{
    "news": [
        {
            "title": "DRC crisis: Sadc steps up peace bid",
            "url": "https://www.herald.co.zw/drc-crisis-sadc-steps-up-peace-bid/",
            "content": "Rumbidzayi Zinyuke-Senior Reporter\n\nSADC Chairperson, President Mnangagwa will convene an Extraordinary Summit of Heads of State and Government to discuss the escalating security situation in the eastern Democratic Republic of Congo and deliberate on recommendations from the virtual Extraordinary Organ Troika Summit held on Thursday.\n\nIn a communiqu, the SADC Secretariat said the date of the summit, likely to be held in Harare, will be announced soon.\n\nThe outcomes and recommendations from the Extraordinary Organ Troika Summit will be presented to the Extraordinary Summit of SADC Heads of State and Government to be convened soon, on a date to be confirmed, SADC said.\n\nThe virtual Troika Summit, chaired by Tanzanian President Dr Samia Suluhu Hassan, in her capacity as chairperson of the SADC Organ on Politics, Defence, and Security Cooperation, focused on strategies to restore peace in the DRC.\n\nIt also reviewed the report of the defence sub-committee on the mandate of the SADC Mission in the DRC (SAMIDRC).\n\nThe meeting was attended by incoming chairperson of the SADC Organ on Politics, Defence, and Security Cooperation Malawian President Lazarus Chakwera, along with Zambian President Hakainde Hichilema, South African President Cyril Ramaphosa, and DRC President Flix Tshisekedi.\n\nIn her opening remarks, Dr Suluhu Hassan reaffirmed SADCs unwavering commitment to supporting the DRC in its pursuit of peace.\n\nShe emphasised the importance of regional solidarity in addressing the ongoing conflict.\n\nThe summit expressed its deepest condolences to the Democratic Republic of Congo, the Republics of South Africa and Malawi, and the United Republic of Tanzania for the deceased soldiers who lost their lives during therecent attacks in the Eastern DRC, and while serving under the SAMIDRC, and wished those injured a speedy recovery, the SADC Secretariat said in a statement.\n\nThe SAMIDRC force, deployed in December 2023 to stabilise the conflict-ridden region, has faced growing challenges, including mounting pressure from the M23 rebel advance and increasing troop casualties.\n\nThe summit reaffirmed SADCs commitment to supporting interventions aimed at achieving lasting peace and security in the eastern DRC, in line with the SADC Mutual Defence Pact of 2003, which governs regional security operations.\n\nDespite efforts by SADC and the East African Community (EAC), fighting between Congolese security forces and the M23-led rebel group, has intensified in recent weeks.\n\nThe rebels, who had previously entrenched themselves in Goma in North Kivu, have now expanded their presence to the South Kivu capital Bukavu, establishing new administrative structures in the city.\n\nThe conflict has fuelled one of the worlds most severe humanitarian crises, with over 1 million Congolese seeking refuge beyond the countrys borders and about 21 million people within the country in urgent need of medical aid, food, and other essential supplies.\n\nSince the start of last year, nearly 358 000 people have been displaced, with 80 percent of this displacement linked to armed conflict. New UN-verified data also reveals a 30 percent rise in grave violations against children in eastern DRC compared to 2023.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/President-Mnangagwa-1-680x380.jpg",
            "description": "Rumbidzayi Zinyuke-Senior Reporter SADC Chairperson, President Mnangagwa will convene an Extraordinary Summit of Heads of State and Government to discuss the escalating security situation in the eastern Democratic Republic of Congo and deliberate on recommendations from the virtual Extraordinary Organ Troika Summit held on Thursday. In a communiqué, the SADC Secretariat said the date of […]",
            "time": "06:27",
            "date": "08 Mar 2025"
        },
        {
            "title": "Zim keen to pursue BRICS membership",
            "url": "https://www.herald.co.zw/zim-keen-to-pursue-brics-membership/",
            "content": "Mukudzei Chingwere-Herald Reporter\n\nZIMBABWE is keen to strengthen ties with Russia and pursue membership in the BRICS group of emerging economies and its associated international development bank, Foreign Affairs and International Trade Minister Professor Amon Murwira, has said.\n\nSpeaking at a meeting with Russian Foreign Minister Sergei Lavrov in Moscow, Russia, on Thursday, Prof Murwira said joining the BRICS economic grouping was not just about political alignment, but enhancing economic growth and development.\n\nBRICS is an economic bloc founded by Brazil, Russia, India, China and South Africa, who sought to provide an alternative economic order against the status quo which is skewed in favour of the United States and its political allies, to the detriment of the rest of the world.\n\nIn August 2023, President Mnangagwa participated at the BRICS 15th Heads of State and Government Summit in Johannesburg, where he was represented by Vice President Dr Constantino Chiwenga, as Zimbabwe formally presented its credentials to join leading economies in the emerging global order for the development of its economy.\n\nAfter the meeting with his Russian counterpart, Prof Murwira spoke about the significance of Zimbabwes potential inclusion in BRICS and the BRICS Bank.\n\nYesterday (Thursday), we discussed about joining economic groupings and one of the economic groupings is BRICS, which is basically made up of the Russian Federation, India, China, Brazil, South Africa, plus other countries that have recently joined, he said.\n\nWe believe that for Zimbabwe to grow, it needs to be in a grouping of countries that trade together, because trade grows economies.\n\nWe are actually taking steps to join BRICS under the direction of President Mnangagwa. So we are on the way to do that and we are doing that in order to grow our economy.\n\nProf Murwira said Zimbabwes Constitution demanded that the country should not only be Pan-African, but must join progressive groups that are good for the socio-economic growth of the nation while promoting peace in the world.\n\nPeace is fostered through economic development and BRICS is one of those groupings which Zimbabwe wishes to be part of.\n\nSo, what we have done with the Russian Federation and many other countries is to coalesce around the idea of growing capabilities, and this comes through education, innovation, science, and technology, he said.\n\nProf Murwira outlined the Governments commitment to economic diplomacy, which seeks to secure trade partnerships and foster local production.\n\nHe elaborated on initiatives such as partnerships in education and technology with Russia.\n\nZimbabwe has applied to join BRICS and the BRICS Bank at a time President Mnangagwa has championed rapid economic growth anchored on infrastructure development and a strong private sector participation.\n\nAll these developments have been achieved using locally mobilised resources as Zimbabwe continues to grapple with the effects of illegal financial sanctions imposed by the US and its Western allies at the turn of the century.\n\nJoining the BRICS Bank head-quarted in Shanghai in China will thus give Zimbabwe the much-needed fillip in its economic development plans as the bank was primarily established by BRICS for the purpose of mobilising resources for infrastructure and sustainable development in emerging markets and developing countries.\n\nPresident Mnangagwa is on record as saying that after applying to join the BRICS Bank, the next stage would be to seek to go beyond the bank and join the grouping.\n\nIt will be an opportune leap for Zimbabwes economic development quest as the groupings global influence continues to grow, with over 40 countries having applied to join the group that already accounts for at least 25 percent of the global economy.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Minister-Murwira-and-Minister-Lavrov2-680x380.jpg",
            "description": "Mukudzei Chingwere-Herald Reporter ZIMBABWE is keen to strengthen ties with Russia and pursue membership in the BRICS group of emerging economies and its associated international development bank, Foreign Affairs and International Trade Minister Professor Amon Murwira, has said. Speaking at a meeting with Russian Foreign Minister Sergei Lavrov in Moscow, Russia, on Thursday, Prof Murwira […]",
            "time": "06:27",
            "date": "08 Mar 2025"
        },
        {
            "title": "Nation celebrates key milestones  in women empowerment",
            "url": "https://www.herald.co.zw/nation-celebrates-key-milestones-in-women-empowerment/",
            "content": "Tendai Gukutikwa-Mutare Bureau\n\nZimbabwe has made numerous notable achievements in empowering rural women to address the challenges they face, Women Affairs, Community, Small and Medium Enterprises Development Minister Senator Monica Mutsvangwa, has said.\n\nShe reaffirmed the unwavering commitment while officially launching the International Womens Day (IWD) 2025 celebrations at Munyarari Primary School in Mutare yesterday.\n\nIWD is commemorated on March 8 annually and this year, it is running under the theme, All Women and Girls: Rights. Equality. Empowerment.\n\nSen Mutsvangwa said the Government remained committed to empowering women through various initiatives, leaving no one and no place behind.\n\nGovernment recognises that women and girls continue to face significant barriers to achieving their full potential, she said.\n\nFrom discriminatory laws and policies to societal norms and stereotypes, women and girls are often marginalised, excluded, and silenced.\n\nHowever, we also acknowledge the incredible progress that has been made towards achieving gender equality, and we celebrate the courage, resilience and determination of women and girls who are driving this change.\n\nSen Mutsvangwa said Zimbabwe had made significant strides in promoting womens rights and empowerment.\n\nOur Constitution guarantees equal rights for women and men and we have implemented various policies and programmes aimed at promoting gender equality.\n\nHowever, despite these efforts,women and girls in Zimbabwe continue to face significant challenges, including limited access to education, healthcare and economic opportunities, she said.\n\nSen Mutsvangwa said Government recognises that empowering women is not just a moral obligation but a strategic necessity to combat poverty, illiteracy, hunger and malnutrition.\n\nGovernment has made significant strides in ensuring rural women are equipped to conquer adversity.\n\nThrough my ministry, Government is relentlessly providing awareness and training to women on climate change mitigation and adaptation, which is pivotal in fortifying resilience.\n\nWe are tirelessly collaborating with development partners to amplify womens access to renewable energy sources, liberating them from hazardous traditional cooking methods that endanger family health, she said.\n\nThe Minister passionately highlighted how solar-powered boreholes and irrigation schemes have revolutionised livelihoods, while menstrual health training and reusable sanitary wear production have uplifted over 2 000 rural women and girls this year alone.\n\nWe will not rest until every community can reliably supply the much-needed sanitary wear, ensuring no girl is left behind, she declared.\n\nMinister Mutsvangwa expounded on financial empowerment, detailing how microfinance facilities established in collaboration with development partners and financial institutions are transforming lives.\n\nThrough the Zimbabwe Women Development Fund, Community Development Fund, Womens Micro Finance Bank, and SMEDCO funding facilities, we provide affordable loans to women, enabling them to become formidable entrepreneurs who drive economic growth, she proclaimed.\n\nUnited Nations Resident Coordinator, Mr Edward Kallon, praised the nations monumental progress, urging unwavering dedication to the cause.\n\nInternational Womens Day is a clarion call to uphold the dignity and rights of women and girls worldwide.\n\nThe UN stands shoulder to shoulder with Zimbabwe, committed to reversing the regression in womens rights and forging a path to true gender equality, he said.\n\nSwedish Ambassador to Zimbabwe, Per Lindgrde, who was representing European Union nations, lauded Zimbabwes relentless pursuit of gender equality, acknowledging the nations progress while emphasising the need for sustained momentum.\n\nToday is not just a celebration, it is a call to action. Zimbabwes Constitution enshrines gender equality, the Education Act ensures pregnant girls remain in school and the Marriage Act protects vulnerable girls.\n\nYet, the scourge of gender-based violence persists, with one in three women affected. We must unite to obliterate this injustice, he affirmed, reinforcing the EUs resolute support through the Team Europe initiative.\n\nAmbassador Lindgrde said the EU has funded many initiatives in Zimbabwe that have significantly contributed to improving the lives of women and girls.\n\nThese initiatives have supported projects aimed at enhancing access to quality education, promoting womens economic empowerment through small and medium enterprises, and strengthening healthcare services in rural areas, he said.\n\nHe also stressed that the EU remains committed to working with the Government of Zimbabwe to create sustainable opportunities for women, protect their rights, and eliminate gender-based violence.\n\nThrough the Team Europe initiative, the EU has consistently championed gender equality, funding programs that equip women with essential skills, provide start-up capital for income-generating activities, and ensure that vulnerable communities receive the necessary support to thrive, he said.\n\nMinister of State for Manicaland Provincial Affairs and Devolution, Advocate Misheck Mugadza, extolled the indomitable spirit and achievements of women in the province.\n\nWomen constitute approximately 1 035 000 of Manicalands population, and their resilience is unparalleled. Our province has produced trailblazing leaders like Minister Oppah Muchinguri and Minister Monica Mutsvangwa.\n\nManicaland stands as an unyielding pillar of womens empowerment, with girls schools shattering records and achieving historic milestones, he said with pride.\n\nAdv Mugadza applauded transformative local projects spearheaded by President Mnangagwa, including the Chikanga Mushroom Project in Mutare, Jopa Market in Chimanimani, and Cynara Dairy in Mutasa.\n\nThese visionary initiatives have equipped women to ascend as innovators and captains of industry, catalysing community transformation, he added.\n\nInternational Womens Day has been observed since the early 1900s  a time of great expansion and turbulence in the industrialised world that saw booming population growth and the rise of radical ideologies.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Minister-Mutsvangwa-680x380.jpg",
            "description": "Tendai Gukutikwa-Mutare Bureau Zimbabwe has made numerous notable achievements in empowering rural women to address the challenges they face, Women Affairs, Community, Small and Medium Enterprises Development Minister Senator Monica Mutsvangwa, has said. She reaffirmed the unwavering commitment while officially launching the International Women’s Day (IWD) 2025 celebrations at Munyarari Primary School in Mutare yesterday. […]",
            "time": "06:27",
            "date": "08 Mar 2025"
        },
        {
            "title": "Africa’s future key to global progress, says China",
            "url": "https://www.herald.co.zw/africas-future-key-to-global-progress-says-china/",
            "content": "Nqobile Bhebhe-Bulawayo Bureau\n\nGLOBAL modernisation cannot proceed without the full participation of Africa, as the continents stability and development are fundamental to the future of humanity, Chinese Foreign Minister Wang Yi said yesterday as he urged the world to actively listen to Africa and respond to its concerns.\n\nUnder the guidance of President Xi Jinping and African leaders, the China-Africa relationship has reached its zenith.\n\nWithin the past three years alone, Chinese enterprises have generated over 1,1 million new jobs across Africa, Minister Wang revealed.\n\nMinister Wang, also a member of the Political Bureau of the CPC Central Committee, stated that China has forged strategic partnerships with every African nation with which it maintains diplomatic ties.\n\nMinister Wang made the remarks during a meeting with Chinese and international journalists on Chinas foreign policy and external relations, held yesterday during the third session of the 14th National Peoples Congress.\n\nHe reiterated that China and Africa have always been steadfast friends, reliable partners, and close brothers, sharing a common destiny.\n\nUnder the guidance of President Xi Jinping and African leaders, China-Africa relationship is now at its best in history. China has established strategic partnership with all African countries having diplomatic ties with it. The China-Africa community with a shared future has been elevated to an all-weather level.\n\nThis year marks the 25th anniversary of FOCAC. Over the past 25 years, China has helped Africa build or upgrade nearly 100 000 kilometres of roads and more than 10 000 kilometres of railways. In the past three years alone, Chinese enterprises created more than 1,1 million new jobs in Africa. China has remained Africas largest trade partner for 16 consecutive years. To African brothers and sisters, China-Africa cooperation is visible, tangible and truly beneficial, he said.\n\nMinister Wang further noted that Africa represents a fertile ground of hope for the 21st century.\n\nThere will be no global modernisation without African modernisation. The stability and development of Africa is vital to the future of humanity, and the world must listen to Africa and heed its concerns. Africa is going through a new awakening, and countries should support Africa in exploring a new development path of self-reliance and self-strengthening, he said.\n\nThe relationship between China and Zimbabwe has deep historical roots, dating back to the liberation struggle of the 1960s, during which Beijing provided crucial military support. This partnership deepened in the early 2000s when Western sanctions were imposed on Zimbabwe, leading China to remain a steadfast ally and a significant trade partner.\n\nUnder President Mnangagwas leadership, trade between Zimbabwe and China has experienced substantial growth, driven by engagement and re-engagement initiatives. China has invested billions in Zimbabwe, particularly in the mining and manufacturing sectors. Notable projects include the US$3,6 billion Palm River Energy Metallurgical Special Economic Zone in Beitbridge, developed in collaboration with a Chinese mining company, and the US$1, 5 billion Dinson Iron and Steel Company project in Manhize.\n\nOther key investments encompass the Afrochine ferrochrome smelters and lithium mining projects through Sinomine Resources, Zhejiang Huayou Cobalt, and Chengxin Lithium Group.\n\nChina has also supported significant infrastructure projects in Zimbabwe, such as the Hwange Thermal Power Station Units 7 and 8 (US$997 million), Kariba South Hydro Power Station (US$533 million), the Robert Gabriel Mugabe International Airport expansion (US$152 million), and the Victoria Falls Airport upgrade (US$150 million).\n\nIn addition to infrastructure, China has contributed to national development projects, including funding the new Parliament building in Mt Hampden through a US$140 million grant.\n\nThe two nations have also collaborated in health and agriculture, with China providing substantial support during the Covid-19 pandemic and assisting Zimbabwes modernisation efforts through initiatives such as borehole drilling. These robust bilateral ties have solidified Chinas position as Zimbabwes all-weather friend, delivering tangible benefits across numerous sectors and aligning with Zimbabwes Vision 2030 modernisation and industrialisation goals.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Chinese-Foreign-Minister-Wang-Yi-680x380.jpg",
            "description": "Nqobile Bhebhe-Bulawayo Bureau GLOBAL modernisation cannot proceed without the full participation of Africa, as the continent’s stability and development are fundamental to the future of humanity, Chinese Foreign Minister Wang Yi said yesterday as he urged the world to actively listen to Africa and respond to its concerns. Under the guidance of President Xi Jinping […]",
            "time": "06:27",
            "date": "08 Mar 2025"
        },
        {
            "title": "British Council boosts economic growth initiatives",
            "url": "https://www.herald.co.zw/british-council-boosts-economic-growth-initiatives/",
            "content": "Spiwe Sarakunze-Herald Reporter\n\nTHE British Council has, in collaboration with Switzerland, launched the Creative Economy Week for fostering innovation and entrepreneurship within the music and fashion industries, enhancing skills, and driving economic growth while showcasing UK expertise and global partnerships.\n\nSpeaking at the launch in Harare yesterday, British Council regional arts director Ms Farai Ncube said they wanted to showcase some of the arts through fashion andmusic.\n\nThe theme for the week, which has been running from Wednesday ending today, is Growth reimagined.\n\nMs Ncube emphasised the importance of reimagining growth from individual contexts and innovations, tapping into cultural heritage, and resonating with the private sector and Government.\n\nThe British Council operates in over 200 countries and territories, reaching 600 million people in 20222023.\n\nMs Ncube noted that the initiative aimed to unlock the potential of the creative economy in Zimbabwe, advocating job creation and supporting social cohesion.\n\nThe partnership with Switzerland involves an investment of 2 million into the economy to scale up several programmes.\n\nCreative Economy Week is part of the British Councils broader Creative Economy programme to strengthen creative and cultural industries across Africa.\n\nThe event gathers creatives, artists, entrepreneurs, industry leaders, policymakers, and cultural enthusiasts to explore opportunities for innovation, skill development, market access, and economic growth within the creative sector.\n\nLast years event saw significant engagement, and this years event aims to support diverse, equitable, and inclusive creative ecosystems, particularly benefiting young creatives, especially women and marginalised communities.\n\nThe Swiss Embassy is actively involved, fostering diplomatic relations and promoting Swiss interests across political, economic, scientific, educational, and cultural sectors. The embassy supports bilateral cooperation and cultural exchanges to enhance mutual understanding.\n\nIn an interview, creative director and founder of Rock Studio London Ms Ellen Rock said they will do their first event at the Creative Economy Week, running an accelerator for several years.\n\nThis years design think-tanks allow the local community to experiment with new skills, with participation from designers across several African countries.\n\nManaging director of K Media Africa Mr Keith Kowudzai spoke about their partnership in the Creative Economy programme, specifically the Music Connects Africa initiative.\n\nBasically, the creative economy programme is an initiative that they have started where they want to capacitate creatives in Zimbabwe with a particular focus in music.\n\nWe are going to have a grand showcase event on Saturday evening where we are showcasing some of the emerging music artists and fashion creatives being supported by the creative economy, he said.\n\nDesign artist Ms Nyasha Johnson expressed her gratitude for the opportunity. I am very grateful for the opportunity that they have given us. I am learning a lot about storytelling when you have a brand as a designer to cooperate with people.\n\nDr Balogun Tomiar, a designer from Nigeria, added that sourcing raw materials from Zimbabwe had been beneficial.\n\nIt is a good thing to be part of the creative economy programme, and I learned a lot from storytelling, said Dr Tomiar.\n\nThe Creative Economy Week is poised to create numerous business opportunities for youth in music and fashion design.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/British-Council-regional-arts-director-Ms-Farai-Ncube-680x380.jpg",
            "description": "Spiwe Sarakunze-Herald Reporter THE British Council has, in collaboration with Switzerland, launched the Creative Economy Week for fostering innovation and entrepreneurship within the music and fashion industries, enhancing skills, and driving economic growth while showcasing UK expertise and global partnerships. Speaking at the launch in Harare yesterday, British Council regional arts director Ms Farai Ncube […]",
            "time": "06:27",
            "date": "08 Mar 2025"
        },
        {
            "title": "7 years on, Zim still heeds President’s call to clean up",
            "url": "https://www.herald.co.zw/7-years-on-zim-still-heeds-presidents-call-to-clean-up/",
            "content": "Trust Freddy-Herald Correspondent\n\nSEVEN years after President Mnangagwas declaration, the National Environment Clean-up Day initiative, continues to thrive.\n\nYesterday, the Zimbabwe Anti-Corruption Commission (ZACC) joined three other independent commissions in a clean-up campaign.\n\nThe initiative stems from the Presidents declaration made on December 5, 2018, designating the first Friday of every month as National Environment Cleaning Day.\n\nOrganisations that participated included the Zimbabwe Media Commission, Zimbabwe Gender Commission, and the Zimbabwe Human Rights Commission.\n\nZACC chairperson Mr Michael Reza said the clean-up campaign was important.\n\nThis is a follow-up to what His Excellency the President, Dr Emmerson Dambudzo Mnangagwa, said, that the first Friday of every month is Clean Up Day. Moreover, it is often said that cleanliness is next to godliness.\n\nTherefore, it is essential that we maintain cleanliness in our surroundings. We must ensure that our workplaces and public areas are clean and well-maintained.\n\nZimbabwe Media Commission chairperson Professor Ruby Magosvongwe weighed in saying: This is just an extension of the recognition of the call by His Excellency the President. I hope that, coming from where we are, each one of us has already cleaned up their offices, their work environment, and is also abstaining from contaminating the beauty within them, because what is happening outside may not necessarily be reflective of whats going on inside.\n\nThe clean up began at a fuel station on Sam Nujoma Street, with the team moving to Herbert Chitepo Avenue, where they thoroughly cleaned the area surrounding Harare Gardens and the ZACC offices.\n\nPresident Mnangagwa launched the national clean-up programme in December 2018, encouraging all citizens to clean their environment between 8am and 10am on the first Friday of every month.\n\nEveryone is invited to participate in cleaning their communities on this day, from individuals to businesses and organisations.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/ZACC-Clean-up-campaign-680x380.jpg",
            "description": "Trust Freddy-Herald Correspondent SEVEN years after President Mnangagwa’s declaration, the National Environment Clean-up Day initiative, continues to thrive. Yesterday, the Zimbabwe Anti-Corruption Commission (ZACC) joined three other independent commissions in a clean-up campaign. The initiative stems from the President’s declaration made on December 5, 2018, designating the first Friday of every month as National Environment […]",
            "time": "06:27",
            "date": "08 Mar 2025"
        },
        {
            "title": "All set for 2 council by-elections",
            "url": "https://www.herald.co.zw/all-set-for-2-council-by-elections/",
            "content": "Remember Deketeke-Herald Reporter\n\nALL is set for todays council by-elections in Norton and Chegutu, Zimbabwe Electoral Commission (ZEC) Deputy Chairperson Ambassador Rodney Kiwa said yesterday.\n\nSpeaking in Harare, Ambassador Kiwa urged voters to participate peacefully, assuring that no challenges were expected during the elections for Ward 3 of Chegutu Rural District Council and Ward 3 of Norton Town Council.\n\nThe vacancy in Chegutu occurred on January 2 when the incumbent councillor passed away, while the vacancy in Norton arose on December 13, 2024.\n\nA total of 2 850 ballot papers have been printed for Ward 3 of Chegutu Rural District Council, along with 2 550 for Ward 3 of Norton.\n\nThese figures include contingencies of 6,74 percent for Chegutu and 7,45 percent for Norton.\n\nIn Norton Town Council Ward 3, independent candidates Walter Munyeveri and Tanatswa Paradzayi, along with ZANU PFs Cde Tsomondo Charamba, will contest the position. Nominations were held on February 6, this year.\n\nIn Chegutu Rural District Council Ward 3, ZANU PFs Cde Mahwinei Makofi, along with independent candidates Stabile Murombedzi and Tawanda Sibanda, are in the running. Ambassador Kiwa confirmed that all election officers, including ward elections officers, deputy ward elections officers, presiding officers, and polling officers, have been recruited and trained.\n\nZiG12 million has been budgeted for the two by-elections, he added.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Zimbabwe-Electoral-Commission-ZEC-deputy-chairperson-Ambassador-Rodney-Simukai-Kiwa-680x380.jpg",
            "description": "Remember Deketeke-Herald Reporter ALL is set for today’s council by-elections in Norton and Chegutu, Zimbabwe Electoral Commission (ZEC) Deputy Chairperson Ambassador Rodney Kiwa said yesterday. Speaking in Harare, Ambassador Kiwa urged voters to participate peacefully, assuring that no challenges were expected during the elections for Ward 3 of Chegutu Rural District Council and Ward 3 […]",
            "time": "06:27",
            "date": "08 Mar 2025"
        },
        {
            "title": "Detective shot dead  in line of duty",
            "url": "https://www.herald.co.zw/detective-shot-dead-in-line-of-duty/",
            "content": "Nqobile Tshili-Bulawayo Bureau\n\nBULAWAYOS Pumula suburb became a scene of a heart-breaking tragedy on Thursday night when a female detective from the Criminal Investigation Department was shot dead in the line of duty.\n\nHer life, dedicated to protecting the city, was extinguished as she and her colleagues pursued suspected armed robbers.\n\nDetective Constable Cassandra Hove (37), a dedicated officer who had committed her life to protecting citizens from criminals, was killed in the line of duty in Pumula South, Habek area, after sustaining gunshot wounds to her upper limbs. She was part of a team of detectives engaged in a raid against armed robbers suspected of targeting service stations throughout the city.\n\nThe incident occurred at approximately 8:40pm, with her team rushing her to a nearby private clinic where she was pronounced dead on arrival.\n\nNational police spokesperson Commissioner Paul Nyathi confirmed that investigations into Detective Constable Hoves death are ongoing.\n\nThe Zimbabwe Republic Police confirms that investigations are being conducted in connection with the tragic and unfortunate death of Detective Constable Cassandra Hove of CID Homicide Bulawayo on 6th March 2025 while pursuing armed robbery suspects. The shooting incident occurred at Habek area, Pumula South, Bulawayo, said Commissioner Nyathi.\n\nHe said that Commissioner-General of Police Stephen Mutamba is mourning Detective Constable Hove, while assuring that a comprehensive investigation is underway to establish the precise circumstances of the incident.\n\nHe stressed that law enforcement is declaring war against violent crimes, while appealing to members of the public to come forward with information that could lead to the arrest of the suspects.\n\nThe ZRP reiterates that there is no going back in the fight against armed robberies and other violent crimes in the country. The public should feel free to give information on criminal movements on Complaints Desk number 0242703631 or WhatsApp number 0712800197, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Cassandra-Hove-680x380.jpg",
            "description": "Nqobile Tshili-Bulawayo Bureau BULAWAYO’S Pumula suburb became a scene of a heart-breaking tragedy on Thursday night when a female detective from the Criminal Investigation Department was shot dead in the line of duty. Her life, dedicated to protecting the city, was extinguished as she and her colleagues pursued suspected armed robbers. Detective Constable Cassandra Hove […]",
            "time": "06:27",
            "date": "08 Mar 2025"
        },
        {
            "title": "ZANU PF gears for Glen View South primary elections",
            "url": "https://www.herald.co.zw/zanu-pf-gears-for-glen-view-south-primary-elections/",
            "content": "Joseph Madzimure-Senior Reporter\n\nZANU PF has officially introduced its candidates for primary elections taking place tomorrow, ahead of by-elections slated for April 12 in Glen View South constituency.\n\nThe seat fell vacant following the death of sitting MP, Gladmore Hakata, who was from the opposition CCC.\n\nThose seeking nomination on a Zanu PF ticket includeCdes Tsitsi Taomera, Jabulani Mbetu, Bani Muchakachi and Tawanda Utete.\n\nThese aspirants have been vetted and approved by the party as they prepare to engage in a competitive selection process to represent ZANU PF in the upcoming by-elections.\n\nAt an event to introduce the quartet yesterday, Politburo member Cde Paul Mangwana underscored the importance of a peaceful campaign.\n\nWe should not engage in violence but campaign peacefully to win the hearts of the people, he said.\n\nHis call for tranquillity aims to foster a positive environment as candidates prepare for the election.\n\nCde Mangwana further urged the selected individuals to adhere to party guidelines in their conduct.\n\nZANU PF Harare provincial chairman Cde Godwills Masimirembwa reinforced the message of discipline.\n\nHe cautioned that any candidates whose supporters are found misbehaving or engaging in any form of violence, will be disqualified.\n\nThe remarks by Cde Masimirembwa reflect the partys commitment to a democratic selection process.\n\nCde Struggle Dzapasi, the acting Harare provincial Political Commissar, provided details about the voting process.\n\nHe announced the identified polling stations where party members will cast their votes for their preferred candidates.\n\nVoting takes place from 7am to 4pm tomorrow at several locations, including: Glen View 1 New Hall, Glenview 1 Primary, Sophi Hall, Glen View, Community Hall, and Glenview 2 Primary.\n\nParty members will cast their votes according to their branches and party districts, said Cde Dzapasi, emphasising the organised structure of the voting process.\n\nIn light of new party regulations, Cde Ophard Muchuwe, the shadow MP for Glen View South, is no longer eligible to contest.\n\nThe regulations stipulate that candidates who fail to secure victories for two consecutive terms cannot seek re-election. Cde Patrick Chinamasa, the Secretary for Legal Affairs, clarified the rationale behind this rule.\n\nThis is not an accusation but a housekeeping issue meant to give fresh blood an opportunity to contest in that particular constituency, he said.\n\nCde Chinamasa further explained that while candidates may seek opportunities in other constituencies, they must give way to newcomers in the constituency they previouslycontested.\n\nIt has nothing to do with whether you are good or a bad person, he added, highlighting the partys focus on fostering new leadership.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Cde-Mangwana-680x380.jpg",
            "description": "Joseph Madzimure-Senior Reporter ZANU PF has officially introduced its candidates for primary elections taking place tomorrow, ahead of by-elections slated for April 12 in Glen View South constituency. The seat fell vacant following the death of sitting MP, Gladmore Hakata, who was from the opposition CCC. Those seeking nomination on a Zanu PF ticket include  […]",
            "time": "06:27",
            "date": "08 Mar 2025"
        },
        {
            "title": "Editorial Comment: Warriors, Nees need all the support for World Cup bid",
            "url": "https://www.herald.co.zw/editorial-comment-warriors-nees-need-all-the-support-for-world-cup-bid/",
            "content": "SO, the Zimbabwe senior soccer side, the Warriors, will get back into business for the first time this year when they resume their FIFA 2026 World Cup qualification bid.\n\nThey were last in action in November last year when they sealed their place at the 2025 CAF Africa Cup of Nations which is scheduled for Morocco.\n\nIt will be the sixth time that Zimbabwe would be lining up alongside Africas top teams for the jamboree that will run in the North African country in December and into early January.\n\nBut before German coach Michael Nees and his Warriors can shift their attention to trying to become the first class of Warriors to proceed beyond the group stage at the Nations Cup, they have some World Cup qualification bid to dispense with.\n\nZimbabwe are bottom of Group C in the race for the expanded 48-team World Cup scheduled to be co-hosted by Canada, Mexico and the United States.\n\nSo, in 12 days time, Nees will take charge of his first Warriors World Cup assignment as the German coach was not in charge when Zimbabwe got off to a horrible start, managing just two points from their opening four games and under two different coaches\n\nIt will also be the first time that Nees will be playing under the Zimbabwe Football Associations first elected executive committee as the German was brought on board by the Normalisation Committee, which was in charge of the association for over a year.\n\nWhile Normalisation Committee chairman Lincoln Mutasa and his colleagues  Rosemary Mugadza and Nyasha Sanyamandwe  may have set off into the sun after completing their mandate, the script has remained the same for the Warriors, which is to try and qualify for the World Cup and do better than previous appearances at AFCON.\n\nNow, ZIFA are under the guidance of Nqobile Magwizi and his 10 colleagues.\n\nRefreshingly, Magwizi and his team have come up with an approach to ensure that all national teams, whether it is the womens juniors, or the CAF schools, are given equal attention and resources to achieve their goals.\n\nWhile we commend the ZIFA approach, which immediately came to life during the Mighty Warriors Women Africa Cup of Nations, whom they afforded all the resources they needed for the qualifier against Angola, we believe that the association alone should not be left to fend for the national teams.\n\nIn Nees, we have found a professional whose approach and work ethic has reportedly charmed players, fellow coaches, the ZIFA secretariat and executive committee.\n\nAs we reported in this publication, the quest to qualify for the World Cup is not and should not be just left on the door steps of the ZIFA headquarters on Number 66 Bishop Gaul Avenue in Harares Milton Park suburb.\n\nInstead, it should be a challenge to the whole nation to rally behind this team which is so long on potential.\n\nFor any team to succeed, a lot is put into the organisation in the build-up to an assignment.\n\nOf course the lack of an approved home stadium remains a worry for the Warriors who, like any football or sporting team, thrive on having a full house backing them.\n\nBut ZIFA have made plans to stage the World Cup assignment against Benin at Moses Mabhida Stadium in Durban on March 20 before the Warriors travel to Uyo in Nigeria to face the Super Eagles.\n\nThe coach has been hard at work assessing all the players before deciding which manpower he can assemble for the upcoming games.\n\nMore importantly is the need for corporates, the Government and individual well-wishers to chip in and help make the organisation of the Warriors assignments a success.\n\nWhile they might be anchoring their long table with two points and five shy of joint leaders Rwanda, South Africa and Benin, all hope is not yet lost as there is still plenty to play for the Warriors.\n\nThey still have more matches against South Africa, Lesotho and the two assignments against Benin at home and away.\n\nNees believes that staying focussed and being adequately prepared and with the right organisation, Zimbabwe can turn things around.\n\nNow the ball is in the court of this nation to ensure the German expatriate is helped to make his job of motivating the Warriors, organising them tactically and inspiring them, an achievable task.\n\nTwo good results against Benin and Nigeria could turn the tide in Zimbabwes favour and the Warriors need to be in the best frame of mind when they tackle the assignments.\n\nThe players travel from their respective bases to around the continent for assignments has to be made smooth and less tiresome in order for them to give coach Nees the best return on the pitch.\n\nAs such, we strongly believe that corporates and individuals can chip in on such tasks like provision of accommodation and the smooth travel for the qualifiers.\n\nFIFA showed the way when they took full charge of ZIFAs welfare during the reign of the Normalisation Committee.\n\nNow Magwizi and crew cannot afford to drop the ball.\n\nInstead, it is now for all concerned football stakeholders and sponsors to come to the party and guarantee a continuation of the good times that were all enjoyed when the Warriors travelled to Uganda, Huye in Rwanda and South Africa for their assignments under the FIFA-assisted and appointed Normalisation Committee.\n\nThe Warriors need support from the terraces, from the corporate and Government corridors and from the engaged support services and just probably, the whole nation could be smiling and celebrating another triumph at the end of the qualifying campaign.\n\nIt may be a tough task indeed, but it certainly is not insurmountable.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Warriors.jpg",
            "description": "SO, the Zimbabwe senior soccer side, the Warriors, will get back into business for the first time this year when they resume their FIFA 2026 World Cup qualification bid. They were last in action in November last year when they sealed their place at the 2025 CAF Africa Cup of Nations which is scheduled for […]",
            "time": "06:27",
            "date": "08 Mar 2025"
        }
    ]
}