{
    "news": [
        {
            "title": "‘Let’s entrench culture of dialogue’ . . . President hosts belated New Year’s reception for diplomats",
            "url": "https://www.herald.co.zw/lets-entrench-culture-of-dialogue-president-hosts-belated-new-years-reception-for-diplomats/",
            "content": "Wallace Ruzvidzo-Herald Reporter\n\nTackling a myriad of pressing global challenges and resolving conflicts amicably needs fostering a culture of constructive dialogue on the international stage, President Mnangagwa has said.\n\nIn his remarks at a belated New Year reception with heads of diplomatic missions and international organisations accredited to Zimbabwe at State House yesterday, the President said on its part, Zimbabwe stood open for progressive dialogue with all nations.\n\nZimbabwe, he said, continued to position itself as a friend to all and enemy to none, guided by theforeign policy of engagement and re-engagement.\n\nMy Governments foreign policy thrust of engagement and re-engagement has seen responsive policies which harness opportunities and manage divergence. Undoubtedly, the ongoing engagements have opened new frontiers of cooperation and partnerships. I commend you all for your role in advancing this focus area.\n\nTogether, let us do more as we entrench a culture of dialogue in our international relations cooperation frameworks, he said.\n\nPresident Mnangagwa\n\nStill on the issue of dialogue, President Mnangagwa added: Zimbabwe remains open for dialogue aimed at the total removal of illegal sanctions.\n\nThe illegal economic sanctions, coupled with the prevalence of climate change-induced natural disasters and weather phenomenon, are negatively impacting our economy. However, domestic resource mobilisation, Diaspora remittances and inflows of foreign direct investments are augmenting the national fiscus.\n\nOur people and the economy are demonstrating extraordinary resilience, unity of purpose, innovation and resourcefulness, he said.\n\nThe President thanked SADC and other partners for their continued support in calling for the illegal embargoes unequivocal removal.\n\nI extend gratitude to our SADC family and African brothers and sisters for their principled support and solidarity as they amplify calls for the lifting of sanctions.\n\nWe also recognise the support we are receiving from the Group of Friends in Defence of the United Nations Charter, the Like-Minded Group and Non-Aligned Movement, said President Mnangagwa.\n\nHe reaffirmed Governments commitment to fostering inclusive growth, consolidating democracy and constitutionalism, while ensuring peace and stability for the overall economic prosperity of the general citizenry.\n\nThrough our multifaceted and people-centred development strategies, we are lifting more of our people out of poverty into prosperity. We look forward to journey this exciting path with you and the countries as well as organisations you represent.\n\nTogether, let us navigate the complex challenges affecting our world and the immense opportunities presented before us, he said.\n\nYesterdays gathering of ambassadors and international organisations facilitated closer interaction between the heads of missions and the Government.\n\nAs such, the President rallied them to submit objective and factual reports about Zimbabwe to their countries.\n\nMay you find the satisfaction and pride in taking our relations to a new level. Our doors remain open and arms outstretched as we dialogue and work in harmony towards a shared prosperity and brighter future for our peoples, said President Mnangagwa.\n\nZimbabwe, he said, maintained its stance as a friend to all and enemy to none, emphasising that the country was very much open for business.\n\nWe are open for business, and your nationals are welcome to pursue investments in our mining sector. Further, leveraging our strategic central location in the southern region, we are determined to work with our neighbours and investors to expand and modernise the North-South Corridor to enhance global supply chains and logistics, said the President.\n\nAt the broader international level, President Mnangagwa said Zimbabwe was committed to the protection of multilateralism and upholding the principles of the United Nations Charter, while rallying for support in its bid for a non-permanent United Nations Security Council seat.\n\nThe principles of equality and respect for each others interests should always guide us in our interactions. There are no big or small nations. Zimbabwes candidature for a non-permanent seat on the United Nations Security Council for the term 2027 to 2028, has been endorsed by SADC and the African Union.\n\nOur candidacy is deeply rooted in our commitment to global peace and security, an inclusive, fair and equitable international rule-based system, said the President.\n\nHe said the Second Republic was undertaking reforms across the board to ensure the countrys attainment of upper-middle-class economic status by 2030.\n\nThis has resulted in various political, economic and legislative reforms as well as the implementation of a broad array of people-centred projects to guarantee household food security, improve incomes and develop critical enablers to propel the modernisation and industrialisation of our economy.\n\nThe projected recovery in agriculture output is expected to drive economic growth to 6 percent, buoyed by the expected bumper harvest, following a successful summer season, said the President.\n\nHe appraised the diplomats on some of the initiatives being rolled out by Government towards the realisation of national goals.\n\nGovernment introduced the concept of village business units and nutritional gardens. Under the Presidential Drilling Programme, we are drilling boreholes in all our 35 000 villages.\n\nWe, thus, invite your missions to partner these initiatives from the perspective of training and capacity building as well as value addition and sourcing of export markets as we promote market driven productivity.\n\nUnder our agriculture transformation strategy and the village business unit concept, Zimbabwe envisions improved incomes and higher standards of living for our grassroots communities and to also contribute to global food security and nutrition, said the President.\n\nIn mitigating climate change, we are expanding dam construction, water conveyancing and resuscitating irrigation schemes. These initiatives provide scope for further partnerships, cooperation, and investments. The growth of the agriculture sector, as the bedrock of our agriculture-based industry, entails the need for retooling, expansion and diversification of our manufacturing sector. I challenge you, Your Excellencies, in your missions, to promote investments along related value chains.\n\nPresident Mnangagwa acknowledged the role played by the ambassadors in promoting Zimbabwe as a favourable and enjoyable tourist destination.\n\nOur national tourism sector has room for expansion across the provinces of our country I encourage you to scale up the promotion of investments and people to people exchanges between Zimbabwe and your jurisdictions, he said.\n\nAfrica, the SADC region and Zimbabwe, said the President, have re- purposed their development towards the modernisation, value addition, and industrialisation of their economies.\n\nRiding on our abundant natural resources, science, technology and innovation solutions, I exhort your missions to deliberately promote cooperation from your capitals around these aspects, as we create stronger synergies for the Africa we all want.\n\nMeanwhile, my Government looks forward to positive outcomes of engagements with the international community under the arrears clearance and debt resolution process, he said.\n\nOn last years El Nino-induced drought, the President said: The humanitarian aid, technical expertise and moral support received last year, from some of your countries and organisations, following my declaration of the El-Nino induced drought as a national disaster, was timely and greatly appreciated. These acts of kindness remind us of the power of unity in overcoming challenges.\n\nAs the current SADC Chair, President Mnangagwa said Zimbabwe wouldcontinue promoting innovation to unlock opportunities for sustainable economic growth and development towards an industrialised SADC.\n\nOn the peace and security challenges in the region, particularly in the eastern Democratic Republic of Congo, he said Zimbabwe, was playing its part through SADC and East African Community initiatives, to find lasting peace.\n\nWe continue to call for an immediate ceasefire and the cessation of hostilities as well as the pursuit of dialogue, as a panacea for sustainable peace and stability in the region. We once again appeal for the provision of humanitarian assistance to the displaced persons from the international community, he said.\n\nOn his part, the Dean of the diplomatic corps, Rwandan Ambassador James Musoni, said they would continue rallying behind President Mnangagwas leadership.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/President-Mnangagwa-with-Mr-James-Musoni-680x380.jpg",
            "description": "Wallace Ruzvidzo-Herald Reporter Tackling a myriad of pressing global challenges and resolving conflicts amicably needs fostering a culture of constructive dialogue on the international stage, President Mnangagwa has said. In his remarks at a belated New Year reception with heads of diplomatic missions and international organisations accredited to Zimbabwe at State House yesterday, the President […]",
            "time": "08:26",
            "date": "29 Mar 2025"
        },
        {
            "title": "‘Unsanctioned protests reckless, retrogressive’",
            "url": "https://www.herald.co.zw/unsanctioned-protests-reckless-retrogressive/",
            "content": "Herald Reporters\n\nTHE war veterans leadership yesterday delivered a scathing attack of Mondays unsanctioned protests, branding them a reckless and destabilising force that threatens to ignite violence.\n\nThey issued a stern warning to the instigators, demanding unity and resolute action against such disruptive elements, while the Confederation of Zimbabwe Retailers (CZR),bus operators and teachers expressed concern over the potential for economic disruption, citing historical precedent.\n\nZanu PF national secretary for war veterans, Cde Douglas Mahiya, said the proposed protests were retrogressive.\n\nHe made the remarks after launching the Matabeleland South Presidential War Veterans Fund, Borehole Drilling and Housing Scheme.\n\nI would like to unequivocally condemn the violence being instigated by detractors and those who seek to stall our nations development. Let us not entertain such individuals and should they persist with these ruthless tactics, their actions will be met with appropriate responses.\n\nTransporters, retailers, teachers, miners, business owners and citizens also condemned the protests.\n\nOn Thursday, President Mnangagwa urged everyone to carry out their normal daily activities and ignore calls by some chameleon-like characters threatening to cause chaos in the country.\n\nAs of last week, companies and associations had started sending messages to their members and employees, urging them to disregard the protest calls.\n\nWe have totally nothing to do with that, Zimbabwe Teachers Association (Zimta) secretary-general Goodwill Taderera told The Herald yesterday. We are not a political party. We are law-abiding citizens. If we have our issues, we know where to go. We know that we discuss through the National Joint Negotiating Council.And if we have any issues, thats where we direct them.\n\nHe also stated that it would be business as usual for all teachers across the country.\n\nMonday is a working day so our teachers will be at work. We have no instructions to make our teachers not to go to work. They should just report for duty. Its a normal day as far as we are concerned.\n\nThe Confederation of Zimbabwe Retailers (CZR) president Dr Denford Mutashu also condemned the planned protests.\n\nDr Denford Mutashu\n\nThe Confederation of Zimbabwe Retailers expresses deep concern over the planned protests scheduled for 31 March 2025.\n\nWhile we recognise the right to peaceful demonstration as enshrined in our Constitution, we have consistently seen that protests in Zimbabwe often result in unintended consequences, including disruptions to business operations, economic instability, and hardship for ordinary citizens.\n\nDr Mutashu aslo described dialogue as the most effective way of solving differences, warning that demonstrations would result in looting.\n\nCZR believes that dialogue remains the most effective way to address national concerns. Zimbabwes economy thrives on stability, investor confidence, and a supportive business environment, all of which are undermined by unrest. While grievances may exist, we strongly encourage engagement between all stakeholders; Government, business, civil society, and concerned groups to find lasting and inclusive solutions, Dr Mutashu said.\n\nHe said the retail and wholesale sector plays a critical role in Zimbabwes economy, ensuring the availability of essential goods and services while supporting thousands of jobs.\n\nOur priority is to maintain an environment where businesses can operate smoothly, securely, and without disruption. We urge all parties to consider the broader impact of protests especially on businesses that provide livelihoods for many Zimbabweans.\n\nThe CZR calls upon organisers and participants of the planned 31 March 2025 protests to consider peaceful, lawful, and constructive avenues for addressing their concerns. We urge stakeholders to come together for dialogue, ensuring that the interests of all Zimbabweans especially workers, consumers, and businesses are protected and prioritised.\n\nZimbabwe Passengers Transport Organisation chairman Dr Samson Nhanhanga assured the people that there will be enough transport .\n\nFor us bus operators, its a working day. Buses will be available at all pickup points in all cities and towns. Buses will also be available in most ranks to transport long distance passengers.\n\nWe are assuring the people of enough transport to take them to their destinations.\n\nWe, therefore, urge the ZRP to ensure all buses are given free passage as well as adequate security from any violent behaviour so as to facilitate continued free movement of people, said Dr Nhanhanga\n\nThe Zimbabwe Miners Federation has issued a circular urging its members to focus on mining and avoiddistractions.\n\nPlease be advised that Monday 31 March 2025 is a normal working day. Let us all remain focused and committed to the gains of our independence by defending our sovereignty\n\nPlease be advised that Monday, 31 March 2025 is a normal working day. Let us all remain focused and committed to the gains of our independence by defending our sovereignty, reads the circular.\n\nGreater Harare Association of Commuter Operators (GHACO) chairman, Mr Ngoni Katsvairo said: Our wish is for this environment to continue without any harassment to legal operators who are doing their bit to support Government policies of Zimbabwe is open business and leaving no one and no place behind.\n\nKadoma businessman, Cde Jamaya Muduvuri, said he had a meeting with his fellow businessmen and agreed to ignore naysayers.\n\nCde Jimayi Muduvuri\n\nWe have just had a meeting and we have agreed that, as businessmen in Kadoma, we shall never be swayed. It shall be business as usual, he said.\n\nInformal traders also added their voice saying it will be business as usual and would never take part in activities that disturb business.\n\nChairperson of traders operating at Glen View Complex Mr Tawanda Utete said it will be business as usual at one of Harares biggest informal trading hub.\n\nAccording to Mr Utete, there are more than 2 500 informal traders operating at Glen View Area 8 Complex.\n\nAs traders at Glen View 8 Complex, we will never join such protests and it will be business as usual.\n\nThere are many families that depend on proceeds from various businesses that are being undertaken at Glen View 8 Complex and we cannot allow such illegal activities to disturb the livelihoods of people, he said.\n\nYouth economic empowerment group Boys DzaMdhara also weighed in urging the public, especially youths, not to be lured by rogue individuals bent on derailing President Mnangagwas economic vision.\n\nZimbabwe is a peace loving nation, whose focus is currently on nation building and nation building alone.\n\nWe urge the public not to be lured into demonstrating by rogue individuals whose aim is to destabilise our peace, rob us of our time and focus towards nation building and growth of our nation.\n\nThese are the same individuals that never lead from the front.\n\nNational Judicial Council of Vapositori added its voice in denouncing the perceived protests urging various church denominations to report any acts that violates public order.\n\nPlease may you report any activity that contravenes the public order of your communities, said National Judicial Council of Vapostori national director Madzibaba Obey Mapuranga.\n\nAny public misconduct, gang activities, hotspots of organised illegal demonstrations and stocking of prohibited weapons or petrol should be reported to the nearest police station.\n\nOur religious counter measures should be solidified with swift real-time observations, surveillance, protection and detection against the ungodly planned 31 March demonstration, said Madzibaba Obey.\n\nMeanwhile, ZRP has launched an investigation into a series of burning down of vehicles that occurred at business premises in Avondale, Highlands, Newlands and Goromonzi early morning on Friday.\n\nIn a statement, national police spokesperson, Commissioner Paul Nyathi said the incidents took place yesterday between midnight and 4am.\n\nHe said the vehicles were set on fire using petrol while in motion.\n\nThe Zimbabwe Republic Police has received reports of petrol-instigated burning of moving vehicles at business premises in Avondale, Highlands, Newlands and Goromonzi on 28 March between midnight and 4 am.\n\nThis was done by suspects who were driving the vehicles. They quickly jumped onto accompanying vehicles and drove away, said Commissioner Nyathi.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Cde-Douglas-Mahiya-680x380.jpg",
            "description": "Herald Reporters THE war veterans’ leadership yesterday delivered a scathing attack of Monday’s unsanctioned protests, branding them a reckless and destabilising force that threatens to ignite violence. They issued a stern warning to the instigators, demanding unity and resolute action against such “disruptive elements”, while the Confederation of Zimbabwe Retailers (CZR),bus operators and teachers expressed […]",
            "time": "08:26",
            "date": "29 Mar 2025"
        },
        {
            "title": "Incoming ZNA boss gets new rank insignia",
            "url": "https://www.herald.co.zw/incoming-zna-boss-gets-new-rank-insignia/",
            "content": "Columbus Mabika-Herald Correspondent\n\nNewly-promoted Zimbabwe National Army Commander Lieutenant-General Emmanuel Matatu was yesterday conferred with insignia for his new rank at Defence Headquarters following his promotion and appointment by President Mnangagwa on Thursday.\n\nHis promotion from the rank of Major-General and subsequent appointment were with effect from Thursday.\n\nThe President made the promotion in terms of Section 216 (2), as read with Section 89 of the Constitution of Zimbabwe and sections 11 (1) (a) and 11 (4) of the Defence Act.\n\nThe President and Commander-in-Chief of the Zimbabwe Defence Forces may, on the advice of the Minister of Defence, acting on the recommendations of the Commander Zimbabwe Defence Forces, reward any member for distinguished service or gallant conduct on active service by promoting an officer to a higher rank.\n\nCommander ZDF General Philip Valerio Sibanda considered Maj-Gen Matatu suitable for promotion to the next higher rank.\n\nThe President, acting on the advice of Defence Minister Oppah Muchinguri-Kashiri, approved the promotion to the rank of substantive Lieutenant-General.\n\nThe Presidents promotional citation reads In terms of Section 216 (2) as read with Section 89 of the Constitution of Zimbabwe and sections 11(1)(a) and 11(4) of the Defence Act, I appoint you, Major-General Emmanuel Matatu to the rank of Lieutenant-General and Commander of the Zimbabwe National Army. The appointment is with immediate effect.\n\nConferring Lt-Gen Matatu with his new rank badges, Gen Sibanda said promotion came with more responsibilities.\n\nHis promotion and appointment come with a lot of responsibilities. Commanding men is not a walk in the park, you are expected to give your best and ensure that the Zimbabwe National Army we know continues. I am looking forward to working with you. I want you to exercise firmness, fairness and discipline on the members of your force so that the army we know remains, he said.\n\nLt-Gen Matatu said he was grateful to the President for his recognition in promotion and appointment.\n\nI want to express my sincere gratitude to the President and Commander-in-Chief of the Zimbabwe Defence Forces, Cde Mnangagwa for promoting me to the rank of Lieutenant-General and appointing me as Commander Zimbabwe National Army. My gratitude also goes to other members of the Presidium and you sir for the promotion you considered and the President acted on, he said.\n\nI have no doubt of the magnitude of the task ahead of me of keeping the legacy of the Zimbabwe National Army and I know I am following the footsteps of some of our greatest commanders like you who have commanded the force ahead of me.\n\nAs part of its military tradition, the ZDF is expected to conduct a handover and takeover parade between Lt-Gen Matatu and outgoing Army Commander Lt-GenNhamo Anselem Sanyatwe who has retired and has been appointed Sports, Recreation and Arts Minister.\n\nThe parade signifies change of command of the organisation.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Gen-Siband-Lt-Gen-Matatu-680x380.jpg",
            "description": "Columbus Mabika-Herald Correspondent Newly-promoted Zimbabwe National Army Commander Lieutenant-General Emmanuel Matatu was yesterday conferred with insignia for his new rank at Defence Headquarters following his promotion and appointment by President Mnangagwa on Thursday. His promotion from the rank of Major-General and subsequent appointment were with effect from Thursday. The President made the promotion in terms […]",
            "time": "08:26",
            "date": "29 Mar 2025"
        },
        {
            "title": "Inter-ministerial delegation okays Gokwe’s Uhuru preps",
            "url": "https://www.herald.co.zw/inter-ministerial-delegation-okays-gokwes-uhuru-preps/",
            "content": "Freedom Mupanedemo-Midlands Bureau\n\nAn inter-ministerial delegation led by Vice President Cde Kembo Mohadi visited this years Independence celebration venue in Gokwe North and expressed satisfaction with the works taking place after Mutora Business Centre suddenly became a hive of activity in all sectors of development.\n\nVice President Mohadi said the civil works at Murora Business Centre and the road works being done ahead of the Uhuru celebrations were on schedule for April 18. He expressed his happiness at witnessing firsthand the developments taking place in Gokwe.\n\nI have seen a lot of progress and am sure by the time we hold the celebrations, we need to keep the momentum because where there are no roads, there is no development. We need to maintain our roads. Development is not just about cities; it is about rural areas where we get most of our votes. To the team on the ground, I want to say well done. We are learning new things every day. I have the feeling that this is going to be more polished. We are impressed, he said.\n\nVP Mohadi noted that decentralising the countrys main events was bearing fruit, with all corners of the country set to witness similar developments.\n\nThis is in line with our Presidents vision of leaving no one and no place behind. The developments we are witnessing in Gokwe are just amazing, he said.\n\nMinister of Information, Publicity, and Broadcasting Services Dr Jenfan Muswere stated that the government had lined up a number of programs to ensure that the event receives enough publicity.\n\nWe have come up with a sound communication strategy to publicize the event. We have lined up some radio and television programs to inform the people about the event. This is a critical event on our national calendar. We need to do justice so that people can come and commemorate the independence from colonial rule, he said.\n\nMidlands Provincial Affairs and Devolution Minister Owen Ncube mentioned that most of the works on the ground, including upgrading feeder roads and refurbishing the soccer ground, were 70 percent complete, with contractors now working 24/7.\n\nWe are now at 70 percent of the project. We have started disbursing the necessary funds to contractors. We have introduced a 24-hour schedule for contractors, so we should be done by the time of the celebrations, he said.\n\nThis years Independence celebrations are being held under the theme: Zim @45: Devolve and Develop Together Towards Vision 2030.\n\nThe main celebrations, to be held on the 18th of April, will be preceded by a childrens party at Nyamuroro Primary School on the 17th of next month at Mutora Business Centre.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/VP-Mohadi-in-Gokwe-680x380.jpg",
            "description": "Freedom Mupanedemo-Midlands Bureau An inter-ministerial delegation led by Vice President Cde Kembo Mohadi visited this year’s Independence celebration venue in Gokwe North and expressed satisfaction with the works taking place after Mutora Business Centre suddenly became a hive of activity in all sectors of development. Vice President Mohadi said the civil works at Murora Business […]",
            "time": "08:26",
            "date": "29 Mar 2025"
        },
        {
            "title": "First Lady’s Chipinge medical outreach benefits thousands",
            "url": "https://www.herald.co.zw/first-ladys-chipinge-medical-outreach-benefits-thousands/",
            "content": "Tendai Rupapa in CHIPINGE\n\nTHOUSANDS of people in Manicaland province, yesterday received free cancer screening services, eyesight checks as well as tests for other non-communicable diseases like hypertension and diabetes courtesy of health Ambassador First Lady Dr Auxillia Mnangagwas drive towards a healthy nation.\n\nWith the assistance of practitioners from the Ministry of Health and Child Care, the First Lady availed her fully-equipped Angel of Hope Foundations mobile hospital and mobile clinic to ensure beneficiaries were screened for cervical, breast and prostate cancers, hypertension, diabetes, and HIV and provided with family planning services.\n\nThere were other supporting tents serving people.\n\nAmai Mnangagwa held discussions with school learners from primary to high school pupils on the dangers of early sexual relations and the need for them to remain in school for a brighter future.\n\nIt was surprising and concerning to learn that younger pupils as young as grade one have in-depth knowledge about sexual intercourse which is inappropriate for their age.\n\nAsked by Amai Mnangagwa how they knew about all this in detail, the children pointed at social media saying that is where they see explicit content.\n\nOthers said it was through peer influence from their peers, who share experiences.\n\nFirst Lady Dr Auxillia Mnangagwa is hugged by school girls who could not hide their excitement at meeting her in person in Chipinge yesterday\n\nA Grade Six learner told the First Lady that there were girls from the primary school level who were already bedding men owing to a quest for money.\n\nWhats your message to them, the First Lady asked and the young girl said: Our time will come and let us not rush to do things that are not of our ages. Sexual relations are not for young people. What if you fall pregnant? If you drop out of school, what will your future be like? Are you not afraid of sexually transmitted diseases? Let us focus on our studies.\n\nShe thanked Amai for her teachings.\n\nThose who have ears have heard what our mother has said, she said to applause.\n\nThe open communication the First Lady had with the learners ensured they understood the context and implications of sexual intercourse before the time was right.\n\nDr Mnangagwa came across a pregnant under-aged girl.\n\nShe told her that she eloped with a 25-year-old man at the age of 15 while she was in grade seven.\n\nAmai was so touched but she reprimanded her for getting pregnant at such a tender age when she was supposed to be in school. However, she urged her to always go for antenatal checks to ensure she delivered well.\n\nThe Mother of the Nation also held an interactive session with members of the community tackling thorny issues like drug and substance abuse and early child marriages.\n\nFirst Lady Dr Auxillia Mnangagwa listens attentively to a girl as she distributed sanitary pads and books to school children in Chipinge yesterday.Pictures: John Manzongo.\n\nLearners were given stationery, while girls also received sanitary pads, courtesy of the First Lady who pledged to donate sewing machines to the province for the girls to sew reusable pads.\n\nPregnant women also received baby preparation kits.\n\nDr Mnangagwa commended women and men for prioritising their health by coming for health checks including cancer screening and encouraged them to use all the mobile medical facilities.\n\nShe also rallied them to get tested for HIV.\n\nThe First Lady was delighted after seeing pregnant women being tested for HIV saying HIV testing during pregnancy is crucial for preventing mother-to-child transmission because it allows for timely access to antiretroviral therapy (ART) for both the mother and infant, significantly reducing the risk of transmission.\n\nAmai Mnangagwa is leading the fight against non-communicable diseases which are afflicting and claiming millions of lives across the globe.\n\nPeople of various age groups received checks for various ailments to save lives because if treated early, the chances of survival for many diseases are high.\n\nTodays programme is different from the one we had yesterday as I have come focusing on health including cancer screening. The world over, Zimbabwe included, cancer is a leading cause of death. If you are diagnosed early and placed on treatment early, it can be treated. It is critical to get screened for cervical, breast and prostate cancer.\n\nA senior police woman distributes sanitary pads donated by First Lady Dr Auxillia Mnangagwa to school girls in Chipinge yesterday.\n\nThere is also HPV which causes cancer especially, among children who are sexually active. Young children must desist from engaging in sexual affairs before the time is ripe, but instead value their education, she said.\n\nWhat are the dangers associated with having sexual intercourse at a tender age? the First Lady asked.\n\nSchoolgirls replied pointing at sexually transmitted infections, pregnancies and dropping out of school.\n\nDr Mnangagwa urged schoolchildren to learn to say no to any man or boy who comes with sexual advances.\n\nShe also spoke against drug and substance abuse, especially among youths. She advised people to use her 575 toll-free line and report such cases.\n\nAmai Mnangagwa further urged people to consume healthy traditional food to keep fit.\n\nManicaland Provincial Affairs and Devolution Minister Advocate Misheck Mugadza praised the First Lady for bringing health services to the people.\n\nAmai has brought a hospital and a clinic at our doorsteps, state-of-the-art medical facilities. The First Lady initiated this programme for us to get early treatment if found with any ailment. This is in a bid to prevent unnecessary loss of lives. Let us all make use of this platform to get screened for diseases. I would like to urge men to also prioritise their health by undergoing medical health checks. Research shows men are lagging, he said.\n\nFirst Lady Dr Auxillia Mnangagwa is assisted by the Member of Parliament who is also Deputy Minister of Primary and Secondary Education Angeline Gata in distributing books to school children in Chipinge yesterday.\n\nDeputy Minister of Primary and Secondary Education Cde Angeline Gata who is also the legislator for Mutema-Musikavanhu Constituency praised the First Lady for her benevolence.\n\nThank you, Amai for what you have done. We have what we call menstruation poverty so Amai what you have done, giving these girls pads will go a long way in alleviating period poverty among some of these girls. Some girls fail to attend school owing to lack of sanitary ware, which disturbs their studies, she said.\n\nSpeaking at the same occasion, a National Aids Council representative showered praises on the First Lady.\n\nWe would like to thank Amai for her women-centric programmes, especially with regards to health. On HIV and AIDS we managed to reach the 95-95-95 target. We have achieved what is called epidemic control. Im happy to see pregnant women being tested for HIV. As a country, we want to eliminate Mother-to-child transmission. As NAC we urge everyone to get tested for HIV. Women, also rally your husbands to get tested for HIV, he said.\n\nFirst Lady Dr Auxillia Mnangagwa hands over new born baby preparation kits to a visually impaired expecting mother in Chipinge yesterday.\n\nManicaland Provincial Medical Director, Dr Munyaradzi Mukuzunga, said medical outreach programmes were beneficial to the people and praised the First Lady for her thoughtfulness.\n\nWe wish to thank the First Lady Dr Auxillia Mnangagwa for bringing the outreach here at Maunganidze in Chipinge District. We have women who have benefited by being screened for cervical cancer and mammography screening for breast cancer. People are also having eyesight examinations, hypertension and other ailments and are being attended to and given medication.\n\nWe have doctors and many nurses who are attending to the people. Some pregnant women were also being attended to as well as being given teachings on what to eat and how to care for themselves. We thank the First Lady verily for her programme. Being tested for HIV is critical because here in Zimbabwe we have what we call triple elimination which seeks to end syphilis, HIV and Hepatitis B so that all children born in Zimbabwe will be free of HIV, free of syphilis and free of Hepatitis B. Women who are pregnant and those who are breastfeeding need to be continuously tested for these ailments so that they do not spread to the children. We want an HIV free generation. These medical outreach programmes are critical because there are some services that are largely not available all the time like at some clinics there will be no dental services but on outreaches we will have such services. We have eye specialists here present and those who did not have access are being helped and Amai is bringing the hospitals to the people, he said.\n\nBeneficiaries of the programme were equally upbeat.\n\nA school girl passionately and authoritatively speaks about how she will reject boys and all forms of sexual advances towards her, abuse and how she will not hesitate to report to police at an interactive session with First Lady Dr Auxillia Mnangagwa in Chipinge yesterday.\n\nI want to thank our First Lady for coming to our rescue. We had grown accustomed to missing school during our monthly cycles but our mother has brought us sanitary pads which help us restore our confidence, said an upper primary school learner at the event.\n\nGogo Marian Timburwa (70) thanked the First Lady for letting her know where she stands health-wise.\n\nA medical Doctor examines a school boy during a free medical outreach organised by Health Ambassador First Lady Dr Auxillia Mnangagwa in Chipinge yesterday.\n\nI am so happy that today I have been screened for breast and cervical cancer free of charge because of our mothers love. She has made it possible for me to undertake a test I never thought I would ever undertake in my life. May God bless her for her deep love, she said.\n\nEqually happy was Mrs Cynthia Bande who received a baby preparation kit from the mother of the nation.\n\nI want to thank the First Lady for what she has done for us today. Apart from letting us be tested, she gave us baby preparation kits. I had nowhere to start from and I am thankful for her double gift, she said.\n\nBulawayo-based Arts group IYASA provided edutainment.\n\nIyasa drama and dance group perform a drama depicting the effects and dangers of drugs and substance abuse among youths and old at a free medical outreach by Angel of Hope Foundation in Chipinge yesterday.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/First-Lady1-2-680x380.jpg",
            "description": "Tendai Rupapa in CHIPINGE THOUSANDS of people in Manicaland province, yesterday received free cancer screening services, eyesight checks as well as tests for other non-communicable diseases like hypertension and diabetes courtesy of health Ambassador First Lady Dr Auxillia Mnangagwa’s drive towards a healthy nation. With the assistance of practitioners from the Ministry of Health and […]",
            "time": "08:26",
            "date": "29 Mar 2025"
        },
        {
            "title": "State, Algeria forge new scientific partnership",
            "url": "https://www.herald.co.zw/state-algeria-forge-new-scientific-partnership/",
            "content": "Mukudzei Chingwere-Herald Reporter\n\nThe Government has officially approved a Memorandum of Understanding with Algeria in a move aimed at bolstering collaboration between the two countries in science and technology.\n\nThis agreement focuses on enhancing cooperation in the fields of science and technology, a vital step towards promoting innovation and research between the two nations. The MoU establishes a framework for various cooperative initiatives, emphasising the exchange of experts and capacity building.\n\nBoth countries aim to collaborate on key areas such as biotechnology, electronics, pharmacology, and the management of information systems. This partnership is expected to not only improve technological capabilities but also foster economic growth through shared knowledge and resources.\n\nInformation Publicity and Broadcasting Services Minister Dr Jenfan Muswere, who announced the approval, highlighted the importance of this agreement in addressing common challenges faced by both countries in the science and technology sectors.\n\nThe objective of the memorandum is to create a framework for cooperation in science and technology between the Republic of Zimbabwe and the Republic of Algeria, through exchange of experts, capacity building, collaboration in research among other activities, said Dr Muswere.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Muswere-1.jpg",
            "description": "Mukudzei Chingwere-Herald Reporter The Government has officially approved a Memorandum of Understanding with Algeria in a move aimed at bolstering collaboration between the two countries in science and technology. This agreement focuses on enhancing cooperation in the fields of science and technology, a vital step towards promoting innovation and research between the two nations. The […]",
            "time": "08:26",
            "date": "29 Mar 2025"
        },
        {
            "title": "Korea pledges support to Zim’s anti-corruption efforts",
            "url": "https://www.herald.co.zw/korea-pledges-support-to-zims-anti-corruption-efforts/",
            "content": "Herald Reporter\n\nThe Anti-Corruption and Civil Rights Commission (ACRC) of the Republic of Korea has pledged to support the Zimbabwe Anti-Corruption Commission (ZACC) in strengthening its fight against corruption in the public sector.\n\nThe commitment was made at the signing of a Memorandum of Understandingbetween ZACC and ACRC at the Korean Government Complex in Seoul, yesterday.\n\nSpeaking at the signing ceremony, ACRC chairperson Mr Ryu Chul Whan expressed satisfaction with the elevated relations between Korea and Zimbabwe.\n\nWe are impressed and respect Zimbabwes efforts to tackle corruption. We are prepared to share knowledge and expertise and we will be glad if Zimbabwe can suggest practical steps for operationalising the MOU, he said.\n\nMr Whan also added that the Republic of Koreas efforts had improved its Corruption Perception Index ranking to 30th out of 180 countries in 2024.\n\nZACC chairperson Mr Michael Reza said this collaboration will enable the Zimbabwean commission to adopt and adapt proven mechanisms like the integrity assessment and corruption risk assessment and work towards institutionalising integrity training for all public officials.\n\nZimbabwe has been doing integrity pledges and integrity committees and will consider expanding the programme to incorporate trainings, he said.\n\nThe ACRCs corruption risk assessment mechanism will be an excellent model for Zimbabwe. This systematic approach allows for the identification of corruption risks within public administration processes.\n\nThe Republic of Korea has a strong legal framework which includes the Anti-Graft Act, Conflict of Interest Prevention Act, Public Fund Recovery Act, Code of Conduct for Public Officials, which seeks to prohibit bribery and improper solicitation and the Public Interest Whistleblower Protection Act.\n\nThese laws set behavioural rules for public officials. Zimbabwe and Korea have enjoyed warm and cordial bilateral relations for the past 31 years. The two countries have exchanged high-level visits, including by President Emmerson Mnangagwa who visited Seoul in June last year when he attended the Korea-Africa Summit and held bilateral discussions with the President of the Republic of Korea HE Mr Yoon Suk Yeol, where five agreements spanning trade, aviation, agriculture, and private-sector collaboration were sealed. The new MOU was spearheaded by Zimbabwes Ambassador to Republic of Korea, Ambassador Stewart Nyakotyo, resident in Japan, when he met the ACRC chairperson.\n\nAmbassador Nyakotyo said the MOU is an important milestone in the deepening of bilateral relations between Zimbabwe and Korea.\n\nIt will assist in the strengthening of international partnerships in line with the foreign policy mantra pronouncement by President Mnangagwa, that Zimbabwe is a friend to all and an enemy to none.\n\nThe objectives of the MoU will assist Zimbabwe in the attainment of National Development Strategy goals and those of the soon-to-be-produced NDS2.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Zim-Korea-relations-680x380.jpg",
            "description": "Herald Reporter The Anti-Corruption and Civil Rights Commission (ACRC) of the Republic of Korea has pledged to support the Zimbabwe Anti-Corruption Commission (ZACC) in strengthening its fight against corruption in the public sector. The commitment was made at the signing of a Memorandum of Understanding  between ZACC and ACRC at the Korean Government Complex in […]",
            "time": "08:26",
            "date": "29 Mar 2025"
        },
        {
            "title": "ZANU PF confident of victory in Glen View",
            "url": "https://www.herald.co.zw/zanu-pf-confident-of-victory-in-glen-view/",
            "content": "Joseph Madzimure-Zimpapers Politics Hub\n\nTHOUSANDS of Zanu PF supporters yesterday thronged Chemhanza Grounds in Glen View South for a campaign rally to garner support for Cde Tsitsi Tawomhera who will represent the party in the April 12 by-election.\n\nPresident Mnangagwa wants Zanu PF to take over the former opposition seat.\n\nThe campaign rally, which was organised by the Zanu PF Youth League, was also attended by senior party members.\n\nZanu PF Secretary for Youth Affairs Cde Tino Machakaire, who was the guest of honour, was optimistic the revolutionary party will grab the seat.\n\nThe opposition led councillors has failed to deliver for the people who voted them into office, especially those in urban areas. In Glen View South, sewage is gushing on peoples door steps, which is a health time bomb to the people.\n\nOnly Zanu PF will end all the challenges for the people, he said.\n\nWe cannot afford to lose the seat if we have proper structures in the constituency. With the level of development which is being carried across the country by the Government under the leadership of President Mnangagwa, the electorate will vote for Zanu PF. The Government is currently working on rehabilitating roads in the area, capacitating youth with ICT skills, drilling boreholes to ensure access to clean water for residents, said Cde Machakaire.\n\nHe also challenged the party candidate Cde Tawomhera to campaign together with the losing candidates from the party primary saying this would bring unity of purpose among party members.\n\nPolitics is a game of numbers, we need everyone to come on board to support the party, the President and our candidate. The seat is for Zanu PF, he emphasised.\n\nCde Machakaire also called for high level discipline among party members saying youth should not insult the party leadership.\n\nWe need to respect the party leadership at all levels. We want discipline within the rank and file of the party. We should shun any from of violence, he said.\n\nHe also challenged the youth to abstain from drug and substance abuse.\n\nYouths should not abuse their bodies through consumption of toxic and illicit concoctions and drugs,.\n\nCde Machakaire highlighted that it was important for young people to value themselves and shun drugs and substances that compromise their health and well-being.\n\nSome of our young peoples health has been deteriorating over time because of noxious drugs.\n\nMany young people have been failing to discharge their family and community duties due to drugs and substance, he said.\n\nHarare provincial youth chairman Cde Emmanuel Mahachi echoed the importance of unity to win the seat.\n\nThere is need to correct the previous mistakes to ensure the party wins resoundingly in the coming by-election. We expect the electorate to vote wisely; vote for your own child, vote for Cde Tawomhera, said Cde Mahachi.\n\nCde Tawomhera pledged to unite the people and work towards the development of the area.\n\nLets support Zanu PF to realise significant community improvements and development.\n\nWe want development in Glen View South she said.\n\nThe partys provincial chairman Cde Godwills Masimirembwa was confident that Cde Tawomhera would win the seat.\n\nWith our structures in place, we will win the seat, considering there is no opposition to talk of, he said\n\nZanu PF has nominated Cde Tawomhera, a 37-year-old member of the National Youth League executive, as its candidate.\n\nShe will face four competitors: Perpetua Mukanda from the NCA party, and independent candidates Chakeredza Tonderai, Tungamirai Madzokere, and George Makwangwaidze.\n\nThe seat became vacant following the death of Gladymore Hakata from the CCC party which did not nominate a candidate.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Cde-Machakaire-arriving-in-Glen-View.jpg",
            "description": "Joseph Madzimure-Zimpapers Politics Hub THOUSANDS of Zanu PF supporters yesterday thronged Chemhanza Grounds in Glen View South for a campaign rally to garner support for Cde Tsitsi Tawomhera who will represent the party in the April 12 by-election. President Mnangagwa wants Zanu PF to take over the former opposition seat. The campaign rally, which was […]",
            "time": "08:26",
            "date": "29 Mar 2025"
        },
        {
            "title": "Man brutally assaults mom, commits suicide",
            "url": "https://www.herald.co.zw/man-brutally-assaults-mom-commits-suicide/",
            "content": "Solomon Bhumu\n\nAfter severely assaulting his mother with a hammer and leaving her on the brink of death, Kudakwashe Machiwana (25) of Chidawanyika Village under Chief Mutasa, killed himself by drinking pesticide.\n\nActing Manicaland police spokesperson Assistant Inspector Wiseman Chinyoka said the attack and suicide took place on Wednesday night.\n\nPolice reports indicate that the events leading to the tragedy began at around 10pm when a heated argument broke out between Kudakwashe and his mother, Mrs Irene Machiwana (67).\n\nAccording to police, Mrs Machiwana denied Kudakwashe permission tovisit his biological father, who resides in Mutare.\n\nIn a fit of rage, Kudakwashe grabbed a hammer and brutally attacked his mother.\n\nHe repeatedly struck her on the head leading to her being unconscious, while bleedingseverely from her wounds.\n\nPartmore Nyamwanza, a neighbor, rushed to the scene after hearing a loud noise and suspected that something was wrong.\n\nHe found Mrs Machiwana lying on the ground, writhing in agony, while Kudakwashe was standing holding the hammer he was using in the attack.\n\nAccording to Mr Nyamwanzas statement to the police, Mrs Machiwana lost consciousness and he quickly sought help from Raphael Chidawanyika, another neighbhour.\n\nUpon their arrival at the scene, they saw Kudakwashe lying on the ground with froth coming out of his mouth.\n\nThey also found the container of a pesticide that he had drunk beside him.\n\nBoth Kudakwashe and Mrs Machiwana were immediately rushed to Tsonzo Clinic for medical attention.\n\nKudakwashe was pronounced dead upon arrival while his mother was transferred to Victoria Chitepo Hospital, where she is receiving specialised care.\n\nAuthorities at the provincial referral hospital said she is still in critical condition.\n\nPolice investigations revealed that Kudakwashe had a pre-existing history of mental health issues, and it was further discovered that he had taken his own life, believing he had killed his mother in the brutal attack.\n\nThe police encourage members of the public to resolve family disputes and misunderstandings peacefully without causing harm to one another, which might lead to loss of life. It is important to engage in dialogue or find someone to mediate if there are challenges, said Assistant inspector Chinyoka.  Post Reporter\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Murder-and-suicide-680x380.jpg",
            "description": "Solomon Bhumu After severely assaulting his mother with a hammer and leaving her on the brink of death, Kudakwashe Machiwana (25) of Chidawanyika Village under Chief Mutasa, killed himself by drinking pesticide. Acting Manicaland police spokesperson Assistant Inspector Wiseman Chinyoka said the attack and suicide took place on Wednesday night. Police reports indicate that the […]",
            "time": "08:26",
            "date": "29 Mar 2025"
        },
        {
            "title": "Editorial Comment: Chevrons must ride on proteas, Black Caps tours",
            "url": "https://www.herald.co.zw/editorial-comment-chevrons-must-ride-on-proteas-black-caps-tours/",
            "content": "SOME sweet news filtered in for Zimbabwes cricket enthusiasts and the countrys sporting family at large on Thursday.\n\nThis came after Zimbabwe Cricket (ZC) secured confirmation from the International Cricket Council that neighbours South Africa will be ending their long hiatus from touring this nation for a Test series and will be at Queens Sports Club in Bulawayo for a two-Test Series in June and July.\n\nSimilarly, the Chevrons have also had a rare Test Series against New Zealands Black Caps being lined up for the end of July into early August at Harare Sports Club.\n\nAnd this is no April Fools Day prank.\n\nThe Test Series against some of the games heavyweights will also be spiced by the Twenty 20 International tri-series matches against both the Proteas and the Black Caps also scheduled for Harare Sports Club.\n\nZC managing director Givemore Makoni aptly captured the feeling that greeted the confirmation of the two teams tour when he said: This is the biggest international home season we have had in years and it is an incredible opportunity for our players to test themselves against two of the worlds cricketing powerhouses.\n\nIt is the coming back of the Proteas to this country in particular that has both the Chevrons and their growing legion of fans already savouring the moment and generating a lot of excitement.\n\nDespite South Africa being neighbours and the closest geographically that Zimbabwe have among all the worlds Test Nations, matches between the Chevrons and the Proteas have been few and far between.\n\nTo put into context, the Proteas were last in this country 11 years ago and Harare Sports Club was the site of that Test match in which the South Africans powered to a nine-wicket victory.\n\nA lot has no doubt changed between then and now.\n\nWe, however, urge Makoni, his management team, the ZC board and the Chevrons to seize the moment and make the most of the upcoming tours.\n\nTo their eternal credit, ZC have ensured that cricket has been among the leading sporting disciplines in the country and the fact that with each outing either at Queens Sports Club or Harare Sports have attracted more and more fans.\n\nImages of drum-beating Zimbabwean fans clad in orange or red overalls have captured global attention in the cricket arena.\n\nOn the business side, the more the Chevrons host Test matches, the more they contribute to sport tourism coffers.\n\nSeeing their international idols in action right on their doorsteps will no doubt inspire budding cricketers to pursue the sport at a professional level.\n\nEvery young athlete needs a level to aspire for and nothing beats competing on the global stage, thus paying their way at Queens or Harare Sports Clubs, to watch from the front row as the likes of Temba Bavuma, Lungi Ngidi, Lizaad Williams, Quinto de Kock compete.\n\nIt also a huge inspiration for the fans and the players to see their very own Sikandar Raza, Craig Ervine, Sean Williams, Blessing Muzarabani, Richard Ngarava, Wessly Madhevere, Ryan Burl, Tendai Chatara, Brian Bennett, and Johnathan Campbell shine on home soil against those global superstars.\n\nRefreshingly it is not lost on ZC that hosting South Africa and New Zealand for both Test cricket and an exciting T20I tri-series is a fantastic development for the growth of the game in Zimbabwe.\n\nSouth Africa and Zimbabwe have faced each other in nine Test matches but we believe that building on the 2025 tour that statistic can be boosted and built into more frequent meetings.\n\nThe Chevrons would, however, have to also play their art and become a consistent performer on the Test Arena.\n\nThey have done it before and Craig Ervines generation owe it to all those who have believed and are believing in Zimbabwe.\n\nAnd in the upcoming Test, Zimbabwe could make it their maiden win against the South Africans who have won eight of the previous nine meetings while the other ended in a draw.\n\nTest cricket continues to define the fabled gentlemans game and while the Chevrons have often held their own in One Day internationals and the T20 assignments, it is in the long format that they need to reassert themselves.\n\nAt least in the ODIs the two sides have met on 41 occasions with South Africa winning 38 matches of those meetings.\n\nZimbabwe won two matches with a single match ending in a no result.\n\nIn the short version of white ball cricket, the two countries have met a total of six times, with South Africa winning five matches while the other failed to produce a result.\n\nThe Chevrons can atone for that in the coming tri-series which will also involve the Black Caps.\n\nWith Zimbabwe and South Africa being the only two ICC full member states in Africa much is expected between the two sides in steering the development of the sport on the continent\n\nThe acceptance by South Africa to play Zimbabwe at home is a sign of cordial relationship which is needed between the countries as the continent looks upon them to lead the way.\n\nAnd with South Africa attracting some international players to their domestic league, the tour will play a part for South African franchises owners to have a closer look at Zimbabwe players which could benefit our local players to get opportunities to play in their Premier League and get the much-required exposure.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/10/Chevrons.jpg",
            "description": "SOME sweet news filtered in for Zimbabwe’s cricket enthusiasts and the country’s sporting family at large on Thursday. This came after Zimbabwe Cricket (ZC) secured confirmation from the International Cricket Council that neighbours South Africa will be ending their long hiatus from touring this nation for a Test series and will be at Queens Sports […]",
            "time": "08:26",
            "date": "29 Mar 2025"
        }
    ]
}