{
    "news": [
        {
            "title": "Tanganda export sales  jump 39pc to US$15,1m",
            "url": "https://www.herald.co.zw/tanganda-export-sales-jump-39pc-to-us151m/",
            "content": "Michael Tome\n\nBusiness Reporter\n\nTANGANDA Tea Company Limited says its export sales volume grew by 39 percent to US$15,1 million in the year to September 2024, which accounted for 59 percent of the groups total revenue.\n\nIn contrast, the company experienced a 16,5 percent decline in local sales volume to US$10,6 million.\n\nThe surge in export sales was primarily attributed to a substantial increase in avocado export volumes.\n\nAs the restrictions imposed by the Covid-19 pandemic eased, the company benefited from both the recovery in selling prices and an upswing in demand.\n\nAvocado exports grew significantly, climbing by 40 percent to 2 997 tonnes, compared to 2 148 tonnes in the same period the previous year.\n\nThis rise was bolstered by an increase in average selling prices, which improved to 75 US cents per kilogramme, up from 44 US cents in the past year, reflecting the global markets improved conditions following the easing of pandemic-related restrictions.\n\nHowever, not all product categories shared this positive trajectory.\n\nMacadamia nut exports faced challenges, experiencing a decline of three percent, dropping to 1 508 tonnes from 1 551 tonnes the previous year.\n\nThis downturn was largely due to logistical complications stemming from rescheduled shipping, which affected the final consignment of 286 tonnes.\n\nSimilarly, bulk tea exports also saw a slight decrease, falling two percent to 6,137 tonnes from 6,238 tonnes in the prior year. The drop in tea export volumes was linked to a decline in tea quality,negatively impacted by extreme temperature conditions experienced throughout the year.\n\nAdditionally, the prevailing market conditions in Kenya significantly affected the tea-export average selling prices. They decreased from US$1, 44 per kilogramme in the prior year to US$1, 34 per kilogramme in the current fiscal year, further worsening the challenges faced by Tanganda.\n\nRevenue for the year of US$25, 7 million grew by nine percent from the prior year of US$23, 6 million primarily attributable to an increase in avocado export volumes and the recovery of their selling prices as Covid-19 pandemic restrictions eased, said Herbert Nkala, Tanganda Tea Company chairman in the full year financial review to September 30 2024.\n\nMr Nkala highlighted that the developments occurred against a backdrop of economic instability characterised by exchange rate fluctuations, depreciation of the local currency, and persistent inflationary pressures.\n\nAfter the new local currency was introduced on April 5, 2024, the economy witnessed a resurgence of the challenges, culminating in a 43 percent devaluation of the ZiG in September 2024.\n\nThis devaluation contributed to a further weakening of market confidence in the local currency.\n\nDespite the Governments implementation of tight fiscal and monetary policies to stabilise the economy, Tanganda said, domestic currency stability continued to be threatened by structural economic challenges.\n\nThe situation had been further compounded by the El Nio which adversely impacted the agricultural sector and coincided with a period of subdued international commodity prices, thus significantly affecting overall economic performance.\n\nDespite navigating these mixed challenges, Tanganda achieved a profit after tax of US$1, 4 million, a turnaround from a loss of US$3, 1 million reported in the previous year.\n\nThe companys total revenue for the year reached US$25, 7 million, reflecting a nine percent increase from the prior years US$23, 6 million.\n\nOperating profit also increased significantly, soaring by 223 percent to US$1, 9 million.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/02/Tanganda-Tea-Company.jpg",
            "description": "Michael Tome Business Reporter TANGANDA Tea Company Limited says its export sales volume grew by 39 percent to US$15,1 million in the year to September 2024, which accounted for 59 percent of the group’s total revenue. In contrast, the company experienced a 16,5 percent decline in local sales volume to US$10,6 million. The surge in […]",
            "time": "2024-12-13 00:03:45"
        },
        {
            "title": "CIFOZ hails PPPs impact on construction sector",
            "url": "https://www.herald.co.zw/cifoz-hails-ppps-impact-on-construction-sector/",
            "content": "Oliver Kazunga\n\nSenior Business Reporter\n\nTHE Construction Industry Federation of Zimbabwe (CIFOZ) has commended the Public-Private Partnerships (PPPs) model saying the initiative promotes growth and development of the construction sector.\n\nUnder National Development Strategy 1 (NDS 1), the five-year economic development policy running through 2025, the Government has prioritised infrastructure development as one of the 14 critical pillars to drive the country towards the envisioned upper middle-income society by 2030.\n\nAgainst this background, the Government has prioritised infrastructural development, calling on construction industry players to tap into opportunities under the PPPs arrangement, where various infrastructure projects have been initiated and developed.\n\nProjects in which the PPPs model has been embraced include the US$88 million Mbudzi Interchange in Harare, US$121,7 million Gwayi-Shangani Dam project in Matabeleland North Province, as well as the US$300 millionBeitbridge Border Post modernisation project, which has positioned the country well for the implementation of the One Stop Border Post concept with the neighboring South Africa.\n\nIn an interview, CIFOZ chief executive officer Mr Martin Chingaira said We are commending the policy changes (to PPPs), where locals are now preferred for most of the projects.\n\nThat has given our local companies in the built environment a new lease of life because we are participating in various infrastructural development projects through PPPs.\n\nHe said the Government had also engaged the private sector, encouraging it to create more jobs using the PPPs and utilise the Zimbabwe Investment and Development Agency (ZIDA) website for priority projects.\n\nAny economy in the world can only do better when the private sector is participating in infrastructure development, unlike waiting for the Government to mobilise funding for the projects.\n\nWe are saying to our members, gone are the days we waited for public tenders to be flighted for us to get jobs but we need to engage for PPPs to create linkages that will create more money through profits, return on investments\n\nWhenever we talk about the construction industry or the built environment, first of all, we say we are the barometer of any economy  thus for the economy to grow we need roads, dams, housing, schools, universities, commercial buildings and so forth.\n\nThis means that when the construction industry is activated, manufacturers of cement or bricks, and those who do timber and ceilings, among others across, the value chain will increase production, said Mr Chingaira.\n\nHe said the construction industry federation would forge ahead with the PPPs model, adding that as long as the population of Zimbabwe keeps growing, more infrastructure like roads, social amenities, health and educational facilities would be required.\n\nCurrently, we are talking about congestion on our roads just because we have not expanded or dualised most of our roads or constructed new roads.\n\nAs long as there is population growth, it means we have to expand every facility we are using for us to be comfortable.\n\nSo there is a lot of work  we need more roads, dams, schools, and industrial buildings and thus there is a lot of work and opportunities for the built environment, said Mr Chingaira.\n\nIn this ZiG276,4 billion 2025 National Budget Statement presented last month, Finance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube said aside ZiG58,6 billion to shore up infrastructure development.\n\nConsistent with our aspirations for Vision 2030, resources will be availed towards funding the 2025 Infrastructure Investment Programme including intergovernmental fiscal transfers amounts to ZiG58,6 billion whose breakdown is as follow: budget revenues of ZiG28,4 billion, development partner support of ZiG1,2 billion, loan funding of ZiG1,8 billion, and statutory and other funding of ZiG27,2 billion, he said.\n\nMinister Ncube highlighted that on account of the continued infrastructure delivery needs and the limited funding capacity, amid the increased funding requirements to close the infrastructure gap, all available funding instruments for projects such as the budget, bond markets, bank loans, equity issuance and guarantees, should be leveraged.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/A12.jpg",
            "description": "THE Construction Industry Federation of Zimbabwe (CIFOZ) has commended the Public-Private Partnerships (PPPs) model saying the initiative promotes growth and development of the construction sector.",
            "time": "2024-12-13 00:03:45"
        },
        {
            "title": "Gold will shine in bearish year ahead for commodities",
            "url": "https://www.herald.co.zw/gold-will-shine-in-bearish-year-ahead-for-commodities/",
            "content": "Tensions between the US and China may weigh on energy and commodities markets next year, while the outlook remains bright for gold, ING Groep NV said.\n\nPresident-elect Donald Trumps pledges to slap tariffs on trading partners, and possible retaliation, could roil markets including oil, metals and agriculture as traders also look to stimulus measures from China to boost consumption, the lender said in its 2025 outlook.\n\nWe see large parts of the complex edging lower in 2025 with relatively comfortable supply and demand balances, Warren Patterson and Ewa Manthey said in the report.\n\nThe potential for an escalation in trade tensions is a downside risk, while markets are waiting to see if and when Chinese support measures feed their way into commodity markets.\n\nWhile Trump is unlikely to move the needle much on US oil production, crude is set to come under pressure from strong non-OPEC supply growth, and ING sees Brent slipping to an average of US$71 a barrel next year, from current levels around US$74.\n\nMeanwhile, new US LNG export plants are likely to lift domestic demand and prices while allowing Europe to more easily offset Russian supplies, leading to lower natural gas prices in the region assuming a normal winter.\n\nGold is set to continue this years streak of hitting consecutive records on geopolitical concerns, ING said, with prices averaging US$2 760 an ounce in 2025 from current levels of around US$2 713.\n\nMost of the buying will come from central banks looking to diversify their foreign reserves, while increased trade and geopolitical friction could add to bullions haven appeal. The outlook for industrial metals is murkier, with trade moves, potential changes to Bidens climate laws and Chinese demand all likely to play a role, ING said. Bloomberg\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Donald-Trump.jpg",
            "description": "Tensions between the US and China may weigh on energy and commodities markets next year, while the outlook remains bright for gold, ING Groep NV said.",
            "time": "2024-12-13 00:03:45"
        },
        {
            "title": "Appetite for SA exposure  stokes buying in JSE’s stock",
            "url": "https://www.herald.co.zw/appetite-for-sa-exposure-stokes-buying-in-jses-stock/",
            "content": "Momentum in South Africas equity market sparked by a landmark election earlier this year is maintaining its pace, with the stock exchanges own shares one of the targets for investors chasing returns.\n\nOne way to get exposure to the growth of Africas capital markets would be the Johannesburg Stock Exchange, which is a publicly listed company, said Thea Jamison, managing director at Change Global Investment LLC, which has been buying the shares.\n\nJSE, which operates Africas biggest stock and bond exchanges and acts as a proxy for South African companies more broadly, has risen almost three times as fast as the benchmark index over the past four months.\n\nPolitical changes in South Africa bringing renewed interest from investors, coupled with rising trading fees and relatively cheap valuation, are making the exchanges shares attractive, Jamison added.\n\nThe dividend yield, showing the return an investor can expect from dividends alone expressed as a percentage of the stock price, is 6,4 percent on a trailing 12-month basis and 6,8 percent based on Bloomberg dividend forecasts for the next 12 months.\n\nThats the second highest among its peers behind the Warsaw Stock Exchange.\n\nSouth African stocks have experienced their strongest third quarter for 11 years, with analysts tracked by Bloomberg seeing the gains extending over the coming 12 months.\n\nThe FTSE/JSE Africa All Share Index has climbed 13 percent so far this year, heading for the best year since 2021, notching at least 13 record highs in the process and outpacing a rally in MSCIs gauge of emerging-market equities.\n\nThe government of national unity, installed after Mays election, has spurred hopes of fixes for the energy and transport problems that have hobbled Africas most-industrialised economy, including its mining sector.\n\nMeanwhile, the countrys central bank lowered borrowing costs for a second successive meeting on November 21 and said its modeling showed further cuts were in the offing, but that the outlook is uncertain.\n\nStock exchanges can be seen as levered plays on a countrys macro environment, said Gustavo Medeiros, head of global macro research at Ashmore in London, who is watching for accelerated economic growth among signs for improved investor sentiment toward South African equities.\n\nMedeiros sees some financial and consumer stocks benefiting from an improving macro environment that is still under appreciated by international investors, who remain focused on US politics and Chinas economic challenges.\n\nWe have seen a lot of positive momentum in South Africa facing businesses on the JSE since the better-than-expected outcome of the national elections at the end of May and beginning of June, said Andrew Dowse, a portfolio manager at Merchant West.\n\nThe primary driver of returns for the JSE is equity trade flow, which continues to improve as local managers tilt their view more favorably towards SA Inc. stocks.\n\nMerchant West Investments Pty, also known as Bridge Collective Investments RF Pty, is among the largest holders of JSE stock, according to data compiled by Bloomberg.\n\nThe portfolio manager sees recent initial public offerings, including Pick n Pay Stores unbundling Boxer, as a symptom of improving demand from investors to participate in a rally and their willingness to pay up for new investment opportunities.\n\nAlthough the intention behind Boxer to float was largely to raise cash for Pick n Pay, the achieved price was at the top of the guidance range, showing good demand from local investors for companies that have reasonably good growth prospects, he said. Bloomberg\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/06/istockphoto-931069162-612x612-612x380.jpeg",
            "description": "Momentum in South Africa’s equity market sparked by a landmark election earlier this year is maintaining its pace, with the stock exchange’s own shares one of the targets for investors chasing returns.",
            "time": "2024-12-13 00:03:45"
        },
        {
            "title": "Musk becomes first-ever person worth US$400bn",
            "url": "https://www.herald.co.zw/musk-becomes-first-ever-person-worth-us400bn/",
            "content": "The Tesla and SpaceX CEOs net worth skyrocketed to US$439,2 billion on Wednesday  an increase of about US$50 billion in just one day, according to Bloomberg figures.\n\nThe jump comes after an insider share sale at SpaceX boosted the space exploration company to a US$350 billion valuation, making it the most valuable private startup in the world.\n\nMusk is believed to own about 42 percent of the firm, NBC News reported.\n\nPrior to the massive boost on Wednesday, Musks net worth had already soared by an unmatched US$155 billion this year, placing him at US$384 billion as of market close on Tuesday, according to the Bloomberg Billionaires Index.\n\nThe index, which has not yet been publicly updated to reflect the latest jump, on Tuesday showed Musk US$140 billion ahead of the worlds second richest person, Amazon founder Jeff Bezos, whos worth US$244 billion.\n\nThe jump comes after the worlds richest person broke his wealth record of about US$340 billion in late November, which had stood for just over three years.\n\nMusks soaring wealth also piggybacks on the postelection rally for Tesla stock. Teslas stock has soared nearly 71 percent so far this year. Its market cap is US$1,23 trillion.\n\nThe stock has surged since Donald Trumps victory in the US presidential election, as investors wagered the electric vehicle maker would benefit from Musks close ties to the president-elect.\n\nMark Malek, Sieberts chief investment officer, previously told BI that some sort of premium has been placed on the stock as a result of Musks very public involvement in Trumps campaign.\n\nTesla could continue to make further gains. Analysts at Bank of America said in a note last week that a recent visit to the Austin factory gave them increased confidence that TSLA is well-positioned to grow in 2025+ with its core EV business launch of its robotaxi offering, and longer-term from its investments in Optimus.-Business Insider Africa\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/02/Untitled-5-3.jpg",
            "description": "The Tesla and SpaceX CEO’s net worth skyrocketed to US$439,2 billion on Wednesday — an increase of about US$50 billion in just one day, according to Bloomberg figures.",
            "time": "2024-12-13 00:03:45"
        },
        {
            "title": "SA inflation fall to mid of central bank range",
            "url": "https://www.herald.co.zw/sa-inflation-fall-to-mid-of-central-bank-range/",
            "content": "South African analysts, business people and trade unions have lowered their inflation expectations through to 2026, taking them to the midpoint of the central banks inflation target range, a quarterly survey showed on Thursday.\n\nThe findings are likely to encourage the South African Reserve Bank (SARB) to forge ahead with its monetary easing cycle, potentially by cutting interest rates in larger increments.\n\nThe fourth-quarter survey conducted by the Bureau for Economic Research found that the average inflation forecast of analysts, business people and labour unions was for headline consumer inflation of 4,6 percent in 2024, 4,5 percent in 2025 and 4,6 percent in 2026.\n\nThat is down from average forecasts of 5,1 percent, 4,8 percent and 4,8 percent in the third-quarter survey and the lowest expectations have been in more than three years.\n\nThe SARB likes to see inflation around 4,5 percent, the midpoint of its 3 percent to 6 percent target band.\n\nIt has lowered its main lending rate by 25 basis points (bps) at each of its last two meetings.\n\nBut some analysts believe there is room for a 50 bp cut at the next policy meeting in January.\n\nData on Wednesday showed headline consumer inflation stood at 2,9 percent year on year in November, below the target band for the second month in a row thanks to food inflation slowing to its lowest level in almost 14 years.Reuters\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/06/istockphoto-931069162-612x612-612x380.jpeg",
            "description": "South African analysts, business people and trade unions have lowered their inflation expectations through to 2026, taking them to the midpoint of the central bank’s inflation target range, a quarterly survey showed on Thursday.",
            "time": "2024-12-13 00:03:45"
        },
        {
            "title": "Tropical cyclone Chido likely to affect Zimbabwe",
            "url": "https://www.herald.co.zw/tropical-cyclone-chido-likely-to-affect-zimbabwe/",
            "content": "Precious Manomano\n\nHerald Reporter\n\nTropical cyclone Chido, which is still to the north-east of Madagascar, has intensified over the past 24 hours and might affect Zimbabwe.\n\nThe Meteorological Services Department (MSD) in conjunction with Department of Civil Protection have said the tropical cyclone is likely to cross into Zimbabwe on December 17.\n\nThe cyclone is expected to bring strong winds, thunderstorms and heavy rainfall of more than 70mm in 24 hours in parts of Manicaland, Masvingo, Mashonaland East, Mashonaland Central, Mashonaland West, Harare and Midlands.\n\nFloods, rock falls and mudflows are also expected.\n\nThe two departments said they will continue to monitor the cyclone and give regular updates.\n\nThe department urged the public to avoid open spaces and also encouraged them to secure their roofs.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Tropical-Cyclone-Chido.jpg",
            "description": "Tropical cyclone Chido, which is still to the north-east of Madagascar, has intensified over the past 24 hours and might affect Zimbabwe.",
            "time": "2024-12-13 00:03:45"
        },
        {
            "title": "Bulawayo to receive Cde Mphoko’s body tomorrow",
            "url": "https://www.herald.co.zw/bulawayo-to-receive-cde-mphokos-body-tomorrow/",
            "content": "Joseph Madzimure\n\nZimpapers Politics Hub\n\nTHE body of the national hero former Vice President Phekezela Mphoko who died in India on Friday last week has arrived in Harare awaiting burial.\n\nHis body was accompanied by his wife Laurinda and his children Sikhumbuzo and Siduduzo.\n\nCde Mpoko( 84) was declared a national hero in recognition of his contribution during and after after the countrys independence.\n\nHis body was received at the Robert Gabriel Mugabe International Airport by Zanu PF Politburo members led by the National Political Commissar, Cde Munyaradzi Machacha, family members and friends.\n\nPresident Mnangagwa consoled Cde Mphokos family this evening soon after his arrival from Midlands Province.\n\nIn an interview this evening, chief director in the Ministry of Home Affairs and Cultural Heritage Mr Mike Masaka said the body of the national hero will lie in state at Charles Gumbo Barracks and will be flown from Manyame Airbase to Bulawayo tomorrow at 10am.\n\nWe are going to convene an inter-ministerial meeting tomorrow at 8am. After that meeting we are going to inform members of the public on the date and place of burial, said Mr Masaka.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/8ab0a508-29d5-43db-997d-2cca4951316a-680x380.jpeg",
            "description": "THE body of the national hero former Vice President Phekezela Mphoko who died in India on Friday last week has arrived in Harare awaiting burial.",
            "time": "2024-12-13 00:03:45"
        },
        {
            "title": "National hero Cde Mphoko’s body arrives in Harare",
            "url": "https://www.herald.co.zw/national-hero-cde-mphokos-body-arrives-in-harare/",
            "content": "Joseph Madzimure\n\nZimpapers Politics Hub\n\nThe body of the former Vice President Phelekezela Mphoko who died in India on Friday last week has arrived at the Robert Gabriel Mugabe International Airport.\n\nMore details to follow.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/84f95e56-8595-4e4a-b9de-bb7ff3f5ed80-680x380.jpeg",
            "description": "The body of the former Vice President Phelekezela Mphoko who died in India on Friday last week has arrived at the Robert Gabriel Mugabe International Airport.",
            "time": "2024-12-13 00:03:45"
        },
        {
            "title": "Mashonaland West Investment Conference begins on high note",
            "url": "https://www.herald.co.zw/mashonaland-west-investment-conference-begins-on-high-note/",
            "content": "Walter Nyamukondiwa in KADOMA\n\nThe two-day Mashonaland West Investment Conference began today with potential local and international investors exploring opportunities in various sectors of the economy.\n\nGovernment ministries and agencies, including the Zimbabwe Investment and Development Authority (ZIDA), Zimbabwe Electricity Distribution and Transmission Company (ZETDC) and Zimtrade, among others, presented investment opportunities in various sectors.\n\nSome participated virtually from countries such as the United Kingdom, USA and Tanzania, among others.\n\nA delegation from Tanzania is also attending the conference to explore opportunities in the province.\n\nMashonaland West Provincial Affairs and Devolution Minister Marian Chombo officially opened the Conference and implored investors to take advantage of the opportunities in the province.\n\nMinister Chombo said the second edition of the conference comes after the first edition, also held in Kadoma in December 2023, recorded positive spin-offs.\n\nMashonaland West Province contributes about 12,6 percent to the national Gross Domestic Product (GDP), the third largest after Harare and Bulawayo.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/9583eb80-f2fc-4aee-9c91-9efc8ce35969-680x380.jpeg",
            "description": "Walter Nyamukondiwa in KADOMA The two-day Mashonaland West Investment Conference began today with potential local and international investors exploring opportunities in various sectors of the economy. Government ministries and agencies, including the Zimbabwe Investment and Development Authority (ZIDA), Zimbabwe Electricity Distribution and Transmission Company (ZETDC) and Zimtrade, among others, presented investment opportunities in various sectors. […]",
            "time": "2024-12-13 00:03:45"
        }
    ]
}