{
    "news": [
        {
            "title": "Ex-Arda boss Nyabadza files application for exception in US$1,3 m fraud",
            "url": "https://www.herald.co.zw/ex-arda-boss-nyabadza-files-application-for-exception-in-us13-m-fraud/",
            "content": "Prosper Dembedza\n\nHerald Correspondent\n\nFormer Agriculture, Rural Development Authority (Arda) board chairman Basil Nyabadza last week filed an application for exception before Harare magistrate Tilda Mazhande on allegations of defrauding former lawmaker Blessed Runesu Geza of US$1 362 000 in a land deal.\n\nNyabadza who is being represented by Tazorora Musarurwa argued that the charge does not state the prejudice or the potential prejudice that was suffered by Geza.\n\nMusarurwa further highlighted that the charge does not disclose how Geza was defrauded considering that the land involved belongs to the Nyabadzas company which is entitled to dispose of it as it pleases in terms of the law.\n\nThe defense submitted that the outline states that the land belongs to Geza without mentioning how he derived such ownership when Nyabadza has registered title.\n\nIn its application the defense argued that the outline indicates that the total value stolen was US$1 362 000 without averring when, how or where that amount was ever received by Nyabadza.\n\nAccording to prosecutor Anesu Chirenje, Geza bought a piece of land from Nyabadza measuring 42,3504 hectares for US$1 362 000 on October 29, 2020.\n\nChirenje said Geza was granted sole authority to subdivide, develop and sell the land. When the agreement of sale was done, Nyabadza allegedly misrepresented to Geza that the piece of land had title deeds which he would avail in a months time but failed to deliver.\n\nChirenje told the court that while Geza was in process of obtaining subdivision permits for the land from the Department of Physical Planning in Mashonaland West Province, he discovered that Nyabadza had sold the same land to Velda Estates.\n\nThe court heard that Geza engaged Nyabadza hoping for an amicable solution only to discover that his agreement of sale was cancelled without him being informed.\n\nThe matter was reported to the police leading to Nyabadza being summoned to the courts.\n\nMagistrate Mazhande remanded the matter to January 31 for ruling on the application for exemption.\n\nGeza suffered prejudice of US$1 362 000 and nothing was recovered.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/05/Harare-Magistrates-Court-680x380.jpeg",
            "description": "Prosper Dembedza Herald Correspondent Former Agriculture, Rural Development Authority (Arda) board chairman Basil Nyabadza last week filed an application for exception before Harare magistrate Tilda Mazhande on allegations of defrauding former lawmaker Blessed Runesu Geza of US$1 362 000 in a land deal. Nyabadza who is being represented by Tazorora Musarurwa argued that the charge […]",
            "time": "21:06",
            "date": "08 Jan 2025"
        },
        {
            "title": "Man in court for raping daughter",
            "url": "https://www.herald.co.zw/man-in-court-for-raping-daughter/",
            "content": "Midlands Bureau\n\nA 54-year-old man from Mberengwa has appeared in court for allegedly raping his eight-year-old daughter.\n\nThe man appeared before Zvishavane regional magistrate Mr Tavengwa Sangster facing one count of rape.\n\nThe accused pleaded not guilty to the charge and was remanded in custody to January 17 for trial continuation.\n\nIt is alleged that sometime in December last year, the complainant was at home with her father and four-year-old sister.\n\nThe court heard that when the victim and her sister retired to bed their father followed them and forced the complainant to sleep on his bed, while the young sister slept on a mat on the floor.\n\nThe accused allegedly raped his daughter and threatened her with death if she reported the matter.\n\nThe complainant, however, narrated her ordeal to a neighbour in the morning, leading to the fathers arrest.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/09/fdcsd.jpg",
            "description": "Midlands Bureau A 54-year-old man from Mberengwa has appeared in court for allegedly raping his eight-year-old daughter. The man appeared before Zvishavane regional magistrate Mr Tavengwa Sangster facing one count of rape. The accused pleaded not guilty to the charge and was remanded in custody to January 17 for trial continuation. It is alleged that […]",
            "time": "21:06",
            "date": "08 Jan 2025"
        },
        {
            "title": "Space barons takeover Harare ranks as operators cry foul",
            "url": "https://www.herald.co.zw/space-barons-takeover-harare-ranks-as-operators-cry-foul/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nCOMMUTER omnibus operators in Harare are embroiled in a bitter feud with unlicenced individuals known as space barons who are extorting money from them at city ranks.\n\nThe operators claim these individuals who operate outside the law are exploiting a regulatory vacuum, pushing up transport costs and threatening the stability of the public transport sector.\n\nWe are being forced to pay twice for something we should not be paying for, lamented Mr Ngoni Katsvairo, secretary-general of the Greater Harare Association of Commuter Omnibus Operators (GHACO).\n\nThese space barons, who are not even the owners of the rank, are collecting money from our companies despite us already paying all the necessary fees to the Government and the council.\n\nThose who pay rent these places and pay rentals to council must contribute to the development of the ranks, not these individuals who do nothing but collect money.\n\nWe demand that the council take responsibility and remove these space barons who are making our work harder.\n\nMr Frederick Maguramhinga, president of the Zimbabwe United Deregulated Commuter Operators (ZUDCO) said they no longer have control over their vehicles.\n\nTouts are controlling everything, including the fares, which are rising arbitrarily and it is costing us dearly. When it rains, they double the fare, and we cannot even stop it because they have the power on the ground.\n\nPassengers Association of Zimbabwe (PAZ) national coordinator Mr Tafadzwa Goliati said their activities were corrupt, exploitative and lawless.\n\nThe authorities must take action and dismantle these networks. They are harming both operators and passengers alike.\n\nThe presence of space barons has created a chaotic and exploitative environment at Harares ranks, despite the city councils mandate to oversee their operation.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/hg-680x380.jpg",
            "description": "Ivan Zhakata Herald Correspondent COMMUTER omnibus operators in Harare are embroiled in a bitter feud with unlicenced individuals known as “space barons” who are extorting money from them at city ranks. The operators claim these individuals who operate outside the law are exploiting a regulatory vacuum, pushing up transport costs and threatening the stability of […]",
            "time": "21:06",
            "date": "08 Jan 2025"
        },
        {
            "title": "Supermodel Zimbabwe unveils 43 finalists in nationwide search",
            "url": "https://www.herald.co.zw/supermodel-zimbabwe-unveils-43-finalists-in-nationwide-search/",
            "content": "Peter Tanyanyiwa\n\nHerald Correspondent\n\nIn an exciting development for the fashion industry, Supermodel Zimbabwe has announced the selection of 43 finalists from a competitive pool of over 430 contestants who auditioned across six major cities: Bulawayo, Gweru, Masvingo, Mutare, Victoria Falls, and Harare.\n\nThis initiative aims to highlight the diverse talent within Zimbabwes modeling scene, contributing to the growth of the nations creative economy.\n\nThe auditions, which attracted between 50 and 100 contestants per city, showcased the vibrant potential in Zimbabwes fashion industry.\n\nCollaborating with industry professionals, including filmmakers and makeup artists, Supermodel has successfully created a platform that unites various facets of the fashion world.\n\nVoting for the Peoples Choice Award, with the announcement of the finalists, fans can now participate in voting for their favorite supermodels via SMS and USSD.\n\nEach contestant is assigned a unique voting code, and the winners of the Peoples Choice award for both male and female categories will be announced on March 1, 2025.\n\nSupermodel CEO Paidemoyo Chideya said that the team was really happy that the journey is finally almost over having gone to different cities in the selection process and they now have 43 finalists.\n\nWe are really excited as we have travelled to different cities and the selection process was not easy, it is a milestone that we are now down to 43 finalists, said Chideya.\n\nI need to remind people that this is more than just a modeling contest; it is a celebration of Zimbabwes rich creative talent.\n\nWe are committed to nurturing local models and enhancing the fashion ecosystem. Following the voting, 20 finalists will be selected to attend an intensive boot camp designed to equip them with skills in brand building, poise, and international self-representation. This program aims to prepare one exceptional supermodel to represent Zimbabwe on a global stage.\n\nThe supermodel initiative is designed not only to develop individual models but also to uplift the entire fashion ecosystem in Zimbabwe.\n\nBy partnering with local designers and creatives, the program promotes the Wear Zimbabwe campaign, encouraging support for indigenous fashion.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/06/Paidemoyo-Chideya.jpg",
            "description": "Peter Tanyanyiwa Herald Correspondent In an exciting development for the fashion industry, Supermodel Zimbabwe has announced the selection of 43 finalists from a competitive pool of over 430 contestants who auditioned across six major cities: Bulawayo, Gweru, Masvingo, Mutare, Victoria Falls, and Harare. This initiative aims to highlight the diverse talent within Zimbabwe’s modeling scene, […]",
            "time": "21:06",
            "date": "08 Jan 2025"
        },
        {
            "title": "The national handicraft sector is embracing sustainable economic growth in 2025",
            "url": "https://www.herald.co.zw/the-national-handicraft-sector-is-embracing-sustainable-economic-growth-in-2025/",
            "content": "Mutsawashe Mashandure\n\nHerald Correspondent\n\nWomen Affairs, Community and Small and Medium Enterprises Development Permanent Secretary Mavis Sibanda has underscored the critical role that the national handicraft sector and community heritage will play in fostering sustainable economic growth this year.\n\nAddressing the national handcraft centers strategic review and strategic plan workshop held on Monday at the Mandel Training Centre, Permanent Secretary Mavis Sibanda emphasised the need to develop the centres 2025 Annual Plan and to review the progress made in 2024.\n\nTo effectively develop and market handicrafts both locally and internationally, collaboration among the Ministry, the National Handicraft Development and Marketing Centre and all stakeholders is crucial, she said.\n\nThis collective effort will focus on creating strategic documents that will guide the centres initiatives in 2025, ensuring a clear and coordinated approach to promoting our handicrafts She applauded the Centre for its role in preserving Zimbabwes cultural identity.\n\nIts mandate is to collect, promote, and market crafts originating from Zimbabwe to a global audience. This includes the renowned Binga basket, among many other unique crafts from our communities.\n\nSpeaking at the same time, board chairperson of the Handcraft Centre, Ms Sandra Ndebele, highlighted that they are obliged to revive the profitable handicrafts industry under the Presidents vision that Zimbabwe is open for business .\n\nAs we aim to bring to fruition Vision 2030 of an upper-middle-income society, it is crucial that we collaborate closely with our parent ministry for policy guidance in order to fulfill the mandates that will be discussed in the coming days, she said\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2020/04/Dr-Mavis-Sibanda-680x380.jpg",
            "description": "Mutsawashe Mashandure Herald Correspondent Women Affairs, Community and Small and Medium Enterprises Development Permanent Secretary Mavis Sibanda has underscored the critical role that the national handicraft sector and community heritage will play in fostering sustainable economic growth this year. Addressing the national handcraft center’s strategic review and strategic plan workshop held on Monday at the […]",
            "time": "21:06",
            "date": "08 Jan 2025"
        },
        {
            "title": "Judgement day set for a human trafficking mastermind",
            "url": "https://www.herald.co.zw/judgement-day-set-for-a-human-trafficking-mastermind/",
            "content": "Prosper Dembedza\n\nHerald Correspondent\n\nThe trial of a suspected human trafficking mastermind, who reportedly paid a woman R25 000 in exchange for her two-day-old baby that she intended to smuggle to Australia, continued on Tuesday with the defence closing its case.\n\nJanet Marimo is facing human trafficking charges. She pleaded not guilty. The presiding magistrate Mr Donald Ndirowei deferred the matter to January 24 for judgement.\n\nInvestigations established that Marimo allegedly conspired with Pauline Maganga, the infants mother, to traffic the child to Australia.\n\nMaganga was jailed for 10 years in May this year at the Harare Magistrates Court for her part in the deal.\n\nMaganga told the court that she started to chat with Marimo on Facebook in connection with child adoption in March last year and was made to join the group administered by Marimo.\n\nIn that group, there were six active members all females, including myself, and it had two female members from South Africa, two females from the United States, Janet Marimo and myself, she said.\n\nMaganga said when she was six months pregnant she sent a message to the group informing the other members that she not in a position to look after herself and her unborn child due to lack of resources.\n\nAll the group members responded to my message. They were all willing to look after me during my pregnancy, to meet the hospital bills, and then take the child after birth for adoption, she said.\n\nMarimo then came to my inbox advising me that I must not give the other group members my child since they would take my child for organ donations. She emphasised that I was supposed to give her my child after birth and we agreed.\n\nMaganga told the court that on June 27 last year, she went to Far East Hospital in Johannesburg to deliver her child and this is where she met Marimo physically for the first time.\n\nSince I was a foreigner I was supposed to pay R2 800 for the hospital bills to be given the childs birth card and birth record. Marimo gave me R1 000 to pay on the day and the balance of R1 800 was supposed to be paid by the end of July.\n\nI was only given the childs birth card and I was told that I would collect the childs birth record after paying the balance, she explained to the court.\n\nAfter the childs birth, Maganga agreed that Marimo would pay her R25 000 and then take the child for adoption, an obligation that was fulfilled.\n\nAccording to prosecutor Mr Tendai Tapi, the arrangement was for Maganga to obtain the babys birth certificate by October 29, but she did not fulfil this requirement.\n\nThis situation led Marimo bringing the baby to Zimbabwe illegally. She was apprehended in Waterfalls on November 27.\n\nUpon learning of Marimos arrest, Maganga returned to Zimbabwe on December 12. The child is now in the care of the Department of Social Welfare.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/courthammer-680x380.jpg",
            "description": "Prosper Dembedza Herald Correspondent The trial of a suspected human trafficking mastermind, who reportedly paid a woman R25 000 in exchange for her two-day-old baby that she intended to smuggle to Australia, continued on Tuesday with the defence closing its case. Janet Marimo is facing human trafficking charges. She pleaded not guilty. The presiding magistrate […]",
            "time": "21:06",
            "date": "08 Jan 2025"
        },
        {
            "title": "Harare municipal police bust vendor selling fake groceries on city streets",
            "url": "https://www.herald.co.zw/harare-municipal-police-bust-vendor-selling-fake-groceries-on-city-streets/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nHARARE Municipal Police has arrested a vendor selling counterfeit and expired groceries at the intersection of Rezende Street and Robert Mugabe Road.\n\nThe individual, identified as Bornwell Dirwai, was caught peddling repackaged goods that posed a potential health risk to unsuspecting consumers.\n\nIn a statement, the City of Harare said the seized products included milk repackaged in South African-branded containers, margarine placed in Buttercup containers and products marked under the Zimgold label.\n\nThe council has confirmed that most of the groceries were expired and not fit for human consumption.\n\nThe vendor has been arrested for selling substandard and unsafe goods, read the statement.\n\nThese repackaged products, some of which are expired, pose a serious health risk. We urge residents to be vigilant when making their purchases.\n\nConsumers should ensure that they are purchasing from verified sources to protect themselves from the hazards posed by counterfeit goods.\n\nThe arrest comes as part of ongoing efforts to curb the spread of fake goods on Harares streets.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Screenshot-9-680x380.png",
            "description": "Ivan Zhakata Herald Correspondent HARARE Municipal Police has arrested a vendor selling counterfeit and expired groceries at the intersection of Rezende Street and Robert Mugabe Road. The individual, identified as Bornwell Dirwai, was caught peddling repackaged goods that posed a potential health risk to unsuspecting consumers. In a statement, the City of Harare said the […]",
            "time": "21:06",
            "date": "08 Jan 2025"
        },
        {
            "title": "Maswanhise named Motherwell Player of the Month",
            "url": "https://www.herald.co.zw/maswanhise-named-motherwell-player-of-the-month/",
            "content": "Tadious Manyepo\n\nSports Reporter\n\nIT keeps on getting better and better for Warriors winger Tawanda Maswanhise who has just been named the Motherwell Player of the Month for December.\n\nThe youngster has taken the Scottish Premiership by storm and is a consistent performer for his team.\n\nHe was in terrific form throughout December and the club duly rewarded him. Maswanhise has done well since joining the club on a two-year contract from Leicester City and he has made 17 appearances, hitting the target five times with the latest goal coming four days ago when he helped Motherwell beat Aberdeen 2-0.\n\nSpeaking about the award, Maswanhise said: My confidence is at an all-time high, which I think has given me an extra edge on the pitch.\n\nWe have navigated a testing time well as a team, and I am glad I can contribute. My thanks go to all the fans for their support.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Screenshot-8-680x380.png",
            "description": "Tadious Manyepo Sports Reporter IT keeps on getting better and better for Warriors winger Tawanda Maswanhise who has just been named the Motherwell Player of the Month for December. The youngster has taken the Scottish Premiership by storm and is a consistent performer for his team. He was in terrific form throughout December and the […]",
            "time": "21:06",
            "date": "08 Jan 2025"
        },
        {
            "title": "Zimbabwe’s tobacco industry anticipates promising season",
            "url": "https://www.herald.co.zw/zimbabwes-tobacco-industry-anticipates-promising-season/",
            "content": "Precious Manomano\n\nHerald Reporter\n\nOne of the countrys major foreign currency earner, the tobacco industry, is gearing up for a promising season after farmers increased the area under the golden leaf to 84 661 hectares, surpassing last years 82 392 hectares.\n\nKnown for its high-quality leaf production, tobacco remains one of Zimbabwes most significant non-food crops, earning the country between US$800 million and US$1 billion annually.\n\nWith a focus on improving productivity, farmers are optimistic about achieving their annual target of 300 million kilograms this season.\n\nThe latest statistics from the Ministry of Lands, Agriculture, Fisheries, Water, and Rural Development reveal a dynamic shift across various regions.\n\nMashonaland Central has taken the lead with 30 459 hectares, an increase from 26 862 hectares last season.\n\nIn contrast, Mashonaland West has planted 21 837 hectares, a decline from 25 773 hectares last year.\n\nMashonaland East recorded a modest increase to 15 937 hectares from 15 802 hectares, while Manicaland has also increased its area under the crop to 16 358 hectares, up from 13 899 hectares.\n\nMasvingo remains stable at 17 hectares, and the Midlands has grown to 53 hectares, up from 39 hectares.\n\nOf the 84 661 hectares under tobacco, 18 595 hectares are under irrigation and the remaining 66 068 hectares is dependent on the rains.\n\nHarvesting of early-planted tobacco has commenced, and farmers are optimistic about the overall condition of their crops.\n\nHowever, challenges remain. Tobacco Farmers Union Trust president Mr Edward Dune cautioned that this years leaf is compromised in terms of weight due to recent challenges.\n\nHarvesting is going on well. We expect the marketing season to commence early, he said. We faced issues where farmers had to replant seedlings lost to a heatwave that affected the whole country. If we continue receiving rains, we remain positive about meeting our annual target.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/06/logo_tobacco-industry-marketing-board-timb_2-1-680x380.png",
            "description": "Precious Manomano Herald Reporter One of the country’s major foreign currency earner, the tobacco industry, is gearing up for a promising season after farmers increased the area under the golden leaf to 84 661 hectares, surpassing last year’s 82 392 hectares. Known for its high-quality leaf production, tobacco remains one of Zimbabwe’s most significant non-food […]",
            "time": "21:06",
            "date": "08 Jan 2025"
        },
        {
            "title": "Police intercepts armed robbers",
            "url": "https://www.herald.co.zw/police-intercepts-armed-robbers/",
            "content": "Crime Reporter\n\nPolice in Harare on Tuesday arrested three robbers aged between 18 and 21 while they were robbing two people.\n\nThe trio had allegedly stolen three cellphones and US$30. National police spokesperson Commissioner Paul Nyathi said, On January 7, 2025, police in Harare reacted swiftly to a report of robbery and arrested Maxwell Tembo (21), Oscar Marowa (19) and Ngonidzashe Maxen (18) for attacking two complainants before stealing three cellphones and US$30. The arrest led to the recovery of the stolen cellphones and cash.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2020/11/PAUL-NYATHI.jpg",
            "description": "Crime Reporter Police in Harare on Tuesday arrested three robbers aged between 18 and 21 while they were robbing two people. The trio had allegedly stolen three cellphones and US$30. National police spokesperson Commissioner Paul Nyathi said, “On January 7, 2025, police in Harare reacted swiftly to a report of robbery and arrested Maxwell Tembo […]",
            "time": "21:06",
            "date": "08 Jan 2025"
        }
    ]
}