{
    "news": [
        {
            "title": "Zim, China key projects take shape",
            "url": "https://www.herald.co.zw/zim-china-key-projects-take-shape/",
            "content": "Zvamaida Murwira\n\nSenior Reporter\n\nZIMBABWE and China have started implementing projects agreed upon last year by President Mnangagwa and his counterpart, President Xi Jinping, during a State visit to the Asian country, as the two countries continue to broaden bilateral relations.\n\nPresident Mnangagwa visited China in September last year where he also attended the Forum on China-Africa Co-operation (Focac), resulting in the signing of 17 Legal Instruments of Co-operation that included 14 Memoranda of Understanding (MoUs) and three Letters of Exchange.\n\nFurther, the Chinese leadership undertook to broaden and deepen collaboration with Zimbabwe across sectors such as investment, trade, infrastructure development, mineral extraction, renewable energy and digital economy growth.\n\nPresident Mnangagwa yesterday hosted a Chinese delegation led by the Executive Vice Governor of Jiangsu Province, Mr Ma Xin, which was one of the provinces President Mnangagwa visited during his State visit to China.\n\nThe discussions centred on a range of issues that mutually affect the two countries.\n\nBriefing journalists on behalf of Vice Governor Mr Ma, Head of Chancery in the Chinese Embassy to Zimbabwe, Mr Cheng Yan, said the delegation came to commit themselves to the agreements made by the two leaders.\n\nIt is our great honour to have the delegation pay a courtesy call on His Excellency President Emmerson Mnangagwa, said Mr Cheng.\n\nAs we all know, we received His Excellency President Mnangagwa last year when he made a very important State visit to China and attended the Focac Summit.\n\nSo, this visit by the provincial delegation is a follow-up action to implement the important consensus reached by the two Heads of State. The delegation is coming to commit itself to strengthen and deepen co-operation with Zimbabwe, especially in areas such as infrastructure, biomedicine, and solar power supply, which is a very strong area of Jiangsu province.\n\nMr Cheng said Jiangsu province is the second biggest provincial economy in China after Guangdong.\n\nHe said there were good prospects of expanding co-operation in many areas for the good of the two countries.\n\nSo, we believe there is a lot of potential to deepen our collaboration and co-operation with Zimbabwe. And we are looking forward to more and more detailed fruits between Jiangsu province and Zimbabwe-lined ministries and local government. This kind of co-operation has very good prospects, Mr Cheng said.\n\nDuring his visit to China, President Mnangagwa met the Communist Party of China (CPC) Secretary for Jiangsu Province, Xin Changxing and attended other business engagements.\n\nHe also visited the city of Shenzhen, in Guangdong Province, another economic hub of technology.\n\nPresident Mnangagwa also went to Hunan Province, where he visited the home of Chinese founding father Mao Zedong and toured the factory of the Sany Group, a world leader in heavy construction machinery.\n\nHe later on met Chinese Communist Party Committee Secretary of Hunan Cde Shen Xiaoming.\n\nThe President wound up his visit to Hunan by visiting a model rural village.\n\nDuring the State visit, President Mnangagwa also attended the high-level meeting on State Government and made a presentation in which heoutlined his vision of an independent development path for Africa and the Global South, without undue foreign influence, and called for the removal of sanctions on Zimbabwe.\n\nHe also attended the 8th Conference of Chinese and African Entrepreneurs, at which he delivered a speech marketing the countrys vast business opportunities.\n\nIn his remarks, President Xi said China stands ready to co-operate with Zimbabwe.\n\nUnder President Mnangagwas leadership, Zimbabwe has witnessed a significant surge in trade with China.\n\nNotably, Chinese private sector investments in Zimbabwe have grown exponentially from US$445,9 million in 2019 to a substantial US$3,4 billion in 2023, representing a remarkable seven-fold increase.\n\nIn recent years, China has invested heavily in Zimbabwe, committing over US$2,2 billion to multi-billion dollar projects primarily in mining and manufacturing.\n\nThe investments include the US$1,5 billion Manhize Dinson Iron and Steel project, the Afrochine Ferrochrome Smelters, the Sinomine Resources, Zhejiang Huayon Cobalt and Chengxin Lithium Group, among others.\n\nTo date, more than 472 investment licenses have been issued to Chinese companies, with more in the pipeline.\n\nChinas support has solidified its position as Zimbabwes all-weather friend, with bilateral ties yielding significant benefits that also include concessional funding for projects in energy, telecommunications, agriculture, defence, and health.\n\nThe construction of Hwange Thermal Power Station Units 7 and 8 and Kariba South Hydro Power are some of the signature projects that have cemented co-operation between the two countries.\n\nThere is also Zimbabwes magnificent new Parliament building constructed through a Chinese grant in Mount Hampden.\n\nYesterdays event was attended by Foreign Affairs and International Trade Minister Professor Amon Murwira, Transport and Infrastructural Development Deputy Minister Joshua Sacco and other senior Government officials.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/23f2f24f-680x380.jpg",
            "description": "Zvamaida Murwira Senior Reporter ZIMBABWE and China have started implementing projects agreed upon last year by President Mnangagwa and his counterpart, President Xi Jinping, during a State visit to the Asian country, as the two countries continue to broaden bilateral relations. President Mnangagwa visited China in September last year where he also attended the Forum […]",
            "time": "06:10",
            "date": "15 Apr 2025"
        },
        {
            "title": "President’s pro-people policies resonate with other countries",
            "url": "https://www.herald.co.zw/presidents-pro-people-policies-resonate-with-other-countries/",
            "content": "Wallace Ruzvidzo\n\nHerald Reporter\n\nPRESIDENT Mnangagwas mantras, Nyika inovakwa nevene vayo (a country is built by its people) and leaving no one and no place behind have gained traction outside the countrys borders and are being embraced by other African countries, outgoing Angolan Ambassador to Zimbabwe Agostinho Tavares has said.\n\nThe diplomat yesterday paid a courtesy call on the President at State House in Harare to bid him farewell following the conclusion of his tenure in Zimbabwe.\n\nIn an interview after their closed-door meeting, Ambassador Tavares reaffirmed Angolas support of Zimbabwes current development thrust.\n\nI wish all the best to the people of Zimbabwe and I told the President that I learned many, many things here in Zimbabwe . . . Leaving no one and no place behind and Nyika inovakwa nevene vayo.\n\nWe support Zimbabwe, he said.\n\nAmbassador Tavares said with President Mnangagwa as Chairperson, Sadc was in safe hands.\n\nThe Angolan envoy continues to assure all and sundry of President Mnangagwas capability to lead the region.\n\nI believe that taking into account the experience and the pragmatism of His Excellency Dr Emmerson Dambudzo Mnangagwa, the Sadc Chairmanship is in good hands, it is in safe hands with President Mnangagwa, he said.\n\nOn relations between Harare and Luanda, Ambassador Tavares said they continued on an upward trajectory since the days of Zimbabwes struggle for independence.\n\nLast year, the two countries signed 11 Memorandums of Understanding (MoUs) in various fields including agriculture, higher education, justice and housing, as relations continue to deepen.\n\nThe MoUs were signed in Luanda, Angola, during the Second Session of the Joint Permanent Commission on Cooperation (JPCC) between Zimbabwe and Angola, which came 32 years after the last meeting.\n\nAs you know, Angola and Zimbabwe, we have very historical and excellent relations between these two countries since the liberation struggle.\n\nZimbabwe and Angola are sistercountries and during my five years here, last year in May, we finally had the second session of bilateral cooperation between the two countries and we signed 11 legal instruments in different areas to strengthen the bilateral relationship between two countries.\n\nWe signed, memorandums of understanding between Angola and Zimbabwewe signed the legal instrument for cultural cooperation, sport cooperation, higher education and science and technology, just to mention a few, said Ambassador Tavares.\n\nHe said he had enjoyed his tenure in Zimbabwe, adding that President Mnangagwa had wished him good fortunes at his next posting in Cape Verde.\n\nThe Ambassador said President Mnangagwa had also sent his greetings to Angolan President Joo Loureno.\n\nI enjoyed my stay in ZimbabweI choose Zimbabwe as my second home now. He (the President) wished me a very good mission in another post where I am going now. I am going to Cape Verde, a Portuguese-speaking country and he wished all the best and good health to President Joo Loureno and to continue to strengthen the relations between Angola and Zimbabwe, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/f3f32f-680x380.jpg",
            "description": "Wallace Ruzvidzo Herald Reporter PRESIDENT Mnangagwa’s mantras, “Nyika inovakwa nevene vayo” (a country is built by its people) and “leaving no one and no place behind” have gained traction outside the country’s borders and are being embraced by other African countries, outgoing Angolan Ambassador to Zimbabwe Agostinho Tavares has said. The diplomat yesterday paid a […]",
            "time": "06:10",
            "date": "15 Apr 2025"
        },
        {
            "title": "Harare ratepayers to pay for council’s wrongful building approval",
            "url": "https://www.herald.co.zw/harare-ratepayers-to-pay-for-councils-wrongful-building-approval/",
            "content": "Trust Freddy\n\nCheck Point Desk\n\nHARARE residents will be responsible for covering compensation costs owed to the owner of a double-storey building along Alpes Road in Vainona suburb, which is set for demolition.\n\nThis follows the unlawful approval of the structure by council officials despite the fact that it infringes on the frontage line and extends onto Alpes Road.\n\nThe Herald has reported that council officials have been secretly selling off land designated for vital public use, such as roads, schools, hospitals and wetlands to private interests.\n\nThe total amount of money to be paid is still to be established.\n\nSituated at the corner of Alpes and Grant roads, the building has been condemned by council after it admitted to making an error in its approval and ordered its demolition.\n\nHarare City Council acting director of Urban Planning, Mr Samuel Nyabezi, confirmed that council erred in approving the structure.\n\nThe building has no demolition order yet, but its fate is sealed; it will be demolished, Mr Nyabezi said.\n\nThe challenge lies in the fact that the building has city council approved plans, but it will still be demolished. The issue of compensating the owner will be addressed later if council is found liable, given that the plans were approved by the city authorities.\n\nHe further criticised council building inspectors for approving plans without due diligence.\n\nInspections were conducted by our building inspectors, but its clear that some of them failed to think critically. They seem to have a narrow focus on building codes, lacking the skills to scrutinise and analyse the plans.\n\nInstead of thoroughly reviewing each project, they simply approve every plan they receive with a stamp, neglecting to compare the approved plans with the actual site conditions.\n\nWhen The Herald visited the site, it was evident that the building was near-completion, with most aspects finished, including tiling, save for painting.\n\nThe double-storey building measures approximately 35 metres by 15 metres, with the ground floor divided into two large rooms and the first floor subdivided into smaller rooms that appear to be offices.\n\nAlthough the building remains unoccupied, a caretaker residing in a cabin on the property reported having lived there for over seven years.\n\nThis publication also observed that the buildings proximity to the main road, less than four metres away, makes it impractical to install a precast wall, as its foundation would extend onto the road.\n\nAdditionally, a plumbing pipe, possibly for a borehole, occupies the limited space between the building and the road, hindering off-road parking.\n\nWhen contacted for comment, the owner of the building, Mr Allen Shonhiwa, maintained that all procedures were followed and everything was done transparently.\n\nI am yet to be formally informed by the City Council regarding any demolition. I am hearing this for the first time from you, he said.\n\nHowever, what I do know is that everything was done above board. I was also approached by the Commission investigating the City of Harare affairs regarding this issue, but I have not received any communication from the City Council itself.\n\nMr Shonhiwa added that he acquired the stand 15 years ago, explaining that he had been delaying developing the piece of land over the years.\n\nHe also pointed out that the open space surrounding the building contains several other undeveloped stands, stating that upon completion, the area will be transformed into a shopping mall.\n\nMr Shonhiwa said his two-story structure was appropriately located, emphasising that commercial properties should not be subjected to the same criteria as the adjacent residential houses.\n\nThats a commercial building, and precast walls are not typically used for commercial properties. Like other commercial buildings in Harare, the foundation is usually positioned exactly where the stand ends.\n\nFor your information, there are several other commercial stands in the area, including schools and shops that are yet to be built, and upon completion, it will effectively become a shopping complex.\n\nHe also alleged that at one point, he was approached by the Ministry of Transport and Infrastructural Development, which threatened to demolish the building while they were constructing the road.\n\nIf I had built without approved plans, demolition would have been the likely outcome. In fact, some Ministry of Transport officials initially threatened to demolish the building, as youre suggesting. This was three to four years ago during the road construction, and the building still stands. The same officials were later corrected by the Surveyor General, who informed them that their assessment was incorrect.\n\nMr Shonhiwa declined to disclose the construction cost, expressing confidence that the council would not demolish the building without a court order.\n\nHe cited the example of Sam Levy Village in Borrowdale, claiming that similar threats were made, implying that such actions would be unlawful without proper judicial oversight.\n\nPosting on his official X account on July 6 last year, Harare Mayor Jacob Mafume described the building as an eyesore, adding that it ought to be demolished.\n\nThat building is an eyesore, he wrote.\n\nI have asked that it be demolished for some time. The mandarins in our office find excuses why we cant demolish it.\n\nThey somehow approved it following the new area plan. They insist it complies with the law. The courts are being approached to resolve this.\n\nHowever, it has been almost a year now, and council is yet to make its official position public.\n\nSeveral senior council officials, including the Mayor himself, who appeared before the Justice Maphios Cheda-led commission, admitted that they had erred in approving the plan.\n\nAn official in the planning department said the only alternative would be to realign the road if the owner is well-resourced.\n\nCombined Harare Residents Association director Mr Reuben Akili said those responsible should face consequences, suggesting compensation be deducted from their salaries.\n\nIn fact, this confirms our assertion that approved buildings or land are supposed to be built with safety in mind. However, this situation also exposes the level of gross incompetence within the city officials, especially those in the planning division. Those who approved the project should also bear the consequences of their actions; that money should be deducted from their salaries.\n\nVainona resident Mr Munyaradzi Mudimu highlighted the potential danger the building poses to occupants.\n\nPeople should just apply common sense. The building was constructed beyond the building or frontage line and extends significantly onto the road verges, putting occupants in danger.\n\nAny slight mistake by a vehicle veering off the road could result in it crashing into the building, he said.\n\nAnother resident Ms Caroline Kamanga raised suspicions about the circumstances surrounding the buildings approval adding the blunder indicates possible underhand dealings and warrants a thorough investigation.\n\nThat should be a symbol of corruption. How did it pass all the building inspections from plan to drainage?\n\nEfforts to obtain a comment from the Mayor of Harare were unsuccessful as his phone went unanswered.\n\nMeanwhile, council spokesperson Mr Stanley Gama said he was still reviewing the questions, despite them having been sent two days earlier.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/07/US-dollars.jpg",
            "description": "Trust Freddy Check Point Desk HARARE residents will be responsible for covering compensation costs owed to the owner of a double-storey building along Alpes Road in Vainona suburb, which is set for demolition. This follows the unlawful approval of the structure by council officials despite the fact that it infringes on the frontage line and […]",
            "time": "06:10",
            "date": "15 Apr 2025"
        },
        {
            "title": "Procedures for compliance with city regulations",
            "url": "https://www.herald.co.zw/procedures-for-compliance-with-city-regulations/",
            "content": "A property developer intending to construct a house should first seek the services of a registered architect, who will design the house plan.\n\nThe plan can be of any design that the developer wants, but the architect should be able to moderate it so that if fits the requirements of the city council. When the plan is complete, the developer should take it to the councils district office for onward forwarding to Cleveland House in the city centre, where the citys architects and planners are housed.\n\nAt Cleveland House, officers from various departments including health and fire, sit and discuss whether or not the plan complies with the citys requirements. The chief building inspector makes a final assessment and issues an approval of building plans to the applicant.\n\nA building form is issued which contains a commencement of work notice that must be submitted by the applicant once the footings are ready for inspection. Subsequently, all phases of the construction must be approved by the building inspectorate.\n\nIf there are no problems with the plan, it should be approved within a minimum period of two weeks. The cost of submitting and having the plan approved is one percent of the estimated cost of constructing the house.\n\nIf there are no problems with the plan it should be approved within a minimum period of two weeks. The cost of submitting and having the plan approved is one percent of the estimated cost of constructing the house.\n\nShould construction works commence prior to the approval of the building plans, the local authority imposes a regularisation fee or fine. A final inspection will occur only if specifically requested and is required for obtaining the occupancy permit.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/10/regulations_2.jpg",
            "description": "A property developer intending to construct a house should first seek the services of a registered architect, who will design the house plan. The plan can be of any design that the developer wants, but the architect should be able to moderate it so that if fits the requirements of the city council. When the […]",
            "time": "06:10",
            "date": "15 Apr 2025"
        },
        {
            "title": "Govt pledges industrial recovery support",
            "url": "https://www.herald.co.zw/govt-pledges-industrial-recovery-support/",
            "content": "Tapiwanashe Mangwiro\n\nThe Government has pledged to continue aiding the manufacturing sector through policies that are in line with the national vision and push for increased industry capacity utilisation.\n\nAddressing delegates at the launch of the Confederation of Zimbabwe Industries (CZI) Manufacturing Sector Survey 2024 Report, Industry and Commerce Permanent Secretary Dr Thomas Utete Wushe, speaking on behalf of Minister Mangaliso Ndlovu, described the sector as a critical driver of job creation and a key pillar in the nations march towards Vision 2030.\n\nHeld under the theme, Two sides of the same coin: Low-capacity utilisation and excess idle capacity, the CZI report painted a mixed picture of modest sectoral contraction balanced by pockets of high performance, rising manufactured exports, and encouraging employment trends.\n\nDespite the challenges, new permanent jobs constituted about 14 percent of total employment in 2024, Dr Wushe said.\n\nThis is a testament to the sectors ongoing ability to absorb labour, even as casualisation rates have risen to 30 percent.\n\nNewer firms, particularly those established within the last five years, were notable standouts, recording a 14 percent increase in output. Large firms also grew output by 8 percent, while the sector as a whole declined by just 0,5 percent, a performance Dr Wushe described as proof of industrial resilience.\n\nThis progress has been made against the backdrop of macroeconomic volatility and an evolving monetary landscape.\n\nThe launch of the new local currency, ZiG, in April 2024 brought temporary stabilisation, though inflation spiked to 37,2 percent by October before subsiding to 3,7 percent by December. Still, annual US dollar inflation averaged only 2,7 percent in 2024, down significantly from 8 percent in 2023.\n\nA big thumbs up to fiscal and monetary authorities for the relative stability we have been experiencing over the past months, Dr Wushe said.\n\nExport performance emerged as another bright spot. Manufactured exports surged from US$324,8 million in 2021 to US$448,7 million in 2023, before registering US$432 million in 2024, evidence of rising competitiveness in the face of global headwinds.\n\nGovernment intends to encourage firms to explore export markets, reducing dependence on local demand and better utilising their production capacity, Dr Wushe stated.\n\nHowever, he acknowledged that only 5 percent of total output was exported in 2024 and just 29 percent of manufacturers felt prepared to compete in the African Continental Free Trade Area (AfCFTA), underlining the need for targeted support.\n\nTo bridge this gap, Government is implementing the Zimbabwe Industrial Reconstruction and Growth Plan (ZIRGP), a transitional framework running through December 2025 that emphasises retooling, financing, infrastructure improvement, and value chain integration.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Untitled-59-680x380.jpg",
            "description": "Tapiwanashe Mangwiro The Government has pledged to continue aiding the manufacturing sector through policies that are in line with the national vision and push for increased industry capacity utilisation. Addressing delegates at the launch of the Confederation of Zimbabwe Industries (CZI) Manufacturing Sector Survey 2024 Report, Industry and Commerce Permanent Secretary Dr Thomas Utete Wushe, […]",
            "time": "06:10",
            "date": "15 Apr 2025"
        },
        {
            "title": "Tshabangu wins legal battle",
            "url": "https://www.herald.co.zw/tshabangu-wins-legal-battle/",
            "content": "Fidelis Munyoro\n\nChief Court Reporter\n\nCCC interim secretary-general Sengezo Tshabangu has won his case against the Welshman Ncube-led faction of the opposition political party and its disciplinary committee.\n\nThe High Court, presided over by Judge President Mary Dube, last week ruled in his favour, declaring that the committees actions against him were unlawful and void.\n\nSenator Tshabangu had been expelled from the party following a disciplinary hearing held on February 12, 2025.\n\nHe argued that the disciplinary committees members had no authority to act, as their terms of office had expired on May 27, 2024, in accordance with the CCC constitution.\n\nJustice Dube found that the terms of office for the office bearers and main organs elected at the Gweru Congress in May 2019 had expired.\n\nThe term of office of the first to fourth respondents and main organs elected on 26 May 2019 at the Gweru Congress, save for its Parliamentary Caucus and Local Government Caucus as set out in Article 6 of its Constitution, expired on 27 May 2024 and hold office unlawfully, she said.\n\nThe judge concluded that any decisions made by these office bearers, including Sen Tshabangus expulsion, were invalid.\n\nSen Tshabangu had also argued that the disciplinary process was fundamentally flawed, citing issues such as improper notice, bias, and the lack of a properly constituted committee.\n\nThe court found the disciplinary process to be illegal and declared it null and void.\n\nThe entire disciplinary process constituting the disciplinary committee that sat at number 60A Hibiscus Road, Lochnivar, Southerton, Harare on 12 February 2025 to deliberate and decide on allegations of misconduct levelled by the fifth respondent against the applicant be and are hereby declared null and void and are set aside, Justice Dube said.\n\nThe court addressed procedural issues raised by the respondents, including the claim that Sen Tshabangu had delayed in filing his application.\n\nIt found that Sen Tshabangu acted promptly after learning of the disciplinary ruling on February 19, 2025, filing his application by February 24, 2025.\n\nJustice Dube said: The applicant did act when the need to act arose and within a reasonable time after the conduct impugned occurred and did not delay in seeking recourse.\n\nThe court also ruled on the authority of Prof Ncube, who had deposed the opposing affidavit on behalf of the CCC.\n\nJustice Dube found that Prof Ncube lacked proper authorisation, as no valid resolution gave him the authority to represent the party.\n\nThe resolution does not speak to the authority of the deponent to the opposing affidavit to depose to it, she said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Sengezo-Tshabangu-680x380.jpg",
            "description": "Fidelis Munyoro Chief Court Reporter CCC interim secretary-general Sengezo Tshabangu has won his case against the Welshman Ncube-led faction of the opposition political party and its disciplinary committee. The High Court, presided over by Judge President Mary Dube, last week ruled in his favour, declaring that the committee’s actions against him were unlawful and void. […]",
            "time": "06:10",
            "date": "15 Apr 2025"
        },
        {
            "title": "Pinjisi signs heavenly contract",
            "url": "https://www.herald.co.zw/pinjisi-signs-heavenly-contract/",
            "content": "Trust Khosa\n\nZimpapers Arts & Entertainment Hub\n\nTATENDA Spanner Boy Pinjisi, was renowned for his unique style of soft sungura, expertly blended laid-back rhythms with crisp vocals that set him apart from others.\n\nThis authenticity distinguished him from most artistes of his generation, who often resort to imitation.\n\nHis bravery in inventing his own sound made him a creative genius among his contemporaries.\n\nWith a vibrant sense of humour and a contagious laugh, he effortlessly connected with everyone around him, becoming a beloved figure in any social circle.\n\nDuring jam sessions at City Sports Bar in Harare, Pinjisi was hard to miss whenever he was around.\n\nWhether he was on stage or not, he would always come to support fellow musicians.\n\nOf course, he loved ciders, with Savanna Premium being his favourite.\n\nThis writer had the privilege of sharing drinks with him on countless occasions, and he was truly a fine young man.\n\nRemarkably, he never showed any signs of drunkenness, even after downing one too many.\n\nI first met Tatenda around 2015, when he gained fame with his hit track Saina, which made him a household name.\n\nA man of many talents, Pinjisi also felt a calling to serve God.\n\nHis untimely death has plunged the arts sector and indeed the whole nation into mourning.\n\nOn Sunday, he succumbed to multiple fractures sustained in a car accident along the Bulawayo highway, just after the Norton Tollgate.\n\nAt only 34 years old, Pinjisi was destined for greatness and its heartbreaking to note that he has passed away in the prime of his life.\n\nHis burial is set for Kahwa Village in Mutoko on Wednesday and many hope that his talent wont be interred with his remains.\n\nMusicians of his calibre are hard to come by, and only God knows what the future holds without Pinjisi. While we may not have him physically, his music will live on to inspire future generations.\n\nJust last year, he launched his sixth album, Varidzi Vebasa, which chronicled his battle with drugs.\n\nHe was never shy about sharing how he once became a slave to addiction.\n\nPinjisi, who started using drugs during the COVID-19-induced lockdown, shared his story as a genuine warning to youngsters not to indulge in drugs.\n\nAs a role model, he took this brave stance to warn society about the dangers of drug use.\n\nDuring the COVID-19 pandemic, drug abuse was rampant among the youth. I confess that I was a victim of marijuana, mutoriro, and other drugs.\n\nI began visualising things creeping on my back, feeling unbelievable energy, seeing daylight during the night and the opposite during the day. It is now over, and that is why I am honestly coming back to you to confess. That is why I wrote the song Mutoriro, whose lyrics will leave parents shedding tears, narrated Pinjisi in an interview with H-Metro last year.\n\nIn the same interview, he also confessed to having lied about being a pastor, despite being spotted preaching on street corners.\n\nI lied that I had abandoned sungura for Christianity; I then quarantined myself, praying to Jesus in privacy, without any church. I have started these anti-drug abuse shows because Kadoma had a victim who used a knife to cut his stomach while under the influence of drugs, he said in the same interview.\n\nNow that he is gone, Pinjisi, like any other man, had his flaws.\n\nHe may have gone to meet the maker, but his legacy wont be tainted by a few shenanigans in his life.\n\nThe good thing about him is that he was brave enough to share his problems with the world.\n\nOn several occasions, we have seen men die in silence, and its quite a shame that many of them have become fragile.\n\nEach time we met, he reflected on his past as a rookie, expressing how he moved from one band to another in search of opportunities.\n\nHe would recall how his journey started in the back of beyond before he came to Harare in 2007 to work with Gift Amuli at Zvishavane Sounds.\n\nHe was always with his cousin, Howard Pinjisi, journeying together in search of new opportunities in showbiz.\n\nPinjisi would narrate how he left Zvishavane Sounds to become a session artist with several bands.\n\nIn 2015, he bravely formed his own ensemble, The Holy Super Sounds, and recorded his debut album, Rumbidzo Kumusiki, which included the hit Saina.\n\nHe went on to release several albums, but his debut album, like the first cut, was deeper. It carried him to where he was at the time of his death.\n\nAccording to his profile, Pinjisi was born in Mutoko on August 7, 1991 and was raised in the village where he received his education. His career and love for music began while he was still in primary school.\n\nDetermined to hone his skills, he once worked with his cousin Howard Pinjisi at Umbiridzo Express, where he was mentored and perfected his craft.\n\nHe was a chart-topper who left a trail of success, featuring on every disc jockeys playlist on radio stations.\n\nThe sad reality is that Pinjisi has signed off at the tender age of 34.\n\nIt can only be part of Gods plan, which we may not understand, but the young man was in a league of his own.\n\nHe is now singing with angels in heaven after a career cut short by the cruel hand of death, which has snatched him away.\n\nHis journey was not just about music; it was about resilience, hope, and the power of redemption. May his soul rest in peace!\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/2DDD-680x380.jpg",
            "description": "Trust Khosa Zimpapers Arts & Entertainment Hub TATENDA “Spanner Boy” Pinjisi, was renowned for his unique style of “soft sungura,” expertly blended laid-back rhythms with crisp vocals that set him apart from others. This authenticity distinguished him from most artistes of his generation, who often resort to imitation. His bravery in inventing his own sound […]",
            "time": "06:10",
            "date": "15 Apr 2025"
        },
        {
            "title": "Zim unveils Indigenous Higher Education System",
            "url": "https://www.herald.co.zw/zim-unveils-indigenous-higher-education-system/",
            "content": "Remember Deketeke\n\nHerald Correspondent\n\nGOVERNMENT yesterday launched DuraIsiphala263, a locally-designed Higher Education Management Information System (HEMIS), aimed at transforming data analysis and decision-making in education and manpower planning.\n\nHigher and Tertiary Education, Innovation, Science and Technology Development Minister Dr Frederick Shava described the system as a response to President Mnangagwas vision for an innovation and knowledge-driven economy by 2030, which will serve as a central repository for data from all higher and tertiary education institutions.\n\nDuraIsiphala263 is a home-designed and home-made system that answers the call by His Excellency to become an upper-middle-income economy through innovation and modernisation, he said.\n\nThe launch was attended by Skills Audit and Development Minister Professor Paul Mavima, Information Communication Technology, Postal and Courier Services Deputy Minister Dingumuzi Phuti and Higher and Tertiary Education, Innovation, Science and Technology Development permanent secretary Professor Fanuel Tagwira, among other senior Government officials.\n\nThe system collects programme data, student records, graduate information and employee statistics, while it provides summary statistics at this stage.\n\nMinister Shava said this will allow policymakers to forecast manpower needs and align education programmes with national economic demands.\n\nPredicting the future of higher education requires modern analytics tools, which DuraIsiphala263 provides, he said.\n\nWe can now analyse, predict, and plan with increased confidence the manpower landscape in Zimbabwe.\n\nMinister Shava also revealed plans to integrate the system with other Government databases, such as the Ministry of Primary and Secondary Education information system, ZIMSEC results, and ZIMSTATS, to enhance national skills planning.\n\nHe challenged stakeholders to fully embrace the system for evidence-based planning.\n\nSystems of this kind evolve. It is through meaningful use, enhancements, and timely data provision that we will maximise its utility.\n\nToday (yesterday) is the beginning of a journeya journey of a thousand miles starting with a first step. We must walk it together, he said.\n\nZimbabwe Council for Higher Education (ZIMCHE) CEO Professor Kuzvinetsa Dzvimbo said DuraIsiphala263 is a transformative tool bringing real-time data, analytics, and unified reporting to strengthen planning and oversight in Zimbabwes higher education sector.\n\nDuraIsiphala263 is a ground breaking development in our ongoing drive to modernise and integrate data-based planning and decision-making within our national education sector, he said.\n\nThe system provides real-time dashboards, comprehensive analytics, and harmonised reporting tools to support manpower planning and institutional oversight across all higher and tertiary education institutions in Zimbabwe.\n\nProf Dzvimbo added that the development speaks to the countrys growing capacity for innovation and reflects the effectiveness of the Heritage-Based Education 5.0 model.\n\nUnlike other countries in the SADC region that rely on proprietary and externally developed systems, Zimbabwe has distinguished itself by successfully designing and developing an end-to-end solution through local expertise from our institutions, said Prof Dzvimbo.\n\nThe system was piloted and refined through collaborative training with 89 percent of the countrys higher and tertiary education institutions.\n\nThe launch marks a significant milestone in Zimbabwes push towards a data-driven education sector and aligns with the Governments broader economic modernisation agenda.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/3er3r-680x380.jpg",
            "description": "Remember Deketeke Herald Correspondent GOVERNMENT yesterday launched DuraIsiphala263, a locally-designed Higher Education Management Information System (HEMIS), aimed at transforming data analysis and decision-making in education and manpower planning. Higher and Tertiary Education, Innovation, Science and Technology Development Minister Dr Frederick Shava described the system as a response to President Mnangagwa’s vision for an “innovation and […]",
            "time": "06:10",
            "date": "15 Apr 2025"
        },
        {
            "title": "NAAZ champs unearth future Olympic gems",
            "url": "https://www.herald.co.zw/naaz-champs-unearth-future-olympic-gems/",
            "content": "Zimpapers Sports Hub\n\nThe wind whispered destiny, and the track thundered with promise.\n\nWhite City Stadium morphed into a cauldron of youthful brilliance over the weekend as more than 700 aspiring athletes converged for the National Athletics Association of Zimbabwe (NAAZ) Junior Championships  a showcase that did far more than crown victors. It uncovered the very heartbeat of Zimbabwes athletic future.\n\nFrom electrifying sprints to jaw-dropping jumps, every corner of the stadium pulsed with raw talent and unshakable resolve. These were not just schoolkids chasing medals. These were future Olympians forging reputations, rewriting personal records, and staking their claim for a place on the international stage.\n\nIn the sprints, Cheetahs speedster Tawananyasha Chimunya turned heads with a blistering 10.63-second win in the Boys 100m final  a time that wouldnt look out of place on senior circuits. On the girls side, NSAs Shalom Sendi lit up the track with a dominant 12.58-second dash to glory.\n\nBut it wasnt just about pace. Prosper Manamike soared an incredible 7.20m in the Boys Long Jump, while Moillar Makamu announced herself as a serious talent with a leap of 5.35m in the girls division  both performances drawing audible gasps from the grandstands.\n\nThe middle-distance races were no less dramatic, with elbows flying, strategies shifting, and champions emerging through grit as much as speed. Relays kept the crowd on its feet, delivering dramatic handoffs and photo finishes that had coaches furiously scribbling notes and selectors quietly nodding approval.\n\nFor NAAZ secretary-general Cynthia Phiri, the championships marked a watershed moment.\n\nWe are extremely proud of these young athletes. They have not only broken personal bests, but theyve inspired a new wave of passion in athletics. This championship was about more than medalsit was about building the next generation of Olympic talent, she said.\n\nNAAZ Technical Director Manuel Mpofu echoed her sentiment, underscoring the championships value as a selection ground.\n\nWhat weve witnessed here is the emergence of a formidable squad. The data collected, times recorded, and technical assessments have given us a solid base to select a competitive team for the Region 5 Games and the Africa Youth Championships in Namibia this June, Mpofu said.\n\nHeld under the inspiring theme Igniting the Flame of Youth Excellence, the championships doubled as a scouting mission, training ground, and national audition  with selectors keeping an eagle eye on athletes likely to carry Zimbabwean hopes at the upcoming AUSC Region 5 Games and the Africa Youth Championships.\n\nWith a training camp now scheduled for May, the top-performing juniors will undergo intense preparation, supported by sports science, nutrition, and recovery experts aimed at sharpening both their physical and mental edge.\n\nSprinters, middle-distance aces, and technical event specialists are expected to form the core of the Zimbabwe delegation heading to Namibia. Several of these juniors will also be shortlisted for international scholarships and elite training camps, with long-term development now firmly in focus.\n\nBeyond medals and records, the championships signalled a deeper shift  the elevation of junior athletics into a structured pipeline with real promise.\n\nAs part of that effort, NAAZ will soon roll out a nationwide schools engagement programme, aimed at identifying and nurturing young talent from an early age, while integrating competitive exposure with academic support.\n\nNAAZ extends heartfelt gratitude to all our sponsors, exhibitors and spectators who made this event possible. Their investment in youth sport is already yielding promising results, read a statement from the association.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2018/07/ccc_campbelltownathleticscentrecampbelltown-680x380.jpg",
            "description": "Zimpapers Sports Hub The wind whispered destiny, and the track thundered with promise. White City Stadium morphed into a cauldron of youthful brilliance over the weekend as more than 700 aspiring athletes converged for the National Athletics Association of Zimbabwe (NAAZ) Junior Championships — a showcase that did far more than crown victors. It uncovered […]",
            "time": "06:10",
            "date": "15 Apr 2025"
        },
        {
            "title": "She-murenga: The untold bravery of women liberators",
            "url": "https://www.herald.co.zw/she-murenga-the-untold-bravery-of-women-liberators/",
            "content": "Gibson Nyikadzino\n\nZimpapers Politics Hub\n\nWOMEN undertook a variety of challenging tasks throughout Zimbabwes liberation struggle, from the late 1960s to Zimbabwes independence in 1980.\n\nDespite post-independence initiatives to promote gender equity following the liberation fight, women ex-combatants have not been able to have equal access to restitution compared to men.\n\nOne of the major reasons is that, traditionally, society has not been able to fully recognise women as a distinct social category in pre-independence and post-independence policies regarding their inclusion in all sectors of socio-economic and political narratives.\n\nThere are patriarchal norms, values and mores that have defined and designated how women should be viewed in society, even when they have been instrumental in modernity, independence and social advancement.\n\nIt would be valid to say that women have been or are fighting a struggle within a struggle, in which they have been or are struggling for inclusion and recognition in the nationalist movement and beyond.\n\nIt can be said that the exclusion of women was not only a product of the colonial and racist regime through the legislation of unjust laws, but also within the liberation movement, which at times created a hierarchical order that limited access to equal opportunities for women combatants.\n\nFor example, the Lancaster House discussions in 1979 focused on restitution for ex-combatants in general, but did not consider women and their unique experiences during the liberation struggle and in the post-independence context.\n\nAlso, what should not be overlooked is the outlook of the bodies that executed the war. For instance, the Dare reChimurenga (War Council) largely designated and constituted to exclude women from participating actively in the decision and strategic necessities in the execution of the war.\n\nIt was rare to find womens voices in that council as it appeared they were prohibited from having a seat in the dare (council).\n\nEven in the battles that were fought, like the decisive 1979 Battle of Mavhonde when the Rhodesian Security Forces launched a ground and air offensive against the ZANLA Military Headquarters in Mozambique, the heroic participation of women has not been fully told as male combatants are given much prominence.\n\nEven historians and biographers have tended to turn a blind eye on unearthing the heroism of women in the theatre of war in the struggle of Zimbabwes independence from the clutches of colonialism.\n\nThis is so because, by nature, conventional wars and liberation struggles have been framed as a masculine business or sport that has no room for femininity. Yet, in that business, the role of women is also seen to be key.\n\nTherefore, the centrality of womens sacrifices during Zimbabwes anti-colonial liberation struggle as both combatants and non-combatants remains a key theme in the documentation of their contributions to the countrys independence. Their relevance to the economic developments in modern Zimbabwe is worth their full recognition.\n\nInforming their motivations to join the struggle were consequences of their situation during colonialism and the gradual exclusion they faced in the economic and social sectors in the then Rhodesia. The oppression of women has historically been instrumental to the development of capitalist consciousness, and therefore, their oppression during colonialism raised their political awareness to fight for their freedom and the rest of others.\n\nIt is undeniable that the goal of fighting the colonial establishment was to ensure equality among Zimbabweans, hence the call to put regulatory mechanisms that advance the rights of women, their social, political and economic stature in Zimbabwe should be given relevance.\n\nSince independence in 1980, Government has publicly recognised the role of women in the liberation struggle through the adoption and ratification of international conventions and enacting legislation that protects the rights of women and their empowerment.\n\nProgress made so far in this regard is commendable; however, at societal and institutional levels, there should be deliberate policies and mechanisms that quickly address the challenges that women are exclusively encountering.\n\nIn the Second Republic, gender (masculinity and femininity) must not be used or manipulated to legitimate scenarios that make one group superior to the other as all Zimbabweans are equal citizens who should enjoy the sacred rewards and benefits of the liberation struggle as constitutionally prescribed.\n\nWomen ex-combatants and non-combatants will always play an important part in all of the fights we will fight to liberate ourselves from the various shackles of neocolonialism as their contribution to the construction of a new society with modern realities. They should not be defiled in any way, nor should they be sacrificed on the altar of prosperity of a system of lies and plunder.\n\nThey will forever be involved in every area of the nations overall organisation, from project creation to decision-making and implementation. The ultimate goal of such vast undertakings should be seen through the creation of a free and prosperous society in which women and men are treated equally in all aspects.\n\nFor women just as they took the initiative to fight the liberation struggle with guns for political independence, they should also take the initiative to put forward their demands and mobilise people to canvass support to win their economic goals.\n\nIt is through this way that women, with the help of all, can break barriers in politics to revolutionise industries and continue to challenge and redefine societal norms in powerful and transformative ways. Many women have become influential figures in shaping policies, driving innovation, and contributing to social change.\n\nIf women are not given a seat at the table, they are not hesitant to one day bring with them folding chairs to the table and give a new dimension to the Chimurenga (revolutionary struggle) lexicon, as She-murenga, a revolutionary struggle initiated, fought and won by women.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/R32R3R-680x380.jpg",
            "description": "Gibson Nyikadzino Zimpapers Politics Hub WOMEN undertook a variety of challenging tasks throughout Zimbabwe’s liberation struggle, from the late 1960s to Zimbabwe’s independence in 1980. Despite post-independence initiatives to promote gender equity following the liberation fight, women ex-combatants have not been able to have equal access to restitution compared to men. One of the major […]",
            "time": "06:10",
            "date": "15 Apr 2025"
        }
    ]
}