{
    "news": [
        {
            "title": "Chicanery, discord will not derail progress: President",
            "url": "https://www.herald.co.zw/chicanery-discord-will-not-derail-progress-president/",
            "content": "Wallace Ruzvidzo, Herald Reporter\n\nNo amount of economic chicanery, mudslinging and discord should be allowed to derail the countrys irreversible course to modernisation industrialisation and development, President Mnangagwa has said.\n\nIn his address at the interment of National Hero Cde Tinaye Chigudu at the National Heroes Acre yesterday, the President said Zimbabwe was marching forward.\n\nThus, the President added, the countrys interests must remain the general citizenrys core focus.\n\nIn every sector, province by province, let us remain focused, disciplined and work harder towards the attainment of Vision 2030.\n\nNo amount of economic chicanery, mudslinging and discord should be allowed or entertained to derail our irreversible course to modernise, industrialise and develop our country. We are marching forward ever, backwards never.\n\nThe long-enduring spirit of national pride and collective loyalty to the nation remains our cardinal beacon.\n\nAs citizens of this country, wherever we are and whatever socio-economic activities we may be undertaking, the interests of Zimbabwe must remain at the core of our focus as we build our country brick by brick, stone upon stone. Zimbabwe inyika yechipikirwa, he said.\n\nAs such, President Mnangagwa rallied all Zimbabweans both within the country and those in the diaspora to pull in the same direction as one people, for the achievement of national aspirations.\n\nPresident Mnangagwa looks on as First Lady Dr Auxillia Mnangagwa consoles Mrs Esther Chigudu during the burial of Cde Tinaye Chigudu at the National Heroes Acre yesterday\n\nZimbabwe envisages to attain upper-middle-income economic status by 2030.\n\nWe have this duty, not only for the present generations but the future as well. Together, under our watch, in Government, the private sector and the communities as a whole, moving forward hand in hand; in peace and unity; with one common objective, Zimbabwe shall be a beacon of prosperity which shines brighter and brighter.\n\nTogether, emboldened by our collective unity of purpose, let us modernise, industrialise and develop the Zimbabwe that we are proud of and for the benefit of future generations, he said.\n\nTo this end, the President urged the general citizenry to remain focused as the country marches towards Vision 2030.\n\nMuch more work is still before us. We cannot tire or lose heart. Let us maintain our focus and discipline to build the Zimbabwe we all want.\n\nNone but ourselves have this weighty obligation. We must, therefore, remain bold and confident in our abilities as a proud, truly independent African people with our national character embedded in a rich liberation heritage.\n\nOur sacred national flag is a constant reminder of what we are as a people and our national anthem is our daily prayer to Almighty God as a petition on behalf of our beloved motherland, Zimbabwe, said President Mnangagwa.\n\nPresident Mnangagwa and First Lady Dr Auxillia Mnangagwa greet crowds after the burial of Tinaye Chigudu at the National Heroes Acre yesterday.  Pictures: Presidential Photographer: John Manzongo\n\nAs Zimbabwe continues to progress, the President said it was imperative that Zimbabweans keep on embracing unity, peace, love and tolerance, for those with divergent views.\n\nFor these are the defining features of our countrys national virtues. The late National Hero, Cde Chigudu, demonstrated unquestionable patriotism, loyalty, consistency and persistence.\n\nThese must always be guiding principles for every Zimbabwean as we undertake our different national responsibilities, he said.\n\nIn respect of the national hero, President Mnangagwa said Cde Chigudus death had dealt a major blow to the country as he had contributed invaluably before and after the countrys independence.\n\nOn behalf of the Government, our revolutionary mass party, ZANU PF, our Nation, my family and indeed on my own behalf, I wish to once again express my deepest heartfelt condolences to the Chigudu family at the sorrowful loss of their loved one and our dedicated patriot.\n\nOur late National Hero, Cde Chigudu, was among many brave, selfless sons and daughters of the soil who took a stand and fought for our Independence.\n\nHe is honoured as one of the first combatants to be sent for training in North Korea under the Zimbabwe Peoples Revolutionary Army (ZIPRA), the military wing of the Zimbabwe African Peoples Union (ZAPU).\n\nHe was deployed as an intelligence operative in the then Salisbury.\n\nVice President Kembo Mohadi arrives at the National Heroes Acre in Harare yesterday. Picture: Joseph Manditswara\n\nThe President narrated how Cde Chigudu undertook risky and critical mission tasks during the liberation struggle, responsibilities which helped to gather information regarding the modus operandi of the racist Rhodesian forces.\n\nThis was instrumental in assisting the guerrilla war command element in the planning and execution of special military operations. As he continued to pursue his important mission, the late National Hero, Cde Chigudu, was unfortunately captured, detained and imprisoned for 12 years by the Rhodesian settler regime.\n\nThis could never deter or hamper his bravery and revolutionary spirit, including the desire to see a free and independent Zimbabwe.\n\nUpon his release from prison, he crossed into Zambia, re-united with comrades and resumed his duties as we waged the protracted armed war of liberation, he said.\n\nPresident Mnangagwa then outlined the late national heros contributions post-independence.\n\nAfter the attainment of independence in 1980, the late National Hero, Cde Chigudu, joined the Government as an Assistant Secretary in the Ministry of Transport.\n\nDue to his hard work ethic and dedication to national service, he was promoted to Deputy Secretary in the Ministry of Home Affairs before his elevation to the position of Permanent Secretary in the same Ministry. Cde Chigudu also served as Permanent Secretary in the Ministry of Mines, thereafter as Governor for Manicaland Province.\n\nHe also served as ZANU PF Chairman for the same Province, always accepting deployment with humility and without a sense of entitlement, he said.\n\nInformation, Publicity, and Broadcasting Services Minister Dr Jenfan Muswere (centre) flanked by Information Communication Technology, Postal and Courier Services Minister Dr Tatenda Mavetera (right) and her deputy Dingumuzi Phuti share a lighter moment after the burial of National Hero Tinaye Elisha Nzirasha Chigudu in Harare yesterday. Picture: Joseph Manditswara\n\nThe President described Cde Chigudu as an unwavering patriot, whose legacy of service must be emulated by current and future generations.\n\nOur departed National Hero, Cde Chigudu was a principled and ideologically rooted cadre who actively participated within the ruling ZANU PF Party and Government, with unflinching allegiance, loyalty and commitment.\n\nHe was a fountain of wisdom who offered sound counsel and advice in conducting both Party and Government business, drawing from his vast experience and institutional memory.\n\nHe always exuded the virtues of straight-forwardness and frankness in every aspect of life. His integrity, sense of excellence, adherence to truth and honesty left an indelible mark on our body politic, he said.\n\nContributions by such dedicated cadres, he said, should never be forgotten.\n\nLet us never forget that it is through the selfless sacrifices and dedication to duty demonstrated by the late National Hero, Cde Chigudu, and many other departed and living cadres that Zimbabwe continues to enjoy peace, stability, unity and development as an independent, sovereign and democratic state.\n\nI, therefore, call upon all Zimbabweans to remain vigilant as we protect, preserve and consolidate the achievements realised in our beloved motherland, Zimbabwe, said President Mnangagwa.\n\nThe burial was attended by Ministers, Deputy Ministers, Permanent Secretaries, Zanu PF Politburo and Central Committee members and other senior Government officials.\n\nService Chiefs led by Zimbabwe Defence Forces Commander General Philip Valerio Sibanda at the burial of Cde Tinaye Chigudu at the National Heroes Acre in Harare yesterday. Picture: Joseph Manditswara\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/HE1-2.jpg",
            "description": "Wallace Ruzvidzo, Herald Reporter No amount of economic chicanery, mudslinging and discord should be allowed to derail the country’s irreversible course to modernisation industrialisation and development, President Mnangagwa has said. In his address at the interment of National Hero Cde Tinaye Chigudu at the National Heroes’ Acre yesterday, the President said Zimbabwe was marching forward. […]",
            "time": "08:34",
            "date": "11 Feb 2025"
        },
        {
            "title": "Cde Chigudu contributed to growth of the liberation movement: VP Chiwenga",
            "url": "https://www.herald.co.zw/cde-chigudu-contributed-to-growth-of-the-liberation-movement-vp-chiwenga/",
            "content": "Mukudzei Chingwere, Herald Reporter\n\nThe late National Hero Cde Tinaye Chigudu contributed immensely to the growth and success of the liberation movement, Vice President Dr Constantino Chiwenga has said.\n\nVP Chiwenga said this in his condolence message following the death Cde Chigudu who was buried at the National Heroes Acre in Harare yesterday.\n\nHe said Zimbabwe had lost a great son of the soil, but emphasised that Cde Chigudus sacrifices and contributions will serve as a lasting inspiration for future generations.\n\nCde Chigudu was a distinguished and pioneering figure in the liberation struggle, he said.\n\nIn 1964, he became one of the first Zimbabwe Peoples Liberation Army (ZIPRA) cadres to receive training in North Korea.\n\nUpon his return, he was deployed as an intelligence operative in Salisbury, now Harare, where his bravery, intellect, and strategic foresight contributed immensely to the growth and success of the liberation movement.\n\nHis ability to recruit urban cadres and provide critical intelligence was vital to the strategic operations of ZIPRA during the struggle for Zimbabwes freedom, said VP Chiwenga.\n\nHe said Cde Chigudus principles of hard work, dedication, loyalty and selflessness have left an indelible mark on the nations political and agricultural sectors.\n\nVP Chiwenga said in 1965, Cde Chigudu was captured by the Rhodesian regime but despite enduring the hardships of a brutal 12-year imprisonment at Gonakudzingwa and Hwahwa prisons, his resolve to achieve a free Zimbabwe never wavered.\n\nUpon his release, he immediately reunited with his fellow freedom fighters in Zambia, and furthered his education in law at Exeter University in Britain, said VP Chiwenga.\n\nIn post-independence Zimbabwe, Cde Chigudu continued to serve with distinction at various senior levels in Government and the ruling ZANU PF party.\n\nHis commitment to national development was evident in his passionate involvement in Zimbabwes agrarian reforms, particularly through his successful farming activities in Makoni District.\n\nHe embodied the principles of hard work, dedication, loyalty and selflessness, leaving behind a lasting legacy in both the political and agricultural sectors, he added. The Vice President noted that Zimbabwe has lost a great son of the soil whose sacrifices and contributions will forever remain an inspiration to all.\n\nWe take comfort in knowing that his legacy of service, unity and perseverance lives on in the progress and prosperity of our nation, said VP Chiwenga.\n\nAs we bid farewell to our dear Comrade, let us embrace his spirit of togetherness, peace, and unity.\n\nMay we draw strength from his example of hard work and selflessness in building a brighter future for Zimbabwe, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/VP.jpg",
            "description": "Mukudzei Chingwere, Herald Reporter The late National Hero Cde Tinaye Chigudu contributed immensely to the growth and success of the liberation movement, Vice President Dr Constantino Chiwenga has said. VP Chiwenga said this in his condolence message following the death Cde Chigudu who was buried at the National Heroes Acre in Harare yesterday. He said […]",
            "time": "08:34",
            "date": "11 Feb 2025"
        },
        {
            "title": "Multitudes bid farewell to principled cadre",
            "url": "https://www.herald.co.zw/multitudes-bid-farewell-to-principled-cadre/",
            "content": "Blessings Chidakwa, Herald Reporter\n\nMultitudes gathered at the National Heroes Acre in Harare yesterday to pay their final respects to National Hero, Cde Tinaye Elisha Nzirasha Chigudu.\n\nThe shrine was filled to capacity as people from across the country began arriving as early as 7 a.m.\n\nThe atmosphere was vibrant, with singing, chanting, and dancing dominating the ceremony.\n\nOne of the prominent chants, led by the Young Women for ED group, was 2030 VaMnangagwa vanenge varimo muOffice (By 2030, President Mnangagwa will still be in office).\n\nCde Chigudu, a former Governor and Zanu PF provincial chairperson for Manicaland Province, as well as a distinguished civil servant, died on Wednesday last week.\n\nPresident Mnangagwa declared him a National Hero in honour of his lifelong dedication to Zimbabwes liberation and development.\n\nMr Edgar Chigudu, speaking on behalf of the family, described his brother as an icon and a man of principle. He expressed gratitude to President Mnangagwa and the Government for conferring National Hero status on Cde Chigudu.\n\nHe was a man of protocol who always respected hierarchy. Though deeply political, he was approachable and open to frank discussions, Edgar said. He added that Cde Chigudu left a lasting legacy of love for his family and commitment to his country.\n\nInformation, Publicity, and Broadcasting Services Minister Dr Jenfan Muswere, shared a personal connection with Cde Chigudu, whom he described as a father figure.\n\nDr Muswere recounted how Cde Chigudu guided him after the death of his own father, teaching him about politics, governance, and the importance of fighting imperialism.\n\nHe constantly reminded us of the struggles under the illegal white regime and urged young people to defend Zimbabwes independence and fight against sanctions, Dr Muswere said.\n\nMinister of State for Manicaland Provincial Affairs and Devolution Advocate Misheck Mugadza praised Cde Chigudus leadership and work ethic.\n\nHe was straightforward, hardworking, and time-conscious. Even after retirement, he remained a valuable advisor on development and political matters, he said.\n\nCde David Parirenyatwa, a member of the Zanu PF Council of Elders, highlighted Cde Chigudus discipline and dedication.\n\nHe was a stern disciplinarian who loved order and respect. His recognition as a National Hero is well-deserved, he said.\n\nVeterans of the Liberation Struggle Affairs Deputy Minister Headman Moyo also paid tribute to the National Hero, recalling Cde Chigudus early involvement in the liberation struggle under ZIPRA. He was a principled cadre who worked tirelessly for the nation, he said.\n\nPresident Mnangagwa, accompanied by the First Lady Dr Auxillia Mnangagwa, presided over the burial ceremony.\n\nAlso in attendance to witness the national heros burial were Vice Presidents Constantino Chiwenga and Kembo Mohadi along with Cabinet Ministers, service chiefs, senior Government officials and members of the Zanu PF Politburo and Central Committee.\n\nCde Chigudus burial was a fitting tribute to a man who dedicated his life to Zimbabwes liberation, development, and the empowerment of future generations. His legacy will continue to inspire the nation as it works toward achieving Vision 2030.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/TC-1.jpg",
            "description": "Blessings Chidakwa, Herald Reporter Multitudes gathered at the National Heroes Acre in Harare yesterday to pay their final respects to National Hero, Cde Tinaye Elisha Nzirasha Chigudu. The shrine was filled to capacity as people from across the country began arriving as early as 7 a.m. The atmosphere was vibrant, with singing, chanting, and dancing […]",
            "time": "08:34",
            "date": "11 Feb 2025"
        },
        {
            "title": "Geza caught in web of fraud, perjury",
            "url": "https://www.herald.co.zw/geza-caught-in-web-of-fraud-perjury/",
            "content": "News Editor\n\nControversial war veteran Cde Blessed Geza has been caught in a web of fraud, perjury, and corruption after he failed to pay US$1 250 000 for a piece of land in Harare and is now hounding prosecutors and police officers involved in the case through open intimidation and harassment.\n\nSeveral prosecutors and police officers have opted out of the case after receiving death threats from the renegade and controversial war veteran, who is locked in a legal battle over the sale of a plot in Harare with former ARDA chairman Mr Basil Nyabadza.\n\nAccording to documents gleaned from court records, in 2020 Cde Geza and Cde Nyabadza entered into a deal for the sale of a portion of land on Plot 5 Spitzkop Harare, for US$1 362 000.\n\nCde Geza made staggered payments totalling US$112 000, and made a commitment that the balance, totalling US$1 250 000 would be paid before October 2021.\n\nConcomitantly, he made an undertaking that he would pay US$100 000 as cash deposit, in instalments of US$25 000, that were to be paid on November 19, 2020, December 10, 2020, December 31, 2020 and January 21, 2021.\n\nDespite making the commitments, Cde Geza did not make any, but then lied under oath that he had settled his debts with Mr Nyabadza.\n\nThis he has been able to achieve, The Herald established, after securing a fake Deed of Transfer Number 6867/73.\n\nSubsequently, he received fake documentation of the sale of the land in dispute after, apparently, bribing some officials in the Ministry of Local Government\n\nRegarding the payment of the outstanding balance, Cde Geza has failed to meet his end of the bargain over a period of four years.\n\nSources close to the case said the sporadic payment history constitutes a material breach of the agreement of sale.\n\nAvailable information shows that while Cde Geza has dragged Mr Nyabadza in a legal dispute claiming that the latter did not have title deeds on the land in question, he unlawfully obtained a subdivision permit, raising questions over how he managed to acquire a subdivision permit without title deeds.\n\nThis could suggest that Cde Geza bypassed proper legal channels or used fraudulent means to get the documents.\n\nPreviously, Cde Geza has reported Mr Nyabadza to the police, on several occasions, but his allegations have consistently failed to stick due to his inability to produce proof of payment and also lack of evidence to support his claims.\n\nAs a result, he has harassed people involved in the case, for instance on September 4, 2024 at the Harare Magistrates Court during a vetting process Cde Geza, interrupted the Prosecutor Miss Maphosa, during proceedings, accusing her of being biased.\n\nHe also said, I will deal with you Nyabadza, if there will be blood, let there be blood.\n\nApart from threatening Mr Nyabadza, Cde Gezi also threatened prosecutors and police officers who are involved in the case.\n\nA few days after threatening Mr Nyabadza in court, Cde Geza on September 7 also deployed 15 rowdy youths to the formers property and threatened to unleash violence, he repeated the same antics on September 11 of the same month.\n\nAlthough he is the one who took Mr Nyabadza to court, Cde Geza has been failing to turn up for court hearings, resulting in the case being postponed on several occasions.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2016/08/ARDA_BOARD_CHAIRMAN_BASIL_NYABADZA-630x380.jpg",
            "description": "News Editor Controversial war veteran Cde Blessed Geza has been caught in a web of fraud, perjury, and corruption after he failed to pay US$1 250 000 for a piece of land in Harare and is now hounding prosecutors and police officers involved in the case through open intimidation and harassment. Several prosecutors and police […]",
            "time": "08:34",
            "date": "11 Feb 2025"
        },
        {
            "title": "Banks prioritise productive sectors in loan disbursements",
            "url": "https://www.herald.co.zw/banks-prioritise-productive-sectors-in-loan-disbursements/",
            "content": "Nelson Gahadza, Business Reporter\n\nZimbabwes banking sector is now giving priority to the key productive sectors of the economy after loans to these critical segments of the economy accounted for 72,25 percent of total disbursements last year, reports the Reserve Bank of Zimbabwe.\n\nZimbabwes main productive sectors are agriculture, mining, tourism, and manufacturing.\n\nThe banking sector has been sourcing lines of credit from different financiers globally to support the key sectors, mainly businesses that are export-orientated or, as in the case of tourism, are foreign currency earners and so able to pay back external loans.\n\nThis has kept the domestic economy going despite the absence of long-term concessional support from multilateral lenders and the collapse of many correspondent banking relationships, making affordable external credit hard to come by.\n\nAccess to external funding has, however, not been a stroll in the park due to the impact of illegal Western sanctions, which blocked easy access to some key lenders and projected Zimbabwe as a risky borrower, making many available loans pricey.\n\nA banking focus on prioritising productive sectors, as opposed to providing consumptive loans, is critical to enable business and economic growth.\n\nThis means that the banks have directed most of the funding at their disposal in supporting for-profit or value-creation initiatives as opposed to consumptive loans borrowed to meet individual or household needs or even to speculate on equity and foreign currency markets.\n\nLimited funding to business and key productive sectors strain the countrys potential for growth, which is critical for job creation and sustaining existing ones. Finance, Economic Development and Investment Promotion Minister Mthuli Ncube expects the economy to grow by 6 percent this year, with the World Bank expecting a slightly better 6,3 percent, driven by agriculture, mining and tourism.\n\nEconomic growth slowed down markedly last year to just two percent, weighed down by the poor performance of agriculture following the devastating El Nino-induced drought. But despite that drought and its effects on agriculture, Zimbabwe continued to move forward, just more slowly.\n\nAccording to the 2025 Monetary Policy Statement (MPS), by the end of last year, aggregate banking sector loans and advances amounted to ZiG55,93 billion, representing a 102 percent increase from ZiG27,45 billion reported six months earlier.\n\nLending to agriculture accounted for 14,72 percent and manufacturing 14,94 percent of total loans, individuals and households accounted for 25,51 of the total loans, while others were at 2,24 percent, reads part of the MPS.\n\nAccording to the MPS, the increase in aggregate banking sector loans was largely attributed to the revaluation of foreign currency-denominated loans, which accounted for 88,17 percent of the banking sectors aggregate loans.\n\nAs of January 20 this year, the loans and advances amounted to ZiG50,33 billion.\n\nFinancial analyst Mr Malone Gwadu said it was encouraging to have more loan funding going to key sectors of the economy as opposed to being skewed towards individual consumption financing.\n\nHe said productive sectors needed the funding for working capital gap filling, recapitalisation, technology modernisation, and as shock absorbers during periods of market turbulence.\n\nHaving a huge chunk of funding for production is quite pleasing, as it also feeds through the broader economy through increased production and productivity, job absorption, a widened tax base, and also the potential accelerator effect the funding might have in the economy, he said.\n\nAccording to RBZ Governor Dr John Mushayavanhu, the banking sectors financial soundness metrics as of the end of last year, indicated that the banking sector remains safe and sound and continues to contribute to economic growth.\n\nAs of December 31 last year, 18 out of 19 banking institutions reported core capital above the minimum regulatory capital requirement of US$30 million.\n\nDr Mushayavanhu said Time Bank, with a reported core capital of US$4,52 million as of December 31, 2024, was authorised to commence limited commercial banking activities, but without taking deposits, in August 2022 so there is no risk to depositors as there are none.\n\nThe Reserve Bank will leverage the external audit reports in verification of the declared capital positions submitted by banking institutions, he said.\n\nAccording to the MPS, total banking sector assets increased from ZiG77,55 billion as of 30 June last year to ZiG161,39 billion by the end of the year, and the asset mix remained skewed towards loans and advances, which accounted for 31,39 percent of total banking sector assets as at year end compared to 32,25 percent at mid-year.\n\nA year end, the sector reported an aggregate non-performing loans to total loans ratio of just 3,37 percent, compared to 2.02 percent at mid year, but the year-end ration was still well within the internationally acceptable threshold of 5 percent.\n\nDr Mushayavanhu said total banking sector deposits continued on an upward trajectory, increasing from ZiG43,60 billion reported at mid-year to ZiG89,07 billion at year end, mainly driven by translation of foreign currency denominated deposits due to exchange rate movements.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/03/Minister-Mthuli-Ncube.jpg",
            "description": "Nelson Gahadza, Business Reporter Zimbabwe’s banking sector is now giving priority to the key productive sectors of the economy after loans to these critical segments of the economy accounted for 72,25 percent of total disbursements last year, reports the Reserve Bank of Zimbabwe. Zimbabwe’s main productive sectors are agriculture, mining, tourism, and manufacturing. The banking […]",
            "time": "08:34",
            "date": "11 Feb 2025"
        },
        {
            "title": "Space barons warned over corruption in Mbare stall allocation",
            "url": "https://www.herald.co.zw/space-barons-warned-over-corruption-in-mbare-stall-allocation/",
            "content": "Rumbidzayi Zinyuke and Obey Musiwa\n\nAllocation of stalls in the temporary traders market at Mbare Musika will be done fairly to ensure that all vendors who lost their wares in the inferno last year benefit.\n\nAfter the completion of the market, there have been allegations that space barons were charging US$10 per person to capture their names on beneficiaries lists.\n\nSpeaking after a Ministers tour of the new market yesterday, Local Government and Public Works Minister Daniel Garwe assured traders that space barons would be dealt with accordingly.\n\nHarare City Council, working with other Government departments has done a verification exercise that is being done accordingly and with transparency. We will never impose people on you to allocate tables, I can assure you that this will be done fairly. I am saying this because there are people who have been demanding US$10 per person to verify a traders position. The verification is done officially, and the names will be released in newspapers, he said.\n\nPresident Mnangagwa declared a state of disaster after a fire destroyed stalls and wares at the old Mbare Musika last year, leaving nearly 5 000 traders stranded.\n\nMinister Garwe said the construction of the temporary and the main market which would be done under two phases in line with national development goals.\n\nThis is following President ED Mnangagwas Vision 2030, which targets the attainment of an upper middle income economic status. We are saying there shall be no one and no place left behind in this traders market, starting with small and medium enterprises. This modern market is being built in line with international standards so you will be able to see the same structure if you visit other countries, he added.\n\nWomen Affairs, Community, Small and Medium Enterprise Development Minister Monica Mutsvangwa said Governments promise to traders was being fulfilled as the temporary market was almost complete to pave way for work on the main traders market.\n\nI understand that the process is underway to finalise the selection of the first batch of beneficiaries to be housed in the market and I want to assure you that this process will be done in a transparent manner. Its worth reminding each other that for an orderly allocation of space to traders, we need more cooperation, solidarity, honesty and transparency. Self-aggrandisement and enrichment at the cost of others will ruin the process of modernising Mbare Musika.\n\nMinister Mutsvangwa said the task ahead needed all hands on the deck to restore businesses back to normal.\n\nInformation, Publicity and Broadcasting Services Minister Dr Jenfan Muswere said the construction of the traders markets was a concept that would spread to all provinces to ensure the transformation of value chains.\n\nWe are talking about the primary industry, that is the agricultural sector, which is based on the success of the land reform programme that has ensured that millions of Zimbabweans have benefited from the land.\n\nThe Mbare Musika market becomes a yardstick for us to measure our capacity as a people, to produce, distribute, and market. This becomes part of a platform, which supports the economic empowerment efforts, by President Mnangagwa, through providing platforms for small to medium scale enterprises, which is part of Vision 2030.\n\nLocal Government and Public Works Minister Daniel Garwe (right) , Women Affairs, Community, Small and Medium Enterprises Development Minister Senator Monica Mutsvangwa(second from left) , State for Provincial Affairs and Devolution for Harare Metropolitan Senator Charles Tavengwa (left) ,Masimba Holdings CEO Engineer Fungai Matahwa and other delegates having a tour at Mbare Market in Harare yesterday . Picture ; Tanyaradzwa Tanyanyiwa\n\nMasimba Holdings chief executive officer Mr Fungai Matahwa said construction of the structure itself was 99 percent while works on the administration block, and ablution facilities have been completed.\n\nIn terms of the work around the structure itself, it took us about 210 tonnes of steel that we had to put together over a period of six weeks with a remarkable team that managed to do the work to make sure that the structure is up. It covers 7 000 square metres and will accommodate between 1 700 to 2 000 traders depending on the demarcations that will be put in place, he said.\n\nTraders said they were happy that everything was now in place for them to start working and improve their livelihoods.\n\nMs Martha Changainesu, a trader said: As a vendor who was severely affected by the devastating fire in October 2024, Im grateful for the swift response from the authorities. The new temporary market is a beacon of hope for us vendors, and Im excited to see it taking shape.\n\nMr Ernest Kazingizi said youths were looking forward to restoring their source of income back through the opening of the temporary market.\n\nWe are grateful that we will get our jobs back because the fire affected us, burning all our goods and source of livelihood. We hope we will be able to get loans to boost our businesses as we start working at the new market, he said.\n\nAnother trader Mrs Violet Makaedza said: As women, we are very happy about this development and all services that will be offered here. To those people who are claiming to own tables at the new market, we hope that the law will deal with them accordingly. We are striving for a living and someone cannot just come along and steal from us.\n\nLocal Government and Public Works Minister Daniel Garwe (centre) , Women Affairs, Community, Small and Medium Enterprises Development Minister Senator Monica Mutsvangwa , State for Provincial Affairs and Devolution for Harare Metropolitan Senator Charles Tavengwa ( second from left) ,Masimba Holdings CEO Engineer Fungai Matahwa (third from left) and other delegates having a tour at Mbare Market in Harare yesterday . Picture ; Tanyaradzwa Tanyanyiwa\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/M1-2.jpg",
            "description": "Rumbidzayi Zinyuke and Obey Musiwa Allocation of stalls in the temporary traders’ market at Mbare Musika will be done fairly to ensure that all vendors who lost their wares in the inferno last year benefit. After the completion of the market, there have been allegations that space barons were charging US$10 per person to capture […]",
            "time": "08:34",
            "date": "11 Feb 2025"
        },
        {
            "title": "EDITORIAL COMMENT: Joint Summit sets highly practical route map for sorting out eastern DRC",
            "url": "https://www.herald.co.zw/editorial-comment-joint-summit-sets-highly-practical-route-map-for-sorting-out-eastern-drc/",
            "content": "The Summit on Saturday bringing together SADC and the East African Community (EAC) was immensely practical in agreeing to effective action to fix the problems in the eastern Democratic Republic of Congo without getting bogged down in a blame game while people suffer.\n\nThe immediate need in that unhappy area is an effective and practical ceasefire, ending the violence and ending it fully, while re-opening the transport corridors that are needed to ensure aid and normal supplies can get through to the people.\n\nThe Heads of State and Government commissioned the military professionals, the chiefs of their defence forces, to move swiftly into the eastern DRC and within five days meet all combatants and settle the ceasefire and the opening of the transport routes.\n\nBy using highly experienced military officers for this tricky mission, the Summit has made sure that those on the ground cannot bluff or pretend; military experts can quickly work out who is where and who is doing what and give the necessary instructions to implement the Summit resolutions.\n\nAt the same time everyone in the region has agreed to prevent arms and military supplies reaching any of the movements within the DRC and has promised not to intervene themselves.\n\nThis will help maintain the ceasefire arrangements, at least for a time while a determined effort is made for a long lasting and permanent solution to the underlying reasons for the violence in the first place.\n\nHere the leaders of Southern and East Africa have decided to work together, combining the two regional peace processes and charging their foreign ministers to work together to have all issues addressed and to report what everyone hopes will be substantial progress within 30 days.\n\nThe point of combining efforts is not only to make the resulting single effort more effective, but also to make it plain to everyone involved in the eastern DRC that it is no longer possible to weave between possible gaps in a double effort, no matter how closely the two regional efforts were aligned.\n\nAs SADC chairperson and co-chair of the Summit President Mnangagwa noted, none of those attending came forward to say they had military commitments in the eastern DRC or were backing any of the rebel participants in the violence, although it was clear that there was such backing, but the Summit decided that blame games at this stage of the process would be unhelpful.\n\nSo what was then pushed through was an agreement that no state should support rebel movements in the eastern DRC or commit troops to the conflict, regardless of what may or may not have happened in the past.\n\nThis universal decision means that attention can be promptly paid to what is needed, ending the violence and then untangling the underlying causes and mess causing that violence.\n\nThis decision avoided the summit getting bogged down in the dispute between the DRC and Rwanda, with Rwanda complaining about insufficient control of what it sees as active rebel movement of Rwandese in the area and the DRC complaining about Rwandan intervention to back DRC rebels. Both countries deny the others allegations. But the Summit moved forward to solve the immediate problems of violence and then the underlying problems.\n\nThere are a number of rebel groups and militias operating in the eastern DRC, and they have been able in the past, at least at times, to weave around peace agreements and enter and leave violent situations and even use their mere existence as a threat that others in the area need to recognise and deal with.\n\nSome of these groups are home-grown.\n\nThe DRC has been able, in most of the rest of the country, to deal with similar rebel and militia movements, hammer out the necessary peace deals to convert them into political movements, end the threat of violence and incorporate suitable fighting personnel into the national army.\n\nIt helps in these sort of negotiations if the rebel movement does not have a sponsor or backer and so has to be willing to talk and to work out a route out of violent conflict.\n\nThe eastern DRC does have a non-home grown movement, mentioned in the communique of the Summit, the FDLR, a Rwandan rebel movement made up largely of those who were partly responsible for the 1994 genocide there and who fled the country.\n\nIt is an amalgamation of previous smaller movements and Rwanda sees this movement as a serious threat.\n\nThe main internal DRC movement is M23, which seems remarkably well equipped and is the rebel movement that has twice occupied the major eastern DRC city of Goma.\n\nThe M23 has twice made deals with the DRC Government, and these have broken down when it appears to be able to gain access to other resources.\n\nCleaning up the mess permanently will involve the joint peace process to deal with both those movements and to ensure that DRC and Rwanda have their security concerns addressed, which as we have mentioned before will mean a secure border and effective civil control by the DRC of its own territory and that control being able to end the years of anyone grabbing a gun to settle a dispute.\n\nPresident Mnangagwa stressed to the Summit that the whole peace process needs to reflect and use the unit generated in Africa in the long struggle against colonialism and then in sorting out internal African complications.\n\nAfrica has avoided most of the sort of wars between states that have bedevilled other continents, with the founders of the OAU, now the African Union, setting out how to make sure this would not happen.\n\nThis determination plus the practical route map the SADC-EAC Summit laid down needs to be applied to whole conflict in all its forms in the eastern DRC, to give the people who live in the two Kivu provinces what they have missed for many years, peace and the opening to use their increasable resources to have a prosperous, peaceful and secure future.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/SADC.jpg",
            "description": "The Summit on Saturday bringing together SADC and the East African Community (EAC) was immensely practical in agreeing to effective action to fix the problems in the eastern Democratic Republic of Congo without getting bogged down in a blame game while people suffer. The immediate need in that unhappy area is an effective and practical […]",
            "time": "08:34",
            "date": "11 Feb 2025"
        },
        {
            "title": "President Sam Nujoma: Zim, Namibia ties that bind and endure",
            "url": "https://www.herald.co.zw/president-sam-nujoma-zim-namibia-ties-that-bind-and-endure/",
            "content": "Ambassador Christopher Mutsvangwa\n\nAfrica began its continental decline from the time Europe took the lead in the accumulation of capital and emergency of the industrial revolution.\n\nA dark cloud of large scale trans-Atlantic slavery inexorably led to imperial wars of colonial conquest, settler encroachment and the attendant vices of racism and Apartheid.\n\nEven then by dint of the sheer population numbers and their intrinsic organisational stamina spared the Mother Continent of the extermination fate that visited Native Americans (Red Indians) and Native Austral-Asian (Aborigines).\n\nThere was thus an inherent bank of energy burst reserved for a resumption of the fight against marauding imperial European occupiers baptised by the 1884 Berlin Conference.\n\nTime did indeed income. Ever prone to internecine wars, competing European powers repeatedly plunged into horrific and debilitating wars.\n\nThe Second War was their last act of folly. Whereupon oppressed people from the Global South saw their chance.\n\nA new socio-political consciousness took hold riding upon their numbers and organisation.\n\nPost WWII resurgent and rising African nationalism did not take long to shirk off imperial bondage in fragile European colonies.\n\nSouthern Africa proved a different ball game. A sizable European settler population had entrenched itself taking full advantage of racialised allocation of capital.\n\nThey invested in strong state apparatus designed to cow the militarily subjugated African majorities in perpetual submission and perpetual servitude.\n\nIt quickly dawned upon the oppressed masses that which was lost by force of arms could only be recovered by an offsetting military showdown.\n\nOne by one, the subregional national liberation movements embraced the root of the armed struggle as the potent weapon to restore lost freedom, usurped sovereignty and denied democracy.\n\nIn South Africa, the ANC charted the course of this new found militancy. Nelson Mandela and Oliver Tambo are among the early luminaries in the restoration of African military virility to confront the well succoured Apartheid militarist state.\n\nZAPUs Joshua Nkomo and James Chikerema, as well as ZANUs Ndabaningi Sithole, Robert Mugabe and Herbert Chitepo took a similar stance against the settler racist regime of Rhodesias Ian Smith.\n\nIn Mozambique there was FRELIMOs Eduardo Mondlane and Samora Machel confronting incongruously belligerence of expedition army imperial Portugal.\n\nSister colony Angola had Agostino Neto and the MPLA.\n\nNamibia, a leased sub-colony of the settler Apartheid South African state gave issue Sam Nujoma and his SWAPO.\n\nNot to forget Amilcar Cabral and his PAIGC in Guinea Bissau and Cape Verde.\n\nThe venerable Julius Nyerere of newly independent Tanzania offered indomitable sanctuary to the fledgling new armies that were determined to address and redress the hitherto African military deficit.\n\nIn twin collaboration with Kenneth Kaunda of Zambia, they both set out about this noble task under the aegis of the Africa Union.\n\nAn Africa Liberation Committee was instituted to marshal military and material support from the sympathetic geo-political blocs of the Union of Soviet Socialist Republic, China, Warsaw Pact socialist nations, Cuba, North Korea and whoever.\n\nThere was a populist resonance by the oppressed majorities. The initial trickle of intrepid recruits would eventually morph into thousands avalanche of youths trooping to Tanzania and Zambia.\n\nThe new military potency drew first blood in 1974 with the defeat of the farcist Imperial army of Portugal.\n\nThis galvanized even further mobilisation into the ranks of the remnant national liberation movements.\n\nConcurrently, the oppressed masses garnered a new defiance and assured confidence of the inevitability of victory.\n\nThe 1976 the Soweto Student Uprising was emblematic of the new mood.\n\nTelling blows of the epic battles of Mavonde and Mapai brought to heel Ian Smith.\n\nBritain and its allies swung into action. They strove to stave off military disaster facing their imperial cats paw Rhodesian Army. The Lancaster House Armstice of 1979 led to freedom, independence and democracy for Zimbabwe.\n\nIn Angola, the beleaguered Apartheid South African army persisted in the folly of aggression aided by a compromised UNITA.\n\nTimely intervention by Fidel Castros conventional Cuban Forces thwarted the South African aggressors.\n\nThe battle of 1987-8 Kuito Cunavale broke the back of the Apartheid army as FAPLA, SWAPO and ANC forces backstopped by Cuba turned the military tide.\n\nThe scared post imperial NATO bloc had no option but to accept the dusk of imperial minority settler Apartheid rule.\n\nAs of 1989, the United Nations brokered Peace Process opened the highway to independence for Namibia.\n\nBut Apartheid landmines still tried to stem the global push for peace, freedom and democracy for Namibia.\n\nThe instrument of evil manifested itself through a dark hand of Koevoet. This was special forces taking from Rhodesian Selous Scouts. It was commanded by Hans Dreyer, a killer of genocidal persuasion.\n\nAs the Peace Process unfolded, he launched a last gasp military effort to defeat peace-inclined SWAPO forces.\n\nThe South African government and some furtively sympathetic western nations joined the Koevoet bandwagon to try to frustrate and upend the Peace Process.\n\nAn alert Harare was not going to let the Apartheid racists get away with murders and massacres. A major diplomatic offensive at the United Nations in New York was launched to thwart the forces of evil.\n\nDr Stan Mudenge masterminded the diplomatic push in solid defence of SWAPO.\n\nI was in his team. To add potency, I was deployed to Windhoek to deal with the unfolding scenarios. We worked under the auspices of the Frontline States Observer Mission duly accredited to Pretoria.\n\nThese efforts took traction when we succeeded to split the then West Germany from those western nations that were prone to geopolitical malfeasance. The goodwill from Bonn, underpinned by its deep pockets proved a boon to Frontline State Diplomacy in Windhoek.\n\nThe UN Peace Process was saved.\n\nHarare then re-directed its efforts to ground work in Windhoek to make sure SWAPO would harvest deserved victory.\n\nA lot of drive went into coalescing all progressive minded Namibians into a solid electoral front. This was all done with the blessing and guidance of President Sam Nujoma of SWAPO.\n\nPresident Robert Mugabe concurrently turned to the actual mechanics and processes of elections drawing upon ZANU PF electoral victory in 1979.\n\nHe instructed Cde Emmerson Mnangagwa, his fail-safe point man to organise a seminar in Harare. Its purpose was to impart electioneering techniques to the home-return SWAPO Campaign Team led by Dr Hage Geingob, the SWAPO electoral work horse.\n\nI was flown in from Windhoek to Harare for this seminar. I had to provide focus on the ground realities and winning strategies.\n\nI was well prepared. I had wise and deep counsel of Namibian fractious politics from Godwin Matatu, the venerated Zimbabwean reporter long based in London.\n\nAll said, Harares politico-diplomatic initiatives on Namibia were amply rewarded by a solid SWAPO victory in 1989. And Namibia joined the comity of nations as a free sovereign and democratic nation.\n\nPresident Nujoma never forgot the timely and vigorous support of Zimbabwe as Namibian dusk turned to dawn.\n\nIt is this context that explains the bush whacking of war mongering Tony Blair by Sam Nujoma at the Sandton Convention Centre.\n\nWe here in Southern Africa have one big problem created by the British. The honourable Tony Blair is here and he creates the situation in Zimbabwe\n\nExposed, the humiliated Tony Blair had to leave the deliberations of the Summit on Sustainable Development in ignominy and shame.\n\nSADC, a subregional bloc has one unique virtue of a shared political soul among bonded neighbours. This soul is begot from fighting together in the trenches by the various national liberation movements.\n\nSam Nujoma is the last to go from that doyen of African luminaries charting the African Renaissance.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Untitled-120-680x380.jpg",
            "description": "Ambassador Christopher Mutsvangwa Africa began its continental decline from the time Europe took the lead in the accumulation of capital and emergency of  the industrial revolution. A dark cloud of large scale trans-Atlantic slavery inexorably led to imperial wars of colonial conquest, settler encroachment and the attendant vices of racism and Apartheid. Even then by […]",
            "time": "08:34",
            "date": "11 Feb 2025"
        },
        {
            "title": "CHEVRONS FAIL IRISH TEST",
            "url": "https://www.herald.co.zw/chevrons-fail-irish-test/",
            "content": "Brandon Moyo, Zimpapers Sports Hub\n\nZIMBABWES poor run in international cricket continued as they suffered a pathetically humbling 63-run loss at the hands of Ireland in a one-off Test match at Queens Sports Club yesterday.\n\nThere is no justification for the defeat for the Chevrons, who lost to an Ireland team that hadnt played cricket for four months and are in the off-season.\n\nZimbabwe put in a dismal show, especially with the bat. After Ireland won the toss and elected to bat first, they were bowled out for 260 in 56.4 overs courtesy of a Blessing Muzarabani seven-for. The Chevrons went on to take a seven-run lead going into the second innings, crumbling to 267 all out. Nick Welch was the stand-out performer with the bat for Zimbabwe, scoring 90 runs on debut while Muzarabani chipped in with a handy 47.\n\nIn the second innings, Ireland responded with 298 all out, setting Zimbabwe a target of 292 runs to win. The Chevrons, however, were bowled out for 228 runs with Wessly Madhevere playing a gallant innings with the bat.\n\nSpeaking after the conclusion of the game, Zimbabwe head coach Justin Sammons said its a worrying trend that his team always gets into good positions but ends up losing at the end of the day.\n\nIts a bit of a trend at the moment. We find ourselves in strong positions, and theres a trend in that. We seem to really fight when the chips are against us, and when we are on top, thats where we are not being ruthless enough. It will be a combination of the mental side of things along with the technique and execution of certain skills in those moments, said Sammons.\n\nThe Zimbabwean coach added, Having them six down for 80 on day one, we knew we had to be ruthless, and we let them walk with poor, ill-disciplined bowling from the backup seamers in that moment. And that let them get away from us.\n\nWe could have restricted them to a lower score if we had been more disciplined with the ball. In our first innings with the bat, we knew we needed to put a big score on the board given the conditions. The conditions were good for batting, and essentially, that is where we dropped the ball. We should have at least gotten a 100-run lead going into Day Three or during Day Three.\n\nThe Chevrons went into the final day yesterday with three wickets in hand, needing 109 runs. Madhevere was the only recognised batter remaining in the middle. It was a tall order for Zimbabwe, who had to rewrite the history books if they were to win.\n\nThe only scenario in Test cricket that a side with three wickets in hand needing over 100 runs to win was when Pakistan stunned Australia in Karachi in 1994. They won by one wicket.\n\nIf youre seven down going into day five needing over 100, its always going to be a challenge to get that. Things need to go right, and kudos to Wessly for being there at the end. If Newman had put in 30 with Wessly, then thats a 60-run partnership, Richard comes in and gets another 30 while Wessly is still there, then suddenly youre closer to the target.\n\nBut a lot had to go right. Essentially, we were asking the tail to do what the top order should have done. At the end of the day, its not the tails responsibility; its the top orders responsibility to go and get the majority of the runs, said Sammons.\n\nZimbabwe began day five on 183/7 with Madhevere batting with Nyamhuri. The former survived a run-out in the first over of the day.\n\nNyamhuri didnt stay for long in the middle as he was trapped in front for eight runs by Matthew Humphreys.\n\nThe game was all but sealed for Ireland when Humphreys bowled Madhevere for a gallant 84 runs off 195 deliveries.\n\nAndy McBrine wrapped things up for the visitors with the wicket of Richard Ngarava, whom he bowled for 14 runs off 38 balls.\n\nMadheveres 84 runs is now the record for the highest score by a Zimbabwean batting number six in a Test chase, surpassing the record of 53, which was set by Craig Ervine against Afghanistan at the same venue in January.\n\nWith Madhevere top scoring for Zimbabwe in the second innings, Brian Bennett fell five runs short of his half-century on 45 runs off 72 balls, while the skipper, Johnathan Campbell, fell for 33 runs from 62 deliveries.\n\nHumphreys finished with figures 6/57 in 28 overs his best numbers in Test cricket and the overall best for Ireland in the format.\n\nBarry McCarthy picked up two scalps while Mark Adair and McBrine took one apiece.\n\nMcBrine was named player of the match for his heroics with the bat and ball in the first innings.\n\nIt was Irelands third Test win on the trot and the second time in history that a teams first three victories in the format are consecutive. The first team to achieve this feat is South Africa.\n\nZimbabwe only have a few days to lick their wounds as they return to action on Friday for the first One Day International (ODI) against Ireland.\n\nThe white-ball games are scheduled for Harare Sports Club.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Muzarabani.jpg",
            "description": "Brandon Moyo, Zimpapers Sports Hub ZIMBABWE’S poor run in international cricket continued as they suffered a pathetically humbling 63-run loss at the hands of Ireland in a one-off Test match at Queens Sports Club yesterday. There is no justification for the defeat for the Chevrons, who lost to an Ireland team that hadn’t played cricket […]",
            "time": "08:34",
            "date": "11 Feb 2025"
        },
        {
            "title": "Parliament resumes sitting",
            "url": "https://www.herald.co.zw/parliament-resumes-sitting-11/",
            "content": "Farirai Machivenyika, Senior Reporter\n\nParliament resumes sitting today after a nearly two-month break with their work cut out for them.\n\nThe two houses adjourned in December last year for the festive season just after passing the 2025 national budget.\n\nWhile the houses will resume business today, portfolio committees where a lot of the detailed work is done, have already begun operating with most of them holding closed-door in-house meetings.\n\nBills that are before them include the Persons with Disabilities Bill, the Parks and Wildlife Amendment Bill, the Private Voluntary Organisations Amendment Bill, the Mines and Minerals Amendment Bill, the Medical Services Amendment Bills, the Insurance and Pensions Commission Amendment Bill, the Broadcasting Services Amendment Bill and the State Services (Pensions) Amendment Bill.\n\nThe Persons with Disabilities Bill seeks to improve the rights and freedoms of people with disabilities and will replace the present Disabled Persons Act, which is outdated. It will align Zimbabwes disability law with the United Nations Convention on the Rights of Persons with Disabilities.\n\nThe Parks and Wildlife Amendment Bill seeks to, among other provisions, empower communities next to parks in the management of wildlife and so that they benefit from any related commercial activities and also provide compensation to victims of conflicts involving wildlife.\n\nThe Private Voluntary Organisations Amendment Bill was recommitted to the Senate to consider amendments to some clauses that were made in the National Assembly but were omitted in the Bill that was sent to the Senate.\n\nThe Bills seek to improve the management, accountability and transparency in the management of charity organisations.\n\nThe Mines and Minerals Amendment Bills seek to among others, ensure communities benefit from minerals resources in their communities and address the rights of farmers where minerals are found on their farms.\n\nSome of the Bills have been in Parliament for some time as everyone tries to get them exactly right, with President Mnangagwa withholding his assent to a Bill that was passed in 2018 as he felt some of its provisions violated the Constitution.\n\nThe Medical Services Amendment Bill brings the Act into line with the Constitution, especially in the Declaration of Rights where the right to health care for all citizens and permanent residents is entrenched along with the rights of children, rights of the elderly, rights of the disabled and rights of war veterans where medical services are a factor.\n\nThe Insurance and Pensions Commission Amendment Bill seeks to widen the mandate of the commission to improve accountability and transparency in the management of insurance and pension funds.\n\nThe Broadcasting Services Amendment Bill will, among other things, rationalise foreign ownership of a broadcasting licence up to 40 percent to allow growth and investment in the sector while the State Services (Pension) Amendment Bill will establish a proper pension fund that will pay out State pensions from its investment income and move away from the pay-as-you-go scheme now operating where the monthly deductions from active civil servants are turned into the monthly pensions for those who have retired.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Parliament-of-Zimbabwe.jpg",
            "description": "Farirai Machivenyika, Senior Reporter Parliament resumes sitting today after a nearly two-month break with their work cut out for them. The two houses adjourned in December last year for the festive season just after passing the 2025 national budget. While the houses will resume business today, portfolio committees where a lot of the detailed work […]",
            "time": "08:34",
            "date": "11 Feb 2025"
        }
    ]
}