{
    "news": [
        {
            "title": "Second Republic registers 346 signature projects",
            "url": "https://www.herald.co.zw/second-republic-registers-346-signature-projects/",
            "content": "Zvamaida Murwira, Senior Reporter\n\nGOVERNMENT has successfully implemented 346 signature projects in the last 300 days as the Second Republic, led by President Mnangagwa, makes huge strides towards modernising the country in line with National Development Strategy 1 (NDS 1) aimed at transforming Zimbabwe into an upper middle income economy by 2030.\n\nGiving an appraisal of the last three 100-day cycle projects in Harare yesterday, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere said many successes were registered last year in different pillars, including infrastructure and utilities, digital economy, food security and nutrition, economic growth and stability, image building, engagement and re-engagement.\n\nOther areas include environmental protection, climate resilience and natural resource management, social protection, governance, housing delivery, human capital development and innovation, devolution and decentralisation, and health and well-being, among others.\n\nI am honoured to address you on behalf of the Government of Zimbabwe on the significant strides made towards the betterment of our country by the visionary leadership of His Excellency, President Dr E.D Mnangagwa, Dr Muswere said.\n\nIn 2024 alone, three 100-Day cycles and 346 projects were successfully implemented. The chairpersons of NDS1 thematic working groups were requested to submit programmes and projects that they implemented in 2024 and to that effect, 834 were submitted.\n\nA standardised template was distributed to MDAs (ministries, departments and agencies) to guide selection of projects. In the next few days, I will elaborate on the NDS1 achievements and other programmes. Some of the achievements in the year 2024 include the development of the first Integrated Media and Communications Policy.\n\nInformation, Publicity and Broadcasting Services Minister Dr Jenfan Muswere addresses the media on the 100-day cycle projects implemented by the Second Republic.  Picture: Edward Zvemisha\n\nOn the infrastructure and utilities pillar, Dr Muswere said last year, the Government implemented projects that focused on provision of road and aviation networks and utilities such as water and electricity.\n\nThey included the expansion and construction of a new VVIP Pavilion at Robert Gabriel Mugabe International Airport in Harare, the Dete Community solar project in Matabeleland North Province, the Harare-Masvingo-Beitbridge road upgrade, the Shurugwi-Mhandamabwe road rehabilitation, the repair of 2 000 boreholes across the country and the drilling of 3 528 boreholes under the Presidential Borehole Drilling Programme.\n\nOther projects include the Mbudzi Interchange construction project, which Dr Muswere described as an engineering marvel, the Harare-Kanyemba Road construction, the Great Zimbabwe 5MW Hydro Power Station in Masvingo, and construction of New Parliament Building access roads in Harare, Mashonaland West and Mashonaland Central provinces.\n\nUnder the digital economy pillar, Dr Muswere said the Government invested in expanding ICT infrastructure, promoting digital literacy, and supporting technology start-ups.\n\nThe start-ups include the Media and Communication Policy, the National E-learning Strategy (computerisation of 1 000 schools to bridge the urban-rural divide), the National ICT Policy launch, the Artificial Intelligence Strategy approval, the licensing of Starlink, electronic passports for citizens in Harare, Guruve, Murehwa, Lupane, Beitbridge, Zvishavane, Marondera and Gweru, among others.\n\nOn the food security and nutrition pillar, Dr Muswere said many projects including dams were constructed.\n\nIn an effort to combat the effects of El-Nino on citizens, livestock, and crop production, the Government of Zimbabwe employed diverse climate proofing strategies chief among them the Pfumvudza/Intwasa programme, food distribution, Presidential Livestock and Stock Feed Programme under disaster risk management. These were all launched and implemented, he said.\n\nMahusekwa District Hospital in Mashonaland East Province was one of the major projects toured by Information, Publicity and Broadcasting Services Minister, Dr Jenfan Muswere, last week.  Picture: Joseph Manditswara\n\nIrrigation rehabilitation and accelerated dam construction across the country was done to boost food security.\n\nDams such as Kunzvi in Mashonaland East, Muchekeranwa Dam on the border of Mashonaland East and Manicaland, Tugwi-Mukosi in Masvingo, Semwa in Mashonaland Central and Lake Gwayi-Shangani in Matabeleland North have been constructed and some are complete and already transforming lives while others are over 70 percent complete.\n\nOn the economic growth and stability pillar, Dr Muswere said Government initiated many programmes such as the debt and arrears clearance programme, tamed inflation, and introduced a gold-backed currency, among others.\n\nRegarding image building and the engagement and re-engagement programme, Dr Muswere said President Mnangagwas administration rehabilitated infrastructure in foreign missions and installed broadcasting infrastructure, which is critical for enhancing Governments image and improved economic diplomacy. It also hosted the 44th Sadc Summit in August and the SADC Extraordinary Summit in November.\n\nOn the social protection pillar, Dr Muswere said the Government focused on the protection of individuals and communities from poverty, vulnerability and social exclusion.\n\nIt also implemented programmes that promoted social justice, human rights and economic security, especially for the marginalised and vulnerable population, he said.\n\nOn governance, there was the construction of magistrate courts, and the implementation and operationalisation of the Integrated Electronic Case Management System, among others.\n\nOn housing delivery, the Government constructed affordable and decent houses in many towns for its workers.\n\nIn terms of human capital development and innovation, learners were prepared to become socially and economically empowered through quality and innovation education.\n\nOn youth, sports and culture emphasis was on fighting socio-economic ills that include drug and substance abuse as well as unemployment.\n\nA lot was also done on health and wellbeing last year including emphasising on improved high-quality care that is affordable and accessible.\n\nAll these initiatives are as a result of the selfless steward leadership of His Excellency, President ED Mnangagwa.\n\nAs we move into 2025, the nation will be guided by NDS2, which is set to propel economic growth and prosperity through technological advancement, Dr Muswere said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/HE.jpg",
            "description": "Zvamaida Murwira, Senior Reporter GOVERNMENT has successfully implemented 346 signature projects in the last 300 days as the Second Republic, led by President Mnangagwa, makes huge strides towards modernising the country in line with National Development Strategy 1 (NDS 1) aimed at transforming Zimbabwe into an upper middle income economy by 2030. Giving an appraisal […]",
            "time": "08:41",
            "date": "06 Jan 2025"
        },
        {
            "title": "Health time bomb looms for Harare residents",
            "url": "https://www.herald.co.zw/health-time-bomb-looms-for-harare-residents/",
            "content": "Zvamaida Murwira, Senior Reporter\n\nTHE Ministry of Health and Child Care has instituted investigations into the public health implications of a decision by Harare City Council to allow a cemetery to be established on top of the main trunk of Prince Edward waterworks near Chitungwiza.\n\nThe development raises fears of water contamination, reminiscent of the recent Lake Chivero pollution incident that claimed wildlife and fish.\n\nTwo weeks ago, Harare City Council was discharging raw sewage into Mukuvisi River, which flows into Lake Chivero, the citys main water source.\n\nThe situation has created health and environmental hazards to both humans and livestock.\n\nIt has also emerged that council has granted a permit to a private cemetery project north-west of the Prince Edward water treatment plant along Seke Road.\n\nResidents and stakeholders have raised concern about risks posed by decomposing human remains that can result in the contamination of treated water should there be a line rupture or a burst pipe within the cemetery area.\n\nStakeholders who spoke to The Herald during a week-long investigation said the cemetery was located too close to the stream feeding into the raw water source, raising chances of contamination of Seke Dam on ground and surface water.\n\nDead bodies and coffins secrete chemicals and impurities that could be carried by rainwater seeping into graves or buried bodies, which might eventually get into direct contact with groundwater that will inevitably permit seepage to flow, combining with groundwater into the raw water source, causing untold health challenges.\n\nEmbalming fluids and preservatives on coffins may contain harmful chemicals like mercury which might also contaminate water, experts have warned.\n\nIn an interview, the Permanent Secretary for Health and Child Care, Dr Aspect Maunganidze, said his ministry had constituted a team to make an assessment of the health prudence of allowing a cemetery on that particular area.\n\nOur team went to assess. They are compiling a report. The minister is likely to issue a statement on it after we go through it, said Dr Maunganidze.\n\nHarare City Council director of Works, Engineer Zvenyika Chawatama, confirmed that they had issued a permit for the project.\n\nHe said health concerns have been raised, including from within the citys Department of Water and they were pursuing remedial action.\n\nConcerns on the water pipeline that passes through the property were recently raised by Harare Water, said Eng Chawatama, who at the time of the interview last week was the citys acting town clerk in the absence of the incumbent.\n\nWe have asked our surveyors to pick up the line so that we wont have structures or graves over it. The other matters raised will be dealt with through an environmental impact assessment process that will be done before the project becomes operational. Environmental Management Agency (EMA) will lead the process and all stakeholders will be consulted.\n\nIn the event that burials are happening before an EMA certificate is granted, then they have to be stopped.\n\nQuestions have also been raised about the issuance of a permit at a time when there was no Environmental Impact Assessment from EMA.\n\nThe citys acting director of Urban Planning, Mr Samuel Nyabezi, defended the decision.\n\nThe permit is issued with conditions; one of which is for an EIA done and approved by EMA. Failure to meet any one of the conditions results in the permit falling away.\n\nThe EIA process is an expensive exercise and it would not be proper for one to incur such high costs where there is no guarantee that a permit will be granted  said Mr Nyabezi.\n\nContacted for comment, EMA spokesperson, Ms Amkela Sidange, said they initially conducted an ecological assessment where they recommended for an exclusion of 22 hectares wetland area, leaving 55 ha non-wetland area.\n\nShe said after an assessment, an EIA was eventually issued.\n\nRegarding the public health implications, Ms Sidange said: Issues of health implications as spelt out in the context of handling of dead bodies and their disposal can best be handled from the public health scope.\n\nOtherwise planning authorities should always be proactive to avert such eventualities, through their environmental health experts and civil engineering department during land use planning and allocation.\n\nCemeteries by their nature are a key function in any settlement development and planning authorities should, just like in any other land use planning stage, exercise due diligence.\n\nMs Sidange said EMA is continuously calling upon planning authorities to ensure that settlement developments integrate environmental considerations and exhibit best practices to protect the environment and the public.\n\nHealth experts spoken to by The Herald expressed reservations about the health prudence of setting up a cemetery in the area.\n\nThat area is bad for a cemetery project to say the least. There are high chances of contamination of the citys raw water source such as Seke dam which is mostly to be in form of both ground water and surface, said one public health expert.\n\nBesides, the procedure of issuing an EIA certificate and the permit include consulting several stakeholders including those in the surrounding areas, something which was not done in the present case.\n\nWe might have a replica of the Lake Chivero water contamination but this time at a huge proportion. We also wonder why the city has not taken heed of recommendations by its own department, the Department of Water, which raised a red flag over the project.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/11/Dr-Aspect-Maunganidze.jpg",
            "description": "Zvamaida Murwira, Senior Reporter THE Ministry of Health and Child Care has instituted investigations into the public health implications of a decision by Harare City Council to allow a cemetery to be established on top of the main trunk of Prince Edward waterworks near Chitungwiza. The development raises fears of water contamination, reminiscent of the […]",
            "time": "08:41",
            "date": "06 Jan 2025"
        },
        {
            "title": "Commission to train traditional leaders",
            "url": "https://www.herald.co.zw/commission-to-train-traditional-leaders/",
            "content": "Herald Reporter\n\nThe Judicial Service Commission has embarked on a capacity building programme for traditional leaders in which they will be trained on how to improve their skills and knowledge as they preside over customary cases in their jurisdiction.\n\nThe training is expected to go a long way in capacitating them and enhance the administration of justice at all tiers of justice delivery system and dovetails with the National Development Strategy 1.\n\nIn a recent interview, JSC secretary, Mr Walter Chikwana said traditional leaders preside over customary law courts hence they were part of the justice delivery system where they equally needed to be capacitated.\n\nWe are going to interact a lot with our traditional leaders. We have taken a position as JSC that we need to support and adequately resource our traditional leaders.\n\nThe Constitution is clear that the customary law courts are part of the judiciary and customary law courts are adjudicated upon by chiefs, they are part of the judiciary, so we have an obligation as JSC to support them, said Mr Chikwanha.\n\nEqually important, we need to support them in terms of skills development. We have mandated the head of the judiciary training institute to start a training programme for those chiefs so that they observe, for example, the rules of natural justice when they preside over their cases.\n\nHe said JSC had since engaged the Chiefs Council led by its leader, Chief Mtshane Khumalo and they have agreed on the parameters.\n\nI have held a meeting with the Chiefs Council President Mtshane Khumalo where we have agreed on the roadmap that we are going to take in terms of capacitation of the chiefs. So the capacitation of customary law courts is not only restricted in training, but also in resources where we need to resource them properly so that the courts will adjudicate matters, respecting the fundamental human rights of our people, he said.\n\nMr Chikwana said it was critical that customary law courts be torch bearers in terms of discharging quality justice.\n\nIn an interview, Chief Khumalo said: Its true the Judicial Service Commission has been in touch with us as the Chiefs Council of Zimbabwe on training and other capacitations. It has been long since the Ministry of Justice, Legal and Parliamentary Affairs or Judicial Service Commission has undertaken any training to boost traditional leaders ethics and procedures on Customary and Local Courts Act as presiding officers of those courts at community level.\n\nThe last interaction was in 2018 and at our last meeting in early December 2024, we agreed to come up with chiefs who will sit on some of the sub-committees like legislative, training and others. The Judicial Service Commission has already been furnished with that list and we hope the sub-committees will start operating sometime this year.\n\nIn the past, the social media has been abuzz with videos of some traditional leaders saying unpalatable words on litigants such as defendants in their customary law courts.\n\nThis has raised concern by some stakeholders who called for their training.\n\nThe recently promulgated Marriages Act has also conferred traditional leaders as marriage officers where they can legally preside over unions.\n\nThis has also created a need for further training so that they have an appreciation of the law.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/06/Mr-Walter-Chikwanha.jpg",
            "description": "Herald Reporter The Judicial Service Commission has embarked on a capacity building programme for traditional leaders in which they will be trained on how to improve their skills and knowledge as they preside over customary cases in their jurisdiction. The training is expected to go a long way in capacitating them and enhance the administration […]",
            "time": "08:41",
            "date": "06 Jan 2025"
        },
        {
            "title": "Civil service  rebate scheme: Govt heightens  vigilance",
            "url": "https://www.herald.co.zw/civil-service-rebate-scheme-govt-heightens-vigilance/",
            "content": "Fidelis Munyoro, Chief Court Reporter\n\nGOVERNMENT has heightened its vigilance against fraudulent practices, and is now meticulously tracking all vehicles imported under the Civil Service Rebate Scheme to ensure compliance with lawful procedures.\n\nThis follows damning allegations that a significant number of beneficiaries exploited counterfeit rebate letters to unlawfully import vehicles.\n\nThe scam centres around 19 police officers, who now stand accused of circumventing legitimate channels to acquire their vehicles.\n\nRather than submitting to the Zimbabwe Revenue Authoritys directive for post-clearance audits, the officers, stationed across various precincts in Mashonaland West Province, opted for a legal showdown.\n\nIn a dramatic turn, they rushed to the High Court with an urgent application seeking to suspend Zimras directive, a move that underscores the tension brewing between law enforcement and tax authorities.\n\nThe Civil Service Rebate Scheme, introduced as a Government initiative to afford eligible civil servants the privilege of importing vehicles under tax rebates, is now mired in controversy.\n\nAllegations have surfaced that the applicants manipulated the system by submitting fraudulent rebate letters.\n\nThese vehicles, now registered with the Central Vehicle Registry in their names, became the focus of an intensifying inquiry after a directive issued on November 22 by the Commissioner-General of Police.\n\nThe directive ordered officers who had benefited from the scheme to present their vehicles for an audit by November 29, 2024.\n\nRather than comply, the officers mounted a spirited defence, claiming they had adhered to all legal requirements and that their vehicles had undergone proper clearance.\n\nThey argued, through their lawyer, Mr Jimmy Zuze, that the directive was unlawful and that the confiscation of some of their vehicles by the police amounted to an illegal deprivation of property.\n\nThe applicants accused Zimra and the police of overstepping their statutory authority, asserting that the law only permits Zimra to inspect and take possession of documents  not physical goods  under Section 223A of the Customs and Excise Act (Chapter 23:02).\n\nZimra, however, countered these assertions with the force of law.\n\nThrough its legal representative, Mr Tinashe Lester Marange, the revenue authority argued that their actions were well within the bounds of the Act.\n\nZimra maintained that Section 223A grants it the power to conduct post-clearance audits, which includes not just document examination but, where necessary, the physical inspection of goods.\n\nMr Marange further clarified that Section 223A must be read in conjunction with Section 193, which empowers Zimra to seize goods liable to seizure.\n\nCrucially, Zimra emphasised that they had not seized the vehicles in question but merely required their temporary availability for auditing purposes.\n\nIn a further blow to the applicants case, Mr Tinashe Serengwa, representing the Commissioner-General of Police, argued that the police merely served as facilitators of Zimras directive.\n\nHe pointed to Section 219(2)(b) of the Constitution, which mandates the police to co-operate with other lawfully constituted bodies in the detection, investigation, or prevention of offences.\n\nMr Serengwa contended that the Zimra directive was a lawful operation conducted in the interests of accountability, and as such, it could not be interdicted.\n\nThe case reached its crescendo in the Chinhoyi High Court before Justice Phildah Muzofa, who delivered a decisive and meticulously reasoned judgment.\n\nDismissing the officers application with costs, Justice Muzofa ruled that Zimras post-clearance audit was a lawful and necessary mechanism to ensure the integrity of the rebate scheme.\n\nSection 223A gives Zimra powers to conduct post-clearance audits to satisfy itself that goods were properly imported. This is a lawful process that cannot be interdicted, she said.\n\nJustice Muzofa noted that Section 223A unequivocally empowers Zimra to conduct such audits, provided they begin with document examination before escalating to physical inspections if irregularities are identified.\n\nShe said the applicants failed to provide evidence that Zimra had unlawfully seized or impounded their vehicles.\n\nInstead, they were simply required to bring their vehicles to Zimras offices for inspection, a directive they failed to comply with.\n\nThe judge found no merit in the applicants claims that their rights had been infringed upon, rendering any further arguments moot.\n\nIn her judgment, Justice Muzofa also highlighted the applicants failure to engage with Mr Maseko, the Zimra official designated to clarify the audit process. Despite clear instructions to contact Mr Maseko for guidance, the applicants made no attempt to seek clarification, which Justice Muzofa deemed a critical oversight.\n\nShe concluded that the applicants reluctance to address their queries with Zimra left their case fatally flawed.\n\nAccording to the Zimra directive, the applicants were supposed to contact one Mr Maseko whose details were provided if they had any queries. There was no indication that Mr Maseko was contacted to clarify what exactly they were supposed to do, Justice Muzofa said.\n\nThe ruling sends a resounding message that the post-clearance audit process is a lawful, unassailable mechanism designed to uphold the integrity of tax compliance.\n\nJustice Muzofas judgment not only vindicates Zimras mandate, but also underscores the principle that no individual, regardless of rank or office, is above the law.\n\nLegal experts say the dismissed application serves as a cautionary tale for those who might seek to exploit Government schemes for personal gain.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2014/04/Zimra.jpg",
            "description": "Fidelis Munyoro, Chief Court Reporter GOVERNMENT has heightened its vigilance against fraudulent practices, and is now meticulously tracking all vehicles imported under the Civil Service Rebate Scheme to ensure compliance with lawful procedures. This follows damning allegations that a significant number of beneficiaries exploited counterfeit rebate letters to unlawfully import vehicles. The scam centres around […]",
            "time": "08:41",
            "date": "06 Jan 2025"
        },
        {
            "title": "Blitz on timber poaching",
            "url": "https://www.herald.co.zw/blitz-on-timber-poaching/",
            "content": "Remember Deketeke, Herald Reporter\n\nA BLITZ against illegal wood cutting and logging has been launched to shield the countrys natural resources from deforestation, Environment, Climate and Wildlife Minister Sithembiso Nyoni has said.\n\nThe initiative, announced last week, comes in response to rising concerns over deforestation and its impact on biodiversity and climate change.\n\nTimber poaching and the growing stockpiles of firewood in urban residential areas like Mbare and Glen View in Harare, which is further driving our already high levels of deforestation, has become a major cause for concern, she said.\n\nTimber poaching poses a significant threat to our forests and ecosystems. This blitz is essential to safeguard our natural heritage and ensure sustainable management of our forest resources.\n\nThe Governments strategy includes increased surveillance and enforcement, with the deployment of forest rangers and law enforcement officials to high-risk areas.\n\nThe Ministry through the Forestry Commission is taking appropriate action. Trucks with charcoal and poached timber are being intercepted at border posts almost daily thanks to our timber regulation operations together with our regulation enforcement partners such as the Zimbabwe Republic Police, Zimbabwe Revenue Authority and the Zimbabwe Prisons and Correctional Services, said Minister Nyoni.\n\nHer Ministry was collaborating with local communities to raise awareness about the importance of forest conservation and the legal implications of timber poaching.\n\nEngaging local communities is crucial. They are our first line of defence in protecting these resources, she said.\n\nThe Governments blitz on timber poaching is expected to have significant implications for both the environment and the economy, as it seeks to balance conservation efforts with the needs of local communities.\n\nAs the campaign unfolds, stakeholders remain hopeful that it will lead to a significant reduction in illegal logging activities and promote sustainable forestry across the nation.\n\nFarmers and others are encouraged to grow their own timber for firewood, rather than chop down natural woodland.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2018/06/SITHEMBISO-NYONI.jpg",
            "description": "Remember Deketeke, Herald Reporter A BLITZ against illegal wood cutting and logging has been launched to shield the country’s natural resources from deforestation, Environment, Climate and Wildlife Minister Sithembiso Nyoni has said. The initiative, announced last week, comes in response to rising concerns over deforestation and its impact on biodiversity and climate change. “Timber poaching […]",
            "time": "08:41",
            "date": "06 Jan 2025"
        },
        {
            "title": "‘President’s leadership transforms Zanu PF’",
            "url": "https://www.herald.co.zw/presidents-leadership-transforms-zanu-pf/",
            "content": "Joseph Madzimure, Zimpapers Politics Hub\n\nPRESIDENT Mnangagwas leadership has revitalised the revolutionary party, Zanu PF, making it the preferred choice of many people in general, and voters in particular, the partys Secretary-General, Dr Obert Mpofu, has said.\n\nThe transformation of the ruling party by the President, who is also its First Secretary, has led to unprecedented success and strengthened its position on the political landscape.\n\nZanu PF, through its Government, has created a contemporary and vibrant socio-economic and political landscape, albeit in an environment riddled with machinations by perennial detractors as well as the illegal sanctions imposed on the country by the West, which have the goal of effecting regime change.\n\nIn an interview, Dr Mpofu said the party has remained resilient, being spurred on by the mantra, Nyika inovakwa, inotongwa, igonamatigwa nevene vayo/Ilizwe lakhiwa, libuswe, likhulekelwe ngabanikazi balo.\n\nDr Mpofu said Zanu PF has revamped its structures and management to transform the party into an efficient and modern political entity.\n\nThis aligns with the resolution passed at the 18th Annual National Peoples Conference in Goromonzi, Mashonaland East province in 2019, directing the party to prioritise strengthening and professionalising its departments for optimal operational efficiency in implementing its manifesto, overseeing Government programmes and executing party initiatives.\n\nThrough this rallying call, Government seeks to attain the status of an upper-middle-income society by 2030.\n\nDr Mpofu highlighted that the National Development Strategy 1 (NDS1) has been pivotal in Zimbabwes economic revival and is now making way for National Development Strategy 2 (NDS2) beginning this year.\n\nUnder the leadership of President Mnangagwa, the Government has achieved significant milestones including large-scale infrastructure projects, improved business environment, robust monetary and fiscal reforms, technology adoption, agricultural advancements, skills enhancement, and enhanced public service delivery, he said.\n\nZimbabwe, Dr Mpofu said, has regained prominence regionally and internationally through President Mnangagwas engagement and re-engagement policies.\n\nAs a former liberation movement, Zanu PF serves as a source of inspiration in the fight against imperialism and neo-colonialism in the region.\n\nPresident Mnangagwas appointment as Chairman of SADC from August last year, offers Zimbabwe an opportunity to share its experiences with the region, showcasing how the Government has steered the country towards prosperity in challenging circumstances.\n\nThe courage, tenacity, resilience, and determination of Zimbabweans in reclaiming their land against all odds, stand as a beacon to sister revolutionary parties in the region, said Dr Mpofu.\n\nIn the August 2023 harmonised elections, Zanu PF walloped the opposition CCC and other opposition parties, as many people embraced President Mnangagwas economic transformation and development policies.\n\nThe lions share of by-elections held since the August 2023 elections have been won by the ruling party, a development that gave it a healthy two-thirds majority. With the opposition disintegrating, it is hoped that Zanu PF will win the 2028 elections resoundingly.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Obert-Mpofu.jpg",
            "description": "Joseph Madzimure, Zimpapers Politics Hub PRESIDENT Mnangagwa’s leadership has revitalised the revolutionary party, Zanu PF, making it the preferred choice of many people in general, and voters in particular, the party’s Secretary-General, Dr Obert Mpofu, has said. The transformation of the ruling party by the President, who is also its First Secretary, has led to […]",
            "time": "08:41",
            "date": "06 Jan 2025"
        },
        {
            "title": "EDITORIAL COMMENT: Targets emerge for upgrade of procurement practices",
            "url": "https://www.herald.co.zw/editorial-comment-targets-emerge-for-upgrade-of-procurement-practices/",
            "content": "Government procurement has been continuously tightened over the past few years by the Second Republic as each weakness was identified, with State procurement officers made to assume far greater responsibility in going through each deal and then enforcing quality and costing standards.\n\nAt the same time a double system of checks was put in place beyond simple reliance on audits over a year later to make corruption and simple inattention to detail far more difficult, the procuring ministry having to make its own assessments and then have these checked out by the Ministry of Finance, Economic Development and Investment Promotion before any payments were made.\n\nBut there is always room for improvement, and systems need to be continually improved to make sure that contractors are not taking the Government for a ride and that the taxpayers are getting maximum value for the money they are legally obliged to hand over at regular intervals.\n\nWith the latest set of efforts to incorporate the informal sectors into the formal tax-paying economy, there are many more taxpayers, and they all have made it clear that they want their money spent properly. A lot of the problems that centred on inefficient or corrupt politicians and civil servants have largely been beaten back thanks to the ruthless anti-corruption drive of the Second Republic.\n\nThis has seen prosecutions and civil seizures of tainted assets and we now see a reasonable flow of clean audit reports as the successes mount up.\n\nThere are still problems in the local government arena, especially in urban councils and from what is now being uncovered, in particular in Harare City Council, the largest.\n\nBut again President Mnangagwa, having insisted on the central Government clean-up with his full backing, is now insisting on the same clean up in local government. Obviously the systems put in place to prevent corruption, and which are now being extended into local government, need to be maintained and extended, but very largely we now know what corrupt officials can do and we are on our guard to prevent them from doing it.\n\nImprovements in procurement systems in this area are largely making sure that the potentially dishonest cannot make dishonest decisions because they will be quickly found out and that the actual dishonest spend some time in a prison cell.\n\nWhat are now far more common procurement problems centre on pricing and standards, and here the Government is now upgrading its procurements systems with inter-ministerial committees and other significant changes. What has been increasingly seen as a problem is a type of dishonesty among some of those tendering for Government contracts and dishonest or dubious behaviour among those who win the contracts. A fair amount of this totally undesirable activity is not necessarily criminal although it is totally undesirable.\n\nThere is nothing criminal about a supplier quoting an outrageous price although if they bribe a politician or civil servant to accept that price then we have a crime.\n\nThe Zimbabwean economy is fairly small. This means that reliance on pure competition to get the lowest possible price is not always effective, as there might either be only one serious contender for a contract, or a formal or informal cartel or even just a vague understanding among a small group of suppliers. This would include a small group of potential contractors wallowing in the same levels of inefficiency, or pegging themselves to the largest and its inefficiencies and practices.\n\nForeign contractors, of course, have far fewer inhibitions about milking Zimbabwe, even if they adorn this as accounting for risk.\n\nWhile it is permitted to quote in US dollars, with payment in many cases to be in ZiG at the prevailing rate of exchange on the date of payment, there have been numerous cases of potential suppliers using black market rates in a way that avoids a direct crime.\n\nThey start off with the real price, convert this to ZiG at the black market rate, and then convert that figure back to US dollars at the official rate to get a higher US dollar price. This is done since they plan on selling the ZiG they receive on the black market when they do actually commit a crime, but only at the very end of the process. Many go even further and do the first conversion at what some bar-room guru predicted would be the black market rate in a few months.\n\nOthers, vaguely less dishonest, feed in what they think the black market rate might be when they dump their own ZiG into the black market as a result of that dumping.\n\nEven when there is apparent competition, the number of suppliers is so small that it is very easy for them to meet and collaborate in price fixing or at least compare notes and without actually agreeing to anything dishonest, at least make each other aware of what they would like, perhaps during a round of golf. This is one problem the Government needs to sort out, so that competition is real, not pretend.\n\nThis is more difficult than ending corruption, because over charging is not criminal, just stupid in a properly competitive environment since the over-chargers then sell nothing. But there is a tendency for businesses to follow each other, even when they are not in formal alliance, and that needs to be broken.\n\nA fair amount of progress has been made by the Finance Ministry, now obliged to check each contract price before payment, first looking at the prices in the general local and global markets, and these days making the procuring ministry do the same. That needs to be continually upgraded.\n\nThis still leaves the problem when the local suppliers as a group overcharge and there is no alternative, but then it can be made clear that the Government can always set up its own unit. Having sorted out a lot of the corruption and inefficiency in Government, that has now become a real option in many cases.\n\nA lot of infrastructure used to be built by Government departments, which now tend to be limited to design, setting of standards and final inspection. But if contractors mess around on pricing and financial factors and compromise the standards, we can always return to what is in theory a more inefficient system, but which can outcompete a dubious private sector.\n\nPublic-private partnerships at most levels, from basic contracting all the way to long term financing arrangements should in many cases give the best value for money by a significant margin. But if that is not the case then they just a way of battening onto the Zimbabwe taxpayer.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/procurement.jpg",
            "description": "Government procurement has been continuously tightened over the past few years by the Second Republic as each weakness was identified, with State procurement officers made to assume far greater responsibility in going through each deal and then enforcing quality and costing standards. At the same time a double system of checks was put in place […]",
            "time": "08:41",
            "date": "06 Jan 2025"
        },
        {
            "title": "Mpilo introduces diploma in accident management",
            "url": "https://www.herald.co.zw/mpilo-introduces-diploma-in-accident-management/",
            "content": "Nqobile Tshili, Bulawayo Bureau\n\nMPILO Central Hospital in Bulawayo has launched Zimbabwes first post-basic nursing diploma in accident and emergency management, a pioneering initiative aimed at elevating the handling of accident victims to international standards.\n\nApproved by the Ministry of Health and Child Care last year, the two-year postgraduate programme commenced in September and has already begun equipping nurses with specialised skills to manage emergency cases effectively.\n\nIn an interview, Mpilo Central Hospitals chief medical officer, Dr Narcisius Dzvanga, revealed that the programme is being conducted in partnership with South Africas Witwatersrand University, which provides mentorship and support.\n\nWe have introduced a post-basic nursing diploma in accident and emergency management. Its the first of its kind in the country, with mentorship and support from Wits University in South Africa, in addition to our local mentors, said Dr Dzvanga.\n\nThis two-year programme is not only designed to improve emergency patient care at Mpilo Central Hospital, but also across the country. We have recruited staff from all corners of Zimbabwe, and as the number of trained professionals grows, we are confident more lives will be saved, he added.\n\nDr Dzvanga said the hospital seeks to tap into the skills from mentorship from the Wits University which is expected to provide material and human capital training.\n\nThe diploma curriculum includes training in patient management during air transport, aligning with the Governments Air Ambulance initiative launched last year. The service operates six helicopters stationed in Harare, Bulawayo, Victoria Falls, and Manicaland, providing emergency medical support nationwide.\n\nThe air ambulance service was launched in Zimbabwe in August in conjunction with the 44th SADC summit.\n\nThese specialised helicopters are equipped with advanced medical facilities and staffed by trained medical personnel. They are designed to overcome geographical barriers and provide the same level of medical care available in an intensive care unit.\n\nThe Second Republic has embarked on a mission to modernise the countrys healthcare system to achieve the goal of becoming a modern, prosperous and industrialised country by 2030.\n\nPresident Mnangagwa visited Russia in June to seek investors to establish an air ambulance service.\n\nWith an air ambulance based at United Bulawayo Hospitals and this new diploma, we are better positioned to save more lives. Part of their curriculum is that nurses are learning how to manage patients in the air, said Dr Dzvanga.\n\nIm looking forward to good results. As the programme grows, we aim to increase student intake to meet national needs.\n\nZimbabwe experiences a high frequency of road traffic accidents, with incidents occurring every 15 minutes and five fatalities recorded daily.\n\nDr Dzvanga noted that the programme is critical for equipping medical professionals with advanced skills to handle various types of accidents.\n\nWhile all doctors and nurses have basic training in accident and emergency care, this programme takes it a step further, aligning with international best practices. It prepares our staff to handle any accident, whether its a fall, car crash, or domestic assault, he explained.\n\nThe programme has 20 students, but Dr Dzvanga expressed hope that other central hospitals will adopt similar initiatives to broaden its impact.\n\nThis is just the beginning. Its like planting a seed and you dont expect to harvest your seed immediately. The programme is only a few months old, and students are still in the theoretical phase and are yet to come to the casualty to practice what they are learning, he said.\n\nMy goal is to see two intakes per year and other central hospitals offering this diploma so that we can create a real impact. With only 20 professionals for the entire country, its a drop in the ocean.\n\nDr Dzvanga said expanding the programme is essential to ensure that every corner of Zimbabwe benefits from improved emergency care.\n\nHe said the introduction of the diploma marks a significant step in addressing the countrys emergency healthcare challenges and underscores Mpilo Central Hospitals commitment to enhancing patient outcomes through innovation and collaboration.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/01/Mpilo-Central-Hospital.jpg",
            "description": "Nqobile Tshili, Bulawayo Bureau MPILO Central Hospital in Bulawayo has launched Zimbabwe’s first post-basic nursing diploma in accident and emergency management, a pioneering initiative aimed at elevating the handling of accident victims to international standards. Approved by the Ministry of Health and Child Care last year, the two-year postgraduate programme commenced in September and has […]",
            "time": "08:41",
            "date": "06 Jan 2025"
        },
        {
            "title": "Last known photo of Cde Tongo handed to family",
            "url": "https://www.herald.co.zw/last-known-photo-of-cde-tongo-handed-to-family/",
            "content": "Africa Moyo, Deputy News Editor\n\nWhat could be the last photograph of the late national hero and liberation war commander General Josiah Magama Tongogara has been handed over to the family.\n\nThe photograph was surrendered to the late Zanla military commanders widow, Senator Angeline Tongogara, by Zimbabwes Ambassador to Belarus, Ignatius Mudzimba, on December 26 last year at the National Heroes Acre during the annual commemorations of his death.\n\nAmbassador Mudzimba was a member of the Zanla General Staff and was appointed personal assistant to then Secretary General Robert Mugabe in December 1976.\n\nThe photo was taken in Brussels, Belgium, in November 1979 where the late President Mugabe had been invited by his friend, the late Frederick Dahlman, who was an engineer by training, but a major supporter of the liberation struggle.\n\nIt was November 1979 during the Lancaster House Talks, which had started in the month before, and it was during one of the breaks that the former President travelled to Brussels to meet Dahlman. He was accompanied by Gen Tongogara, Ambassador Mudzimba whose Chimurenga name was Cde Ignatius Muzenda and Cde Musafare Nyamudahondo, whose Chimurenga name was Innocent Nherera.\n\nThe breaks during the talks were meant to allow both sides time to reflect on or discuss the points raised by the other party among themselves so that no one rushed to accept or reject them.\n\nAmbassador Mudzimba learnt of the presence of such a picture in 2005 when the son of the now late Mr Dahlman, Mr Frederick Dahlman Jnr, looked for him when he was Deputy Ambassador in Brussels and delivered it.\n\nSaid Ambassador Mudzimba: The picture I have given to Mai Tongogara is very important because it reminds us of our General. It is possibly the last picture of General Tongogara taken during the Lancaster House Talks.\n\nThis picture was taken in Belgium, but it is important because no other known picture was taken after this one, so we value it so much and I am happy that Mai Tongogara was glad to receive the present, which reminds her of her husband who died a long time ago.\n\nIn her acceptance speech, Mai Tongogara said she was happy to receive the photograph, especially coming from Ambassador Mudzimba, who she knows from the time he was a young man during the war.\n\nHe is my son. I want to thank you for this gift. I also want to thank your family for being here because it shows you value this gathering.\n\nOthers will say the war ended a long time ago and there is no need to be here, but you came, and for that I want to be thankful, said Mai Tongogara, who calls him Cde Gina.\n\nPresident Mnangagwa, who was a special assistant to President Mugabe during the war, and Gen Tongogara, had unlimited access to the late former leader in Mozambique, whether during the day or at night, because of their role in prosecuting the protracted liberation struggle.\n\nCde Mugabe and his top two Nanking Military Academy-trained military strategists were responsible for planning and directing the struggle, hence the regular engagements.\n\nAmbassador Mudzimba worked with Gen Tongogara for many years, after they first met in 1974, at Chifombo Base in Zambia before he left for military training in Tanzania.\n\nFor that reason, Ambassador Mudzimba treasures the photo and his last moments with Gen Tongogara.\n\nEven when they returned to London for the talks with the British, Ambassador Mudzimba accompanied Gen Tongogara, with other comrades on one of the weekends to the Africa Centre in London, where he addressed his last rally in the city.\n\nThe rally was organised by Dr Frederick Shava, now Higher and Tertiary Education, Innovation, Science and Technology Development Minister.\n\nAt that point Minister Shava was the Zanu representative in London.\n\nIn his address, Gen Tongogara called for unity within the party, including the diaspora and against tribalism and regionalism.\n\nAfter the Lancaster House Talks, the delegation returned to Mozambique and Gen Tongogara tragically died in a car accident.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Tongo.jpg",
            "description": "Africa Moyo, Deputy News Editor What could be the last photograph of the late national hero and liberation war commander General Josiah Magama Tongogara has been handed over to the family. The photograph was surrendered to the late Zanla military commander’s widow, Senator Angeline Tongogara, by Zimbabwe’s Ambassador to Belarus, Ignatius Mudzimba, on December 26 […]",
            "time": "08:41",
            "date": "06 Jan 2025"
        },
        {
            "title": "Mash West on course to meet maize target",
            "url": "https://www.herald.co.zw/mash-west-on-course-to-meet-maize-target/",
            "content": "Conrad Mupesa, Mashonaland West Bureau\n\nMASHONALAND West, known as Zimbabwes breadbasket province, is on track to meet its ambitious target of 360 000 hectares of maize on the back of the rains being experienced countrywide.\n\nBy this time last year, approximately 154 000 hectares had been planted, whereas this year the province has already surpassed 301 000 hectares. The recent wet conditions have prompted farmers in areas such as Mhangura, Banket, Chegutu, and Karoi, who had prepared their land but were waiting for rain to begin planting.\n\nProvincial director of Agricultural and Recovery Development Advisory Services (ARDAS) Mrs Medlinah Magwenzi was optimistic about surpassing the target.\n\nThis low hectarage planted was caused by late rains; nevertheless, we have embarked on our operation, Plant! Dzvarai! Hlanyela! as soon as possible.\n\nOut of our target of 360 000 hectares, we had planted over 300 000 hectares by last Friday, but we are confident that with the rains upon us, we will be able to meet our target.\n\nThe majority of the already planted crop is in good condition, with about 5 percent recovering from temporary wilting. The current rains have improved the condition of crops and allowed farmers to plant more, after the long dry spell.\n\nShe highlighted that Zvimba district has the highest plantings, followed by Chegutu and Makonde, while Sanyati, Ngezi, Hurungwe, and Kariba received less rainfall, resulting in less planting as farmers waited for rains.\n\nIn addition to maize, the province has made substantial progress in planting other crops including sorghum, pearl millet, soya beans, and cotton, surpassing last seasons hectarage by over 150 percent.\n\nMrs Magwenzi encouraged farmers to continue planting during the wet spell, advising them to select short-season varieties for dryland and medium to long-season varieties for irrigated farms. Its essential to plant according to agro-ecological zones performance to avoid loss of inputs. Regions 1, 2, and 3 should plant maize, while regions 4 and 5 should focus on traditional grains to maximise yields for food security, she said.\n\nFarmers were also urged to report any suspected cases of fall armyworm to agricultural extension officers.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/01/Maize-crop.jpg",
            "description": "Conrad Mupesa, Mashonaland West Bureau MASHONALAND West, known as Zimbabwe’s breadbasket province, is on track to meet its ambitious target of 360 000 hectares of maize on the back of the rains being experienced countrywide. By this time last year, approximately 154 000 hectares had been planted, whereas this year the province has already surpassed […]",
            "time": "08:41",
            "date": "06 Jan 2025"
        }
    ]
}