{
    "news": [
        {
            "title": "Over 100 youths to undergo training at Chitepo School of Ideology",
            "url": "https://www.herald.co.zw/over-100-youths-to-undergo-training-at-chitepo-school-of-ideology/",
            "content": "Herald Reporter\n\nMore than 100 youths are set to undergo training at the Herbert Chitepo School of Ideology, an institution that seeks to stimulate national consciousness and patriotism.\n\nThe training is being facilitated by the Heritage Group Trust which focuses on assisting war veterans, their children, and youths to engage in various income generating projects.\n\nIn an interview, the Trusts national chief research officer Cde Shadreck Chikwanda said their main objective is to promote the youths to play a part in developing the countrys economy.\n\nThe Trust is affiliated to Zanu PF and has so far mobilised youths from opposition parties to join the ruling party, said Cde Chikwanda.\n\nOver 100 youths countrywide have registered to undergo training at the School of Ideology. The Heritage Group Trust aims to safeguard Zimbabwes legacy and preserve the countrys history.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Chitepo-School-of-idealogy-680x380.jpg",
            "description": "Herald Reporter More than 100 youths are set to undergo training at the Herbert Chitepo School of Ideology, an institution that seeks to stimulate national consciousness and patriotism. The training is being facilitated by the Heritage Group Trust which focuses on assisting war veterans, their children, and youths to engage in various income generating projects. […]",
            "time": "18:30",
            "date": "04 Feb 2025"
        },
        {
            "title": "Prosecution of wildlife offences scaled up",
            "url": "https://www.herald.co.zw/prosecution-of-wildlife-offences-scaled-up/",
            "content": "Anesu January-Herald Correspondent\n\nThe National Prosecuting Authority of Zimbabwe (NPAZ) and the Tikki Hywood Foundation have initiated a strategic partnership to enhance the prosecution of wildlife-related offenses.\n\nRepresentatives from the Tikki Hywood Foundation, Ms Lisa Hywood and Mr Silent Shoko recently met Prosecutor General Loyce Matanda-Moyo to discuss ways to strengthen cooperation in tackling wildlife crimes.\n\nThe meeting underscored Zimbabwes commitment to protecting its biodiversity and cracking down on sophisticated wildlife trafficking networks.\n\nA key focus of the discussions was on the need to improve data collection on wildlife crimes to ensure more effective tracking of cases within the judicial system to ensure that offenders are held accountable.\n\nAdditionally, the partnership aims to enhance inter-agency collaboration among law enforcement, conservation organisations, and prosecutors to create a more unified response to wildlife crime.\n\nBy combining legal expertise with conservation knowledge, the partnership is expected to enhance enforcement measures and disrupt trafficking networks.\n\nProsecutor General Matanda-Moyo acknowledged the importance of working with specialised conservation organisations like the Tikki Hywood Foundation.\n\nThe collaboration comes at a time when Zimbabwe is intensifying efforts to safeguard its wildlife.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/07/2607-1-1-LOICE-MATANDA-MOYO.jpg",
            "description": "Anesu January-Herald Correspondent The National Prosecuting Authority of Zimbabwe (NPAZ) and the Tikki Hywood Foundation have initiated a strategic partnership to enhance the prosecution of wildlife-related offenses. Representatives from the Tikki Hywood Foundation, Ms Lisa Hywood and Mr Silent Shoko recently met Prosecutor General Loyce Matanda-Moyo to discuss ways to strengthen cooperation in tackling wildlife […]",
            "time": "18:30",
            "date": "04 Feb 2025"
        },
        {
            "title": "‘I am delighted to join the family, the team’ – Munetsi",
            "url": "https://www.herald.co.zw/i-am-delighted-to-join-the-family-the-team-munetsi/",
            "content": "Marshall Munetsi cant wait to get going as a Wolves player after completing his deadline-day move from French side Reims.\n\nHaving plied his trade with the Ligue 1 side since 2019, the Zimbabwe international has grown into a leader of the group, wearing the armband as recently as last Saturday.\n\nHaving consulted former Reims teammate Emmanuel Agbadou and international colleague Tawanda Chirewa before making the move, Munetsi received positive feedback, which made the move a no-brainer on Monday.\n\nI am delighted. It is a dream come true for me. I have always wanted to be part of something big, and being part of Wolves is very big for me and my family.\n\nIt is a team that Ive also seen from afar, and the Premier League is the best place to be, so Im delighted to join the family, to join the team.\n\nI am very excited. It is probably going to be the first time I have had a big opportunity to be representing a bigger club. Nothing against Reims, but now you are going to be playing in the Premier League, playing for Wolves.\n\nAlso, we have a greater population in England for Zimbabweans, I think I will feel even more at home than I was in France.\n\nOn his experiences in France, he said: The first time I got there, I did not think I would stay for that long, but considering what I went through with the club, I really enjoyed my time there, and I think now it is probably the best time because I have gained so much experience.\n\nBeing in the French league is also very tough, probably not as much as the Premier League, but I think it is also quite competitive with the clubs that we have. So, I think those games will come in handy once I make this move.On speaking to Chirewa and Abgadou\n\nObviously, Tawanda messaged me as soon as he saw the news. He was so excited, so at least now hes going to have his big brother there. So, it was very good. With Agba he did the same, because when he first came here, I was the one to welcome him. So, I think now it is going to be his turn to welcome me.\n\nAs Wolves have seen so far, what he provides for the team, the impact that he has, the energy, the strength, the physique, it is something that you need in every top team. So, besides that, he is also a very good friend of mine. We have been very good friends for the past three years. So, I am also looking forward to that.\n\nOn bringing leadership qualities\n\nI think in as much as we play football, we learn a lot. Being a leader is something that is not easy, but you also have to nurture yourself. You have to learn how to help others, how to guide, how to lead by example, on the pitch and off the pitch. So I think it is something that I will also be able to bring to Wolves, considering what Ive also produced here at Reims. I think it is some of the qualities that I do produce on the pitch, and off the pitch.  Wolves FC\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Marshall-Munetsi-Wolves-680x380.jpg",
            "description": "Marshall Munetsi can’t wait to get going as a Wolves player after completing his deadline-day move from French side Reims. Having plied his trade with the Ligue 1 side since 2019, the Zimbabwe international has grown into a leader of the group, wearing the armband as recently as last Saturday. Having consulted former Reims teammate […]",
            "time": "18:30",
            "date": "04 Feb 2025"
        },
        {
            "title": "Marara faces chop over exposing Harare councillors",
            "url": "https://www.herald.co.zw/marara-faces-chop-over-exposing-harare-councillors/",
            "content": "Trust Freddy-Herald Correspondent\n\nHarare City Councils executive assistant to the town clerk, Engineer Matthew Marara is reportedly facing the axe after his explosive testimony before the Commission of Inquiry into the affairs of the local authority.\n\nThis came to light when acting town clerk Engineer Phakhamile Mabhena Moyo was called to clarify the circumstances surrounding Mararas alleged suspension.\n\nThe Commission heard that Harare councillors felt that Marara betrayed them and had allegedly passed a resolution to remove him from his position.\n\nA letter suspending Marara was presented as evidence, but Engineer Mabhena Moyo said he had refused to sign it.\n\nI did not sign the suspension letter because I felt that the timing was suspicious and the resolution was ambiguous, Engineer Mabhena Moyo told the Commission.\n\nDuring his previous testimony, Marara accused Harare councillors of trying to grab executive control, instead of sticking to their roles.\n\nMeanwhile, Marara testified before the Commission of Inquiry in a closed session earlier today as he reportedly wanted to share sensitive information, including the latest attempt to suspend him.\n\nMarara previously said he was digging his own grave by giving the testimony.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/IMG-20250115-WA0094-680x380.jpg",
            "description": "Trust Freddy-Herald Correspondent Harare City Council’s executive assistant to the town clerk, Engineer Matthew Marara is reportedly facing the axe after his explosive testimony before the Commission of Inquiry into the affairs of the local authority. This came to light when acting town clerk Engineer Phakhamile Mabhena Moyo was called to clarify the circumstances surrounding […]",
            "time": "18:30",
            "date": "04 Feb 2025"
        },
        {
            "title": "SheMillionaire sets aside R1,5 million bursary for 100 African women",
            "url": "https://www.herald.co.zw/shemillionaire-sets-aside-r15-million-bursary-for-100-african-women/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nSheMillionaire Wealth Building and Training Academy has announced a bursary programme valued at R1,5 million that will enable 100 African women to receive training in business.\n\nSheMillionaire founder Dr Mandy Sigauke, who is leading the initiative, said she believes that education and entrepreneurship are key in breaking the cycle of poverty.\n\nI have always been passionate about empowering women to become financially independent, she said.\n\nThis bursary is more than just funding, it is an investment into the future of women who have the drive but lack the means.\n\nThe bursary programme is open to African women aged 18.\n\nIt specifically targets those who aspire to build a career in the business and beauty industry but are facing financial barriers.\n\nBeyond just training, the SheMillionaire Academy aims to equip women with practical skills, mentorship, and business knowledge to help them launch and sustain their own businesses.\n\nWe are not just teaching beauty skills, we are building entrepreneurs, Dr Sigauke said.\n\nWe want these women to create businesses that will uplift their communities.\n\nThe selection process will focus on ambition, passion, and a commitment to making a difference.\n\nDr Sigauke said she remains committed to giving back.\n\nEvery year, I make it a priority to contribute to my community. This year, I am investing in the future of 100 women and I cannot wait to see them flourish.\n\nFor updates on the bursary programme and other initiatives, she said people should follow SheMillionaire Academy on social media.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Screenshot-59-680x380.png",
            "description": "Ivan Zhakata Herald Correspondent SheMillionaire Wealth Building and Training Academy has announced a bursary programme valued at R1,5 million that will enable 100 African women to receive training in business. SheMillionaire founder Dr Mandy Sigauke, who is leading the initiative, said she believes that education and entrepreneurship are key in breaking the cycle of poverty. […]",
            "time": "18:30",
            "date": "04 Feb 2025"
        },
        {
            "title": "22 youths arrested for abusing drugs at Chegutu party",
            "url": "https://www.herald.co.zw/22-youths-arrested-for-abusing-drugs-at-chegutu-party/",
            "content": "Walter Nyamukondiwa\n\nMashonaland West Bureau Chief\n\nPolice in Chegutu have arrested 22 youths who were abusing drugs and other substances at a party that was being held in Rifle Range.\n\nThe youths are between the ages of 15 and 25 and include seven girls.\n\nPolice raided the house after being tipped off about a WhatsApp group that had been created by Tinashe Kamunda to invite people to attend the party.\n\nThere was an entrance fee of $2 for males and $1 for females. Those attending the party were also expected to bring $5 for alcohol.\n\nActing police spokesperson, Assistant Inspector Effort Chapoto confirmed the arrests.\n\nPolice received a tip-off that there was suspected drug abuse by youths at a party in Rifle Range, he said.\n\nReacting to the information, ZRP Chegutu raided the house and arrested 15 boys and seven girls. Searches were conducted around the house and resulted in the recovery of stubs of smoked dagga, unused condoms, some liquor and shisha equipment.\n\nPolice managed to locate the parents and guardians of the youths.\n\nTinashe paid a fine for disorderly conduct while the other youths paid fines for a lesser charge before being released into the custody of their parents and guardians.\n\nPolice are urging parents and guardians to always check their childrens whereabouts, he said.\n\nWe thank those who supplied the information and remind everyone that community policing is the way to go. That bond between the community and the police always yields positive results.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/08/Arrested.jpg",
            "description": "Walter Nyamukondiwa Mashonaland West Bureau Chief Police in Chegutu have arrested 22 youths who were abusing drugs and other substances at a party that was being held in Rifle Range. The youths are between the ages of 15 and 25 and include seven girls. Police raided the house after being tipped off about a WhatsApp […]",
            "time": "18:30",
            "date": "04 Feb 2025"
        },
        {
            "title": "NEW: Training allowances for Mighty Warriors",
            "url": "https://www.herald.co.zw/new-training-allowances-for-mighty-warriors/",
            "content": "Zimpapers Sports Hub\n\nTHE new ZIFA board has breathed some fresh air into the game as the Mighty Warriors are set to receive training allowances for the duration of their camp.\n\nThe Sithethelwe Kwinji 15 Sibanda girls, who regrouped on Sunday, are preparing for a crucial back-to-back WAFCON qualifier against Angola later this month.\n\nThey face off with their Cosafa rivals on February 20 in Luanda before they host their opponents at the Lucas Moripe Stadium in Pretoria, South Africa, six days later.\n\nHowever, unlike in the past, they will be paid for every minute spent in camp in a huge positive step made by the recently-elected ZIFA board led by Nqobile Magwizi.\n\nThe development was confirmed by ZIFA secretary-general Yvonne Manwa at the teams training session in Harare this morning.\n\nMagwizi and board member Kudzai Kadzombe graced the training and offered their full support.\n\nI am happy to announce that this board has committed to paying you your training allowances, said Manwa to the delight of the players.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Screenshot-57-680x380.png",
            "description": "Zimpapers Sports Hub THE new ZIFA board has breathed some fresh air into the game as the Mighty Warriors are set to receive training allowances for the duration of their camp. The Sithethelwe “Kwinji 15” Sibanda girls, who regrouped on Sunday, are preparing for a crucial back-to-back WAFCON qualifier against Angola later this month. They […]",
            "time": "18:30",
            "date": "04 Feb 2025"
        },
        {
            "title": "Wolves send Chirewa on another loan move",
            "url": "https://www.herald.co.zw/wolves-send-chirewa-on-another-loan-move/",
            "content": "Eddie Chikamhi\n\nZimpapers Sports Hub\n\nZimbabwe international Tawanda Chirewa has been loaned to English Football League One side Huddersfield Town from topflight club Wolverhampton Wanderers.\n\nThe highly-rated 21-year-old Zimbabwean midfielder will be at the club until the end of the 2024/25 season.\n\nHaving spent the first half of the current season on loan at Derby County in the Sky Bet Championship, Chirewa returned to Wolves only to find himself on the move again.\n\nI am delighted to be here and feel blessed to have been given the opportunity to join such a big club ahead of a really important part of the season, he said.\n\nI have heard amazing things from Nigel and Joe about what it is like to play here  the facilities, coaches, and the supporters. I cannot wait to experience all of that for myself.\n\nThere were a few options available to me, but coming to Huddersfield Town always felt like the right decision.\n\nChirewas arrival marks an exciting new chapter in his career.\n\nBorn in Chelmsford, England, he began his youth career at Ipswich Town before moving to Wolverhampton Wanderers in September 2023.\n\nHis journey with Wolves saw him quickly rise through the ranks, making eight Premier League appearances, and even playing in the fierce Black Country derby against West Bromwich Albion.\n\nHis international debut for Zimbabwe in March 2024 was another milestone in what looked set to be a bright future.\n\n",
            "image_url": null,
            "description": "Eddie Chikamhi Zimpapers Sports Hub Zimbabwe international Tawanda Chirewa has been loaned to English Football League One side Huddersfield Town from topflight club Wolverhampton Wanderers. The highly-rated 21-year-old Zimbabwean midfielder will be at the club until the end of the 2024/25 season. Having spent the first half of the current season on loan at Derby […]",
            "time": "18:30",
            "date": "04 Feb 2025"
        },
        {
            "title": "Calls for climate action funding gets louder",
            "url": "https://www.herald.co.zw/calls-for-climate-action-funding-gets-louder/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nMr Nehemiah Chipato, a member of Zimbabwes delegation to the United Nations Framework Convention on Climate Change (UNFCCC) and founder of the African Renaissance Sustainable Development has said financial resources must be channelled towards climate action.\n\nThis comes after developed nations made renewed commitments to mobilise US$100 billion annually for climate adaptation and mitigation in vulnerable countries at the recently held COP29.\n\nMr Chipato said the funds must be availed to nations like Zimbabwe to enable them to effectively transition to green economies.\n\nHe said Zimbabwe is struggling with extreme heat, prolonged droughts, and erratic rainfall patterns, which is severely impacting its agricultural sector.\n\nFor Zimbabwe, adaptation is not a choiceit is a necessity, he said.\n\nMr Chipato also urged the international community to ensure that pledges for climate financing are supported by clear timelines.\n\nThis comes as scientific reports have highlighted that the planet is already 1.1C warmer than pre-industrial levels. Mr Chipato reiterated the urgency of cutting global emissions by at least 45 percent by 2030 to stay within the 1.5C goal.\n\nHowever, Mr Chipato said climate action must go beyond emission reductions, focusing on a just and equitable transition that allows developing nations to progress without compromising their growth.This is about justice and equity, Mr Chipato said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/3b282117-8dbf-4bca-b157-3124d6fb95dc-680x380.jpeg",
            "description": "Ivan Zhakata Herald Correspondent Mr Nehemiah Chipato, a member of Zimbabwe’s delegation to the United Nations Framework Convention on Climate Change (UNFCCC) and founder of the African Renaissance Sustainable Development has said financial resources must be channelled towards climate action. This comes after developed nations made renewed commitments to mobilise US$100 billion annually for climate […]",
            "time": "18:30",
            "date": "04 Feb 2025"
        },
        {
            "title": "Jason Ziyapapa Moyo Air Force gets first female Base Commander",
            "url": "https://www.herald.co.zw/jason-ziyapapa-moyo-air-force-gets-first-female-base-commander/",
            "content": "Conrad Mupesa\n\nMashonaland West Bureau\n\nAir Commodore Ellen Chiweshe is set to become the first female Base Commander at the Jason Ziyapapa Moyo Air Force Base.\n\nShe becomes the second female Airbase Commander since Independence.\n\nThe first air base to get a female Commander was Manyame Airbase.\n\nAir Commodore Chiweshe takes over from Air Commodore Nicholas Nyati.\n\nAir Force of Zimbabwe Commander, Air Marshal John Jacob Nzvede is expected to officiate at the handover-takeover ceremony today at the base that is located a few kilometres south of Chegutu town.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/1622324c-6461-40d9-9f78-04946807c789-680x380.jpeg",
            "description": "Conrad Mupesa Mashonaland West Bureau Air Commodore Ellen Chiweshe is set to become the first female Base Commander at the Jason Ziyapapa Moyo Air Force Base. She becomes the second female Airbase Commander since Independence. The first air base to get a female Commander was Manyame Airbase. Air Commodore Chiweshe takes over from Air Commodore […]",
            "time": "18:30",
            "date": "04 Feb 2025"
        }
    ]
}