{
    "news": [
        {
            "title": "Mount Pleasant former MP takes on illegal settlers",
            "url": "https://www.herald.co.zw/mount-pleasant-former-mp-takes-on-illegal-settlers/",
            "content": "Prosper Dembedza\n\nHerald Correspondent\n\nFORMER Member of Parliament for Mount Pleasant Jason Passade has told a court that Eastwind Trust owners Rodgers Pote and Trymore Arineshito, who are facing charges of contempt of court and carrying out development on an illegal settlement without approval, were disowned by Harare City Councils director of Housing in an affidavit.\n\nPasade said this during cross-examination by the duos lawyer who had put to him that her clients were regularised.\n\nHe said Arineshito and Pote were ordered by the High Court to vacate the premises, but they are not following that order.\n\nPasade produced an affidavit written by the citys Director of Housing, Mr Addmore Nhekairo, in which he said he never allocated them any land.\n\nThe matter was deferred to April 15 for trial continuation.\n\nDuring previous sittings, Pasade said he knew the accused persons not only in connection with this case but also as land barons at Melfort Farm, Ruwa.\n\nHe said in 2020, his company entered into an agreement to develop land on behalf of the Freedom Fighters Development Trust.\n\nPasade said his company started to carry out developments. Roads were opened while most developments were already at an advanced stage.\n\nHowever, the accused persons started illegally selling and allocating stands in the area.\n\nPasades company allegedly went to court and acquired a High Court order which gave it the authority to remove the illegally settled people.\n\nHowever, the accused persons did not vacate the stands, contrary to the court order.\n\nIt is the States case that on November 2023, the High Court issued a provisional order against Eastwind Trust.\n\nAfter the order was granted, the accused were served by the Sheriff but continued invading the area in violation of the order.\n\nThe complainant is Homegram Investments Limited, represented by Pasade.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/court-hammer.jpg",
            "description": "FORMER Member of Parliament for Mount Pleasant Jason Passade has told a court that Eastwind Trust owners Rodgers Pote and Trymore Arineshito, who are facing charges of contempt of court and carrying out development on an illegal settlement without approval, were disowned by Harare City Council’s director of Housing in an affidavit.",
            "time": "18:43",
            "date": "03 Apr 2025"
        },
        {
            "title": "Zimbabwe aims to boost leather industry through rural collaboration, exports",
            "url": "https://www.herald.co.zw/zimbabwe-aims-to-boost-leather-industry-through-rural-collaboration-exports/",
            "content": "Jerry Chifamba\n\nThe Government is ramping up efforts to revitalise Zimbabwes leather sector through broadening partnerships with rural communities and expanding the sectors reach into export markets, Industry and Commerce Minister Mangaliso Ndlovu has said.\n\nSpeaking during Wednesdays question and answer session in the National Assembly, Minister Ndlovu said his ministry is actively collaborating with the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development and other Government departments to strengthen the leather value chain.\n\nI spoke of a collaboration with the Ministry of Agriculture and other ministries and highlighted that we have not done enough in our leather sector, he said.\n\nWe will be working with rural communities to create a system to produce leather.\n\nMinister Ndlovu said the Government is focusing on growing the domestic market while expanding exports to neighbouring countries, including Zambia.\n\nHe said Government departments have been directed to prioritise domestic leather purchases to stimulate the sectors growth.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/11/Mangaliso-Ndlovu.jpg",
            "description": "The Government is ramping up efforts to revitalise Zimbabwe’s leather sector through broadening partnerships with rural communities and expanding the sector’s reach into export markets, Industry and Commerce Minister Mangaliso Ndlovu has said.",
            "time": "18:43",
            "date": "03 Apr 2025"
        },
        {
            "title": "Job grading to foster quality service in health sector",
            "url": "https://www.herald.co.zw/job-grading-to-foster-quality-service-in-health-sector/",
            "content": "Precious Manomano\n\nHerald Reporter\n\nTHE Government has embarked on comprehensive job grading in the health sector to foster equity and fairness.\n\nThis initiative comes at a time when the Government is coming up with various strategies to improve the health sector, such as building more hospitals and recruiting more workers.\n\nStakeholders in the health sector are holding a two-week symposium in Gweru, where participants will be equipped with essential job grading processes in the health sector.\n\nSpeaking in an interview on the sidelines of the symposium, which began on Monday, Health Services Commission secretary Dr Christopher Pasi said the process will improve productivity among civil servants.\n\nWe are now at an advanced stage of our job grading. We want to see how we can equitably place our employees in different categories, he said.\n\nThe commissions Conditions of Service Industrial Relations general manager, Dr Michael Sande said stakeholders, employees, and their leadership have said the current grading structure does not incorporate all the professions.\n\nThis is partly due to the emergence of new disciplines over the years, such as imaging. These disciplines that were not adequately addressed in the previous grading structure developed in 2003, he said.\n\nWe have had significant developments in various fields, and our grading structure must reflect these changes. We expect the job grading system to address these gaps.\n\nA stakeholder, Ms Flavia Muyambo said job evaluation is the cornerstone of every organisations development.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2020/10/Dr-Pasi.jpg",
            "description": "THE Government has embarked on comprehensive job grading in the health sector to foster equity and fairness.",
            "time": "18:43",
            "date": "03 Apr 2025"
        },
        {
            "title": "Diaspora Conference to spur investment and trade",
            "url": "https://www.herald.co.zw/diaspora-conference-to-spur-investment-and-trade/",
            "content": "Farirai Machivenyika\n\nSenior Reporter\n\nThe Ministry of Foreign Affairs and International Trade will next week host the third edition of the Zimbabwe Annual Diaspora Conference (ZADC) in Vumba, Manicaland Province.\n\nThe Ministrys director for Public Diplomacy, Communications and Advocacy, Mrs Philisiwe Chidawanyika confirmed this in a statement today.\n\nThe conference, which will be held in hybrid format, will run under the theme Engaging, Enabling and Empowering the Diaspora: Catalysing Investment, Trade and Social Support for National Development.\n\nMrs Chidawanyika said the conference will build upon the success of the first and second diaspora conferences that were held in Bulawayo Province in 2023 and in Matabeleland South Province in 2024.\n\nThe three-day meeting will provide opportunities for various stakeholders in the mining, agriculture, real estate, and tourism sectors to engage and explore ways of empowering the Zimbabwean Diaspora to participate in national development programmes, Mrs Chidawanyika said.\n\nThe e-meeting will also provide an opportunity for the diaspora community to contribute to the review of the Zimbabwe Diaspora Policy, which is a comprehensive national framework that guides Government efforts to ensure the participation of the diaspora community in the development of the country under the tenets of nyika inovakwa nevene vayo and leaving no one and no place behind.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Professor-Amon-Murwira-680x380.jpg",
            "description": "The Ministry of Foreign Affairs and International Trade will next week host the third edition of the Zimbabwe Annual Diaspora Conference (ZADC) in Vumba, Manicaland Province.",
            "time": "18:43",
            "date": "03 Apr 2025"
        },
        {
            "title": "Harare man wins child maintenance case",
            "url": "https://www.herald.co.zw/harare-man-wins-child-maintenance-case/",
            "content": "Anotida Chonzi\n\nA Harare man has won his case in the Civil Court after the mother of his two children sought to increase his monthly child support payments from US$85 to US$250.\n\nThe court ruled that the current maintenance amount would remain unchanged, citing Albert Mapuriras unemployment as a key factor.\n\nAppearing before Magistrate Talent Mutasa at the Harare Civil Court, Chenai Chitunhu argued that the US$85 she has been receiving is no longer sufficient to cover the rising costs of raising the children.\n\nWhen the US$85 order was made, our youngest daughter was not yet in school, but I enrolled her at the beginning of this year.\n\nI am struggling to pay her school fees on my own, Chitunhu told the court.\n\nChitunhu said she works as a housemaid and earns US$60 per month, which is inadequate to cover rent, food, school fees and other essentials.\n\nShe pleaded with the court to raise the child support to US$250.\n\nHowever, Mapurira opposed the request, citing his recent job loss.\n\nHe claimed he was fired from his job as a garden worker after Chitunhu, accompanied by police officers, confronted him at his workplace.\n\nMy boss was not happy that police officers showed up at his house. Before that, I was earning US$90 a month, and even then, it was hard to meet the US$85 child support.\n\nWith no source of income, Mapurira told the court that increasing the maintenance amount would impose an even greater burden on him.\n\nAfter considering both arguments, Magistrate Mutasa ruled in Mapuriras favour, maintaining the current monthly payment of US$85.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/court-hammer.jpg",
            "description": "A Harare man has won his case in the Civil Court after the mother of his two children sought to increase his monthly child support payments from US$85 to US$250.",
            "time": "18:43",
            "date": "03 Apr 2025"
        },
        {
            "title": "Mashava smelter producing 1 500 tonnes monthly",
            "url": "https://www.herald.co.zw/mashava-smelter-producing-1-500-tonnes-monthly/",
            "content": "George Maponga in Masvingo\n\nThe new Zimbabwe Zhongxin Chrome Smelting plant in Mashava is now producing 1 500 tonnes of ferrochrome every month.\n\nThe increase in output has seen the ferrochrome producer increase the number of its permanent employees to over 200.\n\nMasvingo Provincial Affairs and Devolution Minister Ezra Chadzamira said the plant is a boon for small-scale miners in the chrome-rich Mashava area.\n\nAddressing participants attending a media workshop organised by Zimcodd on the provinces strides towards growing its Gross Domestic Product to US$8 billion by 2030, Minister Chadzamira said the chrome project is spurring socio-economic growth.\n\nThe project has also empowered women, youths and war veterans by granting them mining claims on land previously designated for exploration prospecting orders, he said.\n\nThe ferrochrome plant was commissioned two years ago, and this threw a lifeline to thousands of small-scale miners in Mashava and surrounding areas.\n\nThe company invested around US$70 million as a result of the Second Republics Zimbabwe is open for business mantra.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/12/Minister-Ezra-Chadzamira.jpg",
            "description": "The new Zimbabwe Zhongxin Chrome Smelting plant in Mashava is now producing 1 500 tonnes of ferrochrome every month.",
            "time": "18:43",
            "date": "03 Apr 2025"
        },
        {
            "title": "CAAZ appoints substantive director general",
            "url": "https://www.herald.co.zw/caaz-appoints-substantive-director-general/",
            "content": "Freeman Razemba\n\nSenior Reporter\n\nThe Civil Aviation Authority of Zimbabwe (CAAZ) has appointed Mr George Mashababe as the substantive director-general of the authority with effect from April 1, 2025.\n\nMr Mashababe replaces Dr Elijah Chingosho.\n\nIn a statement, CAAZ board chairperson Mrs Nonkosi Ncube confirmed the development.\n\nThe board of directors of the Civil Aviation Authority of Zimbabwe (CAAZ) is pleased to advise all aviation industry stakeholders and business partners of the appointment of Mr George Mashababe as the substantive director-general of CAAZ with effect from April 1, 2025, she said.\n\nThe appointment is in terms of Section 17 (2) of the Public Entities Corporate Governance Act [Chapter 10:31] and Section 24 of the Civil Aviation Act (Chapter 13:16).\n\nShe said the incoming director-general is an accomplished aviation expert with a career that spans over 37 years in the field.\n\nMr Mashababe started at the Air Force of Zimbabwe in 1988 and later joined CAAZ in 2002 as an airworthiness inspector in the Directorate of Flight Safety and Standards.\n\nHe rose through the ranks and was promoted to head the Directorate of Air Accidents and Serious Incidents Investigation (DAAII) in the Ministry of Transport and Infrastructural Development in 2020, a position he held until his appointment at CAAZ, Mrs Ncube said.\n\nThe board welcomes Mr Mashababes commitment to sustain a culture of continuous review of civil aviation policies and legislative frameworks, in line with ICAO prescribed Standards and Recommended Practices (SARPs).\n\nCAAZ management and staff extend their congratulations to Mr Mashababe on his new appointment and wish him success in his new position, Mrs Ncube said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Untitled-42.jpg",
            "description": "The Civil Aviation Authority of Zimbabwe (CAAZ) has appointed Mr George Mashababe as the substantive director-general of the authority with effect from April 1, 2025.",
            "time": "18:43",
            "date": "03 Apr 2025"
        },
        {
            "title": "GMB announces 2024/25 producer prices",
            "url": "https://www.herald.co.zw/gmb-announces-2024-25-producer-prices/",
            "content": "Edgar Vhera\n\nAgriculture Specialist Writer\n\nTHE Grain Marketing Board (GMB) has announced the summer crops and winter wheat incentive planning prices as the grain marketing season started on Tuesday.\n\nIn an X post, GMB said maize and traditional grains will be bought at US$376, 48 per tonne, soya bean at US$580 and sunflower at US$668, 98 per tonne.\n\nThe winter wheat incentive planning price has been set at US$451, 35 per tonne.\n\nLast year, producer prices were pegged at US$390 per tonne for maize and traditional grains, US$713 per tonne for sunflower and US$620 per tonne for soya bean.\n\nThe GMB will primarily purchase produce from farmers financed under the Presidential Input Programme (PIP) and irrigation schemes.\n\nSome farmers have started harvesting their summer crops.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/GMB.jpg",
            "description": "THE Grain Marketing Board (GMB) has announced the summer crops and winter wheat incentive planning prices as the grain marketing season started on Tuesday.",
            "time": "18:43",
            "date": "03 Apr 2025"
        },
        {
            "title": "Sports Minister praises Coventry",
            "url": "https://www.herald.co.zw/sports-minister-praises-coventry/",
            "content": "Langton NyakwendaNEWLY appointed Sport, Recreation, Arts and Culture Minister Anselem Sanyatwe has described his predecessor Kirsty Coventry as a golden girl and daughter of the nation who has inspired generations.The Sports Ministry organised a send-off dinner for Coventry on Wednesday night ahead of her new role as president of the International Olympic Committee.Coventry becomes the first African and first woman to lead the IOC.\n\nWe gather to celebrate a remarkable individual, a true champion, both on and off the field, a beloved friend and sister, the golden girl and dear daughter of our country, Zimbabwe, said Sanyatwe.Coventrys remarkable journey is one built on extraordinary integrity and dedication, decorated with unparalleled achievements and unwavering commitment to the values of sportsmanship and service.\n\nShe has indeed inspired generations of young athletes to pursue their dreams, and strive for excellence.Coventry remains one of the most decorated Olympian from Africa, having won seven swimming medals at the Olympics between 2004 and 2012.\n\nShe won two gold medals, four silver and one bronze.\n\nThis record establishes her as Zimbabwe and Africas most decorated Olympian and girl child, said Sanyatwe.The send-off dinner was attended by various sports administrators, including Sport and Recreation Commission chairperson Gerald Mlotshwa and Zimbabwe Football Association president Nqobile Magwizi.\n\nZimbabwe Olympic Committee chair Thabani Gonye and boxing promoters Stalin Mau Mau and Lindsay Earle also attended the function.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/IMG-20250403-WA0055-680x380.jpg",
            "description": "NEWLY appointed Sport, Recreation, Arts and Culture Minister Anselem Sanyatwe has described his predecessor Kirsty Coventry as a golden girl and daughter of the nation who has inspired generations.",
            "time": "18:43",
            "date": "03 Apr 2025"
        },
        {
            "title": "107 protesters arrested over failed demonstrations",
            "url": "https://www.herald.co.zw/107-protesters-arrested-over-failed-demonstrations/",
            "content": "Crime Reporter\n\nA total of 107 suspects who took part in the failed demonstrations on Monday have been arrested so far and were charged with participating in a public gathering to promote violence.\n\nOn Monday, the protesters reportedly chanted slogans, threw stones at police officers, and attempted to barricade roads with bricks and tyres.\n\nIn a statement, national police spokesperson, Commissioner Paul Nyathi said the law will take its course against unruly elements who commit criminal acts under the guise of demonstrations.\n\nHe said the police will continue to deploy officers in strategic positions to thwart any criminal activities.\n\nThe Zimbabwe Republic Police applauds the public for maintaining law and order during the recent attempts by some individuals and groups to incite violence and engage in criminal acts in the country, he said.\n\nThe situation in the country remains peaceful and conducive for all socio-economic activities. The police will continue to deploy officers in strategic positions in support of the current serene environment.\n\nCommissioner Nyathi said on Monday, police recorded a few reports of violence and malicious damage to property.\n\nThe police arrested 107 suspects throughout the country for participating in violent and unsanctioned demonstrations.\n\nThe majority of these arrests were made at Robert Gabriel Mugabe Square in Harare. The public is urged to remain vigilant and disregard social media calls to engage in violent acts or to be hoodwinked into joining unlawful gatherings targeted at criminal acts.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/arrested.jpg",
            "description": "A total of 107 suspects who took part in the failed demonstrations on Monday have been arrested so far and were charged with participating in a public gathering to promote violence.",
            "time": "18:43",
            "date": "03 Apr 2025"
        }
    ]
}