{
    "news": [
        {
            "title": "Deputy Minister Kwidini visits cholera-stricken Glendale",
            "url": "https://www.herald.co.zw/deputy-minister-kwidini-visits-cholera-stricken-glendale/",
            "content": "Fungai Lupande\n\nMashonaland Central Bureau\n\nHealth and Child Care Deputy Minister Sleiman Kwidini, Permanent Secretary Dr. Aspect Maunganidze and other health officials on Tuesday afternoon visited Glendale, where 194 cholera cases have been recorded so far.\n\nOut of these, 93 individuals have been treated and discharged, while eight people are receiving care at Tsungubvi Clinic.\n\nDuring the visit, the Deputy Minister toured the treatment centre and the affected communities.\n\nHe praised healthcare workers for their dedication in managing the outbreak, which began during the festive season.\n\nAdditionally, the National Aids Council contributed by donating two boreholes and two reservoir tanks to the communities affected by the outbreak.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/04/Deputy-Minister-Sleiman-Kwidini.jpg",
            "description": "Health and Child Care Deputy Minister Sleiman Kwidini, Permanent Secretary Dr. Aspect Maunganidze and other health officials on Tuesday afternoon visited Glendale, where 194 cholera cases have been recorded so far.",
            "time": "18:48",
            "date": "07 Jan 2025"
        },
        {
            "title": "Journalists tour Museum of African Liberation",
            "url": "https://www.herald.co.zw/journalists-tour-museum-of-african-liberation/",
            "content": "Farirai Machivenyika\n\nSenior Reporter\n\nJournalists from various media houses on Tuesday toured the Museum of African Liberation being constructed in Harare.\n\nThe museum is being set up to chronicle Africas history from the days of slavery to colonialism and the heroic fight for freedom and the right to self-determination.\n\nInformation, Publicity and Broadcasting Services Minister Dr Jenfan Muswere said the tour was meant to empower journalists to appreciate the sacrifices made by the countrys and African Continents forebearers in fighting against colonial rule.\n\nI believe this is an opportunity for you to be able to relate to our heritage, our sacrifices and our history, because the majority of our history is from a Western perspective, he said.\n\nThis museum is a centre of our heritage where countries across the continent have an opportunity to contribute through artefacts, through history and many other historical developments that took place, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/f2266b68-afdc-4292-9d12-88f4469a6fa2-680x380.jpeg",
            "description": "Journalists from various media houses on Tuesday toured the Museum of African Liberation being constructed in Harare.",
            "time": "18:48",
            "date": "07 Jan 2025"
        },
        {
            "title": "Afropop musician Winnie Khumalo dies aged 51",
            "url": "https://www.herald.co.zw/afropop-musician-winnie-khumalo-dies-aged-51/",
            "content": "South African musician and actress Winnie Khumalo has died at the age of 51. Sunday World can exclusively reveal that Khumalo died on Tuesday at her home after a short illness.\n\nMedia personality, Sabelo Ntombeningi Sithole was one of the first few people to be contacted by Rethabile Khumalo, Winnies daughter.\n\nConfirmed by close friend.\n\nI was contacted by Rethabile, and I could hear from her voice that she was not okay. She asked me to rush to her mothers house because Winnie was not moving. I rushed there and unfortunately it was too late. I am distraught and I have lost a friend, cried Sithole.\n\nHe said he last spoke to Winnie on Monday, January 6, 2025.\n\nI knew she was not fine, but I did not know she would come to this, he said. Khumalo first rose to fame as a teenager, having been introduced to the music industry by the late Brenda Fassie.\n\nSeries of health scares over recent years.\n\nIn November 2024, Khumalo was briefly admitted into a Johannesburg hospital after suffering from shortness of breath, which she later learnt was asthma.\n\nShe said she was unaware that she suffered from asthma until an attack over the weekend. Khumalo told media outlets then that she was recovering at home.\n\nI didnt know that I had asthma until I had shortness of breath. I was so confused, she said. I have never heard of anyone being diagnosed with asthma at this age. But the doctors have told me its still in the early stages. They said I need to manage it well and just take care of myself.\n\nThis was not her first health scare. A few years ago, she was diagnosed with diabetes. But she had successfully managed it.\n\nI take care of myself; make sure I eat well, she added. She was also wheelchair-bound for a few weeks following a back operation and an abscess that had developed in her buttocks in 2017. Khumalo said then that she would also get through the hurdle.\n\nI am a fighter, everyone knows. Many of my peers have passed on. But I want to see my grandchildren grow old, so I pray for long life, she said.\n\nBack-up singer for late icon Brenda Fassie\n\nThe Soweto-born singer worked for Fassie as a backing singer. At the age of 15, she released the album Hey Laitie, Tshina Tshina (produced by Sello Chicco Twala).\n\nIt was followed by an album titled Dlamini, also in the 1980s. She also recorded a gospel album titled Izono Zami in the 1990s, produced by Pastor Langa Dube.\n\nA highlight of her early music career was working with Brenda Fassie as Brendas backing vocalist. She has also worked with the likes of Pure Magic, Sipho Mbele, Brothers of Peace (B.O.P), Bongo Maffin, Zonke Dikana and DJ Cleo, among others.\n\nSuccessful singing and TV acting career\n\nKhumalo also had small roles in the SABC series Muvhango and Mponeng, in which she played a sangoma. She was also in a stage play titled The Journey.\n\nAfter a break from live performance and recording, Khumalo returned in 2008. She released a mature album titled I Just Wanna Live My Life. And it was produced and distributed by Kalawa Jazzmee Records Oscar Oskido Mdlongwa.\n\nThe video for I Just Wanna Live My Life was nominated for Best Dance Video and Best Afro Pop Video at the Channel O Music Awards.\n\nIt was also nominated as one of the top five nominees at the South African Music Awards (SAMAs).\n\nThis was alongside DJ Oskido, Liqui-Deep, Big Nuz and Rhythmic Element in the category Record of the Year. Khumalo was selected to take part in the Shoprite Checkers Women of the Year competition as well as the Museke online Africa Music Awards.\n\nDaughter also followed in her footsteps.\n\nShe and Sello Chicco Twala composed a hit song that topped the charts titled Mina Ngiyohlala Nginje.\n\nKhumalo was seen performing it alongside then-President Jacob Zuma during the 2009 ANC election campaigns.- sundayworld.za\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/ab69b314-bac1-4565-b431-e38f6c19a7d6-680x380.jpeg",
            "description": "South African musician and actress Winnie Khumalo has died at the age of 51. Sunday World can exclusively reveal that Khumalo died on Tuesday at her home after a short illness.",
            "time": "18:48",
            "date": "07 Jan 2025"
        },
        {
            "title": "Robber granted US$800 bail",
            "url": "https://www.herald.co.zw/robber-granted-us800-bail/",
            "content": "Prosper Dembedza\n\nHerald Correspondent\n\nHigh Court judge justice Regis Dembure has granted US$800 bail to a Zengeza 2 man who allegedly stole US$238 000 from a local company last year.\n\nKelly Chinaka who is being represented by Moffat Makuvatsine is facing robbery charges.\n\nIt is the States case that Chinaka connived with Kennedy Mbundire, Owen Mutera, Tedious Desmond Munyaradzi Mhungira and three others, who are still at large to rob the complainant of his money.\n\nThey gained entry into the complainants company offices after they held the guards on duty hostage at gunpoint.\n\nThey then used a grinder to open the safes and stole cash amounting to US$238 000. The accused persons shared the cash among themselves.\n\nAccording to the State ,there is a confirmation of calls made between the accused person and his accomplices soon after the commission of the crime.\n\nSo far from the US$238 000 stolen, only US$6 500 was recovered.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/01/84181_generic-wpvi-robbery-IMG.jpeg",
            "description": "Prosper Dembedza Herald Correspondent High Court judge justice Regis Dembure has granted US$800 bail to a Zengeza 2 man who allegedly stole US$238 000 from a local company last year. Kelly Chinaka who is being represented by Moffat Makuvatsine is facing robbery charges. It is the State’s case that Chinaka connived with Kennedy Mbundire, Owen […]",
            "time": "18:48",
            "date": "07 Jan 2025"
        },
        {
            "title": "19 hippos die in Mid Zambezi Region",
            "url": "https://www.herald.co.zw/19-hippos-die-in-mid-zambezi-region/",
            "content": "Walter Nyamukondiwa\n\nMashonaland West Bureau Chief\n\nAt least 19 hippos have died of unknown causes over the past three months in the Mid-Zambezi region.\n\nInvestigations are in progress to establish the cause of death of 18 hippos at Sapi Safari Area and another one in Chirundu, Mid Zambezi Region.\n\nThe Zimbabwe Parks and Wildlife Management Authority (Zimparks), working with various partners has collected samples for testing.\n\nZimparks spokesperson Mr Tinashe Farawo confirmed the developments emphasising the authoritys commitment to promote the health and safety of wildlife.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2011/10/hippos-emmenzoo1.jpg",
            "description": "At least 19 hippos have died of unknown causes over the past three months in the Mid-Zambezi region.",
            "time": "18:48",
            "date": "07 Jan 2025"
        },
        {
            "title": "Pig industry decries high production costs",
            "url": "https://www.herald.co.zw/pig-industry-decries-high-production-costs/",
            "content": "Edgar Vhera\n\nAgriculture Specialist Writer\n\nSTAKEHOLDERS in the pig industry have lamented the high cost of production against a decline in average selling price this festive season, which left many of them in the red and unable to recoup.\n\nA smallholder pig producer from Goromonzi, Mr Tapiwa Takawira said many pig farmers were caught between a rock and hard place characterised by low output prices against high cost of production rendering their businesses unprofitable.\n\nIn the past, the average on farm cost of production was averaging US$2, 20 per kilogramme but this has shot up to US$2, 95.\n\nWe used to cut on production cost by buying feed concentrate and mix with on-farm maize, but due to the El-Nino induced drought, there is no maize and we are buying expensive straight feeds, he said.\n\nThe pig industry is generally characterised by two pricing regimes in any calendar year  the peak and off-peak periods.\n\nMr Takawira disclosed that the festive season, which spans from October to February was the peak price period with average pork wholesale prices ranging between US$3, 60 and US$3, 75 per kilogramme. The off-peak period from March to September usually has an average price of US$2, 80 per kilogramme.\n\nAbout 60 percent of pig producers are small-scale.\n\nBrokers influence on pork pricing, high slaughter fees, market glut, water and pollution challenges, shortages, smuggling of cheaper pork and pork products from neighbouring countries are some of the challenges bedeviling the sector.\n\nPig slaughter charges have risen from an average of US$5 per beast to the current US$12 and small-scale farmers viability has been impacted negatively, added Mr Takawira.\n\nHe said the country risked depending on pork imports thereby losing out on the gains the industry had made under the National Development Strategy 1 (NDS1).\n\nLivestock and Meat Advisory Council (LMAC) executive administrator, Dr Reneth Mano concurred saying the pork industry has been hardest hit by a combination of higher than usual cost of feeds in a drought year and the shift of pork from value added tax (VAT) exemption to a standard rated food subject to 15 percent when sold through VAT registered abattoirs and retail outlets.\n\nFalling discretionary real income of lower income households with highly elastic demand for meat also meant that pig farmers ended up absorbing almost all of the rising cost of feed and the rising cost of money, as well as 100 percent of the 15 percent VAT introduced in January 2023, said Dr Mano.\n\nHe said smallholder commercial pig farmers supplying pork to most rural townships and growth points have struggled to get feed since last year.\n\nThese farmers are used to making their own feeds through buying locally available maize and oilseeds to formulate. The drought caused local maize prices to rise by more than 100 percent for most pig farmers from the normal range of US$240 to US$350 per tonne to between US$360 and US$700, he added.\n\nPork demand has suffered as well from the abundance of cheap beef on the informal rural and urban markets coming from a distressed drought-hit smallholder cattle farming community.\n\nDr Mano said the countrys biggest pork brands have not been spared, as they suffered their biggest loss in domestic market share with the supermarket route to markets suffering further losses in competitiveness to the informal route.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2011/04/pigs.jpg",
            "description": "  Edgar Vhera Agriculture Specialist Writer STAKEHOLDERS in the pig industry have lamented the high cost of production against a decline in average selling price this festive season, which left many of them in the red and unable to recoup. A smallholder pig producer from Goromonzi, Mr Tapiwa Takawira said many pig farmers were caught […]",
            "time": "18:48",
            "date": "07 Jan 2025"
        },
        {
            "title": "Farmers4ED to push local produce into UK market",
            "url": "https://www.herald.co.zw/farmers4ed-to-push-local-produce-into-uk-market/",
            "content": "Conrad Mupesa Mashonaland West Bureau\n\nThe Farmers4ED United Kingdom Chapter is working tirelessly to ensure that local produce finds its way into that country.\n\nThe chapter is pushing for Zimbabwes horticulture products to be taken up by most UK supermarkets.\n\nMost Zimbabweans who have relocated to the United Kingdom, fail to access locally produced organic foods hence the move by the chapter to spearhead availability of the produce.\n\nThe chapters chairman, Cde Lloyd Makonese, who is currently in the country, said Zimbabwe is supposed to claim its space in UK, which is home to thousands of Zimbabweans working in various sectors.\n\nOf importance is the fact that foods from South Africa, Zambia and Nigeria are widely accessible in supermarkets and all. We have thousands of Zimbabwean there who are have no access to organic foods produced in Zimbabwe, he said.\n\nThe chapter has since approached various supermarkets and retail outlets that are willing to sell the local products in UK.\n\nWe are working on setting up a warehouse where these products will be exported to before they are absorbed by the retailers for resell, he added.\n\nFarmers4ED UK Chapter is going to work as a link between local farmers and the UK market.\n\nThe national president of Farmers4ED Cde Tapiwa Chitate said plans were also in place to set up organic and traditional herbal gardens in all the provinces.\n\nThe projects also dovetails with plans in place by the Chapter and UK-based firm wanting to develop medicines from local herbals.\n\nThe UK Chapter is made up of the chairman, public relations, marketing, logistics and transport and, women and youth officers.\n\nCde Makonese who has been in the overseas country for 22 years, is a health practitioner studying towards attaining a doctorate in the same field.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Screenshot-1-680x380.png",
            "description": "Conrad Mupesa Mashonaland West Bureau The Farmers4ED United Kingdom Chapter is working tirelessly to ensure that local produce finds its way into that country. The chapter is pushing for Zimbabwe’s horticulture products to be taken up by most UK supermarkets. Most Zimbabweans who have relocated to the United Kingdom, fail to access locally produced organic […]",
            "time": "18:48",
            "date": "07 Jan 2025"
        },
        {
            "title": "EMA cracks down on vehicle emissions to combat pollution and climate change",
            "url": "https://www.herald.co.zw/ema-cracks-down-on-vehicle-emissions-to-combat-pollution-and-climate-change/",
            "content": "Mutsawashe Mashandure\n\nHerald Correspondent\n\nThe Environmental Management Agency (EMA) has intensified efforts to reduce vehicle emissions in Harare to lessen their devastating impact on air quality, public health, and the environment.\n\nEMAs Harare provincial manager Mr Leon Mutungamiri, emphasised the urgency of addressing this issue in a statement issued on Tuesday.\n\nVehicle emissions are a significant contributor to air pollution, which has severe consequences for human health, including respiratory problems and other ailments, he said.\n\nMr Mutungamiri highlighted that EMA will collaborate with law enforcement agencies to apprehend drivers of vehicles that emit excessive smoke.\n\nWe will work closely with the police to stop vehicles that produce excessive smoke that pose a threat to public health and contravene the Environmental Management Act. Any person found with a vehicle emitting heavy smoke shall be fined $30, he said.\n\nThe Environmental Management Act, Chapter 20:27, clearly states that any person who emits any substance that causes air pollution in contravention of emission standards shall be guilty of an offence and liable to a fine.\n\nOur plan is to embark on public awareness campaigns to educate vehicle owners about the importance of regular maintenance and the need to adhere to emission standards.\n\n By working together, EMA hopes to significantly reduce vehicle emissions and create a healthier, more sustainable environment for all Harare residents.\n\n",
            "image_url": null,
            "description": "Mutsawashe Mashandure Herald Correspondent The Environmental Management Agency (EMA) has intensified efforts to reduce vehicle emissions in Harare to lessen their devastating impact on air quality, public health, and the environment. EMA’s Harare provincial manager Mr Leon Mutungamiri, emphasised the urgency of addressing this issue in a statement issued on Tuesday. “Vehicle emissions are a […]",
            "time": "18:48",
            "date": "07 Jan 2025"
        },
        {
            "title": "Car dealer in court over R220 000 fraud",
            "url": "https://www.herald.co.zw/car-dealer-in-court-over-r220-000-fraud/",
            "content": "Yeukai Karengezeka\n\nCourt Correspondent\n\nA local car dealer has appeared in court on allegations of defrauding a client of R220 000 after failing to deliver a vehicle he had promised to help import into the country.\n\nThe accused, 33-year-old Kelvin Kudzaishe Makuyana, is facing fraud charges. He was represented by his lawyer, Mr Rungano Mahuni.\n\nAlthough the State opposed bail, Makuyana was granted bail of US$250 after a successful application by his lawyer.\n\nHe will return to court on February 11. The complainant in the case, Macmillian Chiweshe, alleges that Makuyana failed to fulfill his promise to deliver a vehicle, causing him significant financial loss.\n\nProsecutor Mr Rufaro Chonzi told the court that in May 2024, Chiweshe approached Makuyana with the intention of purchasing a Volkswagen 7 model valued at R220 000 as a gift for his wife.\n\nMakuyana assured Chiweshe that he had the capacity to buy and import the vehicle on his behalf.\n\nOn May 8, Chiweshe agreed to the transaction. He was provided with an invoice for the vehicle and a South African First National Bank account number by Makuyana, where the payment was to be made.\n\nThat same day, Chiweshe transferred the required funds and sent proof of payment to Makuyana.\n\nMakuyana instructed Chiweshe to wait a few weeks for the vehicles arrival at Beitbridge Border Post, where customs duties would be settled.\n\nHowever, the court heard that after receiving the payment, Makuyana became evasive. He allegedly avoided meeting with Chiweshe and repeatedly gave false promises and excuses.\n\nEventually, he stopped responding to Chiweshes calls altogether. As a result, Chiweshe suffered a financial loss of R220 000, equivalent to US$12 000.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/courthammer-680x380.jpg",
            "description": "Yeukai Karengezeka Court Correspondent A local car dealer has appeared in court on allegations of defrauding a client of R220 000 after failing to deliver a vehicle he had promised to help import into the country. The accused, 33-year-old Kelvin Kudzaishe Makuyana, is facing fraud charges. He was represented by his lawyer, Mr Rungano Mahuni. […]",
            "time": "18:48",
            "date": "07 Jan 2025"
        },
        {
            "title": "Charumbira in Ghana for new Mahama’s inauguration",
            "url": "https://www.herald.co.zw/charumbira-in-ghana-for-new-mahamas-inauguration/",
            "content": "Zvamaida Murwira\n\nSenior Reporter\n\nPan African Parliament president Chief Fortune Charumbira is in Accra, Ghana for the inauguration of that countrys President elect, Mr John Dramani Mahama who was declared winner of elections held last month.\n\nMr Mahama will also be sworn in together with Vice President elect, Mrs Naana Jane Opoku-Agyemang who becomes the countrys first female vice president.\n\nIn an invitation letter addressed to Chief Charumbira, Speaker of Ghanas Parliament, Mr Alban Sumana Bagbin said his presence would go a long way in forging strong collaborations among African parliaments.\n\nI write to invite you to the official swearing of the President elect and Vice President elect of the Republic of Ghana. The ceremony is scheduled to take place in the morning on Tuesday January 7, 2025, read the letter.\n\nAs Ghana transition to a new political administration and begins a new legislative session, we acknowledge the significance of building strong ties and collaboration among parliaments across the African region.\n\nYour presence would therefore be a great honour and a symbol of unity, shared values and commitment to democratic governance in our respective countries.\n\nMr Mahama, who was the main opposition leader, beat his main rival, vice president and ruling party presidential candidate, Mahamudu Bawumia.\n\nMr Mahama, 66, is making a comeback after serving as Ghanas president from 2012 to 2016.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/12/1212HR0112CHARUMBIRA-PARLY-1.jpg",
            "description": "Zvamaida Murwira Senior Reporter Pan African Parliament president Chief Fortune Charumbira is in Accra, Ghana for the inauguration of that country’s President elect, Mr John Dramani Mahama who was declared winner of elections held last month. Mr Mahama will also be sworn in together with Vice President elect, Mrs Naana Jane Opoku-Agyemang who becomes the […]",
            "time": "18:48",
            "date": "07 Jan 2025"
        }
    ]
}