{
    "news": [
        {
            "title": "Council official, lawyer acquitted of fraud charges",
            "url": "https://www.herald.co.zw/council-official-lawyer-acquitted-of-fraud-charges/",
            "content": "Yeukai Karengezeka\n\nCourt Correspondent\n\nSUSPENDED Council for Legal Education (CLE) executive secretary, Huggins Duri, and lawyer Linda Kovi have been acquitted of fraud charges after a full trial at the Harare Magistrates Court.\n\nRegional magistrate Mr Lazini Ncube ruled that the State had failed to prove its case beyond reasonable doubt and provided insufficient evidence to support the allegations.\n\nMoreover, the main witness, Ms Shorai Mupunga was not credible.\n\nThe two were cleared of any wrongdoing.\n\nThe case centered around allegations that Kovi and Duri conspired to fraudulently obtain a certificate of completion, which allowed the former to be admitted as a legal practitioner in Zimbabwe.\n\nThe complainant in the matter was the State, represented by CLE finance and administration manager Mr Joe Zimba.\n\nKovi (34), an administrator at Kanoti and Partners, graduated in 2019 with a Bachelor of Laws degree from the University of Africa in Lusaka, Zambia.\n\nTo practice law in Zimbabwe, she needed to obtain a conversion certificate from CLE after passing a series of prescribed examinations.\n\nAccording to the State, Kovi registered with the CLE in 2020 and sat for four modules Common Law I & II, Criminal Procedure, and Evidence.\n\nShe only passed Common Law II with 54 percent and failed the remaining three modules. She later registered for three additional modules Civil Procedure, Statutes, and Ethics but failed them all.\n\nInvestigations also revealed that she never wrote the Bookkeeping module, a requirement for certification.\n\nThe prosecution alleged that Kovi then approached Duri, who was the CLE executive secretary at the time, and sought his assistance in fraudulently obtaining a practicing certificate.\n\nDuri purportedly instructed a CLE official, Ms Mupunga, to include Kovis name on the list of those eligible for certification, despite her failing the required modules.\n\nA certificate of completion was allegedly processed, signed by the chairman of the Board of Examinations, and collected by Duri.\n\nThis certificate enabled Kovi to be admitted as a legal practitioner before the High Court of Zimbabwe.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/fraud-680x348-680x348-680x348.jpg",
            "description": "SUSPENDED Council for Legal Education (CLE) executive secretary, Huggins Duri, and lawyer Linda Kovi have been acquitted of fraud charges after a full trial at the Harare Magistrates' Court.",
            "time": "21:46",
            "date": "16 Apr 2025"
        },
        {
            "title": "Five a side football on a revival",
            "url": "https://www.herald.co.zw/five-a-side-football-on-a-revival/",
            "content": "FIVE-A-SIDE football is on a revival, especially in Mbare, which was once a vibrant home for the sport, back in the day.\n\nAlso known as Futsal, the game had faded, thanks to a combination of factors including lack of sponsorship.\n\nHowever, there is a glimmer of hope in Mbare which has been hosting some Northern Region Futsal games.\n\nSunshine Stars clinched the championship a fortnight ago, in their maiden season, after walloping Glen Stars by 4-0 in their final match at Stodart Netball Complex in Mbare.\n\nSo far so good Futsal is now in the right direction and its still a baby that needs good caring with the right people and the right partnerships with the corporate world, Northern Region Futsal chairman, Callistus Keche, said.\n\nThe 5-A-Side game has helped a lot of youths to stay away from drug abuse.\n\nWe are hoping our Futsal players can also participate in the Futsal World Cup and Futsal Africa Cup of Nations qualifiers.\n\nAnd also, if we manage to get an international friendly with other Futsal powerhouses, it would be nice, added Keche.\n\nThe next season starts in May and time to source a sponsor might be running out for the executive.\n\nSo far we dont have sponsorship but we are working hard to find corporates who want to work with Futsal in Zimbabwe.\n\nWe are inviting teams from all over the country to come and join our fast growing game, said Keche.\n\nSunshine Stars chairman, Dexter Chafa, is on cloud nine, after his side clinched the title in their maiden season.\n\nHe is however worried about the lack of sponsorship.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Untitled-3-copy.jpg",
            "description": "FIVE-A-SIDE football is on a revival, especially in Mbare, which was once a vibrant home for the sport, back in the day.",
            "time": "21:46",
            "date": "16 Apr 2025"
        },
        {
            "title": "Food aid, infrastructure development boost for Hurungwe",
            "url": "https://www.herald.co.zw/food-aid-infrastructure-development-boost-for-hurungwe/",
            "content": "Peter Tanyanyiwa\n\nHerald Correspondent\n\nHURUNGWE East Constituency has launched comprehensive relief efforts, combining food aid distribution with critical infrastructure repairs to support vulnerable communities.\n\nHurungwe East legislator, Cde Chenjerai Kangausaru, announced progress in local development initiatives at a recent food distribution event at Karoi Enterprise Primary School.\n\nYesterday (Tuesday) we were at Karoi Enterprise Primary school repairing boreholes in Ward 3 Hurungwe East Constituency and also distributing more than 500 bags of maize-meal and rice to the community as President Mnangagwa said that no one will die of hunger and we are leaving no place and no one behind, he said.\n\nWe are also helping our people through our partnership with the international humanitarian organisation Tzu Chi Foundation in treating those with cancer, stroke and all kinds of ailments as well as educating our people.\n\nHurungwe East, situated in Mashonaland West Province, has historically been known as part of Zimbabwes agricultural heartland.\n\nThe constituencys recent development efforts align with broader national initiatives to ensure food security and improve infrastructure in rural areas.\n\nTzu Chi Foundations involvement has significantly enhanced healthcare access in the area.\n\nThe organisation has established medical outreach programmes and clinics to support local communities, particularly focusing on treating serious conditions such as cancer and stroke.\n\nLocal infrastructure development has also seen progress, with particular attention paid to water access through borehole repairs.\n\nThese efforts are part of a comprehensive strategy to improve living conditions and ensure sustainable development in the constituency.\n\nThe initiatives reflect President Mnangagwas emphasis on building long-term resilience against climate-induced food insecurity, while also addressing immediate humanitarian needs.\n\nThe Governments approach includes investments in climate-smart agriculture and enhanced social protection systems.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/tanya.jpg",
            "description": "HURUNGWE East Constituency has launched comprehensive relief efforts, combining food aid distribution with critical infrastructure repairs to support vulnerable communities.",
            "time": "21:46",
            "date": "16 Apr 2025"
        },
        {
            "title": "Harare province gears for Independence Day",
            "url": "https://www.herald.co.zw/harare-province-gears-for-independence-day/",
            "content": "Obey Musiwa\n\nHerald Reporter\n\nPREPARATIONS for the 45th Independence Day celebrations for Harare Province to be held at Epworth High School are almost complete, with infrastructure to accommodate the masses already in place.\n\nSpeaking at the final rehearsals, Minister of State for Harare Metropolitan Provincial Affairs and Devolution, Senator Charles Tawengwa, said Harare will experience a celebration like never before, with entertainment and other festivities.\n\nHarare will join the rest of the nation in commemorating our independence and honouring our fallen and living heroes at this event, he said.\n\nWe expect a full house, even an overflow, as everyone is excited about the festivities. There will be soccer, entertainment, music, traditional dances and so much more happening here in Epworth for the first time.\n\nMinister Tawengwa said they were expecting a good turnout at the commemorations.\n\nThe celebrations will run under the theme Zim@45: Devolve and Develop Together Towards Vision 2030, showcasing the countrys progress and future development plans.\n\nMinister Tawengwa said nexts years celebrations will be held in Chitungwiza following the Governments commitment to ensure that no place is left behind.\n\nThis year we are in Epworth, and hopefully next year we will be doing the same in Chitungwiza, he said.\n\nThis is our final rehearsal, we are ready, we are prepared for the National Day on the 18th, which is two days away.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/more-1.jpg",
            "description": "PREPARATIONS for the 45th Independence Day celebrations for Harare Province to be held at Epworth High School are almost complete, with infrastructure to accommodate the masses already in place.",
            "time": "21:46",
            "date": "16 Apr 2025"
        },
        {
            "title": "Beitbridge’s Headman Mabidi dies",
            "url": "https://www.herald.co.zw/beitbridges-headman-mabidi-dies/",
            "content": "Thupeyo Muleya,\n\nBeitbridge Bureau\n\nBeitbridge has been plunged into mourning following the passing of Headman Mabidi (57), born Mina Mine Mbedzi, on Wednesday morning.\n\nHe died at United Bulawayo Hospitals, where he had been admitted following a short illness.\n\nThe late headman, among other things, was an environmentalist who fought hard to protect grazing lands, the bushes and the wanton cutting down of trees in Beitbridge West under Chief Tshitaudze area.\n\nDistrict Development Coordinator (DDC) Sikhangezile Mafu-Moyo said they had lost one of the hard-working traditional leaders.\n\nAt the same time, I want to express my heartfelt condolences to the community of Beitbridge and his relatives. This is a loss to all of us within Beitbridge, she said.\n\nMrs Mafu-Moyo said the late traditional leader was born on February 3 1968, in Beitbridge and was confirmed substantive headman in September 2019.\n\nChief Tshitaudze said: This is a blow to us as traditional leaders. He championed several community development projects around the district. He had a passion for development and the preservation of our tradition and culture as the Vha Venda people. We will greatly miss him.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/12/herald-newspapers1.jpg",
            "description": "Beitbridge has been plunged into mourning following the passing of Headman Mabidi (57), born Mina Mine Mbedzi, on Wednesday morning.",
            "time": "21:46",
            "date": "16 Apr 2025"
        },
        {
            "title": "Former MP accuses suspected land barons of trying to overturn High Court order",
            "url": "https://www.herald.co.zw/former-mp-accuses-suspected-land-barons-of-trying-to-overturn-high-court-order/",
            "content": "Prosper Dembedza\n\nHerald Correspondent\n\nFORMER Member of Parliament for Mount Pleasant, Jason Pasade, on Tuesday accused Eastwind Trust owners Rodgers Pote and Trymore Arineshito, who are facing charges of contempt of court and carrying out development on an illegal settlement without approval, of trying to force the lower court to overturn a High Court order to evict them.\n\nDuring cross-examination, Mr Pasade said the pair, through their defence, were trying to force the court to overturn a High Court ruling that evicted them.\n\nHe added that so far, the pair and their company had lost four cases of the same nature at the High Court.\n\nThe matter was deferred to May 13 for trial continuation.\n\nDuring the previous sitting, Mr Pasade told the court that the two were disowned by Harare City Councils director of Housing in an affidavit.\n\nHe said Arineshito and Pote were ordered by the High Court to vacate the premises, but they are not abiding by that order.\n\nMr Pasade produced an affidavit written by the citys Director of Housing, Mr Addmore Nhekairo, in which he said he never allocated them any land.\n\nHe said he knew the accused persons not only in connection with this case but also as land barons at Melfort Farm, Ruwa.\n\nMr Pasade said in 2020, his company entered into an agreement to develop land on behalf of the Freedom Fighters Development Trust.\n\nHe said his company started to carry out developments. Roads were opened while most developments were already at an advanced stage.\n\nHowever, the accused persons started illegally selling and allocating stands in the area. Mr Pasades company allegedly went to court and acquired a High Court order which gave it the authority to remove the illegally settled people.\n\nHowever, the accused persons did not vacate the stands, contrary to the court order. It is the States case that on November 2023, the High Court issued a provisional order against Eastwind Trust.\n\nAfter the order was granted, the accused were served by the Sheriff, but continued invading the area in violation of the order.\n\nThe complainant is Homegram Investments Limited, represented by Mr Pasade.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/court-1.jpg",
            "description": "FORMER Member of Parliament for Mount Pleasant, Jason Pasade, on Tuesday accused Eastwind Trust owners Rodgers Pote and Trymore Arineshito, who are facing charges of contempt of court and carrying out development on an illegal settlement without approval, of trying to force the lower court to overturn a High Court order to evict them.",
            "time": "21:46",
            "date": "16 Apr 2025"
        },
        {
            "title": "Shurugwi head squanders 77 candidates’ exam fees",
            "url": "https://www.herald.co.zw/shurugwi-head-squanders-77-candidates-exam-fees/",
            "content": "Midlands Bureau\n\nA headmaster at Dombojena Primary School in Shurugwi has been arrested for allegedly misappropriating over $1 700 in Zimsec examination fees.\n\nEmmanuel Hove (52) appeared before a Shurugwi magistrate, Ms Patricia Gwetsai, facing one count of fraud.\n\nHove was granted US$100 bail.\n\nHe was ordered not to interfere with State witnesses, to report at Shurugwi Police Station every Friday and to continue residing at his homestead under Chief Nhema.\n\nProsecutor Ms Kwanele Njini said Hove allegedly squandered the students examination fees amounting to US$1 745.\n\nThe court heard that the registration fees were for 77 candidates who want to sit for the November Zimsec examinations.\n\nSince Dombojena Primary School is not an examination centre, Hove was supposed to go and register the pupils at Railway Block Primary School, which is also in Shurugwi.\n\nThe alleged fraud was discovered when Dombojena deputy head Mr Kundai Pedzi visited Railway Primary School and discovered that the registration fees for the 77 pupils had not been processed.\n\nA report was made to the police, leading to Hoves arrest.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/06/exam-fees.jpeg",
            "description": "A headmaster at Dombojena Primary School in Shurugwi has been arrested for allegedly misappropriating over $1 700 in Zimsec examination fees.",
            "time": "21:46",
            "date": "16 Apr 2025"
        },
        {
            "title": "Harare Province gears up for Independence Day",
            "url": "https://www.herald.co.zw/harare-province-gears-up-for-independence-day/",
            "content": "Obey Musiwa\n\nHerald Reporter\n\nPreparations for the upcoming 45th Independence Day celebrations at Epworth High School in Harare are now almost complete, the Minister of State for Harare Metropolitan Provincial Affairs and Devolution, Senator Charles Tawengwa has said.\n\nSpeaking at the final rehearsals today, Minister Tawengwa said Harare will experience a celebration like never before.\n\nWe expect a full house, even an overflow, as everyone is excited about the festivities. There will be soccer, entertainment, music, traditional dances, and so much more happening here in Epworth, he said.\n\nThis years commemorations are themed Zim@45: Devolve and Develop Together Towards Vision 2030, which showcases the countrys progress and future development plans.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/09/charles-tavengwa.jpg",
            "description": "Preparations for the upcoming 45th Independence Day celebrations at Epworth High School in Harare are now almost complete, the Minister of State for Harare Metropolitan Provincial Affairs and Devolution, Senator Charles Tawengwa has said.",
            "time": "21:46",
            "date": "16 Apr 2025"
        },
        {
            "title": "Zim’s public, private sectors join hands for maximum benefits at Expo 2025 Osaka",
            "url": "https://www.herald.co.zw/zims-public-private-sectors-join-hands-for-maximum-benefits-at-expo-2025-osaka/",
            "content": "Hebert Zharare in OSAKA, Japan\n\nZimbabwe is leaving no stone unturned in its quest to ensure that both public and private sector players derive maximum value from the countrys participation at the Expo 2025 Osaka in Japan.\n\nIt has emerged that strategic links have already been forged here with key organisations to help pair key economic players with Zimbabwean organisations seeking partnerships.\n\nAccording to official reports, strategic partnerships and stakeholder engagement to strengthen Zimbabwes dialogue with the Japanese business community have been formed with the Embassy of Zimbabwe in Japan and relevant Japanese trade agencies such as JETRO to co-host business sessions and encourage participation from their networks.\n\nIt has also emerged that Zimbabwe will engage the diaspora business community in Japan to leverage existing business relationships and facilitate networking opportunities between Zimbabwean and Japanese enterprises on the sidelines of the Expo.\n\nZimbabwe will engage reputable Japanese consultancies with expertise in business matchmaking to identify and link Zimbabwean businesses with potential Japanese partners ahead of the business forums.\n\nThese consultancies will facilitate targeted outreach to Japanese industry associations, chambers of commerce and key sector players to secure their participation, reads the report.\n\nMr Allan Majuru, Zimbabwes Commissioner General to the Expo confirmed the development and said plans are being made to ensure that the country successfully hosts the business forum for the benefit of Zimbabwean businesses.\n\nWe are going to have a business forum on July 15, where we are going to be focusing on tourism, investment, and trade.\n\nOn the 16th of July, President Mnangagwa will come through. Some agreements will be signed to make sure that we are not just counting the numbers, but that we are also looking at the value that is going to come out, he Mr Majuru.\n\nWe have linked up with potential partners. When we were preparing for the Expo, it was more of a joint initiative with public and private sector players working together  the likes of CZI, ZNCC, ZIDA and Tourism Business Council, among others.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Majuru.jpg",
            "description": "Zimbabwe is leaving no stone unturned in its quest to ensure that both public and private sector players derive maximum value from the country’s participation at the Expo 2025 Osaka in Japan.",
            "time": "21:46",
            "date": "16 Apr 2025"
        },
        {
            "title": "Former ‘Isidingo’ star Don Mlangeni Nawa dies",
            "url": "https://www.herald.co.zw/former-isidingo-star-don-mlangeni-nawa-dies/",
            "content": "Legendary South African actor Don Mlangeni Nawa has died.His family confirmed the news in a statement.\n\nThe screen veteran has been one of the most recognisable faces on the small box for at least three decades.\n\nHe is famously known for portraying Zebedee Matabane on the former SABC 3 soapie Isidingo. He portrayed the role for 16 years.\n\nHe was the heart of our family  a loving father, brother, and friend. To the world, he was a gifted and respected actor whose presence lit up every stage and screen he graced. His legacy lives on in the lives he touched, the stories he told, and the love he gave so freely, read the statement.\n\nIn 2018, the thespian was awarded a Lifetime Achievement Award at the Royalty Soapie Awards. He is known for his role on productions such as The Estate, The Throne, Legacy, Sgudi Snaysi, Uzalo, and Abomama.\n\nFollowing news of the actors passing, tributes have been shared on social media by those who worked with him and his fans.-iolnews\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/FB_IMG_1744814881139-680x380.jpg",
            "description": "Legendary South African actor Don Mlangeni Nawa has died.",
            "time": "21:46",
            "date": "16 Apr 2025"
        }
    ]
}