{
    "news": [
        {
            "title": "Juvenile killed in crash",
            "url": "https://www.herald.co.zw/juvenile-killed-in-crash/",
            "content": "Andrew MuvishiMashonaland East CorrespondentA JUVENILE died on the spot after she was knocked down by Toyota Aqua at the 5 km peg off the Harare-Mutare Highway along Goromonzi Road.Mashonaland East deputy police spokesperson Assistant Inspector Misheck Denhere confirmed the incident.On April 16 at around 4.30pm a fatal road accident occurred at the 5km peg off the Harare-Mutare (Highway) along Goromonzi Road where one pedestrian was hit by a Toyota Aqua and died on the spot, he said.\n\nAsst Insp Denhere urged motorists to be cautious during the Easter and Independence holidays.\n\nAs police we are urging motorists to be cautious and adhere to road rules and regulations as police is firm on the ground, said Asst Insp Denhere.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/04/accident-7.jpg",
            "description": "A JUVENILE died on the spot after she was knocked down by Toyota Aqua at the 5 km peg off the Harare-Mutare Highway along Goromonzi Road.",
            "time": "21:46",
            "date": "17 Apr 2025"
        },
        {
            "title": "Palestine hails Zimbabwe as a beacon of African unity",
            "url": "https://www.herald.co.zw/palestine-hails-zimbabwe-as-a-beacon-of-african-unity/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nTHE Ambassador of the State of Palestine to Zimbabwe, Dr Tamer Almassri, has extended warm and heartfelt congratulations to President Mnangagwa, the Government and the people of Zimbabwe on the countrys 45th Independence Day.\n\nHe hailed Zimbabwe as a beacon of African unity and a pillar of international solidarity.\n\nIn a congratulatory message to the President, Ambassador Almassri commended Zimbabwes progress over the past four and a half decades, particularly in consolidating independence, driving economic development, and promoting regional and global co-operation.\n\nYour Excellencys leadership has been instrumental in steering the country towards a path of growth, stability, and prosperity, he said.\n\nAmbassador Almassri also said Zimbabwe has made achievements in sectors such as education, healthcare and infrastructure as strong indicators of Zimbabwes trajectory toward the national development goals outlined in Vision 2030.\n\nHe also paid tribute to the historic and enduring friendship between Zimbabwe and Palestine, forged through shared struggles as liberation movements and cemented by common values of justice, equality, and human rights.\n\nThe State of Palestine deeply admires Zimbabwes steadfast dedication to its sovereignty and its pursuit of a brighter future for all its citizens, he said.\n\nThe ambassador expressed deep appreciation for Zimbabwes consistent and vocal support for the Palestinian cause, particularly its condemnation of Israeli aggression and the ongoing humanitarian crisis in Gaza.\n\nWe are profoundly grateful for Zimbabwes unwavering support and advocacy for justice and peace for our people.\n\nAs Zimbabwe marks this milestone, the Palestinian envoy expressed confidence in the countrys continued role as a leader in championing peace, unity and development on the African continent and beyond.\n\nThe African continent looks up to Zimbabwe as a beacon of hope and a champion of African unity and solidarity, he said.\n\nDr Almassri wished the nation continued peace, prosperity and unity, affirming Palestines ongoing solidarity and high regard for the people of Zimbabwe.\n\nZimbabwe is marking its 45th Independence Anniversary on Friday with nationwide celebrations commemorating the countrys liberation from colonial rule in 1980.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/IMG-20250417-WA0130-680x380.jpg",
            "description": "THE Ambassador of the State of Palestine to Zimbabwe, Dr Tamer Almassri, has extended warm and heartfelt congratulations to President Mnangagwa, the Government and the people of Zimbabwe on the country's 45th Independence Day.",
            "time": "21:46",
            "date": "17 Apr 2025"
        },
        {
            "title": "ZDF clarifies status of retired officer",
            "url": "https://www.herald.co.zw/zdf-clarifies-status-of-retired-officer/",
            "content": "Herald Reporter\n\nTHE Zimbabwe Defence Forces (ZDF) has addressed growing concerns surrounding inaccurate reports circulating on social media regarding Group Captain (Retired) Boncase Mwakorera.\n\nThese reports erroneously suggest that Group Captain (Retired) Mwakorera is still an active member of the force.\n\nIn a statement, the ZDF said it has noted with concern the stories, published online and circulated on various social media platforms, that inaccurately report that Group Captain (Retired) Mwakorera is serving in the Air Force of Zimbabwe (AFZ).\n\nThe Officer served in the AFZ and retired on May 31 2021 in the rank of Group Captain, said the ZDF.\n\nIn such instances, it is prudent to accurately capture that he is a retired Group Captain. Failure to correctly capture such details has the potential to mislead the public that the actions by the individual are associated with the ZDF.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Zimbabwe-Defence-Forces.jpg",
            "description": "THE Zimbabwe Defence Forces (ZDF) has addressed growing concerns surrounding inaccurate reports circulating on social media regarding Group Captain (Retired) Boncase Mwakorera.",
            "time": "21:46",
            "date": "17 Apr 2025"
        },
        {
            "title": "More jobs as Belarus, Zimbabwe deepen ties",
            "url": "https://www.herald.co.zw/more-jobs-as-belarus-zimbabwe-deepen-ties/",
            "content": "Theseus Shambare\n\nZimbabwes industrial landscape is buzzing with the promise of significant job creation as AVM Africa, the countrys oldest bus manufacturer, gears up to restart large-scale assembly and venture into tractor production through a landmark agreement with a Belarusian company.\n\nThis development, welcomed by the Government, is poised to create much-needed employment opportunities and revitalise local industries, offering a tangible boost to the nations economy.\n\nThe strategic decision to assemble vehicles locally, leveraging the recently commissioned Dinson Iron and Steel Company for locally produced steel in bus shell fabrication, a pivotal shift towards value addition within Zimbabwe.\n\nIndustry and Commerce Minister Mangaliso Ndlovu highlighted this potential during a tour at BiSON Agro Machinery company in Harare on Tuesday.\n\nMatter of fact, AVM and a Belarusian company have reached an agreement where we will start assembling buses. And progressively we will be moving into other units like tractors, he said.\n\nThis move not only directly creates jobs on the assembly lines but also fosters growth in supporting industries, from steel production to component manufacturing and logistics.\n\nThe impact, Minister Ndlovu said, extends beyond vehicle assembly.\n\nThe ongoing agricultural mechanisation programme, a cornerstone of the Zimbabwe-Belarus partnership, is set to expand also, he said.\n\nBelarusian Vice Prime Minister Viktor Karankevich announced ambitious targets, revealing that more than 700 tractors, 80 harvesters, over 30 grain dryers will be delivered to Zimbabwe within the framework of 2025.\n\nThe machinery, coupled with the establishment of local service centres and training programmes, will generate numerous jobs in maintenance, repair and agricultural operations.\n\nMr Karankevich emphasised the comprehensive approach, noting the focus on service provision, spare parts provision and educational aspect where Zimbabwean specialists are being trained and educated on the grounds of the very service sector.\n\nLands, Agriculture, Fisheries, Water and Rural Development Permanent Secretary Professor Obert Jiri underscored the crucial role of this collaboration in modernising Zimbabwes agricultural sector.\n\nWe have mechanisation as one of our key enablers, and the support that we have gotten from Belarus is very much appreciated, he said.\n\nWe also noted that we must localise the production of these tractors and other pieces of machinery. So we are appreciative of the cooperation that we have with Belarus in the agro machinery space.\n\nThe initiative promises to generate thousands of jobs across various skill levels from factory workers and technicians to agricultural mechanics and support staff.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/11/1811-1-1-JOBS.jpg",
            "description": "Zimbabwe’s industrial landscape is buzzing with the promise of significant job creation as AVM Africa, the country’s oldest bus manufacturer, gears up to restart large-scale assembly and venture into tractor production through a landmark agreement with a Belarusian company.",
            "time": "21:46",
            "date": "17 Apr 2025"
        },
        {
            "title": "Chitungwiza Municipality allays fears over brown water",
            "url": "https://www.herald.co.zw/chitungwiza-municipality-allays-fears-over-brown-water/",
            "content": "Diana NhereraChitungwiza Municipality has clarified that the brownish colour of the water coming out of taps is residual chlorine that had accumulated due to long periods without water.Spokesperson for Chitungwiza Municipality, Mr Tafadzwa Kachiko said this is a common occurrence in systems with intermittent water supply.\n\nBecause we are currently receiving 15 megalitres per day while the actual demand is 70 megalitres, we have had to implement water rationing, he said.\n\nAs a result, some areas go without water for extended periods. When supply is restored, the first flow of water that comes through the pipes often contains higher levels of residual chlorine.\n\nThis is due to the chlorine settling or concentrating in the pipes during the dry period. So when people start filling buckets again, the first few litres may appear to have stronger chlorine presence.\n\nMr Kachiko said this is not harmful and is a result of necessary chlorination for safe drinking water combined with the nature of intermittent delivery.\n\nHe said water supply has generally improved since the recommissioning of the Prince Edward water treatment plant.\n\nMr Kachiko said before the recommissioning of the plant, Chitungwiza was receiving between one to three megalitres per day pumped from Morton Jaffray waterworks.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/FB_IMG_1744906094902-680x380.jpg",
            "description": "Chitungwiza Municipality has clarified that the brownish colour of the water coming out of taps is residual chlorine that had accumulated due to long periods without water.",
            "time": "21:46",
            "date": "17 Apr 2025"
        },
        {
            "title": "SAAPA applauds Govt’s Smart Traffic crackdown",
            "url": "https://www.herald.co.zw/saapa-applauds-govts-smart-traffic-crackdown/",
            "content": "Herald ReporterThe Governments decision to roll out breathalysers and implement smart traffic enforcement at roadblocks across the country has been hailed as a critical step towards improving road safety, especially ahead of the Easter and Independence Day holidays.The Southern African Alcohol Policy Alliance (SAAPA) Zimbabwe welcomed the move on Wednesday, describing it as a bold and timely intervention in the countrys fight against alcohol-related traffic accidents.\n\nThis move could not have come at a better time. The deployment of breathalysers shows a real commitment to saving lives and keeping our roads safe, read the statement.\n\nWe applaud this step. It is a sign that the Government is listening and responding to a long-standing public health concern.\n\nStatistics from previous holiday periods have consistently shown a surge in road carnage, often linked to alcohol abuse. The introduction of modern enforcement tools is expected to significantly reduce incidents of drink-driving.\n\nHowever, SAAPA Zimbabwe warned that while breathalysers are a vital deterrent, they are not a standalone solution.The organisation called for the urgent adoption and implementation of Zimbabwes National Alcohol Policy.\n\nTo truly turn the tide on alcohol-related harm, Zimbabwe must urgently implement the National Alcohol Policy, a policy that has been waiting in the wings for far too long, the alliance said.\n\nThe proposed policy framework, which has been under review for several years, seeks to regulate alcohol consumption in line with the World Health Organisations (WHO) Global Strategy and SAFER initiative.\n\nThe strategy recommends evidence-based interventions such as restricting alcohol availability, enforcing drink-driving laws, increasing alcohol taxes, banning aggressive marketing and expanding treatment for alcohol dependence.\n\nBreathalysers can catch drunk-drivers  but strong alcohol policies can prevent them in the first place, SAAPA Zimbabwe said.\n\nThe organisation also urged members of the public to act responsibly during the upcoming holidays, calling on citizens to prioritise safety and look out for one another.\n\nLets honour these holidays by protecting one another. Dont drink and drive. Choose safety. Choose life.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/11/breathalysers.jpg",
            "description": "The Government's decision to roll out breathalysers and implement smart traffic enforcement at roadblocks across the country has been hailed as a critical step towards improving road safety, especially ahead of the Easter and Independence Day holidays.",
            "time": "21:46",
            "date": "17 Apr 2025"
        },
        {
            "title": "Veteran football administrator Mutukwa gives back to society",
            "url": "https://www.herald.co.zw/veteran-football-administrator-mutukwa-gives-back-to-society/",
            "content": "Curtworth MasangoZimpapers Sports HubMutukwa Academy is determined to make an immediate impact as they prepare for their debut in the Mashonaland Central Division Two B league, hosting Jumbo in their opening match on Saturday at Kanyemba High School.The club, which unveiled its squad and new kits yesterday, has set its sights on securing promotion to Division One, with club patron Edward Mutukwa expressing confidence in the teams readiness.\n\nSpeaking at the kit launch, Mutukwa said that the kit and squad unveiling marked the end of their rigorous pre-season preparations.\n\nToday is the climax of our preparations, where we have officially dressed the team to ensure we are organised for the challenges ahead, he said.\n\nWith extensive experience in football administration, Mutukwa said he was motivated to invest in rural talent development.\n\nAs a football person, I decided to return to my roots, where I grew up to nurture young talent, he said.\n\nOur goal is to spread football beyond urban areas and make a meaningful impact in Zimbabwes football ecosystem.\n\nThe academys squad comprises players aged 16 to 24, a deliberate strategy to develop well-rounded athletes capable of competing at higher levels.\n\nClub chairman Wellington Luwizhi highlighted the teams preseason preparations, including friendly matches against various clubs, as a sign of their readiness.\n\nWe have exposed the team to different opponents, and their performances have been encouraging, he said.\n\nThe community is grateful for this initiative, which is keeping young people engaged and steering them away from drug abuse and other social vices.Head coach Clever Nyikadzino echoed the optimism, stating that the team had undergone over a month of intensive training.\n\nWe are fully prepared for the new season, Nyikadzino said.Our target is to conquer the Mashonaland Central Division Two league. The support from leadership, including todays unveiling, shows we are ready.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/IMG-20250417-WA0112-680x380.jpg",
            "description": "Mutukwa Academy is determined to make an immediate impact as they prepare for their debut in the Mashonaland Central Division Two B league, hosting Jumbo in their opening match on Saturday at Kanyemba High School.",
            "time": "21:46",
            "date": "17 Apr 2025"
        },
        {
            "title": "Equal access to education for every child in Zimbabwe is a priority: President Mnangagwa",
            "url": "https://www.herald.co.zw/equal-access-to-education-for-every-child-in-zimbabwe-is-a-priority-president-mnangagwa/",
            "content": "Farai Dauramanzi\n\nZimbabwe has made significant strides in the attainment of Sustainable Development Goal 4 (SDG 4) on quality education, President Mnangagwa has said.\n\nIn his keynote address at the Childrens Party at Nyamuroro High School in Nembudziya, Gokwe this afternoon, the President emphasised the importance of SDG 4, which focuses on ensuring inclusive and equitable quality education and promoting lifelong learning opportunities for all.\n\nThis goal is vital as it strives to ensure access to education for every child in Zimbabwe.\n\nUnder our education system, boys and girls are being given equal access to education.\n\nHe said Education 5.0 speaks to the economic needs of the 21st century.\n\nWe now need students who can make and design products, said President Mnangagwa.\n\nMy Government will continue to equip you so that you face the future with confidence.\n\nHe encouraged the students to be innovative and emphasised his mantra of nyika inovakwa nevene vayo.\n\nThe President also spoke against the peddling of drugs and the abuse of social media platforms by children.\n\nSay no to drugs and say no to cyberbullying.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/President-Mnangagwa-2-680x380.jpg",
            "description": "Farai Dauramanzi Zimbabwe has made significant strides in the attainment of Sustainable Development Goal 4 (SDG 4) on quality education, President Mnangagwa has said. In his keynote address at the Children’s Party at Nyamuroro High School in Nembudziya, Gokwe this afternoon, the President emphasised the importance of SDG 4, which focuses on ensuring inclusive and […]",
            "time": "21:46",
            "date": "17 Apr 2025"
        },
        {
            "title": "Man seeks court protection from ex-lover following humiliation",
            "url": "https://www.herald.co.zw/man-seeks-court-protection-from-ex-lover-following-humiliation/",
            "content": "Anotida Chonzi\n\nCourt Correspondent\n\nA Harare man has taken his ex-girlfriend to court alleging that she stripped him naked and humiliated him in public after a confrontation.\n\nMr Tonderai Marembo appeared before magistrate Ms Meenal Narotam on Wednesday seeking a protection order against Ms Sphelile Gwaze, whom she accused of persistent harassment and public abuse since their break up.\n\nShe insults me using vulgar language, shows up uninvited at my house and workplace, and even follows me to the beerhall, Mr Marembo said.\n\nShe tells my wife I owe her money, which has caused problems at home.\n\nMr Marembo said Ms Gwaze followed her to the beerhall and assaulted him.\n\nShe followed me demanding money and when I told her I did not have it, she tore my shirt, pushed me to the ground and removed my trousers, he said.\n\nShe ran away with my trousers and left me naked. I was so embarrassed, I stopped going to that place.\n\nHe said he now fears further humiliation in public as Ms Gwaze continues to insult him and being violent.\n\nMs Gwaze denied the allegations and told the court that she only visited the beerhall once to recover the money that Mr Marembo owed her.\n\nI went there because I heard he was buying drinks for his friends while refusing to pay me back, she said.\n\nI didnt strip him. He was drunk and removed his own clothes. I just tore his shirt while trying to stop him from running away.\n\nMs Gwaze admitted to taking Mr Marembos clothes after the altercation.\n\nHe lied to me. I did not know he had a wife, yet he had been staying with me for two weeks. I just want my money back.\n\nMs Narotam granted Mr Marembo the protection order he applied for and instructed Ms Gwaze to refrain from harassing him or tearing his clothes.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/court-hammer.jpg",
            "description": "Anotida Chonzi Court Correspondent A Harare man has taken his ex-girlfriend to court alleging that she stripped him naked and humiliated him in public after a confrontation. Mr Tonderai Marembo appeared before magistrate Ms Meenal Narotam on Wednesday seeking a protection order against Ms Sphelile Gwaze, whom she accused of persistent harassment and public abuse […]",
            "time": "21:46",
            "date": "17 Apr 2025"
        },
        {
            "title": "Woman takes daughter-in-law to court for assault",
            "url": "https://www.herald.co.zw/woman-takes-daughter-in-law-to-court-for-assault/",
            "content": "Anesu January\n\nHerald Correspondent\n\nA Harare woman has been granted a peace order against her daughter-in-law who allegedly assaulted her after she tried to stop her from beating up a neighbour.\n\nMrs Kumbirai Mnangagwa told Harare Civil Court Magistrate Ms Meenal Narotam that her daughter-in-law, Tsitsi Svisvira is in the habit of beating and insulting her.\n\nOn April 14, 2025, she brought a male neighbour to the house and started accusing him of gossiping about her being involved with a married man, she said.\n\nShe started choking the neighbour, that is when I tried to stop her and she pushed me to the ground.\n\nSvisvira denied the allegations and told the court that Mrs Mnangagwa was lying.\n\nShe is lying I never did any of what she is saying, she said.\n\nShe is the one who assaulted me and told me that even if I report the case, nothing will happen to her because of her surname, she said.\n\nMs Narotam granted the peace order in Mrs Mnangagwa`s favour and barred Svisvira from insulting or assaulting her.\n\nShe also told Svisvira to apply for an order against her mother-in-law if she wronged her.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Harare-Civil-Court.jpg",
            "description": "Anesu January Herald Correspondent A Harare woman has been granted a peace order against her daughter-in-law who allegedly assaulted her after she tried to stop her from beating up a neighbour. Mrs Kumbirai Mnangagwa told Harare Civil Court Magistrate Ms Meenal Narotam that her daughter-in-law, Tsitsi Svisvira is in the habit of beating and insulting […]",
            "time": "21:46",
            "date": "17 Apr 2025"
        }
    ]
}