{
    "news": [
        {
            "title": "Deteriorating situation in DRC under spotlight",
            "url": "https://www.herald.co.zw/deteriorating-situation-in-drc-under-spotlight/",
            "content": "Wallace Ruzvidzo, Herald Reporter\n\nSADC Chairperson, President Mnangagwa, will tomorrow preside over a crucial Extraordinary regional summit of Heads of State and Government, where leaders will convene virtually to discuss the deteriorating security situation in eastern Democratic Republic of Congo (DRC).\n\nThe emergency meeting comes on the heels of recent attacks by the M23 rebel armed group on Congolese security forces, SADC troops and civilians.\n\nThe summit is being convened following the virtual Extraordinary SADC Organ Troika Summit held last week.\n\nIn a communiqu released yesterday, the SADC Secretariat said tomorrows Extraordinary Summit will extensively deliberate on recommendations from the virtual Troika meeting.\n\nThe SADC Summit is responsible for setting the overall policy direction and controlling the functions of the regional bloc, making it the primary policy-making institution of the region.\n\nThe Southern African Development Community (SADC) will hold an Extraordinary Summit of Heads of State and Government on 13th March 2025 in a virtual format to discuss the security situation in the Democratic Republic of Congo (DRC).\n\nHis Excellency Dr Emmerson Dambudzo Mnangagwa, President of the Republic of Zimbabwe and Chairperson of SADC, will chair the Summit.\n\nThe Summit will receive updates on the latest security situation in the DRC and deliberate on the recommendation from the Extraordinary SADC Organ Troika Summit which was held on 6th March 2025, said the Secretariat.\n\nPresident Mnangagwa has reaffirmed the regional bodys commitment to the realisation of lasting peace in the eastern DRC.\n\nThe people of the eastern DRC have suffered for far too long. SADC condemns in the strongest terms the attacks by aggressor forces. While we pause to mourn our loss, our resolve to ensure collective security cannot be shaken, he said.\n\nTo this end, our region stands ready to intensify efforts to protect SADC citizens from all forms of instability, in line with the SADC Mutual Defence Pact.\n\nThe peace and security of our region is a shared obligation, said the President during the last SADC Extraordinary Summit held in Harare on January 31.\n\nDespite efforts by SADC and the East African Community (EAC), fighting between Congolese security forces andthe M23-led rebel group, has intensified in recent weeks.\n\nThe rebels, who had previously entrenched themselves in Goma in North Kivu, have now expanded their presence to the South Kivu capital Bukavu, establishing new administrative structures in the city.\n\nThe conflict has fuelled one of the worlds most severe humanitarian crises, with over 1 million Congolese seeking refuge beyond the countrys borders and about 21 million people within the country in urgent need of medical aid, food, and other essential supplies.\n\nSince the start of last year, nearly 358 000 people have been displaced, with 80 percent of this displacement linked to armed conflict. New UN-verified data also reveals a 30 percent rise in grave violations against children in eastern DRC compared to 2023.\n\nMeanwhile, Zimbabwe will today host the SADC Council of Ministers meeting to be presided over by Foreign Affairs and International Trade Minister Professor Amon Murwira as Chair of the Council.\n\nThe SADC Council of Ministers plays a crucial role in overseeing the function and development of SADC.\n\nIt consists of Ministers from each of the 16 SADC member States, typically from ministries related to Foreign Affairs, Economic Planning, Finance, or Trade, and meets biannually in March and August.\n\nIn a statement yesterday, Foreign Affairs and International Trade director public diplomacy, communication and advocacy Mrs Philisiwe Chidawanyika said the Council will review the status of implementation of previous Council and Summit decisions.\n\nThe meeting was preceded by the SADC Standing Committee of Senior Officials, the finance committee meeting and the meeting of senior officials and key experts on the implementation of the Regional Indicative Strategic Development Plan (RISDP) 2020-2030, that were held at the New Parliament Building from 4 to 7 March 2025, she said.\n\nOn the SADC-European Union (EU) Ministerial Partnership Dialogue to be held on Saturday, Mrs Chidawanyika said Prof Murwira will co-chair the meeting with Polands Minister of Foreign Affairs Radoslaw Sikorski.\n\nPoland is holding the rotating Presidency of the Council of the European Union.\n\nThe Ministerial Dialogue will be preceded by the SADC and EU Senior Officials Dialogue on 14 March 2025.\n\nThe SADC-EU Dialogue was launched in 1994 as a platform to reinforce the relations between SADC and the EU, and promote cooperation in peace and security, trade, and policies aimed at sustainable economic growth.\n\nThe dialogue will take stock of progress in the implementation of the SADC-EU Cooperation programmes, and the 2021-2027 Multiannual Indica Programme for Sub Saharan Africa (MIP SSA), she said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/President-Mnangagwa-4.jpg",
            "description": "Wallace Ruzvidzo, Herald Reporter SADC Chairperson, President Mnangagwa, will tomorrow preside over a crucial Extraordinary regional summit of Heads of State and Government, where leaders will convene virtually to discuss the deteriorating security situation in eastern Democratic Republic of Congo (DRC). The emergency meeting comes on the heels of recent attacks by the M23 rebel […]",
            "time": "09:09",
            "date": "12 Mar 2025"
        },
        {
            "title": "Presidential Solarisation Programme launch on cards",
            "url": "https://www.herald.co.zw/presidential-solarisation-programme-launch-on-cards/",
            "content": "Zvamaida Murwira, Senior Reporter\n\nPRESIDENT Mnangagwa will soon officially launch the first year of the Presidential Solarisation Programme that seeks to provide solar power to more than 200 000 households countrywide, Information, Publicity and Broadcasting Services Minister, Dr Jenfan Muswere, has said.\n\nThe programme has so far transformed livelihoods, particularly in rural areas, as the Second Republic moves to bridge the urban-rural divide.\n\nAddressing a post-Cabinet media briefing in Harare yesterday, Dr Muswere said Cabinet considered and approved the implementation of the Presidential Solarisation Programme Report, as presented by the Minister of State for National Security Lovemore Matuke.\n\nFollowing the approval of the Implementation Plan for the Presidential Solarisation Programme in December 2024, significant milestones have been made towards the provision of solar power to 200 000 households, he said.\n\nGuidelines for the implementation of the programme have been established with stakeholder mapping and identification of beneficiaries in villages across the eight rural provinces already completed.\n\nDr Muswere said community mobilisation and awareness processes spearheaded by the Ministers of State for Provincial Affairs and Devolution have also been completed.\n\nHe said graduates of the Youth Service in Zimbabwe, with assistance from experts from the Harare Institute of Technology and the Rural Electrification Agency, will install 200 000 solar kits to the identified households.\n\nHis Excellency President Cde Dr E.D. Mnangagwa will launch the Presidential Solarisation Programme to mark the official commencement of the first year of the Programme, said Dr Muswere.\n\nThrough the National Renewable Energy Policy, Zimbabwe aims to achieve 1 100MW of renewable energy capacity.\n\nThe Presidential Solarisation Project has been one such key intervention which is expected to boost domestic productivity and create employment opportunities in rural communities in line with Vision 2030 of an empowered upper-middle-income society.\n\nThe project targets approximately 200 000 beneficiaries a year and will run for five years, starting this year.\n\nThe Rural Infrastructural Development Agency (RIDA) will oversee the implementation of the project through an Inter-Ministerial Steering Committee architecture incorporating experts from local universities.\n\nIt will provide affordable but advanced solar batteries, inverters, solar panels and cables to power gadgets such as light bulbs, radios, televisions, phone chargers, laptops, small refrigerators, submersible pumps and WiFi.\n\nThe programme will see local youths and women being trained to participate in the installation programmes implemented in the districts and villages.\n\nMeanwhile, Cabinet has also approved the Memorandum of Understanding between Zimbabwe and Algeria on Co-operation in the Field of Tourism, which was presented by Justice, Legal and Parliamentary Affairs Minister Ziyambi Ziyambi as Chairman of the Cabinet Committee on Legislation.\n\nDr Muswere said the major objectives of the MoU are to strengthen the friendly relations and mutual understanding between Zimbabwe and Algeria in the field of tourism; to provide a broad framework that will guide working relations for the development and promotion of tourism for both countries; to enhance co-operation in the exchange of expertise, research, and best practices in tourism development, and to promote joint tourism initiatives and investments between the two countries.\n\nCabinet also received and approved the Learning Visit to China Report that was presented by Environment, Climate and Wildlife Minister Dr Sithembiso Nyoni.\n\nMinister Nyoni led a delegation to China last month whose objective was to strengthen bilateral relations between Zimbabwe and China on environmental policy in general, and to specifically share mutual experiences on the hosting of high-level events like the Conference of Parties to the Convention on Wetlands to be held from July 23 to 31, 2025 in Victoria Falls.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Muswere-1.jpg",
            "description": "Zvamaida Murwira, Senior Reporter PRESIDENT Mnangagwa will soon officially launch the first year of the Presidential Solarisation Programme that seeks to provide solar power to more than 200 000 households countrywide, Information, Publicity and Broadcasting Services Minister, Dr Jenfan Muswere, has said. The programme has so far transformed livelihoods, particularly in rural areas, as the […]",
            "time": "09:09",
            "date": "12 Mar 2025"
        },
        {
            "title": "Zinara earmarks  ZiG11,6bn for road rehab",
            "url": "https://www.herald.co.zw/zinara-earmarks-zig116bn-for-road-rehab/",
            "content": "Freeman Razemba, Senior Reporter\n\nTHE Zimbabwe National Road Administration (ZINARA) has earmarked ZiG11,6 billion for the Emergency Road Rehabilitation Programme 2 (ERRP2) this year.\n\nThis marks a significant increase from ZiG4,6 billion disbursed under the same programme last year.\n\nThe allocation was detailed in ZINARAs disbursement report of December 31, 2024.\n\nIn the report, the road administration authority said it had earmarked ZiG11,6bn for road rehabilitation and was making provisions for a further 2 million litres of fuel.\n\nZINARA has set aside a proposed budget of ZiG11.6 billion for financial disbursements for the year and will continue with the momentum to capacitate road authorities to draw down their annual budgets effectively. ZINARA has also made provisions for a further 2 million litres of fuel to add to the financial disbursements.\n\nFurther to these disbursements, ZINARA will continue to provide technical support through periodic refresher training as well project support by the ZINARA Provincial Engineers. With the receipt of the 2025 road maintenance plans and programmes of work from all 94 Road Authorities, preparations are already underway for the first-quarter disbursements to support these projects.\n\nThe ZINARA report highlights the initial and revised budget allocations for the year and the amounts accessed by the road authorities from the first to the last quarter of the year.\n\nIt also details the fuel allocated and accessed during that period, reflecting a marked improvement in the uptake of allocated disbursements.\n\nTotal disbursements for the year closed at ZiG4,6billion. This was driven by enhanced collections through improved revenue assurance mechanisms in place, as well as the increased project scope of special public interest projects undertaken over the year which required more funding.\n\nAccording to ZINARA, a total of 53 out of the 94 Road Authorities utilised over 90 percent of their budgets, with 15 utilising 100 percent of their allocations.\n\nMashonaland East Province topped the leaderboard with 95 percent, followed by Matabeleland South Province with 92 percent and then Harare Metropolitan Province with 90 percent budget utilisation.\n\nThis is a remarkable new standard which speaks to improved project Implementation and acquittal systems by the Road Authorities. It is also attributed to the enhanced support being rendered to Road Authorities through the ZINARA Provincial Engineers, as well as the periodic training programmes facilitated by ZINARA.\n\nWith regards to fuel disbursements, ZINARA piloted fuel disbursements in the year under review. This is in addition to the financial disbursement budgets already allocated. Over 1.9 million litres of fuel was disbursed to all Road Authorities. During the year under review, 20 of the Road Authorities successfully drew down their full allocations. The budgeted fuel for the year was 2 million litres, ZINARA said.\n\nIt further said that this initiative was well received by Road Authorities as it directly resolved a critical operational challenge they had been facing in terms of procuring fuel for their road maintenance activities.\n\nWith the fuel on hand, the Road Authorities were better equipped to use their equipment for some of the road works and this went a long way to improve the scope of the maintenance works they were able to undertake.\n\nZINARA said road funds are allocated to road authorities by the disbursement formula prescribed in the Road Act.\n\nThe road authorities are appraised of their respective budget allocations and based on these figures; they submit proposals for their projects in their respective jurisdictions.\n\nThese are subsequently reviewed by ZINARA and due approval processes are undertaken.\n\nAt the funds disbursement stage, money is dispatched at two levels, the first is for routine maintenance which is an advance disbursement done quarterly. This is accessed after the authorities have fulfilled several processes, chief among them being acquitting for funds previously issued to them.\n\nThe second level is for periodic maintenance. This is issued upon submission of Interim Payment Certificates (IPCs) following project implementation. It is for specific major maintenance projects which are not expected to be recurring.\n\nIn addition to disbursing these funds, ZINARA also provides technical monitoring and evaluation support to road authorities through the ZINARA Provincial Road Engineers.\n\nThis support serves to enable road authorities to effectively complete their projects and submit the requisite acquittals timeously ahead of the next disbursement. This same process applies to fuel disbursements.\n\nFuel is issued quarterly and upon submission of acquittals of the previously accessed fuel allocations.\n\nAccording to ZINARA, the year 2024 saw a giant leap towards the achievement of Vision 2030 in terms of road rehabilitation and maintenance.\n\nOverall, Road Authorities achieved 122 percent of their planned works, surpassing the initial national target of 30 000km and reaching a soaring 37 000km mark. This is against the prior years achievement of 23 000km of road maintained.\n\nSome of the key projects undertaken in the year 2024 include part of the Bulawayo-Nkayi Road rehabilitation project, Nyanga-Ruwangwe resurfacing project, Shurugwi-Mhandamabwe 42km road rehabilitation, Golden Valley-Sanyati Road project and the greater Harare Roads projects among others.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/03/ZINARA.jpg",
            "description": "Freeman Razemba, Senior Reporter THE Zimbabwe National Road Administration (ZINARA) has earmarked ZiG11,6 billion for the Emergency Road Rehabilitation Programme 2 (ERRP2) this year. This marks a significant increase from ZiG4,6 billion disbursed under the same programme last year. The allocation was detailed in ZINARA’s disbursement report of December 31, 2024. In the report, the […]",
            "time": "09:09",
            "date": "12 Mar 2025"
        },
        {
            "title": "Access to farming inputs: Govt tightens screws",
            "url": "https://www.herald.co.zw/access-to-farming-inputs-govt-tightens-screws/",
            "content": "Precious Manomano, Herald Reporter\n\nTO enhance food security and ensure equitable access to agricultural resources, Government has introduced new securitised cards as part of its strategy to prevent the abuse of agricultural inputs under the Presidential Inputs Programme and the ARDA Joint Venture.\n\nThis innovative initiative is designed to ensure that deserving farmers can access essential inputs without the risk of exploitation, ultimately fostering a more sustainable agricultural environment in the country.\n\nLands, Agriculture, Fisheries, Water and Rural Development permanent secretary, Professor Obert Jiri, said only those farmers possessing input cards will be eligible to participate in the Pfumvudza programme, which has been a game-changer in the countrys rural provinces.\n\nFurthermore, ARDA will now only contract farmers who have title deeds or assist those seeking to obtain them.\n\nThis change marks a major departure from previous practices, where some farmers borrowed funds from various banks but later turned to ARDA for inputs, believing they could evade repayment due to its status as a Government parastatal.\n\nProfessor Jiri explained the rationale behind these changes.\n\nThere have been some variations now in the way we are going to implement the input programmes. On the ARDA programme, we have had cases where farmers borrow funds from different banks and they revert to ARDA saying ARDA is the Governments parastatal so we will not pay.\n\nThat input support programme from ARDA will now contract a farmer or enter into a joint venture programme with a farmer with title deeds or a farmer whom they help get title deeds. So those deeds now will be deposited in the bank. If the farmer fails to pay, the deeds will be deposited there so that we will ensure that farmers pay the bank and we will have a better recovery rate, he said.\n\nWith the introduction of the input card, farmers will be required to access agricultural supplies from agro-dealers or GMB using this card, which will be linked to a bank account, effectively functioning as a debit card.\n\nProf Jiri said this system will include a tracking mechanism that verifies the identity of registered farmers, reducing instances of input abuse.\n\nThat will reduce incidents of input abuse because now only a farmer with a card can access inputs. All the farmers who are beneficiaries of Pfumvudza should have a card.\n\nThe card becomes their identity because we were seeing the abuse of inputs. With a card, we can now track farmers; it will reflect all transactions, Professor Jiri said.\n\nThe implementation of this new initiative is set to commence this winter and will extend into the summer season, with the processing of input cards already underway.\n\nARDA is expected to oversee 60 000 hectares during the winter season, with approximately 35 000 hectares allocated to joint ventures, while the Presidential Inputs Programme will cover 5 000 hectares.\n\nProf Jiri said farmers involved in irrigation schemes supported under the Presidential Inputs Programme need to have new cards to access inputs.\n\nIn addition to improving access to inputs, this new system aims to curb theft, as farmers will be responsible for taking their inputs using their cards.\n\nReactions from the farming community have been largely positive.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/04/Professor-Obert-Jiri.jpg",
            "description": "Precious Manomano, Herald Reporter TO enhance food security and ensure equitable access to agricultural resources, Government has introduced new securitised cards as part of its strategy to prevent the abuse of agricultural inputs under the Presidential Inputs Programme and the ARDA Joint Venture. This innovative initiative is designed to ensure that deserving farmers can access […]",
            "time": "09:09",
            "date": "12 Mar 2025"
        },
        {
            "title": "ZNA emphatically says no to drugs",
            "url": "https://www.herald.co.zw/zna-emphatically-says-no-to-drugs/",
            "content": "George Maponga, Masvingo Bureau\n\nTHE Zimbabwe National Army will not countenance drug and substance abuse within its rank and file with army commander Lieutenant General Anselem Sanyatwe warning that such rotten elements would be automatically dismissed from military service.\n\nLt Gen Sanyatwe warned that there was absolutely no room for drug and substance abuse within the military and urged line commanders to take strong action against the vice.\n\nHe was speaking yesterday at Vitalis Musungwa Gava Barracks, the headquarters of 4 Infantry Brigade in Masvingo, during the handover-takeover parade between incoming Commander, Brigadier General Oscar Tshuma and his predecessor Brigadier General Cephas Gurira, who is now the new commander of 1 Infantry Brigade which is responsible for Bulawayo metropolitan and Matabeleland North and South provinces.\n\nLt Gen Sanyatwe was the chief witnessing officer at the colourful ceremony.\n\nThe ZNA Commander underscored the need for zero tolerance to drug and substance abuse in the military rank and file.\n\nDrug and substance abuse among the rank and file affects the operational readiness and well-being of our troops and I want to make it clear that we have zero tolerance to drug and substance abuse in the army. I call upon commanders to dismiss and I repeat dismiss offenders because there is no room for drug and substance abuse and I repeat no room for that vice in the army,said Lt Gen Sanyatwe.\n\nHe challenged the ZNA to broaden its scope in understanding the battlefield that he said has shifted from the traditional battlefield to new frontiers in spheres such as cyber security.\n\nThe ZNA Commander said under his tenure he would continue to tirelessly work to make sure the army remains an efficient, well-equipped fighting force.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/ZNA.jpg",
            "description": "George Maponga, Masvingo Bureau THE Zimbabwe National Army will not countenance drug and substance abuse within its rank and file with army commander Lieutenant General Anselem Sanyatwe warning that such rotten elements would be automatically dismissed from military service. Lt Gen Sanyatwe warned that there was absolutely no room for drug and substance abuse within […]",
            "time": "09:09",
            "date": "12 Mar 2025"
        },
        {
            "title": "First Lady starts progress visits to widows projects",
            "url": "https://www.herald.co.zw/first-lady-starts-progress-visits-to-widows-projects/",
            "content": "Tendai Rupapa, Senior Reporter\n\nEMPOWERMENT proponent First Lady Dr Auxillia Mnangagwa, who initiated business ventures for widows countrywide under her Widows Association, giving the widows dignity and a chance to be self-reliant, yesterday visited Mashonaland West Province for a follow-up on the projects.\n\nThe highly subscribed progress visit and legal clinic comprised tents manned by representatives from the Master of High Court dealing with deceased estates and another for the 575 GBV Call centre, which Dr Mnangagwa encouraged people to visit and get help.\n\nLegal clinic is a programme often associated with legal aid organisations, that provides free legal services.\n\nIn this case, the Office of the First Lady is working with the Master of High Court and the Police Victim Friendly Unit to allow people, mainly widows and widowers, to be conversant with inheritance laws.\n\nThe First Lady, after realising how widows, widowers, and orphans were losing property upon the death of their spouses and parents, has been initiating legal clinics to educate them on their rights by bringing experts on inheritance issues who equip them with knowledge on legal matters.\n\nIn support of Gogo Chipo Chabayanzaras business, Dr Mnangagwa bought some of her produce, including a sack of nutritious munyevhe, which Amai Mnangagwa said would be used during her countrywide school feeding programme.\n\nGogo Chabayanzara was widowed 35 years ago.\n\nLast year, as patron of the First Ladys Widows Association, Amai Mnangagwa, through her Angel of Hope Foundation and its partners, availed an assortment of goods to widows to kick-start small-scale retailing businesses in their districts aimed at economically empowering the vulnerable group.\n\nPart of the crowd that interacted with First Lady Dr Auxillia Mnangagwa during a progress visit and legal clinic which was organised for widows by First Lady Dr Auxillia Mnangagwa in Mashonaland West yesterday\n\nIn addition, she gave them farming inputs, goats, chickens and chicken feed to kick-start livestock production and horticulture farming.\n\nMashonaland West was the first province to benefit.\n\nAmai Mnangagwa returned to the province yesterday in Hurungwe district where widows from all the seven districts gathered with their success stories.\n\nTheir projects are doing well and they are eager to continue working hard.\n\nThey are grateful to the First Lady for nurturing them and wiping their tears away.\n\nThe First Lady too, could not hide her excitement.\n\nI am glad to have come here to witness what you have been doing. You were the first province to benefit from the First Ladys Widows Association and I have come to monitor progress. I am gratified by the work you are undertaking together. You are continuing with the projects that I initiated for you, she said.\n\nAs a mother, you are the familys keeper and everything rests on your shoulders before it reaches your spouses. If the husband dies, like in your case, everything becomes your responsibility and you therefore need to keep on working hard while looking after the children.\n\nOne of the groups from Chirundu told the First Lady that on top of their projects, they intend to build a Bed and Breakfast hotel.\n\nHowever, the mother of the nation gave them advice.\n\nThose from Chirundu, I heard you saying you want a Bed and Breakfast hotel, but I urge you to start with shops because the hotel may be costly given that you are just starting. Shops bring quick returns, she said.\n\nA representative from the Master of High Court educated widows about inheritance issues during a legal clinic and progress visit organised for widows by First Lady Dr Auxillia Mnangagwa in Mashonaland West yesterday\n\nAssistant Master from the Office of the Master of High Court, Ms Senzeni Madzivadondo, highlighted the challenges encountered by widows and orphans and emphasised the need for people to register their marriages.\n\nShe thanked Amai Mnangagwa for the inheritance education being given to women.\n\nI have come to share with you issues that widows and orphans are facing regularly. The Office of the Master of the High Court looks at issues of inheritance. When a person dies, they leave behind a lot of things like houses, cars, insurance policies, cattle, and household effects. These assets must be protected legally until they are legally distributed.\n\nAs the Office of the Master of the High Court, we encourage you to run to the office of the Master of High Court to register the estate when someone dies. When women lose their husbands, the cases that they encounter include the widows coming to register late, saying the husband died in such and such a year, and I was dispossessed of the house by the elder brother, saying I did not bear children with the deceased, so I had to leave.\n\nThese are the scenarios that we encounter. In some of the cases, a widow comes saying she refused to be inherited by the deceaseds sibling and ended up being chased away. We want to let you know that inheritance isnt all about sexual intercourse. If you encounter such challenges, run to the Masters Office within 14 days of your husbands demise. All you will be doing is to preserve the property that was left behind by your spouse and protecting your childrens inheritance, she said.\n\nMs Madzivadondo also gave a list of persons who can register an estate.\n\nThose who can register the estate, we say if there is a wife who has been left behind by her husband, she can register, the deceaseds child can also register. Relatives of the deceased can also register the death.\n\nWe make you register so that we assist you to have the goods distributed legally. Most women stay with men without registering their marriages. Let us ensure that all marriages are registered so that in future, we have no challenges. When someone dies, we often hear aunties and brothers-in-law saying that so and so was not the wife of the deceased because they will be looking at assets and then go about taking someone who was divorced a long time ago.\n\nThis is the person they put ahead so that they too can get something out of it. We are saying come and register so that we help you to safeguard the deceaseds assets so that they are distributed legally. We are saying even the orphaned children can register because some parents both die at the same time, or die one after one another, without the issues being straightened out. You are not late. Even if your parents died in 1996, our offices will tell you what to do. All you need is a copy of the death certificate, if you dont have one, at our offices we will give you forms to fill in free of charge, and we ensure things are fixed. We will open a file and we will hold an edict meeting where we appoint an executor who we will ensure things are distributed properly. We need someone who can write and we will assist that person.\n\nThere is a new law on civil partnership. Civil partnership has nothing to do with inheritance. It has its own place. Wills are another thorny issue. We need to write them well and register them with the Master of the High Court.\n\nWe discourage people from distributing assets following things written by the deceased in a book without involving the Masters Office because that is when the elder brother will take something by force and leave children in the lurch.\n\nNowadays, there is a programme being implemented under the Land Reform Programme where some people were allocated land without registering and without title deeds. We are encouraging you that some lost their loved ones; those must come forward and register their estates. We therefore give you a letter of administration which you will then use to register the land in your name.\n\nLet us not leave our inheritance going to waste when the Master is there to help you. We thank you, Amai, for the education you give women. Let us register our marriages, she said.\n\nZimbabwe Republic Police Victim Friendly Unit officer educated women about gender based violence trends and statistics in Mashonaland West during an interactive session between First Lady Dr Auxillia Mnangagwa and widows in the province yesterday\n\nThe police Victim Friendly Unit gave shocking statistics of the rape of children on their way from school in Hurungwe as well as the sexual assault of elderly women while sleeping.\n\nOur section is responsible for investigating cases of abuse of women and girls. It was seen that it was not possible for a woman or girl to get into a police station after being raped or being abused, it was not possible to report at the charge office per chance, neighbours will be present and end up spreading the issue to other people.\n\nTherefore, this section is there to provide dignity to people such that when they get to the police station to report their case, they just say they want to see the Victim-Friendly Unit. Police officers in the Charge Office will automatically know that the issue you want to report needs privacy so you will be shown an office to discuss.\n\nHere in Hurungwe we are seeing that rape cases are on the increase. Our children are being raped on their way from school. As police officers from the Victim Friendly Unit, we are saying it is essential that when we are in our home area or community, we must see to it that when our children are going to and from school, are they in groups? We also need to have duties of escorting our children to school instead of leaving them at the mercy of rapists. In February alone, we received four cases of young girls  two who are six years old and two who are seven years old, who were raped on their way from school. Therefore, we are saying to parents, let us help one another to see to it that our children are protected, the police said.\n\nHouses of elderly women, the police said, must be locked from inside so that rapists do not enter in the dead of the night.\n\nWe are also seeing that elderly women are also being raped by members of their communities. This is mainly happening as these elderly women sleep in their homes. Rapists come anytime, maybe the elderly woman would have just closed the door and not locked it. The rapist just enters the house with ease and commits the crime. Neighbours and close relatives are the common rapists. Such crimes are prevalent at homes. If a woman takes her brother to stay at the home, they are committing rape crimes. As police, we are concerned that if homes are no longer safe, where will we keep the children? Stepfathers are also raping children and sadly the women protect the rapists, the police said.\n\nBeneficiaries of the First Ladys Widows Association showered praises on the mother of the nation for initiating projects that help them crawl out of poverty and raise clean money to sustain their families.\n\nMrs Yvonne Mazvimbakupa, who was widowed three years ago, said her life had changed for the better, thanks to the First Lady.\n\nI am a beneficiary of the First Ladys Widows Association. We were given goats by the First Lady to start a project, and they are now so many that we can now give other groups as a pass-on initiative. She rolled out the project so that every woman does not go about begging. We were also given chickens, which are now many, and we can realise income from selling the chickens and eggs. We are learning to work as women and anyone can do it. Besides livestock, we are also involved in horticulture where we are growing tomatoes, pepper, chillies, pumpkins, and cabbages. We are now delivering these to supermarkets where we have a big market. Our mother taught us to work using our own hands. Through what we are doing, we can send our children to school and no longer have to get into bars to look for fees. Our lives have changed for the better, she said proudly.\n\nSimilar sentiments were echoed by another widow from Hurungwe who said the First Lady had enabled her to set foot on the train of development.\n\nWe have eight groups that are selling kapenta, poultry has four groups doing road runners. We also have one group that rears guinea fowls. We have groups that are producing school uniforms and work suits using sewing machines. For peanut butter making, we have two machines so far, and we have two groups that are into goat farming, farming has three groups, and we have those with an incubator hatchery, we have one group, she said.\n\nAnother beneficiary from Chirundu was over the moon.\n\nTo be where I am today and if you look at me, you will not see that I am a widow because of Amai Mnangagwa. Our mother educated us, she empowered us and imparted us with knowledge and uplifted us. As widows, we were looked down upon in the community, if you walked or associated with a married man, you were branded a prostitute. However, because of our mother, she uplifted us. We were given capital by the First Lady, she gave us goats and groceries for projects. We are rearing chickens and we managed to procure a hatcher for eggs.\n\nWe can now lend each other money to buy plastics for resale through our mother. We are no longer frequenting bars and we can now look after our grandchildren. We thank you verily and wish God grants you more years Amai, she said.\n\nMinister of State for Mashonaland West Provincial Affairs and Devolution, Marian Chombo, thanked the First Lady for her initiatives.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/FL1-2.jpg",
            "description": "Tendai Rupapa, Senior Reporter EMPOWERMENT proponent First Lady Dr Auxillia Mnangagwa, who initiated business ventures for widows countrywide under her Widows Association, giving the widows dignity and a chance to be self-reliant, yesterday visited Mashonaland West Province for a follow-up on the projects. The highly subscribed progress visit and legal clinic comprised tents manned by […]",
            "time": "09:09",
            "date": "12 Mar 2025"
        },
        {
            "title": "EDITORIAL COMMENT: Farm dams need to be properly maintained",
            "url": "https://www.herald.co.zw/editorial-comment-farm-dams-need-to-be-properly-maintained/",
            "content": "THOUSANDS of farm dams across Zimbabwe are generally safe and some have been used in for many decades with little trouble with the first ones more than a century old.\n\nBut as the breach on Bandama Farm in Chipinge this week showed, the dam walls can be cracked. If anyone is in the way when the surge of water flows out of the dam down the bed of the original river or stream, they are in danger of being swept away.\n\nWhen people from urban areas think of dams, they envision a few dozen large reservoirs that anchor irrigation schemes and supply towns and cities with water. But the overwhelming majority of the more than 9 800 dams in Zimbabwe are small farm dams, many of them on old large commercial farms. Some are on the borders between two commercial farms, plus a small percentage in the communal lands often on or near old mission stations.\n\nThe principles of dam construction, or at least of these farm dams, are fairly obvious. A wall of earth and stone anchored on each end blocks the course of a stream or small river or even the run off path when rains are heavy. The anchor points need to be the sides of a valley, or hills or rocky outcrops higher than the projected height of the dam.\n\nCritically, there must be a spillway or firm outlet lower than the dam-wall height which is able to cope with far greater flows than are thought likely, to make sure that all surplus water gets out quickly and the wall is never topped. The channel for the outflow needs to be checked, and sometimes redug, to make sure the outflow does not run against the wall and erode it.\n\nThe spillway, or the outlet if the dam owner is lucky enough to be able to divert water around one of the rocky outcrops used to anchor the wall, is normally the one place where erosion is possible under normal circumstances and so this is where rock and concrete tend to be needed.\n\nThe rest of the wall just needs to be solid, with no slumping or undercutting or cracks allowing small channels to form that can be eroded into large channels.\n\nBesides the approved design, there needs to be regular maintenance of these dams.\n\nSpillways and overflows have to be kept unclogged, as does the drainage downstream of the dam wall as the overflow rejoins the old water course, and this needs to be done well before it is needed.\n\nAt least three small dams have been breached in recent decades within Harare City Council, including the first one ever built in the south of Borrowdale in the 19th Century, largely because the maintenance was dubious.\n\nOld farm dams within city limits usually anchor a wetland and public open space.\n\nSome become bird sanctuaries, when the farmers move off and the developers move in.\n\nOthers become features of golf courses and other small dams are built to create these golfing hazards.\n\nThe Chipinge dam breach brings up a pair of lessons.\n\nFor a start, it would seem sensible that every one of these small dams was inspected every now and again.\n\nThe numbers are large, but it should be possible for a small group of qualified engineers to get round them all in two or three years.\n\nThis is when bad maintenance can be picked up, the results of bad design half a century ago can be seen, and where the wrong sort of maintenance can be changed.\n\nOften a farmer or community might be very willing to be responsible but simply need to be told exactly what to do.\n\nThe other lesson from Chipinge is that one person very familiar with the dam, the security guard, noticed something odd in the way of a lot of dirty water was flowing from the dam shortly before the breach.\n\nThis was new to him and in retrospect was probably some sort of erosion through the wall or under the wall.\n\nThe guard could not see what was wrong, and in any case was not a technical expert, but he did notice the oddity and did try to raise an alarm. No one listened.\n\nIn many tragic circumstances, there are warning signs, something different from what usually happens, and there is no harm done if people worry and take precautions. If it was not anything important, well nothing is lost, but if there is some sort of problem or disaster, people are safe.\n\nThese small dams have been a critical component of farming where they were built, usually ensuring that there is some water for irrigation and livestock.\n\nThat is why they were built by the large landowners and missionaries.\n\nWe probably need a lot more, especially in communal lands and in some of the resettlement areas taken over from landowners who knew little and cared less.\n\nWith the smaller farms we generally see these days, that will often mean several farmers share such a dam, even if it is small, and so between them they will be responsible as a community for maintenance and allocating water, not difficult but a set of instructions for the one and rules for the other would seem useful.\n\nAll development creates danger, from good roads making accidents more likely as traffic increases and travels faster, to badly built or sited houses that can fall down, to dams that may collapse or be breached. We have learned that we do not stop the development simply because there are dangers, but make sure that everyone knows what they are doing and our technical experts check up and make sure we all know how to work within sensible safety rules.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/dam-breach.jpg",
            "description": "THOUSANDS of farm dams across Zimbabwe are generally safe and some have been used in  for many decades with little trouble with the first ones more than a century old. But as the breach on Bandama Farm in Chipinge this week showed, the dam walls can be cracked. If anyone is in the way when […]",
            "time": "09:09",
            "date": "12 Mar 2025"
        },
        {
            "title": "Cabinet approves NDS2 priority projects",
            "url": "https://www.herald.co.zw/cabinet-approves-nds2-priority-projects/",
            "content": "Mukudzei Chingwere, Herald Reporter\n\nCABINET has approved national priorities for the second five-year economic blueprint under the Second Republic, the National Development Strategy 2 (NDS2), Information, Publicity and Broadcasting Services Minister, Dr Jenfan Muswere, said yesterday.\n\nThe NDS2, which runs from 2026 to 2030, will succeed the ongoing NDS1, which ends this December, with the new strategy aiming to guide the country through its next five years of development, emphasising 10 key priorities.\n\nPriorities that will shape NDS2 are; macro-economic stability and financial sector deepening; inclusive economic growth and structural transformation; infrastructural development and housing; food security, climate resilience and environmental protection; technology, innovation and human capital development; job creation, youth development, creative industry and culture; social development and social protection; regional development and inclusivity through devolution and decentralisation; image building, international diplomacy and trade; and good governance, institution building, and security.\n\nCabinet considered and approved the National Priorities for the National Development Strategy 2: January 2026 to December 2030 (NDS2). The National Development Strategy 1: 2021-2025 (NDS1) will come to an end in December 2025, said Dr Muswere after yesterdays Cabinet meeting.\n\nGovernment has now adopted 10 national priorities that will guide and underpin the formulation and implementation of the NDS 2.\n\nThe streamlined national priorities are geared to optimise resource allocation and strengthen sectoral coordination for effective and impactful delivery of services to the citizenry.\n\nA broad-based consultative process will buttress thematic working group re-alignment across the different socio-economic sectors, leading to the actual drafting and launch of the NDS2 by October 2025.\n\nDr Muswere emphasised that the collaborative effort is vital for the effective implementation of the strategy, which is expected to be drafted and launched by October 2025.\n\nGovernment aims to optimise resource allocation and enhance coordination across sectors by aligning these priorities with a broad-based consultative process.\n\nThis approach will involve thematic working groups that will engage various stakeholders in the formulation of the NDS 2.\n\nFinance, Economic Development and Investment Promotion Minister, Professor Mthuli Ncube, said it will be important for the Government to engage citizens more in the implementation of the NDS2.\n\nThe very important lesson we have learnt from NDS 1, which we will carry over to NDS 2 is that we need a Whole-of-Government approach in tackling some of these pillars and strategies within NDS 2.\n\nThe Whole-of-Government approach which we were doing in NDS 1, this will continue and we need to be better at it. To make sure we work together in achieving the goal of an upper-middle income society.\n\nThe other lesson is that it is important to make sure we evaluate results; we have been doing performance evaluation of NDS1 and we are going to do a full review of the NDS 1 during the months of April to June, said Prof Ncube.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Dr-Jenfan-Muswere.jpg",
            "description": "Mukudzei Chingwere, Herald Reporter CABINET has approved national priorities for the second five-year economic blueprint under the Second Republic, the National Development Strategy 2 (NDS2), Information, Publicity and Broadcasting Services Minister, Dr Jenfan Muswere, said yesterday. The NDS2, which runs from 2026 to 2030, will succeed the ongoing NDS1, which ends this December, with the […]",
            "time": "09:09",
            "date": "12 Mar 2025"
        },
        {
            "title": "NSS RENOVATIONS GATHER MOMENTUM",
            "url": "https://www.herald.co.zw/nss-renovations-gather-momentum/",
            "content": "Langton Nyakwenda, Zimpapers Sports Hub\n\nREFURBISHMENT of the National Sports Stadium is now expected to gather pace after the government overcame some bottlenecks that were stalling the project.\n\nThe 38-year-old giant facility, which last hosted international matches in 2021, is undergoing renovations, thanks to a partnership between the Government and energy giants Sakunda Holdings.\n\nAlthough the actual deadline for the renovations is not yet fixed, expectations are that the stadium should start hosting international matches before end of the year.\n\nThe scope of work includes the installation of bucket seats, an electronic turnstile system, and the repair of the water reticulation system.\n\nWork on the pitch and ablution facilities is also ongoing.\n\nThe Minister of Sport, Recreation, Arts, and Culture, Kirsty Coventry, toured the facility yesterday to get a hands-on update on the renovations that are being done.\n\nShe was accompanied by her deputy, Emily Jesaya, and Permanent Secretary in the Sport Ministry, Nicholas Moyo.\n\nSo far, five bays and the VVIP tribune now have bucket seats.\n\nWork on the pitch has started, while gate already has the new electronic turnstile system installed.\n\nThe biggest challenge we faced has just been the financial constraints in terms of the release of the budget and getting that (funds) on time.\n\nBut the Treasury and Finance have been doing a very good job.\n\nWe are also very grateful to the partners that have come and brought in the bucket seats, said Coventry.\n\nThe government has allocated 884 million ZiG towards the refurbishment of the National Sports Stadium, but according to the Minister, there is more work than anticipated that needs to be done before the facility is re-opened.\n\nThe Ministry, through the Sports and Recreation Commission, has been working hand in glove with ZIFA, the Confederation of African Football and the world football governing body FIFA.\n\nNot everything goes to plan, especially when you have a very old stadium.\n\nYou start resurrecting different things, and then you find that the job is actually bigger than what you initially thought.\n\nBut in a way thats also really positive because we now know exactly what we are working with and what we really need to fix.\n\nIt is a little bit more than what we originally thought. So, that again has slowed the process a little bit because now we are trying to figure out what are the most important things that need to be done with the budgets that we have and that which we have been allocated, added Coventry.\n\nHowever, the Minister is generally impressed with the progress made so far.\n\nYou can see the beautiful seats (on some of the bays). All the bucket seats are now here.\n\nTheres some good work being done with the pitch. Good to know that the bottom part of the pitch is still good.\n\nSo, its just the top half that we need to renovate and resurrect.\n\nSo, thats some really good news.\n\nAfter getting a brief from engineers from the Ministry of Local Government and Public Works, Coventry is now aware of the mammoth task of getting the water reticulation back up to speed.\n\nWater reticulation, I think there was a lot more damage than we expected.\n\nSo, all the pipes have now been removed, and work is going on there. And then, yeah, they have shown me a few other bits and pieces that we have noticed as we have been doing the different renovations that well now adjust and fix as well.\n\nWork on the new turnstiles is expected to be done in the next few weeks.\n\nCAF and FIFA have been providing guidance through video conferences.\n\nOnce renovations are done, CAF will send inspectors to inspect the facility before it is certified to host international matches.\n\nThe Ministry is expected to call a press conference soon to advise on the time-lines.\n\nWe would have liked to have the process a little bit quicker, but I am glad now that I have seen all the bucket seats are here, and now its just about installing.\n\nI do want to say a big thank you to FIFA and CAF because theyve been very good in giving us guidance along the way.\n\nAnd the partnerships are really working very well. So, I am glad that those relationships are also back to where we would have liked them to have been from the beginning, said Coventry.\n\nDeputy Director of construction and maintenance in the Ministry of Local Government, Nicholas Mutengu, summarised the works being done at the National Sports.\n\nThe scope includes the installation of the bucket seats; as you have seen, work is in progress at the moment.\n\nAnother key area that we are working on are the turnstiles, which is the entrance gates to the stadium.\n\nAnd then the pitch itself, we are working on it as per the CAF requirement.\n\nWe are working on the water supply to the stadium and the ablution facilities around. We are changing to a flash master system around the stadium.\n\nWe are also changing the lights to LED, which consumes less energy, and also the installation of generators as a backup power system for the facility, said Mutengu.\n\nThe multi-purpose facility, Zimbabwes biggest stadium, National Sports, was constructed by a Chinese company from October 1984 to April 1987.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/NSS.jpg",
            "description": "Langton Nyakwenda, Zimpapers Sports Hub REFURBISHMENT of the National Sports Stadium is now expected to gather pace after the government overcame some bottlenecks that were stalling the project. The 38-year-old giant facility, which last hosted international matches in 2021, is undergoing renovations, thanks to a partnership between the Government and energy giants Sakunda Holdings. Although […]",
            "time": "09:09",
            "date": "12 Mar 2025"
        },
        {
            "title": "Zim@45 theme unpacked",
            "url": "https://www.herald.co.zw/zim45-theme-unpacked/",
            "content": "Gibson Mhaka, Zimpapers Politics Hub\n\nWHILE themes for national events often serve as powerful tools, playing a crucial role in shaping national identity, fostering unity, and driving progress, they also provide a central message that resonates with all citizens, regardless of their background or region, helping to create a shared sense of belonging and reinforcing national unity.\n\nThemes often reflect the Governments priorities and development goals, serving as a guiding principle for policy decisions and public initiatives, ensuring that national efforts are aligned with a common vision.\n\nFor a considerable period, the Government has consistently chosen themes for national events, particularly Independence Day that resonate strongly with its developmental priorities. These themes are carefully selected to align with overarching national strategies, especially those enshrined in the National Development Strategy 1 (NDS1).\n\nThis deliberate approach ensures that national celebrations serve not only as commemorative occasions but also as platforms to reinforce and promote the governments vision for economic growth, social progress, and national unity, effectively channelling the nations focus towards achieving its strategic objectives.\n\nLikewise, this years Independence theme, Zim@45: Devolve and Develop Together towards Vision 2030, directly reflects the Governments established practice of aligning national themes with developmental priorities, particularly those outlined in the NDS1.\n\nThe theme serves as a powerful catalyst, directly inspiring the nations efforts to achieve its ambitious developmental goals.\n\nIt underscores the Second Republics commitment to decentralisation as a key driver for achieving Vision 2030.\n\nBy emphasising devolution, the Government aims to empower local communities and provinces, ensuring that development initiatives are tailored to specific regional needs and resources.\n\nThe call to Develop Together reinforces the importance of collaborative efforts across all sectors, fostering a unified approach to national progress.\n\nThis integrated strategy, where national celebrations reinforce developmental goals, ensures that the spirit of independence directly contributes to the realisation of a prosperous and equitable future for all Zimbabweans, as envisioned in Vision 2030.\n\nBuilding on the established tradition, this years Independence theme, Zim@45: Devolve and Develop Together towards Vision 2030, like its predecessors, is laden with vital messages that emphasise development, unity, and the imperative to achieve Vision 2030.\n\nIt acts as a clear directive, reinforcing the Governments commitment to these key national objectives.\n\nThe theme specifically highlights the importance of devolution, recognising that empowering local communities is essential for sustainable development.\n\nBy encouraging provinces to take ownership of their growth, the theme promotes a bottom-up approach that ensures development initiatives are tailored to specific regional needs.\n\nFurthermore, the emphasis on Develop Together underscores the necessity of collaboration across all sectors of society, fostering a unified effort towards achieving the national vision.\n\nJust as previous themes have served as guiding principles, this years theme acts as a constant reminder of the nations shared aspirations and the importance of working collectively to build a prosperous and equitable future for all Zimbabweans.\n\nIt serves as a call to action, urging citizens to actively participate in the development process and contribute to the realisation of Vision 2030.\n\nAligning national events like Independence Day with themes that emphasise the Second Republics commitment to decentralisation and its connection to Vision 2030 is crucial, especially as Zimbabwes pursuit of upper-middle-income status by 2030 intensifies.\n\nWith less than five years remaining, the nations aspirational goals demand focused and strategic action.\n\nBy weaving these developmental priorities into the fabric of national celebrations, the government reinforces its dedication to both decentralisation and the ambitious targets of Vision 2030, ensuring that every citizen understands and actively participates in the journey towards a prosperous future.\n\nIt is important to note that, just as the Independence Day theme reflects the Second Republics commitment to decentralisation and Vision 2030, the decentralisation of the celebrations signifies more than a change of venue; it embodies a commitment to inclusivity and national development.\n\nThis strategic shift inspires the countrys collective efforts toward achieving Vision 2030, a blueprint for an empowered and prosperous upper middle-income society by 2030.\n\nFurthermore, by decentralising national events to diverse provinces, the Government fosters a sense of shared ownership and promotes grassroots development.\n\nIn his article titled National events an anchor towards Vision 2030, published in the Sunday Mail after the Independence Day celebrations in Murambinda, Buhera, Manicaland Province last year, Dr Tinashe Eric Muzamhindo, Head of the Zimbabwe Institute of Strategic Thinking (ZIST), stated that there is need to leverage national events, such as Independence Day celebrations, as a means to promote the countrys vision and transform these occasions into commercial dividends.\n\nAs Zimbabwe looks towards Vision 2030, it is crucial that the country targets big opportunities to capitalise on national events for economic gain.\n\nThese events serve as a canvas upon which the countrys vision can be painted in vibrant hues, showcasing the best of what Zimbabwe has to offer to the world.\n\nIt is crucial to strategically align these events with key sectors such as tourism, agriculture, manufacturing and technology.\n\nZimbabwe can position itself as a beacon of innovation and growth in the region.\n\nIts an opportunity to dream big, to think outside the box and to set the stage for a future that is bright, prosperous, and full of promise, said Dr Muzamhindo.\n\nIt is clear that Dr Muzamhindos sentiments resonate strongly with last years theme, Unity, Peace and Development Towards Vision 2030, by emphasising the practical application of these principles to achieve economic prosperity.\n\nDr Muzamhindo advocates for transforming national events into commercial dividends, directly aligning with the Development aspect of the theme.\n\nHe sees these events not just as celebrations but as opportunities to showcase Zimbabwes economic potential and attract investment, thereby making development a tangible outcome.\n\nIn essence, Dr Muzamhindos perspective translates the abstract concepts of unity, peace, and development into concrete strategies for economic advancement, demonstrating how these values can be leveraged to achieve the goals of Vision 2030.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Zim@45.jpg",
            "description": "Gibson Mhaka, Zimpapers Politics Hub WHILE themes for national events often serve as powerful tools, playing a crucial role in shaping national identity, fostering unity, and driving progress, they also provide a central message that resonates with all citizens, regardless of their background or region, helping to create a shared sense of belonging and reinforcing […]",
            "time": "09:09",
            "date": "12 Mar 2025"
        }
    ]
}