{
    "news": [
        {
            "title": "New dawn for Sadc",
            "url": "https://www.herald.co.zw/new-dawn-for-sadc/",
            "content": "Kudakwashe Mugari in WINDHOEK, Namibia\n\nNAMIBIAs new President Netumbo Nandi-Ndaitwah was sworn in at State House here yesterday, marking a historic moment for the Southern African country.\n\nShe becomes Namibias first female Head of State.\n\nThe event, which coincided with celebrations to mark Namibias 35th independence celebrations, was attended by President Mnangagwa, who is also the SADC Chairperson, and several Heads of State, including Tanzanian President Samia Suluhu Hassan, who was the Guest of Honour.\n\nPresidents Cyril Ramaphosa of South Africa, Flix Tshisekedi of the Democratic Republic of Congo and Hakainde Hichilema of Zambia were also in attendance.\n\nThe inauguration ceremony began with the arrival of President Nandi-Ndaitwah at State House, where she was greeted by outgoing President Nangolo Mbumba.\n\nPresident Nandi-Ndaitwah (72), who won last Novembers general election with 58 percent of the vote, was then sworn in followed by speeches from various dignitaries, including President Hassan.\n\nIn an interview after the colourful ceremony, President Mnangagwa underscored the importance of support and unity in the region.\n\nWe need to continue supporting each other as the region; this is what it ought to be. It is the only way our region will grow if we share our perspectives as respective countries and move forward. Unity is key among our members.\n\nAs the SADC chairperson, President Mnangagwas attendance highlighted the significance of this historic moment for Namibia and the region.\n\nNamibian President Netumbo Nandi-Ndaitwah takes oath of office at her inauguration in Namibia yesterday.  Picture: Presidential Photographer Joseph Nyadzayo\n\nIn her inaugural address, President Nandi-Ndaitwah of the ruling SWAPO party, emphasised the importance of unity and progress, and outlined her vision for Namibia.\n\nShe acknowledged the significance of her election as Namibias first female President, and pledged to work towards a more inclusive and equitable society.\n\nPresident Nandi-Ndaitwah declared that she will not let corruption mar her tenure.\n\nI am a student of the late Julius Nyerere (the late former Tanzania President). Corruption is treason for me, she said.\n\nIf a leader allows corruption, the people will get agitated and overthrow you. So, no to corruption. It is not going to be business as usual, comrades.\n\nI love you all, but you might hate me because I love you and I want to do what is good for you. And I repeat, it is not going to be business as usual.\n\nThe inauguration ceremony was broadcast live on television and radio, allowing Namibians across the country to participate in the celebration.\n\nThe event was also attended by representatives from various corporate entities and institutions, who expressed their support for President Nandi-Ndaitwah and her vision for Namibia.\n\nMeanwhile, President Mnangagwa returned home yesterday evening.\n\nHe was received at Robert Gabriel Mugabe International Airport by Vice President Dr Constantino Chiwenga, Defence Minister Oppah Muchinguri-Kashiri, service chiefs and other senior Government officials.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/NAM1.jpg",
            "description": "Kudakwashe Mugari in WINDHOEK, Namibia NAMIBIA’s new President Netumbo Nandi-Ndaitwah was sworn in at State House here yesterday, marking a historic moment for the Southern African country. She becomes Namibia’s first female Head of State. The event, which coincided with celebrations to mark Namibia’s 35th independence celebrations, was attended by President Mnangagwa, who is also […]",
            "time": "08:34",
            "date": "22 Mar 2025"
        },
        {
            "title": "ZiG levels in market match Govt’s stability aspirations— Mthuli",
            "url": "https://www.herald.co.zw/zig-levels-in-market-match-govts-stability-aspirations-mthuli/",
            "content": "Africa Moyo, Deputy News Editor\n\nTHE amount of ZiG circulating in the market matches the Governments aspirations for durable currency stability desired by consumers, a Cabinet Minister has said.\n\nExplaining Treasury and the Reserve Bank of Zimbabwes tight fiscal and monetary policy positions, Finance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube said the prevailing exchange rate stability where the official and parallel market rates were almost converging was not artificial and would be sustained for the foreseeable future.\n\nThis follows concerns by some members of the transacting public and industrialists about the alleged shortage of the ZiG, which they claimed was affecting the economy.\n\nSome critics say ZiG shortages have resulted in an artificial inflation level, which would rise if more local currency became available on the market.\n\nThe domestic currency monthly inflation rate matched the US dollar rate in January, following a spike driven by increases in rentals.\n\nIn January 2025, Zimbabwes month-on-month inflation rate in ZiG terms surged to 105 percent, a significant increase from the previous months 3,7 percent, compared to the 11,5 percent rate for the US dollar monthly inflation rate.\n\nThe ZiG monthly inflation rate came in at 0,5 percent in February and remains well below the 5 percent monthly range set by Treasury.\n\nIn an exclusive interview with The Herald, Prof Ncube said Zimbabwes low inflation trajectory was not artificial.\n\nInflation is what it is. But also the accusation is that theres no money in the market. That is what is called a tight monetary policy; that is actually the technical definition, he said.\n\nSo, right now, we have a policy that is tight in order to manage inflation in the first place. That is the objective; so its not artificial.\n\nA tight monetary policy, also known as contractionary monetary policy, is a strategy used by a central bank to limit the amount of money available in the economy and may include raising interest rates to curb inflation and speculative borrowing.\n\nThe level of inflation is commensurate with the ZIG money supply that is at hand, and it is appropriate that the Reserve Bank is conducting such tight monetary policy, said Prof Ncube.\n\nThat monetary policy is complemented, also, by a tight fiscal policy because what you dont want is for Government spending to run away, getting out of control to a point where we have to monetise that excess budget deficit.\n\nHe said doing that would drive the money supply and raise inflation, pushing prices of most products beyond the reach of many.\n\nA tight fiscal policy involves a government making sure it lives within its means. In this case, all current and capital spending on social services come out of taxes.\n\nOnly capital spending that produces an instant flow of extra money to repay a loan can be supported by borrowing. This means that the Government does not create money and thus feeding inflation.\n\nProf Ncube said a tight fiscal policy and a tight monetary policy went hand in hand.\n\nThat is what we have right now and that is why the ZiG is stable in the first place. The economy and citizens have been crying out for a stable macroeconomic environment and that is what we are delivering right now. So people should be pleased that at least, we are delivering what is expected of us as the economic policymakers, he said.\n\nThey demanded stability; it allows them to plan, it gives our domestic currency, ZIG, value. You can now save in it, you can transact in it, you restore value characteristics.\n\nZimbabwes monetary policy focuses on maintaining a tight stance, backing Treasurys tight fiscal stance, to stabilise the ZiGand curb inflation, with the Reserve Bank of Zimbabwe aiming to ensure all ZiG in circulation is well-covered by foreign currency reserves.\n\nZiG is backed by gold and foreign reserves.\n\nThe RBZs gold and foreign reserves accumulation strategy in 2024 has resulted in its gold holdings increasing from 1,5 tonnes to 2,7 tonnes.\n\nThe monetary value of gold and foreign currencies ended last year at over US$500 million, which is more than three times cover for the ZiG in circulation.\n\nIn its Strategy Plan (2025-2029), the RBZ exclusively focuses on its core mandate of maintaining price and financial stability, which is aligned to the Back-to-Basics thrust aimed at balancing Confidence-Trust-Credibility-Efficiency-Stability-Growth outcomes.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/03/Minister-Mthuli-Ncube.jpg",
            "description": "Africa Moyo, Deputy News Editor THE amount of ZiG circulating in the market matches the Government’s aspirations for durable currency stability desired by consumers, a Cabinet Minister has said. Explaining Treasury and the Reserve Bank of Zimbabwe’s tight fiscal and monetary policy positions, Finance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube said the […]",
            "time": "08:34",
            "date": "22 Mar 2025"
        },
        {
            "title": "Namibian leader pushes for  sanctions removal, regional unity",
            "url": "https://www.herald.co.zw/namibian-leader-pushes-for-sanctions-removal-regional-unity/",
            "content": "Kudakwashe Mugari in WINDHOEK,Namibia\n\nNamibias President Netumbo Nandi-Ndaitwah has reaffirmed her countrys commitment to advocating for the lifting of sanctions against Zimbabwe and other nations.\n\nIn an interview at the State House, President Nandi-Ndaitwah said sanctions have hindered Zimbabwes economic growth and development for far too long.\n\nSanctions against Zimbabwe, Cuba, and Venezuela must be lifted. There is no reason for keeping sanctions on Zimbabwe, she said.\n\nThose sanctions are hurting us as a region.\n\nThe issue of sanctions is a policy that Namibia will continue to pursue and we believe it is essential for promoting economic development and regional cooperation.\n\nBritain and its allies imposed sanctions on Zimbabwe in response to the countrys successful land reform programme, aiming to suppress the voices of its people. For over two decades, these sanctions have inflicted harm on ordinary citizens.\n\nPresident Nandi-Ndaitwah also delivered a strong message reiterating the importance of unity and cooperation between Zimbabwe and Namibia.\n\nIn terms of Agriculture expertise my administration will tap from Zimbabwe. We have other bilateral policies between our countries. I have been to Zimbabwe several times as a minister and we have benefited a lot from the friendship.\n\nSo the two countries are one, she said.\n\nPresident Nandi-Ndaitwah also emphasised the importance of regional solidarity, particularly in the face of attacks on revolutionary parties like SWAPO, ZANU-PF, and ANC, among others.\n\nWe must work together to protect our revolutionary gains. It is true our parties are under attack from external forces. You can see from the results of elections in our region that we are under attack, she said.\n\nTo maintain unity and achieve victory for the revolutionary party, President Nandi-Ndaitwah believes that implementing SADC programmes is essential.\n\nDeveloping regional value chains is essential for promoting economic growth, creating jobs, and improving the well-being of our people, she said.\n\nWe must change our mindset and pour resources on value addition and beneficiation.\n\nPresident Nandi-Ndaitwah pointed to Europes specialised production model, where nations focus on manufacturing specific parts of a product. She stressed the need for a collaborative approach, urging a move away from monopolised production.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/KM.jpg",
            "description": "Kudakwashe Mugari in WINDHOEK,Namibia Namibia’s President Netumbo Nandi-Ndaitwah has reaffirmed her country’s commitment to advocating for the lifting of sanctions against Zimbabwe and other nations. In an interview at the State House, President Nandi-Ndaitwah said sanctions have hindered Zimbabwe’s economic growth and development for far too long. “Sanctions against Zimbabwe, Cuba, and Venezuela must be […]",
            "time": "08:34",
            "date": "22 Mar 2025"
        },
        {
            "title": "President congratulates triumphant Coventry",
            "url": "https://www.herald.co.zw/president-congratulates-triumphant-coventry/",
            "content": "Ivan Zhakata, Herald Correspondent\n\nPRESIDENT Mnangagwa has congratulated Sport, Recreation, Arts and Culture Minister Kirsty Coventry on her historic election as International Olympic Committee (IOC) president.\n\nIn a statement yesterday, President Mnangagwa said Minister Coventry has made Africa proud by becoming the first African to hold the position in the 131-year history of the IOC.\n\nThursday 20th March, 2025, will remain etched in the annals of history, both in Zimbabwe and across the entire world, as one of our own, Minister of Sport, Arts and Recreation, Honourable Kirsty Coventry, was elected the International Olympic Committee (IOC) president, garnering 49 votes out of a possible 97, he said.\n\nThis incredible win comes iced with the shattering of three records, all broken at the same time. Kirsty Coventry made Africa proud by becoming the first African person to hold the position in the 131-year history of the sports body.\n\nIn addition, she becomes the first woman and the youngest person to achieve this feat! For Zimbabwe, this achievement, huge and historic as it is, comes as no surprise.\n\nPresident Mnangagwa said the country had witnessed Minister Coventrys meteoric rise in the world of sport from being a multiple Olympic champion to a leader.\n\nYour approach to sport has always been marked by intense passion, focus and fierce determination, singling you out as a go-getter who accepts no defeat, he said.\n\nToday, with the flag of Zimbabwe flying high up, I am proud to give you well-deserved congratulations. You have lifted your country high. In centuries to come, whenever the history of the IOC is spoken about or written down, Zimbabwe will be mentioned as having produced the first woman president; the first African president and the youngest president.\n\nEven as you tackle the huge challenges that lie ahead in the new job, I am very confident that you will, undoubtedly, hold your own. You will be no push over and you will do justice to the task that awaits.\n\nI wish you all the best, and success in your tenure as the International Olympic Committee president. Nhasi ndezveduwo! Zimbabwe is proud of you. Well done Kirsty Coventry!.\n\nMinister Coventry, a seven-time Olympic swimming medallist and former world record-holder, has been a key figure in Zimbabwes sports administration.\n\nHer new role as IOC president is expected to bring fresh perspectives and stronger African representation in global sports governance.\n\nThe news of Minister Coventrys election has been met with celebrations across Zimbabwe, with athletes, officials and citizens applauding her for breaking barriers on the international stage.\n\nMany view her presidency as a milestone in promoting inclusivity, athlete welfare and increased opportunities for African nations within the Olympic movement.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Kirsty-Coventry.jpg",
            "description": "Ivan Zhakata, Herald Correspondent PRESIDENT Mnangagwa has congratulated Sport, Recreation, Arts and Culture Minister Kirsty Coventry on her historic election as International Olympic Committee (IOC) president. In a statement yesterday, President Mnangagwa said Minister Coventry has made Africa proud by becoming the first African to hold the position in the 131-year history of the IOC. […]",
            "time": "08:34",
            "date": "22 Mar 2025"
        },
        {
            "title": "VPs congratulate Minister Coventry on historic IOC presidency",
            "url": "https://www.herald.co.zw/vps-congratulate-minister-coventry-on-historic-ioc-presidency/",
            "content": "Ivan Zhakata and Africa Moyo\n\nVICE Presidents Dr Constantino Chiwenga and Kembo Mohadi have commended Sports, Recreation, Arts and Culture Minister Dr Kirsty Coventry on her historic election as the first female and first African president of the International Olympic Committee (IOC).\n\nIn a statement, VP Chiwenga said the appointment was a monumental achievement not only for Minister Coventry but for Zimbabwe and the entire African continent.\n\nHer journey from an Olympic champion to a global sports leader is a testament to her unwavering dedication, excellence, and passion for sports development, he said.\n\nMinister Coventry, a seven-time Olympic medallist and former world record-holding swimmer, has been a key figure in Zimbabwes sports administration.\n\nHer new role as IOC president is expected to bring fresh perspectives and stronger African representation in global sports governance.\n\nVP President Chiwenga said Minister Coventrys leadership was significant and it was her outstanding contributions to sports that led to her appointment as Minister of Sports by President Mnangagwa.\n\nHer expertise and commitment have transformed our national sports agenda, and we have no doubt that she will bring the same vision and dedication to the International Olympic Committee, he said.\n\nThe Government of Zimbabwe stands firmly behind her as she embarks on this critical journey.\n\nThe news of Minister Coventrys election has been met with celebrations across Zimbabwe, with athletes, officials and citizens applauding her for breaking barriers on the international stage.\n\nOn his part, VP Mohadi said the election of Minister Coventry to become the new IOC president is a source of pride for Zimbabwe and the rest of Africa.\n\nIn a statement released through his Chief of Staff, Dr Clever Chirume, VP Mohadi said Minister Coventrys rise has been exceptional and an inspiration to all.\n\nAs a result, Dr Chirume said VP Mohadi joins President Mnangagwa in congratulating Minister Coventry on her historic election as president of the IOC.\n\nYour ascension to the helm of IOC does not only bring pride to Zimbabwe, but it is a shining beacon for Africa, he said.\n\nYour journey from an Olympic champion to a global sports administrator is exceptional for us all.\n\nMay this new chapter be filled with success as you continue to raise our flag high on the global stage. Congratulations once again.\n\nVP Mohadi added that Minister Coventrys election will inspire future generations of athletes and leaders across Africa.\n\nMinister Coventrys election comes after a distinguished career as an Olympic swimmer and sports administrator.\n\nBorn on September 16, 1983, in Harare, she is celebrated as one of Zimbabwes most successful athletes, having won seven Olympic medals, two gold, four silver and a bronze, making her the most decorated Zimbabwean Olympian.\n\nHer remarkable performances at the 2004 Athens and 2008 Beijing Olympics have cemented her legacy in the sport.\n\nFollowing her retirement from competitive swimming, Coventry transitioned into sports administration, where she has made significant strides.\n\nShe was Sports Minister from 2018 until her election to the IOC presidency on Thursday.\n\nHer efforts in this role have focused on developing sports infrastructure in Zimbabwe and promoting youth participation in various sporting disciplines.\n\nThere has been growing recognition of the need for African representation in international sports governance, and Minister Coventrys election is seen as a pivotal moment in the IOCs history, as she becomes the first African, and the first woman to hold this prestigious position.\n\nHer leadership is expected to prioritise inclusivity and sustainability in the Olympic movement, aligning with the IOCs recent initiatives aimed at increasing participation and support for developing nations.\n\nSport analysts have said her presidency at the IOC marks a transformative moment in sports history, symbolising progress and potential for Zimbabwe and the African continent.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/VPs.jpg",
            "description": "Ivan Zhakata and Africa Moyo VICE Presidents Dr Constantino Chiwenga and Kembo Mohadi have commended Sports, Recreation, Arts and Culture Minister Dr Kirsty Coventry on her historic election as the first female and first African president of the International Olympic Committee (IOC). In a statement, VP Chiwenga said the appointment was a monumental achievement not […]",
            "time": "08:34",
            "date": "22 Mar 2025"
        },
        {
            "title": "ZDF concerned over misuse  of uniforms, social media",
            "url": "https://www.herald.co.zw/zdf-concerned-over-misuse-of-uniforms-social-media/",
            "content": "Herald Reporter\n\nThe Zimbabwe Defence Forces (ZDF) yesterday said it was concerned over the misuse of its uniforms and recent utterances on social media by some members of the public, including retired members, on their individual political and economic wishes on the situation in the country.\n\nIn a statement, the ZDF said it was critical for those involved to stop making such claims as they may unfortunately be misconstrued to be the position of the Zimbabwe Defence Forces.\n\nThe public is hereby advised that the Zimbabwe Defence Forces have established channels of communicating with the public and social media is not one of them. The Zimbabwe Defence Forces therefore dissociate themselves from all social media utterances emanating from the public including some retired members.\n\nThe Zimbabwe Defence Forces further note with concern, the continued misuse of military uniform by some members of the public, reads the statement.\n\nThe public was advised that according to the Defence Act (Chapter 11:02), the abuse of military uniform is an offence which prohibits and criminalises the wearing of military uniform by individuals who are not members of the Defence Forces.\n\nSection 99 (2) (c) of the Defence Act (Chapter 11:02) further states that: Any person who without authority wears or uses any decoration supplied to or authorised for use by any member of the Defence Forces or other military forces or any decoration so nearly resembling such decoration as to be likely to deceive shall be guilty of an offence.\n\nAdded the ZDF: Members of the public are therefore urged to desist from acquiring or wearing any items of military uniform or apparel resembling such. Those caught on the wrong side of the law will be prosecuted. Members of the public are also urged to report to the Zimbabwe Republic Police or the Zimbabwe Military Police any persons seen wearing military uniforms outside cantonment and other designated areas, or those committing crimes on the pretext that they are members of the Zimbabwe Defence Forces.\n\nIn this regard, the Zimbabwe Defence Forces appeal to members of the public to report anyone known to be a civilian but wearing military uniform for whatever reason.\n\nAnyone who might have complaints to make against criminals abusing ZDF attire should contact their call centres on cellphone numbers 0712842318 and 0716801064 or landline numbers (0242) 252094 and (0242) 791129.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Zimbabwe-Defence-Forces.jpg",
            "description": "Herald Reporter The Zimbabwe Defence Forces (ZDF) yesterday said it was concerned over the misuse of its uniforms and recent utterances on social media by some members of the public, including retired members, on their individual political and economic wishes on the situation in the country. In a statement, the ZDF said it was critical […]",
            "time": "08:34",
            "date": "22 Mar 2025"
        },
        {
            "title": "EDITORIAL COMMENT: Coventry’s historic feat inspirational",
            "url": "https://www.herald.co.zw/editorial-comment-coventrys-historic-feat-inspirational/",
            "content": "EXACTLY 21 years after she lifted the nations spirits and flew the countrys flag high because of her sporting achievements, Kirsty Coventry has returned to cheer Zimbabweans again, providing yet another golden moment for her motherland.\n\nIn 2004, in the swimming pools of Athens in Greece, Coventry became the first individual athlete to win a medal for Zimbabwe at the Olympic Games, kick-starting a series that would see her not only become the countrys fabled Golden Girl, but Africas most decorated Olympian as she would harvest more medals at the 2008 edition in Beijing, China.\n\nFast forward to 2025 and in the country where she struck gold in the swimming pool, the Minister of Sport, Recreation, Arts and Culture powered to a stunning International Olympic Committee (IOC) election victory that broke the ceiling in the 130-year history of the worlds biggest sporting institution.\n\nShe became the first woman president of the IOC after convincingly beating a very strong field of revered contestants, who are highly-rated sports administrators including Juan Antonio Samaranch Salisachs, a Spanish sports executive and financial analyst who currently serves as the vice president of the IOC and World Athletics president Sebastian Coe.\n\nCoventry polled 49 of the 97 votes at stake, Samaranch had 28 and Coe, a very distant third with a paltry eight.\n\nThus Zimbabweans, Africans and the global sporting family at large have every reason to celebrate Coventrys milestone.\n\nHer historic triumph sees her become the first African to lead the IOC and the youngest person to assume leadership of the Movement after its founding president Pierre de Coubertin, who was 33 when he ascended to the helm.\n\nWhile the huge election victory has naturally drawn massive celebrations and an outpouring of love for Coventry from across the globe, Zimbabweans must draw extra inspiration from her historic feat.\n\nAt 41, she was the youngest among those who were vying for the IOC presidency yet in her career as an athlete, as a sports administrator and as a Cabinet Minister, Coventry has been an epitome of resilience and determination.\n\nZimbabweans can only repay the kind of faith and confidence that the world has reposed in Coventry by ensuring we all put shoulders to the wheel and uplift our sporting standards, that have over the years slumped.\n\nAs a small nation, we have already shown the world that we can produce gold medallists at the ultimate global sporting competition  the Olympics, having done so at this countrys birth in 1980 when the Womens hockey team won gold at the Moscow Games in Russia.\n\nIndeed, her triumph in the IOC elections in which the Government has naturally led the way in celebrating, is an epic moment for Zimbabwe.\n\nThe stuff that real history is made of, a triumph that has left even some of this beautiful countrys detractors not only in awe, but having to admit the folly of their negative campaigning, which sadly for them could not sway the IOC voters.\n\nCoventry has a vision to see the IOC playing a bigger role in bridging the gap between the Haves and the Have nots and our various national sporting associations must implement policies that deliberately uplift marginalised sectors of our sport.\n\nHer election should inspire the young people in the country to take sport more seriously from a very young age.\n\nIt should also inspire more women to participate in sport.\n\nAfter all it is women, who have achieved the most for Zimbabwe on the international sporting stage, starting with the hockey Golden Girls, through to the netball Gems who have been to the two World Cup showcases and the womens football team  the Mighty Warriors who reached the 2016 Olympic Games in Rio de Janeiro, Brazil.\n\nOf course, Coventrys election does not mean Zimbabwe is now capable of hosting the Olympics, but her illustrious career as an Olympian has inspired thousands of young athletes to take up swimming as their discipline of choice.\n\nHer extensive experience and profound knowledge of the sporting ecosystem is a feat which all out sporting institutions can only tap into.\n\nIt is through her passion and vision for sport that as Minister, she has demanded professionalism at national associations.\n\nWe believe that this country is endowed with the talent but that talent could come to nought if not accorded the important support systems especially those that guarantee Long Term Athlete Development.\n\nShe has made this country proud since her teenage days when she competed in the Commonwealth Games.\n\nIn her new role as IOC president, Zimbabweans can only make her proud by ensuring we produce Olympic medallists and grow the numbers of our athletes who qualify for the quadrennial Games.\n\nHer manifesto was based on the principles of Ubuntu which speaks to and prioritises team work and collectivism over individualism.\n\nUbuntu asserts that society shapes our humanity: I am because we are.\n\nThis is a guiding principle that enhances a practical approach to interpersonal relationships.\n\nA principle so valuable our national supporting associations and Zimbabweans at large should adopt in growing our sport, our economy and our beautiful country.\n\nThank you Kirsty for the Olympic legacy.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/32rd-680x380.jpg",
            "description": "EXACTLY 21 years after she lifted the nation’s spirits and flew the country’s flag high because of her sporting achievements, Kirsty Coventry has returned to cheer Zimbabweans again, providing yet another golden moment for her motherland. In 2004, in the swimming pools of Athens in Greece, Coventry became the first individual athlete to win a […]",
            "time": "08:34",
            "date": "22 Mar 2025"
        },
        {
            "title": "When fathers dash their children’s dreams",
            "url": "https://www.herald.co.zw/when-fathers-dash-their-childrens-dreams/",
            "content": "To be betrayed by those closest to you is a pain deeper than any wound inflicted by an enemy.\n\nAnd a father is often seen as a protector, provider, and guiding light in a childs life. But what happens when this very figure who should be a pillar of strength becomes the architect of his childrens downfall?\n\nAcross many homes and campuses, there are students whose greatest obstacles are not academic challenges, but the very men who brought them into this world.\n\nThe truth be told, a child who grows up in constant fear of a fathers rage may never develop the confidence to chase their dreams.\n\nMany young people on campus are battling self-doubt because they were never told they were worthy of love or success. I have been balancing my writings where at one point I elucidated that sometimes our parents are the authors of our failures.\n\nWhile oftentimes children are the authors of their failures, sometimes its not their fault.\n\nNow it appears that some of the fathers have become monsters against their own children.\n\nLike always, I write what I see and sometimes what I hear.\n\nThis week, I am taking a swipe at the monster fathers who are destroying the future of their children.\n\nObviously, I give thumbs up to the good fathers who do not sleep until their children have achieved their dreams, well done to you.\n\nMay all the evil fathers find no peace especially those who rape their own children. By virtue of me being a communicator, I have a privilege to come across some of these worrying cases. This past week alone, I have come across more than four cases of fathers who have been jailed for raping their daughters.\n\nThe sentences are ranging from 15 years going up.\n\nSuch fathers, through their actions and inactions, are dashing the dreams of their children, leaving them scared, broken and hopeless.\n\nInstead of building their children up, they are tearing them down sometimes with violence, sexual abuse sometimes with neglect, and sometimes with the deepest betrayal imaginable. There are young girls in universities and schools today who carry not just books in their bags, but deep emotional wounds inflicted by their own fathers. Fathers who should shield them from harm have become the very predators they fear.\n\nSome of these young women sit in classrooms with empty gazes, struggling to focus because they bear the trauma of nights filled with horror.\n\nThe psychological impact of such abuse is devastating.\n\nI think I should give glory to the Almighty for not giving us transparent bodies otherwise every minute we would be seeing the heavy troubles our souls are carrying.\n\nBut still, trauma is easy to see from a distance. Studies have shown that victims of rape and abuse often struggle with depression, anxiety and an inability to perform well in their academics. A brilliant student with the potential to change the world is reduced to mere survival, her dreams snatched away by the very hands that should have lifted her.\n\nDiscipline is necessary in raising children, but when a father turns his home into a battlefield, he is not correcting but he is destroying.\n\nSome students bear not just physical scars but emotional ones from years of being treated as punching bags.When a childs sense of self-worth is shattered at home, no amount of academic achievement can truly fix it. Some fathers dash the dreams of their children not with fists or violence, but with neglect.\n\nA child who grows up being told they are unwanted, unimportant, or a burden often internalises these words.\n\nHow many young women have had their dreams of education cut short because their fathers did not believe in educating girls?\n\nNelson Mandela once said, Education is the most powerful weapon which you can use to change the world. Yet, how many fathers deny their daughters this very weapon, leaving them powerless in a world that demands knowledge and skill? The tragedy of these stories is that they do not end in childhood.\n\nMany young men or women who were raised with abuse or fists of fury grow into fathers or mothers who repeat the cycle.\n\nMany young women who were never taught their worth or abused settle for abusive partners because they have never known love that does not hurt. But cycles can be broken.\n\nTo every student reading this who has suffered at the hands of a father who should have loved them, you are more than your pain.\n\nYou are not defined by the wounds inflicted upon you.\n\nYour dreams are still valid, and you still have the power to rise above your past.\n\nTo fathers, if you have used your hands for harm instead of protection, your words for destruction instead of encouragement, it is not too late to change.\n\nThose who have raped their own daughters, may you rot in jail.\n\nA fathers role is not just to provide food and shelter but to nurture dreams, to uplift spirits, and to leave a legacy of love.\n\nLet no father be the reason his children stop dreaming.\n\nLet no father dash the future of the one he was meant to guide.\n\nThe true measure of a father is not in his strength, but in the strength he gives his children.\n\nUntil we meet for a toast\n\nFeedback:[emailprotected]\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Untitled-78-680x380.jpg",
            "description": "To be betrayed by those closest to you is a pain deeper than any wound inflicted by an enemy.",
            "time": "08:34",
            "date": "22 Mar 2025"
        },
        {
            "title": "Pros and cons of ice bath therapy",
            "url": "https://www.herald.co.zw/pros-and-cons-of-ice-bath-therapy/",
            "content": "Ice bath therapy, also known as cold water immersion (CWI), has gained popularity among athletes, fitness enthusiasts, and even those seeking general wellness benefits.\n\nWhile some swear by its ability to reduce muscle soreness and enhance recovery, others argue that the potential risks and drawbacks outweigh the benefits.\n\nHeres a look at the pros and cons of ice bath therapy to help you decide whether its right for you.\n\nPros of ice bath therapy\n\nReduces muscle soreness and inflammation\n\nOne of the biggest reasons people use ice baths is to relieve muscle soreness and inflammation.\n\nCold water helps constrict blood vessels, reducing swelling and flushing out metabolic waste, which can speed up recovery after intense exercise.\n\nSpeeds up recovery\n\nAthletes often use ice baths to recover more quickly after strenuous workouts or competitions. The cold exposure reduces muscle fatigue, allowing them to return to training sooner and at a higher intensity. One of the biggest reasons people use ice baths is to relieve muscle soreness and inflammation.\n\nMay improve circulation\n\nAfter exiting the ice bath, the body rapidly increases blood flow to warm up again. This process, known as vasodilation, can improve circulation, which may aid in overall cardiovascular health.\n\nHelps manage pain\n\nCold therapy has been used for centuries to numb pain. Ice baths can be an effective, drug-free way to relieve discomfort from muscle injuries, chronic pain conditions, or even post-surgical swelling.\n\nBoosts mental resilience\n\nImmersing yourself in freezing water is not just a physical challenge, its a mental one, too.\n\nMany people report that regular ice baths help them develop mental toughness, discipline, and a greater tolerance for discomfort.\n\nMay enhance mood and reduce stress\n\nExposure to cold water triggers the release of endorphins and norepinephrine, which can improve mood and reduce stress. Some studies suggest that cold therapy might even help with symptoms of depression and anxiety.\n\nCons of ice bath therapy\n\nRisk of hypothermia\n\nStaying in an ice bath for too long or exposing yourself to extremely low temperatures can lead to hypothermia, a dangerous condition where the body loses heat faster than it can produce it.\n\nCan be uncomfortable or painful\n\nCold water immersion is not a pleasant experience for everyone. The initial shock and discomfort can be overwhelming, especially for those not accustomed to the practice.\n\nMay hinder muscle growth\n\nSome research suggests that ice baths might actually reduce muscle gains by blunting the bodys natural inflammatory response, which is crucial for muscle repair and growth.\n\nIf muscle hypertrophy is your goal, frequent ice baths may not be ideal.\n\nNot suitable for everyone\n\nPeople with certain medical conditions, such as cardiovascular disease, high blood pressure, or Raynauds disease, should avoid ice baths, as the cold can put extra strain on the heart and circulatory system.\n\nPotential for nerve or tissue damage\n\nProlonged exposure to extremely cold temperatures can cause frostbite or nerve damage, especially if the water temperature is too low or if body parts remain submerged for too long.\n\nLimited scientific consensus\n\nWhile many people swear by ice baths, scientific studies on their effectiveness are mixed.\n\nSome research supports their benefits, while other studies suggest that they may not be significantly better than other recovery methods, such as active recovery or stretching. IOL Lifestyle\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/images-2-680x380.jpg",
            "description": "Ice bath therapy, also known as cold water immersion (CWI), has gained popularity among athletes, fitness enthusiasts, and even those seeking general wellness benefits.",
            "time": "08:34",
            "date": "22 Mar 2025"
        },
        {
            "title": "Decentralisation of title  deeds issuance paces up",
            "url": "https://www.herald.co.zw/decentralisation-of-title-deeds-issuance-paces-up/",
            "content": "Farirai Machivenyika, Senior Reporter\n\nOFFICES will soon be established in high-density suburbs in cities and towns across the country to expedite the collection of information on potential beneficiaries of the residential title deeds programme launched by President Mnangagwa in Epworth in 2023, Justice, Legal and Parliamentary Affairs Minister, Ziyambi Ziyambi, has said.\n\nResponding to questions from legislators in the National Assembly on progress made on the issuance of title deeds, Minister Ziyambi said the launch of the title deeds programme in Epworth was a pilot phase to provide insight into how the project would be implemented.\n\nPresident Mnangagwa launched the title deeds programme to secure property rights for homeowners in areas previously regarded as informal settlements.\n\nMore specifically, in urban areas, Epworth was a pilot so that we appreciate the process, then we would decentralise to other areas, said Minister Ziyambi.\n\nWhen we started, we were very excited; we thought it was easy but giving a title, it is a document that confers rights to the exclusion of everyone else.\n\nHence, we had to be thorough. What the Minister of Local Government (Daniel Garwe) was saying is, we needed to ensure that we do all the processes. I will give an example of Epworth; some people are there, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Minister-Ziyambi-Ziyambi-680x380.jpg",
            "description": "Farirai Machivenyika, Senior Reporter OFFICES will soon be established in high-density suburbs in cities and towns across the country to expedite the collection of information on potential beneficiaries of the residential title deeds programme launched by President Mnangagwa in Epworth in 2023, Justice, Legal and Parliamentary Affairs Minister, Ziyambi Ziyambi, has said. Responding to questions […]",
            "time": "08:34",
            "date": "22 Mar 2025"
        }
    ]
}