{
    "news": [
        {
            "title": "Budget will leave South Africans bruised, bloodied",
            "url": "https://www.herald.co.zw/budget-will-leave-south-africans-bruised-bloodied/",
            "content": "Ordinary South Africans are walking away from the 2025 budget bruised and bloodied.\n\nGovernment not only proposed an increase in the value-added tax (Vat) rate, but their income tax burden has increased by R18 billion.\n\nThe partial relief for bracket creep provided for in the original version of the 2025 budget has been wiped off the table. There will be no inflationary adjustment, not even for low-income households.\n\nNor is there any inflationary increase in medical credits.\n\nBut there will be above-inflation sin tax increases. These tax proposals are designed to result in an increased tax collection of R28 billion for the 2025/26 tax year and a whopping R44,1 billion in the following year.\n\nDespite massive resistance to tax increases, Finance Minister Enoch Godongwana raised the Vat rate by 0,5 percent, effective May 1 this year, and another 0,5 percentage points in 2026.\n\nTipping point\n\nThe expected collection from the Vat increase is R13,5 billion in 2025 and R15,5 billion in 2026.\n\nAneria Bouwer, senior consultant at Bowmans, says these projections may not materialise because of the overall increased tax burden.\n\nThe South African Revenue Service (Sars) seems to recognise that there is a tipping point where increased tax rates do not equate to increased tax collections.\n\nBouwer also notes that the primary and secondary rebates have not been adjusted to provide for the impact of inflation.\n\nIndividuals also receive an annual exemption on all South African interest income they earn. It has remained the same for a few years.\n\nThe exemption threshold for interest has remained unchanged since 2013. The current threshold is set at R23 800 for individuals under 65 and R34 500 for individuals 65 and older.\n\nThere is a general reluctance to increase certain thresholds, and because it is gradual it does have a substantial impact on taxpayers and their disposable income.\n\nGovernment thinking is that the higher income households will be bearing the brunt.\n\nLow Vat rate\n\nGerhard Badenhorst, director in Cliffe Dekker Hofmeyrs tax and exchange control practice, says Godongwana indicated in his 2025 Budget Review that 75 percent of the Vat collections come from high income households.\n\nThat may be true but one needs to consider that these households can afford to pay the taxes.\n\nWhat is important is to consider that poor and low-income households spend a substantial proportion of their disposable income on Vat.\n\nThey will feel the impact of the increase more than the richer households, he says.\n\nVat collections until 31 March are expected to come in at R460 billion, which is just under 25 percent of total tax collections. Time will tell if this percentage of total collections will increase because of the 0.5 percentage point increase in the rate, Badenhorst adds.\n\nThe minister attempted to motivate the increase by referring to peer countries and comparing their Vat rates with that of South Africa. The average of the peer countries is 19 percent compared to our current rate of 15 percent.\n\nBudget 2025, Vat, tax rates\n\nBadenhorst warns against considering the Vat rate in isolation.\n\nBotswana has a Vat rate of 14 percent, but its primary healthcare and education systems are exempt for Vat purposes. Our neighbours corporate tax rate is 22 percent compared to our 27 percent and their maximum marginal personal income tax rate is 25 percent compared to SAs 45 percent.\n\nScandinavian countries have an average Vat rate of 25 percent but virtually everything in these countries is tax-exempt.\n\nThey have taken a policy decision to move away from direct taxes to consumption taxes. That is why their Vat rates are so high, says Badenhorst. It is dangerous just to look at rates in isolation and then draw the conclusion that our Vat rate is low compared to other countries.\n\nSmokes and drinks\n\nSouth Africans will feel their tax burden further when they stock up on their smokes and drinks. Cigarettes and cigarette tobacco go up by 4,75 percent and alcohol products by 6,75 percent. Moneyweb\n\nTax Justice SA (TJSA) says these tax hikes will make life even harder for honest citizens while handing yet another victory to criminals.\n\nInstead of tackling the rampant illicit trade that is already robbing the fiscus of R100 billion every year, the government has chosen to punish law-abiding businesses and consumers, driving even more economic activity into the hands of criminals, the organisation says in a statement.\n\nMinister Godongwana has ignored reality and chosen a path that will only worsen South Africas economic crisis, says TJSA founder Yusuf Abramjee.\n\nIncreasing Vat and sin taxes will not raise the revenue the government hopes for. It will only boost illicit traders who operate with impunity while honest businesses struggle to survive.\n\nHe says the budget fails to address the real problem  criminals who are looting the nation on an industrial scale in virtually every sector.\n\nWhy is the Government so quick to squeeze honest taxpayers but so slow to shut down the kingpins of illicit trade? Moneyweb\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/06/istockphoto-931069162-612x612-612x380.jpeg",
            "description": "Ordinary South Africans are walking away from the 2025 budget bruised and bloodied. Government not only proposed an increase in the value-added tax (Vat) rate, but their income tax burden has increased by R18 billion. The partial relief for bracket creep provided for in the original version of the 2025 budget has been wiped off […]",
            "time": "18:41",
            "date": "14 Mar 2025"
        },
        {
            "title": "NAC engages traditional leaders in fight against HIV and AIDS",
            "url": "https://www.herald.co.zw/nac-engages-traditional-leaders-in-fight-against-hiv-and-aids/",
            "content": "Victor Maphosa\n\nMashonaland East Bureua\n\nThe National Aids Council (NAC) has engaged traditional leaders from Mashonaland East province in the fight against HIV and AIDS.\n\nNAC held a sensitisation meeting for the Chiefs in Macheke today, where it introduced the Not in my Village programme to the traditional leaders, which aims to encourage them to take an active role in the fight against HIV and AIDS in their areas of jurisdiction.\n\nThe traditional leaders pledged their unconditional support for NACs programmes.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/31d7b688-319d-4b54-ae2c-ff5d902aa48d-680x380.jpeg",
            "description": "Victor Maphosa Mashonaland East Bureua The National Aids Council (NAC) has engaged traditional leaders from Mashonaland East province in the fight against HIV and AIDS. NAC held a sensitisation meeting for the Chiefs in Macheke today, where it introduced the “Not in my Village” programme to the traditional leaders, which aims to encourage them to […]",
            "time": "18:41",
            "date": "14 Mar 2025"
        },
        {
            "title": "CAFCA sees 23pc surge in first  quarter volumes",
            "url": "https://www.herald.co.zw/cafca-sees-23pc-surge-in-first-quarter-volumes/",
            "content": "Michael Tome\n\nBusiness Reporter\n\nCABLEmanufacturer CAFCA says its volumes grew by 23 percent in the first quarter to December 31, 2024, buoyed by strong growth in aluminum and copper product uptake.\n\nAluminum volumes increased by 74 percent and the copper-based business delivered a 13 percent growth, underscoring the companys diversified strength.\n\nAccording to Cafca, utilities and commercial segments experienced substantial growth, with volumes surging by 187 percent and 83 percent, respectively, compared to the same period in the previous year.\n\nThese gains highlight the companys successful efforts to expand its customer base and capitalise on emerging opportunities in these sectors.\n\nCafcas first-quarter performance sets a positive tone for the rest of the year, with the company well-positioned to continue its growth trajectory and solidify its marketpresence.\n\nVolumes for the first quarter ended December 31, 2024, grew by 23 percent, supported by a 74 percent growth in aluminium volumes compared to the prior comparative period.\n\nThe copper-based business grew by 13 percent compared to the prior comparative period.\n\nUtilities and commercial business showed substantial growth, with volumes increasing by 187 percent and 83 percent, respectively, compared to the prior comparative period, said Caroline Kangara, Cafca company secretary in the companys trading update to December 2024.\n\nHowever, CAFCA reported a notable decline in retail and distribution volumes for the period under review after a 25 percent downturn.\n\nThe company attributed the performance to constrained trading environments and the growing informalisation of the sector.\n\nThe cable manufacturer said the decline was further exacerbated by the influx of smuggled products, disruptions in market channels, and intensified competition within the industry, which continued to exert pressure on trading margins.\n\nA challenging trading environment was largely punctuated by the adverse impact of drought on agricultural output, as well as weak commodity prices affecting other minerals in the Zimbabwean economy.\n\nEven the relatively stable performance in the mining sector, driven by gold production, was insufficient to offset the far-reaching effects of the tough economic climate.\n\nThe combination of these factors created a perfect storm that hindered CAFCAs retail and distribution segments, highlighting the need for the company to adapt and innovate in response to the evolving market landscape.\n\nCafcas ability to navigate these headwinds and identify opportunities for growth will be crucial in determining its future success.\n\nRetail and distribution volumes declined by 25 percent in the first quarter against the previous year due to the constrained trading spaces mostly influenced by the informalisation of that particular sector.\n\nThe market saw an increase in smuggled goods products, disruption of market chains, this was compounded by limited circulation of the Zimbabwean gold, said Kangara.\n\nCAFCA experienced a 39 percent decline in exports compared to the prior year due to foreign currency supply gaps in key export markets such as Malawi, Mozambique and East Africa.\n\nDespite this setback, the company achieved a 29 percent revenue growth for the quarter under review, compared to the previous year.\n\nHowever, CAFCAs production operations faced significant challenges, including power disruptions and surges, which resulted in equipment breakdowns.\n\nNotwithstanding these difficulties, the company successfully met customer production requirements, demonstrating its resilience and commitment to customersatisfaction.\n\nLooking ahead, CAFCA indicated that it intends to concentrate on enhancing operational effectiveness to safeguard margins and drive profitability.\n\nNevertheless, CAFCA acknowledges that the operating environment in Zimbabwe remains challenging, with policy changes, currency instability, and power supply disruptions continuing to pose significant risks.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/01/CAFCA.jpg",
            "description": "Michael Tome Business Reporter CABLE manufacturer CAFCA says its volumes grew by 23 percent in the first quarter to December 31, 2024, buoyed by strong growth in aluminum and copper product uptake. Aluminum volumes increased by 74 percent and the copper-based business delivered a 13 percent growth, underscoring the company’s diversified strength. According to Cafca, […]",
            "time": "18:41",
            "date": "14 Mar 2025"
        },
        {
            "title": "Trump’s tariff threat spurs companies to seek cover",
            "url": "https://www.herald.co.zw/trumps-tariff-threat-spurs-companies-to-seek-cover/",
            "content": "Companies across the world are looking for cover from President Donald Trumps frenzied tariff barrage, planning for the worst even as reversals and exemptions leave them desperately seeking clarity.\n\nIn corporate suites, executives are counting the potential cost of the tariffs, its impact on sales, profits and market shares. Many companies are putting tariff task forces in place as they look to mitigate the pain from the measures.\n\nIn his early weeks in office Trump imposed tariffs on about US$1,4 trillion of goods imports from Canada, Mexico and China  more than triple the US$380 billion worth of Chinese merchandise hit with such levies during his first term, according to estimates from the Tax Foundation.\n\nHe later delayed and scaled back those threats on Canada and Mexico. But his efforts to rewire the US economy have rattled financial markets.\n\nThey have also left companies from carmakers Stellantis NV and Volkswagen AG to pharmaceutical firms Sandoz Group AG and Eli Lilly & Co and retailers Walmart Inc., Target Corp. and Temu struggling to work out the impact and come up with a response.\n\nThe confusion stems in part from how inextricably intertwined global commerce has become over the last few decades, making the outcome of such measures difficult to predict, according to Florent Menegaux, tiremaker Michelins chief executive officer.\n\nIn a globalised world, the mechanisms are very complex.\n\nIf you start to put tariffs, it becomes very, very delicate to understand what are going to be the consequences, he said in an interview, noting for instance that for a vehicle assembled in the US, parts can cross borders 53 times  making tariffs a logistical nightmare.\n\nWhile companies are still sifting through the ever-changing policy statements, there are some broad strands emerging.\n\nMany, like European automotive parts companies Continental AG, Schaeffler AG and Valeo SE say they have no choice but to pass on the higher costs to consumers. Bloomberg\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Untitled-11.jpg",
            "description": "Companies across the world are looking for cover from President Donald Trump’s frenzied tariff barrage, planning for the worst even as reversals and exemptions leave them desperately seeking clarity. In corporate suites, executives are counting the potential cost of the tariffs, its impact on sales, profits and market shares. Many companies are putting “tariff task […]",
            "time": "18:41",
            "date": "14 Mar 2025"
        },
        {
            "title": "EU targets US$26bn US products in tariff retaliation",
            "url": "https://www.herald.co.zw/eu-targets-us26bn-us-products-in-tariff-retaliation/",
            "content": "The European Union launched countermeasures on Wednesday against new US metals tariffs, with plans to impose its own duties on up to 26 billion (US$28,3 billion) worth of American goods.\n\nThe announcement came hours after the US administration imposed 25 percent tariffs on steel and aluminum imports in a massive escalation of the trade war between the longstanding allies.\n\nThe EU will target politically sensitive goods in Republican-led states, including soybeans from Louisiana, home to House Speaker Mike Johnson, according to a senior EU official.\n\nEU metals tariffs that had been put in place during Trumps first term, and later suspended, are due to be reintroduced in full on April 1, including some levies that have never previously been in force.\n\nThe EU will also immediately begin consultations with member states, with the aim of adopting the additional lists of agricultural and industrial goods subject to tariffs as high as 25 percent by mid-April.\n\nOfficials said the idea is to allow a window for negotiations, which will be led by the blocs trade chief, Maros Sefcovic.\n\nThe countermeasures we take today are strong yet proportionate, European Commission President Ursula von der Leyen told reporters at a briefing in Strasbourg. We firmly believe that in a world fraught with geo-economic and political uncertainties, it is not in our common interest to burden our economies with such tariffs.\n\nWhile the EU announced immediately retaliatory steps, other affected countries, including the UK, refrained from immediate action and called for negotiations.\n\nEuropean stocks rallied on Wednesday, with the Stoxx Europe 600 gaining 0,7 percent and Germanys DAX rallying 1,2 percent as traders reacted to progress toward a ceasefire in the war in Ukraine. The euro was little changed, pausing after a sharp rally in the past days.\n\nFor Europe, the new levies will be nearly four times the size of similar duties imposed during Trumps first term, when the US targeted 6,4 billion of the blocs metals exports, citing national security concerns. Bloomberg\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/06/european-union-1024x698.jpg",
            "description": "The European Union launched countermeasures on Wednesday against new US metals tariffs, with plans to impose its own duties on up to €26 billion (US$28,3 billion) worth of American goods. The announcement came hours after the US administration imposed 25 percent tariffs on steel and aluminum imports in a massive escalation of the trade war […]",
            "time": "18:41",
            "date": "14 Mar 2025"
        },
        {
            "title": "17 countries, 24 foreign exhibitors book for ZITF",
            "url": "https://www.herald.co.zw/17-countries-24-foreign-exhibitors-book-for-zitf/",
            "content": "Nqobile Bhebhe\n\nSenior Business Reporter\n\nTWENTY-FOUR international exhibitors from 17 countries have confirmed participation at this years 65th edition of the Zimbabwe International Trade Fair.\n\nLast year, 13 countries participated in Zimbabwes premier annual trade exhibition. Officials confirmed that preparations had gathered momentum for this years event.\n\nThe increase in the number of participating nations at the trade showpiece is evidence of the success of the Governments engagement and re-engagement drive.\n\nSince coming to power in 2017, President Mnangagwas administration has made economic diplomacy an integral part of the Governments foreign policy.\n\nThe mandate of the ZITF Company, responsible for organising the exhibition, includes spearheading national branding efforts, promoting investments and economic growth.\n\nOrganisers said to date, 47 140.87 square metres of the available space, representing 95,2 percent of the total, had been taken up by 435 direct exhibitors.\n\nThis years trade showcase will run from April 21 to 26 at the Zimbabwe International Conference and Exhibition Smart City (ZICES) in Bulawayo under the theme Industrialisation: Crafting an Integrated Economic Landscape.\n\nGiving an update on the state of preparedness yesterday, ZITF chairman Mr Busisa Moyo said the exhibition would position Zimbabwe as a competitive hub for trade and investment and highlight the ZITF Companys enduring legacy and role in shaping Zimbabwes industrial landscape over the decades.\n\nPreparations for the ZITF 2025 edition, taking place from April 21-26, 2025, at the Zimbabwe International Conference and Exhibition Smart City (ZICES) in Bulawayo, are gaining momentum.\n\nAs one of Africas premier trade showcases, ZITF continues to play a pivotal role in driving industrial growth, fostering business connections, and positioning Zimbabwe as a competitive hub for trade and investment.\n\nThis years edition is expected to bring together a diverse mix of local and international exhibitors, investors and policymakers, setting the stage for transformative economic dialogue and collaboration, said Mr Moyo.\n\nHe said as the annual trade showcase celebrates its Blue Sapphire edition, 65 years of exhibition excellence, this years edition would make significant strides in fostering collaboration among industries and countries, strengthening economic ties, and advancing mechanisation in industrial sectors.\n\nThis milestone edition will highlight ZITFs enduring legacy and its role in shaping Zimbabwes industrial landscape over the decades.\n\nMr Moyo said exhibition space uptake had been impressive.\n\nAs preparations for the international, multi-sectoral tradeshow are heading to a climax, the uptake by exhibitors has been quite pleasing.\n\nWe are currently sitting at 95,2 percent of space capacity with 435 direct exhibitors who have taken up 47 140.87 square metres of the set aside 49,499 Square metres.\n\nInternational participation is also very strong. To date, we have confirmed 24 confirmed international exhibits from 17 countries.\n\nThis compares favourably with the booking situation at the same time last year when 13 countries had booked space. Last years closing total was 27 countries represented, he added.\n\nThe ZITF Company recently launched a series of regional roadshows in Botswana, South Africa and Zambia to signal the official countdown to the 65th edition of its annual exhibition in Bulawayo.\n\nThe Botswana leg of the roadshow set for Gaborone is scheduled for today.\n\nMr Moyo said more international road shows were on the cards.\n\nThe road shows tailored presentations and interactive networking sessions have been highlighting the benefits of participating in ZITF events and exploring regional collaboration opportunities.\n\nAttendees per each roadshow have been between 50-80 delegates, including heads of mission based in the visited countries but accredited to Zimbabwe, trade promotion agencies, chambers of commerce and business member organisations (BMOs), media, Zim-diaspora business associations as well as individual potential private-sector exhibitors.\n\nThese engagements have received positive feedback from industry stakeholders, with many expressing enthusiasm about the opportunities ZITF 2025 will offer.\n\nThe roadshows have not only expanded ZITFs reach but reinforced its role as a key driver of regional economic cooperation.\n\nMr Moyo said the event would feature individual companies and organisations from Afghanistan, Canada, Egypt, Ethiopia, Kenya, and Pakistan, showcasing their products and services.\n\nAdditionally, several countries and regional bodies will participate through organised delegations, underscoring their commitment to fostering trade and economic partnerships.\n\nThese include Belarus, China, the European Union, Japan, Malawi, Mozambique, South Africa, Tanzania, the United Kingdom, and the United States of America.\n\nBeyond exhibitors, the event will also welcome high-level delegations from India (organised by the (Federation of Indian Chambers of Commerce and Industry (FICCI) who will be attending as visitors to explore business and investment opportunities, added Mr Moyo.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Untitled-233-680x380.jpg",
            "description": "Nqobile Bhebhe Senior Business Reporter TWENTY-FOUR international exhibitors from 17 countries have confirmed participation at this year’s 65th edition of the Zimbabwe International Trade Fair. Last year, 13 countries participated in Zimbabwe’s premier annual trade exhibition. Officials confirmed that preparations had gathered momentum for this year’s event. The increase in the number of participating nations […]",
            "time": "18:41",
            "date": "14 Mar 2025"
        },
        {
            "title": "Minister Masuka to headline AfCFTA Indaba",
            "url": "https://www.herald.co.zw/minister-masuka-to-headline-afcfta-indaba/",
            "content": "Business Reporter\n\nLands, Agriculture, Fisheries, Water and Rural Development Minister Dr Anxious Masuka is scheduled to headline the African Continental Free Trade Area (AfCFTA) Association of African Commodity Exchanges (A-ACX) annual conference to be held in Zimbabwe later this month.\n\nIn a major step towards strengthening intra-African trade and economic resilience, Zimbabwe was selected to host this years edition of the conference.\n\nThe Zimbabwe Mercantile Exchange (ZMX), in a statement, said the upcoming conference would take place from March 26-27 at the Elephant Hills Hotel in Victoria Falls.\n\nThe commodities exchange said preparations were progressing well.\n\nThe event is shaping up to be a landmark programme, bringing together key industry players from across the continent. Minister Dr Masuka will be the esteemed guest speaker at the conference, reads the statement.\n\nZMX said his presence underscored the importance of the event in advancing Africas agricultural and trade agenda and Zimbabwes commitment to fostering economic growth through commodity exchange platforms.\n\nA delegation from the AfCFTA, led by the head of market access, directorate of trade in goods and competition, AfCFTA Secretariat, Joyce Letswalo, will also grace the conference.\n\nOther key presenters include Ghana Commodity Exchange chief executive Tucci Ivowi, global expert in commodity trade and finance Mr Adam Gross, Zimbabwe Investment and Development Agency (ZIDA) chief executive officer Mr Tafadzwa Chinamo, Johannesburg Securities Exchange (JSE) head of commodities in the capital markets division Anelisa Matutu, commodities and derivatives markets expert Dr Bharat Kulkarni and ZMX chief executive Mr Collen Tapfumaneyi.\n\nThe theme for this years conference, Scaling Intra-African Trade: Leveraging Commodity Exchanges for Economic Resilience and Growth, highlights the role of commodity exchanges in strengthening regional trade and advancing the objectives of the African Continental Free Trade Area (AfCFTA), explained ZMX.\n\nDelegates from all over the continent have already registered to attend, reflecting the growing interest in the discussions surrounding trade harmonisation, investment opportunities, supply chain development and policy frameworks to unlock Africas trade potential.\n\nThe conference will serve as a vital platform for networking, business linkages, and strategic collaborations among policymakers, financial and logistics experts, and international organisations, added ZMX.\n\nZMX said, as the host country, Zimbabwe was ready to showcase its contributions to Africas commodity markets, emphasising its innovative market structures and strategic policies aimed at enhancing agricultural and resource-based trade.\n\nThe event is expected to position Zimbabwe as a key player in intra-African commerce and attract investments into its key economic sectors.\n\nThe A-ACX, an alliance of commodity exchanges across Africa, was established to foster collaboration and alignment with AfCFTAs broader goals of catalysing economic growth and promoting trade among African nations.\n\nThe association aims to play a pivotal role in advancing intra-African trade in commodities and related services, providing a platform for innovation, market development, and regional economic integration.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Untitled-232-680x380.jpg",
            "description": "Business Reporter Lands, Agriculture, Fisheries, Water and Rural Development Minister Dr Anxious Masuka is scheduled to headline the African Continental Free Trade Area (AfCFTA) Association of African Commodity Exchanges (A-ACX) annual conference to be held in Zimbabwe later this month. In a major step towards strengthening intra-African trade and economic resilience, Zimbabwe was selected to […]",
            "time": "18:41",
            "date": "14 Mar 2025"
        },
        {
            "title": "Government extends lean season assistance",
            "url": "https://www.herald.co.zw/government-extends-lean-season-assistance/",
            "content": "Elita Chikwati recently in Buhera\n\nThe Government has extended the lean season food assistance by a month to ensure that no one is affected by hunger, a senior official said at the Madzivire Food Distribution Point in Buhera on Tuesday.\n\nThis comes as United Nations agencies have vowed to strengthen partnerships among themselves and engage the private sector to continue with humanitarian work.\n\nThe lean season, usually the peak hunger period before the next harvest, normally stretches from January to March.\n\nIn an interview after the World Food Programme food distribution on Tuesday, Public Service, Labour and Social Welfare Permanent Secretary, Mr Simon Masanga said the Government has extended assistance up to April due to the late onset of rains in some areas.\n\nCabinet decided to extend this lean season programme by another month up to the end of April when people start getting food from their fields. I need to stress that the Government programme will never come to an end.\n\nWe are always on alert to respond to distress calls. Even after April, if there is a particular community that requires food assistance, they can always go to the nearest social welfare office. We are available throughout the year to ensure and uphold the pledge by the President that no one should die of hunger.\n\nUN resident coordinator, Mr Edward Kallon said he was impressed by the refining of the food distribution process, which is now more accountable.\n\nI want to thank the Government and UN for working together with one common cause, he said.\n\nWFP representative and country director, Ms Barbara Clemens said due to the good the rains, there is going to be a reduction in the number of people in need of assistance in the next lean season.\n\nWe are in the process of working with the Government at the Food and Nutrition Council to see what the state of food security will be like going forward, she said.\n\nThat will inform the degree of resource mobilisation as we prepare for the next lean season. The programmes we undertake seek to minimise the need for lean season assistance by helping to make people more resilient, which is important.\n\nSpeaking on the US aid reduction, Ms Clemence said this presents an opportunity for fostering partnerships with the private sector.\n\nThis is an opportunity to see more efficiency, effectiveness and greater impact because we are partnering and not going alone. We are partnering more with other UN agencies and other NGOs; what is missing from the equation is the private sector.\n\nFor years we have been talking about engaging the private sector, and now we must do that, she said.\n\nUNICEF, Zimbabwe representative, Ms Etona Ekole said she was impressed by the services being offered to beneficiaries at the food distribution points.\n\nBeneficiaries are also getting useful information on health, water and sanitation, while children are also being screened for malnutrition by community health workers.\n\nI liked how organised this process is. It is very structured. It is a beautiful model that can be strengthened and replicated, she said.\n\nWorld Vision representative, Mr Assan Golowa said: We will continue to put our heads together. Let us continue to partner not only in this intervention but in all.\n\nBuhera District in Manicaland is prone to drought, with 15 percent in region 3; 35 percent in region 4 and 50 percent in region 5.\n\nThe lean season assistance in Buhera targeted 229 319 beneficiaries across all 33 communal wards, with food distributions taking place from January to March .\n\nBeneficiaries were receiving 8,5 kg of cereals, 1,7kg pulses and 0,6kg vegetable oil per individual.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/8d9c6bda-d094-46c3-a481-934b041969d7-680x380.jpeg",
            "description": "The Government has extended the lean season food assistance by a month to ensure that no one is affected by hunger, a senior official said at the Madzivire Food Distribution Point in Buhera on Tuesday.",
            "time": "18:41",
            "date": "14 Mar 2025"
        },
        {
            "title": "Chiredzi woman wanted for killing teenage girl",
            "url": "https://www.herald.co.zw/chiredzi-woman-wanted-for-killing-teenage-girl/",
            "content": "Crime Reporter\n\nPolice have launched a manhunt for a 45-year-old Chiredzi woman who is wanted in connection with the murder case of a teenage girl who died after trying to terminate a pregnancy.\n\nChipo Mulauzi allegedly gave the victim an unknown concoction to abort the pregnancy after she had been sexually abused.\n\nThe victim later died.\n\nNational police spokesperson, Commissioner Paul Nyathi confirmed the incident.\n\nPolice in Chiredzi are appealing for information that may lead to the arrest of Chipo Mulauzi who is being sought in connection with a case of murder in which a female juvenile aged 15 died on March 9 while admitted at a Chiredzi hospital, he said.\n\nThe suspect allegedly gave the victim an unknown concoction to terminate a pregnancy after she had been sexually abused.\n\nThe victim got sick after taking the concoction and was admitted at the hospital. Anyone with information can report at the nearest police station.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/02/wanted.jpg",
            "description": "Police have launched a manhunt for a 45-year-old Chiredzi woman who is wanted in connection with the murder case of a teenage girl who died after trying to terminate a pregnancy.",
            "time": "18:41",
            "date": "14 Mar 2025"
        },
        {
            "title": "SADC to implement decisions: Prof Murwira",
            "url": "https://www.herald.co.zw/sadc-to-implement-decisions-prof-murwira/",
            "content": "Wallace Ruzvidzo\n\nHerald Reporter\n\nSADC is prioritising the implementation of decisions made towards the betterment of livelihoods across the region, Foreign Affairs and International Trade Minister Professor Amon Murwira has said.\n\nSpeaking at the closing ceremony of the SADC Council of Ministers in Harare today, Prof Murwira said the regional bloc was working towards the realisation of its goals.\n\nSADC Council of Ministers Chairperson and Foreign Affairs and International Trade Minister Professor Amon Murwira delivers closing remarks at the regional blocs budgeting meeting at the New Parliament Building in Mt Hampden  Picture: Kudakwashe Hunda\n\nWe have noted the progress made in the implementation of our Regional Indicative Strategic Development Plan 2020-2030 and the attendant challenges, he said.\n\nWe all agree that these challenges provide an opportunity for us to learn, rethink and restrategise in this ever-changing international system.\n\nAs we move forward, it is important to prioritise the implementation of our decisions and ensure that our words translate into tangible progress for the benefit of all people.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Untitled-229-680x380.jpg",
            "description": "SADC is prioritising the implementation of decisions made towards the betterment of livelihoods across the region, Foreign Affairs and International Trade Minister Professor Amon Murwira has said.",
            "time": "18:41",
            "date": "14 Mar 2025"
        }
    ]
}