{
    "news": [
        {
            "title": "SADC and EAC Heads of State appoint eminent leaders to lead DRC peace process",
            "url": "https://www.herald.co.zw/sadc-and-eac-heads-of-state-appoint-eminent-leaders-to-lead-drc-peace-process/",
            "content": "Online Reporter\n\nSADC and East African Community (EAC)Heads of State and Government have appointed a panel of eminent African leaders to lead the process of finding a resolution to the conflict in eastern Democratic Republic of Congo (DRC).\n\nThe decision was made during a virtual summit held on Monday evening.\n\nThe panel comprises former Nigerian President Olusegun Obasanjo, former Kenyan President Uhuru Kenyatta, former South African President Kgalema Motlanthe, former Central African Republic President Catherine Samba Panza, and former Ethiopian President Sahle-Work Zewde.\n\nAccording to the summits communique, the selection of the facilitators considered regional, gender, and linguistic inclusivity.\n\nTheir mandate includes spearheading diplomatic efforts to end conflict in eastern DRC, engaging relevant stakeholders and supporting the implementation of peace initiatives endorsed by the African Union and the United Nations.\n\nIn addition to appointing the facilitators, the summit directed its co-chairs  President Mnangagwa, who chairs SADC and his Kenyan counterpart, William Ruto, who chairs the EAC  to convene a briefing session within seven days to outline the panels terms of reference.\n\nAlso the SADC and EAC Secretariats have been tasked with informing the facilitators of their appointment and conveying the summits outcomes to the African Union and the UN.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/04/President-Mnangagwa-and-President-Ruto.jpg",
            "description": "Online Reporter SADC and East African Community (EAC)Heads of State and Government have appointed a panel of eminent African leaders to lead the process of finding a resolution to the conflict in eastern Democratic Republic of Congo (DRC). The decision was made during a virtual summit held on Monday evening. The panel comprises former Nigerian […]",
            "time": "09:46",
            "date": "25 Mar 2025"
        },
        {
            "title": "Public officials called to service, excellence",
            "url": "https://www.herald.co.zw/public-officials-called-to-service-excellence/",
            "content": "Wallace Ruzvidzo\n\nHerald Reporter\n\nTHOSE serving in the countrys public sector must resist the temptation of complacency and comfort and never betray the sacred trust and confidence bestowed on Government and other departments by the general citizenry, President Mnangagwa has said.\n\nIn his address at the announcement of the 2024 Performance Evaluation Results and 2025 Performance Signing Ceremony held at State House in Harare yesterday, the President said the Second Republic was committed to achieving an agile, innovative, responsive and resilient governance system, pursuant to delivering what is needed by the general citizenry.\n\nRiding on the current momentum, more reforms will continue to be implemented, guided by global best practice, which takes into account the unique needs and challenges of our country.\n\nThe public sector must resist the temptation of complacency and comfort, he said.\n\nOn that note, President Mnangagwa said it was disappointing that some Government officials were yet to adopt performance contracting, at a time Government continues to roll out results-based management initiatives across the public service spectrum.\n\nIt is disappointing that there are some officials who are yet to acquaint themselves and adopt performance contracting and the formulation of Strategic Plans. Public sector officials are directed to keep up with the ongoing reforms.\n\nOn its part, my Government will continue to roll out sensitisation and training in Results Based Management across the public sector, at all levels.\n\nDigitalisation of performance contracting will also see increased efficiencies within our systems, while benchmarking with best practices remains ongoing.\n\nThe Whole of Government and Society Approach is being strengthened through consultative engagements with grassroots communities and the private sector, as well as bilateral and development partners, he said.\n\nPresident Mnangagwa said officials should never betray the sacred trust and confidence bestowed on Government and other departments by the general citizenry.\n\nThe Second Republics foremost duty, he said, remained to uplift Zimbabweans livelihoods.\n\nWe derived our mandate from the people as they expressed their democratic right by voting our ruling, revolutionary Party, ZANU PF into office.\n\nIn this regard, the various mandates that we are discharging as the public sector, should be reflective of the will of the people of Zimbabwe, and undertaken in their interest.\n\nIndividually and collectively, we all have a duty to empower and uplift many more of our fellow country men and women, the young and the old alike, as well as our boys and girls, out of poverty into prosperity.\n\nLet us, never betray the sacred trust and confidence that the people have entrusted on us and our colossal mass Party.\n\nI urge us all to wholeheartedly serve our country with honest, unflinching patriotism, uttermost professionalism, humility and unquestionable integrity, he said.\n\nPresident Mnangagwa said Governments implementation of performance contracting was one of the reforms geared to ensure that the public sector is market and people-centred.\n\nPerformance contracting, which was introduced in 2021, has had a propelling effect and enabled stakeholders, including ordinary citizens, to assess progress by Ministries, Departments and Agencies (MDAs).\n\nSince its introduction, the system, which has cascaded to Deputy Ministers, has registered notable milestones across all sectors including steady economic growth, introduction of the ZiG, launch of the Presidential Title Deeds Programme and establishment of Village Units, among other initiatives.\n\nUnder the Second Republic, we have committed ourselves to achieve an agile, innovative, responsive and resilient governance system.\n\nThis is underpinned by policy thrusts which include: Thinking Big: Policy entrepreneurship and innovation; Managing for Sustainable Development Results; and Accountability.\n\nMy Government is determined to re-purpose our institutions and systems to remain relevant to current and emerging trends, as we harness present opportunities and grapple with the associated challenges, said the President.\n\nHe said it was therefore critically important that in the final year of the National Development Strategy 1 (NDS1), the implementation of highly impactful programmes and projects is scaled up to leapfrog the countrys quest to attain high-income society status.\n\nI look forward to the overall Outcome Evaluation Report at the end of the 2025 fiscal year. This will allow us to comprehensively and factually ascertain the impact of Performance Contracting on the economy and citizenry as well as afford us insightful lessons for the implementation of National Development Strategy 2, President Mnangagwa said.\n\nThe enactment of the Government and Results Act, he said, was envisaged to consolidate the nexus between public sector performance and accountability for results.\n\nAlignment between planning and budgeting, and enhancing the rewardsand sanctions mechanisms, remain priority areas of focus.\n\nIt is notable that this years Performance Contracts have been extended to Deputy Ministers, Deputy Chief Secretaries, Public Service Commissioners, the Clerk of Parliament and Secretary to the Judicial Service Commission, President Mnangagwa said.\n\nThe President also announced the introduction of Joint Performance Contracts for programmes and projects which will be implemented with effect from next year.\n\nThis should bring traction in the completion of projects, while improving resource allocation and utilisation.\n\nThese interventions equally provide avenues for the incorporation of the private sector and development partners into public sector programming.\n\nI expect that Joint Performance Contracting will be mainstreamed as we formulate National Development Strategy 2, he said.\n\nIn terms of the performance ratings, awards and recommendations, President Mnangagwa said they had enhanced policy and structural responsiveness, while injecting positive competition among MDAs.\n\nSector specific reforms are being instituted across the public sector so that Government is modernised and responsive to the needs of the people.\n\nThis includes reviewing and eliminating some of the overlapping permits and licences being charged by MDAs.\n\nThe streamlining of cumbersome bureaucratic procedures affecting the ease of doing business, is also being prioritised.\n\nWe are determined to comprehensively consolidate and improve on the gains we have realised towards Zimbabwe being an attractive and competitive investment destination, he said.\n\nPresident Mnangagwa said the ongoing reforms within public entities were set to see a turnaround towards greater viability and profitability.\n\nKey to this strategic refocusing was the creation of the Zimbabwes Sovereign Wealth Fund, under the Mutapa Investment Fund, he said.\n\nWith regards to the Devolution and Decentralisation Agenda, the President reiterated that Provinces were expected to emerge as dynamic and competitive economic hubs, with marked growth across all sectors.\n\nMinisters of Provincial Affairs and Devolution are, thus, directed to champion the implementation of people-centred development projects.\n\nMay I emphasise that Ministries, Departments and Agencies and the public sector as a whole, are directed to adopt synchronised, co-ordinated, and results-driven governance frameworks.\n\nUnder my Administration, the public sector succeeds as one united team, chasing one common national vision, for the good of all our people, leaving no one and no place behind, he said.\n\nIn his remarks before introducing the President, Vice President Dr Constantino Chiwenga said the signing of performance contracts had resulted in improved performance.\n\nHe reiterated President Mnangagwas mantra that nyika inovakwa nevene vayo.\n\nOnly through collective effort can we achieve lasting success, VP Chiwenga said.\n\nIn delivering the vote of thanks, Defence Minister Oppah Muchinguri-Kashiri congratulated the award winners and encouraged the rest.\n\nRemember that the performance contracts framework remains the cornerstone of Governments accountability, she said.\n\nEnds\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/dqwdqw-680x380.jpg",
            "description": "Wallace Ruzvidzo Herald Reporter THOSE serving in the country’s public sector must resist the temptation of complacency and comfort and never betray the sacred trust and confidence bestowed on Government and other departments by the general citizenry, President Mnangagwa has said. In his address at the announcement of the 2024 Performance Evaluation Results and 2025 […]",
            "time": "09:46",
            "date": "25 Mar 2025"
        },
        {
            "title": "Mhona comes out tops",
            "url": "https://www.herald.co.zw/mhona-comes-out-tops/",
            "content": "Wallace Ruzvidzo\n\nHerald Reporter\n\nTHE Minister of Transport and Infrastructural Development, Felix Mhona, is the best performing Minister in President Mnangagwas Cabinet for 2024, having been rewarded for his sterling achievements in refurbishing the countrys critical infrastructure including the road network and superintending over a remarkable turnaround of parastatals under his purview.\n\nPresident Mnangagwa yesterday recognised the outstanding achievements of Zimbabwes top-performing Government officials, awarding Ministers, Permanent Secretaries, and heads of other Government departments for their exceptional service at a ceremony at State House in Harare.\n\nThe continuous performance evaluation reinforces the Second Republics commitment to fostering a culture of excellence, work ethic, and servant leadership, aligning with the nations Vision 2030 goal.\n\nPresident Mnangagwa introduced the accountability framework in 2021.\n\nAmong other notable winners at the awards presentation was the Minister of Lands, Agriculture, Water, Fisheries and Rural Development, Dr Anxious Masuka, who was the first runner-up, while former Minister of Public Service, Labour and Social Welfare, who is now the Energy and Power Development Minister, July Moyo, was the second runner-up.\n\nMasvingo Minister of State for Provincial Affairs and Devolution Ezra Chadzamira was the Overall Best Performing Minister of State for Provincial Affairs and Devolution while Matabeleland South Minister Evelyn Ndlovu was runner-up.\n\nAmong Permanent Secretaries, the Best performing was Engineer Joy Makumbe, Secretary for Transport and Infrastructural Development, with Ministry of Lands, Agriculture , Water, Fisheries and Rural Developments Professor Obert Jiri scooping first runner up and Ministry of Womens Affairs, Community, Small and Medium Enterprise Developments Mavis Sibanda taking second runner-up.\n\nAt provincial level, Permanent Secretary for Masvingo Provincial Affairs and Devolution Dr Addmore Pazvakavambwa emerged as the best performer while Permanent Secretary for Midlands Provincial Affairs and Devolution, Dr Edgar Seenza, claimed second place.\n\nAmong Chief Executive Officers for State Owned Enterprises category, Mr Tinotenda Mhiko from the Agriculture and Rural Development Authority (ARDA) took first place, with ZimTrades Mr Allan Majuru taking second place.\n\nNational Building Society (NBS)s Mr Shingai Mutumbwa was the best performing among chairpersons for State Owned Enterprises while Agricultural and Rural Development Authority (ARDA)s Mr Irvin Craig was the first runner-up.\n\nAmong Executive Secretaries of Independent Commissions, the best performer was Zimbabwe Land Commissions Mr Piwai Mawire while Zimbabwe Gender Commission (ZGC)s Virginia Muwanigwa took second place.\n\nIn the Town Clerks for Urban Local Authorities category Dr Lucia Mnkandla of Kwekwe City Council took first place.\n\nIn the Revenue Collecting Authorities category (Board Chairs), ZINARAs Dr George Manyaya was the Best Performing, while ZIMRAs Mr Anthony Mandiwanza was the runner-up.\n\nIn an interview, the Best Performing Minister, Advocate Mhona, said he waselated by the award while pledging to continue delivering for the general citizenry in terms of transport and infrastructure development.\n\nWe have been trying to balance what the electorate is expecting but I am so grateful. We need to continuously engage with the masses of Zimbabwe so that whatever they want in terms of infrastructure, we run and implement, he said.\n\nThe Best Performing Provincial Minister, Minister Chadzamira, dedicated his accolade to the people of Masvingo saying without them, he would not have achieved the feat.\n\nI am very happy, this win is not only for myself but the people of Masvingo and other stakeholders because we were working together to achieve this win as we earmark the US$8 billion provincial economy, he said.\n\nOn his part, Dr Manyaya said the culture of accountability and transparency instilled by President Mnangagwa had seen ZINARA cultivating results hence his award as Best Performing Board Chair.\n\nHe (President Mnangagwa) has been clear about this even the NDS1 says that we must operate accountably and transparently, so this is what we have done as ZINARA. We have good systems, we have been accountable and we have been disbursing to road authorities.\n\nAnd for the first time ever since the inception of ZINARA, we got a clean audit and this is good and we will continue to do that, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/gert-680x380.jpg",
            "description": "Wallace Ruzvidzo Herald Reporter THE Minister of Transport and Infrastructural Development, Felix Mhona, is the best performing Minister in President Mnangagwa’s Cabinet for 2024, having been rewarded for his sterling achievements in refurbishing the country’s critical infrastructure including the road network and superintending over a remarkable turnaround of parastatals under his purview. President Mnangagwa yesterday […]",
            "time": "09:46",
            "date": "25 Mar 2025"
        },
        {
            "title": "Search for lasting DRC peace continues",
            "url": "https://www.herald.co.zw/search-for-lasting-drc-peace-continues/",
            "content": "Zvamaida Murwira\n\nSenior Reporter\n\nHEADS of State and Government from Sadc and the East African Community held a virtual joint summit last night aimed at resolving the conflict in the Eastern Democratic Republic of Congo.\n\nThe joint summit was co-chaired by Sadc Chairperson President Mnangagwa and his East African Community (EAC) counterpart, Kenyan leader President William Ruto.\n\nThe leaders deliberated on measures to end hostilities in the Eastern DRC where government forces and an armed group, M23, are locked in a vicious war.\n\nIn his welcome remarks, President Mnangagwa commended his colleagues, President Ruto and Tanzanian President Dr Samir Suluhu Hassan, the Council of Ministers and secretariat for providing leadership and support in promoting co-operation between both regions in the shared quest for durable peace in the Eastern DRC.\n\nDr Hassan is the Sadc Chairperson of the Organ on Politics, Defence and Security Co-operation.\n\nPresident Mnangagwa said the efforts made in the past between the two blocs had laid a strong foundation for last nights discussions.\n\nSince our last joint summit of 8 February 2025, our technical experts and the Chiefs of Defence convened the meetings to implement the outcomes of our joint summit, he said.\n\nPresident Mnangagwa added that several engagements had yielded commendable success.\n\nWe are, however, deeply concerned that the implementation of our decisions is not proceeding with the urgency they deserve. This is despite the fact that the security situation in the DRC remains fragile, with supply routes, including the Goma and the Bukavu airports, still closed, he said.\n\nThe humanitarian situation in the Eastern DRC remains dire, while armed groups continue to pose a threat to the sovereignty of the country and the stability of our two regions.\n\nThere is, therefore, a need for us to accelerate the implementation of our joint interventions to arrest these worrisome developments. We continue to call for an immediate and unconditional ceasefire, and cessation of hostilities.\n\nYour Excellencies, we have consistently acknowledged that military interventions on their own are not an absolute panacea to the security challenges besetting our sister country. Instead, it is important that we provide impetus to the peace process in line with our decisions.\n\nPresident Mnangagwa said the establishment of a political framework is a crucial enabler for the implementation of critical outstanding outcomes of the previous meetings.\n\nThere is, therefore, need to initiate diplomatic and political engagement to facilitate the withdrawal of Sadc Mission in the DRC (SAMIDRC) troops.\n\nAs we continue to engage, let us remain aware that the successful implementation of our joint efforts is encouraged by our collective resolve and commitment. It is incumbent upon us all, given the weighty responsibilities bestowed upon us, to demonstrate unity of purpose and the political will to deliver tangibleresults for the people of the DRC, hesaid.\n\nPresident Ruto commended DRC President Felix Tshisekedi and Rwandan President Paul Kagame for having a direct engagement aimed at discussing the hostilities in Eastern DRC.\n\nThis followed a meeting held by the two in Qatar, facilitated by that countrys authorities.\n\nAllow me, Excellencies, also to commend and congratulate our two brothers, President Felix Tshisekedi and President Paul Kagame for the face-to-face engagement that they have had in the last few days.\n\nAgain, a clear demonstration on their part that they are equally committed to seeing to it that we resolve the matters in eastern DRC that affect our countries and our region, he said.\n\nPresident Ruto said the situation in Eastern DRC continues to deteriorate.\n\nIt is, therefore, a source of concern, not just for DRC as a country, but all of us in the region, said President Ruto.\n\nHe noted that the conflict had resulted in the loss of life and displacement of people.\n\nAnd therefore, I want to thank all the Heads of State who have demonstrated their commitment by attending this virtual meeting. It is a confirmation that we are all concerned rightfully about the situation in our neighbourhood and all of us are taking steps to deal with that, he said.\n\nFrom the Zimbabwean side, last nights meeting was attended by Foreign Affairs and International Trade Minister Professor Amon Murwira, Defence Minister Oppah Muchinguri-Kashiri, Tourism and Hospitality Industry Minister Barbra Rwodzi, Zimbabwe Defence Forces Commander, General Phillip Valerio Sibanda, and Deputy Chief Secretary in the Office of the President and Cabinet responsible for Presidential Communications, Mr George Charamba.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/President-Mnangagwa.jpg",
            "description": "Zvamaida Murwira Senior Reporter HEADS of State and Government from Sadc and the East African Community held a virtual joint summit last night aimed at resolving the conflict in the Eastern Democratic Republic of Congo. The joint summit was co-chaired by Sadc Chairperson President Mnangagwa and his East African Community (EAC) counterpart, Kenyan leader President […]",
            "time": "09:46",
            "date": "25 Mar 2025"
        },
        {
            "title": "Moral restoration: First Lady meets with boys-only schools to promote discipline, integrity",
            "url": "https://www.herald.co.zw/moral-restoration-first-lady-meets-with-boys-only-schools-to-promote-discipline-integrity/",
            "content": "Tendai Rupapa\n\nSenior Reporter\n\nKEEN to restore morality among learners and mould them into morally upright citizens, First Lady Dr Auxillia Mnangagwa yesterday held a moral restoration programme targeting boys-only schools in Harare where children are allegedly indulging in immoral activities largely due to Western influences as she leaves no place and no one behind in her initiatives.\n\nThe programme, which is modelled around the highly successful Gota/Nhanga/Ixhiba initiative, comes at a time when abuse of social media, bullying, homosexuality, drug and substance abuse, and theft among many other vices have taken root at schools.\n\nThe boys openly mentioned these vices happening in schools.\n\nIt also came to light during the programme that boarders and day scholars at various institutions have reportedly forged toxic alliances in which the latter smuggle cell phones and drugs which are not permitted, into schoolyards.\n\nThe learners are also mixing cereals and cordial drinks and letting them ferment into highly potent brews which they then drink and get intoxicated at the expense of their studies.\n\nChief Misheck Njelele from Midlands taught boys on the traditional values and norms, expectations and acceptable behaviour among boys and men during a Gota programme organised by First Lady Dr Auxillia Mnangagwa in Harare yesterday\n\nOn the other hand, some are consuming social media content that does not bode well with their studies.\n\nThe students also revealed that some of their peers in boarding were evading school security and scaling over the security fence at night to go to nightclubs.\n\nUnnoticed they would sneak back into school, intoxicated.\n\nAmai Mnangagwa said she would also engage with girls from girls-only schools.\n\nThere are reports that at girls-only schools, some learners are cutting their school dresses into unsightly short dresses and skirts that set typical examples of how never to dress.\n\nWhile the mother of the nation, who has a passion for the welfare of children, has in the past been interacting with learners at core education schools, she felt those in single-sex schools were a large constituency that deserved her attention too.\n\nAllan Wilson boys high school perform their war cry during the Gota programme organised by First Lady Dr Auxillia Mnangagwa at Prince Edward Boys High school in Harare yesterday\n\nLearners at whatever level, the First Lady often remarks, need to do away with activities that restrain them from focusing on education leading to social and economic challenges in the future.\n\nIn light of this, yesterday Dr Mnangagwa sat down with learners from boys-only private and Government schools where a wide range of discussions took place.\n\nSome of the schools that attended include Allan Wilson, Churchill Boys High, Prince Edward, Oriel Boys, Ellis Robins and Cranborne Boys High.\n\nAmai Mnangagwa said Zimbabwe has a rich cultural heritage with in-built mechanisms to fight juvenile delinquency among other social ills.\n\nShe then invited traditional chiefs who are the custodians of the countrys culture and heritage to speak to the boys.\n\nChurch pastors and a media guru, were also part of the speakers brought by the First Lady.\n\nDr Mnangagwas aim is to mould boys into responsible men by providing them with wise counsel.\n\nIt is a profound sense of responsibility that I stand before you today at this unique gathering of young men representing the potential of our nation. Today, I wish to speak to you directly, young men, about the bedrock upon which our nation is built, that is integrity, virtue and the indispensable role of discipline in shaping your future and indeed the future of Zimbabwe. As I look at your faces, I see future doctors, engineers, teachers, entrepreneurs, and leaders of tomorrow. You are the inheritors of a rich and vibrant culture, a tapestry woven with the threads of our history, traditions, and values.\n\nThis heritage is not a relic of the past. It is a living, breathing force that shapes our present and guides our future, she said.\n\nChief James, Kurauone Mutasa from Manicaland taught boys traditional values and norms, expectations and acceptable behaviour among boys and men during a Gota programme organised by First Lady Dr Auxillia Mnangagwa in Harare yesterday\n\nShe said culture was the framework that detects moral purpose, informs relationships and defines peoples sense of belonging.\n\nIt is the language we speak, the stories we tell, the values we uphold, and the respect we show for our elders and our community. Our culture emphasises the importance of Ubuntu, that profound sense of interconnectedness.\n\nThe belief that I am because we are, it teaches us compassion, empathy and the value of collective responsibility. It encourages us to be mindful of our actions and their impact on those around us. In a world that is globalised, it is easy to lose sight of our cultural identity.\n\nHowever, it is precisely in these times that we must hold fast to our cultural heritage. It is our anchor, our compass and our source of strength. I urge you, young man, to embrace your culture with pride, the First Lady said.\n\nAs young men, Dr Mnangagwa said, they have the opportunity to cultivate virtue in their lives.\n\nBe kind to others, be compassionate to those in need and be courageous in standing up for what is right. Strive to be the best version of yourselves and to make a positive impact on the world around you. Cultural integrity and virtue are essential building blocks, but they are not enough on their own. To realize our full potential, we must also cultivate discipline which is the ability to control your impulses, to focus your attention and to persevere in the face of challenges. It is the bridge that connects your aspirations to your achievements. While it is natural to be interested in relationships, I want to caution you against pursuing romantic relationships too early for this can lead to early marriages which have challenges. If you marry at your age, how do you take care of the wife and children when you have no skill to earn a living? You are still children yourselves, being looked after by your own parents. You need to wait until the right time.\n\nFor now, concentrate on education and personal development for you have big opportunities ahead of you, she said.\n\nOne of the boys share his views on the abuse of social media platforms among his peers during the Gota programme organised by First Lady Dr Auxillia Mnangagwa at Prince Edward Boys High school in Harare yesterday\n\nShe said discipline was the key to unlocking potential in achieving ones goals and dreams.\n\nWhile technology offers immense opportunities for progress and development, the First Lady said it also presents unique challenges to culture and values.\n\nThe misuse of technology, particularly social media and the Internet, can erode our cultural norms, promote harmful behaviours, and distract us from our goals. Technology can be a powerful tool for communication, education, and innovation but it can also be a source of social isolation. The anonymity of the internet can embolden individuals to engage in behaviours that they would never consider in the real world. We must be mindful of the potential dangers of technology and use it responsibly. Be critical of the information you encounter online, protect your privacy, and avoid engaging in cyberbullying or other harmful behaviours. Use technology to connect with others in a meaningful way to learn new skills, and to contribute to the betterment of society.\n\nFurthermore, we must be wary in protecting our cultural norms from the effects of technology, the values of respect, integrity, and responsibility must guide our online interactions as much as they do our offline interactions.\n\nLet us use technology to strengthen our culture, not to undermine it, she said.\n\nThe mother of the nation said she was deeply concerned about the rising tide of drug abuse among young people.\n\nThe misuse of drugs, including the dangerous practice of brewing homemade concoctions from food items poses a grave threat to your health, your future, and the well-being of our nation.\n\nDrug abuse can lead to addiction, mental health problems, academic failure, and even death. It can destroy families, shatter dreams and cripple communities. It is a scourge that we must fight with all our might.\n\nI understand that peer pressure, stress and boredom can contribute to drug abuse but I urge you, my children, to resist the temptation to experiment with the drugs. Seek help from your teachers, counsellors, family members, or other trusted adults. Young men, you are the future leaders of Zimbabwe. The choices you make today will shape the future of our country. I urge you to embrace your cultural heritage, cultivate integrity and virtue, and embrace discipline. Avoid drug abuse, and support your friends who may be at risk. Believe in yourselves, believe in your potential, and believe in the power of your dreams. Strive to be the best version of yourselves, and to make a positive impact on the world around you, she said.\n\nChief Chinamhora from Mashonaland East taught boys traditional values and norms, expectations and acceptable behaviour among boys and men during a Gota programme organised by First Lady Dr Auxillia Mnangagwa in Harare yesterday\n\nVana vangu mandiudzamisikanzwa iri kuitwa nevamwe in schools zvinova zvisina kunaka. Parents are working flat out to give you a decent education. Where is mischief now coming from, whose child is taking drugs and bullying others, is it peer pressure? Ko hunhu maisepi, hunhu hausiiwe kumba muchienda kuboarding school, unofamba nawo. Upper grades bully lower grades, stealing their food and forcing them to do chores for you, this is not right. As parents, we are looking up to you kuti muzotichengeta remangwana and carry the family name forward. Choose your friends wisely, friends that push you to study hard and do good. We say no to bad behaviour. I am happy that our traditional chiefs and church pastors are here to also talk to you. What you learnt today ngaive mbuva yako yemangwana. Some of you might get scholarships to go study abroad kusina vabereki venyu, these teachings will help you wherever you go.\n\nEvangelist Nelly Gwatidzo touched on the boy child.\n\nWhat is a boy child, do you know your identity and your roles as a boy child? Do you know that you are the father of tomorrow? The foundation is laid today. If you start wearing three trousers at once when you are still in school, when you become a father unenge wakutofamba wakapfeka wardrobe yese ka, this is not good, lay your tomorrows foundation today and become a responsible man in the future. You also shape your future through prayers. When in boarding schools, are you praying? Prayer is the answer to everything, she said.\n\nZimbabwe Prisons and Correctional Service Chaplain, Christine Phiri, lit up the event with her humorous presentation.\n\nShe said if the boys failed to learn to control their feelings and emotions at this stage, they would end up as her guests in prison.\n\nA disciplined boy knows when to control himself and to wait for the right time.\n\nIf you fail to control your feelings after seeing a girl and end up raping her, rinodoka takudya newe sadza kujeri kwandinoshanda. It is normal to have a love relationship when you are mature not to have love relationships when you are still in school and relying on parents for underwear and a pair of socks, she said.\n\nShe further spoke against young boys who are dating older women.\n\nPrince Edward Boys High School Herdboy Chauke Academy shares his views on some of the immoral activities happening in schools during an interactive gota session organised by First Lady Dr Auxillia Mnangagwa in Harare yesterday\n\nOthers are dating older women and become maBen 10. Be like Joseph in the bible who resisted the temptation of Potiphars wife. Amai these children, who are dating older women, are taking drugs like Viagra to match the older womans energy.Amai said you are the future leaders, how can you become a leader when you are always drunk and high. Dont be pressured to take drugs by friends, say no to peer pressure.\n\nYou are calling yourselves boys dzedrip, walking around with dropped trousers. Do you know that the sagging of pants originated from prisons in Western countries as a sign of sexual availability by homosexuals? Amai is saying do not copy everything that you see on social media, she said.\n\nChaplain Phiri shared the story of her life saying she was once a drunkard before Grace located her.\n\nShe urged the boys to stay away from drugs and to resist the temptation.\n\nHerald Editor Victoria Ruzvidzo touched on the good and bad side of social media.\n\nShe paid tribute to the First Lady for her life teachings.\n\nToday I am going to talk about the two sides of social media and technology. The good and the bad side. We are now living in a global village due to technology. Let us talk about all the platforms under social media.\n\nWhat are the advantages of using social media? she asked.\n\nChief Chikwaka (Mr Witness Bungu) from Mashonaland East taught boys traditional values and norms, expectations and acceptable behaviour and roles among boys and men during a Gota programme organised by First Lady Dr Auxillia Mnangagwa in Harare yesterday\n\nThe boys gave many benefits of social media saying through social media they can do online lessons, follow current affairs and what is happening around the world, and that it can be used for educational research.\n\nMrs Ruzvidzo concurred with them saying a person can do progressive things on social media.\n\nBut with all these good things, it also has a bad side. Social media yakaipirei?\n\nThe boys pointed at cyberbullying, getting influenced by external forces, promoting drug abuse, and violence, and adopting other cultures like homosexuality hence, losing ones identity in the process.\n\nOne of the boys openly said some boys were practicing homosexuality in boarding schools.\n\nSome of the problems that we are facing in schools currently are that of homosexuality. Some of us no longer feel comfortable because someone will be pestering us for a homosexual relationship. It affects studies. My peers, you know exactly whats happening in our toilets, he said.\n\nAnother one revealed that some students were sneaking out, going to clubs, and bringing drugs into schoolyards.\n\nAnother student had wise words for his peers, We have to remember where we come from, who we are as Zimbabwe. We are now losing our identity because of social media. There are certain values that we are supposed to present at all times. Like what Amai said, we have to be disciplined for us to be successful in the future, she said\n\nOne of the boys share his views on homosexuality among some of his peers during the Gota programme organised by First Lady Dr Auxillia Mnangagwa at Prince Edward Boys High school in Harare yesterday.  Pictures: John Manzongo\n\nChief Chikwaka weighed in saying; These children are our future. The parents are facing a lot of problems from these children. As parents we want the best for our children that is why we send them to school. Instead of using that opportunity to study and build their future, they engage in a lot of vices.You are abusing drugs and substances, which is very bad. You are destroying your future. Some of the teachers are also accomplices in that they are the ones who bring drugs for the children. You should stop that forthwith. Lets ensure that our children stay away from drugs and other vices and encourage them to work hard in school. Our children, you are the future leaders, but we cant have leaders who are always high on drugs. The bad things that you do today will hurt your future. We want you to be well-behaved boys who will be good fathers tomorrow. You have told us that some of you are now engaging in homosexuality which is a terrible sin. Its so disgusting and its unZimbabwean. Stop it forthwith. Aspire to become professionals, and create good names for yourselves. As children, you should not abuse your rights muchiramba kuterera vabereki nemateacher hiding under the guise of rights. As traditional leaders, we are pleading with the relevant authorities to re-look on the issue of disciplining children. Isu takakura tichirohwa kwete zvekuurayiwa but for purposes of discipline, he said.\n\nChief Mutasa said mischief by boys starts from the adolescent stage where they start experimenting with things meant for adults.\n\nAs chiefs, we are the custodians of culture and heritage especially on family values, therefore, we are there to place you on the correct path. During our days we would go swimming with girls and nothing would happen but these days it is a different story. Young boys, even 14-year-olds, are now sexually active. Wait until the time is right, he said.\n\nChief Njelele said the way todays youths are doing things was worrisome.\n\nHe partly blamed parents for the childrens mischief saying they no longer have time with their children with some even asking their children to light up a cigarette for them. Chief Chinamhora also had teachings for the boys.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/fll1-680x380.jpg",
            "description": "Tendai Rupapa Senior Reporter KEEN to restore morality among learners and mould them into morally upright citizens, First Lady Dr Auxillia Mnangagwa yesterday held a moral restoration programme targeting boys-only schools in Harare where children are allegedly indulging in immoral activities largely due to Western influences as she leaves no place and no one behind […]",
            "time": "09:46",
            "date": "25 Mar 2025"
        },
        {
            "title": "Editorial Comment: Licensed gambling  needs stricter controls",
            "url": "https://www.herald.co.zw/editorial-comment-licensed-gambling-needs-stricter-controls/",
            "content": "THE proliferation of betting shops across urban Zimbabwe, not only in city and town centres but these days even in suburban shopping centres, where entertainment seems centred on bottle stores, bars and gambling shops, is a cause for concern.\n\nThe Lotteries and Gaming Board is responsible for licensing all betting shops and legal betting and can enforce minimum standards.\n\nAs against those who complain about the explosion in the number of betting shops, and the damage being done to individuals, families and communities, there are others who note that gambling was always ubiquitous and the main difference these days is that most is now out in the open and regulated, at least to a degree.\n\nAt the same time, without legal outlets, online gambling and other external and unregulated gambling would be far worse, so the local licensing can be seen as the lesser of evils by those who oppose gambling.\n\nColonial Zimbabwe was fairly puritanical about gambling, at least officially. Betting on horse races was legal from the beginning of the colonial rule, the argument being it was not a game of chance but required and rewarded knowledge of form and breeding and thus was a game of skill. At the same time a law was passed banning lotteries.\n\nIn 1934, growing pressure saw a curious test of acceptability. All registered voters were sent a questionnaire through the post by the Government statistician to see if they agreed to a state lottery.\n\nTechnically it was not a referendum that the opposition was promising if it won an election, but was regarded as such.\n\nThe colonial voters wanted a lottery, so they got one.\n\nExcept for charity raffles by non-commercial entities such as churches or schools, and they had to give physical prizes not money and in any case needed special approval, other gambling besides the lottery and horse racing were banned.\n\nA small opening came during UDI when tourist resorts in Victoria Falls, Kariba and Nyanga were allowed a tightly controlled casino each.\n\nThe net result was a huge horse racing industry and because South African law was similarly restrictive, there was horse racing in a major South African city almost every day of the week, and bookmakers would take bets on these races and the turf clubs in Zimbabwe would run totes on two weekday sets of racing as well as the Saturday Borrowdale races.\n\nIt was not difficult to lose a lot of money.\n\nThis was the position that the new Government found after independence.\n\nIt maintained the very tight control and the restriction for legal gambling to the horses and the State Lottery.\n\nBut from the 1990s technology started making this difficult. It started with swipe cards and lottos in other countries and then the whole electronic offering now available.\n\nSensibly, the Government, even at the risk and then the certainty of the loss of the State Lottery and its support for education, arts and sport in Zimbabwe, and the loss of most horse racing, decided it would be better to accept and control the flood of new gambling rather than have a totally unenforceable ban.\n\nConsidering the alternative, of secretive gambling dens cheating and robbing customers as someone with a computer and modem connected to the internet, the decision made a lot of sense, but it still leaves the huge social problems.\n\nAs Zimbabwe is an open society, generally people are allowed to ruin their lives if they insist.\n\nThey can drink, smoke and gamble and they do, although there is an enforced dividing line between those under and over 18 with as much protection as possible offered to children.\n\nThe supporters of State-regulated gambling are correct that things would be a lot worse if it all went underground, but at the same time there perhaps needs to be more care in the licensing, where the Ministry of Home Affairs and Cultural Heritage is more concerned about whether a licence-holder will obey the rules rather than downstream effects.\n\nFor a start, there appear to be good grounds for not licensing gambling in residential suburbs.\n\nThis is not really an industry suitable for much devolution and should perhaps be confined to well-demarcated parts of cities and towns.\n\nThis would also make it easier to ensure that children are not involved and that it is seen less as a social occasion.\n\nIt might make it less attractive, but then that would be half the point.\n\nSecondly we need the education, starting off with the sort of warnings we already find on cigarette boxes and bottles of alcoholic drinks.\n\nMoney can be made in gambling, but by the licence holders and business owners.\n\nTheir customers are betting against the odds and will, over time, lose even if they get the odd spurt of cash.\n\nSome work is being done to help those who have become addicted to gambling, and have lost everything and even gone to jail after stealing money to feed their addiction, but we need to probably do more to help others pick up the pieces.\n\nSo we agree with the policy that it is better to control and regulate, rather than ban, but would want to see this legal gambling moved out of residential areas, be subjected to enforced warnings and with more backing for those who are faced with total disaster in their lives.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/02/soccer-betting.jpg",
            "description": "THE proliferation of betting shops across urban Zimbabwe, not only in city and town centres but these days even in suburban shopping centres, where entertainment seems centred on bottle stores, bars and gambling shops, is a cause for concern. The Lotteries and Gaming Board is responsible for licensing all betting shops and legal betting and […]",
            "time": "09:46",
            "date": "25 Mar 2025"
        },
        {
            "title": "Broadcaster puts life story on paper",
            "url": "https://www.herald.co.zw/broadcaster-puts-life-story-on-paper/",
            "content": "Trust Khosa\n\nWRITING an autobiography requires immense bravery, a clear conscience and a significant investment of time.\n\nThese personal narratives often stir debate and expose the author to public scrutiny.\n\nYet, they have the power to evoke a range of emotions, from laughter to tears, providing readers with priceless moments.\n\nSuch works become even more engaging when authored by prominent public figures we admire. One such individual is Tendayi Jennifer Chakanyuka, who has bravely shared her journey as a broadcaster, mother and living legend.\n\nShe recently published her first book, titled; The Sweet Thaaang . . . Its An Attitude.\n\nThis launch, coinciding with the height of Womens Month celebrations, is not just a reflection of her life; it serves as a powerful commentary on womens issues that require urgent attention.\n\nFrom her rebellious childhood to her experiences with love and her advocacy for womens rights, Chakanyuka encapsulates it all in her autobiography, now available on bookshelves.\n\nHer editor, Phillip Chidavaenzi, along with her mentor, Joyce Jenje-Makwenda  who encouraged Chakanyuka to write more  describes this book as a remarkable triumph.\n\nFellow broadcaster, Tich Mataz who officiated at the launch could not hide his elation as Chakanyuka nailed it in the book worth the wait.\n\nIt was a seven-year wait from Chakanyuka, who also took the opportunity to explain her moniker, The Sweet Thaaang, which kept many people guessing over the years.\n\nThis powerful memoir evokes a spectrum of emotions, making readers laugh, feel anger, and even shed tears.\n\nChakanyuka writes with deep passion, sharing her journey as a daughter, sister, and mother who has endured immense challenges in her pursuit of justice.\n\nIn all her 14 chapters, Chakanyuka tackled several issues. These range from her upbringing at Makumbi Mission (now Visitation) and life at St Johns Emerald Hill to Nagle House in Marondera, where she completed her Advanced Level studies.\n\nHer time at Harare Polytechnic, where she studied Mass Communication, and her experiences at the Zimbabwe Broadcasting Corporation are also addressed in this book.\n\nThere is something spiritual and fulfilling about this book, as Chakanyuka poured out her heart. She recounted her past experiences in a manner that leaves readers yearning for the next chapter. Once you start reading it, you will find yourself easily flipping to the next page.\n\nHer imagery, powerful song-writing technique, and overall narration of events are exceptional. The input of her editor, Chidavaenzi, is strongly felt by those who have read his works. It was a combination of two great minds who collaborated to create an impressive book.\n\nIn her own narration, Chakanyuka recalled how she came up with the idea to write this book.\n\nThe dream was birthed seven years ago; that is when I started. The experience was therapeutic. Its about my journey as a broadcaster and how I was inspired by the likes of Eunice Goto.\n\nI have always loved radio, and thats why I ended up working as a broadcaster over the years. I worked hard to be where I am today, despite my poor start, she recalled. She also praised her editor, Chidavaenzi, for his patience.\n\nI would like to thank Mr Chidavaenzi for his patience in the making of this book. It was not easy to come up with this book, but he took his time editing the scripts. There are many people who helped me throughout the process of creating this book, including my family.\n\nChidavaenzi commended Chakanyuka for sacrificing her time to write the book.\n\nHe noted that she is following new trends where journalists share their stories by writing books.\n\nIf you look at global trends, journalists are beginning to write books, which is quite encouraging. Its also quite encouraging that this is beginning to happen in Zimbabwe, he stressed.\n\nChidavaenzi revealed that it is not easy to work with authors.\n\nChakanyuka is certainly not an easy person to work with, but we have managed to complete this book.\n\nAs you know, some authors have a tendency to drop their projects, and whether you are going to do rewrites or simply edit is another issue. All they want is to see their books edited and published, he said.\n\nChidavaenzi lauded Chakanyuka for her bravery in writing her memoir. It takes a lot of bravery to write a biography open to public scrutiny. She did not sanitise her experiences as a writer; there are priceless life lessons in her book.\n\nFormer workmate Leander Kandiero described Chakanyukas initiative as historic.\n\nHistory is made in many interesting ways. I had the opportunity to work with her, and we also attended the same school at St Johns Emerald Hill.\n\nWe met at ZBC, where I had the chance to host a breakfast show with her, and today we are here together as she launches her book. She volunteered to be my mentor, and I can safely say congratulations on this achievement, he narrated.\n\nSimilar sentiments were echoed by Jenje-Makwenda, who encouraged her to write more books.\n\nOf course, I have written many books over the years, and this book is about her character. She didnt sugar-coat anything; she wrote about who she is. She also addressed the abuse women in the media face in this book, she explained.\n\nJenje-Makwenda also stressed how powerful biographies can be when written with passion, as is the case with Chakanyuka.\n\nShe didnt dilute anything in her quest to win the hearts of readers.\n\nIts a book one can read over and over again, as she shared some of the priceless moments in life. To say she nailed it would be an understatement.\n\nPerhaps the term magical aptly describes this prolific work of literary art.\n\nIts a book worth the wait and purchasing.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Untitled-37-1-680x380.jpg",
            "description": "Trust Khosa WRITING an autobiography requires immense bravery, a clear conscience and a significant investment of time. These personal narratives often stir debate and expose the author to public scrutiny. Yet, they have the power to evoke a range of emotions, from laughter to tears, providing readers with priceless moments. Such works become even more […]",
            "time": "09:46",
            "date": "25 Mar 2025"
        },
        {
            "title": "Mutasa vows MWOS no pushovers",
            "url": "https://www.herald.co.zw/mutasa-vows-mwos-no-pushovers/",
            "content": "Eddie Chikamhi\n\nZimpapers Sports Hub\n\nVETERAN coach Lloyd Mutasa says MWOS are in the Premier Soccer League to stay, after the debutants made an explosive start to life in the topflight.\n\nThe Norton-based side, nicknamed The Punters, shocked many by topping the log standings when the league paused for the FIFA international break last week.\n\nMutasa, whose team beat giants Highlanders, edged Yadah, and drew against Bikita Minerals, said the strong start exceeded expectations.\n\nIm very impressed with the take-off  seven points out of a possible nine and leading the table going into the FIFA break, said Mutasa.\n\nIts something we hadnt anticipated in our debut season.\n\nHowever, its still early days. Weve only played three games, so we must keep our feet on the ground and make it a habit to collect as many points as possible.\n\nThe main goal from the club leadership is to survive relegation and stay in the league in our firstseason.\n\nMWOS earned their spot in the topflight after acquiring the ZPC Hwange franchise, following the power utilitys decision to withdraw from the league  they already have another team, ZPC Kariba, in the Premiership.\n\nThis came after MWOS narrowly lost the promotion race to Scottland, who also earned a ticket to the PSL and will likely renew rivalries with the Norton side at the top level.\n\nI told the boys we had been itching for a place in the Premiership and through Gods grace, it finally happened, said Mutasa.\n\nOpportunities like this dont come often, so we need to seize the moment and show the local football community that we belong at this level.\n\nMWOS bolstered their squad with a mix of topflight experience and youthful energy.\n\nThey retained nearly half of last seasons squad and added key signings such as Warriors goalkeeper Martin Mapisa, Billy Veremu, Claude Mapoka, Innocent Zambezi, and Ghanaian winger Wilson Mensah.\n\nWe identified key areas to strengthen and brought in experienced players like Martin Mapisa and Francis Tizayi because the goalkeeping department is very important, said Mutasa.\n\nWe also reinforced all departments to make sure every position has players with Premiership experience, while maintaining a good blend of youth and experience.\n\nMutasa said the international break came at a good time for his team, giving them a chance to reset after a tough opening stretch and to nurse injuries.\n\nWe used the break to refocus and consolidate our gains. It was also important to refresh our legs after gruelling fixtures at the start of the season.\n\nNow we look forward to being on the road again for our next game against FC Platinum at Mandava this weekend.\n\nIts going to be a tough outing, but the break also allowed some of our injured players, like Claude Mapoka, to recover.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/MWOS-FC-680x380.jpg",
            "description": "Eddie Chikamhi Zimpapers Sports Hub VETERAN coach Lloyd Mutasa says MWOS are in the Premier Soccer League to stay, after the debutants made an explosive start to life in the topflight. The Norton-based side, nicknamed “The Punters”, shocked many by topping the log standings when the league paused for the FIFA international break last week. […]",
            "time": "09:46",
            "date": "25 Mar 2025"
        },
        {
            "title": "TB in mining sector demands urgent action",
            "url": "https://www.herald.co.zw/tb-in-mining-sector-demands-urgent-action/",
            "content": "Rumbidzayi Zinyuke\n\nHealth Buzz\n\nMining is a cornerstone of the Zimbabwean economy, contributing significantly to the countrys GDP and providing livelihoods for thousands of workers.\n\nHowever, beneath the surface of this vital industry lies a silent and deadly crisis: tuberculosis (TB).\n\nMiners, who often work in hazardous conditions with limited access to healthcare, are disproportionately affected by TB.\n\nGlobally, TB remains one of the top infectious disease killers, with an estimated 10,6 million people falling ill and 1,3 million dying from the disease in 2022, according to the World Health Organisation (WHO).\n\nYesterday, as the world commemorated the World TB Day, it became important to highlight how miners are affected by this ancient disease.\n\nThe mining sector is particularly vulnerable, with miners facing the risk of contracting TB that is up to four times higher than the general population.\n\nThis is due to a combination of factors.\n\nIn sub-Saharan Africa, the region most affected by TB, the mining industry has been identified as a hotspot for the disease.\n\nIn Southern Africa, it is estimated that 89 percent of mineworkers have latent TB infection.\n\nMain factors that contribute to the higher risk of TB among mineworkers include exposure to silica dust, crowded living and working conditions with inadequate ventilation, high incidence of silicosis and HIV/TB co-infection among others.\n\nSilicosis, resulting from exposure to silica dust in the mines, is a chronic condition for which no treatment is available, it contributes to mineworkers susceptibility to TB infection and recurrence post-employment.\n\nThus, the TB epidemic in the mining sector affects not only current workers, but ex-mineworkers several years after leaving the mines, posing the challenge of providing post- employment occupational health services and support.\n\nThis disparity underscores the need for targeted interventions in the mining sector.\n\nZimbabwe, with its rich mineral resources, relies heavily on mining for economic growth.\n\nThe sector accounts for over 60 percent of the countrys export earnings and employs approximately 10 percent of the formal workforce.\n\nNumerous other workers are in the informal sector as they work as artisanal miners.\n\nHowever, the health and well-being of miners are often overlooked, leaving them vulnerable to TB and other occupational diseases.\n\nZimbabwe has one of the highest TB prevalence rates in the world, with an estimated 233 cases per 100 000 people.\n\nDespite these staggering numbers, many cases go undiagnosed or untreated due to a lack of awareness, stigma, and inadequate healthcare infrastructure.\n\nTB disproportionately affects working-age adults, leading to lost productivity and increased healthcare costs.\n\nIt, therefore, becomes important to increase awareness and improve health seeking behaviours among these miners.\n\nRaising awareness about TB in the mining sector is crucial for several reasons.\n\nIt promotes early detection and treatment because many miners are unaware of the symptoms of TB or fear the stigma associated with the disease, leading to delayed diagnosis and treatment.\n\nEarly detection is key to improving outcomes and reducing transmission.\n\nMiners are often exposed to silica dust, which not only increases the risk of TB but also causes silicosis, a debilitating lung disease.\n\nRaising awareness can drive demand for better working conditions and protective measures.\n\nThe availability of occupational health services and skilled occupational health professionals in the region is limited.\n\nThe public health sector in most countries has insufficient capacity to address the complex health needs of mineworkers and ex-mineworkers.\n\nWhile larger mining companies provide health services for their employees, smaller mining operations often rely on the public health sector.\n\nFurthermore, mining companies have no system for providing occupational health services to ex-mineworkers and their families post-employment.\n\nAlthough ex-mineworkers are entitled to compensation for occupational related illnesses, access to these funds requires routine screening and assessment, few facilities in the region are equipped to provide these screenings which effectively denies ex-mineworkers access to compensation for themselves and their families.\n\nThe lack of harmonisation of regional policies regarding dust control and standardisation of mining health and safety also complicate regulatory monitoring and compliance.\n\nBy addressing TB in the mining sector, Zimbabwe can protect its workforce and sustain economic growth. The mining sector is a hub for TB transmission, with miners often carrying the disease back to their communities.\n\nTackling TB in mines is therefore essential for controlling the broader epidemic.\n\nTo address this crisis, a multi-faceted approach is needed. Governments, mining companies, and international organisations must work together to improve access to healthcare, implement occupational health and safety standards, and raise awareness about TB.\n\nInitiatives such as regular health screenings, education campaigns, and the provision of protective equipment can make a significant difference.\n\nThis year, as the world marks World TB Day, African governments, including Zimbabwe, must prioritise TB in mining as a critical public health issue.\n\nThe mining sector, which fuels economies across the continent, has long been a breeding ground for TB so governments must implement targeted TB screening and treatment programmes for miners, enforce stringent workplace safety regulations, and ensure adequate healthcare infrastructure in mining communities.\n\nZimbabwe, where mining is a key economic driver, must take the lead in addressing this crisis.\n\nA national strategy on TB in mining, with collaboration between the government, mining companies, and health organisations should be at the forefront of public health policy.\n\nIncreased investment in TB prevention and treatment will not only save lives but also protect the workforce that sustains the mining industry and, by extension, the nations economy. On this World TB Day, it is important to demand urgent action.\n\nTo push for policies that make TB prevention and treatment in mining a top priority.\n\nThe fight against TB cannot be won with words alone, it requires political will, corporate responsibility, and sustained investment in healthcare.\n\nBy shining a light on this hidden crisis, lives can be saved, livelihoods can be protected thus ensuring that mining remains a pillar of sustainable and responsible development in Africa.\n\nFeedback:[emailprotected]\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/sdfwefewf-680x380.jpg",
            "description": "Rumbidzayi Zinyuke Health Buzz Mining is a cornerstone of the Zimbabwean economy, contributing significantly to the country’s GDP and providing livelihoods for thousands of workers. However, beneath the surface of this vital industry lies a silent and deadly crisis: tuberculosis (TB). Miners, who often work in hazardous conditions with limited access to healthcare, are disproportionately […]",
            "time": "09:46",
            "date": "25 Mar 2025"
        },
        {
            "title": "Job offers turn into nightmares",
            "url": "https://www.herald.co.zw/job-offers-turn-into-nightmares/",
            "content": "Yeukai Karengezeka\n\nCourt Correspondent\n\nA MAN and a woman from Harare appeared in court yesterday accused of orchestrating a months-long crime spree in which they allegedly lured job-seeking women with promises of employment, only to rob and rape them.\n\nAleck Kanyonzo (42) and Tendai Tabazha (42) have been charged with multiple counts of rape and robbery after eight women, aged between 19 and 42, came forward with harrowing accounts of deception and violence.\n\nAccording to prosecutors, Tabazha would approach women in public places, offering them jobs as housemaids or shop assistants.\n\nOnce the victims expressed interest, she collected their contact details and arranged meetings.\n\nKanyonzo would then pick them up under the guise of taking them to work.\n\nInstead, he allegedly drove them to isolated areas near Lake Chivero farms, where he would draw a knife, threaten them, and sexually assault them before stealing their belongingsincluding phones, clothes, and cash.\n\nThe crimes reportedly spanned from January 2024 to March 2025, with each victim targeted on a different day. The stolen items were allegedly handed to Tabazha, who sold them and split the profits with Kanyonzo and a third accomplice still at large.\n\nThe scheme unravelled on March 20, when Tabazha approached a 23-year-old womans relative, offering a shopkeeper job.\n\nThough the relative declined, she shared the victims contact details.\n\nThe next day, the victim met Tabazha at Machipisa Shopping Centre, where Kanyonzo took over, escorting her onto a commuter omnibus.\n\nInstead of a workplace, he led her to a secluded area, where he allegedly raped her three times at knifepoint and stole her phone and bag.\n\nAfter the assault, the traumatised victim stumbled upon passersby, who helped track down Kanyonzo. He was caught with her stolen phone and clothes.\n\nWhen the pair appeared before Harare Magistrate Marehwanazvo Gofa, they were advised to seek bail at the High Court due to the severity of the charges. They will return to court on April 8 as investigations continue.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/armed-robbers-used-gun-robbery-260nw-1495712093.jpeg",
            "description": "Yeukai Karengezeka Court Correspondent A MAN and a woman from Harare appeared in court yesterday accused of orchestrating a months-long crime spree in which they allegedly lured job-seeking women with promises of employment, only to rob and rape them. Aleck Kanyonzo (42) and Tendai Tabazha (42) have been charged with multiple counts of rape and […]",
            "time": "09:46",
            "date": "25 Mar 2025"
        }
    ]
}