{
    "news": [
        {
            "title": "Security forces on high alert . . . Concern over foreign hand in illegal protests",
            "url": "https://www.herald.co.zw/security-forces-on-high-alert-concern-over-foreign-hand-in-illegal-protests/",
            "content": "Herald Reporters\n\nSECURITY forces stand ready to handle any disturbances and the Government remains resolutely committed to national stability, the Minister of State for National Security, Lovemore Matuke, has said.\n\nAddressing citizens in Gutu South yesterday, Minister Matuke warned against any actions threatening public order and potential disruptions by agitators, emphasising that protecting citizens safety remained the Governments top priority, with all necessary measures implemented to ensure communities remained secure and daily activities continue uninterrupted.\n\nAt the same time, the Zimbabwe Republic Police confirmed comprehensive nationwide deployments to maintain public safety.\n\nI want to assure every citizen that your security is our top priority. Comprehensive measures are in place to safeguard our society. Our security forces are well-prepared to handle any potential disruptions while ensuring that people going about their daily business are respected and protected, said Minister Matuke.\n\nMinister Matuke\n\nWhile acknowledging citizens right to lawful protest, the minister firmly opposed any actions endangering public safety.\n\nIn the spirit of promoting calm and resilience, I encourage all citizens to continue with their daily business as usual. There is no need for undue anxiety or panic, he said.\n\nWe must collectively focus on our national priorities that enhance welfare and progress, rather than be distracted by rogue elements.\n\nThe minister warned that security forces would respond decisively to any threats posed by malcontents.\n\nOur security apparatus is equipped to handle the situation, and anyone attempting to incite violence or chaos will be dealt with swiftly and decisively. We call upon every citizen to show restraint.\n\nMinister Matuke stressed national unity as essential for Zimbabwes stability:\n\nLet us work together to uphold the values of peace, stability, and democratic engagement. We stand ready to protect our citizens and our sovereignty, ensuring that our nation remains a place of safety and prosperity for all.\n\nMinister Matuke revealed concerns about foreign influence behind potential unrest.\n\nWe are concerned about a concerted effort to undermine our stability and foster discord within our society. I urge all citizens to remain vigilant against such foreign-funded threats.\n\nOn Saturday, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere said Zimbabweans should go about their business as usual as law enforcement agents will be vigilant and on high alert to guarantee security and ensure peace across the country.\n\nDr Muswere\n\nAddressing the media, Dr Muswere urged Zimbabweans to ignore calls for protests that are being made by cyber terrorists and fanned through social media, saying the countrys security sector is well-equipped to deal with any mischief.\n\nAs official Government spokesman, I would like to assure the nation that peace and stability will continue to prevail in our country in terms of the Constitution, including on the 31st March 2025, and all Zimbabweans should disregard misinformation and disinformation being peddled on social media platforms by cyber terrorists, said Dr Muswere.\n\nWe also like to assure the people that law-enforcement agencies have more than enough capacity to deal with any illegal activities that might take place in our country. As a Government, we have taken note of artificial intelligence-generated videos and messages from comedian-cum-terrorists who seek to misinform and dis-inform the public. Those who want to create despondency, alarm and anarchy will be dealt with in terms of the law. No one has the right to overthrow a constitutionally elected Government. So labour, business, learners, students and the generality of all Zimbabweans should continue to do their business as usual as the security sector has more than enough capacity to deal with any illegal activities in our country.\n\nThe call for protests, Dr Musweresaid, was misplaced as it sought to create a false narrative of a non-existent political crisis.\n\nWe urge Zimbabweans not to participate in these illegal activities which are aimed at creating a false narrative of a political crisis in the country. These actions are criminal and undermine the constitutional rights of freedom of assembly, he said.\n\nLast Thursday, the Minister of Home Affairs and Cultural Heritage, Kazembe Kazembe, said security services were on high alert to ensure the safety and security of the public and everyone, including visitors to the country, should feel secure and continue engaging in their socio-economic activities.\n\nYesterday, police spokesperson Commissioner Paul Nyathi also assured the nation that it will be business as usual across the country today.\n\nThe police have made adequate deployments throughout the country. Those using public transport or private vehicles should not fear. Businesses and schools should operate normally.\n\nComm yathi issued a stern warning against social media misuse.\n\nWe are aware of individuals spreading threats online, discouraging work attendance or public transport use. Once identified, they will face the full force of the law.\n\nNationwide, normalcy prevailed yesterday with businesses operating, churches holding services, and social activities continuing undisturbed.\n\nHarares commercial centres remained busy while transport services operated smoothly.\n\nPassengers Association Coordinator Tafadzwa Goliati said: Harare is operating normally, with no major disruptions. Commuters should proceed with their daily routines.\n\nReligious services across the capital proceeded without concern, with congregants focused on worship rather than protest fears.\n\nDuring sermons yesterday church leaders delivered sermons that focused on the importance of respecting Government authority as a means to promote peace and national development.\n\nTheir messages drew heavily from Romans chapter 13 in the New Testament, which addresses the relationship between Christians and governing authorities.\n\nThe Apostle Paul, who authored Romans, underscores the significance of submission to civil authorities, stating that they are established by God.\n\nThe leaders highlighted that resisting such authority equates to resisting Gods ordinance.\n\nOne church leader remarked, We shared Apostle Pauls message in the Book of Romans 13, which highlights that rulers are meant to be a source of good, rewarding those who do right and punishing wrongdoers. Paul describes the government as a servant of God for maintaining order.\n\nThe sermons encouraged congregants to pray for peace and unity, emphasizing the need for personal and national development. The leaders acknowledged the presence of individuals with negative attitudes, likening them to Tobiah from the Book of Nehemiah, who criticized the rebuilding efforts in Jerusalem.\n\nAmong the people, we have those with evil thoughts who do not emulate the good work being done by President Mnangagwa, one church leader noted.\n\nThe church leaders reiterated that Christians should not only obey civil laws but also fulfil their moral obligations, such as paying taxes and showing respect to those in authority.\n\nThey also referenced the concluding verses of Romans 13, which call for love among individuals, stating that love fulfils the law. This reinforces the idea that genuine Christian living is guided by love for others.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/High-alert-680x380.jpg",
            "description": "Herald Reporters SECURITY forces stand ready to handle any disturbances and the Government remains resolutely committed to national stability, the Minister of State for National Security, Lovemore Matuke, has said. Addressing citizens in Gutu South yesterday, Minister Matuke warned against any actions threatening public order and potential disruptions by agitators, emphasising that protecting citizens’ safety […]",
            "time": "08:29",
            "date": "31 Mar 2025"
        },
        {
            "title": "Parly calls for urgent fix to Zimra’s e-service platform",
            "url": "https://www.herald.co.zw/parly-calls-for-urgent-fix-to-zimras-e-service-platform/",
            "content": "Farirai Machivenyika-Senior Reporter\n\nTHE e-service platform being used by the Zimbabwe Revenue Authority (Zimra) must be expeditiously improved to enable taxpayers to submit returns timeously and ensure there are no losses in the revenue collection process, Parliaments Public Accounts Committee has said.\n\nIn a report tabled in Parliament last week, the Public Accounts Committee (PAC) called upon Zimra to ensure that the Tax Revenue Management System (TaRMS) is fully functional by year-end and also come up with comprehensive contingency plans to address any potential systems failure that may affect revenue collection.\n\nThe PAC report was presented to Parliament last week following the Auditor-Generals 2021 and 2022 reports which noted unreliable performance of the tax collectors e-service platform since 2016.\n\nThe audit observed that the Authoritys e-service platform had not been performing as expected, since 2016. It experienced congestion during peak periods of returns submission and in 2021 the system was not able to process all the 364 011 returns and its downtime was 0,45 percent and 0,95 percent, which was far above the tolerable downtime rate of 0,02 percent.\n\nThe committee also said Zimras Commissioner-General, Ms Regina Chinamasa, had confirmed that in 2021, the e-service system was non-functional, prompting the Authority to put in place mechanisms to ensure that taxpayers were able to submit their returns to facilitate revenue collection.\n\nInitially, the Authority had used the e-mail facility where people submitted their returns through their e-mails.\n\nLater in 2022, they developed an in-house solution (e-taxes) to mitigate the challenge the taxpayers were facing. The long-term solution was the implementation of the TaRMS which was deployed in 2023 with a four-life deployment period ending December 2024, further reads the report.\n\nThe PAC added that the e-service platforms poor performance and frequent downtime had hindered taxpayers ability to submit returns, potentially affecting revenue collection.\n\nIt said Zimras reliance on e-mail submissions as a temporary solution was not a secure or efficient method for handling sensitive tax information.\n\nThe development of an in-house solution (e-taxes) and the implementation of the TaRMS were positive steps, but the delay in deploying TaRMS until late 2023 was a matter of concern.\n\nZimra must ensure the TaRMS is fully functional and user-friendly by the end of the deployment period, that is December 2025, to prevent further disruptions.\n\nZimra must develop a comprehensive contingency plan to address potential system failures and minimise downtime by 31 December 2025, PAC said in thereport.\n\nIt also recommended that Zimra conduct a thorough review of the e-mail submission process to ensure the security and integrity of taxpayer data, by December 31.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Ms-Regina-Chinamasa-680x380.jpg",
            "description": "Farirai Machivenyika-Senior Reporter THE e-service platform being used by the Zimbabwe Revenue Authority (Zimra) must be expeditiously improved to enable taxpayers to submit returns timeously and ensure there are no losses in the revenue collection process, Parliament’s Public Accounts Committee has said. In a report tabled in Parliament last week, the Public Accounts Committee (PAC) […]",
            "time": "08:29",
            "date": "31 Mar 2025"
        },
        {
            "title": "Mayor publicly rebukes council’s top executives",
            "url": "https://www.herald.co.zw/mayor-publicly-rebukes-councils-top-executives/",
            "content": "Herald Reporter\n\nHarare Mayor Councillor Jacob Mafume has publicly rebuked councils top executives for failing to renovate district offices, citing the irony that these officials own large homes in leafy suburbs that dwarfed theoffices they have neglected.\n\nThis comes amid reports that the town clerk is allegedly earning over US$30 000 per month, while the least-paid executive takes home a hefty US$15 000 monthly salary.\n\nDespite this, the citys top executives have kept a surprisingly low-profile, driving pre-owned vehicles only when they are coming to work and using worn-out office furniture, apparently to conceal their high earnings.\n\nSpeaking at the launch of a revenue blitz recently, Clr Mafume pointed out the striking contradiction between the citys struggling district offices and the lavish homes of its top executives.\n\nOur district offices are smaller than private residents of our managers and directors present here. Some wanted to see my house, but I can tell you mine is very small. We have people here who have bigger houses that dwarf district offices and if we are to say lets go and see their houses, we might get surprised so lets renovate our district offices before we call for an inspection in loco for your houses.\n\nHe said residents will be shocked if a similar on-site inspection was carried out for top council managers and directors private residences.\n\nWe can start with an on-site inspection of the town clerks house, followed by the finance directors, and so on, until we reach the final director. Since you have already seen mine.\n\nClr Mafume directed the formation of a technical committee to expedite the renovation of district offices.\n\nMost Harare City Council district offices are in a dilapidated state, frequently plagued by power outages.\n\nDue to the lack of functional systems, cashiers have reportedly resorted to storing financial records on flash drives, while top officials earn hefty salaries.\n\nThe Cleveland Building, home to the Department of Works, is also in a state of disrepair, characterised by broken furniture, non-functional toilets and peeling paint.\n\nThis also comes at a time when the suspended Harare town clerk, who reportedly has over four wives, has allegedly built houses for each of them, including a mansion for his fourth wife in Mt Pleasant.\n\nExecutive assistant to the town clerk, Matthew Marara revealed to the Harare Commission of Inquiry set up to investigate council mismanagement that he owns three houses in affluent suburbs, including Gunhill, Mabelreign and Bulawayo.\n\nAdditionally, Harare City Councils principal housing officer, Mr Edgar Dzehonye, reportedly owns a house in Glen Lorne, another upscale suburb in Harare.\n\nDespite the dilapidated state of council facilities, Harare City executives allegedly splurged US$1 million in 2023 on Toyota Fortuners.\n\nThe purchase, led by suspended town clerk Hosiah Chisango, was reportedly funded by remittances from Harare City Park, a city subsidiary.\n\nThis comes amid revelations that the top brass mutually agreed to keep a low-profile by not driving their luxury Toyota Fortuner GD6 vehicles towork.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Mafume.jpg",
            "description": "Herald Reporter Harare Mayor Councillor Jacob Mafume has publicly rebuked council’s top executives for failing to renovate district offices, citing the irony that these officials own large homes in leafy suburbs that dwarfed the  offices they have neglected. This comes amid reports that the town clerk is allegedly earning over US$30 000 per month, while […]",
            "time": "08:29",
            "date": "31 Mar 2025"
        },
        {
            "title": "DRC crisis: High stakes indaba in the pipeline",
            "url": "https://www.herald.co.zw/drc-crisis-high-stakes-indaba-in-the-pipeline/",
            "content": "Debra Matabvu-Senior Reporter\n\nSADC Chairperson, President Mnangagwa and his East African Community (EAC) counterpart, Kenyan President William Ruto, are expected to hold a high-level meeting this week to formally appoint a panel of eminent African leaders and define their mandate in seeking a lasting solution to the conflict bedevilling eastern Democratic Republic of Congo (DRC).\n\nIn a virtual SADC-EAC meeting on Monday last week, regional leaders appointed former Nigerian President Olusegun Obasanjo, former Kenyan President Uhuru Kenyatta, former South African President Kgalema Motlanthe, former Central African Republic President Catherine Samba Panza and former Ethiopian President Sahle-Work Zewde to spearhead efforts to end the conflict in DRC.\n\nPresident Mnangagwa and President Ruto were tasked with convening the briefing within seven days to outline the panels mandate and tasks.\n\nIn an interview yesterday, Foreign Affairs and International Trade Minister Professor Amon Murwira said preparations were now at an advanced stage, with the meeting set to be held within the stipulated framework.\n\nWe believe that the high-level briefing will be held anytime from now and will be held within the seven-day framework which was stipulated, Prof Murwira said.\n\nAs of Friday (last week), the preparations were at an advanced stage, the programme, and agenda were being finalised while letters have been signed. The Excellences had said they were going to hold the briefing in seven days, so we believe that it will be done in seven days. We now await to hear from the Excellences.\n\nThis map shows areas where M23 rebels are operating in the DRC.\n\nIn a separate interview, Foreign Affairs Permanent Secretary, Ambassador Albert Chimbindi said efforts were being made to ensure the mediation process begins immediately.\n\nThe process has to be navigated delicately as it involves a number of issues such as sending formal requisitions to the nominated leaders, terms of references and coming up with dates for the meeting that are suitable for everyone, he said.\n\nThe meeting is set to be held very soon, although we do not have dates, we have to appreciate the effort which is being made to ensure the meeting takes place.\n\nThe panel of leaders is expected to facilitate dialogue between warring parties, including the Congolese government and the M23 rebels, to promote peaceful negotiations and address underlying grievances.\n\nThey are also expected to advocate for international support and assistance for the DRC, including humanitarian aid, funding for development initiatives, and resources for rebuilding affected communities.\n\nRecently the United Nations Security Council applauded efforts by the two regional blocs to resolve the DRC crisis and strongly condemned the ongoing offensive by M23 rebels in the eastern DRC.\n\nThe Security Council demanded that the M23 immediately cease hostilities, withdraw from all areas that it controls, and fully reverse the establishment of illegitimate parallel administrations in the DRC territory.\n\nIt reiterated the urgent appeal for all parties to conclude an immediate and unconditional ceasefire, as called for by leaders from EAC and SADC.\n\nThe M23 rebels have been moving south towards Bukavu, the capital of South Kivu province, in what appears to be an attempt to expand their area of control in the countrys east after capturing the city of Goma.\n\nM23, which refers to March 23, 2009, is the latest group of ethnic Tutsi-led insurgents to take up arms against Congolese forces. It launched the current rebellion in 2022.\n\nThe group has accused the government of Congo of not living up to the peace deal and fully integrating Congolese Tutsis into the army and administration.\n\nThe latest advances are part of a major escalation of a decades-old conflict over power, identity and resources that has killed hundreds of thousands of people and displaced millions since its recent resurgence.\n\nAccording to reports at least 7 000 people have died in the fighting since January this year with over 600 000 people having been displaced by the fighting since November 2024.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/President-Mnangagwa-SADC-Chair-680x380.jpg",
            "description": "Debra Matabvu-Senior Reporter SADC Chairperson, President Mnangagwa and his East African Community (EAC) counterpart, Kenyan President William Ruto, are expected to hold a high-level meeting this week to formally appoint a panel of eminent African leaders and define their mandate in seeking a lasting solution to the conflict bedevilling eastern Democratic Republic of Congo (DRC). […]",
            "time": "08:29",
            "date": "31 Mar 2025"
        },
        {
            "title": "Govt gives assurance of peace, security in Mashonaland West",
            "url": "https://www.herald.co.zw/govt-gives-assurance-of-peace-security-in-mashonaland-west/",
            "content": "Walter Nyamukondiwa-Mashonaland West Bureau Chief\n\nPeople in Mashonaland West should go about their normal business and other affairs today, Mashonaland West Provincial Affairs and Devolution Minister Marian Chombo said yesterday, and alert law enforcement agencies if anyone tries to disrupt the peace and normal life.\n\nShe described the attempts to demonstrate by some shadowy figures as an attempt to disrupt the nations peace, security and development trajectory.\n\nIn her address yesterday, Minister Chombo said Government was committed to promoting peace, security and development in Mashonaland West Province.\n\nThe Minister of State for Provincial Affairs and Devolution, unequivocally condemns the 31 March 2025, planned demonstrations across the breadbasket province of the nation, she said.\n\nThese demonstrations will not only disrupt our efforts towards peace and stability of the province but will also disrupt our economic trajectory as well as put the lives of innocent citizens at risk.\n\nShe said security organs would not hesitate to take decisive measures against individuals, groups and other efforts to disrupt peace and stability in the province and the country at large.\n\nI humbly urge all stakeholders, including civil society organisations, the business community and community leaders, to desist from engaging in any activities that may incite violence or disrupt the prevailing peace and tranquillity, she said.\n\nAs Government, we will not tolerate any counter-productive actions that will seek to undermine Governments progressive efforts.\n\nShe urged citizens, the business community and all stakeholders to continue operating as usual and alert law enforcement agencies of any attempts to disrupt peace and routine business activities.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Minister-Marian-Chombo-680x380.jpg",
            "description": "Walter Nyamukondiwa-Mashonaland West Bureau Chief People in Mashonaland West should go about their normal business and other affairs today, Mashonaland West Provincial Affairs and Devolution Minister Marian Chombo said yesterday, and alert law enforcement agencies if anyone tries to disrupt the peace and normal life. She described the attempts to demonstrate by some shadowy figures […]",
            "time": "08:29",
            "date": "31 Mar 2025"
        },
        {
            "title": "Comesa to tap into $5bn leather industry potential",
            "url": "https://www.herald.co.zw/comesa-to-tap-into-5bn-leather-industry-potential/",
            "content": "Elita Chikwati-Agribusiness News Editor\n\nTHE Common Market for Eastern and Southern Africa (COMESA) has the potential to generate US$5 billion in annual revenue through leather value addition and local footwear production.\n\nThis could create jobs, drive industrialisation and enhance economic growth in COMESA Member States.\n\nThis came out at the launch of the COMESA Regional Leather Value Chain Strategy for 2025-2029 in Nairobi Kenya on Friday.\n\nThe strategy is aimed at shifting the industrys trajectory from being predominantly raw material exporters to competitive manufacturers of finished leather products.\n\nThe development of the leather value chain will ensure economic, social and environmental sustainability within the region.\n\nOfficiating at the function, COMESA secretary-general, Mrs Chileshe Mpundu Kapwepwe, said the region remained heavily dependent on footwear imports.\n\nShe said COMESA Member States were exporting most of the hides and skins either raw or processed at minimal value addition.\n\nCOMESA accounts for approximately 11 percent of the worlds cattle population, 12 percent of sheep and 18 percent of goats making it a significant global player in raw material supply for leather production.\n\nEach year COMESA produces over 42 million hides and skins representing 34, 3 percent of Africas total production, yet much of this potential remains untapped due to limited processing capacity and market access constraints.\n\nCOMESAs annual footwear demand is estimated at approximately 544 million pairs yet the region remains heavily dependent on imports, with a footwear import bill of US$1,1billion per year, local production could create many jobs and generate over US$5 billion in sales, driving economic growth in our Member States, Mrs Kapwepwe said.\n\nThe Leather Value Chain strategy is focused on capacity building, equipping SMEs with skills, training and knowledge sharing. It promotes innovation and technology, advancing modern production and sustainable tanning practices.\n\nThe strategy also plays a pivotal role in advancing COMESAs strategic objectives by promoting industrialisation and value addition, shifting from raw material exports to finished goods to enhance manufacturing, create jobs and boost competitiveness,\n\nIt also strengthens trade facilitation and market access, driving intra COMESA trade and supporting AfCFTA goals. Given the sectors reliance on SMEs (Small to Medium Enterprises), fostering their growth through training, financing and market access ensures inclusive economic development.\n\nI urge COMESA Member of States to adopt procurement policies that prioritise leather footwear produced within the region, particularly for uniformed service personnel.\n\nThis will create a guaranteed market for our footwear-producing enterprises, encouraging private sector investment in leather processing and manufacturing, Mrs Kapwepwesaid.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/COMESA-secretary-general-Mrs-Chileshe-Mpundu-Kapwepwe-680x380.jpg",
            "description": "Elita Chikwati-Agribusiness News Editor THE Common Market for Eastern and Southern Africa (COMESA) has the potential to generate US$5 billion in annual revenue through leather value addition and local footwear production. This could create jobs, drive industrialisation and enhance economic growth in COMESA Member States. This came out at the launch of the COMESA Regional […]",
            "time": "08:29",
            "date": "31 Mar 2025"
        },
        {
            "title": "No disturbances  in Manicaland",
            "url": "https://www.herald.co.zw/no-disturbances-in-manicaland/",
            "content": "Mutare Bureau\n\nMinister of State for Manicaland Provincial Affairs and Devolution, Advocate Misheck Mugadza has assured the province that it is safe to go about their daily business today as adequate security measures have been put in place to ensure public safety in the face of planned protests by some renegades.\n\nMinister Mugadza said businesses and schools should remain open, as the Government is committed to maintaining peace and order.\n\nHe made it clear that the authorities will not tolerate any violent acts and will take firm action to protect citizens and maintain stability.\n\nThe people of Manicaland are assured that today March 31, 2025 is a normal day, with businesses and schools operating as usual. The people of Manicaland are urged to remain united, work together, and prioritise peace to drive development and progress.\n\nAs President Dr Mnangagwa leads the country, Manicaland remains a place for all citizens. The Government has initiated several high-impact projects and programmes that are progressing well and nearing completion. These initiatives are expected to improve the lives of Manicaland residents, aligning with Vision 2030s goal of becoming an upper-middle-income country.\n\nThe security forces will be deployed to maintain peace and order, ensuring a secure environment for all citizens. We expect our citizens to go about their daily activities freely, without any fear or intimidation, and to carry on with their work and businesses as usual.\n\nThe people of Manicaland can rest assured that their safety is a top priority, and they should not let the threat of demonstrations disrupt their daily lives as Government will work tirelessly to ensure that law and order prevail, said Minister Mugadza.\n\nMinister Mugadza also thanked President Mnangagwa for prioritising key infrastructure projects in Manicaland, including the revamping of the Forbes Border Post, Christmas Pass Bypass Road, Mutare International Airport, irrigation development, dam construction, energy generation, and the upgrading of the Birchenogh-Murambinda, Headlands-Chiendambuya and Chipinge-Mt Selinda roads, among other life-changing projects.\n\nZanu PF Manicaland provincial chairman, Cde Tawanda Mukodza has pledged to prevent any demonstrations in the province.\n\nWe will not tolerate any attempts to destabilise our province. The Government, led by President Mnangagwa has made significant strides in developing our province, and we will not let anyone undermine these efforts, he said.\n\nCde Mukodza drew a line in the sand, warning would-be troublemakers that any attempts to cause violence or disrupt the smooth operation of businesses and schools will be met with swift and decisive action. He said the party will not be intimidated, and it will do whatever it takes to protect the people.\n\nCde Mukodza made it clear that with a largely youthful and energetic membership, Zanu PF is confident in its ability to handle any malcontents seeking to cause anarchy and violence.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Advocate-Misheck-Mugadza-680x380.jpg",
            "description": "Mutare Bureau Minister of State for Manicaland Provincial Affairs and Devolution, Advocate Misheck Mugadza has assured the province that it is safe to go about their daily business today as adequate security measures have been put in place to ensure public safety in the face of planned protests by some renegades. Minister Mugadza said businesses […]",
            "time": "08:29",
            "date": "31 Mar 2025"
        },
        {
            "title": "Mash East tranquil",
            "url": "https://www.herald.co.zw/mash-east-tranquil/",
            "content": "Herald Reporter\n\nMinister of State for Provincial Affairs and Devolution for Mashonaland East Advocate Itayi Ndudzo has assured everyone across the province that their security is guaranteed.\n\nHe made the remarks while addressing journalists in Marondera yesterday.\n\nAs Mashonaland East province, the Government and its security services would like to assure the business community, schools and the general public that their security is guaranteed.\n\nAny rabble-rousers, malcontents and anarchist that would want to disturb the peace and harmony in the province will be dealt with according to the laws of the country.\n\nThe province is therefore imploring the population at large and different sectors of the economy to continue engaging and operating without hindrance as the security forces are on high alert to protect the country, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Minister-Ndudzo-680x380.jpg",
            "description": "Herald Reporter Minister of State for Provincial Affairs and Devolution for Mashonaland East Advocate Itayi Ndudzo has assured everyone across the province that their security is guaranteed. He made the remarks while addressing journalists in Marondera yesterday. “As Mashonaland East province, the Government and its security services would like to assure the business community, schools […]",
            "time": "08:29",
            "date": "31 Mar 2025"
        },
        {
            "title": "Residents denounce protests calls",
            "url": "https://www.herald.co.zw/residents-denounce-protests-calls/",
            "content": "Herald Reporters\n\nZIMBABWEANS from all walks of life have denounced calls for protests that are being made by cyber terrorists and fanned through social media, with security forces ready to handle any disturbances.\n\nThe Government said the call for protests was misplaced as it sought to create a false narrative of a non-existent political crisis.\n\nA cross-section of Bulawayo residents said violent protests could disrupt business, threaten livelihoods and destabilise the prevailing peace. They urged the Government to bring to book those caught on the wrong side of the law.\n\nMrs Khangelani Msimanga (75) raised concerns about the impact of potential demonstrations.\n\nHistory has taught us that violent protests are not good for the country and our livelihoods as citizens. In the past, we have witnessed shops being looted and destroyed, yet these businesses create employment for our children, she said.\n\nAs a responsible resident, I dont condone such acts. Every right-thinking Zimbabwe should condemn these planned violent protests.\n\nMs Sithembiso Ndlovu, an informal trader in the city centre, said previous protests had left her counting losses after looters took advantage of the chaos.\n\nI rely on my daily sales to feed my family. Every time there is a protest, businesses are forced to close, and we lose income. We dont want violence in our city and the country at large, she said.\n\nAnother vendor who declined to be named said: Why should we be used by people who have their own agendas? Thina siyazithengisela and that is where our bread comes from. For me, this demonstration is a big no.\n\nZimbabwe Teachers Association (Zimta) chief executive officer Dr Sifiso Ndlovu said their organisation is not a political movement, and urged teachers to stick to their sole responsibility of educating the nation.\n\nWe are just hearing calls for demonstrations, but as teachers, we have nothing to do with that because that is not what Zimta was formed for. Our organisation was not formed to topple the Government of the day, he said.\n\nOur organisations interest is to educate children and nothing else. If we have grievances we know how to address them through proper and laid down structures.\n\nDr Ndlovu urged teachers to continue with their normal duties today.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Denounced-680x380.jpg",
            "description": "Herald Reporters ZIMBABWEANS from all walks of life have denounced calls for protests that are being made by “cyber terrorists” and fanned through social media, with security forces ready to handle any disturbances. The Government said the call for protests was misplaced as it sought to create a false narrative of a non-existent political crisis. […]",
            "time": "08:29",
            "date": "31 Mar 2025"
        },
        {
            "title": "Editorial Comment: Ignore misguided calls for demonstrations",
            "url": "https://www.herald.co.zw/editorial-comment-ignore-misguided-calls-for-demonstrations/",
            "content": "WE do not imagine there will be any serious support for demonstrations called for today by a former member of the Zimbabwe National Liberation War Veterans Association and a former Zanu PF Central Committee member who could not garner support in either organisation for his minority views.\n\nFew people among the general public would nothave recognised his name before he started his social media campaigns to try and get around his lack of support among those he once worked with.\n\nFurthermore, the support he has been receiving on social media comes from groups and individuals whose names are hardly on everyones lips, and may not even exist.\n\nWe have seen many times groups that no one has heard of emerging from the woodwork to make statements.\n\nAt best, these are half a dozen people sitting around a crate of beers somewhere, more usually a single person who feels they are important, and these days can quite easily be a person creating social media names and so forming several groups, none of which have any members except that one person.\n\nFrom past experience of non-entities calling for public protests, nothing will happen today, at least nothing in the way of such protests. And normally these calls could be safely ignored.\n\nNo leading person in opposition politics has been backing the call for protests, and the generality of Zimbabweans know the folly of engaging mindless violent demonstrations.\n\nRumours on social media, usually announced as certainties rather than fiction, that the authorities might close off central business districts are obviously not true.\n\nThe authorities have made it clear that there will be a greater police presence to make sure that criminals do not try and take advantage of the calls and social media chatter.\n\nWe expect everyone to carry on with their normal legal business and legal activities.\n\nHowever, there are still dangers, again based on past experience, because some individuals, sometimes grouping themselves for the day as they try and talk each other into activity, might attempt to take advantage of the situation to rob and loot.\n\nWe have seen this several times where people assemble then swing into action and break into shops and businesses and steal what they can.\n\nThis is what obviously makes many business people nervous.\n\nThe formal retailers, through the Confederation of Zimbabwe Retailers, sought and received assurances from the police and the authorities that adequate police protection would be available to deter criminal gangs who might target their businesses, and if the worse came to the worse, deal with criminals trying their luck.\n\nCZR has issued a statement saying that its members should treat today like a normal business day, and we expect most of them will.\n\nThe main public transport organisations have been assured that bus and kombi services are not going to be affected. They have since urged their members to continue in business as normal.\n\nThe transporters have also urged the police who might be keeping an eye on traffic and potential troublemakers to let their buses and kombis through without delays.\n\nThis should be easy to arrange. Police may want to glance through the windows of some public transport, but when they see normal people going about their normal business, and that is easy to see, they can wave it on.\n\nThese retail and transport groups would obviously welcome a denser police presence, so that potential troublemakers and criminals will maintain a low profile and slink off. And this seems to be the position of the police, who have been making it clear that they regard today as a normal working day.\n\nThere will still be some who will be nervous about moving around, not wanting to be caught up in any trouble, and we can sympathise with them.\n\nBut they should not worry and in any case can often find out before they move around that there is no trouble and so go about their normal activities.\n\nThis nervousness is what has obviously caused more to delve into some of the more arcane social media to see if their worries have any basis, but we hope that they will realise that there is not really anything behind the calls for trouble and will relax.\n\nIt seems odd that a single person, who is not much of a public figure, can create so much unfactual talk on some social media platforms, but this is the sort of thing we can regrettably have in the modern world.\n\nWe will have to become more and more used to this sort of thing, and be able to distinguish between factual news and fake news.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Say-no-to-protest-680x380.jpg",
            "description": "WE do not imagine there will be any serious support for demonstrations called for today by a former member of the Zimbabwe National Liberation War Veterans Association and a former Zanu PF Central Committee member who could not garner support in either organisation for his minority views. Few people among the general public would not  […]",
            "time": "08:29",
            "date": "31 Mar 2025"
        }
    ]
}