{
    "news": [
        {
            "title": "Zimbabwe moves towards combating lung cancer",
            "url": "https://www.herald.co.zw/zimbabwe-moves-towards-combating-lung-cancer/",
            "content": "Rumbidzayi Zinyuke in Kadoma\n\nIn a move that seeks to tackle the growing burden of lung cancer, the Ministry of Health and Child Care today convened an inception meeting for the National Lung Cancer Programme.\n\nThe Hope for Lungs project, which is being supported by Bristol Myers Squibb Foundation through the Jointed Hands Welfare Organisation (JHWO), aims to improve access to early diagnostic services and treatment for lung cancer in the country.\n\nAccording to the World Health Organization (WHO), lung cancer is one of the leading causes of cancer deaths worldwide, accounting for approximately 1,8 million deaths annually.\n\nIn Zimbabwe, an estimated 1 200 new cases of lung cancer are diagnosed annually, resulting in around 800 deaths.\n\nTobacco use is a major risk factor for lung cancer, and Zimbabwe has a significant tobacco usage problem.\n\nThe country has approximately 864 292 male and 37 181 female adult smokers.\n\nThe adult smoking prevalence currently stands at 8.5 percent, with 18 percent being men and 0.7 percent being female smokers.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Screenshot-28-680x380.png",
            "description": "Rumbidzayi Zinyuke in Kadoma In a move that seeks to tackle the growing burden of lung cancer, the Ministry of Health and Child Care today convened an inception meeting for the National Lung Cancer Programme. The Hope for Lungs project, which is being supported by Bristol Myers Squibb Foundation through the Jointed Hands Welfare Organisation […]",
            "time": "20:34",
            "date": "20 Dec 2024"
        },
        {
            "title": "Another Mukuru Money Transfer agency robbed",
            "url": "https://www.herald.co.zw/another-mukuru-money-transfer-agency-robbed/",
            "content": "Arron Nyamayaro\n\nArmed robbers fired a warning shot in the air and got away with a yet-to-be-established amount of money from a Mukuru Money Transfer agency at Kamunhu Shopping Centre in Mabvuku this afternoon.\n\nShoppers and vendors lay down for cover and witnessed the robbers speeding away in their getaway car.\n\nThe robbers were covering their faces with balaclavas.\n\nWe became suspicious when we saw two men with their faces covered. Within a minute we heard a gunshot and the drama unfolded, said one of the eye witnesses who preferred anonymity.\n\nThe robbery, targeting Mukuru Money Transfer agencies, is the second one within a week.\n\n",
            "image_url": null,
            "description": "Arron Nyamayaro Armed robbers fired a warning shot in the air and got away with a yet-to-be-established amount of money from a Mukuru Money Transfer agency at Kamunhu Shopping Centre in Mabvuku this afternoon. Shoppers and vendors lay down for cover and witnessed the robbers speeding away in their getaway car. The robbers were covering […]",
            "time": "20:34",
            "date": "20 Dec 2024"
        },
        {
            "title": "Police geared for festive season",
            "url": "https://www.herald.co.zw/police-geared-for-festive-season/",
            "content": "Midlands Bureau\n\nPolice in Gweru have said they are fully resourced to conduct round the clock patrols throughout the holidays and urged residents to celebrate responsibly.\n\nOfficer-in-Charge Gweru Central Chief Inspector Joel Goko this morning led police officers as they went around Gwerus central business district to urge residents to shun violence and any other form of criminal activities during the holidays.\n\nWe are ready to pounce on those found on the wrong side of the law so we urge citizens to be responsible and to shun violence or any other criminal activity as we celebrate Christmas, said Chief Inspector Goko.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Screenshot-26-680x380.png",
            "description": "Midlands Bureau Police in Gweru have said they are fully resourced to conduct round the clock patrols throughout the holidays and urged residents to celebrate responsibly. Officer-in-Charge Gweru Central Chief Inspector Joel Goko this morning led police officers as they went around Gweru’s central business district to urge residents to shun violence and any other […]",
            "time": "20:34",
            "date": "20 Dec 2024"
        },
        {
            "title": "16 months old boy drowns in rubbish pit",
            "url": "https://www.herald.co.zw/16-months-old-boy-drowns-in-rubbish-pit/",
            "content": "Crime Reporter\n\nA 16 months old boy drowned in a water logged rubbish pit at a house in Epworth as he was playing.\n\nNational police spokesperson, Commissioner Paul Nyathi confirmed the incident which occurred on December 18, 2024.\n\nThe ZRP reports a sad incident in which a 16 months old baby boy drowned in a water logged rubbish pit on December 18 at a house in Overspill, Epworth.\n\nThe victim was playing outside the house while his mother was doing household chores, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/12/PAUL-NYATHI-1.jpg",
            "description": "Crime Reporter A 16 months old boy drowned in a water logged rubbish pit at a house in Epworth as he was playing. National police spokesperson, Commissioner Paul Nyathi confirmed the incident which occurred on December 18, 2024. “The ZRP reports a sad incident in which a 16 months old baby boy drowned in a […]",
            "time": "20:34",
            "date": "20 Dec 2024"
        },
        {
            "title": "Live Coverage:  President Mnangagwa launches Land Tenure Implementation Programme",
            "url": "https://www.herald.co.zw/live-coverage-president-mnangagwa-launches-land-tenure-implementation-programme/",
            "content": "10.30 President Mnangagwa has arrived at Precabe Farm in Kwekwe where he is set to launch the Land Tenure Implementation Programme.\n\nThe new system is envisaged to enhance access to financing and encourage agricultural production and productivity.\n\nIt will bolster the land ownership model, unlock huge amounts of finance, spur economic growth and enhance productivity.\n\nThis follows President Mnangagwas announcement in October that the countrys land tenure system would be adjusted to improve land tenure security.\n\nUnder the new era, all land held by beneficiaries of the Land Reform Programme under 99-year leases, offer letters and permits will be under a bankable, registrable and transferable document.\n\nOur crew is in Kwekwe at Precabe Farm to give you live updates of the programme. Stay tuned.\n\n10.55 President arrives at Precabe\n\nPresident Mnangagwa has arrived at Pricabe Farm, an elaborate thriving agricultural property in Kwekwe that is owned by the First Family.\n\nHe is set to launch the Land Tenure Implementation programme which will bolster land ownership and put an end to the issue of title and security.\n\nThe Head of State and Government has started touring the farm.\n\nHe is accompanied by Government Ministers, Permanent Secretaries, Service Chiefs, senior Government officials, captains of industry, traditional leaders, and farmers.\n\nThere are several agricultural activities at the farm, including horticulture, livestock and fish farming, among others.\n\nChief Hwenje is entertaining the bumper crowd gathered at the farm.\n\n10.58 HE leads Precabe Farm tour\n\nPresident Mnangagwa has started showing Cabinet Ministers various activities being carried out at the farm.\n\nHe has shown them the produce that is being grown at the farm.\n\nPotatoes are being grown at a large scale and have since claimed a huge market share as the First Family leads by example.\n\n11.10  How the Land Tenure Implementation Programme will work\n\nUnder the programme being launched by President Mnangagwa today, the tittle issued to farmers will only be transferable to indigenous Zimbabweans as the Government asserts the irreversibility of the Land Reform Programme embarked upon at the turn of the millennium.\n\nThe Land Tenure Implementation Programme has seen the Government issuing an indefinite moratorium on the Issuance of any new 99-year leases, offer letters and permits for agricultural land to ensure the smooth facilitation of the process.\n\nPriority in the issuance of title will be on war veterans, women and youth.\n\n11.55 Bishop Mutendi leads in prayer\n\nZion Christian Church leader, Bishop Nehemiah Mutendi is opening the programme with words of devotion.\n\nHe said the land issue is reminiscent to the biblical land conferred on Israel by God. Your Excellency the President, what you are setting out to do is in line with Gods plan. You are demonstrating unselfish vision. You are indeed a good steward to Zimbabweans, said Bishop Mutendi.\n\n11.56 President committed to empowerment: Midlands Minister\n\nMinister of State for Midlands Provincial Affairs and Devolution, Cde Owen Mudha Ncube is now on the podium to welcome the people.\n\nHe described the First Familys farm as a model for farming and a centre of excellence.\n\nMinister Ncube said todays event shows President Mnangagwas determination to provide land tenure and security.\n\nThe programme also shows the Presidents desire to provide broadbased empowerment and is in fulfillment to the commitment he made during his inauguration in 2017, said Minister Ncube.\n\n12.11 Land Tenure Programme a landmark development: Agriculture Minister\n\nLands, Agriculture, Fisheries, Water and Rural Development Minister, Dr Anxious Masuka is now on the stage.He described the launch of the programme as a landmark development.Todays is a great day not only for Zimbabwe but for Sadc. Its a landmark development as we are unlocking the levers of production.\n\n12.32 Minister Muchinguri introduces the President\n\nMinister Muchinguri Kashiri chronicled the various programmes that have been initiated by President Mnangagwa to alleviate the challenges arising from the effects of climate change.\n\nThese include high impact dams and several agricultural schemes such as Pfumvudza/Intwasa, among others.\n\nMinister Muchinguri Kashiri, whose role is to introduce President Mnangagwa, outlined the role played by the Head of State and Government during the liberation struggle.\n\nShe also said President Mnangagwa has a solid background in agriculture, both as a farmer and as a policy maker.\n\nHe is a man with passion to bring posterity to Zimbabwe, she said.\n\nPresident Mnangagwa has now been invited to the podium.\n\n12.41 Land tenure system will encourage investment and productivity: President MnangagwaPresident Mngagwa is now on the podium.\n\nThe President said the country is charting a new trajectory which is consistent with Vision 2030.\n\nWe are determined to deliver broad-based empowerment and transformation, leaving no place and no one behind, said President Mnangagwa.\n\nThe land reform programme is irreversible, adding that land is the cornerstone for economic growth.\n\nOur Constitution gives rights to every Zimbabwean citizen to acquire, use or dispose agricultural land.\n\nThe land tenure system is critical. It encourages investment and encourages production and productivity. With secure land tenure, our farmers can secure loans and improve their yields. The importance of bankable, secure land system cannot be overemphasised, said President Mnangagwa.\n\nHe urged banks to accept the land documents.The handover of title deeds is testimony of the Governments desire to empower the people, he said.\n\nThe State is transferring title to a new holder and the recipient is challenged to defend the revolution. The handover has happened because there was a land revolution to emancipate Zimbabweans, said President Mnangagwa.\n\n13.00  President inspired by his parents\n\nThe President commended the technical committee that is instrumental in ensuring the success of the Land Tenure Implementation Programme.\n\nHe said he was inspired to take up farming by his parents at a young age.\n\nPresident Mnangagwa said through learning from best practices, he has set new records in farming.\n\nThe principle is go and learn from the best, said President Mnangagwa.\n\nIn ending his speech, President Mnangagwa extended his best wishes for everyone during this festive season.\n\nHe said Christmas is a time for joy.\n\n13.24 Businessman Kuda Tagwirei chairs Land Tenure Implementation Committee\n\nRenowned businessman, Mr Kuda Tagwirei, is the chairperson of the Land Tenure Implementation Committee.\n\nMr Tagwirei is now on stage and is expected to lead in the presentation of title deeds.\n\nIn his speech, Mr Tagwirei said after a thorough analysis of the law, the technical committee resolved that there is no legal barrier that can prevent the Government from issuing title deeds.\n\nHe said the title deeds are bankable and could facilitate the holder from accessing loans.\n\nI am a businessman. I have never seen such an empowerment scheme better than this one, Your Excellency, said Mr Tagwirei.\n\nHe said 10 people from 10 provinces will be the first beneficiaries of the title deeds, with President Mnangagwa being the first to get them.\n\nOthers beneficiaries are former Cabinet Minister, Dr Herbert Murerwa and Public Service Commission chairperson, Dr Vincent Hungwe.\n\nOthers include Deputy Speaker of the National Assembly, Cde Tsitsi Gezi and Mr Egypt Kakono, both from Mashonaland Central Province.\n\nThere is also Mr Vengai Rushwaya and Ezra Chadzamira (both from Masvingo Province), Mr Mthambeli Ndou and Mr Mangamela Sibanda (both from Matabeleland North), among others.Mr Tagwirei said the title deeds have been digitalised and have enhanced security.\n\n13.28 Minister Garwe challenges beneficiaries to utilise title deeds responsibly\n\nLocal Government and Public Works Minister Daniel Garwe is now delivering the vote of thanks.\n\nHe thanked all those that were involved in the implementation of the programme.\n\nMinister Garwe challenged beneficiaries to utilise the title deeds responsibly.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/kwekwe-680x380.jpeg",
            "description": "10.30 – President Mnangagwa has arrived at Precabe Farm in Kwekwe where he is set to launch the Land Tenure Implementation Programme. The new system is envisaged to enhance access to financing and encourage agricultural production and productivity. It will bolster the land ownership model, unlock huge amounts of finance, spur economic growth and enhance productivity. […]",
            "time": "20:34",
            "date": "20 Dec 2024"
        },
        {
            "title": "Mabvuku woman appears in court for killing stepdaughter",
            "url": "https://www.herald.co.zw/mabvuku-woman-appears-in-court-for-killing-stepdaughter/",
            "content": "Yeukai Karengezeka\n\nCourt Correspondent\n\nA 20-year-old Mabvuku woman appeared in court yesterday facing charges of murdering her four-year-old stepdaughter, Tatenda Muchato.\n\nMemory Moyana appeared before Harare Magistrate, Ms Rufaro Panavanhu.\n\nMoyana was advised to apply for bail at the High Court.\n\nShe was remanded in custody to January 2.\n\nProsecutor Takudzwa Jambawu told the court that on December 16 at around 2pm, Moyana allegedly assaulted the young girl.\n\nThe assault was overheard by a neighbour, Lorrein Makore, who later became the informant in the case.\n\nA short while later, Tatenda emerged from the house with visible bruises on her chest and mouth, which were noted by Makore.\n\nAt around 3pm, the child reportedly came out of the toilet with soiled clothes, asking for tissue paper.\n\nMoyana reportedly assisted her and the two returned to their room. Moyana allegedly pushed the child against an object in the room, accusing her of soiling herself.\n\nMoments later, the informant reportedly saw Moyana carrying the child, who appeared to be unconscious.\n\nMoyanas husband took the child to a prophet, and she was declared dead.\n\nThe family then transported the body to Nyazura.\n\nA report was then made to the police.\n\n",
            "image_url": null,
            "description": "Yeukai Karengezeka Court Correspondent A 20-year-old Mabvuku woman appeared in court yesterday facing charges of murdering her four-year-old stepdaughter, Tatenda Muchato. Memory Moyana appeared before Harare Magistrate, Ms Rufaro Panavanhu. Moyana was advised to apply for bail at the High Court. She was remanded in custody to January 2. Prosecutor Takudzwa Jambawu told the court […]",
            "time": "20:34",
            "date": "20 Dec 2024"
        },
        {
            "title": "Mukuru awarded deposit-taking microfinance institution licence",
            "url": "https://www.herald.co.zw/mukuru-awarded-deposit-taking-microfinance-institution-licence-2/",
            "content": "Oliver KazungaSenior Business Reporter\n\nFINANCIAL services provider Mukuru has been awarded a deposit-taking microfinance institution licence in Zimbabwe as the firm seeks to expand its mission of driving financial inclusion in the country.\n\nIn a statement, Mukuru, which has been part of Zimbabwes financial services landscape over the past 20 years, serving more than three million clients, said the latest development enables the business to expand on its mission of driving financial inclusion in the country.\n\nWe are excited to leverage our extensive network and digital capabilities to further empower underserved communities  particularly SMEs (Small-to-Medium Enterprises), women, youth, people with disabilities and rural populations  and drive greater financial inclusion across the country, said Mukuru group chief executive officer Mr Andy Jury.\n\nThe firm, he said, is uniquely positioned to bridge the gaps between formal and informal financial services in Zimbabwe by unlocking new economic opportunities through the provision of innovative financial products that enable people to send, store, spend and potentially borrow with ease.\n\nRelevant financial inclusion depends on the uptake of products and services. To this end, Mukurus trusted brand and reputation as a reliable financial services provider is expected to support the building of customer trust and drive the adoption of digital offerings, said Mr Jury.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/WhatsApp-Image-2024-12-20-at-12.31.16-1-680x380.jpeg",
            "description": "Oliver Kazunga Senior Business Reporter FINANCIAL services provider Mukuru has been awarded a deposit-taking microfinance institution licence in Zimbabwe as the firm seeks to expand its mission of driving financial inclusion in the country. In a statement, Mukuru, which has been part of Zimbabwe’s financial services landscape over the past 20 years, serving more than […]",
            "time": "20:34",
            "date": "20 Dec 2024"
        },
        {
            "title": "Redcliff proposes US$25m budget for 2025",
            "url": "https://www.herald.co.zw/redcliff-proposes-us25m-budget-for-2025/",
            "content": "Midlands Bureau\n\nRedcliff Municipality has proposed a US$25million budget for 2025, which is a decrease from this years US$30million.\n\nMayor Vincent Shangwa Masiiwa said the budget seeks to prioritise the serious water challenges being faced in the dormitory town.\n\nOur total budget for the year 2025 is US$25 337 144.96. Water supply remains a key challenge in Redcliff, therefore more emphasis has been directed towards water projects. We will look at addressing water challenges in Torwood water and sewer connections, as well as roads.\n\nThe following schemes were budgeted for in the 2025 budget and will be funded by our own revenue, that is maintenance of Millennium Park and Engelbrecht Road, water and sewer reticulation, Simbi Park roads, drainage and sewer.\n\nThese projects will improve the quality of life for residents and attract new businesses to Redcliff, said Mr Masiiwa.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/images-5.jpeg",
            "description": "Midlands Bureau Redcliff Municipality has proposed a US$25million budget for 2025, which is a decrease from this year’s US$30million. Mayor Vincent Shangwa Masiiwa said the budget seeks to prioritise the serious water challenges being faced in the dormitory town. “Our total budget for the year 2025 is US$25 337 144.96. Water supply remains a key […]",
            "time": "20:34",
            "date": "20 Dec 2024"
        },
        {
            "title": "Mellon Foundation extends US$500K grant to national gallery",
            "url": "https://www.herald.co.zw/mellon-foundation-extends-us500k-grant-to-national-gallery/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nThe Mellon Foundation has awarded the National Gallery of Zimbabwe a US$500 000 grant to support the development of the museums infrastructure.\n\nThe grant shall be utilised to refurbish the gallerys amenities, including the installation of a brand new air conditioning system, a fire suppression system, access control and security systems.In a statement, the executive director of the\n\nNational Gallery of Zimbabwe, Mr Raphael Chikukwa said the grant will ensure that the gallery stands at par with other international institutions.\n\nThe grant has come as a lifesaving mechanism after years of seeking partnerships that could encourage the rehabilitation of the museums amenities, he said.\n\nMr Chikukwa said the gallery was grateful to the Mellon Foundation for their generous contribution.\n\nThe bequest will take the National Gallery of Zimbabwe towards world class status, and as a national treasure, contribute to the proper management and preservation of the permanent collection for the foreseeable future, he said.\n\nThe National Gallery of Zimbabwe is committed to promote, develop and safeguard Zimbabwes visual arts while fostering a vibrant art ecosystem.\n\nIt has received the grant in line with the Mellon Foundations mission of building communities enriched by meaning and empowered by critical thinking, where ideas and imagination can thrive.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/11/Raphael_Chikukwa.jpg",
            "description": "Ivan Zhakata Herald Correspondent The Mellon Foundation has awarded the National Gallery of Zimbabwe a US$500 000 grant to support the development of the museum’s infrastructure. The grant shall be utilised to refurbish the gallery’s amenities, including the installation of a brand new air conditioning system, a fire suppression system, access control and security systems. […]",
            "time": "20:34",
            "date": "20 Dec 2024"
        },
        {
            "title": "POTRAZ honoured for tax compliance",
            "url": "https://www.herald.co.zw/potraz-honoured-for-tax-compliance/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nThe Postal and Telecommunications Regulatory Authority of Zimbabwe (POTRAZ) has been named the Most Compliant Taxpayer in the Information Communication Technology sector under the large corporates category.\n\nThe accolade was awarded during the Zimbabwe Revenue Authority (ZIMRA) Appreciation Awards ceremony held in Harare yesterday.\n\nThe ceremony was attended by senior Government officials, including Permanent Secretary in the Ministry of Industry and Commerce Dr Thomas Utete Wushe.\n\nZIMRA board chairperson Mr Anthony Mandiwanza and ZIMRA commissioner-general Mrs Regina Chinamasa also attended the event.\n\nSpeaking on the sidelines of the event, Mrs Chinamasa applauded POTRAZ for setting a benchmark in compliance and accountability, emphasising the importance of such standards in nation-building.\n\nPOTRAZ emerged as the sole parastatal and Government entity that stood out in a competitive field of over 50 entities dominated by private-sector players such as Bata Shoe Company, CBZ, Mimosa, Zimplats, and Fereira Furnitures.\n\nThis milestone underscores the Authoritys dedication to fostering a culture of integrity, transparency, and adherence to fiscal obligations, she said.\n\nIn an interview after receiving the award, POTRAZ director-general Dr Gift Machengete said the recognition was a testament to their unwavering commitment to compliance and good governance.\n\nIt symbolises the hard work and dedication of the POTRAZ team in upholding the principles of accountability. As a public institution, we aim to lead by example and inspire a culture of excellence, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2013/08/Potraz.png",
            "description": "Ivan Zhakata Herald Correspondent The Postal and Telecommunications Regulatory Authority of Zimbabwe (POTRAZ) has been named the Most Compliant Taxpayer in the Information Communication Technology sector under the large corporates category. The accolade was awarded during the Zimbabwe Revenue Authority (ZIMRA) Appreciation Awards ceremony held in Harare yesterday. The ceremony was attended by senior Government […]",
            "time": "20:34",
            "date": "20 Dec 2024"
        }
    ]
}