{
    "news": [
        {
            "title": "Zimasco secures order for hearing of its appeal",
            "url": "https://www.herald.co.zw/zimasco-secures-order-for-hearing-of-its-appeal/",
            "content": "Online Reporter\n\nZIMASCO (Pvt) Ltd has successfully secured an order for the urgent hearing of an appeal challenging a decision that prevents Harare lawyer Mr Wilson Manase from presenting himself as a corporate rescue practitioner for the company.\n\nThe appeal was lodged with the Supreme Court by Kwekwe businessman Shepherd Tundiya and his company, Avim Investments, contesting an interdict issued against Mr Manase.\n\nJustice Tendai Uchena presided over the matter and granted Zimascos application.\n\nThe High Court registrar was directed to compile and dispatch the record of proceedings to the Supreme Court registrar by April 25, in preparation for the appeals hearing.\n\nJustice Uchenas order explicitly restrained Mr Manase from performing or presenting himself as a Corporate Rescue Practitioner under Part XXXIII of the Insolvency Act [Chapter 6:07].\n\nThe matter is to be scheduled for the earliest available Supreme Court date. The court order was issued with the consent of all parties, without affecting the substantive grounds of the appeal.\n\nZimasco has informed its stakeholders that, based on the latest legal developments, two High Court orders previously issued pertain to Sinosteel Zimasco (Pvt) Ltd, a separate entity, and therefore cannot be enforced against Zimasco (Pvt) Ltd.\n\nTo address any lingering uncertainties, a further High Court application has been filed for determination on this issue.\n\nIn the midst of these proceedings, the Chinese Embassy has formally communicated its concerns to the Government of Zimbabwe regarding the protection of its investments in Zimasco (Pvt) Ltd.\n\nIt has urged the Government to take immediate and decisive measures to prevent any unlawful interference with these investments.\n\nAdvocate Daniel Tivadar is representing Zimasco in the ongoing legal matters, while Advocate Silvester Munyaradzi Hashiti is acting on behalf of Avim Investments, Shepherd Tundiya, and Mr Manase.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Supreme-Court-of-Zimbabwe-680x380.jpg",
            "description": "ZIMASCO (Pvt) Ltd has successfully secured an order for the urgent hearing of an appeal challenging a decision that prevents Harare lawyer Mr Wilson Manase from presenting himself as a corporate rescue practitioner for the company.",
            "time": "18:43",
            "date": "11 Apr 2025"
        },
        {
            "title": "Gvt’s increased engagement with Diaspora bears fruit",
            "url": "https://www.herald.co.zw/gvts-increased-engagement-with-diaspora-bears-fruit/",
            "content": "Ray Bande in Vumba\n\nGOVERNMENTS increased engagement with its citizens in the diaspora is bearing fruit, with a considerable number of investment projects in agriculture, education, mining among other sectors already operational, while others are in the pipeline.\n\nThis was revealed in virtual presentations made by the countrys envoys during the Third Zimbabwe Annual Diaspora Conference in Vumba just outside Mutare.\n\nAmbassador in Asia and the Pacific Region, Ambassador Joe Tapera Mhishi said several engagement initiatives with Zimbabweans in the diaspora were aimed at highlighting investment opportunities back home.\n\nDiaspora engagement and consular services provision are being rolled out in Australia and New Zealand. There is also massive participation by Zimbabweans here in community organised events such as the Zimbabwe Achievers Awards Gala dinner held annually, and also Independence Day celebrations commemorated here. The Ambassador is invited to these events as a guest of honour. Resources allowing, there should be at least one diaspora engagement meeting in each of the eight states that make up the Commonwealth of Australia.\n\nThis will also apply to New Zealand regions of Wellington, Auckland and Christchurch. These engagement meetings have been focusing on developments in Zimbabwe, trade and investment opportunities, said Ambassador Mhishi.\n\nFurthermore, on record is another individual in the diaspora that submitted a proposal to work in marginalised communities in the agriculture sector. On records again are some individuals in the diaspora who signed an MOU with the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development for a collaboration at Shamva Agricultural College. The MOU focuses on promoting sustainable agricultural practices and innovation to enhance productivity.\n\nAnother individual from Auckland in New Zealand signed an MOU with the Womens University of Zimbabwe. The scope of the MOU is to facilitate running a modern dairy project using the best practices in breeding dairy cows. New Zealand is rated eighth in the world in the dairy industry. There are cases of diaspora individuals carrying out private investments in Zimbabwe as private individuals or corporate bodies. Among these is a diaspora company founded in April 2022 and whose presence is now being witnessed at the ZITF and the Zimbabwe Agricultural Show. The company is the sole producer of concrete made animal feed and water troughs. A diaspora ladies association called Sisters Connect is investing in real estate after they bought land in Chivhu for constructing residential properties.\n\nThere is also a diaspora family whose efforts to construct a medical centre in Gweru is at an advanced stage. In engaging Zimbabweans in the diaspora, the mission is mindful of the numbers that amount to 60 000 in Australia and 10 000 in New Zealand with diverse professional, business, political and personal interests. From these engagements, it is worth noting that Zimbabweans in the diaspora have shown keenness in transferring knowledge and skills in different sectors.\n\nAmbassador in the Europe Region, Ambassador Christian Katsande said Zimbabweans in the diaspora have shown great interest in investing back home.\n\nZimbabweans in the diaspora have shown great interest in investing back home in different sectors of our economy. Effective engagement has also been instutionalised, and is being done through their diaspora organisations. Examples in the UK include Zimbabweans in the UK Organisation, Zimbabwe Diaspora Nation Building Initiative, Zimbabwe UK Business Chamber, Zimbabwe UK Nurses and Midwives Association Zim Achievers Awards and many others.\n\nI am aware that all these organisations have made their contributions. At the Embassy, we have created clusters that mirror the pillars of the National Development Strategy, especially Financial Services, Agriculture, Mining, Tourism, Infrastructure Construction, Sports, Film and Arts as well as Cultural Heritage. With respect to programmes to promote economic diplomacy, engagement with the diaspora has been fostered through bilateral and cluster meetings. In the Financial Services Sector, the diaspora has huge networks with industry bodies of UK financial services who are assisting in mobilising resources, deepening and broadening financial and capital markets.\n\nTrade and investment conferences such as the Zimbabwe Capital Market Conference and mining investment conferences as well as the business exhibitions which draws the participation of Zimbabweans in the diaspora, he said.\n\nZimbabwes first Ambassador to the Kingdom of Saudi Arabia, Ambassador Jonathan Wutahnashe said: Our mission in the Kingdom of Saudi Arabia is fairly new after having been established last year. This is the reason why it is difficult by now to state the numbers of Zimbabweans, more-so when we have others working in sectors that require extreme privacy.\n\nHowever, we do have Zimbabweans working in Saudi Arabia including some in executive levels while others are what we might call in commercial service level Saudi Arabia has recruited Zimbabweans including in the oil and gas industry as well as construction industry. It is rare not to find a Zimbabwean working as engineers in huge industries here. We had our inaugural diaspora engagement last year, and we connected with local organisations such as ARDA and ZimParks who clearly explained investment opportunities, and there was a lot of interest generated, which we noted, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/08/Joe-Tapera-Mhishi.jpg",
            "description": "GOVERNMENT'S increased engagement with its citizens in the diaspora is bearing fruit, with a considerable number of investment projects in agriculture, education, mining among other sectors already operational, while others are in the pipeline.",
            "time": "18:43",
            "date": "11 Apr 2025"
        },
        {
            "title": "Kariba floodgate partially opened for commissioning tests",
            "url": "https://www.herald.co.zw/kariba-floodgate-partially-opened-for-commissioning-tests/",
            "content": "Walter Nyamukondiwa\n\nMashonaland West Bureau Chief\n\nTHE Zambezi River Authority (ZRA) today conducted commissioning tests for the sluice gates (floodgates) at Kariba Dam as rehabilitation works near completion.\n\nWater plunged briefly to the newly reshaped plunge pool below for about 4 minutes.\n\nWork started in 2019 and ZRA engineers are checking for quality and the possibility of any leaks by releasing amounts of water equivalent to that used to turn a turbine during power generation for three seconds.\n\nIn an update, ZRA planning officer Engineer Munesushe Mudzi said the tests were being undertaken to gauge the efficacy of the work undertaken over the past four years.\n\nToday (Friday), we were commissioning Sluice No 2 that we have been working on since 2019. The tests are part of quality checks that we do, said Eng Mudzi.\n\nWe have done the tests and we used 1500 cubic meters of water and in terms of power generation, this is similar to 3 seconds of turbines turning.\n\nThe stop beams have to be tight when closed to ensure that no water passes through.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/sd-680x380.jpg",
            "description": "THE Zambezi River Authority (ZRA) today conducted commissioning tests for the sluice gates (floodgates) at Kariba Dam as rehabilitation works near completion.",
            "time": "18:43",
            "date": "11 Apr 2025"
        },
        {
            "title": "Masvingo to host Hlanganani/Sanganai 2026",
            "url": "https://www.herald.co.zw/masvingo-to-host-hlanganani-sanganai-2026/",
            "content": "George Maponga in Masvingo\n\nMASVINGO province will next year host the 19th edition of Hlanganani/Sanganai World Tourism Expo.\n\nThis year, the tourism fete is set for Manicaland from September 10 to 12, marking the first time the expo is being held outside Bulawayo or Harare.\n\nTourism and Hospitality Industry Minister Babra Rwodzi announced that Masvingo as the host of the 2026 edition of the tourism extravaganza during an engagement in the city recently.\n\nNext year( 2026)Hlanganani/Sanganai World Tourism Expo is coming to Masvingo and this is part of the devolution initiative being pursued by our President Cde Dr ED Mnangagwas Government, where major national events are being taken to different parts of the country, said Minister Rwodzi.\n\nThe Tourism and Hospitality Industry minister challenged Masvingo province to take advantage of premier tourism events like Hlanganani/Sanganai to put itself on the tourism map and stimulate socio-economic growth in line with Vision 2030.\n\nMinister Rwodzi noted that Masvingo province stands to accrue many tourism takeaways from world-acclaimed spectacles such as the Hlanganani/Sanganai expo.\n\nThe province boasts of the Great Zimbabwe World Heritage site, which headlines tourist attraction sites that include Lake Mutirikwi, Tugwi-Mukosi Dam and Gonarezhou National Park in the south-eastern Lowveld.\n\nThe annual Hlanganani/Sanganai expo is highly anticipated and attracts visitors from across the globe.\n\nIt is a collaboration between the Ministry of Tourism and Hospitality Industry and the Zimbabwe Tourism Authority (ZTA).\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/07/WhatsApp-Image-2022-07-14-at-2.06.21-PM.jpeg",
            "description": "MASVINGO province will next year host the 19th edition of Hlanganani/Sanganai World Tourism Expo.",
            "time": "18:43",
            "date": "11 Apr 2025"
        },
        {
            "title": "Zim champions tourism growth, connectivity at UN Summit",
            "url": "https://www.herald.co.zw/zim-champions-tourism-growth-connectivity-at-un-summit/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nZimbabwe is stepping up efforts to boost tourism resilience, regional connectivity and investment across Africa, Tourism and Hospitality Industry Minister Barbara Rwodzi has said.\n\nShe was speaking at the second UN Tourism Summit for Africa and the Americas underway in Livingstone, Zambia.\n\nThe summit, running under the theme Advancing Resilient Tourism through Connectivity, Investment and Skilled Workforce Development, brought together tourism ministers, government officials, industry leaders and experts from across Africa and the Americas.\n\nMinister Rwodzi said Zimbabwe was committed to economic transformation through tourism.\n\nZimbabwe is steadfast in its pursuit of upper-middle-income status by 2030 and tourism is a critical pillar in this national strategy, she said.\n\nThe Minister hailed the countrys recent advancements in air connectivity under President Mnangagwas leadership, citing the refurbishment and expansion of Robert Gabriel Mugabe, Joshua Mqabuko Nkomo and Victoria Falls International Airports.\n\nVictoria Falls International Airport has become a vital aviation hub within the Kavango-Zambezi (KAZA) region, now capable of accommodating wide-bodied aircraft to serve not just Zimbabwe but the entire region.\n\nMinister Rwodzi also spoke about Africas ongoing air connectivity challenges and called for urgent action.\n\nPoor intra-African air connectivity is a critical barrier we must dismantle, she said.\n\nWe urge governments to make deliberate investments in strengthening national airlines to prioritise and ease regional travel.\n\nWith climate change affecting agriculture and volatile global metal prices impacting mining revenues, the Minister said tourism holds the potential to become Africas leading economic sector.\n\nTourism is the next frontier for sustainable growth across our continent, she said.\n\nMinister Rwodzi said there were investments in MICE facilities, industry skills training, improved visa regimes and infrastructure development.\n\nShe told the meeting that Zimbabwes visa liberalisation would be tackled carefully.\n\nWe advocate for reciprocity in visa policies. Open borders must be mutual and beneficial.\n\nOn the sidelines of the summit, Minister Rwodzi met with UN Tourism Secretary-General Mr Zurab Pololikashvili to discuss collaborative projects, including progress on the African International Academy for Culinary Arts  a Zimbabwe-UN Tourism partnership spearheaded under the patronage of the First Lady Dr Auxillia Mnangagwa.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/05/Minister-Rwodzi.jpg",
            "description": "Zimbabwe is stepping up efforts to boost tourism resilience, regional connectivity and investment across Africa, Tourism and Hospitality Industry Minister Barbara Rwodzi has said.",
            "time": "18:43",
            "date": "11 Apr 2025"
        },
        {
            "title": "All set for Glen View South, Rushinga RDC Ward 19 by-elections",
            "url": "https://www.herald.co.zw/all-set-for-glen-view-south-rushinga-rdc-ward-19-by-elections/",
            "content": "Joseph Madzimure\n\nZimpapers Politics Hub\n\nALL is set for the Glen View South constituency and Rushinga Rural District Council, Ward 19 by-elections on Saturday with all materials and human resources already in place, Zimbabwe Electoral Commission (ZEC) deputy chairperson Ambassador Rodney Kiwa has said.\n\nThe by-elections follow the death of Howard Machipisa, who was a councillor in Ward 19 Rushinga RDC and Grandmore Hakata in Glenview South constituency.\n\nGlenview South Constituency Centre will be at Glenview 1 Community Hall, while Ward 19 Rushinga RDC Ward Centre will be at Nyamanyanya Primary School.\n\nZEC has set 43 polling stations for Glenview South constituency and 4 polling stations for Rushing RDC Ward 19, said Ambassador Kiwa.\n\nThe constituency elections officers, deputy constituency elections officers, ward elections officers, deputy ward elections officers, presiding officers, and polling officers for all electoral centres have been recruited and trained.\n\nA total of ZWG$25,5 million has been budgeted for the two by-elections.\n\nHe stated that the commission is encouraging candidates, political parties and all stakeholders to observe the law, especially the code of conduct for political parties, candidates and maintaining peace before, during and after the elections.\n\nIn Glen View South constituency, five candidates are battling it out to wrestle the seat, among them Tsitsi Tawomhera of Zanu PF, Tungamirai Madzokere, Independent, Tonderai Chakeredza, Independent, George Makwangwaidze, Independent and Perpetua of National Consultative Assembly.\n\nIn Rushinga RDC Ward 19, Trinity Madzinga of Zanu PF will battle it out with Itai Kahwiti, an Independent candidate.\n\nIn Glenview South constituency, a total of 31 519 are registered and ZEC has printed 33 700 ballot papers, while in Rushinga RDC Ward 19, a total of 1 578 are expected to cast their vote, with 1 700 ballot papers printed.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/r-680x380.jpg",
            "description": "ALL is set for the Glen View South constituency and Rushinga Rural District Council, Ward 19 by-elections on Saturday with all materials and human resources already in place, Zimbabwe Electoral Commission (ZEC) deputy chairperson Ambassador Rodney Kiwa has said.",
            "time": "18:43",
            "date": "11 Apr 2025"
        },
        {
            "title": "GreenFuel seek to improve away record",
            "url": "https://www.herald.co.zw/greenfuel-seek-to-improve-away-record/",
            "content": "Curtworth Masango\n\nZimpapers Sports Hub\n\nGreenFuel is set to face FC Platinum on Saturday, aiming to improve their dismal away record.\n\nThey have struggled on the road, registering 22 losses in 36 games since their top-flight debut in 2023.\n\nIn their two away games this season, GreenFuel lost 1-0 to Ngezi Platinum, but managed a 4-2 win against Bikita Minerals.\n\nThis weeks match against FC Platinum at Mandava will be a crucial test for the teams away form.\n\nGreenFuel has never won a game against FC Platinum away, with their previous encounters ending in a 1-1 draw and a 1-0 loss. In contrast, the team has excelled at home, turning the Green Fuel Arena into a fortress.\n\nAfter five matchdays, GreenFuel sits fifth on the log with eight points, five points behind leaders Ngezi Platinum.\n\nThe team has played three home games, winning one and drawing two, while accumulating five points at home and three away.\n\nGreenFuel is the highest-scoring team in the league, with eight goals scored and six conceded. They have managed only one clean sheet. The teams home form has been impressive, with no defeats in their last 28 games.\n\nTheir last home defeat came against Simba Bhora in September 2023, a 3-0 loss. Since their debut, GreenFuel has lost only four games at home with Manica Diamonds, Ngezi Platinum and FC Platinum beating them in their own backyard.\n\nThis Saturday they seek to have a positive outing which they hope will be the bedrock for their season.\n\nSpeaking to Zimpapers Sports, GreenFueld head coach Taurai Mangwiro said:\n\nThey are a difficult opponent at home over the years. We are going there fully aware of the threat they pose to us.\n\nThey have one of the finest coaches in the ranks and the results are always there for everyone to see.\n\nWhile we have respect for them, we are not going foregoing our chances, if you have a wrong approach they will hurt you.\n\nSo by the time we go there we believe we will be ready to have a good approach to withstand whatever they bring to us.Mangwiro added;\n\nWe had a strong record at home last season, but we still found ourselves on the lower echelons in the league because of our poor away record.\n\nIf we are to launch a formidable challenge in the league, we need to improve our away performances.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/3de5707d-864a-4d2f-961e-e534308ff95d-680x380.jpeg",
            "description": "GreenFuel is set to face FC Platinum on Saturday, aiming to improve their dismal away record.",
            "time": "18:43",
            "date": "11 Apr 2025"
        },
        {
            "title": "PSL adds photographers to voting panel",
            "url": "https://www.herald.co.zw/psl-adds-photographers-to-voting-panel/",
            "content": "Bruce Chikuni, Sport Reporter\n\nTHE Castle Lager Premiership has finally acknowledged photographers are important for the development of the game.\n\nAfter an outcry by the media, PSL has roped in three sports photographers into their voting panel, which selects the leagues Coach of the Month, Player of the Month and the best 11 players at the end of the season.\n\nLiberty Libertino Mugari, Knowledge Chingwecha, and Munashe Chokodza are the photographers who were added to the panel, which consists of sports journalists, coaches and club captains.\n\nThe decision not to incoporate photographers was despite the fact that they play a big role in capturing the games memories.\n\nChingwecha, the senior of the trio, says they feel honoured and appreciated.\n\nIm incredibly honoured and excited to be part of the Soccer Stars of the Year voting panel. This is something big for all photographers, but it always feels good when your efforts are being appreciated, said Chingwecha.\n\nThis is a powerful recognition of the role we, as photographers, play in telling the story of the beautiful game. Every image captured on and off the pitch adds depth, emotion and history to our sport.\n\nBeing on this panel is a proud moment; it changes how we feel, as far as being appreciated is concerned.\n\nThe development comes at a time when there has been a marked decline for specilaists sports photographers with Mugari in particilar dominating the area.\n\nIn South Africa, sports photographers like Vino Snap and Mutalusi Mazilitha Phalandwa have attracted millions of followers through their craft.\n\nRecently, one of the most celebrated sportscasters in Mzansi, Robert Marawa, reportedly facilitated a trip for Vino Snap to cover an English Premier League match as a way to appreciate his passion.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/04/PSL-Zim1.jpg",
            "description": "THE Castle Lager Premiership has finally acknowledged photographers are important for the development of the game.",
            "time": "18:43",
            "date": "11 Apr 2025"
        },
        {
            "title": "Lieutenant General Emmanuel Matatu takes command of ZNA",
            "url": "https://www.herald.co.zw/lieutenant-general-emmanuel-matatu-takes-command-of-zna/",
            "content": "Columbus Mabika\n\nNEWLY-appointed Commander of the Zimbabwe National Army, Lieutenant General Emmanuel Matatu, this morning officially took over command and control of the organisation from Lieutenant General (Retired) Anselem Nhamo Sanyatwe.\n\nLt Gen Sanyatwe (Rtd) has since been appointed Minister of Sports, Recreation, Arts and Culture.\n\nA handover and takeover parade was held at Charles Gumbo Barracks in Harare.\n\nThe Commander Zimbabwe Defence Forces, General Philip Valerio Sibanda, who was the chief witness to the command exchange, called on Lt Gen Matatu to pay attention to principled leadership which is responsive to the dictates of the current operating environment..\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/90ba9b4e-b827-44c0-9913-0c20a5a10c4c-680x380.jpeg",
            "description": "NEWLY-appointed Commander of the Zimbabwe National Army, Lieutenant General Emmanuel Matatu, this morning officially took over command and control of the organisation from Lieutenant General (Retired) Anselem Nhamo Sanyatwe.",
            "time": "18:43",
            "date": "11 Apr 2025"
        },
        {
            "title": "Family of 17 involved in an accident",
            "url": "https://www.herald.co.zw/family-of-17-involved-in-an-accident/",
            "content": "Conrad Mupesa\n\nMashonaland West Bureau\n\nSEVENTEEN members of the same family were seriously injured this morning after the vehicle they were travelling in was involved in an accident near Selous along the Harare-Bulawayo road.\n\nThe family was going to Gokwe.\n\nThe injured, who are in a stable condition, were rushed to Norton General Hospital, where they are currently receiving treatment.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/04/accident-2.jpg",
            "description": "SEVENTEEN members of the same family were seriously injured this morning after the vehicle they were travelling in was involved in an accident near Selous along the Harare-Bulawayo road.",
            "time": "18:43",
            "date": "11 Apr 2025"
        }
    ]
}