{
    "news": [
        {
            "title": "NEW: Justice Ministry halts ZIMURA’s US$150 cover band tariff",
            "url": "https://www.herald.co.zw/new-justice-ministry-halts-zimuras-us150-cover-band-tariff/",
            "content": "Mbulelo Mpofu\n\nZimpapers Arts and Entertainment Hub\n\nThe Ministry of Justice, Legal and Parliamentary Affairs has halted the implementation of a US$150 cover band tariff imposed by the Zimbabwe Music Rights Association (ZIMURA) on local artistes.\n\nThe move follows a formal directive sent to ZIMURA, instructing the suspension of the tariff pending regulatory approval.\n\nIt has come to our attention, as the regulator of collecting societies registered in Zimbabwe under the Copyright and Neighbouring Rights Act (Chapter 26:05), that you are requiring cover bands and third parties to pay a licence fee of US$150 and 30 percent of total sponsorship to your organisation, reads part of the letter from the Ministry.\n\nPlease note that the Copyright Office is still seized with the approval of all Collective Management Organisations (CMOs) tariffs for the year 2025, and the 30 percent remittance to ZIMURA is unprecedented.\n\nTherefore, in terms of Section 111 of the above Act, you are hereby directed to suspend the levying of the cited tariffs until a determination has been made by the regulator in consultation with all relevant stakeholders.\n\nThe Ministrys intervention came in response to a letter from ZIMURAs head of licensing, Servious Matiza, addressed to the managing director of Ecobank. In that letter, ZIMURA requested the bank to allocate 30 percent of its sponsorship budget toward music licensing and royalties for copyright holders.\n\n Follow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/WhatsApp-Image-2025-04-05-at-10.58.03-AM-680x380.jpeg",
            "description": "Mbulelo Mpofu Zimpapers Arts and Entertainment Hub The Ministry of Justice, Legal and Parliamentary Affairs has halted the implementation of a US$150 cover band tariff imposed by the Zimbabwe Music Rights Association (ZIMURA) on local artistes. The move follows a formal directive sent to ZIMURA, instructing the suspension of the tariff pending regulatory approval. “It […]",
            "time": "18:30",
            "date": "05 Apr 2025"
        },
        {
            "title": "Skills-based education key, says President",
            "url": "https://www.herald.co.zw/skills-based-education-key-says-president/",
            "content": "Mashudu Netsianda in VICTORIA FALLS\n\nPresident Mnangagwa has called for a paradigm shift in Africas education systems, urging stakeholders to adopt transformative strategies that equip learners with practical skills to drive the continents industrialisation and economic growth.\n\nSpeaking at the 3rd Africa Education Summit in Victoria Falls yesterday, the President boldly stressed the need for education on the continent to move beyond policy discussions and reforms towards tangible action that translates learning into development.\n\nBuilding the Africa we want, demands a continuous paradigm shift from us stakeholders, policy makers, educators, innovators and learners alike, he told delegates.\n\nBold and decisive strategies have to be adopted so that we foster education systems that inculcate solution-driven minds and not produce merely certificate-holding graduates. Our discussions during this summit must, therefore, enable convergence towards scaling up transformative strategies that drive education and developmental progress across Africa.\n\nTogether, we have yet another opportunity to innovate, think outside the box and promote impactful best practices to up-scale resilient systems, as we shape the future of our continent through education.\n\nPresident Mnangagwa said there was an urgent need for skills-based education, urging institutions to bridge the gap between academic learning and industry needs.\n\nOur schools and institutions of higher learning must become incubators of innovation, entrepreneurship and leadership, taking into account our indigenous knowledge systems, he said.\n\nStudents and graduates should be capacitated to produce goods and services that meet the demands of our communities. We must become a continent that can produce and feed itself.\n\nPresident Mnangagwa receives a portrait of himself as a gift from visual artist Tawanda Mhako at the 3rd Africa Education Summit in Victoria Falls yesterday. Looking on is Defence Minister Oppah Muchinguri-Kashiri (right).  Pictures: Eliah Saushoma\n\nThe establishment of innovation hubs at the countrys state universities has already kick-started Zimbabwes industrial modernisation agenda through the pursuit of the Education 5.0 policy, which has so far seen the Government registering over 500 patents in various fields, thereby aiding national development.\n\nUniversities with innovation hubs and industrial parks so far are the National University of Science and Technology, Midlands State University, University of Zimbabwe, Harare Institute of Technology (HIT), Zimbabwe Defence University, and the Chinhoyi University of Technology.\n\nDespite progress in literacy rates and access to higher education, President Mnangagwa said Africa still faces significant challenges in the education sector, including resource shortages and lack of trained educators.\n\nHe pointed out that about 30 million children in Sub-Saharan Africa, for instance, are out of school and called for increased collaboration among African states in teacher training to address this gap and ensure inclusive education.\n\nZimbabwe is ready to share experiences in this regard, said President Mnangagwa, stressing the importance of knowledge exchange among nations.\n\nTo reduce school absenteeism due to poverty, Zimbabwe has implemented a nationwide School Feeding Programme covering both rural and urban schools.\n\nIn our case as Zimbabwe, increased school infrastructure across the country, especially in new settlements, has ensured that learners do not walk more than 5km to access educational facilities, said President Mnangagwa.\n\nDelegates follow proceedings at the 3rd Africa Education Summit in Victoria Falls yesterday\n\nGovernment has also embarked on a project to sink a borehole at every rural school and village, complemented by nutrition gardens to enhance food security, water access and sanitation in schools.\n\nLet us build on the solid foundation set out at previous engagements under this initiative to leap forward our education systems. To further translate our educational advancement for continental development, it is important to be holistic in our propositions, taking into account the unique African realities, said President Mnangagwa.\n\nThe quality of education varies widely, with many institutions lacking adequate resources and trained educators. These gaps and disparities hinder our ability to harness the full potential of our youth and translate educational advancements into tangible development outcomes, he added.\n\nPresident Mnangagwa further stressed the need for Africa to invest in clean energy and modern infrastructure to fully integrate ICTs, e-learning, and digital transformation in education\n\nLimited access to energy hinders prospects for most African learners, especially those in rural communities. Hence, investments in clean energy, along with modern school infrastructure, must now be deemed a dual necessity, he noted.\n\nCalling for further support for Science, Technology, Engineering and Mathematics (STEM) education, alongside vocational training and digital literacy, he said these will ensure students graduate with skills that empower them to create jobs and establish industries.\n\nOur students should exit education institutions with skills that empower them to create jobs, establish viable industries and solve societal challenges. Therefore, the need to enhance collaboration, scale up synergies and strengthen partnerships cannot be over emphasised, he said.\n\nUnder the Second Republic, President Mnangagwa said Government has increased support for the provision of modern teaching and learning materials.\n\nThese are having a positive impact on learning outcomes and resulting in dynamic teaching-learning processes that benefit both learners and educators. The digital divide remains a significant barrier to educational access across the continent, he said.\n\nLeveraging technology to bridge the educational divide will, in the main, enable even the most remote communities to access quality learning. Our governments have a duty to increase support for infrastructure to broaden digital access and literacy, particularly for students and teachers.\n\nPresident Mnangagwa noted that limited access to energy hinders prospects for most African learners, especially those in rural communities.\n\nHence, investments in clean energy, along with modern school infrastructure, must now be deemed a dual necessity. This is more urgent given the centrality of energy access for the deployment of ICTs, e-learning, innovation and overall digital transformation industrialisation of Africa, he said.\n\nUltimately, e-learning platforms, smart classrooms and Artificial Intelligence driven learning tools should no longer be luxuries but day to day teaching and learning necessities.\n\nUnder the Second Republic, the Government has increased support for modern teaching and learning materials, resulting in improved learning outcomes, said the President. Resource centres and libraries with digital capabilities are being promoted across the country, with the establishment of community information centres and deployment of mobile information buses.\n\nFurthermore, the countrys education reforms have seen curriculum revisions aimed at fostering critical thinking, creativity, and problem-solving abilities.\n\nWe are ensuring that education is accessible to all, regardless of socio-economic background, gender, or disability. Women and girls, in particular, must be empowered to excel in all fields and contribute meaningfully to our continents progress, said President Mnangagwa.\n\nThe 3rd Africa Education Summit is a premier event dedicated to fostering educational advancement across the continent. The event, which started on Thursday and ending today, brought together education ministers, policymakers and stakeholders from across Africa to deliberate on strategies for enhancing the continents education systems in line with Agenda 2063 and Vision 2030.\n\nIt is running under the theme: Translating our Educational Advancement to Continental Development.\n\nThe summit is jointly hosted by Global Skills Hub United Kingdom, Africa Education Stakeholders, and the government of Zimbabwe. It seeks to create a transformative experience that will drive educational and developmental progress across Africa.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/HE1-1.jpg",
            "description": "Mashudu Netsianda in VICTORIA FALLS President Mnangagwa has called for a paradigm shift in Africa’s education systems, urging stakeholders to adopt transformative strategies that equip learners with practical skills to drive the continent’s industrialisation and economic growth. Speaking at the 3rd Africa Education Summit in Victoria Falls yesterday, the President boldly stressed the need for […]",
            "time": "18:30",
            "date": "05 Apr 2025"
        },
        {
            "title": "Corruption scandal rocks city school",
            "url": "https://www.herald.co.zw/corruption-scandal-rocks-city-school/",
            "content": "Emmanuel Kafe, Check Point\n\nBLAKISTON Junior School, a Government primary school in Milton Park, Harare, is at the centre of a corruption scandal that has resulted in nearly US$60 000 being siphoned from its coffers over the past three years, a damning internal audit seen by Check Point has revealed.\n\nAllegations of systematic fraud, bribery, improper procurement and financial mismanagement, have been levelled against the schools administration.\n\nSchool head, Ms Memory Chaikosa, who was suspended on February 17 over the same allegations, school development committee (SDC) chairperson Mr Ronald Gurure and a former SDC bursar Mr Ronald Mashonganyika, are at the centre of the scam, which also implicates some Zimbabwe Anti-Corruption Commission (ZACC) officers (names supplied) and Ministry of Primary and Secondary Education auditors, who allegedly received bribes to cover up the matter.\n\nA confidential SDC draft findings report, which was presented to the school management, shows a US$58 448,50 discrepancy in banked funds.\n\nAccording to the report, the variance was due to unaccounted withdrawals, many of which lacked supporting documentation, including delivery notes, invoices, receipts and quotations, all mandatory requirements under the financial management guidelines for non-finance education managers.\n\nThe report further revealed that the schools financial records for 2022 and 2023 were riddled with inconsistencies.\n\nIn 2022, for instance, a total of US$7 411 was withdrawn, but records showed that US$8 665,01 was spent, indicating a cash shortfall of US$1 254,01.\n\nIn 2023, the school withdrew US$29 292, but only US$22 792,30 was recorded, leaving a balance of US$7 136,70 unaccounted for.\n\nSources said while investigations are still underway, it has become clear that not all withdrawals were backed by proof of expenditure, further raising concerns about the integrity of the schools financial management system.\n\nA draft management report, which has been obtained by Check Point, showed that the schools internal auditors had noted missing receipts that could not be traced back to the bank statements.\n\nBank reconciliations were reportedly not being done properly, exposing the school to potential misappropriation of funds.\n\nThe banking was not done on a daily routine basis, and on days when banking was not done, the school head, Ms Chaikosa, would insist that the money be kept in her office, not in the safe.\n\nShe claimed the safe was unsafe after other schools had been robbed in the past, said a source.\n\nThe report also pointed to huge procurement anomalies.\n\nThe school allegedly bypassed proper procedures when hiring service providers, with procurement records showing discrepancies.\n\nAudit noted the following anomalies in the procurement of goods and services: According to procurement minutes dated January 13, a company named Noah Chirozvi was selected to repair a motor vehicle, but payment was made to Rafferty Zimowa, read the audit report.\n\nFurthermore, when procuring stationery, only two quotations were obtained when Lotus Stationery was selected as the supplier, violating the Public Procurement and Disposal of Public Assets Act.\n\nEven more troubling, the schools security provider, Burlington Security Company, has been operating without a contract since April 2019.\n\nIn the event of theft or burglary, the school may face difficulties in apportioning responsibility and recovering stolen goods, a concerned parent privy to developments at the school said.\n\nThe most alarming part of Check Points findings involves the schools handling of receipts and funds.\n\nA whopping US$400 107,50 was reportedly received by the school between January 2022 and December 2024.\n\nOf that amount, only US$341 659 was banked, leaving US$58 448,50 unaccounted for.\n\nSources have also disclosed an incident involving the schools Yutong bus, which was involved in an accident in March 2024.\n\nDespite the significant damage, the vehicle was allegedly parked in a garage in Tynwald, Harare, and school officials have reportedly avoided discussions on whether to repair or replace it.\n\nInstead, there have been ongoing discussions about purchasing a new minibus.\n\nIn a shocking twist, at least 35 tablets purchased for information and communication technology lessons in early 2024 were reportedly stolen.\n\nBy the end of the year, 21 tablets were missing.\n\nThe school has yet to report the theft to the police or provide any documentation related to the missing devices.\n\nCheck Point has also obtained a letter allegedly from a former SDC bursar, who also doubled as the schools assistant accountant, Mr Ronald Mashonganyika, which was directed to the district schools inspector, who revealed that he was coerced into paying bribes to auditors and ZACC officers in exchange for covering up the schools financial mismanagement.\n\nAccording to Mr Mashonganyika, he was instructed by the school head, Mrs Chaikosa, to hand over money and to ensure that auditors and investigators would leave the school without completing their work.\n\nThey called for a meeting which was never minuted to discuss the underbanking issues. The individuals who attended were Mrs Chaikosa (the head), Mr Gurure (SDC chairperson), Mr Sasunhwa (SDC vice chairperson) and Mrs Nyakutambwa (treasurer).\n\nThe agreement was concluded that I should commit to pay up by June 2025. But these agreements were made on the understanding that both the SDC vice chair and the treasurer were to be given US$200 so that they will not expose the situation to others. This decision came from the SDC chair but I was told by the headmistress.\n\nIn the same letter of response, Mr Mashonganyika claimed he acted under duress from the SDC chairperson, Mr Gurure, and Ms Chaikosa, fearing job loss.\n\nI did so because I was acting under duress from the SDC chair. During the meeting, he pretended not to know about the underbanking, yet he insisted that I give money to the treasurer and the SDC vice-chair. Thats when I realised the procedure was improper; it was forced upon me for job security. I complied and handed the money to the SDC chair.\n\nLater, I was approached again to secure US$650 to expedite the internal auditors departure before they completed their task. This directive came from the SDC chair through the headmistress (Ms Chaikosa) and I obeyed. The underbanking records from January 2025 can corroborate this.\n\nFurthermore, the week before my suspension, I was asked to provide US$300. I had US$260 meant for banking, but the SDC chair insisted the funds were needed to pay anti-corruption officials who were conducting an exercise and familiarising themselves with the school system. I was instructed to bring the money upstairs to the admin office.\n\nMr Mashonganyika detailed these events in a written response to the district schools inspector.\n\nThis development resulted in the suspension of former SDC chairperson Mr Gurure following a vote of no confidence. The decision was formalised in a letter dated February 18, signed by the acting chairperson.\n\nWith reference to the above matter, you are alleged to have connived to bribe the ZACC investigation officer, who alleged that Ronald Mashonganyika (assistant accountant), the headmistress Ms Chaikosa and the SDC chairperson Mr R. Gurure connived to bribe ZACC officials, and internal auditors so that they cover up the misconduct of their underbankings, it is alleged that you were given US$300 to give ZACC and US$650 to internal auditors . . .\n\n. . . therefore, you are no longer allowed as of now, to perform any form of duties pertaining to Blakiston Junior School SDC business and you should surrender all powers, documents and any other property you might have in possession.\n\nIn his defence, the former SDC chairperson, Mr Gurure, told Check Point that through his lawyers, he intends to file a defamation lawsuit if the school fails to substantiate the corruption allegations.\n\nCorrespondence from Mr Gurures lawyers to the acting SDC chairperson, which Check Point has obtained, states: . . . we believe due procedure was not followed and we are very eager to take up this matter in terms of the law.\n\nIn light of the above, we insist that you provide the requested details within 24 hours of receipt of this letter, failure of which we will proceed to file a lawsuit of defamation of character . . . reads part of the communique.\n\nIn a letter dated February 26, the acting chairperson responded via legal counsel: Kindly be advised that your client was relieved of his duties as the SDC chairman of Blakiston Primary School pursuant to a resolution of the SDC which passed on the 18th of February 2025.\n\nFurther, kindly be advised that we do not have instructions to respond to other allegations levelled against your client for the matter is under investigation with the Zimbabwe Anti-Corruption Commission.\n\nNorthern Central District Schools inspector Mr Mafudzi Mafukidze said a team of investigators had been deployed to look into the matter.\n\nWe have dispatched a team of auditors and inspectors, who are currently compiling a report. The school head (Ms Chaikosa) has since been suspended.\n\nOur investigation is underway, and the report will be released soon. The team will present their recommendations next week (this week), after which we will take action, he said.\n\nMr Mafukidze said while the unaccounted funds may not amount to exactly US$58 000, the figure runs into thousands of dollars.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/10/corruption-.png",
            "description": "Emmanuel Kafe, Check Point BLAKISTON Junior School, a Government primary school in Milton Park, Harare, is at the centre of a corruption scandal that has resulted in nearly US$60 000 being siphoned from its coffers over the past three years, a damning internal audit seen by Check Point has revealed. Allegations of systematic fraud, bribery, […]",
            "time": "18:30",
            "date": "05 Apr 2025"
        },
        {
            "title": "Zim targets 1,8m tonnes of maize from irrigation",
            "url": "https://www.herald.co.zw/zim-targets-18m-tonnes-of-maize-from-irrigation/",
            "content": "Precious Manomano, Herald Reporter\n\nZIMBABWE is on track to harvest over 1,8 million tonnes of maize from 350 000 hectares that were put under irrigation in the summer cropping season.\n\nAn additional 1,4 million tonnes of irrigated wheat, barley and potatoes are expected in winter.\n\nZimbabwes annual maize requirement is approximately 2,2 million tonnes, with 1,8 million tonnes for human consumption and 400 000 tonnes for livestock feed.\n\nAccording to a report presented by the Permanent Secretary for Lands, Agriculture, Fisheries, Water and Rural Development, Professor Obert Jiri, to the Parliamentary Portfolio Committee on Agriculture recently, the country needs at least 350 000 hectares of functional irrigated land as the minimum capacity to ensure that the nation becomes food self-sufficient regardless of climate.\n\nTo achieve this, the projected area to be developed is 496 000 hectares, made up of the current developed and functional 217 000 hectares, and 275 000 hectares of additional area required during winter, he said.\n\nCabinet approved the Accelerated Irrigation Rehabilitation and Development Plan in 2021 with the aim of developing 350 000ha for summer irrigation by 2025.\n\nThis was meant to produce 1.8 million tonnes of summer cereals annually at 5 tonnes per ha, which is enough to feed the nation and generate a surplus annually.\n\nThe ministry also estimates that with improved efficiencies, more use of groundwater, and use of transboundary water resources such as Kariba Dam, the Zambezi and Limpopo rivers, a total identified potential irrigable area of 2 244 835ha can be developed, more than 10-times the 217 000 hectares now regarded as functional.\n\nDams such as Tugwi Mukosi in Masvingo have the capacity to irrigate 40 000ha in Chiredzi and Chivi.\n\nMarovanyati Dam in Manicaland has the capacity to irrigate 1 250ha in Buhera, while Muchekeranwa dam in Mashonaland East has the capacity to irrigate 1 400ha in Makoni and Marondera.\n\nMutirikwi dam in Masvingo will irrigate 3 000ha in Masvingo.\n\nLilstock dam in Mashonaland Central is expected to irrigate 7 000ha in Bindura, Mazowe, and Mt Darwin while Biri dam in Mashonaland Central is expected to irrigate 4 000ha in Zvimba and Makoni.\n\nDams under construction are expected to irrigate 38 953 ha, with Semwa in Mashonaland Central having the potential to irrigate 12 000 ha in Rushinga, Gwayi Shangani in Matabeleland North to irrigate 10 000 ha in Hwange, and Bindura dam in Mashonaland Central expected to irrigate 1 240ha. Tuli Manyange will irrigate 2 400ha in Gwanda, Dande dam in Mashonaland Central will irrigate 4 000ha in Guruve, Ziminya Dam in Matabeleland North will irrigate 4 500ha in Nkayi, and Vungu in Midlands will irrigate 2 513 ha.\n\nProfessor Jiri said Zimbabwe had plans for the creation of irrigated green belts for year-round cropping, such as the opening of 50 000 hectares of new irrigated land along the Tugwi, Runde, and Mwenezi rivers, taking advantage of Tugwi Mukosi Dam, Manyuchi Dam, and the proposed Runde Tende Dam.\n\nThere was an immediate revitalisation of above 2500ha of irrigated land at Middle Save, and the opening of 10 000ha of new irrigated land in Mbire District, 3 000ha in Dande Communal Area, 5 000 hectares in Angwa Block, and the opening of 15 000ha of new irrigated land in Binga to utilise the Zambezi water.\n\nCurrently, there are 460 documented smallholder irrigation schemes with a total developed area of 26 173 ha directly benefitting 35 585 households.\n\nThe Government has introduced the Vision 2030 Accelerator Model, which is a business model for rural irrigation transformation that will be accelerated at speed and pace.\n\nThis model is being rolled out to 460 irrigation scheme business units across the country under 26 000 ha of land, and to date, 348 out of 460 irrigation scheme business units have been boarded.\n\nThe model is also being used to manage 35 000 village business units, 9 600 school business units, and 68 vocational training centre business units.\n\nThe plan under the village business unit programme is for 35 000 companies across villages, each with a solar-powered borehole and solar-driven intensive agriculture production linked to aggregation, value addition, and beneficiation centres.\n\nThe irrigable area of land gazetted for joint ventures is 20 686 hectares, with Manicaland covering 1 628ha, Mashonaland Central at 9 385.5ha, Mashonaland East with 5 600ha, Mashonaland West at 1 437.5ha, Masvingo contributing 378.5ha, Matabeleland North at 306ha, Matabeleland South with 887ha, and the Midlands covering 1 066ha.\n\nHigh-impact dams have been constructed across the country, such as Marovanyati, Muchekeranwa, Chivhu, Gwayi-Shangani, Kunzvi, Tuli-Manyange, Dande, and Ziminya Dams, as well as Tugwi-Mukosi Dam.\n\nModern conveyancing and irrigation development around these facilities have the potential to realise multi-pronged benefits in terms of expanding the national area of irrigable land, ensuring food security, supporting agro-based industries, and generating broader economic ripple effects.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/04/Professor-Obert-Jiri.jpg",
            "description": "Precious Manomano, Herald Reporter ZIMBABWE is on track to harvest over 1,8 million tonnes of maize from 350 000 hectares that were put under irrigation in the summer cropping season. An additional 1,4 million tonnes of irrigated wheat, barley and potatoes are expected in winter. Zimbabwe’s annual maize requirement is approximately 2,2 million tonnes, with […]",
            "time": "18:30",
            "date": "05 Apr 2025"
        },
        {
            "title": "‘Country’s detractors will fail’",
            "url": "https://www.herald.co.zw/countrys-detractors-will-fail/",
            "content": "Blessings Chidakwa, Zimpapers Politics Hub\n\nEFFORTS by some renegade former Zanu-PF officials to unseat the democratically elected Government of Zimbabwe will fail dismally, a senior official has said.\n\nSpeaking at a rally to drum up support for Zanu PF Glen View South Constituency candidate Cde Tsitsi Tranquillity Tawomhera in Harare on Wednesday, Zanu PF Mashonaland East Provincial Chairman, who is also the Local Government and Public Works Minister, Cde Daniel Garwe, said efforts by some former Zanu PF officials to unconstitutionally undermine or remove the democratically elected Government would come to grief.\n\nHe said the ruling party and Government are solidly behind the leadership of President Mnangagwa.\n\nPresident Mnangagwa won the election (in 2023). Now, in his second term, some people are already plotting, saying they cant wait for his term to end and are calling for demonstrations to remove him. What do they mean they cant wait?\n\nThere is no office without a leader. Cde Mnangagwa is our President, whether they like it or not, Cde Garwe said.\n\nHe said President Mnangagwa has the people at heart, as demonstrated by life-changing development programmes, including the Emergency Road Rehabilitation Programme (ERRP) and the Presidential Borehole Scheme.\n\nThe developmental programmes spearheaded by President Mnangagwa give us an advantage and show that our leader is pragmatic and committed to the people. Road rehabilitation is ongoing under ERRP, and the borehole scheme is progressing countrywide, Cde Garwe said.\n\nHe also took a swipe at fugitive former Zanu PF member Blessed Geza.\n\nA stray dog always has an owner. If you want to know its master, beat the dog, and the owner will come out. If you want to find out the mother of a puppy, grab the puppy, and the mother will bark and charge at you.\n\nRight now, we are dealing with Geza. Even if he calls for demonstrations, do not be misled, said Cde Garwe.\n\nThanking citizens for ignoring Gezas calls for protests, Cde Garwe challenged him to come out of hiding and face him directly.\n\nI will make Geza wear an apology jersey for his rebellious utterances. Let me warn you, Geza do not rebel against Zanu PF again. Comrades, tell Geza the time for rebels is over.\n\nGeza, stay in South Africa with (Saviour) Kasukuwere if you want.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Cde-Daniel-Garwe.jpg",
            "description": "Blessings Chidakwa, Zimpapers Politics Hub EFFORTS by some renegade former Zanu-PF officials to unseat the democratically elected Government of Zimbabwe will fail dismally, a senior official has said. Speaking at a rally to drum up support for Zanu PF Glen View South Constituency candidate Cde Tsitsi Tranquillity Tawomhera in Harare on Wednesday, Zanu PF Mashonaland […]",
            "time": "18:30",
            "date": "05 Apr 2025"
        },
        {
            "title": "VP Mohadi advocates  all-inclusive education",
            "url": "https://www.herald.co.zw/vp-mohadi-advocates-all-inclusive-education/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nVICE President Kembo Mohadi yesterday reaffirmed the Governments commitment to establishing all-inclusive schools across the nation, ensuring that no child is denied access to education due to discriminatory practices.\n\nIn a speech delivered by Matabeleland South Minister of State for Provincial Affairs and Devolution Dr Evelyn Ndlovu, VP Mohadi said discrimination based on race, ethnic origin, political views, or gender is unacceptable under the Second Republic.\n\nHe highlighted the constitutional right to education for all citizens and permanent residents, urging schools to foster an environment that encourages children to thrive academically.\n\nThere should be no discriminatory tendencies in any form and manner when admitting children to school, but, instead they should be motivated to develop a sharp focus and zeal to prosper at school, said the VP.\n\nHe added that the right to education, especially for school-going children, is fundamental to societal development.\n\nAt the commissioning of the solarised borehole at Beitbridge Mission Primary School, which also has boarding facilities for learners with disabilities, VP Mohadi outlined several initiatives aimed at enhancing educational access.\n\nThis school is notable for being the only facility in Matabeleland South province that provides boarding for students with disabilities, showcasing a commitment to inclusivity.\n\nThe solarised borehole, sourced and equipped by TelOne, is expected to significantly improve water access for the school, which is crucial for various agricultural projects being implemented. These include poultry rearing, a nutritional garden, a tuckshop, and even fish farming.\n\nWater is the source of life to all of us. I am also continuously indebted to this school where my foundation in education was established, VP Mohadi said, emphasising the importance of addressing basic needs to support education.\n\nIn addition to infrastructure improvements, laptops and computers were donated to the school by the VP.\n\nDiscovery Ambulances provided training on first aid to 70 learners, further enhancing the safety and health education of the students.\n\nThis multifaceted approach aims to create a supportive and enriching environment for all learners.\n\nThe education sector mainly falls under the Governance and Inclusive Economic Growth pillars with the pathway towards realisation of Vision 2030, said VP Mohadi.\n\nHe said the national constitution mandates the right to basic State-funded education, which the Government must progressively make available and accessible.\n\nDuring his visit, the VP also acknowledged the role of community and business stakeholders in improving educational services.\n\nBy the way, in giving back to the community, it is significant to respond to the challenges that, when addressed, will provide the need to bridge gaps, he said.\n\nVP Mohadi called on the business community to assist where they can, reinforcing the idea that collective efforts can lead to meaningful change.\n\nTelOnes CEO, Engineer Lawrence Nkala, echoed this sentiment, emphasising the importance of corporate social responsibility.\n\nHe said TelOne has five key corporate investment clusters, including health, education, social welfare, environment, and women and girls empowerment.\n\nEach of these clusters plays an integral role in feeding into the Sustainable Development Goals (SDGs), which aim to address global challenges such as poverty, inequality, climate change, environmental degradation, peace, and justice, said Eng Nkala.\n\nIn addition to the solarised borehole donation, TelOne contributed 5 000 exercise books for the learners at Beitbridge Mission Primary School, along with a Starlink kit that includes a three-month subscription to boost internet connectivity. This donation will ensure that both students and teachers have access to the latest information and educational resources.\n\nVP Mohadis visit aims not only to improve educational infrastructure but also to foster a culture of continuous learning and development. He reiterated that adequate water supply will ensure proper sanitation facilities promoting dignity and well-being of learners.\n\nThis holistic approach to education is essential for creating a healthier and more productive learning environment.\n\nThe collective efforts of the Government, private sector, and community members are poised to transform the educational landscape in Beitbridge and beyond, ensuring that the rights of every child to quality education are upheld.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/EN.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau VICE President Kembo Mohadi yesterday reaffirmed the Government’s commitment to establishing all-inclusive schools across the nation, ensuring that no child is denied access to education due to discriminatory practices. In a speech delivered by Matabeleland South Minister of State for Provincial Affairs and Devolution Dr Evelyn Ndlovu, VP Mohadi said discrimination […]",
            "time": "18:30",
            "date": "05 Apr 2025"
        },
        {
            "title": "Investment in youths critical: VP Chiwenga",
            "url": "https://www.herald.co.zw/investment-in-youths-critical-vp-chiwenga/",
            "content": "Mukudzei Chingwere, Herald Reporter\n\nYOUNG people are creative and passionate, which are critical ingredients for progress, and investing in them is essential to fortify the fabric of society, Vice President Dr Constantino Chiwenga said last night.\n\nHe was speaking at a fundraising event in Harare aimed at supporting youth participation in the upcoming Roman Catholic church Jubilee Year of the Youth Pilgrimage in Rome, Italy.\n\nWe gather not just to fundraise but to unleash the extraordinary power that lives within our youth, said VP Chiwenga.\n\nTheir creativity and passion are vital for progress. Investing in our youth is, in fact, strengthening the very foundation of our society.\n\nI, therefore, encourage you to reflect on the impact your generosity can make in shaping their lives. Think of the moments in your own lives when you were uplifted or inspired by the kindness of fellow congregates, friends, and strangers.\n\nThis is an opportunity for you to make a positive impact in the lives of our youth.\n\nHighlighting the potential of youths, the VP urged them to be mindful of their choices during these formative years.\n\nAs you navigate this pivotal stage in your lives, be mindful of your choices; they shape not only your destiny but the future of our communities, said VP Chiwenga.\n\nWe are surrounded by challenges, temptations such as drugs and substance abuse, crime, unemployment and teenage pregnancies that can divert our paths.\n\nRemember, substance abuse is not only a harmful phase; it affects your health, leads to a cycle of despair, and hinders your potential.\n\nHe urged youths to embrace healthier coping mechanisms, adding that they have the strength and potential to rise above all the vices.\n\nEngage in sports, arts, and meaningful friendships that inspire you to achieve great things.\n\nThe Jubilee journey is one such good adventure that will inspire you in your growth journey. It is an opportunity that will remind you that you are valued, cherished and deserving of a better future.\n\nAs you go through the Door of Hope, during the pilgrimage, remember, true strength lies in making rational choices, not succumbing to instant gratification. Let us all strive to do good and be exemplary, said VP Chiwenga.\n\nHe also acknowledged the financial barriers that may prevent many people from participating in the pilgrimage to Rome, which holds profound spiritual significance.\n\nThe Jubilee Year offers a unique opportunity for renewal, reflection and reconciliation.\n\nIt is a call to deepen your faith and explore your identity while building a future rooted in love and unity.\n\nYet, we recognise that financial hurdles can impede many youths from seizing this life-changing pilgrimage to Rome.\n\nThey dream of walking the same streets that have inspired millions before them, of standing in the presence of the Holy Father, and of connecting with fellow pilgrims from around the world. Without our collective support, these dreams may remain just that, dreams. Let us therefore ensure that these dreams become a reality, said VP Chiwenga.\n\nThe VP was accompanied by his wife Colonel Miniyothabo Chiwenga, senior Government officials and some family members.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/VP.jpg",
            "description": "Mukudzei Chingwere, Herald Reporter YOUNG people are creative and passionate, which are critical ingredients for progress, and investing in them is essential to fortify the fabric of society, Vice President Dr Constantino Chiwenga said last night. He was speaking at a fundraising event in Harare aimed at supporting youth participation in the upcoming Roman Catholic […]",
            "time": "18:30",
            "date": "05 Apr 2025"
        },
        {
            "title": "EDITORIAL COMMENT: ZIFA branding move a welcome initiative",
            "url": "https://www.herald.co.zw/editorial-comment-zifa-branding-move-a-welcome-initiative/",
            "content": "FOR so many years, the Zimbabwe Football Association (ZIFA) have been blamed for not having both the will and wherewithal to take the countrys biggest sporting game as the big global industry that it has been.\n\nThe world over, football has evolved into a billion-dollar industry that has transformed players into millionaires, changed the lives of coaches, administrators and even the communities where clubs operate.\n\nSadly, for Zimbabwe, the sport has been lagging behind with successive ZIFA executive committees failing to come up with strategies that match the commercialisation that has become the hallmark of football.\n\nThat ZIFA had last had a meaningful strategic plan in 2014 sounded like a script plucked from some fiction book.\n\nYet that was the stark reality as the association tottered aimlessly and became notorious for taking the begging bowl to the Government in particular and corporates in general at the 11th hour.\n\nHowever, since the era of the FIFA-appointed Normalisation Committee ZIFA have gradually turned on a new leaf in the manner in which they have been going about their business.\n\nFor over a year, ZIFA were under the administration of FIFA via Lincoln Mutasas Normalisation Committee with the world football governing body insisting on implementation of systems in the governance of the game.\n\nRefreshingly the new executive committee that was ushered into office on January 25 on a four-year mandate have shown promising signs to carry on from where Mutasa and his colleagues who included Rosemary Mugadza, Sikumbuzo Ndebele, Nyasha Sanyamandwe and Cynthia Malaba left of.\n\nAlmost every second week since he assumed office, ZIFA president Nqobile Magwizi has either been stringing commercial deals or announcing policies and measures aimed at enhancing the development of the game and also tapping into the vast commercial value in football.\n\nThis week Magwizis ZIFA broke with tradition and opted to involve Zimbabweans in the branding of the national teams starting with the flagship side the Warriors.\n\nIn the year that the Warriors will be making their sixth appearance at the Africa Cup of Nations, ZIFA wants them to wear kits that are designed by Zimbabweans and which tell a story and reflect the true identity of this beautiful Southern African country.\n\nIt is indeed the beckoning of exciting times for domestic football when its citizens can proudly take ownership of the kits that their national teams will be wearing.\n\nAccording to Magwizi, for the next six weeks, it will be a roller-coaster ride as the creative talents of Zimbabweans are out to the test to design and brand the kits that the Warriors will wear at the AFCON tournament scheduled for Morocco in late December to early January.\n\nThis follows the launch of a national campaign by ZIFA yesterday appealing to local designers and football enthusiasts to design unique and inspiring brands and kits that reflect Zimbabwes football passion.\n\nThe ground-breaking initiative, dubbed the Warrior Pride: Brand Design Battle, was announced by ZIFA president Nqobile Magwizi in Harare, and will run for the next six weeks.\n\nZIFA have also put in a US$3 000 cash prize, and an all-expenses paid-for trip to watch the Warriors opening match against Egypt at the AFCON tournament.\n\nBut more importantly is the realisation by ZIFA that they could actually rake in more from the sale replicas that are made by the countrymen and women rather incurring huge import bills.\n\nZimbabwes northern neighbours Zambia have already undertaken that route and it has reaped rewards for them after decades of flirting with various brands like Puma, Adidas, Joma and Nike.\n\nWhile such big global brands like Adidas, Umbro and Puma remain the torch bearers, the initiative by ZIFA to have an indigenously designed and style kit must be applauded.\n\nThat the Uganda Football Association have reportedly done it successfully with the Cranes kits, shows that with aggressive marketing and affordable pricing, it can also be achieved in a country where football fans are also crazy about their Warriors.\n\nWhile it has its commercial spin where instead of splashing about millions of dollars importing kits, ZIFA could cut on the costs and have custom-made outfits that could give the Warriors a unique identity whenever they step onto the pitch.\n\nApart from the funding they get from FIFA via grants, ZIFA need to create more avenues that guarantee sustained growth of football whether it is in Area Zones, districts, provinces, regions, primary and secondary schools and tertiary institutions.\n\nAs Magwizi aptly put it: It is a groundbreaking national campaign that puts the creative power into the hands of Zimbabweans. For the first time, we are inviting graphic designers, artists, football fans, and creative minds across Zimbabwe to shape the future identity of our national football teams.\n\nThis is your chance to design a brand and kit that truly represents the spirit, resilience, and unity of Zimbabwe in football.\n\nThis initiative is designed to engage the nation in the creative process of branding our national teams. Of course, encourage creativity and participation from designers and football enthusiasts, as well as showcase our national pride through unique and inspiring designs, said Magwizi.\n\nThe campaign is more than just a competition as it seeks to rally the cross-section of Zimbabweans behind the national teams and it is also another fan engagement exercise and that effect such hashtags like #WarriorPride and #ZimKitChallenge, have been crafted in a bid to the initiative into a huge national sporting movement that should unite Zimbabweans through design and football.\n\nWe believe such legacy initiatives not only deserve to be given a chance but must be supported.\n\nWe also urge ZIFA to be transparent in the manner the adjudication is done and to ensure the ground-breaking ceremony that will spur on other sporting codes like rugby, cricket, athletics and netball to follow suit.\n\nMaybe, ZIFA have really turned the corner and watch with excitement as the commercialisation drive takes shape.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/10/Zimbabwe-Football-Association.jpg",
            "description": "FOR so many years, the Zimbabwe  Football Association (ZIFA) have been blamed for not having both the will and wherewithal to take the country’s biggest sporting game as the big global industry that it has been. The world over, football has evolved into a billion-dollar industry that has transformed players into millionaires, changed the lives […]",
            "time": "18:30",
            "date": "05 Apr 2025"
        },
        {
            "title": "DeMbare, Gem Boys clash: 12th man factor at play",
            "url": "https://www.herald.co.zw/dembare-gem-boys-clash-12th-man-factor-at-play/",
            "content": "Ray Bande in MUTARE\n\nWHEN Harare giants Dynamos and Mutare miners Manica Diamonds lock horns today at Sakubva Stadium in a potentially explosive Castle Lager Premiership encounter, all eyes will not only be on the field of play, but also in the terraces where innovative supporters of the game are providing an exhilarating side bar that usually captures the imagination of all in attendance.\n\nOf late Mutare, just like many other match venues across the country, the Manica Diamonds supporters have not lagged behind in creating comic animation as well as an electric atmosphere that captivates their players on the field of play.\n\nNo wonder todays DeMbare and Gem Boys clash will likely be fought both on the pitch and in the terraces as the home team fans have vowed make their presence felt.\n\nIn the past, Dynamos, because of their numbers, have easily annihilated their opponents fans and no matter the match venue.\n\nIn fact, DeMbare could easily be mistakenly taken for the home team.\n\nBut in an age where supporters, like football players, are being paid for their allegiance, many clubs across the country now have their own supporters armed with unique and eye catching pranks and frolics in the terraces.\n\nManica Diamonds secretary-general Sugar Chagonda said his team is ready for Dynamos, but was quick to emphasise the importance of having their fans in their numbers for this tricky encounter.\n\nWe are ready for the match. It is all systems go. As you have seen we started the season well as opposed to previous seasons. We are taking every match as it comes.\n\nWe appreciate the fact that there are no small teams in the league. The league is now very competitive with no room for chancers and we are taking it as such.\n\nDynamos is a big brother we have much respect for them, but I am sure by now they know that we do not read too much into their age. Reports from camp indicate that the boys are ready and raring to go.\n\nI want to implore to our 12th player, the fans come in numbers and enjoy the match. Their invaluable support is imperative in giving the boys grim determination and tremendous inspiration, said Chagonda.\n\nManica Diamonds Supporters Association chairperson Brian Chibwana, weighed in saying: Yes, the Dynamos match will be a mouthwatering one and a real test to our preparedness as the season progresses. Dynamos is really a brand in Zimbabwean football but with the baby steps that Manica Diamonds is taking, we will put out our A performance so as to appease some half-hearted followers.\n\nA tough match it is, but we hope as fans we will be able to rise to the occasion and hopefully the football gods will smile at us, considering that Dynamos will be buoyed by their last weeks performance against Simba Bhora.\n\nTheir fans, as usual, will come out in their numbers and they will come out guns blazing to continue that feat from last week, but we as Manica Diamonds have enough arsenal to repel their attacks and even come good after 90 minutes.\n\nWe are still smarting from yesteryears events when they equalised in injury time in the Chibuku competition and that gives us reason enough for us as fans to keep rooting for our team to the final whistle. As supporters we will be given our all from the terraces, I hope our voices will give the boys the much-needed adrenalin.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/fans.jpg",
            "description": "Ray Bande in MUTARE WHEN Harare giants Dynamos and Mutare miners Manica Diamonds lock horns today at Sakubva Stadium in a potentially explosive Castle Lager Premiership encounter, all eyes will not only be on the field of play, but also in the terraces where innovative supporters of the game are providing an exhilarating side bar […]",
            "time": "18:30",
            "date": "05 Apr 2025"
        },
        {
            "title": "Deputy head flees amid sodomy allegations",
            "url": "https://www.herald.co.zw/deputy-head-flees-amid-sodomy-allegations/",
            "content": "Midlands Bureau\n\nIN the heart of Mberengwa, Masase High School stood as a beacon of hope for many families, a place where dreams flourished under the guidance of dedicated teachers.\n\nHowever, beneath its storied walls, a dark secret festered  one that would shatter the lives of many.\n\nAnywhere Gumbo, the deputy headmaster, was once regarded as a charismatic figure in the community. With his warm smile and open-door policy, he seemed to embody the spirit of mentorship. Parents trusted him, believing he had their childrens best interests at heart.\n\nYet, as the saying goes, appearances can be deceiving.\n\nFor some time now, Gumbo had allegedly exploited his position, luring over 35 boys into his office under the guise of offering academic help. The boys, eager to please and afraid of disappointing an authority figure, found themselves trapped in a nightmare.\n\nThe breaking point came when an anonymous letter reached the Ministry of Education, detailing the horrific abuse allegations.\n\nThe letter, penned by a fellow teacher who suspected something was amiss, ignited a chain reaction. Investigators descended upon the school, only to find that Gumbo had vanished into thin air, leaving behind a trail of anguish.\n\nMidlands provincial police spokesperson, Inspector Emmanuel Mahoko, said Gumbo remains at large.\n\nSources say Gumbo would lure pupils to his office to sexually abuse them.\n\nThe police and officials from the Ministry of Education have been on the ground after they received an anonymous letter from one of the teachers over the issue, said a source.\n\nThe school head has a very tight policy which requires pupils to talk to him if they want to report anything, and this has seen the majority of the pupils being sodomised in silence, said a parent whose child is among the victims.\n\nSome parents and teachers accuse the head, Mr Albion Masukume, of trying to suppress the scandal.\n\nMr Masukume confirmed the probe in a letter to parents but denied involvement.\n\nI write with sorrow to inform you that allegations of child abuse by one of our staff members were reported.\n\nCurrently, thorough investigations by the Ministry of Primary and Secondary Education and the police are underway, he said in the letter.\n\nMasase High is run by the Evangelical Lutheran Church of Zimbabwe (ELCZ).\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Anywhere-Gumbo.jpg",
            "description": "Midlands Bureau IN the heart of Mberengwa, Masase High School stood as a beacon of hope for many families, a place where dreams flourished under the guidance of dedicated teachers. However, beneath its storied walls, a dark secret festered – one that would shatter the lives of many. Anywhere Gumbo, the deputy headmaster, was once […]",
            "time": "18:30",
            "date": "05 Apr 2025"
        }
    ]
}