{
    "news": [
        {
            "title": "Magaya’s application dismissed, Zifa elections to proceed",
            "url": "https://www.herald.co.zw/magayas-application-dismissed-zifa-elections-to-proceed/",
            "content": "Tadious Manyepo\n\nAll is now set for Saturdays watershed ZIFA elections after High Court judge Justice Chitapi dismissed an application for review filed by one of the presidential candidates Walter Magaya.\n\nThe latter was excluded from running for the post on grounds that he doesnt have the minumum requirement of 5 Ordinary Level passes.\n\nIt is against this background that the cleric then approached the courts seeking for a review which could have stopped or delayed Saturdays election.\n\nIn his submission, through his lawyer Thabani Mpofu, Magaya had argued that he had submitted certificates and diplomas from South African higher learning institutions which he argued were far better than the Ordinary Level passes.\n\nHe argued that by demanding a minimum of 5 O Level passes or equivalent, the ZIFA statutes were flawed and grossly unreasonable.\n\nStanding for ZIFA Normalization Committee, Lovemore Madhuku had argued that Magaya was just supposed to avail the requirement.\n\nAnd Justice Chitapi said if Magaya had the requisite qualification, he ought to have submitted them including on his CV which formed part of his outline.\n\nAnd he dismissed Magayas application with each part set to settle the costs of the hearing.\n\nMagayas only hope now lies with the Court of Arbitration for Sport (CAS) where he also reported his case.\n\nBut for now, the six candidates listed for the ZIFA presidency including Phillemon Machana, Martin Kweza, Makwinji Soma Phiri, Twine Phiri and Nqobile Magwizi can roll their sleeves for Saturdays showdown which will also see the election of two vice presidents and six ordinary board members.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Walter-Magaya-680x380.jpg",
            "description": "Tadious Manyepo All is now set for Saturday’s watershed ZIFA elections after High Court judge Justice Chitapi dismissed an application for review filed by one of the presidential candidates Walter Magaya. The latter was excluded from running for the post on grounds that he doesn’t have the minumum requirement of 5 Ordinary Level passes. It […]",
            "time": "18:41",
            "date": "23 Jan 2025"
        },
        {
            "title": "Live Coverage: Magaya High Court case ruling this afternoon",
            "url": "https://www.herald.co.zw/live-coverage-magaya-high-court-case-ruling-this-afternoon/",
            "content": "13.57 The case in which Walter Magaya is seeking to have the High Court stop the watershed ZIFA elections on Saturday will be determined this afternoon by Justice Tawanda Chitapi.\n\nOur Reporter Tadious Manyepo will provide live coverage of this story as the day progresses, so you may remain glued to your screens for the latest information on this.\n\nMagayas name was excluded from the presidential aspirants ballot on December 23 and the cleric was not furnished with a record as per ZIFAs code.\n\nIt later emerged that he had been removed because he didnt submit his Ordinary Level results on his nomination papers.\n\nThrough his legal counsel Thabani Mpofu, Magaya argued that he should have been given seven days as per the dictates of the electoral code to submit the academic qualifications.\n\nLovemore Madhuku represented the ZIFA Normalization Committee during the hearing last week and all attention is on the judgement to be delivered this afternoon.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/07/high-court-of-zimbabwe-01.jpeg",
            "description": "13.57 – The case in which Walter Magaya is seeking to have the High Court stop the watershed ZIFA elections on Saturday will be determined this afternoon by Justice Tawanda Chitapi. Our Reporter Tadious Manyepo will provide live coverage of this story as the day progresses, so you may remain glued to your screens for […]",
            "time": "18:41",
            "date": "23 Jan 2025"
        },
        {
            "title": "Bulawayo man strangled to death by his passenger",
            "url": "https://www.herald.co.zw/bulawayo-man-strangled-to-death-by-his-passenger/",
            "content": "Crime Reporter\n\nA 50-year-old Bulawayo man was strangled to death with a seat belt by a man he had offered a lift on Tuesday.\n\nAlbert Tshuma was in the company of his son (age not given) when the incident occurred along Randum Road in Upper Rangemore.\n\nThey were travelling in a Honda CVR.\n\nInvestigations revealed that Tshuma offered a lift to the unidentified assailant who then produced a pistol and ordered him to follow an unregistered BMW vehicle that was in front of him.\n\nAfter Tshumas vehicle ran out of fuel, the assailant strangled him with a seat belt and then drove off in the BMW.\n\nNational police spokesperson, Commissioner Paul Nyathi confirmed the incident.\n\nThe ZRP is investigating a case of murder that occurred along Randun Road, Upper Rangemore in Bulawayo on January 21. Albert Tshuma died in the incident.\n\nThe victim and his son were travelling in a Honda CRV. They offered a lift to an unknown male suspect before he produced a firearm and instructed them to follow an unregistered BMW that was in front of them.\n\nThe suspect strangled the victim with a seat belt after his vehicle had run out of fuel and he drove off in a BMW vehicle. The victims body was conveyed to Bulawayo Hospital for post-mortem. Anyone with information can report at the nearest police station, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/02/death.jpg",
            "description": "Crime Reporter A 50-year-old Bulawayo man was strangled to death with a seat belt by a man he had offered a lift on Tuesday. Albert Tshuma was in the company of his son (age not given) when the incident occurred along Randum Road in Upper Rangemore. They were travelling in a Honda CVR. Investigations revealed […]",
            "time": "18:41",
            "date": "23 Jan 2025"
        },
        {
            "title": "High Court dismisses bail appeal in US$9 million fraud case",
            "url": "https://www.herald.co.zw/high-court-dismisses-bail-appeal-in-us9-million-fraud-case/",
            "content": "Fidelis Munyoro\n\nThe legal battle for business partners Moses Mpofu and Mike Chimombe took another turn today as the High Court dismissed their bid for bail pending trial.\n\nThe duo stands accused of defrauding the City of Harare of a staggering US$9 million in a fraudulent streetlight tender deal.\n\nJustice Benjamin Chikowero presided over the matter.\n\nAdvocate Tapson Dzvetero, who is representing Mpofu, told journalists outside the High Court: Our appeal has been thrown out. The judge said the reasons will be made available in due course. We are now awaiting the judgment to determine our next course of action.\n\nThe allegations that Mpofu and Chimombe are facing stem from the Harare City Councils streetlight rehabilitation project that was initiated in January last year.\n\nIt is understood that the council got bids from 11 companies, including Mpofus Juluka Endo Joint Venture (Pvt) Ltd.\n\nHowever, Mpofus company failed to meet the tender requirements, which included providing stamped audited financial statements for the last two years, proof of payment for the special procurement oversight committee, and administration fees.\n\nCouncil officials allegedly permitted Mpofu to resubmit his bid. Mpofu allegedly then submitted falsified documents.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/10/Mike-Chimombe-and-Moses-Chimombe.jpg",
            "description": "Fidelis Munyoro The legal battle for business partners Moses Mpofu and Mike Chimombe took another turn today as the High Court dismissed their bid for bail pending trial. The duo stands accused of defrauding the City of Harare of a staggering US$9 million in a fraudulent streetlight tender deal. Justice Benjamin Chikowero presided over the […]",
            "time": "18:41",
            "date": "23 Jan 2025"
        },
        {
            "title": "Mtukudzi: Six years on",
            "url": "https://www.herald.co.zw/mtukudzi-six-years-on/",
            "content": "Trust Khosa\n\nToday marks six years since the passing of the iconic crooner, Oliver Tuku Mtukudzi.\n\nThe icon lost his battle with diabetes complications on January 23, 2019, at a Harare hospital.\n\nHe was 66 years old at the time of his death and left behind an impressive legacy of over 60 albums.\n\nTuku was declared a national hero, and his remains were interred at his Madziwa home in Mashonaland Central Province.\n\nCommemorative festivities have since become a staple on the showbiz calendar, with his family, friends, and arts promoters organising various activities to celebrate the remarkable body of work he built over four decades.\n\nOn February 2, the Oliver Mtukudzi Half Marathon which is organised by events planner Sylvia Sanyanga will take centre stage at Pakare Paye in Norton.\n\nThis years edition, which is the fourth, aims to raise awareness about diabetes complications.\n\nOrganisers anticipate a full house in Norton.\n\nTukus family, friends, and fans established the marathon as a tribute to his memory, offering participants a choice between 5 km, 10 km, or 21.1 km races.\n\nLast years edition attracted 500 runners. It was coordinated by Evonne Mudzingwa of Eves Wellness Event Management and was described as a success.\n\nFollowing the races, fans will be treated to performances by Pakare Paye artists, Tuku Friends, and the Black Spirits Band.\n\nRefreshments will be provided as the $20 registration fee will cover that. The registration fee will also include medals and sports bibs for the runners.\n\nThis occasion aims to awaken the town from its deep slumber, with support from various corporates and individuals who worked closely with the late Tuku.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2015/05/oliver-mtukudzi.jpg",
            "description": "Trust Khosa Today marks six years since the passing of the iconic crooner, Oliver “Tuku” Mtukudzi. The icon lost his battle with diabetes complications on January 23, 2019, at a Harare hospital. He was 66 years old at the time of his death and left behind an impressive legacy of over 60 albums. Tuku was […]",
            "time": "18:41",
            "date": "23 Jan 2025"
        },
        {
            "title": "Harare’s finances in shambles, property disappears, says Mayor Mafume",
            "url": "https://www.herald.co.zw/harares-finances-in-shambles-property-disappears-says-mayor-mafume/",
            "content": "Trust Freddy\n\nHerald Correspondent\n\nHarare Mayor Jacob Mafume has admitted to serious financial mismanagement at the local authority and revealed that some council properties have mysteriously disappeared.\n\nMayor Mafume dropped the bombshell when he appeared before the Justice Cheda-led Commission of Inquiry this morning.\n\nHe revealed that the councils management conspired to get rid of an effective Enterprise Resource Planning (ERP) system.\n\nThe problem is that management conspired to get rid of an effective ERP system, so we dont know what is happening, he said.\n\nWe need an effective ERP system to manage our properties, but there was a deliberate move not to incorporate properties into the system.\n\nHe said he has raised concern over this issue on several occasions, although his concerns fell on deaf ears.\n\nWhen asked why council subsidiaries are not under the city, Mayor Mafume said there wouldnt be much gain in transferring them back into an equally chaotic system.\n\nYou cannot transfer assets or resources to a chaotic system. What is needed is an effective ERP system to detect any irregularities.\n\n",
            "image_url": null,
            "description": "Trust Freddy Herald Correspondent Harare Mayor Jacob Mafume has admitted to serious financial mismanagement at the local authority and revealed that some council properties have mysteriously disappeared. Mayor Mafume dropped the bombshell when he appeared before the Justice Cheda-led Commission of Inquiry this morning. He revealed that the council’s management conspired to get rid of […]",
            "time": "18:41",
            "date": "23 Jan 2025"
        },
        {
            "title": "Wheat meant for Presidential Drought Relief Programme go up in flames in suspected arson case",
            "url": "https://www.herald.co.zw/wheat-meant-for-presidential-drought-relief-programme-go-up-in-flames-in-suspected-arson-case/",
            "content": "Victor Maphosa\n\nMashonaland East Bureau\n\nPolice in Mashonaland East are investigating a suspected arson case where wheat for the Presidential Drought Relief Programme was destroyed by fire at Mr Watson Tsvangirais homestead in Chikomba.Mr Tsvangirai is the areas headman.\n\nThe incident reportedly occurred on January 21 during the night.\n\nPolice spokesperson for Mashonaland East, Inspector Simon Chazovachiyi confirmed the incident.\n\nOn January 20 at around 6 pm, Mr Tsvangirai went to Chirasauta, Sadza, to attend a funeral. He left his wife, Ms Eurita Maguri at home.\n\nOn January 21 at around midnight, an unknown person came and set Mr Tsvangirais thatched hut on fire. His wife and two grandchildren were sleeping in that hut.\n\nThe hut was also being used as a storeroom and it contained various items, including ninety 50kg bags of wheat meant for the Presidential Drought Relief Programme.\n\nFifty-eight bags of wheat were saved, as well as some kitchen utensils. Twelve 50kg bags of fertiliser, a motorbike, a bicycle, a wardrobe, and US$55 were all destroyed by the fire.\n\nAround 4am, Ms Maguri phoned her husband and informed him about the incident. He then reported it at ZRP Sadza.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/09/Wheat-harvesting.jpg",
            "description": "Victor Maphosa Mashonaland East Bureau Police in Mashonaland East are investigating a suspected arson case where wheat for the Presidential Drought Relief Programme was destroyed by fire at Mr Watson Tsvangirai’s homestead in Chikomba. Mr Tsvangirai is the area’s headman. The incident reportedly occurred on January 21 during the night. Police spokesperson for Mashonaland East, […]",
            "time": "18:41",
            "date": "23 Jan 2025"
        },
        {
            "title": "Marondera receives fire tender from Government",
            "url": "https://www.herald.co.zw/marondera-receives-fire-tender-from-government/",
            "content": "Victor Maphosa\n\nMashonaland East Bureau\n\nActing chief executive officer for Marondera Rural District Council, Mr Robson Mungure has thanked the Government for assisting local authorities in enhancing service delivery through various initiatives.\n\nMr Mungure was speaking in an interview with The Herald today following the delivery of a modern fire tender to the council, courtesy of the central Government.\n\nAfter receiving the fire tender, the council took it to the people and demonstrated how it works. Members of the public were urged to quickly report fire incidents to local authorities for immediate assistance.\n\nWe are one of the first Rural District Councils to receive this fire tender and we are grateful to the Government for this initiative. We will save a lot of lives and property with this equipment, Mr Mungure said.\n\nWhen the fire tender was taken to Masomera Business Centre, residents could not hide their joy.\n\nWe always record cases of veld fires and sometimes they are fatal. Imagine watching your house being reduced to ashes and being unable to put it out.\n\nNow that we have the right equipment, we will be able to save some lives and property, all thanks to our Government which is capacitating councils, said Mr Spirio Shoniwa of Masomera.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/124a36bf-c5f7-42d8-b98e-d4fbf2330734-680x380.jpeg",
            "description": "Victor Maphosa Mashonaland East Bureau Acting chief executive officer for Marondera Rural District Council, Mr Robson Mungure has thanked the Government for assisting local authorities in enhancing service delivery through various initiatives. Mr Mungure was speaking in an interview with The Herald today following the delivery of a modern fire tender to the council, courtesy […]",
            "time": "18:41",
            "date": "23 Jan 2025"
        },
        {
            "title": "Four arrested for smuggling second-hand clothes",
            "url": "https://www.herald.co.zw/four-arrested-for-smuggling-second-hand-clothes/",
            "content": "Crime Reporter\n\nPolice have arrested four suspected smugglers of second-hand clothes and shoes under the ongoing operation codenamed No to smuggling.\n\nThe four were intercepted at a roadblock along the Gweru-Mvuma Road.\n\nPolice recovered 33 bales of second-hand clothes and shoes.\n\nNational police spokesperson Commissioner Paul Nyathi confirmed the arrests.\n\nOn January 22, members of the police deployed at a roadblock along the GweruMvuma Road intercepted a Lean Angels bus and arrested the bus driver, Bothwel William (41), as well as Casnos Rungwande (45), Rodrick Muyayiso (41) and Chris Mabhuya (26) for\n\nsmuggling 33 bales of second-hand clothes and shoes. The bus was travelling from Mutare to Bulawayo, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Assistant-Commissioner-Paul-Nyathi.jpg",
            "description": "Crime Reporter Police have arrested four suspected smugglers of second-hand clothes and shoes under the ongoing operation codenamed “No to smuggling”. The four were intercepted at a roadblock along the Gweru-Mvuma Road. Police recovered 33 bales of second-hand clothes and shoes. National police spokesperson Commissioner Paul Nyathi confirmed the arrests. “On January 22, members of […]",
            "time": "18:41",
            "date": "23 Jan 2025"
        },
        {
            "title": "Commission grills Harare Mayor over council irregularities",
            "url": "https://www.herald.co.zw/commission-grills-harare-mayor-over-council-irregularities/",
            "content": "Trust Freddy\n\nHerald Correspondent\n\nHarare Mayor Jacob Mafume is currently testifying before the Commission of Inquiry into the affairs of Harare City Council, where he is expected to provide insight into alleged corruption and mismanagement of resources within the local authority.\n\nThe Commission, led by retired Judge, Justice Maphios Cheda, is investigating the councils operations and business units from 2017 to date, following allegations of widespread irregularities.\n\nMayor Mafume, whose role is ceremonial, is also expected to respond to allegations that he is attempting to usurp executive powers.\n\nThe commission was appointed by President Mnangagwa in May last year to probe the councils affairs amid reports of corruption and mismanagement.\n\n",
            "image_url": null,
            "description": "Trust Freddy Herald Correspondent Harare Mayor Jacob Mafume is currently testifying before the Commission of Inquiry into the affairs of Harare City Council, where he is expected to provide insight into alleged corruption and mismanagement of resources within the local authority. The Commission, led by retired Judge, Justice Maphios Cheda, is investigating the council’s operations […]",
            "time": "18:41",
            "date": "23 Jan 2025"
        }
    ]
}