{
    "news": [
        {
            "title": "DRC crisis: 3 mediators appointed",
            "url": "https://www.herald.co.zw/drc-crisis-3-mediators-appointed/",
            "content": "Zvamaida Murwira, Senior Reporter\n\nThe SADC and East African Community (EAC) joint process has appointed three eminent former African leaders to facilitate efforts to find lasting peace in the Democratic Republic of Congo (DRC) where hostilities between Government forces and rebels have resulted in the death of thousands of people and left millions homeless.\n\nDiplomatic engagements and consultations between the two blocs have seen the appointment of former Kenyan leader Uhuru Kenyatta, former leader of Nigeria Olusegun Obasanjo and former Prime Minister of Ethiopia Hailemariam Desalegn Boshe as mediators in the conflict that was threatening to suck in the whole Great Lakes region until the intervention of SADC Chairman President Mnangagwa and other African leaders.\n\nThe appointment of the three leaders is a culmination of a joint EAC-Sadc summit, co-chaired by President Mnangagwa and his Kenyan counterpart William Ruto, in Tanzania which deliberated on the conflict in Eastern DRC pitting armed M23 rebel groups against Government forces backed by some Southern African countries under the SADC Mission in the DRC (SAMIDRC).\n\nIn a statement, the Joint EAC/Sadc said President Mnangagwa and President Ruto continued engagement efforts following the summit held in Tanzania early this month which saw the appointment of the three leaders as facilitators.\n\nHis Excellency Dr Emmerson Dambudzo Mnangagwa, President of the Republic of Zimbabwe and Chairperson of SADC and His Excellency, Dr William Samoei Ruto, President of the Republic of Kenya and Chairperson of the EAC have continued engaging on the progress in restoration of peace and security and in consultation with SADC and EAC Heads of State and Government have agreed on the appointment of HE Uhuru Muigai Kenyatta former President of the Republic of Kenya; H.E Olusegun Obasanjo, former President of the Federal Republic of Nigeria; and HE Hailemariam Desalegn Boshe, the former Prime Minister of the Federal Democratic Republic of Ethiopia as Facilitators of the EAC-SADC peace process (the merged Luanda and Nairobi processes) in Eastern DRC, reads the statement.\n\nPreparatory Meetings of the EAC Chiefs of Defence Forces (CDFs) from EAC Partner States were held in Nairobi on 21st February 2025 to discuss the ongoing security situation in the eastern Democratic Republic of Congo (DRC). The Meeting of the SADC Chief of Defence Forces on the same subject also convened in Dar es Salaam, Tanzania. The meetings followed a directive from the joint EAC-SADC Heads of State Summit on 8th February 2025 in Dar-es-Salaam, Tanzania. Prior to the meeting the EAC, Defense Experts Working Group held two days of discussions on the situation in Eastern DRC. The meeting was guided by six key directives: Immediate and unconditional ceasefire and cessation of hostilities, provision of humanitarian assistance, opening of main supply routes, development of a securitisation plan for Goma and surrounding areas; and immediate reopening of Goma Airport and advice on other facilitative interventions.\n\nThe DRC map. Source: Wires\n\nYesterday, a joint EAC-SADC Chiefs of Defence Forces Meeting was held in Dar es Salam, Tanzania, preceding the Joint Ministerial Meeting scheduled for February 28.\n\nThe meeting is expected to work on the details of the ceasefire. Considering the above developments, all actors are urged to observe the ceasefire announced by the EAC-SADC Summit, and the M23 and all other actors are called upon to cease any further advancements in Eastern DRC and to observe and abide by an immediate ceasefire. The Joint EAC-SADC process is actively seized of the peace process in the Eastern Democratic Republic of the Congo, reads the statement.\n\nConflict between Government forces and M23 armed rebels have escalated over the past months with the armed groups taking control of large swathes of the resource-rich Eastern DRC including the provincial capital Goma.\n\nLast Friday, the United Nations Security Council unanimously adopted a resolution that strongly condemned the ongoing offensive by M23 rebels in the eastern DRC.\n\nThe Security Council demanded that the M23 immediately cease hostilities, withdraw from all areas that it controls, and fully reverse the establishment of illegitimate parallel administrations in the DRC territory.\n\nThe UN body called on the Rwanda Defence Forces to stop supporting the armed group and immediately withdraw from Congolese territory without preconditions.\n\nIt reiterated the urgent appeal for all parties to conclude an immediate and unconditional ceasefire, as called for by leaders from EAC and SADC.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/President-Mnangagwa-10.jpg",
            "description": "Zvamaida Murwira,  Senior Reporter  The SADC and East African Community (EAC) joint process has appointed three eminent former African leaders to facilitate efforts to find lasting peace in the Democratic Republic of Congo (DRC) where hostilities between Government forces and rebels have resulted in the death of thousands of people and left millions homeless. Diplomatic […]",
            "time": "06:34",
            "date": "26 Feb 2025"
        },
        {
            "title": "Promising outlook for food production",
            "url": "https://www.herald.co.zw/promising-outlook-for-food-production/",
            "content": "Mukudzei Chingwere, Herald Reporter\n\nGovernment has announced a first-round crop assessment report for the current agricultural season, indicating a promising outlook for local food production.\n\nThis optimistic evaluation highlights the potential for increased yields, which could significantly benefit the nations food security.\n\nTo capitalise on this positive trend, the Government is taking steps to enhance local production of essential farming inputs, particularly fertilisers.\n\nThis initiative aims to reduce dependency on imports and ensure that farmers have access to the necessary resources for successful cultivation.\n\nAdditionally, the Government is accelerating the Rural Development 8.0 initiative, which focuses on empowering communities through sustainable agricultural practices and improved access to resources.\n\nInformation, Publicity and Broadcasting Services Minister Dr Jenfan Muswere announced these developments following yesterdays Cabinet meeting.\n\nHe said Cabinet received a comprehensive update on the assessment of crops, livestock, and fisheries, presented by the Minister of Lands, Agriculture, Fisheries, Water and Rural Development, Dr Anxious Masuka.\n\nDr Muswere said the survey was conducted by ZIMSTAT under a whole-of-Government approach, ensuring a thorough and collaborative assessment of the agricultural landscape.\n\nGovernment will create a new institutional arrangement to optimise planning and coordination of cloud seeding activities for enhanced rainfall patterns in Zimbabwe, said Dr Muswere.\n\nClimate-proofing agriculture at household and national levels will be accelerated through Pfumvudza/Intwasa. Community participation in the strategic grain reserve will be enhanced at community level, he said.\n\nTowards that end, Dr Muswere said Government will accelerate irrigation development to increase functional irrigation capacity from the current 217 000 hectares to the targeted 496 000 hectares through increased private sector participation.\n\nGovernment will accelerate the establishment of ward drought mitigation centres to create resilience of communities against future shocks. Government will strengthen the local production of key farming inputs such as fertilisers, said Dr Muswere.\n\nHe added that The Presidential Tick Grease Scheme will henceforth be appropriately renamed to Household Tick Management Scheme, while the Rural Development 8.0 intervention will be accelerated to empower communities.\n\nThe Government will accelerate the establishment of the five fingerling production centres at Henderson, Chipinge, Makoholi, Matopo and Lupane, said Dr Muswere.\n\nThe area planted under staple cereals that include maize and traditional grains increased during the 2024/2025 season from the targeted 2 520 000 hectares to 2 540 385 hectares, while the planted area is 8.1 percent higher than the 2 349 921 hectares achieved in the 2023/2024 season and above the 2024/2025 target.\n\nRegarding horticulture, Dr Muswere said, there were notable increases in the area planted particularly for blueberry, orange and coffee, while the total area planted marginally increased from 11 952 hectares in the 2023/2024 season to 11 957 in the 2024/2025 season.\n\nThe increases were achieved despite the negative effects of the El Nino-induced drought and the corollary false start to the 2024/2025 season, said Dr Muswere.\n\nConcerning livestock, the national beef cattle herd grew by 0.4 percent from 5 718 523 in 2023 to 5 741 397 in 2024. The national dairy herd increased by 8.7 percent from 60 398 in 2023 to 65 659 in 2024.\n\nThis resulted in a 15 percent increase in raw milk production to 11 699 440 litres from 99 823 775 litres in 2023. The Presidential Rural Poultry Scheme gained momentum in 2024 with the distribution of 751 408 four-week-old indigenous chicks to beneficiaries compared to 200 161 in 2023.\n\nDr Masuka noted that the Zimbabwean economy is mainly anchored by agriculture and a positive outlook of the countrys agricultural fortunes promises better fortunes for the economy.\n\nHe noted that the low growth of the economy last year was due to the El Nino-induced drought and expressed optimism on this years prospects.\n\nMeanwhile, Dr Muswere said Cabinet received and approved the Policy Review Framework for Audit Committees in Central Government.\n\nHe said in the interest of good governance every ministry shall henceforth constitute a board composed of a Minister responsible for the Ministry as Chairperson, Deputy Minister, five non-executive audit committees members, accounting officer and head of finance.\n\nThe Ministrys Audit Committee shall report to the Ministry board. The Minister responsible for Finance shall be the appointing authority of Audit Committee members, said Dr Muswere.\n\nThe Secretary to Treasury will now be the nominating authority of Four Audit Committee members. The Office of the President and Cabinet shall appoint the Audit Committee for Treasury.\n\nThe Accounting Officer of the Ministry shall nominate one technical member of the Audit Committee who is retired and the legal department of the Ministry will be the secretariat of the Audit Committee.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/PC1.jpg",
            "description": "Mukudzei Chingwere, Herald Reporter Government has announced a first-round crop assessment report for the current agricultural season, indicating a promising outlook for local food production. This optimistic evaluation highlights the potential for increased yields, which could significantly benefit the nation’s food security. To capitalise on this positive trend, the Government is taking steps to enhance […]",
            "time": "06:34",
            "date": "26 Feb 2025"
        },
        {
            "title": "Sadc renews commitment to tackling climate change-induced health challenges",
            "url": "https://www.herald.co.zw/sadc-renews-commitment-to-tackling-climate-change-induced-health-challenges/",
            "content": "Rumbidzayi Zinyuke, Senior Reporter\n\nSADC has reaffirmed its commitment to tackling emerging climate change-induced health challenges and strengthening collective regional response mechanisms.\n\nLast week, the SADC Ministers of Health attended an Extraordinary Meeting on Health to discuss emerging health threats and come up with collective actions to combat them.\n\nThe meeting underscored the importance of timely information sharing among member states to curb cross-border disease transmission. It also endorsed several initiatives to bolster regional health security.\n\nInformation, Publicity and Broadcasting Services Minister Dr Jenfan Muswere said the EGM was critical in addressing health challenges facing the region and crafting solutions to strengthen collective responses to these challenges.\n\nKey highlights of the proceedings and outcomes included the ongoing health emergencies in the SADC region, such as Mpox Outbreak and Marburg Virus Disease. Member States were urged to share information on disease outbreaks timeously in order to effectively address cross-border transmission. The Meeting also endorsed the SADC TB Strategic Plan, the expansion of the E8 Malaria Elimination Initiative to all 16 SADC Member States under the auspices of SADC, a project to accelerate the implementation and investment into the SADC Sexual and Reproductive Health and Rights (SRHR) Strategy, the feasibility study on the establishment of a Southern Africa Health Organisation and the establishment of the SADC Pooled Procurement Services (SPPS) as an autonomous special purpose vehicle under the principle of subsidiarity, he said.\n\nIn addition, Minister Muswere said member states had been urged to mobilise alternative funding through public-private partnerships and domestic resource mobilisation for critical health programmes, including HIV, TB and malaria prevention, treatment and control.\n\nAddressing questions from journalists, Health and Child Care Minister Dr Douglas Mombeshora acknowledged the impact of climate change on disease outbreaks.\n\nWe are prepared and I think this year we have done very well. We managed to respond quickly because we had learned from what had happened in the past. We are also seeing an upsurge in other diseases like the Mpox and Marburg virus which has spread to quite a number of countries, more than what it used to be like. And we think actually its because of climate change that these viruses are beginning to spread beyond the borders where they never used to spread. This is why we had this meeting, together with other countries in SADC, so that we come together, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/02/Minister-Muswere.jpg",
            "description": "Rumbidzayi Zinyuke, Senior Reporter SADC has reaffirmed its commitment to tackling emerging climate change-induced health challenges and strengthening collective regional response mechanisms. Last week, the SADC Ministers of Health attended an Extraordinary Meeting on Health to discuss emerging health threats and come up with collective actions to combat them. The meeting underscored the importance of […]",
            "time": "06:34",
            "date": "26 Feb 2025"
        },
        {
            "title": "Zim economy to grow 5,3pc: AfDB",
            "url": "https://www.herald.co.zw/zim-economy-to-grow-53pc-afdb/",
            "content": "Tapiwanashe Mangwiro,Senior Business Reporter\n\nZimbabwe is expected to be among the fastest growing economies in Africa this year, with the African Development Bank (AfDB) forecasting 5,3 percent growth.\n\nThe strong growth forecast is slightly below the 6 percent predicted by Finance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube, but it is still one of the fastest on the continent.\n\nNiger is projected to be the fastest-growing economy in Africa, with an expected growth rate of around 11,1 percent due to its burgeoning oil production sector.\n\nOther African economies expected to lead the growth race this year include Senegal, Rwanda and Ethiopia.\n\nAgriculture is expected to lead Zimbabwes economic recovery following good rains experienced this season.\n\nLast year, the economy was pegged back by the devastating impact of the El Nino-induced drought, reducing economic growth to 2 percent.\n\nThe drought reduced the maize harvest, a key staple in the country, by about 71 percent, according to the World Bank.\n\nGrowth is expected to be markedly faster driven by other key sectors such as mining, tourism and infrastructure development.\n\nThe AfDBs African Economic Performance Report paints a highly positive outlook for Zimbabwes economy this year.\n\nIn 2025, economic performance in Zimbabwe will benefit from agricultural recovery, greater electricity generation, and expected stability in commodity prices in mining, with growth projected to rise from an estimated 2,0 percent in 2024 to 5,3 percent in 2025, stated the AfDB.\n\nAgriculture has historically been a pillar of Zimbabwes economy.\n\nBetter access to financing and several Government support initiatives including inputs schemes are also expected to help boost production in the sector.\n\nThe mining sector is set to play a crucial role in the rebound, benefiting from stabilised and strong global commodity prices, including for gold, as well as increased investment in exploration and production.\n\nThe World Bank forecast growth in transport and distribution, construction, retail and manufacturing, which will contribute to Zimbabwes overall economic expansion.\n\nEconomist Gladys Shumbambiri-Mutsopotsi said while the AfDBs forecast fell short of the Governments 6 percent growth target, its bullish projection reflected an overall positive outlook.\n\nThe AfDB report shows some positive developments related to the overall macroeconomic growth trajectory, and this is coming at the right time when the Government intends to scale up economic growth.\n\nOf course, there are some challenges here and there, but what is needed is the will to oversee the set targets become a reality for the benefit of the entire nation, she said.\n\nFor Zimbabwe to realise its full economic potential, close collaboration between the Government and the private sector will be crucial, economists say.\n\nZimbabwe National Chamber of Commerce president Mr Tapiwa Karoro emphasised the importance of working for a common purpose among key stakeholders to maintain gains achieved thus far.\n\nWhat is needed is stakeholder commitment, where the Government and the private sector work together towards identifying what needs to be done this year.\n\nWhile there are positive signs of the economy growing, there are still many grey areas that need to be sorted in terms of consolidating the current gains, he said.\n\nThe AfDBs positive growth projection for Zimbabwe follow similar predictions by the International Monetary Fund and the World Bank, which also forecast Zimbabweseconomy to register strong growth this year.\n\nZimbabwes economic outlook is positive, with recovery from the 2019-2020 Covid-19 recession and the 2024 El Nino-related drought, the World Bank said in its recently published Zimbabwe Economic Update report.\n\nAccording to the report, Zimbabwes economic recovery will be driven by agriculture, which is expected to grow by nearly 13 percent, anchored by recovery in maize and tobacco production.\n\nThe report also noted that Zimbabwes mining sector continued to exhibit strong growth, bolstered by rising gold prices and new investments that are expected to increase lithium, iron ore and steel production.\n\nSimilarly, the tourism industry is growing rapidly, with increasing numbers of international arrivals and hotels bed occupancy, the report said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/AfDB-680x380.jpg",
            "description": "Tapiwanashe Mangwiro, Senior Business Reporter Zimbabwe is expected to be among the fastest growing economies in Africa this year, with the African Development Bank (AfDB) forecasting 5,3 percent growth. The strong growth forecast is slightly below the 6 percent predicted by Finance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube, but it is still one […]",
            "time": "06:34",
            "date": "26 Feb 2025"
        },
        {
            "title": "More Australian charity organisations pledge to support AoHF",
            "url": "https://www.herald.co.zw/more-australian-charity-organisations-pledge-to-support-aohf/",
            "content": "Tendai Rupapa, Senior Reporter\n\nEMPOWERMENT champion First Lady Dr Auxillia Mnangangwa, who is in Australia on a philanthropic visit, yesterday met leaders of charity organisations and the business community keen to work with her Angel of Hope Foundation (AoHF) to transform the lives of the less-privileged in Zimbabwe.\n\nDr Mnangagwa, who is committed to helping others, embodies the ideals of philanthropy, demonstrating exceptional generosity, compassion, and commitment to creating positive change.\n\nShe shared notes and ideas with Reverend Bill Crews of the Rev Bill Crews Foundation, many other philanthropists and members of the Australia Business Summit Council led by president Dr Frank Alafaci.\n\nThey discussed areas of possible collaboration, especially in the health sector, ending drug and substance abuse and also education, among other issues.\n\nLike a bird using its feet simultaneously to find seeds, bugs or any other food for her nest, the mother of the nation thinks critically and develops effective plans to achieve goals that benefit mainly the needy and disadvantaged groups back home.\n\nThe organisations meeting with the First Lady and expressing eagerness to partner with her foundation, speak volumes about her brand and hard work which has reached far and wide.\n\nThe organisations pledged to assist her foundation with medical equipment for hospitals and clinics.\n\nRev Crews and his team have been caring for the homeless and disadvantaged for almost 40 years in Australia.\n\nAngel of Hope Foundation patron First Lady Dr Auxillia Mnangagwa, Ambassador Joe Tapera Mhishi and Dr Mataruse pose for a photograph with Australian philanthropists after their interaction in Sydney yesterday.  Pictures: John Manzongo\n\nThey are at the forefront of alleviating the causes and effects of homelessness and poverty, something that Dr Mnangagwa is also fighting through her foundation.\n\nThey are into healthcare, education, community support, hospitality training and community feeding, hence the need to share notes with the First Lady who is also involved in all those fields.\n\nDr Alafaci said it was a profound honour and privilege to be in the presence of Dr Mnangagwa whom he described as a distinguished person.\n\nHe said they had close connections to various hospitals around Australia and were willing to source decommissioned medical equipment for AoHF and training technicians who will service the mobilised equipment.\n\nNot only on the strength of the video presentation of her work displayed to everybody here today but on the strength of my research that Ive been doing into her (the First Lady) in the work that she does in Zimbabwe, as you all know, Im an academic so research is one of my strong points. I believe that the First Lady will be a very, very worthy recipient of the Nobel Prize for Peace, he said.\n\nHe added; Because too often we hear or talk of war and hate and oppression, but little do we hear of peace, love and compassion. I think that Her Excellency is the embodiment of that.\n\nThe First Lady is carrying these engagements in Australia to source medical equipment, which might be useful in Zimbabwean hospitals and clinics, looking specifically at obtaining decommissioned medical equipment.\n\nAngel of Hope Foundation patron First Lady Dr Auxillia Mnangagwa looks at the meals prepared and served to the underprivileged at the Rev Bill Crews foundation. Looking on is the foundation chairman Rev Bill Crews and Ambassador Joe Tapera Mhishi during a visit in Sydney, Australia yesterday\n\nAnother philanthropist, who is in the health sector weighed in saying; It is critical that you are putting your voice in the fight against cancer, you are indeed saving lives. I will send you a list of offerings that we have and you will pick what you need.\n\nAmai Mnangagwa thanked the groups for their kind gesture and willingness to partner with her AoHF.\n\nWhen you look at the diseases that are affecting people, especially in the SADC region, we are seeing the prevalence of HIV and AIDS and cancer as well, hence the awareness campaigns and medical outreach programmes that I conduct across the country. We also have the gender-based violence (GBV) scourge, and child marriages.\n\nI am fighting all that and urging parents to let the girl child finish her education. If you look at all what Im talking about, mothers bear the brunt. To curb this, I am also conducting male engagement programmes to try and find solutions to all these problems affecting families.\n\nDrug and substance abuse is also a menace and is killing our children. Some children are pointing fingers at their parents saying they lack parental guidance that is why I have programmes suitable for all family members from children to grandparents as I try to address these social ills, she said.\n\nShe further thanked the Australian business community for the pledges.\n\nI would like to thank you for what you have done and for what you are going to do. The equipment and other necessities will go a long way in capacitating our hospitals and clinics, she said.\n\nAustralian philanthropists read a magazine showcasing Angel of Hope Foundations philanthropic works during their meeting with First Lady Dr Auxillia Mnangagwa on possible areas of cooperation in Sydney, Australia yesterday\n\nRev Crews commended the First Lady for her charity work which he said was touching many lives.\n\nWhat I like is you are going out to the people not the other way round. You care for them and this is commended, he said.\n\nThe First Lady responded saying; Indeed, distance is not a barrier to me, I go out to the people even to those in hard-to-reach areas. I do not select and all my programmes and projects are the same for the urbanites and those in the rural areas. I also do advocacy and awareness campaigns on health issues as the health ambassador.\n\nWhen I go to the people, I stay with them for some days, incline an ear to their challenges and find solutions where I can. I am happy Rev that you are also clothing and feeding the less privileged. I also do the same in Zimbabwe through my Angel of Hope Foundation. We have a lot in common. Your centre is offering a cocktail of services to the disadvantaged people, she said.\n\nIn response Rev Crews said; God bless you and we would love to continue doing more for you and your Angel of Hope Foundation.\n\nZimbabwes Ambassador to Australia and New Zealand Mr Joe Tapera Mhishi said he felt gratified that the Australian team found an opportunity to meet the First Lady.\n\nShe is visiting Australia for the first time, what I would like to say is that what brings her to Australia is the burden of a mother, if I may put it that way. A mother carries the whole house. She is an embodiment of the spirit of motherhood in Zimbabwe.\n\nThe First Lady came here as a philanthropist on a private visit. She is building hospitals both in the urban and rural areas and they are both nearing completion. She also works with all hospitals countrywide mobilising resources and equipment for them. She is doing a lot for the people of Zimbabwe. She is an all-rounder and is hands-on, he said.\n\nAngel of Hope Foundation patron First Lady Dr Auxillia Mnangagwa poses for a photograph with female Australian philanthropists after their interaction in Sydney yesterday\n\nAngel of Hope Foundation patron First Lady Dr Auxillia Mnangagwa shares a lighter moment with Rev Bill Crews and Ambassador Joe Tapera Mhishi during a visit at Rev Bill Crews Foundation in Sydney, Australia yesterday\n\nAngel of Hope Foundation patron Dr Auxillia Mnangagwa interacts with nursing staff at Rev Bill Crews Foundation during a visit at the charity organisation in Sydney, Australia yesterday\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/FL1-6.jpg",
            "description": "Tendai Rupapa, Senior Reporter EMPOWERMENT champion First Lady Dr Auxillia Mnangangwa, who is in Australia on a philanthropic visit, yesterday met leaders of charity organisations and the business community keen to work with her Angel of Hope Foundation (AoHF) to transform the lives of the less-privileged in Zimbabwe. Dr Mnangagwa, who is committed to helping […]",
            "time": "06:34",
            "date": "26 Feb 2025"
        },
        {
            "title": "Zanu PF urged to foster unity among members",
            "url": "https://www.herald.co.zw/zanu-pf-urged-to-foster-unity-among-members/",
            "content": "Joseph Madzimure and Remember Deketeke\n\nHerald Reporters\n\nZANU PF members have been urged to refrain from using social media to create divisions within the party, but engage in constructive dialogue to achieve national aspirations.\n\nAt the launch of the US$150 000 War Veterans Presidential Fund, Special Presidential Investment Advisor Dr Paul Tungwarara addressed war veterans, cautioning against those who exploit social media to sow discord within party ranks.\n\nDo not use social media to promote enmity, especially among the Presidium, he said.\n\nLet us shun division and encourage collective work ethics as envisioned in Vision 2030. We will not be swayed by those attempting to use divide-and-rule tactics to undermine the Presidents vision for developing Zimbabwe.\n\nThe event drew thousands of Zanu PF supporters to the party headquarters in Harare, marking the official launch of the Presidential War Veterans Fund in the province.\n\nThe programme aims to provide boreholes and housing for war veterans in their communities. The funds, allocated from the National War Veterans Fund, are designed to empower liberators through various economic initiatives and support programmes, benefiting war veterans, their widows, children, and war collaborators.\n\nIn Harare alone, 540 war veterans are expected to benefit from this initiative.\n\nCde Douglas Mahiya, Secretary for War Veterans in the Politburo, said Vision 2030 is within reach.\n\nThe support we are receiving has never happened in the past 40 years, he said. The President is now saying that all war veterans must be included in the nations development and contribute meaningfully to the economy.\n\nWar Veterans League, Secretary Cde Douglas Mahiya, (second from left) War veterans chairperson for Harare province Cde John Guta (right) Special Presidential Investment Advisor Dr Paul Tungwarara (centre) Zanu PF Harare provincial chairperson Cde Goodwills Masimirembwa holding the Harare province presidential warveterans fund cheque while Minister of State for Harare Metropolitan Province Cde Charles Tavengwa witnesses during the official launch of Harare Warveterans presidential fund, borehole drilling and housing scheme in Harare yesterday. -Picture: Memory Mangombe\n\nHarare Provincial Chairman Cde Godwills Masimirembwa called on war veterans to guide the younger generation.\n\nWe expect war veterans to use their experience to mentor the youth, who are the future leaders, he stated.\n\nMinister of State for Harare Metropolitan Province, Senator Charles Tavengwa, reaffirmed the Governments commitment to creating more opportunities for war veterans.\n\nPresident Mnangagwa, as a listening leader, is dedicated to fulfilling promises made to improve the livelihoods of war veterans, he said.\n\nHe highlighted various initiatives from the Second Republic, including the Presidential Housing Scheme, Presidential Solar Scheme, and the Presidential War Veterans Scheme, aimed at uplifting the lives of these veterans.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/WAR-VETS.jpg",
            "description": "Joseph Madzimure and Remember Deketeke Herald Reporters ZANU PF members have been urged to refrain from using social media to create divisions within the party, but engage in constructive dialogue to achieve national aspirations. At the launch of the US$150 000 War Veterans Presidential Fund, Special Presidential Investment Advisor Dr Paul Tungwarara addressed war veterans, […]",
            "time": "06:34",
            "date": "26 Feb 2025"
        },
        {
            "title": "EDITORIAL COMMENT: Zimbabwe moves up the line to heavy industry",
            "url": "https://www.herald.co.zw/editorial-comment-zimbabwe-moves-up-the-line-to-heavy-industry/",
            "content": "Zimbabwe is now moving rapidly towards becoming one of the top major heavy industrial centres in Africa and the future African Continental Free Trade Area as it converts its vast range of mineral wealth into the materials that manufacturers and others use to make the final products.\n\nAlready the new giant steelworks of Dinson Iron and Steel Company, the local subsidiary of Tsingshan Holdings of China, at Manhize is in production and has moved beyond pig iron and steel billets to steel bar, with other materials, such as sheet steels, in the pipeline and the specialist stainless steels coming in future phases.\n\nNow a second base metallurgical industrial centre, this time by Xintai, the local subsidiary of Xinganglian (Shanxi) Holdings of China, is rising near Beitbridge with the Palm River Energy Metallurgical Economic Zone that will be centred on another major stainless steel production investment.\n\nThese two giant investments are being fed by the ferrochrome smelters and nickel processing that is already in place and which are being expanded, not least by another ferrochrome smelter in the Palm River complex. Both steel complexes have their coking plants, Dinsons at Hwange and Xintais at Palm River.\n\nZimbabwe is well positioned to be a high-end steel production centre having large deposits of iron ore, which can be mined and processed locally but which it is quite uneconomic to export as ore from a landlocked country near the bottom end of a continent. There are also the necessary deposits of reasonable quality coal suitable for coking, the second most important ingredient in the steel mix.\n\nThe stress on stainless steels comes because up to 20 percent of standard stainless steels is chrome and up to 11 percent is nickel. Zimbabwe has both in good quantities and already these minerals have to be exported as metal, that is ferrochrome and nickel metal. These happen to be the form of these raw materials that a stainless steel producer wants, so the bars can soon be going to local steel producers.\n\nThere is a policy of value addition, which is why there is so much pressure on not exporting ores but at least having partial processing or better done in Zimbabwe. This is also sensible from the point of view of those wanting to export from a landlocked country far away, when you want a product that is easy to handle and has maximum value for its bulk. Bars of metal have these attributes while a truck or wagon of crushed ore is neither easy to handle and is expensive to transport when we look at costs per unit of value.\n\nIt makes even more sense, if the rest of the raw materials are on hand, as they are in Zimbabwe, for the local processing and value addition to move up to the level of steels and stainless steels so that transport and other costs of each dollar of value are lower still.\n\nMore specialist stainless steels include a couple of percent of molybdenum in addition to the chrome and nickel and traces of other elements that are normally found with iron ore and so are no problem to add. Africa is not really on the worlds molybdenum production map, but Zimbabwe has some deposits.\n\nA modest deposit was confirmed near Chipinge at the end of the 1980s, not large enough for a viable commercial investment when all that was wanted was train loads of ore to ship to a port, but could quite easily be very useful when only modest quantities are needed at local stainless steel smelters. It would seem sensible for a more thorough geological investigation of other potential deposits.\n\nWhile Zimbabwe is unlikely to ever have the sort of manufacturing and construction sectors that can use the quantities of steel we are looking at producing, this huge supply of primary products does open up opportunities for the heavy metal production that we have been lacking, with a reasonable chunk of the processed steel exported as products, rather than materials.\n\nZimbabwean industry has tended to concentrate on agro-processing, sensible and important considering the farming pillar of our economy, and on some of the lighter end of consumer products. Metal manufacturers have been importing their materials, which has limited opportunities, a limit that soon disappears. The downstream industries open a vast range of opportunities for many companies, not all of which have to be giant concerns.\n\nThe other major advance that we are now looking at is the commercial natural gas drilling in the Muzarabani area, providing both energy and a feedstock for chemical industries. Other processing of minerals for export and for fertilisers has seen other elements needed in a chemical industrial base coming through.\n\nWe admit one major problem is developing heavy industry has been the energy deficiency in Zimbabwe. The two giant investors at Manhize and Beitbridge saw this from the beginning and both are building their own power stations to supply their own needs and to sell any surplus into the grid. Xintai has gone further and plans a major power station that will go far further than its own requirements and be an energy investment. Since Zesas distribution arm can buy just about anything that anyone can generate in Zimbabwe this is a safe bet.\n\nInvictus, the gas explore, has also seen the profitable possibilities of investment into gas fed power stations and has these lined up for the early parts of its own investment programme.\n\nThe reasons for the billions of US dollars of investment being made in Zimbabwe is not just because the stuff people want to mine is here. Other countries have that. But the Second Republic has pushed hard for a pro-businesses investment environment, including the special economic zones that are required and the openness to energy investment as investors build power stations. The fact that President Mnangagwa is more than willing to turn up at groundbreaking and commissioning ceremonies shows the sort of support that Government wants to give.\n\nAt the same time, we are starting to reap our major investments in education. An investor moving into Zimbabwe can quickly find people who can be rapidly trained to operate their businesses and factories, right from the lowest labourers to the top technical people. This makes it much easier to open a new investment, since almost all the foreign workers needed will be trainers, rather than permanent staff.\n\nWe are now at one of the most exciting times for Zimbabwes economic progress, as we add the heavy metallurgical column to our existing agro-industrial column and so move forward rapidly to becoming a major industrial giant.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/07/DISCO.jpg",
            "description": "Zimbabwe is now moving rapidly towards becoming one of the top major heavy industrial centres in Africa and the future African Continental Free Trade Area as it converts its vast range of mineral wealth into the materials that manufacturers and others use to make the final products. Already the new giant steelworks of Dinson Iron […]",
            "time": "06:34",
            "date": "26 Feb 2025"
        },
        {
            "title": "Localising value chains  key to cut production costs",
            "url": "https://www.herald.co.zw/localising-value-chains-key-to-cut-production-costs/",
            "content": "Business Reporter\n\nZimbabwe should implement strategies to deepen its value chains to localise key manufacturing inputs and eliminate dependency on imports to improve its competitiveness in global markets, economic experts say.\n\nThis comes as captains of industry and commerce continue to lobby for a review of the ease of doing business conditions to facilitate growth of business and the economy in general.\n\nEconomist Dr Cornelius Dube, who is also Confederation of Zimbabwe Industries (CZI) chief economist, said Zimbabwe was importing more than 52 percent of key raw materials needed for manufacturing.\n\nIn other key sectors such as pharmaceuticals, the ratio of imported raw materials can be as high as 87 percent, which raises the cost of production and diminishes the companies and countrys competitiveness.\n\nDr Dube also highlighted that the local industry was lagging in terms of capacity to export manufactured goods due to the high costs of production.\n\nZimbabwes productive capacity suffered extensively over nearly two decades since the turn of the millenium, largely buckling under the weight of Western sanctions, which decimated agriculture and industry productivity.\n\nOur capacity to produce and export manufactured goods is where we are basically failing to be competitive even when compared to countries like Namibia.\n\nOne of the reasons is that about 52 percent of the raw materials (87 percent for the pharmaceutical industry) that are used in the manufacturing industry are imported and that is diminishing our competitiveness.\n\nSo, in terms of industrialisation we should be focussing on the extent to which we can ensure that we deepen our value chains and try to localise them so that at least we depend on the raw materials that we can produce on our own.\n\nEspecially leveraging on our abundant mineral resources, on our efficiencies in mining as well as in the agricultural sector where we are doing quite well, said Mr Dube.\n\nThis comes as captains of industry have been lobbying the Government to implement policies that improve the ease and cost of doing business to enhance the competitiveness of localproducts.\n\nThey cited the need to streamline procedures for starting a business, dealing with construction permits and registering property, among other areas. Simplifying regulatory procedures and the cost of complying with regulations can improve the business and economic environment in Zimbabwe lobbyists say.\n\nAddressing the high cost of transportation, multiple taxes, exchange rate volatility, growing informalisation, restrictive policies and energy supply bottlenecks were also cited as factors weighing down business operations.\n\nThis comes hot on the heels of President Mnangagwas clarion call for statutory entities to ensure that fees, licences, permits and regulations promote economic development.\n\nGovernment is actively working to enhance the ease of doing business, which includes reforming the Zimbabwe Investment Development Agency and a one-stop shop investment processing entity.\n\nAddressing delegates at the inaugural annual competitiveness summit hosted by the National Competitiveness Commission (NCC), Zimbabwe National Chamber of Commerce chief executive officer Mr Christopher Mugaga said currency volatility had been one of the biggest problems compromising the competitiveness of local businesses.\n\nI always talk to the central bank Governor to say, the moment we just respect market forces, 75 percent of our problems will be solved. All the voluminous chapters on fiscal policy and monetary policy will be irrelevant because at the heart of our competitiveness issues lies the exchange rate confusion.\n\nIt is a conundrum. So, try to clean the exchange rate problem and you will be shocked.\n\nThere was a debate recently where people said, look at taxation levels, these are some of the things that need to be sorted, said Mr Mugaga.\n\nThrough the Reserve Bank of Zimbabwes monetary policy and Treasurys tight fiscal policy measures, the Government has made giant strides towards eliminating exchange rate issues. President Mnangagwa is on record saying his administration is fully aware of the challenges facing businesses and is actively working to create a more supportive environment that fosters innovation and investment.\n\nThis entails implementing measures that promote value addition and beneficiation of raw materials and minerals, which are essential for developing robust industrial value chains.\n\nHe has also highlighted that the NCC was a key institution tasked with interrogating the various aspects of the countrys economy, to enhance local and global competitiveness.\n\nFinance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube is also on record saying that the Government is committed to localising all value chains to enhance the diversity and complexity of Zimbabwes manufacturing sector.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/03/Confederation-of-Zimbabwe-Industries-CZI.jpg",
            "description": "Business Reporter Zimbabwe should implement strategies to deepen its value chains to localise key manufacturing inputs and eliminate dependency on imports to improve its competitiveness in global markets, economic experts say. This comes as captains of industry and commerce continue to lobby for a review of the ease of doing business conditions to facilitate growth […]",
            "time": "06:34",
            "date": "26 Feb 2025"
        },
        {
            "title": "Dams gain significant inflows",
            "url": "https://www.herald.co.zw/dams-gain-significant-inflows/",
            "content": "Herald Reporter\n\nZimbabwes major dams continue to experience a surge as water levels rose to an average of 85,8 percent on the back of the rains being received in different parts of the country.\n\nAccording to the latest statistics from the Zimbabwe National Water Authority (Zinwa), as at February 24, the dams had gained a cumulative 28,9 percent since December 19, 2024.\n\nThis is 18,3 percent higher than the 10, 6 percent gained during the same period in the last season.\n\nThe countrys two largest inland water bodies, Tugwi-Mukosi and Mutirikwi, have already hit 100 percent and are spilling.\n\nZinwa said dams in Matabeleland North province had the highest percentage gains in terms of inflows at 66,1 percent, followed dams in Bulawayo Province with 44. 4 percent.\n\nMashonaland East Province has so far recorded the least inflows of 5 percent, followed by Mashonaland West whose dams gained a cumulative 8,1 percent since December 19, 2024. The gains are expected to increase as more inflows are still anticipated.\n\nWith the dams receiving these significant and at times higher than normal inflows, ZINWA encourages communities downstream of dams to be on very high alert, to monitor the movement of children and livestock as well as ensuring that all water abstraction equipment along river channels is removed or properly secured, said Zinwa spokesperson Ms Marjorie Munyonga.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/dams.jpg",
            "description": "Herald Reporter Zimbabwe’s major dams continue to experience a surge as water levels rose to an average of 85,8 percent on the back of the rains being received in different parts of the country. According to the latest statistics from the Zimbabwe National Water Authority (Zinwa), as at February 24, the dams had gained a […]",
            "time": "06:34",
            "date": "26 Feb 2025"
        },
        {
            "title": "High National Youth Day turnout evidence of national relevance",
            "url": "https://www.herald.co.zw/high-national-youth-day-turnout-evidence-of-national-relevance/",
            "content": "Gibson Mhaka, Zimpapers Politics Hub\n\nIN Zimbabwe, certain national holidays such as Independence Day, Heroes Day, and Defence Forces Day which are deeply ingrained in national consciousness are held in high esteem.\n\nThese national holidays are pivotal moments that shape national identity and reflect the sacrifices made for freedom and sovereignty.\n\nThese holidays are marked by solemn ceremonies, vibrant cultural displays, and heartfelt tributes, reinforcing the nations collective memory and fostering a sense of unity and national pride.\n\nSuch holidays serve as crucial reminders of the countrys history, values, and the ongoing commitment to building a prosperous and just Zimbabwe for all.\n\nSimilarly, the recent National Youth Day observance at the Zimbabwe International Exhibition Centre in Bulawayo last Friday, marked by an exceptionally high turnout characterised by similar displays of national pride, suggests that it has become another national holiday held in high esteem.\n\nThousands of young people from across the countrys 10 provinces, along with youth representatives from countries such as Burundi, Mozambique, and South Africa, attended, a testament to the events growing significance.\n\nLast year, the day was celebrated in Masvingo at Mushagashe Vocational Training Centre, where there was also a high turnout.\n\nEvery year on February 21, Zimbabweans gather to celebrate National Youth Day, dedicated to honouring the vital role young people play in shaping the countrys present and future.\n\nEstablished as a national holiday in 2017, this day provides an opportunity to reflect on the immense potential of Zimbabwean youth and to encourage their active participation in national development.\n\nNational Youth Day is gaining significant traction.\n\nIt is more than just a commemoration; it is a call to action, a reminder that investing in young people is investing in the countrys prosperity.\n\nThe high turnout also illustrates the day is evolving into more than just a public holiday; it is a symbol of hope, unity, and renewal, solidifying its place as an important national event.\n\nThe day, which is also tied to the legacy of former President Robert Mugabe, who played a significant role in advocating for youth inclusion in national matters, also highlights the importance of youth empowerment and the role of young people in shaping a better Zimbabwe.\n\nIt is important to note that this surge in participation signals a growing public recognition and embrace of the holiday, solidifying its place within the national calendar.\n\nThe impressive turnout in Bulawayo serves as a potent indicator of the holidays expanding appeal.\n\nThe attendance reflects a deepening connection between Zimbabwean youth and the days intended purpose: to celebrate their contributions, address their concerns, and foster a sense of national unity.\n\nIn his keynote address at the National Youth Day commemorations, President Mnangagwa stated that the huge turnout and the peaceful, jovial, and electric atmosphere characterising the gathering reflected the countrys collective unity and its defining national character as an independent and sovereign people.\n\nThis National Youth Day is set aside and dedicated to recognising the potential of you, the young people of our country. Use your leaders, believe in your potential, and will, continue to ensure that your zeal and energy are harnessed so that you accomplish your dreams and aspirations and ultimately, our national Vision 2030.\n\nI also commend you for the consciousness you have of our rich history, as well as the future we are marching towards. I urge you to continue working hard for our great motherland, Zimbabwe, with unflinching patriotism and loyalty. Resist and reject machinations of those who would want to divide you, and divide our nation, said President Mnangagwa.\n\nPresident Mnangagwa also challenged young people in leadership positions to continue demonstrating principles of servant leadership and discipline, while simultaneously encouraging youth participation in the countrys socio-economic and cultural affairs.\n\nYouth Empowerment, Development and Vocational Training Minister Tino Machakaire underscored the importance of the day, stating it was proclaimed and instituted in 2017 to celebrate the contributions made by youth to the development of our country.\n\nHe said this years theme: Empower Youth; Secure the Future resonated with the nations collective vision for a brighter future, one that is driven by the energy, creativity, and passion of young people.\n\nWe appreciate the initiatives that have been put in place to promote youth empowerment as well as the appointment of young people in various boards and positions of influence in the government, said Minister Machakaire.\n\nZanu PF Bulawayo province youth league chairperson Cde Freedom Murechu emphasised that the national Youth Day was an important day where young people also celebrated the youth of yesteryear who participated in the liberation struggle to liberate the country.\n\nAs Bulawayo Province, we are happy to have hosted the National Youth Day celebrations, and the huge turnout is a testament to the days growing esteem among the youth. Its a day where we celebrate both the current youth and the youth of yesteryear who participated in the liberation struggle to liberate our country.\n\nWe also aim to instil a strong work ethic within the youth, encouraging them to work for their country now, especially in light of the Presidents Vision 2030, where every youth has a role to play in its attainment.\n\nZanu PF Harare province youth league chairperson Cde Emmanuel Mahachi expressed gratitude that this years National Youth Day celebration spanned three days.\n\nWe are happy as youth to be part of Youth Day in Bulawayo, and we want to thank President Mnangagwa, who gazetted it as a public holiday in remembrance of the youth. It is an important public holiday because, of all the public holidays, this one is specifically for the youth.\n\nWe want to acknowledge that this years celebrations are different from previous ones because we are seeing the youth exhibiting their innovations in line with youth empowerment. As youth, we once appealed to His Excellency for a youth fund, similar to what is provided to War Veterans, and we are looking forward to him considering our request, said Cde Mahachi.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/National-Youth-Service-1.jpg",
            "description": "Gibson Mhaka, Zimpapers Politics Hub IN Zimbabwe, certain national holidays such as Independence Day, Heroes’ Day, and Defence Forces Day which are deeply ingrained in national consciousness are held in high esteem. These national holidays are pivotal moments that shape national identity and reflect the sacrifices made for freedom and sovereignty. These holidays are marked […]",
            "time": "06:34",
            "date": "26 Feb 2025"
        }
    ]
}