{
    "news": [
        {
            "title": "‘Improving livelihoods  top priority’",
            "url": "https://www.herald.co.zw/improving-livelihoods-top-priority/",
            "content": "Zvamaida Murwira, Senior Reporter\n\nZIMBABWE and Cuba should never surrender the fight to improve their peoples livelihoods despite the yoke of illegal sanctions and blockades imposed on them by the United States and Western countries, visiting president of the Cuban National Assembly, Esteban Lazo Hernandez, has said.\n\nBriefing journalists at State House in Harare yesterday soon after holding bilateral talks with President Mnangagwa, Mr Hernandez said Zimbabwe and Cuba should instead upscale their political relations to stronger economic ties for the good of the people.\n\nCuba has always been able to count on the support of Zimbabwe in our fight against the blockade, sanctions, against all the abuse of imperialism and the inclusion of Cuba on the list of so-called countries sponsoring terrorism. That has been creating difficulties for the life of our people because it touches on our incomes, our access to financial bodies and all that impacts the living conditions of our people, he said.\n\nBut we will never surrender. We are going to keep fighting. It has been 63 years since the blockade was imposed on our country, but we have never surrendered. With the support of our brothers and sisters in Africa and particularly Zimbabwe, we will continue to move forward.\n\nTurning to yesterdays discussions with President Mnangagwa, Mr Hernandez said they explored ways to deepen co-operation in several areas.\n\nWe exchanged ideas on the relations between Cuba and Zimbabwe that have been based on fights and battles, that have been the fruits and friendship between Commander in Chief (Cuban founding leader) Fidel Castro and the founding father of Zimbabwe Robert Mugabe, he said.\n\nWe have been discussing a lot of things and we have also condemned all the sanctions that have been imposed on Zimbabwe by Western powers, that have impeded the development of your country. Our main objective is to continue fostering, developing and deepening relations that are currently at their best moments. We have been discussing reinforcing relations between political parties, our parliaments and our Governments and more importantly, we are convinced that we should take our economic relations to the same level that our political ties are at.\n\nMr Hernandez said Zimbabwe and Cuba enjoy long-standing warm bilateral relations which have seen a deepening of co-operation in health and education.\n\nThere is a deep connection and friendship between our two peoples. Many Cubans were sent on missions here to Zimbabwe and over 3 000 Cubans have come here. And there are over 3 000 sons and daughters of Zimbabwe who have been able to study and graduate in Cuba as evidence of our warm bilateral relations, he said.\n\nBoth Zimbabwe and Cuba have held reciprocal solidarity engagements through enhanced co-operation where Havana has trained more than 3 000 teachers in Mathematics and Science coupled with the help it rendered in pharmaceuticals.\n\nThe training programme is now being undertaken at Bindura University of Science Education.\n\nThere have been reciprocal visits at the highest level in the two countries aimed at exploring ways to deepen co-operation.\n\nYesterdays meeting was attended by the Speaker of Parliament, Advocate Jacob Mudenda, Foreign Affairs and International Trade Minister, Professor Amon Murwira, Members of Parliaments Portfolio Committee in Foreign Affairs led by Cde Webster Shamu and Cuban Ambassador to Zimbabwe, Ms Suseleys Perez Mesa.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/HE.jpg",
            "description": "Zvamaida Murwira, Senior Reporter ZIMBABWE and Cuba should never surrender the fight to improve their people’s livelihoods despite the yoke of illegal sanctions and blockades imposed on them by the United States and Western countries, visiting president of the Cuban National Assembly, Esteban Lazo Hernandez, has said. Briefing journalists at State House in Harare yesterday […]",
            "time": "08:27",
            "date": "04 Mar 2025"
        },
        {
            "title": "Zambia backs President’s regional peace initiatives",
            "url": "https://www.herald.co.zw/zambia-backs-presidents-regional-peace-initiatives/",
            "content": "Wallace Ruzvidzo, Herald Reporter\n\nTHE Zambian Government has reaffirmed its commitment to supporting SADC Chairperson, President Mnangagwa in his ongoing efforts to promote peace, security and stability in the region and beyond.\n\nZimbabwe hosted the 34th session of Zimbabwe-Zambia Joint Permanent Commission on Defence and Security which ended yesterday in Victoria Falls.\n\nThe Zimbabwean delegation was led by Minister of State for National Security Lovemore Matuke, who was accompanied by Minister of Defence Cde Oppah Muchinguri-Kashiri as well as Permanent Secretaries Aaron Nhepera and Ambassador Raphael Faranisi.\n\nThe Zambian delegation was led by acting Minister of Defence Dr Douglas Syakalima, who was accompanied by Minister of Home Affairs and Internal Security Jacob Jack Mwiimbu, and Permanent Secretaries Mr Maambo Haamaundu and Mr Goodson Sinyenga and Zambian Ambassador to Zimbabwe Mr Derrick Livune.\n\nIn a joint statement, Minister Matuke and acting Minister Syakalima said Zambia, as a member of the SADC Organ Troika on Politics, Defence and Security Co-operation, had pledged to continue supporting peace efforts being championed by President Mnangagwa as Chair of the regional bloc.\n\nThe Zambian delegation congratulated His Excellency, Dr Mnangagwa, for assuming the position of Chairperson of the Southern African Development Community.\n\nIn this regard, as a member of the SADC Organ Troika on Politics, Defence and Security Co-operation, the Zambian delegation assured their counterparts of Zambias support to the Chairperson of SADC in his efforts of ensuring peace and security in the region, and beyond, reads the statement.\n\nThe Commission noted that there was general peace and stability in the region, with President Mnangagwa leading from the front in spearheading peace initiatives in the conflict plagued eastern DRC.\n\nIt (commission), however, expressed concern over a multiplicity of security challenges in some member states, which include terrorism, transnational crimes, poaching, irregular migration, human and drug trafficking, smuggling and other related cross border vices. In this regard, the commission agreed to continue co-operating and devising new strategies aimed at addressing these security threats.\n\nThe commission, however, expressed concern over the deteriorating security and humanitarian crises in the eastern Democratic Republic of the Congo.\n\nMinister Matuke and acting Minister Syakalima said the commission had also called for concerted efforts aimed at restoring peace in Mozambiques Cabo Delgado Province.\n\nThe Commission then congratulated Zimbabwe and other member States in the region; Botswana, DRC, Eswatini, Mauritius, Mozambique, Namibia and South Africa, for successfully holding elections from the time of the 33rd Session of the Commission held in 2022.\n\nThe unconditional removal of unilateral coercive measures imposed on Zimbabwe, was also called for by the commission.\n\nIt also noted the Government of Zimbabwes policy of engagement and re-engagement, and concerted solidarity efforts from SADC and friendly countries, said Minister Matuke and acting Minister Syakalima.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/03/Cde-Lovemore-Matuke-680x373-680x380.jpg",
            "description": "Wallace Ruzvidzo, Herald Reporter THE Zambian Government has reaffirmed its commitment to supporting SADC Chairperson, President Mnangagwa in his ongoing efforts to promote peace, security and stability in the region and beyond. Zimbabwe hosted the 34th session of Zimbabwe-Zambia Joint Permanent Commission on Defence and Security which ended yesterday in Victoria Falls. The Zimbabwean delegation […]",
            "time": "08:27",
            "date": "04 Mar 2025"
        },
        {
            "title": "Zim receives maize grain boost from UAE",
            "url": "https://www.herald.co.zw/zim-receives-maize-grain-boost-from-uae/",
            "content": "Remember Deketeke and Patience Maturure\n\nZimbabwe has received a significant boost in its food security efforts with the arrival of 700 tonnes of grain donated by the United Arab Emirates, part of a total consignment of 8 530 tonnes.\n\nThe donation comes in response to an appeal made by President Mnangagwa, following the severe drought induced by El Nio that impacted Zimbabwe and much of the Southern African Development Community (SADC) last year.\n\nAt the handover ceremony yesterday, Local Government and Public Works Minister, Daniel Garwe, expressed gratitude for the donation, highlighting its importance to communities affected by the drought.\n\nWe have gathered here today to receive an initial 700 tonnes of maize grain out of a total of 8 530 tonnes donated by the United Arab Emirates for distribution to our communities affected by the drought, he said.\n\nThis initial delivery marks a crucial step in addressing the food shortages that have plagued the region.\n\nMinister Garwe emphasised that this donation aligns with the Governments efforts to implement the Food Deficit Mitigation Strategy (FDMS), which aims to combat food insecurity in vulnerable communities.\n\nThe donation comes at a time when the Government of Zimbabwe and partners are accelerating the implementation of the overarching Food Deficit Mitigation Strategy, he noted.\n\nThe grain is expected to play a key role in cushioning cereal requirements in marginalised areas.\n\nMinister Garwe highlighted the long-standing relationship between Zimbabwe and the UAE, saying the handover ceremony does not conclude anything; but indeed, fulfils the existence of our long-lasting relationship.\n\nHe assured attendees that the Government would ensure the donation reaches those in need, up to the last mile.\n\nMinister Garwe also said the UAEs gesture would assist in cushioning the cereal requirements for affected communities.\n\nNo one and no place must be left behind in terms of food security, he said.\n\nHis remarks reflect the Governments commitment to ensuring that all citizens have access to adequate food, especially as the country begins to recover from last years drought.\n\nPublic Service, Labour and Social Welfare Minister, Edgar Moyo, said the donation would supplement existing food distribution programmes. The distribution of maize is a contribution to a programme that is already existing; we have a distribution plan in place that is already running, he explained.\n\nMinister Moyo clarified that the donated grain would not be distributed in its raw form but would be milled and then provided as mealie meal, following established distribution protocols.\n\nThe UAE Ambassador to Zimbabwe, Jassim Mohammed Al Qasimi, said Zimbabwe and the UAE have become more than brothers.\n\nZimbabwe and the UAE have transcended the bond of brotherhood, forging a partnership that stands as a testament to our shared aspirations, he said.\n\nZimbabwe and the UAE have evolved beyond mere sibling ties, embracing a robust alliance that exemplifies mutual growth and collaboration.\n\nThe Ambassador pledged to continue supporting Zimbabwe to ensure no one and no place is left behind.\n\nThe collaboration between the UAE and Zimbabwe is poised to make a significant impact in addressing food challenges in the affected areas.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/UAE.jpg",
            "description": "Remember Deketeke and Patience Maturure Zimbabwe has received a significant boost in its food security efforts with the arrival of 700 tonnes of grain donated by the United Arab Emirates, part of a total consignment of 8 530 tonnes. The donation comes in response to an appeal made by President Mnangagwa, following the severe drought […]",
            "time": "08:27",
            "date": "04 Mar 2025"
        },
        {
            "title": "RBZ wants banks to return to core business",
            "url": "https://www.herald.co.zw/rbz-wants-banks-to-return-to-core-business/",
            "content": "Business Reporter\n\nRESERVE Bank of Zimbabwe (RBZ) Governor, Dr John Mushayavanhu, has urged banks to shift from fee-based income models to traditional lending or funded income-driven approaches.\n\nHe cautioned that insistence on exorbitant fees and commissions could lead to banks being pushed out of the market by more efficient players.\n\nBanks typically rely on funded income as a primary revenue source.\n\nHowever, data indicates that they are generating 80 percent of their revenue from non-funded income.\n\nThe central bank is working with banks to make sure that they go back to core business, which is the business of lending money, said Dr Mushayavanhu in a podcast interview with ZTN Prime in Harare on Friday last week.\n\nAnd also, as the economy and the banking sector digitalises, you will find that the cost of maintaining an account or the cost of doing a transaction will go down.\n\nThe challenge is out there. If the banks do not change, they will be pushed out of the market by more efficient players.\n\nDr Mushayavanhu also indicated that large corporate entities can negotiate more favourable interest rates with their banking partners, utilising the size of their deposit holdings as leverage.\n\nThe imposition of exorbitant bank charges and reluctance to pay interest on deposits has been identified as a significant factor discouraging individuals from saving.\n\nThis has severely affected the national savings culture, contributing to the erosion of savings, and in some cases, resulting in the complete wiping out of deposit balances.\n\nThe lack of interest on deposits, coupled with high charges, has created a deeply unfavourable environment for savers, economic analyst Mr Carlos Tadya said.\n\nThis is a major concern for long-term capital formation.\n\nThe situation highlights the need for a comprehensive review of the banking sectors role in supporting savings and investment. Policy interventions are needed to incentivise savings and protect depositors interests.\n\nAn analysis by the central bank reveals a significant reliance on non-interest income, which constituted a substantial 87,57 percent of the sectors cumulative income in the six months to June 2024.\n\nThe primary drivers of the non-interest income were identified as net gains from the revaluation of foreign currency assets and investment properties.\n\nWhile the gains contributed significantly to the sectors profitability, the heavy dependence on non-funded income raises concerns about long-term sustainability.\n\nAccording to the RBZ, fluctuations in foreign exchange rates and property values can bring volatility and unpredictability into the sectors earnings.\n\nA more balanced income structure, incorporating a greater proportion of interest income from lending activities, would likely enhance the sectors resilience and stability.\n\nDr Mushayavanhu said the stability of the ZiG, which has remained firm on both the official and parallel markets, should instill confidence and encourage individuals to deposit their funds in banks.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/10/ef.jpg",
            "description": "Business Reporter RESERVE Bank of Zimbabwe (RBZ) Governor, Dr John Mushayavanhu, has urged banks to shift from fee-based income models to traditional lending or funded income-driven approaches. He cautioned that insistence on exorbitant fees and commissions could lead to banks being pushed out of the market by more efficient players. Banks typically rely on funded […]",
            "time": "08:27",
            "date": "04 Mar 2025"
        },
        {
            "title": "Packed programme for Cuban delegation",
            "url": "https://www.herald.co.zw/packed-programme-for-cuban-delegation/",
            "content": "Blessings Chidakwa, Herald Reporter\n\nA CUBAN delegation led by the president of the National Assembly, Esteban Lazo Hernandez, took part in several events yesterday after meeting President Mnangagwa at State House in Harare.\n\nThe delegation proceeded to lay a wreath at Fidel Castro Square, located along the street bearing his name, honouring Castros enduring legacy and the immense support Cuba provided to Zimbabwe during its liberation struggle.\n\nFidel Castro Square, now a lasting tribute to the strong relationship between the two nations, was named by the Zimbabwean Government in recognition of Cubas role in Zimbabwes fight for independence.\n\nMinister of State for Harare Metropolitan Provincial Affairs and Devolution, Senator Charles Tawengwa, said the Cuban delegations visit reaffirmed the deep-rooted ties between Zimbabwe and Cuba, which were forged during the liberation struggle.\n\nWe fondly recall how Cuba, under the leadership of Fidel Castro, supported us with training, arms, and other resources, he said.\n\nThis road, formerly Charter Road, was renamed Fidel Castro Road in 2020 to honour that unwavering support and remind future generations of the bond between our nations.\n\nThe Cuban delegation also toured Liberation City, including the Museum of African Liberation, where they viewed a collection of historical artefacts and saw the construction of the museum.\n\nDuring the tour, Mr Hernandez watered a Cuban tree near the Cuban flag, symbolising the ongoing friendship.\n\nIn a symbolic gesture, Mr Hernandez also presented a picture book of Fidel Castro to the Museum of African Liberation while Ambassador Kwame Muzavazi, CEO of the Institute of African Knowledge (INSTAK), presented the Cuban delegation with the Africa Fact Book.\n\nSpeaking on behalf of the Cuban delegation, Hero of the Republic of Cuba, Fernando Gonzalez, expressed strong support for the museum project, emphasising its significance not only for African countries but for Cuba as well. We consider ourselves part of the African continent culturally, and this museum will play a pivotal role in preserving the memory of the liberation struggles, he said.\n\nWe hope that young people will come here, learn from history, and understand the contributions made by all countries fighting for liberation.\n\nAmong the distinguished delegates were Zanu PFs Secretary for International Relations, Cde Simbarashe Mumbengegwi, and Zanu PF Deputy Commissar Cde Webster Shamu, who recently visited Cuba.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Esteban-Lazo-Hernandez.jpg",
            "description": "Blessings Chidakwa, Herald Reporter A CUBAN delegation led by the president of the National Assembly, Esteban Lazo Hernandez, took part in several events yesterday after meeting President Mnangagwa at State House in Harare. The delegation proceeded to lay a wreath at Fidel Castro Square, located along the street bearing his name, honouring Castro’s enduring legacy […]",
            "time": "08:27",
            "date": "04 Mar 2025"
        },
        {
            "title": "SMEs driver to economic prosperity — Minister",
            "url": "https://www.herald.co.zw/smes-driver-to-economic-prosperity-minister/",
            "content": "Joseph Madzimure, Senior Reporter\n\nSmall and medium enterprises remain a crucial driver of employment creation, economic growth, and poverty reduction in Zimbabwe, Women Affairs, Community, Small and Medium Enterprises Development Minister Monica Mutsvangwa said yesterday.\n\nGiving a lecture at the joint command and staff course number 38 at Zimbabwe Staff College, Minister Mutsvangwa said Government remained committed to strengthening the sector and ensuring that no one and no place was left behind in line with Vision 2030.\n\nAs we march towards Vision 2030 of an upper-middle-income economy, the role of SMEs cannot be overemphasised. You as highly skilled professionals are exceptionally equipped to capitalise on the abundant SME opportunities in Zimbabwe and the continent at large, she said.\n\nEntrepreneurship offered a rewarding path to economic empowerment and wealth creation.\n\nI strongly encourage you to explore SME initiatives as a means of building sustainable livelihoods, said Minister Mutsvangwa.\n\nThe Government of Zimbabwe was committed to providing the necessary support for successful entrepreneurial journeys. In 2024 alone, Government successfully facilitated market access for 14 173 SMEs, with notable participation in events like the Zimbabwe International Trade Fair and international trade fairs in Zambia, Tanzania, Malawi, Namibia, India, China and Turkey.\n\nMinister Mutsvangwa indicated that this year, 41 SMEs have so far been mobilised to market their products at the Osaka World Expo in Japan. Recognising the critical need for decent and appropriate workspaces, she said the Government, in close partnership with local authorities, development partners and private investors, was driving the development of SME Infrastructure. The Government was actively promoting innovative investment models, Including the arrangements known as build-operate-transfer (BOT) and build-own-operate-transfer (BOOT).\n\nTo demonstrate our commitment, significant Government funding has been allocated for SME workspace construction, with projects currently underway in Gweru, Chirundu, Bulawayo, Gweru and Chikomba.\n\nWomen Affairs, Community, Small and Medium Enterprises Development Minister Monica Mutsvangwa addresses student at the Zimbabwe Staff College in Harare yesterday.\n\nRecognising the immense contribution of SMEs to economic growth and employment, she said the Government had undertaken deliberate efforts to enhance the sectors sustainability and expansion.\n\nSeveral strategic interventions had been put in place to support SME growth and employment creation.\n\nThe Second Republic had improved the business environment such that private sector financial institutions had come on board to embrace SMEs by giving them loans.\n\nNew financial products and services specifically addressing the needs of women entrepreneurs, such as flexible loan terms, long-term capital loans, and comprehensive business development support, have been put in place.\n\nThe proactive implementation of the Financial Inclusion Strategy I and II by the Reserve Bank of Zimbabwe has improved SME access to and use of formal financial services..\n\nIn Zimbabwe the SME sector had become the engine for economic development with over 3,4 million registered SMEs, employing over 4,8 million people and the sector contributing about 60 percent to GDP according to the 2021 MSMEs Survey.\n\nFurthermore, 76 percent of Zimbabwes workforce was engaged in the SME sector, and notably, women constitute 52,1 percent of full-time employees, highlighting the sectors importance in women empowerment and national economic transformation.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/M1.jpg",
            "description": "Joseph Madzimure, Senior Reporter Small and medium enterprises remain a crucial driver of employment creation, economic growth, and poverty reduction in Zimbabwe, Women Affairs, Community, Small and Medium Enterprises Development Minister Monica Mutsvangwa said yesterday. Giving a lecture at the joint command and staff course number 38 at Zimbabwe Staff College, Minister Mutsvangwa said Government […]",
            "time": "08:27",
            "date": "04 Mar 2025"
        },
        {
            "title": "EDITORIAL COMMENT: Educational television channel gives teachers extra string to their bow",
            "url": "https://www.herald.co.zw/editorial-comment-educational-television-channel-gives-teachers-extra-string-to-their-bow/",
            "content": "Dedicated television and radio channels for education is now a practical possibility with the switch to digital output creating the electronic space for the channels and the near nationwide coverage of free-to-air transmitters ensuring that those who need the programmes can watch them.\n\nIt is only with the development of the television and radio systems that the opportunity for dedicated education channels now exists, and the Government is moving rapidly into the next stage of having such channels and creating the content.\n\nQuite sensibly, the Ministry of Primary and Secondary Education will be in charge of the channels, to make sure that the broadcasting times can be sensible for each level of the education system and that the content is what is needed and fits in with Zimbabwes heritage-based education system.\n\nThis will need some thought, as there will be around an hour each day at most for each grade or form, and the Ministry is most aware of where gaps exist and what sort of content would be most useful.\n\nThe channels are not replacing school teachers, but rather acting as a supplement and being able to extend their range and be able to fill gaps.\n\nSome subjects may have very little television time, since they are not really visual and because teachers in the schools will not need much supplementary content.\n\nOther subjects will benefit immensely by being able to have the extra content, and there will be programmes and output that will benefit a wide range of grades or forms.\n\nTo a degree, the more isolated schools will benefit the most as they are most likely to have to do everything in house, while a central urban school, for example, has opportunities to show pupils more outside events and the pupils can in any case access museums and other facilities without much problem.\n\nThe upgrade in syllabuses for more scientific and technical content will be made a great deal easier when some programming can show things that may very well not be available within the local community of a school, and that would include urban schools as well as rural schools.\n\nThis will give an opportunity for some innovative material from experts with a gift and training for teaching these sort of subjects, especially as so much teaching of a technical subject does require being able to show pupils what is going on, rather than just describing or relying on text books.\n\nAgain the television will be the supplement to the school teaching, but in some cases a very important supplement that makes the school teaching far more effective.\n\nThere has been some pre-school and infant radio programming, not much but some, for many decades.\n\nThe Covid-19 pandemic and the resulting lockdowns saw a degree of emergency programming to help children who had to stay at home or where limited in how many days a week they could physically be in a school.\n\nThis showed us what was wanted and what was possible and that has no doubt been one of the practical reasons why the Education Ministry is so keen on the dedicated channels and why it has been pushing for them as the technology advances make these a practical proposition.\n\nContent has been thought through, especially as some content may be fairly expensive.\n\nThe Ministry is not just looking at in-house content, but at sponsored programming and the contributions of many others.\n\nSo long as this content is accurate, so long as it can be fitted into the national syllabus that all schools have to follow, and so long as it is useful, it appears the Ministry will be happy for all contributions.\n\nAt the same time the Government has been steadily pushing ahead with other technology programmes, encouraging schools that can raise their own funds to have computer laboratories and implementing a programme that sees these being set up at schools that need them but who do not have the resources or a sponsor willing to help out.\n\nThe objective is that all schools and all children will have some internet access, and this will be added to the television channel, to ensure that everyone can benefit.\n\nThere has been a lot of talk about the rural-urban divide, largely built around the ease of establishing fairly cheap internet connections in urban areas and the higher price, sometimes much higher price if phone services are used, for a narrower band service in rural areas.\n\nSatellite services, which are still significantly more expensive than the cable services now available in most urban areas, will help narrow the gap, and the television channel will reinforce this process.\n\nAll this technical advance we are now seeing will never replace ever better schools with ever better facilities, and of course the core of any educational system are motivated and able teachers who can bring their subjects to life.\n\nBut the technical advances also make life easier for teachers who can show pupils, as well as describe to pupils, a wide range of activities and images that make learning easier and in some cases even possible. So while the Education Ministry appears to be moving forward with implementing the plans for its content and scheduling, we still need the assignment of the channel and the practical broadcasting of the content as we step up our education efforts with yet another link between children and the world they live in.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Television.jpg",
            "description": "Dedicated television and radio channels for education is now a practical possibility with the switch to digital output creating the electronic space for the channels and the near nationwide coverage of free-to-air transmitters ensuring that those who need the programmes can watch them. It is only with the development of the television and radio systems […]",
            "time": "08:27",
            "date": "04 Mar 2025"
        },
        {
            "title": "ZIFA SET FOR DIGITAL TRANSFORMATION",
            "url": "https://www.herald.co.zw/zifa-set-for-digital-transformation/",
            "content": "Eddie Chikamhi, Zimpapers Sports Hub\n\nZIMBABWEAN football is set for a major digital transformation as well as enhancing its grassroots development blueprint following the signing of two key strategic partnerships between ZIFA and local brands in Harare yesterday.\n\nZIFA president Nqobile Magwizi believes the MOUs with Kyros Sports and PD House will be critical in the pathway they are taking towards resuscitating domestic football in the digital era.\n\nThe association is looking to ramp up its schools football development drive through their partnership with Kyros Sport, who has made significant contributions in disciplines such as rugby, athletics, and swimming.\n\nPD House, a leading web development company, has also been roped in to transform the associations website to international standards, making ZIFA more accessible and engaging and, at the same time, unlocking new revenue streams through various technological innovations.\n\nThis is one of many partnership deals we hope to be signing as we go into the future as we go towards transforming our football, said Magwizi.\n\nOne of the critical aspects of building sport is making sure that its well resourced.\n\nResourcing sports, and football in particular, does not only require people that are going to bring in money, but it also requires creating environments or ecosystems that will generate the revenues we need to make football move forward.\n\nSo, a lot of the engagements weve been doing are aimed at generating capacity in all spheres of our thrust as an association to build the sport.\n\nThe new ZIFA president reckoned the association stands to derive financial spin-offs from the partnerships.\n\nI think the beauty about the agreements that we are getting into is that ZIFA is not laying out a single cent, but we are going to stand to benefit from these relationships financially.\n\nOf course, there is a lot of work that has to go in first in establishing the projects, and hence we have these partners who are able, who are going to be working with us to ensure that these projects are established, and then they can start also generating revenue, which we very much need for the growth of our football in Zimbabwe. So, we are very excited, said Magwizi.\n\nKyros Sports, a local sports marketing, talent identification, and management company, will be working with schools to create a clear pathway for the next generation of football stars.\n\nThe companys director, Nyasha Muchochomi, said they employ modern talent identification processes, training, and nurturing methods through the use of advanced technology tools. They have a strong team on the ground and have previously worked with the Zimbabwe Rugby Union, the National Athletics Association of Zimbabwe, and swimmer Donata Katai to prepare her for her Olympic experience.\n\nWeve done quite a lot in sports management and creating systems. I think where our strength lies is in creating structures and systems that develop talent, and in terms of youth development, weve done that with different associations in Zimbabwe and also internationally.\n\nWeve seen great success, and I think some of you are also privileged to some of our other myriad activities, not just in media marketing and identifying talent and highlighting on a platform, which PD House is also going to be part of in terms of creating a platform where we promote Zimbabwe to the rest of the world.\n\nSo, we are excited to have this partnership and create value for Zimbabwe and football, said Muchochomi.\n\nZIFA board member Technical Development Tafadzwa Benza was optimistic about their marriage with Kyros Sport, who they also hope will assist the national teams in embracing artificial intelligence and other digital technologies in the future.\n\nTheyve got programs that will help in capacitating our schools to have the right training programs so that we can start having clear pathways for junior football development.\n\nThat is something that is very critical and something that were excited to partner with them on, said Benza.\n\nPD House Business Development Manager Martin Mukaro said his company was more interested in the technological side of football business.\n\nWe are more into enterprise resource planning. Thats what PD House does. But out of that, we are then able to do all sorts of things, such as websites, apps, and any other technology platform that you can think of.\n\nEverything is actually being developed in-house. We have a team that is actually based overseas that actually undertakes all these apps.\n\nFor example, here in Zimbabwe for the past three years weve been working with Zimpapers. I dont know if any of you have come across the Zimpapers app. It was actually developed by PD House, and there are a lot of developments that are being worked on in the Zimpapers app where, to a large extent, it will assist in terms of developing things like e-commerce.\n\nSo, its the same thing that we are looking at ZIFA and saying to them theres a lot of opportunities that can actually be created, particularly in terms of e-commerce, ticket sales, and reaching different markets all over the world.\n\nThe moment you go on the technology side, you are no longer just limited to broadcasting or to talking to Zimbabweans in Zimbabwe alone.\n\nBut all of a sudden now you can reach out to literally everyone around the world. So, to a large extent, we are actually going to be developing the apps and the website and then were going to be working with people like you, the media, to make sure that there is enough information that is being disseminated to the different people around Zimbabwe as well, said Mukaro.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/ZIFA.jpg",
            "description": "Eddie Chikamhi, Zimpapers Sports Hub ZIMBABWEAN football is set for a major digital transformation as well as enhancing its grassroots development blueprint following the signing of two key strategic partnerships between ZIFA and local brands in Harare yesterday. ZIFA president Nqobile Magwizi believes the MOUs with Kyros Sports and PD House will be critical in […]",
            "time": "08:27",
            "date": "04 Mar 2025"
        },
        {
            "title": "Stop insulting leadership, ZANU PF members told",
            "url": "https://www.herald.co.zw/stop-insulting-leadership-zanu-pf-members-told/",
            "content": "Victor Maphosa, Mashonaland East Bureau\n\nZANU PF chairperson for Mashonaland East province Cde Daniel Garwe has implored members and supporters to stop insulting the partys leadership on social media platforms.\n\nAddressing party members during the Mashonaland East Provincial Co-ordinating Committee (PCC) meeting in Marondera at the weekend, Cde Garwe said it is not a ZANU PF culture to insult the President and called on those who are doing so to stop it henceforth.\n\nLast year we held our conference in Bulawayo and 132 resolutions were adopted. Today we are not here to explain all these adopted resolutions, but one. We adopted one resolution where all provinces agreed to allow President Mnangagwa to remain in office beyond 2028.\n\nWe then came back and began telling people about this resolution through inter-district meetings. We held these inter districts, we are holding them and we will continue to hold them, telling people about these resolutions, all of them, but our emphasis is on Resolution Number One.\n\nOf all the resolutions, none of them granted anyone permission to insult others. No resolution was adopted allowing people to be forced to do a slogan. No resolution was passed, which allows someone to insult anyone because he or she is doing a certain slogan.\n\nNow, what is bothering us is that there are some elements who are insulting President Mnangagwa on social media. I am sure that all of you here are aware of how President Mnangagwa is being insulted and disrespected on social media by people who we think are ZANU PF. This is unacceptable.\n\nCde Garwe said if anyone is aggrieved, there is always a better way of tabling issues adding that throwing insults is not one of them.\n\nWe have a ZANU PF way of solving issues. Our party constitution provides for a conducive platform to air our grievances.\n\nOne should use party structures. But some people are no longer doing that. Mashonaland East is now on top of the list for insulting the President, including insults directed at me the chairman. We should never do that. There are better ways of expressing issues, he said.\n\nCde Garwe said he would not remain silent while some elements from the province disrespect the President.\n\nHe also urged youths to remain vigilant and steadfast in protecting the party and the President.\n\nWe will not remain silent if we are truly ZANU PF in spirit and truth when our party and President are being insulted. Because if we remain idle, we are automatically supporting the insults. We will not remain silent.\n\nWe are all protection officers; we must protect the party and the President. There is no room for disrespecting people. We voted for our President to be in office, so we will keep on supporting him Cde Garwe said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Cde-Daniel-Garwe.jpg",
            "description": "Victor Maphosa, Mashonaland East Bureau ZANU PF chairperson for Mashonaland East province Cde Daniel Garwe has implored members and supporters to stop insulting the party’s leadership on social media platforms. Addressing party members during the Mashonaland East Provincial Co-ordinating Committee (PCC) meeting in Marondera at the weekend, Cde Garwe said it is not a ZANU […]",
            "time": "08:27",
            "date": "04 Mar 2025"
        },
        {
            "title": "Reckless drivers  must lose licences",
            "url": "https://www.herald.co.zw/reckless-drivers-must-lose-licences/",
            "content": "Isdore Guvamombe\n\nIf there is anything that has defied logic over the years, it is the way we, as a country, have failed to tame the wayward on our roads  the kombi drivers.\n\nEach time I see a kombi I cringe, for, am never sure what worst thing the driver is going to do, suddenly. kombis have become a menace whether you are a passenger, a pedestrian, a cyclist or another driver.\n\nCan anything good come out of kombi drivers?\n\nThe abnormal has become the normal, common sense is no longer common and the law is no longer legal. Yes, the kombi drivers have made traffic laws illegal. Illegal!\n\nLife has become cheap. The kombi drivers, the dare devils or rather devil incarnates, do as they wish on our roads regardless the dangerous, and mostly fatal effects to other motorist and pedestrians too.\n\nThe kombis do everything wrongly. The drivers care only about the cash, not even the passengers who bring in the cash, for once a passenger gets in, all rights are taken away, the passenger immediately becomes luggage and the route can change any minute or the destination, even the fare can change.\n\nThe touts shout obscenities to anyone as if they were not born of women. The touts shove men, women and children, (including the elderly) into their vehicles, as if they are not people.\n\nScenes of store-away touts hanging precariously on kombi backs are common and personally, am not sure of others, I have not heard of a case in which a kombi crew and the touts have been prosecuted for that disturbing behaviour.\n\nThis is common during peak hours and ironically this is the time when police are on the road.\n\nScenes of kombis passing through road blocks with store-aways on their back are very common. One wonders what exactly it means.\n\nJust a few days ago, President Mnangagwa lamented the lack of discipline on our roads.\n\nThe President even asked for the police to act and hopefully this time around they will act.\n\nSome of these things, in my opinion, can easily be dealt with by our police. Something is just lacking somewhere.\n\nIn the past few weeks, I was very excited to see roadblocks all over the country but at the end, they ended up dealing with trivial issues, not that those issues are not important, but police should decisively deal with errant drivers and touts.\n\nMaybe we needed more deterrent punishment for these drivers.\n\nA little investigation has also shown that most of the men and women driving buses also came from kombis and are doing exactly the same antics with the big buses.\n\nThen there is mushikashika, same club. Our roads have become dangerous. Every time you drive, you survive by luck. That is very bad.\n\nThe President was emphatic that The Zimbabwe Republic Police must tame the traffic jungle on the countrys roads through implementing the electronic traffic management system to curb carnage which has been on the rise over the years.\n\nHe made the remarks in his keynote address at a ZRP recruit graduation ceremony at Mkushi Academy recently.\n\nThe high rate of indiscipline on our roads, which has resulted in the loss of countless lives due to road carnage, is disturbing. More worrisome is the fact that a total of 4 069 people were killed in road traffic accidents in 2024, compared to 2 104 in 2023, reflecting an astonishing 93 percent increase.\n\nThe ZRP is challenged to tame the traffic jungle by speedily implementing the Electronic Traffic Management System.\n\nI call upon all Zimbabwean citizens to respect the countrys traffic laws and cooperate with law enforcement agencies, said President Mnangagwa.\n\nThe President is very correct because, especially our urban roads have seen an influx of mushikashika and kombis that have become a menace as the drivers are notorious for flouting traffic laws.\n\nCommuter omnibus drivers and some private motorists are also a terror on urban roads due to recklessness.\n\nIt is our hope that the recent handover of 500 vehicles for police operations from the Government  which is a show of serious commitment on its part  will be used by police to ensure our safety.\n\nWe should be grateful that the Government is ensuring that the force is well-equipped with tools of the trade.\n\nBut modern ICT hardware and software are now of critical importance to an effective police force, and we have seen other African countries start doing it.\n\nHonestly at this stage of life we, as Zimbabweans should at this stage in life, never be troubled by public transport drivers.\n\nThey should be the most disciplined because they carry human life. But they are the worst.\n\nIt is a dream, for some of us, to one day drive from home to work and vice versa, in flowing traffic where kombis do not create side traffic, beat traffic lights or drive against legal traffic. That should not be a big dream. With a bit of enforcement, this can surely end overnight.\n\nThe President made it clear that he hoped that the various high-impact innovations that are being undertaken by the police such as the Automated Fingerprint System will aid investigations and subsequent convictions of both first and repeat offenders. More innovations of this type should be encouraged to enhance efficiency in the justice delivery system.\n\nMost of the law abiding citizens are with the President on this issue.\n\nAs drivers of private vehicles we are tired of being bullied by kombi and mushikashika drivers.\n\nThe irony of it is that the more you drive well and to the traffic book, the more you get bullied by the kombis and mushikashika.\n\nUnlike yesteryear where physical height and stamina were critical attributes for joining the force, today policing is no longer a walk in the park. The challenges in this profession now require higher levels of knowledge and broader skills. Hence, the importance of deliberately designed training curricula that mould competent and professional police officers. In this regard, it is commendable that the two-year diploma programme undertaken by the graduating class incorporated an elaborate syllabi of contemporary policing courses, said the President.\n\nThe President is spot on. Most of the accidents happening on our roads these days are human error. It is not a lie that bullying of drivers using legal rules on the road has increased to disturbing proportions. We need to tame the lawlessness.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Mushikashika.jpg",
            "description": "Isdore Guvamombe If there is anything that has defied logic over the years, it is the way we, as a country, have failed to tame the wayward on our roads — the kombi drivers. Each time I see a kombi I cringe, for, am never sure what worst thing the driver is going to do, […]",
            "time": "08:27",
            "date": "04 Mar 2025"
        }
    ]
}