{
    "news": [
        {
            "title": "Pedestrian dies after being hit by a truck",
            "url": "https://www.herald.co.zw/pedestrian-dies-after-being-hit-by-a-truck/",
            "content": "Midlands BureauOne person died on the spot after being hit by a truck along the Gweru-Zvishavane highway on Tuesday.Midlands Provincial police spokesperson Inspector Emmanuel Mahoko confirmed the accident that occurred around 16:40 pm.\n\nIt is alleged that Charles Sikarova (42) of Nkayi was driving a red Howo Sino truck towards Zvishavane along the Gweru-Zvishavane Road with three passengers on board, he said.\n\nInspector Mahoko said upon reaching the 43km peg, he tried to overtake a Nissan Vanette that was ahead of him.The truck veered off the road to the far left, hit and injured two pedestrians and then stopped.\n\nSikarovas passengers sustained varying degrees of injuries. One pedestrian died upon admission at Shurugwi District Hospital, said Inspector Mahoko.Meanwhile in a separate incident, another pedestrian was hit by a motor vehicle whilst crossing the road.\n\nInspector Mahoko said the accident occurred along the Mberengwa-West Nicholson Road on Tuesday around 1pm.Trust Shumba (23) of Makwasha, Zvishavane, was driving a Toyota Probox heading towards West Nicholson with some passengers onboard.\n\nUpon reaching the 96km peg, he hit a 6-year-old boy who was crossing the road. The juvenile fell on the tarmac and sustained a cut on the forehead and a fractured left leg. He is currently admitted at United Bulawayo Hospitals and is in a serious condition,  he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/04/accident.jpg",
            "description": "One person died on the spot after being hit by a truck along the Gweru-Zvishavane highway on Tuesday.",
            "time": "18:39",
            "date": "15 Jan 2025"
        },
        {
            "title": "We need home-grown solutions for Africa’s challenges: Dr Muswere",
            "url": "https://www.herald.co.zw/we-need-home-grown-solutions-for-africas-challenges-dr-muswere/",
            "content": "Columbus Mabika\n\nHerald Reporter\n\nInformation, Publicity and Broadcasting services Minister Dr Jenfan Muswere has called on African nations to develop home-grown solutions for the problems being faced by African countries.\n\nHe made the remarks this afternoon while presenting the topic The Evolution of Information Systems and How this has Impacted on National Security at the National Defence University.\n\nDr Muswere said the Second Republic has made great strides in improving information systems.\n\nHe said developing nations cannot afford to continue depending on Western nations.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Screenshot-52-680x380.png",
            "description": "Columbus Mabika Herald Reporter Information, Publicity and Broadcasting services Minister Dr Jenfan Muswere has called on African nations to develop home-grown solutions for the problems being faced by African countries. He made the remarks this afternoon while presenting the topic “The Evolution of Information Systems and How this has Impacted on National Security” at the […]",
            "time": "18:39",
            "date": "15 Jan 2025"
        },
        {
            "title": "Hwange man steals goat, sells meat to owner",
            "url": "https://www.herald.co.zw/hwange-man-steals-goat-sells-meat-to-owner/",
            "content": "Tapiwa Chikuhwa\n\nHerald Correspondent\n\nA Hwange man who stole a goat and sold the meat to its owner has been sentenced to six months in prison.\n\nShylock Zulu (28) of Mashala Village appeared before the Hwange Magistrates Court facing charges of stock theft.\n\nThree months were suspended on condition that he does not commit a similar offense in the next five years.\n\nThe remaining three months were suspended on condition that he pay ZWG1 057 to Thabani Sibanda, the owner of the goat.\n\nOn January 8, 2025, Zulu unlawfully took Sibandas goat at the Mashala grazing area.\n\nZulu slaughtered the goat and proceeded to Sibandas homestead where he sold the meat to him for USD$15.\n\nHe claimed that it was bushbuck meat.\n\nSibanda became suspicious that the meat could be from his goat that had gone missing.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/courthammer-680x380.jpg",
            "description": "Tapiwa Chikuhwa Herald Correspondent A Hwange man who stole a goat and sold the meat to its owner has been sentenced to six months in prison. Shylock Zulu (28) of Mashala Village appeared before the Hwange Magistrates’ Court facing charges of stock theft. Three months were suspended on condition that he does not commit a […]",
            "time": "18:39",
            "date": "15 Jan 2025"
        },
        {
            "title": "Shebeen king fined",
            "url": "https://www.herald.co.zw/shebeen-king-fined/",
            "content": "Tapiwa Chikuhwa\n\nHerald Correspondent\n\nA shebeen operator from Nabole Village, Siakobvu, has been ordered to pay a fine of US$150 or serve two months in prison after he was convicted of operating a liquor shop without a licence.\n\nTyson Donald Siabwanda (28) appeared before the Karoi Magistrates Court facing charges of contravening the Liquor Act.\n\nThe court heard that on December 26, 2024, at around midnight, Siabwanda was found operating after the stipulated times in terms of the Liquor Act, leading to his arrest.\n\nIt was then established that he was not licenced to operate.\n\nAll the beer found on the premises was seized.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/courthammer-680x380.jpg",
            "description": "Tapiwa Chikuhwa Herald Correspondent A shebeen operator from Nabole Village, Siakobvu, has been ordered to pay a fine of US$150 or serve two months in prison after he was convicted of operating a liquor shop without a licence. Tyson Donald Siabwanda (28) appeared before the Karoi Magistrates Court facing charges of contravening the Liquor Act. […]",
            "time": "18:39",
            "date": "15 Jan 2025"
        },
        {
            "title": "Zim delegation heads to Africa Youth Congress in Uganda",
            "url": "https://www.herald.co.zw/zim-delegation-heads-to-africa-youth-congress-in-uganda/",
            "content": "Herald Reporter\n\nA delegation from Zimbabwe will be attending the Africa Youth Congress that is set to take place between January 16 to 18, 2025, in Uganda.\n\nThe congress aims to unite youth leaders across Africa to discuss critical issues such as education, employment, and health.\n\nRepresentatives from various youth organisations, Government officials, and activists are part of the delegation.\n\nThey plan to share Zimbabwes initiatives and learn from other countries best practices.\n\nThis is a vital opportunity for our youth to engage with their counterparts and address the challenges we face as a continent, said team leader Hopewell Tinashe Sako.\n\nThe congress is expected to foster collaboration and inspire actionable solutions for the future of African youth.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Screenshot-47-680x380.png",
            "description": "Herald Reporter A delegation from Zimbabwe will be attending the Africa Youth Congress that is set to take place between January 16 to 18, 2025, in Uganda. The congress aims to unite youth leaders across Africa to discuss critical issues such as education, employment, and health. Representatives from various youth organisations, Government officials, and activists […]",
            "time": "18:39",
            "date": "15 Jan 2025"
        },
        {
            "title": "Conservation stakeholders applaud appointment of Prof Gandiwa as ZimParks Director-General",
            "url": "https://www.herald.co.zw/conservation-stakeholders-applaud-appointment-of-prof-gandiwa-as-zimparks-director-general/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nStakeholders in the wildlife and conservation sector have welcomed the appointment of Professor Edison Gandiwa as the new Director-General of the Zimbabwe Parks and Wildlife Management Authority (ZimParks).\n\nProf Gandiwa replaces Dr Fulton Mangwanya, who moved to a new role in the Presidents Department.\n\nLeading voices in the sector are optimistic about the future of Zimbabwes conservation efforts under Prof Gandiwas leadership.\n\nWith over 20 years of wildlife conservation experience, Prof Gandiwa is seen as a strong leader who can tackle the pressing challenges facing Zimbabwes wildlife and biodiversity.\n\nMr Phillip Kuvawoga, senior director of landscape conservation at the International Fund for Animal Welfare (IFAW) congratulated Prof Gandiwa on his appointment.\n\nWe are thrilled to extend our warmest congratulations to Prof Gandiwa. His vision and expertise will make a significant impact on ZimParks and our shared efforts to preserve Zimbabwes natural heritage, Mr Kuvawoga said.\n\nMs Julia Pierini, chief executive officer of BirdLife Zimbabwe also expressed her confidence in Prof Gandiwas abilities.\n\nWe are very happy that Prof Gandiwa has been appointed as the new Director-General of ZimParks. His knowledge will be invaluable in the protection of Zimbabwes protected areas, Ms Pierini said.\n\nMs Olivia Mufute, country director for the African Wildlife Foundation (AWF) said she is optimistic about the future of conservation in Zimbabwe.\n\nWe are optimistic that the future of conservation in Zimbabwe will continue on a positive trajectory under Prof Gandiwas leadership, she said.\n\nMs Rumbidzai Takawira, executive director of The Conservation Conversation, said they hope for continued collaboration with ZimParks.\n\nWe look forward to working with Prof Gandiwa to strengthen conservation education, enhance public engagement, and drive innovative solutions, she said.\n\nWith Zimbabwes natural heritage facing numerous challenges, from poaching to human-wildlife conflict, the conservation community is hopeful that Prof Gandiwas leadership will bring a new era of sustainable and effective conservation in the country.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/07/WhatsApp-Image-2024-07-12-at-07.14.49-680x380.jpeg",
            "description": "Ivan Zhakata Herald Correspondent Stakeholders in the wildlife and conservation sector have welcomed the appointment of Professor Edison Gandiwa as the new Director-General of the Zimbabwe Parks and Wildlife Management Authority (ZimParks). Prof Gandiwa replaces Dr Fulton Mangwanya, who moved to a new role in the President’s Department. Leading voices in the sector are optimistic […]",
            "time": "18:39",
            "date": "15 Jan 2025"
        },
        {
            "title": "Beitbridge traffic to increase following suspension of operations at SA-Botswana border",
            "url": "https://www.herald.co.zw/beitbridge-traffic-to-increase-following-suspension-of-operations-at-sa-botswana-border/",
            "content": "Thupeyo Muleya\n\nBeitbridge Bureau\n\nThe volume of commercial and human traffic is expected to surge at the Beitbridge Border Post following the temporary closure of the South Africa-Botswana border due to high water levels at the port of entry.\n\nThe Groblers Bridge Border handles transit traffic to inland SADC.\n\nOf late, Beitbridge has been handling an average of 1000 commercial trucks daily, with the Groblers handling an estimated 300 trucks every day.\n\nIn a statement last night, South Africas Border Management Authority (BMA) advised transporters to use alternative border posts.\n\nThe Commissioner of the BMA, Dr Michael Masiapato wishes to inform all travellers, transport operators, and stakeholders that operations at Groblers Bridge Port of Entry have been temporarily suspended due to adverse conditions caused by high water levels as a result of the rainfall, said the BMA.\n\nThe BMA said operations were temporarily suspended to prioritise safety following consultations with Botswana authorities.\n\nWe assure the public that the situation is being closely monitored on an hourly basis, and regular updates will be provided.\n\nFor diversion of movements, Stockpoort and Platjan ports of entry can be used as alternatives by travellers and small vehicles as these are non-commercial ports.\n\nFor cargo movements, travellers and truck operators are advised to use Skilpadshek, Ramatlabama, Beitbridge and Kopfontein as alternative ports of entry.\n\nThe BMA said the alternative ports of entry are operating as follows: Stockpoort  06:00hrs-18:00hrs, Platjan  06:00hrs-18:00hrs, Skilpadshek  06:00hrs-00:00hrs, Kopfontein  06:00hrs00:00hrs and Ramatlabama  06:00hrs-22:00hrs, while Beitbridge is operating round the clock.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Screenshot-50-680x380.png",
            "description": "Thupeyo Muleya Beitbridge Bureau The volume of commercial and human traffic is expected to surge at the Beitbridge Border Post following the temporary closure of the South Africa-Botswana border due to high water levels at the port of entry. The Grobler’s Bridge Border handles transit traffic to inland SADC. Of late, Beitbridge has been handling […]",
            "time": "18:39",
            "date": "15 Jan 2025"
        },
        {
            "title": "Seventeen nabbed for taking pictures at accident scene",
            "url": "https://www.herald.co.zw/seventeen-nabbed-for-taking-pictures-at-accident-scene/",
            "content": "Arron Nyamayaro\n\nSeventeen people have been arrested for taking photographs with their smartphones at a road traffic accident scene in Harare.\n\nThis was after a commuter omnibus, whose driver was evading arrest, was involved in an accident with a truck at corner Robert Mugabe Road and Sam Nujoma Street in Harares central business district.\n\nPolice rounded up the self-styled journalists and confiscated their cellphones.\n\nSeveral people have been recording and posting pictures and videos of accident scenes on social media, thereby causing alarm and despondency among members of the public.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Screenshot-46-680x380.png",
            "description": "Arron Nyamayaro Seventeen people have been arrested for taking photographs with their smartphones at a road traffic accident scene in Harare. This was after a commuter omnibus, whose driver was evading arrest, was involved in an accident with a truck at corner Robert Mugabe Road and Sam Nujoma Street in Harare’s central business district. Police […]",
            "time": "18:39",
            "date": "15 Jan 2025"
        },
        {
            "title": "Several injured as kombi collides with refuse compactor",
            "url": "https://www.herald.co.zw/several-injured-as-kombi-collides-with-refuse-compactor/",
            "content": "Herald Correspondent\n\nSeveral people have been injured in a traffic accident that occurred at the busy intersection of Sam Nujoma Street and Robert Mugabe Road in Harare this morning (Wednesday).\n\nThe incident occurred when a commuter omnibus, attempting to overtake a City of Harare refuse compactor, failed to clear the manoeuvre and collided with the vehicle.\n\nEyewitnesses said the omnibus was speeding in an attempt to beat a red light when the collision occurred.\n\nThe impact caused the omnibus to swerve off the road, injuring multiple passengers onboard.\n\nThe refuse compactor sustained minor damages.\n\nWhen we arrived at the scene to help, the passengers were trapped in the kombi and we could not push the truck until we called for help and managed to release the passengers, said Ms Dorcas Siziba.\n\nAnother onlooker, Ms Betty Ngwerume said, We need to give way to each other when traffic lights are not working. Most traffic lights are not working but the drivers are not exercising caution.\n\nEmergency services arrived at the scene swiftly, provided first aid to the injured and transported them to Parirenyatwa Group of Hospitals.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Screenshot-45-680x380.png",
            "description": "Herald Correspondent Several people have been injured in a traffic accident that occurred at the busy intersection of Sam Nujoma Street and Robert Mugabe Road in Harare this morning (Wednesday).   The incident occurred when a commuter omnibus, attempting to overtake a City of Harare refuse compactor, failed to clear the manoeuvre and collided with […]",
            "time": "18:39",
            "date": "15 Jan 2025"
        },
        {
            "title": "More than 12 000 Palestinian students killed in Israeli genocide",
            "url": "https://www.herald.co.zw/more-than-12-000-palestinian-students-killed-in-israeli-genocide/",
            "content": "Tapiwa Chikuhwa\n\nHerald Correspondent\n\nMore than 12 000 students have been killed since the beginning of the Israeli genocide in the state of Palestine while more than 20 000 have been injured.\n\nIn a statement, the Embassy of the State of Palestine in Zimbabwe said most students now suffer from psychological trauma and difficult health conditions.\n\nA total of 12 329 students were killed while 20 160 were injured since the beginning of the Israeli aggression on the Gaza Strip and the West Bank in 2023, reads the statement.\n\nThe Embassy also said 657 teachers and administrators were killed and 3 904 injured in the Gaza Strip and West Bank, while more than 165 were detained in the West Bank.\n\nAbout 788 000 students in the Gaza Strip are still deprived of attending their schools and universities since the beginning of the aggression, while most students suffer from psychological trauma and difficult health conditions, reads the statement.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Screenshot-43-680x380.png",
            "description": "Tapiwa Chikuhwa Herald Correspondent More than 12 000 students have been killed since the beginning of the Israeli genocide in the state of Palestine while more than 20 000 have been injured. In a statement, the Embassy of the State of Palestine in Zimbabwe said most students now suffer from psychological trauma and difficult health […]",
            "time": "18:39",
            "date": "15 Jan 2025"
        }
    ]
}