{
    "news": [
        {
            "title": "Mischief makers put on noticel . . . Ignore calls to cause chaos, says President",
            "url": "https://www.herald.co.zw/mischief-makers-put-on-noticel-ignore-calls-to-cause-chaos-says-president/",
            "content": "Zvamaida Murwira and Joseph Madzimure\n\nZIMBABWEANS should continue to carry out their normal daily activities and ignore calls by some chameleon-like characters threatening to cause chaos in the country as that will be thwarted by State security personnel who will be deployed to protect property and the security of everyone, President Mnangagwa has said.\n\nHe described those calling for protests as retrogressive individuals who were pursuing delusional ambitions.\n\nPresident Mnangagwa, who is also Zanu PFs First Secretary, said this yesterday while addressing the 125th Central Committee meeting at the party headquarters in Harare.\n\nCentral Committee meetings are held every three months in line with the party constitution.\n\nTo be a leader in our revolutionary mass party Zanu PF, is never an entitlement or a right. We must remain anchored on the commitment to wholeheartedly serve the people of our great motherland, Zimbabwe. It is most unfortunate that a retrogressive trend has emerged, with some members of our party showing their chameleon-like characters as willing accessories to our detractors for the purpose of desecrating our rich revolutionary heritage. Pasi navo! said President Mnangagwa to wild applause.\n\nHe said 45 years after Zimbabwe attained independence by defeating the retrogressive spirit of individualism and the Rhodesian settler regime, it was a shame that a small clique of individuals was pursuing delusional ambitions and selfish interests.\n\nTheir actions are an affront to the partys principles and grossly taint our countrys image as well as the gains of our liberation struggle. These rogue opportunists will soon meet their fate. The party and our peace-loving nation are commended for bravely standing firm against such treasonous acts of indiscipline.\n\nPeople are called upon to go about their business as usual. Our State security infrastructure is in place to protect property and the safety of all Zimbabweans, from Plumtree to Mutare, Chirundu to Beitbridge said the President.\n\nHe congratulated the party for winning in local authority by-elections held in Mashonaland West Province and urged members to redouble their efforts in the forthcoming by-elections in Gutu East and Glen View South.\n\nGutu East constituency fell vacant after Zanu PF recalled the incumbent Benjamin Ganyiwa for indiscipline, while Glen View South constituency was declared vacant following the death of CCC legislator, Mr Gradmore Hakata.\n\nOur focus now shifts to winning Gutu East and Glen View South Constituency here in Harare Province, where the youthful Comrade Tsitsi Tawomhera is our candidate, said President Mnangagwa.\n\nHe commended Zimbabweans for taking it upon themselves to embark on nation-building activities.\n\nThrough increased production and productivity, the people of Zimbabwe, in every sector of the economy, are applauded for dismantling the spectator mentality. To date, it is pleasing that all Zimbabweans here at home and those abroad are all working hard, demonstrating resilience and focus towards the attainment of our vision to become an empowered and prosperous upper middle-income society. Congratulations Zimbabweans, said President Mnangagwa.\n\nHe said evidence was all around the country showing that the national development philosophy Nyika inovakwa, inotongwa, inonamatigwa nevene vayo/ilizwe lakhiwa, libuswe, likhu-le-kelwe ngabanikazi balo is taking root across communities and the citizenry as a whole.\n\nUnder the Agriculture and Food Security Pillar of our development strategy, we are poised to realise yet another bumper harvest, which was occasioned by the good rains received across the country. The country is on track with regard to accelerating the establishment of new irrigation schemes and the rehabilitation of existing projects. The Village Business Units, Presidential Borehole Drilling Scheme will have a profound impact on growing our countrys food security as well as household incomes.\n\nPresident Mnangagwa said these milestones were reflective of the concerted efforts by Government in implementing Zanu PF resolutions as directed by the partys annual conference.\n\nIn the mining sector, the commissioning of the Palm River, a US$3.6 billion investment project in Beitbridge, Matabeleland South Province and the expansion of other mining projects across the country, is a clear testimony of our conducive business operating environment. To achieve energy security and self-sufficiency, the construction of an array of projects by Independent Power Producers is on course. These are augmenting our green-energy integrated power generation initiatives, he said.\n\nThe President outlined several projects the Government is undertaking aimed at improving the livelihoods of people. They include the Presidential Youth Empowerment Facility, the War Veterans Fund and the Borehole Drilling Scheme.\n\nAs the Party, it is our expectationthat beneficiaries of these programmes take up productive, profitable and viable economic enterprises. This should not only bring about the transformation of livelihoods at the household level but have a positive ripple effect to the local economies, at the village and ward levels, he said.\n\nTurning to the partys Central Committee meeting, President Mnangagwa said the session will provide members with an opportunity to collectively reflect on the impact of the international and continental geopolitical dynamics.\n\nIt is critically important, therefore, that we stand ready to craft responsive strategies for the good of both our Party and the nation as a whole. The Central Committee being the principal decision-making body of our colossal revolutionary mass Party, is called upon to proffer the requisite recommendations and decisions to propel our peoples revolution, Party Vision as well as the national aspirations and goals, he said.\n\nWe are as the Central Committee vested with an array of functions and powers, including coordination of party activities across all organs. This meeting will accordingly receive comprehensive reports covering the intervening period. These include an outlook at the state of our party, economy and the progress on the various people-centred projects and programmes, which our Government is implementing throughout the country.\n\nPresident Mnangagwa invited all citizens to attend the 34th Independence Day celebrations to be held in Nembudziya, Gokwe North district in the Midlands province under the theme, Devolve and Develop Together towards Vision 2030.\n\nPresident Mnangagwa commended members for their ideological aptitude and national consciousness shown in executing the work of the party.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/President-Mnangagwa-9-680x380.jpg",
            "description": "Zvamaida Murwira and Joseph Madzimure ZIMBABWEANS should continue to carry out their normal daily activities and ignore calls by some “chameleon-like” characters threatening to cause chaos in the country as that will be thwarted by State security personnel who will be deployed to protect property and the security of everyone, President Mnangagwa has said. He […]",
            "time": "08:44",
            "date": "28 Mar 2025"
        },
        {
            "title": "Lt-Gen Sanyatwe welcomes new role",
            "url": "https://www.herald.co.zw/lt-gen-sanyatwe-welcomes-new-role/",
            "content": "Mukudzei Chingwere-Herald Reporter\n\nLIEUTENANT-General (Retired) Anselem Sanyatwe has saluted President Mnangagwa for appointing him Sports, Recreation, Arts and Culture Minister, describing his new assignment as a special recognition.\n\nThe President swore in Lt-Gen (Rtd) Sanyatwe at State House in Harare yesterday at a ceremony attended by Vice Presidents Dr Constantino Chiwenga and Cde Kembo Mohadi and senior Government officials.\n\nAllow me first to thank His Excellency, the President of the Republic of Zimbabwe and the Commander-in-Chief of the Zimbabwe Defence Forces for appointing me as Minister of Sports, Recreation, Arts and Culture. It is indeed a great honour, a special recognition from His Excellency. In fact, I am also humbled with the confidence and trust that the President has accorded me to lead this special ministry, said the former Zimbabwe National Army chief after being sworn in.\n\nTurning to his new mandate, Lt-Gen Sanyatwe (Rtd) said arts and culture were strong tools for national unity, youth empowerment as well as economic growth.\n\nThe President swore in Lt-Gen (Rtd) Sanyatwe at State House in Harare yesterday at a ceremony attended by Vice Presidents Dr Constantino Chiwenga and Cde Kembo Mohadi and senior Government officials.\n\nIt is with these that a nation is identified as our identity, our history as well as the aspirations of a nation. Given that background, it is my submission that I should by all means take on board all stakeholders as I embark on my new journey to lead this sector.\n\nMy mission therefore is to develop, to create as well as to promote all the aspects that go by our identity and where possible for it to be recognised locally and internationally.\n\nWe shall move together as a team as we move forward with a unity of purpose as I take up my new office as Minister, said Lt-Gen Sanyatwe (Rtd).\n\nTurning to his new mandate, Lt-Gen Sanyatwe (Rtd) said arts and culture were strong tools for national unity, youth empowerment as well as economic growth.\n\nHe succeeds International Olympic Committee (IOC) president-elect Dr Kirsty Coventry who was recently elected to the worlds most influential sports position.\n\nIn his new role, Lt-Gen Sanyatwe (Rtd) is expected to address challenges bedevilling the sporting sector like the lack of infrastructure to host international sports competitions.\n\nAs a result of a dearth of FIFA-certified stadia, national teams like the Zimbabwe senior nationalsoccer team have resorted to playing their matches in other countries, and the coming in of Lt-Gen Sanyatwe (Rtd) is expected to add impetus to the ongoing upgrading of local facilities.\n\nLt-Gen Sanyatwe (Rtd) is not the first military commander to be deployed to Government service by President Mnangagwa and his predecessors have inculcated a reputation of excellence in service of the country.\n\nHe is expected to bring military discipline to the civil service and other positive attributes such as time consciousness, dedication to duty, fulfilment of obligations, respect and selfless service.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Sanyatwe-sworn-in-680x380.jpg",
            "description": "Mukudzei Chingwere-Herald Reporter LIEUTENANT-General (Retired) Anselem Sanyatwe has saluted President Mnangagwa for appointing him Sports, Recreation, Arts and Culture Minister, describing his new assignment as a “special recognition”. The President swore in Lt-Gen (Rtd) Sanyatwe at State House in Harare yesterday at a ceremony attended by Vice Presidents Dr Constantino Chiwenga and Cde Kembo Mohadi […]",
            "time": "08:44",
            "date": "28 Mar 2025"
        },
        {
            "title": "Maj-Gen Matatu appointed ZNA Commander",
            "url": "https://www.herald.co.zw/maj-gen-matatu-appointed-zna-commander/",
            "content": "Remember Deketeke-Herald Reporter\n\nCommander-in-chief of the Zimbabwe Defence Forces, President Mnangagwa has promoted Major -General Emmanuel Matatu to the rank of Lieutenant-General and appointed him Commander of the Zimbabwe National Army with immediate effect.\n\nIn a statement last night, Chief Secretary to the President and Cabinet, Dr Martin Rushwaya, said: His Excellency the President of the Republic of Zimbabwe and Commander-in-Chief of the Zimbabwe Defence Forces, Cde Dr Emmerson Dambudzo Mnangagwa, acting in terms of Section 216 (2) as read with section 89 of the Constitution of Zimbabwe and sections 11(1)(a) and 11(4) of the Defence Act (Chapter 11:02), has appointed Major-General Emmanuel Matatu to the rank of Lieutenant-General and Commander of the Zimbabwe National Army with immediate effect.\n\nLt-Gen Matatu replaces Lt-Gen (Retired) Anselem Sanyatwe who was retired on Tuesday and appointed to the position of Minister of Sports, Recreation, Arts and Culture.\n\nLt-Gen Matatu was promoted to the rank of Major-General from Brigadier General in 2021.\n\nHe then moved from the Zimbabwe National Defence University to Army headquarters as Chief of Staff Administration Staff, a position he held until his latest appointment.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Maj-Gen-Matatu-680x380.jpg",
            "description": "Remember Deketeke-Herald Reporter Commander-in-chief of the Zimbabwe Defence Forces, President Mnangagwa has promoted Major -General Emmanuel Matatu to the rank of Lieutenant-General and appointed him Commander of the Zimbabwe National Army with immediate effect. In a statement last night, Chief Secretary to the President and Cabinet, Dr Martin Rushwaya, said: “His Excellency the President of […]",
            "time": "08:44",
            "date": "28 Mar 2025"
        },
        {
            "title": "Security services on high alert",
            "url": "https://www.herald.co.zw/security-services-on-high-alert/",
            "content": "Nyore Madzianike\n\nSECURITY Services are on high alert to ensure the safety and security of the public and everyone, including visitors to the country, should feel secure and continue engaging in their socio-economic activities, the Minister of Home Affairs and Cultural Heritage, Kazembe Kazembe, has said.\n\nAddressing a press conference on the security situation in the country in Harare yesterday, Minister Kazembe said the Zimbabwe Republic Police has made adequate deployments, enough to guarantee a conducive environment for people to conduct their routine socio-economic activities.\n\nHe indicated that the Government is aware of illegal threats that have been made by some rogue elements and warned those engaging in such activities.\n\nMinister Kazembe said the Government will not be deterred in fulfilling its constitutional obligation of safeguarding security in the country.\n\nThe Government of Zimbabwe notes with deep concern the mobilisation efforts, through social media postings, pseudo press statements and letters by criminally-inclined individuals and groups inciting peace loving Zimbabweans to engage in unlawful gatherings that interfere with public order, he said.\n\nThe illegal acts being mobilised undermine the prevailing security, peace and stability. The retrogressive intents should be dismissed with the contempt they deserve. Those fronting the mobilisation should stand warned. Their self-seeking, subversive and anti-development endeavours have been exposed.\n\nMinister Kazembe said Government has a constitutional mandate to safeguard the security and territorial integrity of the country and will fulfil that mandate.\n\nMay I take this opportunity, therefore, to assure the nation and all our visitors that the countrys security services are on high alert to ensure the sustained safety and security of the public.\n\nHe added that police have made adequate deployments to guarantee an environment conducive to socio-economic development and unhindered movement of people in all parts of the country.\n\nMinister Kazembe also reminded the public to abide by the law and regulations governing maintenance of public order.\n\nI need not emphasise that we are all expected to remain guided by the provisions of Section 164 of the Criminal Law (Codification and Reform) Act and Section 164 of the Cyber Security and Data Protection Act on offences relating to electronic communications and materials.\n\nThe relevant instruments will be invoked to deal with those who unlawfully engage in transmitting, broadcasting and distributing data messages to any person, group of persons or to the public with intent to incite acts of violence against any persons or to cause damage to any property, he said.\n\nMinister Kazembe warned those who intend to incite or force others to participate in illegal gatherings and criminal acts that they will face the full wrath of the law.\n\nMay I, once again, reiterate that anyone who tries to intimidate, threaten, harass or coerce the public to engage in criminal acts will certainly face the full wrath of law.\n\nThe Commissioner General of Police will apply the law to its fullest without fear or favour. In the same vein, I would like to encourage the peace-loving and patriotic citizenry to report anyone who incites violence and causes public despondency through the listed contact details: Harare Emergency Response Centre Toll Free 911 or 112, Harare Operations (0242) 748836 or 777651, Harare Central Police 777592/4/6/8, 777626 (0242), Bulawayo Emergency Response Centre Toll Free 112, 911, Bulawayo Operations (0292) 273547or 883930, National complaints desk (0242) 703631, Police General Headquarters WhatsApp 0712 800 197, he said.\n\nMinister Kazembe said the police will respond to such reports without delay.\n\nHe implored Zimbabweans to continue abiding by the law to effectively contribute towards the countrys attainment of an upper middle income economy status by 2030.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Minister-Kazembe-and-Comm-Gen-Mutamba-680x380.jpg",
            "description": "Nyore Madzianike SECURITY Services are on high alert to ensure the safety and security of the public and everyone, including visitors to the country, should feel secure and continue engaging in their socio-economic activities, the Minister of Home Affairs and Cultural Heritage, Kazembe Kazembe, has said. Addressing a press conference on the security situation in […]",
            "time": "08:44",
            "date": "28 Mar 2025"
        },
        {
            "title": "First Lady takes legal clinic, GBV awareness to Birchenough . . . holds interactive sessions with the community",
            "url": "https://www.herald.co.zw/first-lady-takes-legal-clinic-gbv-awareness-to-birchenough-holds-interactive-sessions-with-the-community/",
            "content": "Tendai Rupapa in BIRCHENOUGH\n\nAN electric atmosphere enveloped Birchenough in Manicaland Province yesterday where First Lady Dr Auxillia Mnangagwa arrived to a rousing welcome from thousands of people gathered for her legal clinic and gender-based violence awareness campaign as she unveiled programmes tailored to address the concerns of the whole family.\n\nThe Province took the opportunity to celebrate the First Ladys birthday with beneficiaries of her women empowerment projects showing their prowess in baking.\n\nThey presented birthday cakes to Amai Mnangagwa who humbly accepted the gesture before sharing the cakes with everyone present.\n\nIt was a touching and joyous moment when the gathering sang Happy Birthday, adding colour to the event.\n\nA surge in rape cases involving minors in Chipinge and numerous calls on other GBV-related cases being reported on her National Gender-Based Violence Call Centre 575, prompted Dr Mnangagwa to undertake the awareness programme to put an end to the menace, save lives and create harmony in communities.\n\nThe long distance from Harare that Amai Mnangagwa covered, is a testament to her love for the people countrywide, with distance not a barrier.\n\nA legal clinic is a programme often associated with legal aid organisations, that provides free legal services.\n\nIn this case, the Office of the First Lady is working with the Master of High Court and the Police Victim Friendly Unit to enable people, mainly widows and widowers, to be conversant with inheritance laws.\n\nYesterday, elderly women and men were given the platform to share what helped them remain in marriage for long, providing a learning curve for young couples.\n\nPerforming arts ensemble, IYASA enacted a play which depicted the challenges caused by domestic violence and another one highlighting the plight of widows.\n\nAddressing the gathering, the First Lady highlighted the need for women to be dignified and to always set good examples for their children.\n\nShe also hammered on the importance of creating good names for themselves.\n\nFirst Lady Dr Auxillia Mnangagwa is swarmed by thousands of people who wanted to greet her at an interactive session where she taught about Gender Based Violence and also conducted legal clinic in Chipinge yesterday.Pictures: John Manzongo.\n\nI am glad to be here where we are teaching and planning together as a family with the aim of moulding homes and sowing the seeds of harmony. I want to start by focusing on the woman at the homestead. If a family goes astray, the mother is to blame. If a child does not follow morally acceptable behaviour and etiquette, the mother is again to blame. If a child falls sick, the mother handles that challenge. I then ask whether you are the self-same woman I have come for today. I want to know how you are perceived in the community. How did you acquire the nicknames you have? Are they good or bad? Come and tell me where these names originated from?\n\nThe question elicited a lot of responses, some of which induced laughter.\n\nMrs Anita Sithole says; In our village, we have mai Madoro. She is a woman who spends time in the bar without time to prepare meals for her family.\n\nAnother contributor said Gumbomutsvairo is a woman who is found everywhere where there is gossip while Jachachacha is a carefree type of woman who never has time to plan while doing the rounds aimlessly in the community.\n\nMrs Ndakaziva Mutenda spoke about a woman who was labelled a lioness because of her hard work.\n\nIn our community, there is a widow who is strong and works for her family. We nicknamed her Lioness because even her husbands relatives who sought to dispossess her of her inheritance failed, she said, triggering laughter.\n\nYet another contributor spoke of a woman who was nicknamed Kandege because of her restlessness which made it difficult to perform her household chores.\n\nWhat of those who are promiscuous and ogle other peoples husbands? They must be given names also, the First Lady said in jest.\n\nShe added, Kana wakafirwa gara pamba pako ugutsikane woti Mwari murume hapachina chindipai simba rekushandira mhuri. Ukada zvekubuda uchatora zvirwere.\n\nA woman must stand in her rightful position and move on the correct path without nicknames which are a result of bad traits. God assigned us roles as women which are different from those of men. Yes, challenges will come along the way but I urge you to pray for your family because God will never give you a load that you cannot carry. I am also happy that men are here and have also learnt about GBV and inheritance. We want peace in our homes. We saw our Iyasa children presenting a play exposing the badness of domestic violence. We want peace in our homes. On inheritance, do not fear visiting the Master of the High Court for assistance because their offices are open for you. Do not be disinherited illegally.\n\nThe First Lady also spoke candidly against naughtiness in children, and drug and substance abuse among men, women and children.\n\nSome of the messages which were written on the cakes which were baked to celebrate First Lady Dr Auxillia Mnangagwas birthday by women beneficiaries of her empowerment projects in Chipinge yesterday.\n\nWhat of the naughtiness in children characterised by poor dressing, whose house are they coming from? If a girl child dresses badly, what image of you does that present? Some children copy this undignified dressing from their parents. As mothers, please stand in your rightful positions and be role models. Government placed us in our rightful position sanamai and brought Agric4she so that you use your hands, but some women are missing from such programmes because of gossiping and laziness. Drunkenness among men is contributing to domestic violence and a high rate of divorce cases. Let us shun alcohol and drug abuse and look after our families properly. In the olden days, divorce cases were non-existent because people followed the correct channels. Vana mbuya can you tell us how you lived in the olden days and why our grandfathers fell in love with you, she said. A granny who has been married for 70 years spoke of the importance of good manners.\n\nI have been married for over 70 years. My husband proposed to me because I was well-mannered. I was not naughty to the point of dating many men at the same time. I did not elope and we followed the proper channels of going through our aunties. This is far different from today where you propose to one another on social media today and sleep together tomorrow. They do not value virginity and these marriages do not last, she warned.\n\nAn elderly woman warned children against having an unsatiable appetite for money.\n\nThese children of nowadays have a huge appetite for money at the expense of love. Girls no longer look for love but a deep pocket. So what will you do when he goes broke? During our heydays, we never considered ones financial muscle. A girl was loved because of her cultural norms and values while for boys we looked at ones skills, she said.\n\nAnother woman shared the secret to a happy marriage.\n\nWe valued conjugal rights as well in our marriages in line with how we had been taught by our aunties and grandmothers. Nowadays marriages are collapsing over conjugal rights. A slight misunderstanding, couples sleep away from one another as the husband seeks a girlfriend while the wife looks for a boyfriend and this brings about diseases in the home, she said.\n\nAmai Mnangagwa urged young couples to listen and learn from the fortresses of knowledge.\n\nThe mother of the nation decried the rise in child sexual abuse cases in Chipinge district.\n\nShe inquired on some of the causes of the menace.\n\nWhat is it that is driving the rape of minor children? Through my 575 toll-free line, I am receiving many reports of children being raped here in Chipinge. A case in point is of a minor 8-year-old who was being raped by her brothers aged 27 and 14. Why is this so? Vabereki vanenge varipi zvakadai zvichiitika? she asked.\n\nA young man attributed this to drug abuse.\n\nA member of the Jekenisheni church skilfully beats the drum and dancing at a Gender Based Violence awareness campaign and legal clinic held by First Lady Dr Auxillia Mnangagwa in Chipinge yesterday.\n\nWhen someone is high, they will be worse than animals. Some people are taking concoctions to enhance their sexual appetite and they end up raping children as they seek someone closer and vulnerable, he said.\n\nYet another male contributor echoed similar sentiments saying most people who rape children do so for rituals and are made to think that abusing a minor enhances their luck.\n\nA female contributor expressed shock at the emergence of women who were also raping minors.\n\nAmai, even women are also raping young boys. You see someone who is 45 years old bedding a 13-year-old boy. What pleasure does one derive from a child? These women are luring the boys with money, she said.\n\nThe First Lady emphasised the need for parents to protect their children from all forms of abuse ensuring that they focus on their studies. She said the long arm of justice will catch up with the perpetrators.\n\nMrs Daisy Gazimbi from the Master of the High Courts Office gave the gathering a lecture on what her office stood for and the best way to prevent people from being disinherited in the event of the death of a loved one.\n\nWe are responsible for administering the distribution of the wealth you are working for. Once you lose a spouse, rush to our offices because your inheritance has to be distributed by the law. You do not pay anything when you come to inform us of the death.\n\nWe are, however, witnessing challenges especially when a husband dies. Widows are taking long to notify us within the stipulated 14 days. We asked why they delayed and they said the husbands relatives needed to be notified first so that they grant the go-ahead at their own will. But we are saying come and tell us first then we call the relatives as we follow the next steps. Some couples are also not registering their marriages even to traditional leaders and churches. You must see whether your husband whom you are living and working with has no other marriage because you may work for nothing and the goods will be taken by someone who did not work for them. Both men and women must feel free to visit our offices, she said.\n\nAssistant Inspector Gloria Mugodhi of Manicaland Police Victim Friendly Unit said Dr Mnangagwas 575 call centre had come in handy to her unit as it assisted a lot of people countrywide.\n\nHorseplay between a man and sisters-in-law is now a thing of the past. It is now actually criminal because to learners we say dont touch. Children under the age of 18 are not supposed to be bedded. No woman can be married off to someone she does not love because its a crime. We also have a law against cyberbullying and harassment, do not insult someone over the phone or show nude pictures because that too is a crime. We also abhor physical abuse and fighting. We must not destroy property because this is illegal. Psychological abuse like giving someone a nickname is a crime. Body shaming is a crime too. As the Victim Friendly Unit we work with the GBV call centre 575 which can be phoned without airtime so that we investigate the cases and assist one another. When raped, proceed to the hospital where we will collect our evidence and you will be helped to prevent sexually transmitted infections. If you get abused or someone close to you has been abused, tell someone whom you trust. You can tell nurses while learners can inform their teachers. Report rape cases within 72 hours. We also work on tip-offs. You can report such cases on 575 or you can write letters to the VFU, she said.\n\nLet us encourage one another to report because we must assist one another at all times,she said.\n\nPart of the crowds that interacted with First Lady Dr Auxillia Mnangagwa at a Gender Based Violence awareness campaign, legal clinic and birthday celebration in Chipinge yesterday.\n\nTafadzwa Mugabe of the 575 GBV Toll-free call centre praised Dr Mnangagwa for setting up the 575 National Gender-Based Violence Call Centre.\n\nThe main thrust of this initiative, she said, was to eradicate any forms of violence relating to gender and foster peace in the domestic set-up.\n\nSpeaking at the same occasion, Simbarashe Makina of the National Aids Council said women were three times more vulnerable to HIV than their male counterparts.\n\nWe also have programmes we introduced in a bid to curb GBV and child abuse. We work with the Ministry of Health and Child Care where we refer people for cancer screenings, for family planning services, and for treatment of other diseases.\n\nDeputy Minister of Primary and Secondary Education Hon Angeline Gata, who is also the legislator for Mutema-Musikavanhu Constituency praised the First Lady for her inclusive Programmes.\n\nThe First Lady tackles challenges that we encounter daily in life. She leaves no one and no place behind in her initiatives. Today she is here in Chipinge which is far from Harare which shows her love for the people, she said.\n\nCde Gata urged her fellow MPs to cascade Amais teachings in their constituencies.\n\nManicaland Provincial Affairs and Devolution Minister Advocate Misheck Mugadza expressed gratitude to the First Lady for always remembering his province in her well-thought-out programmes.\n\nYour Excellency, let me on behalf of the people of Manicaland Province, offer our collective appreciation for your presence at this event today. May I take this opportunity to acknowledge and salute you Amai for the invaluable and able leadership you continue to demonstrate in women empowerment and emancipation. Under your able leadership Amai, we have witnessed various life-changing projects which have brought tremendous benefit not only in Manicaland but in all the 10 provinces of Zimbabwe. On behalf of the province and indeed on my behalf, we are truly honoured to have you providing guidance and support to us whenever we need it. You are an all-encompassing icon leaving a lasting legacy of caring and ensuring the welfare of the vulnerable and making sure it takes centre stage. We thank you, he said.\n\nThe First Lady donated tonnes of rice and meal meal to the community.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/First-Lady1-1-680x380.jpg",
            "description": "Tendai Rupapa in BIRCHENOUGH AN electric atmosphere enveloped Birchenough in Manicaland Province yesterday where First Lady Dr Auxillia Mnangagwa arrived to a rousing welcome from thousands of people gathered for her legal clinic and gender-based violence awareness campaign as she unveiled programmes tailored to address the concerns of the whole family. The Province took the […]",
            "time": "08:44",
            "date": "28 Mar 2025"
        },
        {
            "title": "Minister hails Diaspora contribution",
            "url": "https://www.herald.co.zw/minister-hails-diaspora-contribution/",
            "content": "Farirai Machivenyika-Senior Reporter\n\nZIMBABWEs Diaspora has an important role to play in the development of the country and Government is engaging them to facilitate access to investment opportunities in the country, Foreign Affairs and International Trade Minister Professor Amon Murwira has said .\n\nThe Minister said this in an interactive meeting with the Portfolio Committee on Foreign Affairs and International Trade chaired by Chegutu East MP, Cde Webster Shamu on Wednesday.\n\nDiaspora is bringing at least US$2 billion to this country, and we are engaging them. Wherever the President goes, he makes sure he meets with the Diaspora so that people are positive about their country.\n\nNo matter where you go, no matter what, you are Zimbabwean, whether you change your citizenship, but you know very well that is just a paper, you are Zimbabwean.\n\nSo that is very important. So, our people are now remitting, in terms of remittances, I think last year we received over US$2 billion in remittances, and they are beginning to invest, and we are encouraging them using our Diaspora Division, to make sure that they feel at home, and it is part of our doctrine, our policy, to make our people feel at home, he said.\n\nProf Murwira said it was wrong to refer the migration of Zimbabweans to other countries as brain drain.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/08/Prof-Amon-Murwira.jpg",
            "description": "Farirai Machivenyika-Senior Reporter ZIMBABWE’s Diaspora has an important role to play in the development of the country and Government is engaging them to facilitate access to investment opportunities in the country, Foreign Affairs and International Trade Minister Professor Amon Murwira has said . The Minister said this in an interactive meeting with the Portfolio Committee […]",
            "time": "08:44",
            "date": "28 Mar 2025"
        },
        {
            "title": "Sadc regional parliament inches closer",
            "url": "https://www.herald.co.zw/sadc-regional-parliament-inches-closer/",
            "content": "Farirai Machivenyika-Senior Reporter\n\nBotswana President Duma Boko has signed the agreement amending the SADC Treaty to transform the SADC Parliamentary Forum into a regional parliament and enhance the harmonisation of laws within the region.\n\nPresident Boko signed the agreement on Wednesday at an event that was witnessed by Speaker of Parliament Advocate Jacob Mudenda, who is the chairman of the strategic lobbying team for the transformation of the SADC Parliamentary Forum (SADC PF) into a regional parliament.\n\nHe signed the agreement at a ceremony in Gaborone that was attended by several dignitaries including Dithapelo Keorapetse, Speaker of the National Assembly of Botswana, Thoko Didiza, Speaker of the National Assembly of South Africa, Moeti Mohwasa, Botswanas Minister for State President and SADCs Executive Secretary, Elias Magosi, among others.\n\nBotswana becomes the 14th member State to sign the agreement, leaving only Mauritius as the only country yet to do so.\n\nThank you all for attending this landmark signing ceremony. In my capacity as the chairman of the strategic lobbying team for the transformation of the SADC PF into a regional parliament, I can assert today that the process of transformation has made a huge leap forward by the signature from Botswana.\n\nThe signature represents a huge leap in many respects, but especially because Botswana is also the seat of the SADC Secretariat which is at the heart of all SADC operations. The signature by Botswana thus gives renewed confidence and impetus to the transformation agenda of the Forum, Advocate Mudenda said.\n\nHe added that Botswanas signature demonstrated that the transformation agenda rides on the pedestal of inclusivity and that no member of parliament and SADC country should be left out in the process.\n\nI am also pleased to mention that earlier this week, we received correspondence from the National Assembly of Madagascar to the effect that the President of the Republic of Madagascar, His Excellency, Andry Nirina Rajoelina, has also signed the agreement amending the SADC Treaty. With the signatures of Botswana and Madagascar, this leaves only Mauritius as the only country of the 15 SADC-PF Member countries which is yet to sign the Agreement, Advocate Mudenda said.\n\nThe Speaker also said more work still needed to be done to make the transformation agenda fully mature.\n\nAs you are aware, the protocol on the SADC Parliament is already in circulation and it needs to be both signed and ratified by two-thirds of SADC member States for transformation to actually take effect.\n\nThus, we encourage all countries, including Botswana, to examine the protocol and give comments to the SADC Secretariat so that a final version can be presented to the 45th SADC submit at its next sitting, he said.\n\nOnce the protocol is signed and ratified by two-thirds of the SADC member states, which would constitute 11 States, then the Protocol would be effective as from the date of its coming into operation.\n\nThe event underscored the collective commitment of SADC member states to enhance regional cooperation, legislative harmonisation and democratic governance. The Transformation of the SADC PF into a Regional Parliament is poised to strengthen multilateralism and promote sustainable development across the Southern African region.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/President-Duma-Boko-680x380.jpg",
            "description": "Farirai Machivenyika-Senior Reporter Botswana President Duma Boko has signed the agreement amending the SADC Treaty to transform the SADC Parliamentary Forum into a regional parliament and enhance the harmonisation of laws within the region. President Boko signed the agreement on Wednesday at an event that was witnessed by Speaker of Parliament Advocate Jacob Mudenda, who […]",
            "time": "08:44",
            "date": "28 Mar 2025"
        },
        {
            "title": "Zim, Russia strengthen media cooperation",
            "url": "https://www.herald.co.zw/zim-russia-strengthen-media-cooperation/",
            "content": "Herald Reporter\n\nThe Russian Federation has expressed its commitment to enhancing cooperation with Zimbabwe in the media sector.\n\nA delegation from Russian news agency Ruptly met with the Information, Publicity and Broadcasting Services Permanent Secretary, Mr Nick Mangwana, yesterday in Harare.\n\nMr Mangwana reaffirmed the long-standing relations between Zimbabwe and Russia, as discussions focused on strengthening cooperation in media services through joint projects.\n\nThere is no current penetration of Ruptly in Zimbabwe, but this exploratory visit will make sure that the situation changes. As a ministry, we support that very much. We want our media, both private and state media, to have alliances and partnerships across the globe, and also with those countries with whom ideologically we are aligned. We have an MOU with the Russian government where our media services are expected to cooperate, and this is part of the actualisation of the MoU, he said.\n\nDuring this visit, they will also meet the private media so that the Zimbabwean story will be told in foreign lands through a friendly voice, and the Russian story will be told in our jurisdiction through us as a friendly voice as well.\n\nSpeaking on the partnership, Ruptlys chief executive officer, Ms Anna Semidotskaya, highlighted the long-standing friendship between the two nations and the agencys role in fostering closer ties through media collaboration.\n\nRussia and Zimbabwe for a long time have been in a very close friendship. Ruptly, being a part of Russia Today family, we are the first Russian video news agency, we see our mission to support these high-level relations and take them to greater heights in the changing media landscape, she said.\n\nTodays meeting with the Ministry of Information, Publicity and Broadcasting Services of Zimbabwe and with the participation of Zimbabwean media was very fruitful and we explored new perspective for partnership. There were a lot of inspiring human stories in Zimbabwe which resonate deeply with the Russian audience. We are going to continue distributing such content in Russia and work together with Zimbabwean side on joint media projects and events.\n\nThe partnership provides a platform to showcase Brand Zimbabwe to the international community, aligning with the Second Republics engagement and re-engagement drive.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Mr-Nick-Mangwana-680x380.jpg",
            "description": "Herald Reporter The Russian Federation has expressed its commitment to enhancing cooperation with Zimbabwe in the media sector. A delegation from Russian news agency Ruptly met with the Information, Publicity and Broadcasting Services Permanent Secretary, Mr Nick Mangwana, yesterday in Harare. Mr Mangwana reaffirmed the long-standing relations between Zimbabwe and Russia, as discussions focused on […]",
            "time": "08:44",
            "date": "28 Mar 2025"
        },
        {
            "title": "Zim pushes for sustainable urban growth at UN-Habitat meeting",
            "url": "https://www.herald.co.zw/zim-pushes-for-sustainable-urban-growth-at-un-habitat-meeting/",
            "content": "Ivan Zhakata-Herald Correspondent\n\nZIMBABWE has called for increased global support for sustainable urban settlements saying there is urgent need to tackle informal housing challenges across Africa.\n\nThe call was made during the first Executive Board session of the United Nations Human Settlements Programme (UN-Habitat) for 2025, held this week in Nairobi, Kenya.\n\nLeading Zimbabwes delegation, Minister of National Housing and Social Amenities Zhemu Soda said financial backing was key to implementing solutions that can transform informal settlements.\n\nAfrica is urbanising at an unprecedented rate, yet millions of people continue to live in informal settlements without adequate housing, infrastructure, and essential services, he said.\n\nZimbabwe fully supports the resolutions proposed by the Africa Group, particularly on the transformation of informal settlements and slums.\n\nThe session, attended by global policymakers and UN representatives, opened with remarks from Dr Shuaibu Belgore, Permanent Secretary of Nigerias Ministry of Housing and Urban Development.\n\nHe welcomed delegates to what is expected to be a pivotal year for UN-Habitat, as key decisions will shape the organisations strategic direction.\n\nUN-Habitats executive director, Ms Anacludia Rossbach said she acknowledged that there were financial challenges limiting progress in sustainable urban development.\n\nWe must increase financial commitments to ensure effective programmes that address housing, climate resilience and urban recovery, she said.\n\nWithout stronger resource mobilisation, our ability to deliver impactful solutions remains constrained.\n\nZimbabwes commitment to sustainable urbanisation was further demonstrated by its National Human Settlements Policy, launched under President Mnangagwa.\n\nMinister Soda said the policy aligned with the African Unions Agenda 2063 and SADCs Regional Indicative Strategic Development Plan, both of which prioritise poverty reduction and inclusive urban growth.\n\nOur government remains steadfast in ensuring every citizen has access to adequate housing and social amenities, he said.\n\nWe call upon UN-Habitat to intensify efforts in mobilising resources to support equitable and sustainable human settlements.\n\nZimbabwes role in the UN-Habitat framework was further solidified as it was nominated by SADC to represent Southern Africa on the UN-Habitat Executive Board for the next four-year term, beginning in May at the resumed second session of the UN-Habitat Assembly.\n\nWith UN-Habitats mandate to promote socially and environmentally sustainable cities, Zimbabwes push for transformation could serve as a model for addressing the urbanisation challenges facing the continent.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Minister-Soda-680x380.jpg",
            "description": "Ivan Zhakata-Herald Correspondent ZIMBABWE has called for increased global support for sustainable urban settlements saying there is urgent need to tackle informal housing challenges across Africa. The call was made during the first Executive Board session of the United Nations Human Settlements Programme (UN-Habitat) for 2025, held this week in Nairobi, Kenya. Leading Zimbabwe’s delegation, […]",
            "time": "08:44",
            "date": "28 Mar 2025"
        },
        {
            "title": "Editorial Comment: Diaspora remittances  key to economic growth",
            "url": "https://www.herald.co.zw/editorial-comment-diaspora-remittances-key-to-economic-growth/",
            "content": "THE US$2,2 billion in Diaspora remittances last year, a figure likely to be exceeded this year, help ensure that a lot of families live a better life.\n\nThey also are critical for keeping the country on an even economic growth course and allowing imports to exceed exports while still having inflows of foreign currency exceeding outflows.\n\nWithout this money sent home, usually to relatives although there are some direct purchases such as property, Zimbabweans would find themselves tightly cramped when it came to imported goods and services.\n\nWe would either have to return to the days of total control of imports by the authorities with a permit for everything or reduce standards of living by pushing up the price of imported goods sharply through taxes or rationing or other measures to reduce demand, including those of petroleum fuels.\n\nDiaspora money is easily the largest segment of foreign currency in private hands in Zimbabwe and is what maintains the dual currency system we use in the local economy.\n\nWhile exports account for more than three times the level of foreign currency inflows as Diaspora funds, they do not feed much foreign currency into private hands.\n\nNet exporters pay half their taxes in foreign currency and can buy some goods and services in Zimbabwe using their retained foreign currency receipts, and most pay some or all of their salaries in foreign currency from those same receipts. But that is about it.\n\nExporters have to sell 30 percent of their foreign currency, these days to the Government rather than the Reserve Bank of Zimbabwe after reforms last year.\n\nFor anything more they need in local currency they have to sell some of their retained earnings to willing buyers via their commercial bank.\n\nThis does not see much foreign currency from this source directly entering the local retail economy and being held by private people.\n\nThe Government itself pumps some foreign currency free funds into private hands, some in payments to farmers and some in the foreign currency allowances that it pays to its own civil servants, most of this money coming from the taxes paid in foreign currency.\n\nThe compulsory purchases of the 30 percent of exporters inflows are not used for these payments. Such foreign currency either goes towards what the Government itself must import or pay when servicing debt, and at least half being moved into the banking system to provide the base load for the interbank market and so being bought by importers.\n\nEveryone else with foreign currency in their pocket is getting this money, perhaps through a string of intermediaries, either from what a civil servant spent or from someone who has Diaspora money, with most of that money in private pockets being originally Diaspora money.\n\nThe inflows of Diaspora money also help to explain why most petroleum fuels are sold for foreign currency and why service stations are just about the only retailer allowed to demand foreign currency, rather than let the customer choose the currency.\n\nSince we import more than export, and since petroleum fuels are the largest single import, having that large block of imports sold locally for foreign currency means that Diaspora money, directly and indirectly, pays for much of our petroleum fuel imports, so ensuring that at least a good slice of the Diaspora money is used constructively, to balance our trade.\n\nWhile petroleum fuels are in the trade statistics, most of these imports are not funded from export earnings, and that in turn means when we look at the actual inflows and outflows of trade cash, excluding petroleum, we are roughly in balance.\n\nThis is the result of some happy coincidences but it does mean that this slice of Diaspora money goes into the trading account without any directives from the authorities and without anyone actually tracking what happens to Diaspora funds after the recipients have picked up their cash.\n\nBut more could probably be done to encourage those receiving Diaspora money to be more productive in how they spend at least some of the money.\n\nOf course, an elderly couple receiving money from a qualified and caring child earning a good living outside the country will spend most of their money on groceries, electricity and other essentials. But others may have more options.\n\nA lot of cheap imported manufactured goods enter the country, and the steady inflow of second-hand cars is largely paid, again indirectly, from the Diaspora pool.\n\nHaving good-quality budget cars made in Zimbabwe, and the rise of the electric vehicle market, opens doors along with the fact that we are now making steel.\n\nThis would see some of that Diaspora cash ending up in the local manufacturing sector.\n\nConsidering the duties on imported second hand cars, far higher than imported new cars, pricing would not be a problem for the local budget car. It should be possible to produce a new car for the same price as an imported second hand car.\n\nRebuilding the textile and garment industries would see another slice building local companies, rather than just seeing it flow out to foreign factories.\n\nAgain, it would not involve protectionism, but would be the result of having efficient local producers able to price at least equal and often below the combined production and transport costs of the import, with the low customs duties for non-African products being just a bonus.\n\nThe first result of continuing our present trajectory of increasing exports year, coupled with building local industries that can compete with imports, would soon see service stations having to accept all currencies, which everyone except the owners want, and a growing pool of foreign currency available via the banks changing money that could then be used to accelerate growth by imports of things like machinery, rather than second-hand cars and cheap consumer goods.\n\nThis would mean that the Diaspora money sent home by our clever and hardworking citizens, and we need to remember that they only send home a modest fraction of what they earn, would have a double benefit, not just keeping their aged parents or other relatives in reasonable comfort, but also indirectly helping to supercharge the growth of their native land.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Diaspora-Remittances-680x380.jpg",
            "description": "THE US$2,2 billion in Diaspora remittances last year, a figure likely to be exceeded this year, help ensure that a lot of families live a better life. They also are critical for keeping the country on an even economic growth course and allowing imports to exceed exports while still having inflows of foreign currency exceeding […]",
            "time": "08:44",
            "date": "28 Mar 2025"
        }
    ]
}