{
    "news": [
        {
            "title": "Madzibaba Ishmael’s five accomplices have no case, court rules.",
            "url": "https://www.herald.co.zw/madzibaba-ishmaels-five-accomplices-have-no-case-court-rules/",
            "content": "Prosper Dembedza\n\nHerald Correspondent\n\nNorton provincial magistrate Christina Nyandoro has ruled that five of Johanne Masowe eChishanu leader Madzibaba Ishmael Chokurongerwas seven accomplices Takavengwa Gwenzi (55), Siribiniyo Chikunhire (53), Zebedia Sigudu (49), Aaron Chokurongerwa (47), and Shingirai Ngavafume (42) have no case to answer.\n\nShe however ruled that a prima facie case had been established against Chokurongerwa, Wonder Kabaya, and Devlodge Katsande.\n\nThe five were jointly charged together with Chokurongerwa, Kabaya, and Katsande on allegations of contravening sections of the Burial and Cremation Act and the Childrens Act.\n\nThe State, represented by District Public Prosecutor Tafara Chirambira and Ms Sheila Mupindu, brought forward testimony from 13 witnesses, detailing alleged neglect and a shocking disregard for legal and ethical procedures.\n\nThe court heard that Chokurongerwa, as the mastermind, led his followers to adhere to practices that included the concealment of births and deaths, ultimately resulting in the current charges of child ill-treatment, illegal burial, and failure to notify authorities.\n\nThe case has now been adjourned to January 17, 2025, when the defence is expected to present its case.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/03/Madzibaba-Ishmael.jpg",
            "description": "Prosper Dembedza Herald Correspondent Norton provincial magistrate Christina Nyandoro has ruled that five of Johanne Masowe eChishanu leader Madzibaba Ishmael Chokurongerwa’s seven accomplices Takavengwa Gwenzi (55), Siribiniyo Chikunhire (53), Zebedia Sigudu (49), Aaron Chokurongerwa (47), and Shingirai Ngavafume (42) have no case to answer. She however ruled that a prima facie case had been established […]",
            "time": "20:33",
            "date": "24 Dec 2024"
        },
        {
            "title": "Sewage crisis dampens festive mood for Chitungwiza residents",
            "url": "https://www.herald.co.zw/sewage-crisis-dampens-festive-mood-for-chitungwiza-residents/",
            "content": "By Daglous Masveta\n\nSome residents of St Marys Chitungwiza are facing the possibility of having a bleak Christmas due to a sewage problem that has persisted for months.\n\nFor over three months, residents of 63, 64, 65, and 66 Nehanda Close, St Marys, just a stones throw from St Marys Police Station, have been grappling with a perennial sewage problem that has turned their lives into a never-ending nightmare.\n\nThe situation is so dire that raw sewage is flowing into homes, with some houses experiencing sewage bursting from toilets, rendering them uninhabitable.\n\nDespite their desperate efforts to sweep away the ever-flowing sewage, residents have been unable to find relief.\n\nThe situation has started to adversely affect the residents with some falling the possibly of falling sick with diseases such as dysentery, cholera, and typhoid.\n\nOne of the affected residents Mr Tariro Bhasikoro said they are still waiting for authorities to act on the matter.\n\nIt is unbearable, we are tired of living in these conditions. We need help, and we need it now, he said.\n\nWe are now thinking of relocating to safer places because the local authorities are not responding swiftly to this emergency issue.\n\nSewage is flowing right inside our houses we cannot even enjoy Christmas celebrations with others as flies are always roaming around worst of it the smell of raw faecal matter.\n\nAnother resident, Tecla Bomba said the situation reminds her of the 2008 period when she was admitted at Chitungwiza Central Hospital due to cholera.\n\nWe do not want history to repeat itself here, cholera is a deadly disease, I was diagnosed with cholera in 2008 together with my children but we were lucky to survive due to urgent medical assistance that was rendered to us. Now the same area has been hit by this sewage crisis bringing back the trauma, she said.\n\nSpeaking in a telephone interview, Chitungwiza Council public relations officer Mr Tafadzwa Kachiko said they are looking into the matter.\n\nPlans are in a pipeline that we sort out sewage issues in Chitungwiza focusing on our 2025 proposed budget to the tune of US$5,1 million, he said.\n\nWe hope that by next year Chitungwiza will restore its smart town status. Our works department is working tirelessly to fix water issues and they need financial and mechanical support since the sewage issues are overwhelming, especially this rainy season.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/ec7cd215-ead8-489b-accc-6fe211339072-680x380.jpeg",
            "description": "By Daglous Masveta Some residents of St Mary’s Chitungwiza are facing the possibility of having a bleak Christmas due to a sewage problem that has persisted for months. For over three months, residents of 63, 64, 65, and 66 Nehanda Close, St Mary’s, just a stone’s throw from St Mary’s Police Station, have been grappling […]",
            "time": "20:33",
            "date": "24 Dec 2024"
        },
        {
            "title": "Banket Town Board delivers early Christmas presents to the elderly",
            "url": "https://www.herald.co.zw/banket-town-board-delivers-early-christmas-presents-to-the-elderly/",
            "content": "Walter Nyamukondiwa in BANKET\n\nBANKET Town Board put a smile on at least 100 elderly people, the disabled, and child-headed families in the farming town after handing out food hampers.\n\nThe hampers contained flour, cooking oil, rice, cordials, toothpaste, salt, tea, soap and washing powder among others.\n\nMrs Peggy Munjanja could not hide her joy saying the hamper would give her family a memorable festive season.\n\nThis is a special day for me and my family. We are going to have a memorable Christmas this year, said Mrs Munjanja.\n\nGuest of honour, Mashonaland West Provincial Affairs and Devolution Minister Marian Chombo hailed the Banket Local Board for the gesture.\n\nThis gesture helps to fulfill our Presidents vision of leaving no-one and no place behind during this period of festivities, said Minister Chombo.\n\nI am glad that we have the elderly here with us, child-headed families, and those living with disabilities who have adhered to eating habits, which the First Lady is championing.\n\nAnother beneficiary, Gogo Mary Urayayi said this was a pleasant surprise.\n\nGod blesses you in ways you least expect. I never thought someone would think of me in this way, she said.\n\nThe Town Board started giving food hampers to members of the community last year.\n\nZvimba South Member of Parliament Dexter Mangaliso said it was blessed to give and people ride on the spirit of giving to make a difference in other peoples lives.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/ebc8ef4f-fd74-42e6-8391-c94bf5554e81-680x380.jpeg",
            "description": "Walter Nyamukondiwa in BANKET BANKET Town Board put a smile on at least 100 elderly people, the disabled, and child-headed families in the farming town after handing out food hampers. The hampers contained flour, cooking oil, rice, cordials, toothpaste, salt, tea, soap and washing powder among others. Mrs Peggy Munjanja could not hide her joy […]",
            "time": "20:33",
            "date": "24 Dec 2024"
        },
        {
            "title": "ZRP, bus operators partner to reduce carnage",
            "url": "https://www.herald.co.zw/zrp-bus-operators-partner-to-reduce-carnage/",
            "content": "Freeman Razemba\n\nSenior Reporter\n\nThe Zimbabwe Republic Police has partnered with transport operators and various stakeholders to reduce road carnage during this festive season.Senior officers in Harare, this Tuesday conducted awareness campaigns at Mbare Musika bus terminus\n\nIn an interview, the Officer Commanding Harare Province Commissioner Maxwell Chikunguru said that they have deployed adequate police officers to ensure that law and order prevails.\n\nWe are here at Mbare Musika where most buses depart to several destinations to conduct awareness campaigns, he said.\n\nAs you are aware this is a Christmas holiday and today is December 24, 2024 there are a lot of people travelling to their rural homes.\n\nSo we saw it fit to come here as police to conduct such awareness campaigns to the drivers, the commuting public on issues that cause road traffic accidents on our roads.\n\nHe said what they have noted is that most of the people who travel during the holiday abuse alcohol and other illicit substances and they urging them to desist from such activities.\n\nComm Chikunguru said drivers should avoid speeding, overloading and drinking while driving as this might cause fatal road accidents.\n\nPassengers were also advised to report any bad driving or drivers driving under the influence of alcohol at any nearest police station, roadblock or a tollgate.\n\nPolice officers have been deployed everywhere, at roadblocks and even tollgates and we are saying passengers have got the right to make a report, Comm Chikunguru said.\n\nZimbabwe Passengers Transport Organisation chairman, Dr Samson Nhanhanga also said they had gathered not just as individuals, but as a united community, driven by a common purpose to ensure the safety of all who travel on the roads.\n\nEvery day, countless lives are affected by road traffic incidents- families are torn apart, dreams are shattered, and futures are altered forever. In Zimbabwe, as in many parts of the world, road traffic injuries are among the leading causes of death, particularly among our youth. This is not merely a statistic; these are our brothers, sisters, mothers, fathers, and friends, he said.\n\nEach loss is a tragedy that reverberates through our communities. This campaign is not just the responsibility of a few; it is a collective effort that necessitates the involvement of every individual, community, organization, and government agency.\n\nTogether, we can create a safer environment for all road users- pedestrians, cyclists, motorists, and passengers alike. We must cultivate an ethos of responsibility and respect on our roads. Each one of us has a role to play.\n\nDr Nhanhanga said whether it is driving within speed limits, obeying traffic signs, drivers should avoid driving under the influence of alcohol or substances.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2015/02/Zimbabwe-Republic-Police-badge.jpg",
            "description": "Freeman Razemba Senior Reporter The Zimbabwe Republic Police has partnered with transport operators and various stakeholders to reduce road carnage during this festive season. Senior officers in Harare, this Tuesday conducted awareness campaigns at Mbare Musika bus terminus In an interview, the Officer Commanding Harare Province Commissioner Maxwell Chikunguru said that they have deployed adequate […]",
            "time": "20:33",
            "date": "24 Dec 2024"
        },
        {
            "title": "Macheso set to entertain fans in Chinhoyi",
            "url": "https://www.herald.co.zw/macheso-set-to-entertain-fans-in-chinhoyi/",
            "content": "Conrad Mupesa Mashonaland West Bureau\n\nSUNGURA legend, Alick Macheso is tonight expected to ignite Chinhoyi at the Christmas Eve musical gig set for CSC joint.\n\nThe Sungura maestro has previously managed to draw fans from as far as Mhangura, Mutorashanga and Makonde among other surrounding service centres.\n\nAlready, the town is abuzz with anticipation for his show.\n\nThis is going to be the best Christmas Eve we have experienced, said Taurai Chinyonga from Mhangura town located 70 kilometers northwest of Chinhoyi.\n\nHe is part of many that have already thronged the town for the musical gig. Hoteliers have also confirmed that the show has brought them business.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/11/Untitled-303.jpg",
            "description": "Conrad Mupesa Mashonaland West Bureau SUNGURA legend, Alick Macheso is tonight expected to ignite Chinhoyi at the Christmas Eve musical gig set for CSC joint. The Sungura maestro has previously managed to draw fans from as far as Mhangura, Mutorashanga and Makonde among other surrounding service centres. Already, the town is abuzz with anticipation for […]",
            "time": "20:33",
            "date": "24 Dec 2024"
        },
        {
            "title": "Early Christmas treat for disabled children",
            "url": "https://www.herald.co.zw/early-christmas-treat-for-disabled-children/",
            "content": "Talent Chimutambgi\n\nHerald Reporter\n\nThe 21st China Medical Team recently gave disabled children under the Zimbabwe Parents of Children with Disabilities an early Christmas treat after organising a party in Harare and also handed out food hampers.\n\nThe team, which is led by Dr Tan Jianlong, from Hunan province of also offered free medical services.\n\nThe free medical services were extended to the parents of the targeted children resulting in more two hundred people with varying ailments benefiting.\n\nDr Jianlong, who is also the Captain of China Medical Team which is currently based at Parirenyatwa Group Hospitals, said the initiative was part of their humanitarian efforts based on the growing cordial relations between Zimbabwe and China.\n\nWe are here today as the 21st China Medical Team because of the cooperation between China and the Government of Zimbabwe, he said.\n\nWe are a collaboration between us as health experts and Hunan Province Business Team, and we have come here to help the people. We are conducting outreach programmes throughout the country. We are also providing the latest clinical skills to the local people.\n\nSpeaking at the same occasion, 21st China Medical Team vice-captain Dr Hu Sha who is also the Zimbabwe-China Traditional Chinese Medical Centre director said the initiative was part of their corporate social responsibility.\n\nDr Sha who gave herself the Shona name Chipo said she was promoting Chinese traditional medicines to which many people were responding positively.\n\nWe established this initiative at Parirenyatwa in 2020 to promote Chinese traditional medicines, I am so happy that a lot of people are now aware of the medicines, she said.\n\nWe attend to at least sixty patients per day. We are also here to assist people with ailments that need traditional medicines and also to introduce them to these traditional medicines.\n\nZimbabwe Parents of Children with Disabilities director and coordinator Mrs Theresa Makwara applauded the team for the gesture saying the initiative would help the children to experience a refreshed environment during the festive season.\n\nI would like to express my sincere gratitude to our good friends from Hunan Province of China. This is now the second time they have remembered us, she said.\n\nThey realised that our children are underprivileged and they are always indoors because of their situations. We are very happy today that they have made them to come out in their numbers to gather here and enjoy themselves during this festive season, said Mrs Theresa.\n\nSometimes our children have other conditions which require medical attention, and the parent doesnt have money for medical bills, we are happy about the gesture.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Screenshot-32.png",
            "description": "Talent Chimutambgi Herald Reporter The 21st China Medical Team recently gave disabled children under the Zimbabwe Parents of Children with Disabilities an early Christmas treat after organising a party in Harare and also handed out food hampers. The team, which is led by Dr Tan Jianlong, from Hunan province of also offered free medical services. […]",
            "time": "20:33",
            "date": "24 Dec 2024"
        },
        {
            "title": "Activity heightens at border as SA-based Zimbabweans return home",
            "url": "https://www.herald.co.zw/activity-heightens-at-border-as-sa-based-zimbabweans-return-home/",
            "content": "Thupeyo Muleya\n\nBeitbridge Bureau\n\nActivity has heightened at Beitbridge Border Post with many Zimbabweans based in South Africa are making a last-minute rush to get home for the festive season.\n\nAlready border authorities from Zimbabwe and South Africa have deployed more manpower to clear peak traffic between December 10 and January 10 next year.\n\nLong and slow-moving moving queues of both vehicles and people have become the order of the day at both components of the border.\n\nA senior Zimbabwean customs official who preferred anonymity said they had deployed more workers at the bus and private vehicles terminal to help with the clearance of motorists who need assistance with the electronic temporary import permits (ETIP).\n\nStatistics from the Department of Immigration show that from December 16 to December 21, a total of 85 846 people arrived in the country through Beitbridge while 34 094 left the country during the same period.\n\nIn addition, 75 096 were returning residents and these represented 87 percent of the people who used the border in the last seven days.\n\nRegarding vehicle traffic, a total of 3 087 light vehicles, 2 403 buses and 3 525 trucks entered the border from the South African side of the border.\n\nThe assistant regional immigration officer-in-charge of Beitbridge, Mrs Canisia Magaya said they had noted a surge in traffic through the border and that they had deployed enough manpower.\n\nWe are handling an average of 13 976 entries and 6 362 departures daily, she said.\n\nShe added that they had deployed more personnel to all three terminals and tight security was on the ground to enforce compliance and ensure the safety of travelers as they pass through the border.\n\nAlthough there is a surge in traffic through the border now, statistics show a 16 percent decline in the number of the people who arrived in the country and a 4 percent drop in the number of people who left the country this year compared to the previous year, she said.\n\nBetween December 11 and December 22 this year we cleared a total of 153 744 entries against 160 632 we handled in 2023. In addition, we processed 69 992 departures versus 81 235 processed last year during the same period.\n\nShe advised travelers to avoid the use of third parties to clear with the department of immigration since in most cases these turn out to be conmen.\n\nMrs Magaya said those travelling with children must ensure they have valid passports and the necessary supporting documents.\n\nThe Permanent Secretary in the Ministry of Tourism and Hospital, Dr Takaruza Munyanyiwa is already on the ground leading a team to ensure there is a seamless flow of traffic at the border.\n\nWe are here on the ground and happy with the feedback we are getting from travelers coming through Beitbridge Border Post, said Dr Munyanyiwa.\n\nWhat we have noted from most travelers is that there is a need to harmonise payment processes to cut the time they spend in queues paying levies and other compliance fees.\n\nGenerally they are happy with the permanent separation of traffic into cargo, buses, and light motor vehicles.\n\nIn separate interviews, most travelers said they were happy with the ambiance, signage, and separation of traffic at the border.\n\nI was served well this time around compared to the last three years. I am happy about the introduction of the eTIP system which is a good step by the Government embracing e-governance, said a motorist who preferred anonymity.\n\nA cross-border transporter identified as Ncube said the separation of traffic was a game changer that has helped reduce the turnaround time at the border.\n\nIn previous years, all the traffic would be processed from one building which saw travelers spending a minimum of 24 hours to pass through the border.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2020/12/beitbridge-border__zoom.jpg",
            "description": "Thupeyo Muleya Beitbridge Bureau Activity has heightened at Beitbridge Border Post with many Zimbabweans based in South Africa are making a last-minute rush to get home for the festive season. Already border authorities from Zimbabwe and South Africa have deployed more manpower to clear peak traffic between December 10 and January 10 next year. Long […]",
            "time": "20:33",
            "date": "24 Dec 2024"
        },
        {
            "title": "Zim to introduce parole",
            "url": "https://www.herald.co.zw/zim-to-introduce-parole/",
            "content": "Nqobile Bhebhe, Bulawayo Bureau\n\nThe Government is undertaking a comprehensive review of existing policies and regulations to facilitate the effective implementation of the parole system and establish community correctional centres.\n\nThe Ministry of Justice, Legal and Parliamentary Affairs, in partnership with the Zimbabwe Prisons and Correctional Service (ZPCS), are working to implement the system that is outlined in the new Prisons and Correctional Service Act.\n\nPresident Mnangagwa recently reassured the ZPCS of continued Government support to enable the organisation to fulfil its constitutional mandate while officiating at a pass-out parade of correctional officers at Ntabazinduna Training School.\n\nThe parole system initiative underscores Zimbabwes commitment to transforming its prison system from one of punishment to one focused on rehabilitation and reintegration.\n\nParole is the conditional release of prisoners before they complete their sentences. The new Act has provision for the establishment of the State Parole Board and sets conditions for early release from prison.\n\nThe system needs ways of measuring how each prisoner considered for parole would have met the required conditions.\n\nAn inmate can be released through a decision made by the President, the State Parole Board, the Commissioner General of Prisons, or the Minister responsible for Prisons and Correctional Services.\n\nThe State Parole Board is authorised to release inmates on day parole.\n\nSome of the considerations for granting parole include whether an inmate has displayed meritorious conduct, self-discipline, responsibility and was industrious while in prison.\n\nPersons to be released early must not present undue risk to society when on parole, and their release must contribute to the rehabilitation and reintegration of the inmates into society as law-abiding citizens.\n\nIn his address at the combined 154th and 155th recruit correctional officers courses pass-out parade held at ZPCS Ntabazinduna Training School recently, Justice Minister Ziyambi Ziyambi said that in liaison with ZPCS, the ministry is reviewing policies and regulations in line with the provisions of the new Act.\n\nThis will positively see the effective implementation of the parole system and establishment of community correctional centres, among other aspects. These programmes are crucial in advancing the reintegration process and also assisting in reducing overcrowding in correctional facilities, he said.\n\nMinister Ziyambi added that ZPCS is leaving nothing to chance to address challenges faced by inmates and ex-inmates in their passage to reintegration into society.\n\nHe said ZPCS has initiated a bid to facilitate the establishment of a foundation aimed at addressing these challenges.\n\nThrough stakeholder involvement, the foundation will provide support programmes and mobilise resources necessary for the successful implementation of reintegration initiatives. As a Ministry, we are fully behind this ingenuity and will ensure that the vision becomes a reality.\n\nHe noted that it was also vital to make concerted efforts and continue fostering regional collaboration among neighbouring correctional services to holistically enhance successful reintegration.\n\nI, therefore, urge all correctional services in Africa to fully use the African Correctional Services Association in order to propel exchange programmes for mutual benefit towards successful reintegration. It is our belief that African problems should be solved by African solutions.\n\nSpeaking at the same ceremony, ZPCS Commissioner-General Moses Chihobvu said the enactment of the new Act had empowered ZPCS to bolster its efforts in the rehabilitation and reintegration of inmates.\n\nBy focusing on rehabilitation over punishment, the new legislation aims to strengthen the furnishing of former inmates with the requisite skills and support for successful re-entry to society after serving their sentences, he said.\n\nReintegration is crucial not only for the personal growth of released inmates but also for enhancing public safety and reducing recidivism rates. When ex-offenders are provided with access to education, employment opportunities, and social services, they are more likely to become contributing members of society.\n\nHe noted that the holistic approach fosters a sense of belonging and encourages positive citizenship, ultimately strengthening the fabric of the nation.\n\nHe said through effective reintegration efforts, ZPCS sought to transform lives and promote a more inclusive and resilient society.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/President-Mnangagwa-3.jpg",
            "description": "Nqobile Bhebhe, Bulawayo Bureau The Government is undertaking a comprehensive review of existing policies and regulations to facilitate the effective implementation of the parole system and establish community correctional centres. The Ministry of Justice, Legal and Parliamentary Affairs, in partnership with the Zimbabwe Prisons and Correctional Service (ZPCS), are working to implement the system that […]",
            "time": "20:33",
            "date": "24 Dec 2024"
        },
        {
            "title": "Christmas fever grips Harare",
            "url": "https://www.herald.co.zw/christmas-fever-grips-harare/",
            "content": "Trust Freddy and Obey Musiwa\n\nHarare was busy yesterday, as shoppers flocked to shops for last-minute Christmas shopping, while hundreds of travellers headed to rural areas to reunite with loved ones.\n\nThe city centre was flooded with people rushing to buy last-minute Christmas goodies, clothes, and get stylish haircuts, with salons and beauty parlours also bustling with activity as everyone sought to look their best for the holiday.\n\nThere were long queues at banks with people trying to withdraw banknotes from ATMs to spend where cards or transfers were impossible to use or not accepted.\n\nMoney transfer agents such as Paisa, Mukuru, Homelink and Western Union were also overrun with long queues as people collected remittances from the diaspora.\n\nStreets in the central business district were heavily congested with vendors who had set up their wares on the pavements, making it difficult for pedestrians to walk.\n\nThe crowded conditions created an opportunity for pickpockets to strike, and the odd pedestrian could be heard screaming in distress after discovering that their cellphones or wallets had been stolen.\n\nMost businesspeople who spoke to The Herald reported that they were running low on stock, as large numbers of customers flooded their shops.\n\nMs Chenai Wimbo, who supplies womens hair products, expressed happiness with the high number of customers.\n\nDuring the first week of December, it was slightly quiet, but in the second week of December things became hectic.\n\nYou would think that people only woke up on Wednesday and then remembered that its now Christmas, they just started to come in numbers.\n\nA shop worker, who preferred to be called Tariro and works at the corner of Sir Seretse Khama Street and Augustinho Neto Avenue said she was exhausted.\n\nThis is not my shop, but my boss is making money, she said.\n\nSince last week, I havent cashed anything below US$1 000 daily, and I guess its because we are selling kids clothes, which parents prioritise for Christmas.\n\nMeanwhile, a normally 15-minute drive from Herald House to Mbare bus terminus turned into a gruelling hour-long ordeal as all roads leading to the terminus were clogged with vehicles jostling to drop off passengers bound for rural areas.\n\nThe roads were congested with cars, taxis, and buses, all trying to navigate through the chaos, as travellers scrambled to catch long-distance buses.\n\nAt the bus rank, there was pandemonium as touts jostled for customers.\n\nSome bus operators had increased fares, with Buhera routes now costing US$15, up from the usual US$10.\n\nMasvingo fares had also risen, from US$10 to US$15, while Ngundu fares had jumped to US$20, from US$15.\n\nAs Christmas Day approaches, fares are expected to continue rising as crews take advantage of the festive season, before returning to their normal fares thereafter.\n\nA Chiredzi-bound passenger, Ms Sarudzai Chaipa, said she had missed a bus that goes directly to Chiredzi.\n\nI am waiting for a bus that can take me directly to Chiredzi, but the ones that are available will take me via Ngundu. Just going to Ngundu costs US$20, and I might end up paying US$30, so I hope to find a direct one, she said.\n\nBut on other routes, bus operators mantained the same fares. If you look, Chinhoyi and Bulawayo routes are still the same , I hope they will not increase tomorrow (today), Mr Tinashe Gwekwe said.\n\nA bus driver plying the Harare-Karoi route, said: Usually during this festive season we increase fares because people will be carrying a lot of luggage and the heavy weight translates to huge fuel consumption.\n\nPushcart operators were also making money, as they were the most preferred option for carrying peoples goods, being capable of navigating the congested roads with ease.\n\nI am targeting US$100 a day, and I am praying that this congestion will persist, so that people will be dropped far from the bus stop, allowing us to charge them handsomely, a pushcart operator who identified himself as Tindo said.\n\nSimilarly, at the Simon Muzenda Street bus terminus, some operators had marginally increased their fares with pirate taxis the worst.\n\nTouts could be heard mocking passengers bound for Shamva, who were waiting for buses that cost US$3.\n\nYou are hesitant to board this kombi, were going to increase the fare to US$8 from US$5 at 6pm , a tout said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Mbare.jpg",
            "description": "Trust Freddy and Obey Musiwa Harare was busy yesterday, as shoppers flocked to shops for last-minute Christmas shopping, while hundreds of travellers headed to rural areas to reunite with loved ones. The city centre was flooded with people rushing to buy last-minute Christmas goodies, clothes, and get stylish haircuts, with salons and beauty parlours also […]",
            "time": "20:33",
            "date": "24 Dec 2024"
        },
        {
            "title": "Economic stability boost for industry",
            "url": "https://www.herald.co.zw/economic-stability-boost-for-industry/",
            "content": "Farirai Machivenyika and Ivan Zhakata\n\nCaptains of industry and other stakeholders must take advantage of the economic stability brought by the Second Republics policies to grow their operations and accelerate economic growth in the coming new year, Industry and Commerce Minister Mangaliso Ndlovu said in his Christmas message.\n\nHe said consumers should buy products made in Zimbabwe to boost the operations of local companies and consequently create more jobs.\n\nIn his statement, Minister Ndlovu saluted businesses, development partners, the private sector, ministry development agencies and consumers for their contributions to economic growth this year.\n\nThe new year presents an opportunity to address challenges in industrial growth while optimising on the strong macro-economic stability we have experienced in the last few months to drive industrial growth going forward, he said.\n\nI equally encourage your support for the inter-ministerial taskforce on business malpractice in combating counterfeiting and smuggling which enables us to give sanity to our business environment while enhancing consumer protection.\n\nAs you celebrate this festive season, please support local initiatives through the Buy Zimbabwe and local content strategy, Minister Ndlovu implored the nation.\n\nHis statement comes as Grain Millers Association of Zimbabwe national chairman Mr Tafadzwa Musarara yesterday said the milling industry had supplied all essential grain-based products to the market for the festive season and that there will be no shortages.\n\nMr Musarara said despite 2024 being a challenging year marked by drought and grain imports, the milling sector rose to the occasion and delivered products that exceeded demand by 38,9 percent. The stock levels meant that prices would be stable as they could only be pushed up by profiteering retailers when there were shortages.\n\nWith all maize in stock reserved for Government food schemes, millers had to import their entire supply except for what they had contracted with the farmers.\n\nSome of the products that have been supplied to the market were maize meal,rice, flour, salt and other essentials.\n\nThe surplus supply has stabilised prices, making these commodities accessible to all, in both formal and informal retail outlets, he said.\n\nMoving forward, we remain committed to supporting local agriculture through contract farming and exploring additional source markets to maintain affordability.\n\nMr Musarara thanked the Government for its private sector-led approach to achieving national food security.\n\nThe Governments policies align with international best practices and have enabled us to adapt effectively to these challenges, he said.\n\nThe Government has implemented a number of measures to stabilise the economy including strengthening the foreign exchange market that has seen the stability of the local currency, the ZiG, against the US dollar and other currencies, even on the parallel market.\n\nA crackdown against smuggling through the countrys borders has also been launched, amid startling revelations the country may be losing an estimated US$1 billion annually in revenue through smuggling.\n\nThrough partnerships with private investors, a number of electricity generating projects, especially in the coal sector, have been initiated and are expected to ease power shortages the country has been experiencing this year by the end of next year. This will enable Zesa to release more electricity to the manufacturing sector.\n\nMinister Ndlovu said they are focusing on strengthening collaboration with the private sector and invited all stakeholders to engage actively with the Ministry.\n\nThe Zimbabwe Industrial Reconstruction and Growth Plan 2024-2025 had been launched to promote industrial development as the country strives to be an upper-middle income society by 2030.\n\nThe plan seeks to address challenges hindering the growth of the manufacturing and commercial sectors, including issues such as competitiveness, the cost of doing business, promotion of links with small and medium enterprises, innovation and research.\n\nThe Ministry was allocated ZiG509 million for the implementation of the plan in the 2025 National Budget.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/07/Untitled-91-1.jpg",
            "description": "Farirai Machivenyika and Ivan Zhakata Captains of industry and other stakeholders must take advantage of the economic stability brought by the Second Republic’s policies to grow their operations and accelerate economic growth in the coming new year, Industry and Commerce Minister Mangaliso Ndlovu said in his Christmas message. He said consumers should buy products made […]",
            "time": "20:33",
            "date": "24 Dec 2024"
        }
    ]
}