{
    "news": [
        {
            "title": "Junior Sables beat Outback Barbarians",
            "url": "https://www.herald.co.zw/junior-sables-beat-outback-barbarians/",
            "content": "Brandon Moyo\n\nZIMBABWE national mens Under-20 rugby team, the Junior Sables staged a remarkable second half come-back to register a six points win over Outback Barbarians at Hartsfield Rugby Grounds.\n\nThe Junior Sables were trailing 20-21 at halftime but managed to stick to their guns to register a 39-33 win courtesy of a last minute Tafara Dewa try which was successfully converted by Tinotenda Rusike.\n\nWayne Kunaka scored the first try for the Junior Sables in the ninth minute with co-vice-captain Rusike converting to make it 7-0.\n\nThe big Australians, playing a physical and aggressive game, responded two minutes later with a converted try.\n\nMoments later, Tinotenda Rusike nearly made a grave mistake before Shammah Jackson came in to the rescue with a kick.\n\nQuick hands from the Junior Sables saw PK Manyakara beat the Outback Barbarians defense to restore Zimbabwes lead in the 22nd minute. Rusike, however, missed the conversion in front of the posts.\n\nIn the 29th minute, Kunaka played the ball on the ground for a penalty. The visitors opted to tap and managed to score a try which was successfully converted under the posts to take a two-point lead.\n\nRusike comfortably converted a Junior Sables penalty to reclaim their lead.\n\nThe lead was short lived as poor decision making from the hosts cost them. The Outback Barbarians scored their third try and successfully converted.\n\nTwo minutes before half time, the Outback Barbarians flyhalf missed a penalty after they had decided to go for posts.\n\nA minute later, Shammah Jackson made a brilliant interception and run to score the Junior Sables third try. However Rusike missed the conversion with the last kick of the first half.\n\nThe Barbarians scored their fourth try in the 55th minute which was successfully converted once again to make it 20-28.\n\nImpact player, Ethan Chiponda scored a brilliant try from a drop kick in the 60th minute whose conversion, was however, missed by Phillip Chimhaka.\n\nThe miss, which would have leveled the score left Zimbabwe trailing 25-28.\n\nFive minutes later, Chimhaka went on to score a brilliantly worked out try which Tatenda Kambvumbi successfully converted to make it 32-28 in favour of the Junior Sables.\n\nIn the 69th minute, Outback Barbarians scored another try but missed the conversion to make it 32-33.\n\nIn 77th minute, Zimbabwe missed a penalty, but a minute later Tafara Dewa scored a try that sealed the game for the hosts. It was successfully converted by Rusike to make it 39-33.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/f1edd67b-8768-4851-84d9-6a8c533e9ea6-680x380.jpg",
            "description": "ZIMBABWE national men’s Under-20 rugby team, the Junior Sables staged a remarkable second half come-back to register a six points win over Outback Barbarians at Hartsfield Rugby Grounds.",
            "time": "21:07",
            "date": "19 Mar 2025"
        },
        {
            "title": "Chirumanzu man jailed for raping minor daughters",
            "url": "https://www.herald.co.zw/chirumanzu-man-jailed-for-raping-minor-daughters/",
            "content": "Anesu January\n\nHerald Correspondent\n\nA 67-year-old Chirumanzu man has been sentenced to 20 years in prison for raping his two minor daughters.\n\nThe man appeared before the Gweru Magistrates Court.\n\nHe was convicted of raping his daughters aged five and eleven on various occasions in 2024.\n\nThe court heard that the man threatened to harm the minors if they reported the abuse to anyone.\n\nThe matter came to light after the girls mother noticed strange behaviour in her daughters.\n\nA police report was made, leading to the mans arrest.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/11/Jailed.jpg",
            "description": "A 67-year-old Chirumanzu man has been sentenced to 20 years in prison for raping his two minor daughters.",
            "time": "21:07",
            "date": "19 Mar 2025"
        },
        {
            "title": "SADC gears to tackle trade barriers",
            "url": "https://www.herald.co.zw/sadc-gears-to-tackle-trade-barriers/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nThe Southern African Development Community (SADC) will next week convene a crucial five-day meeting in Victoria Falls aimed at eliminating trade barriers and strengthening regional economic cooperation.\n\nThe 40th SADC Technical Barriers to Trade (TBT) Cooperation Structures meetings will take place from March 24 to 28, 2025 at the Peniel Retreat Centre in Victoria Falls.\n\nOrganised by the SADC Secretariat in collaboration with the Ministry of Industry and Commerce, the high-level meeting will bring together key stakeholders from across the region, including Government representatives, regulatory bodies and industry experts.\n\nThe goal is to accelerate the harmonisation of standards, improve quality assurance and enhance trade facilitation across the 16-member bloc.\n\nAt the heart of the discussions is the SADC Protocol on Trade, which aims to promote seamless trade by eliminating unnecessary regulatory obstacles.\n\nThe meeting will focus on key areas of the SADC TBT Cooperation Structures, which oversee standardization, accreditation, legal metrology, technical regulations and stakeholder engagement.\n\nThese structures work to ensure that regional standards align with international benchmarks, strengthen recognition of conformity assessments, enhance measurement compliance for fair trade practices, and harmonise policies to create a transparent regulatory environment.\n\nThe meeting will also review the progress of the SADC Secretariats ongoing efforts in supporting Member States in implementing the Standardisation, Quality Assurance, Accreditation and Metrology (SQAM) Programme.\n\nDiscussions will include updates on the review of the TBT Annex and future strategies to align regional policies with global trade requirements.\n\nWith intra-African trade increasingly gaining momentum, especially under the African Continental Free Trade Area (AfCFTA), this SADC initiative is seen as a key step towards creating a more competitive and integrated market.\n\nBy reducing technical barriers, the bloc aims to attract investment, enhance industrial growth and support local businesses in reaching international markets.\n\nDelegates from all SADC Member States, as well as representatives from regional and international organisations, are expected to participate.\n\nTheir discussions will not only shape the future of trade within SADC but also set the tone for broader engagements with global trading partners.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/SADC-States-1.jpg",
            "description": "The Southern African Development Community (SADC) will next week convene a crucial five-day meeting in Victoria Falls aimed at eliminating trade barriers and strengthening regional economic cooperation.",
            "time": "21:07",
            "date": "19 Mar 2025"
        },
        {
            "title": "Harare City employee in court over US$120k fraud",
            "url": "https://www.herald.co.zw/harare-city-employee-in-court-over-us120k-fraud/",
            "content": "Prosper Dembedza\n\nHerald Correspondent\n\nA Harare City employee has appeared in court on allegations of defrauding a home seeker of US$120 000 in a botched stand deal.\n\nCharles Sigauke (51) was released on US$500 bail by Harare magistrate, Mrs Marehwanazvo Gofa.\n\nSigauke was ordered to reside at his given address until the matter is finalised.\n\nThe court heard that on April 27, 2024, Sigauke and Josphat Chidamoyo allegedly decided to sell a stand in Greystone Park, Harare, measuring 4000 square metres.\n\nIt is the States case that the complainant, Edelite Muzavazi, expressed an interest in the stand and on May 9, 2024, she and the accused proceeded to view it.\n\nOn May 11, 2024, Sigauke and the complainant signed an agreement of sale for the stand.\n\nThe stand was valued at US$150 000 and Muzavazi paid a deposit of US$100 000.\n\nThe balance was supposed to be paid in instalments over six months.\n\nThe court heard that on June 26, 2024, the complainant paid US$26 000 and tried to transfer the stands cession from Sigaukes name to hers but failed.\n\nShe then approached the City of Harare over the issue.\n\nMuzavazi also tried to contact the accused person but he became evasive.\n\nThe complainant then made a police report and investigations established that Sigauke was issued with an offer letter for the stand in April 2019 but failed to pay for it.\n\nMuzavazi was prejudiced of US$120 000 and nothing was recovered.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/fraud-680x348-680x348-680x348.jpg",
            "description": "A Harare City employee has appeared in court on allegations of defrauding a home seeker of US$120 000 in a botched stand deal.",
            "time": "21:07",
            "date": "19 Mar 2025"
        },
        {
            "title": "Zim faces 6 000 transformers shortage",
            "url": "https://www.herald.co.zw/zim-faces-6-000-transformers-shortage/",
            "content": "Farirai Machivenyika\n\nSenior Reporter\n\nThe country is facing a shortage of 6 000 transformers that have been lost mainly due to vandalism, Energy and Power Development Minister July Moyo told the National Assembly today.\n\nHe was responding to a question by Murehwa South legislator, Cde Noah Mangondo during the weekly question and answer session.\n\nCde Mangondo wanted to know the Governments policy regarding replacing damaged or vandalised electricity transmission infrastructure, especially for schools and health institutions, some of which have gone for months without electricity.\n\nThe main problem we are facing is vandalism of infrastructure and as we speak, 6 000 transformers were stolen countrywide. We have no capacity locally to produce enough to replace them timeously.\n\nFor the wooden poles, the policy we now have is that we replace them with concrete ones which are more durable, Minister Moyo said.\n\nThe Government has since amended the law to impose a mandatory 10-year jail term on electricity infrastructure vandals.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/11/transformer.jpg",
            "description": "The country is facing a shortage of 6 000 transformers that have been lost mainly due to vandalism, Energy and Power Development Minister July Moyo told the National Assembly today.",
            "time": "21:07",
            "date": "19 Mar 2025"
        },
        {
            "title": "Bulawayo serial burglar arrested",
            "url": "https://www.herald.co.zw/bulawayo-serial-burglar-arrested/",
            "content": "Anesu January\n\nHerald Correspondent\n\nThe Zimbabwe Republic Police have arrested 38-year-old Tauya Maguwu in connection with a string of unlawful entry and theft cases in Bulawayo.\n\nThe crimes were committed between January 2021 and March 12, 2025.\n\nMaguwu is allegedly linked to at least seven burglaries, with stolen household goods being valued at approximately US$3 500.\n\nNational police spokesperson, Commissioner Paul Nyathi confirmed the arrest and credited community cooperation for aiding law enforcement efforts.\n\nThe Zimbabwe Republic Police commends the public for providing information that led to the arrest of the suspect, he said. We urge citizens to remain vigilant and report any criminal activities to the police.\n\nOne of the incidents took place in December 2021 in Nketa. Maguwu allegedly stole a laptop, a Starlet HD decoder, a Q Set decoder, two laptop speakers, and a radio speaker.\n\nOn March 12, 2025, he is accused of breaking into a house in Sizinda, where a Samsung home theatre, three blankets and a 50-inch Samsung television were stolen.\n\nFollowing the arrest, ZRP recovered stolen items worth US$1900.\n\nMore property remains unaccounted for.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/12/Arrested.jpg",
            "description": "The Zimbabwe Republic Police have arrested 38-year-old Tauya Maguwu in connection with a string of unlawful entry and theft cases in Bulawayo.",
            "time": "21:07",
            "date": "19 Mar 2025"
        },
        {
            "title": "Agric symposium on the cards",
            "url": "https://www.herald.co.zw/agric-symposium-on-the-cards/",
            "content": "Oliver Kazunga\n\nSenior Business Reporter\n\nTHE Entrepreneurs Network Association of Zimbabwe (ENAZ) will next month host a symposium in Harare, bringing together key stakeholders in agriculture, finance, and policy to drive Zimbabwes economic resurgence.\n\nThe high-level event will underscore the agricultural sectors indispensable role in steering Zimbabwe towards Vision 2030 goals, focusing on food security, investment opportunities, and sustainable value addition.\n\nIn a statement, ENAZ director Ms Tsitsi Mutemaringa said the upcoming symposium will position Zimbabwe as a prime destination for agricultural investment while reinforcing the Governments commitment to facilitating private sector engagement in agribusiness .\n\nWith over 300 expected attendees, including investors, agribusiness leaders, policymakers, and international trade representatives, the symposium which will serve as a dynamic platform for knowledge exchange and strategic networking, will be held in Harare on April 11, she said.\n\nWe aim to showcase agriculture as a viable, high-yield investment opportunity while fostering dialogue on modern agricultural trends, financing solutions, and technology-driven farming innovations.\n\nWith the countrys rich agricultural potential and increasing global demand for high-quality produce, Ms Mutemaringa said agriculture remains one of the most critical pillars for economic stability, job creation, and industrial growth.\n\nThe sector contributes over 17 percent to Zimbabwes Gross Domestic Product and employs nearly 70 percent of the population, particularly in rural areas.\n\nBeyond primary production, agriculture feeds into agro-processing industries  export markets  and financial services, making it a fundamental driver of economic diversification.\n\nKey topics to be discussed include agriculture as a business, technology and innovation in farming, AI-driven solutions to maximise productivity; and addressing climate change and promoting eco-friendly farming techniques.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/ts-680x380.jpg",
            "description": "THE Entrepreneurs Network Association of Zimbabwe (ENAZ) will next month host a symposium in Harare, bringing together key stakeholders in agriculture, finance, and policy to drive Zimbabwe’s economic resurgence.",
            "time": "21:07",
            "date": "19 Mar 2025"
        },
        {
            "title": "Man fined for bashing ex-wife on Valentine’s Day, acquitted of stealing US$10 000 from her",
            "url": "https://www.herald.co.zw/man-fined-for-bashing-ex-wife-on-valentines-day-acquitted-of-stealing-us10-000-from-her/",
            "content": "Yeukai Karengezeka\n\nCourt Correspondent\n\nA Harare man was on Tuesday convicted of assaulting his ex-wife after she refused to accept his Valentines gift but was acquitted of another charge of stealing US$10 000 from her.\n\nBrandon Ncube, a resident of Kuwadzana 3, was fined US$150 by magistrate Ms Learnmore Mapiye after a full trial.\n\nThe court heard that on the evening of February 14, the complainant Rebecca Masunda, a 23-year-old self-employed woman, was in her house in Kuwadzana 3 when Ncube arrived with his Valentines gift.\n\nMasunda, who had recently separated from Ncube, refused to accept the gift, prompting a heated argument that escalated into violence.\n\nDuring the confrontation, Ncube reportedly assaulted Masunda by striking her on the face and grabbing her by the neck, leading to some injuries.\n\nFearing for her safety, Masunda fled her home to seek help.\n\nMasunda claimed that when she returned home later on the same day, she discovered that her piggy bank containing US$10 000 was missing.\n\nShe then contacted Ncube and he allegedly confessed to taking the money.\n\nMasunda reported the matter to the police, leading to Ncubes arrest.\n\nHowever, Magistrate Mapiye found him not guilty of the theft charge.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/fined-680x380.jpg",
            "description": "A Harare man was on Tuesday convicted of assaulting his ex-wife after she refused to accept his Valentine’s gift but was acquitted of another charge of stealing US$10 000 from her.",
            "time": "21:07",
            "date": "19 Mar 2025"
        },
        {
            "title": "Upgraded Kariba rural schools commissioned",
            "url": "https://www.herald.co.zw/upgraded-kariba-rural-schools-commissioned/",
            "content": "Conrad Mupesa\n\nMashonaland West Bureau\n\nTHE Government has commissioned three upgraded schools in Nyaminyami, Kariba, that were constructed by the Seventh Day Adventist Development and Relief Agency (ADRA) through funding from the Embassy of Japan.\n\nThe upgrade of Majazo, Sawiramakwande and Malembeja schools dovetails with the Governments Vision 2030.\n\nBefore the upgrade, learners were conducting lessons in grass-thatched makeshift classrooms.\n\nCounsellor at the Embassy of Japan in Zimbabwe, Mr Nakamura Masataka said the three schools were part of the Participatory School Development Project aimed at improving education for learners.\n\nMembers of the community played a part by moulding bricks and providing locally available building materials during the three-year construction period.\n\nADRA constructed two-by-two classroom and administration blocks at all three schools.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2017/12/logo.jpg",
            "description": "THE Government has commissioned three upgraded schools in Nyaminyami, Kariba, that were constructed by the Seventh Day Adventist Development and Relief Agency (ADRA) through funding from the Embassy of Japan.",
            "time": "21:07",
            "date": "19 Mar 2025"
        },
        {
            "title": "20 Ethiopians intercepted after fire exchange with transporter",
            "url": "https://www.herald.co.zw/20-ethiopians-intercepted-after-fire-exchange-with-transporter/",
            "content": "Thupeyo Muleya\n\nBeitbridge Bureau\n\nSouth Africas anti-smuggling team has intercepted 20 Ethiopians who had been smuggled into that country after a high-speed chase and a shoot-out with their transporter.\n\nLimpopo police spokesperson, Lieutenant Colonel Stephen Thakeng said the gang was arrested on Tuesday in Mahwelereng, adding that they have been charged for violating immigration laws.\n\nPolice received information regarding a white Ford Ranger double cab that was allegedly smuggling illegal foreign nationals from Beitbridge Point of Entry and heading towards Johannesburg, he said.\n\nThe vehicle was intercepted along the N11 road. An attempt was made to stop the vehicle but the driver did not comply and drove off at high speed, and a car chase ensued.\n\nShots were fired and the transporter returned fire until the vehicle lost control and stopped in nearby bushes. Two of the suspects were injured during the shootout. The driver and one passenger managed to jump out and flee from the scene to evade arrest, said Lieutenant Colonel Thakeng.\n\nTwenty Ethiopian men, aged between 18 and 44 years, were found in the car and they failed to produce valid travel documents.\n\nThey have since been arrested.\n\nA manhunt of the two male suspects who evaded an arrest is underway while the suspects will appear before Mahwelereng Magistrates Court soon.\n\nIn Zimbabwe, the Department of Immigration with the assistance of other security agents, has been intercepting Ethiopians, Somalians, Congolese, Eritreans and citizens of countries north of the Zambezi River during their great trek south of the Limpopo.\n\nIt is understood that these nationalities are finding their way into the country through illegal crossing points in the northern and eastern parts of Zimbabwe.\n\nAccording to security sources, the river is the main barrier in their trek to South Africa, hence they are often intercepted at the border or roads leading to several illegal crossing points along the Limpopo River.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/ethop1-680x380.jpg",
            "description": "South Africa's anti-smuggling team has intercepted 20 Ethiopians who had been smuggled into that country after a high-speed chase and a shoot-out with their transporter.",
            "time": "21:07",
            "date": "19 Mar 2025"
        }
    ]
}