{
    "news": [
        {
            "title": "Armed inmate escapes at court",
            "url": "https://www.herald.co.zw/armed-inmate-escapes-at-court/",
            "content": "Prosper Dembedza\n\nCourt Correspondent\n\nAn armed inmate, Luke Zinyengerere, has staged a dramatic escape from the Zimbabwe Prisons and Correctional Services (ZPCS) officers at the Harare magistrate court.\n\nIn a scene reminiscent of a movie, Zinyengerere pointed a gun at the officers escorting prisoners to their transport van, hijacking another motorists vehicle and speeding away.\n\nSources at the scene revealed that the firearm may have been smuggled into the facility by someone at the remand prison. His accomplice, Tafadzwa Marondera, was apprehended at the scene.\n\nBoth Zinyengerere and Marondera are facing armed robbery charges.\n\nMore details will follow as the story develops.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/11/1711-1-1-INMATE.jpg",
            "description": "An armed inmate, Luke Zinyengerere, has staged a dramatic escape from the Zimbabwe Prisons and Correctional Services (ZPCS) officers at the Harare magistrate court.",
            "time": "20:41",
            "date": "21 Mar 2025"
        },
        {
            "title": "Mbare youths acquire ICT skills",
            "url": "https://www.herald.co.zw/mbare-youths-acquire-ict-skills/",
            "content": "Joseph Madzimure\n\nZimpapers Politics Hub\n\nAT least 150 000 youths in Harare are expected to receive training under the Digitruck and Digital Skills Ambassador Programme, Minister of State for Harare Metropolitan Province and Devolution, Senator Charles Tawengwa has said.\n\nPresident Mnangagwa launched the programme early this year.\n\nThe initiative is designed to leapfrog the nation into digital excellence so that every community can thrive in the global digital economy.\n\nMbare youths are the first beneficiaries of the programme and a total of 68 students graduated yesterday.\n\nAt least 10 000 youths in Mbare are expected to benefit from the programme, with no entry qualification required for one to attend the ICT lessons.\n\nSpeaking at the graduation ceremony at the Mbare Renewal Project in Harare this afternoon, Minister Tawengwa said the Second Republic is committed to transforming the livelihoods of the people through ICT.\n\nThe goal is to bring technology and knowledge to everyone regardless of their location or socio-economic status. We want to ensure our youth are empowered, he said.\n\nChairperson of the Mbare Renewal Projects Mr Oliver Olembe Vellem attended the graduation ceremony.\n\nWe expect more youths from Mbare to acquire ICT knowledge for free. We have constructed an ICT lab, which they can use for free, said Mr Vellem.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/09/charles-tavengwa.jpg",
            "description": "AT least 150 000 youths in Harare are expected to receive training under the Digitruck and Digital Skills Ambassador Programme, Minister of State for Harare Metropolitan Province and Devolution, Senator Charles Tawengwa has said.",
            "time": "20:41",
            "date": "21 Mar 2025"
        },
        {
            "title": "Government commemorates World Meteorological Day",
            "url": "https://www.herald.co.zw/government-commemorates-world-meteorological-day/",
            "content": "Anotida Chonzi\n\nHerald Correspondent\n\nThe Government of Zimbabwe and the Meteorological Service Department have shown their commitment to enhancing early warning systems.\n\nSpeaking during commemorations of the World Meteorological Day today, Permanent Secretary in the Ministry of Environment, Climate and Wildlife Mr Tadeous Chifamba said Government is committed to strengthening meteorological infrastructure and enhancing community-based early warning systems.\n\nOur meteorological network has been expanded significantly, with automatic weather stations in all our 47 stations dotted around the country and 5 Doppler weather radars that cover the whole country and provide real-time data. This is crucial for accurate forecasting and tracking of storms, he said.\n\nWe will strengthen collaboration at all levels, ensuring that weather and climate information reaches every citizen, particularly in rural and underserved areas.\n\nLocal radio stations have played a pivotal role in the establishment and expansion of community-based early warning systems to ensure that even the most remote areas receive timely alerts, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/c4962791-f8de-46c7-b44c-3714fa7e431c-680x380.jpeg",
            "description": "The Government of Zimbabwe and the Meteorological Service Department have shown their commitment to enhancing early warning systems.",
            "time": "20:41",
            "date": "21 Mar 2025"
        },
        {
            "title": "President leaves Namibia",
            "url": "https://www.herald.co.zw/president-leaves-namibia/",
            "content": "Kudakwashe Mugari in Namibia\n\nPresident Mnangagwa has left Windhoek for Harare after witnessing the inauguration of Namibias fifth president and the 35th Independence Day celebrations.\n\nThe Sadc chairperson was seen off at the Hosea Kutako International Airport by Minister of Foreign Affairs and International Trade, Professor Amon Murwira, Zimbabwes top envoy to Namibia Ambassador Melody Chaurura, Embassy officials and other senior officials from the host nation.\n\nPresident Netumbo Nandi-Ndaitwah, the first female President for Namibia, was sworn in this morning at the southern African countrys State House.\n\nCde Nandi-Ndaitwah represented the South West Africa Peoples Organization (SWAPO) in the November elections and got 57.31 percent of the vote, beating 14 other rivals.\n\nShe succeeds President Nangolo Mbumba, who served as interim President for a year since the death of President Hage Geingob in February 2024.\n\nNamibia gained independence from apartheid South Africa in 1990.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/d3c2ce76-51c5-46e2-8206-f083e0c22f6a-680x380.jpeg",
            "description": "President Mnangagwa has left Windhoek for Harare after witnessing the inauguration of Namibia's fifth president and the 35th Independence Day celebrations.",
            "time": "20:41",
            "date": "21 Mar 2025"
        },
        {
            "title": "President mourns Bulawayo Road accident victims",
            "url": "https://www.herald.co.zw/president-mourns-bulawayo-road-accident-victims/",
            "content": "Freeman Razemba\n\nSenior Reporter\n\nPresident Mnangagwa has sent a condolence message to the families of eight people who died when a commuter omnibus they were travelling in was hit by a haulage truck along the Harare-Bulawayo Road near Dzivarasekwa turn-off on Wednesday.\n\nEleven other people were injured in the accident that has since been declared a national disaster.\n\nGovernment will accord the victims State-assisted funerals.\n\nIn a statement, President Mnangangwa said, I learned with a deep sense of shock and horror of the fatal accident that occurred on Wednesday involving a commuter omnibus, a haulage truck and a lorry at the Dzivarasekwa turn-off along Bulawayo Road that claimed 8 lives and left 11 injured.\n\nIt is disturbing that the nation continues to lose lives from road carnage, mostly through human error and unroadworthy vehicles.\n\nI call upon the commuting public and transport operators to avoid using intersections and other dangerous spots along the roads as pick-up and drop-off points. I also appeal to all motorists to avoid reckless driving and to exercise extreme caution for the safety of all road users, he said.\n\nMay I remind everyone that Zimbabwe is a signatory to the Southern African Development Community (SADC) Protocol on Transport, Communications and Meteorology, which saw Member States harmonizing transport policies, institutions and practices, a development that saw some of our traffic laws and regulations changing.\n\nIn that regard, all arms of Government that are responsible for ensuring road safety are thus reminded to not only continue improving roads and signage but also intensify information campaigns on the changes in our traffic laws to improve public awareness, especially that of motorists.Government has declared this horrendous accident a national disaster and will accord the victims State-assisted funerals.\n\nI express my heartfelt sympathy and condolences to families and relatives who have lost their loved ones as well as prayerfully wish all those injured and hospitalized a speedy recovery, said the President.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Untitled-50.jpg",
            "description": "President Mnangagwa has sent a condolence message to the families of eight people who died when a commuter omnibus they were travelling in was hit by a haulage truck along the Harare-Bulawayo Road near Dzivarasekwa turn-off on Wednesday.",
            "time": "20:41",
            "date": "21 Mar 2025"
        },
        {
            "title": "Acting President Chiwenga congratulates new IOC president",
            "url": "https://www.herald.co.zw/acting-president-chiwenga-congratulates-new-ioc-president/",
            "content": "Mukudzei Chingwere\n\nHerald Reporter\n\nActing President Dr Constantino Chiwenga has congratulated Sports, Arts, Recreation and Culture Minister Kirsty Coventry on her election as president of the International Olympic Committee (IOC).\n\nMinister Coventry becomes the first woman and the first African to lead the prestigious organisation.\n\nIn a statement, Dr Chiwenga celebrated Minister Coventrys remarkable journey to the influential position, emphasising that her election is not just a personal triumph but a source of immense pride for the whole country.\n\nDr Chiwnga urged Minister Coventry to represent Zimbabwes values and aspirations on the global stage.\n\nThe IOC president carries immense responsibilities and I am confident that you will advocate for the development of sports worldwide, said Acting President Chiwenga.\n\nYour illustrious career as an Olympian, marked by your dedication and unparalleled achievements, has inspired countless Zimbabweans and athletes worldwide.\n\nIt was this legacy of success that made it an easy decision for our President, His Excellency Dr Mnangagwa, to appoint you as the Minister of Sports, Recreation, Arts, and Culture.\n\nYour extensive experience and profound knowledge of the sporting world have made a significant impact on our national sports agenda, he said.\n\nThe Acting President said the Government of Zimbabwe stands firmly behind Minister Coventry as she takes on the new role.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Untitled-77-680x380.jpg",
            "description": "Acting President Dr Constantino Chiwenga has congratulated Sports, Arts, Recreation and Culture Minister Kirsty Coventry on her election as president of the International Olympic Committee (IOC).",
            "time": "20:41",
            "date": "21 Mar 2025"
        },
        {
            "title": "Blessed Mhlanga’s appeal for bail thrown out",
            "url": "https://www.herald.co.zw/blessed-mhlangas-appeal-for-bail-thrown-out/",
            "content": "Fidelis Munyoro\n\nAlpha Media Holdings journalist Blessed Mhlanga remains in custody after the High Court dismissed his appeal for bail today.\n\nThe case stems from allegations that Mhlanga transmitted information that was meant to incite public violence following a press conference held by Blessed Geza.\n\nHis appeal sought to overturn Magistrate Farai Gwitimas earlier decision to deny him bail.\n\nDelivering the High Court ruling, Justice Gibson Mandaza upheld the magistrates decision and said Mhlangas release poses a risk of interference with ongoing investigations.\n\nJustice Mandaza dismissed arguments from Mhlangas legal team that the prosecutions case was an attack on press freedom, asserting that all professional conduct must operate within legal boundaries.\n\nMagistrate Gwitima had earlier ruled that Mhlangas release would likely lead to interference with witnesses, many of whom are his subordinates.\n\nThe magistrate criticised the defences approach, accusing it of trivialising a serious offence with wide-ranging implications for national stability.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/04/Blessed-Mhlanga.jpg",
            "description": "Alpha Media Holdings journalist Blessed Mhlanga remains in custody after the High Court dismissed his appeal for bail today.",
            "time": "20:41",
            "date": "21 Mar 2025"
        },
        {
            "title": "Acting President celebrates First Lady",
            "url": "https://www.herald.co.zw/acting-president-celebrates-first-lady/",
            "content": "Mukudzei Chingwere\n\nHerald Reporter\n\nActing President Dr Constantino Chiwenga has extended warm birthday wishes to the First Lady, Dr Auxilia Mnangagwa, as she celebrates her 62nd birthday.\n\nIn his congratulatory message, the Acting President emphasised the significant impact of the First Ladys philanthropic efforts through the Angel of Hope Foundation, which has uplifted the lives of many underprivileged Zimbabweans.\n\nThe nation is gratified to spare a moment to reflect and cherish the tremendous work that she continues to spearhead, said the Acting President.\n\nThe indelible legacy of commitment, compassion and the spirit of giving she has inculcated in all Zimbabweans is something we emulate with pride.\n\nHe praised Amai Mnangagwas multifaceted role, describing her as a beacon of hope and a catalyst for change in various sectors, particularly health and childcare, environmental conservation and tourism.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/08/VP-Chiwenga.jpg",
            "description": "Acting President Dr Constantino Chiwenga has extended warm birthday wishes to the First Lady, Dr Auxilia Mnangagwa, as she celebrates her 62nd birthday.",
            "time": "20:41",
            "date": "21 Mar 2025"
        },
        {
            "title": "US$125 000 fraud trial kicks off",
            "url": "https://www.herald.co.zw/us125-000-fraud-trial-kicks-off/",
            "content": "Herald Correspondent\n\nThe trial of a Harare businessman who allegedly converted a clients US$125 000 to personal use kicked off today with him denying the charges.\n\nVhurumu Mutero is facing theft of trust property charges.\n\nHowever, Mutero is accusing the complainant of retaliating against him after he had sued him for US$80 000.\n\nMutero said he is the one who is owed by the complainant.\n\nThe court heard that between February and July last year, the complainant gave Mutero US$125 000 to acquire a Toyota single-cab truck, household and office furniture for him.\n\nThe items included four double-door refrigerators, four 65-inch television sets, a washing machine, four sets of leather sofas, three dining room sets, four deep freezers, seven bed sets, office sofas, outdoor chairs, three tables, and eleven room dividers.\n\nThe complainant was prejudiced of US$125 000 and nothing was recovered\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/09/Fraud.jpg",
            "description": "The trial of a Harare businessman who allegedly converted a client’s US$125 000 to personal use kicked off today with him denying the charges.",
            "time": "20:41",
            "date": "21 Mar 2025"
        },
        {
            "title": "Pig Industry Board signs Integrity Pledge to combat corruption",
            "url": "https://www.herald.co.zw/pig-industry-board-signs-integrity-pledge-to-combat-corruption/",
            "content": "Mutsawashe Mashandure\n\nHerald Correspondent\n\nThe Pig Industry Board has signed the Integrity Pledge, thereby marking a decisive step towards fostering ethical standards and combating corruption within the agricultural sector.\n\nSpeaking during the signing ceremony, Zimbabwe Anti-Corruption Commission (ZACC) chairperson Mr Michael Reza said the pledge was designed to enhance transparency and discourage corrupt activities.\n\nThe readiness of the members of the board to sign the pledge demonstrates not just a personal commitment, but a collective vision to build a binding ethical culture within the pig Industry, he said.\n\nIt is the cornerstone upon which all effective public administration is built. When we speak of integrity, we refer to a state of moral soundness, incorruptibility, and steadfast adherence to moral and ethical principles, he said.\n\nMr Reza highlighted that integrity manifests as transparency in decision-making.\n\nWithout integrity, governance structures become hollow shells, susceptible to capture by vested interests and incapable of serving the public good, he said.\n\nBribery might occur in licensing processes, with unscrupulous operators offering payments to secure favourable treatment or to expedite approvals.\n\nExtortion could take place when officials demand payments to perform their regular duties or to overlook violations.\n\nSpeaking at the same event, the boards chief executive Dr Sharai Ncube said the signing of the pledge will promote ethical standards in the agriculture sector.\n\nThe pledge creates mechanisms for transparency that allow stakeholders to hold public officers accountable, she said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2013/11/pigs.jpg",
            "description": "The Pig Industry Board has signed the Integrity Pledge, thereby marking a decisive step towards fostering ethical standards and combating corruption within the agricultural sector.",
            "time": "20:41",
            "date": "21 Mar 2025"
        }
    ]
}