{
    "news": [
        {
            "title": "President hands over title deed to PPC Zimbabwe",
            "url": "https://www.herald.co.zw/president-hands-over-title-deed-to-ppc-zimbabwe/",
            "content": "Rumbidzayi ZinyukeSenior ReporterPresident Mnangagwa today officially handed over the title deed for Subdivision E of Arlington Estate to PPC Zimbabwe.\n\nThe property, initially owned by Portland Holdings (Private) Limited, now operating as PPC Zimbabwe, had been acquired by the Government as part of the Airport expansion programme.\n\nHowever, following a formal request by the company for its return citing extensive investment and planned developments on the site, the Government has now reinstated ownership.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/IMG-20250410-WA0117-680x380.jpg",
            "description": "President Mnangagwa today officially handed over the title deed for Subdivision E of Arlington Estate to PPC Zimbabwe.",
            "time": "18:09",
            "date": "10 Apr 2025"
        },
        {
            "title": "25-year marriage falls apart over unpaid bride price",
            "url": "https://www.herald.co.zw/25-year-marriage-falls-apart-over-unpaid-bride-price/",
            "content": "Violet Chenyika\n\nA Harare woman has taken her husband of 25 years to court alleging that he insults and sexually harasses her.\n\nMs Happiness Moyo made the allegations against Mr Tedious Mudzana at the Harare Civil Court on Thursday.\n\nShe accused Mr Mudzana of insulting and sexually harassing her yet he did not pay the bride price to her family.\n\nWe have been staying together as husband and wife for 25 years, and we have five children. He never paid any money to my family as bride price in all those years.\n\nHe verbally and sexually harasses me in public. He insulted me after I paid his medical bills, saying that it makes up for the money he paid for my mothers burial, she said.\n\nIn his defence, Mr Mudzana did not deny the allegations but argued that his wife has been refusing him conjugal rights for six months.\n\nI have no issues with the order, but she has been refusing me conjugal rights for over six months now. She also refused my proposal to marry another wife.\n\nPresiding magistrate Ms Meenal Narotam ordered Mr Mudzana not to insult and sexually harass Ms Moyo.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/civil-court-680x380.jpg",
            "description": "A Harare woman has taken her husband of 25 years to court alleging that he insults and sexually harasses her.",
            "time": "18:09",
            "date": "10 Apr 2025"
        },
        {
            "title": "Construction of Dhizha Clinic in Dema nears completion",
            "url": "https://www.herald.co.zw/construction-of-dhizha-clinic-in-dema-nears-completion/",
            "content": "Victor Maphosa\n\nMashonaland East Bureau\n\nDhizha Clinic, which is being built in Ward 6 of Manyame District, is now 75 percent complete, with the local authority expecting to finishn construction works this year.\n\nThe council is using devolution funds to build the clinic, the second clinic in the ward.\n\nCurrently, people are walking more than 10 km to the nearest Zhakata Clinic in Seke for services.\n\nThe new clinic is expected to bring relief to residents by reducing the distance they are walking to the nearest health centre.\n\nMashonaland East Provincial Affairs and Devolution Minister Advocate Itayi Ndudzo visited the construction site to assess progress and commended the local authority for channeling funds towards improving service delivery as well as the community for providing labour.\n\nThis project, which is ongoing, was initiated by residents who were enduring long distances to the next clinic, he said.\n\nGovernment came through Manyame Rural District Council and availed devolution funds which have accelerated development in this ward.\n\nIt is pleasing to note that the community is assisting. The Member of Parliament for this constituency also contributed with Constituency Development Funds (CDF) to ensure the project is a success. What we want to see here is the completion of this clinic so that people can benefit.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Untitled-2-680x380.jpg",
            "description": "Dhizha Clinic, which is being built in Ward 6 of Manyame District, is now 75 percent complete, with the local authority expecting to finishn construction works this year.",
            "time": "18:09",
            "date": "10 Apr 2025"
        },
        {
            "title": "Relay teams off to Botswana",
            "url": "https://www.herald.co.zw/relay-teams-off-to-botswana/",
            "content": "Zimpapers Sports Hub\n\nZIMBABWE athletes who are bidding to qualify for the World Relays set for China next month left Harare on Thursday for Gaborone.\n\nThey will on Saturday take part in an athletics competition in which they are bidding to qualify for the prestigious World Relays.\n\nThe athletics teams for both 4100 and 4x400m Relays will be bidding to clock times that are in the World Athletics top 32.\n\nThe mens 4x400m team was 28th last week but hanging on precariously as other national teams raced to make the grade across the globe.\n\nPhakamile Lisimati, the National Athletics Association of Zimbabwe director of coaching, confirmed that the athletes are on their way.\n\nThey are now in Bulawayo traveling by bus, said Lisimati.The teams4x100m MEN:1. Ngoni Makusha2. Daniel Magogo3. Delroy Reppoh4. Takudzwa Manhanga5. Elvis Mukuchura\n\n4x100M GIRLS1. Hayley Chingono2. Nyasha Doka3. Rutendo Vushe4. Gladys Mukome5. Rutendo Sixpence6. Samukheliso Ndebele\n\n4x400m1. Geren Muwishi2. Dennis Hove3. Leeford Zuze4. Aldrin Mafa\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/2e8f970e-3a35-4106-8775-17a1e9f1eb58-680x380.jpeg",
            "description": "ZIMBABWE athletes who are bidding to qualify for the World Relays set for China next month left Harare on Thursday for Gaborone.",
            "time": "18:09",
            "date": "10 Apr 2025"
        },
        {
            "title": "Road rehabs start in Harare suburbs",
            "url": "https://www.herald.co.zw/road-rehabs-start-in-harare-suburbs/",
            "content": "Richard Muponde\n\nZimpapers Politics Hub\n\nTHE Government has started the construction and rehabilitation of roads in Harares suburbs, with work underway in Glen View where new surfaces are being laid out.\n\nThis is part of the Governments pledge to rehabilitate and construct roads in major cities and towns to address years of neglect by local authorities.\n\nCity roads fall under the purview of local authorities, but for the past 20 years, the predominantly opposition-led councils have neglected them.\n\nIn the latest intervention, the Government is working with the Zimbabwe National Road Administration (Zinara).\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/03/ZINARA.jpg",
            "description": "THE Government has started the construction and rehabilitation of roads in Harare’s suburbs, with work underway in Glen View where new surfaces are being laid out.",
            "time": "18:09",
            "date": "10 Apr 2025"
        },
        {
            "title": "Zim, UAE launches Zim Digital Skills",
            "url": "https://www.herald.co.zw/zim-uae-launches-zim-digital-skills/",
            "content": "Freeman Razemba\n\nSenior Reporter\n\nZIMBABWE and the United Arab Emirates have launched the countrys Digital Skills Programme in Harare.\n\nThe initiative was born out of a fruitful partnership between the two governments under the Government Experience Exchange Programme.\n\nThe event was attended by Minister of Information Communication Technology, Postal and Courier Services Dr Tatenda Mavetera and Deputy Minister of Cabinet Affairs and Government Experience Exchange Programme in the United Arab Emirates, Abdullar Lutah, among other senior government officials.\n\nSpeaking during the event, Minister Mavetera said: Today marks a significant milestone in our journey towards a digitally empowered Zimbabwe.\n\nIt is my honour to stand before you at the launch of the Zimbabwe Digital Skills Programme, an initiative born out of a fruitful partnership with the United Arab Emirates Government under the Government Experience Exchange Programme.\n\nAs we embark on this transformative journey, we are guided by the goals and aspirations of our National Development Strategy and the visionary framework of Vision 2030, as articulated by our President, His Excellency, Dr Emmerson Dambudzo Mnangagwa.\n\nThis programme is not just an educational initiative; it is a crucial step towards realising our collective dream of a prosperous, inclusive, and technologically advanced nation.\n\nThe Zimbabwe Digital Skills Programme, she said, aims to train 1.5 million coders in essential skills such as Data Science Fundamentals, Programming fundamentals, Android Kotlin Developer Fundamentals, and AI fundamentals.\n\nThis ambitious target reflects our commitment to empowering our youth with the tools they need to thrive in an increasingly digital world, she said.\n\nThis training programme will add impetus to the Digital Skills Ambassadors Programme that was launched at State House by our President, His Excellency, Dr. Emmerson Mnangagwa on February 19 2025. The best time to build a generation of digitally astute citizens has passed and the next best time is today. In todays global economy, digital skills are the new currency.\n\nShe said these were vital for innovation, entrepreneurship, and economic growth.\n\nBy equipping our young people with these skills, we are not only enhancing their employability but also fostering a culture of creativity and problem-solving that will drive our nation forward, Minister Mavetera said.\n\nI would like to extend my deepest gratitude to the United Arab Emirates Government for their unwavering support and collaboration. Your commitment to sharing knowledge and expertise is invaluable as we navigate this digital transformation together.\n\nThis partnership exemplifies the spirit of cooperation and mutual growth that we aspire to achieve.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/ff700ff4-1a48-46d5-9ae9-ff1aeb8c2ff9-680x380.jpeg",
            "description": "ZIMBABWE and the United Arab Emirates have launched the country's Digital Skills Programme in Harare.",
            "time": "18:09",
            "date": "10 Apr 2025"
        },
        {
            "title": "22 000 households to register for Presidential title deeds in Epworth",
            "url": "https://www.herald.co.zw/22-000-households-to-register-for-presidential-title-deeds-in-epworth/",
            "content": "Online Reporter\n\nMore than 22 000 stand owners are set to register for the KWANGU/NGAKWAMI Presidential Title Deeds programme in Epworth this month, with the number set to rise to 45 000 in two months.\n\nThe programme is aimed at formalising the dormitory settlement.\n\nThe registered stand owners will be able to use their title deeds as collateral for their property.\n\nEpworth Local Board Secretary, Dr Wilton Mhanda confirmed the development, affirming that with the regularisation exercise nearing completion, over 22 000 households are eligible for registration in the Presidential Title Deeds initiative.\n\nAn additional 23 000 stand owners will be entitled to title deeds in two months, as soon as the Epworth Council completes all the work.\n\nOur regularisation exercise is almost complete, and over 22 000 families are set to receive title deeds under the KWANGU/NGAKWAMI Presidential Title Deeds programme upon completion of roads resurfacing and land marking in some areas, said Dr Mhanda.\n\nIn two months from now, an additional 23 000 stand owners will also receive deeds under the same programme.\n\nDr Mhanda described the development as a major achievement for informal settlements in the country.\n\nHe said this will help in improving infrastructural development through properly planned housing structures that are approved and inspected by council.\n\nThe title deeds programme is meant to enhance property rights for those in informal or unregulated settlements, long-standing tenants in local authority houses and those at rural growth points.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Untitled-10-1-680x380.jpg",
            "description": "More than 22 000 stand owners are set to register for the KWANGU/NGAKWAMI Presidential Title Deeds programme in Epworth this month, with the number set to rise to 45 000 in two months.",
            "time": "18:09",
            "date": "10 Apr 2025"
        },
        {
            "title": "Neighbours fight over property in squatter camp",
            "url": "https://www.herald.co.zw/neighbours-fight-over-property-in-squatter-camp/",
            "content": "Spiwe Sarakunze\n\nHerald Reporter\n\nA Mount Hampden woman has approached the civil court seeking a peace order against her neighbours, accusing them of damaging her property and being violent.\n\nMs Revai Gatsi of Mt Hampden accused her neighbours Dennis and Luke Basvo of insulting and damaging her property.\n\nThey are in the habit of coming to my house, throwing stones and destroying my property, she said.\n\nMs Gatsi told the court that they live in a squatter camp and they are pulling down her temporary structure, resulting in her sleeping in the open with her children.\n\nShe said the duo is still claiming ownership of her structure, yet she bought it from them.\n\nThey sold the structure to me about five years ago now they are throwing my things outside and l have nowhere to go, Ms Gatsi said.\n\nShe said that she no longer has peace in the area adding that Dennis and Luke always barge into her room without permission and insult her in public.\n\nI am being labelled a prostitute and a witch because l told them that l will report the matter to the police if they continue harassing me, she said.\n\nThe first respondent, Luke, said that he did not destroy Ms Gatsis property but she is the one who came to them and asked to be accommodated temporarily but is no longer willing to leave.\n\nl only warned her to leave, but she is refusing, telling people that l abuse her, he said.\n\nThe second respondent, Dennis, also denied the allegations, stating that Ms Gatsi is the one who insulted him after he told her to leave.\n\nEnough is enough, she must leave. It is not a crime to tell her to move from our place, he said.\n\nAfter considering the testimonies from parties, presiding magistrate Ms Meenal Narotam granted the peace order in favour of Ms Gatsi.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/06/Peace-order.jpg",
            "description": "A Mount Hampden woman has approached the civil court seeking a peace order against her neighbours, accusing them of damaging her property and being violent.",
            "time": "18:09",
            "date": "10 Apr 2025"
        },
        {
            "title": "Government allocates housing stands to MPs",
            "url": "https://www.herald.co.zw/government-allocates-housing-stands-to-mps/",
            "content": "Blessings Chidakwa\n\nHerald Reporter\n\nThe Ministry of Local Government has allocated 70 residential stands to Members of Parliament across Harare, Goromonzi and Zvimba.\n\nThis initiative forms part of an ongoing urban housing programme supporting legislators from the 8th to the 10th Parliament.\n\nIn a statement, the Ministry of Local Government and Public Works said since 2013, over 250 stands have been issued in various towns including Bulawayo, Chiredzi and Kadoma.\n\nThe Ministry said the stands are a one-time, non-monetary benefit under MPs conditions of service.\n\nThe Ministry of Local Government and Public Works in 2013 partnered with the Parliament of Zimbabwe to avail residential stands in urban and peri-urban areas for allocation to Honourable Members, effective the 8th Parliament and forward, read the statement.\n\nSince its inception, the facility has been benefitting Honourable Members from the 8th (2013-2018), 9th (2018-2023) and the current 10th Parliament. This facility is a once-off entitlement given as non-monetary benefit, which is part of their conditions of service.\n\nThe Government says the move aligns with constitutional obligations to improve the welfare of key public service groups.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Untitled-8-1-680x380.jpg",
            "description": "The Ministry of Local Government has allocated 70 residential stands to Members of Parliament across Harare, Goromonzi and Zvimba.",
            "time": "18:09",
            "date": "10 Apr 2025"
        },
        {
            "title": "UN Results Report spotlights strategic partnerships, transitioning from Funding to Financing for SDGs in Zim",
            "url": "https://www.herald.co.zw/un-results-report-spotlights-strategic-partnerships-transitioning-from-funding-to-financing-for-sdgs-in-zim/",
            "content": "Sirak Gebrehiwot\n\nAs the world looks towards accelerating progress on the Sustainable Development Goals (SDGs), Zimbabwe stands at a pivotal point in its developmental journey, as outlined in the recently released 2024 Annual Results Report by the UN in Zimbabwe.\n\nThis report reflects the outcomes from the third year of the Zimbabwe United Nations Sustainable Development Cooperation Framework (ZUNSDCF 2022-2026) and highlights collective UN support towards achieving the goals set in the National Development Strategy 1 (NDS1, 2021-2025).\n\nA significant focus of this report is showcasing the transition from traditional funding methods to innovative financing strategies for sustainable development.\n\nThis transition is particularly significant for Zimbabwe  an economy in transition, investment in infrastructure and ambitious national and commitment to achieve the SDGs by 2030.\n\nThis strategic shift is supported by key global frameworks, including the Addis Ababa Action Agenda, which emphasises the importance of sustainable financial strategies over dependency on donor funds.\n\nIn 2024, the UN system disbursed approximately US$450 million, significantly supporting Zimbabwes development projects and humanitarian responses, including the El Nio-induced drought.\n\nThe given shrinking official development assistance, the focus is now shifting towards financing mechanisms that are resilient and capable of attracting diverse funding sources.\n\nThis approach aims to empower Zimbabwe to mobilise resources more effectively and sustainably, reducing the reliance on external aid.\n\nThe transition is aligned with the upcoming Fourth International Conference on Financing for Development (FFD4), which is set to be held in Sevilla, Spain, in mid-2025.\n\nThis international conference is expected to serve as a platform advocating for the reform of the international financial architecture and promoting innovative financing mechanisms to support the SDGs.\n\nThe results report emphasises the importance of innovative and strategic approaches such as:\n\n1. Public-Private Partnerships (PPPs): Leveraging PPPs can significantly enhance infrastructure development and public service delivery in Zimbabwe.\n\n2. Blended Finance: Combining concessional funds with private investments can reduce risks for development projects, thereby attracting more investors.\n\n3. Financial Inclusion and Innovation: Enhancing digital financial services can increase economic participation, helping to mobilise resources within the economy.\n\n4. Capacity Building and Human Capital Development: Investing in education and skills development is crucial for fostering a capable workforce to drive economic transformation.\n\n5. Policy Coherence and Governance: Strengthening these areas will attract higher foreign direct investments and bolster domestic investments.\n\nThe collaborative efforts under ZUNSDCF have seen Zimbabwe make strides in areas such as renewable energy, health, education and food system transformation.\n\nMajor successes include mobilising additional investments in renewable energy and connecting schools to digital networks, laying the ground for future growth.\n\nThe UNs role has been pivotal in fostering these developments, supported by flagship joint programmes and strategic dialogues on financing and development policies.\n\nThese initiatives demonstrate how effective partnerships can drive sustainable development and resilience.\n\nLooking ahead, priorities for 2025 focus on ensuring economic stability, resolving debt issues, enhancing institutional capacities and promoting inclusive policies to address gender disparities and youth skill development needs.\n\nThe 2024 report, along with insights and planned actions leading up to FFD4, presents a clear roadmap for Zimbabwes sustainable development.\n\nThrough strategic partnerships and a robust shift towards financing for development, Zimbabwe stands ready to accelerate its progress towards the SDGs, turning challenges into opportunities for sustainable growth and development.\n\nThis proactive approach by Zimbabwe, supported by international cooperation and innovative financial strategies, holds promise for unlocking pathways to prosperity and aligning national development goals with global objectives.\n\nAs the world converges on Sevilla for FFD4, Zimbabwes strategic endeavours serve as a testament to the power of partnership in realising the 2030 Agenda for Sustainable Development.\n\nThe 2024 UN results report is available on: <https://zimbabwe.un.org/sites/default/files/2025-04/UN%20ZIMBABWE%20ANNUAL%20RESULTS%20REPORT%202024_Final-1.pdf> <https://zimbabwe.un.org/en/292321-2024-un-country-team-zimbabwe-results-report>\n\nSirak Gebrehiwot is UN Partnerships and Development Finance Advisor at the UN Resident Coordinators Office.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/United-Nations-Economic-Commission-for-Africa-UN-ECA-Fellowship-Programme-2021-1320x937-680x380.jpg",
            "description": "As the world looks towards accelerating progress on the Sustainable Development Goals (SDGs), Zimbabwe stands at a pivotal point in its developmental journey, as outlined in the recently released 2024 Annual Results Report by the UN in Zimbabwe.",
            "time": "18:09",
            "date": "10 Apr 2025"
        }
    ]
}