{
    "news": [
        {
            "title": "Museum to be set up at Connemara Prison",
            "url": "https://www.herald.co.zw/museum-to-be-set-up-at-connemara-prison/",
            "content": "Jerry Chifamba\n\nThe Government is converting a wing of Connemara Prison, a historical detention centre for nationalists during Zimbabwes liberation struggle, into a museum by mid-March 2025.\n\nThis initiative aims to preserve the countrys history and highlight the brutality faced by liberation heroes.\n\nMidlands Provincial Affairs and Devolution Minister Owen Ncube said, As we reflect on our painful past, these heritage sites inspire our collective determination to modernise and industrialise our economy.\n\nThe Connemara facility, one of four significant heritage sites in the Midlands Province, previously housed prominent nationalists, including Leopold Takawira and Edgar Tekere.\n\nThe museum will feature murals that tell the story of the liberation struggle while maintaining the sites original character.\n\nNational Museums and Monuments director Mr Clapperton Gutu said the project is in progress, with a budget already secured and a procurement team mobilised.\n\nWork is now in progress. We want to put murals on the walls, which will unpack the story of the liberation struggle, he said.\n\nThe budget is now there, and the procurement team is on the move. There are a lot of touch-ups to be done, but we dont want the detention centre to lose its originality.\n\nThis way, we will be able to preserve our rich history by highlighting the brutality that was unleashed on our liberation heroes by the settler regime.\n\nThis year, Midlands Province will host the national Uhuru celebrations at Mutora Business Centre, further highlighting its historical importance in Zimbabwes journey to independence.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/1-copy-680x380.jpg",
            "description": "Jerry Chifamba The Government is converting a wing of Connemara Prison, a historical detention centre for nationalists during Zimbabwe’s liberation struggle, into a museum by mid-March 2025. This initiative aims to preserve the country’s history and highlight the brutality faced by liberation heroes. Midlands Provincial Affairs and Devolution Minister Owen Ncube said, “As we reflect […]",
            "time": "21:06",
            "date": "30 Jan 2025"
        },
        {
            "title": "Five-year-old Shamva boy drowns in river",
            "url": "https://www.herald.co.zw/five-year-old-shamva-boy-drowns-in-river/",
            "content": "Fungai Lupande\n\nMashonaland Central Bureau\n\nA five-year-old boy from Shamva, Nyasha Chegorerino, drowned on Monday while attempting to cross a flooded river on his way home from school.\n\nThe incident occurred at around 4 pm.\n\nNyasha was an ECD A student at Chevakadzi Primary School in Shamva.\n\nMashonaland Central police spokesperson, Inspector Milton Mundembe said Nyasha was in the company of his seven-year-old brother, Kudzai, who is in Grade 1 at the same school, when the incident occurred.\n\nUpon reaching the river, Nyasha said he wanted to cross the flooded river first. As he got into the river, he was swept away.\n\nKudzai immediately ran to tell their uncle, Knowledge Chegorerino (27), who alerted other villagers, and they organised a search to rescue Nyasha.\n\nWhen they got to the river, they could not locate Nyasha. Upon searching downstream, they discovered Nyashas body trapped in wooden logs in the river, approximately 200 meters from the crossing point.\n\nA report was made at ZRP Bindura Rural and police officers attended the scene.\n\nThe body was taken to Bindura Provincial Hospital, where it is awaiting a post-mortem examination.\n\nAuthorities suspect no foul play.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/drown-680x380.jpg",
            "description": "Fungai Lupande Mashonaland Central Bureau A five-year-old boy from Shamva, Nyasha Chegorerino, drowned on Monday while attempting to cross a flooded river on his way home from school. The incident occurred at around 4 pm. Nyasha was an ECD A student at Chevakadzi Primary School in Shamva. Mashonaland Central police spokesperson, Inspector Milton Mundembe said […]",
            "time": "21:06",
            "date": "30 Jan 2025"
        },
        {
            "title": "GBV fuelling mental health crisis",
            "url": "https://www.herald.co.zw/gbv-fuelling-mental-health-crisis/",
            "content": "Ivan Zhakata and Anesu January\n\nMental health disorders linked to gender-based violence (GBV) are on the rise, a Government official has said.\n\nMs Mildred Mapani, deputy director for Strategic Policy Planning in the Ministry of Womens Affairs, Community, Small and Medium Enterprise Development said this at a Data to Policy programme that was organised recently by the Zimbabwe National Statistics Agency\n\n(ZimStat), Vital Strategies, Bloomberg Philanthropies and Data for Health Initiative.\n\nShe said there has been an increase in cases of suicide attempts, anxiety, depression, and substance abuse among GBV survivors.\n\nThere is limited capacity to respond strategically to GBV cases. Law enforcement and health professionals play a critical role, but only 1 500 out of 15 000 have received proper training, Ms Mapani said.\n\nShe said only seven out of 118 hospitals in the country provide one-stop GBV services, leaving many survivors without adequate psychological and medical support.\n\nWe need to focus on high-impact interventions, including increasing the number of trained professionals and improving access to GBV services, Ms Mapani said.\n\nShe also raised concerns over societal attitudes, which she said discourage victimsespecially menfrom seeking help.\n\nWhen a man reports that his wife is abusing him, society laughs at him instead of assisting him. This attitude is harmful and prevents victims from speaking out.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/12/gbv1-1.jpg",
            "description": "Ivan Zhakata and Anesu January Mental health disorders linked to gender-based violence (GBV) are on the rise, a Government official has said. Ms Mildred Mapani, deputy director for Strategic Policy Planning in the Ministry of Women’s Affairs, Community, Small and Medium Enterprise Development said this at a Data to Policy programme that was organised recently […]",
            "time": "21:06",
            "date": "30 Jan 2025"
        },
        {
            "title": "Lake Mutirikwi now spilling",
            "url": "https://www.herald.co.zw/lake-mutirikwi-now-spilling/",
            "content": "Precious Manomano\n\nHerald Reporter\n\nLake Mutirikwi in Masvingo Province is now full and spilling while Lake Tugwi-Mukosi is now on 77,3 percent.\n\nThe development follows a marked improvement in water levels of dams in the province.\n\nLake Mutirikwi provides water to the sugar estates in the Lowveld.\n\nIn a statement, the Zimbabwe National Water Authority (ZINWA) confirmed the developments saying other dams in the provinces that had very low volumes are now seeing an improvement, with Manjirenji Dam recording a 19,8 percent increase since January 22 to reach 40, 4 percent.\n\nSiya Dam, which also augments Manjirenji in providing water to the Mkwasine Sugarcane Estates rose by 10, 9 percent and is now 29,7 percent full.\n\nNotable gains have also been witnessed in Mashonaland Central Province dams.\n\nThe national dam level average is now 74,5 percent.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2011/09/lake%20mutirikwi%20along%20the%20mutirikwi%20river%20in%20masvingo.jpg",
            "description": "Precious Manomano Herald Reporter Lake Mutirikwi in Masvingo Province is now full and spilling while Lake Tugwi-Mukosi is now on 77,3 percent. The development follows a marked improvement in water levels of dams in the province. Lake Mutirikwi provides water to the sugar estates in the Lowveld. In a statement, the Zimbabwe National Water Authority […]",
            "time": "21:06",
            "date": "30 Jan 2025"
        },
        {
            "title": "Man arrested for issuing fake council licences",
            "url": "https://www.herald.co.zw/man-arrested-for-issuing-fake-council-licences/",
            "content": "Herald Reporter\n\nA Harare man has been arrested for masquerading as a council official and issuing fake shop licences to several people in the city.\n\nIn a statement, the city said it has noted with concern rising cases of fraudsters masquerading as business licence inspectors.\n\nThe fraudsters are issuing fake licenses and pocketing the money collected.\n\nCouncil said this week its municipal police investigation teams uncovered three fake licenses in shops along Kaguvi Street.\n\nInquiries on the business owners in question established that they had acquired the fake licenses through an individual by the name Edmore Muringayi who claimed to work for the City of Harare, reads the statement.\n\nThe business people were tricked into paying money. Muringayi has since been arrested and is assisting the police with investigations.\n\nWe urge business owners to be aware of unscrupulous fraudsters masquerading as municipal officials.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/08/Arrested.jpg",
            "description": "Herald Reporter A Harare man has been arrested for masquerading as a council official and issuing fake shop licences to several people in the city. In a statement, the city said it has noted with concern rising cases of fraudsters masquerading as business licence inspectors. The fraudsters are issuing fake licenses and pocketing the money […]",
            "time": "21:06",
            "date": "30 Jan 2025"
        },
        {
            "title": "Chinhoyi warns unregistered business persons",
            "url": "https://www.herald.co.zw/chinhoyi-warns-unregistered-business-persons/",
            "content": "Conrad Mupesa\n\nMashonaland West Bureau\n\nThe Chinhoyi Municipality has warned people operating businesses within its jurisdiction without authorisation, permits and valid lease agreements to cease operations.\n\nThe move is aimed at bringing sanity to the provincial capital.\n\nThe targeted businesses include those operating along major roads, at shopping centres and in residential areas.\n\nIn a letter seen by The Herald this morning, Municipality of Chinhoyi acting town clerk, Engineer Simon Marara said the council has prohibited businesses in undesignated areas, including mobile kitchens, automotive services, clothing vendors, liquid petroleum gas outlets and mobile phone accessories.\n\nThe warning also targets unauthorised mobile cash containers, illegal hair salons and barbershops, tuck shops, welding and carpentry.\n\nThe Municipality of Chinhoyi is committed to ensuring the orderly development and operation of businesses within its jurisdiction, he said.\n\nAll individuals operating such businesses are strongly advised to cease operations immediately and to dismantle any illegal structures by no later than 10 February 2025.\n\nThe council also threatened to seize goods or equipment used in conducting unauthorised business activities.\n\nWhile the council has advised individuals to regularise their operations to avoid financial loss and/or legal consequences, the affected persons argued that there arent enough places to operate from.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/ch-680x380.jpg",
            "description": "Conrad Mupesa Mashonaland West Bureau The Chinhoyi Municipality has warned people operating businesses within its jurisdiction without authorisation, permits and valid lease agreements to cease operations. The move is aimed at bringing sanity to the provincial capital. The targeted businesses include those operating along major roads, at shopping centres and in residential areas. In a […]",
            "time": "21:06",
            "date": "30 Jan 2025"
        },
        {
            "title": "Health Ministry calls for increased investment in maternal health services",
            "url": "https://www.herald.co.zw/health-ministry-calls-for-increased-investment-in-maternal-health-services/",
            "content": "Ivan Zhakata and Anesu January\n\nThe Ministry of Health and Child Care is pushing for increased investment in health workforce retention, procurement of essential medical supplies, and improved infrastructure for maternal health services, an official has said.\n\nSpeaking during a policy briefing on maternal mortality, Dr Chipo Chimamise, national maternal health officer in the Ministry of Healths Family Health Department said there is need to improve maternal care across all levels of healthcare to stop all preventable deaths during childbirth.\n\nThe programme was organised by the Zimbabwe National Statistics Agency (ZimStat), Vital Strategies, Bloomberg Philanthropies, and Data for Health Initiative.\n\nShe said maternal deaths remain high despite ongoing efforts to strengthen emergency obstetric care.\n\nDr Chimamise said the national maternal and peri-natal death surveillance and response committee regularly reviews cases and provides recommendations.\n\nWe have trained healthcare workers under programmes like the Emergency Obstetric and Newborn Care (EmONC) initiative, but high staff turnover means facilities are constantly losing skilled personnel.\n\nWith increased investment in health workforce retention, we should see a change as a country, said Dr Chimamise.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/mi-680x380.jpg",
            "description": "Ivan Zhakata and Anesu January The Ministry of Health and Child Care is pushing for increased investment in health workforce retention, procurement of essential medical supplies, and improved infrastructure for maternal health services, an official has said. Speaking during a policy briefing on maternal mortality, Dr Chipo Chimamise, national maternal health officer in the Ministry […]",
            "time": "21:06",
            "date": "30 Jan 2025"
        },
        {
            "title": "10 mushikashika robbers arrested",
            "url": "https://www.herald.co.zw/10-mushikashika-robbers-arrested/",
            "content": "Crime Reporter\n\nTen suspected armed robbers who were using vehicles commonly used as mushikashika to pick up and rob passengers have been arrested in Harare.\n\nThe suspects were using vehicles such as Honda Fit, Toyota Fun Cargo, Toyota Vitz and Toyota Sienta, to lure and rob passengers.\n\nNational police spokesperson Commissioner Paul Nyathi said, The Zimbabwe Republic Police confirms the arrest of ten suspects in connection with a series of robbery cases in which unsuspecting passengers were targeted after being given lifts in mushikashika or pirate taxis in and around Harares central business district between January 20 and 28, 2025.\n\nThe suspects are Liberty Matsika (37), Temptation Mazodze (30), Blessing Murize (32), Rodgers Marufu (26), Golden Tangwanda (38), Admire Makumalo (51), Ashely Bakasa (28), Ndoro Chiriwa Zambezi (28), Stanley Matarutse (48) and Nyasha Kamujoma (32).\n\nThe arrests follow robbery incidents in recent weeks where criminals would utilise mushikashika vehicles to lure and rob passengers, Commissioner Nyathi said.\n\nFrom January 20 to 28, police tracked the suspects in and around Harares CBD after receiving information that linked them to the robbery incidents. Subsequently, the suspects were arrested, leading to the recovery of cellphones, cash and other valuables.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/05/armed-robbers-used-gun-robbery-260nw-1495712093.jpeg",
            "description": "Crime Reporter Ten suspected armed robbers who were using vehicles commonly used as ‘mushikashika’ to pick up and rob passengers have been arrested in Harare. The suspects were using vehicles such as Honda Fit, Toyota Fun Cargo, Toyota Vitz and Toyota Sienta, to lure and rob passengers. National police spokesperson Commissioner Paul Nyathi said, “The […]",
            "time": "21:06",
            "date": "30 Jan 2025"
        },
        {
            "title": "Redcliffe Woman acquitted of killing son",
            "url": "https://www.herald.co.zw/redcliffe-woman-acquitted-of-killing-son/",
            "content": "Fidelis Munyoro\n\nNomatter Gwatsvaira of Redcliff has been acquitted of murder, with the High Court citing her mental illness at the time of the fatal incident.\n\nJustice Pisirai Kwenda acquitted Gwatsvaira at the High Court Circuit in Gokwe after it was established that she was mentally ill when she killed her one-year-old son, Brighton Makai.\n\nGwatsvaira inflicted fatal injuries on her son while lying on a bed with him on August 22, 2020.\n\nShe scratched Brightons navel and stomach before forcefully pulling his genitals, resulting in his tragic death.\n\nJustice Kwenda invoked Section 29 (2) (a) of the Mental Health Act [Chapter 15:12], which provides for acquittal on the grounds of insanity.\n\nThe court said Gwatsvairas actions were not intentional but were a result of mental disturbances.\n\nThe infants grievous injuries were discovered by Gwatsvairas sister, Sarudzai, who found him groaning in pain with a bruised navel and missing private parts.\n\nBrighton was rushed to Kwekwe District Hospital and was pronounced dead upon arrival.\n\nJustice Kwenda ordered Gwatsvairas referral to Mlondolozi Rehabilitation Centre, where she will receive psychiatric care and support.\n\nThe prosecution was led by Ms Salome Maunganidze.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/05/acquittal-acquitted-as-not-guilty-judgement-crime-as-legal-concept-court-law-as-gavel-judge-mallet-171326042.jpeg",
            "description": "Fidelis Munyoro Nomatter Gwatsvaira of Redcliff has been acquitted of murder, with the High Court citing her mental illness at the time of the fatal incident. Justice Pisirai Kwenda acquitted Gwatsvaira at the High Court Circuit in Gokwe after it was established that she was mentally ill when she killed her one-year-old son, Brighton Makai. […]",
            "time": "21:06",
            "date": "30 Jan 2025"
        },
        {
            "title": "Gold panner found dead in a disused mine shaft",
            "url": "https://www.herald.co.zw/gold-panner-found-dead-in-a-disused-mine-shaft/",
            "content": "Crime Reporter\n\nThe body of a suspected gold panner was found in a decomposing state in a mine shaft in Kadoma.\n\nPolice have since launched investigations into the suspected murder case.\n\nNational police spokesperson Commissioner Paul Nyathi said, Police in Kadoma are investigating a suspected case of murder in which Trynos Mpofu aged 33 was found dead in a 28 metres deep disused shaft at Cricket area, Battlefields, on January 27.\n\nThe body was in a decomposed state. Anyone with information that might assist with investigations should contact the nearest police station.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Assistant-Commissioner-Paul-Nyathi.jpg",
            "description": "Crime Reporter The body of a suspected gold panner was found in a decomposing state in a mine shaft in Kadoma. Police have since launched investigations into the suspected murder case. National police spokesperson Commissioner Paul Nyathi said, “Police in Kadoma are investigating a suspected case of murder in which Trynos Mpofu aged 33 was […]",
            "time": "21:06",
            "date": "30 Jan 2025"
        }
    ]
}