{
    "news": [
        {
            "title": "‘NDS2 boon for manufacturing’ . . . Sector to rise from US$4bn to US$10bn: President",
            "url": "https://www.herald.co.zw/nds2-boon-for-manufacturing-sector-to-rise-from-us4bn-to-us10bn-president/",
            "content": "Zvamaida Murwira in BULAWAYO\n\nPresident Mnangagwa says National Development Strategy 2 (NDS2), the successor to NDS1, will prioritise value addition and industrialisation, particularly in the manufacturing sector, which is poised to rise from the current US$4 billion to over US$10 billion through a strategic focus on value chains in different sectors.\n\nThe Head of State and Government said this in Bulawayo yesterday while officially launching the inaugural annual Competitiveness Summit, organised by the National Competitiveness Commission.\n\nHeld under the theme, Building sustainability towards enhanced productivity and competitiveness in Zimbabwe, the summit seeks to foster dialogue among stakeholders to improve national competitiveness.\n\nAs you are aware, the first edition of the National Development Strategy 1 is coming to an end in 2025, said the President.\n\nDelegates sing the national anthem at the inaugural Annual Competitiveness Summit of the National Competitiveness Commission at the ZITF Grounds in Bulawayo yesterday.\n\nEfforts are underway to develop the successor programme, the National Development Strategy 2 (NDS2).\n\nThis is set to be anchored on fiscal discipline, macro-economic stability as well as robust trade and investment, as critical drivers for improving productivity and competitiveness.\n\nPresident Mnangagwa said NDS2 will prioritise value addition and industrialisation, particularly in the manufacturing sector.\n\nThe aim is to increase the sectors value from the current US$4 billion to over US$10 billion, through a strategic focus on value chains in the different sectors, he said.\n\nPresident Mnangagwa said the Government was aware of challenges affecting businesses and measures would be put in place to address them.\n\nOn its part, the Second Republic is alive to issues affecting businesses and is scaling up measures that create a supportive business operating environment, which encourages innovation and investment.\n\nMy Governments thrust is premised on the need to promote value addition and beneficiation of raw materials and minerals, that support the creation of vibrant industrial value chains, which are critical in the transformation of our economy, said President Mnangagwa.\n\nGovernment, he added, was ready to support the National Competitiveness Commission so that it focuses on competitive strategy, which is key in guiding national policy formulation.\n\nIt is pleasing to note that the Ministry of Industry and Commerce, through the National Competitiveness Commission will focus on developing a National Competitiveness Strategy this year which will be instrumental in guiding national policy formulation.\n\nMy Government stands ready to lend you as much support as possible to successfully acquit yourselves on this very noble endeavour, said President Mnangagwa.\n\nThe inaugural competitive summit, he said, had come at an opportune moment for the Government.\n\nDelegates follow proceedings at the inaugural Annual Competitiveness Summit of the National Competitiveness Commission at the ZITF Grounds in Bulawayo yesterday.\n\nHe then took the opportunity to urge the commission to leverage the invaluable networks it has.\n\nPresident Mnangagwa said the Zimbabwe Industrial Reconstruction and Growth Plan has been developed as the transitional plan to address the challenges bedevilling both the industrial and commercial sectors.\n\nSpecific sectors and value chains such as the soya bean and dairy value chains have been identified as having the national comparative advantage and maximum potential to contribute towards manufacturing value-added growth, he said.\n\nValue addition and beneficiation are poised to enhance the competitiveness of the countrys manufacturing sector at a time when the African Continental Free Trade Area agreement is now operational, said President Mnangagwa.\n\nI urge stakeholders to tap into the new market opportunities presented by these emerging conditions of trade. Hence the need to ensure that our countrys goods and services are competitive, cannot be overemphasised. All sectors, therefore, have a duty and responsibility to embrace the competitiveness agenda and take it to another level.\n\nDelegates follow proceedings at the inaugural Annual Competitiveness Summit of the National Competitiveness Commission at the ZITF Grounds in Bulawayo yesterday\n\nOn its part, my Government remains committed to working with all stakeholders, including the private sector, development partners and academia, in addressing impedimentsaffecting the countrys global competitiveness, said President Mnangagwa.\n\nEarlier, Vice President Dr Constantino Chiwenga said the theme of the summit aligned well with President Mnangagwas steadfastness to achieve inclusive and equitable economic growth as outlined in the NDS1.\n\nVP Chiwenga\n\nThis trajectory will continue to inform and guide us into NDS2. It is gratifying that President Mnangagwa has consistently championed the improvement of Zimbabwes global competitiveness.\n\nUnder his leadership, the country has embarked on a transformative journey focusing on boosting productivity, enhancing the ease of doing business and fostering an ecosystem that attracts both domestic and foreign investment, said VP Chiwenga.\n\nIndustry and Commerce Minister, Mangaliso Ndlovu, said one of the objectives of the summit is to improve the ease of doing business and end bureaucracy.\n\nIt is the key driver of the countrys economic growth, said Minister Ndlovu.\n\nHe added that competitiveness is the cornerstone of any countrys development.\n\nIt is the key driver of the countrys economic growth, said Minister Ndlovu.\n\nThe summit was meant to provide a dialogue platform for all stakeholders to reflect strategies to enhance competitiveness in the country and come up with resolutions for presentation to Government.\n\nIt drew participants from Government ministries, agencies, business leaders and academicsamong others.\n\nSpeakers from different countries addressed the summit where they presented on best practices on how to achieve competitiveness.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/President-Mnangagwa-in-Byo-copy-680x380.jpg",
            "description": "Zvamaida Murwira in BULAWAYO President Mnangagwa says National Development Strategy 2 (NDS2), the successor to NDS1, will prioritise value addition and industrialisation, particularly in the manufacturing sector, which is poised to rise from the current US$4 billion to over US$10 billion through a strategic focus on value chains in different sectors. The Head of State […]",
            "time": "06:41",
            "date": "21 Feb 2025"
        },
        {
            "title": "Edgars plant charms Head of State",
            "url": "https://www.herald.co.zw/edgars-plant-charms-head-of-state/",
            "content": "Zvamaida Murwira in BULAWAYO\n\nBulawayo has the potential to become the hub of the countrys manufacturing sector, given the potential it has shown so far, President Mnangagwa said yesterday.\n\nHe said this after touring Edgars Stores Carousel Clothing manufacturing plant, which is expected to increase production in terms of economic output and employment creation.\n\nThe Presidents visit preceded the launch of the National Competition Commissions inaugural Summit that he later officiated at the Zimbabwe International Trade Fair Exhibition Centre.\n\nThe Edgars manufacturing plant produces a range of clothes for its retail divisions dotted around the country and other outlets, a development set to increase its market share.\n\nEdgars invested in new sewing equipment among other machines to boost its competitiveness.\n\nIn an interview after the tour, President Mnangagwa said he was happy with the production work at the company, particularly considering that the bulk of their workforce was made up of women.\n\nI am very impressed. I have never been here before. It is my first visit to this place, so I am impressed that we have such facilities in our country, so vast and providing employment, especially towomen.\n\nIt shows that when you say Bulawayo is a hub of manufacturing, I realised that it is true, said President Mnangagwa.\n\nThe newly-installed equipment include sewing machines, garment printing press, sand dusting and reaping machines, and pocket inserting machines, amongst otheraccessories.\n\nThe companys manufacturing division has increased the number of workers from 35 in 2022 to about 700 this year.\n\nThe Edgars Group runs Edgars Stores, Jet, Carousel and Club-Plus and the business units have registered steady growth over the years.\n\nPresident Mnangagwa was accompanied by Vice President Dr Constantino Chiwenga, Industry and Commerce Minister Mangaliso Ndlovu, Chief Secretary to the President and Cabinet Dr Martin Rushwaya and other senior Government officials.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/President-tours-Edgars-680x380.jpg",
            "description": "Zvamaida Murwira in BULAWAYO Bulawayo has the potential to become the hub of the country’s manufacturing sector, given the potential it has shown so far, President Mnangagwa said yesterday. He said this after touring Edgars Stores’ Carousel Clothing manufacturing plant, which is expected to increase production in terms of economic output and employment creation. The […]",
            "time": "06:41",
            "date": "21 Feb 2025"
        },
        {
            "title": "4 kids drown sheltering under bridge",
            "url": "https://www.herald.co.zw/4-kids-drown-sheltering-under-bridge/",
            "content": "Patrick Chitumba-Midlands Bureau\n\nFOUR children, aged between nine months and four years, were swept away after they fell asleep under a bridge while sheltering from the rain with their parents in Gokwe last Friday.\n\nMidlands Provincial police spokesperson, Inspector Emmanuel Mahoko, confirmed the incident.\n\nThe incident occurred at around 3.30am when a congregation of an apostolic church sect of about 20 people was praying near Tare Bridge along Gokwe-Siabuwa Road, he said.\n\nInsp Mahoko said seeking refuge from the initial light rain, the group took shelter under a dry bridge.\n\nHowever, he said, as the rain intensified upstream, a sudden wave of flood-water swept in, catching them off guard.\n\nInsp Mahoko said although the adults were able to wake up and rescue themselves, the four children tragically drowned.\n\nTwo children are from Kamba Village and their names are Beauty and Devine Mavhiringani (9 months and 4 years old). The other two are Pamela Natare (1 year 9 months old) of Tsive Village and Effort Shava (3) of Mudzimiri Village.\n\nThe bodies of Devine, Pamela and Effort were later found at the river bank between one kilometre and about 20 kilometres from Tare Bridge, he said.\n\nInsp Mahoko said a search is ongoing to locate Beautys body.\n\nThe retrieved bodies were taken to Gokwe South District Hospital Mortuary and investigations are still underway,he said.\n\nThe four children are part of the 40 people who have drowned across the country since the start of the rainy season, according to the police. Three other minors have also drowned taking to seven the number of children affected.\n\nThe Civil Protection Unit reported that heavy rainfall in Gokwe South, Midlands Province, caused the Tare River to flood its banks.\n\nA group of members of the Johane Masowe eJerusalem Sect, who had taken shelter under the Tare River Bridge during a night vigil, were swept away by the floodwaters while asleep.\n\nUnfortunately, four minors, Muchiringani Devine (4), Muchiringani Beauty (9 months), Tsiva Pamela (20 months), and Shava Effort (3), lost their lives. Three bodies were retrieved, while the search for the remaining minor is ongoing.\n\nThe Department of Civil Protection has facilitated the burial of the minors through Doves Funeral Services, the CPU report stated.\n\nAccording to the agency, since the start of the rainy season, Midlands has recorded the highest number of deaths, with 10 fatalities, followed by Manicaland Province, with eight.\n\nMatabeleland North and South have recorded four each and Bulawayo Metropolitan two.\n\nMashonaland Central and Masvingo have also recorded four fatalities, Mashonaland East and West three each, while Harare is the only province with no reporteddeaths.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/07/Inspector-Emmanuel-Mahoko.jpg",
            "description": "Patrick Chitumba-Midlands Bureau FOUR children, aged between nine months and four years, were swept away after they fell asleep under a bridge while sheltering from the rain with their parents in Gokwe last Friday. Midlands Provincial police spokesperson, Inspector Emmanuel Mahoko, confirmed the incident. “The incident occurred at around 3.30am when a congregation of an […]",
            "time": "06:41",
            "date": "21 Feb 2025"
        },
        {
            "title": "All set for Youth Day celebrations",
            "url": "https://www.herald.co.zw/all-set-for-youth-day-celebrations-3/",
            "content": "Sikhumbuzo Moyo and Sikhulekelani Moyo\n\nTHOUSANDS of youths from across the country today converge at the Zimbabwe International Exhibition Centre where President Mnangagwa will lead National Youth Day celebrations.\n\nThe event is also expected to coincide with the official launch of the ambitious digital skills training programme meant to empower 3,5 million youths with digital skills and enhance their global competencies.\n\nThe commemorations will also focus on initiatives aimed at enhancing the welfare and livelihoods of young people across the country, thereby buttressing the Second Republics inclusive development thrust.\n\nBy end of the day yesterday, the venue for the event was a hive of activity as final touches were being put ahead of todays programme.\n\nAn electronic monitor at the side of the VIP stand had been installed beaming: Zimbabwe Digital Skills Training Programme Launch; Empowering 3,5m youths with digital skills.\n\nThe main commemorations will be held in Hall 4 while in Hall 3 there will be exhibitions by youngsters from various schools, tertiary institutions, Government Ministries, Departments and Agencies.\n\nAll the available 162 cubicles in Hall 3 were taken while Bulawayo schools will exhibit under one cubicle where they showcase their innovative and cultural works.\n\nThis years commemorations are being held under the theme: Empower the Youths, Secure the Future.\n\nMinister of Youth Empowerment, Development and Vocational Training, Tino Machakaire, expressed excitement about the event and said Government was committed to empowering youths and urged them to take a proactive role in the nations economic transformation.\n\nAs we celebrate the 21st February Movement, we encourage the youth of Zimbabwe to unite and concentrate on the economy rather than getting distracted by petty issues, he said.\n\nThere will be opportunities for young people to exchange innovative and entrepreneurial ideas to enhance their skills and knowledge, enabling them to contribute to our great nation.\n\nMinister Machakaire said Government was determined to address all the pressing issues affecting youths such as drug and substance abuse, which is threatening the future of many youths.\n\nWe are committed to launching projects that engage young people so that they have meaningful activities to occupy their time and steer clear of drug and substance abuse, he said.\n\nThe law enforcement agencies will fulfil their responsibilities in addressing drug abuse. However, we must also empower our youths by providing them with life-changing opportunities.\n\nMinister Machakaire said plans to ensure the youth can participate in various Government projects, including construction and road refurbishment were being implemented to give them tangible work opportunities, regardless of the projects scale.\n\nHe said reducing the high unemployment rate among young people remains a primary objective for the Government.\n\nOur youths are the future leaders of this nation, and it is essential to empower them through quality education and entrepreneurial skills to shape their futures and improve their livelihoods.\n\nWe aim to promote youth-led projects by facilitating technology transfer and creating connections between technology suppliers, financial institutions, and young innovators, said Minister Machakaire.\n\nIn separate interviews, various youth groups expressed excitement and had high hope that todays event will speak to their issues and inspire them.\n\nZimbabwe Vision (ZimVi) 2030 Implementers leader Mr Archibald Siziba said they will use the platform express appreciation of President Mnangagwa positive policies.\n\nAs a beneficiary of the Second Republics youth empowerment programmes, I can confidently say that success is within reach only takes participation, dedication, and a willingness to see beyond misinformation, said Mr Siziba.\n\nBy 2030, I see myself as a millionaire, not because I waited for handouts, but because I took advantage of the opportunities provided by President Emmerson Mnangagwa.\n\nThe future is bright for those who embrace Vision 2030 and walk the path of progress. The President has opened the doors, its up to the youth to walk through them.\n\nAnother youth, Mr Addington Mpofu, said the Second Republic has done extremely well in empowering young people and making sure they become drivers of the economy and critical party of the mainstream economy.\n\nIf you look at the agriculture sector, we have seen young people now participating and Zimbabwe is now one of the very few countries that have the highest number of young people in the agriculture sector, said Mr Mpofu.\n\nIf you go to the mining sector, most of the people there are young people, traditionally mining is an old sector but now its being run by youth.\n\nThe President has been very instrumental in making sure that young people are the drivers of the economy and if you look at our ministers now, most of them are young capable people who are in key strategic ministries.\n\nZanu PF Bulawayo provincial spokesperson Cde Archie Chiponda said Zimbabwe is blessed to be endowed with hardworking and highly intelligent youths who have shown the ability to adapt to any economic environment.\n\nThe issue of reserved sectors for indigenous needs to be implemented effectively as those sectors are the sectors in which we would naturally see a high amount of youth participation, said Cde Chiponda.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Minister-Machakaire-680x380.jpg",
            "description": "Sikhumbuzo Moyo and Sikhulekelani Moyo THOUSANDS of youths from across the country today converge at the Zimbabwe International Exhibition Centre where President Mnangagwa will lead National Youth Day celebrations. The event is also expected to coincide with the official launch of the ambitious digital skills training programme meant to empower 3,5 million youths with digital […]",
            "time": "06:41",
            "date": "21 Feb 2025"
        },
        {
            "title": "Mandatory radio licence Bill back in Parliament",
            "url": "https://www.herald.co.zw/mandatory-radio-licence-bill-back-in-parliament/",
            "content": "Blessings Chidakwa and Munyaradzi Musiiwa\n\nThe Broadcasting Services Bill, which makes it mandatory for motorists to first buy a radio licence before acquiring insurance cover, will be tabled in Parliament next Tuesday.\n\nOnly those with an exemption from the Zimbabwe Broadcasting Corporation, which receives the licence money, will be spared, including those without a radio receiver.\n\nFurther, plans are afoot to have a single synchronised disc incorporating radio, Zinara and insurance licences.\n\nThis was revealed during a tour of ZBC and Zimbabwe Media Commission premises by the Ministry of Information, Publicity, and Broadcasting Services and the Parliamentary Portfolio Committee on Media.\n\nDeputy Minister of Information, Publicity and Broadcasting Services Dr Omphile Marupi was representing the Minister, Dr Jenfan Muswere, accompanied by the Parliamentary Portfolio Committee on Information, Publicity and Broadcasting Services chaired by Caston Matewu.\n\nChairperson Matewu said they thought it would be good if they engaged ZBC as a broadcaster and also hear from members of Parliament, some of their concerns, as they go through this Bill.\n\nToday we came here because we wanted to have this engagement with ZBC. So today is not about just trivialisation, but its wanting to hear your views because as you currently know, before Parliament is the Broadcasting Services Amendment Bill.\n\nIt is going to be read on Tuesday for the second reading of the Bill. After which debate will commence by Tuesday.\n\nAs you know, the Bill makes a right number of proposals that it seeks to change the broadcasting sector, he said.\n\nLegislator Matewu said they want ZBC to prosper.\n\nAs you know, the digitalisation project was initially appropriated ZIG30 million. But through our intervention, the last budget is now almost ZIG200 million. That is there for the digitalisation programme, he said.\n\nAs for the Zimbabwe Media Commission, legislator Matewu said the ZMC plays an integral role in satisfying freedom of expression and access to information as enshrined in the national Constitution.\n\nInformation, Publicity and Broadcasting Services Deputy Minister Dr Omphile Marupi said good laws will ensure good governance.\n\nOur purpose is to improve the working conditions of the media and when we talk of the working conditions, we are talking of the law.\n\nThe law helps us to ensure good governance. We cannot talk of good governance with the law not being adhered to, he said.\n\nAs for ZMC, Deputy Minister Marupi assured that Government is committed to ensure improvement of working conditions for the media mostly the laws that govern the trade. He said good law helped on good governance.\n\nThe purpose really is to improve the working conditions of the media fraternity and when we are talking of the working conditions, we are talking of the law of course.\n\nThe law helps us to really talk of good governance. We cannot talk of good governance without the law being adhered to, said the Deputy Minister.\n\nZBC board chair Helliate Rushwaya assured that citizens should be geared for top-notch programming.\n\nThis amendment really matters to us, as we see, as the proposed amendments will expand our revenue base and ensure a steady flow of funds that is crucial, as they seek financial stability.\n\nAnd with this stability, we will be able to invest in delivering our public service broadcasting mandate, to make sure that we include investing in high quality broadcasting infrastructure and content production, shesaid.\n\nZMC chairperson Professor Ruby Magosvonge said sexual harassment in the media is being dealt with.\n\nSexual harassment is a cancer in the media industry. I will work with players in the industry to make the workplace more friendly, shesaid.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Dr-Marupi-680x380.jpg",
            "description": "Blessings Chidakwa and Munyaradzi Musiiwa The Broadcasting Services Bill, which makes it mandatory for motorists to first buy a radio licence before acquiring insurance cover, will be tabled in Parliament next Tuesday. Only those with an exemption from the Zimbabwe Broadcasting Corporation, which receives the licence money, will be spared, including those without a radio […]",
            "time": "06:41",
            "date": "21 Feb 2025"
        },
        {
            "title": "Analyst speak on ZDI removal from sanctions list",
            "url": "https://www.herald.co.zw/analyst-speak-on-zdi-removal-from-sanctions-list/",
            "content": "Columbus Mabika-Herald Reporter\n\nPolitical commentators yesterday said the removal of Zimbabwe Defense Industries (ZDI) from the sanctions list by the European Union (EU) is a sign of acknowledgement by the West that sanctions were wicked and malicious, while it is also a step towards the universal removal of the embargo.\n\nThe EU on Wednesday delisted the ZDI from the restrictive measures imposed in 2002 but maintained an embargo on arms and equipment.\n\n(EU) Council renews restrictive measures framework and delists one entity. The Council today renewed its framework for restrictive measures in view of the situation in Zimbabwe for a further year, until 20 February 2026. The Council also delisted the last remaining entity, the Zimbabwe Defence Industries. The embargo on arms and equipment . . . remains in place, the EU said.\n\nThe development comes as the SADC region and the African continent at large have joined the long growing band of calls for sanctions which have caused untold suffering on the Zimbabwean populace and hampered economic development to be removed.\n\nFormer legislator and National Peace and Reconciliation Commissioner Mr Obert Gutu said the removal was positive but universal removal of sanctions should be immediate.\n\nBy removing the Zimbabwe Defence Industries from the illegal, punitive and ruinous sanctions list, the EU is simply acknowledging the fact that these sanctions were wicked and malicious in the very first place and also that theyre no longer serving any purpose, he said.\n\nRight from the outset there was absolutely no legal justification to place the ZDI under these malevolent sanctions, the whole idea was to punish Zimbabwe for the revolutionary land reform programme that is irreversible and that Zimbabwes sovereignty is not for sale.\n\nFundamentally, Mr Gutu said these illegal sanctions were simply meant to make Zimbabwes economy scream with the aim of collapsing the national economy.\n\nThe removal of ZDI from the sanctions, he said, will enable the company to trade normally and also be able to easily access modern technology in the armaments industry.\n\nHe said this will definitely make the ZDI more efficient, competitive and more profitable.\n\nAnother political analyst, Dr Tongai Dana concurred saying the EU decision to remove ZDI from the sanctions list marks a significant milestone, not just for the defence sector but for the broader national economy.\n\nThis move signals a shift towards re-engagement, opening doors for economic expansion, industrial growth, and enhanced national security. While challenges remain, this development offers Zimbabwe an opportunity to reclaim its place in the global defence and economic landscape, fostering resilience and self-sufficiency in the face of restrictions, he said.\n\nHe said the development signals the possibility of re-engagement.\n\nThis move sits at the intersection of realism, where strategic interests dictate foreign policy, and constructivism, which acknowledges that international relations are shaped by evolving norms and diplomatic recalibration, he said.\n\nDefence industries worldwide, he said, serve as critical engines for industrialisation, job creation, and technological advancement.\n\nIn Zimbabwes case, the development will unlock access to global defence markets, facilitate technology transfer, and enhance financial transactions, previously stifled by restrictions.\n\nFrom a national security perspective, Dr Dana said the ability to develop an independent defence industry reduces reliance on foreign arms suppliers, a challenge faced by many African nations vulnerable to external pressures leading to terrorism.\n\nAnti-sanctions activist, Mr Witness Dube, said the removal of ZDI from the sanctions list has a positive impact on the economy.\n\nThis is a sign that the relationship between Zimbabwe and the EU is thawing and an acknowledgement of the existence of democracy, human rights and the rule of law, which were the reasons cited for the sanctions in the first place, he said.\n\nRemoval of ZDI as an entity is positive for economic growth as this company can now go all out to attract foreign investment while trading on the international stage. Growth in this sector will open doors for the yet unknown economic activity that has been subdued by sanctions, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Mr-Obert-Gutu-680x380.jpg",
            "description": "Columbus Mabika-Herald Reporter Political commentators yesterday said the removal of Zimbabwe Defense Industries (ZDI) from the sanctions list by the European Union (EU) is a sign of acknowledgement by the West that sanctions were wicked and malicious, while it is also a step towards the universal removal of the embargo. The EU on Wednesday delisted […]",
            "time": "06:41",
            "date": "21 Feb 2025"
        },
        {
            "title": "Midlands still stands by People’s Conference resolution number 1",
            "url": "https://www.herald.co.zw/midlands-still-stands-by-peoples-conference-resolution-number-1/",
            "content": "Freedom Mupanedemo-Midlands Bureau\n\nThe Midlands Province remains firm and stands with Zanu-PFs Peoples Conference resolution number 1 which resolved to extend President Mnangagwas term to the year 2030, Midlands Provincial Affairs and Devolution Minister, Owen Ncube has said.\n\nHe said this while giving his opening remarks at the launch of War Veterans residential stands scheme in Gweru yesterday.\n\nMinister Ncube said President Mnangagwa has done a lot, coming up with robust economic turn around programmes that he should see out through 2030.\n\nFellow Comrades, I assure you that the Midlands Province remains steadfast, resolute and unwavering in support of Resolution number 1 overwhelmingly endorsed by all the countrys 10 Provinces in Bulawayo last year mandating His Excellency the President of the Republic of Zimbabwe Cde Dr E.D Mnangagwa to lead the nation towards attainment of our National Vision 2030.\n\nThe voice of the people is the voice of God, he said.\n\nMinister Ncube said the Second Republic under the leadership of President Mnangagwa came up with a broader economic turn around programmes that compassed every one including the veterans of the liberation struggle hence the need to extend the Presidents term.\n\nTodays landmark empowerment initiative targeting Veterans of the Liberation Struggle attests to the Second Republics unwavering commitment towards upholding and defending the objectives of the liberation struggle, among them economic empowerment and defending our national sovereignty, interests and ethos.\n\nAccordingly, this event showcases the indelible footprint of the New Dispensations pursuit of universal access to shelter as provided for in terms of Section 28 of the Constitution of Zimbabwe and the Zimbabwe National Human Settlement Policy.\n\nFurthermore, allocation of residential stands to Veterans of the Liberation Struggle seamlessly aligns with the supreme law of our country, the Constitution of Zimbabwe and other statutes which recognise the role of Veterans in the war of liberation and after independence and provide for the welfare of veterans who fought in the war of liberation, assisted fighters, and those restricted and detained for their political activism, he said\n\nHe said the nation should take pride in President Mnangagwas leadership style that was all inclusive.\n\nIt is therefore befitting that our nation takes pride in the people-oriented leadership of His Excellency the President of the Republic of Zimbabwe, Cde Dr E.D Mnangagwa himself a decorated freedom fighter who trained in Tanzania, Egypt and The Peoples Republic of China and survived the death penalty on a legal technicality.\n\nFollowing the ushering in of the New Dispensation in 2017, His Excellency the President Cde Dr E.D Mnangagwa immediately rolled out robust programmes and projects designed to recognise, uphold and amplify the resilience, loyalty, consistency and perseverance of the selfless sacrifices of Veterans of the liberation struggle during the second and third Chimurenga, he said.\n\nSpeaking at the same occasion, Veterans of the Liberation Struggle Affairs, Minister Monica Mavhunga said President Mnangagwas Government was committed to improving the welfare of war veterans.\n\nToday we are launching a landmark programme of 106 residential stands which will be given to the veterans of the liberation struggle and this shows how the Second Republic values the role played by these Comrades to liberate the country, she said.\n\nBeneficiaries of the residential stands commended President Mnangagwa for coming up with such a programme.\n\nWe are very happy we now own stands most of us are still tenants, we rent places where we stay despite the role we played in the struggle and we are happy that the Second Republic is working on improving our welfare, said Cde Beauty Hera who was among the beneficiaries.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/06/OWEN-NCUBE-680x380.png",
            "description": "Freedom Mupanedemo-Midlands Bureau The Midlands Province remains firm and stands with Zanu-PF’s People’s Conference resolution number 1 which resolved to extend President Mnangagwa’s term to the year 2030, Midlands Provincial Affairs and Devolution Minister, Owen Ncube has said. He said this while giving his opening remarks at the launch of War Veterans residential stands scheme […]",
            "time": "06:41",
            "date": "21 Feb 2025"
        },
        {
            "title": "Zim’s bold war on superbugs: National action plan 2.0 launched",
            "url": "https://www.herald.co.zw/zims-bold-war-on-superbugs-national-action-plan-2-0-launched/",
            "content": "Rumbidzayi Zinyuke-Senior Health Reporter\n\nZimbabwe has launched an aggressive fight against antimicrobial resistance (AMR), a hidden yet lethal crisis that has already claimed thousands of lives.\n\nIn 2019 alone, more than 15 000 people succumbed to drug-resistant infections, highlighting the urgent need for action.\n\nYesterday, the Government and its partners launched the second National Action Plan for AMR (2024-2028), setting the tone for the country to address the growing threat of AMR through a comprehensive One Health approach.\n\nThe One Health approach recognises the interconnectedness of human, animal, and environmental health.\n\nWith support from the UK government, through the Fleming Fund phase 2 that has committed 2,5 million, Zimbabwe will expand surveillance, strengthen regulations, and promote responsible use of antimicrobials in healthcare and agriculture.\n\nSpeaking at the launch, Health and Child Care Minister Dr Douglas Mombeshora said if unchecked, AMR could cost Zimbabwe up to 7 percent of its Gross Domestic Product by 2050.\n\nIf we dont act now, the cost will be devastatingnot just in lives lost but in livelihoods destroyed, families torn apart, and opportunities missed, he said.\n\nAMR doesnt respect borders; it doesnt care about wealth or privilege. It threatens us all. Its fuelled by the misuse of antimicrobials in healthcare, on our farms, and even in our environment.\n\nIf we do nothing, by 2050, this crisis could claim 10 million lives annually and cut global GDP by trillions. Here at home, the stakes are high, not to mention the strain it will place on our healthcare system and our farmers. But this is not a time for despair; its a time for action.\n\nThe first National Action Plan, which ran from 2017 to 2022, supported the provision of essential medicines and services in health and animal institutions as well as the introduction of AMR modules in nursing curricula, among many other activities.\n\nDr Mombesora said the new plan was built on five pillars that would guide the national response to AMR.\n\nThese included raising awareness, strengthening surveillance systems, promoting prevention practices, optimising antimicrobial use and fostering research and innovation.\n\nThe 2024-2028 National Action Plan is bolder, smarter, and more inclusive. It adopts the One Health approach, which recognises that human, animal, and environmental health are deeply connected.\n\nThis plan is about bringing everyone to the tablehealthcare workers, farmers, scientists, and policymakersto tackle AMR together, he said.\n\nDr Mombesora said the Government would ensure the successful implementation of the plan through the provision of human and financial resources to supply essential medicines and consumables for the populace and animals.\n\nThe Fleming Fund Grant II aims to address gaps in surveillance and the use of data generated for policy-making.\n\nAs Zimbabwe, we are grateful to our development partners who have been providing technical and financial support to the implementation of activities to mitigate AMR.\n\nFellow Zimbabweans, this is our moment to rise to the occasion. Let us commit to this plan, not just in words but in action. Let us show the world what Zimbabwe can achieve when we come together with purpose and resolve, said Dr Mombeshora.\n\nLands, Agriculture, Fisheries, Water and Rural Development Minister, Dr Anxious Masuka, who was represented by the Chief Director Veterinary Department, Dr Pious Makaya, said the launch of the second Plan was a pivotal moment in the collective fight against AMR.\n\nOver the past five years, we have made strides in improving our surveillance systems, building laboratory capacity, and strengthening the overall one-world effort.\n\nAs we launch the NAP 2, we move forward with renewed energy and purpose. We build on the lessons learned and the challenges faced during the first phase, and we invest in the new opportunities and collaborations that are emerging, he said.\n\nDr Mombeshora commended the collaborative approach used in the fight against AMR.\n\nMinister of Environment, Climate and Wildlife Dr Sithembiso Nyoni, who was represented by deputy director in the Ministry, Mr Abu Matiza, recognised the critical role the environment plays in the maintenance and strength of AMRs.\n\nAntimicrobial residues in our ecosystems stemming from various sources can contribute significantly to the development of resistance.\n\nThe environment is a reservoir of antimicrobial-resistant microbes and pathogens. Ensuring this reservoir does not sieve or pass on these microbes is critical in guaranteeing the success of environmental solutions in addressing the antimicrobial resistance threat, she said.\n\nFood and Agriculture Organisation sub-regional coordinator for southern Africa and representative for Zimbabwe, Eswatini and Lesotho Dr Pratrice Talla said the integration of AMR into agri-food policies was crucial to ensuring that antimicrobial use in livestock, aquaculture and crop production was both responsible and sustainable.\n\nZimbabwes livestock sector plays a vital role in the national economy and rural livelihoods, with a significant proportion of rural households keeping poultry, which serves as a safety net for food security and income generation.\n\nHowever, the misuse and overuse of antimicrobials in poultry and livestock farming can accelerate the spread of resistant pathogens, threatening both animal and human health, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Health-and-Child-Care-Minister-Dr-Douglas-Mombeshora--680x380.jpg",
            "description": "Rumbidzayi Zinyuke-Senior Health Reporter Zimbabwe has launched an aggressive fight against antimicrobial resistance (AMR), a hidden yet lethal crisis that has already claimed thousands of lives. In 2019 alone, more than 15 000 people succumbed to drug-resistant infections, highlighting the urgent need for action. Yesterday, the Government and its partners launched the second National Action […]",
            "time": "06:41",
            "date": "21 Feb 2025"
        },
        {
            "title": "Editorial Comment: National Youth Day chance to stress national development",
            "url": "https://www.herald.co.zw/editorial-comment-national-youth-day-chance-to-stress-national-development/",
            "content": "Today is National Youth Day with the maincelebration being held in Bulawayo, and both the name of the day and venue for this years central celebration are important.\n\nThe day only became a public holiday under the Second Republic, and President Mnangagwa has stressed the national nature of the day from its inception.\n\nIn one sense, the choice of Bulawayo is doubly symbolic of the national nature of the holiday. While it is useful for a February holiday to choose a location where it is easy to find venues that allow gatherings if it rains, the Second Republic has been determined to rotate the main national occasions round the country to emphasise both their national nature and that all parts of Zimbabwe are included in the concept.\n\nThe main reason for a national day, and the associated public holiday, is to concentrate attention on our young people, their needs and their expectations, and to celebrate their accomplishments.\n\nThe younger generations are a majority of the population, so they are important, and the future of Zimbabwe will fairly obviously be built around what they do and what they do not do. So it is very important that what they do is productive and constructive and that they do not drift into the self-destruction of drugs and alcohol abuse.\n\nA lot has been done since Independence and is still being done to ensure that all children have a full primary education and at least four years of secondary education. Curriculums are being adjusted to make this basic education more effective and to introduce a great deal more relevance to studies and ensure that all children, regardless of examination results, have a decent base on which to further their training and skills.\n\nWhile the same post-Independence thrust saw a rapid and dramatic expansion in university and polytechnic education, this still left a lot of young people behind.\n\nA lot of tertiary education requires in practice A-Level, although technically a very good O-Level certificate is the minimum for many non-degree diploma and higher diploma courses.\n\nSo what about the rest, the majority, of the youth. Here the Second Republic has been active with the rapid expansion of vocational training and making sure the training centres are dispersed to they are practically accessible.\n\nNow, more is being done to measure the skills that people learn, so that future customers, and bankers, of those who set up their own businesses know who they are dealing with, and future employers have an idea of what they might be hiring.\n\nObviously a lot more needs to be done in this regard, to build on President Mnangagwas declarations that no person and no place must be left behind as Zimbabwe advances. But at least we are now headed in the right direction, and a lot more effort and attention is being directed at ensuring that there are advances.\n\nThe importance is that all young people as they leave school are now being catered for and are seeing opportunities opening up.\n\nThe creation of a dedicated Ministry of Youth Empowerment, Development and Vocational Training highlights the decisions to turn rhetoric into practical programmes with its own slice of the national budget and with officials all having their accomplishments measured in another of President Mnangagwas policies, that political leaders and officials all have to deliver.\n\nA lot has been spoken about the dangers youths face, with drugs and alcohol topping many lists, and young girls in danger of forced marriages while still in their teens. Effective programmes are already in place, and being made better and expanded, to deal with these menaces. But a lot of the temptations and pressures would be dramatically reduced if all youths could get ahead and earn a reasonable income.\n\nWe have noted comments coming from parents and community leaders when investors in a particular area hire local youths where possible, or when the contractors for major infrastructure contracts hire local youths. Comments tend to centre on the fact that their young adult children are highly unlikely to be taking drugs if they are gainfully employed.\n\nLike most developing countries Zimbabwe at the moment has a demographic dividend. The falling birth rates in recent decades, and the far lower size of the population in the past, means that the percentage of the population who are too old to work or are still children is low compared to what we see in most developed countries. We have what is known as a low theoretic dependency ratio.\n\nWith a significant majority of the population in what are seen as the working years of most peoples lives, it is essential for our development that all those in that long gap between childhood and old age are in fact productive and building the wealth of the nation as well as earning their own living and supporting their families.\n\nThis is another point that needs stressing, that we need our youth to be productive, and for that matter paying their share of taxes out of that production, if our economy is to keep growing, and that means there are national needs, as well a human needs, to making sure that every youth is equipped to be productive.\n\nSo the concentration of thought that we hope we will see through our National Youth Day is a major requirement for a better, more prosperous and more equitable Zimbabwe.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/President-Mnangagwa-4.jpg",
            "description": "Today is National Youth Day with the main  celebration being held in Bulawayo, and both the name of the day and venue for this year’s central celebration are important. The day only became a public holiday under the Second Republic, and President Mnangagwa has stressed the national nature of the day from its inception. In […]",
            "time": "06:41",
            "date": "21 Feb 2025"
        },
        {
            "title": "Debt clearance key to grow Zim economy: WB",
            "url": "https://www.herald.co.zw/debt-clearance-key-to-grow-zim-economy-wb/",
            "content": "Tapiwanashe Mangwiro-Senior Business Reporter\n\nArrears clearance and debt resolution rank among critical issues Zimbabwe should address to guarantee sustained economic growth, according to the World Banks latest report.\n\nFull resolution of the issue would not only drive growth but also help create an environment attractive to investors, the multilateral lender said.\n\nZimbabwes economic trajectory hinges on resolving macroeconomic challenges, particularly through arrears clearance and prudent debt management, the bank noted.\n\nThese measures are pivotal in redirecting resources to high-productivity sectors and catalysing private sector investment, which are imperative for sustained economic expansion.\n\nHigh inflation and exchange rate volatility have hampered sustainable economic growth, limiting much-needed private investment and diminishing resources.\n\nThe accumulation of public debt arrears has limited Zimbabwes access to external financing and kept public investment at low levels, further negatively impacting growth.\n\nAs such, addressing price and exchange rate volatility and public debt arrears is a necessary condition for economic growth and job creation, the World Bank added.\n\nEconomic analysts share similar sentiments, saying addressing the challenges head-on is a fundamental prerequisite for fostering an environment conducive to robust economic growth.\n\nClearing public debt arrears is not just about financial stability, it is about unlocking new avenues for investment and development, said Mr Peter Kaunda, chief operations officer of Travis and Denham, an investment firm.\n\nInvestors are eagerly awaiting these reforms, which would mitigate risk perceptions and stimulate substantial inflows of both public and private capital.\n\nAs of January 2025, Zimbabwes total public debt was estimated at US$21 billion, representing a debt-to-GDP ratio of 97 percent, leaving the country with limited financial capacity for its development needs.\n\nOf the US$21 billion, external debt owed to bilateral and multilateral creditors totalled US$12,3 billion. Zimbabwes biggest multilateral creditors include the World Bank, which is owed US$1,5 billion, the African Development Bank Group US$760 million, and the European Investment Bank US$427 million.\n\nThe countrys domestic debt stands at US$8,7 billion.\n\nTo address the debt issue, the Government established the Structured Dialogue Platform, a collaborative effort between Zimbabwe and international financial institutions to resolve the countrys debt situation.\n\nThis platform is already working to chart a course towards comprehensive debt restructuring to reopen access to cheaper and long term international financing.\n\nSufficient progress across the three pillars of the Structured Dialogue Platform would allow Zimbabwe to fully re-engage with multilateral financial institutions and provide significant amounts of new funding to Zimbabwe.\n\nAfter nearly two years of dialogue with development partners, Zimbabwe is looking to accelerate the arrears clearance and debt resolution process by working with the International Monetary Fund (IMF) under a staff-monitored programme (SMP).\n\nThe SMP falls under the economic reforms Zimbabwe is undertaking as part of the process to clear its US$21 billion public debt and arrears.\n\nAddressing the sixth Structural Dialogue Platform in November 2024, President Mnangagwa expressed support for the IMF programme and called for provisional financial support to protect vulnerable groups of the population that will be negatively affected.\n\nZimbabwe has not been able to access funding from the multilateral lender since the turn of the century due to its arrears position.\n\nIt cannot also get concessional loans from other multilateral lenders due to the pari passu rule, a principle which requires the lenders to treat defaulters the same way.\n\nIn this regard, the protection of the vulnerable groups, through effective social protection programmes is of critical importance to my Government, President Mnangagwa told creditors, development partners, private sector players, civil society organisations and farmers organisations at the high-level dialogue.\n\nAfrican Development Bank President Dr Akinwumi Adesina termed the IMF staff programme a significant milestone towards concretising the arrears clearance and debt resolution.\n\nI would like to urge here that our collective efforts will be critical to ensure that this is a wet-SMP (a supported staff monitored programme) that will provide fiscal space for the country to implement needed reforms and protect the vulnerable populations, said Dr Adesina, who was appointed by President Mnangagwa the Champion of the debt resolution process.\n\nDr Prosper Chitambara, an economist noted, The dialogue has laid out a clear roadmap for Zimbabwe to address its external debt obligations methodically.\n\nSuccessful implementation will not only restore Zimbabwes creditworthiness but also catalyse significant injections of concessional financing, critical for achieving sustainable growth targets.\n\nCentral to this strategy is Zimbabwes Vision 2030, a series of economic milestones the country must achieve through inclusive economic transformation and poverty alleviation.\n\nWith arrears clearance and debt resolution at its core, Vision 2030 envisions a future where robust public and private investments drive tangible socio-economic progress across all sectors.\n\nVision 2030 hinges on our ability to secure affordable external credit lines and stimulate domestic investment, Mr Kaunda said.\n\nThrough clearing arrears and resolving debt issues, we are positioning Zimbabwe as a magnet for global capital, ushering in an era of unprecedented growth and prosperity.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Dept-graph-680x380.jpg",
            "description": "Tapiwanashe Mangwiro-Senior Business Reporter Arrears clearance and debt resolution rank among critical issues Zimbabwe should address to guarantee sustained economic growth, according to the World Bank’s latest report. Full resolution of the issue would not only drive growth but also help create an environment attractive to investors, the multilateral lender said. “Zimbabwe’s economic trajectory hinges […]",
            "time": "06:41",
            "date": "21 Feb 2025"
        }
    ]
}