{
    "news": [
        {
            "title": "ZICC reinforces transparency in security sector",
            "url": "https://www.herald.co.zw/zicc-reinforces-transparency-in-security-sector/",
            "content": "Obey Musiwa\n\nHerald Reporter\n\nThe Zimbabwe Independent Complaints Commission (ZICC) is making headway in its mandate to investigate complaints of misconduct against members of the security sector.\n\nThe Commission is taking shape through capacity building and recruitment of key personnel, including investigators and legal officers.\n\nSpeaking at a strategic planning workshop held in Darwendale, ZICC chairperson Justice Webster Chinamora said they handle complaints in a transparent and fair manner.\n\nThe Commission is mandated to ensure that there is a fair mechanism for receiving complaints from members of the public, he said.\n\nEstablished by the Constitution of Zimbabwe, the Commission aims to provide an effective and independent mechanism for addressing public grievances.\n\nWe investigate those complaints with an open-mind, without prejudging any issues, and making appropriate recommendations.\n\nAnd those recommendations include, in deserving cases, referral for prosecution by the National Prosecution Authority, he said.\n\nHe emphasised the importance of stakeholder collaboration.\n\nAs a Commission, we are guided by the need to improve national and human security through fair, timely and transparent handling of complaints.\n\nWe are, at this stage, in the process of developing the necessary tools that will enable us to receive complaints.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Justice-Webster-Chinamora.jpg",
            "description": "The Zimbabwe Independent Complaints Commission (ZICC) is making headway in its mandate to investigate complaints of misconduct against members of the security sector.",
            "time": "18:10",
            "date": "17 Mar 2025"
        },
        {
            "title": "Rwanda cuts diplomatic ties with Belgium, expels diplomats amid rising tensions",
            "url": "https://www.herald.co.zw/rwanda-cuts-diplomatic-ties-with-belgium-expels-diplomats-amid-rising-tensions/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nRwanda has officially severed diplomatic relations with Belgium, ordering all Belgian diplomats to leave the country within 48 hours.\n\nThe Rwandan government announced the decision today citing Belgiums alleged interference in regional affairs and its historical role in fuelling instability.\n\nIn a statement, Rwandas Ministry of Foreign Affairs and International Cooperation accused Belgium of engaging in pitiful attempts to sustain its neocolonial delusions and taking sides in the ongoing conflict in the Democratic Republic of Congo (DRC).\n\nBelgium has consistently undermined Rwanda, both well before and during the ongoing conflict in the DRC, in which Belgium has a deep and violent historical role, especially in acting against Rwanda, reads the statement.\n\nThe Rwandan government further alleged that Belgium was systematically mobilising against Rwanda in different forums and accused Brussels of harbouring groups that propagate genocide denial.\n\nThis decision reflects Rwandas commitment to safeguarding our national interests and the dignity of Rwandans, as well as upholding the principles of sovereignty, peace, and mutual respect, reads the statement.\n\nThe diplomatic fall-out comes amid heightened tensions in the Great Lakes region, with Rwanda facing accusations of backing M23 rebels in eastern DRCclaims that Kigali denies.\n\nThe rift also follows Rwandas suspension of its development cooperation agreement with Belgium earlier this year, after accusing its former colonial power of politicising aid.\n\nBelgium has not yet issued a formal response.\n\nAs Rwanda enforces its expulsion order, diplomatic observers warn that the severing of ties could further strain international efforts to mediate peace in the DRC.\n\nThe move also marks a significant escalation in Rwandas long-standing grievances with Belgium, whose colonial legacy remains a point of contention in Rwandan politics.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/09/1709-1-1-KAGAME.jpg",
            "description": "Rwanda has officially severed diplomatic relations with Belgium, ordering all Belgian diplomats to leave the country within 48 hours.",
            "time": "18:10",
            "date": "17 Mar 2025"
        },
        {
            "title": "President meets Tanzanian envoy",
            "url": "https://www.herald.co.zw/president-meets-tanzanian-envoy/",
            "content": "Zvamaida Murwira\n\nSenior Reporter\n\nSadc Chairperson, President Mnangagwa is meeting Tanzanian Foreign Affairs and East Africa Cooperation Minister, Ambassador Thabit Mahmoud Kombo at State House in Harare.\n\nAmbassador Kombo, a special envoy for Tanzanian President Samia Suluhu Hassan, is expected to deliver a message from her.\n\nPresident Hassan is Sadc chairperson for the Organ of Politics, Defence and Security Cooperation.\n\nThe two are currently holding bilateral talks.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/b9a5b3b6-5f63-4ade-8081-c3e427074c6d-680x380.jpeg",
            "description": "Sadc Chairperson, President Mnangagwa is meeting Tanzanian Foreign Affairs and East Africa Cooperation Minister, Ambassador Thabit Mahmoud Kombo at State House in Harare.",
            "time": "18:10",
            "date": "17 Mar 2025"
        },
        {
            "title": "Judgment reserved in Blessed Mhlanga’s case",
            "url": "https://www.herald.co.zw/judgment-reserved-in-blessed-mhlangas-case/",
            "content": "Fidelis Munyoro\n\nJudgment has been reserved in the matter involving Alpha Media Holdings (AMH) news reporter Blessed Mhlanga, who stands accused of transmitting messages alleged to incite public violence.\n\nThis follows the conclusion of submissions by both the defence and the prosecution.\n\nMhlanga sought relief from the High Court after being denied bail by the Magistrates Court.\n\nThe Magistrates Court found that granting bail posed a risk of witness interference.\n\nDuring proceedings, Justice Gibson Mandaza dismissed the defences request to introduce electronic evidence, which the defence argued was essential to support Mhlangas bail application.\n\nThe court ruled that releasing and reviewing such evidence at this stage would amount to pre-trial conduct.\n\nJustice Mandaza said such evidence would only be considered during the trial phase.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/04/Blessed-Mhlanga.jpg",
            "description": "Fidelis Munyoro Judgment has been reserved in the matter involving Alpha Media Holdings (AMH) news reporter Blessed Mhlanga, who stands accused of transmitting messages alleged to incite public violence. This follows the conclusion of submissions by both the defence and the prosecution. Mhlanga sought relief from the High Court after being denied bail by the […]",
            "time": "18:10",
            "date": "17 Mar 2025"
        },
        {
            "title": "Zanu PF Masvingo starts work on new offices",
            "url": "https://www.herald.co.zw/zanu-pf-masvingo-starts-work-on-new-offices/",
            "content": "George Maponga in Masvingo\n\nZanu PF Masvingo has mobilised resources to build its provincial headquarters.\n\nMobilisatin of building materials for the offices is almost complete after the Special Presidential Investment Advisor to the United Arab Emirates Dr Paul Tungwarara donated 50 000 bricks and 600 bags of cement for the project.\n\nThe offices are being constructed in the Clovelly area on the western side of Masvingo City.\n\nSpeaking on behalf of Dr Tungwarara, Masvingo Provincial Affairs and Devolution Minister Cde Ezra Chadzamira said Zanu PF is now set to have its own permanent home in the province.\n\nMinister Chadzamira said by December this year, the project would have been completed.\n\nZanu PF Masvingo provincial chair Cde Rabson Mavhenyengwa said the project will culminate in the building of a conference centre with the capacity to accommodate 10 000 people.\n\nWe will also have space to hold our inter-district meetings on top of the conference centre that will accommodate 10 000 people. This is a new era for Masvingo, he said.\n\nZanu PF does not have permanent offices in Masvingo and is currently operating from leased premises that serve as the provincial headquarters.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/11867fd2-bc0e-42cb-8fed-621d9af2dda1-680x380.jpeg",
            "description": "Zanu PF Masvingo has mobilised resources to build its provincial headquarters.",
            "time": "18:10",
            "date": "17 Mar 2025"
        },
        {
            "title": "Magwizi highlights infrastructure challenges as Warriors prepare for home match in South Africa",
            "url": "https://www.herald.co.zw/magwizi-highlights-infrastructure-challenges-as-warriors-prepare-for-home-match-in-south-africa/",
            "content": "Sports Reporter\n\nZifa president Nqobile Magwizi today came close to admitting that it is always painful when the Warriors play home matches on foreign land.\n\nThe Warriors face Benin in a Group C World Cup qualifier at Moses Mabidha Stadium in South Africa on Thursday.\n\nMichael Nees charges are expected to hold the first full session on Tuesday when the majority of the foreign-based players join the local-based players that are already in Durban.\n\nMagwizi has since met Harare Mayor Jacob Mafume and got a commitment to get 40 hectares in HighGlen for the construction of a stadium.\n\nIn addition to that, the association will also get a sports club for the Mighty Warriors, while Rufaro and Gwanzura will be refurbished.\n\nYou have shown us an amazing display of grace. One of our key pillars is the issue of infrastructure, Magwizi told Mayor Mafume.\n\nIn the absence of infrastructure, its impossible to implement any of our programmes. We have a shared responsibility for those that love football in Zimbabwe.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Nqobile-Magwizi.jpg",
            "description": "Zifa president Nqobile Magwizi today came close to admitting that it is always painful when the Warriors play home matches on foreign land.",
            "time": "18:10",
            "date": "17 Mar 2025"
        },
        {
            "title": "SADC-EAC joint meeting: Zimbabwe calls for collaborative efforts in restoring peace in DRC",
            "url": "https://www.herald.co.zw/sadc-eac-joint-meeting-zimbabwe-calls-for-collaborative-efforts-in-restoring-peace-in-drc/",
            "content": "Mukudzei Chingwere\n\nHerald Reporter\n\nZimbabwe has underscored the need for collaborative efforts to restore peace in the Democratic Republic of Congo (DRC).\n\nForeign Affairs and International Trade Minister Professor Amon Murwira delivered Zimbabwes position during the Southern African Development Community (SADC) and East African Community (EAC) joint ministerial meeting today.\n\nThe meeting, held in Harare, aims to accelerate the implementation of decisions made at the recent summit in Dar es Salaam, Tanzania, addressing the escalating security and humanitarian crisis in the region.\n\nTodays meeting is both timely and necessary, said Professor Murwira, highlighting the deteriorating situation in the DRC, which has seen increased violence and displacement of thousands of people.\n\nHe called upon all Member States to focus on the broader objectives of peace and security, emphasising that the real battle lies not in armed conflict but in combating poverty and deprivation.\n\nProf Murwiras remarks resonated with the urgency of the situation, as he urged participants to adopt a Pan-Africanist approach.\n\nLet us make Africa the tree of life, not a tree of death and desperation, said Prof Murwira.\n\nHis call for introspection was poignant as he questioned the origins of the weapons fuelling the conflict, urging delegates to consider their collective responsibility in addressing the crisis.\n\nAcknowledging the groundwork laid by senior officials and defence experts from both regions, Prof Murwira expressed hope that the international community will continue to support their efforts.\n\nAs the global spotlight shines on eastern DRC, let us leverage this momentum to achieve lasting peace, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/a20613c9-2c00-41f2-927a-41f56f6d7c73-680x380.jpeg",
            "description": "Zimbabwe has underscored the need for collaborative efforts to restore peace in the Democratic Republic of Congo (DRC).",
            "time": "18:10",
            "date": "17 Mar 2025"
        },
        {
            "title": "Zvishavane miner strikes gold in farming",
            "url": "https://www.herald.co.zw/zvishavane-miner-strikes-gold-in-farming/",
            "content": "Herald Reporter\n\nAs Government works towards getting the country back to being the breadbasket of Africa, Mr Samson Gondwe of Zvishavane is also walking the talk.\n\nMr Gondwe, a well-known gold dealer in Zvishavane, acquired his mining claim around 2012 and started operating Beara Milling Company.\n\nThe 51-year-old miner then decided to diversify his portfolio and applied for a piece of land in 2019.\n\nAfter many years of going underground to look for the precious stone, I decided to venture into farming, but I did not have land.\n\nSo I applied through the Ministry of Lands and Agriculture, and I managed to get almost 100 hectares at Cheshire Estate subdivision 19, said Mr Gondwe, popularly known as Sam Dread in Zvishavane.\n\nMr Gondwe is now rearing cattle, goats, pigs and poultry, while also producing maize, millet and tobacco, etcetera.\n\nI was inspired to get into farming by a war veteran, Cde Masunungure, who was rearing pigs. After I got the land, Cde Masunungure gave me some piglets. I am now supplying pork to butcheries around Zvishavane.\n\nI thank President Mnangagwa and the Government for allowing blacks to own land. Now we are producing for the country.\n\nMr Gondwes urged the Government to intervene and solve the mining claims ownership wrangles, which are affecting most small-scale miners.\n\nHe employs 10 workers at his farming venture.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Untitled-301-680x380.jpg",
            "description": "As Government works towards getting the country back to being the \"breadbasket of Africa,\" Mr Samson Gondwe of Zvishavane is also walking the talk.",
            "time": "18:10",
            "date": "17 Mar 2025"
        },
        {
            "title": "Government managing pest outbreaks",
            "url": "https://www.herald.co.zw/government-managing-pest-outbreaks/",
            "content": "Precious Manomano\n\nThe Government is implementing comprehensive measures to control pests and support farmers.\n\nCurrently, the African armyworm has been reported in every province, prompting Government to set traps in 214 strategically selected sites nationwide.\n\nThis initiative is part of a broader surveillance strategy intended to detect and manage infestations before they cause significant damage to crops.\n\nThe Minister of Lands, Agriculture, Fisheries, Water and Rural Development, Dr Anxious Masuka said efforts to deal with the pests are underway.\n\nWe have distributed chemicals in all 60 districts. Fortunately, its a very common chemical  carbaryl 85-WFP  which anyone can get from the shelf, he said.\n\nThis accessibility empowers farmers to take immediate action when pests are detected.\n\nThe Government has also distributed 600 000 knapsack sprayers.\n\nDr Masuka emphasised the importance of community involvement.\n\nIt takes all of us, the whole sector. Government has done the facilitation and provided resources, but it takes the farmer and every one of us to ensure that the damage is minimised, he said.\n\nDr Masuka said they will continue to scale up the fight against the African armyworm.\n\nWe will assess the severity and the extent of the area that has been devoured by this pest as we do the second round of crop, livestock, and fisheries assessment, which is more quantitative, Dr Masuka said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/06/Anxious-Masuka.jpeg",
            "description": "The Government is implementing comprehensive measures to control pests and support farmers.",
            "time": "18:10",
            "date": "17 Mar 2025"
        },
        {
            "title": "Magwizi pushes for new stadium, head office … Harare avails sports club, land to Zifa … Rufaro, Gwanzura to be refurbished",
            "url": "https://www.herald.co.zw/magwizi-pushes-for-new-stadium-head-office-harare-avails-sports-club-land-to-zifa-rufaro-gwanzura-to-be-refurbished/",
            "content": "Sports Reporter\n\nHarare City Council is set to give the Zimbabwe Football Association (Zifa) 40 hectares and a sports club for the construction of a stadium and headquarters.\n\nMayor Jacob Mafume confirmed the developments after meeting Zifa president Nqobile Magwizi in Harare today.\n\nApart from the HighGlen land deal, the city says it will also partner with the association to ensure that Rufaro and Gwanzura are renovated, among other agreements.\n\nWe will avail one of our sports clubs for the building of the Zifa headquarters. It will go through the committees tomorrow.\n\nWe are also keen to avail one of our sports grounds to Zifa. We want to develop it, the 40-hectare HighGlen Stadium, said Mafume.\n\nThe HighGlen land is designated for the construction of a stadium, according to the citys master plan.\n\nWe are willing to avail that land to Zifa for assistance. We would not want them to give us money, but we would want them to assist us in developing Rufaro and Gwanzura Stadia.\n\nWe will also avail another sports club for the Mighty Warriors and develop that facility. We will also name that facility in due course, said Mafume.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/ZIFA-2.jpg",
            "description": "Harare City Council is set to give the Zimbabwe Football Association (Zifa) 40 hectares and a sports club for the construction of a stadium and headquarters.",
            "time": "18:10",
            "date": "17 Mar 2025"
        }
    ]
}