{
    "news": [
        {
            "title": "Govt ready for  constitutional  amendments . . . Changes to extend Presidential term",
            "url": "https://www.herald.co.zw/govt-ready-for-constitutional-amendments-changes-to-extend-presidential-term/",
            "content": "Farirai Machivenyika-Senior Reporter\n\nJustice, Legal and Parliamentary Affairs Minister Ziyambi Ziyambi yesterday said they are ready to implement constitutional amendments to extend President Mnangagwas term beyond 2028 as resolved by Zanu PF at its Annual National Peoples Conference last year, once they get instructions to do so.\n\nMinister Ziyambi said it was possible to enact the amendments to extend the Presidents term from 2028 to 2030 in line with the peoples wishes.\n\nMy comment is that it is possible to do so (make the amendments) when the time is right, when we get the instructions to do so. We also have to know that Zimbabwe is a democracy guided by the will of the people.\n\nSo, if the people say they want the Presidents term extended, so be it, thats what democracy is all about, he said.\n\nMinister Ziyambi said while President Mnangagwa had said he wanted to step down as required by the Constitution, the people who voted him into office have indicated that they want him to stay on.\n\nOnce the people who voted him into office have spoken, the necessary legal requirements will be put in place. What I can say is it is possible to make the necessary constitutional amendments, Minister Ziyambi added.\n\nLast year at its conference in Bulawayo, Zanu PF made a resolution that the Presidents term be extended so that he can see to fruition the various development projects he has initiated over the past fewyears.\n\nThe main opposition Citizens Coalition for Change has also thrown its weight behind the proposal to extend the Presidents term.\n\nSpeaking during a tour by Parliamentarians of the First Familys Pricabe Farm in Kwekwe at the weekend, leader of the opposition in Parliament, Mr Sengezo Tshabangu, said: If we approve your (President Mnangagwa) stay in power and the people of Zimbabwe are happy, let it be.\n\nMr Tshabangu said President Mnangagwa was leading by example in all areas, hence he must be supported.\n\nWe are Zimbabweans, we should be singing together, playing together, celebrating together. When I walk out of here (Pricabe Farm) I will face criticism and it does not matter because it improves us as Zimbabweans.\n\n. . . when we go to Parliament, I can assure you that we are going to unpack the blueprint to bring the people of Zimbabwe together. We need to coexist and live together, he said.\n\nAcross the country, all Zanu PF structures have voiced their support for President Mnangagwas term extension as he has delivered tangible results that resonate with the masses.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/11/1.jpg",
            "description": "Farirai Machivenyika-Senior Reporter Justice, Legal and Parliamentary Affairs Minister Ziyambi Ziyambi yesterday said they are ready to implement constitutional amendments to extend President Mnangagwa’s term beyond 2028 as resolved by Zanu PF at its Annual National People’s Conference last year, once they get instructions to do so. Minister Ziyambi said it was possible to enact […]",
            "time": "09:27",
            "date": "15 Jan 2025"
        },
        {
            "title": "‘President bridges gap between ruling party, opposition’",
            "url": "https://www.herald.co.zw/president-bridges-gap-between-ruling-party-opposition/",
            "content": "Wallace Ruzvidzo-Herald Reporter\n\nPOLITICAL analysts say President Mnangagwas open-door policy has united Zimbabweans towards a productive and developmental path that is a turning point for the countrys once polarised political landscape.\n\nOn Sunday, in a first-of-its-kind show of unity, parliamentarians from across the political divide visited the First Familys Pricabe Farm for a familiarisation tour.\n\nAnalysts said this was a demonstration of maturity in the countrys once-fractious politics.\n\nA majority of opposition legislators attended the tour, with a few who did not participate sending their apologies.\n\nPolitical commentators applauded this show of unity, saying politics in Zimbabwe had indeed come of age.\n\nGovernment critic and former Cabinet Minister Professor Jonathan Moyo, who is living in self-imposed exile, described the opposition MPs visit to Pricabe Farm as ice-breaking.\n\nGiven their number in Parliament, it turns out that contrary to earlier false reports, the attendance of 34 CCC legislators at yesterdays (Sunday) ground-breaking tour of President Mnangagwas Precabe Farm by MPs from across the political divide was significant and ice-breaking, engagement-wise!, he said.\n\nThe unprecedented visit is in stark contrast to the antagonistic politics before the dawn of the Second Republic in 2017 and flies in the face of oppositional elements who thrive on discord.\n\nPolitical analyst Mr Godwine Mureriwa said the uniting of all political players in the country had been something President Mnangagwa had always wanted and has now achieved.\n\nFocus, he said, should now shift to the countrys development agenda pursuant to the attainment of Vision 2030.\n\nI think His Excellency President Mnangagwa when he came into power, made sure that he had a mandate to unite the country sothat those in the ruling party, those in opposition formations, can realise that they are Zimbabweans.\n\nBut what is important is that we have to focus on the development agenda, which is key to achieving Vision 2030 that has been set by His Excellency. The vision is not individualistic, it is a vision that the country has to focus on, Mr Mureriwa said.\n\nAnother political analyst, Dr Leopold Chakanyuka, said President Mnangagwa had ushered in a new era of political maturity in Zimbabwes political landscape.\n\nThe visit on Sunday by both Zanu PF and CCC Members of Parliament symbolises the highest level of political maturity that we have attained as a country.\n\nWe can unite where necessary and criticise where necessary, doing it constructively. The visit shows that as Zimbabweans we are pushing towards one common agenda which I think is very important, he said\n\nDr Chakanyuka commended the opposition for forgoing selfish political interests and choosing national development.\n\nWe need to appreciate the opposition for realising that we are Zimbabweans first before we become political parties, he said.\n\nIn his address to the Parliamentarians, President Mnangagwa urged opposition legislators to actively scrutinise and hold the ruling party Zanu PF Members of Parliament to account so that they deliver for the general citizenry.\n\nThe President said the opposition legislators should give their ruling party counterparts a hard time in Parliament to build and develop Zimbabwe.\n\nBecause of his open-door policy, another political analyst Mr Rutendo Matinyarare, said the President had successfully unified political parties in the country.\n\nThis, he said, would see all political players joining forces in the development of the country.\n\nI think that the President has been successfully able to bring unity to the political parties. He is breaking the polarisation that we have seen for many years in our country, uniting different political opponents to make them focus on the national interest and the one goal of building a better Zimbabwe.\n\nI would assume that, that is why some of the opposition members are saying let us hold on and hold off elections while we unite and build our country better to take us forward. I think that is very commendable, Mr Matinyarare said.\n\nHe said President Mnangagwa had demonstrated that he is a unifying leader by giving the legislators an opportunity to get a feel of his successful farming operation.\n\nI think the President has shown a very great sign of leadership. He is showing leadership in terms of farming, showing by example, what land in Zimbabwe is supposed to be used for, he said.\n\nFollowing his election victory last year, the President, in his inauguration speech, said: Now that elections are behind us, we must now focus on addressing the economic challenges facing our country.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/etheh-680x380.jpg",
            "description": "Wallace Ruzvidzo-Herald Reporter POLITICAL analysts say President Mnangagwa’s open-door policy has united Zimbabweans towards a productive and developmental path that is a turning point for the country’s once polarised political landscape. On Sunday, in a first-of-its-kind show of unity, parliamentarians from across the political divide visited the First Family’s Pricabe Farm for a familiarisation tour. […]",
            "time": "09:27",
            "date": "15 Jan 2025"
        },
        {
            "title": "Police target 13 550 unregistered kombis",
            "url": "https://www.herald.co.zw/police-target-13-550-unregistered-kombis/",
            "content": "Freeman Razemba-Crime Reporter\n\nTHE Zimbabwe Republic Police (ZRP) is going after more than 13 500 unregistered kombis and pirate taxis as part of an operation aimed at restoring order in Harare.\n\nReports indicate that there are approximately 16 500 commuter omnibuses operating in the city, with only 2 950 of them registered.\n\nThis information was disclosed at a meeting between police and transport operators, where the focus was on strategies to reduce road carnage and lawlessness.\n\nThe meeting, chaired by Commissioner Bazibi Dube, who is the chief staff officer operations at Police General Headquarters, included key figures such as the Officer Commanding Harare Province, Commissioner Maxwell Chikunguru, national police spokesperson Commissioner Paul Nyathi, and senior police officers.\n\nThe meeting, chaired by Commissioner Bazibi Dube, who is the chief staff officer operations at Police General Headquarters, included key figures such as the Officer Commanding Harare Province, Commissioner Maxwell Chikunguru, national police spokesperson Commissioner Paul Nyathi, and senior police officers.\n\nTransport operators from various bus companies, Zimbabwe Public Transport Organisation (ZPTO) chairman Dr Sam Nhanhanga, his deputy Dr Leonard Mukumba, and Greater Harare Association of Commuter Operators (GHACO) chairman, Mr Ngoni Katsvairo, also attended the meeting.\n\nThe ongoing safety operation targets drivers causing congestion, picking passengers at unauthorised points, creating imaginary lanes, and driving against traffic.\n\nUnregistered public service vehicles, including kombis and mushikashika operating without permits or vehicle fitness certificates, are also under scrutiny.\n\nFor kombis to operate on the roads, they require an operators licence, registration plates, third plate, ZINARA licence, vehicle insurance, and passenger insurance.\n\nThey must also have a certificate of fitness, a City of Harare permit, RMT route authority, City of Harare Rank Disc and Tax Clearance Certificate.\n\nTransport operators from various bus companies, Zimbabwe Public Transport Organisation (ZPTO) chairman Dr Sam Nhanhanga, his deputy Dr Leonard Mukumba, and Greater Harare Association of Commuter Operators (GHACO) chairman, Mr Ngoni Katsvairo, also attended the meeting.\n\nMany non-compliant kombis are reportedly diverting to less-used side roads to evade police checks, while compliant vehicles follow designated routes and pass through checkpoints with minimal delays.\n\nWe have noted that we have 16500 kombis but only 2 950 meet the requirements. We embarked on this operation upon identifying a significant problem. It is a multi-phase initiative aimed at enforcing traffic laws. While we have made progress, there is still much work to be done. This operation is not limited to a specific timeframe; it will persist as long as violations occur, said Comm Dube.\n\nAnd so far, I can safely say a milestone has been achieved, though not happily expected. Sadly, I heard from social media that some were saying, the operation will run up to the 25th of January. May I inform the nation that this operation is there to stay. It is there to stay for as long as we have these violations that are taking place on the ground.\n\nHe expressed concern over reports of corrupt activities involving kombi crews and police officers, warning that the law would be enforced against anyone involved in such practices.\n\nOn his part, Comm Chikunguru reiterated the importance of the meeting, saying it provided an opportunity to update operators on police plans and collaborate to tackle existing challenges.\n\nFirstly, I would like to draw your attention to our ongoing operation against mushikashika. We are resolute in our determination to restore orderliness and sanity in the manner in which passengers are picked up and dropped off. Let me be clear: we will take a no-mercy stance against those who continue to disregard designated bus termini. I urge you all to comply with the regulations and use the designated bus termini to ensure your safety, he said.\n\nComm Chikunguru said they had intensified their traffic enforcement efforts in the city, with the primary focus to remove unroadworthy vehicles from the roads.\n\nThis means that all vehicles, including passenger transport vehicles, that are unfit for road use risk being impounded.\n\nWe urge you to ensure that your vehicles meet the required safety standards to avoid any disruptions to your operations.\n\nThirdly, I am compelled tocomment on the conduct of some of our drivers and conductors. Its alarming to note that some drivers engage in reckless behaviour, posing a significant threat to the safety of passengers and other road users. This behaviour is unacceptable and will not be tolerated.\n\nWe urge you to take immediate action to address this issue and ensure that your drivers and conductors adhere to the highest standards of professionalism and safety, Comm Chikunguru said.\n\nHe said the Police Service also has a zero tolerance to corruption and that the law will not spare anyone involved in such acts.\n\nComm Nyathi underscored the need for operators to obey traffic regulations and ensure their vehicles are properly registered.\n\nRepresenting transporters, Dr Nhanhanga said the meeting sought to find solutions to reduce road accidents and enhance safety.\n\nHe called for measures to curb rampant corruption on the roads, highlighting ongoing engagements with the Ministry of Transport to deploy law enforcement officers at bus terminuses for inspections.\n\nGHACO chairman Mr Katsvairo noted their associations discussions with Harare City Council regarding illegal pick-up points used by pirate taxis, which contribute to corruption.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Chief-of-Staff-Operations-at-Police-General-Headquarters-Commissioner-Dr-Bazibi-Dube-centre-680x380.jpg",
            "description": "Freeman Razemba-Crime Reporter THE Zimbabwe Republic Police (ZRP) is going after more than 13 500 unregistered kombis and pirate taxis as part of an operation aimed at restoring order in Harare. Reports indicate that there are approximately 16 500 commuter omnibuses operating in the city, with only 2 950 of them registered. This information was […]",
            "time": "09:27",
            "date": "15 Jan 2025"
        },
        {
            "title": "Govt completes teacher training on Heritage-Based 5.0 curriculum",
            "url": "https://www.herald.co.zw/govt-completes-teacher-training-on-heritage-based-5-0-curriculum/",
            "content": "Remember Deketeke and Obey Musiwa-Herald Reporters\n\nGOVERNMENT says it will complete the training of teachers on the new the Heritage-Based 5.0 Curriculum (HBC) by February, ensuring they are prepared to implement it in their respective schools.\n\nThis was said yesterday by Primary and Secondary Education Minister Torerayi Moyo while touring schools within Harare on the opening day.\n\nMinister Moyo toured three schools  Shingai Primary School in Chitungwiza, Borrowdale Primary School and Churchill Boys High School in Harare.\n\nThe Minister, a teacher by profession, rolled back the years, as he took students at Churchill Boys High through classes.\n\nMinister Moyo engaged Upper Six Arts students in a lively discussion about the French Revolution, encouraging active participation and making the historical events come alive for the class.\n\nFurthermore, he assigned group projects to the learners, supervising their work and marking their responses as they presented in front of the class which fostered collaboration and deepened their understanding of the subject.\n\nThe training of teachers on the new The Heritage-Based 5.0 Curriculum starts at the district level and then to clusters until it reaches individual schools, said Minister Moyo.\n\nSince the training has already started, we do not need more than two months to completely finish the training process, by February all the teachers within the country would have been trained in the HBC.\n\nMinister Moyo said from their assessment, all schools were ready for the new term.\n\nOur observations indicate that all schools are 100 percent ready for opening. We have observed that all schools have their schemes of work in place. Lessons began promptly at 7:30am, and significant progress has been made. Teachers have also engaged in lesson planning, especially concerning the new heritage-based curriculum.\n\nHe was impressed with the level of planning, as teachers had integrated new teaching approaches, reflecting their hard work.\n\nMinister Moyo applauded the 2024 results at the schools he toured, with Shingai Primary School achieving 87 percent, Borrowdale Primary School 95 percent and Churchill High School attaining a 95 percent pass rate in their A-level results.\n\nHe urged schools to sustain their hard work and to focus not only on planning but also on cleanliness and adherence to standard operating procedures.\n\nIn light of the cholera outbreaks in Mashonaland Central, the Minister said it is essential to ensure that all schools have running water and protective measures to fight the disease.\n\nMinister Moyo said the ministry is going to launch investigations into schools that have been reported by parents for violating Governments Statutes.\n\nHead of Borrowdale Primary school, Mr Charles Chisekombwachevana, said the school is fully prepared, having started the implementation of the HBC last year with Grades ECD up to Grade 5 already learning it.\n\nHe said the only exception is Grade 7, which is continuing with last years curriculum.\n\nAs for teacher training on HBC, Mr Chisekombwachevana said most have been trained.\n\nOne teacher completed a full three-day training, while I attended a one-day session and have been coaching the staff on HBC. Although more training is needed, we are actively progressing and have already begun the implementation, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Minister-Moyo-at-Churchill-Boys-High-School-680x380.jpg",
            "description": "Remember Deketeke and Obey Musiwa-Herald Reporters GOVERNMENT says it will complete the training of teachers on the new the Heritage-Based 5.0 Curriculum (HBC) by February, ensuring they are prepared to implement it in their respective schools. This was said yesterday by Primary and Secondary Education Minister Torerayi Moyo while touring schools within Harare on the […]",
            "time": "09:27",
            "date": "15 Jan 2025"
        },
        {
            "title": "High Court opens with 165 murder cases",
            "url": "https://www.herald.co.zw/high-court-opens-with-165-murder-cases/",
            "content": "Bulawayo Bureau\n\nTHE High Court opened for the 2025 legal year on Monday, with 165 murder cases scheduled for trial in Bulawayo and the Gweru circuit.\n\nAmong the cases to be heard during the first term is the trial of two Beitbridge-based police officers accused of killing a suspect, dismembering his body, and hiding the remains under a bridge to cover up their alleged crime.\n\nThe officers, Xander Siyasayi and Daniel Peyan, reportedly detained and killed Blessing Nare in 2021 after cash went missing from a bottle store in Toporo Village.\n\nThe court will also hear the case of three armed robbery suspects linked to a series of robberies and the murder of Lobengula West businessman, Langelihle Dube, in June 2022.\n\nThe suspectsBrian Moyo alias Smally, Lucky Sibanda alias Makhekhe, and Kelvin Njabulo Dubeallegedly attacked Mr Dube at his home, leaving him for dead and stealing cellphones and US$25.\n\nAnother high-profile case involves three Beitbridge-based Zimbabwe National Army members accused of fatally shooting Zion Christian Church (ZCC) worshipper Jervas Masvina in July 2019. Masvina and other worshippers were holding an all-night prayer in a bushy area along the Limpopo River when the incident occurred.\n\nThe court will preside over the case of Ndabayezulu Ncube of Gwanda, accused of killing his wife, Nokuthula Khumalo, in June 2017. Ncube allegedly struck his wife with a hoe after she reportedly denied him conjugal rights.\n\nIn the Midlands Province, 82 murder cases are set to be heard by five High Court judges during the 2025 circuit. Two judges will handle 35 cases in Gokwe, while three judges will oversee 47 cases in Gweru. The circuit begins on January 20 and is expected to run for two weeks.\n\nTo ensure a smooth process, arrangements have been made for transport and witness quarters in both Gweru and Gokwe.\n\nThis deployment is a significant move to address the backlog of murder cases in the region.\n\nMidlands provincial public prosecutor, Mr Samuel Pedzisayi, said a team of five High Court judges will preside over the provinces first term of the 2025 High Court circuit.\n\nThree judges will be deployed for Gweru and two for Gokwe. There are no high-profile cases, said Mr Pedzisayi.\n\nHe said when the High Court sat last term, they managed to complete 137 cases.\n\nSpeaking at the official opening of the 2025 legal year in Bulawayo, Chief Justice Luke Malaba, expressed concern over the high number of unresolved murder cases in the Midlands.\n\nHe noted that the Bulawayo High Court had to sit on circuit in Gweru to clear 137 cases last year.\n\nThe Chief Justice said the high number of murder cases in the Midlands prompted the JSC to set up an extraordinary circuit as the public was now losing confidence in the justice system.\n\nStakeholders brought to my attention the high number of murder cases in the Midlands province which were taking too long to be finalised by the High Court in Bulawayo. The numbers were so high that sooner than later the public was likely to lose confidence that the courts could protect them, he said.\n\nIt became necessary for the Office of the Chief Justice to intervene. I directed the setting up of an extraordinary High Court circuit session in the Midlands Province which saw the deployment of five judges in the province to deal with the murder cases.\n\nChief Justice Malaba commended the judiciary and other stakeholders for their efforts.\n\nA total of 137 cases were completed. I wrote letters of commendation to the Judge President and all judges who participated in the extraordinary circuit sitting. Collaboration among the judiciary, prosecutors, legal practitioners, and police ensured the wheels of justice were not derailed, he said.\n\nUntil now I have not found the appropriate occasion to also thank the Prosecutor General and her team; the Law Society of Zimbabwe and through it, all legal practitioners who participated by representing accused persons either through the pro-deo appointment system or after being engaged as practitioners of choice by their clients, the Commissioner-General of the Zimbabwe Republic Police and all officers under his command.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/01/Malaba.jpg",
            "description": "Bulawayo Bureau THE High Court opened for the 2025 legal year on Monday, with 165 murder cases scheduled for trial in Bulawayo and the Gweru circuit. Among the cases to be heard during the first term is the trial of two Beitbridge-based police officers accused of killing a suspect, dismembering his body, and hiding the […]",
            "time": "09:27",
            "date": "15 Jan 2025"
        },
        {
            "title": "PAP lobbies for sanctions removal",
            "url": "https://www.herald.co.zw/pap-lobbies-for-sanctions-removal/",
            "content": "Wallace Ruzvidzo-Herald Reporter\n\nThe Pan-African Parliament (PAP) will despatch a delegation to lobby countries that are maintaining illegal economic sanctions on Zimbabwe to remove them.\n\nThis was said by PAP president Chief Fortune Charumbira, who paid a courtesy call on Foreign Affairs and International Trade Minister Professor Amon Murwira at his Munhumutapa offices yesterday.\n\nHe said PAP stood behind Zimbabwe in calling for the unequivocal removal of sanctions, hence the gesture.\n\nOne issue that we discussed with the Minister is the resolution by the Pan-African Parliament to send a delegation of Pan-African Parliament MPs representing the continent. It will be a small delegation, but representing all the five regions of this continent to visit those countries that have imposed sanctions on Zimbabwe and impress upon them that these sanctions are retrogressive.\n\nThese sanctions do not benefit anyone, including those who are imposing them. And the effects on this country are indeed, as you know, illegal, unfair, and that we condemn them.\n\nSo, Pan-African Parliament condemned the sanctions, and we are sending a delegation across those countries that continue to impose sanctions, he said.\n\nProf Murwira said Zimbabwe was a Pan-African country, as enshrined in the law of the land.\n\nAs such, the country was committed to supporting PAP in its endeavours.\n\nZimbabwes posture towards Africa in the Pan-African Parliament is governed by our own constitution. Section 12, subsection 2 of our constitution makes it mandatory that we are Pan-African and by that, our disposition towards the Pan-African Parliament is that of absolute and maximum support to the best that we can as a country.\n\nTherefore, the visit and the updates that were being given by Senator Chief president Charumbira are very important for us to shape how we can contribute meaningfully to the progress of the Pan-African Parliament as a Pan-African institution, he said.\n\nSanctions imposed on Zimbabwe, said Prof Murwira, were a violation of the countrys rights.\n\nAnd again, it is very important that the peaceful co-existence of Zimbabwe within the international world and the peaceful resolution of conflicts across the world is also constitutionally mandated as part of our posture to the world as Zimbabwe.\n\nSo that is why we were discussing about conflicts, how to prevent those conflicts, how to respect the laws that govern international relations, including these issues that we have been talking about, issues of illegal sanctioning.\n\nBecause as you know, again, section 12, subsection 1 of the constitution, Zimbabwe upholds the tenets of international law.\n\nAnd any violation of that is basically a violation of Zimbabwes rights, and we speak against it from a legal and a constitutional point of view, he said.\n\nThe Foreign Affairs Minister said Zimbabwe was committed to playing its role in advancing peace and prosperity initiatives on the continent.\n\nBut we always say peace and prosperity, integrity of this nation, dignity of this nation for prosperity are the founding values of our foreign policy.\n\nAnd you would know from His Excellency President ED Mnangagwas posture and doctrine is the that of peace, prosperity, doctrine of hard work, doctrine of dignity of the people of Zimbabwe, and within the African continent and the people of Africa.\n\nThat is why we talk about being open for business, that is why we talk about leaving no one and no place behind.\n\nSo, in this case, on the African continent, it is our primary goal to make sure that our relations with Africa, with ourselves, with the Pan African Parliament are of an excellent nature, he said.\n\nWestern countries imposed illegal economic sanctions on Zimbabwe at the turn of the millennium as punishment for the land reform programme that corrected colonial land inequities.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/PAP-president-Chief-Charumbira-and-minister-Murwira-680x380.jpg",
            "description": "Wallace Ruzvidzo-Herald Reporter The Pan-African Parliament (PAP) will despatch a delegation to lobby countries that are maintaining illegal economic sanctions on Zimbabwe to remove them. This was said by PAP president Chief Fortune Charumbira, who paid a courtesy call on Foreign Affairs and International Trade Minister Professor Amon Murwira at his Munhumutapa offices yesterday. He […]",
            "time": "09:27",
            "date": "15 Jan 2025"
        },
        {
            "title": "Muchinguri-Kashiri leaves for Mozambique",
            "url": "https://www.herald.co.zw/muchinguri-kashiri-leaves-for-mozambique/",
            "content": "Columbus Mabika/Zvamaida Murwira-Herald Reporters\n\nDefence Minister Oppah Muchinguri-Kashiri left the country yesterday for Mozambique to attend the inauguration of President-elect Daniel Chapo today.\n\nShe is representing President Mnangagwa, who is on his annual leave.\n\nMinister Muchinguri-Kashiri will join several Heads of State and Government, who are also in Mozambique for the event.\n\nZimbabwe and Mozambique have a long-standing relationship dating back to the days of the liberation struggle when the latter provided rear bases for the formers freedom fighters.\n\nPresident Chapo is Mozambiques fifth President since the country gained independence in 1975.\n\nHe won elections held in October last year, garnering more than 70 percent of the vote against his closest challenger, Mr Venancio Mondlane who got 20 percent.\n\nPresident elect Chapo will succeed President Felipe Nyusi who served two terms in office.\n\nBoth belong to the ruling Frelimo party.\n\nMeanwhile, Pan African Parliament president, Chief Fortune Charumbira, also left the country yesterday for Maputo, Mozambique, for the inaugration of President-elect Chapo.\n\nIn his invitation to Chief Charumbira, Mozambican President Nyusi said his country and PAP enjoy good bilateral relations.\n\nFollowing the validation and proclamation of the results of the 7th Presidential, Parliamentary and Fourth Provincial Assembly election held on October 9, 2024, in which Mr Daniel Francisco Chapo was declared the winner, I am delighted and honoured to extend an invitation to you to attend the inauguration ceremony of His Excellency the President-elect, reads Chief Charumbiras invitation from outgoing President Nyusi.\n\nIn line with the Constitution of the Republic of Mozambique, the inauguration ceremony takes place on the 15th of January 2025 at the Independence Square in the capital city Maputo before Members of the National Assembly, the people and invited dignitaries.\n\nIn view of the excellent partnership and cooperationbetween PAP and our nation, I am confident that you will honour our invitation with your presence at this landmark event in our history of consolidation of democracy and rule of law.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/OM.jpg",
            "description": "Columbus Mabika/Zvamaida Murwira-Herald Reporters Defence Minister Oppah Muchinguri-Kashiri left the country yesterday for Mozambique to attend the inauguration of President-elect Daniel Chapo today. She is representing President Mnangagwa, who is on his annual leave. Minister Muchinguri-Kashiri will join several Heads of State and Government, who are also in Mozambique for the event. Zimbabwe and Mozambique […]",
            "time": "09:27",
            "date": "15 Jan 2025"
        },
        {
            "title": "Small-scale gold miners crucial for economic growth",
            "url": "https://www.herald.co.zw/small-scale-gold-miners-crucial-for-economic-growth/",
            "content": "Farirai Machivenyika and Wallace Ruzvidzo\n\nGOVERNMENT does not have any plans to ban small-scale mining activities for the foreseeable future, Mines and Mining Development Deputy Minister Dr Polite Kambamura has said.\n\nThis comes following misguided reports by some media outlets that the deputy minister had banned small-scale mining activities.\n\nIn an interview yesterday, Dr Kambamura cleared the air, saying small-scale miners were an important constituency in the countrys mining industry hence Government would not ban their activities.\n\nWe did not ban underground mining; we value the contributions coming from the small-scale sector, especially the gold sub-sector, but above all life is sacred and we value the lives of people and safety will be a priority.\n\nSo underground mining is not banned and we do not have any plans to ban small-scale underground mining, but what we are saying is if there are bad weather conditions our miners should consider safety, he said.\n\nThe Deputy Minister said he had only advised small-scale miners to suspend their operations as a cautionary measure during this rainy season, especially after the collapse of a mining Shaft in Makaha, Mudzi, last week resulting in the trapping of three small-scale miners.\n\nI issued a comment on the matter (Makaha incident) advising small-scale miners to consider suspending going underground, considering the dangers posed by incessant rains and the weak ground conditions that can lead to mine flooding and ground collapse.\n\nOn 13 February 2019 we had a similar case at Battlefields in Kadoma where small-scale miners were flooded by rain and we lost 24 miners as a result, so as a cautionary statement we advised small-scale miners not to go underground especially when it is raining and only resume going underground when weather conditions have improved, he said.\n\nIn an earlier statement, Permanent Secretary in the Ministry of Mines and Mining Development, Mr Pfungwa Kunaka said Government values small-scale gold miners and their contribution to the economy.\n\nMr Kunaka said authorities had only issued cautionary statements for the safety of the small-scale miners in the current rainy season.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Screenshot-36-680x380.png",
            "description": "Farirai Machivenyika and Wallace Ruzvidzo GOVERNMENT does not have any plans to ban small-scale mining activities for the foreseeable future, Mines and Mining Development Deputy Minister Dr Polite Kambamura has said. This comes following misguided reports by some media outlets that the deputy minister had banned small-scale mining activities. In an interview yesterday, Dr Kambamura […]",
            "time": "09:27",
            "date": "15 Jan 2025"
        },
        {
            "title": "Gandiwa appointed new ZimParks boss",
            "url": "https://www.herald.co.zw/gandiwa-appointed-new-zimparks-boss/",
            "content": "Ivan Zhakata and Tapiwa Chikuhwa\n\nTHE Zimbabwe Parks and Wildlife Management Authority (ZimParks) has entered a new era following yesterdays appointment of Professor Edson Gandiwa as its new director-general.\n\nHe succeeds Dr Fulton Mangwanya who was recently appointed Central Intelligence Organisation (CIO) director-general.\n\nAt the handover ceremony in Harare yesterday, Prof Gandiwa expressed appreciation for the opportunity to lead ZimParks.\n\nI accept this significant leadership role with profound gratitude and humility, he said.\n\nIt is difficult to fill the void left by such a unique leader, but as we look ahead, we are motivated by his commitment to conservation and his legacy of hard work.\n\nDr Mangwanya expressed heartfelt gratitude for his tenure at ZimParks.\n\nHe emphasised the broader significance of wildlife conservation, saying ZimParks mission extends beyond mere protection, to contributing to sustainable development goals, including poverty eradication.\n\nIt has been a pleasure to serve as director-general alongside you all, said Dr Mangwanya.\n\nOur work is not just about conserving for the sake of conserving; it is about ensuring that wildlife conservation benefits all Zimbabweans.\n\nMr Edward Samuriwo, Acting Permanent Secretary for Environment, Climate and Wildlife, highlighted the historic nature of this transition.\n\nThis handover is a milestone for ZimParks, he noted, emphasising Dr Mangwanyas lasting impact on Zimbabwes conservation landscape.\n\nMrs Sithembile Ncube, acting chairperson of the ZimParks board, expressed her unwavering support for Prof Gandiwa.\n\nWe have full confidence in your leadership, she said, assuring him that the team is ready to rally behind him as they did for Dr Mangwanya.\n\nAs Prof Gandiwa steps into his new role, he aims to continue ZimParks mission of wildlife conservation while promoting sustainable development.\n\nHis appointment is viewed as a strategic move to reinforce the authoritys commitment to sustainable wildlife management.\n\nWith a PhD in Wildlife Conservation and Management from Wageningen University and Research in the Netherlands, Prof Gandiwa brings a wealth of expertise, co-authoring over 140 peer-reviewed publications.\n\nHis previous role as Executive Dean of the School of Wildlife, Ecology, and Conservation at Chinhoyi University of Technology complements his extensive field experience.\n\nAs he takes the reins, all eyes will be on him as he navigates the delicate balance between conservation and human-wildlife co-existence in a country renowned for its extraordinary biodiversity.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/ZimParks-outgoing-director-general-Dr-Fulton-Mangwanya-left-confers-his-successor-Professor-Edson-Gandiwa-680x380.jpg",
            "description": "Ivan Zhakata and Tapiwa Chikuhwa THE Zimbabwe Parks and Wildlife Management Authority (ZimParks) has entered a new era following yesterday’s appointment of Professor Edson Gandiwa as its new director-general. He succeeds Dr Fulton Mangwanya who was recently appointed Central Intelligence Organisation (CIO) director-general. At the handover ceremony in Harare yesterday, Prof Gandiwa expressed appreciation for […]",
            "time": "09:27",
            "date": "15 Jan 2025"
        },
        {
            "title": "Editorial Comment: Efficiency in justice  delivery system crucial",
            "url": "https://www.herald.co.zw/editorial-comment-efficiency-in-justice-delivery-system-crucial/",
            "content": "FOR a justice delivery system to work, it has to be effective. Five senior judges said as much at the opening of the new Legal Year in all centres where there is a resident High Court judge. Everyone involved in the system has to be both efficient, properly staffed and collaborating.\n\nChief Justice Luke Malaba and the other judges did note that the courts themselves are now working at a far higher level of efficiency than was seen a few years ago, have cleared backlogs and are being measured for their efficiency.\n\nThe Judicial Service Commission, which is headed by the Chief Justice himself and brings together representatives of other judges, magistrates and the legal profession as well as suitable lay members who can raise the sort of questions that those outside the legal world want considered, has been relentless in its pursuit of building excellence and accessibility.\n\nThere has been a continuous programme to add to the chain of magistrates courts and most towns of any size now have a resident magistrate with the larger and more isolated suburbs of big cities now also getting a permanent court in their midst. The fact that the legal year opened in five High Court buildings shows that far more civil law, as well as the top end of criminal law, is now being decided closer to the people who are involved.\n\nThe Judicial Service Commission has also implemented a performance management system to gauge the effectiveness of every judge and magistrate. This must measure both the amount of work every judicial officer does, as well as its quality, which the judiciary can do perhaps more easily than others since a magistrate or judge who has very few decisions changed on appeal or review is obviously doing well.\n\nThe review system, whereby all the more serious criminal cases decided by magistrates are routinely checked over by a judge or a pair of judges, along with the sentencing guidelines promulgated by the commission, means we are seeing far greater uniformity and so fairness in the courts along with a rigid adherence to the law and the Constitutional safeguards.\n\nBoth the Chief Justice, and Deputy Chief Justice Elizabeth Gwaunza, also brought up the potential for corruption in the judicial systems and the continuing need to make sure that it simply did not happen and that all responsible for dispensing justice led exemplary lives in both public and private. Zero tolerance has produced results.\n\nThe spread of the judicial services has also seen the welcome opportunities for qualified legal practitioners to move out of the big cities and offer legal services in many smaller centres, the possibility of court work added to the routine attorney work making this sort of business viable and competitive.\n\nThe Chief Justice and his colleagues addressed the need for all involved in the criminal justice system to be fully efficient and to work together. There are obvious limits, since magistrates and judges decide guilt or innocence while police investigate crime and the prosecutors present the cases. Collaboration obviously does not mean that the judiciary move away from independence.\n\nBut it does mean that we should not have endless delays while evidence is assembled by the police or cases are prepared by the prosecutors or witnesses are tracked down and properly summoned with adequate warning.\n\nSome delays are unavoidable, and some are even generated by defence lawyers who seem to have been instructed to postpone the day of reckoning until everyone involved has died of old age. But we see cases where it seems to take almost forever for the police to assemble evidence, and the prosecutors seem ill prepared to present their cases.\n\nThe new National Council on the Administration of the Criminal Justice System, chaired by the head of the High Court Judge president Mary Zimba-Dube and including, with others, Prosecutor General Justice Loice Mutanda-Moyo, is designed to make sure that the administration works properly and better so that the accused are not left for long periods in a state of limbo before their guilt or innocence is established.\n\nWe have argued before that prosecutors and the police should work more closely in assembling cases, as is done in a range of other countries, so that holes in a case are identified earlier and the correct charges are laid that are supported by evidence. Prosecutors are not trained investigators but they need the facts, and police are not trained lawyers, but need to know what to look for so the correct charge is laid and a reasonable case assembled.\n\nIt is in these earlier stages that the mistake of arresting the wrong person can be sorted out and the investigation widened to find the actual perpetrator. In almost all criminal cases there is no doubt that a crime has been committed, although there are some crimes where this needs to be established if they reach the trial stage.\n\nThe main question for the investigation is finding who committed it and the main question for the courts is whether the evidence assembled and presented proves beyond reasonable doubt that the person before the court is the person who committed the crime. This is a fairly obvious concept but it does mean high levels of skill and efficiency right down the chain to the constable who receives the first crime report.\n\nIt has been said that justice delayed is justice denied, at least to someone who might well be the victim of crime. This is a bit of an exaggeration but it does highlight the need to ensure that everyone involved must move forward at due deliberate speed so that everything for investigation, prosecution, defence and final decision is done properly, fairly and correctly.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/bfe79ab8-a6c2-4494-bf09-7db3add18fba-1-680x380.jpeg",
            "description": "FOR a justice delivery system to work, it has to be effective. Five senior judges said as much at the opening of the new Legal Year in all centres where there is a resident High Court judge. Everyone involved in the system has to be both efficient, properly staffed and collaborating. Chief Justice Luke Malaba […]",
            "time": "09:27",
            "date": "15 Jan 2025"
        }
    ]
}