{
    "news": [
        {
            "title": "President extends Gen Sibanda’s term of office",
            "url": "https://www.herald.co.zw/president-extends-gen-sibandas-term-of-office/",
            "content": "Columbus Mabika-Herald Reporter\n\nPRESIDENT Mnangagwa has extended the term of office for the Commander of the Zimbabwe Defence Forces (ZDF), General Philip Valerio Sibanda, by one year to November 2025.\n\nThis was announced by the Chief Secretary to the President and Cabinet, Dr Martin Rushwaya, in a notice published in the Government Gazette dated 3 January 2025.\n\nIt is hereby notified that His Excellency the President has, in terms of proviso (i) to the Defence (Regular Force) (Officers) Regulations, 1988, published in Statutory Instrument 152 of 1988, extended the appointment of General Philip Valerio Sibanda as Commander of the Zimbabwe Defence Forces with effect from the 24th December, 2024 to the 23rd November, 2025, reads part of the notice.\n\nPresident Mnangagwa yesterday promoted 26 Zimbabwe National Army (ZNA) Lieutenant Colonels to the rank of Colonel.\n\nThe President, who is also the Commander-in-Chief of the Zimbabwe Defence Forces, made the promotions in terms of the Defence Act (Chapter 11:02) Section 20, as read with Statutory Instrument 257 of 2020, Section 19c, Sub-section 2c, which reads:\n\nHis Excellency the President of the Republic of Zimbabwe and Commander-in-Chief of the Zimbabwe Defence Forces may on the advice of the Minister of Defence, acting on the recommendations of the Commander Zimbabwe Defence Forces, reward any member for distinguished service or gallant conduct on active service by promoting an officer to a higher rank.\n\nMajor-General Simo Maseko (right) and Major-General Augustine Chipwere confer new insignia of rank to Colonel Norman Mbimbi at the Josiah Magama Tongogara Barracks in Harare yesterday.Picture Joshua Muswere.\n\nConferring new badges of rank to the promoted officers, ZNA Chief of Staff Quarter Master Staff Major General Simo Maseko said the promotions were a recognition of the officers hard work, loyalty, and dedication to duty over several years.\n\nYour promotion is a recognition of your unquestionable loyalty and dedication to duty. You all have the necessary capabilities and capacities to lead at the levels appointed. The Command Element has entrusted you with the rank and appointment, to prove your worth. It is now upon you to maintain the expected professionalism and work to the best of your abilities in your new appointments going forward, he said.\n\nMaj Gen Maseko called on the newly promoted officers to hit the ground running.\n\nI know how it feels to be promoted, I was recently promoted as well. You are all excited to have been elevated. Celebrate your achievements but lets hit the ground running and make an impact. Bring in improvements and innovations in your various workplaces, he said.\n\nMore will be expected from you by both your superiors and subordinates. Be the new brooms that will add a breath of fresh air to the organisation and strive to leave an indelible mark in whatever task you perform in your new appointment.\n\nSpeaking after the conferment ceremony, Col Cletus Maregere, who has now been appointed Director of the Zimbabwe Mine Action Centre, pledged to work hard to defend Zimbabwe and its people.\n\nI would like to pay tribute to the Commander-in-Chief, President Mnangagwa for the honour bestowed upon us. Because of this, my pledge is to work extra hard for the betterment of this great nation and its people he said.\n\nCol Norman Mbimbi said they will continue to be loyal to the Constitution and Command Establishment.\n\nHe thanked President Mnangagwa for the confidence he showed by elevating them to higher ranks.\n\nWe extend our sincerest gratitude to the Commander-in-Chief of the Zimbabwe Defence Forces, His Excellency President Mnangagwa, for bestowing upon us the esteemed rank of Colonel. We also appreciate the recognition and recommendation by Commander ZNA (Zimbabwe National Army), Lieutenant General Sanyatwe, which paved the way for our promotion, Col Mbimbi said.\n\nWe reaffirm our loyalty and commitment to the ZDF and our beloved country Zimbabwe. We will continue to support and drive the vision for the service, serving and supporting the Command Element.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/President-and-Gen-Sibanda-680x380.jpg",
            "description": "Columbus Mabika-Herald Reporter PRESIDENT Mnangagwa has extended the term of office for the Commander of the Zimbabwe Defence Forces (ZDF), General Philip Valerio Sibanda, by one year to November 2025. This was announced by the Chief Secretary to the President and Cabinet, Dr Martin Rushwaya, in a notice published in the Government Gazette dated 3 […]",
            "time": "06:28",
            "date": "07 Jan 2025"
        },
        {
            "title": "Govt moves to clear housing waiting list",
            "url": "https://www.herald.co.zw/govt-moves-to-clear-housing-waiting-list/",
            "content": "Wallace Ruzvidzo-Herald Reporter\n\nGOVERNMENT is moving to clear over two million people that are on the housing waiting list through the employment of new technologies as directed by President Mnangagwa, Local Government and Public Works Minister Dr Daniel Garwe has said.\n\nThe adoption of digital technology will see Zimbabweans being able to access and monitor the progress of housing waiting lists from the comfort of their homes  doing away with the need for them to visit their respective local authority.\n\nThose seeking rented accommodation, or those looking to buy houses, or residential stands will be able to access advertisements through the digital systems.\n\nDuring the last Cabinet meeting of 2024, President Mnangagwa emphasised the need for digitalisation and structural transformation of Ministries, Government Departments and Agencies this year, as this will ensure organised and expedited service delivery for the general citizenry.\n\nSpeaking at a Ministers Meet the Media platform organised by Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere in Harare yesterday, Dr Garwe said his Ministry was responding to the Presidents directive.\n\nThe President emphasised (the need for) management systems, the software for management systems to run our local authorities.\n\nIf I tell you that some of our local authorities still use pen and paper and files to manage themselves in this digital era, so the President said, no, no, no, no, we must move with time, let us outdo the use of old technologies in management.\n\nBuy and install current software that is being used globally so that we run our local authorities efficiently, he said.\n\nDr Garwe said it was imperative that the general citizenry access services pertaining to accommodation digitally.\n\nThis, he said, would also ensure that the backlog is cleared efficiently and in an orderly manner.\n\nRight now we know we have got in excess of two million people that are aggregated on the waiting list for housing, but there is no single local authority which can put all that information, feed it into software so that people can digitally access that information.\n\nWe are now saying, let us upgrade the systems and ensure that they are digitised. Wherever you are, make it comfortable for you so that if you are at home or in your office, you can use your smartphone, you can access a city council waiting list, be able to access your position if you are on the waiting list or who is on the waiting list.\n\nOr if you are looking for accommodation, whether its a rental, temporary accommodation, or its rented apartment accommodation, or its (even) accommodation to be bought, instead of waiting for papers to advertise. This is where we are going, this is what Vision 2030 is directing us to do. We must start it now.\n\nPresident Mnangagwa rallied his Ministers to expedite the adoption of new technologies in their ministries this year, as this would ensure effective service delivery for Zimbabweans.\n\nThe digital technology revolution is the cornerstone of modernisation, industrialisation and efficient service delivery to drive sustainable economic growth.\n\nInroads in the digitalisation of Government information and services are occurring at a worryingly slow pace.\n\nIt is a misnomer that with the abundant ICT skills and capacities among young people, our Government has only a few functional and up-to-date Ministry websites. More should be done to improve this situation, said the President at the last Cabinet meeting of 2024.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Ministers-Muswere-and-Garwe-680x380.jpg",
            "description": "Wallace Ruzvidzo-Herald Reporter GOVERNMENT is moving to clear over two million people that are on the housing waiting list through the employment of new technologies as directed by President Mnangagwa, Local Government and Public Works Minister Dr Daniel Garwe has said. The adoption of digital technology will see Zimbabweans being able to access and monitor […]",
            "time": "06:28",
            "date": "07 Jan 2025"
        },
        {
            "title": "New minerals tax to boost revenue",
            "url": "https://www.herald.co.zw/new-minerals-tax-to-boost-revenue/",
            "content": "Farirai Machivenyika-Senior Reporter\n\nFOLLOWING the signing into law of the Finance Act by President Mnangagwa last week, a two percent levy on gross value of lithium, black granite, quarry stones, uncut and cut diamonds sold locally or abroad will now be charged and must be paid in the currency of trade.\n\nThe new provision came into force on January 1, 2025.\n\nThe levy on gross value of lithium, black granite, quarry stones and uncut and cut dimensional stone chargeable in terms of section 36P of the Taxes Act shall be two percent of the gross value of the sale within Zimbabwe or on export of lithium, black granite, quarry stones and uncut and cut dimensional stone, which levy must be payable in the currency of trade, reads part of the Finance Act.\n\nThe provision is part of efforts by Government to increase revenue collected from the countrys mineral resources.\n\nThe new levy is an increase on the one percent that was charged previously.\n\nThe new law also explicitly states that authority of all underground natural resources on which royalties are charged, vests in the President.\n\nFor the avoidance of doubt, it is declared that dominium in the subsoil resources on which royalties are charged vests in the President by right of prerogative, which right may be expressly amended, abridged or limited by this Act or any other Act of Parliament for as long as this or any other such Act is in force, the Act further reads.\n\nBeginning January 1, the Finance Act also prohibits the acquisition or transfer of mining title to entities that are not registered for tax purposes.\n\nNo registration of the acquisition of a mining title by a mining entity shall be executed, attested or registered by registrar or other registering official by whatever name called responsible for registering rights, titles and transfers or amendments thereof in terms of any of the Mines and Minerals Act [Chapter 21:05] unless there is submitted to the official concerned by either of the parties or their agents concerned in the transaction a certificate issued by the Zimbabwe Revenue Authority stating that the recipient mining entity is a registered taxpayer or, if such mining title has been registered without such certificate having been submitted, the transfer of such mining title or share, stake, right or interest in any mining title is deemed to be void, and shall be cancelled upon the request in writing of the Commissioner-General to that effect, reads the Act.\n\nThe new tax measures announced in the Finance Act for the mining sector are meant to increase revenue from the countrys vast mineral resources.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/06/Untitled-4-2.jpg",
            "description": "Farirai Machivenyika-Senior Reporter FOLLOWING the signing into law of the Finance Act by President Mnangagwa last week, a two percent levy on gross value of lithium, black granite, quarry stones, uncut and cut diamonds sold locally or abroad will now be charged and must be paid in the currency of trade. The new provision came […]",
            "time": "06:28",
            "date": "07 Jan 2025"
        },
        {
            "title": "National dam levels average 59pc",
            "url": "https://www.herald.co.zw/national-dam-levels-average-59pc/",
            "content": "Nyasha Motsi-Herald Correspondent\n\nZimbabwes major dams now hold 59,1 percent of their capacity after the rains in November and current downpours across the country.\n\nAccording to the Zimbabwe National Water Authority (ZINWA), the wet spell being experienced in most parts of the country continues to push dam levels up.\n\nA recent surge in rainfall across the country has led to a notable increase in water levels at major dams. As a result, the national average dam level has risen to 59,1 percent, representing a 1,59 percent increase since December 30.\n\nDespite the recent increase, the current national dam level average of 59,1 percent still lags behind last years level of 78 percent recorded during the same period.\n\nAs a result, water users are urged to maintain conservative and efficient water usage practices, read the statement.\n\nWater levels were higher this time last year because the previous season had been particularly good in terms of rainfall. The drought in the last season meant that levels were lower when the season ended and that irrigation demand was higher.\n\nThe water authority also advised individuals and entities using dam water for non-essential purposes, such as irrigating summer crops to comply with water abstraction agreements and adhere to relevant laws regulating water use.\n\nIn Gwayi catchment, the dam levels vary significantly. Ngwenya Dam is at 91,6 percent capacity, while Pollards Dam is at 93,2 percent. Insukamini Dam holds 56,3 percent, and Bubi-Lupane Dam is at 35,1 percent. Notably, Khami Dam has reached full capacity at 100 percent, ZINWA said.\n\nIn the Manyame catchment area, Chivero is at 72,1 percent capacity, while Manyame Dam has reached 74,1 percent.\n\nHarava Dam holds 16,3 percent, while Biri Dam holds 75 percent, and Mazvikadei Dam is at 66,6 percent.\n\nFor dams on the Mazowe catchment, Mazowe Dam is at 28 percent, Kushinga-Phikhelela Dam at 26,9 percent, Masembura Dam at 78,6 percent capacity and Arcadia Dam at 60,7 percent.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/05/lake-chivero-spillway-1.jpg",
            "description": "Nyasha Motsi-Herald Correspondent Zimbabwe’s major dams now hold 59,1 percent of their capacity after the rains in November and current downpours across the country. According to the Zimbabwe National Water Authority (ZINWA), the wet spell being experienced in most parts of the country continues to push dam levels up. “A recent surge in rainfall across […]",
            "time": "06:28",
            "date": "07 Jan 2025"
        },
        {
            "title": "President honours war hero Chief Chivi",
            "url": "https://www.herald.co.zw/president-honours-war-hero-chief-chivi/",
            "content": "George Maponga-Masvingo Bureau\n\nPRESIDENT Mnangagwa has conferred liberation war hero status on the late Chief Chivi, who passed away last week at the age of 106.\n\nBorn Tavagwisa Magura, Chief Chivi was buried on Sunday at Maregere Village.\n\nThe President honoured the late traditional leader for his selfless contribution to Zimbabwes liberation struggle, having served as a war collaborator during the struggle.\n\nThis recognition follows a formal application for acknowledgment from the provincial leadership in Masvingo, aimed at paying homage to Chief Chivis efforts for both liberation and post-independence development.\n\nThe burial ceremony was attended by senior Government and Zanu PF party officials, including Minister of State for Masvingo Provincial Affairs and Devolution Ezra Chadzamira,Zanu PF provincial chair Cde Robson Mavhenyengwa, Dr Addmore Pazvakavambwa, Permanent Secretary in the Ministers office, and community leaders.\n\nIn his address, Minister Chadzamira said the chiefs death has deprived Masvingo province and Zimbabwe of a dedicated individual who devoted his life to the pursuit of a free nation.\n\nToday, Zimbabwe enjoys the fruits of freedom thanks to the sacrifice of individuals like the late Chief Chivi.\n\nMinister Chadzamira thanked President Mnangagwa for honouring Chief Chivi, describing him as an inspirational force and advocate for economic empowerment.\n\nChief Chivi was recognised for his role as a foot soldier and driver of the Second Republics Vision 2030, promoting and supporting Government programmes aimed at benefiting the local community and the wider Chivi district.\n\nCde Mavhenyengwa also paid tribute to Chief Chivi, noting his unwavering support for the ruling party and President Mnangagwas Vision 2030 initiatives.\n\nHe described Chief Chivi as a loyal party cadre whose life and contributions warrant celebration.\n\nWe must ensure that his dream of seeing Zimbabwe achieve an upper middle-income economy by 2030 is realised, Cde Mavhenyengwa said.\n\nThe Zanu PF Masvingo provincial chair assured the people of Chivi district and the family of the late chief that the ruling party will continue to support efforts aimed at achieving socio-economic transformation, which is central to establishing an empowered upper middle-income society.\n\nChief Chivi, born in Chivi in 1919, left formal employment in 1976 at the height of the liberation war to become a full-time war collaborator, demonstrating his commitment to the cause of independence.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/President-Mnangagwa-680x380.jpg",
            "description": "George Maponga-Masvingo Bureau PRESIDENT Mnangagwa has conferred liberation war hero status on the late Chief Chivi, who passed away last week at the age of 106. Born Tavagwisa Magura, Chief Chivi was buried on Sunday at Maregere Village. The President honoured the late traditional leader for his selfless contribution to Zimbabwe’s liberation struggle, having served […]",
            "time": "06:28",
            "date": "07 Jan 2025"
        },
        {
            "title": "‘Media engagement remains priority’",
            "url": "https://www.herald.co.zw/media-engagement-remains-priority/",
            "content": "Ivan Zhakata-Herald Correspondent\n\nTHE Minister of Information, Publicity and Broadcasting Services, Dr Jenfan Muswere, has said the Government will extend its Minister Meets Media programme across the countrys 10 provinces to strengthen its relationship with journalists and media.\n\nSpeaking to journalists during a press briefing in Harare yesterday, Dr Muswere outlined the Governments commitment to fostering open dialogue between the media and Government institutions.\n\nHe said these provincial media talks will provide journalists with a platform to engage directly with Government representatives.\n\nWe will continue to roll out these provincial media talks, allowing you to ask questions, and also allowing the Government to respond, said Dr Muswere.\n\nHe acknowledged the complexities of modern media, particularly with the rise of social media platforms, which have introduced both opportunities and challenges.\n\nDr Muswere said the toxicity often found on social media differed from the more traditional, professional journalism.\n\nYes, in the fourth industrial revolution of social media platforms, that is a whole new control by the respective countries, he said.\n\nThere is a lot of scatological toxicity within social media platforms. But this is citizen journalism versus the mainstream media industry, which is who you are, and I am sure you will not be defeated by those videos.\n\nDr Muswere said qualified journalists play a key role in providing accurate reporting and the Government remains committed to transparency and improving media access to information.\n\nAs Government, we have created the Freedom of Information Act to enhance your access to information. We also have a new media policy and the National Employment Council to guarantee the welfare of journalists.\n\nDr Muswere also reflected on the importance of building a cohesive, cooperative relationship between the Government and the media, saying polarisation should be a thing of the past.\n\nHe reiterated that the Governments goal is to unite the country through collaborative efforts.\n\nWe are now friends, and we work together. The Government is a government of the people, by the people, for the people. Let us build our country together, Dr Muswere said.\n\nThe expanded Minister Meets Media programme is expected to provide more direct access to Government officials, allowing for greater transparency and improved two-way communication with the media across the nation.\n\nAs discussions on media freedom, challenges in the digital age, and the future of journalism continue, the Governments commitment to engaging with media professionals remains a central pillar of its public service strategy.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Minister-Muswere-680x380.jpg",
            "description": "Ivan Zhakata-Herald Correspondent THE Minister of Information, Publicity and Broadcasting Services, Dr Jenfan Muswere, has said the Government will extend its “Minister Meets Media” programme across the country’s 10 provinces to strengthen its relationship with journalists and media. Speaking to journalists during a press briefing in Harare yesterday, Dr Muswere outlined the Government’s commitment to […]",
            "time": "06:28",
            "date": "07 Jan 2025"
        },
        {
            "title": "Supreme Court settles NSSA, developer row",
            "url": "https://www.herald.co.zw/supreme-court-settles-nssa-developer-row/",
            "content": "Fidelis Munyoro-Chief Court Reporter\n\nThe seven-year contractual saga between the National Social Security Authority (NSSA) and a developer it once contracted, Housing Cooperation Zimbabwe (HCZ), has finally reached its conclusion, with the Supreme Court ruling in favour of NSSA.\n\nThis multi-million dollar dispute, once entrenched in the corridors of arbitration centres and judicial chambers, has been laid to rest after the Supreme Court overturned a High Court ruling that had awarded HCZ a staggering US$22 million plus interest in damages for lost profits.\n\nThis was awarded by the first arbitrator who, said the court, erred in allowing a consequential damages claim that was specifically barred by the initial contract with NSSA.\n\nThe court criticised NSSA for sending a fairly junior official to the arbitration hearings. The High Court erred, said the Supreme Court, in confirming this erroneous award and not seeing that NSSA was objecting over contract law, not seeking a special favour as a public entity.\n\nThe dispute revolved around a botched deal for the construction of 8 000 houses and flats in Caledonia, Harare, at a total cost of US$304 million.\n\nA week after its formation in 2017, HCZ, a company co-founded by Adam Molai and Stephen Duggan, was handed the colossalproject.\n\nHowever, the ambitious partnership faced problems, culminating in HCZ suing NSSA for breach of contract before an arbitrator, who ruled in its favour.\n\nThat decision which HCZ sought to register in the High Court, ignited a legal battle that raged for years.\n\nAt the centre of the dispute lay the arbitrators award of damages for loss of profit that NSSA vehemently argued were not contemplated in the contract.\n\nNSSA contended that the arbitrator, senior private lawyer Mr Peter Carnegie Lloyd, had effectively rewritten the agreement by awarding consequential damages expressly excluded under clause 22.1 of the contract.\n\nThe authority further decried the award as a gross violation of public policy, asserting that such damages could not have been within the reasonable contemplation of the parties at the time of contracting.\n\nThe High Court, however, ruled in favour of HCZ, dismissing NSSAs objections and ordering the registration of the arbitral award.\n\nThis ruling, NSSA argued, was flawed on multiple fronts. Not only had the High Court failed to interrogate the arbitrators findings critically, but it also misconstrued NSSAs legal argument as a plea for sympathy, mischaracterising the authoritys position as an appeal to its public nature and the protection of taxpayers funds.\n\nNSSA, insisted that its stance was rooted in clear contractual principles, that a party cannot claim damages outside the express terms of the agreement.\n\nThe matter escalated to the Supreme Court, where the appeal panel of three judges Justice Antonia Guvava, Justice Tendayi Uchena, and Justice Samuel Kudya, delivered a judgment that not only vindicated NSSA, but also underscored the sanctity of contractual terms.\n\nJustice Guvava, writing for the court, stressed that an arbitral award must be set aside if it is so manifestly erroneous that it brings about a grave injustice.\n\nShe noted that the damages awarded by the arbitrator were clearly consequential in nature and so prohibited by the parties agreement.\n\nThe lower court, she said, had erred in failing to recognise this fundamental breach of public policy.\n\nJustice Guvava dismantled the High Courts reasoning, pointing out that the judge had aligned too readily with the arbitrators findings without subjecting them to the scrutiny demanded by NSSAs objections.\n\nThe damages claimed by HCZ, she explained, were not general damages, as the lower court had classified them, but special or consequential damages that clause 22.1 of the agreement explicitly barred.\n\nAs such, the arbitral award stood in stark contravention of the contract, a fatal flaw that rendered it untenable.\n\nThe Supreme Courts ruling also rebuked the procedural missteps that marred NSSAs initial arbitration hearing.\n\nThe authority had sent a relatively junior officer to represent it, a decision that Justice Guvava described as resulting in damaging concessions and a failure to effectively challenge HCZs claims.\n\nYet, despite this miscalculation, the court held that the arbitrators decision could not stand when measured against the high bar of public policy.\n\nThe appeal will succeed on this basis, declared Justice Guvava.\n\nThe issue of the registration of the award, therefore, falls away, as there is no longer an award to register.\n\nNoting that the High Courts errors extended to its treatment of the application to set aside the award, she allowed NSSAs appeal with costs, closing the chapter on a contentious and high stakes legal battle.\n\nAdvocate Thabani Mpofu, instructed by Mawere and Sibanda, argued the case on behalf of NSSA, while Advocate Daniel Tivadar, under the instruction of Zigomo Legal Practitioners, represented HCZ.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Supreme-Court-of-Zimbabwe-680x380.jpg",
            "description": "Fidelis Munyoro-Chief Court Reporter The seven-year contractual saga between the National Social Security Authority (NSSA) and a developer it once contracted, Housing Cooperation Zimbabwe (HCZ), has finally reached its conclusion, with the Supreme Court ruling in favour of NSSA. This multi-million dollar dispute, once entrenched in the corridors of arbitration centres and judicial chambers, has […]",
            "time": "06:28",
            "date": "07 Jan 2025"
        },
        {
            "title": "Irrigated tobacco harvesting begins",
            "url": "https://www.herald.co.zw/irrigated-tobacco-harvesting-begins/",
            "content": "Precious Manomano-Herald Reporter\n\nHARVESTING of the early-planted irrigated tobacco has begun with farmers optimistic about achieving their target of 300 000 tonnes.\n\nReports indicate that the crop is generally in good condition, with some small-scale farmers reliant on the rains, late this year across the tobacco belt of the Mashonaland provinces and Manicaland, still planting.\n\nThe president of the Tobacco Farmers Union Trust, Mr Edward Dune, said most farmers have begun reaping their crops.\n\nHowever, he cautioned that this years leaf is compromised in terms of weight.\n\nHarvesting is going on well. We expect the marketing season to start early. We faced issues where farmers had to replant seedlings lost to a heatwave that affected the country. If we continue receiving rains, we remain positive about meeting our annual target, he said.\n\nIn addition, Mr Dune noted a significant migration of labour to tobacco farms, particularly in dry areas like Binga and Muzarabani, where families are seeking sustenance.\n\nIn a related development, Lands, Agriculture, Water, Fisheries and Rural Development Minister Dr Anxious Masuka has extended the deadline for destroying tobacco seedbeds to January 15 to take into account the dry spell and the delay imposed on many dryland farmers until reasonable rains started falling around Christmas.\n\nThe Plant Pests and Diseases (Tobacco) Regulations of 1979 typically mandate destruction by December 31 to disrupt pest life cycles.\n\nHowever, due to a prolonged dry spell, farmers relying on rain-fed tobacco could not transplant in time.\n\nThe Tobacco Industry and Marketing Board (TIMB) advocated for this extension to help farmers preserve their investments and reap the benefits of their hard work. Late December rains have brought relief and optimism for dryland tobacco growers, marking a turning point for the present season.\n\nAccording to TIMB statistics, as of December 27, growers had transplanted 84 661 hectares, surpassing the 82 392 hectares recorded during the same period in 2023. Further, 126 092 growers have been registered this year, compared to 112 904 last year, underscoring the industrys resilience and growth.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2017/12/0512-1-1-TOBACO-USE.jpg",
            "description": "Precious Manomano-Herald Reporter HARVESTING of the early-planted irrigated tobacco has begun with farmers optimistic about achieving their target of 300 000 tonnes. Reports indicate that the crop is generally in good condition, with some small-scale farmers reliant on the rains, late this year across the tobacco belt of the Mashonaland provinces and Manicaland, still planting. […]",
            "time": "06:28",
            "date": "07 Jan 2025"
        },
        {
            "title": "Rights commission applauds abolition of death penalty",
            "url": "https://www.herald.co.zw/rights-commission-applauds-abolition-of-death-penalty/",
            "content": "Ivan Zhakata-Herald Correspondent\n\nThe Zimbabwe Human Rights Commission (ZHRC) has welcomed and celebrated the historic signing into law of the Death Penalty Abolition Act, 2024.\n\nIn a statement, the Commission said the landmark step is a significant milestone in Zimbabwes commitment to upholding the sanctity of human life, as enshrined in Section 48 of the Constitution, which protects the right to life, alongside sections 51 and 53 which respectively guarantee the rights to dignity and freedom from torture, cruel, inhuman and degradingtreatment.\n\nIt said the new Act eliminates the death penalty in Zimbabwe, ensuring no person shall be sentenced to death or executed.\n\nThis legislative development aligns with modern human rights standards and reflects the global trend towards the abolition of the death penalty, reads the statement.\n\nZimbabwe now joins a growing number of nations that have recognised the inherent dignity of every human being, regardless of their past actions. The ZHRC applauds the inclusive and compassionate approach taken in the transitional provisions of the Act, ensuring prisoners under sentence of death are afforded legal representation and the opportunity for clemency.\n\nThis approach underlines the importance of rehabilitation over retribution in Zimbabwes justice system. The ZHRC highly commends the unity of purpose demonstrated by the leadership across the political divide, notably, Mr Edwin Mushoriwa who introduced the Private Members Bill in November 2023, Minister of Justice and Parliamentary Affairs Ziyambi Ziyambi who facilitated the passage, Members of Parliament as a whole, and President Mnangagwa who signed the Bill into law.\n\nThe Commission has urged the political leadership to maintain the unity for the sake of promoting human rights in Zimbabwe.\n\nIt said the abolition of the death penalty is a monumental achievement for human rights in Zimbabwe as it resonates with the fundamental principles of equality, justice and mercy, which are cornerstones of a democratic society.\n\nThis development also reinforces Zimbabwes alignment with international human rights instruments such as the African Charter on Human and Peoples Rights and the International Covenant on Civil and Political Rights, reads the statement.\n\nThe ZHRC recognises the challenges of addressing grave crimes, but firmly maintains that the death penalty is not the solution. Evidence worldwide shows that the death penalty does not deter crime more effectively than other punishment.\n\nInstead, its abolition allows for a more humane and restorative justice system. As we celebrate this significant milestone, the ZHRC reiterates its commitment to promoting the protection of human rights and advocating for the reform of laws and policies to create a fairer and more just society.\n\nThe Commission has also called on all stakeholders, Government bodies, civil society and citizens to support the full implementation of the Act and to work collectively towards building a Zimbabwe where justice, equality and respect for life prevail.\n\nAs a matter of priority, the ZHRC urges the responsible authorities to ensure expeditious and fair re-sentencing of those on the death row, and will monitor such process.\n\nThis milestone achievement symbolises Zimbabwes commitment to upholding constitutional, regional and international human rights standards. In that vein, the ZHRC therefore, urges the Government of Zimbabwe to maintain the momentum and ratify outstanding treaties, particularly the UN Convention against Torture and Other Cruel, Inhuman or Degrading Treatment or Punishment (CAT), and the UN Convention for the Protection of All Persons from Enforced Disappearance (CED).\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2020/06/death-penalty.jpg",
            "description": "Ivan Zhakata-Herald Correspondent The Zimbabwe Human Rights Commission (ZHRC) has welcomed and celebrated the historic signing into law of the Death Penalty Abolition Act, 2024. In a statement, the Commission said the landmark step is a significant milestone in Zimbabwe’s commitment to upholding the sanctity of human life, as enshrined in Section 48 of the […]",
            "time": "06:28",
            "date": "07 Jan 2025"
        },
        {
            "title": "Govt steps up efforts to regularise informal settlements",
            "url": "https://www.herald.co.zw/govt-steps-up-efforts-to-regularise-informal-settlements/",
            "content": "Joseph Madzimure-Senior Reporter\n\nTHE Government has stepped up efforts to regularise informal settlements across the country, Local Government and Public Works Minister Daniel Garwe has said.\n\nIt has also put in place a regularisation policy managed by the Ministry of National Housing and Social Amenities together with the Ministry of Local Government and Public Works.\n\nSpeaking at a Ministers Meet the Media briefing organised by the Ministry of Information, Publicity and Broadcasting and Publicity Services in Harare yesterday, Minister Garwe said the Government would expedite the regularisation of all the informal settlements to realise Vision 2030.\n\nWe have no choice; we need to regularise all the informal settlements that are within the country. If we are to speak of an upper middle-income status by 2030, we need to make conscious decisions not only as central Government but as Zimbabweans to ensure that we regularise. How do we start it: it starts with you and me.\n\nMinister Garwe said people must not to buy land from land barons, since all State land belongs to the Government.\n\nPlease stop buying land from land barons, thats the first call for regularisation. We now have structures put in place to ensure that you can come to the Ministry of Local Government and your local authority and be able to get information on the availability of a stand in the area of your choice if there are there, so stop buying land from criminals.\n\nFor the areas that already exist as informal settlements such as Caledonia to the east of Harare and the swathe of settlements across Harare South, Minister Garwe said Government had put in place a budget to ensure they engaged developers who would develop the area.\n\nThose who would be getting the title deeds would be able to use these as security to get the mortgages they needed to pay for services such as roads, water and sewers.\n\nWe now have a budget in place to ensure that we engage the developers so that they provide roads, water, and the sewer that is required to regularise those areas.\n\nWe want residents to participate. They desire to have a title deed. They can only get a title deed if they pay for the land first. The land belongs to the State. Even if you are living on a stand that is half a metre by half a metre, you pay for the land first, Minister Garwe said.\n\nAfter paying for the land you are now requested to pay for the road construction that covers the 500 metres in your area of concern, the water for the same distance of that same area and the sewer of your area.\n\nThe money does not go to the Government coffers; it will go to a bank or an insurance company or building societies that have the responsibility to offer mortgage facilities for the same beneficiaries that are on the land.\n\nProper regularisation, he said, ultimately enabled the building of modern smart infrastructure which would increase property values as regulated and organised neighbourhoods were more desirable places to live and work.\n\nMinister Garwe said sanitisation was closely linked to economic development as poor sanitary practices can lead to increased healthcare costs, lost productivity due to illness, and a burden on the public health system.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Minister-Garwe-680x380.jpg",
            "description": "Joseph Madzimure-Senior Reporter THE Government has stepped up efforts to regularise informal settlements across the country, Local Government and Public Works Minister Daniel Garwe has said. It has also put in place a regularisation policy managed by the Ministry of National Housing and Social Amenities together with the Ministry of Local Government and Public Works. […]",
            "time": "06:28",
            "date": "07 Jan 2025"
        }
    ]
}