{
    "news": [
        {
            "title": "Redcliff proposes US$25m budget for 2025",
            "url": "https://www.herald.co.zw/redcliff-proposes-us25m-budget-for-2025/",
            "content": "Midlands Bureau\n\nRedcliff Municipality has proposed a US$25million budget for 2025, which is a decrease from this years US$30million.\n\nMayor Vincent Shangwa Masiiwa said the budget seeks to prioritise the serious water challenges being faced in the dormitory town.\n\nOur total budget for the year 2025 is US$25 337 144.96. Water supply remains a key challenge in Redcliff, therefore more emphasis has been directed towards water projects. We will look at addressing water challenges in Torwood water and sewer connections, as well as roads.\n\nThe following schemes were budgeted for in the 2025 budget and will be funded by our own revenue, that is maintenance of Millennium Park and Engelbrecht Road, water and sewer reticulation, Simbi Park roads, drainage and sewer.\n\nThese projects will improve the quality of life for residents and attract new businesses to Redcliff, said Mr Masiiwa.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/images-5.jpeg",
            "description": "Midlands Bureau Redcliff Municipality has proposed a US$25million budget for 2025, which is a decrease from this year’s US$30million. Mayor Vincent Shangwa Masiiwa said the budget seeks to prioritise the serious water challenges being faced in the dormitory town. “Our total budget for the year 2025 is US$25 337 144.96. Water supply remains a key […]",
            "time": "09:46",
            "date": "20 Dec 2024"
        },
        {
            "title": "Mellon Foundation extends US$500K grant to national gallery",
            "url": "https://www.herald.co.zw/mellon-foundation-extends-us500k-grant-to-national-gallery/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nThe Mellon Foundation has awarded the National Gallery of Zimbabwe a US$500 000 grant to support the development of the museums infrastructure.\n\nThe grant shall be utilised to refurbish the gallerys amenities, including the installation of a brand new air conditioning system, a fire suppression system, access control and security systems.In a statement, the executive director of the\n\nNational Gallery of Zimbabwe, Mr Raphael Chikukwa said the grant will ensure that the gallery stands at par with other international institutions.\n\nThe grant has come as a lifesaving mechanism after years of seeking partnerships that could encourage the rehabilitation of the museums amenities, he said.\n\nMr Chikukwa said the gallery was grateful to the Mellon Foundation for their generous contribution.\n\nThe bequest will take the National Gallery of Zimbabwe towards world class status, and as a national treasure, contribute to the proper management and preservation of the permanent collection for the foreseeable future, he said.\n\nThe National Gallery of Zimbabwe is committed to promote, develop and safeguard Zimbabwes visual arts while fostering a vibrant art ecosystem.\n\nIt has received the grant in line with the Mellon Foundations mission of building communities enriched by meaning and empowered by critical thinking, where ideas and imagination can thrive.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/11/Raphael_Chikukwa.jpg",
            "description": "Ivan Zhakata Herald Correspondent The Mellon Foundation has awarded the National Gallery of Zimbabwe a US$500 000 grant to support the development of the museum’s infrastructure. The grant shall be utilised to refurbish the gallery’s amenities, including the installation of a brand new air conditioning system, a fire suppression system, access control and security systems. […]",
            "time": "09:46",
            "date": "20 Dec 2024"
        },
        {
            "title": "POTRAZ honoured for tax compliance",
            "url": "https://www.herald.co.zw/potraz-honoured-for-tax-compliance/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nThe Postal and Telecommunications Regulatory Authority of Zimbabwe (POTRAZ) has been named the Most Compliant Taxpayer in the Information Communication Technology sector under the large corporates category.\n\nThe accolade was awarded during the Zimbabwe Revenue Authority (ZIMRA) Appreciation Awards ceremony held in Harare yesterday.\n\nThe ceremony was attended by senior Government officials, including Permanent Secretary in the Ministry of Industry and Commerce Dr Thomas Utete Wushe.\n\nZIMRA board chairperson Mr Anthony Mandiwanza and ZIMRA commissioner-general Mrs Regina Chinamasa also attended the event.\n\nSpeaking on the sidelines of the event, Mrs Chinamasa applauded POTRAZ for setting a benchmark in compliance and accountability, emphasising the importance of such standards in nation-building.\n\nPOTRAZ emerged as the sole parastatal and Government entity that stood out in a competitive field of over 50 entities dominated by private-sector players such as Bata Shoe Company, CBZ, Mimosa, Zimplats, and Fereira Furnitures.\n\nThis milestone underscores the Authoritys dedication to fostering a culture of integrity, transparency, and adherence to fiscal obligations, she said.\n\nIn an interview after receiving the award, POTRAZ director-general Dr Gift Machengete said the recognition was a testament to their unwavering commitment to compliance and good governance.\n\nIt symbolises the hard work and dedication of the POTRAZ team in upholding the principles of accountability. As a public institution, we aim to lead by example and inspire a culture of excellence, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2013/08/Potraz.png",
            "description": "Ivan Zhakata Herald Correspondent The Postal and Telecommunications Regulatory Authority of Zimbabwe (POTRAZ) has been named the Most Compliant Taxpayer in the Information Communication Technology sector under the large corporates category. The accolade was awarded during the Zimbabwe Revenue Authority (ZIMRA) Appreciation Awards ceremony held in Harare yesterday. The ceremony was attended by senior Government […]",
            "time": "09:46",
            "date": "20 Dec 2024"
        },
        {
            "title": "National Museums and Monuments Zimbabwe sets sights on preserving liberation heritage",
            "url": "https://www.herald.co.zw/national-museums-and-monuments-zimbabwe-sets-sights-on-preserving-liberation-heritage/",
            "content": "Mutsawashe Mashandure\n\nHerald Correspondent\n\nThe National Museums and Monuments of Zimbabwe (NMMZ) has embarked on an ambitious plan to preserve and promote the countrys liberation heritage, both within its borders and in neighbouring countries that hosted Zimbabwes liberation armies during the struggle for independence.\n\nSpeaking at a management meeting held in Harare yesterday, Minister of Home Affairs and Cultural Heritage Kazembe Kazembe emphasised the importance of preserving the countrys history.\n\nWe have a responsibility to our ancestors, to ourselves, and to future generations to ensure that our liberation heritage is preserved and celebrated.\n\nWe have a unique opportunity to unlock the economic potential of our monuments, some of which are large tracts of landscapes that offer breathtaking opportunities for investment through concessions and other tourism offers , he said.\n\nHe highlighted that the NMMZ has expanded its mandate to include the liberation heritage of Zimbabwe, which involves preserving and promoting the history of the countrys struggle for independence, including the roles played by neighbouring countries such as Mozambique, Zambia, Botswana, Angola, and Tanzania.\n\nWe will work closely with these nations to identify, document, and preserve liberation heritage sites, ensuring our shared history is protected and celebrated, he added.\n\nMinister Kazembe outlined a multi-faceted approach to achieve this goal, including developing Memoranda of Understanding with neighbouring countries, fostering partnerships with local authorities and traditional leaders, as well as leveraging digital technologies to document the countrys liberation heritage.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/05/kzkz.jpg",
            "description": "Mutsawashe Mashandure Herald Correspondent The National Museums and Monuments of Zimbabwe (NMMZ) has embarked on an ambitious plan to preserve and promote the country’s liberation heritage, both within its borders and in neighbouring countries that hosted Zimbabwe’s liberation armies during the struggle for independence. Speaking at a management meeting held in Harare yesterday, Minister of […]",
            "time": "09:46",
            "date": "20 Dec 2024"
        },
        {
            "title": "Bogus cop arrested over Star FM programme",
            "url": "https://www.herald.co.zw/bogus-cop-arrested-over-star-fm-programme/",
            "content": "Crime Reporter\n\nA 47-year-old man has been arrested on allegations of masquerading as a policeman during a Star FM programme titled Tilder Live Show.\n\nIn a statement, national police spokesperson Commissioner Paul Nyathi confirmed the arrest.\n\nReference is made to a Tilder Moyo Star FM programme titled Tilder Live Show, Zvinoyera nezvinotyisa nezvinoda kufumurwa, held on the 17th of December, 2024.\n\nThe Zimbabwe Republic Police confirms the arrest of a bogus police officer, Shepherd Mangoma (47) of Budiriro , Harare, for impersonation and extortion.\n\nThe arrest of the suspect follows the appearance of the late Darlington\n\nTendai Mapikis family members on the Star FM programme where they raised concerns over the circumstances surrounding the death of Darlington Tendai Mapiki on October 27th, 2024, in Rugare.\n\nThe family disputed the post-mortem results which indicated that Mapiki had committed suicide and suspected foul play.\n\nThe family members then claimed that on the 9th of December 2024, they were approached by the suspect who posed as a detective stationed at CID Homicide, Harare, he said.\n\nThe suspect allegedly claimed to have information concerning the death of Mapiki and demanded US$500 from his family to facilitate the arrest of the suspects linked to their relatives death.\n\nMangoma alleged that the pathologist had been bribed to manipulate the post-mortem results and that five people who included a businessman and a traditional healer were involved in Mapikis murder for ritual purposes.\n\nOn the 18th of December 2024, the family reported the matter at the CID Police Anti-Corruption Unit, Harare, leading to a trap being set. The suspect was arrested at Rainbow Towers Hotel, Harare, after being handed US$200 by the family.\n\nCommissioner Nyathi said: The Zimbabwe Republic Police implores the public to be vigilant and to report individuals who approach them claiming to be police officers on the streets, shopping centres or other places outside police establishments, demanding cash or personal information.He said the public should report such individuals on National Complaints Desk number (0242) 703631, WhatsApp 0712 800 197 or at the nearest police station.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/12/PAUL-NYATHI-1.jpg",
            "description": "Crime Reporter A 47-year-old man has been arrested on allegations of masquerading as a policeman during a Star FM programme titled “Tilder Live Show.” In a statement, national police spokesperson Commissioner Paul Nyathi confirmed the arrest. “Reference is made to a Tilder Moyo Star FM programme titled “Tilder Live Show, Zvinoyera nezvinotyisa nezvinoda kufumurwa,” held […]",
            "time": "09:46",
            "date": "20 Dec 2024"
        },
        {
            "title": "President reads Riot Act. . .Warns senior party members abusing social media",
            "url": "https://www.herald.co.zw/president-reads-riot-act-warns-senior-party-members-abusing-social-media/",
            "content": "Joseph Madzimure, Senior Reporter\n\nPRESIDENT Mnangagwa yesterday read the Riot Act on senior party members who are abusing social media platforms to create divisions, discord and confusion among members.\n\nThis comes as some senior ruling party members have been communicating opinionated views on social media.\n\nAddressing the 380th Session of the Politburo yesterday, the President emphasised the importance of unity and order within the party rank and file.\n\nAt this stage of our political development and with the maturity of our revolutionary party, it is disheartening to note the unbecoming levels of mud-slinging and other counter-revolutionary tendencies, including the broadcasting of party issues on social media platforms.\n\nThese acts continue to cause discord and confusion among the membership base. No one must put our party into disrepute. This is unacceptable. Such behaviour cannot be tolerated and must stop. Vari kuzviita cherai chikomba, emphasised President Mnangagwa.\n\nEvery member, the President said, must adhere to provisions of the party constitution, founding principles, and procedural integrity, including wide consultation and formal ratification of issues that affect the party.\n\nPrudence must be exercised in the execution of our duties and rights as members, through the use of appropriate principal organs and structures of the party. Zanu PF musangano unegwara, uye nematare.\n\nLet us do more to unite the party and entrench a positive culture of common purpose, harmony and love, as we advance our party Vision and Mission as articulated in Articles 6 and 7 of our party constitution, he said.\n\nOn top of that, a social media policy is being crafted which will guide party members.\n\nThe President urged the party leadership to look forward to 2025 with optimism and confidence that the colossal party will sustain the development momentum realised so far.\n\nIn doing so, our primary concern at every leadership level should be to continue building a positive image of the party and expanding the membership base in our structures. The party must remain visible in the villages, and urban areas, always guiding misinformed cadres in our communities, and raising their political awareness. Mu ZANU PF, iwe neni tine basa, he said.\n\nPresident Mnangagwa said despite the effects of the heinous illegal sanctions the country has witnessed numerous success milestones during the year.\n\nDespite the weighty and retarding effects of the heinous illegal sanctions on our country, we scored numerous success milestones during the year towards the modernisation, industrialisation and growth of our economy.\n\nOur national development philosophy, Nyika inovakwa, inotongwa, inonamatigwa nevene vayo/ ilizwe lakhiwa, libuswe, likhulekelwe ngabanikazi balo, is now embedded nationally, in the mind-sets of our people.\n\nAs such, through this rallying call as well as hard work, focus and determination, our country is realising growth across all sectors of the economy and also a higher quality of life for our people, said President Mnangagwa.\n\nIn the past few weeks alone, President Mnangagwa has officiated at various ceremonies for notable development projects and programmes being championed by the ruling party.\n\nThese included the commissioning of the Shurugwi- Mhandamabwe Road, the Varun Beverages Phase 6 and 7 expansion project, and the launch of the construction of a US$1 billion Titan New Energy Plant, among others.\n\nAs we continue to make efforts to position Zimbabwe as an infrastructure powerhouse, the central role of the iron and steel sector cannot be overemphasised. To this end, the convening of the Zimbabwe Iron and Steel Indaba was a welcome initiative. It stands as a reminder to the party, Government and other stakeholders in the sector to quickly adapt and innovate as we revitalise this important industry of our nation, he said.\n\nFocus, he stated, must be towards guaranteeing that the natural endowments of the country benefit Zimbabweans and help accelerate the modernisation and industrialisation of the economy.\n\nHe commended party members for being instrumental in the success of programmes and activities that were held during the course of the year.\n\nYour individual and collective efforts were instrumental in the success of party programmes and activities held during the course of the year. The spirit of servant leadership and determination to wholeheartedly serve the party and people of our motherland, Zimbabwe, should remain our guiding beacon into the new year. Congratulations on a job well done, he said.\n\nHe also commended the party and Herbert Chitepo School of Ideology for facilitating training and capacity building for the members of the Youth League through the ongoing partnership with the Julius Nyerere School of Leadership.\n\nSuch leadership training programmes along with those conducted with various stakeholders within the country nurture our people to value and promote the ideals of patriotism and Pan-Africanism for the ongoing national development revolution.\n\nThe Chitepo School of Ideology, as a strategic Party and national institution, is directed to remain guided by the founding objectives, spirit and letter, that saw its establishment, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/HE1-5.jpg",
            "description": "Joseph Madzimure, Senior Reporter PRESIDENT Mnangagwa yesterday read the Riot Act on senior party members who are abusing social media platforms to create divisions, discord and confusion among members. This comes as some senior ruling party members have been communicating opinionated views on social media. Addressing the 380th Session of the Politburo yesterday, the President […]",
            "time": "09:46",
            "date": "20 Dec 2024"
        },
        {
            "title": "President launches land tenure programme",
            "url": "https://www.herald.co.zw/president-launches-land-tenure-programme/",
            "content": "Zvamaida Murwira, Senior Reporter\n\nPresident Mnangagwa will today launch the new Land Tenure Implementation Programme in Kwekwe to bolster the land ownership model, unlock huge amounts of finance, spur economic growth and enhance productivity.\n\nThis follows an adjustment to the countrys land tenure system announced by President Mnangagwa in October to improve land tenure security.\n\nUnder the new era, all land held by beneficiaries of the Land Reform Programme under 99-year leases, offer letters and permits, will be held under a bankable, registrable and transferable document.\n\nAddressing the 380th Ordinary Session of the ZANU PF Politburo at the revolutionary partys headquarters, President Mnangagwa, who is also First Secretary of the ruling party, said he will be launching the new programme at Pricabe Farm in Kwekwe.\n\nTomorrow (today) I will be launching the new land tenure implementation programme as we consolidate the gains of land reform. The programme is envisaged to bolster the land ownership model, and enhance access to financing, as well as to encourage production and productivity, said President Mnangagwa.\n\nHe implored communities to remain vigilant as the country seeks to capitalise on weather patterns for improved agricultural output.\n\nIn the agriculture sector, I once again urge communities, village-by-village, ward-by-ward to remain vigilant as we maximise the weather patterns for a successful agriculture season, said the President.\n\nTo ensure the smooth facilitation of the process, the Government issued an indefinite moratorium on the issuance of any new 99-year leases, offer letters and permits for agricultural land.\n\nIn announcing the new policy in October this year, President Mnangagwa said in implementing the new system, priority will be given to veterans of the liberation struggle, youths and women.\n\nIn addition, security of tenure to all agricultural land regularised under this programme will, at all times, only be transferable among indigenous Zimbabweans and land targeted for the new tenure system will exclude communal land that is under the jurisdiction of traditional chiefs.\n\nHe said the noticeable new paradigm amongst Zimbabwean farmers, especially the majority of beneficiaries of the land reform, was to regard and conduct farming as a business, a source of both livelihoods and means to increase personal economic value.\n\nChronicling the background of the programme, President Mnangagwa said the Government, has since 2008, put in place various programmes to assist farmers to be productive on the land through programmes such as the Basic Commodity Supply Side Intervention (Baccossi), Inputs and Mechanisation Equipment, Maguta, and the Special Grains Import Substitution Programme among others.\n\nIn the Second Republic, the country has witnessed and benefited from the Governments deliberate and complementary policy of incorporating accelerated infrastructure development which includes road construction and rehabilitation incorporating the much-needed rural roads, dam construction; irrigation; and housing development, he said.\n\nSome of the challenges, he said, that were faced by farmers in the past include difficulty in accessing affordable finance and varying levels of accountability from the farmers.\n\nThe President has since constituted a Cabinet Oversight Committee chaired by Defence Minister Oppah Muchinguri-Kashiri to lead the reform process.\n\nA technical committee  the Land Tenure Implementation Committee (LTIC)  to coordinate and steer the implementation of this process will also be constituted.\n\nThese Committees will work diligently to develop improved security of tenure for land beneficiaries while ensuring that the value of agricultural and urban State land is fully unlocked to guarantee inclusive and nationwide economic development.\n\nGovernment will put in place all the necessary institutional and logistical mechanisms to ensure the smooth coordination and implementation of these new policies and objectives.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/HE2-6.jpg",
            "description": "Zvamaida Murwira, Senior Reporter President Mnangagwa will today launch the new Land Tenure Implementation Programme in Kwekwe to bolster the land ownership model, unlock huge amounts of finance, spur economic growth and enhance productivity. This follows an adjustment to the country’s land tenure system announced by President Mnangagwa in October to improve land tenure security. […]",
            "time": "09:46",
            "date": "20 Dec 2024"
        },
        {
            "title": "Govt exceeds housing delivery target",
            "url": "https://www.herald.co.zw/govt-exceeds-housing-delivery-target/",
            "content": "Blessings Chidakwa, Herald Reporter\n\nThe Second Republic has successfully delivered 700 000 housing units under National Development Strategy 1 (NDS1), exceeding its initial target of 220 000 and is now approaching a new goal of one million units.\n\nUnder the leadership of President Mnangagwa, the Government has prioritised the provision of affordable, modern and safe houses, recognising housing as a basic and fundamental need.\n\nThe revised target was announced during a media session aimed at enhancing interactions between journalists and Cabinet ministers, facilitated by Information, Publicity, and Broadcasting Services Minister Dr Jenfan Muswere.\n\nAmong the attendees was National Housing and Social Amenities Minister Zhemu Soda, who expressed confidence in surpassing the revised target of one million housing units.\n\nMinister Soda stated that since inception of the Second Republic, guided by the Presidents vision, the Government aimed to construct a substantial number of houses within the National Development Strategy period, which runs from 2021 to 2025.\n\nThe initial target, as I indicated, was 220 000 housing units. When we took stock in April last year, we realised that we had completed 272 000 houses, and the Cabinet is ready to review the target to 1 million housing units. As we speak, we have already achieved more than 700 000 housing units, which accounts for over 70 percent of our targets. This positions us well to achieve our goals by 2025, he said.\n\nMinister Soda emphasised that housing delivery is not solely the responsibility of the Ministry of National Housing; it involves collaboration with various stakeholders, including pension funds, insurance schemes, individuals, and civil society. He noted ongoing partnerships with banks such as BancABC, CBZ, and CABS, highlighting the importance of private sector participation in realising the vision for 2030, which is expected to be led by the private sector.\n\nSo we are crowding in the private sector by creating a conducive investment environment where they can find opportunities to participate in the housing delivery sector, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Muswere-1.jpg",
            "description": "Blessings Chidakwa, Herald Reporter The Second Republic has successfully delivered 700 000 housing units under National Development Strategy 1 (NDS1), exceeding its initial target of 220 000 and is now approaching a new goal of one million units. Under the leadership of President Mnangagwa, the Government has prioritised the provision of affordable, modern and safe […]",
            "time": "09:46",
            "date": "20 Dec 2024"
        },
        {
            "title": "3 commissions sworn in",
            "url": "https://www.herald.co.zw/3-commissions-sworn-in/",
            "content": "Wallace Ruzvidzo, Herald Reporter\n\nPresident Mnangagwa yesterday swore-in commissioners into the Zimbabwe Prisons and Correctional Services Commission (ZPCSC), the Zimbabwe Human Rights Commission (ZHRC) and the Zimbabwe Independent Complaints Commission (ZICC).\n\nMr Simon Madzimure, Mr Albert Mandinika, Ms Rosemary Kanonge, Mr Sternly Kondongwe, Ms Chipo Mandela and Mr Utoile Silaigwana were sworn into the ZPCS Commission.\n\nMr Martin Muduva was sworn into the ZHRC, while Mr Kudakwashe Muchena was sworn into ZICC.\n\nIn an interview after the swearing-in ceremony at State House yesterday, Mr Silaigwana said the ZPCS Commission would diligently discharge its duties as enshrined in the Constitution.\n\nSince we have now been sworn-in by His Excellency the President of Zimbabwe, Dr ED Mnangagwa, in terms of the Constitution of Zimbabwe, especially for the commissioners in the Zimbabwe Prisons and Correctional Services, our priorities are well laid out in the constitution in terms of our functions. We are dedicated to duty, said Mr Salaigwana.\n\nMr Silaigwana said, going forward, the commission would work towards enhancing the efficiency and proficiency of the ZPCS.\n\nThere are issues to do with maybe regulations, where necessary, they must be put in place and also to make sure that the ZPCS enjoys good relations with the civilian population as they interact with them for correctional services as per their mandate, he said.\n\nOn his part, Mr Muchena said he would serve ZICC as a specialist psychologist because mental health issues have become ever so pertinent.\n\nAs you are aware, according to the act of the Zimbabwe Independent Complaints Commission we are supposed to have a psychologist on the panel, so I am there to represent the entire psychology fraternity in Zimbabwe.\n\nFor a very long time, mental health issues have never been a part of the discourse in terms of commissions, but this is the first commission that we see a specialist psychologist being on the panel so that they represent issues that have to do with mental health, he said.\n\nMr Muduva said human rights were fundamental in promoting democracy hence he would discharge his duties diligently.\n\nRemember, these are commissions that have been appointed through the establishment of the Paris Principles.\n\nThe Paris Principles led to the United Nations Commission also adopting the same and it cascades down to national levels where as commissions we are adopting the same. So it is very pertinent for us as a nation to adopt the same to show that we are aligning with global practices and we are a democratic nation, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/HE3-3.jpg",
            "description": "Wallace Ruzvidzo, Herald Reporter President Mnangagwa yesterday swore-in commissioners into the Zimbabwe Prisons and Correctional Services Commission (ZPCSC), the Zimbabwe Human Rights Commission (ZHRC) and the Zimbabwe Independent Complaints Commission (ZICC). Mr Simon Madzimure, Mr Albert Mandinika, Ms Rosemary Kanonge, Mr Sternly Kondongwe, Ms Chipo Mandela and Mr Utoile Silaigwana were sworn into the ZPCS […]",
            "time": "09:46",
            "date": "20 Dec 2024"
        },
        {
            "title": "Zambian envoy consults Sadc Chair",
            "url": "https://www.herald.co.zw/zambian-envoy-consults-sadc-chair/",
            "content": "Wallace Ruzvidzo, Herald Reporter\n\nZambian President Hakainde Hichilema yesterday sent his special envoy, former Vice President Enoch Kavindele to consult President Mnangagwa, who is also SADC Chairperson, on various issues affecting the region.\n\nZambia is fielding a candidate, Dr Samuel Munzele Maimbo, for the Africa Development Bank (AfDB) presidents post and Zimbabwe has already pledged to support his candidature.\n\nIn an interview alongside President Mnangagwa after their closed-door meeting at State House yesterday, Mr Kavindele said they had come to consult the SADC Chair as Harare and Lusaka enjoyed cordial relations.\n\nThe other reason cited by the former VP was President Mnangagwas dedication to leading the regional bloc, hence the consultations.\n\nAs you may be aware, President Mnangagwa is the Chairman of SADC and we (Zambia) were Chairman of the SADC Troika before he came in. So, from time to time, its important that we come to consult the Chair of SADC on many issues.\n\nZambia and Zimbabwe are so gifted that we have a dedicated man in Zimbabwe who knows where we have come from as a region, so I just came here with my team for consultations, he said.\n\nThe former Vice President said their candidate had been endorsed by SADC member states and they had also briefed President Mnangagwa.\n\nThe last time I was here (in July) we were seeking his (President Mnangagwa) support for a Zambian, who wants to be president of the African Development Bank, and indeed the President assisted us and that man has since been endorsed by SADC and we have taken him around, we use the fact that the man was endorsed in Harare. So, it is important that we brief His Excellency (President Mnangagwa), he said.\n\nZambias AfDB candidate, Dr Maimbo, is the current World Bank Group vice president responsible for budget, performance review and strategic planning.\n\nHe is responsible for aligning the World Banks budget with its strategic priorities, financial sustainability objectives, efficiency targets and business needs.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/HE4-2.jpg",
            "description": "Wallace Ruzvidzo, Herald Reporter Zambian President Hakainde Hichilema yesterday sent his special envoy, former Vice President Enoch Kavindele to consult President Mnangagwa, who is also SADC Chairperson, on various issues affecting the region. Zambia is fielding a candidate, Dr Samuel Munzele Maimbo, for the Africa Development Bank (AfDB) president’s post and Zimbabwe has already pledged […]",
            "time": "09:46",
            "date": "20 Dec 2024"
        }
    ]
}