{
    "news": [
        {
            "title": "Freeman calls for more community-building gatherings",
            "url": "https://www.herald.co.zw/freeman-calls-for-more-community-building-gatherings/",
            "content": "Trust Khosa\n\nSoccer-mad Zimdancehall stalwart Sylvster Freeman Chizanga has urged the corporate world to partner with creatives in community-building initiatives.\n\nHis call comes after the recent Pacific Storm social soccer tournament, featuring various musicians at Gwanzura in Highfield, Harare.\n\nVigilance FC won the tournament, taking home US$1 000, while Freemans Gallis FC, King Shaddys Makorokoza FC, and Zim Musicians, captained by Peter Moyo, received consolation prizes in the packed stadium.\n\nAlthough Freeman missed the tournament due to other commitments, he expressed his support for his team and commended the organizers for uniting musicians and fans.\n\nIts important for people to connect with artists in person. They might resonate with you more than through radio, and that can lead to new followers. People can fall in love with your character as a celebrity, he said.\n\nFreeman praised his team for their commitment over the past year.\n\nThey participated not just because Im the leader but because they have a passion for the game. Their effort is evident in every tournament.\n\nAs a youth icon, Freeman acknowledged the organisers efforts to combat drug abuse through the event.\n\nDrug abuse is often linked to unemployment and bad influences. However, there are many ways to escape these temptations. When idle, try reading, researching, meditating, praying, or going to the gym. Self-empowerment can be a powerful escape route.\n\nHe also offered advice to aspiring musicians.\n\nBe true to yourself. The internet can mislead you into thinking that youre falling behind, but no one posts their failures online. Trust your process and embrace your journey; eventually, youll succeed.\n\nPacific Storm marketing manager Kuda Chiutsi assured the youth that more community-centred programmes are on their way.\n\nThis tournament is part of the numerous initiatives we implement at Pacific Cigarette Company.\n\nIt is aimed at promoting community cohesion and addressing issues affecting young adults. We believe that the tournament has sparked more projects that will enhance local economies and improve livelihoods for all, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/freeman.jpg",
            "description": "Soccer-mad Zimdancehall stalwart Sylvster “Freeman” Chizanga has urged the corporate world to partner with creatives in community-building initiatives.",
            "time": "2024-12-13 20:52:15"
        },
        {
            "title": "Live Coverage : President Mnangagwa in Botswana to meet SADC secretariat",
            "url": "https://www.herald.co.zw/live-coverage-president-mnangagwa-in-botswana-to-meet-sadc-secretariat/",
            "content": "10.30 President Mnangagwa has arrived in Botswana for his maiden visit to the SADC Secretariat Headquarters as Chairman of the regional bloc.\n\nHe was welcomed by Botswana Minister of Foreign Affairs Phenyo Butale, Botswana Ambassador to Zimbabwe Ms Sarah Molosiwa and Zimbabwean Ambassador to Botswana Henry Mukonoweshuro.\n\n10.33 During his tenure, the President will push the realisation of the SADC Regional Indicative Strategic Development Plan (RISDP 2020-2030) and SADC Vision 2050.\n\nThe two strategic plans seek to further deepen Southern Africas regional integration and foster development.\n\nThey are premised on three interrelated pillars; Industrial Development and Market Integration; Infrastructure Development in support of Regional Integration; and Social and Human Capital Development.\n\n10.37 The President was also welcomed by a military guard of honour under a cloudy sky. He is now proceeding for a briefing at a local hotel before the commencement of his itinerary which will see him meeting the SADC Secretariate management and staff. As Chair, the President will also be handed over the recently acquired SADC Secretariat Headquarters building before presiding over a ground-breaking ceremony of the SADC Regional Logistics Depot.\n\n10.53 During their tenure, SADC Chairpersons traditionally visit the Secretariat to engage with management and address staff, as well as get an appreciation of day to day operations.Accompanying President Mnangagwa during his itinerary will be Botswanas President Duma Gideon Boko, as the host leader.\n\n10.56 What SADC Chairpersons do on maiden SADC Secretariat visit\n\n Welcomed at SADC House by Executive Secretary Mr Elias Magosi, supported by the SADC Secretariat Management and the SADC Ambassadors and High Commissioners accredited to the Republic of Botswana and SADC\n\n ushered by the SADC Executive Secretary to sign the guest book\n\n ushered to the Julius Nyerere SADC Library to appreciate the SADC History Collection\n\n Photo Session in the SADC Secretariat reception area with SADC Ambassadors based in the Republic of Botswana\n\n SADC Chair Unveils the Visiting Placard\n\n Photo Session in front of the SADC Secretariat building\n\n SADC Chair and Chairperson of the Council of Ministers meet with regional blocs Management team\n\n Briefing on the mandate, functions and structure of the SADC Secretariat\n\n Briefing on Priorities of SADC, and Overall Status of Regional Integration in SADC\n\n SADC Chair gives reaction and guidance\n\n meeting with all SADC Secretariat Staff\n\n11.33 President Mnangagwa has begun the tour\n\n12.15 The SADC Chair is now in a meeting with the Secretariat management.\n\nIn the meeting, Mr Magosi will give introductory remarks and thereafter, a video on the SADC Vision and RISDP 2020-2030 priority areas will be played.\n\nDeputy Executive Secretary Dr Judith Kateera will then give a briefing on the mandate, functions and structure of the SADC Secretariat.\n\nAt the end of the meeting the President will give a reaction and proffer guidance on the way forward\n\n13.06 President Mnangagwa share notes with Botswanas President BokoBotswanas President Duma Gideon Boko and President Emmerson Mnangagwa are now having a tte--tte.Zimbabwe and Botswanas relations have continued to grow in leaps and bounds as evidenced by frequent engagements at Head of State level in the last two months.President Boko, as the host President, is accompanying President Mnangagwa during his visit to Botswana.\n\n13.34 SADC Secretariat headquarters to be handed over to President Mnangagwa\n\nAs chair, the President will be handed over the recently acquired SADC Secretariat Headquarters building in Gaborone, Botswana.\n\nPrior to the buildings purchace, SADC had been leasing it for about 18 years.\n\nBongwe Investments board member Neo Bogatsu said they worked cordially with SADC until the\n\n13.34 President Boko pledges Botswanas commitment to regional integration\n\nBotswana is committed to regional integration and that of the continent at large, newly elected President Duma Boko has said.\n\nHe was speaking at the handover of the SADC Secretariat Headquarters to President Mnangagwa, who is the blocs chairman, this afternoon.\n\nPresident Boko said Botswana appreciates President Mnangagwas leadership as SADC chairman.\n\nThe SADC chair and I are her to receive this building and attest to this significant milestone. We are here to reaffirm the binds and bonds that hold us together, he said.\n\nThis is a propitious moment which began over 20 years ago when a decision was taken in Luanda to establish the SADC Headquarters in Botswana.\n\nThe idea moved from words spoken into concept crystallised, examples enacted and it is a spectacular outcome attained.\n\nPresident Boko concluded his speech by indicating that SADC stands out as a source of hope, strength, unity, resilience and social cohesion.\n\n13.49 SADC headquarters handed over to President Mnangagwa\n\nThe SADC Headquarters Building has been handed over to President Mnangagwa, who is the chairman of the regional bloc.\n\nHe received the building on behalf of the regions Heads of State and Government.\n\nPrior to its handover, the edifice was under management through a public-private-partnership agreement involving SADC, Bongwe Investments (Proprietary) Limited as the private party and the Botswana government as a guarantor to the arrangement.\n\nSpeaking at the hand-over ceremony this afternoon, President Mnangagwa said the building testifies the importance of collaborative efforts.\n\nSADC House should be an embodiment of the regions history, culture and heritage. The building testifies the importance of collaborative efforts. I congratulate all parties involved in the publicprivate partnership.\n\nPresident Mnangagwa went on to congratulate President Boko on his recent election victory.\n\nBotswana is our second home. Our two countries enjoy excellent multi-faceted relations. And the enabling environment in Botswana allows the SADC secretariat to execute the blocs mandate seamlessly.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/img-ed-1-680x380.jpeg",
            "description": "10.30 – President Mnangagwa has arrived in Botswana for his maiden visit to the SADC Secretariat Headquarters as Chairman of the regional bloc. He was welcomed by Botswana Minister of Foreign Affairs Phenyo Butale, Botswana Ambassador to Zimbabwe Ms Sarah Molosiwa and Zimbabwean Ambassador to Botswana Henry Mukonoweshuro. 10.33 – During his tenure, the President will push […]",
            "time": "2024-12-13 20:52:15"
        },
        {
            "title": "Zimbabwe prepares for tropical cyclone",
            "url": "https://www.herald.co.zw/zimbabwe-prepares-for-tropical-cyclone/",
            "content": "Mutsawashe Mashandure\n\nHerald Correspondent\n\nZimbabwe is ramping up measures to mitigate the potential impacts of Tropical Cyclone Chido, currently positioned northeast of Madagascar.\n\nMeteorological officials have indicated that while the cyclone poses a significant threat to regions near its path, its effects on Southern Africa, including Zimbabwe, are expected to be minimal.\n\nChido is the name given to a tropical cyclone that is currently forming in the Indian Ocean, characterized by strong winds and heavy rainfall.\n\nDuring the cyclone alert press conference, the Met Department head of forecasting Mr James Ngoma highlighted that southern Africa will be less impacted by Cyclone Chido.\n\nThe cyclone should be almost 2000 km from Harare. From there, it will move to Comoros Island from the Indian Ocean to the northern parts of Mozambique near the Nacala district, where we expect heavy impacts.\n\nWhen it enters southern Africa, it will have less impact. The spin speed will be reduced from 200 km/h to 50 km/h. The trajectory will also change once it reaches Comoros. It might change direction to the south, north, or west.\n\nHe highlighted the areas that are most likely to be impacted by Cyclone Chido.\n\nStarting from Sunday, we expect rainfall in Matabeleland North, Matabeleland South, Masvingo, Midlands, and Harare, with the expectation of widespread rainfall across the whole country by the 16th , he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/12/190126-Heavy-rains-Mullaitivu-NH-2.jpg",
            "description": "Mutsawashe Mashandure Herald Correspondent Zimbabwe is ramping up measures to mitigate the potential impacts of Tropical Cyclone Chido, currently positioned northeast of Madagascar. Meteorological officials have indicated that while the cyclone poses a significant threat to regions near its path, its effects on Southern Africa, including Zimbabwe, are expected to be minimal. Chido is the […]",
            "time": "2024-12-13 20:52:15"
        },
        {
            "title": "Five robbers arrested during a shootout",
            "url": "https://www.herald.co.zw/five-robbers-arrested-during-a-shootout/",
            "content": "Crime Reporter\n\nFIVE robbers who were targeting families and business premises in and around Bulawayo have been arrested.\n\nThe five are Nkosiyazi Nyathi (20), Vusumuzi Ncube (22), Mgcini Sibanda (24), Mlungisi Ndlovu (41) and Nkosiyazi Moyo (27).\n\nPolice have since launched a manhunt for Alex Nyathi alias Samduduzi who is the sixth suspect and is still at large.\n\nOne pistol has been recovered from the suspects who were mostly committing armed robbery cases in and around Cowdray Park while armed with two pistols.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/12/Arrested.jpg",
            "description": "Crime Reporter FIVE robbers who were targeting families and business premises in and around Bulawayo have been arrested. The five are Nkosiyazi Nyathi (20), Vusumuzi Ncube (22), Mgcini Sibanda (24), Mlungisi Ndlovu (41) and Nkosiyazi Moyo (27). Police have since launched a manhunt for Alex Nyathi alias Samduduzi who is the sixth suspect and is […]",
            "time": "2024-12-13 20:52:15"
        },
        {
            "title": "Man jailed 15 years for kidnapping and raping minor",
            "url": "https://www.herald.co.zw/man-jailed-15-years-for-kidnapping-and-raping-minor/",
            "content": "Thupeyo Muleya\n\nBeitbridge Bureau\n\nA 20-year-old man from Ndambe Village in Beitbridge has been sentenced to 15 years in prison for kidnapping and raping a 16-year-old Form Three pupil who had rejected his love proposal.\n\nDominic Chirenje denied the charges when the trial opened before Beitbridge regional magistrate Ms Charity Maphosa.\n\nHowever, Ms Maphosa convicted him on Thursday due to the strength of the States evidence.\n\nThe magistrate imposed a 15-year effective sentence after conditionally suspending three years of his initial 18-year term.\n\nProsecutor Miss Tsitsi Mtukwa said on July 31 last year, there was a livestock sales show at Jam Farm, and both the complainant and the accused attended.\n\nLater that evening around 9pm, Chirenje proposed to the complainant, but she turned him down.\n\nAt approximately 9:30pm as the girl and her friends were leaving the farm to head home, the accused followed them.\n\nWhen he caught up with them, he ordered the girls friends to go home and kidnapped her.\n\nThe court further heard that after traveling for close to 5 km in his donkey-pulled cart, Chirenje stopped the wagon, dragged the girl into the bushes, and raped her before disappearing from the scene, leaving her behind.\n\nThe complainant managed to get home and reported the incident to the police the following day.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/08/Court.jpg",
            "description": "Thupeyo Muleya Beitbridge Bureau A 20-year-old man from Ndambe Village in Beitbridge has been sentenced to 15 years in prison for kidnapping and raping a 16-year-old Form Three pupil who had rejected his love proposal. Dominic Chirenje denied the charges when the trial opened before Beitbridge regional magistrate Ms Charity Maphosa. However, Ms Maphosa convicted […]",
            "time": "2024-12-13 20:52:15"
        },
        {
            "title": "SADC headquarters handed over to President Mnangagwa",
            "url": "https://www.herald.co.zw/sadc-headquarters-handed-over-to-president-mnangagwa/",
            "content": "Online Reporter\n\nThe SADC Headquarters Building has been handed over to President Mnangagwa, who is the chairman of the regional bloc.\n\nHe received the building on behalf of the regions Heads of State and Government.\n\nPrior to its handover, the edifice was under management through a public-private-partnership agreement involving SADC, Bongwe Investments (Proprietary) Limited as the private party and the Botswana government as a guarantor to the arrangement.\n\nSpeaking at the hand-over ceremony this afternoon, President Mnangagwa said the building testifies the importance of collaborative efforts.\n\nSADC House should be an embodiment of the regions history, culture and heritage. The building testifies the importance of collaborative efforts. I congratulate all parties involved in the publicprivate partnership.\n\nPresident Mnangagwa went on to congratulate President Boko on his recent election victory.\n\nBotswana is our second home. Our two countries enjoy excellent multi-faceted relations. And the enabling environment in Botswana allows the SADC secretariat to execute the blocs mandate seamlessly.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/B8-680x380.jpeg",
            "description": "Online Reporter The SADC Headquarters Building has been handed over to President Mnangagwa, who is the chairman of the regional bloc. He received the building on behalf of the region’s Heads of State and Government. Prior to its handover, the edifice was under management through a public-private-partnership agreement involving SADC, Bongwe Investments (Proprietary) Limited as […]",
            "time": "2024-12-13 20:52:15"
        },
        {
            "title": "ZBC receives 25 vehicles, radio and TV equipment",
            "url": "https://www.herald.co.zw/zbc-receives-25-vehicles-radio-and-tv-equipment/",
            "content": "Rumbidzayi Zinyuke\n\nSenior Reporter\n\nInformation Publicity and Broadcasting Services Minister Dr Jenfan Muswere has commissioned 25 vehicles and equipment for radio and television transmission.\n\nThe equipment, which was secured through a donation of over US$2 million from the Ministry of Finance, Economic Development and Investment Promotion, the Ministry of Information, Publicity and Broadcasting Services and a private donor, is part of the state broadcasters recapitalisation programme.\n\nEquipment for radio and television transmission includes playback servers, vision and audio consols, cameras and information communication technology equipment to enhance production.\n\nThis donation is expected to improve operations at the ZBC and restore its viability.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/zbc.jpg",
            "description": "Rumbidzayi Zinyuke Senior Reporter Information Publicity and Broadcasting Services Minister Dr Jenfan Muswere has commissioned 25 vehicles and equipment for radio and television transmission. The equipment, which was secured through a donation of over US$2 million from the Ministry of Finance, Economic Development and Investment Promotion, the Ministry of Information, Publicity and Broadcasting Services and […]",
            "time": "2024-12-13 20:52:15"
        },
        {
            "title": "President Boko pledges Botswana’s commitment to regional integration",
            "url": "https://www.herald.co.zw/president-boko-pledges-botswanas-commitment-to-regional-integration/",
            "content": "Online Reporter\n\nBotswana is committed to regional integration and that of the continent at large, newly elected President Duma Boko has said.\n\nHe was speaking at the handover of the SADC Secretariat Headquarters to President Mnangagwa, who is the blocs chairman, this afternoon.\n\nPresident Boko said Botswana appreciates President Mnangagwas leadership as SADC chairman.\n\nThe SADC chair and I are here to receive this building and attest to this significant milestone. We are here to reaffirm the binds and bonds that hold us together, he said.\n\nThis is a propitious moment which began over 20 years ago when a decision was taken in Luanda to establish the SADC Headquarters in Botswana. The idea moved from words spoken into concept crystallised, examples enacted and it is a spectacular outcome attained.\n\nPresident Boko concluded his speech by indicating that SADC stands out as a source of hope, strength, unity, resilience and social cohesion.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/B10-680x380.jpeg",
            "description": "Online Reporter Botswana is committed to regional integration and that of the continent at large, newly elected President Duma Boko has said. He was speaking at the handover of the SADC Secretariat Headquarters to President Mnangagwa, who is the bloc’s chairman, this afternoon. President Boko said Botswana appreciates President Mnangagwa’s leadership as SADC chairman. “The […]",
            "time": "2024-12-13 20:52:15"
        },
        {
            "title": "Cde Mphoko to be buried in Bulawayo in line with his wishes",
            "url": "https://www.herald.co.zw/cde-mphoko-to-be-buried-in-bulawayo-in-line-with-his-wishes/",
            "content": "Joseph Madzimure\n\nZimpapers Politics Hub\n\nNational hero former Vice President Phelekezela Mphoko will be buried at his home in Bulawayo on Sunday upon his family request.\n\nHome Affairs and Cultural Heritage Minister Kazembe Kazembe confirmed the development.\n\nActing President Chiwenga presided over the send-off ceremony of the national hero this morning as he was flown from Harare to Bulawayo.\n\nCde Mphokos body arrived in the country from India yesterday.\n\nMinister Kazembe described the late former Vice President Mphoko as a dedicated cadre who sacrificed his life to liberate the country.\n\nCde Mphokos young brother Mr Ndabezinhle Mphoko commended the Government for according his brother heros status.\n\nThe recognition will last forever. Our family is not in conflict with the Government in any way. We are burying our brother at his home in Bulawayo in line with his wishes. We are just fulfilling his wishes, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/CDES-AND-FRIENDS.jpg",
            "description": "Joseph Madzimure Zimpapers Politics Hub National hero former Vice President Phelekezela Mphoko will be buried at his home in Bulawayo on Sunday upon his family’ request. Home Affairs and Cultural Heritage Minister Kazembe Kazembe confirmed the development. Acting President Chiwenga presided over the send-off ceremony of the national hero this morning as he was flown […]",
            "time": "2024-12-13 20:52:15"
        },
        {
            "title": "Saintfloew, Levels, DJ Tamuka to Headline Carling Black Label DJ Clash",
            "url": "https://www.herald.co.zw/saintfloew-levels-dj-tamuka-to-headline-carling-black-label-dj-clash/",
            "content": "Trust Khosa\n\nRap sensation Saintfloew, Chillspot Records co-director Levels, and DJ Tamuka will take to the stage at the 2024 Carling Black Label DJ Clash.\n\nThe event is set to take place at the Hippodrome in Braeside, Harare, on December 20.\n\nNow in its second year, the DJ Clash aims to unite emerging and talented DJs under one roof, providing them with a platform to showcase their skills.\n\nIn a statement, Delta Corporation marketing manager Irimayi Muzorewa said: After an extensive search across eight regions and the review of over 350 mixtapes, the time to crown Zimbabwes ultimate Champion DJ is almost here.\n\nCongratulations to the 25 finalists who will gather in Harare for the national finals on December 20, 2024, at the Hippodrome. Reigning champion DJ Irvene X will compete against this years finalists to defend his title, he said.\n\nIrimayi also announced that two finalists will be awarded top honours from a prize pool totalling US$15 000.\n\nThe overall winner will receive US$3 000, a controller, an Apple MacBook, studio monitors, and a cordless microphone.\n\nThe second finalist will win US$2 000, a studio monitor, and a cordless microphone.\n\nIn addition to the DJ competition, top performers, including Saintfloew, will bring diversity to the event.\n\nThis year, we will feature guest artists covering the Zimdancehall and hip-hop genres. Saintfloew, Voltz, and ChillSpot (represented by Levels) will face off against Mushroom Media (represented by DJ Tamuka) at the event.\n\nTickets are currently available for US$5, stated Irimayi.\n\nUnder the Carling Black Label brand, this contest recognises and rewards the champion within everyone.\n\nThe campaign aims to uplift and showcase champion DJs nationwide, highlighting their musical talents as they work towards building a brighter future for themselves.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/03/Irimayi-Muzorewa.jpg",
            "description": "Trust Khosa Rap sensation Saintfloew, Chillspot Records co-director Levels, and DJ Tamuka will take to the stage at the 2024 Carling Black Label DJ Clash. The event is set to take place at the Hippodrome in Braeside, Harare, on December 20. Now in its second year, the DJ Clash aims to unite emerging and talented […]",
            "time": "2024-12-13 20:52:15"
        }
    ]
}