{
    "news": [
        {
            "title": "Masvingo gets the kiss of life",
            "url": "https://www.herald.co.zw/masvingo-gets-the-kiss-of-life/",
            "content": "Blessings Chidakwa in MASVINGO\n\nTHE face of Masvingo Province is undergoing a significant transformation due to value addition and beneficiation of minerals, along with various signature projects initiated under President Mnangagwas leadership.\n\nThese initiatives are reshaping the local economy and improving the quality of life for residents.\n\nAmong prominent projects are the Bikita Minerals Spodumene and Palatine plants, which are pivotal in enhancing local mineral processing capabilities.\n\nIn addition, a US$1 million health facility has been established at the mine, featuring advanced X-ray equipment and a maternity ward, making it a first-of-its-kind centre in the district.\n\nTo improve power connectivity, a US$30 million Tokwe-Bikita 132KV powerline has been laid in record time.\n\nThis new infrastructure has significantly boosted power availability for both the mine and surrounding communities.\n\nIt is expected to support increased production and improved living standards.\n\nEmployment opportunities in the region are also on the rise.\n\nA newly-minted US$60 million chrome smelting plant in Mashava has created over 230 direct jobs for locals.\n\nThe plant is part of a broader strategy to ensure the benefits of mineral wealth are shared with the community.\n\nThis came out yesterday during the Masvingo provincial media tour led by Information, Publicity, and Broadcasting Services Minister Dr Jenfan Muswere.\n\nInformation, Publicity and Broadcasting Services Minister Dr Jenfan Muswere (right) chats with Minister of State for Masvingo Provincial Affairs and Devolution Ezra Chadzamira during a tour of Zimbabwe Zhongxin Smelting Company Ltd(ZZSC) site in Mashava yesterday. Picture: Charles Muchakagara\n\nHe was accompanied by Masvingo Provincial Affairs and Devolution Minister Ezra Chadzamira.\n\nDr Muswere said the mines were a game-changer, not only in terms of employment creation, but also value addition.\n\nThe value chains in terms of chrome ore, which comes from Lalapanzi, Shurugwi, (and) Mashava, is part of the direct economic empowerment programme where most of the mining claims are owned by Zimbabweans, he said.\n\nA number of clinics have been built utilising devolution funds, which speaks to the decentralisation of resources under the leadership of President E.D. Mnangagwa.\n\nMasvingo Province is also home to a US$14,5 million mini-hydropower plant located at Lake Mutirikwi.\n\nThe facility generates 5 megawatts and supports various initiatives, including irrigation, tourism, and fisheries.\n\nIt serves as a critical resource for local farmers and businesses.\n\nDevolution funds are playing a crucial role in facilitating the construction of health facilities throughout the province.\n\nNotable projects include NatPharm Clinic, Runyararo West Clinic, and the Great Zimbabwe University Medical School.\n\nThe developments underscore the Second Republics commitment to improving healthcare access in the region.\n\nDr Muswere said the Mutirikwi hydro power station embodies a whole-of-Government approach to development.\n\nInformation, Publicity and Broadcasting Services Minister Dr Jenfan Muswere (right) accompanied by Minister of State for Masvingo Provincial Affairs and Devolution Ezra Chadzamira lead the delegates during a tour of Zimbabwe Zhongxin Smelting Company Ltd(ZZSC) site in Mashava yesterday. Picture: Charles Muchakagara\n\nIt is not only an energy source, but also part of an integrated plan that includes fisheries, tourism, and hospitality services.\n\nThis strategy aims to create downstream benefits, supporting thousands of farmers through irrigation and other agricultural activities.\n\nDr Muswere pointed out that the damming infrastructure in Masvingo is essential for the provinces agricultural success.\n\nWith its extensive network of dams, the region is well-positioned to ensure food and nutrition security, he observed.\n\nMore dams are under construction, further bolstering these efforts.\n\nSo the damming infrastructure in Masvingo Province, which is the most dammed province in terms of our geography as a country, will continue to employ a number of irrigation employees, also a number of irrigation works across all this damming infrastructure, with a total population in Zimbabwe of around 10 600, said Dr Muswere.\n\nMinister Chadzamira expressed pride in the achievements of the Second Republics policies in Masvingo.\n\nAmong the companies contributing to this growth is Zhongxin Smelting, a beneficiation value addition enterprise.\n\nThe company plays a vital role in enhancing the local economy and contributing to the national Gross Domestic Product.\n\nIt also empowers youth, women, and war veterans by providing them with economic opportunities, said Minister Chadzamira.\n\nThose who are mining (locals), are also benefitting through selling their products to this mine.\n\nSo as a province, we are very happy with the coming in of this smelting company, he said.\n\nInformation, Publicity and Broadcasting Services Minister Dr Jenfan Muswere (right) chats with Minister of State for Masvingo Provincial Affairs and Devolution Ezra Chadzamira during a tour of Zimbabwe Zhongxin Smelting Company Ltd(ZZSC) site in Mashava yesterday. Picture: Charles Muchakagara\n\nBikita Minerals public relations officer, Mr Collins Nikisi, said the mine has completed the setup of a 112km power line and transmission infrastructure. The development brings a dedicated 90MW of power to Bikita and allows for surplus power to be fed into the national grid.\n\nBikita Minerals has also invested over US$1 million to establish a modern clinic for the local community, offering specialist services in areas such as X-rays, optometry, and cardiovascular testing.\n\nZimbabwe Zhongxin Smelting Company official, Mr Paul Machongoni, said the firm employs more than 230 locals and has a capacity to process 1 500 tonnes of ore per month.\n\nThe company relies on raw materials sourced from the local community, reinforcing the connection between mining operations and community livelihoods.\n\nThis approach ensures that the benefits of mineral wealth are felt throughout the province, paving the way for a brighter future for Masvingo.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/M1-1.jpg",
            "description": "Blessings Chidakwa in MASVINGO THE face of Masvingo Province is undergoing a significant transformation due to value addition and beneficiation of minerals, along with various signature projects initiated under President Mnangagwa’s leadership. These initiatives are reshaping the local economy and improving the quality of life for residents. Among prominent projects are the Bikita Minerals Spodumene […]",
            "time": "06:37",
            "date": "22 Jan 2025"
        },
        {
            "title": "Triple national heroes’ burial today",
            "url": "https://www.herald.co.zw/triple-national-heroes-burial-today/",
            "content": "Herald Reporters\n\nTHREE national heroes  Major-General (Retired) Solomon Siziba, Cde Chenhamo Chen Chakezha Chimutengwende and Ambassador John Shumba Mvundura  are set to be buried at once at the National Heroes Acre in Harare today, marking the third time this has happened since Independence in 1980.\n\nActing President Dr Constantino Chiwenga is set to preside over the triple burial.\n\nHome Affairs and Cultural Heritage Minister Kazembe Kazembe confirmed the latest developments.\n\nAll the national heroes will be buried tomorrow (today); it will be a triple heroes burial, he said.\n\nThe Acting President General (Rtd) Dr Chiwenga will preside over the burials of the three national heroes.\n\nThe first time that Zimbabwe buried three national heroes at once was on January 26, 2021, when three national heroes  Lieutenant-General (Rtd) Dr Sibusiso Busi Moyo, Dr Joel Biggie Matiza and Major-General (Rtd) Paradzai Zimondi  were buried on the same day.\n\nThe second occasion was on April 29 last year when Cde Nash Nyasha Dzimiri, Brigadier-General Shadreck Vezha and Cde Tsitsi Grace Jadagu, were buried at the national shrine.\n\nActing Home Affairs and Cultural Heritage Permanent Secretary Mr Mike Masaka appealed to Zimbabweans to turnout in their numbers to give the three national heroes a befitting send-off.\n\nThe Government has provided buses to the provinces where our national heroes hail from.\n\nWe have provided buses in Mashonaland Central, Manicaland, Bulawayo and Matabeleland South provinces, said Mr Masaka.\n\nPallbearers carry the casket bearing the body of national hero Cde Chenhamo Chimutengwende at Charles Gumbo Barracks in Harare yesterday.  Picture: Edward Zvemisha\n\nGates to the National Heroes Acre are set to open at 6am and mourners are expected to be seated by 7am.\n\nYesterday, a service was held in Mutare for Ambassador Mvundura, where speakers praised Governments decision to accord him national hero status.\n\nZANU PF Politburo member Cde Supa Mandiwanzira said it is through people like Ambassador Mvundura that young leaders in the party were finding their feet on the political terrain.\n\nI am here to thanks to Ambassador Mvundura for the good works he carried out during his lifetime. I am also here to thank the President Dr Emmerson Mnangagwa for his decision to bestow Ambassador Mvundura with national hero status, he said.\n\nI would not be where I am today as a young party leader had it not been for people like Ambassador Mvundura and his fellow cadres.\n\nI read in The Sunday Mail at some point that when Ambassador Mvundura went to join the liberation struggle in Tembwe, he was tortured together with his colleagues back then because they were suspected to have been on a spying mission.\n\nHowever, together with his colleagues, he never looked back until they convinced the leadership of the armed struggle that they were genuine cadres who were out to liberate the country from the shackles of colonialism.\n\nMinister of State for Manicaland Provincial Affairs and Devolution, Advocate Misheck Mugadza, said Ambassador Mvundura shaped his early political consciousness as a ZANU PF cadre.\n\nWhen I speak of Ambassador Mvundura I am speaking about a leader that I really know as he was my father, the late Kenneth Manyondas best friend.\n\nHe was one person who had great respect for lawyers and personally he helped shape my early political career. I really want to thank our leader President Emmerson Mnangagwa for the national hero status. As the people of Manicaland, we feel honoured that our deserving leaders are getting the recognition they duly deserve, said Advocate Mugadza.\n\nPallbearers carry the casket bearing the body of national hero Chen Chimutengwende at Charles Gumbo Barracks in Harare yesterday.  Picture: Edward Zvemisha\n\nWar Veterans representative, Cde Nyasha Manyanhaire and ZANU PF Manicaland chairman Cde Tawanda Mkodza, among others, attended the service.\n\nAmbassador Mvunduras body was later airlifted to Harare, where it lay in state ahead of burial today.\n\nSimilarly, Cde Chimutengwendes body was taken back to Harare yesterday afternoon from his rural home in Chiweshe where it was taken on Monday to allow family, friends and the entire province to bid him farewell.\n\nIn respect of Maj-Gen Siziba, the body was taken back to Harare on Monday after a full military funeral parade held in Bulawayo at Lookout Masuku Barracks, where Commander Defence Forces, General Philip Valerio Sibanda, was the chief mourner.\n\nThe bodies of the national heroes yesterday lay in state at Charles Gumbo Barracks ahead of burial today.\n\nYesterday, Maj-Gen Sizibas cousin, Mr Obert Siziba, said that during his upbringing, the late national hero was a role model, not only to his siblings but also other youngsters in the Nhwali community in Gwanda South.\n\nHe noted that Maj-Gen Siziba was among the few individuals who defied the odds by excelling in his education during the colonial Bantu Education System, which was designed to restrict black peoples progress.\n\nHe was one of the few young people who secured a place at Manama High School, which was reserved for the academically gifted.\n\nOur brother loved school very much, and he did well. He used to help us a lot with school and encouraged us to attend classes, said Mr Siziba.\n\nWe all aspired to be like him. He took many of us under his wing and assisted us with our studies. He attended Nhwali Primary School and did so well that he managed to secure a place at Manama High School, which was reserved for the academically gifted.\n\nDuring the school holidays, he would come home and teach us how to speak English. His ability to speak English made him popular among other children in the community, but he never let it go to his head, he added.\n\nHe remained kind and humble. The education system at the time was designed to disadvantage black people, but despite the obstacles, my brother soared high.\n\nMr Bethuel Siziba said the national hero consistently made an effort to assist not only his immediate family but also the broader family and community whenever he could.\n\nHe recalled that last year, hundreds of people were able to obtain birth certificates and national identity cards after his late brother engaged the Registry Department to provide a three-day service at Nhwali High School.\n\nMs Angelina Dube, another cousin of the late liberation icon, said their family and community gained valuable recognition and status because of Maj-Gen Sizibas work.\n\nThe lives of many people in our community and family improved because of our late brothers influence. He encouraged people to pursue education or engage in livelihood projects that could improve their well-being, she said.\n\nWe are proud of him as a family, as we are now recognised and have been elevated because of his good and influential works.\n\nThe Nhwali community has also gained prominence and has experienced significant development due to his efforts. We will always remember him and remain grateful.\n\nMaj-Gen Siziba attended Nhwali Primary School before proceeding to Manama High School in 1976, where he began Form One.\n\nThe following year, he joined the armed struggle from school alongside the now-late national hero, Lt-Gen Sibusiso Moyo, Beitbridge East MP Albert Nguluvhe, former Commander Air Force Commander Air Chief Marshal (Rtd) Elson Moyo, and former Zimbabwe International Trade Fair (ZITF) public relations manager Mrs Cecilia Bhebhe, among other cadres.\n\nMaj-Gen Siziba underwent military training in Zambia and, during the ceasefire, was attested into the Zimbabwe National Army (ZNA).\n\nHe was stationed at the Zimbabwe Military Academy, where he rose to the rank of Captain. He was later transferred to ZNA Headquarters, where he worked until 2005, rising to the position of Lieutenant-Colonel.\n\nHe was posted to Botswana as Defence Attach from 2005 to 2013, based at the Zimbabwean Embassy.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/H1.jpg",
            "description": "Herald Reporters THREE national heroes — Major-General (Retired) Solomon Siziba, Cde Chenhamo “Chen” Chakezha Chimutengwende and Ambassador John Shumba Mvundura — are set to be buried at once at the National Heroes Acre in Harare today, marking the third time this has happened since Independence in 1980. Acting President Dr Constantino Chiwenga is set to […]",
            "time": "06:37",
            "date": "22 Jan 2025"
        },
        {
            "title": "Zanu PF, CCC to share ZiG170 million",
            "url": "https://www.herald.co.zw/zanu-pf-ccc-to-share-zig170-million/",
            "content": "Zvamaida Murwira, Senior Reporter\n\nZanu PF and the Citizens Coalition for Change will this year share ZiG$170 million that Treasury allocated in the National Budget to fund political parties meeting the required voter threshold under the Political Parties Finance Act.\n\nThe money will be distributed based on the number of seats a party got in the National Assembly.\n\nAccording to Treasurys blue book, which provides ultra-fine details of how money under the Budget is spent, qualifying political parties have been allocated ZiG$170 million for this year.\n\nFor a political party to qualify, it should have registered a five percent threshold of the total votes cast in a general election.\n\nThis leaves Zanu PF and CCC as the only political parties meeting the threshold, thereby qualifying to get a share of State funding.\n\nZanu PF is set to get the largest share of the ZiG$170 million given that it enjoys a comfortable two thirds majority in the National Assembly.\n\nZanu PF garnered 137 geographical constituencies in the August 2023 general election while CCC won 73, leaving the revolutionary party to get the bulk of the money.\n\nA rough calculation shows that Zanu PF will get almost ZiG$111 million while CCC will get around ZiG$59 million.\n\nZanu PF director of information and publicity, Cde Farai Marapira said the money will go a long way in funding and enhancing the ruling partys activities.\n\nAs Zanu PF we appreciate these funds as they enable us to rejuvenate and revamp our party. As a party with structures, these funds assist us in getting feedback from our grassroots as well as communicating leadership positions. We have offices and officers and attendant office bills that need to be paid and these funds go a long way in ensuring this happens, said Cde Marapira.\n\nAdvocate Nqobizitha Mlilo, spokesperson for CCC interim secretary-general, Senator Sengezo Tshabangu said while the opposition appreciates the money disbursed under the Political Parties Finance Act, they will comment substantively once the money has been released to them.\n\nGovernment promulgated Political Parties Finance Act to prevent foreign funding of political activities in the country.\n\nThis was after the discovery that the main former opposition party, the MDC, and other smaller parties were receiving funding from foreign governments and organisations and using the funding for regime change.\n\nPolitical parties can now receive lawful funding through Government grants under the Act, sale of party cards, fundraising activities and donations from local well-wishers from party members.\n\nGovernment has also since gazetted the Private Voluntary Organisations Amendment Bill that prohibits non-government organisations from campaigning for political parties or candidates.\n\nThe Bill, currently before Parliament came after it emerged that civic society and NGOs were being used as conduits for illegal activities by some political parties and hostile foreign agencies.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/10/Cde-Farai-Marapira.jpg",
            "description": "Zvamaida Murwira, Senior Reporter Zanu PF and the Citizens Coalition for Change will this year share ZiG$170 million that Treasury allocated in the National Budget to fund political parties meeting the required voter threshold under the Political Parties Finance Act. The money will be distributed based on the number of seats a party got in […]",
            "time": "06:37",
            "date": "22 Jan 2025"
        },
        {
            "title": "Govt commits to timely disbursement of devolution funds",
            "url": "https://www.herald.co.zw/govt-commits-to-timely-disbursement-of-devolution-funds/",
            "content": "Sukulwenkosi Dube- Matutu, Bulawayo Bureau\n\nGovernment has reaffirmed its commitment to the timely release and monitoring of devolution funds to ensure proper use.\n\nThis was said by Presidential Affairs and Devolution Permanent Secretary Engineer Tafadzwa Muguti yesterday when he visited Gwanda to assess progress on some of the development projects being pursued by the Second Republic led by President Mnangagwa.\n\nAt Phakama Primary School, Eng Muguti praised Gwanda Municipality for its effective use of devolution funds, which amounted to US$51 000 for the schools construction.\n\nPresently, the school has one classroom block serving ECD B learners, with plans for an additional block underway.\n\nEng Muguti commended the local authority for addressing the long-distance travel issue faced by learners.\n\nHe urged the council to prioritise constructing more classroom blocks with future devolution funds.\n\nMay you also use ERRP (Emergency Road Rehabilitation Programme) funds to construct a road that will connect to this school as this area doesnt have proper roads.\n\nI also heard that there is need for a bridge in this area to enable children to access the school. I would like to urge council to use ERRP that will be disbursed to build the bridge, he said.\n\nEng Muguti emphasised that local authorities should formalise their economies to increase revenue, which in turn would enhance devolution funds.\n\nHe noted that local authorities must actively contribute to revenue generation rather than solely relying on Government disbursements.\n\nCommunities were also advised that devolution funds are sourced from taxpayers, stressing the importance of civic responsibility in revenue collection.\n\nGwanda Mayor Alderman Thulani Moyo said Phakama Primary School would alleviate congestion in existing schools, particularly as Jahunda Primary School currently accommodates over 2 000 learners.\n\nHe said the town is rapidly growing and that devolution funds have been crucial in meeting educational needs.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/01/Tafadzwa-Muguti.jpg",
            "description": "Sukulwenkosi Dube- Matutu, Bulawayo Bureau Government has reaffirmed its commitment to the timely release and monitoring of devolution funds to ensure proper use. This was said by Presidential Affairs and Devolution Permanent Secretary Engineer Tafadzwa Muguti yesterday when he visited Gwanda to assess progress on some of the development projects being pursued by the Second […]",
            "time": "06:37",
            "date": "22 Jan 2025"
        },
        {
            "title": "Farmers urged to diversify crops",
            "url": "https://www.herald.co.zw/farmers-urged-to-diversify-crops/",
            "content": "Victor Maphosa, Mashonaland East Bureau\n\nFarmers nationwide must diversify their operations to ensure food security for the nation, Lands, Agriculture, Fisheries, Water and Rural Development Minister, Dr Anxious Masuka, has said.\n\nHe made the remarks during a recent tour of Mashonaland East Province, where he assessed the crop condition and visited both commercial and Pfumvudza farmers, aligning with President Mnangagwas food security goals.\n\nAt Kudenga Farm in Marondera District, Dr Masuka commended the farms successful fisheries project and livestock production, yielding an annual off-take of 250 steers from a herd of 1 000 cattle.\n\nThe farm also features a modern tobacco curing facility powered by renewable energy.\n\nDr Masuka praised the farmer, saying: We are on a visit to ascertain the crop condition With farmers like Kudenga here in Marondera, we are surely on our way to accomplishing food security. A diversified farm is always a marvel to visit.\n\nDr Masuka also interacted with Pfumvudza farmers in Ward 8, at the homestead of Mr David Ziyengwa.\n\nThe Ziyengwa family has prepared 24 plots with various crops at different growth stages, impressing the Minister, who remarked that such commitment is essential for household food security.\n\nHe reassured farmers of the Governments ongoing support, stating that inputs would be provided to all beneficiaries who prepare their plots.\n\nDr Masuka highlighted a broader societal benefit of food security, noting that once there is food security at household level, even domestic violence becomes minimal.\n\nMr Ziyengwa shared his familys positive experience since participating in the Pfumvudza programme, saying they are thriving and able to send their children to better schools.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/06/Anxious-Masuka.jpeg",
            "description": "Victor Maphosa, Mashonaland East Bureau Farmers nationwide must diversify their operations to ensure food security for the nation, Lands, Agriculture, Fisheries, Water and Rural Development Minister, Dr Anxious Masuka, has said. He made the remarks during a recent tour of Mashonaland East Province, where he assessed the crop condition and visited both commercial and Pfumvudza […]",
            "time": "06:37",
            "date": "22 Jan 2025"
        },
        {
            "title": "First Lady calls for optimum care for trees",
            "url": "https://www.herald.co.zw/first-lady-calls-for-optimum-care-for-trees/",
            "content": "Tendai Rupapa, Senior Reporter\n\nENVIRONMENT and tourism patron, First Lady Dr Auxillia Mnangagwa, yesterday led in the planting of more than 3 000 indigenous and exotic trees in Mashonaland East Province as she fights to provide windbreak and vegetation cover in areas that have become bare and prone to erosion.\n\nThe trees, which were planted in Nherekashumba, Muzuva and Chizengeni villages, included Croton and the Quinine tree which is the tree of the year.\n\nThe country is losing over 200 000 hectares of forests annually due to deforestation, a situation that poses severe threats to the environment and livelihoods.\n\nIn light of this, Amai Mnangagwa is working flat out to ensure that forests are restored to avoid irreversible damage.\n\nThe mother of the nation was joined by traditional chiefs, communities, churches, youths and learners in the programme attended by thousands of people.\n\nShe also held an interactive session with members of the communities, reinforcing the need for hard honest work and for people to shun drug and substance abuse, which is wreaking havoc, especially among youths across the globe.\n\nDr Mnangagwa spoke at length against early child marriages, saying children need to focus on their education for a brighter future.\n\nAs Agric4She patron, Dr Mnangagwa gave the elderly under Agric4Grandmothers sunflower seed, fertiliser, suckers for German 2 sweet potatoes, vegetable combo seeds, rhizobium, which traps nitrogen and fixes into the soil, chemicals and knapsack sprayers.\n\nThey were also given eggs and layers for poultry production.\n\nSchoolchildren and villagers plant trees during a programme which was led by Environment and Tourism patron First Lady Dr Auxillia Mnangagwa in Mashonaland East yesterday.\n\nIn her remarks, Amai Mnangagwa said she was delighted with the high turnout and warm welcome she received.\n\nI am happy with your high turnout and the welcome you accorded me. I am so delighted in my heart. Today I have come to plant trees in this rainy season. I am glad you came out in your numbers so that we work together. I have come so that we teach one another and create awareness on the importance of tree planting. Fruits that sustain livelihoods come from trees. They are also wind breakers and they curb soil erosion. God gave us these forests. We have come to adorn our nation and keep it the way it was created by God so that it sustains us. These trees that we are planting here today, our children at universities will analyse them and see their importance from the leaves to the branches and roots. Some pills that we ingest come from these trees. If we destroy trees, we would have ruined a lot of things. Our children who are growing up need to know the different types of trees. If we cut and dont replant them, the future generations will not know of them. You risk cutting down the history of our motherland. If we have green forests, even tourists will come. Lets protect our environment and our heritage. I was in Mashonaland West yesterday (Monday) and they admitted to have been cutting down trees and I taught them the importance of trees, she said.\n\nThe mother of the nation also had words of advice for artisanal miners.\n\nTo my children who are involved in mining, let us follow the law and not leave holes everywhere. You should mine at approved sites because the Ministry of Mines knows safe places, yet some are entering disused mines which then collapse, leading to loss of life and limb. Recently, some had a mine collapse as they were working in Mashonaland Central Province and they are still to be accounted for, she said.\n\nDr Mnangagwa as Agric4She patron, distributed farming inputs to the elderly and other beneficiaries.\n\nToday I have also come with Agric4Grandmothers so that I can give them inputs. The inputs are also adequate to cover even those who are not elderly, she said.\n\nAmai Mnangagwa reinforced the importance of raising morally upright families.\n\nMadzimai, as you prepare your sadza, talk to God seeking protection over your family; to say God please look after my children or my husband. Children nowadays are ruined by drugs and we must stand firm as their mothers so that our children grow up morally upright. As communities, are we working with the police? Are we cooperating with the police and reporting those who are selling and consuming drugs? The whole nation is troubled by drug and substance abuse so if you as a father figure or mother figure then start brewing and distributing drugs, you are ruining other peoples children. Let us be dignified as Zimbabwe nationals who follow our cultural norms and values which mould us. Dignity should be present everywhere and never be left home like a coat. Children must value education and think about marriage afterwards. We say no to those who fall pregnant before the time is ripe, she said.\n\nAgric4She patron First Lady Dr Auxillia Mnangagwa gave the elderly under Agric4Grandmothers sunflower seeds, fertiliser, sweet potato suckers, vegetable seeds, chemicals and knapsack sprayers in Mashonaland East yesterday.  Pictures: John Manzongo\n\nMr Lewis Radzire, the operations manager of the Forestry Commission, praised the First Lady for her interventions.\n\nOur patron for Environment and Tourism, Her Excellency Dr Auxillia Mnangagwa, led the nation in planting trees in Mashonaland East. We identified some of the degraded sites where Amai is restoring the area with both indigenous and croton species which then promotes tobacco curing. We are here with the community, all people from all walks of the district and province planted trees to ensure that we restore the degraded sites. One thing that is coming out interesting is since we are planting trees, we have actually identified pockets of muhacha, mukute and all other trees that usually used to be in this area so we want to replenish and restore those degraded areas so this is quite pivotal. The theme for this year is trees and forests for ecosystem restoration for improved livelihoods. So the theme dovetails with the vision of His Excellency of ensuring that we plant as many trees as we can. Apart from that, we are also identifying households. His Excellency two years ago launched the horticulture recovery growth plan in Mangwe in 2022 so we have identified other households that are nearby where we are planting at least 10 fruit trees per household. This will then combine with communal projects, but more importantly, this area is quite bare. I am sure as a country we have witnessed infrastructure being destroyed as a result of harsh winds. So Amai is also promoting shelter belts that will then hold ferocious winds that will destroy roofs of schools and houses. So this programme led by Her Excellency will go a long way in ensuring that our forests are restored. As Forestry Commission working under the guidance of our patron, the First Lady, we want to promote the planting of indigenous trees as well as processing them that is in line as we are ending the National Development Strategy 1 and approaching NDS2. So this is a clarion call to everyone, he said.\n\nMashonaland East Provincial Affairs and Devolution Minister Aplonia Munzverengwi paid tribute to the First Lady for her educative and life-transforming programmes.\n\nWe welcome you with happiness for coming here so that we plant trees and adorn the nation. Our mother is seeing that the nation is now bare, especially here where we have planted trees because if ferocious winds and rains come, we will be destroyed. Amai, I urge people in my province and countrywide to protect these trees that would have been planted. We thank you for your love because you are leaving no place and no one behind. This programme you have brought teaches us to plant trees at our homesteads. Focusing on your Agric4She programme, women now appreciate the value of farming and they are doing well with the inputs support that you give them. Were it not for you, these women would have remained aloof, folding their hands. All your programmes are beneficial to us and they are educative, she said.\n\nBeneficiaries of the programme punched the air with excitement and praised the First Lady for remembering them.\n\nGogo Euphrasia Goko said: I was failing to raise income to buy seeds and fertilisers for a portion of my field and Amai has come with these inputs. I am so happy because she is doing well for the whole nation.\n\nThe sentiments dovetailed with those of Gogo Elizabeth Chakanyuka.\n\nI am indeed gratified by what Amai Mnangagwa has done for us here in Chihota. She has taught us the importance of planting trees so that we enjoy fruits, shade and get windbreak. These teachings are not supposed to be taken for granted, she said.\n\nMr Reason Chitsaya praised the First Lady for her intervention and hammering home the need for people to plant trees.\n\nWe thank the First Lady for coming here to teach our community about the importance of planting trees. This area was now bare, with very little vegetation cover, leaving it susceptible to erosion. I was also gratified that she encouraged us to plant fruit trees at our homesteads so that we have access to healthy food. Trees have medicinal properties, so we need to grow them for the benefit of our communities and the nation, he said.\n\nPutting the catch-them-young concept into practice, the First Lady taught learners the importance of preserving and planting trees.\n\nSusan Mudzimurema, a Form 3 learner, was thankful to the First Lady for teaching them the importance of planting trees.\n\nThe First Lady taught us that we need to preserve forests since they are a habitat for various species. Trees have many benefits.\n\nI also want to thank our First Lady for visiting our home area and teaching us to focus on our education. I will share with my colleagues at school the valuable information I received from the First Lady, she said.\n\nIn his vote of thanks, Chief Nechombo said: We are grateful for the work that you are doing in our province and country in terms of correcting, preserving and safeguarding our cultural norms and values Amai.\n\nYou are doing well to end domestic violence. Your educative Gota/Nhanga/Ixhiba Programme is instructive. You have done a lot for us and we wish you a long life for helping us plant trees.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/FL1-1.jpg",
            "description": "Tendai Rupapa, Senior Reporter ENVIRONMENT and tourism patron, First Lady Dr Auxillia Mnangagwa, yesterday led in the planting of more than 3 000 indigenous and exotic trees in Mashonaland East Province as she fights to provide windbreak and vegetation cover in areas that have become bare and prone to erosion. The trees, which were planted […]",
            "time": "06:37",
            "date": "22 Jan 2025"
        },
        {
            "title": "EDITORIAL COMMENT: Let’s be vigilant this rainy season",
            "url": "https://www.herald.co.zw/editorial-comment-lets-be-vigilant-this-rainy-season/",
            "content": "THE persistent rains falling for most of this month to the delight of farmers are also increasing dangers for the unwary, with at least 21 people reported drowned in mineshafts, flooded rivers and other traps.\n\nThe dangers of fast moving flows of water are repeated every year, and some people do not listen or refuse to accept that the flows in their nearest river, or across the bridge they normally use, could possibly be dangerous.\n\nBut people should apply that textbook knowledge they acquire in school as they grow up and they will quickly see that the less obvious aspects of river flow are the most dangerous, which should fit in with their own experience.\n\nThe energy of a flowing river, and so the force it exerts on an object like a human being walking across or a vehicle being driven through it is proportional to the mass of the water flowing, basically the depth of the water, but to the square of the speed of the flow. So a river flowing twice as fast has four times the energy, one flowing three times as fast, nine times the energy and one four times as fast, 16 times the energy.\n\nThis is why some people are fooled when they see a river is only twice as deep as it was last week, when it was a slow-flowing gentle stream and is now a raging torrent.\n\nDespite being only twice as deep it might well hit you with more than 20 times the force and sweep you or your car away. So the danger is far more than just the modest danger of deeper water.\n\nThis is why everybody concerned about safety, from the police onwards, continually warn people not to cross flooded rivers and flooded bridges, no matter how benign they might look. They need to wait.\n\nLow level bridges opened up in Zimbabwe as the first proper roads, the old strip roads, were driven across the country and people who had spent half a rainy season unable to cross a ford now revelled in having to wait just a few days before the bridge was usable in even the heaviest rainy season. Often now, with these bridges largely on the smaller rivers, drivers only have to wait a few hours or a day at the most before it is safe.\n\nThe problems for pedestrians are more numerous, it often being a walk of some length or several hours to get to the nearest bridge.\n\nFor some odd reason there are not many foot bridges in Zimbabwe, despite the problems of rivers and streams rising in flood for a few months each year. Yet an adequate footbridge is not very expensive and can easily be built from wood or a small quantity of metal.\n\nWe would think that standard designs could easily be drawn up and distributed through rural district councils to many communities, and even some of our cities that have a reasonable summer river running through them would benefit.\n\nThis is the sort of practical engineering that should be publicised.\n\nOften local materials can be used and local labour, so the cost of a footbridge might be very low, just some hardware items or perhaps the hire of a tractor for a few hours to move tree trunks.\n\nMany people take risks when crossing rivers because they do not want to divert, and in countries where it rains most months of the year these small bridges become ubiquitous over generations since crossing even the smallest rivers normally needs a bridge.\n\nIt is not just rural areas.\n\nThe Mukuvisi River in Harare becomes dangerous over part of the rainy season after some decent rains have fallen, and a city council on the ball would have found a suitable site for a foot and cycle bridge every half kilometre or so, instead of forcing pedestrians to take their lives in their hands or walk long distances to the half a dozen or so road bridges.\n\nArtisanal miners take far too many risks at the best of times, but in the rainy season these risks escalate alarmingly and when storm water diverts down a mine shaft or into a mining tunnel then a whole lot of extra dangers emerge, from shaft walls being eroded away to the sheer force of water sweeping miners off their feet and drowning them.\n\nMajor established mines are aware of the dangers and take a great deal of care to properly collect and drain their storm water, making sure it is not a menace and a danger. But on many artisanal mines no one has even thought of that work for many years, so even if there were adequate drains at some stage these are probably blocked, eroded or simply non-functioning. Once again people die.\n\nProperty is often severely damaged because people have not thought of storm water drains when building a house or some other structure, and we have even seen that in Borrowdale Brook in the poshest Harare suburb, or have allowed drains to become blocked. Sometimes houses are just built in the wrong place, and that we have also seen.\n\nWhat looks like a good building site between May and September might be quite dangerous after heavy rains near by, or even for the whole of a reasonable rainy season and people should be willing to look harder at the site, and preferably during a rainy season so they can see the dangers.\n\nEven those who should be able to work out the drainage often forget that drains can block quite quickly and should make sure their drains can handle far higher loads than predicted, with big margins of safety.\n\nWe need to see every rainy season as the blessing it is, and that means we need to be able to deal with rising streams and rivers without much trouble since these are not new and unknown events but come with the rains.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/08/Rainfall-2.jpg",
            "description": "THE persistent rains falling for most of this month to the delight of farmers are also increasing dangers for the unwary, with at least 21 people reported drowned in mineshafts, flooded rivers and other traps. The dangers of fast moving flows of water are repeated every year, and some people do not listen or refuse […]",
            "time": "06:37",
            "date": "22 Jan 2025"
        },
        {
            "title": "Murder cases surge across the nation",
            "url": "https://www.herald.co.zw/murder-cases-surge-across-the-nation/",
            "content": "Freeman Razemba, Crime Reporter\n\nA chilling wave of violence has swept across the country, leaving communities reeling as authorities grapple with a surge in ruthless killings.\n\nThe shadow of murder grows ever darker, with the recent discovery of five lifeless bodies in some parts of the country, all victims of unknown assailants.\n\nIn Harares sprawling suburb of Epworth, an 18-year-old youth, Simon Kembo, met a tragic end.\n\nHis body was found abandoned near a sports bar at Reuben Shops, a deep cut marring his forehead, a grim evidence to the brutality of his assailant(s).\n\nIn Bulawayos Cowdray Park, 46-year-old Qinisela Nyathi was discovered lifeless in a bushy area, his throat slashed and his left arm bearing a deep wound.\n\nNational police spokesperson Commissioner Paul Nyathi voiced the growing concern over these violent incidents, calling for public cooperation to bring those responsible to justice.\n\nPolice in Harare are appealing for information that may assist in the investigation of the murder of Simon Kembo, found dead on January 19, 2025. Similarly, in Bulawayo, we are investigating the tragic killing of Qinisela Nyathi, whose body was discovered on the same day, he said.\n\nThe bloodshed does not end there.\n\nIn Goromonzi, the lifeless body of 40-year-old Lackius Murimi was pulled from the chilling waters of Shapiro Dam at Leicester Farm.\n\nHis hands were bound with rope, and his skull bore the savage marks of two deep cuts.\n\nPolice launched an intense investigation into this harrowing case, which has left the local community both horrified and fearful.\n\nPolice in Goromonzi are probing the circumstances surrounding the murder of Lackius Murimi, whose body was found floating in Shapiro Dam on January 16, 2025. The victims hands were tied, and he had sustained two severe head injuries, Commissioner Nyathi confirmed, his voice heavy with the weight of yet another senseless killing.\n\nThe violence spilled further south, into Gwanda, where yet another life was cruelly extinguished.\n\nAdmire Tshuma succumbed to his injuries while en-route to the hospital after being found in the Gobatema area on January 17, 2025.\n\nA deep gash on his forehead told a story of unimaginable violence.\n\nAnd in the rural expanse of Lothe Village, tragedy struck again.\n\nThe lifeless body of 36-year-old Gladys Ndlovu was discovered in a bushy area, her body marked by multiple injurieseach wound a silent witness to a savage and heartless act.\n\nAs the nation mourns the lives lost to this wave of bloodshed, police continue their plea for assistance.\n\nAnyone with information that might aid in the investigations of these heinous crimes is urged to contact their nearest police station, Commissioner Nyathi implored.\n\nThe rising tide of violence has cast a pall over communities once considered safe, leaving citizens anxious and authorities scrambling for answers. Each of these losses is a painful reminder of the fragility of life and the need for justice to prevail.\n\nWill the perpetrators of these brutal acts be brought to account, or will the shadows grow even darker? Only time, and the resolve of the nation, will tell.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/02/Assistant-Commissioner-Paul-Nyathi.jpg",
            "description": "Freeman Razemba, Crime Reporter A chilling wave of violence has swept across the country, leaving communities reeling as authorities’ grapple with a surge in ruthless killings. The shadow of murder grows ever darker, with the recent discovery of five lifeless bodies in some parts of the country, all victims of unknown assailants. In Harare’s sprawling […]",
            "time": "06:37",
            "date": "22 Jan 2025"
        },
        {
            "title": "MLISWA LOSES ZIFA ELECTIONS BID",
            "url": "https://www.herald.co.zw/mliswa-loses-zifa-elections-bid/",
            "content": "Eddie Chikamhi, Zimpapers Sports Hub\n\nZIFA lawyer Lovemore Madhuku was a relieved man yesterday after one of the two court bids to stop this weeks watershed election ended in his clients favour when aggrieved presidential aspirant Temba Mliswa withdrew his urgent High Court application for an interdict.\n\nMadhuku, who was hired by ZIFA last week to deal with the thorny court challenges raised by Mliswa and another disqualified candidate, Walter Magaya, successfully argued that the matter brought before Justice Tawanda Chitapi was not urgent.\n\nMliswa and Magaya have been seeking a postponement of the elections scheduled for the Rainbow Towers in Harare on Saturday.\n\nDespite yesterdays victory, ZIFA will be back at the High Court again tomorrow, where Justice Chitapi is expected to make a determination on the challenge by Magaya.\n\nThe Yadah Stars president claims he was unfairly disqualified for not attaching his O Level certificate in his nomination papers.\n\nBut Madhuku, who was flanked by long-serving ZIFA lawyer Chenaimoyo Gumiro during the three-hour marathon proceedings yesterday, was elated that one hurdle in the bids to derail the polls had been cleared. This was after Mliswa and his counsel conceded they had filed their review application out of time.\n\nMliswa was challenging the election process as well as the validity and legitimacy of the new ZIFA statutes adopted by Congress on October 18 last year.\n\nThe urgent review application was supposed to be filed within eight weeks, according to the statutes, but the applicant deposited their papers after 11 weeks.\n\nAfter some three hours of argument, we were able to reach a position where Mliswa, through his legal counsel, conceded that the review application was out of time, which then makes the urgent chamber application not founded on that, said Madhuku.\n\nFor us ZIFA, we are happy that at least one challenge is out of the way and that the next one will happen in two days, he added, referring to the Magaya case.\n\nMliswa and his legal counsel had no choice but to withdraw the urgent application for review after it became clear it was filed outside of the stipulated time frame.\n\nHowever, Justice Chitapi said Mliswa could still pursue the case as a normal court application.\n\nThis application is withdrawn by consent, and the applicant will pay the costs of the hearing, said Justice Chitapi.\n\nMliswas lawyer, Musindo Hungwe, conceded their application had missed the accepted time frames.\n\nThe outcome of the matter is that after argument and the issues raised in relation to the time frame with-in which the main application for review was filed, it became clear that the application was filed a bit out of time, and we have made a confession to that effect, he said.\n\nGiven that concession and the need for condemnation in that aspect, we have considered that this present application be withdrawn. So effectively we have withdrawn the application, a decision that has been accepted by the respondents.\n\nSo, that is the status of the case.\n\nMliswa, who is among the five candidates that were disqualified by the ZIFA Electoral Committee after falling short of the associations ethics and eligibility criteria, conceded his application had fallen away.\n\nTo me its fair. The facts are there. We were out of time; figures dont lie, said Mliswa.\n\nOne of the greatest things about life is that when you have been outdone, you must concede. My lawyer remains my lawyer; hes a great lawyer, but there were some technicalities that came through that we didnt expect.\n\nAs a result, I had to make a decision. The judge asked my lawyer and myself to go out and talk in terms of the way forward: do we proceed with the arguments that have been put forth and the technicalities, basically out of time, to instruct my lawyer to withdraw the case?\n\nHowever, the former Norton legislator indicated he would now pursue the matter via a normal application.\n\nMliswa is arguing that the ZIFA Congress, which the constitution had no mandate to do that since their term of office had expired in 2022.\n\nThis is also despite the fact FIFA granted an extension to the life of Congress as part of the normalisation process and the ZIFA reform bid.\n\nMliswa still maintained that it was an illegal Congress whose resolutions, including all the electoral processes, were a nullity.\n\nThis fight is not about me; its not about you; its about football.\n\nBut even if, you know, the elections are bigger, Ive entrusted whoever is coming in to be the (ZIFA) president to ensure that they regularise (the constitution). That Ill repeat, they regularise.\n\nSo, the main application remains. This was an urgent application for an interdict. The main application remains . . . Football has won, no one has lost.\n\nBut in football, we need to have people who will lead it with credibility, who understand the constitution, and who will come up with a better constitution. Our constitution is in a mess.\n\nAnd again, the sooner elections are held, the better, said Mliswa.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Temba-Mliswa-copy-680x380.jpg",
            "description": "Eddie Chikamhi, Zimpapers Sports Hub ZIFA lawyer Lovemore Madhuku was a relieved man yesterday after one of the two court bids to stop this week’s watershed election ended in his clients’ favour when aggrieved presidential aspirant Temba Mliswa withdrew his urgent High Court application for an interdict. Madhuku, who was hired by ZIFA last week […]",
            "time": "06:37",
            "date": "22 Jan 2025"
        },
        {
            "title": "Enough resources in place for good harvest",
            "url": "https://www.herald.co.zw/enough-resources-in-place-for-good-harvest/",
            "content": "Precious Manomano, Herald Reporter\n\nIn a summer season marked by unprecedented agricultural initiatives, the Government has mobilised extensive resources to ensure the success of the agricultural season.\n\nWith nearly 1,8 million hectares of maize and over 800 000 hectares of traditional grains planted, this season signifies a remarkable increase in planting and a hoped-for set of record harvests.\n\nIn its weekly report, Agricultural Advisory and Rural Development Services director, Mr Leonard Munamati, said the country had mobilised resources that will lead to the success of the season.\n\nOur commitment to agricultural development is unwavering. This season, we have not only prepared the land but also ensured that our farmers have access to the necessary resources and support, he said.\n\nThe Bankers Association of Zimbabwe had mobilised ZiG852,97 million and US$163,12 million to support these efforts, showcasing strong financial backing for the agricultural sector.\n\nAs irrigation became increasingly vital, the Government had allocated 120 000 hectares of irrigated land for maize, alongside 20 000 hectares each for soyabeans and sugar beans under summer irrigation.\n\nLast year, we had only 75 000 hectares under irrigation. This years increase is a testament to our dedication to providing sustainable water solutions for our farmers, Mr Munamati said.\n\nIn terms of equipment, the availability of 15 308 tractors, 9 230 disc harrows, and 11 212 ploughs ensured that farmers can till an impressive 1 156 000 hectares.\n\nWe believe that equipping our farmers with the right tools is crucial for enhancing productivity.\n\nHowever, he acknowledged the challenges in seed availability, particularly for groundnuts, soybeans, and sunflowers, which might require imports to meet demand.\n\nFertiliser availability remained a cornerstone of agricultural success, with the seasonal requirement at 780 000 tonnes.\n\nTimely access to fertilisers is essential for maximising yields. We are working diligently to ensure that farmers receive what they need when they need it.\n\nThe Government is also proactive in addressing pest management.\n\nReports of African armyworm outbreaks in Mashonaland East and Central had prompted immediate action. The department provided the necessary chemicals and sprayers to combat the pests.\n\nTraining played a pivotal role in making sure farmers were using the best methods and so far more than 2,5 million farmers had been trained, with plans to establish 35 000 farmer field schools across villages.\n\nEducation is key. By empowering our farmers with knowledge, we enable them to make informed decisions that will lead to improved productivity, Mr Munamati said.\n\nAs part of a comprehensive approach, the Government activated a monitoring and evaluation unit to oversee agricultural production.\n\nWe are committed to ensuring that our policies are implemented effectively. A whole of Government and whole of sector approach is required for the smooth execution of our summer plan, he said.\n\nLooking ahead, Mr Munamati shared plans for issuing secure, tradeable land tenure documents to A1, A2, and 99-year leaseholders this year.\n\nThis new land policy will enhance access to finance and promote joint ventures, ultimately driving agricultural production forward.\n\nZimbabwes agricultural landscape was poised for transformation, fuelled by strategic initiatives and unwavering support from the Government. With these concerted efforts, Zimbabwe was on the path to an agricultural resurgence that promises to nourish both the land and its people.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Ag.jpg",
            "description": "Precious Manomano, Herald Reporter In a summer season marked by unprecedented agricultural initiatives, the Government has mobilised extensive resources to ensure the success of the agricultural season. With nearly 1,8 million hectares of maize and over 800 000 hectares of traditional grains planted, this season signifies a remarkable increase in planting and a hoped-for set […]",
            "time": "06:37",
            "date": "22 Jan 2025"
        }
    ]
}