{
    "news": [
        {
            "title": "Zim’s trajectory unshaken: President",
            "url": "https://www.herald.co.zw/zims-trajectory-unshaken-president/",
            "content": "Blessings Chidakwa in GOKWE\n\nPRESIDENT Mnangagwa yesterday reaffirmed the Governments commitment to building a legacy that honours the sacrifices of the liberation struggle, emphasising that true independence lies in securing prosperity for future generations.\n\nIn his keynote address to thousands of people who thronged Mutora Open Grounds in Gokwe for the main Independence Day celebrations, President Mnangagwa said despite ongoing illegal sanctions imposed by the West, climate change-induced setbacks, global economic shocks and attempts by detractors to divide the nation, Zimbabwes trajectory remains unshaken.\n\nHe said Zimbabwes journey since independence has been one of inspiration, marked by significant progress across all sectors.\n\nPresident Mnangagwa delivers his remarks at the 45th Independence Day celebrations at Nembudziya Stadium in Gokwe yesterday.  Picture: Believe Nyakudjara.\n\nAfter 45 years of independence, the Zanu PF Government remains committed to building a future that honours the sacrifices of the past, while securing prosperity for generations to come.\n\nTo ensure Zimbabwean products remain competitive both locally and globally, technical and vocational education, particularly in Science, Technology and Innovation, is critical, he said.\n\nPresident Mnangagwa said workers welfare remains a top priority, while also paying tribute to the security forces for maintaining peace and stability prevailing across the country.\n\nHe urged the nation to embrace innovation, technology and skills development as the foundation of future success, with Vision 2030 now within reach.\n\nThe President said food security would always be prioritised, with the Agriculture Transformation Strategy deepening rural reforms toenhance grain production and efficiency.\n\nLand, which is our inalienable heritage, is being productively utilised, and we anticipate a bumper harvest from the 2024/25 summer cropping season. This will allow us to replenish the Strategic Grain Reserve.\n\nLast seasons El Nio-induced drought affected many districts, but as a nation we managed to feed ourselves. The Food Deficit Mitigation Programme, which included cash transfers to urban households, significantly reduced vulnerability, he said.\n\nSaluting the security forces, President Mnangagwa called on all citizens to protect the nation from both internal and external elements that threaten national development.\n\nHand in hand, with focus and discipline, let us defend and work harder for our motherland, Zimbabwe. We salute our security services for their loyalty and patriotism, and for steadfastly defending our sovereignty and hard-won independence.\n\nThe Second Republic is entrenching the rule of law and protecting law-abiding citizens while decisively dealing with rogue elements, he said.\n\nPresident Mnangagwa said the nations detractors would never triumph in their ill-fated mission to divide the country.\n\nPresident Mnangagwa and First Lady Dr Auxillia Mnangagwa pose for a photograph at the 45th Independence Day celebrations in Gokwe yesterday.\n\nDivisive and alarmist elements will never triumph over a nation such as ours, born from a rich liberation history and the blood of brave sons and daughters. Law enforcement agencies will always act in accordance with the law and in the best interests of our sovereign motherland.\n\nThe President called for unity and development, encouraging every citizen to contribute positively to the national vision.\n\nAs communities, let us uphold values of love, unity, compassion, empathy, discipline and hard, honest work qualities for which Zimbabweans are known. These values must be passed on to all, young and old.\n\nRegardless of political affiliation, religion, race, gender or age, let us all put Zimbabwe first. It is the only country we call home, and so shall future generations.\n\nHe said that just like culture and tradition, values such as love, trust and mutual support must be handed downthrough generations.\n\nPresident Mnangagwa highlighted how Zimbabweans, under the Second Republic, are defying odds and achieving remarkable development successes from household to provincial level.\n\nThe policies of the Second Republic are bearing fruit. The mining sector is leading in value addition, with a projected 5.6 percent growth this year, spurred by new mines and favourable commodity prices.\n\nThe accelerated implementation of the National Development Strategy has had a positive effect on the manufacturing sector. The pharmaceutical sector, for example, has seen capacity utilisation rise to 50 percent from 43 percent, he said.\n\nPresident Mnangagwa said his Governments efforts to achieve energy security are yielding results, with rural electrification of schools, clinics and administrative centres improving service delivery.\n\nOn veterans of the liberation struggle, President Mnangagwa said Government continues to honour their contributions by creating inclusive opportunities for socio-economic participation.\n\nMany programmes are underway, including the Presidential Borehole Drilling, Rural Solarisation, Housing Schemes and Youth Empowerment Initiatives. Communities must be actively involved in these programmes championed by the ruling Zanu PF.\n\nAll Zimbabweans regardless of gender, tribe, age or political affiliation must benefit. Zanu PF is a peoples party, he said.\n\nPresident Mnangagwa inspects a military parade at the 45th Independence Day celebrations at Nembudziya Stadium in Gokwe yesterday.  Pictures: Believe Nyakudjara.\n\nThe President also highlighted the ongoing rehabilitation and upgrading of infrastructure, particularly in disaster-prone areas like Gokwe.\n\nIssuing a stern warning against the misuse of social media, President Mnangagwa urged Zimbabweans to remain vigilant and united.\n\nI commend you, my fellow compatriots at home and abroad, for remaining patriotic and steadfast, never allowing yourselves to be misled by shadowy elements with dubious agendas, he said.\n\nBefore addressing the crowd who braved the rainy and chilly weather, the President, accompanied by First Lady Dr Auxillia Mnangagwa, inspected the Independence Parade mounted by the Zimbabwe Defence Forces.\n\nVice President Dr Constantino Chiwenga and his wife, Colonel Miniyothabo Chiwenga, Cabinet ministers, Service Chiefs, and Heads of Diplomatic Missions, were among the dignitaries present.\n\nVice President Dr Constantino Chiwenga and his wife Colonel Miniyothabo Chiwenga follow proceedings at the historic event.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/President-Mnangagwa--680x380.jpg",
            "description": "Blessings Chidakwa in GOKWE PRESIDENT Mnangagwa yesterday reaffirmed the Government’s commitment to building a legacy that honours the sacrifices of the liberation struggle, emphasising that true independence lies in securing prosperity for future generations. In his keynote address to thousands of people who thronged Mutora Open Grounds in Gokwe for the main Independence Day celebrations, […]",
            "time": "21:27",
            "date": "19 Apr 2025"
        },
        {
            "title": "President pays tribute to Gokwe, Midlands heroes",
            "url": "https://www.herald.co.zw/president-pays-tribute-to-gokwe-midlands-heroes/",
            "content": "Kuda Bwititi in Gokwe\n\nPRESIDENT Mnangagwa yesterday paid glowing tribute to the people and heroes of the Midlands Province, acknowledging their historical sacrifices and enduring contributions to Zimbabwes freedom and post-independence development.\n\nAddressing a packed gathering at the countrys 45th Independence Day commemorations in Gokwe, the President reflected on the colonial injustices suffered by communities in the region, hailing their resilience and transformation of the area into one of the countrys most vibrant districts.\n\nDuring the brutal colonialera, this area became home to many of our forefathers who were forcibly bundled out from various parts of the country by the racist white colonial regime, said the President.\n\nThey survived and thrived in these lands, which were then highly infested with tsetse flies, turning this area into one of the most populous and economically vibrant districts in our country.\n\nThe President praised the people of the Midlands Province, particularly Gokwe, for standing as a symbol of resilience and fortitude and for their pivotal role in shaping Zimbabwes liberation and economic progress.\n\nHe took time to honour the revered sons and daughters of the province who played key roles in the liberation struggle and post-independence nation-building.\n\nAmong those remembered were national heroes such as General Josiah Magama Tongogara, Cde Leopold Takawira, Cde Cephas Msipa, Cde Sibusiso Moyo and many others whose bravery, he said, laid the foundation for Zimbabwes sovereignty.\n\nWe also honour the great heroes of the Midlands Province. These include General Josiah Magama Tongogara, Cde Leopold Takawira, Cde Cephas Msipa, Cde Richard Hove, Cde Stephen Vuma, Cde Lameck Makanda, Cde Benjamin Mabenge, Cde Sibusiso Moyo, Cde Garikayi Magadzire, Cde Nash Nyasha Dzimiri, Cde Herbert Mahlaba, Cde Sydney Bhebhe, and Cde Ngwabi Bhebhe, among others.\n\nMany more lie at District and Provincial Heroes Acres as well as in unmarked graves within the country and beyond. It is because of their collective bravery, dedication and patriotism that today we are forever free, Independent, peaceful and a sovereign people, he said.\n\nThe President also celebrated the economic contributions of the province in the years following independence, particularly in cotton production, mining and agriculture.\n\nYour contribution as Midlands Province and Gokwe to the economy in post-Independent Zimbabwe . . . is unmatched, he said.\n\nIn a message of unity, the President emphasised that Independence belonged to all Zimbabweans, regardless of province or background.\n\nThe country is gathered here, therefore, to thank you, ukuzolibonga, kuzokutendayi, and to celebrate with you. This Independence is ours together, we are one united people of Zimbabwe, President Mnangagwa said.\n\nThe commemorations brought together thousands from across the country in celebration of Zimbabwes hard-won freedom, with traditional performances, military parades and cultural displays highlighting the days festivities.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/President-Mnangagwa-and-First-Lady-Dr-Auxillia-Mnangagwa-680x380.jpg",
            "description": "Kuda Bwititi in Gokwe PRESIDENT Mnangagwa yesterday paid glowing tribute to the people and heroes of the Midlands Province, acknowledging their historical sacrifices and enduring contributions to Zimbabwe’s freedom and post-independence development. Addressing a packed gathering at the country’s 45th Independence Day commemorations in Gokwe, the President reflected on the colonial injustices suffered by communities […]",
            "time": "21:27",
            "date": "19 Apr 2025"
        },
        {
            "title": "Zim@45 — Congratulatory messages pour in",
            "url": "https://www.herald.co.zw/zim45-congratulatory-messages-pour-in/",
            "content": "Herald Reporter\n\nTHE global community of nations and other world bodies yesterday congratulated Zimbabwe on its 45th anniversary of its Independence.\n\nThere was an outpouring of solidarity messages from regional, continental and global organisations.\n\nThe Republic of China, Belarus, India, the United Nations, Australia, Palestine, the United States, and the European Union are among the countries and regional bodies that extended congratulatory messages.\n\nIn his congratulatory message to the people of Zimbabwe and President Mnangagwa, Belarusian President Aleksandr Lukashenko said having demonstrated unwavering courage and patriotism in the selfless struggle against the colonial regime, Zimbabweans won freedom and opened a new chapter in the history of their country, which today is one of the most progressive ones in Africa.\n\nThe Republic of Belarus knows you (President Mnangagwa) as a direct participant in the national liberation movement, a devoted patriot who cares deeply about the well-being of Zimbabweans.\n\nHe also commended Zimbabwe for its role in promoting both regional and global peace.\n\nUnder your wise leadership, the Republic of Zimbabwe is consistently growing its economy, improving the quality of life of its people, contributing to the resolution of issues related to regional security and global order, actively expanding foreign policy ties, President Lukashenko said.\n\nI hope that the interstate relations will maintain momentum going forward. I am very pleased to see the positive impact of the Belarus-Zimbabwe friendship on the socio-economic development of your beautiful country. I will be glad to welcome you to the hospitable Belarusian land in May of this year and discuss in detail promising areas of co-operation across the board.\n\nItalian PresidentMr Sergio Mattarella has written to President Mnangagwa, congratulating him on the occasionof Zimbabwe s independence day celebrations.\n\nItalian PresidentMr Sergio Mattarella\n\nPresident Mattarella expressed hope that Harare and Rome may further improve dialogue and collaboration in all sectors of common interest, both at bilateral level and under the European Union framework.\n\nIndias External Affairs Minister Subrahmanyam Jaishankar also extended greetings to the people of Zimbabwe,reiterating his countrys commitment to advancing the long-standing partnership between the two nations.\n\nGreetings to Professor Amon Murwira, the Government and people of Zimbabwe on their 45th Independence Day. Committed to advancing our long-standing partnership.\n\nPosting on its X account, @Chinese Embassyin Zimbabwe, China said: Warmest Congratulations! Today marks the 45th anniversary of Zimbabwes independence as well as the establishment of diplomatic relations between the Peoples Republic of China and the Republic of Zimbabwe.\n\nIn his congratulatory message, Member of the Political Bureau of the CPC Central Committee and Foreign Minister of China Wang Yi said China and Zimbabwe enjoy a profound traditional friendship, which has stood the test of time and remained rock-solid amid the changing international landscape.\n\nForeign Minister of China Wang Yi\n\nSince the establishment of diplomatic ties 45 years ago, our two countries have always treated each other as equals with sincerity and friendship, and stayed committed to mutual benefit and common development, he said.\n\nThe United Nations reiterated its commitment to support Zimbabwes vision of achieving an upper middle income economy by 2030.\n\n@UNZimbabweTeam wishes the Government and People of Zimbabwe happy 45th Independence Day. Together for 2030 Agenda for Sustainable Development.\n\nThe United Kingdom also pledged to strengthen its ties with Zimbabwe.\n\nCongratulations on the occasion of your 45th anniversary of independence. The United Kingdom extends its best wishes and looks forward to further strengthening our longstanding partnership.\n\nThe European Union conveyed its message through its envoy to Zimbabwe, Mr Jobst von Kirchmann, who said: Happy Independence Day Zimbabwe! We join you in celebrating the spirit of freedom, unity and progress that defines this day.\n\nThe United States said: Congratulations to the people of Zimbabwe as you mark 45 years of independence. We recognise this important milestone in your national history and join you in recognising your day national pride and remembrance.\n\nThe Ambassador of the State of Palestine to Zimbabwe Dr Tamer Almassri also congratulated President Mnangagwa and people of Zimbabwe.\n\nDr Tamer Almassri\n\nOn behalf of the Embassy of State of Palestine and staff, Palestinian community in Zimbabwe and on my own behalf, I extend my warmest and most sincere congratulations to Your Excellency, the Government, and the people of Zimbabwe on the momentous occasion of your 45th Independence Day.\n\nOver the past 45 years, Zimbabwe has made tremendous strides in consolidating its independence, promoting economic development, and fostering regional and international cooperation.\n\nHe also hailed President Mnangagwa for driving economic growth and his commitment to achieving justice and peace globally.\n\nYour Excellencys leadership has been instrumental in steering the country towards a path of growth, stability, and prosperity. The progress made in areas such as education, healthcare, and infrastructure development is a clear indication of the countrys potential for growth and development towards vision 2030.\n\nWe in Palestine deeply admire Zimbabwes steadfast dedication to its sovereignty and its pursuit of a brighter future for all its citizens. The State of Palestine values the strong bonds of solidarity and friendship that exist between our two nations rooted in a shared commitment to the principles of justice, equality, and human rights which has been strengthened by our shared experiences as liberation movements, said Ambassador Almassri.\n\nHe also expressed his confidence that Zimbabwe will continue to play a vital role in promoting regional and international peace, stability, and cooperation, adding that the African continent looks up to Zimbabwe.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/11/2-2.jpg",
            "description": "Herald Reporter THE global community of nations and other world bodies yesterday congratulated Zimbabwe on its 45th anniversary of its Independence. There was an outpouring of solidarity messages from regional, continental and global organisations. The Republic of China, Belarus, India, the United Nations, Australia, Palestine, the United States, and the European Union are among the […]",
            "time": "21:27",
            "date": "19 Apr 2025"
        },
        {
            "title": "Joy, patriotism fill the air as Zim celebrates Uhuru",
            "url": "https://www.herald.co.zw/joy-patriotism-fill-the-air-as-zim-celebrates-uhuru/",
            "content": "Herald Reporters\n\nA WAVE of joy and patriotism swept across Zimbabwe as people celebrated 45 years of independence.\n\nThe main celebrations were held at the Mutora Open Grounds in Nembudziya, Gokwe, Midlands Province, where President Mnangagwa led the proceedings.\n\nEach province showcased its rich cultural heritage, featuring captivating musical talents, impressive oratory skills, and vibrant dances and displays.\n\nThis years celebrations were held under the theme, Zim@45: Devolve and Develop Together Towards Vision 2030.\n\nIn Harare, the celebrations were held at Epworth High School, where proceedings were presided over by the Minister of State for Harare Metropolitan Provincial Affairs and Devolution, Senator Charles Tavengwa, who read the Presidents speech to the delight of Epworth residents.\n\nIn Harare, the celebrations were held at Epworth High School, where proceedings were presided over by the Minister of State for Harare Metropolitan Provincial Affairs and Devolution, Senator Charles Tavengwa, who read the Presidents speech to the delight of Epworth residents.\n\nAmong the residents were Freddy Kapfupi Manjalima and his wife, Mai Nga, who kept attendees on their feet with their music and left guests in stitches with their skits.\n\nWe feel honoured and proud as residents of Epworth to have the Independence Day celebrations at our doorstep, Kapfupi said.\n\nThe Second Republic, led by His Excellency President Mnangagwa, has brought life to the people of Epworth.\n\nThe actor commended President Mnangagwa for decentralising national events, which enabled Epworth to host provincial events.\n\nApart from the police band, Chitepo National War Veterans choir, Elysium Magna dance theatre, T n T Brothers dance group, and ZILIWACO Mbira Crew provided entertainment.\n\nCelebrations ended with sports activities that included Chitungwiza and National Army male and female tug-of-war groups, as well as a soccer match between Scotland and Dreamers Academy football clubs.\n\nIn Masvingo Province, hundreds of people yesterday braved the cold weather and thronged Nemanwa Grounds in Masvingo district to celebrate 45 years of independence amid pomp and fanfare.\n\nMinister of State for Masvingo Provincial Affairs and Devolution, Ezra Chadzamira, arrived to cheers from the crowd.\n\nThe celebrations for the second year running were held at Nemanwa Growth Point in Masvingo district in line with the Second Republics devolution agenda to take key national programmes to all corners of the country.\n\nProceedings to mark the festivities started just around 10 am, with the huge crowd at Nemanwa witnessing the arrival of service chiefs led by 4 Infantry Brigade Commander Brigadier General Obert Tshuma for the celebrations.\n\nSoon after, the guest of honour and Minister of State for Masvingo Provincial Affairs and Devolution, Ezra Chadzamira, arrived to cheers from the crowd.\n\nMinister Chadzamiras arrival was preceded by the permanent secretary in his office, Dr Addmore Pazvakavambwa.\n\nThe Minister of State for Provincial Affairs and Devolution then inspected the parade before the crowd was entertained by the parades marching, with the army band providing music.\n\nThe parade displays were met with loud cheering by the crowd, particularly when the parade formed a shape that read Zim@45.\n\nMinister Chadzamira read the Presidential Speech before the crowd was treated to police dog displays by the Zimbabwe Republic Police.\n\nProceedings continued until days end, with a soccer match pitting Masvingo United against Great Zimbabwe University football club.\n\nMashonaland East Province also joined the entire nation and the world at large in celebrating Independence Day.\n\nThe province held the event at Kotwa High School in Mudzi district, where thousands from across the province gathered for the celebrations.\n\nIt was a hive of activity, with various entertainment groups, including one from Mozambique, mesmerising the attendees.\n\nA jovial mood could be felt throughout the proceedings as people enjoyed the peace and unity brought about by the living and fallen heroes.\n\nThe proceedings started when the Minister of State for Provincial Affairs and Devolution for Mashonaland East, Advocate Itayi Ndudzo, inspected the parade.\n\nHe later delivered the 2025 Presidential Independence speech, officially marking the end of the programme.\n\nHowever, the large crowd was treated to a football match soon after, between Tsonga Football Club from Mudzi and Changara Football Club from Mozambique.\n\nTsonga went on to win with a single goal to nil against their rivals.\n\nBy sunset, several musicians were already at the venue, waiting to perform to an already eager crowd.\n\nIn an interview on the sidelines of the celebrations, several people said it is critical to always remember how the nation attained independence, as it was not just a walk in the park.\n\nMrs Anatoria Nyakusauka from Kotwa said to her, the day is important as it is a reminder of how Zimbabwe gained independence.\n\nTo us, its like we are celebrating a birthday because this day is the one when Zimbabwe gained its freedom from colonial rule. I am so excited about this because we are enjoying peace and calmness since 1980. We enjoy it every day as Zimbabweans.\n\nThere is no doubt that Zimbabwe is one of the most peaceful countries in the whole world. Celebrating this day is giving honour to those who sacrificed all for us to be free today. We will never forget or look down upon that sacrifice; that is why we are out in our numbers to celebrate, she said.\n\nMr Farai Kambanje said his wish is for the prevailing peace to be maintained.\n\nWe are so peaceful in Zimbabwe and, of course, we will never forget the blood that was shed for us to enjoy this freedom. We are thankful to those who went to war for the sake of liberating us from colonial rule.\n\nMy prayer is for this peace that we are enjoying today to remain so for eternity, he said.\n\nMs Tanaka Kamuta, a youth from Mudzi, said it is important for the youth to be taught and reminded of how Zimbabwe gained independence.\n\nI always attend these important events because I know their importance to the nation. As a youth, I encourage my colleagues to always yearn to know how the peace enjoyed today came about. Our elders should always teach us to be patriotic and to always respect the sacrifice made by our fathers, grandfathers, and grandmothers for this freedom.\n\nI am aware that this peace did not just come; a vicious battle occurred, and Zimbabwe came out victorious. This is why we are here to celebrate that victory which brought in independence. Long live Zimbabwe, she said, before joining the crowd on the dance floor, singing along with the Seke Teachers College choir, which was performing at the event.\n\nIn Mashonaland West, apart from the provincial independence celebrations held at Mbafa Primary School in Chegutu, all the seven districts held similar commemorations at their respective centres, with people in Makonde converging at Alaska Stadium.\n\nMakonde Constituency legislator, Cde Simbarashe Ziyambi, commended the President for decentralising the event to grassroots.\n\nEntertainment was provided by sungura musician, Madzibaba Gina.\n\nThe Zvimba district converged at Kasanze School, where hundreds of attendees were entertained by local musical groups and school performances.\n\nMeanwhile, the provincial independence celebrations saw the main entertainment act being provided by guest singer Pridence Mama Africa Muchada, army-side Crocodile Sounds, and Chinhoyi Prison Band.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Bulawayo-Provincial-Affairs-and-Devolution-Minister-Judith-Ncube-680x380.jpg",
            "description": "Herald Reporters A WAVE of joy and patriotism swept across Zimbabwe as people celebrated 45 years of independence. The main celebrations were held at the Mutora Open Grounds in Nembudziya, Gokwe, Midlands Province, where President Mnangagwa led the proceedings. Each province showcased its rich cultural heritage, featuring captivating musical talents, impressive oratory skills, and vibrant […]",
            "time": "21:27",
            "date": "19 Apr 2025"
        },
        {
            "title": "Uhuru celebrations leave  lasting memories for Gokwe",
            "url": "https://www.herald.co.zw/uhuru-celebrations-leave-lasting-memories-for-gokwe/",
            "content": "Kuda Bwititi in Gokwe\n\nSONG, dance and a spirit of patriotism were the toast of Gokwe yesterday as thousands of Zimbabweans gathered at the Mutora Open Grounds in Nembudziya to mark the countrys 45 years of independence.\n\nThe atmosphere was electric with flags waving proudly, traditional drums beating rhythmically, and a palpable sense of national pride filling the air.\n\nThe day was chilly, and it rained in the morning, causing thick mud at the venue.\n\nMembers of the Zimbabwe Defence Forces abseil from a helicopter in one of the drills that left the crowd awestruck.\n\nHowever, this did not dampen the lively spirit among the thousands of people from all walks of life who attended the Independence Day celebrations.\n\nThe rural heartland transformed into a sea of celebration as people from all walks of life came together to honour the sacrifices of the past and look toward a brighter future.\n\nAt the centre of the days festivities was President Mnangagwa, who delivered a stirring address that captured both the historical weight of the occasion and the forward-looking aspirations of the Second Republic.\n\nAfter 45 years of Independence, the ZANU PF Government remains committed to building a future that honours the sacrifices of the past, but fundamentally secures prosperity for the generations ahead, he declared, receiving applause from the crowd.\n\nThe President emphasised the pivotal role of innovation, science and skills development in shaping Zimbabwes economic trajectory. With a call to embrace technical and vocational education  especially in science and technology  he outlined a vision of a self-sustaining, competitive economy rooted in homegrown expertise and resilience.\n\nTo guarantee that Zimbabwean products are competitive in both local and global markets, technical and vocational education, with biases in Science, Technology and Innovation, are of critical importance, he said.\n\nThe Presidents words struck a chord with the audience. Among the revellers were students, farmers, teachers and artisans  many of whom expressed hope that the Governments push for innovation and education would open doors for youth in previously marginalised communities like Gokwe.\n\nAt the centre of the days festivities was President Mnangagwa, who delivered a stirring address that captured both the historical weight of the occasion and the forward-looking aspirations of the Second Republic.\n\nI felt proud wearing my school uniform and singing for the President. We practiced for weeks, and today, I saw hope in the eyes of my classmates, said Tinashe Mudzamiri, a student at Nembudziya High School.\n\nIve seen many Independence Days, but this one felt different, shared Mr Thabo Marurenza, who is an artisan at ZESA in Gokwe and is also a brand ambassador for Radio Zimbabwe. I have lived in Gokwe for about 15 years and this is the biggest event to ever take place here. This day will never be forgotten by the people of Gokwe. The Presidents speech was powerful. It feels like were being called to build something new  and I want my children to be part of that future.\n\nWar veteran Mr Eckem Moyo, whose Chimurenga name Cde Robert Makiza, stood with pride as he reflected on the significance of Zimbabwes Independence Day celebrations.\n\nFor him, the occasion was not just a national holiday  it was a deeply personal journey back in time.\n\nI fought in the Gokwe area, in the dense bushes along the road to Zhombe, he recalled, his voice carrying the weight of memory.\n\nBeing here today, celebrating independence in the same soil where I fought is surreal. It brings back so many emotions  joy, pride and a deep sorrow for the comrades we lost along the way.\n\nDraped in the colours of the national flag, Mr Moyo watched the festivities unfold with a sense of fulfilment. The beating drums, childrens laughter and patriotic songs all served as a reminder of what they had fought for.\n\nAs war veterans, we are grateful to the President for bringing such a mammoth event to rural Gokwe. He truly is a visionary leader who is living true to his mantra of leaving no one and no place behind, said Mr Moyo.\n\nGokwe businessman Mr Stan Manyiwa could hardly contain his excitement as his enterprise experienced a surge in activity during the Independence Day celebrations.\n\nBusiness has been very good. It has been so for the past three weeks. The Independence Day celebrations didnt just bring joy to the people, but they also brought life to our markets. Its a reminder that when we come together to celebrate, we all benefit.\n\nAs traditional leaders and Government officials mingled with ordinary citizens, the celebrations echoed with a renewed sense of unity and determination.\n\nFrom traditional dance troupes to school choirs, the days performances reflected Zimbabwes cultural richness and enduring patriotism.\n\nPresident Mnangagwa also lit the Independence Day flame, signifying that the legacy of independence is not just about the past, but also about striving for progress, peace, and prosperity.\n\nPresident Mnangagwa also lit the Independence Day flame, signifying that the legacy of independence is not just about the past, but also about striving for progress, peace, and prosperity.\n\nThe crowd was entertained by various activities, including displays by the Zimbabwe Defence Forces, musicians and other performers.\n\nA musical gala was also scheduled to take place last night, featuring various top musicians.\n\nAs dusk fell and the last echoes of the national anthem faded into the twilight, one thing was clear: Gokwe had not only celebrated independenceit had embraced the promise of a future fuelled by innovation, pride, and the unshakable spirit of its people.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Part-of-the-crowd-in-Gokwe-680x380.jpg",
            "description": "Kuda Bwititi in Gokwe SONG, dance and a spirit of patriotism were the toast of Gokwe yesterday as thousands of Zimbabweans gathered at the Mutora Open Grounds in Nembudziya to mark the country’s 45 years of independence. The atmosphere was electric with flags waving proudly, traditional drums beating rhythmically, and a palpable sense of national […]",
            "time": "21:27",
            "date": "19 Apr 2025"
        },
        {
            "title": "Government completes 8 000 projects",
            "url": "https://www.herald.co.zw/government-completes-8-000-projects/",
            "content": "Farai Dauramanzi in NEMBUDZIYA Gokwe\n\nGOVERNMENT has completed over 8 000 projects countrywide since the coming in of the Second Republic under President Mnangagwa in 2017, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere said yesterday.\n\nSpeaking during the 45th Independence Celebrations at Mutora Open Grounds in Nembudziya, Gokwe North, Dr Muswere said the projects include the rehabilitation of roads, construction of dams, power plants and also initiatives such as the E-Learning strategy, Presidential Internet Scheme and the land tenure programme.\n\nAs we march forward with Vision 2030 which is running under the theme, Leaving no one and no place behind, we now have over 8 000 projects that have been completed by His Excellency, the President Dr Emmerson Mnangagwas Government.\n\nThese projects include programmes such as the construction of roads like the Beitbridge-Harare highway and we now also have 10 600 dams that have been constructed.\n\nThese are some of the projects that have been successfully completed. We also have initiatives such as the E-Learning strategy aimed at providing computers in schools, Presidential Internet Scheme and the distribution of land to Zimbabweans under the land tenure programme that was launched recently by President Mnangagwa, he said.\n\nSpeaking on the sidelines of the event, Chief Chireya, the traditional leader in the host district, expressed gratitude to President Mnangagwa for bringing the independence celebrations to his area.\n\nWe are happy that the hosting of these celebrations has brought development to our area.\n\nInformation, Publicity and Broadcasting Services Permanent Secretary Mr Nick Mangwana (right) shares a lighter moment with LEAD president Ms Linda Masarira (left) andNCA leader ProfessorLovemore Madhuku in Gokwe yesterday.\n\nWe did not have supermarkets and now they are there, roads have been rehabilitated, many boreholes were also drilled while clinics and schools were also constructed, said Chief Chireya.\n\nWar veterans also expressed satisfaction over the growing recognition of war veterans under the Second Republic, saying their decades-long hopes are finally being fulfilled.\n\nWe are happy that as war veterans, we are now receiving the recognition that we deserve, Zanu PF Secretary for War Veterans, War Collaborators, Ex-Detainees, and Restrictees, Cde Douglas Mahiya said.\n\nThis year is very special, following the launch of the Presidential War Veterans Fund meant to address our welfare issues.\n\nCde Mahiya said significant strides had been made, including the construction of houses for veterans and improved respect at national events.\n\nZanu PF Midlands provincial chairperson Cde Edson Chihengere expressed joy at hosting the Uhuru celebrations, saying a total of 1 726 people were employed during preparations for the 45th main Independence Day celebrations in Gokwe North.\n\nI applaud Zimbabweans for coming in numbers to support us in hosting the 45th main Independence Celebrations.\n\nAs Gokwe North, we have benefitted from road rehabilitation, the construction of schools, and borehole drilling, he added.\n\nThe Minister of Youth Development and Vocational Training, Cde Tino Machakaire, said youths were happy to celebrate the countrys independence as it is coming at a time the Government has made strides in their empowerment.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Ministers-Muswere-and-Garwe-680x380.jpg",
            "description": "Farai Dauramanzi in NEMBUDZIYA Gokwe GOVERNMENT has completed over 8 000 projects countrywide since the coming in of the Second Republic under President Mnangagwa in 2017, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere said yesterday. Speaking during the 45th Independence Celebrations at Mutora Open Grounds in Nembudziya, Gokwe North, Dr Muswere said the […]",
            "time": "21:27",
            "date": "19 Apr 2025"
        },
        {
            "title": "Zim-Belarus Business Forum set to boost economic ties",
            "url": "https://www.herald.co.zw/zim-belarus-business-forum-set-to-boost-economic-ties/",
            "content": "Farirai Machivenyika-Senior Reporter\n\nTHE Zimbabwe-Belarus Business Forum will be held in Minsk during President Mnangagwas State visit next month, as the two countries continue to strengthen their relations in various fields and provide a platform for the private sectors of both nations to forge ties.\n\nThis was stated by Foreign Affairs and International Trade Minister Professor Amon Murwira at the Mid-Term Review of the inaugural Joint Permanent Commission on Cooperation, which ended in Harare on Wednesday.\n\nWhile political relations are excellent, trade and investment have tremendous scope for expansion. The signing of the various instruments of cooperation is merely the first step; true value lies in their full implementation.\n\nIn this regard, we commend efforts by Belarusian companies to establish manufacturing and assembly plants within the Republic of Zimbabwe, which will serve both local and regional markets. We welcome the continued engagement between our business communities, particularly through the Zimbabwe-Belarus Business Forum, which will take place on the sidelines of the upcoming State Visit to Belarus, Prof Murwira said.\n\nHe added that the existing instruments of cooperation reaffirm their unwavering commitment to deepening collaboration, not only in traditional sectors such as agriculture, health, medical sciences, and infrastructure development, but also in harnessing the vast potential of the ongoing scientific and technological revolution.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Minister-Murwira--680x380.jpg",
            "description": "Farirai Machivenyika-Senior Reporter THE Zimbabwe-Belarus Business Forum will be held in Minsk during President Mnangagwa’s State visit next month, as the two countries continue to strengthen their relations in various fields and provide a platform for the private sectors of both nations to forge ties. This was stated by Foreign Affairs and International Trade Minister […]",
            "time": "21:27",
            "date": "19 Apr 2025"
        },
        {
            "title": "Upper middle-income society within sight",
            "url": "https://www.herald.co.zw/upper-middle-income-society-within-sight/",
            "content": "We publish here the speech that was delivered by President Mnangagwa at the 45th Independence Day celebrations in Nembudziya, Gokwe, yesterday.\n\n***\n\nDirector of Ceremonies and Minister of Local Government and Public Works, Hon D Garwe;\n\nThe First Lady, Amai A Mnangagwa;\n\nVice President, Hon Gen (Rtd) Dr CGDN Chiwenga;\n\nVice President, Hon Col (Rtd) KCD Mohadi;\n\nChairman of ZANU PF and Minister of Defence, Hon OCZ Muchinguri-Kashiri;\n\nMinister of State for Provincial Affairs and Devolution, Midlands Province, Hon O Ncube;\n\nMembers of the ZANU PF Central Committee and Politburo;\n\nLeaders of other Political Parties; Speaker of Parliament, Hon. Advocate JF Mudenda;\n\nPresident of the Senate, Hon M Chinomona;\n\nThe Chief Justice, Hon L Malaba;\n\nHonourable Ministers;\n\nChief Secretary to the President and Cabinet, Dr M Rushwaya;\n\nChairman of the Public Service Commission, Dr V Hungwe;\n\nCommander, Zimbabwe Defence Forces, Gen PV Sibanda;\n\nService Chiefs;\n\nYour Excellencies, Members of the Diplomatic Corps;\n\nMadzimambo Edu/Izinduna Zethu;\n\nSenior Government Officials;\n\nVeterans of the Liberation Struggle;\n\nFellow Countrymen and Women;\n\nComrades and Friends.\n\nToday marks another significant milestone as we celebrate the 45th Independence Anniversary of our great motherland, being held under the theme: Zimbabwe at 45: Devolve and Develop together towards Vision 2030.\n\nThis year, we gather here in Gokwe-Nembudziya, Midlands Province in fulfilment of our commitment to devolution and development, that leaves no one and no place behind. We thank you, the people of Gokwe and the Midlands Province for your warm welcome and hospitality. Tauyawo kudunhu revaShangwe.\n\nNzvimbo ino inenhorowondo. During the brutal colonial era, this area became home to many of our forefathers who were forcibly bundled out from various parts of the country by the racist white colonial regime.\n\nThey survived and thrived in these lands, which were then highly infested with tsetse flies, turning this area into one of the most populous and economically vibrant districts in our country.\n\nIn gathering here, from all the four corners of the country, we honour you, the people of the larger Midlands Province and Gokwe in particular. You shall forever stand as a symbol of resilience and fortitude. We also honour the great heroes of the Midlands Province.\n\nThese include General Josiah Magama Tongogara, Cde Leopold Takawira, Cde Cephas Msipa, Cde Richard Hove, Cde Stephen Vuma, Cde Lameck Makanda, Cde Benjamin Mabenge, Cde Sibusiso Moyo, Cde Garikayi Magadzire, Cde Nash Nyasha Dzimiri, Cde Herbert Mahlaba, Cde Sydney Bhebhe, and Cde Ngwabi Bhebhe, among others.\n\nMany more lie at District and Provincial Heroes Acres as well as in unmarked graves within the country and beyond.\n\nIt is because of their collective bravery, dedication and patriotism that today we are forever free, Independent, peaceful and a sovereign people. Kutsunga kwavo, nekushinga, nekuda nyika yekwedu; nekuzvipira kwaita kuti nhasi tive takasununguka.\n\nYour contribution as Midlands Province and Gokwe, to the economy in post-Independent Zimbabwe, through cotton production, here in this district as well as in mining, crop and livestock farming, among other sectors, is unmatched.\n\nThe country is gathered here, therefore, to thank you, ukuzolibonga, kuzokutendayi, and to celebrate with you. This Independence is ours together, we are one united people of Zimbabwe. Commemorations are also taking place countrywide, at provincial levels as well as throughout the world at our diplomatic missions. To all my Fellow Citizens, countrymen and women ndinoti Makorokoto; ngithi Amhlophe; Congratulations Zimbabwe, on 45 years of Independence, freedom, sovereignty, unity, peace and development. Happy Independence Day!\n\nComrades and Friends; As we mark this day, we can look back at the past with pride, knowing what we have achieved, as a united and hardworking people.\n\nFrom the household level up to our respective provinces and the nation as a whole, we are defying the odds, breaking records and realising uncommon development successes.\n\nThe continuing sanctions, climate change-induced setbacks, global economic shocks, and machinations by detractors, desperate to see us divided, have not derailed our course. A higher quality of life and a prosperous upper middle-income society for many more of our people, in line with Vision 2030 is within sight.\n\nTogether as one people, we are building our motherland, brick by brick, and stone upon stone. From Plumtree to Mutare, Zambezi to Limpopo, Beitbridge to Chirundu, Zimbabweans are demonstrating that Nyika inovakwa, inotongwa, inonamatirwa nevene vayo / Ilizwe lakhiwa, libuswe, likhu-le-kelwe ngabanikazi balo.\n\nComrades and Fellow Citizens; The Second Republic is comprehensively promoting rural development and revitalisation.\n\nWe are delivering development towards Vision 2030. Hurumende yedu ye ZANU PF irikuunza budiriro kumaruwa.\n\nIt is worth noting that this years Independence celebration is occurring after the consolidation of our Land Reform through the issuance of title deeds to both A1 and A2 farmers, including veterans of the liberation struggle. My Government is also stepping up efforts to regularise both old and new settlements in cities and towns throughout the country. These programmes are set to assure citizens security of tenure, and ownership of their properties through title deeds.\n\nThe ongoing Agriculture Transformation Strategy, implemented under my Administration, is further deepening rural reforms to ensure food security, increased grain production and agricultural efficiency.\n\nImproved incomes for farmers, beginning at household levels are evident while poverty eradication initiatives anchored by the agriculture sector have broadened.\n\nRiding on the rural industrialisation policy, the volume of trade and value addition, based on agriculture crops and products is recording new highs.\n\nSteady growth of both the beef and dairy national herds and other categories of livestock farming as well as the need to prevent animal-borne diseases remain a top priority for my Government. As such, programmes, including the Presidential Heifer, Piggery and Poultry Pass-on Schemes, particularly for women, youth and war veterans, will continue to be supported.\n\nLand which is our inalienable heritage, is being productively utilised, with an anticipated bumper harvest from the 2024-2025 summer cropping season.\n\nThis will see the restocking of our Strategic Grain Reserve.\n\nI call upon all patriotic Zimbabweans to support our farmers and industries by buying local produce, increasing investments in agri-businesses and unlocking the full potential of our land.\n\nThe Pfumvudza/Intwasa programme is expanding yearly. Partnerships under the Irrigation Development\n\nAlliance, will develop an additional 100 000 hectares with the private sector. These proactive initiatives will go a long way towards minimising the challenges associated with climate change.\n\nLast seasons El Nino induced drought affected many districts throughout the country. We must applaud ourselves as a nation, for being able to feed ourselves in the face of this adversity. Vulnerability of all those affected was adequately reduced under the Food Deficit Mitigation Programme, which also saw urban households benefiting from cash transfers.\n\nGovernment continues to honour the contribution made by our people to the attainment of Independence, especially the Veterans of the Liberation Struggle. We are creating an enabling environment for full participation in mainstream socio-economic development. To date, many programmes are underway, such as the Presidential Borehole drilling, Rural Solarisation and Housing schemes, along with those under the Youth Empowerment initiative.\n\nCommunities across the country are encouraged to be actively involved in these programmes being championed by our ruling ZANU PF Government.\n\nAll Zimbabweans, no matter their gender, tribe, age or political affiliation, must benefit. ZANU PF is a peoples Party. Tose tinokwana muhomwe nemuma programmes e-Musangano weruzhinji rweZimbabwe.\n\nGovernment, is concerned with the frequency of destruction of life and property in some districts, including here in Gokwe, Chimanimani, Chipinge, Chiredzi, Muzarabani, and Tsholotsho, among others, due to the severe weather events. The need to build climate resilient infrastructure in communities, is now urgent.\n\nMore resources have, therefore, been allocated to restore and rehabilitate damaged infrastructure, including schools, clinics, bridges, roads and water supply systems. So far, houses constructed by Government for flood victims are ready for commissioning, while over 400 boreholes have been drilled in this province alone, some of which, have been equipped with solarised pumps.\n\nFellow Zimbabweans; It is pleasing that our economy continues to experience positive growth.\n\nThe policies of the Second Republic are bearing fruit, with the mining sector leading and supporting value addition across sub-sectors.\n\nA 5,6 percent growth is expected this year, benefiting from new mines, and the favourable commodity prices of some minerals.\n\nThe accelerated implementation of the National Development Strategy has had a positive impact on manufacturing sector value chains. Of note is the Pharmaceutical Sector, with rising capacity utilisation up to the current 50 percent, from previous levels of 43 percent. After 45 years of Independence, the ZANU PF Government remains committed to building a future that honours the sacrifices of the past, but fundamentally, secures prosperity for the generations ahead.\n\nTo guarantee that Zimbabwean products are competitive in both local and global markets, technical and vocational education, with biases in Science, Technology and Innovation, are of critical importance. Training of artisans and technicians to drive our industrialisation agenda, under the Industry and Government Special Apprenticeship Scheme has commenced.\n\nThe Integrated Skills Expansion and Outreach Programme is also equipping youths in rural communities, with skills to drive modernisation and development, beginning at the grassroots level.\n\nOver the past year, tax incentives, infrastructure access and public procurement reforms, that favour youth-led enterprises and business start-ups, have been implemented by the Second Republic.\n\nSimilarly, financial support to women-led businesses have been extended through various financing schemes.\n\nThese facilities have increased the number of women and Micro, Small and Medium Enterprises participating in local, regional and international trade. The ZANU PF Government is listening and wholeheartedly fulfilling the aspirations of our people.\n\nVulnerable learners under the Basic Education Assistance Module exceed 1.5 million. New schools and classrooms were constructed in all provinces with focus on rural and resettlement areas. New urban settlements throughout the country are benefiting from this programme, including Cowdray Park in Bulawayo as well as Stoneridge and Caledonia in Harare.\n\nThe ongoing quest by my Government to realise urban-rural energy security, has seen the electrification of rural public institutions across Zimbabwe, such as schools, clinics and administrative centres. This is positively impacting social service delivery.\n\nThe health delivery system is undergoing reform and modernisation, in terms of quality service delivery, access to affordable specialist treatment, availability of drugs as well as infrastructure development. I commend the private sector, which has come on board to increase health facilities across all provinces.\n\nFellow Zimbabweans, Comrades and Friends;\n\nIn March this year, Senior Public Sector officials signed Performance Contracts, as a management tool for achieving impactful results. It is commendable that thousands of high impact projects have been completed between 2018 and 2024, with every Ward having a project the people can attribute to the 2nd Republic.\n\nThese span critical areas in infrastructure, energy, agriculture, health, education, and industry.\n\nInternet access during the Third Quarter of 2024, increased remarkably, paving way for the expansion of digital transformation, e-Government, e-Learning, mobile banking services and automation of procurement systems, improving efficiency and curbing corruption, among other benefits. Technologies in the delivery of justice, are assisting in crime prevention as well as protecting lives and property.\n\nThe same will be deployed to bring sanity on our roads and prevent the mayhem that has increased Road Traffic Accidents. Progress, in these and other areas, is significant, and work is ongoing. We will leave no stone unturned in pursuit of quality service delivery throughout our economy.\n\nEmployee welfare, as well as fair and inclusive working conditions, are a top priority of the Second Republic.\n\nThe Public Service Pension Fund is prudently laying a firm foundation for sustainable social protection while occupational safety and health are being promoted.\n\nAll people and all jobs are important, be it in rural or in urban areas, we are one. Tose takakosha munyika yedu. Vekumaruwa, nevekumadhorobha, ne avo varikushanda varikunze kwenyika, takakosha.\n\nFellow Citizens;\n\nUnity, peace and security are essential ingredients to sustainable development and prosperity. Zimbabwe is at peace within our borders, with our regional neighbours and the world. Our country enjoys excellent relations within the comity of nations. Under our mantra friend to all and an enemy to none, we are consolidating existing friendships and establishing new partnerships that benefit the economy and people to people relations.\n\nAs the current Chair of SADC, Zimbabwe is promoting innovation, the development of cross-border value chains and enhancing opportunities for Public Private Partnerships, to drive modernisation and industrialisation.\n\nFurther, promoting intra-African trade, and resolving conflicts in some parts of Africa, towards entrenching peace for sustainable socio-economic development, are critical areas of our focus.\n\nIn this spirit, we work with all partners to strengthen multi-lateralism and a rules-based global governance system, that leaves no country, or region behind.\n\nComrades and Friends; Each of us has a duty to protect our nation from elements, both within and outside our borders who want the regression, of our national development course. Hand-in-hand, with focus and discipline, let us defend and work harder for the benefit of our motherland, Zimbabwe, now and in the future.\n\nWe salute our security services for their loyalty, patriotism and unflinchingly defending our country, sovereignty; territorial integrity; and hard-won Independence.\n\nTinotenda mawuto edu navo vese vanoshanda kudzivirira nyika yedu nekuzvitonga kwedu kuzere.\n\nAll patriotic Zimbabweans are reminded of the need to guard against the dangers of social media, which is increasingly being used as a tool to cause discord and raise false alarms.\n\nI commend you, my dear fellow compatriots, both at home and abroad, for remaining vigilant, patriotic and steadfast, never allowing ourselves to be misled by shadowy elements with dubious opportunistic agendas. Ngatirambe takabatana, tichivaka nyika yedu. Tose tine mutoro wekushandira Zimbabwe. Ngatizivikanwe kuti takashandira dunhu kana nyika yekwedu, nekubatanidza vanhu.\n\nThe values of love, mutual support and trust are handed down from generation to generation, just like our culture, traditions, history, and moral principles.\n\nMoral standards and the family institution must be deliberately protected. Zimbabwe has been, and must remain, a stronghold of the traditional values on which human civilisation stands. In this spirit, let us never neglect the plight of the elderly, orphans, disabled and those exposed to drug and substance abuse, among other vulnerable members of our society.\n\nAll levels of Government, our traditional leaders, civil society and the churches are challenged to contribute to stronger families and greater community cohesion. As communities, let us help to preserve the noble values of love, unity, compassion, empathy, discipline and hard-honest work, for which Zimbabweans are known for. This message of peace, love, unity, hard work and discipline, should be spread across all our families, communities and the nation, to children, as well as young and old people alike. The Second Republic is entrenching the rule of law, defending the Constitution and stands ready to protect law-abiding citizens, while dealing decisively with misguided and rouge elements. Divisive and alarmist elements will never triumph over a nation such as ours; with a rich liberation history and born out of the blood of the brave sons and daughters of this sacred land. Our law enforcement agencies, will always act according to the law and in the best interests of our Independent and sovereign motherland, Zimbabwe.\n\nFellow Country-men and Country-women; Our motherland, Zimbabwe, is poised for greater times.\n\nLet us remain focused, resilient and persistent, inspired by the numerous achievements and milestones attained so far.\n\nRegardless of political affiliation, religion, race, gender or age, let us all put Zimbabwe first. It is the only country that we call home, and which the next generations shall call home.\n\nBrothers and Sisters, Fellow Citizens in the Diaspora; you too have a duty to speak well, defend and promote the national interests of our great nation, Zimbabwe. Victory in all circumstances is our heritage; the ability to overcome any challenges is in our DNA.\n\nAcross every sector, let us re-double production and productivity, to realise self-sufficiency in our economy. Through our own efforts, let us remain a free, Independent and sovereign people, who are masters of our own destiny.\n\nAs the curtain comes down on this year s commemoration, which begun with the Childrens Party yesterday, I thank you, the people of Midlands Province and Gokwe, for warmly welcoming Zimbabwe to your doorstep and for turning out in your large numbers. Makorokoto, Amhlophe, Magona.\n\nCongratulations.\n\nWe also commend all stakeholders for the developmental projects undertaken on the side-lines of these commemorations and for the overall success of this event. Fellow Compatriots; This years Independence commemorations coincide with the Easter holidays. We thank Almighty God, who gave His only begotten Son, our Lord and Saviour Jesus Christ, to die on the cross and rise from the dead, for our sins. Through Him we now receive salvation and eternal life. Let us continue to thank God for redemption and to pray for our nation, encouraged by Philippians 4 verse 13 which says We can do all things through Jesus Christ who gives us strength.\n\nWith these remarks, it is now my singular honour and privilege to wish all Zimbabweans, here at home and those around the world, a Happy 45th Independence Anniversary.\n\nLong live our independence.\n\nLong live our freedom, our unity and our peace.\n\nLong live Zimbabwe.\n\nGod bless you.\n\nGod bless Zimbabwe.\n\nI thank you.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/President-Mnangagwa-speech-680x380.jpg",
            "description": "We publish here the speech that was delivered by President Mnangagwa at the 45th Independence Day celebrations in Nembudziya, Gokwe, yesterday. *** Director of Ceremonies and Minister of Local Government and Public Works, Hon D Garwe; The First Lady, Amai A Mnangagwa; Vice President, Hon Gen (Rtd) Dr CGDN Chiwenga; Vice President, Hon Col (Rtd) […]",
            "time": "21:27",
            "date": "19 Apr 2025"
        },
        {
            "title": "Woman dedicates life to saving orphans",
            "url": "https://www.herald.co.zw/woman-dedicates-life-to-saving-orphans/",
            "content": "Theseus Shambarerecently in CHIREDZI\n\nIMAGINE, 22 mouths waiting to be fed!\n\nTwenty-two lives looking up to you to be nurtured.\n\nSuch is the life of an extraordinary woman from the dusty streets of Tshovani, a high-density suburb in the sugarcane-producing town of Chiredzi.\n\nNdidzulafhi Moyo, a 54-year-old widow, who recently opened up to The Herald in an interview, has a heart that overflows with love.\n\nShe has dedicated her life to rescuing children from the harsh realities of the streets.\n\nDespite her immense dedication to caring for 22 children, Ndidzulafhi remains humble as she ekes out a living as a vegetable vendor in the bustling market of Chiredzi.\n\nA child who is desperate on the street, she explains, her voice weathered by years of toil. Their eyes tell a story. A story of hunger, of fear, of a life adrift. You see the pain, the loneliness, the shattered dreams reflected in their eyes. But you also see the flicker of hope, the spark of resilience, the yearning for a better future.\n\nNdidzulafhi does not just see the children; she sees their potential, their dreams, the lives that could be.\n\nI interview them, she says, adding, Try to understand their situation, their fears, their hopes. To see the child beneath the scars, beneath the grime. To see the unique individual, with their own dreams, their own talents, their own unique story waiting to be written.\n\nThis innate empathy, born from her own profound losses, has led her to become a foster parent, a role she embraces with unwavering dedication.\n\nLosing three out of her six biological children to the Grim Reaper has etched a deeper understanding of loss and grief onto her soul. After losing her children, she was left to raise her grandchildren single-handedly as death claimed her husbands life last year.\n\nThis taught me the depth of a mothers lovethe fragility of life and the desperate need for a loving hand, she confesses, her voice thick with emotion.\n\nIt taught me that every child deserves a chance to thrive, to dream, to simply be a child, free from the burdens that weigh down their young shoulders.\n\nNdidzulafhis home, once a haven for a few, has transformed into a sanctuary, a veritable childrens home overflowing with life and laughter.\n\nThe clatter of plates, a symphony of metal against metal, echoes through her small house every evening.\n\nTwenty-two plates, meticulously arranged on the rough-hewn wooden table, await their eager occupants. A stark reminder of the lives she nurtures, the hearts she mends, the futures she shapes.\n\nEach plate testifies to her unwavering commitment to the children who call this humble abode their home.\n\nSome women dump newly-born babies for different reasons. These find their way to Ndidzulafhis home.\n\nThe training she received as a community child care worker (CCW) under the child protection programmes spearheaded by the Ministry of Public Service, Labour and Social Welfare, in partnership with UNICEF and the Swedish government, further empowered her commitment.\n\nWhen a child is dumped, I report the case to the police and to the social welfare department. It is my duty to ensure their safety, to protect their innocence. But it is not enough, she says.\n\nShe adds: We need to break the cycle of poverty, of exploitation, of despair. We need to empower these children, to give them the tools and the opportunities to build a better future for themselves and their communities. We need to create a world where every child has the right to a birth certificate, to an education, to a life free from abuse.\n\nIf a child is picked from the streets and handed over to me after proper channels have been followed by the social welfare department, I ensure that the child gets a birth certificate or national identity card.\n\nAmong the children she shelters are the twins, Enock and Victoria. Orphaned at a tender age, they faced a bleak future.\n\nEnock, a beacon of resilience, took on odd jobs while still in Grade Six in the sugarcane fields, sacrificing his childhood to ensure his sisters and his own education.\n\nHe walked for miles, Ndidzulafhi reflects.\n\nMiles to school, miles to work, carrying the weight of his family on his young shoulders. His spirit, unbroken by hardship, is an inspiration to us all. His actions even taught me that, in the face of adversity, the human spirit can soar.\n\nTheir story, she says, touched the hearts of their teachers and soon, the school intervened. Recognising the impossible burden on these young shoulders, they sought a safe haven for the twins.\n\nNdidzulafhi, with her open heart and overflowing home, became their refuge. Now, the twins are blossoming, their futures no longer tethered to the harsh realities they once faced. Both Enock and Victoria, with Ndidzulafhis encouragement, are excelling in their studies, dreaming of becoming engineers.\n\nYet, as she watches the children devour their meal, a quiet worry lingers within her.\n\nTwenty-two plates, twenty-two mouths to feed, twenty-two lives to nurture.\n\nThe weight of responsibility, the ever-growing needs of her children, often threatens to overwhelm her.\n\nMy prayer is that when these two complete their Advanced Level studies, which I am confident that they will pass with better grades, they get enrolled at a university to further their studies.\n\nI want to see them realise their dreams despite the fate they befallen them at a tender age, Ndidzulafhi says.\n\nAs the sun dips below the horizon, casting long shadows across the dusty streets of Tshovani, she sits on her porch, the laughter of children fading into the distance.\n\nNdidzulafhi looks up at the star-studded sky, a silent prayer for the future, for the children in her care, for a world where every child can reach for their dreams, where every child can find their place under the sun.\n\nFeedback:X@TheseusShambare\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Ndidzulafhi-Moyo-680x380.jpg",
            "description": "Theseus Shambare recently in CHIREDZI IMAGINE, 22 mouths waiting to be fed! Twenty-two lives looking up to you to be nurtured. Such is the life of an extraordinary woman from the dusty streets of Tshovani, a high-density suburb in the sugarcane-producing town of Chiredzi. Ndidzulafhi Moyo, a 54-year-old widow, who recently opened up to The Herald […]",
            "time": "21:27",
            "date": "19 Apr 2025"
        },
        {
            "title": "Editorial Comment: Let’s keep marching towards Vision 2030",
            "url": "https://www.herald.co.zw/editorial-comment-lets-keep-marching-towards-vision-2030/",
            "content": "PRESIDENT Mnangagwa was clear and forthright in his Independence speech in Gokwe yesterday  lets keep focused towards the attainment of Vision 2030 without letting our detractors side track us.\n\nHe was also unequivocal about the need to maintain national cohesion and unity, exhorting Zimbabweans to prioritise peace and stability so that national programmes and processes can proceed unhindered.\n\nZimbabweans are honest, hard working people, the President said, and there is nothing that can stand in their way towards the attainment of shared goals.\n\nThus he called for the consolidation of the progress made since Independence while building towards a better, prosperous future.\n\nIn the years after independence there was real progress in making sure educational opportunities long denied so many people were opened to all. There was also a concerted effort to ensure that all Zimbabweans could access at least the basic health facilities practically, as well as opening doors to economic advancement.\n\nEfforts were made to empower the communal areas with both proper local government and with the start of better farming opportunities, at the very least stripping away the laws that limited their competitiveness. With the dumping of the old racial and land tenure laws it became possible for a lot of people to realise the fruits of their hard work and live better.\n\nAfter around 20 years the promise of land reform was made real in the sense that Zimbabwe took control of its farming land and started allocating this land on the basis of ability and need, although it soon became obvious that the major benefits of land reform would need further programmes to allow the landholders to realise their potential and to give them security so they could develop their farms.\n\nBut whatever we do there is still more than needs to be done since we cannot just draw a line and say we now have a perfect country, a perfect society and a perfect economy.\n\nThe Second Republic under President Mnangagwa has in more than six years been accelerating the development of the economy, of communities, families and individuals, realising ever more the potential of the resources Zimbabwe has been blessed with and making sure that everyone shares in this potential, with no area and no person left behind.\n\nThis double requirement, of growth that includes all, is summarised in the theme for the independence celebrations this year: Zimbabwe at 45: Devolve and develop together towards Vision 2030. We need the development, but we need to make sure that this is devolved, so we all benefit, and no one is left behind.\n\nIn his address to the nation to mark the 45th anniversary, President Mnangagwa returned to the practical business of building Zimbabwe. It cannot happen instantaneously, but it must happen as he noted, a brick a time. Vision 2030 is largely a goal so that we know what we are building in practical terms, and to make sure that all Government and private policies are heading in the same direction. In his address the President explored the brickworks that we are using to get those bricks to build the country. Farmers, commercial on the larger A2 farms and small-scale on the communal lands and A1 farms, are now able to access a range of programmes to grow more crops and, increase and upgrade livestock.\n\nThese practical programmes not only bring in the results of research to cope with climate change and other problems, and not only make sure that any genuine farmer can access inputs through a range of schemes, but also close the door on those who want to cheat with some very simple checks and conditions shutting the door on corruption.\n\nOther programmes are closing the rural-urban divides, such as the borehole drilling that is bringing a borehole to every village and every school, and the rural solar programme that will provide a basic power supply to every house. These add value to life far in excess of the modest increase in economic value, making life a lot easier for a lot of people. Not all programmes have to be economically justified.\n\nAt the same time the Government is now moving ahead on offering security to all genuine farmers with a title-deed scheme, with a similar scheme in progress in urban areas to regularise those settlements that can be regularised and where people have commendably been building decent housing. At the same time as sorting out the urban mess caused by deficient local government, the Government wants the proper rules enforced so that we can accelerate the provision of housing without cleaning up future errors.\n\nThe universal right to education and skills training is being made far more effective, partly by ensuring that those from vulnerable families can go to school, partly through curriculum changes that stress that pupils and students must learn how to apply the knowledge learned in classrooms, but also with a huge expansion in vocational training so that practical skills are learned and far more people can earn a good living.\n\nIn the end it is what people can do and what they do that matter and here a practical Government is opening doors for practical people, and increasing the backing for those prepared to apply their skills and work hard.\n\nDevolution has had some very practical benefits already, with a significant chunk of the capital budget now being applied through local authorities and communities. The basis for this is that people living on the spot almost always have a far better idea of what they need and what they are missing than a theoretical expert, and are normally willing to ensure far more value comes from the devolved funds through their own inputs.\n\nGood government also requires being able to deal with emergencies, and here the President brought up the fact that Zimbabwe is now largely able to cope with its own resources when faced with emergencies like Covid-19 or that terrible drought that hit us last year. We also learn from this coping, not just in overcoming the potential disaster but also putting place policies so that next time we have less of a problem.\n\nThe President was also stressing the need for national unity, which does not mean we all agree all the time but does mean we are all ready to pull our weight and push forward to build the Zimbabwe we want and which our children deserve. There might be debate and disagreement over priorities and policies, but there is remarkably little disagreement over what sort of society we want and what sort of country we all want.\n\nIndependence Day is a good time for us all to remember that far more unites us than splits us up and that we have and can work together. We first did that to win our independence, and now we must continue doing this to turn that independence into the sort of country and society we all want.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/WhatsApp-Image-2025-04-18-at-13.26.13-680x380.jpeg",
            "description": "PRESIDENT Mnangagwa was clear and forthright in his Independence speech in Gokwe yesterday – let’s keep focused towards the attainment of Vision 2030 without letting our detractors side track us. He was also unequivocal about the need to maintain national cohesion and unity, exhorting Zimbabweans to prioritise peace and stability so that national programmes and […]",
            "time": "21:27",
            "date": "19 Apr 2025"
        }
    ]
}