{
    "news": [
        {
            "title": "Government has not banned small scale mining: Dr Kambamura",
            "url": "https://www.herald.co.zw/government-has-not-banned-small-scale-mining-dr-kambamura/",
            "content": "Wallace RuzvidzoHerald ReporterGovernment has not banned small-scale mining activities but has urged miners to exercise caution during this rain season, Mines and Mining Development Deputy Minister Dr Polite Kambamura has said.This comes after misguided reports by some media outlets that the Deputy Minister had called for a ban on small-scale mining activities.\n\nIn an exclusive interview today, Dr Kambamura allayed fears that Government had banned small-scale mining activities.\n\nThe Deputy Minister said he was only advising small-scale miners to suspend their operations as a cautionary measure.\n\nThis was after a mining shaft in Makaha, Mudzi, collapsed last week, resulting in three small-scale miners getting trapped.We did not ban underground mining, we value the contributions coming from the small-scale sector, especially the gold sub-sector, but above all life is sacred. We value the lives of people and therefore safety will be a priority.\n\nSo underground mining is not banned, we do not have any plans to ban small-scale underground mining but what we are saying is if there are bad weather conditions, our miners should consider safety, he said.\n\nI issued a comment on the matter (Makaha incident) advising small-scale miners to consider suspending going underground considering the dangers posed by incessant rains and the weak ground conditions that can lead to mine flooding and the ground collapsing.\n\nOn 13 February 2019, we had a similar case at Battlefields in Kadoma where small-scale miners were flooded by rain and we lost 24 miners. So as a cautionary statement, we advised small-scale miners not to go underground when it is raining and resume when weather conditions improve, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/IMG-20250114-WA0067-680x380.jpg",
            "description": "Government has not banned small-scale mining activities but has urged miners to exercise caution during this rain season, Mines and Mining Development Deputy Minister Dr Polite Kambamura has said.",
            "time": "18:00",
            "date": "14 Jan 2025"
        },
        {
            "title": "Chief Charumbira heads to Mozambique for President-elect Chapo’s inaugration",
            "url": "https://www.herald.co.zw/chief-charumbira-heads-to-mozambique-for-president-elect-chapos-inaugration/",
            "content": "Zvamaida MurwiraSenior ReporterPan African Parliament president, Chief Fortune Charumbira is going to Maputo, Mozambique, for the inaugration of President-elect Daniel Chapo on Wednesday following elections that were held last year.In his invitation to Chief Charumbira, Mozambican President Filipe Nyusi said his country and PAP enjoy good bilateral relations.\n\nFollowing the validation and proclamation of the results of the 7th Presidential, Parliamentary and Fourth Provincial Assembly election held on October 9, 2024, in which Mr Daniel Francisco Chapo was declared the winner, I am delighted and honoured to extend an invitation to you to attend the inaugration ceremony of His Excellency the President-elect, reads Chief Charumbiras invitation from outgoing President Nyusi.\n\nIn line with the Constitution of the Republic of Mozambique, the inaugration ceremony takes place on the 15th of January 2025 at the Independance Square in the capital city Maputo before Members of the National Assembly, the people and invited dignitaries.\n\nIn view of the excellent partnership and cooperation between PAP and our nation, I am confident that you will honour our invitation with your presence at this landmark event in our history of consolidation of democracy and rule of law.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Chief-Fortune-Charumbira.jpg",
            "description": "Pan African Parliament president, Chief Fortune Charumbira is going to Maputo, Mozambique, for the inaugration of President-elect Daniel Chapo on Wednesday following elections that were held last year.",
            "time": "18:00",
            "date": "14 Jan 2025"
        },
        {
            "title": "Oliver Mtukudzi, Zex Manatsa and Mbuya Chiweshe, the legends who bade farewell in January",
            "url": "https://www.herald.co.zw/oliver-mtukudzi-zex-manatsa-and-mbuya-chiweshe-the-legends-who-bade-farewell-in-january/",
            "content": "Trust Khosa\n\nIn Roman mythology, January holds significant meaning, marking the start of the year.\n\nIt is a time for reflection and setting resolutions as the new year unfolds.\n\nNamed after the Roman god Janus, January symbolises beginnings and endings.\n\nFor the families of Zimbabwes late music icons  Mbuya Stella Chiweshe, Zex Manatsa and Oliver Tuku Mtukudzi  January represents a period of sorrow.\n\nThis trio, celebrated for promoting Zimbabwes culture and music beyond its borders, all passed away during the month of January.\n\nFor these families, January is indeed a dark month, as they remember their torchbearers.\n\nFans hope that the tears shed in memory of the trio will nurture the seeds of love they planted within their respective communities.\n\nAmong them, Tuku was the first to pass on January 23, 2019, at a Harare hospital.\n\nHe lost his battle against diabetes complications, leaving millions of his fans across the world shattered.\n\nFor building an impressive body of work over four decades, singing songs with substance, and his global influence, Tuku was declared a national hero.\n\nHis remains were interred at his Madziva home in Mashonaland Central Province.\n\nTuku, who commanded a huge following, inspired generations.\n\nHowever, some of his family members are yet to find closure. The cloud of bitterness, sorrow and anger still hovers among them.\n\nWith time, it is hoped that they will find each other and move on.\n\nThen, another yesteryear icon, Manatsa, lost his battle against cancer on January 20, 2022.\n\nHe was 78.\n\nThe Green Arrows boss, who shattered records after his wedding ceremony at Rufaro Stadium in 1979, was a music colossus for years.\n\nA unifier, Manatsa won the hearts of football fans with songs dedicated to the countrys once most-supported four teams  Dynamos, Highlanders, CAPS United, and Zimbabwe Saints.\n\nHis all-time hits, including songs like Chipo Chiroorwa, Chitima Nditakure, Hwahwa, and Tea Hobvu, are still as wonderful as ever.\n\nAs a true legend, he received a State-assisted funeral and was buried at Warren Hills Cemetery, Harare.\n\nManatsas wife, Stella, died in her sleep at their Mabelreign, Harare home, on August 30, 2022.\n\nOn January 20, 2023, the nation was plunged into mourning again following the death of Mbuya Stella Chiweshe.\n\nShe lost her battle against a brain tumour at the age of 76.\n\nThe cultural icon, whose career spanned over five decades, was also hailed for the role she played in Zimbabwes liberation struggle.\n\nThe mbira queen also marketed Zimbabwe overseas, especially in Germany, where she spent most of her life.\n\nLike a true traditionalist, Mbuya Chiweshe was buried the traditional way in Nekati Village under Chief Masemburas area.\n\nHer burial made headlines after her body was transferred from an expensive casket to be wrapped in a cloth and a reed mat.\n\nThe casket was destroyed, with close relatives in charge. The media was barred from taking pictures, true to tradition.\n\nHer daughter, Virginia Mukwesha, told mourners that it was Mbuya Chiweshes wish to be buried the traditional way.\n\nTwo years after her death, Mbuya Chiweshe is still remembered for promoting African tradition through music.\n\nLike her two counterparts  Tuku and Manatsa  the departed mbira icons influence is still being felt.\n\nShe remains a role model, inspiring other female mbira players to navigate the terrain she once occupied.\n\nBesides this trio, there are also other Zimbabwean celebrities who died in January.\n\nThe late Simbarashe Mhere, a Zimbabwe-born South African actor, presenter, and television personality died on January 31, 2015, at the age of 26.\n\nMhere, who reportedly moved to South Africa when he was only one, will be best remembered for his exploits on the top lifestyle show, Top Billing, which earned him fans across the continent.\n\nAcross the Limpopo, fans are mourning the death of South African actress and singer Winnie Khumalo, who died on January 7 at the age of 51.\n\nThe Afro-pop star, whose career dates back to the 1980s, will be buried on Saturday.\n\nFamed for her hit song Live My Life, she had the opportunity to collaborate with top South African acts, including Brenda Fassie.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2020/04/2004-1-1-OLIVER-GOOD.jpg",
            "description": "Trust Khosa In Roman mythology, January holds significant meaning, marking the start of the year. It is a time for reflection and setting resolutions as the new year unfolds. Named after the Roman god Janus, January symbolises beginnings and endings. For the families of Zimbabwe’s late music icons — Mbuya Stella Chiweshe, Zex Manatsa and […]",
            "time": "18:00",
            "date": "14 Jan 2025"
        },
        {
            "title": "Commission grills Harare’s acting Human Capital Director as public hearings resume",
            "url": "https://www.herald.co.zw/commission-grills-harares-acting-human-capital-director-as-public-hearings-resume/",
            "content": "Trust Freddy\n\nHerald Correspondent\n\nThe Commission of Inquiry into the affairs of Harare City Council resumed public hearings today as it continues to investigate the alleged corruption and mismanagement of resources within the council.\n\nThe acting Human Capital Director, Mr Bosman Matengarufu, is currently testifying before the Commission and is expected to provide insight into the alleged irregularities at the local authority.\n\nIn May last year, President Mnangagwa appointed retired Judge, Justice Maphios Cheda, to lead the Commission in probing the operations of Harare City Council and its business units from 2017 to date.\n\nSo far, the Commission has uncovered a web of scandals at Harare City Council, including the disappearance of US$105 million and annual losses of US$70 million due to inefficient systems. A US$4,5 million loan facility allocated to Harare Quarry also vanished.\n\nIt has also emerged that 60 000 houses were not being billed, over 5 000 illegal stands were parcelled out ahead of the 2023 harmonised elections, while 350 housing cooperatives were illegally regularised.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Screenshot-40-680x380.png",
            "description": "Trust Freddy Herald Correspondent The Commission of Inquiry into the affairs of Harare City Council resumed public hearings today as it continues to investigate the alleged corruption and mismanagement of resources within the council. The acting Human Capital Director, Mr Bosman Matengarufu, is currently testifying before the Commission and is expected to provide insight into […]",
            "time": "18:00",
            "date": "14 Jan 2025"
        },
        {
            "title": "ZIFA, Magaya case deferred to Friday",
            "url": "https://www.herald.co.zw/zifa-magaya-case-deferred-to-friday/",
            "content": "Zimpapers Sports Hub\n\nTHE matter in which Walter Magaya is challenging his removal as one of the presidential candidates for the upcoming ZIFA elections has been deferred to Friday.\n\nMagaya, in his urgent chamber application filed at the High Court before Justice Tawanda Chitapi, cited ZIFA Normalisation Committee chairperson Lincoln Mutasa as the first respondent, the Electoral Committee of ZIFA, and the ZIFA Normalisation Committee which he leads as the second and third respondents.\n\nAll parties were in attendance, accompanied by their legal counsels.\n\nIn an interview with the press after the court sitting, one of Magayas lawyers, Tavonga Makamure said they are looking forward to the hearing on Friday.\n\nWe had a case management for the matter and now it will heard on Friday, he said.\n\nSo there are two matters that are going to be heard  the urgent matter and the main matter on review.\n\n",
            "image_url": null,
            "description": "Zimpapers Sports Hub THE matter in which Walter Magaya is challenging his removal as one of the presidential candidates for the upcoming ZIFA elections has been deferred to Friday. Magaya, in his urgent chamber application filed at the High Court before Justice Tawanda Chitapi, cited ZIFA Normalisation Committee chairperson Lincoln Mutasa as the first respondent, […]",
            "time": "18:00",
            "date": "14 Jan 2025"
        },
        {
            "title": "Professor Gandiwa appointed ZimParks Director General",
            "url": "https://www.herald.co.zw/professor-gandiwa-appointed-zimparks-director-general/",
            "content": "Ivan Zhakata and Tapiwa Chikuhwa\n\nRenowned wildlife ecologist Professor Edson Gandiwa has been appointed Director General of the Zimbabwe Parks and Wildlife Management Authority (ZimParks).\n\nThis ushers in a new chapter for one of Africas most significant conservation institutions.\n\nProf Gandiwa, a distinguished academic and former Director of Research at ZimParks, steps into the role following the departure of Dr Fulton Mangwanya, who now heads the Central Intelligence Organisation (CIO).\n\nHis appointment is widely seen as a strategic move to reinforce the authoritys commitment to sustainable wildlife management.\n\nProf Gandiwa has co-authored over 140 peer-reviewed publications, thereby cementing his status as a leading voice in wildlife ecology and environmental science.\n\nHis professional journey includes serving as the Executive Dean of the School of Wildlife, Ecology and Conservation at Chinhoyi University of Technology.\n\nThis academic leadership complements his extensive field experience and deep understanding of Zimbabwes conservation landscape.\n\nAs Prof Gandiwa takes over the reins, all eyes will be on his efforts to navigate the delicate balance between conservation and human-wildlife co-existence in a country known for its extraordinary biodiversity.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/0534e074-2571-4050-aaf9-cb583673a104-680x380.jpeg",
            "description": "Ivan Zhakata and Tapiwa Chikuhwa Renowned wildlife ecologist Professor Edson Gandiwa has been appointed Director General of the Zimbabwe Parks and Wildlife Management Authority (ZimParks). This ushers in a new chapter for one of Africa’s most significant conservation institutions. Prof Gandiwa, a distinguished academic and former Director of Research at ZimParks, steps into the role […]",
            "time": "18:00",
            "date": "14 Jan 2025"
        },
        {
            "title": "ZRP, transport operators meet to iron out lawlessness",
            "url": "https://www.herald.co.zw/zrp-transport-operators-meet-to-iron-out-lawlessness/",
            "content": "Crime Reporter\n\nThe Zimbabwe Republic Police met transport operators in Harare today (Tuesday) to find ways to curb road carnage and lawlessness in and around the city.\n\nThe Officer Commanding Harare Province, Commissioner Maxwell Chikunguru; National Police Spokesperson, Commissioner Paul Nyathi, and other senior police officers attended the meeting that was chaired by the Chief Staff Officer Operations at the Police General Headquarters, Commissioner Bazibi Dube.\n\nZimbabwe Public Transport Organisation (ZPTO) chairman Dr Sam Nhanhanga, his deputy Dr Leonard Mukumba, Greater Harare Association of Commuter Operators (GHACO) chairman, Mr Ngoni Katsvairo and transport operators from various bus companies also attended the meeting.\n\nThe police are conducting an operation targeting anyone who poses a danger to other motorists by causing congestion, picking up and dropping passengers at undesignated points, creating imaginary lanes, or driving the wrong way on one-way streets.\n\nThose operating public service vehicles, unregistered commuter omnibuses, and unregistered pirate taxis, as well as those without the relevant permits, route authority and vehicle fitness certificates, are also targeted.\n\nThe crackdown has seen non-compliant vehicles diverting to smaller roads to avoid police checks.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Screenshot-38-680x380.png",
            "description": "Crime Reporter The Zimbabwe Republic Police met transport operators in Harare today (Tuesday) to find ways to curb road carnage and lawlessness in and around the city. The Officer Commanding Harare Province, Commissioner Maxwell Chikunguru; National Police Spokesperson, Commissioner Paul Nyathi, and other senior police officers attended the meeting that was chaired by the Chief […]",
            "time": "18:00",
            "date": "14 Jan 2025"
        },
        {
            "title": "Kwekwe student dies after getting ‘A’ Level results",
            "url": "https://www.herald.co.zw/kwekwe-student-dies-after-getting-a-level-results/",
            "content": "Midlands Bureau\n\nA Kwekwe family was left devastated after their 18-year-old son died the day he got his A Level results.\n\nLacere Masese (18) of Mbizo scored 15 points in the three science subjects he sat for.\n\nHe died last Friday at Kwekwe District Hospital moments after he had been told the good news.\n\nHe had been diagnosed with cancer. He received the good news and died afterwards. We are so devastated, said a relative, Wesley Nyandoro.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Screenshot-37-680x380.png",
            "description": "Midlands Bureau A Kwekwe family was left devastated after their 18-year-old son died the day he got his ‘A’ Level results. Lacere Masese (18) of Mbizo scored 15 points in the three science subjects he sat for. He died last Friday at Kwekwe District Hospital moments after he had been told the good news. “He […]",
            "time": "18:00",
            "date": "14 Jan 2025"
        },
        {
            "title": "Beitbridge Municipality go after unregistered schools",
            "url": "https://www.herald.co.zw/beitbridge-municipality-go-after-unregistered-schools/",
            "content": "Thupeyo Muleya\n\nBeitbridge Bureau\n\nBeitbridge Municipality with the support of the Ministry of Primary and Secondary Education is cracking down on unregistered private schools that have mushroomed across the town.\n\nThe district has 71 primary and 18 secondary registered schools.\n\nIt is believed that more than 20 unregistered facilities are operating in Beitbridge.\n\nIn a statement, the municipality raised concern over the increase in the number of unregistered private schools operating in the district.\n\nThe municipality and relevant stakeholders shall conduct an exercise to get rid of unregistered schools.\n\nWe strongly urge parents and guardians to ensure that their children are enrolled at registered schools that comply with all regulations. Some unregistered private schools compromise the well-being and safety of our children, said the municipality.\n\nChoosing a properly registered school guarantees a standard of education that meets both local and national requirements. This will safeguard your childs learning experience and future opportunities.\n\nLets work together to provide quality education for our children.\n\nIn some instances, pupils enrolled at unregistered schools have faced challenges in registering for public examinations.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/08/Ministry-of-Primary-and-Secondary-Education.jpg",
            "description": "Thupeyo Muleya Beitbridge Bureau Beitbridge Municipality with the support of the Ministry of Primary and Secondary Education is cracking down on unregistered private schools that have mushroomed across the town. The district has 71 primary and 18 secondary registered schools. It is believed that more than 20 unregistered facilities are operating in Beitbridge. In a […]",
            "time": "18:00",
            "date": "14 Jan 2025"
        },
        {
            "title": "Triangle sugar giant embarks on retrenchment exercise",
            "url": "https://www.herald.co.zw/triangle-sugar-giant-embarks-on-retrenchment-exercise/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nTriangle Limited, one of the largest sugar producers in Zimbabwe, has announced a phased retrenchment exercise as it grapples with declining profitability.\n\nThe decision, described as difficult but necessary, aims to safeguard the companys future amid rising costs and declining profitability.\n\nIn a statement, Triangle managing director Tendai Masawi said, This is not a reflection of our employees dedication or performance. It is a painful step dictated by the harsh economic realities we face.\n\nOur profit margins have plummeted by 55 percent since 2022, and manpower costs have surged by 133 percent relative to revenue. We have no choice but to realign our operations to survive.\n\nThe retrenchment, part of the companys broader restructuring strategy dubbed Project Zambuko, will occur in three phases.\n\nThe first phase will be completed by February 2025, followed by two additional stages that will be concluded in May and August.\n\nWe have explored every possible avenue to stabilise the business, including cost-cutting and revenue-enhancing measures, but these have proven insufficient, Masawi said.\n\nTriangle Limited has pledged to handle the process with fairness and transparency, offering severance packages and emotional support programmes to affected employees.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/images-8.jpeg",
            "description": "Ivan Zhakata Herald Correspondent Triangle Limited, one of the largest sugar producers in Zimbabwe, has announced a phased retrenchment exercise as it grapples with declining profitability. The decision, described as “difficult but necessary,” aims to safeguard the company’s future amid rising costs and declining profitability. In a statement, Triangle managing director Tendai Masawi said, “This […]",
            "time": "18:00",
            "date": "14 Jan 2025"
        }
    ]
}