{
    "news": [
        {
            "title": "Veteran journalist Hebert Mutugwi dies",
            "url": "https://www.herald.co.zw/veteran-journalist-hebert-mutugwi-dies/",
            "content": "Ivan ZhakataTHE media fraternity is in mourning following the sudden death of senior journalist, Hebert Mutugwi.Mutugwi collapsed and died at his workplace in Harare today.He was 58.\n\nThe veteran journalist spent nearly four decades in the media industry.\n\nAt the time of his death, he was a senior editor at New Ziana where he played a critical role in reviving the national news agencys editorial operations.\n\nZimbabwe Mass Media Trust executive secretary, Ray Mungoshi described Mutugwi as a champion of journalism whose influence on the media landscape will be felt for generations.We have lost a true champion of journalism, he said.\n\nHeberts experience, editorial expertise and unmatched ability to mentor young reporters made him an irreplaceable asset. His legacy will live on through the many lives he touched.\n\nMutugwis distinguished career began in 1987 as a cadet reporter at the Chronicle in Bulawayo.\n\nHe rose to assume the position of Assistant News Editor in 1992, before being promoted to News Editor at The Manica Post in 1997.\n\nIn 2010, he joined the community newspapers group under New Ziana as Editor of the Nehanda Guardian in Bindura.\n\nHe later edited the Masvingo Star and was subsequently moved to Harare to bolster New Zianas national news agency.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/IMG-20250407-WA0135-680x380.jpg",
            "description": "Ivan Zhakata THE media fraternity is in mourning following the sudden death of senior journalist, Hebert Mutugwi.Mutugwi collapsed and died at his workplace in Harare today. He was 58. The veteran journalist spent nearly four decades in the media industry. At the time of his death, he was a senior editor at New Ziana where […]",
            "time": "21:46",
            "date": "07 Apr 2025"
        },
        {
            "title": "President meets 2024 Moot Competition winners",
            "url": "https://www.herald.co.zw/president-meets-2024-moot-competition-winners/",
            "content": "Online ReporterPresident Mnangagwa is meeting the 2024 Orate Africa Moot Competition winners at State House.\n\nZimbabwe won the prestigious first prize in the competition, affirming the countrys high literacy rate while cementing the huge milestones registered in the education sector.\n\nThe prize was won by students from Heritage School and St George College.Primary and Secondary Education Minister Torerayi Moyo is accompanying the students.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/IMG-20250407-WA0119-680x380.jpg",
            "description": "President Mnangagwa is meeting the 2024 Orate Africa Moot Competition winners at State House.",
            "time": "21:46",
            "date": "07 Apr 2025"
        },
        {
            "title": "Parliament notes Beitbridge Border Post operational challenges",
            "url": "https://www.herald.co.zw/parliament-notes-beitbridge-border-post-operational-challenges/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nParliament has noted the operational challenges that are affecting the effective curbing of leakages and irregular migration at Beitbridge Border Post.\n\nActing chairperson of the joint Parliamentary Portfolio Committee on Defence, Security and Home Affairs, Cde Albert Nguluvhe said the team is touring all major ports of entry as part of Parliaments oversight roles.\n\nWe are impressed with this border posts operations. It is now more secure following its upgrading by the Second Republic, said Cde Nguluvhe.\n\nWe have seen drone surveillance, fast cargo scanners, canine units, e-gates, biometric services and the separation of traffic.\n\nIn addition, the security has been doing well, addressing the issue of touts and wheeler-dealers that had become a problem at the border.\n\nHowever, we have noted challenges to do with patrol vehicles, bad roads along the borderline and limited manpower in some departments. So we will sit down with the teams doing the tour and consolidate our report for Parliament.\n\nThe team is set to visit Plumtree and Mulambepehle ports of entry on a similar mission on Tuesday.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/1ca215cf-e6af-4771-9c03-8fffb5e9ce4f-680x380.jpeg",
            "description": "Parliament has noted the operational challenges that are affecting the effective curbing of leakages and irregular migration at Beitbridge Border Post.",
            "time": "21:46",
            "date": "07 Apr 2025"
        },
        {
            "title": "Starlink, Aura Group join hands for rural connectivity",
            "url": "https://www.herald.co.zw/starlink-aura-group-join-hands-for-rural-connectivity/",
            "content": "Ivan Zhakata\n\nSTARLINK, the global satellite internet provider, has partnered with local technology provider, Aura Group, to intensify efforts to bridge the digital divide in Zimbabwes rural areas.\n\nA three-member Starlink delegation is currently in the country to solidify the collaboration, which seeks to significantly enhance internet connectivity in underserved regions.\n\nThe Ministry of Information Communication Technology (ICT), Postal and Courier Services facilitated the partnership.\n\nICT Minister Tatenda Mavetera said Government supports the initiative.\n\nWhen Starlink applied to come to Zimbabwe, it was because of our Governments desire to see reliable and accessible internet services in our country, she said.\n\nWe are grateful for Starlinks commitment to Zimbabwe, and we are eager to see the expansion of services, particularly to rural areas. Our goal is to connect schools, clinics, police stations, courts, and agri-tech offices to the internet to foster economic and social development.\n\nWe hope to explore opportunities to work together on satellite infrastructure, especially as we plan to launch our communication satellite. Additionally, the establishment of a local ground station will significantly enhance the capacity and coverage of Starlink services in Zimbabwe.\n\nRepresenting Starlink, Mr Shaun Hathrill said Aura is an extension of the company in Zimbabwe.\n\nThey know the customers, they have the on-ground contacts and relationships, and they help us connect with the community. Their innovative approach has been exceptional, and we are excited to work together to connect the unconnected in Zimbabwe and across Africa, he said.\n\nAura Groups chief executive, Mr Samuelle Dimairho said their vision is of national and continental development through improved internet access.\n\nAt the core of our mission, we are passionate about connecting our people to the internet, he said.\n\nWe believe that access to information is crucial for growth, and our collaboration with Starlink is helping us to bring that vision to life. We are proud to be leaders in this field and excited to continue expanding across Africa.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/8a76d227-c576-49be-ab0c-7d0c272cf8bb-680x380.jpeg",
            "description": "STARLINK, the global satellite internet provider, has partnered with local technology provider, Aura Group, to intensify efforts to bridge the digital divide in Zimbabwe's rural areas.",
            "time": "21:46",
            "date": "07 Apr 2025"
        },
        {
            "title": "Amabhubesi roar loud at BMRFB U20 league",
            "url": "https://www.herald.co.zw/amabhubesi-roar-loud-at-bmrfb-u20-league/",
            "content": "Brandon Moyo\n\n[emailprotected]\n\nPLUMTREE High Schools Amabhubesi were crowned champions of the 2025 Bulawayo Metropolitan Rugby Football Board (BMRFB) Archer Clothing Under-20 Rugby League after a comfortable 38-15 win over Western Suburbs Panthers at Hartsfield Rugby Grounds.\n\nPlumtree dominated the match early on and went to the break with a comfortable 21-5 lead before coming back to add 17 more points to the board with Panthers scoring 10 points more to their halftime score.\n\nIn the first half, Plumtree scored and successfully converted three tries while Panthers, scored one and missed the conversion.\n\nThe eventual champions scored three more tries in the second half, however, with one conversion. Panthers scored tries but failed to convert.\n\nWhat made the victory sweet for Amabhubesi is that they lost their opening two league matches during the round robin stage but managed to stage a remarkable come-back to go all the way and pocket the winners US$1 000 prize money.\n\nFor Panthers, it was a painful end to a remarkable campaign as they in went into the final unbeaten, the only team not to have tasted defeat during the round robin stage.\n\nSaturdays final was a culmination of nine weeks of highly entertaining rugby action.  @brandon_malvin\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/rugby.jpg",
            "description": "Brandon Moyo Brandonmalvin9@gmail.com PLUMTREE High School’s Amabhubesi were crowned champions of the 2025 Bulawayo Metropolitan Rugby Football Board (BMRFB) Archer Clothing Under-20 Rugby League after a comfortable 38-15 win over Western Suburbs’ Panthers at Hartsfield Rugby Grounds. Plumtree dominated the match early on and went to the break with a comfortable 21-5 lead before coming […]",
            "time": "21:46",
            "date": "07 Apr 2025"
        },
        {
            "title": "Farmers urged to implement fire prevention measures",
            "url": "https://www.herald.co.zw/farmers-urged-to-implement-fire-prevention-measures/",
            "content": "Edgar Vhera\n\nAgriculture Specialist Writer\n\nTHE Environmental Management Agency (EMA) has advised farmers and communities to take precautionary measures to combat the veld fire crisis that has destroyed more than 12 million hectares of land over the past 11 years.\n\nIn a recent notice to farmers and landowners, EMA said farmers should now begin fire suppression measures to protect crops and pastures ahead of the fire season which runs from July 31 to October 31 of each year.\n\nDuring this period, the biomass will be dry, it would be windy and conducive for wild, uncontrolled and runaway fires which are destructive to life, the environment, property and agricultural produce.\n\nAs the rainy season recedes, after a dominantly successful farming season, farmers and landowners must urgently prepare for the heightened risk of veld fires.\n\nThe drying vegetation and crops create a dangerous biomass load, increasing the potential for devastating fires, said EMA.\n\nFarmers are urged to construct proper fireguards and regularly clear them of dry grass, stay equipped for firefighting and monitor and report all veld fire outbreaks while traditional leaders should advise their communities against starting fires.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/04/EMA.jpg",
            "description": "THE Environmental Management Agency (EMA) has advised farmers and communities to take precautionary measures to combat the veld fire crisis that has destroyed more than 12 million hectares of land over the past 11 years.",
            "time": "21:46",
            "date": "07 Apr 2025"
        },
        {
            "title": "Husband sues wife over infidelity",
            "url": "https://www.herald.co.zw/husband-sues-wife-over-infidelity/",
            "content": "Spiwe Sarakunze\n\nHerald Reporter\n\nA Harare man has approached the civil court seeking a protection order against his wife, accusing her of infidelity and violence.\n\nMr Takudzwa Gore accused his wife Ms Ohtilia Mangwiro of bringing boyfriends into their matrimonial home.\n\nI no longer have peace in my own house since she has been bringing different men into the house. l am now afraid of getting infected, he said while testifying in court on Monday.\n\nHe said the boyfriends have been threatening to kill him and his wife supports them.\n\nMr Gore also said Ms Mangwiro told him that his life is in her hands and she can destroy him anytime.\n\nMy wife told me that l should not do what l want since she now decides everything for me, Mr Gore said.\n\nHe told the court that, apart from her indiscretions, Ms Mangwiro is also in the habit of selling his property.\n\nShe sells my batteries and solar panels and squanders the money with her boyfriends, he said.\n\nI am now afraid to ask her since she has threatened to end my life.\n\nMr Gore almost broke into tears as he narrated to the court how he was now living like a servant in his own house.\n\nHe said his wife also assaults and insults him.\n\nLast week Sunday, she threw pots at me and l got injured. She always uses deadly objects whenever assaulting me, he complained.\n\nMr Gore said that Ms Mangwiro insults him using obscene words even in front of people, embarrassing him.\n\nHe pleaded with the court for protection saying he was afraid to go back home as he could be chased out of the house.\n\nMs Mangwiro defaulted the court proceedings but presiding magistrate Ms Meenal Naratom granted Mr Gore the protection order he was seeking.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/civil-court-680x380.jpg",
            "description": "A Harare man has approached the civil court seeking a protection order against his wife, accusing her of infidelity and violence.",
            "time": "21:46",
            "date": "07 Apr 2025"
        },
        {
            "title": "New IPEC law to set new conditions for asset managers",
            "url": "https://www.herald.co.zw/new-ipec-law-to-set-new-conditions-for-asset-managers/",
            "content": "Martin Kadzere\n\nThe Insurance and Pension Commission (IPEC) Amendment Bill of 2024 will require asset managers to secure IPECs prior approval before providing services to clients in the insurance and pensions sector, adding a new layer of regulatory oversight.\n\nAsset managers are currently regulated by the Securities Commission of Zimbabwe (SECZ).\n\nThe bill, which also seeks to expand IPECs regulatory powers to include medical aid societies, establish new governance structures and create a policyholder and pensions, and provide fund members protection, will require asset managers to secure IPEC approval before commencing services for insurance and pension sector clients.\n\nAsset managers who are already serving clients in the insurance and pensions sector will require IPECs approval to continue doing so.\n\nMarket analysts say the new requirements would likely result in increased licensing, reporting, and operational costs for asset managers.\n\nThey have noted that IPECs new mandate to promote a fair, safe, and stable sector and to conduct investigations grants the commission significant oversight over asset managers. This means IPEC can scrutinise asset managers investment strategies, risk management practices, and client relationships.\n\nIPEC can also conduct investigations into potential violations of the IPEC Act or other relevant laws, which could lead to penalties or sanctions.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/ipec.jpg",
            "description": "The Insurance and Pension Commission (IPEC) Amendment Bill of 2024 will require asset managers to secure IPEC's prior approval before providing services to clients in the insurance and pensions sector, adding a new layer of regulatory oversight.",
            "time": "21:46",
            "date": "07 Apr 2025"
        },
        {
            "title": "NMBZ banks on tech to drive growth",
            "url": "https://www.herald.co.zw/nmbz-banks-on-tech-to-drive-growth/",
            "content": "Nelson Gahadza\n\nNMB Holdings says it remains on a growth trajectory, with a focus on bolstering core banking business, establishing a wider regional presence with the technology subsidiary and consolidating balance sheet growth through the property company.\n\nThe group said it would leverage technology to unlock new opportunities, drive economic growth, and shape the future of digital financial services in Africa.\n\nGroup chief executive officer Mr Gerald Gore, in a statement of financials for the year ended December 31, 2024, said the group was looking to structure appropriate funding for its clientele, with the bank well on course to draw down US$100 million from different providers of offshore lines of credit in 2025.\n\nIn 2024, we raised over US$65 million in direct funding and trade finance limits from offshore Developmental Finance Institutions (DFIs).\n\nThese include, among others, Proparco from France ($25 million), BII from the United Kingdom ($10 million), the Trade and Development Bank (TDB) ($15 million) and the African Development Bank (AfDB) ($15 million), he said.\n\nMr Gore added that with the two new subsidiaries established in 2023 now fully operational, the group was now on course to explore opportunities to reach new markets.\n\nMr Gore said the groups technology unit, Xplug Solutions Limited, continued to make growth strides in the region as well as locally.\n\nHe said that through cutting-edge fintech solutions, robotic process automation (RPA), and custom software development, the subsidiary was empowering businesses across Africa to thrive in the digital economy.\n\nXplug has expanded its regional reach and is now working and supporting banks in Tanzania, Rwanda, Uganda, Mozambique, Zambia and Malawi, delivering innovative solutions that enhance financial inclusion and operational efficiency.\n\nIn Rwanda, Xplug deployed an agency banking solution and workflow system, streamlining financial processes for financial institutions. Our RPA solutions are enhancing automation and efficiency for clients in Tanzania, Rwanda, Uganda and Zambia, said Mr Gore.\n\nAdditionally, he added that in Mozambique, the unit was deploying mobile banking channels for a financial institution, expanding digital banking access in the region.\n\nMr Gore said locally in Zimbabwe, the company has deployed digital platforms, a medical aid system and member administration portals, among others.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/09/NMBZ-Holdings.jpg",
            "description": "NMB Holdings says it remains on a growth trajectory, with a focus on bolstering core banking business, establishing a wider regional presence with the technology subsidiary and consolidating balance sheet growth through the property company.",
            "time": "21:46",
            "date": "07 Apr 2025"
        },
        {
            "title": "Singapore presents huge market potential for Zimbabwe",
            "url": "https://www.herald.co.zw/singapore-presents-huge-market-potential-for-zimbabwe/",
            "content": "Business Reporter\n\nThere is significant potential for Zimbabwe to increase its range and volume of exports to Singapore, following a market scan conducted by ZimTrade that identified substantial opportunities in the Southeast Asian market.\n\nAs a global trade hub, Singapore could present a lucrative market for Zimbabwean products, particularly in sectors like horticulture, processed foods, leather goods, and essential oils, the national trade promotion and development body found, after its market study.\n\nThe findings from the market scan and the subsequent recommendations offer valuable insights for Zimbabwean businesses seeking to tap into the Singaporean market.\n\nThe Southeast Asian nations dependency on imports, particularly food, makes it an attractive destination for Zimbabwean agricultural and processed food products.\n\nWith over 90 percent of Singapores food supply coming from overseas, the countrys population of approximately 5,7 million presents a significant opportunity for Zimbabwean exporters.\n\nAs one of the Four Asian Tigers, Singapore boasts a highly developed economy, strategic location, and world-class infrastructure, including one of the busiest airports in the world.\n\nAlthough trade between Zimbabwe and Singapore is currently modest, there is significant potential for growth.\n\nIn 2024, Zimbabwes exports to Singapore totalled US$10,3 million, mainly consisting of blueberries, raw hides, tobacco and gold.\n\nOn the other hand, Zimbabwes imports from Singapore amounted to US$355 million, a drop from US$1,1 billion in 2022.\n\nThe market scan highlighted several sectors with high export growth potential, particularly in horticulture, where Zimbabwe has a significant opportunity to export fresh produce, especially blueberries, avocados, citrus fruits and chillies.\n\nEstablishing a direct trade route would allow Zimbabwean exporters to gain a competitive edge and tap into a market worth over US$47 million.\n\nThe processed foods sector also holds promise, driven by Singapores growing demand for organic and natural products.\n\nZimbabwean exporters of organic teas, dried fruits, nuts, jams, and sauces can also capitalise on the growing demand trend.\n\nThe essential oils market also presents an opportunity for Zimbabwean exporters of avocado oil and other organic oils to build long-term relationships with industry players in Singapore.\n\nZimbabwean exporters have considerable potential to expand their presence in Singapores market.\n\nWhile Zimbabwean blueberries are already present in the Singaporean market, they are re-exported through South Africa. In horticulture, Zimbabwe has a significant opportunity to export fresh produce, especially blueberries, avocados, citrus fruits, and chillies.\n\nThe demand for organic and natural products is also on the rise in Singapore, creating openings for Zimbabwean exporters of organic teas, dried fruits, nuts, jams, and sauces.\n\nZimbabwean dried fruit, particularly mangoes, pineapples, and bananas, could find a receptive market in Singapore, given the preference for high-quality dried products, said ZimTrade in its latest monthly publication.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Untitled-75-680x380.jpg",
            "description": "There is significant potential for Zimbabwe to increase its range and volume of exports to Singapore, following a market scan conducted by ZimTrade that identified substantial opportunities in the Southeast Asian market.",
            "time": "21:46",
            "date": "07 Apr 2025"
        }
    ]
}