{
    "news": [
        {
            "title": "Historic milestone for Land Reform!. . . Beneficiaries get title deeds",
            "url": "https://www.herald.co.zw/historic-milestone-for-land-reform-beneficiaries-get-title-deeds/",
            "content": "Zvamaida Murwira in KWEKWE\n\nPRESIDENT Mnangagwa yesterday delivered the historic first batch of title deeds to beneficiaries under the Land Tenure Implementation Programme as the Second Republic bolsters land ownership that will put an end to the issue of tenure and security.\n\nThe tenure system will revolutionalise the Land Reform Programme embarked upon by the Government from the year 2000, and ensure bankability and transferability of title.\n\nThe President launched the programme at Pricabe Farm in Kwekwe, a property owned by the First Family.\n\nIt was a colourful ceremony attended by Cabinet Ministers, Permanent Secretaries, service chiefs, traditional leaders, farmers and captains of industry, among others.\n\nIn his keynote address, President Mnangagwa described the event as a significant milestone in the countrys journey towards the attainment of Vision 2030.\n\nIt is with a great sense of pride and joy that we gather here on this historic day to highlight another accomplishment of the Second Republic, he said.\n\nI welcome you all to Pricabe Farm. My Government is charting a new transformative and inclusive development agenda encapsulated in our National Development Strategy 1 (NDS 1).\n\nThis is consistent with the collective aspirations and determination of the people of our great nation to become an empowered and prosperous upper middle-income society by 2030.\n\nPresident Mnangagwa said it was through such relentless pursuits that Government was determined to deliver broad-based transformation, wealth creation and provision of economic opportunities for all Zimbabweans, leaving no one and no place behind.\n\nThe land in our great motherland is an indispensable economic enabler to the attainment of our vision, more so that agriculture is at the epicentre of our national transformative agenda, he said.\n\nPresident Mnangagwa said the land holds deep historical significance as its ownership can be traced back to the First Chimurenga, adding that the countrys forebears fought tirelessly for the right to keep the land.\n\nThe Second Chimurenga reclaimed this land in 1980 when we won our Independence. The Land Reform Programme, undertaken in 2000, remains a cornerstone of our national identity and an essential pillar for our economic independence.\n\nWe fought the liberation war to get back our land, ivhu rave nevene varo, vene vevhu vave nevhu ravo.\n\nThe land is irreversibly with its people, and the people irreversibly with their land. The Land Reform Programme is, therefore, irreversible, he said.\n\nPresident Mnangagwa said the national Constitution recognised the importance of land in agricultural productivity.\n\nOur Constitution binds us to strengthen the Land Tenure System of 99-year Leases and A1/A2 permits. The Constitution, in sections 289, 293 and 295, gives rights to every Zimbabwean citizen to acquire, hold, occupy, use, transfer or dispose of agricultural land.\n\nLand tenure security is critically important to Zimbabwes economic growth and development.\n\nIt encourages investment, improves agricultural production and productivity, and lifts many out of poverty into prosperity, he said.\n\nWith secure land tenure, the President said, farmers can access credit facilities, buy inputs and hire labour, ultimately increasing their yields and incomes.\n\nAs such, the importance of more secure, bankable and transferable land tenure cannot be overstated. Such a tenure document is the ultimate empowerment tool for our farmers, especially war veterans and their children.\n\nThe title deed, which my Government has developed for issuance to farmers, will preserve security and spur investment for accelerated livelihoods upliftment and economic development, said President Mnangagwa.\n\nMy administration has, therefore, made a bold decision to empower the beneficiaries of the Land Reform Programme by giving them tenure that will unlock the value of our land, allowing it to be used as collateral.\n\nWar veterans, whose sacrifices won the countrys independence and the land, must not be left behind, added the President.\n\nYouths, women and people with disabilities should also be considered for the title deeds.President Mnangagwa said the need to safeguard the land andpreserve the liberation struggle gains is paramount.\n\nIn this regard, land transfers shall be amongst qualifying Zimbabweans, he said.\n\nThe President implored financial institutions to embrace the title deeds in order to improve farmers access to finance and capital, which is critical for production.\n\nLet me reiterate my Governments commitment to ensuring that land distribution is fair, transparent, and beneficial to all Zimbabweans.\n\nThe handover of these title deeds is a testament to our commitment to empower Zimbabweans  the estimated 23 500 A2 farmers and estimated 360 000 A1 farmers, he said.\n\nFarmers were reminded that the land must be used judiciously and responsibly.\n\nAs you are aware, the land vests in the President on behalf of the State. The State is, therefore, transferring the land to each holder of a valid land tenure document.\n\nThis new tenure system will be the ultimate anchor of our Land Reform Programme. To the recipients of this new tenure document, I challenge you to use this to defend the revolution, unlock investment and increase production, productivity, profitability, viability, and sustainability to accelerate agricultural transformation.\n\nThe President commended the Land Tenure Technical Committee chaired by businessman, Mr Kudakwashe Tagwirei, for its excellent and meticulous contribution to the success of the initiative.\n\nYour dedication is deeply appreciated. Your selfless contribution is a true testimony to the mantra, Nyika inovakwa, inotongwa, inonamatigwa, nevene vayo/ Ilizwe lakhiwa, libuswe, likhulekelwe, ngabanikazi balo.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/efwerg.jpg",
            "description": "Zvamaida Murwira in KWEKWE PRESIDENT Mnangagwa yesterday delivered the historic first batch of title deeds to beneficiaries under the Land Tenure Implementation Programme as the Second Republic bolsters land ownership that will put an end to the issue of tenure and security. The tenure system will revolutionalise the Land Reform Programme embarked upon by the […]",
            "time": "08:24",
            "date": "22 Dec 2024"
        },
        {
            "title": "A night of elegance, inspiration at  The Herald Community Heroes Awards",
            "url": "https://www.herald.co.zw/a-night-of-elegance-inspiration-at-the-herald-community-heroes-awards/",
            "content": "Lifestyle Writer\n\nOh, what a night!\n\nThe recently concluded The Herald Community Heroes Awards, held at the illustrious Rainbow Towers, was nothing short of a spectacular celebration of humanity and selflessness.\n\nThis grand event, hosted by Zimbabwes premier newspaper, The Herald, cast a radiant spotlight on the countrys unsung heroes and heroines  those tireless souls whose unwavering dedication transforms lives and uplifts communities, often without the recognition they so richly deserve.\n\nAs the evening unfolded, the atmosphere was electric, infused with an air of anticipation and joy.\n\nGuests were greeted by a stunning display of elegance as they stepped onto the red carpet, their outfits shimmering under the soft glow of lights.\n\nFrom flowing gowns adorned with intricate beadwork to sharp suits that spoke of sophistication, each ensemble was a testament to individual style and creativity.\n\nBold colours and unique patterns adorned the attendees, reflecting the vibrant spirit of Zimbabwean culture.\n\nIt felt as though the very essence of fashion had come alive, transforming the venue into a runway filled with hope and pride.\n\nBranding played a significant role in the evening, not just for the event itself but for the guests as well.\n\nMany attendees showcased their personal brands through carefully curated outfits that signified their identity and values. Fashion designers and local brands seized the opportunity to gain visibility, with guests donning unique pieces that told their stories.\n\nThis emphasis on personal branding extended beyond clothing; it resonated in the accessories and hairstyles that complemented their looks.\n\nGuests understood that their appearance was a powerful form of expression, capable of communicating their commitment to social causes and community upliftment.\n\nThe event attracted an impressive assembly of the nations luminaries from various realms, including music, fashion, business, sports, and diplomacy.\n\nAmong the crowd were prominent figures whose contributions to society have been immeasurable. As they mingled and exchanged stories, the energy in the room was palpable  a vibrant tapestry woven from the threads of community spirit and shared aspirations.\n\nThe colourful event saw In Total boy-band  group entertaining guests with their melodies of renditions from other artists.\n\nAs the awards ceremony commenced, the spotlight shifted to the remarkable individuals who were about to be honoured.\n\nEach award presented was not just a token of appreciation but a heartfelt acknowledgment of the profound impact these heroes have made in their communities.\n\nThe evening was a celebration of altruism, revealing the profound stories of those whose selfless acts often remain in the shadows.\n\nSpeaking on behalf of the Minister of Women Affairs, Community, Small and Medium Enterprise Development, Permanent Secretary in the Ministry, Dr Mavis Sibanda spoke eloquently about the significance of these awards.\n\nRecognition awards play a pivotal role in acknowledging the remarkable contributions of individuals who go above and beyond to make a positive difference in the lives of others.\n\nBy honouring our community heroes and heroines, we not only express our gratitude but also inspire others to follow in their footsteps, she said.\n\nHer words resonated deeply, highlighting the essence of the awards as symbols of hope and unity. They illuminate the heroic endeavours of healthcare workers battling disease, educators shaping young minds, and volunteers tirelessly striving to uplift the marginalised.\n\nEach honouree was a beacon of light, illuminating the path for others to follow, and their stories were woven into the fabric of Zimbabwean society.\n\nIn a world often overshadowed by challenges, awards like these serve a vital purpose  they remind us of the goodness that exists, the power of community, and the importance of recognizing those who strive to make a difference.\n\nThey create a narrative of positivity, fostering an environment where others are inspired to engage in acts of kindness and service. In celebrating these heroes, we cultivate a culture that values compassion and social responsibility, essential elements for any thriving society.\n\nVictoria Ruzvidzo, The Herald Editor, took the stage to emphasize the importance of recognizing community leaders.\n\nFirst and foremost, it highlights the invaluable contributions these individuals make to society. By awarding them, we acknowledge their hard work, dedication, and often selfless efforts to improve the lives of those around them. This recognition not only honours their achievements but also serves as an inspiration for others to engage in community service and activism, she stated.\n\nAs she spoke, the audience hung on her words, understanding that this recognition was not just about accolades but about fostering a sense of pride within the community. The evening was a celebration of resilience, a reminder that every small act of kindness contributes to the greater good.\n\nAmidst the applause and cheers, the event also paid tribute to remarkable companies that have significantly impacted their communities, by sponsoring the event who include CAG Buses and Coaches, City Link, Prevail International, Herentals Group of Schools, National Foods, Nivtail, Zimbabwe Free Range Poultry Association, West Properties, Geo Pomona, Faramatsi Motors and Dove Funeral Service.\n\nTheir presence underscored the collective effort required to uplift society, shining a light on the partnerships that drive positive change.\n\nThe award winners were a diverse group, each with a unique story that resonated with the audience.\n\nBelow are the winners:\n\nList of Community Award Winners\n\nHarare:Mai Thembi (Mabvuku), Mr Aaron Aaron (Mufakose)\n\nBulawayo:Sazini Tshuma, Mrs Chingombe\n\nManicaland:Mr. Edmore Nyamangodo, Molin Chipoyi\n\nMashonaland Central:Lancos Kuuyangepi, Mr Mamera Kadzingatsayi (Mbire)\n\nMashonaland East:Gloria Kaisa (Chikomba)\n\nMashonaland West:Billy Rwodzi, Hugh Maya (Chegutu)\n\nMatabeleland North:Obert Dube, Chief Mbuso Bhekithemba Dakamela (Nkayi)\n\nMasvingo:Calisto Chimoyi (Bikita East)\n\nMatabeleland South:Mrs Babongile Gora, Mr Pick Nkomwa\n\nMidlands:Earnest Muchechetere (Shurugwi Ward 9)\n\nSpecial Awards\n\nDr. Paul Tungwarara\n\nDr Afra Nhanhanga\n\nMr Farai Matsika\n\nMr Tafadzwa Benza\n\nMrs Joanne Sharpe\n\nMrs Rutendo Gwatidzo\n\nDr. Delish Nguwaya\n\nDr. Divine Ndhukula\n\nSDA Church\n\nPedzai Scott Sakupwanya\n\nAs each name was called, the audience erupted in applause, celebrating not only individual achievements but also the spirit of collective responsibility that binds the community together. The Herald Community Heroes Awards was more than just a ceremony; it was a powerful reminder of the strength found in unity and the importance of recognizing those who work tirelessly for the greater good.\n\nIt ignited a collective spirit of community development and social responsibility, inspiring all present to contribute to the noble cause of uplifting society. As the night drew to a close, guests left with hearts full of inspiration, ready to take action in their own communities.\n\nThe Herald Community Heroes Awards shone brightly, illuminating the path toward a better future, one hero at a time. In a world where recognition can catalyse change, these awards stood as a testament to the power of honour, gratitude, and the relentless pursuit of a better tomorrow.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/aa-678x380.jpg",
            "description": "Lifestyle Writer Oh, what a night! The recently concluded ‘The Herald Community Heroes Awards’, held at the illustrious Rainbow Towers, was nothing short of a spectacular celebration of humanity and selflessness. This grand event, hosted by Zimbabwe’s premier newspaper, The Herald, cast a radiant spotlight on the country’s unsung heroes and heroines — those tireless […]",
            "time": "08:24",
            "date": "22 Dec 2024"
        },
        {
            "title": "Stakeholders hail programme as a game-changer",
            "url": "https://www.herald.co.zw/stakeholders-hail-programme-as-a-game-changer/",
            "content": "Zvamaida Murwira in KWEKWE\n\nBENEFICIARIES, businessmen and other stakeholders have hailed the issuance of title deeds on farms under the Land Tenure Implementation Programme launched by President Mnangagwa yesterday, saying it is the panacea to unlocking value, profitability and ultimately productivity on properties under the land redistribution programme.\n\nTen beneficiaries were handed the title deeds in a historic development that will subsequently see thousands of other farmers getting the security of tenure in the next few months.\n\nThe development is expected to bolster viability and predictability of the Government-initiated Land Reform Programme.\n\nPeople who spoke at the event said security of tenure was key to agricultural productivity.\n\nDefence Minister Oppah Muchinguri-Kashiri, who is also the Cabinet Oversight Committee chairperson of the programme, said the tenure system was an indication of President Mnangagwas astute leadership.\n\nThe transfer of these deeds illustrates your unwavering commitment to empower communities and ensure that Zimbabweans have access to land, which is a vital resource to prosperity.\n\nWe thank you for your vision of restoring our dignity 44 years after our independence, said Minister Muchinguri-Kashiri.\n\nLands, Agriculture, Fisheries, Water and Rural Development Minister, Dr Anxious Masuka, said the landmark development will be felt not only in Zimbabwe but also in the region.\n\nToday is a great day not only for Zimbabwe but for Sadc. It marks a landmark development to unlock value to the Land Reform Programme, said Dr Masuka.\n\nLand Tenure Implementation Committee chairperson and businessman, Mr Kuda Tagwirei, said the land tenure system unveiled by the Government is unique.\n\nYour Excellency, I am a businessman. From history and my study, I have never seen a better empowering programme like this in the whole world, said Mr Tagwirei.\n\nHe said his committee will facilitate the issuance of 2 000 title deeds in the next three months and more than 24 000 title deeds for both A1 and A2 in the next 18 months.\n\nWe believe that all these farmers will be able to access loans from banks, said Mr Tagwirei.\n\nThose who got the title deeds yesterday include President Mnangagwa, who was awarded for leading the agricultural revolution by example at Pricabe Farm.\n\nOthers are Mr Lester Chizunza from Manicaland Province, Public Service Commission chairperson, Dr Vincent Hungwe, former Cabinet Minister Dr Herbert Murerwa, Chief Vengai Rushwaya from Gutu in Masvingo Province, Deputy Speaker of the National Assembly, Cde Tsitsi Gezi from MashonalandCentral Province and Mr Egypt and Miriam Kakono from Mazowe district in Mashonaland Central province.\n\nOthers include Minister of State for Masvingo Provincial Affairs and Devolution Ezra Chadzamira, Mrs Mangamela Sibanda from Matabeleland North province and Ntambeleni Ndou from Beitbridge district in Matabeleland South Province.\n\nIn an interview, Mr Chizunza described the issuance of title deeds as crucial to his farming operations.\n\nI want to thank President Mnangagwa for taking a bold decision because the issue of transferability and bankability has been a huge impediment.\n\nThose who lent money never looked at the productivity of a farmer but at security; they were worried about what would become of their money should one be removed from the property, said Mr Chizunza.\n\nDr Murerwa said the issuance of title deeds is a huge step in the right direction.\n\nWhen you have title you are able to invest knowing fully well that you have security of tenure and you also have access to capital.\n\nThis will unlock a lot of poductivity on the farms, said Dr Murerwa.\n\nYesterdays event was attended by Cabinet Ministers, Permanent Secretaries, Service Chiefs, traditional leaders, captains of industry and farmers among others.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2012/04/deedstitle.jpg",
            "description": "Zvamaida Murwira in KWEKWE BENEFICIARIES, businessmen and other stakeholders have hailed the issuance of title deeds on farms under the Land Tenure Implementation Programme launched by President Mnangagwa yesterday, saying it is the panacea to unlocking value, profitability and ultimately productivity on properties under the land redistribution programme. Ten beneficiaries were handed the title deeds […]",
            "time": "08:24",
            "date": "22 Dec 2024"
        },
        {
            "title": "Mutamba appointed Police chief",
            "url": "https://www.herald.co.zw/mutamba-appointed-police-chief/",
            "content": "Herald Reporter\n\nPRESIDENT Mnangagwa has appointed Deputy Commissioner-General Stephen Mutamba as the new Commissioner-General of the Zimbabwe Republic Police, following the retirement of Commissioner General Tandabantu Godwin Matanga.\n\nThe appointment is with effect from January 1, 2025.\n\nComm-Gen Matangas retirement takes effect fromDecember 31, 2024.\n\nIn a statement last night, Chief Secretary to the President and Cabinet Dr Martin Rushwaya said: In terms of Section 221(1) of the Constitution of Zimbabwe, His Excellency, the President Cde Dr Emmerson Dambudzo Mnangagwa has appointed Deputy Commissioner-General Stephen Mutamba as Commissioner-General of the Zimbabwe Republic Police.\n\nIn a separate statement, Dr Rushwaya announced the retirement of Comm-Gen Matanga.\n\nHis Excellency the President of the Republic of Zimbabwe Cde Dr Emmerson Dambudzo Mnangagwa has, in term of Section 340 (1)(f) as read with Section 221 (1) of the Constitution of Zimbabwe, retired Commissioner-General Tandabantu Godwin Matanga from the post of Commissioner-General of the Zimbabwe Republic Police. The retirement is with effect from after duty on 31st December 2024, he said.\n\nComm-Gen Matanga was born on February 5, 1962.\n\nHe took over as the Police Commissioner-General on a caretaker basis in December 2017 from Comm-Gen Augustine Chihuri. He was then officially appointed as Comm-Gen on February 12, 2018 by President Mnangagwa.\n\nComm Gen Matanga joined the police in 1982 and was Deputy Commissioner General since 1992.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/13e12e.jpg",
            "description": "Herald Reporter PRESIDENT Mnangagwa has appointed Deputy Commissioner-General Stephen Mutamba as the new Commissioner-General of the Zimbabwe Republic Police, following the retirement of Commissioner General Tandabantu Godwin Matanga. The appointment is with effect from January 1, 2025. Comm-Gen Matanga’s retirement takes effect from  December 31, 2024. In a statement last night, Chief Secretary to the […]",
            "time": "08:24",
            "date": "22 Dec 2024"
        },
        {
            "title": "Zim strengthens diplomatic ties with Algeria, Palestine, UNICEF",
            "url": "https://www.herald.co.zw/zim-strengthens-diplomatic-ties-with-algeria-palestine-unicef/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nZIMBABWE continues to bolster its international partnerships with significant diplomatic engagements by the Minister of Foreign Affairs and International Trade, Professor Amon Murwira, who this week hosted Algerias Special Envoy, the Palestinian Ambassador, and a delegation from UNICEF.\n\nThese high-level meetings focused on deepening political, economic and humanitarian collaborations.\n\nAlgerias Special Envoy Abdelhak Saihi conveyed a message from President Abdelmadjid Tebboune, emphasising the historical ties between the two nations dating back to Zimbabwes liberation struggle.\n\nThe birth of Zimbabwe cannot be talked about without mentioning Algeria, Prof Murwira said.\n\nHe highlighted the need to translate these ties into economic and scientific collaboration. Discussions included partnerships in pharmaceuticals, mining, agriculture, and tourism. Both sides agreed to organise a Joint Permanent Commission of Co-operation to formalise and implement these initiatives.\n\nMr Saihi described the relationship as excellent, adding that they discussed future opportunities for development between the two countries, building on their rich shared history.\n\nIn a separate meeting, the Palestinian Ambassador to Zimbabwe, Dr Tamer Almassri, thanked Zimbabwe for its unwavering support for Palestines independence amid ongoing conflicts.\n\nWe exchanged solidarity messages, especially during the ongoing Israeli genocide against Palestinian civilians, he said.\n\nAmbassador Almassri condemned international double standards and applauded Zimbabwes principled stance against oppression.\n\nZimbabwe reiterated its commitment to continue recognising Palestines sovereignty.\n\nZimbabwe remains principled in supporting the right to self-determination and condemns all forms of violence and oppression, Prof Murwira said.\n\nBoth nations pledged to strengthen bilateral co-operation, with plans for high-level visits in 2025. UNICEF representatives, including Comptroller Diane Kepler and Harare-based representative Ms Etona Ekole, paid a courtesy call on Prof Murwira to discuss ongoing co-operation.\n\nZimbabwe has shown immense dedication to fostering a strong partnership with UNICEF, said Ms Kepler.\n\nThis is my first time visiting Zimbabwe, and its a beautiful country with gracious hospitality. I look forward to returning. We aim to continue our collaboration to ensure progress for the people of Zimbabwe and the region, Ms Ekole said.\n\nProf Murwira emphasised a shared vision of prosperity for all parties involved.\n\nAt the end of the day, our people must lead prosperous, happy, and fulfilling lives. This is our constitutional obligation and one we share with our partners, he said.\n\nWith the engagements, Zimbabwe has demonstrated its commitment to fostering meaningful international relationships that extend beyond historical alliances to tangible economic and humanitarian gains.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/qfdqwefd.jpg",
            "description": "Ivan Zhakata Herald Correspondent ZIMBABWE continues to bolster its international partnerships with significant diplomatic engagements by the Minister of Foreign Affairs and International Trade, Professor Amon Murwira, who this week hosted Algeria’s Special Envoy, the Palestinian Ambassador, and a delegation from UNICEF. These high-level meetings focused on deepening political, economic and humanitarian collaborations. Algeria’s Special […]",
            "time": "08:24",
            "date": "22 Dec 2024"
        },
        {
            "title": "Russian Ambassador visits Dr  Auxillia Mnangagwa Children’s Home",
            "url": "https://www.herald.co.zw/russian-ambassador-visits-dr-auxillia-mnangagwa-childrens-home/",
            "content": "Oscar Rusenga in Chiredzi\n\nRussian Ambassador to Zimbabwe His Excellency Nikolai Vladimirovich Krasilnikov on Thursday visited the Dr Auxillia Mnangangwa Childrens Home in Chambuta, Chiredzi South, where he met a group of children from the home who returned from a historic trip to Russia.\n\nTen boys from the childrens home visited Russias second biggest city, St Petersburg, in a sports and cultural exchange programme, courtesy of the First Lady Dr Auxillia Mnangangwa who is the patron of the home.\n\nThe boys who visited Russia fared well flying the Zimbabwean flag high.\n\nThey brought home a trophy and medals after winning a football tournament in the biggest country in the world by land mass.\n\nTheir win and representation of the country is a testament to the good works of the First Lady who took the young boys from the streets and transformed their lives.\n\nAt Chambuta, Ambassador Krasilnikov shared his life story with the boys at the childrens home to motivate them to do well and never to give up in life.\n\nI grew up with my grandparents and I wanted to be a professional footballer. I joined one of the biggest teams in Russia called Spartak Moskow, bigger than DeMbare here in Zimbabwe (Dynamos F.C). I came through the ranks as a teenager and trained hard to play in the first team but my parents decided I must be a diplomat since many people in my lineage were diplomats.\n\nMy career path changed but I learned a lot through football, you have to set goals and try to do the best in everything you do. Through hard work and discipline, you can make it in life, added the Ambassador.\n\nThe Russian Ambassador challenged the children at Chambuta to work hard in school.\n\nChildren at the Dr Auxillia Mnangagwa childrens home enjoying a sumptuous meal during a Christmas party organised by the First Lady yesterday\n\nI failed my first exam but that did not deter me from pursuing my objective I studied hard and eventually passed before I was admitted and this is where I am today.\n\nMy message to you today is not to give up but to be resilient and use this platform that the First Lady Dr Auxillia Mnangangwa has given you to launch your careers.\n\nThe Ambassador also made donations to the home, which included footballs.\n\nDr Auxillia Mnangangwa Childrens Home formerly Chambuta, is now home to 58 boys who were living in the streets.\n\nSome suffered from drug abuse but their story is now different after they were rescued by the First Lady.\n\nOne of the beneficiaries of the First Ladys benevolence at Chambuta, Joshua Emmanuel, showered praise on the Mother of the Nation for transforming his life and other former street children at the home.\n\nI want to appreciate and thank the First Lady, Dr Auxillia Mnangangwa for taking us out of the streets, he said.\n\nWe go to some of the best schools in the province (Masvingo) where we are taught different things. Some are good in sports like soccer and basketball while others are doing well in academics and we are glad we are being supported in everything we do.\n\nWe have good shelter here. We are also taught a lot of life skills here at home such as animal husbandry and horticulture projects and the knowledge will help us and the country at large, he said.\n\nWe have good food and clean water and we also have a good library for our studies as well as a computer laboratory for ICT projects so I can safely say this is the best place and all this is because of the love from our lovely mother Dr A Mnangangwa, added Emmanuel.\n\nAmbassador Krasilnikov also handed out Christmas presents to the boys and mingled with them.\n\nThe children were very happy as they enjoyed meals while wearing their medals around their necks.\n\nThe Ambassador also personally prepared a fire and served the children a Russian traditional meal despite the scorching heat in Chiredzi.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/kk.jpg",
            "description": "Oscar Rusenga in Chiredzi Russian Ambassador to Zimbabwe His Excellency Nikolai Vladimirovich Krasilnikov on Thursday visited the Dr Auxillia Mnangangwa Children’s Home in Chambuta, Chiredzi South, where he met a group of children from the home who returned from a historic trip to Russia. Ten boys from the children’s home visited Russia’s second biggest city, […]",
            "time": "08:24",
            "date": "22 Dec 2024"
        },
        {
            "title": "Judge condemns Harare over dereliction of duty",
            "url": "https://www.herald.co.zw/judge-condemns-harare-over-dereliction-of-duty/",
            "content": "Fidelis Munyoro\n\nChief Court Reporter\n\nThe High Court has delivered a resounding indictment against the City of Harare, condemning its flagrant neglect of landlord responsibilities towards the residents of Mbare Flats, who have been subjected to deplorable living conditions.\n\nJustice Priscilla Munangati Manongwas ruling compels the city to undertake immediate renovations, ensuring these accommodations meet the basic standards of human habitation.\n\nThis landmark judgment not only holds the City of Harare accountable but also implicates four critical government departments: the ministries of Local Government, National Housing, Health and Child Care, and Environment, Climate and Wildlife.\n\nEach is mandated to fulfil its statutory obligations to rectify the dire circumstances faced by the tenants of Matapi, Matererini, Mbare Flats, Nenyere and Shawasha hostels.\n\nJustice Munangati articulated a clear breach of both common law and statutory duties by the local authority, emphasising that the City of Harares dereliction has resulted in the residents enduring squalid and intolerable living conditions.\n\nThe City of Harare is compelled to fulfil its mandatory statutory and common law obligations as a landlord, she stated, asserting the necessity for the flats to be rendered safe and suitable for habitation.\n\nThe courts orders are unequivocal: the City of Harare must restore essential services, including a functional water and sewer reticulation system and adequate sanitation.\n\nFurthermore, Local Government and Rural Development Minister Daniel Garwe and National Housing Minister Soda Zhemu are required to provide temporary shelter, such as tents, along with basic services during the necessary rehabilitation and refurbishment of the hostels.\n\nThis entails a comprehensive plan ensuring that displaced residents are afforded security against eviction and access to vital amenities like water, sanitation, and electricity.\n\nMinister Garwe is specifically tasked with ensuring the swift restoration of essential services vital for the health and safety of the affected residents, including the provision of clean potable water and efficient refuse disposal.\n\nHealth and Child Care Minister Douglas Mombeshora bears the crucial responsibility of implementing measures under the Public Health Act to prevent potential outbreaks of disease, while Environment, Climate and Wildlife Minister Sithembiso Nyoni is directed to take immediate action to mitigate pollution surrounding the hostels.\n\nThis ruling is not merely a legal victory; it is a clarion call for accountability and a reminder of the fundamental rights owed to every resident.\n\nThe City of Harare is now under judicial scrutiny, tasked with rectifying its failure and restoring dignity to the lives of those it serve.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/jtyj.jpg",
            "description": "Fidelis Munyoro Chief Court Reporter The High Court has delivered a resounding indictment against the City of Harare, condemning its flagrant neglect of landlord responsibilities towards the residents of Mbare Flats, who have been subjected to deplorable living conditions. Justice Priscilla Munangati Manongwa’s ruling compels the city to undertake immediate renovations, ensuring these accommodations meet […]",
            "time": "08:24",
            "date": "22 Dec 2024"
        },
        {
            "title": "SADC to set aside Regional Development Fund",
            "url": "https://www.herald.co.zw/sadc-to-set-aside-regional-development-fund/",
            "content": "Wallace Ruzvidzo\n\nHerald Reporter\n\nSADC is working on operationalising the blocs Regional Development Fund (RDF) which will see the region benefiting from its financing mechanism towards sustained economic growth and development.\n\nThis came out during a meeting between the SADC Committee of Ministers of Finance and Investment, which is chaired by Finance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube.\n\nIn a statement, the SADC Secretariat said the African Development Bank (AfDB) had proffered guidance on how the regional bloc can successfully operationalise the RDF.\n\nThe SADC Treaty already provides for the establishment of a special RDF.\n\nIn his opening remarks, Honourable Prof Mthuli Ncube, Minister of Finance, Economic Development and Investment Promotion of the Republic of Zimbabwe and Chairperson of the Committee of Ministers of Finance, stated that the Senior Officials considered the detailed presentation from the African Development Bank (AfDB) on the revised RDF Discussion Paper.\n\nIn this regard, they reported that the different options and recommendations set out in the Revised Discussion Paper are in line with the 2016 Agreement on the Operationalisation of the SADC RDF, said the Secretariat.\n\nSADC Executive Secretary Mr Elias Magosi said one mechanism proffered by the AfDB was that the regional blocs member states be given access to concessional funding.\n\nA concessional window of the AfDB will allow low-income countries to access resources on concessional terms, which may be used to invest in the RDF.\n\nThe SADC Executive Secretary, His Excellency Mr Elias Magosi, informed the meeting that the SADC Treaty provides that a special SADC Regional Development Fund (RDF) be established to create a Regional Financing Mechanism for Economic Development and Sustainable Growth.\n\nHis Excellency Mr Elias Magosi recognised the fiscal pressures as the main impediment on Member States to meet their capitalisation contributions towards the RDF.\n\nThe Executive Secretary underscored that the Ministers should consider the Discussion Paper on the Operationalisation of the Fund for it offers varied mechanisms for Member States to expedite both membership and capitalisation of the Fund, said the SADC Secretariat.\n\nSuccess stories on the African Development Fund (ADF)s utilisation to close financial gaps are well documented in Africa, as some countries have utilised the window to fund membership contributions to the African Trade and Investment Development Insurance Agency (ATIDI).\n\nFor example, in 2015, the ADF provided Unit of Account (UA) 19,87 million to support Benin, Ethiopia, and Cte dIvoire in their equity contribution for ATIDI, thereby enhancing insurance coverage for private sector development across Africa. In 2018, Nigeria also received ADF support of UA 10.21 million to invest in ATIDI, said the SADC Secretariat.\n\nMr Magosi conveyed SADCs heartfelt gratitude to the AfDB for sharing the blocs vision in partnering with its endeavours to fast-track the operationalisation of the RDF.\n\nHe also underlined that with this level of commitment, SADC could not afford to fail in making the RDF operational for use without delay.\n\nWhile the AfDB has committed resources and support, member states must do their part to ensure the exercise is successfully concluded, said the SADC Secretariat.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/SADCC.jpg",
            "description": "Wallace Ruzvidzo Herald Reporter SADC is working on operationalising the bloc’s Regional Development Fund (RDF) which will see the region benefiting from its financing mechanism towards sustained economic growth and development. This came out during a meeting between the SADC Committee of Ministers of Finance and Investment, which is chaired by Finance, Economic Development and […]",
            "time": "08:24",
            "date": "22 Dec 2024"
        },
        {
            "title": "Mhona applauds CAAZ’s work ethic",
            "url": "https://www.herald.co.zw/mhona-applauds-caazs-work-ethic/",
            "content": "Freeman Razemba\n\nSenior Reporter\n\nTransport and Infrastructural Development Minister Felix Mhona has praised the Civil Aviation Authority of Zimbabwe (CAAZ) for its exemplary work ethic in advancing the vision of establishing a regional hub for world-class transport networks, logistics, and services by 2030.\n\nHe made these remarks during the CAAZ 7th Annual General Meeting in Harare on Thursday.\n\nMinister Mhona emphasised the importance of annual general meetings (AGMs) for public entities and state enterprises, as mandated by the Public Entities and Corporate Governance (PECG) Act (Chapter 10:31).\n\nHe referenced Section 194 of the Zimbabwean Constitution, which calls for public entities to operate under democratic ideals that prioritise transparency and efficient resource use while upholding professional ethics.\n\nIt is for this reason that CAAZ deserves commendation for adhering to regulations, as demonstrated by todays AGM, he said.\n\nHe reiterated the Ministrys commitment to fostering an environment conducive to the growth of the aviation sector, highlighting its crucial role in the nations economic progress.\n\nMinister Mhona stressed the need for institutions to align with long-term policy frameworks, echoing President Mnangagwas mantra that Zimbabwe is Open for Business.\n\nThis directive aims to guide entities in fulfilling their mandates to achieve the national vision of an empowered and prosperous upper-middle-income society by 2030.\n\nAs we approach the end of 2024, I express my gratitude to the Government, led by our President, for the landmark aviation projects completed this year, he added.\n\nUnder the National Development Strategy 1 (NDS1), several key achievements were noted, including the commissioning of the Aviation Training Academy of Zimbabwe, which received ICAO TrainAirplus Certification in November 2024.\n\nAdditionally, the installation of a Secondary Surveillance Radar and the completion of the Air Traffic Control Communication System were highlighted, alongside the successful expansion of Robert Gabriel Mugabe International Airport and the commissioning of the VVIP Pavilion.\n\nThese milestones reflect CAAZs relentless pursuit of excellence, guided by appropriate legal and policy frameworks such as the PECG Act and the Constitution, Minister Mhona said.\n\nAs stakeholders, the Minister commended the work ethic of the CAAZ board and management, expressing hope that the AGM reports would reflect a commitment to good corporate governance.\n\nHe encouraged other entities within the Ministrys purview to emulate CAAZs dedication to achieving the vision of a regional transport hub by 2030.\n\nThe Government is committed to the growth of the aviation sector, and we will continue to support CAAZ and the entire aviation industry, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/05/Felix-Mhona.jpg",
            "description": "Freeman Razemba Senior Reporter Transport and Infrastructural Development Minister Felix Mhona has praised the Civil Aviation Authority of Zimbabwe (CAAZ) for its exemplary work ethic in advancing the vision of establishing a regional hub for world-class transport networks, logistics, and services by 2030. He made these remarks during the CAAZ 7th Annual General Meeting in […]",
            "time": "08:24",
            "date": "22 Dec 2024"
        },
        {
            "title": "Mini solar grids  for social amenities",
            "url": "https://www.herald.co.zw/mini-solar-grids-for-social-amenities/",
            "content": "Blessings Chidakwa\n\nHerald Reporter\n\nThe Government has launched mini solar grids to supply power to essential services such as schools, clinics, and business centres, in a bid to address power shortages.\n\nThese grids will operate independently of the national grid, ensuring a consistent power supply and reducing disruptions caused by outages from ZESA.\n\nDuring a recent Government media session, Engineer Gloria Magombo, Permanent Secretary for Energy and Power Development, announced the initiative, stating that each province now has a solar grid in operation.\n\nThese solar grids are not affected by national grid loadshedding; they continue to be supplied as they will be independent, she explained.\n\nPerm Sec Magombo highlighted the ministrys efforts to develop a national integrated resource plan and energy resource plan, aimed at consolidating the network master plan through 2040.\n\nThis comprehensive approach will align with the rural energy master plan and the solar integration plan, set to be launched in the first quarter of next year.\n\nThe ministry is also collaborating with the World Bank on a national electrification strategy to identify and close access gaps in energy supply. Currently, 62 percent of the population has access to modern energy, leaving 38 percent without.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/07/magorimbo.jpg",
            "description": "Blessings Chidakwa Herald Reporter The Government has launched mini solar grids to supply power to essential services such as schools, clinics, and business centres, in a bid to address power shortages. These grids will operate independently of the national grid, ensuring a consistent power supply and reducing disruptions caused by outages from ZESA. During a […]",
            "time": "08:24",
            "date": "22 Dec 2024"
        }
    ]
}