{
    "news": [
        {
            "title": "Zim, Indonesia trade soars under Second Republic",
            "url": "https://www.herald.co.zw/zim-indonesia-trade-soars-under-second-republic/",
            "content": "Zvamaida Murwira, Senior Reporter\n\nTrade between Zimbabwe and Indonesia has grown from US$60 million to US$100 million under the Second Republic, anchored on tobacco exports.\n\nWith abundant lithium reserves in Zimbabwe, the figures are expected to jump further because Indonesia has now gone full-throttle into producing electric vehicles.\n\nOutgoing Indonesian Ambassador to Zimbabwe, Dewa Juniarta Sastrawan, said the premier quality of Zimbabwes tobacco had helped his country to produce high grade cigarettes.\n\nHe made the remarks while briefing journalists after bidding farewell to President Mnangagwa at State House in Harare yesterday.\n\nThe diplomat, together with his Kenyan counterpart Ambassador Stella Munyi, met the President separately as they bade him farewell after completing their tours of duty.\n\nAmbassador Sastrawan said several memorandums of understanding were signed in the area of health and agriculture at the Second Indonesia-Africa Forum and the High-Level Forum on Multi-Stakeholder Partnerships where Vice President Kembo Mohadi represented the country in Bali last year.\n\nHe described the agreements as important because they deepened cooperation and will go a long way in producing affordable medication through Natpharm.\n\nOn the trade sector, this is one that I would like to highlight. When I came here in 2019, our trade volume was only US$60 million, but now, as of last year, our figures show that it is US$93 million. The good thing about this, is that it is more exports from Zimbabwe to Indonesia. This is happening that way because we import a lot of tobacco from Zimbabwe, said Amb Sastrawan.\n\nPresident Mnangagwa meets outgoing Indonesian Ambassador Dewa Juniarta Sastrawan, who paid a farewell courtesy call on him at State House in Harare yesterday.  Picture: Believe Nyakudjara\n\nZimbabwe, he said, also exported cotton to Indonesia.\n\nThe product we import the most from Zimbabwe is tobacco. And we use the good quality of tobacco from Zimbabwe to blend our cigarettes. So, this is a very significant achievement that we have made, he said.\n\nThere is also cooperation in cement and fertiliser production between the two countries, with Zimbabwe using Indonesian technologies.\n\nWe also would like to develop cooperation in lithium mining. We will soon be holding discussions on how we can cooperate in processing lithium. The reason why we would like to cooperate with Zimbabwe in processing lithium is because we, in Indonesia, have already started producing electric car batteries and also motorcycle batteries, we have nickel, but we dont have lithium. So, thats why we would like to have this cooperation, said Amb Sastrawan.\n\nZimbabwe-Indonesia relations were established in 1986 and both countries are members of the Non-Aligned Movement.\n\nOn her part, Ambassador Munyi said she registered many achievements during her tour of duty, the most important one being the high-level reciprocal visits by President Mnangagwa to Nairobi and Kenyan leader, President William Ruto coming to Zimbabwe.\n\nShe said the fact that Zimbabwe and Kenya chaired the Joint Sadc and East African Commission to discuss conflict resolution in the Democratic Republic of Congo was because of the good relations between the two countries.\n\nI have managed to achieve what I came here to do. Our bilateral relations with Zimbabwe are excellent. I have managed to build them through the years I have been here. We had our Joint Permanent Commission for Cooperation, when I came here, the last one had been done in 1989. But during my tenure, we had the third session in 2021 and 2024. And now I am looking forward to a mid-term review this year, said Amb Munyi.\n\nShe said trade between the two countries has increased, buoyed by Kenyan Airways, which increased flights between Nairobi and Harare and Nairobi to Victoria Falls.\n\nI have also promised His Excellency, President Mnangagwa that I will be your Ambassador. I told him that I have been to Victoria Falls, I think, more than 15 to 20 times. I have also managed to go around the country, including to Great Zimbabwe, and also to Kariba, but the magnificent Victoria Falls has been the place to be. And I think I will continue visiting. I will also be your champion. I have also talked about the issue that we are there to champion the complete removal of sanctions by the West, as well as the readmission of Zimbabwe into the Commonwealth.\n\nZimbabwe and Kenya are both members of Comesa and the African Union.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/HE1-9.jpg",
            "description": "Zvamaida Murwira, Senior Reporter Trade between Zimbabwe and Indonesia has grown from US$60 million to US$100 million under the Second Republic, anchored on tobacco exports. With abundant lithium reserves in Zimbabwe, the figures are expected to jump further because Indonesia has now gone full-throttle into producing electric vehicles. Outgoing Indonesian Ambassador to Zimbabwe, Dewa Juniarta […]",
            "time": "08:36",
            "date": "27 Feb 2025"
        },
        {
            "title": "Zim key player in Africa’s automobile revival",
            "url": "https://www.herald.co.zw/zim-key-player-in-africas-automobile-revival/",
            "content": "Blessings Chidakwa and Remember Deketeke\n\nZimbabwe is emerging as a major player in the resurgence of Africas automobile manufacturing sector, leveraging its extensive natural resources, including one of the continents largest steel plants and rich lithium deposits.\n\nThe country is home to Africas largest and the worlds sixth-largest lithium reserves, positioning it strategically to utilise the African Continental Free Trade Area (AfCFTA) for maximum benefit in the automobile industry.\n\nGiven Zimbabwes past as a giant in the automobile industry, with Willowvale and AVM companies, a South African business delegation is in the country to explore ways to unlock the vast potential in the industry through creating synergies with other African countries.\n\nChief executive officer of the Association of the African Automobile Manufacturers (AAAM) Mr David Coffey yesterday met Industry and Commerce Minister Mangaliso Ndlovu and exchanged notes on how Zimbabwe will be positioned in the African automobile industry revival.\n\nMr Coffey said the delegation will be in Zimbabwe for the next few days, visiting various stakeholders, to appreciate and understand opportunities that exist in the framework of the AFCFTA.\n\nOur mission is to industrialise and grow the sector across the continent. Its really about industrialisation, and we work very closely with the AFCFTA Secretariat.\n\nWe have developed a strategy for the automotive industry, we explore many African countries and see what their role is in the value chain. We are here for three days to see the capabilities in Zimbabwe and we believe there is potential, be it from minerals or other resources, he said.\n\nMr Coffey added that: Not every country can do all of that so we are here to assess what a company can focus on and be good for in the long term.\n\nHe said Africa should rub off the tag of being a dumping ground for vehicles from abroad.\n\nToday, Africa is a dumping ground of 3 to 5 million vehicles, and we want to change that. We want to industrialise, we obviously understand we need to provide freedom of ability. And that is the part of the ecosystem where we help governments.\n\nIndustry and Commerce Minister Ndlovu said Zimbabwe has vast potential in the automobile industry, but is yet to realise that.\n\nThis is a great chance. For the last six years, we have spent US$1,6 billion on second-hand vehicles. Not to mention the jobs that we have exported. The majority of those are pre-owned vehicles, most of which last less than three years in the country.\n\nWe believe that also with our iron and steel taking shape, we should be able to re-localise a lot of production. We already need to be looking at the growth size of these vehicles.\n\nLast year, when I was talking to the President, we had 23,000 pre-owned vehicles that were imported. So, all these, in our view, are opportunities, he said.\n\nMinister Ndlovu said when there is the creation of bigger interlinkages, there should be value chains developed across countries where possible.\n\nWe will work together to see how we can, from an African perspective, grow this sector. For the Government, I can assure you that we will provide full support, he said.\n\nGroup Chief Executive Officer at Production Technologies Association of South Africa Tapiwa Samanga said Zimbabwe is better poised in the vehicle manufacturing industry given its past history.\n\nThe main role of AAAM is to make sure that each country within the region contributes to the manufacturing of cars given their different strengths, he said.\n\nThe president of the Motor Industry Association of Zimbabwe Lawrence Nyamushanya, said this was a great opportunity for the nation.\n\nAs a motor industry I think we are going to learn quite a lot from them especially as we will be touring different industries within Zimbabwe, he said.\n\nDuring the advent of the Second Republic, Zimbabwe launched the Motor Industry and Development Policy (MIDP), targeting to attract 10 percent of total foreign direct investment.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/MD.jpg",
            "description": "Blessings Chidakwa and Remember Deketeke Zimbabwe is emerging as a major player in the resurgence of Africa’s automobile manufacturing sector, leveraging its extensive natural resources, including one of the continent’s largest steel plants and rich lithium deposits. The country is home to Africa’s largest and the world’s sixth-largest lithium reserves, positioning it strategically to utilise […]",
            "time": "08:36",
            "date": "27 Feb 2025"
        },
        {
            "title": "UN applauds Zim for abolishing death penalty",
            "url": "https://www.herald.co.zw/un-applauds-zim-for-abolishing-death-penalty/",
            "content": "Herald Reporter\n\nThe United Nations Human Rights Council (UNHRC) has commended Zimbabwe for officially abolishing the death penalty.\n\nThis recognition followed an address by the Attorney-General of Zimbabwe Mrs Virginia Mabiza, at the UNs Biennial High-Level Panel Discussion on the Judiciarys Contribution to Human Rights in Geneva, Switzerland.\n\nIn her presentation on Tuesday, Mrs Mabiza outlined the historical context of the death penalty in Zimbabwe, detailing its evolution through three distinct phases.\n\nThese are the pre-colonial era, which emphasised restorative justice, the colonial period, marked by retributive practices and the post-colonial era, which focused on justice and human rights. High Commissioner for Human Rights, Volker Trk, said Zimbabwes decision aligns with a growing global trend, as 113 countries have abolished the death penalty completely.\n\nMrs Mabiza explained that the death penalty was introduced by colonial powers in the 18th century and persisted even after Zimbabwe gained Independence in 1980.\n\nShe said at that time, a range of offences  including murder, treason and aggravated robbery  were punishable by death.\n\nSince then, various legislative and policy interventions were implemented to gradually reduce the number of crimes attracting the death penalty, said Mrs Mabiza.\n\nIn 2013, the number of offences attracting the death penalty had been reduced from nine to only one namely murder committed in aggravating circumstances.\n\nThis ensured compliance with the United Nations General Assembly Resolution 52 on reducing the number of offences that attract the death penalty.\n\nMrs Mabiza highlighted the judiciarys critical role in this transformation, noting that higher courts have consistently found the death penalty to violate human rights, leading to many sentences being commuted to life imprisonment.\n\nSince 2005, no executions have taken place in Zimbabwe, a testament to the Judiciarys discretion and evolving legal framework.\n\nShe said the adoption of a new Constitution in 2013 marked a pivotal point, incorporating a Bill of Rights that explicitly exempted vulnerable groups from capital punishment.\n\nMrs Mabiza said this reform, along with the strong political will from President Mnangagwa, culminated in the enactment of the Death Penalty Abolition Act in 2024 which prohibits the imposition of the death penalty.\n\nAfter Mrs Mabizas address, Zimbabwe drew praise from numerous countries, including Belgium and Switzerland.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Mrs-Virginia-Mabiza-680x380.jpg",
            "description": "Herald Reporter The United Nations Human Rights Council (UNHRC) has commended Zimbabwe for officially abolishing the death penalty. This recognition followed an address by the Attorney-General of Zimbabwe Mrs Virginia Mabiza, at the UN’s Biennial High-Level Panel Discussion on the Judiciary’s Contribution to Human Rights in Geneva, Switzerland. In her presentation on Tuesday, Mrs Mabiza […]",
            "time": "08:36",
            "date": "27 Feb 2025"
        },
        {
            "title": "Retired OK Zimbabwe CEO bounces back to steady ship",
            "url": "https://www.herald.co.zw/retired-ok-zimbabwe-ceo-bounces-back-to-steady-ship/",
            "content": "Nelson Gahadza, Senior Business Reporter\n\nOK Zimbabwes former chief executive officer, Mr Willard Zireva, has bounced back to lead the retail group and lift it from its current operational challenges, which have seen the company closing five branches.\n\nMr Zireva led the company as CEO from 2001 until his retirement in 2017 and comes back when the 83-year-old retailer, the countrys largest by store numbers, has embarked on a business review and restructuring aimed at enhancing operational efficiency and driving sustainable growth in a dynamic market.\n\nOK Zimbabwe, in a statement, said the conclusion of voluntary separation saw agreements with three top executives: chief executive Mr Maxen Phillip Karombo, chief financial officer Mr Phillimon Mushosho, and supply chain director Mr Knox Mupaya.\n\nThis followed a period when the giant retailer struggled to restock its branches across the country citing a tough trading environment amid a burgeoning debt burden.\n\nHowever, the Reserve Bank has suggested most challenges facing retailers have nothing to do with the operating environment, but the affected companies questionable management decisions.\n\nAt OK Zimbabwe, the new management also includes Mr Alex Edgar Siyavora, another former CEO of the group, who comes back as chief financial officer and Mr Muzvidzwa Richard Chingaira who takes over as new supply chain director.\n\nThe appointments are with immediate effect, with the new leadership expected to stabilise operations and implement a strategic recovery plan over the next six months while the company searches for permanent executive replacements.\n\nThe board would like to acknowledge the outgoing executive team for their service through this challenging period and to welcome back the team entrusted with stabilising and turning the business around, OK Zimbabwe said in the statement yesterday.\n\nIn a recent trading update, OK Zimbabwe said it had begun restocking shops with support from supplier partners and financial institutions that continue to assist with short-term funding facilities. In addition, the business said new alternative procurement models had been put in place, including but not limited to, a structured stock supply arrangement with a third party for supplier assurance purposes as the business works to restore critical supply relationships with both local and foreign suppliers.\n\nThe retail group experienced episodes of stockouts during the last three months of last year which continued into the first two months of this year.\n\nThis was evidenced by daily availability levels of around 50 percent of normal stocking levels, and these stockouts arose from restricted supplies from manufacturers and distributors, the company said in a trading update for the quarter-ended December 31, 2024.\n\nThe group said it was confident of restoring normal stocking levels before the end of the current financial year.\n\nDuring the period under review, volumes decreased by 36 percent compared to the same period last year. However, on a year-to-date basis, the group recorded volume growth of 10 percent over the same period.\n\nThe company noted that the reduction in volumes recorded during the quarter translated to a decline in revenue of 36 percent as compared to the prior period.\n\nOK said it had outstanding and overdue creditors balances, which were predominantly denominated in US dollars against a backdrop of low US dollar sales, at times reaching as low as 20 percent of sales revenue.\n\nThe company has claimed the low stocking levels were a direct manifestation of sub-economic pricing arising from exchange rate distortions and suppliers demanding foreign currency in invoicing to cover their operational and raw material needs.\n\nSuppliers continued to insist on shorter trading terms and, in some cases, prepayments for supplies invoiced in local currency. This exerted pressure on the business working capital and necessitated the need to access short-term funding, it said.\n\nTo mitigate against rising operating costs, the group resolved to close four branches in Glen Norah, Kuwadzana 5, Chitungwiza Town Centre, and Robson Manyika Street, all in Harare.\n\nA fifth branch was closed in Bulawayos Entumbane high density suburb.\n\nThe business said a review and consideration of branches saddled with the stifling impact of unsustainable operating cost structures and costly licensing requirements was in progress.\n\nThe Confederation of Zimbabwe Retailers (CZR) has been pressing for action to ease challenges facing retailers.\n\nThe sector, according to CZR, is the heartbeat of Zimbabwes economy, ensuring food security, employment, and revenue collection.\n\nPresenting a case study on the retail sector to the Tripartite Negotiating Forum Economic Cluster, CZR president Mr Denford Mutashu, represented by acting CEO Mr Innocent Marimo, argued that exchange rate distortions, rising informality, excessive taxation, among other issues have created an environment where compliance is punished while informality flourishes.\n\nIf urgent interventions are not implemented, we risk a complete collapse of the formal retail sector, leading to mass job losses, declining tax revenues, and further economic instability, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2014/07/ZIREVA.jpg",
            "description": "Nelson Gahadza, Senior Business Reporter OK Zimbabwe’s former chief executive officer, Mr Willard Zireva, has bounced back to lead the retail group and lift it from its current operational challenges, which have seen the company closing five branches. Mr Zireva led the company as CEO from 2001 until his retirement in 2017 and comes back […]",
            "time": "08:36",
            "date": "27 Feb 2025"
        },
        {
            "title": "New South Wales Governor commends First Lady’s works",
            "url": "https://www.herald.co.zw/new-south-wales-governor-commends-first-ladys-works/",
            "content": "Tendai Rupapa, Senior Reporter\n\nCHARITY work, health issues, love and the quest to uplift the less-privileged reigned supreme when First Lady Dr Auxillia Mnangagwa met Her Excellency, Governor of New South Wales, the Honourable Margaret Beazley AC KC in Sydney.\n\nMember for Blacktown Parliamentary Secretary for Planning and Public Spaces Mr Stephen Bali, who was among the people who welcomed Dr Mnangagwa when she toured Blacktown Hospital, was mesmerized by her charity work.\n\nThe Honourable Governor gave the First Lady a warm reception. After their discussions, she described Dr Mnangagwa as an example for other people who are involved in charity and volunteer activities.\n\nDuring their discussions, Dr Mnangagwa expressed her deep appreciation for the warm reception she received from the people of New South Wales.\n\nThe First Lady visited Australia in her capacity as a philanthropist and she told the Governor that she was happy to have connected with various philanthropists in New South Wales who made substantial donations of goods including medical equipment to Zimbabwe.\n\nThe First Lady shared her philanthropic work, particularly in the areas of womens and mens health.\n\nShe informed the Governor that she was appointed the Ambassador for Health because of her dedication to improving public health outcomes in Zimbabwe.\n\nThe mother of the nation informed her host that her main focus on health was on both womens and mens health, adding that her health initiatives were aimed at addressing critical health challenges, raising awareness, and providing support to underserved populations.\n\nHer Excellency the Honourable Margaret Beazley AC KC, Governor of New South Wales welcomes Angel of Hope Foundation patron First Lady Dr Auxillia Mnangagwa at Government House in Sydney, Australia.  Pictures: John Manzongo\n\nThe First Lady also pointed out that her programmes were focused on providing access to healthcare services to vulnerable communities, raising awareness about gender-specific health issues, and advocating for preventative measures.\n\nShe has also been actively involved in the campaign against gender-based violence and promoting mental health awareness among men and women, the Governor heard.\n\nAmai Mnangagwa underscored that all of the services provided by the Angel of Hope Foundation (AoHF) were accessible to all Zimbabweans regardless of their political affiliations.\n\nThe Honourable Beazley commended the First Lady for using her position to bring positive transformation to the health system in Zimbabwe.\n\nShe also applauded Amai Mnangagwa for all of the initiatives that the Angel of Hope is spearheading in Zimbabwe saying she should be proud of herself.\n\nDr Mnangagwa said her work is driven by the compassion that she has for the less privileged and vulnerable people in Zimbabwe. Her Excellency, the Honourable Beazley, stated that the programmes being implemented by the First Lady were an indication that homegrown programmes can be successful in their own right.\n\nShe also highlighted that some of the social and health programmes being implemented by the First Lady were similar to programmes that are also being offered in Australia, particularly in Indigenous communities.\n\nAngel of Hope Foundation patron First Lady Dr Auxillia Mnangagwa interacts with the Governor of New South Wales Her Excellency the Honourable Margaret Beazley AC KC in the presence of Zimbabwes Ambassador to Australia and New Zealand Mr Joe Tapera Mhishi and Mr Christopher Sullivan, the deputy secretary to the Governor at Government House in Sydney, Australia\n\nShe added that there were programmes being implemented in regional towns that focus on providing medical facilities to vulnerable communities.\n\nShe further stated that most of these programmes are offered through mobile clinics.\n\nThe Governor indicated that the programmes have a holistic approach to health and that they cover treatment and also teach the importance of good nutrition and how to grow crops.\n\nDr Mnangagwa advised the Governor that she too ran a similar programme in Zimbabwe under her foundation called the From Garden to Table initiative which aims at addressing food security, improving nutrition, and promoting sustainable farming practices in Zimbabwe.\n\nShe highlighted that this initiative encourages families, particularly women, to grow their food in small-scale gardens, which can provide a reliable source of fresh healthy produce.\n\nThe programme, Hon Beazly was told, is also aimed to empower communities, reduce food insecurity, and promote healthy eating habits.\n\nThe discussions were also centred on the cooperation that exists between Australia and Zimbabwe in the education sector where Dr Mnangagwa highlighted that some Zimbabwean students were in Australia for studies, with some of them being beneficiaries of scholarships under the Australia Scholarship Awards Programme for Africa.\n\nThe First Lady said after finishing their studies the students are expected to return to their country and help build it.\n\nShe stated that education is a priority in Zimbabwe, adding that primary and high school education is compulsory.\n\nGovernor of New South Wales Her Excellency the Honourable Margaret Beazley AC KC expresses a point to Dr Auxillia Mnangagwa while Ambassador to Joe Tapera Mhishi and Ms Victoria Chipoka look on\n\nOn diseases, it came to light during the discussion that leading causes of death are cancers mostly breast, cervical and prostate, with HIV/AIDS still prevalent and some cancers being associated with the virus.\n\nIn light of this, Amai Mnangagwa has been pushing for greater awareness and early detection as crucial steps towards improving health outcomes.\n\nDuring her awareness campaigns, the First Lady discovered that men are more reluctant to have their health checked, therefore, she is pushing for widespread education to help men understand the importance of early detection and the role it plays in not only protecting their own health but that of their families also.\n\nThe AoHF patron emphasized that early detection of cancer through regular screenings and self-examinations can greatly improve the chances of successful treatment and survival.\n\nHonourable Beazley informed Dr Mnangagwa that Australia also had strong cancer awareness initiatives that advocate for early detection.\n\nShe pointed out that one of the most successful campaigns on cancer in Australia has been spearheaded by the McGrath Foundation, a prominent Australian charity dedicated to supporting individuals affected by breast cancer.\n\nThe Governor further informed the First Lady of a medical centre in Australia that used to offer free mammograms to women for early breast cancer detection. Amai Mnangagwa expressed gratitude to Honourable Beazley for the opportunity to come and meet her, extending an invitation to her to visit Zimbabwe so that she can have a first-hand appreciation of the country and what AoHF was doing in supporting and empowering vulnerable groups.\n\nAngel of Hope Foundation patron First Lady Dr Auxillia Mnangagwa interacts with the Aide De Camp to the Governor Lieutenant Commander Robert Valler and Mr Christopher Sullivan, the deputy secretary to the Governor of New South Wales while Ambassador Joe Tapera Mhishi looks on at Government House in Sydney, Australia\n\nGovernor of New South Wales Her Excellency the Honourable Margaret Beazley AC KC, poses for a photograph with Dr Auxillia Mnangagwa at Government House in Sydney, Australia\n\nAngel of Hope Foundation patron First Lady Dr Auxillia Mnangagwa expresses a point to the Governor of New South Wales Her Excellency the Honourable Margaret Beazley AC KC while Ambassador to Joe Tapera Mhishi looks on\n\nDr Auxillia Mnangagwa is seen off by Mr Christopher Sullivan, the Deputy Secretary to the Governor of New South Wales at Government House in Sydney, Australia\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/FL1-7.jpg",
            "description": "Tendai Rupapa, Senior Reporter CHARITY work, health issues, love and the quest to uplift the less-privileged reigned supreme when First Lady Dr Auxillia Mnangagwa met Her Excellency, Governor of New South Wales, the Honourable Margaret Beazley AC KC in Sydney. Member for Blacktown Parliamentary Secretary for Planning and Public Spaces Mr Stephen Bali, who was […]",
            "time": "08:36",
            "date": "27 Feb 2025"
        },
        {
            "title": "Nujoma ‘strongly supported Zim’s Land Reform programme’",
            "url": "https://www.herald.co.zw/nujoma-strongly-supported-zims-land-reform-programme/",
            "content": "Herald Reporter\n\nFOUNDING Namibian president, Dr Sam Nujoma, strongly supported Zimbabwe during its Land Reform Programme, standing firm against neo-colonial influences and international pressure, a Cabinet Minister has said.\n\nDr Nujoma passed on early this month, leaving behind a legacy of leadership in the fight for independence in Namibia and Southern Africa, and his burial is scheduled for Saturday at the National Heroes Acre in the capital Windhoek.\n\nDr Nujoma served as Namibias first president after independence between 1990 and 2005.\n\nIn a speech read on his behalf by Deputy Foreign Affairs and International Trade Sheillah Chikomo during a memorial service in Harare yesterday, Foreign Affairs Minister, Professor Amon Murwira said Dr Nujoma showed unwavering solidarity during Zimbabwes period of isolation.\n\nProf Murwira said Dr Nujoma defended Zimbabwes right to reclaim its land and pushed against external efforts to derail the programme.\n\nZimbabwe was always close to his heart, understandably given our shared historical experiences and in particular, our common struggles, said Prof Murwira.\n\nAt the height of Zimbabwes isolation following the countrys successful Land Reform Programme, our father, Dr Nujoma, boldly stood out in support of the programme.\n\nWhile we had achieved our goal of independence, he remained alive to neo-colonial influences and aggression which stood in the way for Africas redemption from servitude.\n\nProf Murwira said beyond his vocal support, Dr Nujoma used his diplomatic influence to rally for Zimbabwe to receive support across SADC, the African Union (AU) and the Non-Aligned Movement (NAM).\n\nHe said Dr Nujomas leadership played a crucial role in shaping the global stance on land redistribution and economic empowerment in post-colonial Africa.\n\nAlthough he left active politics in 2005, he remained an advisor to all of us, he added.\n\nOn November 24, 2017, Dr Nujoma, along with Zambias late founding father, Kenneth Kaunda, led the cast of former Heads of State and other dignitaries who attended His Excellency President Mnangagwas inauguration ceremony.\n\nSpeaking at the same occasion Zanu PF Secretary Information and Publicity Ambassador Christopher Mutsvangwa described Dr Nujoma as an African revolutionary, a giant of African Pan-Africanism and a remarkable patriot of Namibia.\n\nThis is a very solemn occasion where we are honouring a revered African revolutionary, Pan-Africanist, a remarkable patriot of Namibia and also an outstanding regional statesman who over six decades helped shape the course of African liberation, said Amb Mutsvangwa.\n\nNamibian Ambassador to Zimbabwe, Mr Nicklaas Kandjii described Dr Nujomas legacy as a liberator stretching across the slopes and savannahs of Southern Africa and ultimately encompassing the world.\n\nHis steadfast, dedication, to the liberation of the Namibian people from the shackles of colonialism and apartheid resonates not only in our nation but showcases the ethos of the African renaissance and reclamation of black political power, said Amb Kandjii.\n\nThe memorial service which was hosted by the Institute of African Knowledge at the Heritage Village was attended by diplomats as well as Namibian citizens based in Zimbabwe.\n\nZimbabwe and Namibia share strong historical ties, dating back to the liberation struggles of both nations.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/SN1.jpg",
            "description": "Herald Reporter FOUNDING Namibian president, Dr Sam Nujoma, strongly supported Zimbabwe during its Land Reform Programme, standing firm against neo-colonial influences and international pressure, a Cabinet Minister has said. Dr Nujoma passed on early this month, leaving behind a legacy of leadership in the fight for independence in Namibia and Southern Africa, and his burial […]",
            "time": "08:36",
            "date": "27 Feb 2025"
        },
        {
            "title": "EDITORIAL COMMENT: Current good rains guarantee  better harvests this season",
            "url": "https://www.herald.co.zw/editorial-comment-current-good-rains-guarantee-better-harvests-this-season/",
            "content": "The latest crop and livestock assessment by the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development has confirmed that most crops and pastures are in reasonable shape after the good rains we have been seeing for the last couple of months following a very slow start to the rainy season.\n\nNo one is guaranteeing the final harvest yet, but already it looks considerably better than at the same stage last year, and so long as moderately reasonable rains continue, as they are likely to, most dryland farmers will produce a fairly reasonable harvest.\n\nThe Government, which made sure that all farmers had access to the required seed and fertiliser inputs at the beginning of the season, and is now making sure that the subsequent fertiliser needs are met, has been backing the efforts of the farmers.\n\nWe tend to think about just two factors when we look at a harvest, that is do the farming families have enough food for the next 12 months and does the country as a whole have the same supply?\n\nThese are important points, but the third is equally important, that when all farmers from the smallest scale to the most capitalised commercial farmer are producing surpluses, then rural development can take off.\n\nMore and more, especially as we build up our irrigation potential to cope with unpleasant breaks in the rain seasons and the hard droughts like we saw last year, the question is becoming how much money will farmers make.\n\nWe talk about national food security, and someone does need to have a running calculation over whether our total harvest is enough or if we need imports. But when a farmer goes out into their fields they are not thinking about that at all.\n\nThey are wondering how much they will harvest and how much they can sell.\n\nThis becomes increasingly important as the percentage of Zimbabweans in farming families continues to fall.\n\nWhile the rural population is still a majority in Zimbabwe, less than half of all Zimbabweans are now farmers or dependants of farmers.\n\nThis is a sign of development, as ever more rural people have other occupations and sources of income, although the rural economy is underpinned by farming.\n\nIn developed countries that have maintained the smaller family farms, we now see a majority of the rural population process the produce of the farms, or provide services to farmers such as looking after farm machinery, or make and sell things to farmers.\n\nAlready we are seeing some of this in Zimbabwe.\n\nIn most seasons, there is good work for builders for example, as a farming family with a bit of profit decides to extend or upgrade the house now that they can afford another batch of materials.\n\nThey will spend money on carpentry, on buying more clothes, and all sorts of other needs.\n\nThis is one reason why drought can be so devastating in a rural community. It not only hits the farmers who grow their own food, but hits large swathes of others who rely on farmers for their own businesses. And this is also why when there is an okay season, everyone is a lot happier, and when there is a good season everyone cheers.\n\nAs we have seen since the drought hit last year, we can use reserves and imports to make sure everyone eats, but this does not create the wealth that we need to create as we push forward in our development.\n\nLast year the economy grew only 2 percent, but the fact that it grew while farming output contracted shows that other sectors, in particular mining and tourism, grew and managed to grow more than farming contracted.\n\nBut farming still is the source of income for the largest group of Zimbabweans and so good and bad harvests have major ripple effects, far more than for example booms and busts in mineral prices might have.\n\nFairly obviously we need to continue maximising the climate proofing of farming.\n\nAlready the experts are making sure everyone gets their moneys worth from their inputs by having the right seed for the right crop in each area.\n\nFarming techniques have been developed that can make maximum use of whatever rain does fall.\n\nAnd the Government is pressing ahead hard with expanding irrigation, so more and more of what we eat and sell can cope with dry spells and a drought.\n\nWe hope that this irrigation will be maximised by allowing supplementary irrigation, rather than an all or nothing approach.\n\nThe commercial farmers on their medium farms do not fully irrigate a summer crop, even in a drought year, rather using irrigation to get the crop established earlier, then filling in the dry spells.\n\nEven in a bad drought they still get more than half the water their crops need from rain, so the irrigation available can grow more than twice as much as a dedicated pure irrigated crop.\n\nThe good rains that have already fallen have been refilling the dams that did not fill last season and were run down in the months since.\n\nAlready far more water has flowed into these dams this season than last season, another sign that our rains are so much better.\n\nThe two huge cornerstone dams of the Lowveld irrigation have now spilled, meaning that the irrigation in that part of the country is guaranteed for some time to come, since these dams were designed to use the good seasons to irrigate in the bad seasons.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Rains.jpg",
            "description": "The latest crop and livestock assessment by the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development has confirmed that most crops and pastures are in reasonable shape after the good rains we have been seeing for the last couple of months following a very slow start to the rainy season. No one is guaranteeing […]",
            "time": "08:36",
            "date": "27 Feb 2025"
        },
        {
            "title": "Beitbridge energy park: A beacon of Zim’s investment potential",
            "url": "https://www.herald.co.zw/beitbridge-energy-park-a-beacon-of-zims-investment-potential/",
            "content": "Anashe Mpamombe, Herald Correspondent\n\nThe recent commissioning of the US$3.6 billion Palm River Energy Metallurgical project in Beitbridge by President Mnangagwa marks another significant milestone in Zimbabwes industrialisation agenda.\n\nConstructed by the Chinese firm Xinganglian, this project is a major boost to Zimbabwes energy and metallurgical sectors, further solidifying the countrys status as a prime investment destination.\n\nIt is a strong testament to Zimbabwes ability to attract large-scale international partnerships and drive forward its economic development.\n\nAs the country continues on its trajectory of economic growth, the Palm River Energy Metallurgical project showcases the positive results of Zimbabwes strategic engagement with global investors.\n\nThe collaboration with China, a long-standing economic partner, reflects the confidence that international businesses have in Zimbabwes potential.\n\nThis investment aligns with Governments commitment to fostering a business-friendly environment, attracting foreign direct investment, and creating sustainable development opportunities.\n\nWith a substantial capital injection of US$3.6 billion, this project is set to revolutionise Zimbabwes industrial landscape by creating jobs, advancing technology transfer, and enhancing the countrys energy and metallurgical capabilities.\n\nThe metallurgical sector is a crucial pillar in Zimbabwes industrialisation drive.\n\nThe process of extracting and refining metals supports industries such as construction, manufacturing, and energy production.\n\nBy integrating energy generation into the metallurgical processes, the Palm River Energy project exemplifies modern, sustainable industrial practices.\n\nZimbabwes rich mineral resources, such as gold, platinum, and lithium, present vast opportunities for value addition and economic expansion.\n\nThis project strengthens Zimbabwes capacity to process its minerals domestically, increasing their market value and contributing significantly to national economic growth.\n\nGovernments commitment to industrialisation and investment-led growth is evident in its ability to secure large-scale projects like this.\n\nInfrastructure development, policy consistency, and investor-friendly reforms have positioned Zimbabwe as a preferred destination for economic cooperation.\n\nOver the years, the country has successfully partnered with China on transformative projects, including the expansion of the Hwange Thermal Power Station, the construction of the New Parliament Building in Mt Hampden, and the modernisation of airports.\n\nThese developments are driving economic growth, enhancing infrastructure, and fostering increased investor confidence.\n\nAs Zimbabwe continues to attract foreign investment, it is essential to ensure that large-scale projects are implemented with sustainability and community development in mind.\n\nPresident Mnangagwa emphasised that the Palm River Energy project aligns with global standards for sustainable mining. With a focus on low greenhouse gas emissions, responsible waste management, and energy self-sufficiency, this initiative is set to become a model of environmentally conscious industrial development.\n\nBy prioritising green technology and efficient resource utilisation, the project will contribute to a cleaner, more sustainable future for Zimbabwe.\n\nBeyond its economic benefits, the project presents a wealth of opportunities for employment and skills development. Thousands of Zimbabweans will be employed in various capacities, from engineering and technical roles to administrative and logistical support.\n\nMoreover, the transfer of knowledge and expertise from international partners will equip local professionals with valuable skills, ensuring long-term benefits for Zimbabwes workforce.\n\nThe involvement of Zimbabwean engineers, technicians, and workers will foster skills development and economic empowerment, strengthening the countrys industrial capacity.\n\nAnother key advantage of the Palm River Energy Metallurgical project is its potential to uplift the local community. Beitbridge, a strategic economic hub, stands to benefit from improved infrastructure, increased business activity, and enhanced social services.\n\nInvestments of this magnitude often lead to the development of better roads, schools, healthcare facilities, and other essential services, improving the quality of life for local residents.\n\nGovernment and its partners are committed to ensuring that communities surrounding major investment projects reap the benefits of economic progress.\n\nThis project also sets a positive precedent for future large-scale investments in Zimbabwe.\n\nIt demonstrates the countrys readiness to welcome global investors and implement projects that drive economic diversification and industrial modernisation.\n\nGovernments commitment to maintaining a stable and transparent investment climate further reinforces Zimbabwes appeal as a destination for foreign direct investment.\n\nEnsuring policy consistency, strengthening anti-corruption measures, and fostering partnerships between foreign investors and local businesses will further solidify the countrys position as a growing economic powerhouse.\n\nThe commissioning of the Palm River Energy Metallurgical project is a clear sign that Zimbabwe is on the right track towards industrial transformation.\n\nIt symbolises the success of economic diplomacy, the effectiveness of investment-friendly policies, and the strength of Zimbabwes strategic partnerships.\n\nBy embracing sustainable industrialisation and prioritising community development, the country is paving the way for a prosperous future.\n\nThis project is not just an investment in infrastructure; it is an investment in the people, the economy, and the long-term success of Zimbabwe.\n\nAs the country continues to build a robust and resilient economy, initiatives like this will serve as stepping stones toward a brighter, more prosperous tomorrow.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Palm-River-1.jpg",
            "description": "Anashe Mpamombe, Herald Correspondent The recent commissioning of the US$3.6 billion Palm River Energy Metallurgical project in Beitbridge by President Mnangagwa marks another significant milestone in Zimbabwe’s industrialisation agenda. Constructed by the Chinese firm Xinganglian, this project is a major boost to Zimbabwe’s energy and metallurgical sectors, further solidifying the country’s status as a prime […]",
            "time": "08:36",
            "date": "27 Feb 2025"
        },
        {
            "title": "Broadcaster laments declining radio standards, quality of on-air conversations",
            "url": "https://www.herald.co.zw/broadcaster-laments-declining-radio-standards-quality-of-on-air-conversations/",
            "content": "Trust Khosa\n\nVETERAN broadcaster Tendayi Chakanyukabelongs to a golden generation of radio presenters who touched the hearts of many with their exceptional skills.\n\nChakanyuka honed her craft under the guidance of seasoned radio professionals and, after graduating from college, knew that her passion lay in radio presenting.\n\nKnown by her moniker The Sweet Thang, Chakanyukas voice and pulsating presence on radio will be sorely missed.\n\nHer engagement with listeners, fellow co-presenters, and guests was truly remarkable.\n\nIn her view, radio is not just a profession but a way of life; she believes it has propelled her to acclaim.\n\nWith nostalgia, Chakanyuka reflected on some of her best days on air alongside industry stars.\n\nLike many, she had her role models in broadcasting, including Eunice Goto, the late Tsitsi Mawarire, and Kudzi Marudzatop personalities of their era.\n\nThose were the days when radio was still radio, is a recurring phrase she uses whenever the topic of quality broadcasting comes up.\n\nChakanyuka has worked alongside several generations of presenters and has consistently excelled.\n\nSadly, on her 51st birthday yesterday, she expressed that she had lost her love for radio.\n\nIn a conversation with The Herald Arts, taking us down memory lane, she emphasised that her life would be incomplete without acknowledging her successful stints at Radio 3, later renamed Power FM, and Radio 1, now known as National FM.\n\nWhile she also had a successful run on the soap opera Studio 263, many will remember Chakanyuka for her contributions to radio.\n\nI am passionate about radio, but I cannot listen to radio anymore.\n\nWe are now lacking basic standards or rules in the profession, lamented Chakanyuka.\n\nFor starters, we dont know where most of these presenters are coming from.\n\nAre they still receiving proper training in radio as we once did?\n\nIs it now just a matter of club DJs playing music for listeners without adhering to fundamental radio practices, like research?\n\nAlthough she believes the current generation of presenters can do better, she insists she has stopped listening to the radio.\n\nAs a radio presenter, you have to talk to the listeners, but you can only do that after researching.\n\nIt appears most presenters do not plan programmes, and you can easily conclude that some of the topics come up on short notice for those who listen to the radio.\n\nNowadays, it is a matter of presenters talking about anything that comes to their mind on air, including mjolo and stuff, bemoaned Chakanyuka.\n\nThe broadcaster, who made her name at the Zimbabwe Broadcasting Corporation (ZBC), argued that much work remains to be done to make radio enjoyable again.\n\nWhile she does not wish to belittle the current crop of presenters, her call is for quality research, and engagement with listeners through radio programmes.\n\nWe simply need to follow the rules and research before going on air.\n\nHowever, her on-off marriage with the ZBC started at the turn of the new millennium when the then Radio 3 rebranded and moved to Gweru.\n\nI could not move to Gweru because I was married. I stayed behind in Harare but remained in touch with my peers.\n\nI have always loved radio, and I knew I would bounce back and I did when they (Power FM) moved back to Harare, she recounted.\n\nTrue to her belief, Chakanyuka found herself a presenter at SFM (now Classic 263) in 2008 and later rejoined Power FM.\n\nAt Power FM, she made a formidable combination with Tinashe Chikuse among other presenters.\n\nShe had a brief stint at Capitalk FM, where she left in recent years to pursue other projects.\n\nOn her role in the soap opera Studio 263, where she starred as Aunty Mandy Huni, Chakanyuka revealed it was by default.\n\nI can say in 2002 I made my maiden role in the soapie Studio 263.\n\nI had never acted before, except for small roles while in school long back.\n\nDuring that time, I was only working at PSI. I later joined Small House Saga among other productions, she shared.\n\nA lady of many talents, Chakanyuka also featured in several theatrical performances after garnering experience at Studio 263.\n\nI had a stint in theatre where I featured in the late (Stephen) Chifunyises plays like Lovers, Friends and Money and Waiting for a New Constitution, among other productions, remarked Chakanyuka, whose versatility has made her a top creative.\n\nBut her versatility, which saw her venturing into theatre, film, and television among other projects, means Chakanyuka will always be remembered as a radio personality with plenty to offer.\n\nComing from an older generation, her sentiments to urge the current crop of radio presenters to up their game carry weight.\n\nHer reflections have sparked a fresh debate, rooted in her extensive experience as a lifelong radio personality.\n\nChakanyuka, who was the Best Radio Personality at the National Merit Awards in 2015, remains a role model to the girl child.\n\nHer combination with the likes of Kudzi Mr Kool Marudza, Witness Chuman Matema, and Ronald D-train Chiwanza, will always remain a painkiller for old-school music lovers.\n\nThe mother of one was raised in Domboshava by strict parents who were both teachers.\n\nShe studied Mass Communication at Harare Polytechnic and further honed her skills as a radio presenter at ZBC.\n\nChakanyuka also studied marketing among other programmess.\n\nMeanwhile, she is set to launch her book next Wednesday.\n\nInitially, the book launch was set to coincide with her birthday yesterday.\n\nThe book will be launched next week. As for the birthday party, it will be a family affair. Im used to people spoiling me, especially when there are major milestones, like when I turned 40 and 50, noted the proud broadcaster.\n\nAt 51, Chakanyuka is not asking for too much from the new crop of presenters, but rather for them to up their game\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Tendayi-Chakanyuka-.jpg",
            "description": "Trust Khosa VETERAN broadcaster Tendayi Chakanyuka belongs to a golden generation of radio presenters who touched the hearts of many with their exceptional skills. Chakanyuka honed her craft under the guidance of seasoned radio professionals and, after graduating from college, knew that her passion lay in radio presenting. Known by her moniker “The Sweet Thang,” Chakanyuka’s […]",
            "time": "08:36",
            "date": "27 Feb 2025"
        },
        {
            "title": "Zim, Japan to strengthen relations",
            "url": "https://www.herald.co.zw/zim-japan-to-strengthen-relations/",
            "content": "Ivan Zhakata, Herald Correspondent\n\nZimbabwe and Japan have reaffirmed their strong diplomatic and economic relations with both nations committing to deeper cooperation in trade, infrastructure, agriculture and education.\n\nSpeaking at the Japan National Day celebrations in Harare, Foreign Affairs and International Trade Deputy Minister Sheillah Chikomo said Japan has been making major contributions to Zimbabwes development.\n\nJapanese Ambassador to Zimbabwe Shinichi Yamanaka expressed optimism about expanding economic ties between the two countries.\n\nDep Minister Chikomo applauded Japans continued support in infrastructure development, particularly in road rehabilitation projects.\n\nWe acknowledge the cooperation in implementing infrastructure development projects, including the rehabilitation of our highways such as the Hellgate section in Makuti, she said.\n\nAmb Yamanaka announced the launch of Phase 2 of the North-South Corridor Road rehabilitation project between Makuti and Chirundu, a key trade route that connects Zimbabwe to regional markets.\n\nIn the agriculture sector, Japan has played a pivotal role in supporting Zimbabwes smallholder irrigation projects.\n\nDep Minister Chikomo praised the Smallholder Horticulture Empowerment Promotion (SHEP) Market-Oriented Agriculture initiative, which facilitated Zimbabwes first-ever sesame seed exports to Japan.\n\nThis milestone was made possible through the collaboration of our two governments, she said.\n\nWe are confident that this project will continue to support rural communities and contribute to President Mnangagwas Rural Development Programme.\n\nAmb Yamanaka said there was a steady growth of trade between the two nations, pointing to the resumption of petalite exports after a two-year halt.\n\nPetalite, a key mineral used in traditional Japanese pottery, is now back in Japans supply chain.\n\nWe are also witnessing the resumption of coffee exports from Zimbabwe to Japan after 20 years,.\n\nAmb Yamanaka said there was a growing interest in agriculture, mining and investment opportunities in Zimbabwe.\n\nBusiness activities between Japan and Zimbabwe are expanding gradually and steadily.\n\nZimbabwe has also benefited from Japans technological and educational support, with several Zimbabwean students receiving scholarships to study in Japan.\n\nCurrently, around 25 Zimbabwean students are in Japan each year on scholarships, Amb Yamanaka said.\n\nAdditionally, many Zimbabweans are working as English teachers in Japanese schools, fostering strong people-to-people ties between our nations.\n\nZimbabwe will showcase its investment potential at Expo 2025 Osaka, while the 9th Tokyo Int-ernational Conference on African Development (TICAD) in Yokohama in August 2025 is expected to further cement economic and diplomatic ties.\n\nThe Government of Zimbabwe remains open for business and invites Japanese investors to explore opportunities in agriculture and mining, Amb Chikomo said.\n\nBeyond trade and infrastructure, cultural cooperation remains a key aspect of the partnership.\n\nJapan continues to support community-based tourism projects in Bulawayo, Chesvingo, Gairezi and Tengenenge, blending cultural heritage with economic empowerment. Both Zimbabwe and Japan reaffirmed their commitment to peace, global cooperation and sustainable development.\n\nJapans commitment to these values resonates with ours as we aspire to create a world that fosters cooperation and mutual growth, Dep Minister Chikomo said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Japan.jpg",
            "description": "Ivan Zhakata, Herald Correspondent Zimbabwe and Japan have reaffirmed their strong diplomatic and economic relations with both nations committing to deeper cooperation in trade, infrastructure, agriculture and education. Speaking at the Japan National Day celebrations in Harare, Foreign Affairs and International Trade Deputy Minister Sheillah Chikomo said Japan has been making major contributions to Zimbabwe’s […]",
            "time": "08:36",
            "date": "27 Feb 2025"
        }
    ]
}