{
    "news": [
        {
            "title": "Mupamhanga national hero",
            "url": "https://www.herald.co.zw/mupamhanga-national-hero/",
            "content": "Rumbidzayi Zinyuke\n\nSenior Reporter\n\nPRESIDENT Mnangagwa has bestowed national hero status on former Deputy Chief Secretary responsible for Monitoring and Evaluation in the Office of the President and Cabinet, Cde Justin Mupamhanga.\n\nHe died yesterday at Arundel Clinic in Harare after a long fight against diabetes and high blood pressure.\n\nZanu PF national Political Commissar, Cde Munyaradzi Machacha, delivered the message of national hero status to the Mupamhanga family at their Harare home last night.\n\nCde Machacha was accompanied by Zanu PF Mashonaland Central Politburo members, Central Committee members and provincial executive members, including provincial chairman Cde Kazembe Kazembe, among others.\n\nIn his remarks, Cde Machacha said Cde Mupamhanga led an exemplary life, hence the decision to declare him a national hero.\n\nZANU PF and His Excellency Dr ED Mnangagwa are happy to announce to the family and to the nation that Cde Mupamhanga has been accorded national hero status, he said.\n\nWhen the party looked at the work he has done over the years; it was not difficult for the President to bestow upon him this status. He earned it through his hard work.\n\nCde Machacha said the work done by the national hero started during the liberation war where he selflessly worked alongside other cadres to liberate the country.\n\nEven after the war, he said, Cde Mupamhanga remained a positive person and supported the ruling party in every way possible, together with his wife, where they participated in various thematic committees, giving progressive ideas and opinions.\n\nCde Mupamhanga had depth of knowledge of the socialist ideology of the ruling party and he held this until his death.\n\nHe was a hard worker and a team player. He was good at research and made sure that he would thoroughly dig for facts around any issue before making a presentation.\n\nThe family may have lost a great man, but I think the greatest loss is to the country, ZANU PF and all the ZANLA cadres who knew and worked with him all these years, Cde Machacha said.\n\nEarlier yesterday, Acting President Dr Constantino Chiwenga had sent a condolence message to the Mupamhanga family.\n\nHe said the decision to bestow national hero status on Cde Mupamhanga was in recognition of his role in the struggle for Independence and in national development, especially in laying the foundation and growing the agriculture and energy sectors.\n\nMay I, on behalf of His Excellency the President Dr ED Mnangagwa and the First Family, the nation, the ruling ZANU PF party, Government and my family, express my deepest and heartfelt condolences to the Mupamhanga family, including Amai Mupamhanga and the children who include, our Deputy Minister for Youth Empowerment, Development and Vocational Training, Hon Kuda Mupamhanga, on their saddest loss.\n\nMay they derive solace from the knowledge that the nation today joins them in mourning the sad and untimely demise of this illustrious son of the soil, Acting President Chiwenga said.\n\nCde Mupamhangas last-born son, Mr Kumbirai Justin Mupamhanga, expressed gratitude for the honour bestowed on his father.\n\nToday is a dark day. We have lost a great man as a family, the country lost a great man. As a father, he was the best.\n\nThe intention is to give him a great send-off, what he deserves, and carry on his legacy. He is gone but through us his sons and his grandchildren, he lives, he said.\n\nHis granddaughter Makanaka Mupamhanga (11) said life would not be the samewithout her grandfather.\n\nI frequently used to visit his office and we have a lot of great memories. The fact that hes gone makes us really sad, but we know that he is in a better place. One thing he always told us was, always remember me, even when Im in my grave, and we will fulfill his wishes, she said.\n\nFamily friend, Mr Denias Zaranyika, said he had lost a good friend and brother.\n\nHe stayed in Mozambique for a long time, fighting for the freedom of this country. He wanted Zimbabwe to be free so that we would be able to self-determine our future.\n\nI have no words today; we are celebrating the passing on of a great man. We know that he worked very hard for this country to liberate it, and I want to say to him, well done, Justin, well done, my friend, he said.\n\nCde Mupamhanga was a veteran of the liberation struggle who sacrificed his studies at the then University of Rhodesia in 1975 to join Zanla forces at the battle front.\n\nHe played a critical role in driving the implementation of Government programmes as Deputy Chief Secretary responsible for monitoring and evaluation in the Office of the President and Cabinet, working under then Chief Secretary, Dr Misheck Sibanda.\n\nHe superintended over numerous strategic and key Government programmes in agriculture, energy and infrastructure development.\n\nCde Mupamhanga joined the liberation struggle in Mozambique and was allowed to complete his university studies soon after completing his initial military training.\n\nHe later held important positions in the Zimbabwe African National Union (ZANU) and ZANLA commissariat and education departments.\n\nAfter Independence, he began his civil service career in Government in 1983 in the Economics Division of the Presidents Department.\n\nHe rose through the ranks, first establishing and heading the Economics Branch, serving as Minister Counsellor at the Diplomatic Mission in London, United Kingdom, and later being elevated to the position of Deputy Director in the Presidents Department under President Mnangagwa, who was then the Minister of State Security.\n\nIn times of the El Nino-induced droughts that have from time to time devastated the Southern African region, Cde Mupamhanga was part of a taskforce that included the then Commander Air Force of Zimbabwe, Air Marshal Perrance Shiri, who is now late, Major General Amoth Chimombe andMr Ngoni Masoka, the then Secretary for Agriculture, that was charged with the responsibility to import grain and avert hunger in the country.\n\nCde Mupamhanga was later appointed Pemanent Secretary for Energy and Power Development. During his tenure, he played a key role in the liberalisation of the fuel industry, which eliminated fuel shortages and increased participation by indigenous businesses in that sector.\n\nIn that role, he also led the restructuring of the National Oil Company of Zimbabwe.\n\nHe also restructured ZESA into self-contained business units and introduced the Zimbabwe Energy Regulatory Authority.\n\nAs Deputy Chief Secretary responsible for monitoring and evaluation in the Office of the President and Cabinet, Cde Mupamhanga oversaw the implementation of major projects such as the construction of Tugwi-Mukosi Dam.\n\nThe highlight of his career was as Chairman of Command Agriculture during which he laid the framework for agricultural productivity, thus helping Zimbabwe to reclaim its breadbasket status in the region.\n\nHe retired in 2019 after 36 years of dedicated service to Government and country but continued as Chairman of Kuvimba Mining House.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/13E1E-680x380.jpg",
            "description": "Rumbidzayi Zinyuke Senior Reporter PRESIDENT Mnangagwa has bestowed national hero status on former Deputy Chief Secretary responsible for Monitoring and Evaluation in the Office of the President and Cabinet, Cde Justin Mupamhanga. He died yesterday at Arundel Clinic in Harare after a long fight against diabetes and high blood pressure. Zanu PF national Political Commissar, […]",
            "time": "08:34",
            "date": "23 Jan 2025"
        },
        {
            "title": "‘Each generation must take nation forward’",
            "url": "https://www.herald.co.zw/each-generation-must-take-nation-forward/",
            "content": "Mukudzei Chingwere\n\nHerald Reporter\n\nThe true honour Zimbabwe can bestow on its national heroes and heroines lies in building a prosperous nation free from corruption, unethical behaviour and selfish dealings, Acting President Dr Constantino Chiwenga has said.\n\nSpeaking at the triple burial of National Heroes  Major-General (Retired) Solomon Siziba, Cde Chenhamo Chakezha Chen Chimutengwende and Ambassador John Shumba Mvundura at the National Heroes Acre in Harare yesterday  Acting President Chiwenga said each generation must take the nation forward.\n\nLet us all strive to build habitable, peaceful, economically stable and secure Zimbabwe as a legacy for future generations, he said.\n\nEach generation must take our nation forward  that way, the trajectory of our nation will remain on an upward path, with each generation leaving a wholesome legacy for the one coming after it.\n\nThe only way we can honour these heroes and heroines is to make sure that we all build the Zimbabwe they envisioned, indeed the great Zimbabwe we want which is peaceful, secure, prosperous and always moving forward.\n\nActing President Chiwenga took a swipe against corruption and other illicit activities.\n\nA loud and clear no to corruption by whomsoever; corruption aborts our quest for sustainable economic development, peace and stability, hesaid.\n\nThe Acting President said Zimbabwes struggle for independence was rooted in values of unity and love.\n\nHe also called on various stakeholders, including the media, civil society and political parties, to foster nation-building and unity.\n\nLet us not forget that it is through the selfless sacrifices and dedication to duty by the late three gallant sons of the soil we are laying to rest today, and many other departed and living cadres, that Zimbabwe continues to enjoy its sovereign nationhood as aState.\n\nWe can only realise our vision of attaining an Empowered and Prosperous Upper-Middle Income Society by guarding against and desisting from all forms of actions and misdeeds which undermine the national interest, said Acting President Chiwenga.\n\nForemost is corruption and all forms of related unethical and selfish conduct, especially in respect of business transactions at whatever level  small, medium to large economic units.\n\nAny act of shady dealings and acts of deceit go towards undermining the ideals for which these gallant nationalheroes sacrificed their lives.\n\nHe said values of unity and love are timeless and must personify today and tomorrow and be passed on to future generations.\n\nThey make a nation, they give character to a people. Above all, they make us winners in every sphere of human endeavour.\n\nAs we strive to develop our country, what must always guide us is the need to shun hatred, and embrace each other through love, tolerance and forgiveness.\n\nIf you become a false witness, then you are betraying these three comrades we are laying to rest today.\n\nLack of respect for each other and petty jealousies are mortal sins which cannot be forgiven here on earth and in heaven.\n\nWe should respect one another and continue to be guided by the principle of Ubuntu, taking cognisance of the fact that every Zimbabwean who was born as we fought for our Independence contributed in different yet important capacities towards this one sacred goal which motivated us all and built solid unity in struggle.\n\nActing President Chiwenga called on different sectors of society, particularly the media and communications fraternity at large, civil society and national-interest driven opposition political parties and other social interest groups to play a positive role in the promotion of nation-building and unity of purpose.\n\nDespite our divergent political views, we should always remember that we are one people who should be guided by the ethic of transformative politics where tolerance, forgiveness and ubuntu take precedence in our quest to build a prosperous, secure and stable Zimbabwe that we will continue to be patriotically proud of.\n\nHe implored the citizenry to make the most of the rains we are currently receiving by growing short-season variety crops to enhance the Governments food security efforts.\n\nBrigadier General Mpulaeng Siziba, young brother to the late Major General (Rtd) Siziba, hailed the legacy left left by his brother.\n\nHe said his late brother contributed wholeheartedly to the growth and development of the agricultural sector in the region.\n\nMr Cleopas Nyangoni, brother to Cde Chimutengwende, said the family had lost a pillar who assisted in the education and development not only of his immediate family but extended family.\n\nHe said his brother was a hard worker and an easygoing man who enjoyed his free time through music and dance.\n\nMs Jayne Mvundura, daughter to Ambassador Mvundura, said her late father was a loving family man but at the same time a strict disciplinarian who demanded the very best from his children and family.\n\nShe said Ambassador Mvundura also contributed to the education and personal development of several people who are not his family.\n\nThe burial of the three national heroes was attended by Vice President Kembo Mohadi, Cabinet Ministers, Service Chiefs and other senior Government officials.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/2D23D-680x380.jpg",
            "description": "Mukudzei Chingwere Herald Reporter The true honour Zimbabwe can bestow on its national heroes and heroines lies in building a prosperous nation free from corruption, unethical behaviour and selfish dealings, Acting President Dr Constantino Chiwenga has said. Speaking at the triple burial of National Heroes — Major-General (Retired) Solomon Siziba, Cde Chenhamo Chakezha Chen Chimutengwende […]",
            "time": "08:34",
            "date": "23 Jan 2025"
        },
        {
            "title": "OPC slams media over 2030 misinformation",
            "url": "https://www.herald.co.zw/opc-slams-media-over-2030-misinformation/",
            "content": "Herald Reporter\n\nTHE Office of the President and Cabinet has criticised the privately-owned newspaper, NewsDay, for apportioning to President Mnangagwa views being expressed by some citizens who want him to extend his tenure beyond 2028.\n\nIn a statement yesterday, Deputy Chief Secretary (Presidential Communications) in the Office of the President and Cabinet, Mr George Charamba, said President Mnangagwa will not stand in the way of those expressing their views to have him extend his tenure because doing so would amount to undermining the very Constitution he swore to uphold, which provides for freedom of expression.\n\nMr Charamba was responding to a story carried in the NewsDay yesterday, headlined, Churches trash ED2030 plan, which the newspaper generated from what it claimed to be a statement written by the Zimbabwe Heads of Christian Denominations.\n\nThe NewsDay front-page story, said Mr Charamba, was deliberately intended to wrongly impute, misinform, malign and incite.\n\nWhile the NewsDay story purports to draw from a statement by the ecumenical Zimbabwe Heads of Christian Denominations (ZHOCD), which is titled, Statement on Presidential Constitutional Term Limits, the papers article is patently at variance with the said source statement whose addressees are clearly spelt out, and which appreciates and accurately restates the position of His Excellency the President, Dr E.D. Mnangagwa, regarding Presidential term limits.\n\nIndeed, His Excellency the President has stated and restated his position and stance on the matter time and time again, he said.\n\nMr Charamba said it was thus mischievous for NewsDay to seek to apportion to the President viewpoints by, and calls from, some citizens who are exercising their constitutional rights by proffering their views on the same matter.\n\nEqually, it is wrong for NewsDay to seek to redirect the viewpoint of, and message from, ZHOCD away from its clearly identified main interlocutors inorder to drag in or besmirch the person of His Excellency the President, he said.\n\nMr Charamba reminded NewsDay that President Mnangagwa was not responsible for views held or wishes expressed by some Zimbabweans in the course of expressing or exercising their constitutionally guaranteed freedoms.\n\nIndeed, inviting the President, whether directly or through editorial insinuations, to take a stand against the expression of such viewpoints, or any viewpoint for that matter, amounts to inviting and inciting him to overthrow the very Constitution he is sworn to uphold in its entirety.\n\nDemocracy is about allowing the free contestation of ideas in the nation. To that end and in a genuine constitutional democracy such as our own, the media provide neutral platforms for such contestations which, at any rate threaten nobody and in fact validate and demonstrate our democracy in actual action, he said.\n\nMr Charamba also said it was critical to avoid interfering with people expressing their views.\n\nThe designated role of the President of Zimbabwe in such situations is not to tamper with expressions of viewpoints from the citizenry; rather, it is to allow those viewpoints free play for as long as they remain within the remit of our Constitution.\n\nThe Office of the President and Cabinet hopes this role and position is fully appreciated and respected by all, including by the media which in democratic parlance is called the Fourth Estate, he said.\n\nZanu PF, together with other citizens, have called on President Mnangagwas term to be extended to 2030, saying he has implemented several signature projects that warrant his continued stay in office until they come to fruition.\n\nThe ruling party adopted a resolution to have the Presidents term extended during its Annual National Peoples Conference held in Bulawayo last year.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2018/05/GEORGE-CHARAMBA.jpg",
            "description": "Herald Reporter THE Office of the President and Cabinet has criticised the privately-owned newspaper, NewsDay, for apportioning to President Mnangagwa views being expressed by some citizens who want him to extend his tenure beyond 2028. In a statement yesterday, Deputy Chief Secretary (Presidential Communications) in the Office of the President and Cabinet, Mr George Charamba, […]",
            "time": "08:34",
            "date": "23 Jan 2025"
        },
        {
            "title": "People have right to talk about ED2030: Minister",
            "url": "https://www.herald.co.zw/people-have-right-to-talk-about-ed2030-minister/",
            "content": "Herald Reporter\n\nTHE call to extend President Mnangagwas term of office beyond 2028 remains a rightful and unquestionable obligation for Parliament and other important stakeholders, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere has said.\n\nAs such, he said the proposal to move a motion on the Presidential Term Limit Extension will follow the provisions of the law.\n\nIn a statement yesterday, Dr Muswere said legislators needed to push the will of the people they represent.\n\nThe politically broad-based call to extend the Presidential term of office beyond 2028 remains a rightful and unquestionable obligation for Parliament, the Party of Zimbabwes permanent national democratic revolution  ZANU PF and other legitimate political stakeholders to this matter, he said.\n\nParliamentarians from the cross-sectional divide of political parties represent the views and interests of their electorate.\n\nParliamentarians, said Dr Muswere, were not answerable nor inclined to influence from Western-funded civil society organisations that seek to push the regime change agenda.\n\nHis remarks come after a religious organisation made futile attempts to push their Western handlers narrative.\n\nSubmissions by Honourable Members of Parliament reflect the aspirations of those who voted in the constituencies they were elected to serve.\n\nParliament is not answerable to narrow, sectoral and regime-change donor funding antics by a paltry conglomerate of civil society entrepreneurs purporting to represent the views of the Church in Zimbabwe.\n\nIn the same vein, such Western donor organisations need not to be reminded that ZANU PF is a political establishment which delivered freedom of expression and freedom of religion among many other rights we all enjoy today, said Dr Muswere.\n\nThe Zanu PF-led Government, he added, remains committed to furthering freedom of worship, but advised Western-backed organisations to refrain from trying to soil relations between the Second Republic and the Church.\n\nLikewise, the ZANU PF-led Government still ferociously defends freedom of worship for all Zimbabweans most of which are not affiliated to the Zimbabwe Heads of Christian Denominations (ZHCD) outfit.\n\nHowever, it is crucial for ZANU PFs godly existential values not to be abused by minority entities and individuals bent on misrepresenting the cordial relationship which the State and the church enjoy.\n\nDr Muswere said the proposal to move a motion on the Presidential Term Limit Extension will follow the provisions of the law.\n\nIt must be emphasised that the Constitution will remain centrifugal throughout this process with no iota of infractions, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/2EF2EF-680x380.jpg",
            "description": "Herald Reporter THE call to extend President Mnangagwa’s term of office beyond 2028 remains a rightful and unquestionable obligation for Parliament and other important stakeholders, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere has said. As such, he said the proposal to move a motion on the “Presidential Term Limit Extension” will follow the […]",
            "time": "08:34",
            "date": "23 Jan 2025"
        },
        {
            "title": "Mood of gratitude engulfs national shrine . . . 185 heroes and heroines interred to date",
            "url": "https://www.herald.co.zw/mood-of-gratitude-engulfs-national-shrine-185-heroes-and-heroines-interred-to-date/",
            "content": "Wallace Ruzvidzo\n\nHerald Reporter\n\nThe mood was one of reflection and gratitude at the National Heroes Acre yesterday, as Zimbabweans gathered to bid farewell to three national heroes  Major-General (Retired) Solomon Siziba, Cde Chenhamo Chen Chakezha Chimutengwende and Ambassador John Shumba Mvundura.\n\nWith the burial of the trio yesterday, 185 people have now been interred at the National Shrine comprising 169 heroes and 16 heroines.\n\nYesterdays triple burial was a rare occurrence, as there have only been two other such ceremonies since Zimbabwe attained Independence in 1980.\n\nThe first time Zimbabwe buried three national heroes at once was on January 26, 2021, when Lieutenant-General (Rtd) Dr Sibusiso Busi Moyo, Dr Joel Biggie Matiza, and Major-General (Rtd) Paradzai Zimondi were buried at the National Shrine.\n\nThe second occasion was on April 29 last year when Cde Nash Nyasha Dzimiri, Brigadier-General Shadreck Vezha and Cde Tsitsi Grace Jadagu were buried.\n\nDespite the cloudy weather, the atmosphere was electric, with a sea of vibrant colours dotting the landscape as mourners filled the stands at the National Shrine to give the heroes a befitting send off.\n\nThe occasion was a testament to the countrys commitment to honouring its heroes and preserving its history.\n\nBanners emblazoned with Zororai Murugare Shumba, Zororai Murugare Mhofu Yemukono . . . and Kha Vha Nga Mulalo Vho Siziba fluttered in the gentle breeze, a poignant reminder of the countrys history and heritage.\n\nThe Zanu PF Choir, resplendent in their party regalia, added to the pomp and circumstance, while members of the Apostolic Sect Church stood out in their traditional whitegarments.\n\nThe Zimbabwe Republic Police Band entertained the crowd with sombre melodies, setting the tone for the occasion.\n\nActing President Dr Constantino Chiwenga presided over the triple burial with Vice President Kembo Mohadi, Cabinet ministers, Deputy Ministers, Zanu PF officials, senior Government officials and families of the three heroes in attendance.\n\nThe Chaplin-Generals opening prayer set the stage for a ceremony that was both solemn andcelebratory.\n\nMinister of State for Bulawayo Provincial Affairs and Devolution Judith Ncube had nothing, but praises for the departed national heroes.\n\nYou know, to be honoured as a national hero, it is something which is valued so much because of the works of a person.\n\nThe background, the history, the participation during the liberation struggle, after the liberation, we value that so much. Hence, one is recognised.\n\nThe recognition that is being given to a person as a national hero, it means a lot, not only to the family, but to the entire nation.\n\nWe salute our three fallen heroes. We salute them, she said.\n\nManicaland Minister of State for Provincial Affairs and Devolution Misheck Mugadza said the three national heroes had contributed immensely to the countrys prosperity.\n\nHe made particular reference to Ambassador Mvundura who hailed from Manicaland.\n\nAs Manicaland, we thank very much His Excellency Dr Emmerson Dambudzo Mnangagwa, the President, and the Politburo for according hero status to Cde John Shumba Mvundura.\n\nCde John Shumba Mvundura was a war veteran who, like many other war veterans, fought for this country, brought independence and brought prosperity to this country.\n\nThese gallant sons of the soil, we respect them, we cherish what they have brought for us and we are very happy that we are here today burying them.\n\nWe are sad, of course, we have lost a hard worker, a man, a unifier, a man (Ambassador Mvundura) who was very instrumental in the development of Manicaland for a long time, he said.\n\nZanu PF Mashonaland Central Provincial chair in the Womens League Cde Tsitsi Gezi said it was heartening that the three had been accorded national hero status.\n\nCde Chimutengwende, she said, had seen through many developmental projects in the province particularly in Chiweshe where he had served as Member of Parliament.\n\nWe thank President Mnangagwa for bestowing the highest honour on Cde Chen Chimutengwende.\n\nHe worked greatly for the country from the time he was still in his youth.\n\nHe was a very brave man and he brought development in the province, in Chiweshe, she said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/F32R-680x380.jpg",
            "description": "Wallace Ruzvidzo Herald Reporter The mood was one of reflection and gratitude at the National Heroes Acre yesterday, as Zimbabweans gathered to bid farewell to three national heroes – Major-General (Retired) Solomon Siziba, Cde Chenhamo “Chen” Chakezha Chimutengwende and Ambassador John Shumba Mvundura. With the burial of the trio yesterday, 185 people have now been […]",
            "time": "08:34",
            "date": "23 Jan 2025"
        },
        {
            "title": "Over 200 airlifted as ambulance roll-out intensifies",
            "url": "https://www.herald.co.zw/over-200-airlifted-as-ambulance-roll-out-intensifies/",
            "content": "Trust Freddy\n\nHerald Correspondent\n\nGovernment-sponsored air ambulance services stationed at Sally Mugabe Hospital have completed two separate rescue missions, bringing the total of patients airlifted to over 200 since August last year.\n\nYesterday, the air ambulance was dispatched to Kadoma to evacuate a miner who suffered serious injuries in a mine shaft.\n\nThe incident occurred on Tuesday around 2pm, when a section of the mine collapsed, severely injuring the artisanal miner.\n\nThe first air ambulance departed Kadoma General Hospital at 4:04pm and arrived at Sally Mugabe Central Hospital at 4:43pm, marking a flight time of approximately 39 minutes.\n\nOn board the aircraft were two medical practitioners, Dr Louis Tatenda Mushaike, a medical doctor with the National Air Ambulance Service (Zimbabwe), and Adrian Maposa, a registered general nurse and air medic.\n\nThey were led by chief pilot, Vadim Vagapov and co-pilot Melvin Masanzi.\n\nOnce the patient was on-board, Dr Mushaike provided an update on the miners condition.\n\nWe have taken an ill patient who sustained blunt abdominal trauma, bladder injury, and pelvic fracture secondary to a mine collapse, he said.\n\nHe noted that while the patients vitals were within normal limits upon arrival, he was in urinary retention.\n\nWe drained the urine via the suprapubic region with the assistance of the doctor from Chegutu Hospital. This patient requires urgent specialist attention, he said.\n\nThe second air ambulance mission involved transporting a woman in labour from Chegutu to Chinhoyi Hospital. This crucial mission was led by chief pilot, Alexandra Rusanov and co-pilot Richard Sithole.\n\nThe air ambulance flew from Harare to Chegutu in just 30 minutes and then to Chinhoyi in 25 minutes, totalling 55 minutes for the entire journey. This efficient transport saved 34 minutes compared to the traditional road journey, which typically takes 1 hour and 9 minutes.\n\nStarting next week, the Government-sponsored air ambulances will become fully operational in Victoria Falls, marking a significant step in the ongoing roll-out of this essential service across the country.\n\nIn 2023, Zimbabwe received a fleet of 18 Russian-made Ansat and Mi-17 helicopters, part of a deal initiated by President Mnangagwa to enhance the accessibility of quality healthcare for patients within the public health system.\n\nThe introduction of this air ambulance service has already made a profound impact, saving numerous lives and enabling the prompt transportation of patients from rural areas to central hospitals.\n\nThe air ambulance service has thus far been rolled out in Harare, Bulawayo, and now Victoria Falls, providing crucial support where its needed most.\n\nAs the programme continues to expand, officials hope to further improve healthcare access for all Zimbabweans, particularly in underserved regions.\n\nGovernments commitment to this initiative reflects a broader strategy to modernise healthcare delivery and ensure that emergency medical services are available to those in urgent need.\n\nWith the successful airlifts and the ongoing roll-out of services, the air ambulance programme stands as a testament to Zimbabwes dedication to enhancing public health and saving lives nationwide.\n\nAs Dr Mushaike emphasised, timely medical intervention can be the difference between life and death, and this service is poised to make a significant difference in the lives of many.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/E2F2F-680x380.jpg",
            "description": "Trust Freddy Herald Correspondent Government-sponsored air ambulance services stationed at Sally Mugabe Hospital have completed two separate rescue missions, bringing the total of patients airlifted to over 200 since August last year. Yesterday, the air ambulance was dispatched to Kadoma to evacuate a miner who suffered serious injuries in a mine shaft. The incident occurred […]",
            "time": "08:34",
            "date": "23 Jan 2025"
        },
        {
            "title": "Treasury to strengthen local health funding",
            "url": "https://www.herald.co.zw/treasury-to-strengthen-local-health-funding/",
            "content": "Bulawayo Bureau\n\nZIMBABWE will strengthen domestic resource mobilisation to fund the health sector following the United States withdrawal from the World Health Organisation (WHO), Finance, Economic Development and Investment Promotion Minister, Professor Mthuli Ncube, has said.\n\nThe US has been a major global funder of various health programmes.\n\nThe countrys withdrawal from WHO signals a likely reduction in support for countries like Zimbabwe, which rely on PEPFAR funding for the HIV and AIDS programme.\n\nProf Ncube shared these insights during an online meeting with the media, providing updates on the ongoing World Economic Forum (WEF) annual meeting in Davos, Switzerland.\n\nOne issue which we noted is the US pulling out of WHO, which we felt perhaps will signal reduced support for countries such as Zimbabwe as you know Zimbabwe relies on PEPFAR funding directly from the US government for supporting our HIV and AIDS programmes, he said.\n\nTo address the potential funding gap, Prof Ncube highlighted the importance of increasing domestic health sector funding.\n\nHe suggested directing earmarked taxes, such as the sugar content tax and a proposed tax on fast foods, towards health initiatives.\n\nSo far, the sugar content tax introduced last year has raised about US$31 million. These funds will be ring-fenced for procuring cancer machines and essential drugs, he added.\n\nProf Ncube stressed the urgency of preparing for reduced healthcare support, particularly for critical programmes like PEPFAR, though no official communication on its status has been received.\n\nWe just felt that perhaps this thing is posing a danger to PEPFAR, but we have not received any official communication yet, that PEPFAR is in danger but if it is then we have a challenge. Our response should be that of domestic resource mobilisation, he said.\n\nThe WEF annual meeting, themed, Collaboration for the Intelligent Age, runs from January 20 to 24 in Davos Klosters, Switzerland.\n\nIt brings together global leaders to address challenges such as geopolitical shocks, economic growth, and an inclusive energy transition.\n\nLeading Zimbabwes delegation, Prof Ncube, who also chairs the Committee of African Finance Ministers, has been advocating for reforms to the global financial architecture to better serve developing nations, particularly in Africa.\n\nProf Ncube highlighted the importance of accessing climate funding to mitigate the effects of climate shocks like El Nino.\n\nHe urged Zimbabwe to view climate challenges as investment opportunities, stressing the need to invest in electric vehicles, cleaner railway infrastructure, and other green technologies.\n\nProf Ncube called for the creation of enabling regulatory frameworks and infrastructure to support investment in digital technologies, ensuring the sector thrives.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/04/Untitled-sdvsvsv.jpg",
            "description": "Bulawayo Bureau ZIMBABWE will strengthen domestic resource mobilisation to fund the health sector following the United States’ withdrawal from the World Health Organisation (WHO), Finance, Economic Development and Investment Promotion Minister, Professor Mthuli Ncube, has said. The US has been a major global funder of various health programmes. The country’s withdrawal from WHO signals a […]",
            "time": "08:34",
            "date": "23 Jan 2025"
        },
        {
            "title": "40 years, not out for Amai Jilimba",
            "url": "https://www.herald.co.zw/40-years-not-out-for-amai-jilimba/",
            "content": "Trust Khosa\n\nFor nearly four decades, camera lights, scripting, and acting have been the foundation of her career. Talented actress Amai Jilimba began her journey in Marondera, launching her career in 1985.\n\nAfter starring in several Zimbabwe Broadcasting Corporation (ZBC) productions, including Mawoko Matema, Hupenyu Mutoro, Checkmate, Mafuro Manyora, and Gehena Harina Moyo, she needs no introduction.\n\nShe has become widely known by the name Amai Jilimba, a moniker derived from her role in Mawoko Matema drama series. Renowned for her versatility, she excels in complex, cunning and no-nonsense roles across various productions.\n\nHowever, in real life, she is simply an easygoing woman.\n\nBorn Patience Musafare (age withheld), Amai Jilimba is often referred to as Patience Musa, but she humorously claims to have three other surnames  Mapfumo, Wadyehwata, and Zimbeva.\n\nLike many women of her generation, Amai Jilimba keeps her age a secret.\n\nI have dementia; I sometimes forget my age, joked the energetic actress in an interview with The Herald Arts.\n\nWhat you should know is that I started this whole journey in 1985, and I have featured in numerous productions. ZBC used to be our cash cow back in the day, and that is the life we have always known until things changed recently. I am also a legend who deserves to be counted among the top television personalities of my generation.\n\nTaking us down memory lane, Amai Jilimba first conceded that 2024 was a difficult year for her, although she managed to remain afloat.\n\nIt was not easy for me because I have kids to look after at the moment, which means I had to work hard and bring food to the table.\n\nI have three girls of my own and others that I adopted. It meant that I had to be a multi-tasking woman in 2024 because that has always been my lifestyle since.\n\nKnown for taking daring yet engaging roles in most productions, which have earned her enemies in real life, Amai Jilimba proudly shared her journey into acting.\n\nLike I said earlier, I was just born an actress from childhood. It wasnt until 1985 that I became a professional actress after finishing school at Monte Casino Girls High in Manicaland.\n\nOver the years, I have worked with big names like Stephen Chigorimbo, Sithembeni Makawa, Dorothy Chidzawo, and Ejike Asiegbu from Nollywood in the movie The Zimbabwe I Know, among other top producers. For the record, I am also a director-producer, considering all the years I have been in this game, she stressed.\n\nThe actress, who is set to celebrate her undisclosed birthday on January 29, narrated how she spends her day in Highfield, Harare.\n\nLike I indicated earlier, I am a hardworking woman who did not put all her eggs in one basket. I am an actress first, and then I am also a herbalist who assists people. I have been a cross-border trader for years, while my other job involves dealing with scrap metal with my team.\n\nAsked how she balances her busy and demanding schedule, she responded:\n\nIts not easy being a multi-tasking personality, but I have devised ways of managing my schedule. I always allocate time for every task. For instance, we normally do most of the shootings on Sundays after church since we finish early at the Roman Catholic Church. I then allocate time to make follow-ups on orders as well as monitoring my team that I work with in the scrap metal business, she said.\n\nAs a socialite in the Highfield community, Amai Jilimba, a mother of three, runs mentorship programmes on drug and substance abuse. I am also a volunteer who is helping young people in my area to fight the danger (drug and substance abuse) that has destroyed our communities, she stated.\n\nWith the winds of change sweeping across the showbiz landscape due to the technological revolution, Amai Jilimba has urged the old school to move with the times.\n\nI have realised that I still have a lot to offer to the showbiz scene because I create content every day.\n\nAs a result, my kids advised me to start my social media page under Amai Jilimba Productions, where we are sharing content. I thoroughly enjoy this work because I am now realising something, she said.\n\nThe shrewd actress emphasised the need for socialites to desist from hate language and obscenities.\n\nI have noted that some people believe controversy or unsavoury posts sell more, which is not true. Although some have gained traction by sharing unpleasant content, we cant do that considering we are elders in the game. We have to lead by example and show the way.\n\nShe also warned upcoming content creators, especially in the film and television sector to avoid workplace romance.\n\nDating producers or directors during productions of films or movies is a big no. It has killed many careers, and I have always been against that practice.\n\nBut who is Amai Jilimba?\n\nThe actress was born in Marondera under Chief Nenguwos area. She was born into a family of 11, being the seventh child.\n\nAs a young girl, she enrolled at Manyaira Primary School several decades ago. Afterwards, she found a place for her secondary education at Monte Casino, but she didnt perform well during her first Ordinary Level sitting.\n\nAn actress, herbalist, cross-border trader, and scrap metal dealer, Amai Jilimbas only public appeal is for the fame she has garnered to translate into real favourable fortunes.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Untitled-176.jpg",
            "description": "For nearly four decades, camera lights, scripting, and acting have been the foundation of her career. Talented actress Amai Jilimba (pictured)began her journey in Marondera, launching her career in 1985.",
            "time": "08:34",
            "date": "23 Jan 2025"
        },
        {
            "title": "EDITORIAL COMMENT : Mineral beneficiation critical for economic growth",
            "url": "https://www.herald.co.zw/editorial-comment-mineral-beneficiation-critical-for-economic-growth/",
            "content": "THE process of adding value to Zimbabwean minerals before they are exported is continuing and rapidly becoming part of the new normal with very little raw ore going out of the country, but rather containers of processed products or ingots of metals.\n\nThis new normal was shown off this week in Masvingo, where major mining companies invested in the province have been backing the Government policy of beneficiation and value addition. This adding of value does require people to do the work, but the investors have found that the good Zimbabwean educational system provides plenty of young people who are eminently trainable to do the skilled work required, so the country gets the double benefit of more valuable exports and the creation of good jobs.\n\nThere are additional benefits in that some of the mining can be contracted out to small-scale miners, again increasing employment.\n\nOf course every growing community in what can be regarded as a new town around a mine supplies markets for local farmers. Zimbabwes nascent mining supply industry, hit hard at one stage, now has potentially ever more customers for its own value addition.\n\nOne major mine in Masvingo, Bikita Minerals, that opened around a century ago and was for long the sole Zimbabwean lithium mine, has grown dramatically since it was bought by a new investor, Sinomine Resource Group, almost exactly three years ago in January 2022.\n\nIt has since spent several times the US$180 million purchase price to expand production of the two basic hard lithium minerals in what is regarded as the largest single lithium deposit in the world.\n\nLast year it commissioned a 12MW solar plant, to provide a good slice of its electrical energy, and commissioned a new high-capacity power line and connection to the national grid.\n\nThis has allowed many others to connect to the grid in Bikita district, a fairly undeveloped area until recently with half the district once being a single ranch that relied on its vast area to maintain cattle with little infrastructure.\n\nAlso last year, President Mnangagwa went to the mine to commission the new value-add plant for the main two lithium minerals.\n\nThis not only helps Zimbabwe, but Sinomine now has severely reduced transport costs, which are expensive when stuff has to be trucked out of Bikita, by switching from ores to semi-refined products that need a lot less truck space since the waste rock is left behind. Once again this is good business and Zimbabwean benefits are the same.\n\nSinomine Resources investments include effectively building the small town around the mine and processing plant, with 300 houses and a decent clinic. While some of this investment can be seen as service to the local community, most Zimbabwean major mines have found over the years that few mineral deposits are next door to major urban centres, so there is a need to have a new town where staff can live with their families and essential services can be laid on.\n\nSo this sort of development is often a cost-effective business decision as well. Again, everyone wins.\n\nThe other major development highlighted in this weeks tour was the new US$60 million chrome smelting plant in Mashava.\n\nThe plant processes chrome ore, and converts it to far more valuable ingots of ferro-chrome for sale and shipment. This has created over 230 direct jobs for Zimbabweans as well as making the exports a lot more valuable.\n\nThe lower chrome output during the UDI era was all converted to ferro-chrome before export, using cheap surplus power from Lake Kariba.\n\nAfter independence the far greater industrial development absorbed more power and more commercially-priced power was needed. The then chrome smelter owners backed out and Government had to allow a lot of chrome to be exported as ore.\n\nNew investors have not only reanimated the old plants, but have been adding capacity, as at Mashava, for the increased mining and markets, using more efficient methods. They have even been building their own power station, so they have secure power supplies, and Zimbabwe has once again banned exports of pure ore.\n\nThere will be a growing local market for Zimbabwean ferrochrome and nickel as the new steelmaking complex at Manhize moves into production of stainless steels.\n\nAround 30 percent plus of most stainless steels consist of chrome and nickel so as the Dinson works move up the ladder there will be a huge demand for other minerals besides the basic iron ore and coke, and the final exports will be exceptionally valuable high-grade steels, giving maximum value addition and revenue.\n\nAgain all this industrial processing needs a lot of skilled Zimbabweans, so more decent jobs are created, and those workforces and their employers buy goods and services, so the whole business world wins.\n\nThe intermediate products are also available to manufacturers downstream, so in the end a significant portion of the iron, chrome and nickel mined in Zimbabwe is exported as manufactured goods.\n\nThis is one reason why, being a major lithium producer, Zimbabwe is looking at going beyond refining the lithium down to the products and salts needed by battery manufacturers and starting battery manufacture locally.\n\nThe second most important material after lithium is nickel, plentifully available, and the small amounts of cobalt needed as the third material are easy to buy around the corner in Zambia and DRCs Katanga province.\n\nMineral production in Zimbabwe will always be far higher than local manufacture could ever absorb, even when a lot of industrial output is exported, but by ensuring that when the raw materials are exported they are exported in the standard processed form required by global markets, we will obtain full value, and the miners will be doing better business than trying to truck out low-value high-bulk goods instead of high-value low-bulk goods.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/08/Economic-Growth.jpg",
            "description": "THE process of adding value to Zimbabwean minerals before they are exported is continuing and rapidly becoming part of the “new normal” with very little raw ore going out of the country, but rather containers of processed products or ingots of metals.",
            "time": "08:34",
            "date": "23 Jan 2025"
        },
        {
            "title": "94pc sorghum target planted, exports hit US$1bn",
            "url": "https://www.herald.co.zw/94pc-sorghum-target-planted-exports-hit-us1bn/",
            "content": "Edgar Vhera\n\nAgriculture Specialist Writer\n\nFARMERS have planted 94 percent of the 2024/25 seasons targeted sorghum hectarage of 418 000 with the crops exports from last seasons harvest reaching US$1 billion between January 1 and September 30 last year.\n\nThe Agricultural and Rural Development Advisory Service (ARDAS) weekly report dated January 20 show that 391 251 hectares of sorghum have been planted against a target of 418 000.\n\nA combination of Government and private sector financing models has allowed the country to achieve this feat.\n\nThe weekly report showed that the Food Crop Contractors Association (FCCA) targeted and contracted farmers to do 14 630 hectares with the growers surpassing the mark by planting 14 707ha.\n\nAFC targeted 3 000ha and so far, 908ha have been contracted with 73ha planted so far.\n\nAgricultural and Rural Development Authority (ARDA) has set a target of 50 000ha with 15 410ha contracted and 14 962ha planted to date.\n\nThe Presidential Input Programme (PIP) targeting 154 215ha has so far contracted 211 581ha and planted 205 446ha, marking a whopping 133 percent increase from the set target.\n\nSelf-financing farmers whose target is 196 155ha have so far planted 156 049ha.\n\nMatabeleland South and North provinces have covered 100 percent of their target.\n\nMasvingo province has the largest planted area of 85 164ha, followed by Manicaland at 58 526ha and Mashonaland Central with 55 857ha.\n\nThe area planted under sorghum this year has surpassed last years 176 933ha by a whopping 221 percent.\n\nA total of 1 213 500 beneficiaries have received sorghum seed this year.\n\nThe report revealed that the condition of crops was good across provinces with most of the traditional grains (85 percent), which was planted in December at the vegetative stage.\n\nTo encourage production of sorghum, the Government has set a pre-planting traditional grain price of US$335, 14 per tonne. The premium prices for maize and traditional grains was to encourage deliveries to Grain Marketing Board (GMB) with the board set to establish mobile depots for easy delivery of maize and traditional grains.\n\nOver the years, farmers with traditional grains were able to swap them for maize at the GMB.\n\nSince last season, the Government announced that input distribution would be guided by a crop suitability map that compelled farmers in agro-ecological regions four and five to plant traditional grains.\n\nAs the populace embraces healthy eating, demand for traditional grains has been increasing with daily mass market price and volume data compiled by Knowledge Transfer Africa (KTA) showing that sorghum grain and meal have been trading throughout the whole year.\n\nA 20-litre tin of sorghum grain ended the year at an average price of US$12 while the five-litre tin of its meal was being sold on an average price of US$6.\n\nMeanwhile, statistics from Zimbabwe National Statistics Agency (ZimStats) show that the country has exported 2 690 042 kilogrammes of unmilled sorghum grain over the period January 1 to September 30 last year.\n\nIn value terms the country has earned US$990 619. The average export price was US$0, 37 per kilogramme.\n\nThe sorghum was exported to South Africa and Botswana in the first two months of the year. Botswana accounted for 74 percent of the sorghum in volume terms.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Screenshot-22-680x380.png",
            "description": "Edgar Vhera Agriculture Specialist Writer FARMERS have planted 94 percent of the 2024/25 season’s targeted sorghum hectarage of 418 000 with the crop’s exports from last season’s harvest reaching US$1 billion between January 1 and September 30 last year. The Agricultural and Rural Development Advisory Service (ARDAS) weekly report dated January 20 show that 391 […]",
            "time": "08:34",
            "date": "23 Jan 2025"
        }
    ]
}