{
    "news": [
        {
            "title": "Mashonaland Central provincial hero Cde Mandipaza laid to rest",
            "url": "https://www.herald.co.zw/mashonaland-central-provincial-hero-cde-mandipaza-laid-to-rest/",
            "content": "Daniel Chigunwe\n\nHerald Correspondent\n\nMashonaland Central Provincial Affairs and Devolution Minister, Retired Captain Christopher Magomo has described provincial war hero, Cde Gift Mandipaza, who was buried on Monday as a courageous individual whose steadfast commitment to justice and freedom saw him taking up arms to liberate the country.\n\nCde Mandipaza (64) who died on December 26 was interred at the Provincial Heroes Acre in Bindura.\n\nIn his eulogy during the burial ceremony, Minister Magomo narrated the heros liberation history saying legacy is a call to action for all of every Zimbabwean to safeguard the hard-won independence.\n\nCde Mandipaza, born on March 5, 1960 in Nyanga, was a courageous individual whose steadfast commitment to justice and freedom led him to join the armed struggle at the tender age of seventeen, he said.\n\nMotivated by unwavering desire to combat colonial oppression, he crossed into Mozambique in 1977, where he trained alongside fellow freedom fighters, enduring hardships that would forge his spirit and resolve.\n\nHis journey from the Frelimo camp to the battlefields was not merely a personal quest but a testament to his dedication to the liberation of our motherland. Surviving the Chimoio attack, Cde Mandipaza displayed resilience that inspired many. He played an integral role in the formation of the Zimbabwe National Army, contributing to the establishment of the 1 Mechanised Brigade.\n\nHe also described how the provincial hero contributed towards food security through his farming prowess.\n\nAfter retiring from the army, Cde Mandipaza continued to serve his community through agriculture, embracing the land reform program and contributing to the Vision 2030 initiative, he said.\n\nHis efforts were not just about his own farm at Longcroft but were aimed at uplifting the lives of those around him, ensuring food security and economic sustainability.\n\nAs we bid farewell to this gallant son of the soil, let us reflect on the values he embodied: bravery, loyalty, and an unyielding commitment to our nations progress. Cde Mandipazas legacy is a call to action for all of us to safeguard our hard-won independence and to remain steadfast in our duty to serve Zimbabwe.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/trt-680x380.jpg",
            "description": "Daniel Chigunwe Herald Correspondent Mashonaland Central Provincial Affairs and Devolution Minister, Retired Captain Christopher Magomo has described provincial war hero, Cde Gift Mandipaza, who was buried on Monday as a courageous individual whose steadfast commitment to justice and freedom saw him taking up arms to liberate the country. Cde Mandipaza (64) who died on December […]",
            "time": "20:25",
            "date": "30 Dec 2024"
        },
        {
            "title": "Man rapes niece on Christmas day",
            "url": "https://www.herald.co.zw/man-rapes-niece-on-christmas-day/",
            "content": "Prosper Dembedza\n\nHerald Correspondent\n\nA 25-year-old man from Mungate Village under Chief Chinamhora has appeared in court on allegations of raping his 17-year-old niece at a pigsty on Christmas day.\n\nThe man was remanded in custody and advised to apply for bail at the High Court. The court heard that on December 25, 2024, the accused and the complainant were outside roasting meat.\n\nIt is alleged that when the complainant sat down the accused touched her thigh and proposed love to her but she rejected him.\n\nAfter a while accused told the complainant that he wanted to meet her behind the house near the pigsty and she agreed.\n\nThe complainant went into the house and later came out to put some pegs that were on the washing line into a bag.\n\nAfter that she went to the toilet and met the accused who reminded her to meet him behind the pigsty. He later called the complainant to the pigsty and she came.\n\nWhile at the pigsty the accused kissed the complainant but she did not respond. He allegedly grabbed her waist and tried to fondle her breasts but she pushed him away.\n\nHe then overpowered her and raped her. The matter was reported to the police leading to the accuseds arrest.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2015/05/Underage-rape-cases-on-the-rise-in-NCD-media.jpg",
            "description": "Prosper Dembedza Herald Correspondent A 25-year-old man from Mungate Village under Chief Chinamhora has appeared in court on allegations of raping his 17-year-old niece at a pigsty on Christmas day. The man was remanded in custody and advised to apply for bail at the High Court. The court heard that on December 25, 2024, the […]",
            "time": "20:25",
            "date": "30 Dec 2024"
        },
        {
            "title": "Bindura University of Science Education takes its Annual District Education Conference to Manicaland, Masvingo",
            "url": "https://www.herald.co.zw/bindura-university-of-science-education-takes-its-annual-district-education-conference-to-manicaland-masvingo/",
            "content": "Fungai Lupande\n\nMashonaland Central Bureau\n\nBindura University of Science Education (BUSE) is taking its Annual District Education Conference (ADEC) to the grassroots levels in the Makoni and Gutu districts, in Manicaland and Masvingo, respectively.\n\nADECs co-chairperson, Dr Lazarus Dokora, said that this strategy aims to enhance local educational frameworks and promote transformative science learning for community development.\n\nRecently, officials from BUSE, Manicaland, and Masvingo provinces met to prepare for a series of training sessions scheduled to take place in January 2025.\n\nDuring the meetings, the officials agreed to establish committees of stakeholders within each district to address science and technical education initiatives tailored to address specific needs of their communities.\n\nBUSE is committed to fostering community development in line with our nations vision of becoming an upper middle-income society, aligned with the UN Sustainable Development Goals (SDGs), said Dr Dokora.\n\nTechnical courses delivered through Infield Blended Learning (IBL) will become the standard moving forward. While it is a moving target, we are assessing the scale of this evolution in ADEC outreach.\n\nIn Makoni district, Zimbabwe Foundation for Education with Production director and a member of the Makoni district team, Mr Gideon Chiukira welcomed the initiative and pledged their full support.\n\nMakoni Rural District Councils chief executive officer, Mr Chidembo Chidembo, promised that the schools within his jurisdiction would become the focal point for the BUSEs Friendship School.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/eeggew-680x380.jpg",
            "description": "Fungai Lupande Mashonaland Central Bureau Bindura University of Science Education (BUSE) is taking its Annual District Education Conference (ADEC) to the grassroots levels in the Makoni and Gutu districts, in Manicaland and Masvingo, respectively. ADEC’s co-chairperson, Dr Lazarus Dokora, said that this strategy aims to enhance local educational frameworks and promote transformative science learning for […]",
            "time": "20:25",
            "date": "30 Dec 2024"
        },
        {
            "title": "President Mnangagwa embarks on month-long annual leave",
            "url": "https://www.herald.co.zw/president-mnangagwa-embarks-on-month-long-annual-leave/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nPresident Mnangagwa will begin his month-long annual vacation on Tuesday, December 31, 2024.\n\nIn a statement, acting Chief Secretary in the Office of the President and Cabinet Mr George Charamba said the President will remain in the country during his leave, ensuring availability for any commitments that demand his personal attention.\n\nHis Excellency, the President, will spend his vacation locally and will remain accessible for responsibilities that require his direct involvement, both in his capacity as Head of State and as Chairman of the Southern African Development Community (SADC), said Mr Charamba.\n\nDuring the Presidents absence from routine duties, the two Vice Presidents, Kembo Mohadi and Constantino Chiwenga, will act on his behalf in that order.\n\nVice President Mohadi will assume the role of Acting President from December 31, 2024, to January 19, 2025. Thereafter, Vice President Chiwenga will take over until His Excellency resumes duties in early February 2025, Mr Charamba said.\n\nThe announcement reassures the nation of continued Government operations and leadership during the Presidents leave period.\n\nThe move also underscores the structured delegation of authority within Zimbabwes executive leadership.\n\nPresident Mnangagwas annual leave comes at a time when the nation is focused on consolidating economic growth and fostering regional cooperation under his leadership as SADC //Chairperson.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/President-Mnangagwa-5.jpg",
            "description": "Ivan Zhakata Herald Correspondent President Mnangagwa will begin his month-long annual vacation on Tuesday, December 31, 2024. In a statement, acting Chief Secretary in the Office of the President and Cabinet Mr George Charamba said the President will remain in the country during his leave, ensuring availability for any commitments that demand his personal attention. […]",
            "time": "20:25",
            "date": "30 Dec 2024"
        },
        {
            "title": "Government resolves social work training dispute",
            "url": "https://www.herald.co.zw/government-resolves-social-work-training-dispute/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nThe Ministry of Public Service, Labour, and Social Welfare has announced the resolution of a long-standing dispute between the Womens University in Africa (WUA) and the Council of Social Workers, paving the way for enhanced social work education and professional standards in Zimbabwe.\n\nIn a statement, Public Service, Labour, and Social Welfare Minister July Moyo lauded the collaborative efforts that led to a breakthrough saying the Council of Social Workers had previously identified gaps in WUAs Social Work Training Programme.\n\nThe council raised valid concerns regarding the program, and I am pleased to announce that WUA has diligently addressed these issues through a comprehensive implementation plan that meets the recommendations from both the Council of Social Workers and ZIMCHE, said Minister Moyo.\n\nThe council has since resumed its oversight role in WUAs social work programmes, a move that underscores the commitment to ensuring practitioners are equipped to meet community needs effectively.\n\nThis milestone strengthens the social work profession and aligns with the National Development Strategy 1 (NDS1) on labour and social protection, which aims to guarantee decent work conditions and social protections for all, Minister Moyo said.\n\nThe minister extended his gratitude to all stakeholders for their dedication, emphasising the broader impact of this resolution on society.\n\nThis is not just about improving education standards; it is about fostering a profession that serves our communities and builds a better Zimbabwe, he said.\n\nWith this resolution, the social work sector is set to benefit from improved training programs and stronger professional oversight, ensuring future practitioners are well-prepared to address the countrys pressing social challenges.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/a-680x380.jpg",
            "description": "The Ministry of Public Service, Labour, and Social Welfare has announced the resolution of a long-standing dispute between the Women’s University in Africa (WUA) and the Council of Social Workers, paving the way for enhanced social work education and professional standards in Zimbabwe.",
            "time": "20:25",
            "date": "30 Dec 2024"
        },
        {
            "title": "Killer T, Tocky Vibes headline Kadoma Shutdown Gig",
            "url": "https://www.herald.co.zw/killer-t-tocky-vibes-headline-kadoma-shutdown-gig/",
            "content": "Trust Khosa\n\nZimdancehall stars Killer T and Tocky Vibes will headline the Kadoma Shutdown Gig scheduled for The Odyssey grounds on New Years eve.\n\nTocky Vibes\n\nThe event will celebrate the young Turks of showbiz in Kadoma as they welcome 2025 in style.\n\nFellow artists Enzo Ishall, Master H, Madedido, Outlaw 7, MC Trateey, and Bling 4 are also part of the line-up.\n\nPowered by Pacific Cigarettes Company, the show comes at a time when youthful musicians had a splendid 2024 season.\n\nShow coordinator Dee Nosh of DTL Entertainment said it was all systems go.\n\nWe have decided to feature mainly youthful musicians as we enter 2025. For the people of Kadoma, this is the best way we have chosen to end our entertainment calendar. We also want to thank them for their support throughout 2024 as we enter 2025 in style, he said.\n\nIn terms of preparations, Dee Nosh said that his team has done their best.\n\nWe always prioritise the welfare of our fans, and as such, we have set up large tents in case it rains, while tight security is in place to ensure the safety of our fans.\n\nLike any other big event, we cant afford to disappoint our fans who have always been there for us. We urge fans to purchase tickets in advance to avoid the last-minute rush.\n\nKiller Ts camp has also promised fireworks at the show.\n\nWe are ready for this years shutdown gig in Kadoma. I love the place because fans in that town have been loyal to us. As we enter 2025, I urge fans to party responsibly and avoid injuries, he said.\n\nJudging by the line-up, fans are in for a real treat. Master H has been doing well, while Tocky Vibes is a tried-and-tested performer.\n\nMadedido, Outlaw 7, MC Trateey, and Bling 4 are set to provide variety at the show.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Killer-T.jpg",
            "description": "Trust Khosa Zimdancehall stars Killer T and Tocky Vibes will headline the Kadoma Shutdown Gig scheduled for The Odyssey grounds on New Year’s eve. The event will celebrate the young “Turks” of showbiz in Kadoma as they welcome 2025 in style. Fellow artists Enzo Ishall, Master H, Madedido, Outlaw 7, MC Trateey, and Bling 4 […]",
            "time": "20:25",
            "date": "30 Dec 2024"
        },
        {
            "title": "Police appeal for assistance in identifying road accident victim",
            "url": "https://www.herald.co.zw/police-appeal-for-assistance-in-identifying-road-accident-victim/",
            "content": "Crime Reporter\n\nPolice in Harare are appealing for anyone who can assist in identifying the body of a 12-year-old boy who was fatally hit by a car along Seke Road in October.\n\nThe body is still at Parirenyatwa Hospital mortuary. National police spokesperson Commissioner Paul Nyathi said, Police in Harare are appealing for information which may assist in identifying the body of a male juvenile approximately 12 years old, medium built and 1.2 metres in height, who was involved in a fatal road traffic accident on October 18, 2024 along Seke Road near ABC Auctions.\n\nThe victim was hit by a Honda Shuttle vehicle while crossing the road. The body is at Parirenyatwa Group of Hospitals mortuary.\n\nAnyone with information or may be missing a relative matching the description to report at any nearest Police Station.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/02/Assistant-Commissioner-Paul-Nyathi.jpg",
            "description": "Crime Reporter Police in Harare are appealing for anyone who can assist in identifying the body of a 12-year-old boy who was fatally hit by a car along Seke Road in October. The body is still at Parirenyatwa Hospital mortuary. National police spokesperson Commissioner Paul Nyathi said, “Police in Harare are appealing for information which […]",
            "time": "20:25",
            "date": "30 Dec 2024"
        },
        {
            "title": "Israel burns down Kamal Adwan Hospital, kills, tortures doctors and patients",
            "url": "https://www.herald.co.zw/israel-burns-down-kamal-adwan-hospital-kills-tortures-doctors-and-patients/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nIsrael has burned the Kamal Adwan Hospital in northern Gaza and has arrested, stripped naked and tortured the hospitals director of Dr Hussam Abu Safiyya along with 350 hospital staff and patients.\n\nAmbassador of the state of Palestine to Zimbabwe Dr Tamer Almassri has condemned Israels ongoing attacks.\n\nHe said the attacks killed at least five healthcare workers at the facility and destroyed ambulances.\n\nThe State of Palestine demands for the immediate release of the detained doctors and other health workers detained in Israeli prisons, he said.\n\nThis brutal act, violates the fundamental principles of international humanitarian law, constitutes a blatant assault on human rights and an unjustified attack on medical institutions providing essential humanitarian services to civilians.\n\nTargeting hospitals and other locations protected under international humanitarian law constitutes a war crime under the Geneva Conventions.\n\nThe Israeli occupations persistence in its crimes is largely due to the silence of the international community regarding the ethnic cleansing and massacres taking place therefore the international community must assume its legal and moral responsibilities, and to oblige the occupying state to immediately stop its ongoing aggression against Gaza, its ongoing violations of international law and international humanitarian law, stop its crimes against our people, and hold those responsible accountable.\n\nOver the past year, Israeli forces have detained more than 600 health workers from various specialties, and approximately 1060 health workers have been killed, some while being tortured in custody.\n\nHundreds more have been injured, representing a significant loss of skilled personnel and expertise and a blow to the health system as a whole.\n\nAmbassador Almassri has called on the international community and the UN Security Council to take decisive steps to end the violations which he said do not only constitute serious and blatant violations of international law and international humanitarian law, but also pose a serious threat to regional and international peace and security.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/b027999d-421e-4a6a-9a5d-a386167318b8-680x380.jpeg",
            "description": "Ivan Zhakata Herald Correspondent Israel has burned the Kamal Adwan Hospital in northern Gaza and has arrested, stripped naked and tortured the hospital’s director of Dr Hussam Abu Safiyya along with 350 hospital staff and patients. Ambassador of the state of Palestine to Zimbabwe Dr Tamer Almassri has condemned Israel’s ongoing attacks. He said the […]",
            "time": "20:25",
            "date": "30 Dec 2024"
        },
        {
            "title": "Thunderstorms bring significant rainfall",
            "url": "https://www.herald.co.zw/thunderstorms-brings-significant-rainfall/",
            "content": "Precious Manomano\n\nHerald Reporter\n\nVarious parts of the country, especially Chipinge received significant amounts of rainfall on Sunday.\n\nThe Meteorological Services Department (MSD) attributed the rainfall to thunderstorms that were fueled by moist and unstable conditions.\n\nThe highest rainfall amounts were recorded in Mutemwa in Chipinge (78mm), followed by Victoria Falls (63 mm), and Buwerudza, Chipinge at (46 mm).\n\nOther notable amounts included Mukandi (44 mm), Chipinge Meteorological office and Chisengu both at (36 mm), Masvingo at (32 mm), Makoholi at (31 mm), Chiredzi at (29 mm), and Belvedere Harare (25 mm).\n\nMost other areas experienced rainfall below 25 mm. In a statement the department said the weather on Monday morning transitioned to partly cloudy and mild conditions across much of the country, which later became cloudy and warm.\n\nNumerous thunderstorms developed, particularly in the provinces of Manicaland, Mashonaland East, and Mashonaland Central, where heavier rainfall was observed.\n\nLooking ahead, the moist and unstable conditions are expected to persist, maintaining a likelihood of thunderstorms throughout the country, it said.\n\nTomorrow, scattered thunderstorms are anticipated under partly cloudy and warm conditions. However, Masvingo province is expected to experience only isolated thundershowers.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/12/Thunderstorms.jpg",
            "description": "Various parts of the country, especially Chipinge received significant amounts of rainfall on Sunday.",
            "time": "20:25",
            "date": "30 Dec 2024"
        },
        {
            "title": "Jimmy Carter, longest-lived US president, dies aged 100",
            "url": "https://www.herald.co.zw/jimmy-carter-longest-lived-us-president-dies-aged-100/",
            "content": "Jimmy Carter, the 39th president of the United States, a broker of peace in the Middle East in his time, and a tireless advocate for global health and human rights, has died, it was announced on Sunday. He was 100 years old.\n\nMy father was a hero, not only to me but to everyone who believes in peace, human rights, and unselfish love, said Chip Carter, the former presidents son, in a statement.\n\nMy brothers, sister, and I shared him with the rest of the world through these common beliefs. The world is our family because of the way he brought people together, and we thank you for honoring his memory by continuing to live these shared beliefs.\n\nA Georgia Democrat, Carter was the longest-lived president in US history. He only served one term in the White House and was soundly beaten by Ronald Reagan in 1980.\n\nBut Carter spent the decades afterward focused on international relations and human rights, efforts that won him the Nobel peace prize in 2002.\n\nCarter had undergone a series of hospital stays before and his family said on February 18 last year that he had chosen to spend his remaining time at home, in hospice care and with loved ones.\n\nThe decision had the full support of his family and his medical team, a family statement said.\n\nPresident Joe Biden on Sunday declared January 9 a national day of mourning, calling on Americans to visit their places of worship to pay homage to the late US leader.\n\nCarters wife, Rosalynn Carter, died last November, two days after her own transition to hospice care.\n\nThe former first lady was 96. The pair married in 1946 and the former president attended her memorial service, traveling from the couples longtime home in Plains, Georgia, to the Glenn Memorial church in Atlanta.\n\nThe Carters eldest grandchild, Jason Carter, had said in a media interview in June this year that the former president was not awake every day but was experiencing the world as best he can as his days were coming to an end.\n\nCarter took office in 1977 as Jimmy Who?, a one-term Georgia governor and devout Christian whose unfamiliarity with Washington was seen as a virtue after the Watergate and Vietnam war years.\n\nHopes for the Carter presidency were dashed, however, by economic and foreign policy crises, starting with high unemployment and double-digit inflation and culminating in the Iran hostage crisis and the Soviet invasion of Afghanistan. A rolling energy crisis saw the price of oil triple from 1978 to 1980, leading to lines at US gas stations.\n\nSuch struggles belied early promise. In 1977, Carter completed a treaty that had eluded his predecessors to return control of the Panama canal to its host country.\n\nAt Camp David in 1978, Carter brought together the Israeli prime minister, Menachem Begin, and the Egyptian president, Anwar Sadat, for a deal that would produce peace that endures today.\n\nCarters fruitless attempts to halt the economic slide led Republicans to label him Jimmy Hoover, after the Depression-era president.\n\nBut as Carter prepared to run for re-election in 1980, it was the Iran hostage crisis that weighed most visibly on Americans minds, the TV anchor Ted Koppel devoting his broadcast five days a week to the plight of 52 Americans held in Tehran.\n\nA botched rescue attempt left eight US servicemen dead and fed doubts about Carters leadership.\n\nReagan, a former California governor, won 44 states. The hostages were released on 20 January 1981, hours after Carter left office, prompting speculation that Republicans had made a deal with Iran.\n\nBroadly unpopular then, Carter went on to become not just the longest-lived president but also to have one of the most distinguished post-presidential careers.\n\nHe was awarded the Nobel peace prize for decades of untiring effort for human rights and peacemaking. His humanitarian work was conducted under the Atlanta-based Carter Center, which he founded in the early 1980s, with Rosalynn.\n\nCarter traveled the world as a peace emissary, election observer and public health advocate. He made visits to North Korea in 1994 and Cuba in 2002.\n\nThe Carter Center is credited with helping to cure river blindness, trachoma and Guinea worm disease, which went from millions of cases in Africa and Asia in 1986 to a handful today.\n\nCarter was a critic of the 2003 invasion of Iraq, drone warfare, warrantless government surveillance and the prison at Guantnamo Bay.\n\nHe won admiration, and loathing, for his involvement in efforts for Middle East peace, urging a two-state solution in speeches and books including Palestine: Peace Not Apartheid.\n\nHe met Shimon Peres, then president of Israel, on a 2012 trip to Jerusalem, but top Israeli leaders generally shunned Carter after publication of the book. As recently as 2015, requests to meet the prime minister and president were rebuffed.\n\nCarter played a central role in promoting Habitat for Humanity, which provides housing for the needy, and was an alternative energy pioneer, installing solar panels on the White House. (Reagan removed them.)\n\nThe Carters had four children and 11 grandchildren, among them James Carter IV, credited with playing a pivotal role in the 2012 election when he unearthed a video of Mitt Romney casting aspersions on 47 percent of Americans.\n\nJames Earl Carter Jr grew up in Plains, Georgia, a town of fewer than 1 000 and about 150 miles south of Atlanta.\n\nA graduate of the US Naval Academy, he rose to the rank of lieutenant and worked on the nascent nuclear submarine program.\n\nAfter his fathers death in 1953, he took up peanut farming. He was elected to the Georgia senate then won the governorship in 1970, calling for the state to move beyond racial segregation.\n\nCarters blend of moral authority and folksy charisma produced moments of unusually frank national dialogue.\n\nIn a 1979 speech, he spoke semi-spontaneously for half an hour about a crisis of confidence  a fundamental threat to American democracy  nearly invisible in ordinary ways. Americans had fallen into a worship of self-indulgence and consumption, he said, only to learn that piling up material goods cannot fill the emptiness of lives which have no confidence or purpose.\n\nThe address struck a chord: Carters popularity surged 11 points. But after Reagan and others recast it as a self-indulgent exploration of personal malaise, the speech became a liability.\n\nJames Fallows, a former Carter speechwriter, wrote in 1979 that the president suffered from an inability to generate excitement but would surely outshine most other leaders in the judgment of the Lord.\n\nCarter outlived the two presidents who followed him, Reagan and George HW Bush.\n\nThere will be public observances in Atlanta and Washington DC, followed by a private interment in Plains, Georgia. Carters state funeral, including all public events and motorcade routes, is still pending.-The Guardian\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/jimmy-carter-680x380.jpg",
            "description": "  Jimmy Carter, the 39th president of the United States, a broker of peace in the Middle East in his time, and a tireless advocate for global health and human rights, has died, it was announced on Sunday. He was 100 years old. “My father was a hero, not only to me but to everyone […]",
            "time": "20:25",
            "date": "30 Dec 2024"
        }
    ]
}