{
    "news": [
        {
            "title": "President meets Odinga",
            "url": "https://www.herald.co.zw/president-meets-odinga/",
            "content": "Rumbidzayi Zinyuke, Senior Reporter\n\nPRESIDENT Mnangagwa yesterday met Kenyan opposition leader, Mr Raila Odinga, who was seeking Zimbabwes support for his candidature for the position of African Union Commission chairperson.\n\nMr Odinga is one of the three candidates in the race to succeed the incumbent, Mr Moussa Faki, who has held the position since 2017.\n\nOther candidates for the AU Commission chairperson are Djibouti Foreign Affairs Minister Tahtoud Ali Youssof and Somalias Fawzia Yusuf Adam.\n\nSpeaking after meeting President Mnangagwa at State House in Harare, Mr Odinga expressed hope that Zimbabwe and the rest of the SADC region would support his bid for the top AU post.\n\nI have come to announce (my candidature) and to also ask for support from Zimbabwe and SADC by extension.\n\nI am happy to have been received very well by the President, he said.\n\nPosting on his X handle later yesterday, Mr Odinga said: We landed in Harare, Zimbabwe today to a warm reception courtesy of H.E President Emmerson Mnangagwa @edmnangagwa\n\nIts been a pleasure sharing with the President my vision for Africa and discussing my candidature for the AUC Chairmanship.\n\nPresident Mnangagwa is presently the SADC Chairperson, and it was fitting that Mr Odinga would visit Harare, as he seeks support from the entire regional bloc.\n\nThe African Union (AU) unanimously agreed in March to grant the Eastern Africa region the right to nominate the next chairperson of the AU Commission.\n\nThis decision marks the culmination of institutional reforms launched in November 2018.\n\nThe AU Assembly aims to bolster transparency and meritocracy in the leadership selection process, prioritising equitable regional representation, gender parity, and recruitment of top talent from across the African continent.\n\nMr Odinga said he had been touring many countries in Africa to garner support for his candidature and after Zimbabwe, he will visit other Southern Africa countries.\n\nHe stressed that African countries are facing similar challenges that should be tackled collectively.\n\nWe have shared experiences with other nations, we know where we are coming from, where we want to go. But Africa will only be developed by Africans themselves. We must have a clear roadmap and blueprint on how to develop Africa.\n\nWe have 55 States in Africa, we are looking at how these countries can be integrated so that we benefit from the resources that we have in our continent, said Mr Odinga.\n\nHe added that the continent has a young population, which could drive transformation of the continent.\n\nThe new AU Commission chair will be elected by the AU Assembly via a secret ballot on February 25 at the 38th AU Summit set for Addis Ababa, Ethiopia.\n\nPast chairpersons of the AU Commission have come from the AUs western, central and southern regions, hence the AU Executive Councils intervention to assert the right of the East African region to produce the next chairperson while North Africa will fill the deputy chairpersons post.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/HE-1.jpg",
            "description": "Rumbidzayi Zinyuke, Senior Reporter PRESIDENT Mnangagwa yesterday met Kenyan opposition leader, Mr Raila Odinga, who was seeking Zimbabwe’s support for his candidature for the position of African Union Commission chairperson. Mr Odinga is one of the three candidates in the race to succeed the incumbent, Mr Moussa Faki, who has held the position since 2017. […]",
            "time": "06:31",
            "date": "14 Jan 2025"
        },
        {
            "title": "High expectations as new school term begins",
            "url": "https://www.herald.co.zw/high-expectations-as-new-school-term-begins/",
            "content": "Herald Reporters\n\nTHE 2025 school calendar for the Ministry of Primary and Secondary Education gets into full swing today, with Government yesterday saying top among their priorities is the employment of over 8 000 teachers and continuation with construction of new schools and expansion of existing ones.\n\nThis was said by Primary and Secondary Education Minister, Dr Torerayi Moyo, at a Meet the Media session in Harare, an initiative of the Ministry of Information, Publicity and Broadcasting Services to allow the media an opportunity to interact with Ministers on many topical issues.\n\nGiving an overview of the Ministrys operations, Dr Moyo said they have targeted to employ over 8 000 new teachers following the adoption of the Heritage-Based curriculum that is focused on producing goods and services useful to the economy, based on a countrys heritage or natural endowments.\n\nIt seeks to ensure that learners acquire skills, values and attitudes that are useful in life.\n\nI am happy the Heritage-Based curriculum will take effect from 2025 to 2030, the time when the vision of the President will be realised, Dr Moyo said. So, in terms of recruitment, we submitted our bids to recruit teachers. We are expecting to recruit not less than 8 000.\n\nThese are the teachers that we recruit under expansion recruitment. There is a difference between expansion and attrition posts.\n\nDr Moyo added that they have already started audits to determine the vacancies for the attrition posts while the recruitment for the expansion posts would require Treasury concurrence to fill them.\n\nUsually Treasury, after mobilising funds, they will tell us, now you can recruit in the first term, 3 000 or 4 000. Like last year, we recruited 3 000 in March.\n\nThats for the time when we got the Treasury concurrence. So, we expect 8 000 to be recruited, and that is very important, because we have already started decentralising the recruitment process, he said.\n\nThe ministry, which is the biggest in Zimbabwe, was allocated ZiG46 billion, the biggest vote in the 2025 national Budget.\n\nThe funds will be spent on overhead costs.\n\nWe are also going to utilise part of that money on the schools construction, which is very important. It is mandatory for us as a Ministry, as Government, to build new schools. We have a deficit. When I took over in 2020, we had a deficit of 3 000.\n\nI am able to announce that now we have a deficit of 2 600 schools. Last year, we managed to build a total of 104 schools. These are schools that were built by the Government and by our partners.\n\nWe have also built a number of classrooms, more than 300 000 classrooms that we built in both the rural and the urban areas. So, Im very happy with the progress that we are making as Government. I feel so grateful for the support that I received from the President, Dr Mnangagwa. He is the one who allowed us to introduce the Heritage-Based curriculum which we have aligned with the national strategic Vision 2030 and to realise Vision 2030, it is going to be done through the National Development Strategy 2, which takes effect from 2025 to 2030, Dr Moyo said.\n\nMeanwhile, it was a hive of activity in Harares central business district as parents and guardians with children attending boarding schools paid fees at banks while others were taking buses to school.\n\nOther parents flooded stationery and uniform shops to make last-ditch purchases of outstanding requirements.\n\nBuses from mission and boarding schools were also at their usual pick-up points, including the Robert Mugabe Square next to the Zimbabwe Agricultural Society and opposite the City of Harare Library, taking learners to school.\n\nSchool administrators were checking if learners had paid fees at banks, before allowing them to board buses.\n\nThose that had not paid fees or made payment plans were barred from getting onto buses.\n\nBack to School.. Inkanyezi Primary School learners speaks with their parents and or guardians as the 2025 Schools term kicks off today.- Picture: Edward Zvemisha\n\nHighfield resident, Ms Joyce Muraiwa expressed gratitude for the schools proactive measures to enhance security, especially paying fees at banks to avoid robberies.\n\nThese security protocols not only safeguard against potential threats, but also give us peace of mind that our children are in a secure learning environment, she said.\n\nA School Development Committee member from Oswards Mission, who spoke on condition of anonymity, said the school was accepting school fees paid in various currencies, with payments made at the bank before the schools opening day.\n\nAs you can see here, these are the proof of payments for our school fees, and parents are paying with the currency they have, she said.\n\nStudents are thrilled to return to school after the long holiday, and were relieved that we do not have any reports of death, serious illness, or marriages among our learners.\n\nIn Bulawayo, the CBD bustled with activity yesterday as parents, guardians, and learners thronged the citys streets and pick-up points in a last-minute dash to prepare for the 2025 school calendar.\n\nThe annual back-to-school rush injected life into the citys economy, with businesses and vendors cashing in on the surge in demand for school supplies and services. Many parents, burdened with bulging shopping bags, jostled through the crowded streets to grab the last items on their checklists.\n\nShops selling stationery, uniforms, and school bags were packed to capacity, while vendors along the pavements displayed essential school items, hoping to attract hurried buyers.\n\nThe City Hall area was a hive of activity as buses lined up to ferry learners to boarding schools across the region. Long queues formed, with some buses already filled, forcing parents to wait for additional transport.\n\nSimilarly, the OK Mart parking lot in Raylton saw a flurry of farewells as parents loaded school trunks and groceries onto buses and trucks destined for boarding schools.\n\nThe scramble for transport saw some boarding schools outsourcing buses from local institutions such as Amhlophe High School in Pumula East, Townsend High School in Ilanda, and Mpumelelo Primary School in Mpopoma.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/02/Cde-Torerayi-Moyo.jpg",
            "description": "Herald Reporters THE 2025 school calendar for the Ministry of Primary and Secondary Education gets into full swing today, with Government yesterday saying top among their priorities is the employment of over 8 000 teachers and continuation with construction of new schools and expansion of existing ones. This was said by Primary and Secondary Education […]",
            "time": "06:31",
            "date": "14 Jan 2025"
        },
        {
            "title": "Internet initiative to bridge rural-urban divide",
            "url": "https://www.herald.co.zw/internet-initiative-to-bridge-rural-urban-divide/",
            "content": "Remember Deketeke, Herald Correspondent\n\nTHE e-learning initiative being introduced by Government with the heritage-based curriculum is being formalised with network providers licensed and the telecommunications infrastructure expanded so that the rural-urban divide is bridged.\n\nSpeaking during a Cabinet Ministers-Media Meeting event in Harare yesterday where he was joined by Primary and Secondary Education Minister Torerayi Moyo, Information, Publicity, and Broadcasting Services Minister Dr Jenfan Muswere said the Second Republic was dedicated to ensuring internet connectivity for every school across the nation.\n\nThe licensing framework approved by President Mnangagwa facilitates the involvement of all players, which is vital for both expansion and investment in telecommunications.\n\nDr Muswere highlighted the approval of the Starlink licensing policy, which is part of the broader strategy to support the e-learning initiative as it helps ensure that even very remote schools can have an affordable broadband connection.\n\nThe Government of Zimbabwe has sanctioned the licensing framework for Starlink, along with other providers, which will enhance e-learning in our schools.\n\nDr Muswere said private sector operators were empowered through this framework, referencing the notable infrastructure project by BCS, which is extending a fibre line from Beitbridge to Victoria Falls and another one to Manicaland.\n\nA significant aspect of this initiative is that as private companies develop fibre infrastructure, all schools along their routes will receive free internet connectivity.\n\nThis will ensure that educational institutions from Victoria Falls to Manicaland, and all schools within that zone, are connected and can access online resources, Dr Muswere said.\n\nTo bolster the national e-learning strategy, a core component of the Presidential e-learning mandate, the Government was focusing on the establishment of the Zimbabwe Information Technology Company (Zitco).\n\nThis company will be pivotal in producing computers and other ICT devices, further enhancing the educational value chain at affordable costs.\n\nDr Muswere said 1 500 schools per year will be connected under the national e-learning strategy, expressing confidence in the progress made thus far and the potential for future expansion through community information centres.\n\nMinister Moyo outlined the Ministrys initiatives aimed at promoting internet connectivity in rural areas.\n\nWe have introduced Internet in a Box solutions, which enable school authorities to use routers connected to satellites. This allows students within a 100 to 200-metre radius to access online notes and assignments, facilitating online assessments and submissions, he said.\n\nThe Ministry is further investing in teacher training, with in-service training on robotics being conducted virtually by professors from a Russian university. Over 200 teachers have already received certifications, and scholarships have been awarded to those specialising in science, technology, engineering, and mathematics.\n\nAdditionally, universities like Bindura and Midlands State University are providing training in computer programming and robotics, equipping teachers to effectively impart coding skills to their students.\n\nMinister Moyo announced that the Ministry had secured channels for broadcasting radio and television lessons, ensuring that students in rural areas can access educational resources.\n\nWhile there are challenges in delivering content to visually-impaired students, audio resources will ensure that these learners also benefit from inclusive education.\n\nThis comprehensive approach not only aims to enhance connectivity but also fosters an inclusive and innovative educational environment across Zimbabwe, paving the way for a brighter future for all students.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Muswere-1.jpg",
            "description": "Remember Deketeke, Herald Correspondent THE e-learning initiative being introduced by Government with the heritage-based curriculum is being formalised with network providers licensed and the telecommunications infrastructure expanded so that the rural-urban divide is bridged. Speaking during a “Cabinet Ministers-Media Meeting” event in Harare yesterday where he was joined by Primary and Secondary Education Minister Torerayi […]",
            "time": "06:31",
            "date": "14 Jan 2025"
        },
        {
            "title": "2025 Legal Year opens",
            "url": "https://www.herald.co.zw/2025-legal-year-opens/",
            "content": "Herald Reporters\n\nCHIEF Justice Luke Malaba has called for enhanced collaboration among stakeholders in the justice delivery system, emphasising that the judiciary alone cannot build public confidence without the support of the entire criminal justice value chain.\n\nSpeaking at the historic official opening of the 2025 legal year in Bulawayo yesterday, Chief Justice Malaba highlighted the establishment of the National Council on Administration of the Criminal Justice System as a critical step towards expediting criminal trials and fostering co-operation.\n\nFor the first time, the opening ceremony was held outside Harare, marking a significant shift in the judiciarys approach to inclusivity and decentralisation. This aligns with the Governments National Development Strategy 1 (NDS1) and the Second Republics commitment to devolution.\n\nThe event, held under the theme: Building Public Confidence in the Judiciary through Multi-Stakeholder Participation, began with the inspection of the quarter guard, followed by Chief Justice Malaba addressing members of the bench, service chiefs, and other key stakeholders.\n\nChief Justice Malaba said an effective justice system requires the seamless co-operation of various stakeholders, including the police, prosecutors, witnesses, and correctional services.\n\nWhile the judiciary plays a central role in the administration of justice, it must be acknowledged that there are various other stakeholders who play critical roles in the proper functioning of the justice delivery system, he said.\n\nA breakdown in any part of this chain, whether its a failure to arrest suspects, lapses in prosecution, or the absence of witnesses, can derail the entire process and erode public confidence in the judiciary.\n\nDeputy Chief Justice Elizabeth Gwaunza delivers her remarks at the opening of the 2025 Legal Year in Harare yesterday.  Picture: Kudakwashe Hunda\n\nThe newly established council, chaired by Judge President Justice Mary Zimba-Dube and including Prosecutor-General Justice Loice Matanda-Moyo, aims to address these gaps by expediting criminal trials in both magistrates and high courts.\n\nChief Justice Malaba also called for the revitalisation of community service and pre-trial diversion committees, emphasising their importance in reducing case backlogs and improving access to justice.\n\nThe Chief Justice reaffirmed the judiciarys commitment to accountability, noting that the performance of courts and judicial officers is closely monitored through the JSC performance management system.\n\nAchieving this goal requires a shared commitment to fulfilling our constitutional obligations that underpin the administration of justice. The active participation and collaboration of the judiciary and its stakeholders is essential, as without this collective effort, fostering public trust in the judiciary will remain unattainable, he said.\n\nThe judiciary must remain exemplary, not only in its professional duties but also in the personal conduct of its officers. Judicial misconduct, if left unchecked, can undermine the public trust that is foundational to our justice system.\n\nChief Justice Malaba said public confidence in the judiciary hinges on its efficiency, impartiality, and adherence to constitutional principles.\n\nThis means that the judiciarys overall performance is subject to the evaluation of the people of Zimbabwe. As a judiciary, we acknowledge that we cannot build public confidence and trust in isolation.\n\nAchieving the delivery of quality justice is possible only through collaboration and partnership with all stakeholders within the justice sector, said Chief Justice Malaba.\n\nHe said the conduct and manner in which each public institution carries out its mandate directly influences the level of confidence in the public sphere.\n\nThe principle of public confidence is, therefore, a broad constitutional principle that governs the actions and conduct of all public officials, including judges, magistrates, and other individuals presiding over courts established under Zimbabwean law, said Chief Justice Malaba.\n\nThe public confidence in the judiciary is reflected in the publics belief in the efficiency, fairness, and impartiality of the courts, in adherence to the rule of law, and in the protection of human rights and freedoms.\n\nThe Chief Justice said the JSC will continue to implement policies and measures that safeguard judicial independence in decision-making while ensuring accountability to the public for its rulings.\n\nHe said the measures include the rigorous monitoring of court and judicial officer performance through the JSCs performance management system.\n\nChief Justice Malaba said while it is impossible to entirely prevent misconduct, given human fallibility, the JSC has established mechanisms to ensure that its errant members are held to account.\n\nHe said judiciary officers must be exemplary in both their professional and private lives.\n\nIt is for that reason that the commission has taken a firm stance against corruption and judicial misconduct. If it is not nipped in the bud, judicial misconduct has the potential to undermine the very fabric upon which the public trust that exists between the judiciary and the citizens is created, said Chief Justice Malaba.\n\nHe expressed satisfaction with the judiciarys integrity, noting that no misconduct charges were brought against judges in the previous year.\n\nChief Justice Malaba concluded by reiterating the judiciarys dedication to safeguarding judicial independence while fostering partnerships to deliver quality justice.\n\nThe active participation and collaboration of all stakeholders in the justice sector are indispensable for building public trust and ensuring the effective delivery of justice, he said.\n\nOfficially opening the 2025 legal year in Harare, Deputy Chief Justice Elizabeth Gwaunza said the judiciarys zero-tolerance approach to corruption is not merely a policyit is a moral imperative and a cornerstone for the effective delivery of justice.\n\nShe said corruption not only undermines the rule of law but also erodes public confidence, which is vital to the legitimacy of the judiciary.\n\nIn Chinhoyi, Deputy Judge President Justice Garainesu Mawadze officially opened the 2025 Legal Year at the Chinhoyi Courts, emphasising the paramount significance of collaborative engagement with stakeholders and lauding the notable milestones achieved in advancing the administration of justice.\n\nJustice Mawadze said the Judicial Services Commissions designation of Banket as a resident court for Mashonaland West province on January 2 marked a pivotal development aimed at fortifying the dispensation of justice in the region.\n\nReflecting on this transformation, he said: Formerly operating as a circuit court, Bankets intermittent nature meant that court proceedings were sporadic. However, this transition to a resident court heralds a new era where legal matters will be addressed daily, ensuring a consistent and expeditious resolution of cases.\n\nThis strategic shift, Justice Mawadze said, is poised to diminish delays in case adjudication and alleviate the burden on Chinhoyi.\n\nIt signifies a significant stride towards enhanced convenience for litigants, legal practitioners, and all seekers of justice, guaranteeing that the machinery of justice operates with heightened celerity and dependability, he said.\n\nCommending the High Court, particularly the Chinhoyi High Court, for their outstanding performance in 2024, Justice Mawadze celebrated their remarkable 98 percent case clearance rate.\n\nThis accomplishment is truly remarkable, given the mounting caseload and the intricate nature of the cases presented before them, Justice Mawadze said.\n\nHe extolled the dedication and efficiency of the High Court Judges in case management. Notably, the High Court effectively resolved 151 out of 154 civil cases, all 115 cases within the family division, and an impressive 1564 out of 1567 cases in the criminal division. Furthermore, the Chief Magistrates Department Criminal Division successfully concluded 299 cases out of 335 cases.\n\nAcross the provincial courts, a 95.6 percent clearance rate was achieved with 1481 cases resolved out of 1549, while the Anti-Corruption Courts handled 54 cases, finalising 25 of them. Justice Mawadzes address underscored a narrative of commitment, efficiency, and a resolute dedication to upholding the pillars of justice in the region.\n\nIn Mutare, another Constitutional Court Judge Justice Ben Hlatshwayo implored social media content creators, known as the Fifth Estate, to refrain from unwarranted character assassination, misinformation, and disinformation when utilising communication platforms.\n\nThis message was conveyed during his address at the official opening of the legal year 2025 at Mutare High Court.\n\nJustice Hlatshwayo underscored the importance of ethical communication.\n\nI urge the Fifth Estate to exercise caution in disseminating information. It is crucial to avoid engaging in character assassination, spreading misinformation, and fostering polarisation. By utilising social media responsibly, users can contribute significantly to developmental issues and facilitate constructive public discourse.\n\nTraditionally, the professional media industry has been recognised as the Fourth Estate, while the Fifth Estate refers to socio-cultural groups with diverse perspectives in contemporary society.\n\nThis term commonly encompasses bloggers, journalists operating in non-mainstream media platforms, and individuals with a significant presence on social media platforms.\n\nThe overarching theme for this years official opening of the legal year is centered around Building public confidence in the Judiciary through stakeholder participation.\n\nIn Masvingo, Constitutional Court Judge Justice Anne-Marie Gowora inaugurated the 2025 Legal Year at the Masvingo High Court, calling for an additional judge to alleviate the workload on the current bench members.\n\nJustice Gowora lauded the exceptional work ethic of Justices Sunsley Zisengwe and Helena Charewa, highlighting their remarkable achievements in case resolutions.\n\nIn 2024, the two judges successfully concluded over 1700 criminal cases and 810 civil cases, boasting a commendable case clearance rate of 94 percent for criminal cases and 89 percent for civil cases.\n\nDespite the substantial caseload of 1909 criminal cases filed at the Masvingo High Court last year, with 32 cases carried over from 2023, only 118 cases remained pending, carried over to the current year.\n\nMoreover, the civil division of the Masvingo High Court, which began with 20 cases from the previous year, handled 893 additional cases.\n\nOf these, 103 civil cases were left unresolved and carried over to the current year.\n\nJustice Gowora praised Justices Zisengwe and Charewa for their dedication and resilience in efficiently resolving a significant number of cases in 2024.\n\nWhile acknowledging the outstanding performance of the two judges, Justice Gowora stressed the critical need for increased judicial capacity at the Masvingo High Court.\n\nShe said that the addition of another judge would enhance the justice delivery system, especially considering the broad jurisdiction served by the court, extending beyond Masvingo province to parts of Matabeleland South and the Midlands province.\n\nJustice Gowora underscored the importance of sustainable and effective service delivery.\n\nWhile the stellar performance of the two judges last year is commendable, it is crucial to recognise the challenges posed by the current workload.\n\nTo ensure sustainable and effective service delivery, it is imperative that at least one more judge be posted to their station. This would help alleviate the pressure on the existing judicial officers and prevent the risk of overburdening them, said Justice Gowora.\n\nThe ceremony was attended by various dignitaries, including the Minister of State for Masvingo Provincial Affairs and Devolution, Ezra Chadzamira, the permanent secretary in his office, Dr Addmore Pazvakavambwa, service chiefs, members of the legal community, and traditional leaders.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Malaba.jpg",
            "description": "Herald Reporters CHIEF Justice Luke Malaba has called for enhanced collaboration among stakeholders in the justice delivery system, emphasising that the judiciary alone cannot build public confidence without the support of the entire criminal justice value chain. Speaking at the historic official opening of the 2025 legal year in Bulawayo yesterday, Chief Justice Malaba highlighted […]",
            "time": "06:31",
            "date": "14 Jan 2025"
        },
        {
            "title": "Maize planting no longer feasible: Ministry",
            "url": "https://www.herald.co.zw/maize-planting-no-longer-feasible-ministry/",
            "content": "Precious Manomano, Herald Reporter\n\nAs the rains fall across Zimbabwe, heralding a promising cropping season, the maize planting window has been closed by Government since any additional planting will not yield anything.\n\nFarmers can still plant some other crops, in particular short-season varieties of traditional grains, beans, sweet potatoes and sunflowers.\n\nAbout 1 750 407 hectares of maize were planted, representing an impressive 97 percent of this seasons target.\n\nWith this achievement, the focus now turns to the shorter season alternative crops.\n\nThe national target for production of all summer cereals is over 3,2 million tonnes, almost four-and-a-half times the 744 271 tonnes harvested after the devastating drought last season.\n\nPermanent Secretary for Lands, Agriculture, Fisheries, Water and Rural Development Professor Obert Jiri said it was important to follow the best agricultural practices.\n\nFarmers should apply top dressing fertiliser to early planted crops, using split applications to mitigate the effects of excess rainfall, which can lead to leaching, he advised.\n\nThe guidance is particularly relevant given the recent rains that have replenished soil moisture across most of the provinces.\n\nFurther, Prof Jiri underscored the necessity of pest management, urging farmers to remain vigilant against threats like the fall armyworm and African armyworm, two of the major pests that can hit maize.\n\nScouting for pests and implementing control measures should be a priority, he insisted, encouraging farmers to report any infestations to local Agritex officers or the migratory pests department.\n\nHe also challenged farmers to declare war on weeds to reduce competition for nutrients with their crops.\n\nWhile the maize planting period has concluded, farmers still have the opportunity to plant crops such as sunflowers and sugar beans, which can thrive under the current moist conditions.\n\nThe advice also extends to irrigation schemes that have yet to plant, emphasising the need to focus on short-season varieties that can be harvested by April, allowing for timely wheat planting thereafter.\n\nPresident of the Zimbabwe Commercial Farmers Union Dr Shadreck Makombe said if farmers plant maize late, some varieties may not mature in time due to potential rainfall shortages in March.\n\nFarmers should stop planting, as failure to do so may lead to losses; time is no longer on our side, he warned.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/04/Professor-Obert-Jiri.jpg",
            "description": "Precious Manomano, Herald Reporter As the rains fall across Zimbabwe, heralding a promising cropping season, the maize planting window has been closed by Government since any additional planting will not yield anything. Farmers can still plant some other crops, in particular short-season varieties of traditional grains, beans, sweet potatoes and sunflowers. About 1 750 407 […]",
            "time": "06:31",
            "date": "14 Jan 2025"
        },
        {
            "title": "Zanu PF Harare prepares for legal engagements",
            "url": "https://www.herald.co.zw/zanu-pf-harare-prepares-for-legal-engagements/",
            "content": "Joseph Madzimure, Senior Reporter\n\nZANU PF Harare province is mobilising structures in anticipation of any legal processes related to the proposed extension of President Mnangagwas term beyond 2028.\n\nThis initiative aligns with the resolution adopted at the 21st ZANU PF National Peoples Conference.\n\nTo facilitate this, the provincial leadership has launched an outreach programme aimed at educating party members, including the commissariat department, on the importance of the agenda.\n\nRecent engagements have already taken place in areas such as Zone 5, Epworth, Chitungwiza Zone 1, and Glen View Zone 2, focusing on promoting the extension of President Mnangagwas term to support Vision 2030.\n\nAt a provincial meeting held at Glen View Community Hall, Harare at the weekend, ZANU PF provincial chairman Cde Godwills Masimirembwa said there is need for political commissars to inform the public about the achievements of President Mnangagwa.\n\nThe aim of this meeting is to equip our political commissars to spread the message about the resolution for the Presidents term extension. They must be well-versed with the significant progress made under his leadership and promote Vision 2030, Cde Masimirembwa said.\n\nHe underscored the essential role of the commissariat department in membership recruitment, retention, and the dissemination of party ideology.\n\nWe aim to strengthen the commissariat at all levels, from province to branch and cell, with the goal of doubling our membership in Harare.\n\nZANU PF Council of Elders member Cde Idah Mashonganyika also urged party members to maintain loyalty to the party and its leadership.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Cde-Masimirembwa-680x380.jpg",
            "description": "Joseph Madzimure, Senior Reporter ZANU PF Harare province is mobilising structures in anticipation of any legal processes related to the proposed extension of President Mnangagwa’s term beyond 2028. This initiative aligns with the resolution adopted at the 21st ZANU PF National People’s Conference. To facilitate this, the provincial leadership has launched an outreach programme aimed […]",
            "time": "06:31",
            "date": "14 Jan 2025"
        },
        {
            "title": "EDITORIAL COMMENT: Stakeholders must make schools opening flawless",
            "url": "https://www.herald.co.zw/editorial-comment-stakeholders-must-make-schools-opening-flawless/",
            "content": "SCHOOLS open today for the first term, and around a quarter of the entire population of Zimbabwe, more than 3,6 million schoolchildren of the 15 million citizens, are expected to trek down the road and start their lessons promptly, after their initial assembly.\n\nFor some, there is the jump from primary school to secondary school and for a significant group of very young children, there is their first day of what will be the rest of their childhood as they progress up the ladder of the primary grades and go on to secondary school. They at least will be very excited, if a little nervous, at this new turn in their lives.\n\nWe sometimes forget what amounts to the largest movement of people in the country and the major combined efforts that are needed from parents, teachers, heads and administrators to bring it off each year.\n\nBut all reports say every school and every teacher is ready, and most of the children have been prepared by their parents and sent on their way, correctly dressed and carrying their pencils or pens and any other required stationery.\n\nThe Ministry of Primary and Secondary Education has made it clear what all schools, public and private, must do and are allowed to do and what they are not allowed to do.\n\nFor example, parents can buy uniforms from whoever they like, or even make them themselves at home, so long as they meet the standards set by the school, so the efforts that were creeping in at some schools on making a large profit on monopolising uniform sales have been shot down.\n\nUntil a few decades ago almost all school dresses and blouses and skirts for girls were made at home or by a local family dressmaker, this being easy since the fabric was woven and dyed in Zimbabwe and rolls were sent to both the factories and the local fabric shops, so every dress was made from the same fabric and meeting standards was easy.\n\nThe range for boys uniforms was far more limited, two colours of trousers and four colours of shirts, so parents could shop around as almost every manufacturer made identical products.\n\nEven jerseys came in a very limited range of colours with no neckband colour stripes. Just blazers and ties varied. We need to get back to those simpler days. The police have, yet again, urged those transporting children to follow road rules. This imposes some responsibilities on parents, who ought to take a serious interest in how their children go to school.\n\nMany going to the local school will be walking there and often safety will be considerably improved if they are accompanied by an adult or older child. It should be possible for neighbours to take turns on the school runs and school walks to boost safety and make things easier. School fees and their payment will arise. We hope that most schools are now insisting on parents depositing cash payments at the schools bank or better still making electronic payments into the schools bank account, with the required information in the right field included.\n\nBut even mobile money payments, so long as the parents or child bring the proof of payment and the transaction details, should be receipted.\n\nThe police have warned schools not to keep large sums of cash on their premises, since this will make them a target for robberies.\n\nRegrettably, robbery gangs do now keep their ears open about piles of cash building up in a school safe, and are willing to suborn school staff to get details. If payments have been made electronically there is obviously no danger, but even when schools are willing to accept cash and parents have wanted to pay cash the schools must make sure that the cash is moved promptly to their bank.\n\nIf there is a flood of payers coming with cash today then that might need more than one trip to the bank before closing time. Some schools have now banned cash payments and insist that parents make the deposits at the bank, or make online or mobile payments, and then produce proof of payment for the records.\n\nRobbers do not want a pile of paper slips showing payments have been made and the school will not be a target. Even rural primary schools could switch to mobile money for most fee payments if other options were not available. There is the ruling that public schools cannot turn away a child for non-payment of fees, although this generally means tuition fees since a boarding school must have the money to buy the food for the hostels.\n\nIn many cases this may also require investigations to find out if the family can pay, but is simply being difficult or if the family genuinely cannot pay.\n\nThe BEAM programme has now been expanded so it covers around a third of the schoolchildren, and this term might have to do even more since the drought last year means a lot of farming families might not have had anything to sell to raise school fees.\n\nThe schools would be far more eager to accept BEAM money if the payments were made promptly by the Government.\n\nSchool heads are normally eager to hear from parents who might have payment problems so they can, if possible, work out payment plans or know exactly when an employer will be forwarding the money, or know they have a good applicant for BEAM funds. But the head can only help when they know what the problems are.\n\nWhat drives them to despair are those parents who simply send their children when fees have not been paid, rather than coming in themselves to explain.\n\nThe Government policy does not excuse parents refusing to accept responsibility and behaving properly.\n\nBut most parents do accept their responsibilities and do behave properly and so support their children and their childrens schools. In return the schools need to treat this large group of parents fairly and seek their co-operation and assistance to make their childrens schooling even better and more effective.\n\nRaising a child is not something that can be left to parents or left to schools. Both have to be heavily involved and the child will have a better time at school and a more effective education when both parents and school are working together.\n\nSo we hope all the children who went off this morning for their first day of the new year have a wonderful and rewarding year.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Back-to-school.jpg",
            "description": "SCHOOLS open today for the first term, and around a quarter of the entire population of Zimbabwe, more than 3,6 million schoolchildren of the 15 million citizens, are expected to trek down the road and start their lessons promptly, after their initial assembly. For some, there is the jump from primary school to secondary school […]",
            "time": "06:31",
            "date": "14 Jan 2025"
        },
        {
            "title": "ZWMB loans soar to ZiG205,5 million in 2024",
            "url": "https://www.herald.co.zw/zwmb-loans-soar-to-zig2055-million-in-2024/",
            "content": "Oliver Kazunga\n\nSenior Business Reporter\n\nTHE Zimbabwe Womens Microfinance Bank (ZWMB) significantly increased loan disbursements in 2024, reaching ZiG205,5 million, a 759 percent surge from ZiG23,9 million in 2023.\n\nEstablished in 2018, the ZWMB is a deposit-taking microfinance institution dedicated to providing women with access to affordable and innovative financial solutions.\n\nResponding to questions from this publication, ZWMB chief executive Dr Mandas Marikanda attributed both the number of beneficiaries and loans to increased appetite for economic empowerment initiatives.\n\nThe 4 083 loans disbursed in 2024 benefitted 4 135 clients split as 3 498 being females and 637 males, revaled Dr Marikanda.\n\nThe increase in the number of beneficiaries accessing loans from the bank can be attributed to collaborations and partnerships with Non-Governmental Organisations and various Government ministries.\n\nThis resulted in both new products and market development.\n\nLack of access to capital is one of the major barriers facing women entrepreneurs in Zimbabwe, especially in marginalised areas. They often lack the security to borrow while some cultural values do not allow women to venture into businesses.\n\nIn 2024, Dr Marikanda said the bank funded agricultural value chains in poultry, maize, sugar bean and sugar cane production.\n\nThe bank also funded Small-to Medium Enterprises in manufacturing, mining, trade and services.\n\nA total of 5 773 jobs were created and sustained as a result of the loans disbursed by ZWMB last year, said Dr Marikanda.\n\nSince its inception, close to 120 000 clients with women constituting 72,7 percent have benefited from ZWMB loans  and this year, the bank targets to support at least 10 000 projects across the country.\n\nLast year, Finance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube said the Government was working on a guarantee for loans secured from the womens bank to improve access to capital for women entrepreneurs.\n\nIn the 2025 Budget, the Treasury made a provision of ZiG1,02 billion for the Ministry of Women Affairs, Community, Small and Medium Enterprises.\n\nThe support includes capitalisation of Zimbabwe Women Micro Finance Bank to the tune of ZiG130 million, EmpowerBank ZiG77,4 million; Small and Medium Enterprises Development Corporation ZiG130 million and the National Venture Capital Company of Zimbabwe ZiG108 million.\n\nDr Marikanda said ZWMB envisages continued support of value chains in various economic sectors including agriculture.\n\nWe are looking forward to continued support of agricultural value chains, supporting mechanisation of productive sectors through asset financing and liquidity support for SMEs operating in various sectors.\n\nWe look forward to having an impactful presence in every ward and every district throughout the countrys 10 provinces, she said.\n\nA joint report by the Portfolio Committees on Women Affairs, Community, Small and Medium Enterprises Development and Thematic Committee on Gender and Development noted that several beneficiaries confirmed ZWMB loans boosted their businesses such as cross-border trading, chicken production, sawing and farming.\n\nThe report, published in 2022 assessed the impact of the bank in empowering women since its inception.\n\nThe committee confirmed with those who managed to access the loans from ZWMB and noted that the loans were useful and of much importance in supporting their projects and small businesses, said the report.\n\nMembers of the public who received the loans confirmed that they received US$150 vendor loans which were payable on a weekly basis. Submissions from other beneficiaries were that women started grinding mill projects as groups which empowered them financially as well as saving the distance they used to travel to get the service.\n\nThe committee also noted beneficiaries did not face challenges in repaying the loans.\n\nHowever, a disturbing concern was the period of loan repayment. The beneficiaries reported that the bank required 30 days to repay.\n\nThe committee noted from the submissions the period was too short for projects such as poultry and farming.\n\nHowever, some of the beneficiaries acknowledged the loan repayment system was flexible since the bank can negotiate and agree with clients on payment timeframe.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/qdq3d-680x380.jpg",
            "description": "Oliver Kazunga Senior Business Reporter THE Zimbabwe Women’s Microfinance Bank (ZWMB) significantly increased loan disbursements in 2024, reaching ZiG205,5 million, a 759 percent surge from ZiG23,9 million in 2023. Established in 2018, the ZWMB is a deposit-taking microfinance institution dedicated to providing women with access to affordable and innovative financial solutions. Responding to questions from […]",
            "time": "06:31",
            "date": "14 Jan 2025"
        },
        {
            "title": "Emergency food distribution to continue until March",
            "url": "https://www.herald.co.zw/emergency-food-distribution-to-continue-until-march/",
            "content": "Leonard Ncube, Victoria Falls Bureau\n\nThe rains being experienced across the country have sparked optimism for a successful farming season, with the hope that the food distribution under the drought mitigation programme will continue until March, when the first harvests come in to support vulnerable communities.\n\nThe programme, launched last year in response to the El Nio-induced drought, transitioned from a cash-based to a voucher-based food distribution system in rural areas. This system is designed to ease the burden on affected families. Beneficiaries now receive a three-month grain allocation in a single delivery.\n\nEach person is entitled to 7,5kg of grain per month, amounting to 22,5kg over three months. For a family of five, this translates to 112,5kg of grain for the same period.\n\nPresident Mnangagwa declared the El Nio-induced drought a national disaster so that the Government could legally take emergency action and switch funds from other accounts to pay for the extra food. The drought left over 520 000 people food-insecure in 167 wards across the seven districts of Matabeleland North.\n\nThis represents more than 65 percent of the provinces population in need of food aid, following poor or no harvests due to adverse weather conditions. According to the 2022 census, Matabeleland North has a population of 749 017 across 160 912 households. The districts most affected by food insecurity include Binga with 136 210 food-insecure persons requiring 1 021,57 tonnes of grain monthly, Hwange with 50 899 persons needing 381,7 tonnes, and Lupane with 68 210 persons needing 511,57 tonnes. Tsholotsho has 69 283 persons requiring 519,62 tonnes, while Bubi has 48 497 persons needing 364 tonnes. Umguza has 82 004 persons requiring 615 tonnes.\n\nMatabeleland North Provincial Affairs and Devolution Minister Richard Moyo, confirmed that food distribution was continuing across all districts. He also highlighted the importance of taking advantage of the rains to boost food supplies in a few months.\n\nWe are waiting for reports on the crop situation in the province, but some farmers are still planting while others need top-dressing fertiliser, which has already been delivered. For those who planted early, their crops are nearing the flowering stage, he said.\n\nMinister Moyo said food aid would continue until March, after which the Government would assess the harvest to determine if further assistance is needed. In normal years there are still people who need food aid, often the elderly and child-headed households among other vulnerable groups, but the majority usually manage to grow their own food with something left over for sale.\n\nHe urged farmers to make full use of the inputs distributed by the Government, warning against selling or diverting them.\n\nPeople are receiving inputs, and we expect everyone to plant and take care of their crops. Lets desist from selling inputs because this could lead to poor harvests, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/07/0i0-11.jpg",
            "description": "Leonard Ncube, Victoria Falls Bureau The rains being experienced across the country have sparked optimism for a successful farming season, with the hope that the food distribution under the drought mitigation programme will continue until March, when the first harvests come in to support vulnerable communities. The programme, launched last year in response to the […]",
            "time": "06:31",
            "date": "14 Jan 2025"
        },
        {
            "title": "98pc conviction rate for Midlands murder cases",
            "url": "https://www.herald.co.zw/98pc-conviction-rate-for-midlands-murder-cases/",
            "content": "Bulawayo Bureau\n\nPROSECUTOR-General, Justice Loice Matanda-Moyo, says the National Prosecuting Authority (NPA) recorded an impressive 98 percent conviction rate for murder cases in the Midlands last year.\n\nSpeaking at the official opening of the 2025 Legal Year here yesterday, Justice Matanda-Moyo highlighted how streamlining services among many stakeholders can result in a flawless justice system.\n\nShe said the criminal justice system relies on multiple players, including complainants, police investigators, the Special Anti-Corruption Group (SAG), prosecutors, magistrates, judges and the prison service.\n\nAll these stakeholders need to collaborate to ensure the system is effective. If we fail to work together, the justice system becomes inefficient, jeopardising public safety.\n\nCollaboration is essential to safeguard our citizens, Justice Matanda-Moyo said.\n\nShe attributed the Midlands High Court circuits 98 percent conviction rate in murder cases in 2024 to robust teamwork among stakeholders.\n\nEffective collaboration ensures cases are thoroughly investigated, evidence is properly gathered, and witnesses are protected, resulting in watertight dockets and high conviction rates, said Justice Matanda-Moyo.\n\nHer sentiments follow Chief Justice Luke Malabas concern over the increasing number of murder cases in Midlands Province, and calling for swift measures to address delays in justice delivery.\n\nChief Justice Malaba urged the resuscitation of fast-track courts across the country to expedite the handling of serious criminal cases, including murders.\n\nAttorney-General Mrs Virginia Mabiza echoed Justice Matanda-Moyos sentiments, advocating for a multi-stakeholder approach to justice delivery.\n\nShe highlighted the potential for innovation through shared resources, knowledge and expertise.\n\nMrs Mabiza said collaboration between entities like the NPA, Zimbabwe Anti-Corruption Commission, and the courts can lead to significant improvements in justice delivery.\n\nBy working together as different sectors, we can share resources, knowledge, and expertise, leading to innovation and improvement in the sector.\n\nThis collaborative approach can also facilitate the effective utilisation of modern technology, such as the integrated electronic case management system (IECMS), she said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/08/Justice-Matanda-Moyo.jpg",
            "description": "Bulawayo Bureau PROSECUTOR-General, Justice Loice Matanda-Moyo, says the National Prosecuting Authority (NPA) recorded an impressive 98 percent conviction rate for murder cases in the Midlands last year. Speaking at the official opening of the 2025 Legal Year here yesterday, Justice Matanda-Moyo highlighted how streamlining services among many stakeholders can result in a flawless justice system. […]",
            "time": "06:31",
            "date": "14 Jan 2025"
        }
    ]
}