{
    "news": [
        {
            "title": "National hero Cde Mphoko’s body arrives in Harare",
            "url": "https://www.herald.co.zw/national-hero-cde-mphokos-body-arrives-in-harare/",
            "content": "Joseph Madzimure\n\nZimpapers Politics Hub\n\nThe body of the former Vice President Phelekezela Mphoko who died in India on Friday last week has arrived at the Robert Gabriel Mugabe International Airport.\n\nMore details to follow.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/84f95e56-8595-4e4a-b9de-bb7ff3f5ed80-680x380.jpeg",
            "description": "The body of the former Vice President Phelekezela Mphoko who died in India on Friday last week has arrived at the Robert Gabriel Mugabe International Airport.",
            "time": "2024-12-12 20:28:58"
        },
        {
            "title": "Mashonaland West Investment Conference begins on high note",
            "url": "https://www.herald.co.zw/mashonaland-west-investment-conference-begins-on-high-note/",
            "content": "Walter Nyamukondiwa in KADOMA\n\nThe two-day Mashonaland West Investment Conference began today with potential local and international investors exploring opportunities in various sectors of the economy.\n\nGovernment ministries and agencies, including the Zimbabwe Investment and Development Authority (ZIDA), Zimbabwe Electricity Distribution and Transmission Company (ZETDC) and Zimtrade, among others, presented investment opportunities in various sectors.\n\nSome participated virtually from countries such as the United Kingdom, USA and Tanzania, among others.\n\nA delegation from Tanzania is also attending the conference to explore opportunities in the province.\n\nMashonaland West Provincial Affairs and Devolution Minister Marian Chombo officially opened the Conference and implored investors to take advantage of the opportunities in the province.\n\nMinister Chombo said the second edition of the conference comes after the first edition, also held in Kadoma in December 2023, recorded positive spin-offs.\n\nMashonaland West Province contributes about 12,6 percent to the national Gross Domestic Product (GDP), the third largest after Harare and Bulawayo.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/9583eb80-f2fc-4aee-9c91-9efc8ce35969-680x380.jpeg",
            "description": "Walter Nyamukondiwa in KADOMA The two-day Mashonaland West Investment Conference began today with potential local and international investors exploring opportunities in various sectors of the economy. Government ministries and agencies, including the Zimbabwe Investment and Development Authority (ZIDA), Zimbabwe Electricity Distribution and Transmission Company (ZETDC) and Zimtrade, among others, presented investment opportunities in various sectors. […]",
            "time": "2024-12-12 20:28:58"
        },
        {
            "title": "President commissions Shurugwi-Mhandamabwe Highway",
            "url": "https://www.herald.co.zw/president-commissions-shurugwi-mhandamabwe-highway/",
            "content": "14.11 President Mnangagwa has arrived in Shurugwi where he is expected to commission the newly resurfaced Shurugwi-Mhandamabwe Highway in Shurugwi district, Midlands Province, as the Second Republic continues to register significant milestones in infrastructural development as envisaged by the National Development Strategy 1.\n\nThe road connects Beitbridge with other borders, including Chirundu and Nyamapanda.\n\nThe Head of State and Government is expected to first unveil a plaque along the Highway at Chachacha Business Centre, signifying the commencement of the use of that road before heading for Mlandapi Business Centre where he will deliver his address.\n\n14.12 His Excellency now at Chachacha\n\nPresident Mnangagwa has arrived at Chachacha Shopping Centre in Shurugwi where he will cut the ribbon and unveil a plaque to commission the Shurugwi-Mhandamabwe Road.\n\nThe commissioning of the Shurugwi-Mhandamabwe highway is part of the Second Republics elaborate plans to stimulate economic growth, anchored on infrastructural development, particularly improving the road network to enhance connectivity.\n\n14.56 President satisfied with Second Republics progress\n\nPresident Mnangagwa has unveiled a plaque that signifies the resumption of the resurfaced roads use.\n\nIn a brief interview soon after unveiling the plaque, President Mnangagwa expressed excitement at the milestones that the Second Republic continues to register saying it will not relent to move on the development trajectory that will revolutionalise communities and the lives of ordinary people.\n\nHe said he grew up in the area as a young boy and is aware of how bad the roads and other social amenities were.\n\nWe would have one school here, for example, and another school in a different district. So I am happy with the milestones being registered under the Second Republic, he said.\n\n15.00 Bumper crowd welcomes the President\n\nPresident Mnangagwa has arrived at Mkandapi Business Centre where he is expected to address a huge crowd gathered to celebrate the commissioning of the Shurugwi Mhandamabwe highway.\n\nUpon his arrival, the President got a standing ovation from the bumper crowd.\n\nThe ecstatic crowd began to swell as early as 8am.\n\nPopular musician Chief Hwenje, who recently returned from India where he had gone for medical treatment, kept the people entertained as they waited for President Mnangagwas arrival.\n\n15.42 Midlands Minister hails President Mnangagwa\n\nMinister of State for Midlands Provincial Affairs and Devolution Cde Owen Mudha Ncube is now on the podium.\n\nHe outlines the significance of the road project, which he said was completed in a record five months ahead of the envisaged timeframe.\n\nMinister Ncube hailed President Mnangagwa saying he has lived to his word from the day he took the oath of office during his initial inauguration where he pledged to transform communities.\n\nHe said the milestones remain glaring, notwithstanding the illegal sanctions imposed on the country.\n\nMinister Ncube outlined several other projects in various sectors that President Mnangagwa has initiated in Midlands Province\n\n15.43 Community welcomes development\n\nA villager, only identified as Mrs Maramwidze, is invited to give a testimony to the significance of the road resurfacing.\n\nShe outlined how bad the road had become, and the adverse impact it had on vehicles, among other vices occasioned by the poor road.\n\n15.44 Transport Minister highlights recent road projects\n\nTransport and Infrastructural Development Minister Felix Mhona now on stage.\n\nHe commends President Mnangagwas leadership that has produced wonders despite sanctions that would have ordinarily impeded development.\n\nMinister Mhona outlined several road projects that have been carried out and completed, coupled with those under construction.\n\nSome of them include Bulawayo Nkayi, Harare-Nyamapanda, and Beitbridge-Gwanda Roads, among others.\n\nMinister Mhona ends speech by inviting President Mnangagwa to the podium.\n\n15.50 Roads are a key economic enabler: President Mnangagwa\n\nIn his address, President Mnangagwa said the road projects that the Government has embarked on are not meant for the country alone but for the region as a whole.\n\nHe said the transport sector is a huge enabler for economic growth.\n\nThere is a need to provide an efficient transport system to enable people to access markets and promote regional integration.\n\nBecause of modernisation, it is now possible to travel from Shurugwi to Gweru and return in a few hours, he said.\n\nPresident Mnangagwa said this can only be accomplished by indigenous Zimbabweans working together.\n\nNo other person outside Zimbabwe will come to develop Zimbabwe, he said.\n\nHe also said Zimbabwe cannot grow in isolation but should collaborate with other neighbouring countries for development.\n\n16.41 Presidents passionate plea\n\nHis Excellency, President Mnangagwa made a passionate appeal to motorists to drive responsibly as the country approaches the festive season.\n\nHe warned drivers to desist from driving under the influence of alcohol.\n\nPresident Mnangagwa said there is a need to uphold the countrys traffic laws and to respect the sanctity of human life\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Screenshot-14-680x380.png",
            "description": "  14.11 – President Mnangagwa has arrived in Shurugwi where he is expected to commission the newly resurfaced Shurugwi-Mhandamabwe Highway in Shurugwi district, Midlands Province, as the Second Republic continues to register significant milestones in infrastructural development as envisaged by the National Development Strategy 1.   The road connects Beitbridge with other borders, including Chirundu and […]",
            "time": "2024-12-12 20:28:58"
        },
        {
            "title": "Geo Pomona Waste Management delegation meets Lesotho Prime Minister",
            "url": "https://www.herald.co.zw/geo-pomona-waste-management-delegation-meets-lesotho-prime-minister/",
            "content": "Blessings Chidakwa in MASERU, Lesotho\n\nA Geo Pomona Waste Management delegation that is in Lesotho to explore ways of improving the kingdoms waste management system has met Prime Minister, Right Honourable Samuel Ntsokoane Matekane.\n\nThe delegation is being led by Deputy Chief Secretary in the Office of the President and Cabinet, Engineer Amos Marawa.\n\nSpeaking during the meeting at State House in Maseru, Prime Minister Matekane said he was very impressed by the solutions suggested by Geo Pomona Waste Management.\n\nLesotho has been operating without a landfill and exports hazardous waste to South Africa.\n\nResidents in the capital city, Maseru, are living close to a dumpsite that has been in use since the 1980s and are exposed to serious health hazards.\n\nZimbabwean Government officials, Geo Pomona Waste Management, Maseru City Council and local residents yesterday toured the Tsosane dumpsite and a possible landfill, Tsoeneng, to get an appreciation of the situation.\n\nThe visit came after Sadc Heads of State recently visited the Geo Pomona Waste Management site.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/GEO-POMONA.jpg",
            "description": "Blessings Chidakwa in MASERU, Lesotho A Geo Pomona Waste Management delegation that is in Lesotho to explore ways of improving the kingdom’s waste management system has met Prime Minister, Right Honourable Samuel Ntsokoane Matekane. The delegation is being led by Deputy Chief Secretary in the Office of the President and Cabinet, Engineer Amos Marawa. Speaking […]",
            "time": "2024-12-12 20:28:58"
        },
        {
            "title": "A call to action for wetlands conservation",
            "url": "https://www.herald.co.zw/a-call-to-action-for-wetlands-conservation/",
            "content": "Peter Tanyanyiwa\n\nHerald Correspondent\n\nLocal Government and Public Works Minister Daniel Garwe has commended efforts made by civil society organisations, particularly the Zimbabwe Wetlands Trust and BirdLife Zimbabwe, in raising awareness and advocating for environmental protection.\n\nThe ministers commendation comes on the back of revelations that 82 percent of Zimbabwes wetlands are now considered moderately or severely degraded, with urban development and climate change posing significant threats.\n\nIt is our responsibility to protect and restore them for the benefit of future generations, said Minister Garwe.\n\nHe was speaking during the Wetlands Policy and Legislation Indaba, facilitated by BirdLife Zimbabwe.\n\nThe minister said the Government has mapped and gazetted wetlands across the country and is working on the National Wetlands Policy and Management Guidelines, which aim to provide a clear framework for the sustainable management of these vital ecosystems.\n\nThe indaba brought together various stakeholders to discuss strategies for sustainable management of wetlands.\n\nIn July 2025, Zimbabwe is set to host the Ramsar Convention in Victoria Falls.\n\nThis event will serve as a crucial platform for Zimbabwe to showcase its commitment to wetlands conservation and share best practices with other nations.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/01/Cde-Daniel-Garwe.jpg",
            "description": "Peter Tanyanyiwa Herald Correspondent Local Government and Public Works Minister Daniel Garwe has commended efforts made by civil society organisations, particularly the Zimbabwe Wetlands Trust and BirdLife Zimbabwe, in raising awareness and advocating for environmental protection. The minister’s commendation comes on the back of revelations that 82 percent of Zimbabwe’s wetlands are now considered moderately […]",
            "time": "2024-12-12 20:28:58"
        },
        {
            "title": "Gems brace for Namibia clash",
            "url": "https://www.herald.co.zw/gems-brace-for-namibia-clash/",
            "content": "Tadious Manyepo\n\nZimpapers Sports Hub\n\nGems coach Ropafadzo Mutsauki has said Zimbabwe needs to concentrate when they play hosts Namibia in their final group game of the ongoing African Netball Championships.\n\nThe Gems can advance to the semi-finals as group winners if they make it past Namibia in the match that kicks-off at 6pm.\n\nA positive result will also see them avoid favourites South Africa in the last four tomorrow.\n\nBut that is not what Mutsauki is focusing on as he knows Namibia can derail their aspirations.\n\nAll we are looking for at the moment is playing the way we have always done and be able to beat Namibia, said Mutsauki.\n\nNamibia is a very good team that is capable of beating anyone in this tournament, including us. So we are not looking beyond that match as we should also pass that 60-minute test for us to be in a position to talk about the semi-finals, said Mutsauki.\n\nLook, Namibia have always shown that they are a team with a lot of intention and ambition. They will always come at you in full force and try to make things happen.\n\nBut I am glad the girls had some rest today (yesterday) and they are willing to go at it. The team is well-motivated and willing to showcase themselves while being competitive. This is the spirit we have always talked about and it is helping us in a huge way.\n\nNamibia are the hosts and they will have a lot of support from all in the dome. We need to be focused on the game and be willing to express ourselves while also trying to be compact.\n\nZimbabwe are playing well in the meet and they have already clipped two victories in Pool B, first beating one of the tournament favourites Uganda 50-49 on Sunday before they followed that up with a massive 78-20 win over Eswatini on Tuesday.\n\nThey will be hoping to emulate the same indomitable form from Tuesdays victory in todays game.\n\nThat is the aim. If we go at it the same way we did in our opening two games, we will give ourselves a huge chance to win the game. We will see how best to go about it but obviously, we need the same desire and enthusiasm, added Mutsauki.\n\nWe are ready for it and we hope to do well and book our place in the semi-final in style.\n\nPool A has South Africa, Malawi, Kenya and Zambia, with South Africa being the favourites to win it.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/GEMS-680x380.png",
            "description": "Tadious Manyepo Zimpapers Sports Hub Gems coach Ropafadzo Mutsauki has said Zimbabwe needs to concentrate when they play hosts Namibia in their final group game of the ongoing African Netball Championships. The Gems can advance to the semi-finals as group winners if they make it past Namibia in the match that kicks-off at 6pm. A […]",
            "time": "2024-12-12 20:28:58"
        },
        {
            "title": "Stanbic CEO Nyanhongo wins awards",
            "url": "https://www.herald.co.zw/stanbic-ceo-nyanhongo-wins-awards/",
            "content": "Business Reporter\n\nStanbic Bank Zimbabwe chief executive (CE), Solomon Nyanhongo, has won the overall chief executive officer (CEO) of the year as well as the banking sector CEO of the year awards at the annual CEO Round Table Awards ceremony.\n\nA five-member adjudication committee made of seasoned players in the banking sector, law, accounting, media and investment and finance judged nominees in eight categories.\n\nThe categories are business performance; corporate and strategy; digital journey; customer experience; risk management; product mix; product innovation; and ethical leadership and management.\n\nThe committee was chaired by lawyer, entrepreneur and educationist, Mr Canaan Dube.\n\nThey rewarded Mr Nyanhongo for guiding Stanbic Bank to greater heights in its business performance as measured by revenue growth as well as leadership and corporate strategy, whose indicator was strategic foresight.\n\nThe committee rewarded Mr Nyanhongo for championing the implementation of the institutions three strategic priorities, that is transform client experience, execute with excellence, and drive sustainable growth and value.\n\nMr Dube said Mr Nyanhongo was rewarded for creating a top-notch customer experience through which the institution had the highest levels of customer satisfaction and customer retention.\n\nStanbic Bank also won the Best Customer Experience Award in the Banking Category from the Customer Experience Association of Zimbabwe. The institution has won the award for the past two years. Customer satisfaction across Stanbic Banks segments averaged 8.5 out of 10 suggesting that the institutions clients are highly satisfied with the services they provide them.\n\nMr Dube said the adjudication committee was guided by the principle of maintaining the integrity of the award process and thus strictly adhered to guidelines.\n\nEach nominee was assessed against a predefined set of criteria, ensuring a consistent and objective evaluation. The selection of the overall winner involved a multi-faceted approach, part of which was that nominees who were selected by the majority of adjudicators were considered.\n\nAs the adjudication committee, we are confident that we conducted a fair and transparent evaluation process based on the information provided by the nominees. We are proud of the outcomes that were unveiled, said Mr Dube.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/04/Untitled-93.jpg",
            "description": "Business Reporter Stanbic Bank Zimbabwe chief executive (CE), Solomon Nyanhongo, has won the overall chief executive officer (CEO) of the year as well as the banking sector CEO of the year awards at the annual CEO Round Table Awards ceremony. A five-member adjudication committee made of seasoned players in the banking sector, law, accounting, media […]",
            "time": "2024-12-12 20:28:58"
        },
        {
            "title": "Zimbabwe aims to lead in digital economy with strong AI, infrastructure focus",
            "url": "https://www.herald.co.zw/zimbabwe-aims-to-lead-in-digital-economy-with-strong-ai-infrastructure-focus/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nZimbabwe is positioning itself as a leader in the digital economy, with a strong focus on artificial intelligence (AI) and digital infrastructure to drive economic growth.\n\nSpeaking at the Zimbabwe Artificial Intelligence and Innovation Week at the University of Zimbabwe, Minister of Information Communication Technology (ICT), Postal and Courier Services, Dr Tatenda Mavetera outlined the countrys vision for a tech-driven future.\n\nThe event is running under the theme Building Digital Infrastructure: Enabling Innovation and Connectivity in Zimbabwes Digital Economy, which emphasises the importance of connectivity and innovation for national development.\n\nWe are envisioning a future where technology empowers our people, drives economic growth, and solidifies Zimbabwes position as a leader in the digital economy, Minister Mavetera said.\n\nShe said a robust digital infrastructure played a critical role as the foundation for economic transformation.\n\nInnovation is the engine of economic growth, Minister Mavetera said, adding that Zimbabwe has made significant strides with internet penetration reaching 78.55 percent and mobile connectivity exceeding 96 percent.\n\nZimbabwe is also embracing cutting-edge technologies, with 5G connectivity being offered by two of the countrys three mobile network operators, and the recent approval of Low Earth Satellites to enhance connectivity.\n\nMinister of Foreign Affairs and International Trade, Professor Amon Murwira also praised the role of AI in boosting market access.\n\nAI will help us promote Zimbabwes economic opportunities globally.\n\nYouth Empowerment, Development and Vocational Training Minister Tino Machakaire said there is need to nurture a generation of young innovators.\n\nWe are committed to creating an environment where creativity and ingenuity can thrive, he said.\n\nAs Zimbabwe continues to invest in its digital infrastructure, the country aims to harness technology to drive growth and innovation across various sectors.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/c6f55834-5a13-4f62-9603-bb29b6551be7-680x380.jpeg",
            "description": "Ivan Zhakata Herald Correspondent Zimbabwe is positioning itself as a leader in the digital economy, with a strong focus on artificial intelligence (AI) and digital infrastructure to drive economic growth. Speaking at the Zimbabwe Artificial Intelligence and Innovation Week at the University of Zimbabwe, Minister of Information Communication Technology (ICT), Postal and Courier Services, Dr […]",
            "time": "2024-12-12 20:28:58"
        },
        {
            "title": "Liquid boosts Botswana’s digital backbone with 730km fibre network",
            "url": "https://www.herald.co.zw/liquid-boosts-botswanas-digital-backbone-with-730km-fibre-network/",
            "content": "Herald Correspondent\n\nLIQUID Intelligent Technologies has unveiled a significant expansion of its fibre network in Botswana, spanning 730 kilometres across towns like Francistown, Mahalapye and Palapye.\n\nThis marks the first direct fibre link along the A1 Road from northern Botswana, promising to revolutionise digital connectivity in the region.\n\nThe new fibre infrastructure will deliver multi-terabit capacity, enabling lightning-fast internet speeds and increased network resilience.\n\nThis will benefit both urban and rural communities, empowering businesses, educational institutions, and individuals alike.\n\nThis expansion is a game-changer for Botswana, said Odirile Tamajobe, managing director of Liquid Botswana.\n\nIt will strengthen our economic hubs, connect major commercial centres, and provide high-speed internet access to both urban and rural communities.\n\nExtended network will serve as a crucial link between Botswana and neighbouring countries, including Zimbabwe, South Africa, Kenya, Zambia, the Democratic Republic of Congo and Sudan.\n\nThe cross-border connectivity will bolster the regions digital capabilities and accelerate Africas digital transformation.\n\nIncreased connectivity is poised to fuel economic growth, particularly in sectors like finance, education and hospitality.\n\nLocal Internet Service Providers (ISPs) will also benefit, expanding their services to more households and creating new job opportunities.\n\nWe are seeing the tangible benefits of this expansion in every community along the route, said Tamajobe.\n\nThis project is an investment in Botswanas future, and it will help local businesses, schools, and families access faster, more reliable internet services.\n\nLiquids commitment to enhancing Botswanas digital infrastructure aligns with the countrys national digital transformation strategy.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/LIQYUID.jpg",
            "description": "Herald Correspondent LIQUID Intelligent Technologies has unveiled a significant expansion of its fibre network in Botswana, spanning 730 kilometres across towns like Francistown, Mahalapye and Palapye. This marks the first direct fibre link along the A1 Road from northern Botswana, promising to revolutionise digital connectivity in the region. The new fibre infrastructure will deliver multi-terabit […]",
            "time": "2024-12-12 20:28:58"
        },
        {
            "title": "Minister Garwe tours Mbare’s temporary market",
            "url": "https://www.herald.co.zw/minister-garwe-tours-mbares-temporary-market/",
            "content": "Freeman Razemba\n\nSenior Reporter\n\nLocal Government and Public Works Minister Daniel Garwe has toured the temporary traders market at Mbare Musika in Harare to assess the progress made by contractor Masimba Contracting so far.\n\nConstruction of the market has also created employment for several youths and is progressing well, with the contractor expected to hand over the finished structure by month-end.\n\nAfter that, the contractor will then focus on building the larger and permanent three-storey market where the traders will eventually move.\n\nAlthough designed to be a temporary solution, the new structure is set to become a hub for commerce and trade, embracing a new way of doing business that incorporates the use of the internet and technology.\n\nThe development shows that Government is walking the talk on providing modern economic markets that meet Zimbabwes goal of becoming an upper middle-income society by 2030.\n\nMinister Garwe was accompanied by Harare Mayor Councillor Jacob Mafume and senior Government officials.\n\n",
            "image_url": null,
            "description": "Freeman Razemba Senior Reporter Local Government and Public Works Minister Daniel Garwe has toured the temporary traders’ market at Mbare Musika in Harare to assess the progress made by contractor Masimba Contracting so far. Construction of the market has also created employment for several youths and is progressing well, with the contractor expected to hand […]",
            "time": "2024-12-12 20:28:58"
        }
    ]
}