{
    "news": [
        {
            "title": "FC Platinum clinch Uhuru Cup",
            "url": "https://www.herald.co.zw/fc-platinum-clinch-uhuru-cup/",
            "content": "Langton Nyakwenda in Gokwe\n\nFC PLATINUM clinched their third Uhuru Cup title after dispatching Simba Bhora in a penalty shoot-out at Nembudziya Growth Point in Gokwe today.\n\nHistory was made in Gokwe as the Midlands town hosted its first ever top flight match, as part of Governments devolution programme.\n\nA patient crowd waited until 5:30pm when the match finally kicked off.\n\nAlthough the match was shortened due to the waterlogged pitch and lighting issues, Gokwe fans still had a rare chance of watching Premier Soccer League stars like 2022 Soccer Star of the Year second runner up Donald Mudadi, Jarrison Selemani,\n\nMbongeni Ndlovu and Never Tigere live in action.\n\nThe match ended goalless and went straight into a penalty shoot-out which FC Platinum won 3-0.\n\nMisheck Ngwenya, Thandolwenkosi Ngwenya and Thubelihle Jubane converted while the first three takers for Simba Bhora all fired blanks.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/rr-680x380.jpg",
            "description": "Langton Nyakwenda in Gokwe FC PLATINUM clinched their third Uhuru Cup title after dispatching Simba Bhora in a penalty shoot-out at Nembudziya Growth Point in Gokwe today. History was made in Gokwe as the Midlands town hosted its first ever top flight match, as part of Government’s devolution programme. A patient crowd waited until 5:30pm […]",
            "time": "20:27",
            "date": "18 Apr 2025"
        },
        {
            "title": "Independence Cup clash: Concerns over waterlogged pitch",
            "url": "https://www.herald.co.zw/independence-cup-clash-concerns-over-waterlogged-pitch/",
            "content": "Langton Nyakwenda in Gokwe\n\nFC Platinum are set to clash with Simba Bhora at Nembudziya Growth Point but both teams are yet to take to the pitch.\n\nThere are genuine concerns about the state of the pitch, which has suffered from heavy rains that pounded Gokwe into the early hours of Friday.\n\nSome patient fans are still singing on the terraces hoping the teams will finally play.\n\nShould the game finally kicks off, it will be the first time for Gokwe to host Premier Soccer League teams.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/4224-680x380.jpg",
            "description": "Langton Nyakwenda in Gokwe FC Platinum are set to clash with Simba Bhora at Nembudziya Growth Point but both teams are yet to take to the pitch. There are genuine concerns about the state of the pitch, which has suffered from heavy rains that pounded Gokwe into the early hours of Friday. Some patient fans […]",
            "time": "20:27",
            "date": "18 Apr 2025"
        },
        {
            "title": "Athletes gear up for Comrades with Independence Run",
            "url": "https://www.herald.co.zw/athletes-gear-up-for-comrades-with-independence-run/",
            "content": "Lovemore Dube\n\nFITNESS First Athletics Club members today engaged in a gruelling 50km road race as part of their preparations for the Comrades Marathon.\n\nClubs spokesperson Mudiwa Nyirenda said they had decided to have the Independence Run for wellness, camaraderie and preparations for some of their members in the absence of the Matopos 33 Miler for the epic South African ultra-marathon.\n\nThe club members are competing to commemorate Independence Day. Others, in the absence of the Matopos 33 Miler, are using this 50km race to prepare for the Comrades Marathon.\n\nThe weather is fine, it is drizzling and they wont be dehydrated that much, said Nyirenda.\n\nZimbabwe athletes have used the PPC Matopos 33 Miler to qualify for the Comrades or to prepare for it.\n\nZimbabwean Stephen Muzhingi is the most successful Comrades Marathon runner with three titles.\n\nThe Comrades Marathon takes place in June.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/64d6001b-4ee1-4849-88af-855a1a3c428f-680x380.jpg",
            "description": "FITNESS First Athletics Club members today engaged in a gruelling 50km road race as part of their preparations for the Comrades Marathon.",
            "time": "20:27",
            "date": "18 Apr 2025"
        },
        {
            "title": "Legends Academy chase Easter glory in SA",
            "url": "https://www.herald.co.zw/legends-academy-chase-easter-glory-in-sa/",
            "content": "Zimpapers Sports Hub\n\nFOR the second year running, top Zimbabwean football academy Legends will get a chance to showcase some of the best emerging talent in the country when they feature in the Vision View TV Easter Cup of Champions tournament in South Africa.\n\nThe Under-17 tournament for which Legends were invited on the back of their impressive showing on debut last year, is being staged at Pinnacle College grounds in Kyalami and burst into life Friday morning with the Zimbabwean outfit having a 3-0 walkover win on Midrand LFA, who were too late for kick off.\n\nAccording to the pre-tournament draw Legends were drawn into Group C which also includes Highlands Park, Panorama, and School of Excellence.\n\nGroup A is made up of Zhaimu Jambos Kaizer Chiefs, Joburg City, Magnet Youth KPS Academy and Mamelodi Sundowns.\n\nThe mid-morning clash between Kaizer Chiefs and Mamelodi Sundowns is one of the headline fixtures for Saturday given the rivalry that exists between their senior teams.\n\nApart from the Legends assignments, other potential match-ups include the encounter between SuperSport United and University of Pretoria in Group D and the showdown between AmaZulu and TS Galaxy.\n\nCoach Farai Dhliwayo and manager Josephat Rwafa have brought fresh talent with only a few survivors from last years class, including defender Nashe Pepukai and star forward Tatenda Maulidi providing the tournament experience.\n\nChurchill High School king pin, Maulidi, one of the stars of the Zimbabwe team in the CAF Schools competition, has also been named captain of this years class.\n\nDhliwayo is confident Legends will shine again this year.\n\nBut more importantly for the experienced development coach and his trusted lieutenant Rwafa, is the platform which such tournaments like the Easter Cup of Champions provides to budding talent, with some of the young players on tour, travelling out of Zimbabwe for the first time in their lives.\n\nThe Easter Cup is also coming in the year that Legends are expected to take an Under-17 side to England for a tour of that countrys Premiership side Everton.\n\nLegends are one of only two African institutions that are on the Everton International Affiliate Programme.\n\nParticipating in the Under-17 Vision Viewer TV Easter Cup of Champions against South Africas and some of Southern Africas best club sides is now a part of our development process, Dhliwayo said.\n\nIt is important that we compare our development efforts with the top clubs in the region.\n\nFor our players it is priceless experience and I have seen players grow from these kinds of exposure.\n\nAs part of development we ensured that half of our squad that participated in the tournament last year were young enough to play again this year.\n\nThis is essential for the development cycle. Last year many of them played bit part roles, but this year they are the stalwarts of our cup chasing team.\n\nWe will be looking for good performances from the exceptional Tatenda Maulidi, Vera Santu, Munyaradzi Mugabazi, Jay-Jay Dhliwayo, Nashe Pepukai, Denzel Chakaza, Johnathan Zaloumis and Abel Musemburi, he said.\n\nDhliwayo said they will continue with the cycle of participating with one eye on the next tournament in 2026.\n\nThis year we have done the same, bringing a contingent of players who will next year be the leaders striving for success.\n\nFor many of our young players, this is the first time to get a passport and travel internationally.\n\nThe tournament will be a new experience for them, but it helps to capacitate and prepare them if they get junior national team call-ups in the future.\n\nWith ZIFA emerging from a dark past where youth football had been sidelined, academies have chipped in to play a major role in talent identification and nurturing, which has eased the burden on Young Warriors coaches when they have to select squads for the COSAFA and African Union of Sports Region 5 assignments.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/7ead3cb5-7276-46b1-923d-2e2b9266f964-680x380.jpg",
            "description": "FOR the second year running, top Zimbabwean football academy Legends will get a chance to showcase some of the best emerging talent in the country when they feature in the Vision View TV Easter Cup of Champions tournament in South Africa.",
            "time": "20:27",
            "date": "18 Apr 2025"
        },
        {
            "title": "Kapfupi hails Presidential Title Deeds Programme",
            "url": "https://www.herald.co.zw/kapfupi-hails-presidential-title-deeds-programme/",
            "content": "Arron Nyamayaro\n\nMusician and comedian Kapfupi has commended President ED Mnangagwa for spearheading the Presidential Title Deeds Programme in Epworth.\n\nKapfupi, real name Freddy Manjalima, was speaking on the sidelines of Harares provincial Independence celebrations at Epworth High School this afternoon.\n\nMy journey with a drama along First Street in Harare, said Kapfupi. When my name became popular, many suggested that l should go and rent a house in Borrowdale.\n\nNdakavabvunza kuti asi kune dzimba dzakagara pamusoro pedovi here?\n\nWithin a few years, the Second Republic, led by President Mnangagwa, started to give title deeds to Epworth residents.\n\nWe thank the President and Amai Mnangagwa for changing the lives of Epworth residents and the nation at large, said Kapfupi.\n\nMore than 22 000 stand owners are set to register for the KWANGU/NGAKWAMI Presidential Title Deeds programme in Epworth this month, with the number set to rise to 45 000 in two months.\n\nThe programme is aimed at formalising the dormitory settlement.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Freddy-Manjalima-680x380.jpg",
            "description": "Musician and comedian Kapfupi has commended President ED Mnangagwa for spearheading the Presidential Title Deeds Programme in Epworth.",
            "time": "20:27",
            "date": "18 Apr 2025"
        },
        {
            "title": "Bulawayo celebrates the achievements of Second Republic",
            "url": "https://www.herald.co.zw/bulawayo-celebrates-the-achievements-of-second-republic/",
            "content": "Sikhumbuzo Moyo\n\nBULAWAYO Minister of State for Provincial Affairs and Devolution Judith Ncube read the Presidents speech at the provinces lndependence celebrations at the White City Stadium this afternoon.\n\nThe speech touched on the Second Republics achievements over the past year.\n\nPeople from across the province braved the chilly weather to attend the celebrations, which will culminate in a football match between Highlanders and Chicken Inn.\n\nMembers of the defence forces provided entertainment with their drills.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Minister-Judith-Ncube-680x380.jpg",
            "description": "BULAWAYO Minister of State for Provincial Affairs and Devolution Judith Ncube read the President’s speech at the province’s lndependence celebrations at the White City Stadium this afternoon.",
            "time": "20:27",
            "date": "18 Apr 2025"
        },
        {
            "title": "Musicians ready to light up Mash West as part of Independence celebrations",
            "url": "https://www.herald.co.zw/musicians-ready-to-light-up-mash-west-as-part-of-independence-celebrations/",
            "content": "Conrad Mupesa\n\nMashonaland West Bureau\n\nVARIOUS musicians are now at Mbafa Primary School in Uhuru Nakazi, Chegutu, for what promises to be an electric night for the local community.\n\nThe Uhuru Nakazi community becomes the latest beneficiaries of the Second Republics decentralisation drive of national events in the province.\n\nVarious musicians, including Afrofusion artist, Prudence Mama Africa Muchada, army-side outfit Crocodile Sounds and Chinhoyi Prison Band are ready to entertain the bumper crowd at the gala that is scheduled to start after a soccer match between Ngezi Platinum and Mwos FC.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Prudence-Muchada-680x380.jpg",
            "description": "VARIOUS musicians are now at Mbafa Primary School in Uhuru Nakazi, Chegutu, for what promises to be an electric night for the local community.",
            "time": "20:27",
            "date": "18 Apr 2025"
        },
        {
            "title": "Nation rallied towards innovation, technology",
            "url": "https://www.herald.co.zw/nation-rallied-towards-innovation-technology/",
            "content": "Blessings Chidakwa in Gokwe\n\nPresident Mnangagwa has reaffirmed his administrations commitment to building a prosperous Zimbabwe rooted in the legacy of the liberation struggle, while urging the nation to embrace innovation, technology, and skills development as the bedrock of future success.\n\nAddressing thousands who gathered at Mutora Open Grounds in Gokwe for the main Independence Day celebrations today, the President said the Zanu PF Government remains steadfast in honouring the sacrifices made during the liberation war.\n\nAfter 45 years of Independence, the Zanu PF Government remains committed to building a future that honours the sacrifices of the past, but fundamentally secures prosperity for the generations ahead, he said.\n\nPresident Mnangagwa emphasized the critical role of technical and vocational education, particularly in the fields of science, technology, and innovation, as key to unlocking Zimbabwes economic potential and improving the competitiveness of local products on both domestic and global markets.\n\nTo guarantee that Zimbabwean products are competitive in both local and global markets, technical and vocational education, with biases in science, technology and innovation, are of critical importance, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/President-Mnangagwa-2-1-680x380.jpg",
            "description": "President Mnangagwa has reaffirmed his administration’s commitment to building a prosperous Zimbabwe rooted in the legacy of the liberation struggle, while urging the nation to embrace innovation, technology, and skills development as the bedrock of future success.",
            "time": "20:27",
            "date": "18 Apr 2025"
        },
        {
            "title": "President commends Zimbabweans",
            "url": "https://www.herald.co.zw/president-commends-zimbabweans/",
            "content": "Online Reporter\n\nPresident Mnangagwa has commended Zimbabweans for remaining vigilant in the face of shadowy elements with dubious opportunistic agendas.\n\nWhile delivering his keynote address at Mutora Open Grounds in Gokwe Nembudziya this afternoon, the President emphasised the need for unity.\n\nI commend you, my dear fellow compatriots, both at home and abroad, for remaining vigilant, patriotic and steadfast, never allowing ourselves to be misled by shadowy elements with dubious opportunistic agendas.\n\nNgatirambe takabatana, tichivaka nyika yedu. Tose tine mutoro wekushandira Zimbabwe. Ngatizivikanwe kuti takashandira dunhu kana nyika yekwedu, nekubatanidza vanhu, he said.\n\nPresident Mnangagwa added that values of love, mutual support and trust are handed down from generation to generation, just like our culture, traditions, history, and moral principles.\n\nMoral standards and the family institution must be deliberately protected. Zimbabwe has been, and must remain, a stronghold of the traditional values on which human civilisation stands.\n\nIn this spirit, let us never neglect the plight of the elderly, orphans, disabled, and those exposed to drug and substance abuse, among other vulnerable members of our society.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/fcfb999f-01d0-4417-bb40-e03c8bb77dda-680x380.jpeg",
            "description": "President Mnangagwa has commended Zimbabweans for remaining vigilant in the face of shadowy elements with dubious opportunistic agendas.",
            "time": "20:27",
            "date": "18 Apr 2025"
        },
        {
            "title": "Masvingo celebrates 45 years of Independence",
            "url": "https://www.herald.co.zw/masvingo-celebrates-45-years-of-independence/",
            "content": "George Maponga in Nemanwa\n\nHundreds of people have braved the cold weather and thronged Nemanwa Grounds in Masvingo District to celebrate 45 years of independence amid pomp and fanfare.\n\nThe celebrations are being held at Nemanwa Growth Point in line with the Second Republics devolution agenda to take key national programmes to all corners of the country.\n\nProceedings to mark the festivities started around 10am with the huge crowd witnessing the arrival of service chiefs that were led by 4 Infantry Brigade Commander, Brigadier General Obert Tshuma.\n\nGuest of honour and Minister of State for Masvingo Provincial Affairs and Devolution Ezra Chadzamira arrived to cheers from the crowd and inspected the parade.\n\nAlso in attendance is Permanent Secretary for Masvingo Provincial Affairs and Devolution, Dr Addmore Pazvakavambwa and other senior Government officials.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/2b4609a9-f32c-4568-84de-4364ad516489-680x380.jpeg",
            "description": "Hundreds of people have braved the cold weather and thronged Nemanwa Grounds in Masvingo District to celebrate 45 years of independence amid pomp and fanfare.",
            "time": "20:27",
            "date": "18 Apr 2025"
        }
    ]
}