{
    "news": [
        {
            "title": "‘SMEs major economic drivers’",
            "url": "https://www.herald.co.zw/smes-major-economic-drivers/",
            "content": "Zvamaida Murwira, Senior Reporter\n\nSMALL to Medium Enterprises (SMEs) are a key driver of economic growth, broad-based empowerment, job and wealth creation, contributing significantly to the countrys Gross Domestic Product, President Mnangagwa has said.\n\nCommissioning the Mbare Musika Traders Market Phase 1, a state-of-the-art facility that is set to benchmark the modern SMEs trading environment, President Mnangagwa said the importance of the Small and Medium Enterprises sector to the growth of the economy cannot be over-emphasised.\n\nCompletion of the first phase of the market paved the way for 1 628 traders to begin operations and comes as a timely relief for traders who lost their stalls and stock last year in a fire outbreak.\n\nThe President said the SMEs sector stands as one of the critical pillars of the economy, contributing significantly to the total Gross Domestic Product.\n\nMy Government, thus, recognises that SMEs are a key driver of economic growth, job creation, wealth creation and broad-based empowerment, he said.\n\nPresident Mnangagwa said his just-ended visit to the 11th Session of the Africa Regional Forum on Sustainable Development in Uganda, as Chairman of SADC, discussed the importance of driving job creation and economic growth, mainly through young people and women.\n\nI, therefore, challenge the entrepreneurs of our country to scale up the establishment of small businesses and start-ups in line with emerging trends and digital technologies.\n\nAs a Government, we are ready to support solutions and new products related to agriculture, financial and climate technologies among others that must propel the industrialisation of our country, he said.\n\nAn aerial view of the newly-built Mbare Traders Market in Harare that was commissioned by President Mnangagwa yesterday.  Picture: OPC\n\nPresident Mnangagwa said the facilitation of more opportunities and windows of support such as low-interest financing, business development services, transfer of skills and technologies as well as market access for the sector, will be availed.\n\nHe directed all partners to the Mbare Musika Traders Market and future projects to ensure that levies and rentals are pegged at competitive and affordable levels.\n\nOccupants and customers of the markets were also called upon to be responsible custodians of the modern facilities.\n\nThe President called for collaborative synergies between SMEs and relevant ministries, departments and agencies, saying such collaboration was important towards the formalisation of small businesses and start-ups.\n\nAs we continue to diversify our economy, the formalisation of this sector must never be viewed as a direct threat to the survival and sustainability of your respective businesses.\n\nOn its part, my Government will continue to improve the ease of doing business, through reducing barriers to entry, as well as streamlining business registration, licencing and compliance levies.\n\nDialogue with the SMEs sector is an essential building block for enhanced business productivity. There should not be a them and us mentality, said President Mnangagwa.\n\nHe added that the Government and SMEs sector must act as one for the good of the country.\n\nThe Ministry of SMEs was challenged to deploy innovative initiatives that will see more SMEs becoming fully fledged business entities with footprints beyond Zimbabwe and the SADC region.\n\nGovernment is determined to see the realisation of the Urban Transformation Agenda designed to primarily focus on addressing rapid urbanisation by prioritising safe, inclusive, resilient and sustainable cities and human settlements, in line with Sustainable Development Goal (SDG) Number 11.\n\nPresident Mnangagwa said Phase 2 of the New Mbare Musika is designed to be a multi-storey complex with improved sanitation, fire safety features and organised trading spaces, thus resonating with Vision 2030 and the SDGs.\n\nHe applauded Masimba Construction and Mkambo Misika Hubs, whopartnered the Government in the project, for their professionalism and work ethic, which have ensured the completion of Phase 1 of the market.\n\nEarlier on, President Mnangagwa commended Mbare residents for their consistent support of Zanu PF that saw the revolutionary party winning in that constituency in the 2023 harmonised elections.\n\nBe assured that the interests of the people of our great motherland, Zimbabwe, remain at the core of my Administration. Two weeks ago, I was pleased to receive, at State House, representatives of Vendors and Tuckshops Associations from across the country.\n\nThat engagement, among many others I have had in the recent past, gave me general insights into matters that concern you and the broader Micro, Small and Medium Enterprises sector. Government is seized with facilitating an environment where your businesses can thrive for an improved standard of living for all, he said.\n\nDefence Minister Oppah Muchinguri-Kashiri said the construction of the market resonated with President Mnangagwas national vision spelt out in the National Development Strategy 1 and Governments ultimate goal of elevating Zimbabweans to a prosperous and empowered upper-middle-income society by 2030.\n\nThis bustling market has been a cornerstone of Zimbabwes SMEs and a vital source of livelihood for traders and their families.\n\nThis initiative has not only restored the markets infrastructure but also upgraded it to a cutting-edge facility, demonstrating Governments commitment to creating an enabling environment for businesses to thrive, she said.\n\nLocal Government and Public Works Minister, Daniel Garwe, said the commissioning of the market was a precursor to the second phase of another market to accommodate more people.\n\nThis event also marks the ground-breaking ceremony of the main market, which is going to accommodate 10 000 traders, he said.\n\nMinister Garwe said following the fire disaster that destroyed stock and stalls, President Mnangagwa directed the engagement of domestic investor, Masimba Holdings, in terms of the urban transformation policy to undertake reconstruction works.\n\nThe infrastructure, as you have witnessed, Your Excellency, is augmented by social amenities such as banks, Zimbabwe Republic Police Post, advanced security services, CCTV, advanced ablution facilities, advanced fire suppression systems, and availability of water infrastructure, among others, he said.\n\nWomen Affairs, Community, Small and Medium Enterprises Development Minister, Senator Monica Mutsvangwa, said the new market was set to transform the SMEs sector that has been looked down upon over the years.\n\nMinister of State for Provincial Affairs and Devolution for Harare Metropolitan, Charles Tawengwa, commended President Mnangagwa for restoring the livelihood of traders following the fire outbreak.\n\nYesterdays event was attended by Cabinet Ministers, permanent secretaries, Harare City councillors, captains of industry, Zanu PF leadership, and traders, among others.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/HE1-3.jpg",
            "description": "Zvamaida Murwira, Senior Reporter SMALL to Medium Enterprises (SMEs) are a key driver of economic growth, broad-based empowerment, job and wealth creation, contributing significantly to the country’s Gross Domestic Product, President Mnangagwa has said. Commissioning the Mbare Musika Traders Market Phase 1, a state-of-the-art facility that is set to benchmark the modern SMEs trading environment, […]",
            "time": "08:41",
            "date": "12 Apr 2025"
        },
        {
            "title": "President appoints two ministers",
            "url": "https://www.herald.co.zw/president-appoints-two-ministers-2/",
            "content": "Columbus Mabika, Herald Reporter\n\nPRESIDENT Mnangagwa has appointed Dr Evelyn Ndlovu Environment, Climate and Wildlife Minister with immediate effect.\n\nHe also appointed Cde Albert Nguluvhe as the Minister of State for Matabeleland South Provincial Affairs and Devolution.\n\nCde Albert Nguluvhe\n\nIn a statement last night, Chief Secretary to the President and Cabinet, Dr Martin Rushwaya, said: In terms of Section 104, Subsection 1 of the Constitution of Zimbabwe, His Excellency, the President, Cde Dr Emmerson Dambudzo Mnangagwa, has appointed Honourable Evelyn Ndlovu (MP), as Minister of Environment, Climate and Wildlife with immediate effect.\n\nIn a separate statement, Dr Rushwaya said: His Excellency the President of the Republic of Zimbabwe has in terms of Section 104, Subsection (1) of the Constitution of Zimbabwe, appointed Honourable Albert Nguluvhe (MP), as Minister of State for Provincial Affairs and Devolution, Matabeleland South Province, with immediate  effect.\n\nDr Ndlovu, who has been Minister of State for Matabeleland South Provincial Affairs and Devolution since 2023, replaces Dr Sithembiso Nyoni, who was removed from the ministry about two weeks ago.\n\nShe is a veteran politician who previously served as Minister of Primary and Secondary Education.\n\nCde Nguluvhe is Beitbridge East legislator, having first won the seat in the 2018 harmonised elections.\n\nIn October 2023, Cde Nguluvhe was named Chairperson of the Parliamentary Portfolio Committee on Defence, Home Affairs, Veterans of the Liberation Struggle and Security in the 10th Parliament of Zimbabwe.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/02/Dr-Evelyn-Ndlovu.jpg",
            "description": "Columbus Mabika, Herald Reporter PRESIDENT Mnangagwa has appointed Dr Evelyn Ndlovu Environment, Climate and Wildlife Minister with immediate effect. He also appointed Cde Albert Nguluvhe as the Minister of State for Matabeleland South Provincial Affairs and Devolution. In a statement last night, Chief Secretary to the President and Cabinet, Dr Martin Rushwaya, said: “In terms […]",
            "time": "08:41",
            "date": "12 Apr 2025"
        },
        {
            "title": "PVO Amendment Bill gets Presidential assent",
            "url": "https://www.herald.co.zw/pvo-amendment-bill-gets-presidential-assent/",
            "content": "Farirai Machivenyika, Senior Reporter\n\nPRESIDENT Mnangagwa has assented to the Private Voluntary Organisations Amendment Bill which becomes law.\n\nThe new Act was published in the Government Gazette yesterday by the Chief Secretary to the President and Cabinet, Dr Martin Rushwaya, under General Notice 620 of 2025.\n\nThe following law, which was assented to by His Excellency the President, is published in terms of subsection 6 (a) of section 131 of the PVO Amendment Act (No.1) of 2025, Dr Rushwaya said.\n\nThe new law will ensure the country complies with the recommendations of the Financial Action Taskforce to prevent the abuse of charities for the financing of criminal and terrorist activities.\n\nIt will also streamline the administration, accountability and transparency of charity organisations and provide a more detailed definition and interpretation of terms used in the principal Act.\n\nThe Act provides for the inclusion of the definition of funds or other assets, which is very wide-ranging, to include all financial assets and funds or other assets of any kind.\n\nIt also amended the definition of Private Voluntary Organisation to ensure it covers all relevant organisations that fall under this law, even when the coverage is confined to ensuring an entity is not being used to launder terrorist funds.\n\nIn view of the international dimension of terrorist and proliferation financing through the abuse of charities, a definition for Financial Intelligence Unit of the Reserve Bank is necessary because of the role the unit will play in assisting the Registrar of Private Voluntary Organisations in that regard, reads the preamble of the Act.\n\nThe definition of private voluntary organisation excludes from the scope of that term certain activities, for example, fundraising for schools or hospitals by or on behalf of the schools or hospitals concerned. However, even excluded activities may come within the scope of monitoring against money laundering if the activities are carried on by any high-risk entity.\n\nClause Six repeals the existing section of the principal Act requiring the registration of a PVO and replaces it with a more comprehensive provision that brings within the scope of registration certain trusts that were previously excluded from registration.\n\nIt requires organisations not previously within the scope of the PVO Act to now register as PVOs, but in these cases, time will be given for compliance.\n\nThis means those organisations not registered as trusts, but which receive external funding to pursue objects of a charitable nature, such organisations will be afforded a reasonable period to comply with the Act.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/09/martinrushwaya-451x380.jpg",
            "description": "Farirai Machivenyika, Senior Reporter PRESIDENT Mnangagwa has assented to the Private Voluntary Organisations Amendment Bill which becomes law. The new Act was published in the Government Gazette yesterday by the Chief Secretary to the President and Cabinet, Dr Martin Rushwaya, under General Notice 620 of 2025. “The following law, which was assented to by His […]",
            "time": "08:41",
            "date": "12 Apr 2025"
        },
        {
            "title": "PRAZ to boost economic growth",
            "url": "https://www.herald.co.zw/praz-to-boost-economic-growth/",
            "content": "Mukudzei Chingwere, Herald Reporter\n\nVice President Constantino Chiwenga has said the new PRAZ head office project goes beyond the construction of a physical structure but marks a bold step in strengthening national procurement systems, enhancing transparency, and driving institutional efficiency.\n\nHe was speaking at the groundbreaking ceremony for the new PRAZ head office in Harare yesterday.\n\nMost importantly, it underscores our unwavering commitment to sustainable development and innovation as we strive to build a modern, forward-looking Zimbabwe, said VP Chiwenga.\n\nThe Vice President also encouraged contractors to uphold high standards of workmanship and ethical practices throughout the construction period. His address served as a reminder of the broader implications of the project, which aims to bolster Zimbabwes procurement systems while contributing to local economic growth.\n\nI am particularly pleased to highlight that the design of this new facility incorporates sustainability principles and energy-efficient technologies, said VP Chiwenga.\n\nIn an era where climate consciousness is no longer optional but essential, this project reflects the countrys forward-thinking approach. It will serve as a lasting testament to our responsibility not just to current generations but to those who will inherit the Zimbabwe of tomorrow, said VP Chiwenga.\n\nAs we stand at the start of this exciting journey, let us reflect on the true significance of what we are initiating today. We are laying the foundation not only of a new building but of a renewed procurement system, one that is modern, transparent, and effective.\n\nMinister of State for Harare Metropolitan Province Cde Charles Tavengwa expressed his delight that PRAZ acquired their land legally and that they are building their head office in the Sunshine  City.\n\nContractor and Zimbuild chief executive officer Dr Tinashe Manzungu said they are happy to be entrusted with the project.\n\nWe are honoured to be entrusted with this significant project, which reflects our commitment to quality and innovation in construction, said Dr Manzungu.\n\nOur team is excited to collaborate with local stakeholders and ensure that this development meets the needs of the community while adhering to the highest standards of safety and sustainability. We look forward to making a positive impact through our work and contributing to the countrys growth.\n\nPRAZ chief executive officer Dr Clever Ruswa said the structure will be partially funded by PRAZ with support from the Government.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/VP-1.jpg",
            "description": "Mukudzei Chingwere, Herald Reporter Vice President Constantino Chiwenga has said the new PRAZ head office project goes beyond the construction of a physical structure but marks a bold step in strengthening national procurement systems, enhancing transparency, and driving institutional efficiency. He was speaking at the groundbreaking ceremony for the new PRAZ head office in Harare […]",
            "time": "08:41",
            "date": "12 Apr 2025"
        },
        {
            "title": "First Lady’s Widows Association transforms lives in Masvingo",
            "url": "https://www.herald.co.zw/first-ladys-widows-association-transforms-lives-in-masvingo/",
            "content": "Tendai Rupapa in MASVINGO\n\nA LIVELY atmosphere engulfed the Rupike community in Masvingo yesterday where hundreds of widows basked in a new lease of life they are enjoying through life-transforming income-generating projects initiated for them by empowerment proponent First Lady Dr Auxillia Mnangagwa under the auspices of her Widows Association.\n\nAll the seven districts of Masvingo Province benefited and Amai Mnangagwa yesterday visited Rupike in Masvingo district as she assessed the success of her interventions.\n\nOther districts, however, came along to share their success stories.\n\nLast year, as patron of the First Ladys Widows Association, Dr Mnangagwa, through her Angel of Hope Foundation and its partners, availed an assortment of goods to widows in all provinces to kick-start small-scale retailing businesses in their districts aimed at economically empowering the vulnerable group.\n\nThe women are now enjoying the fruits of their hard work.\n\nFirst Lady Dr Auxillia Mnangagwa being shown the multiplied goats being reared by widows who are beneficiaries of her empowerment scheme under the First Ladys Widows Association in Masvingo yesterday\n\nMasvingo becomes the second province to be visited by the mother of the nation for a follow-up of the projects.\n\nThe highly subscribed progress visit came along with a legal clinic that comprised of tents manned by officers from the First Ladys National Gender-Based Violence Call Centre 575 and the Police Victim Friendly Unit who were assisting people.\n\nThere were also experts from the Master of the High Court who shared critical information to curb abuse and worrying cases where widows and orphans were disinherited of their wealth by greedy relatives.\n\nUnlike in the past when widows were branded husband snatchers and left to wallow in poverty, yesterday they were exuding confidence and seeking to share information on how the First Lady had restored their dignity and allowed them to set foot on the train of development.\n\nIn Rupike, beneficiaries are rearing 600 broilers, 500 road runners and over 200 goats.\n\nThey used funds they realized from the sale of groceries they were given by the First Lady to start the projects. As the shops continue to thrive, the women have been banking the profits and currently have a bank balance of US$20 000.\n\nIn her remarks, Dr Mnangagwa said she was gratified with the hunger for success shown by the beneficiaries of her programmes in Masvingo and encouraged them to keep working hard to realise more success.\n\nI brought about the First Ladys Widows Associations in all provinces seeking to see whether since your husbands have died, the homes still dignified. As a mother are you still walking the correct dignified path? When left alone following the death of your spouse, you will shoulder all the responsibilities for the family. However, God will never give you a burden that you cannot carry. I then said let me go out there and tell these women that you are important. Amai makakosha munodzora, muri muchengeti uye munochengeta nekubatsira even vasiri vekwenyu. You help even in instances that do not benefit you. I then ask again as to whether you are the woman who is being spoken about, or you are the one who is living recklessly after the death of your husband snatching other peoples husbands. This is where the test is, as people want to know how you are faring. Vanhu vakatotarisa kuda kuona magariro amurikuita as a widow. A mother is not selective, she is a defender and builder even to neighbours. It is not a crime to be widowed. Accept the situation. To men, if you have a family, fix all the challenges while you are still alive seeing to it that children are brought up well. Prepare for your children because some of your wealth will be taken away by greedy relatives, making it difficult for your children to live like others out there, she said.\n\nThe broiler chickens being reared by widows under First Lady Dr Auxillia Mnangagwas widows association in Masvingo yesterday\n\nDr Mnangagwa implored women to use their hands to earn good names in their communities.\n\nParticipate in projects that give you income and good names in the communities. On my 575 Gender-based Violence toll-free line I am receiving calls to the effect that some widows are being promiscuous and bringing all types of men home. They are the same men who are raping their children and some of them start dating your daughters. Does it augur well for a mother and her daughter to share a man? These boyfriends destroy and waste away the inheritance that was left behind by your husbands. Women, let us stay away from embarrassing things which earn us bad names, she said.\n\nDr Mnangagwa did not hide her appreciation of the womens hard work.\n\nI am gratified with the work that you are doing. When I brought up these projects, I told you that I would come back for a follow-up. Masvingo you have made me proud and even those who helped me with the resources I gave you will be happy seeing your zeal to prosper. You did not embarrass me. Continue working in groups and in harmony, she said.\n\nBikita district also came and shared what it accomplished.\n\nTheir representative Mrs Matimba said they now boast 2 400 chickens which they are selling in boarding schools and restaurants around the district.\n\nThey also have close to US$ 10 000 cash and intend to start fish farming and a goat project soon.\n\nThe broiler chicks being reared by widows under the First Lady Dr Auxillia Mnangagwas widows association in Masvingo yesterday\n\nMrs Chengeto Shindi representing Chiredzi said;\n\nAmai we took the groceries and road runners you gave us to the district. We sold the groceries and reared chickens before starting a pass-on scheme where we gave one another the chickens in our wards. The profits we got from selling groceries we started a fushai scheme and a started goat-rearing project, she said.\n\nSaid a representative of Chivi District: After selling the groceries you gave us Amai; we realised a substantial amount of money which we distributed to all the constituencies in our district. In the constituencies, they used the money to start other projects which are flourishing.\n\nMwenezi District was over the moon.\n\nIts representative described Amai as a worker, organiser, manager, adviser and nation builder (WOMAN).\n\nAmai our members are 650 and we are all benefiting from your generosity. We are rearing chickens and keeping money. We will not let you down. Amai we are awestruck by your hard work and love.\n\nA representative of Gutu District, Mrs Makuwaza gave a brief on what they did with the groceries received from the First Lady.\n\nShe said after selling groceries, they realized over US$3 000 which they now want to use to start other projects while continuing with their retail business.\n\nZaka district was also thankful to the mother of the nation.\n\nTruly as widows, we had bad names but you came and erased them and made us walk on the correct path. We are now dignified people through working hard for ourselves. Amai from selling our products we generated money which we want to use for piggery and poultry projects, she said.\n\nPart of the widows follow proceedings during their interactive session with the patron of First Ladys Widows Association, First Lady Dr Auxillia Mnangagwa, where they also benefited from a legal clinic in Masvingo yesterday\n\nMrs Tambudzai Mutume (57) was among the widows who expressed gratitude to the First Lady for her life-transforming initiatives.\n\nMy husband died in 2010 and I was left with five children. The First Lady gave us groceries and chickens which we sold and realized money which we kept and we are rearing more chickens and used part of the money to start goat rearing project, she said.\n\nMrs Elizabeth Marimira the chairperson of the project in Ward 23 was equally ecstatic.\n\nI lost my husband in 2017 and was left with seven children. Out of my children, only three were grown up. We were given groceries which we sold and started chicken projects and goat rearing. Before this, most widows would take other peoples husbands and frequent bars but since we started these projects no one ever did this as we were married to our projects. We are benefitting from the projects and we are now able to send our children to school. No widow will ever frequent bars and we thank the First Lady for her benevolence, she said.\n\nThe First Lady donated packs of vegetable combo seeds to the women for horticulture farming.\n\nShe further donated tonnes of wheat to communities.\n\nMrs Senzeni Kapanga from the 575 GBV call centre, which is stationed in the office of the First Lady underscored the need for families to live in peace at all times.\n\nAmai through the call centre is assisting people in a lot of ways but the biggest thing she is focusing on is staying well in the homes, in marriages, in families and communities. Amai varikukurudzira runyararo vachiti no to gender based violence. If we are not living well in our homes, it also means even the children are not happy. It also means even the community is not safe. If all these spaces are not safe, it therefore means no one will get the time to work. You can call on 575 and get help. In the call centre, some agents are multi-lingual. We are happy to have come here today where there are widows because we receive a lot of reports against them.\n\nMost of the reports we are getting is that we as mothers are not controlling ourselves and we are doing things that are not expected of us. We are engaging in harlotry and this is affecting our families, children and communities.\n\nMost people who phone are children who would have been bashed. When going further to assist the child, it will come out that the mother was being promiscuous openly and the child was following suit thinking that it was how it was done. We are also encountering mothers who are not taking care of their children. A child complains of being raped and the mother sends the child to that person. Some mothers are protecting their relations with lovers even after they would have raped their child. We have a case where someone concealed a rape case to protect a boyfriend only for the protected man to continue doing so until the child contracted a sexually transmitted infection, she said.\n\nA Masvingo police Victim Friendly Unit representative said cases of rape, domestic violence and statutory rape were on the rise. She urged women to report such crimes timeously without fear.\n\nPlease know that every man is a potential abuser, therefore do not leave children with any men, including relatives. Look after our children, she said.\n\nMasvingo Provincial Affairs and Devolution Minister Ezra Chadzamira paid tribute to the First Lady for her empowerment initiatives.\n\nWe are grateful for your income-generating projects Amai. You have embarked on a lot of projects, which are meant to ensure that the country becomes an upper-middle-income economy by 2030. You are complementing the work being done by the President. We are very grateful because you are leaving no one and no place behind. You have impacted the lives of women, the elderly, children, widows, and everyone. You have transformed the lives of people from marginalised communities. You started Agric4She which has given birth to a lot of success stories countrywide. You empowered seven districts in our province with the Widows Association Project, and today we are witnessing success stories from one of the districts. You have chosen to come to the periphery of Masvingo. To you, distance is not a barrier. You are always travelling across the country even in hard-to-reach areas to make sure that everyone lives a decent life, he said.\n\nMinister Chadzamira praised the First Lady for playing a role in the preservation of the countrys traditional values.\n\nYou are also playing a pivotal role in the preservation of our traditional cultural values. You are teaching women, men and children to dress decently, and we are seeing the results of your teachings. We would also like to thank you for bringing us food. You always teach us to earn a living through using our hands, he said.\n\nBulawayo-based arts group IYASA provided edutainment.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/FL1.jpg",
            "description": "Tendai Rupapa in MASVINGO A LIVELY atmosphere engulfed the Rupike community in Masvingo yesterday where hundreds of widows basked in a new lease of life they are enjoying through life-transforming income-generating projects initiated for them by empowerment proponent First Lady Dr Auxillia Mnangagwa under the auspices of her Widows Association. All the seven districts of […]",
            "time": "08:41",
            "date": "12 Apr 2025"
        },
        {
            "title": "ZNA welcomes new  Commander in handover ceremony",
            "url": "https://www.herald.co.zw/zna-welcomes-new-commander-in-handover-ceremony/",
            "content": "Columbus Mabika, Herald Reporter\n\nTHE handover and takeover parade for newly-appointed Zimbabwe National Army Commander, Lieutenant General Emmanuel Matatu, was held yesterday at Charles Gumbo Barracks in Harare.\n\nLt-Gen Matatu took over from Lieutenant General (Retired) Anselem Nhamo Sanyatwe, who was appointed Minister of Sports, Recreation, Arts and Culture, taking over from Dr Kirsty Coventry, who will become the President of the International Olympic Committee in June following her recent election.\n\nPresiding over the exchange of command between the two as chief witness, the Commander of the Zimbabwe Defence Forces (ZDF), General Philip Valerio Sibanda, said the ZDF will continue to ensure the country has an enabling environment that guarantees security for citizens and visitors.\n\nThe people of Zimbabwe have high hopes and expectations for a better future, and as the Zimbabwe Defence Forces, we should ensure that a conducive and peaceful environment prevails so that all government developmental programmes are carried out without any hindrance.\n\nCitizens of this great nation and its visitors alike should enjoy real security and develop a sense of belonging to this beautiful country, he said.\n\nWe should all, therefore, understand the governments vision for development in its entirety in order to contribute meaningfully as we strive to improve the lives and security of our people.\n\nIn this regard, the modernisation of the ZDFs capabilities continues to be a work in progress among my priorities.\n\nGeneral Sibanda said the two commanders, whose change of command took place yesterday, were of a high calibre, with unquestionable loyalty and reputation.\n\nTheir dedication to duty is beyond reproach; both are founding members of our defence forces who were attested into the army at its inception.\n\nSince then, they have served with undeniable loyalty, honour, and dignity in various capacities, he said.\n\nGeneral Sibanda called on Lt Gen Matatu to prioritise principled leadership, which is responsive to the dictates of the current operating environment.\n\nRegular interaction with troops through various activities, he said, was crucial to tap their energy and zeal. Accepting command, Lt Gen Matatu said he was up to the task.\n\nIt is with a deep sense of humility and honour that I stand before you today to accept the command of the Zimbabwe National Army. This momentous occasion is not just a personal achievement, but more importantly, a reflection of the collective efforts and support I have received from my commanders, my fellow workmates, subordinates, and my family throughout this long journey, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/ZNA.jpg",
            "description": "Columbus Mabika, Herald Reporter THE handover and takeover parade for newly-appointed Zimbabwe National Army Commander, Lieutenant General Emmanuel Matatu, was held yesterday at Charles Gumbo Barracks in Harare. Lt-Gen Matatu took over from Lieutenant General (Retired) Anselem Nhamo Sanyatwe, who was appointed Minister of Sports, Recreation, Arts and Culture, taking over from Dr Kirsty Coventry, […]",
            "time": "08:41",
            "date": "12 Apr 2025"
        },
        {
            "title": "EDITORIAL COMMENT – ICC visit: Another confidence vote on Zim",
            "url": "https://www.herald.co.zw/editorial-comment-icc-visit-another-confidence-vote-on-zim/",
            "content": "IT is not every day that a country deemed small in the global sporting matrix gets to be the focus of attention of one of the worlds biggest international federations.\n\nYes, Zimbabwe might not be a global sporting powerhouse whether one is looking at it from a rugby, football, netball, athletics, cricket or boxing perspective.\n\nBut, this week our beautiful country has been the focal point in the sport they call the gentlemans gamecricket.\n\nInternational Cricket Council (ICC) bigwigs, led by chairman Jay Shah, are in the country for the federations series of high-level meetings.\n\nAway from the fall of wickets and the bid to put runs on the scoreboard, Zimbabwe Cricket (ZC) have scored big by being nominated hosts of the important ICC meetings.\n\nThe meetings, details for which the ICC top-brass are, in line with their tradition, keeping a tight lid on, began in Harare and will move to the majestic Victoria Falls today and tomorrow.\n\nWhile the meetings are centred on serious global cricket business, ZC in particular and Zimbabweans at large will no doubt be happy to see this country benefiting from tourism.\n\nAnd being the focal point of sports tourists coming to dispense with ICC business is just what the doctor may have ordered for Zimbabwe.\n\nThus, the onus is on ZC chairman Tawengwa Mukuhlani and his board to ensure they make the most of this huge vote of confidence on Zimbabwe by the ICC top brass.\n\nThis is because the visit by the ICC board members for the organisations high-level meetings in Zimbabwe marks a huge milestone for the country as a tourism as well as a conference destination.\n\nFor the first time in the history of the game, Zimbabwe is hosting the key figures in international cricket leadership for the committee and board meetings.\n\nThe meetings are focusing on critical governance, strategic and operational matters shaping the future of the sport worldwide.\n\nThe choice of Zimbabwe as a venue of the ICC gatherings is a major vote of confidence in the country and also showcases the Southern African countrys growing role in global cricket. And that the ICC select venues for their board meetings based on several factors, including the significance of the location in the cricketing world, logistical convenience and the ability to host high-profile events, puts into perspective the kind of endorsement Zimbabwe has received.\n\nThese decisions often reflect strategic goals, such as promoting cricket in specific regions or celebrating milestones.\n\nThe ICC also consider the facilities available at the venue, ensuring they meet the requirements for hosting international delegates.\n\nZimbabwe ticked the boxes!\n\nThe organisation has held meetings in various notable locations over the years. Dubai, for instance, has been a frequent host, given its status as the ICCs headquarters.\n\nMajor cricketing nations which include India, England and Australia, have also hosted such meetings, reflecting their prominence in the cricketing world.\n\nICC meetings do not just take place anywhere; they are often hosted in cities with strong cricketing ties or strategic importance to the federations goals.\n\nZimbabwe is part and parcel of the wider ICC strategic goals, given the country has also hosted several global events in the last few years.\n\nAs the gatherings take place in the cosy conference rooms, there are several benefits that come with welcoming such an important delegation, comprising representatives from more than 15 countries.\n\nICC meetings can significantly impact the host countrys cricketing culture in several ways, which include increased global recognition, development opportunities, cultural exchange prospects, economic benefits as well as act as an inspiration for aspiring cricketers.\n\nAbove all, it is a tourism tonic, which the Zimbabwe Tourism Authority (ZTA) is likely to and should in fact, leverage.\n\nHosting ICC meetings places a country in the international spotlight, showcasing its cricketing infrastructure and commitment to the sport.\n\nThis can boost the nations reputation within the cricketing community.\n\nDuring the visit, the ICC leadership is likely to get first hand appreciation of the infrastructure and cricket development programmes that ZC are pursuing.\n\nThis is also a chance for the domestic cricket authorities to lobby for support as the meetings often lead to discussions about investments in cricketing facilities and programmes.\n\nZimbabwe are set to host the Under-19 Cricket World Cup next year as well as co-host the 2027 senior mens cricket World Cup.\n\nAs a result of these commitments, there are various projects that are on the ground in preparation for these events, including the construction of the 10 000-seater Victoria Falls International Cricket Stadium in the resort town.\n\nThere has also been a hint from Shah that a deal could be worked out between ZC and the ICC on the on-going construction of the Mosi-Oa-Tunya International Cricket Stadium in Victoria Falls.\n\nThrough persuasion and diplomacy by Zimbabwe Cricket officials, hosting the games leadership in the country could spur infrastructure improvements such as upgraded stadiums and training facilities, benefiting local players and fans in the long run.\n\nZimbabwe as the host country has the chance to share its unique cricketing traditions and learn from others, fostering a richer cricketing and sporting culture.\n\nThe presence of international cricketing figures and discussions about the sport can inspire young players and fans, encouraging greater participation and enthusiasm for cricket.\n\nHosting such a bigger number of delegates at one go could stimulate the local economy through tourism, hospitality, and related industries, indirectly supporting cricket development.\n\nThe tourism and hospitality industries should bring their A-game during this period. This is a big chance for tour operators in Victoria Falls to market the country to the world.\n\nThis is a platform to showcase the beauty, warmth and hospitality of our nation to the rest of the world.\n\nAnd ZC, ZTA and all well-meaning Zimbabwean tourism stakeholders must welcome the platform which the ICC visit presents, with warm and open arms.\n\nBut the mere fact that the ICC meetings are being held in Zimbabwe is already a huge win for the country, amid the belief that this nation can play a pivotal in the growth of cricket around Africa.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Jay-Shah-.jpg",
            "description": "IT is not every day that a country deemed small in the global sporting matrix gets to be the focus of attention of one of the world’s biggest international federations. Yes, Zimbabwe might not be a global sporting powerhouse whether one is looking at it from a rugby, football, netball, athletics, cricket or boxing perspective. […]",
            "time": "08:41",
            "date": "12 Apr 2025"
        },
        {
            "title": "Visually impaired lawyer defies odds",
            "url": "https://www.herald.co.zw/visually-impaired-lawyer-defies-odds/",
            "content": "Fidelis Munyoro, Chief Court Reporter\n\nThe soft warmth of the midmorning sun bathed Harare in a golden glow, a city bustling on the cusp of winter.\n\nYet, for one man, this light carried a deeper meaninga warmth that transcended the season, igniting the culmination of a lifelong dream.\n\nLoncio Banda, a 27-year-old visually impaired man from Kwekwe, felt this warmth as he stepped into the revered halls of the High Court, not as a spectator, but as a sworn-in lawyer.\n\nIt was a moment he had envisioned since his youth, a dream realised in defiance of the odds stacked against him.\n\nLast year, Banda graduated with a law degree from the University of Zimbabwe, a milestone that marked the beginning of a new chapter in his life.\n\nThis week, that chapter came alive as he stood before Justice Maxwell Takuva and took the solemn oath of a judicial officer, pledging to uphold the laws of the land with the dignity and the honour the profession demands.\n\nIn that moment, he not only joined the ranks of lawyers in the country, but also continued the legacy of visually impaired individuals who have shattered barriers in this noble field.\n\nWith quiet pride and unwavering confidence, Banda credited his triumph to the solid support of his parents, siblings, friends, and loved ones.\n\nI am very happy to be admitted as a lawyer of the High Court, he said, his voice carrying the weight of perseverance.\n\nIt was my wish to become a lawyer. I am indebted to all those I have mentioned for smoothing my journey through the tempests of life. I have done it.\n\nBandas journey is not merely a personal victory; it is a symbol of hope for those living with disabilities across the nation.\n\nHe spoke candidly about the challenges faced by people with disabilities, the biases they endure, and the strength it takes to rise above them.\n\nSometimes people look down upon us, he admitted, but this journey is proof that disability is not inability. With determination and zeal, I have reached the heights I always dreamt of, and I want others to know that they too can.\n\nAmong those who witnessed this monumental occasion was Bandas partner, Rudo Matanhire, herself a testimony to resilience and achievement.\n\nAlso visually impaired, Matanhire graduated from the University of Zimbabwe with a Bachelor of Science in Social Work.\n\nTheir shared journey began within the universitys walls, where their relationship blossomed into a partnership of mutual encouragement and shared aspirations.\n\nThe milestone Loncio has achieved demonstrates that people with disabilities are not limited academically or otherwise, Matanhire said, her words carrying a quiet strength.\n\nWe have an inner power that drives us forward, a power that allows us to stand shoulder to shoulder with anyone, regardless of their abilities. This is a message to the world: do not look down upon us, but recognise the strength within us.\n\nBandas story is also one of camaraderie and support. Tatenda Muzhuri, who served as Bandas assistant during his early years of study, spoke of his unyielding determination.\n\nHe is a hardworking young man, Muzhuri said with admiration.\n\nHe never lets his disability define him or limit his ambitions. His passion for law is unmatched, and I am confident he will achieve even greater things in this noble profession.\n\nIndeed, Bandas passion for the law burns brightly, a flame that no challenge can extinguish. His journey is not just a personal triumphit is a statement, a challenge, and an inspiration.\n\nIt reminds society that barriers exist only to be broken, and that the human spirit, when fuelled by determination and support, can achieve the extraordinary.\n\nFor Banda, the High Court is not just a destination, but the beginning of a journey that promises to inspire countless others to dream, to strive, and to succeed.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Banda.jpg",
            "description": "Fidelis Munyoro, Chief Court Reporter The soft warmth of the midmorning sun bathed Harare in a golden glow, a city bustling on the cusp of winter. Yet, for one man, this light carried a deeper meaning—a warmth that transcended the season, igniting the culmination of a lifelong dream. Loncio Banda, a 27-year-old visually impaired man […]",
            "time": "08:41",
            "date": "12 Apr 2025"
        },
        {
            "title": "Why you have to  pay for blood that’s donated for free",
            "url": "https://www.herald.co.zw/why-you-have-to-pay-for-blood-thats-donated-for-free/",
            "content": "Rumbidzayi Zinyuke, Health Reporter\n\nMost Zimbabweans are puzzled as to why they have to pay for blood even though it is donated freely by citizens eager to save lives.\n\nSo, why does that same blood come with a price tag when needed in hospitals?\n\nAccording to the National Blood Service Zimbabwe (NBSZ), the cost attached to blood has nothing to do with the blood itself.\n\nInstead, the price reflects the complex and costly process of making that blood safe and suitable for transfusion.\n\nWhile blood itself is donated freely by generous individuals, the process of making it safe and available for transfusion involves significant costs.\n\nThese costs are essential to maintaining the integrity of the blood supply chain. Its important to understand that once blood is donated, it does not go directly for transfusion. Instead, it undergoes rigorous testing for infections, blood grouping, separation into components, safe storage and then  distribution.\n\nThese processes require advanced equipment, skilled scientists personnel, specialised storage facilities and strict adherence to international safety standard, said Ms Lucy Marowa, NBSZ chief executive officer.\n\nBeyond testing, the blood is then separated into its various components that include red blood cells, plasma, and platelets.\n\nThis is done so that each unit can be used to treat multiple patients with different medical needs.\n\nStorage is another crucial part of the process, said Ms  Marowa.\n\nShe said blood products had a limited shelf life and required constant refrigeration under specific conditions. Any lapse in storage standards can render the blood unusable.\n\nIn 2018, the Government launched a free blood initiative which ensures that blood is available free of charge to all patients in public hospitals.\n\nThe initiative aims to provide free blood and blood products to vulnerable groups in public health institutions.\n\nIt is therefore important to note that no patient pays for blood in public hospitals because the blood is paid for by the Government of Zimbabwe.\n\nOnce blood is dispatched from the NBSZ to healthcare facilities, it is managed by those institutions and NBSZ does not have direct control over how the blood is distributed or accessed by patients. However, NBSZ remains committed to working closely with healthcare providers to ensure transparency and efficiency in the system, Ms Marowa added.\n\nShe stressed that the cost patients were being asked to pay was strictly to recover operational expenses as the organisation did not profit from the blood supply.\n\nHowever, blood and blood products remain free for blood donors and some of their immediate family members as part of the blood components beneficiary policy.\n\nUnder this policy, blood donors who have given blood 10 times or more, with their last donation made within the past 12 months, are entitled to free blood for their biological parents, children, or spouse in the event that they require blood for transfusion purposes.\n\nBlood donors generosity not only saves lives but strengthens the foundation of a healthy and thriving nation, said Ms Marowa.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/05/Ms-Lucy-Marowa.jpg",
            "description": "Rumbidzayi Zinyuke, Health Reporter Most Zimbabweans are puzzled as to why they have to pay for blood even though it is donated freely by citizens eager to save lives. So, why does that same blood come with a price tag when needed in hospitals? According to the National Blood Service Zimbabwe (NBSZ), the cost attached […]",
            "time": "08:41",
            "date": "12 Apr 2025"
        },
        {
            "title": "Mapeza unfazed by worst start",
            "url": "https://www.herald.co.zw/mapeza-unfazed-by-worst-start/",
            "content": "Mugove Chigada, Zimpapers Sports Hub\n\nTHEYVE built a reputation on ruthlessness, but FC Platinum have fired blanks where it matters most  in front of goal.\n\nNow, with just two strikes in five matches, Norman Mapezas men find themselves staring at their lowest scoring start in their first five games since their top-flight arrival in 2011.\n\nBut while the attack misfires, the defence stands tall  second best in their top-flight history at this stage of the season.\n\nFor the record, the platinum miners have never failed to reach at least six goals at this stage in any of the 12 seasons.\n\nSix goals scored in 2016 and 2017 after five games stood as the record low until this gloom.\n\nMapeza says they are fully aware of the situation and need to turn around their goalscoring fortunes.\n\nThe goals are not coming, but we have been talking about it. Thats why you heard me talking about belief, its about belief, its about confidence. We will get the goals but we will need to be patient, Mapeza said.\n\nCan they be brutal at Mandava against GreenFuel today, and miraculously deliver the magic five goals to drop the unwanted record?\n\nIf they can, it will become the second-highest score by FC Platinum in their first six games while six goals will equal the record win they set against Tenax (6-1), achieved within the first six games during the 2021/22 season.\n\nIn summary, thats why Mapezas charges recovery will be a process.\n\nBut such has been FC Platinums pedigree that in a season they have had an average 0.4 goals scored per game, they can be relentless as the season progresses.\n\nAnd they remain one of the bookmakers favourites for the league title.\n\nThe tables will turn, said Mapeza.\n\nMatch day six comes with its own benchmarks.\n\nFor the record, 2013 was the season FC Platinum had the best scoring season in the first six games of the season with 13 goals, an average 2.2 goals per game.\n\nIt was a season they opened with a 2-1 win over Buffaloes, 4-1 win over How Mine, 2-1 win over Black Mambas, 2-1 win over Chicken Inn, 1-0 defeat to Shabanie Mine and 3-0 win over Triangle.\n\nA lot has changed.\n\nIf you look at the statistics, locally, which team has scored 10 goals? We are still on the same page. We are still trying to negotiate our way to get goals.\n\n . . . We have been creating chances, and thats one positive we have not been talking about. Its a process, said Mapeza.\n\nTo their credit, for the 2025 season, the former champions have managed to shut out most teams and collected four points from four draws, conceding a goal in one of the draws, and edging Manica Diamonds 1-0 in their only win of the season.\n\nDefensively, they are special.\n\nApart from FC Platinum, only Simba Bhora and MWOS have conceded just a goal.\n\nThe 2025 season became their second-best season in terms of goals conceded in the first five games of the season.\n\nOnly in 2018 were they better, with no goals conceded after the same number of games.\n\nIn that year, they were only breached in their sixth game against Harare City, a 3-1 win for the platinum miners.\n\nIf FC Platinum can go on and keep a clean sheet against GreenFuel at Mandava on Saturday, they will equal their record of the lowest goals conceded in the first six games  one goal  since they started playing in the Premiership in 2011.\n\nIt was in 2015 that FC Platinum conceded the most goals in their first six games of the season at 10, and the only year they had a negative goal difference of minus two after that number of games.\n\nThat also became FC Platinums worst start to the season in six games as they only managed four points, three points fewer than this season.\n\nAt this stage, it may be fair to say, you can never rule out Mapeza and FC Platinum.\n\nJustification lies in that, in FC Platinums best four starts to the season after six games since promotion  in 2018, 2016, 2013 and 2024  it was only in 2018 that they went on to be crowned champions.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Mapeza-680x380.jpg",
            "description": "Mugove Chigada, Zimpapers Sports Hub THEY’VE built a reputation on ruthlessness, but FC Platinum have fired blanks where it matters most – in front of goal. Now, with just two strikes in five matches, Norman Mapeza’s men find themselves staring at their lowest scoring start in their first five games since their top-flight arrival in […]",
            "time": "08:41",
            "date": "12 Apr 2025"
        }
    ]
}