{
    "news": [
        {
            "title": "Unity transforms Zim across sectors: President",
            "url": "https://www.herald.co.zw/unity-transforms-zim-across-sectors-president/",
            "content": "Wallace Ruzvidzo, Herald Reporter\n\nZIMBABWE is recording evident transformation across all sectors of the economy through unity and a common purpose, President Mnangagwa has said.\n\nIn his Unity Day message, the President said Zimbabwe was unapologetically marching forward, adding that unity, peace and love continue to be the guiding principles of the countrys non-stop development under the Second Republic.\n\nThrough oneness and common purpose, we are recording evident transformation in every facet of the economy village by village, ward by ward and sector by sector, said President Mnangagwa.\n\nThe policies and programmes of the Second Republic are galvanising us all towards increased production and productivity, and propelling us to the realisation of Vision 2030.\n\nBrick by brick, stone upon stone and step by step, we are unapologetically marching forward.\n\nZimbabwe, said President Mnangagwa, has stood firm and united in the face of adversity.\n\nNumerous attacks and ill-will from the countrys erstwhile detractors have all come to nought due to the peoples oneness.\n\nThe attacks have been seen even during the peoples fight for the sovereign reclamation of their land.\n\nAdded the President: Presently, our nation is moving forward with fervent hope and determination to build a more prosperous future for all Zimbabweans, leaving no one and no place behind.\n\nWe remain inspired to continue demonstrating unparalleled national strength, resilience and unflinching patriotism to our country.\n\nThe numerous attacks and ill-will we have endured from detractors over the years, were aimed at sowing seeds of division and disunity. However, the people of this great nation have remained vigilant and resolute.\n\nPresident Mnangagwa said it was heartening to note that self-hate, violence, tribalism and regionalism had been rejected in the countrys national psyche and culture.\n\nThis years commemorations mark 37 years since the signing of the Unity Accord.\n\nThe President said Zimbabweans embraced and embedded unity, peace, self-belief and confidence in their identity, as the sons and daughters of this sacred soil.\n\nThis national consciousness is now imprinted in our individual and collective mind-set, embodied by our national development philosophy, Nyika inovakwa, inotongwa, inonamatirwa nevene vayo/ Ilizwe lakhiwa, libuswe, likhulekelwe ngabanikazi balo.\n\nAs the people of Zimbabwe, we are entrenching our identity as an independent, sovereign, free, united and truly liberated African people, he said.\n\nZimbabwe remains a composite and solid unitary State despite its diverse norms, customs, languages and culture, said the President.\n\nHe said from Zambezi to Limpopo, from Plumtree to Mutare, and across the most remote villages in the country, people sing with pride one national anthem and fly one national flag.\n\nWe are diverse but one. To this end, this past week saw my administration concretise the constitutionally enshrined obligation to give rights to every Zimbabwean citizen to hold and occupy agricultural land.\n\nHence, the bold decision to empower the beneficiaries of the Land Reform Programme through the issuance of Deeds of Transfer that will unlock the value of our land.\n\nThrough this historic act, these new tenure documents will be issued to the over 23 500 A2 and over 360 000 A1 farmers.\n\nThe celebration of this years Unity Day is, therefore, equally a jubilant occasion affirming that the land is now irreversibly with its people, and the people with their land, said President Mnangagwa.\n\nUnity, patriotism, peace, love and respect, he said, remain indispensable values in the countrys development matrix.\n\nTherefore, the President called on all citizens to commemorate the national Unity Day with sober reflections and recommit to the rich national heritage embodied in the historic accord of 1987.\n\nNever, never, never again, should anything ever divide us. United we must stand, strong and solid as the walls of Great Zimbabwe, from which we derive our nations name.\n\nHand in hand, in unity, from village to the provincial level; sector by sector and industry by industry, Vision 2030 shall surely become a reality, said President Mnangagwa.\n\nHe also wished the nation merry festivities, but implored everyone to exercise caution.\n\nAs we celebrate this important national holiday, let us do so responsibly and safely, especially for the travelling and commuting public.\n\nOn my own behalf, that of Government and indeed my family, I wish all fellow citizens, at home and abroad, a merry Christmas and a prosperous 2025.\n\nMay the new year ahead bring hope and greater prosperity for our motherland, Zimbabwe, President Mnangagwa said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/President-Mnangagwa-2.jpg",
            "description": "Wallace Ruzvidzo, Herald Reporter ZIMBABWE is recording evident transformation across all sectors of the economy through unity and a common purpose, President Mnangagwa has said. In his Unity Day message, the President said Zimbabwe was unapologetically marching forward, adding that unity, peace and love continue to be the guiding principles of the country’s non-stop development […]",
            "time": "06:28",
            "date": "23 Dec 2024"
        },
        {
            "title": "‘More roadblocks, stop and searches during holiday’",
            "url": "https://www.herald.co.zw/more-roadblocks-stop-and-searches-during-holiday/",
            "content": "Herald Reporters\n\nPolice officers have been heavily deployed on all major roads, residential areas, central business districts and places where people converge to make merry to ensure peace and order, Police Commissioner-General Godwin Matanga has said.\n\nHe said there will be heightened roadblocks, traffic blitzes, stop and searches, motorised and cycle patrols to curb crime and road traffic accidents.\n\nThe Zimbabwe Republic Police takes note that the public is now geared for the 2024-2025 festive season by engaging in various socio-economic activities, Comm-Gen Matanga said.\n\nThe volume of traffic on the roads will certainly increase. Road traffic accidents and violations of road rules and regulations will obviously take centre stage.\n\nIn this regard, the Zimbabwe Republic Police has made adequate deployments to ensure that peace prevails throughout the period.\n\nHe urged all stakeholders, who include transporters, to prioritise the safety and security of the public.\n\nAs road safety campaigns are being conducted, the Zimbabwe Republic Police shall impound all defective and unroadworthy vehicles.\n\nIn the same measure, the commuting public are discouraged from boarding non-public service vehicles for their own safety and other travellers. May I caution drivers to avoid overloading of vehicles and speeding on the roads, Comm-Gen Matanga said.\n\nRoad safety campaigns will include components of education to prevent accidents, promote compliance with road rules and regulations and strict enforcement of the countrys laws to ensure no pirate taxis or mushika-shika vehicles are allowed to pass through police check points.\n\nHowever, as of yesterday, kombis were still plying major highways, in defiance of regulations that prohibit them from travelling for 60km outside the CBD.\n\nA number of road accidents have already been recorded in the last week, with over 10 people dying and many others injured in three separate road accidents.\n\nYesterday morning, two people died while two others were injured when three buses  Rimbi, Blue Circle and Tombs  were involved in a freak accident just before Bubi along the Harare-Masvingo-Beitbridge highway.\n\nA Rimbi Bus reportedly rammed onto the trailer of a stationary Tombs bus after its driver had lost control and hit a stationary Mbokodo bus, which then overturned, leaving two passengers seriously injured.\n\nThe pile up allegedly started after a Tombs bus developed a mechanical fault and pulled off the road after hitting a donkey around 4am.\n\nThe Mbokodo bus then stopped to rescue stranded passengers who were in the Tombs bus, and then came a Rimbi bus, which hit the Tombs bus trailer, forcing it to overturn.\n\nMasvingo provincial police spokesperson Inspector Kudakwashe Dhewa said bodies of the deceased were taken to Beitbridge District Hospital mortuary while the injured were taken to Beitbridge District Hospital.\n\nIt is not clear where all the three buses were going.\n\nMeanwhile, Comm-Gen Matanga said as the rainy season has started, the motoring public should exercise caution as some roads may be slippery.\n\nHe also challenged motorists and individuals not attempt to cross flooded rivers and bridges to curb drowning incidents.\n\nMay I also caution public service vehicle operators, both local and cross border, to minimise night travelling as most of the fatal road traffic accidents are being recorded at night due to vision and observation challenges, said Comm-Gen Matanga.\n\nHe also encouraged individuals and institutions involved in the importation and exportation businesses to lead by example and officially declare all goods at the countrys ports of entry and exit.\n\nThe law will take its course without fear or favour on transporters who are involved in smuggling activities and those using undesignated points along our border lines to commit crime, Comm-Gen Matanga said.\n\nPolice have taken note of reports of liquor outlets in some central business districts and residential areas, which are not observing the provisions of the Liquor Act, by operating outside their stipulated opening and closing times, said the police chief.\n\nSome of the beer outlets are also allowing minors to access alcohol.\n\nMay I buttress that arrests will be effected and the law will certainly take its course. In the same vein, may I take this opportunity to strongly warn parents and guardians who allow minors under the guise of merry making to partake in beer drinking orgies.\n\nAs the public embarks on various activities during this festive period, families, business persons and institutions should avoid carrying or keeping large sums of money at home or offices to curb robbery and other related violent criminal acts, Comm-Gen Matanga said.\n\nHe said police will also take action on those engaging in drug and substance abuse, adding that as the public celebrates the cross-over into the New Year, individuals, institutions and businesspersons must adhere to the provisions of the law on the use of fireworks, fire crackers and other gadgets that may disturb the safety and security of the people.\n\nAs required under the countrys laws, the use of fireworks should be notified to the local authorities and police well on time, Comm-Gen Matanga said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/12/2412-1-1-COMMISSIONER-GENERAL-GODWIN-MATANGA-2019.jpg",
            "description": "Herald Reporters Police officers have been heavily deployed on all major roads, residential areas, central business districts and places where people converge to make merry to ensure peace and order, Police Commissioner-General Godwin Matanga has said. He said there will be heightened roadblocks, traffic blitzes, stop and searches, motorised and cycle patrols to curb crime […]",
            "time": "06:28",
            "date": "23 Dec 2024"
        },
        {
            "title": "Govt signs nine irrigation deals",
            "url": "https://www.herald.co.zw/govt-signs-nine-irrigation-deals/",
            "content": "Edgar Vhera, Agriculture Specialist Writer\n\nNINE irrigation investments have been signed off by the Government with private companies as the Second Republic up-scales its resolve to ensure food security and agricultural raw materials for industry and export from unpredictable weather patterns that cause production and supply disruptions.\n\nIrrigation farming is now seen as critical to ensure continuous and constant output instead of relying solely on rainfall.\n\nLands, Agriculture, Fisheries, Water and Rural Development Permanent Secretary Professor Obert Jiri presided over the signing of irrigation investment agreements with nine companies in Harare last week.\n\nThe deals will transform Zimbabwe into a weather-independent food hub.\n\nProf Jiri reiterated the importance of transforming the country into a food-secure nation, regardless of weather conditions, through irrigation investments.\n\nHe acknowledged the role of investors as crucial partners in this initiative, emphasising that the Governments role was to facilitate progress to ensure more and more farmers had access to irrigation.\n\nThe next steps involve practical implementation, focusing on land and dam development for irrigation systems, with the Department of Irrigation and Zimbabwe National Water Authority (ZINWA) being key.\n\nToday we start wetting the paper, but the eventual goal is to wet the fields. If we do that, we would have succeeded in climate-proofing our agriculture, said Prof Jiri.\n\nWriting on his X post, Prof Jiri said: Transforming Zimbabwe into a weather-independent food hub remains a core priority of the Ministry. On Monday, nine irrigation investment deals were finalised, marking a significant step towards achieving this critical goal.\n\nThis comes in the wake of the official opening of the National Irrigation Investment Conference by President Mnangagwa earlier this year, where after noting that the El Nino-drought has not spared Zimbabwe, he called for more targeted interventions to ensure that the country and Africa at large become food secure once again.\n\nIt is now urgent and imperative for us to think outside the box to de-risk our nation from the vagaries of climate change. Similarly, stakeholders and communities alike should accelerate the implementation and adoption of mechanisms to climate-proof our agriculture sector, beginning at the household level, he said.\n\nThe country secured over US$227 million in two investment deals for irrigation projects at the Zimbabwe Irrigation Investment Conference.\n\nAnother US$1.5 billion in funding was secured to develop major dams such as Musami Dam and the completion of the Gwayi-Shangani pipeline, among several other key infrastructure projects.\n\nThe concept is not so much centred on infrastructure but rather on what the water captured within that infrastructure is intended to do, President Mnangagwa stressed as he has led the country to adopt a new ethos and philosophy: a dam as an economy to accelerate economic development.\n\nThe dam as an economy philosophy has expanded the project scope to include dam construction, irrigation development, hydroelectricity generation, potable water and fisheries development as fundamental project tenets to accelerate rural development for the attainment of Vision 2030, aiming to elevate and improve livelihoods while leaving no one and no place behind.\n\nThe ambitious dam projects are expected to expand the countrys irrigated land from the current 217 000 hectares to 496 000 hectares in the present phase, guaranteeing national food security and resilience against climate change.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/04/Professor-Obert-Jiri.jpg",
            "description": "Edgar Vhera, Agriculture Specialist Writer NINE irrigation investments have been signed off by the Government with private companies as the Second Republic up-scales its resolve to ensure food security and agricultural raw materials for industry and export from unpredictable weather patterns that cause production and supply disruptions. Irrigation farming is now seen as critical to […]",
            "time": "06:28",
            "date": "23 Dec 2024"
        },
        {
            "title": "Cross-section of society marks Unity Day",
            "url": "https://www.herald.co.zw/cross-section-of-society-marks-unity-day/",
            "content": "Joseph Madzimure, Senior Reporter\n\nA diverse cross-section of society yesterday celebrated Unity Day, a significant day on the national calendar that brings together various cultures to embrace a shared identity.\n\nOn December 22 each year, Zimbabweans commemorate Unity Day, a symbolic reminder that when united, the nation can reach greater heights.\n\nPeople celebrated the day in many ways, some congregating at merry-making joints, while others held sport tournaments and others used the day to finalise Christmas and New Year shopping and others travelling to different destinations for the holidays.\n\nZanu PF secretary-general Dr Obert Mpofu said unity is important for the attainment of development.\n\nHe noted that many nations remain in dire situations due to a lack of unity among their peoples.\n\nOur nation has been able to achieve a lot because of our firm belief in unity. Unity has always been desired, even before independence, he said, honouring the decision made on December 22, 1987 by the countrys founding fathers, to form a united movement.\n\nDr Mpofu said the Unity Accord was a pivotal moment in the nations history, shaping a new Zimbabwe centred on unity.\n\nIn a statement, the Ministry of Information, Publicity and Broadcasting Services said the historic signing of the Unity Accord laid a strong foundation for the prevailing peace and development the country enjoys.\n\nAs we celebrate this Day, let us cherish the unity and tranquillity that define our great motherland. Anchored on these crucial building blocks, Zimbabwe is on course to attain Vision 2030, reads the statement.\n\nFormer Harare South National Assembly member Cde Shadreck Mashayamombe said Unity Day is more than just a public holiday, as it embodies the core values of peace, unity and national cohesion.\n\nThe nation came together convinced that national unity, political stability, peace, law and order, social and economic development could be achieved, he said.\n\nMr Timothy Mncube, leader of the opposition Zimbabwe African National Congress (ZANC), recognised the significance of Unity Day in the nations journey toward prosperity and peace, emphasising the importance of unity in achieving a brighter future.\n\nAnother opposition leader, Ms Linda Masarira, of the Labour Economists and Afrikan Democrats (LEAD) said Unity Day reflects on the sacrifices made by the countrys forebears.\n\nShe called for solidarity, mutual respect and collaboration in shaping an inclusive Zimbabwe.\n\nThe Unity Accord of 1987 marked a pivotal moment in our history. It is our responsibility to honour this legacy by promoting cohesion and ensuring that every Zimbabwean feels represented, she said.\n\nMrs Charity Rukweza of Harare said as the nation seeks to attain Vision 2030 of an empowered upper middle income society, it is essential to draw lessons from the past and work together to safeguard the peace and unity that have been hard-won over decades of struggle.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/UD.jpg",
            "description": "Joseph Madzimure, Senior Reporter A diverse cross-section of society yesterday celebrated Unity Day, a significant day on the national calendar that brings together various cultures to embrace a shared identity. On December 22 each year, Zimbabweans commemorate Unity Day, a symbolic reminder that when united, the nation can reach greater heights. People celebrated the day […]",
            "time": "06:28",
            "date": "23 Dec 2024"
        },
        {
            "title": "Police to use breathalysers",
            "url": "https://www.herald.co.zw/police-to-use-breathalysers/",
            "content": "Freeman Razemba, Senior Reporter\n\nGovernment, through the Traffic Safety Council of Zimbabwe (TSCZ), has bought breathalysers to be used by police at roadblocks as part of efforts to curb road accidents.\n\nThis initiative seeks to ensure safer roads during the festive season by targeting motorists driving under the influence of alcohol and drugs.\n\nTransport and Infrastructural Development Minister Felix Mhona confirmed that the TSCZ was in the process of acquiring additional breathalysers to equip more police officers on the roads.\n\nWe have been saying in the ministry that we also need to police ourselves as citizens. Wherever you see errant behaviour, let us know, he said.\n\nMinister Mhona emphasised the importance of vigilance among drivers and road users to minimise accidents, especially during the festive season when traffic density increases.\n\nHe highlighted the need to avoid risky behaviours such as speeding, overloading and driving under the influence of alcohol.\n\nHome Affairs and Cultural Heritage Minister Kazembe Kazembe also addressed the issue, confirming that the police is ready to collaborate with other stakeholders to enforce compliance with road rules.\n\nHe noted the concerning rate of road accidents and expressed a commitment to reversing this trend.\n\nWe believe the time has come for us to collectively start reversing the current disturbing trend, Minister Kazembe said, adding that police visibility will be heightened at roadblocks and through motorised patrols on highways.\n\nThe ministers warned that any defective vehicles found on the roads during the holidays would be removed and taken to designated centres until they meet safety requirements.\n\nAdditional measures are set to be implemented to enhance road safety, although specific details were withheld for now.\n\nThe Insurance Council of Zimbabwe (ICZ) has also contributed resources for the purchase of breathalyser machines.\n\nPreviously, in March 2022, the ICZ donated traffic equipment worth US$82 000, including breathalysers, to assist police in enforcing traffic laws.\n\nNational police spokesperson Commissioner Paul Nyathi announced that monitoring teams, including relevant stakeholders, have been established to help curb road accidents.\n\nThe police are coordinating with the Ministry of Health and Child Care to test drivers suspected of being under the influence.\n\nBoth Minister Mhona and Minister Kazembe stressed the collective responsibility of all road users to ensure safer travel and reduce the alarming rates of road traffic accidents.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/11/breathalysers.jpg",
            "description": "Freeman Razemba, Senior Reporter Government, through the Traffic Safety Council of Zimbabwe (TSCZ), has bought breathalysers to be used by police at roadblocks as part of efforts to curb road accidents. This initiative seeks to ensure safer roads during the festive season by targeting motorists driving under the influence of alcohol and drugs. Transport and […]",
            "time": "06:28",
            "date": "23 Dec 2024"
        },
        {
            "title": "First Lady hands over 1 000 goats to women in Masvingo",
            "url": "https://www.herald.co.zw/first-lady-hands-over-1-000-goats-to-women-in-masvingo/",
            "content": "Tendai Rupapa in MASVINGO\n\nTHE Goat Pass-on Programme is a people-centred initiative that embodies the spirit and enduring values of empowerment, wealth creation, resilience and improving the livelihoods of rural communities, Agric4She patron, First Lady Dr Auxillia Mnangagwa, said while handing over 1 000 goats to Young Women for Economic Development (YW4ED) in Masvingo.\n\nGoats are generally an easier and cheaper option for livestock production as they can thrive even in difficult conditions.\n\nAmai Mnangagwa said the goat-pass on scheme was more than just asset creation through improving livestock breeds, but symbolises individual and collective quest for self-reliance, production and productivity.\n\nShe urged the young women from all the seven districts of Masvingo to pass-on the goats to vulnerable groups like the elderly, those with disabilities, widows and child-headed families so that they are not left out on the pedestal of success.\n\nThe First Lady has become synonymous with the economic emancipation of women to restore their dignity and ensure they respectably raise their families without venturing into vices like prostitution and drug abuse.\n\nAs the Agric4SHE patron, Amai Mnangagwa gave farming inputs to vulnerable groups of people.\n\nThe inputs included Compound D, Ammonium Nitrate, maize seed, sorghum seed, sunflower seed, ground nuts, velvet beans, vegetable combo seed, knapsack sprayers and pesticides.\n\nThrough her Angel of Hope Foundation, she also gifted the elderly, people with disabilities and orphans, some groceries while everyone in attendance walked away with rice and mealie-meal.\n\nYoung Women for Economic Development national chairperson and also ICT, Postal and Courier Services Minister, Tatenda Mavetera hands over farming inputs which were given to vulnerable groups by Agric4SHE patron, First Lady Dr Auxillia Mnangagwa in Masvingo\n\nThe mother of the nation also commissioned a solar-powered borehole and initiated nutrition gardens and fish ponds at Chidzikwe Secondary School.\n\nIn her address, the First Lady rallied women to be self-sustainable and to engage in projects that benefit future generations.\n\nAs we gather here, we are not just participants in a programme but part of a community that is united and focused on uplifting ourselves and future generations into prosperity. Emboldened by the development philosophy Nyika inovakwa nevene vayo and through the implementation of life-transforming projects and programmes, we are truly on to become masters of our destiny. Congratulations, makorokoto for this milestone, she said.\n\nAt its core, the First Lady said, the Goat Pass-on Programme is more than just asset creation through improving livestock population and breeding.\n\nIt symbolises our individual and collective quest for self-reliance, production and productivity, and eventually sustainable household livelihoods. By providing goats to women in our communities, we are not only offering a source of income but also creating a pathway for personal and collective growth.\n\nThis is what it means to be united as a community. Together you will continue to achieve more and help transform your quality of life, she said.\n\nPoverty, particularly its negative impact on women and children, is a challenge that demands collective attention, the First Lady said.\n\nTherefore, she said, access to productive resources, including livestock can be a powerful tool in breaking the cycle of poverty.\n\nSmall livestock, including goats, offer a remarkable pathway to economic empowerment, especially for vulnerable households. I urge each of you to embrace the opportunity this programme presents. Let us pass on not just goats, but also knowledge, skills, support, and provision of safety nets.\n\nThis includes cross-cutting areas such as the fight against gender-based violence, drug and substance abuse and improving health awareness on critical diseases such as cancer, among others.\n\nIt is my hope that once the project grows, you also give back to the marginalised and vulnerable in our community. Ndingazvitenda zvikuru kuti mupindewo mubasa randinoita, mukurangarira vana mbuya navanasekuru, nherera neshirikadzi dziri mudzinharaunda dzedu, she said.\n\nPart of the 1 000 goats handed over to Young Women 4ED by First Lady Dr Auxillia Mnangagwa during the Goat pass-on Programme in Masvingo\n\nThe First Lady said philanthropy can only be carried out in harmony as unity of purpose is of paramount significance.\n\nYoung Women4ED can also be meaningful philanthropic contributors to society. Pandinofambawo nezvandinazvo muchange muineni negoat scheme iyi pakupawo mbudzi idzi kana project yenyu yabereka yakura.\n\nIn conclusion, I call upon women who are beneficiaries of the Land Reform exercise to take an interest in the new land tenure programme launched yesterday (Friday). The new programme ensures that all beneficiaries of land, including war veterans and people with disabilities have title deeds. This is a secure tenure document that allows us to use our land to find financing and to invest in our God-given land while giving impetus to production and productivity, she said.\n\nThe mother of the nation implored beneficiaries of the programme to work hand-in-hand with livestock specialists to get training on the best practices to increase their livestock population to realise more economic benefits.\n\nLet us move forward together in hope and determination as we embark on this remarkable journey, she said.\n\nWhen we rear goats, chickens, and ducks at the homestead, as grandmothers we will have something for our grandchildren. We must have all of these at our homes. If someone has nothing to do, they end up doing bad things because they wont have anything to lay their hands on. These livestock start small and grow because someone will be looking after them. Everyone starts low be it in business and grows bit by bit.\n\nAmai Mnangagwa called for peace in homes and communities.\n\nYou men must not beat women and you women do not trigger violence or do things that make men beat you. Be a good mother and role model to the children.\n\nWhen you are in the wrong, admit. As a mother you are the keeper, the defender because everything lies on your shoulders. We are grateful that God created us as women. Be strong in your home so that it grows and prospers.\n\nIf you have a lazy husband as I hear from other provinces vana mai vachichema chema kuti vana baba havadi kushanda, do not relax. Take him along to the fields. What nickname do you have because these names are often given after our characters? How do you dress? Let us go back to our cultural norms and values.\n\nOur culture does not allow us to walk in the nude. Learn to live well as women and have good manners. Let us teach our children well. Young Women4ED I am pleased with your work because you are following what I teach you. I want you to venture into all the work that I started. Keep on doing projects because they benefit even generations to come. We do not want work that is left midway. Widows, orphans and people with disabilities need help. Keep helping them and have a long heart.\n\nKeep the goats well and we want to hear from those you would have assisted. I would be glad to hear that you are looking after vulnerable groups in your communities. Let us not just end with goats, but do many other projects. I encourage you to work with Agritex officers so that they take you through the project. Masvingo I wish to thank you for working hard. Remain united so your development is noticeable, she said.\n\nWomen erupt with joy while welcoming First Lady Dr Auxillia Mnangagwa to Masvingo for the goat pass-on programme and food distribution\n\nAs the environment patron, she encouraged people to protect the environment by not cutting down trees and burning grass.\n\nShe also stressed the need to observe road safety rules especially before, during, and after the festive season.\n\nYW4ED national chairperson, Tatenda Mavetera, who is also the Minister of ICT, Postal and Courier Services, praised the First Lady for her empowerment initiatives.\n\nOn August 6, we came to see you at State House when you said you wanted us to learn how to deliver services to the people and how to work hard using our hands. I want to thank you for showing us the way Amai.\n\nOn August 21, 2023, you launched a programme called Young Women for ED and we are thankful. We thank you very much for empowering us. You did not just empower us to look for money but know good manners and look after ourselves. We are grateful that you have done a lot in the direction of Vision 2030. Our group includes members of Parliament and councillors because of your teachings which we keep close to our hearts.\n\nYou uplifted us in a big way through mukando and there are women who are giving one another cars. When we went out there cleaning the homes of elderly people, it was through the First Ladys teachings. As young women, we also did rabbits, fish farming, and piggery through you Amai. We are happy for the goat projects you have brought for us today, she said.\n\nSinger Sandra Ndebele, who is part of the Young Women for ED, paid tribute to the First Lady for playing a pivotal role in shaping our landscape.\n\nThroughout history, Amai, Women have been at the forefront of innovation, entrepreneurship and resilience. Today we stand on your shoulders thanking you for the way you paved for us as Young Women for ED. We embrace the opportunities that were given to us.\n\nWe are into various projects and you made this possible through your initiatives and teachings. Together, through you mhamha, we have the power to redefine norms, break barriers and create a more inclusive and prosperous future for all. We, as Young Women for ED Amai, want to congratulate you on your doctorate. Amhlope, makorokoto for showing us how its done, she said.\n\nSome of the farming inputs that include compound D, ammonium nitrate, maize seed, sorghum seed, sunflower seed, ground nuts, velvet beans, vegetable combo seed, knapsack sprayers and pesticides which were given to vulnerable groups by Agric4SHE patron, First Lady Dr Auxillia Mnangagwa in Masvingo\n\nShe said the organisation would continue working hard for the benefit of the economy.\n\nMasvingo Provincial Affairs and Devolution Minister Hon Ezra Chadzamira thanked the First Lady for her interventions and congratulated her on attaining a doctor of philosophy degree.\n\nI want to start by congratulating our mother for attaining a PhD, encouraging young people and women that education has no limit. Amai, we also felt eager to go back to school. Today you have brought us many things for everyone. Everyone present here will get maize meal and rice.\n\nIn addition, the elderly, orphans and those with disabilities have been brought food and toiletry hampers. The school had no borehole but today our mother commissioned a solar-powered borehole. She has initiated a nutrition garden and fish ponds at the school.\n\nThe school will also receive maize meal and rice for the continuation of the schools feeding programme done by the First Lady. Amai we thank you for empowering marginalised communities. We do not forget your First Ladys widows association, which is empowering widows countrywide. Widows in this province are managing the projects you initiated for them very well.\n\nTheir businesses are expanding. All your programmes are educative and empowering. Amai you are not selective, you embrace and empower everyone. Your love is unmatched, he said.\n\nSo touched by the donations were the beneficiaries that they sang praises to the First Lady.\n\nMr Jameson Muronda, who lives with a disability, was on cloud nine.\n\nI am grateful to the First Lady because of her love. She frequently remembers us and ensures we have adequate food to nourish our bodies. She has a good heart and has given us a Christmas treat, she said.\n\nMasvingo Young Women 4ED members receive goats handed over to them by First Lady Dr Auxillia Mnangagwa during the Goat pass-on Programme in Masvingo\n\nMs Jerita Gatsi weighed in saying: The First Lady has done a wonderful thing for us by giving us goats which we will keep so that the project grows big and reproduces, giving us access to capital to look after our families. She is a loving mother who means well for the nation.\n\nMrs Tecla Mashari said she will forever cherish the First Ladys commitment to empowering communities.\n\nI will forever cherish the First Ladys commitment to empowering communities. She has unveiled many projects for the people of Masvingo and now she has brought us goats. This is a bold commitment to development, she said.\n\nBeneficiaries depart to their respective homes after being blessed with Christmas goodies by Angel of Hope Foundation patron First Lady Dr Auxillia Mnangagwa during the Goat pass-on Programme in Masvingo\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/FL1-1.jpg",
            "description": "Tendai Rupapa in MASVINGO THE Goat Pass-on Programme is a people-centred initiative that embodies the spirit and enduring values of empowerment, wealth creation, resilience and improving the livelihoods of rural communities, Agric4She patron, First Lady Dr Auxillia Mnangagwa, said while handing over 1 000 goats to Young Women for Economic Development (YW4ED) in Masvingo. Goats […]",
            "time": "06:28",
            "date": "23 Dec 2024"
        },
        {
            "title": "EDITORIAL COMMENT: Diversity enriches our national unity",
            "url": "https://www.herald.co.zw/editorial-comment-diversity-enriches-our-national-unity/",
            "content": "NATIONAL Unity Day, which was celebrated yesterday, although the public holiday in lieu has been moved to today, has a double importance.\n\nFirst to celebrate the end of a tragic period in our history when we saw what happens when we are not united on essentials, and secondly to recommit ourselves to preserving that unity forever, keeping our many differences of culture and opinion within the ambit of a united nation.\n\nAs President Mnangagwa noted, Zimbabwe is very diverse culturally, linguistically and even in religion. This is why we needed to set 16 official languages when we finally wrote and agreed on our new Constitution in 2013, so that everyone was included equally under the umbrella of that Constitution.\n\nBut at the same time, we have one country, one flag, one national anthem, one central Government and while there are 10 provinces and 92 urban and rural local authorities, these are geographical in scope, rather than defined culturally or linguistically.\n\nEven when the majority in a district share a mother tongue, and that is not uncommon, every other Zimbabwean in that district is included and cannot be treated any differently.\n\nWhile we might have linguistic majorities in a district, we do not have any homogeneous areas outside some villages made up of an extended family, and even there that is not guaranteed.\n\nNational unity is not a new concept. It was initially forged in the fire of the First Chimurenga. The British South Africa Company had invaded and conquered the areas that are now Zimbabwe.\n\nThe land grabbing that followed, with the invading forces paid off with large farms and far more land seized for sale to newcomers along with the forced labour and the imposition of high taxes to make the conquered pay for the conquest, with the whole directed by the imposition of a ruthless local administration, made it clear to all within our borders just what this invasion entailed.\n\nIn 1896 during the First Chimurenga, there was a concerted effort to throw off the yoke of the invaders and despite the linguistic difficulties and the lack of any central organisation, there was a remarkable degree of coordination.\n\nThe invading company and its settlers would, in fact, have been defeated, but for the decision of the British to commit large numbers of imperial troops to maintain the new imperial province in that age of empire. That initial national unity was never forgotten, even with the determined efforts of the colonial and settler authorities embracing the policy of divide and rule and doing their level best to try and make sure Southern Rhodesian natives did not develop any national consciousness, but rather had loyalties only to the smallest possible groups, which were to be kept in competition.\n\nThat policy failed as the rise of trade unions, and the common realisation that the overwhelming majority of the population were together treated as subservient people within their own country with almost zero rights.\n\nBy the 1950s this unity had solidified into the nationalist movement, although the formal parties established to direct the movement were frequently banned and leaders often restricted.\n\nDuring one of these periods the nationalist movement split, but not on geographical or linguistic lines, or on the need for a democratic united country, but rather on the tactics to be followed to achieve this freedom. The split, regrettably, endured although it remained one over tactics with both sides having supporters everywhere.\n\nThe settler authorities obviously did all in their power to maintain the split, but there was a major and successful surge of a united approach to block the imposition of a British-backed deal with the settlers.\n\nIt was only a set of accidents, such as assignment of rear bases after the liberation war went into its continuous phase and became built around mobilising the whole population, that the split started bringing in geography, with the settler authorities really pushing this with deliberate efforts of making insincere offers to selected individuals.\n\nThe ideological split of the early 1960s had long been ended with the realisation by all that only an armed struggle would liberate the country.\n\nAfter independence, another external influence appeared, with the dying apartheid regime in South Africa adopting a policy of trying to convert each of its neighbours into contending groups of bantustans that would be in eternal conflict, show the rest of the world how only the regime could impose order, and make sure that Angola, Mozambique and Zimbabwe were failed states not worthy of support.\n\nSo there was active leveraging of every possible difference, building on what the defeated Rhodesian settlers had been doing although at a whole order of magnitude worse.\n\nThere were inevitable errors in dealing with this, and these are largely admitted. But the final result was a determined decision to step back from the brink by all major political forces, and that resulted in December 1987 with the reunification of the old nationalist movement on lines that were both realistic and fair.\n\nOpposition parties have arisen, and this is part of the democracy Zimbabwe has enjoyed, and while their policies seem woolly and their leadership in perpetual conflict with each other on personal grounds, they have all accepted that Zimbabwe is one country, they all wave the national flag, and all have been careful not to try and limit their appeal to one area, preferring to see if they can unseat Zanu PF everywhere, rather than wanting to split up the country.\n\nThat is to an extent a by-product of our Constitution, with a single winning Presidential candidate and a single Parliament needing a majority to rule.\n\nMeanwhile, the Second Republic, as President Mnangagwa noted at the weekend, has pushed hard to make sure that the diversity within unity as guaranteed by the home-grown Constitution is made a practical reality.\n\nA hallmark of President Mnangagwas leadership has been to make sure that no one and no area is left behind, and that has seen special development efforts in areas that obviously were not fully included in some of the past growth, so they catch up quickly, making sure we move forward united and together.\n\nAt the same time decentralisation policies have been implemented, not breaking up the country, but trusting local communities will know more about what they need and want than some civil servant in Harare and so letting them make the choice over how central Government capital development funds are spent in their areas.\n\nThis is practical decentralisation under a unitary Government, stressing both fairness and local interests\n\nAt the same time Zimbabweans are becoming proud of their diversity in culture and language, seeing this as enriching the country and making it stronger, as well as recognising that accepting all our fellow citizens means that they will in turn accept us and that we can all flourish together.\n\nWe learned the lessons of just how damaging disunity can be, and we have now recreated our country as a united country that not only accepts our many differences, but embraces them, as something that makes Zimbabwe unique and stronger.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Unity-Day.jpg",
            "description": "NATIONAL Unity Day, which was celebrated yesterday, although the public holiday in lieu has been moved to today, has a double importance. First to celebrate the end of a tragic period in our history when we saw what happens when we are not united on essentials, and secondly to recommit ourselves to preserving that unity […]",
            "time": "06:28",
            "date": "23 Dec 2024"
        },
        {
            "title": "Unity Day: Embodiment of national identity, unity and shared purpose",
            "url": "https://www.herald.co.zw/unity-day-embodiment-of-national-identity-unity-and-shared-purpose/",
            "content": "Evans Mushawevato, Correspondent\n\nUNITY DAY, celebrated annually on December 22, is more than just another holiday on Zimbabwes calendar.\n\nIt is a momentous occasion that embodies the core of our national identity; unity, peace and shared purpose.\n\nThe 1987 Unity Accord, signed by the late former President Robert Mugabe and Vice-President Joshua Nkomo, marked another milestone in Zimbabwes history.\n\nAs Zimbabweans, we have consistently rejected tribalism and divisive sentiments. Our shared struggle for liberation and our collective aspirations for a prosperous Zimbabwe are far stronger than any force that seeks to divide us.\n\nIt is this unwavering unity that has enabled us to overcome challenges and preserve the peace and stability that have defined post-independence Zimbabwe.\n\nThe late nationalist and national hero Cde Cephas Msipa aptly described the Unity Accord as . . . more than an agreement between two political parties.\n\nIt brought to the fore the united Zimbabwe that has built an intrinsic and holistic sense of belonging to the territory between the Zambezi and the Limpopo rivers by all citizens.\n\nIt was the culmination of a hard-fought journey to reconcile two liberation movements  ZANU PF and PF ZAPU  into a united front for nation-building.\n\nThis agreement was not merely political; it was a profound acknowledgment that Zimbabwes future could only be secured through collective effort and unity. The Unity Accord followed years of internal conflict and division that threatened to destabilise the young nation.\n\nBoth ZANU PF and PF ZAPU were pivotal in the liberation struggle, with their military wings, ZANLA and ZIPRA, fighting side by side against colonial oppression. Their shared sacrifices during the war and collaborative efforts at platforms like the Lancaster House Conference demonstrated that their goals for an independent Zimbabwe were fundamentally aligned.\n\nThis spirit of collaboration ultimately laid the groundwork for the historic Unity Accord, which has since become a cornerstone of Zimbabwes peace and stability. Unity Day is a celebration of this enduring peace  a priceless gift that has shielded Zimbabwe from the civil wars and unrest that plague many other nations.\n\nAs the late ZANU PF Secretary for Information and Publicity, Cde Simon Khaya Moyo, once noted: The Unity Accord is against tribalism, regionalism, and racism. It promotes respecting one another and treating each other as one big family. As we celebrate Unity Day we should take cognisance of the fact that no-one is greater than the other because of his/her birthplace. We are all equal citizens of Zimbabwe and we are called upon to play our part . . . together we cannot fail.\n\nZimbabwe is, indeed, a mosaic of languages as well as traditions and its strength lies in this diversity. Tribalism and divisive sentiments have had no place in a nation that has consistently chosen unity over discord.\n\nAs a people, Zimbabweans have shown an unshakable commitment to the ideals of harmony and mutual respect.\n\nReflecting on the sacrifices made during the liberation struggle, it is impossible to overlook the contributions of icons like Mbuya Nehanda, King Lobengula, General Mtshana Khumalo (a revered commander of King Lobengulas Imbizo Regiment that defeated the Allan Wilson Patrol at the Battle of Pupu in 1893), Joshua Nkomo and Robert Mugabe.\n\nTheir legacy is deeply woven into the fabric of Zimbabwes identity. The lowering of the Union Jack, the lighting of the Eternal Flame and the raising of the Zimbabwe Flag signified the dawn of a new era  a time Zimbabweans became masters of their destiny.\n\nThe Unity Accord reinforced this vision, ensuring that no Zimbabwean would ever again fight a fellow Zimbabwean. As we celebrate Unity Day, it is crucial to remember that this peace and unity did not come on a silver platter.\n\nThey were the result of immense sacrifices made by countless Zimbabweans who gave life and limb as well as livelihoods for the dream of an independent and united nation.\n\nFor many young people who have grown up in a peaceful Zimbabwe, these sacrifices may sound like a distant past. However, the importance of preserving this history cannot be overstated.\n\nAs the late national hero, Cde Absolom Sikhosana, emphasised: Youths should defend the country, which has survived many challenges, including illegal sanctions. We will conquer all economic, social and political hardships if we continue to stand united.\n\nPresident Emmerson Mnangagwa, in his inaugural address in 2017, reinforced the message of unity and reconciliation. Having inherited a nation with a polarised political landscape, he emphasised that he is . . . everyones President regardless of colour, tribe, or race.\n\nHis call for reconciliation over retribution and his pledge to serve all Zimbabweans, irrespective of their backgrounds, further solidified the countrys commitment to unity.\n\nI intend, nay am required, to serve our country as the President of all citizens regardless of colour, creed, religion, tribe, totem, or political affiliation, he declared.\n\nThis inclusive approach has been essential for fostering the peace and stability needed to drive Zimbabwes economic development and prosperity.\n\nUnity Day is a time to reflect on the ongoing journey of nation-building. While we celebrate the gains of independence, such as the Land Reform Programme and the empowerment of indigenous Zimbabweans, we must remain vigilant against threats to our unity.\n\nThe divide-and-rule tactics once used by colonial powers to subjugate us have found a formidable barrier in the unity and peace we now cherish.\n\nThe revolutionary party ZANU PFs motto  Unity, Peace and Development  continues to guide every Zimbabwean in efforts to build a better future.\n\nThis commitment to unity is not just about politics; it is a fundamental requirement for Zimbabwes progress.\n\nAs Cde Sikhosana eloquently put it: Without unity there is no peace, without peace there is no development, and without development there is no prosperity.\n\nThese words highlight the interconnections of unity, peace and national progress. Zimbabwes ability to remain united in the face of external pressures, such as sanctions, and internal challenges is evidence of a united people.\n\nDespite the odds, Zimbabweans have consistently chosen to work together for the common good, demonstrating that their collective aspirations for a prosperous nation are stronger than any forces that seek to divide them.\n\nThe peace and unity Zimbabwe enjoys today have put the country in a unique position to focus on development without the hindrances of civil wars and mayhem that characterise some nations globally. President Mnangagwas emphasis on reconciliation and inclusivity has created a platform for economic growth, encouraging all Zimbabweans to contribute to the nations progress.\n\nAs the country celebrates yet another Unity Day, it is imperative to recognise the profound importance of this peace and unity in shaping Zimbabwes destiny. Unity Day is not just a historical marker; it is a living principle that must be upheld and celebrated every day.\n\nIt reminds us of who we are as Zimbabweans  a proud, determined people united by a common purpose. Nationalist leaders like Joshua Nkomo, who was fittingly honoured with a statue in Bulawayo and the renaming of Main Street in his name, symbolise the sacrifices made for the good of the country. As former President Mugabe once said: We now own our resources, every part of it, because people like Mdala Nkomo fought.\n\nAs we continue to face modern challenges, Unity Day serves as a call to action. It challenges us to protect our heritage, to educate future generations about the struggles and sacrifices that brought us to this point, and to remain steadfast in our commitment to unity.\n\nIt is a reminder that, despite our differences, we are all Zimbabweans  united in our determination to build a better future. Unity Day also celebrates Zimbabwes unique identity as a nation that values diversity and inclusion.\n\nFrom the Zambezi to the Limpopo, Zimbabwe is an enchantingly beautiful textile of cultures, languages and traditions. This diversity is not a weakness but a strength, enriching the nation and providing a solid foundation for growth.\n\nThe detractors are trying by all means to sow the seeds of disunity, but it is the duty of each and every Zimbabwean to guard jealously the unity that has brought this stability and peace we are enjoying, said the late Cde Msipa those many years ago.\n\nAnd that message remains relevant today. As Zimbabweans, we must draw inspiration from the achievements of the past while looking towards the future with hope and determination.\n\nThe Unity Accord laid the foundation for a united, peaceful and prosperous Zimbabwe. But it is up to us, the current generation, to build on this foundation and ensure that the values of unity, peace and development continue to define our nation.\n\nUnity Day is more than a holiday; it is a celebration of Zimbabwes identity and unwavering determination not just to maintain its sovereignty but grow. It is a reminder of the sacrifices made to secure our freedom and the shared responsibility we have to protect it. As we honour this day, let us recommit ourselves to the ideals of unity and peace. Let us reject division and embrace the rich diversity that makes us who we are. Long live unity! Long live Zimbabwe!\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Unity.jpg",
            "description": "Evans Mushawevato, Correspondent UNITY DAY, celebrated annually on December 22, is more than just another holiday on Zimbabwe’s calendar. It is a momentous occasion that embodies the core of our national identity; unity, peace and shared purpose. The 1987 Unity Accord, signed by the late former President Robert Mugabe and Vice-President Joshua Nkomo, marked another […]",
            "time": "06:28",
            "date": "23 Dec 2024"
        },
        {
            "title": "Mbire community goat project thrives",
            "url": "https://www.herald.co.zw/mbire-community-goat-project-thrives/",
            "content": "Fungai Lupande, Mashonaland Central Bureau\n\nThis Christmas, the people of Ward 2 in Mbire are set to celebrate joyfully as families have pledged to slaughter goats from a goat-rearing project initiated by the women, all in support of a community free of gender-based violence.\n\nHistorically, violence against women and girls was prevalent and culturally accepted in this community.\n\nHusbands often resorted to severe assaults, such as tying their wives to trees and beating them up, young girls were married off early, and victims of sexual violence frequently remained silent due to fear of backlash.\n\nIn response to this suffering, Katswe Sistahood launched a goat-rearing project aimed at economically empowering women while providing resources for victims of gender-based violence to access legal support.\n\nThe initiative began with a group of 10 women who started with just four goats, which quickly grew to 40.\n\nThis success allowed the project to expand to four additional groups, each comprising over 25 women.\n\nMotivated by the projects impact, men in the ward initiated their own goat-rearing farming.\n\nMr Joshua Munatsi, the ward secretary, noted that men felt challenged by their wives success, which spurred them to take part.\n\nI am leading the goat project and we have seen significant growth. This Christmas, we will grill goats from our project to celebrate the positive changes brought about by awareness of gender-based violence, he said.\n\nInitially, many men resisted the project, fearing it would empower their wives too much. However, the community gradually recognised the importance of living in peace, leading to a decline in gender-based violence. The project has also provided economic benefits, allowing women to contribute to household incomes.\n\nOne of the pioneers, Mrs Estina Chitswi from Maranda Village, shared that the project began in 2019, with some setbacks, including theft and predation.\n\nNevertheless, the remaining members persevered, and by 2021, the goats had multiplied to 32. We prioritised women affected by domestic violence, giving them the opportunity to educate themselves, she said.\n\nMrs Precious Nyatande from Kumirai Village emphasised that before the goat project, women lacked knowledge about economic independence. Now, as part of an internal savings and lending scheme with 31 members, they recently shared US$3 000 among themselves.\n\nThese initiatives have allowed me to realise my dream of educating my child, she remarked.\n\nMrs Shylet Ncube from Makwara Village recounted how cotton production had led to gender-based violence, as husbands controlled the finances.\n\nNow I manage my money, and we support our childrens education, she said.\n\nMiss Chengetayi Chininga, head of operations at Katswe Sistahood, highlighted their dual focus on preventing gender-based violence and providing sustainable livelihoods for women. Active in Wards 2, 3, 4, 11, and 12, their projects empower survivors of gender-based violence and foster educational opportunities for children.\n\nWe work closely with indigenous communities and their leaders to raise awareness about rights and the impacts of climate change, she explained.\n\nAddressing language barriers, they ensure climate communication is accessible for better understanding.\n\nAs the Mbire community prepares for a memorable Christmas, the goat project stands as a testament to resilience and empowerment.\n\nBy fostering economic independence and challenging cultural norms, the initiative not only supports survivors of gender-based violence but also nurtures a brighter future for the entire community.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/goats.jpg",
            "description": "Fungai Lupande, Mashonaland Central Bureau This Christmas, the people of Ward 2 in Mbire are set to celebrate joyfully as families have pledged to slaughter goats from a goat-rearing project initiated by the women, all in support of a community free of gender-based violence. Historically, violence against women and girls was prevalent and culturally accepted […]",
            "time": "06:28",
            "date": "23 Dec 2024"
        },
        {
            "title": "FOOTBALL FAMILY WAITS ANXIOUSLY",
            "url": "https://www.herald.co.zw/football-family-waits-anxiously/",
            "content": "Eddie Chikamhi, Zimpapers Sports Hub\n\nSpeculation surrounding candidates to contest ZIFA board elections will be addressed today when the Normalisation Committee announces the official list of aspirants that have passed the eligibility test.\n\nSeveral people have expressed interest in taking up positions on the ZIFA board ahead of the January 25 ballot.\n\nHowever, according to ZIFA statutes, contestants have to pass an eligibility test to make the final short-list of candidates.\n\nThe vetting process has been taking place in the last two weeks with the assistance of the ZIFA Ethics Committee led by renowned legal practitioner Muchadeyi Masunda.\n\nThere has been an overwhelming interest in the elections, with the biggest number ever of aspiring office holders throwing their hats into the ring.\n\nBut the decision will be announced today with regard to nominations that make the cut.\n\nThere is a possibility some of the nominees will be disqualified if they fail to meet the ethical requirements, which, among other things, state that a person should not have been previously convicted of offences as determined in the electoral code.\n\nThe upcoming elections have seen as many as 10 aspirants reportedly submitting their documents to contest for the ZIFA presidency, while about 30 are understood to be eyeing places in the executive committee as board members.\n\nPositions to be contested for on January 25 include the president, two vice presidents, and six ordinary board members.\n\nUnfortunately, the road has not been that smooth, as things turned ugly last week following a mudslinging spate that was punctuated by a series of letters addressed to the ZIFA ethics committee.\n\nThese letters, which targeted presidential aspirants, were signed by unknown individuals and sought to discredit most of the candidates. The electoral code is clear, though, on how the committee should proceed. Below are some of the requirements aspiring candidates have to meet as stated by the new ZIFA constitution:\n\nThe president, the vice president, and the other members of the Executive Committee shall be elected by the Congress in accordance with art. 31 of these Statutes. They shall undergo an integrity check, to be conducted by the Ethics Committee, prior to their election or re-election.\n\nAll members of the Executive Committee shall be citizens and residents of Zimbabwe and shall have been continuously resident in Zimbabwe for a period of 2 (two) years preceding the date of election.\n\nAll members of the Executive Committee shall have already been active in football for at least five years within the last 10 years and shall fulfil the prerequisites stipulated in art. 24 par. 8 of these Statutes.\n\nAll members of the Executive Committee shall not have been previously convicted and sentenced for any offence.\n\nThe President and the two Vice Presidents of the Executive Committee shall have passed a minimum of five O-Level subjects (education level) or any equivalent educational level.\n\nFor one to be eligible to be voted as the president of the executive committee, one must be of the age of 40 years and above.\n\nA member of the Executive Committee may not at the same time be a member of an independent committee and may not be appointed/elected as a delegate representing a member at the Congress.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/05/Muchadeyi-Masunda-393.jpeg",
            "description": "Eddie Chikamhi, Zimpapers Sports Hub Speculation surrounding candidates to contest ZIFA board elections will be addressed today when the Normalisation Committee announces the official list of aspirants that have passed the eligibility test. Several people have expressed interest in taking up positions on the ZIFA board ahead of the January 25 ballot. However, according to […]",
            "time": "06:28",
            "date": "23 Dec 2024"
        }
    ]
}