{
    "news": [
        {
            "title": "Zim, Belarus in drive to bolster bilateral relations . . . Leaders seek to pace up cooperation",
            "url": "https://www.herald.co.zw/zim-belarus-in-drive-to-bolster-bilateral-relations-leaders-seek-to-pace-up-cooperation/",
            "content": "Wallace Ruzvidzo-Herald Reporter\n\nZIMBABWE and Belarus are exploring avenues to accelerate bilateral relations across all sectors for the mutual benefit of both nations, Belarusian Deputy Prime Minister Viktor Karankevichhas said.\n\nDeputy PM Karankevich yesterday paid a courtesy call on President Mnangagwa at State House in Harare following his arrival in the country on a working visit aimed at strengthening bilateral relations and broadening economic and technical co-operation earlier this week.\n\nZimbabwe and Belarus traditionally enjoy excellent relations that have seen the exchange of high-level visits, increased political and economic cooperation, and deepened collaborative efforts between the two countries at multilateral fora.\n\nIn an interview after a closed-door meeting with President Mnangagwa, Deputy PM Karankevich said Belarus was proud to be in various partnerships with Zimbabwe.\n\nWith the distinguished President of Zimbabwe, His Excellency President Mnangagwa, we have sincerely discussed all the possibilities for further fast-tracking bilateral relations in every particular sphere in order to make sure we increase the benefits to the population of the two countries, he said.\n\nHarare and Minsk have ongoing co-operation frameworks in agriculture, industrial production, education, energy, transport and facilitation of investment.\n\nBelarus is very proud to be part of strategically important joint ventures for the benefit of the two peoples of the countries . . . and from our side, we are ready to reconfirm readiness to implement all the projects of interest to the Zimbabwean side, as well as implement the new ones that would be upcoming, he said.\n\nDeputy PM Karankevich said the two countries are presently actioning agreements entered into by Presidents Mnangagwa and Aleksandr Lukashenko of Belarus.\n\nYesterday (Tuesday), we were planning meetings on the level of the heads of the ministers.\n\nToday (yesterday) we are planning the Joint Commission meeting session, headed by the Ministers of Foreign Affairs, where we are going to consider all the agreements agreed and implemented by the Heads of the State, where it is necessary to fast-track the implementation of bilateral relations, as well as determine the new directions of bilateral development co-operation in the future for the benefit of the populations of Zimbabwe and Belarus, he said.\n\nDeputy PM Karankevich said the increased co-operation between Zimbabwe and Belarus continues to bear fruit and the results speak forthemselves.\n\nWe already note that we have the positive experience of implementing the earlier agreed agreements between the Heads of State of Zimbabwe and Belarus in the past.\n\nI am talking about the implementation of the joint programme of agricultural system modernisation of Zimbabwe.\n\nThe beginning of this programme started in 2020 ushered by the two Presidents; the results speak for themselves.\n\nIt is a pleasure to mention that currently we are implementing the third phase of the current programme, within the framework of which we are planning to supply to Zimbabwe agricultural machinery, he said.\n\nThe two countries this week convened a Mid-Term Review of their Joint Permanent Commission on Co-operation.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/President-Mnangagwa-meets-Belarusian-Deputy-Prime-Minister-Viktor-Karankevich-680x380.jpg",
            "description": "Wallace Ruzvidzo-Herald Reporter ZIMBABWE and Belarus are exploring avenues to accelerate bilateral relations across all sectors for the mutual benefit of both nations, Belarusian Deputy Prime Minister Viktor Karankevich has said. Deputy PM Karankevich yesterday paid a courtesy call on President Mnangagwa at State House in Harare following his arrival in the country on a working […]",
            "time": "08:29",
            "date": "17 Apr 2025"
        },
        {
            "title": "All set for 45th Independence Day celebrations",
            "url": "https://www.herald.co.zw/all-set-for-45th-independence-day-celebrations/",
            "content": "Zimpapers Politics Hub\n\nIT is all systems go for Zimbabwes 45th Independence Day commemorations, with the main celebrations set to take place tomorrow at Mutora Business Centre in Nembudziya, Gokwe North District, Midlands Province.\n\nAt the main venue, organisers were yesterday putting final touches in place ahead of todays Childrens Party and tomorrows official Independence Day proceedings.\n\nThe Childrens Party will be hosted by President Mnangagwa at Nyamuroro High School, also located in Mutora.\n\nThis years celebrations are running under the theme: Zim@45: Devolve and Develop Together Towards Vision 2030, which underscores the Second Republics dedication to inclusive national development and the decentralisation of key State events.\n\nYesterday, contractors were busy adding final touches to infrastructure ahead of the milestone event. A major highlight of todays programme is the lighting of the Independence Flame at Sikombela Detention Centre  a revered historical site now being developed into a national monument.\n\nVice President Kembo Mohadi is expected to officiate at the flame-lighting ceremony before the symbolic torch is transferred to Mutora for the main event.\n\nPermanent Secretary for Midlands Provincial Affairs and Devolution, Dr Edgars Seenza, said all is set for the commemorations.\n\nAs far as the level of preparedness is concerned, over 3 000 children set to attend the Childrens Party have arrived. The event will be held at Nyamuroro High School, where two new hostels for boys and girls have been constructed, he said.\n\nSo I can safely say that we are ready to host the Independence Day celebrations, as all proposed infrastructure developments have been completed. Staff are now simply sprucing up the venue.\n\nDr Seenza further noted that all developments at Nyamuroro High School, including a new School Business Unit, are complete. At the open space designated for the main event, changing rooms and ablution facilities have been established.\n\nThe main venue, which is a football pitch, was completed on time. The lawn is lush and green, and the newly constructed terraces are filled with people enjoying the rehearsals, added Dr Seenza.\n\nDirector for the southern region at National Museums and Monuments, Mr Lovemore Mandima, said all was in place for the lighting of the Independence Flame at Sikombela.\n\nThis is symbolic of love, bravery, kindness, and, most importantly, unity, virtues displayed by the gallant sons and daughters of Zimbabwe during the liberation struggle, he said.\n\nThe flame reminds us to keep the light of freedom burning. From Sikombela, it will be transported to Mutora for the national commemorations.\n\nThe celebrations have sparked a wave of excitement among Gokwe residents, who praised the developmental impact the event has brought to their community.\n\nGokwe-Nembudziya legislator Cde Flora Buka said the community was elated to host the national event.\n\nWe are very happy as a community to host these national celebrations. Theyve ushered in significant changes  our schools now boast impressive features, she said.\n\nChief Chireya echoed the same sentiment: This is a proud moment for us. The President has brought development right to our doorstep, and local businesses are thriving. We are grateful.\n\nAcross the country, preparations for decentralised celebrations are also well underway.\n\nIn Harare, preparations for the 45th Independence Day celebrations at Epworth High School are now almost complete, with infrastructure developments done to accommodate the masses.\n\nSpeaking at the final rehearsals, Minister of State for Harare Metropolitan Provincial Affairs and Devolution, Senator Charles Tawengwa, said Harare will experience a celebration like never before, with entertainment and otherfestivities lined up.\n\nThe nation will join in celebrating our independence and honouring the fallen and living heroes of our country at this event, he said.\n\nWe expect a full house, even an overflow, as everyone is excited about the festivities.\n\nThere will be soccer, entertainment, music, traditional dances, and so much more happening here in Epworth for the first time.\n\nMinister Tawengwa said in the spirit of decentralisation and devolution, the 2026 Independence celebrations would be held in Chitungwiza, to ensure no one and no place is left behind.\n\nNow we are in Epworth, and hopefully next year we will be doing well in Chitungwiza. This is why we are here. This is our final rehearsal, we are ready, we are prepared for the National Day on the 18th, he said.\n\nIn Mashonaland West province, the Independence Day celebrations are set to take place at the historic Mbafa Primary School located in the vibrant Uhuru Nakazi area of Chegutu East District.\n\nThe event is anticipated to attract over 15 000 people from across the province, providing a unique opportunity for community engagement and national pride.\n\nPreparations have been in full swing.\n\nChoosing to celebrate Independence Day in Uhuru Nakazi  a name derived from the Swahili phrase Uhuru ka Nakazi that loosely means Freedom and work  echoes the vision put forth by President Mnangagwa for the decentralisation of national events, ensuring wider accessibility and inclusivity in Zimbabwe.\n\nRecently, members of the Zanu PF Provincial Co-ordinating Committee (PCC) gathered on site to evaluate the progress of preparations.\n\nThe atmosphere was electric as they discussed the many activities planned for tomorrow.\n\nOne of the key infrastructure developments includes a meticulously rehabilitated 9km stretch from the Chinhoyi-Chegutu Highway to the event venue, facilitating smooth access for attendees.\n\nAdditionally, the Government has prioritised the installation of piped water at the school to ensure all necessary amenities are in place.\n\nMembers of the uniformed forces have been hard at work, doing rehearsals so that individuals and families are entertained tomorrow.\n\nDuring the PCC meeting, Minister of State for Provincial Affairs and Devolution for Mashonaland West, Marian Chombo, said: We are gearing up to welcome at least 15 000 attendees. Our entertainment line-up is both diverse and entertaining! We have arranged for two elephants and kudu to be featured from Zimparks.\n\nFor sports enthusiasts, a riveting soccer match between the provinces exciting teams, Ngezi Platinum and MWOS FC, is lined up together with a musical gala where accomplished artistes, including Romeo Gasa, Prudence Mama Africa Muchada, and the Crocodile Sounds Band from the army will perform.\n\nTransport has been organised for people from Kariba, Hurungwe, Sanyati, and Makonde.\n\nIn Bulawayo, White City Stadium will host the provincial Independence Day festivities. Provincial Affairs and Devolution Permanent Secretary Mr Paul Nyoni said logistical arrangements were nearly complete.\n\nWere 99 percent ready. Twenty buses have been secured to ferry people to the stadium, and the military is finalising parade drills. The day will conclude with a cultural showcase and a football match between Highlanders and Chicken Inn, he said.\n\nSeven buses will also transport Bulawayo representatives to the main celebrations in Gokwe, including pupils from various schools.\n\nThis is a day of national pride. Citizens should take part and listen to the Presidents message as we mark 45 years of independence and self-determination, added Mr Nyoni.\n\nIn Matabeleland South, Plumtree is preparing to host its first-ever provincial Independence celebrations at the Plumtree School Pavilion Grounds, where over 5 000 attendees are expected.\n\nActing Mangwe DCC chairperson, Mrs Ruth Saurava, said all final arrangements were being made, with budgets and allocations already approved.\n\nNewly sworn in Minister of State for Provincial Affairs and Devolution, Albert Nguluvhe, is expected to officiate at the provincial commemorations, which honour Zimbabwes liberation journey and developmental milestones.\n\nIn Matabeleland North Province, Tsholotsho is ready to host provincial celebrations at the Tsholotsho Business Centre. Ten buses have been organised to ferry people from all seven districts of the province.\n\nMatabeleland North Provincial Affairs and Devolution Minister, Richard Moyo, confirmed that preparations are complete, with key service providers stepping in to ensure the event runs smoothly. ZETDC has pledged uninterrupted electricity supply, while ZINWA is handling water logistics.\n\nLarge corporates such as Hwange Colliery Company have come on board to provide mobile toilets, tents and chairs for this momentous occasion, as the nation celebrates 45 years of self-rule after a protracted liberation struggle, said Minister Moyo.\n\nFestivities in the province begin today with a Childrens Party at Tsholotsho High School, where Minister Moyo will interact with young people from across the province.\n\nThe people of Matabeleland North are thrilled. Our defence forces have been rehearsing at the main venue and the atmosphere is electric, he added.\n\nMinister Moyo applauded the Second Republics rotational hosting policy, saying it has brought real benefits to communities that were previously overlooked in major national affairs.\n\nWhen the Second Republic came in, it introduced the policy of rotating both provincial and national events. Its a hallmark of President Mnangagwas vision  to ensure no one and no place is left behind while unlocking developmental and economic opportunities for host districts, said Minister Moyo.\n\nAs part of preparations, Tsholotsho Rural District Council, with support from other local authorities like Umguza and Nkayi, has rehabilitated the TshefunyeTsholotsho Business Centre Road, which had become impassable due to recent rains.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/President-Mnangagwa-680x380.jpg",
            "description": "Zimpapers Politics Hub IT is all systems go for Zimbabwe’s 45th Independence Day commemorations, with the main celebrations set to take place tomorrow at Mutora Business Centre in Nembudziya, Gokwe North District, Midlands Province. At the main venue, organisers were yesterday putting final touches in place ahead of today’s Children’s Party and tomorrow’s official Independence […]",
            "time": "08:29",
            "date": "17 Apr 2025"
        },
        {
            "title": "Exchange rate controls scrapped in major shift to market pricing",
            "url": "https://www.herald.co.zw/exchange-rate-controls-scrapped-in-major-shift-to-market-pricing/",
            "content": "Business Reporters\n\nZIMBABWEAN businesses now have greater pricing flexibility, thanks to a more stable local currency and the scrapping of exchange rate controls.\n\nThrough Statutory Instrument 34 of 2025, Finance, Economic Development and Investment Promotion Minister, Professor Mthuli Ncube, has repealed the previous law that restricted businesses to the official exchange rate when pricing goods and services.\n\nThe repealed law, enacted in May 2024, prohibited businesses from pricing their products using exchange rates higher than the Reserve Bank of Zimbabwes average interbank foreign currency selling rate.\n\nThis new flexibility is anticipated to encourage more ethical business practices, as market competition will likely compel businesses that might otherwise overcharge to align their prices with prevailing market levels.\n\nWhile the central bank had previously announced that businesses could utilise their own exchange rates, this pronouncement lacked legal authority without a formal Statutory Instrument.\n\nProf Ncube has now formalised this in a bid to promote transparency and competitiveness in Zimbabwes pricing structures.\n\nThe restriction has now been removed, said Prof Ashok Chakravarti, a member of the Reserve Bank of Zimbabwes Monetary Policy Committee (MPC). Because of the stability of the local currency and the economy, the Government is confident that pricing in the market can be freed. It will stabilise based on competition amongst businesses.\n\nProf Chakravarti added that while some retailers had already been informally using rates around 3032 Zimbabwe Gold (ZiG) per US dollar, higher than the official 27, authorities had turned a blind eye.\n\nAll we have done is legalise that particular type of pricing and behaviour in the market, he said.\n\nThis legislative change comes on the back of a more stable local currency, helped by tighter monetary discipline and improved foreign currency inflows. It also reflects a policy recalibration by Government, which has struggled to contain pricing distortions and a thriving informal sector that operates outside formal exchange frameworks.\n\nStatutory Instrument 34 of 2025, formally titled, The Exchange Control (Amendment of Schedule to the Exchange Control Act) (Repeal) Notice, symbolises the Governments broader attempt to adapt regulation to prevailing market dynamics.\n\nIt eliminates the schedule governing civil penalties for currency violations, essentially legalising what had become common practice across formal retail and informal trading platforms.\n\nThis is Government trying its best to close the gap between the formal and informal players, said Zimbabwe National Chamber of Commerce (ZNCC) chief executive Christopher Mugaga. The move gives businesses the leeway to deal with prices as they see fit and adjust according to the environment.\n\nWhile the business community has broadly welcomed the repeal, concerns remain over whether monetary reform will be matched with fiscal discipline.\n\nMr Mugaga cautioned that tax policy must evolve alongside exchange rate liberalisation to ensure the formal sector remains competitive.\n\nThe fiscal side should complement the monetary side in order to level the ground, and this can bedone by reducing taxes to the formalised and formalising the informal, he said.\n\nIndeed, despite the progressive tone of the latest reforms, long-term success will hinge on how well the fiscal environment supports business sustainability.\n\nEconomists are applauding the policy as a pragmatic move aligned with market realities.\n\nThis was long overdue, said Dr Pedzisai Kaunda, an economist. Businesses were already pricing goods at a rate they felt was viable. The Governments recognition of this, and more importantly, the decision to give it legal backing sends the right signal to investors and retailers alike.\n\nDr Kaunda believes the change could help restore confidence in the formal retail sector, which has struggled to compete with informal traders who price goods based on parallel market rates.\n\nEchoing this sentiment, Mrs Gladys Shumbambiri-Mutsopotsi, a research economist, described the move as a corrective policy shift.\n\nThrough liberalising the pricing mechanism, the Government is acknowledging market behaviour and responding with policy that is more facilitative than punitive, she said. It shows a learning curve in governance and a greater willingness to let economic fundamentals drive outcomes.\n\nBoth economists, however, stressed that consistency would be key. Sustaining this momentum and supporting it with a credible fiscal framework is what will anchor business sentiment going forward, said Mrs Shumbambiri-Mutsopotsi.\n\nThe Governments hope is that liberalising the exchange rate used in pricing will encourage fairer business practices. In theory, market forces should now help regulate prices more effectively than statutory impositions.\n\nAs Prof Chakravarti said, Let it be determined by competition amongst the players. That is the right way to go.\n\nThis, analysts say, could also reduce the need for heavy-handed regulatory interventions.\n\nIf businesses price too high, consumers will simply buy elsewhere. The market becomes the enforcer, said Dr Kaunda.\n\nThe move may also improve the countrys perception among international investors, who have long been wary of opaque currency policies.\n\nWith the ZiG enjoying a period of relative calm and the exchange rate now truly liberalised, all eyes will be on whether this pricing freedom translates into lower inflation and a more level playing field for businesses across the board.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/07/c0d6de7b-5d63-4d31-985e-6d18ca0e33b6-680x380.jpeg",
            "description": "Business Reporters ZIMBABWEAN businesses now have greater pricing flexibility, thanks to a more stable local currency and the scrapping of exchange rate controls. Through Statutory Instrument 34 of 2025, Finance, Economic Development and Investment Promotion Minister, Professor Mthuli Ncube, has repealed the previous law that restricted businesses to the official exchange rate when pricing goods […]",
            "time": "08:29",
            "date": "17 Apr 2025"
        },
        {
            "title": "Sadc Military Health Working Group hails Geo Pomona",
            "url": "https://www.herald.co.zw/sadc-military-health-working-group-hails-geo-pomona/",
            "content": "Wallace Ruzvidzo-Herald Reporter\n\nThe Geo Pomona Waste Management facility is a timely project that is aiding the country and regions well-being, the SADC Military Health Working Group has said.\n\nThe SADC Health Working Group yesterday went on a tour of the waste management firms facility, led by its chief executive officer and executive chairman, Dr Dilesh Nguwaya.\n\nIn an interview after the tour, Zimbabwe Defence Forces (ZDF)s Brigadier General Godfrey Mutetse, who is the incoming Chair of the Working Group, said the facility was promoting the overall well-being of the general citizenry and the environment.\n\nWe felt that the Geo Pomona Waste Management site, being a project that manages waste from Harare, would be good to synthesise what we would have discussed in our AGM, he said.\n\nHere we have seen the processes that are being undertaken to manage waste are actually in support of sustainable development goals, and of interest to this group that I am leading. Good health and well-being is one aspect which the Geo Pomona Waste Management site is managing well, thanks to Dr Nguwaya for that.\n\nWe have also seen that they are not just throwing away whatever they collect; they promote reduction of usage, they promote recycling, and they are also promoting reuse, which are very important concepts. I understand our environmental managements urgency to promote such concepts of waste management.\n\nZambias Brigadier General Jackson Kasela, who is the outgoing Chair of the Working Group, said he had not seen such a facility before, adding that the project was very good.\n\nI have not seen this one anywhere else . . . we were told we were going to a dumpsite, and as we were entering the gate, I asked if this was the dumpsite . . . it is a very good project because I can actually eat my food here next to where the garbage is being dumped, so I think this is very good, he said.\n\nDr Nguwaya said Geo Pomona was playing its part in ensuring a clean environment.\n\nWaste management is also related to health issueseveryone needs to stay in a good environment, he said.\n\nAs a waste management company, we are also making sure that people live in a good environment by collecting waste from the streets and managing waste very well here.\n\nHe said the touring of the facility by representatives from several countries and local institutions was a testament to the work being done by the firm.\n\nSo far we have countries like Lesotho, Botswana, and Madagascar who are interested in working with us on the issue of waste management, and we also have our local authorities like the City of Mutare and City of Masvingo we are currently working with, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/SADC-millitary-at-Geo-Pomona-680x380.jpg",
            "description": "Wallace Ruzvidzo-Herald Reporter The Geo Pomona Waste Management facility is a timely project that is aiding the country and region’s well-being, the SADC Military Health Working Group has said. The SADC Health Working Group yesterday went on a tour of the waste management firm’s facility, led by its chief executive officer and executive chairman, Dr […]",
            "time": "08:29",
            "date": "17 Apr 2025"
        },
        {
            "title": "Belarus backs State’s UNSC seat bid",
            "url": "https://www.herald.co.zw/belarus-backs-states-unsc-seat-bid/",
            "content": "Farirai Machivenyika-Senior Reporter\n\nTHE Mid-Term Review of the Zimbabwe and Belarus Joint Permanent Commission on Cooperation ended in Harare yesterday, with the Eastern European country supporting Harares bid for a non-permanent seat on the United Nations Security Council for the period 2027 to 2028.\n\nThis is contained in a communique released after the meeting that was co-chaired by Foreign Affairs and International Trade Minister Professor Amon Murwira and his Belarusian counterpart, Mr Maxim Ryzhenkov, while that countrys Deputy Prime Minister Mr Viktor Karenkevich was the guest of honour.\n\nBoth Parties affirmed their mutual support in the United Nations and other international organisations, including, inter alia, support of the bid of the Republic of Zimbabwe for a non-permanent seat on the United Nations Security Council for the period 2027-2028, reads part of the communique. Zimbabwes bid has been endorsed by several countries that include Russia, India, Cuba and Sadc.\n\nIf it succeeds, the development will enable Zimbabwe to enhance its global standing and provide a platform to represent the interests of Sadc and African countries. The communique also says the two delegations engaged in comprehensive and constructive discussions, assessing progress in the implementation of joint commitments while identifying new avenues for enhanced bilateral cooperation.\n\nThe MTR facilitated the convening of the Second Sitting of the Joint Working Group (JWG) in the field of agriculture, which reviewed progress in the implementation of agricultural cooperation initiatives and identified priority areas for further collaboration.\n\nFurthermore, the MTR acknowledged with satisfaction the robust and expanding bilateral cooperation across multiple sectors, including; agriculture, industrial cooperation, higher and tertiary education, health, disaster management and mining, among others.\n\nThe MTR called for the enhanced implementation of Instruments of Cooperation that have already been signed as well as the speedy conclusion of the pending Instruments, the communique reads.\n\nZimbabwe expressed deep gratitude and appreciation to Belaruss President, Mr Alexander Lukashenko, for the humanitarian assistance extended to Harare, in response to the appeal by President Mnangagwa, following the El Nino-induced drought.\n\nThe MTR underscored the importance of expediting the conclusion of all outstanding instruments of bilateral cooperation and reaffirmed its commitment to strengthen further the implementation of shared commitments through tangible projects that will complement the two countries national development efforts.\n\nIn this regard, both parties welcomed the entry into force of the Agreement on the Avoidance of Double Taxation signed in 2023 between the Republic of Zimbabwe and the Republic of Belarus, reads part of the communique.\n\nThe MTR recognised the importance of diplomatic engagement and facilitating official travel between the two countries and called upon the parties to finalise the draft Agreement on the Exemption of Visa Requirements for holders of diplomatic and service passports and to take measures to facilitate mutual travel of citizens.\n\nThe MTR confirmed the decision by the Commission that Belarus will host the Second Session of the Joint Permanent Commission on Cooperation in 2026, in order to further follow up on the implementation of the agreements signed during the high-level visits and previous sessions of the JPCC, as well as exploring further areas of cooperation, the communique reads.\n\nIn his closing remarks, Prof Murwira described the MTR as a success.\n\nThis MTR has been more than just a routine check; it has been a decisive and results-driven exercise. We have rigorously monitored the progress of our joint projects and programmes, assessed performance with a critical eye, and drawn key lessons to refine our strategies moving forward.\n\nWe have confronted challenges head-on, recalibrated our approaches where necessary, and reinforced our commitment to delivering meaningful and measurable outcomes. Dear Colleagues, now, the real work begins. Our words must translate into action, and our commitments into tangible results, he said.\n\nMr Ryzhenkov said the close ties between the leaders of the two countries provided a platform for mutual cooperation.\n\nI would like to stress again that the very warm, truly sincere, friendly, even brotherly relations between our leaders, President Mnangagwa and President Lukashenko, President of the Republic of Belarus, created a good opportunity for all of us to develop the relations between our countries in any spheres we could even imagine.\n\nWe could, based on this understanding among our leaders, we could provide our relations as far as even other countries which have a very long history of relations couldnt reach. Because we are very friendly nations, we havent seen problems in our relations, we share the views of the international agenda, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Minister-Murwira--680x380.jpg",
            "description": "Farirai Machivenyika-Senior Reporter THE Mid-Term Review of the Zimbabwe and Belarus Joint Permanent Commission on Cooperation ended in Harare yesterday, with the Eastern European country supporting Harare’s bid for a non-permanent seat on the United Nations Security Council for the period 2027 to 2028. This is contained in a communique released after the meeting that […]",
            "time": "08:29",
            "date": "17 Apr 2025"
        },
        {
            "title": "‘Second Republic’s reforms begin to change country’s image on global stage’",
            "url": "https://www.herald.co.zw/second-republics-reforms-begin-to-change-countrys-image-on-global-stage/",
            "content": "Gibson Nyikadzino-Zimpapers Politics Hub\n\nECONOMIC reforms being instituted by the Second Republic are shifting the negative perceptions Zimbabwe endured for nearly two decades as the country reasserts its commitment to pioneering Africas economic transformation at a time of significant geopolitical changes,President MnangagwasChief Advisor on Global Affairs, Ambassador Mahomed Jassat, has said.\n\nHe said decades of sanctions, misinformation, and biased reporting distorted Zimbabwes image in the eyes of the world.\n\nAmbassador Jassat urged the Western world, international investors, and development partners to move beyond the propaganda.\n\nZimbabwe has often been misunderstood and misrepresented in global media. The greatest obstacle to Zimbabwes renaissance is not economic or political; it is perceptual. Decades of sanctions, misinformation, and biased reporting have distorted Zimbabwes image in the eyes of the world.\n\nBut perception is beginning to shift. Nations in the Gulf, Asia, and BRICS are already moving in, forming sovereign partnerships, acquiring long-term leases, and establishing manufacturing hubs, Amb Jassat said.\n\nAs of October 2024, the United Arab Emirates (UAE) was Zimbabwes top export destination, after 42 of the shipments, valued at US$293,32 million, went to the Middle Eastern country.\n\nSouth Africa, at 24,7 of total exports worth US$172,16 million, and China at 10,5 valued at US$73,15 million, completed the list of the countrys top three export destinations.\n\nAlso, by April 7 this year, total trade in goods and services between the United Kingdom and Zimbabwe was US$543 million in the four quarters to the end of September 2024, an increase of 24,9 or US$108 million.\n\nIt is time for the Western world, international investors, and development partners to move beyond the propaganda. Zimbabwe is not isolated. It is integrating into global value chains. It is a pioneer in African economic transformation, he added.\n\nSince its inception in 2017, the Second Republic has embarked on a reform agenda that has seen economic liberalisation, re-engagement with international partners, and the creation of a pro-business climate.\n\nSaid Ambassador Jassat: The establishment of the Zimbabwe Investment and Development Agency (ZIDA) has streamlined the process of investment, eliminated bureaucratic red tape, and offered investor protection under robust legislation. Most significantly, the government has taken bold steps to repatriate land to productive use and ensure food security through mechanised agriculture and smart partnerships with war veterans, youth cooperatives, and privateinvestors.\n\nThe world is redefining its relationship with Africa, and Zimbabwe is poised to be an investment destination of priority because of its critical mineral resources, conducive agricultural climate, and highly skilled human resource base, Ambassador Jassat added.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Ambassador-Jassat-388x380-680x380.jpg",
            "description": "Gibson Nyikadzino-Zimpapers Politics Hub ECONOMIC reforms being instituted by the Second Republic are shifting the negative perceptions Zimbabwe endured for nearly two decades as the country reasserts its commitment to pioneering Africa’s economic transformation at a time of significant geopolitical changes,  President Mnangagwa’s  Chief Advisor on Global Affairs, Ambassador Mahomed Jassat, has said. He said […]",
            "time": "08:29",
            "date": "17 Apr 2025"
        },
        {
            "title": "Breathalysers, smart traffic policing to be used at roadblocks",
            "url": "https://www.herald.co.zw/breathalysers-smart-traffic-policing-to-be-used-at-roadblocks/",
            "content": "Freeman Razemba-Senior Reporter\n\nMORE breathalysers and a new smart traffic management system will be used at roadblocks to contain the surge in accidents caused by reckless and drunk driving, the Government has said.\n\nAccording to the Government, the smart traffic management system was part of a broader strategy to improve traffic management and reduce road carnage, congestion and corruption.\n\nThe Government recently revealed that a Dubai-based company, Vitronic Machine Vision Middle East, was spearheading the project through a public-private partnership.\n\nThe company is set to inject an initial investment of approximately US$80 million into this transformative initiative.\n\nThe system will leverage technology to address various traffic-related challenges, ensuring that offenders are held accountable and that no individualregardless of their status or connectionsescapes the consequences of breaking the law.\n\nIn a joint statement, Home Affairs and Cultural Heritage Minister Kazembe Kazembe and his Transport and Infrastructural Development Minister Felix Mhona confirmed these developments.\n\nThey underscored the importance of transitioning to electronic traffic management, highlighting its impartiality and efficiency.\n\nThis year, our priority is deploying an electronic traffic management system. Technology doesnt discriminateit does not care about your face, relationship, or status. It ensures fairness and holds everyone accountable, read the statement.\n\nWhile the system is being implemented, police presence, roadblocks, and traffic controls will remain essential tools for maintaining order.\n\nThe ministers also called on drivers to adhere to traffic laws and urged the public to collaborate with the police in upholding safety standards.\n\nReckless drivers and lawbreakers have also been warned that they would face strict penalties, with plans underway to enforce deterrent measures against errant motorists.\n\nMeanwhile, the Government was recently in the process of procuring more breathalysers for use at roadblocks to combat the rising number of accidents and most of them have since arrived in the country.\n\nThe Ministry of Home Affairs, in partnership with the Traffic Safety Council of Zimbabwe (TSCZ), procured the breathalysers to use at roadblocks to combat the rising number of accidents caused by impaired driving.\n\nThese devices will be used at police roadblocks as part of an intensified road safety mechanism to curb reckless and drunk driving. May it be noted that more breathalysers are being procured to ensure these measures are widely implemented.\n\nI urge you all to actively support these efforts by reporting reckless driving and following traffic regulations. We must also take responsibility as citizens. If you witness dangerous behaviour on the roads, report it immediately.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/fefbbdcb-e350-42c6-8ec2-009073d3a5d2-680x380.jpeg",
            "description": "Freeman Razemba-Senior Reporter MORE breathalysers and a new smart traffic management system will be used at roadblocks to contain the surge in accidents caused by reckless and drunk driving, the Government has said. According to the Government, the smart traffic management system was part of a broader strategy to improve traffic management and reduce road […]",
            "time": "08:29",
            "date": "17 Apr 2025"
        },
        {
            "title": "ZITF exceeds space capacity . . . 112 new exhibitors sign up",
            "url": "https://www.herald.co.zw/zitf-exceeds-space-capacity-112-new-exhibitors-sign-up/",
            "content": "Nqobile Bhebhe\n\nTHE Zimbabwe International Trade Fair (ZITF) has exceeded its exhibition space capacity ahead of this years edition, following a record-breaking surge in interest from both new and returning exhibitors, local and international alike, thereby solidifying Zimbabwes status as a leading trade and investment destination.\n\nBy yesterday, an impressive 596 exhibitors had confirmed their participation, just shy of the 600 mark, with 112 of these being first-time participants. The figures reflect renewed confidence in the ZITF brand and optimism about Zimbabwes trade prospects. With traditional exhibition space now fully subscribed, organisers have moved to create additional space to meet the overwhelming demand.\n\nZITF Company board chairperson, Mr Busisa Moyo, announced the milestone during a media briefing yesterday, describing the 2025 edition as one of the most promising in the events 65-year history.\n\nTraditional exhibition space is 100 percent full, and the ZITF Company has prepared extra space to accommodate the high volume of exhibitors, currently standing at 596. Direct exhibitors have now taken up 51 204, 62 square metres of exhibition space, he said.\n\nThis years trade fair, set to run from 21 to 26 April at the Zimbabwe International Exhibition Centre, will be held under the theme Industrialisation: Crafting an Integrated Economic Landscape. It aims to bring together a dynamic mix of policymakers, industry leaders, investors, innovators, and small to medium enterprises under one roof.\n\nMr Moyo noted that the 2025 edition has seen unprecedented international interest, with 28 countries confirmed to participate  an increase from last years 27. A total of 45 direct international exhibitors are expected. Confirmed countries include Afghanistan, Angola, Austria, Belarus, Botswana, Brazil, Canada, China, the EU Delegation, Egypt, Ethiopia, France, Germany, Indonesia, Italy, Japan, Kenya, Malawi, Mozambique, Netherlands, Pakistan, Rwanda, South Africa, Sweden, Tanzania, the United Kingdom, the United States, the United Arab Emirates and Zambia.\n\nMr Moyo said ZITFs international appeal continues to grow, with more countries and global firms identifying Zimbabwe as a gateway to new markets and regional partnerships.\n\nWe can confirm the participation of 45 direct international exhibitors, with 28 countries represented in the show  an encouraging rise from last years 27, he said.\n\nAdding prestige to the event, the President of Mozambique, Daniel Chapo, is set to officially open the trade fair next Friday, an occasion expected to further deepen economic ties between Zimbabwe and its regional neighbours.\n\nZITFs exponential growth is also a significant win for Bulawayo, the countrys second-largest city, which once again takes centre stage as a hub for regional commerce and industrial dialogue.\n\nMinister of State for Bulawayo Provincial Affairs and Devolution, Judith Ncube, expressed satisfaction with the preparations and noted that interest remains high, with bookings still trickling in.\n\nAs host city, Bulawayo is ready to welcome this years edition of ZITF. What excites me most is the high number of foreign countries that have come on board. The ZITF chief executive officer, Dr Nicholas Ndebele, briefed me on this development, she said.\n\nMr Moyo also emphasised that ZITFs success hinges on an ecosystem approach, involving collaboration with key local stakeholders, from the hospitality sector and security services to emergency response teams, all of whom have confirmed their readiness.\n\nWe have already received assurance from stakeholders in the hospitality industry, emergency services, and security services, among others that they are fully prepared for the show, he said.\n\nMore than just an annual fixture, ZITF is increasingly viewed as a strategic platform that supports Government efforts to attract foreign direct investment and accelerate the countrys industrialisation drive. The fair offers a rare convergence of multi-sectoral representation, enabling stakeholders from manufacturing, ICT, mining, agriculture, and services to connect, collaborate, and compete on both regional and global stages.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Mr-Buusisa-Moyo-680x380.jpg",
            "description": "Nqobile Bhebhe THE Zimbabwe International Trade Fair (ZITF) has exceeded its exhibition space capacity ahead of this year’s edition, following a record-breaking surge in interest from both new and returning exhibitors, local and international alike, thereby solidifying Zimbabwe’s status as a leading trade and investment destination. By yesterday, an impressive 596 exhibitors had confirmed their […]",
            "time": "08:29",
            "date": "17 Apr 2025"
        },
        {
            "title": "Energy Compact to boost power supply . . . Interconnections improve access to regional power",
            "url": "https://www.herald.co.zw/energy-compact-to-boost-power-supply-interconnections-improve-access-to-regional-power/",
            "content": "Mukudzei Chingwere-Herald Reporter\n\nTHE newly approved comprehensive Energy Compact aimed at enhancing both internal generation and regional interconnections is a giant stride towards strengthening Zimbabwes energy landscape, a Cabinet Minister has said.\n\nResponding to questions at the post Cabinet media briefing in Harare on Tuesday, Energy and Power Development Minister July Moyo, outlined the multifaceted approach that the Compact, which was approved by Cabinet this week, will take to address the energy needs of Zimbabwe, the SADC region and beyond.\n\nThe Energy Compact is expected to increase the countrys energy supply, particularly through the expansion of renewable sources.\n\nMinister Moyo emphasised the importance of tapping into Zimbabwes diverse energy resources, including thermal and renewable energy.\n\nThe first part of the compact deals with internal generation in Zimbabwe and we have looked at all our generation capacities in terms of all the resource-based capacities of thermal and renewable energy, he said.\n\nWe obviously have stepped up our renewable energy market. Most households now have solar panels, firstly for their own use when you are not using your solar energy you can send it to the grid and you will be given credits.\n\nThen there are these captive power producers. Some of them are having enough for themselves and they are selling to the grid. Some of them have invested very big.\n\nMinister Moyo said renewable energy is becoming very important worldwide and Zimbabwe has started harnessing wind energy.\n\nRight now we have three sites where we want to attract investors because we believe the wind is strong enough for them to produce enough energy from wind which is renewable.\n\nBut ultimately our number one renewable energy source is water, hydro. Yes, climate change has impacted on us, but we still think that on the Zambezi Riverthere are sites where we can do what is called run of the river.\n\nRather than building a big reservoir you just build enough to create pressure and even when there is less rain we will be able to generate. So, Batoka is one of them, said Minister Moyo.\n\nA key element of the compact explained by the Minister is the enhancement of interconnectors with neighbouring countries.\n\nCurrently, Zimbabwe is linked to South Africa and Mozambique via 400 kVA lines, with additional connections to Zambia.\n\nMinister Moyo highlighted ongoing projects that will facilitate new interconnections, notably between Zambia and Tanzania, which will significantly widen access to electricity across the region.\n\nFor the regional aspect we need to have interconnectors. We are already, as Zimbabwe, interconnected to South Africa through a 400 kVA. We are connected with Mozambique with another 400 KVA, he said.\n\nMinister Moyo said Zimbabwe was also connected with another 400 kVA to Zambia and that connection also was strengthened with the help of Zambia through its inter-connection to the DRC.\n\nZimbabwe can access electricity from DRC through that connection.\n\nWhat we were lacking, we are connected to Botswana because they are connected to South Africa. What we were lacking are the interconnectors between Zambia and Tanzania, which we hope will be completed in the next few years, Minister Moyo said.\n\nOnce that happens, he said, Zimbabwe will have access not just to the SADC region, which are the 12 countries which are connected right now, but into East Africa because Tanzania is already connected to Kenya, Uganda, Burundi and Rwanda, as well as the interconnection between Kenya and Ethiopia.\n\nUltimately, you can end up saying we will be connected to the eastern seaboard, southern Africa, East Africa and North Africa, the part that goes to Egypt. So those interconnectors are very important.\n\nSo, that completes the whole picture of how Zimbabwe will play its role in the marketing of electricity among SADC countries, said Minister Moyo.\n\nHe said Government initiatives, such as the Presidential Household Scheme targeting 1.2 million people, aim to increase solar installations in rural areas.\n\nLooking ahead, Minister Moyo revealed plans for various renewable projects, including wind energy sites and innovative hydro solutions on the Zambezi River.\n\nThe Minister also spoke about the potential for floating solar systems on Lake Kariba, which could add up to 600 megawatts of power.\n\nBeyond interconnections and generation, Minister Moyo detailed efforts to extend the electricity grid to rural and underserved urban areas.\n\nWith over 5 000 schools already connected and plans to electrify clinics, the Government is committed to improving access to electricity for communities nationwide.\n\nWe have the Presidential Household Scheme, which is targeting 1.2 million people, and its starting this year, said Minister Moyo.\n\nWe have given it a two-year period so that we can have household solar systems, particularly in the rural areas.\n\nMinister Moyo said schools and clinics are also targeted for total electrification both in urban and rural areas.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/10/Minister-July-Moyo1.jpg",
            "description": "Mukudzei Chingwere-Herald Reporter THE newly approved comprehensive Energy Compact aimed at enhancing both internal generation and regional interconnections is a giant stride towards strengthening Zimbabwe’s energy landscape, a Cabinet Minister has said. Responding to questions at the post Cabinet media briefing in Harare on Tuesday, Energy and Power Development Minister July Moyo, outlined the multifaceted […]",
            "time": "08:29",
            "date": "17 Apr 2025"
        },
        {
            "title": "Editorial Comment: Local assembly plant will create jobs, boost economic growth",
            "url": "https://www.herald.co.zw/editorial-comment-local-assembly-plant-will-create-jobs-boost-economic-growth/",
            "content": "BELARUSIAN companies have become major suppliers of tractors, buses, trucks and fire-fighting equipment to Zimbabwe largely because of having the right vehicles and a willingness to enter into financial arrangements that allow buyers to pay over three years with low interest rates.\n\nThe strong political ties between the two countries helped build up the business, largely by oiling the processes, providing guarantees, opening doors and setting up programmes that tied in local authorities and farmers. The decisions over import duties and other taxes were also critical, many of the products have been able to enter Zimbabwe under duty concessions so cutting prices.\n\nBut important as these were in opening the market, the market has been largely created by business decisions of selling the right products at the right price with back-up and finance.\n\nSo the upgrade of the supply and marketing by setting up an assembly plant in Zimbabwe as is now planned by the end of the year makes a lot of sense and allows the Belarus businesses to also look at regional markets, especially if they can start adding some local content to meet rules of origin.\n\nBut for a start, even just final assembly should cut back sharply on transport costs, and these cannot be negligible when moving heavy vehicles from a landlocked country in the middle of Eastern Europe to a landlocked country in the middle of Southern Africa. Moving the parts as kits would seem to make best use of a supply line that must go from land, sea and back to land transport.\n\nWhile Belarus vehicles seem to be very price competitive, making them even more so by cutting transport costs and doing final assembly in Zimbabwe will consolidate the market and allow the equipment to remain competitive even when others start seeing the sense of offering the same sort of finance arrangements in Zimbabwe.\n\nIt would also move the duty concessions from what amount to one-offs for each particular programme to the regular concessions offered permanently for vehicle assembly, allowing for a far greater degree of long-term business relations and business planning on both sides.\n\nThat again will help concentrate the business parts of the relationship and help minimise the need for special action.\n\nThis double combination is what built up the previous assembly plants in colonial Zimbabwe. These days there is a better trained workforce available, from skilled workers all the way up to engineering professionals, so labour is no problem.\n\nThe Belarus suppliers can also then be looking at the rules of origin for the African Continental Free Trade Area, which at least in the early stages will require only modest local content input for the assembly plants, and with Zimbabwes industrial base now being extended rapidly with new steel mills and the like, quite possible to meet fairly soon.\n\nThis could also allow design modifications when these were thought desirable for Zimbabwean and African conditions, although Belarus engineers have had to design and produce products for some really harsh environments with infrastructure very variable.\n\nLocal assembly also allows for far easier training of the sort of service back up needed. Every vehicle and every machine needs regular servicing by someone who knows what theyre doing. Both servicing and repairs need stocks of spare parts and service mechanics who are familiar with the machines. Centring this supply and skills training on an assembly plant makes all the back-up a lot easier.\n\nGood original product and adaptive design, plus being inside a free trade area, will help build up regional markets, with word of mouth advertising from Zimbabwean users being probably the most effective way of breaking into non-traditional markets among our neighbours long dominated by others.\n\nWhat we are arguing is that the assembly plant should make business sense, for everyone, so that the decision to go ahead is a business decision and will build up longer-term relationships. When establishing new trade relationships, the diplomats and political leaders can provide a lot of help, but for the trade to endure it must make business sense.\n\nWe think that this plant does meet these conditions, so as the plans are turned into factory, the Zimbabwean authorities at national level, and in whatever city or town gets the plant, should be willing to smooth the way.\n\nZimbabwean farmers, local authorities and businesses have been using the Belarus vehicles and equipment that have come through the doors opened through diplomacy, and seem to be happy with the value they are paying for. So the continued progress towards expanding business and trade ties seems appropriate.\n\nThis will be seen among suppliers of other equipment into Zimbabwe, the country having several advantages when it comes to selecting a regional and AfCFTA hub, and so having ever more model investment and satisfied investors in Zimbabwes industrial development is important.\n\nModern global trade would seem to need ever more spread of manufacturing by suppliers, both to enter markets and to find ever more skilled workers, as well as control costs by making best use of transport and local resources.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Chief-director-for-Political-Affairs-Pearson-Chigiji-shakes-hands-with-the-Belarus-Head-of-the-Department-of-Africa-and-the-Middle-East-Yuri-Nikolaychik-680x380.jpg",
            "description": "BELARUSIAN companies have become major suppliers of tractors, buses, trucks and fire-fighting equipment to Zimbabwe largely because of having the right vehicles and a willingness to enter into financial arrangements that allow buyers to pay over three years with low interest rates. The strong political ties between the two countries helped build up the business, […]",
            "time": "08:29",
            "date": "17 Apr 2025"
        }
    ]
}