{
    "news": [
        {
            "title": "Uhuru preps at full throttle . . . Installation of critical infrastructure almost complete",
            "url": "https://www.herald.co.zw/uhuru-preps-at-full-throttle-installation-of-critical-infrastructure-almost-complete/",
            "content": "Mukudzei Chingwere-Herald Reporter\n\nPreparations for the countrys 45th Independence anniversary celebrations slated for Gokwe, Midlands Province, are on course, with the installation of critical infrastructure at the venue almost complete.\n\nHeritage sites are being upgraded, schools and clinics have been built while the stadium that will host Premier Soccer League teams in rural Gokwe is almost ready.\n\nAddressing a post-Cabinet media briefing in Harare yesterday, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere detailed progress made so far.\n\nHe said contractors were working diligently at the main arena and Gokwe North Open Grounds.\n\nThe Midlands Province will host this years celebrations after the Second Republic adopted a policy of rotating the hosting of national events in line with President Mnangagwas devolution policy.\n\nLast year, the 44th celebrations were held in Buhera, with a record 70 000 people attending.\n\nThis years celebrations will take place at Nembudziya Growth Point in Gokwe North District, with a special Childrens Party hosted by the First Family on April 17 at Nyamuroro High School.\n\nNotable progress at the venue includes the planting of the lawn, construction of changing rooms, installation of floodlights and building of ablution blocks as well as the sprucing up of the road leading to the venue.\n\nThe venue of the Childrens Party is also undergoing substantial renovations.\n\nPreparations for the 45th independence anniversary and the 2025 Childrens Party have gathered momentum and the nation is gearing up for the celebrations, said Dr Muswere.\n\nContractors have accelerated works at the Main Arena, Gokwe North Open Grounds, and phenomenal progress has been achieved in lawn-planting; terracing; construction of changing rooms; floodlight installation; and construction of ablution blocks.\n\nHe said the venue of the Childrens Party, Nyamuroro High School, is undergoing vast transformation through the construction of two ablution blocks and two students hostels, both of which are almost complete.\n\nRegarding work at Nembudziya Government High School, the Gala Site, construction of one ablution block and 2 classroom blocks; a domestic science laboratory; and a senior science laboratory have reached wall plate level, with roof installation being the next phase, said Dr Muswere.\n\nHe also outlined both short and long-term plans to enhance infrastructure development in the Midlands Province, particularly in Gokwe.\n\nRoad rehabilitation efforts under the Emergency Road Rehabilitation Programme are ongoing, with major feeder roads being re-gravelled and surfaced in anticipation of the celebrations.\n\nHealth and wellness services are also a priority, with 10 emergency health management teams and ambulances, including an air ambulance, being mobilised.\n\nA VIP ward, isolation centre and 16 telemedicine centres have been established to ensure the safety and well-being of all participants.\n\nConcerning health and wellness, the following services, among others, have been mobilised for the Celebrations, said Dr Muswere.\n\n10 emergency health management teams; 10 ambulances; an air ambulance, and emergency kits. A VIP ward, isolation centre and 16 telemedicine centres have been established.\n\nConstruction of a mortuary and extension of a ward are already underway at NembudziyaHospital.\n\nAdding to the historical significance of the celebrations, the Independence Flame will embark on a route through various districts, culminating at Nembudziya Growth Point.\n\nThe flame will be lit by Vice President Dr Constantino Chiwenga on April 10 in Gweru, before passing through key sites including the former Sikombela Detention Camp where it will be received by Vice President KemboMohadi.\n\nTo honour those who fought for Zimbabwes freedom, 132 graves at heroes shrines throughout the Midlands are being adorned with concrete slabs, while a field museum and memorial plinth are set to be completed at the former Sikombela Restriction Camp beforeApril 17.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/President-Mnangagwa-680x380.jpg",
            "description": "Mukudzei Chingwere-Herald Reporter Preparations for the country’s 45th Independence anniversary celebrations slated for Gokwe, Midlands Province, are on course, with the installation of critical infrastructure at the venue almost complete. Heritage sites are being upgraded, schools and clinics have been built while the stadium that will host Premier Soccer League teams in rural Gokwe is […]",
            "time": "06:35",
            "date": "02 Apr 2025"
        },
        {
            "title": "RBZ to swoop on currency hoarders",
            "url": "https://www.herald.co.zw/rbz-to-swoop-on-currency-hoarders/",
            "content": "Richard Muponde-Zimpapers Politics Hub\n\nTHE Reserve Bank of Zimbabwe (RBZ) will soon swoop on businesses and individuals hoarding money in cash deposit boxes in banks, homes and business premises.\n\nAuthorities are concerned that such practices leave millions of dollars lying idle, starving the economy of much-needed cash for transactions.\n\nAnnouncing his 2025 Monetary Policy Statement in February, RBZ Governor Dr John Mushayavanhu described the practice of hoarding cash in banks or company premises as financial disintermediation, which he said was stifling economic growth by depriving economic agents of much-needed liquidity.\n\nSome manufacturers, he said, were supplying goods to the informal market but were not banking the proceeds. Instead, they were keeping these funds in cash deposit boxes, which violates the Anti-Money Laundering Act.\n\nDr Mushayavanhu said the Financial Intelligence Unit (FIU) of the RBZ would take action to address this malpractice.\n\nFIU director-general, Mr Oliver Chiperesa, confirmed the impending blitz, citing concerns raised by Dr Mushayavanhu.\n\nYou may recall that during the presentation of his 2025 Monetary Policy Statement, the RBZ Governor mentioned that businesses and individuals, especially manufacturers and informal retailers, were hoarding millions of dollars in their cash deposit boxes. This is depriving the economy of the much-needed liquidity, Mr Chiperesa said.\n\nWe are currently working on the regulations to ensure that we conduct this blitz within the confines of the law. Normally, cash deposit boxes are used to keep important documents, but the current trend is that they are being used to store large sums of money outside the banking system, which is illegal according to the Anti-Money Laundering Act.\n\nHe said it was encouraging to see improved use of the official banking system, which promotes free financial flows.\n\nWe want to encourage growth and ensure that all transactions are accounted for in line with anti-money laundering and anti-terrorism regulations. We were removed from the FATF (Financial Action Task Force) grey list because of the clean flow of money in our economy, and we want to maintain that achievement to support economic growth through attracting Foreign Direct Investment, Mr Chiperesa said.\n\nThe FIU recently strengthened its operations by opening offices in Bulawayo to bolster ZiG stability.\n\nHowever, the widespread hoarding of millions of dollars in cash deposit boxes was a major challenge as it threatened financial stability.\n\nCurrently, as Dr Mushayavanhu indicated, there was stability in the market and the continued stability of Zimbabwe Gold (ZiG) was expected to lead to more transactions being conducted in local currency.\n\nThese transactions are expected to include fuel sales as the market begins to embrace ZiG as a store of value and a reliable medium of exchange.\n\nDr Mushayavanhu also emphasised that keeping large sums of cash was an unnecessary risk given the upward revision in limits on prepaid credit and attractive interest rates on savings.\n\nAs part of efforts to promote a culture of saving and bolster confidence in the local banking sector, the RBZ has implemented an incremental rise in interest rates on savingsaccounts.\n\nThe stability of ZiG has led to an increase in local currency transactions and deposits, signalling confidence and acceptance of the local currency by the market.\n\nThis development has also resulted in the proportion of local currency deposits held by banks increasing from less than 10 percent before the introduction of ZiG to current levels of around 15percent.\n\nThe RBZ also requires 50 percent of quarterly payments dates (QPDs) by corporates to be settled in local currency, as part of measures to promote the use and stability of the ZiG currency.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/rhrhr-680x380.jpg",
            "description": "Richard Muponde-Zimpapers Politics Hub THE Reserve Bank of Zimbabwe (RBZ) will soon swoop on businesses and individuals hoarding money in cash deposit boxes in banks, homes and business premises. Authorities are concerned that such practices leave millions of dollars lying idle, starving the economy of much-needed cash for transactions. Announcing his 2025 Monetary Policy Statement […]",
            "time": "06:35",
            "date": "02 Apr 2025"
        },
        {
            "title": "Zimbabweans demonstrate full support for President",
            "url": "https://www.herald.co.zw/zimbabweans-demonstrate-full-support-for-president/",
            "content": "Herald Reporter\n\nZIMBABWEANS demonstrated their full support for President Mnangagwa and their appreciation of the peace prevailing in the country by ignoring calls to demonstrate by some shadowy terror groups on Monday, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere, has said.\n\nSpeaking at a post-Cabinet media briefing in Harare yesterday, Dr Muswere said the failure of the protests was testament to the citizens confidence in the constitutionally-elected Zanu PF Government, led by President Mnangagwa.\n\nIn terms of what cyber terrorists had planned which did not materialise yesterday (Monday), this is a clear demonstration that Zimbabweans fully support the Government that they elected, that is the Zanu PF Government which is headed by His Excellency President Mnangagwa. This also shows that we still fully appreciate peace and tranquillity in our country, said Dr Muswere.\n\nHe described those who incited the protests as misguided and delusional figures with unrealistic ambitions.\n\nYes, these cyber-terrorists were led by one (Blessed) Geza, a liberation war mistake with a lot of delusional hallucinations in that he actually believed he could create an uprising in our country which is a clear misdirection of ambition. We are here and we can witness that peace and tranquillity continues to exist in our country, Dr Muswere said.\n\nHe emphasised the importance of collective responsibility in achieving national development goals and assured the nation that the security sector remained vigilant in addressing such activities.\n\nZimbabweans have got a shared responsibility in order to achieve Vision 2030 which seeks to achieve an upper middle society by the year 2030, said Dr Muswere.\n\nA planned demonstration that had been called for Monday by former Zanu-PF Central Committee member, Geza, was a monumental flop as Zimbabweans chose to uphold the peace and tranquillity prevailing in the country.\n\nPeace prevailed nationwide, with no meaningful demonstrations recorded as it was business as usual.\n\nSchools were open and learners attended classes as usual.\n\nNational police spokesperson Commissioner Paul Nyathi said the situation was generally calm countrywide.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Business-as-usual-680x380.jpg",
            "description": "Herald Reporter ZIMBABWEANS demonstrated their full support for President Mnangagwa and their appreciation of the peace prevailing in the country by ignoring calls to demonstrate by some shadowy terror groups on Monday, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere, has said. Speaking at a post-Cabinet media briefing in Harare yesterday, Dr Muswere said […]",
            "time": "06:35",
            "date": "02 Apr 2025"
        },
        {
            "title": "Cabinet approves media policy",
            "url": "https://www.herald.co.zw/cabinet-approves-media-policy/",
            "content": "Mukudzei Chingwere-Herald Reporter\n\nCabinet has approved the Zimbabwe Media Policy aimed at enhancing the countrys media landscape, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere has said.\n\nThis policy is designed to protect Zimbabwes image, sovereignty, and territorial integrity while promoting a robust digital economy and a diverse media industry.\n\nIt outlines ambitious goals to transform the media environment through modern infrastructure, emphasising professionalism and creating a comprehensive code of ethics to raise media standards nationwide.\n\nThe policy not only seeks to ensure the viability and sustainability of the media but also to cultivate national values and foster a common understanding of Zimbabwes history and development goals.\n\nDr Muswere stated that by advancing national interests, the policy aims to enhance the countrys social, economic, cultural, and political well-being.\n\nCabinet considered and approved the Zimbabwe Media Policy, said Dr Muswere.\n\nThe objectives of the policy are to defend Zimbabwes image, sovereignty and territorial integrity, to achieve a strong and converged digital economy, to promote the growth and development of a vibrant, diverse media industry in Zimbabwe.\n\nTo transform Zimbabwes media landscape through the development of modern, efficient, and sustainable infrastructure, to promote professionalism and capacitate the industry, to develop and enforce a comprehensive code of ethics to raise the standards of media practice in Zimbabwe.\n\nTo instil national values, ethics and citizenship thereby promoting a shared understanding of Zimbabwes history, vision, and developmental aspirations, advance and protect Zimbabwes national interests and promote the countrys social, economic, cultural and political well-being.\n\nThe Policy will assert and maintain Zimbabwes media sovereignty to ensure the countrys independence and self-determination in the production, dissemination, and regulation of media content. Foster a linguistically inclusive media landscape in Zimbabwe, where all officially recognised languages are valued, promoted, and used to reach diverse audiences and communities and govern the whole sector, including internet-based broadcasting.\n\nWith strict measures in place, the policy mandates a 75 percent local content quota for all broadcasting licensees, while specialised broadcasters will adhere to a 50 percent quota.\n\nThis initiative seeks to counter the dominance of foreign content and provide necessary incentives for local production, all while safeguarding intellectual property rights.\n\nThe sixth pillar of the policy, which is Local Content Promotion, addresses challenges such as funding constraints, limited producer capacity, the dominance of foreign content, and an inadequate regulatory framework, said Dr Muswere.\n\nThematic Working Groups will be established to focus on specific policy pillars, while the ministry will take the lead in coordinating and implementing the Policy.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/minister-Muswere-Sanyatwe-and-Garwe-and-Mr-Nick-Mangwana-680x380.jpg",
            "description": "Mukudzei Chingwere-Herald Reporter Cabinet has approved the Zimbabwe Media Policy aimed at enhancing the country’s media landscape, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere has said. This policy is designed to protect Zimbabwe’s image, sovereignty, and territorial integrity while promoting a robust digital economy and a diverse media industry. It outlines ambitious goals […]",
            "time": "06:35",
            "date": "02 Apr 2025"
        },
        {
            "title": "Trump aid cut: Zim to unveil HIV funding plan",
            "url": "https://www.herald.co.zw/trump-aid-cut-zim-to-unveil-hiv-funding-plan/",
            "content": "Africa Moyo in CHINHOYI\n\nZIMBABWE will unveil an HIV sustainability plan expected to address funding issues following the suspension of development partner support through United States President Donald Trumps Executive Order, Permanent Secretary for Health and Child Care Dr Aspect Maunganidze said yesterday.\n\nSpeaking at a two-day editors workshop organised by the National AIDS Council (NAC), which ends here today, Dr Maunganidze said Zimbabwe has taken active steps to fill the gap left by the withdrawal of US funding.\n\nThis workshop comes at a time when our health delivery system is at crossroads given the abrupt cessation of funding from some of our foreign partners, he said.\n\nAs a Ministry, we have already taken steps to ensure that our people are not severely affected especially those taking antiretroviral therapy. Part of these steps include budget allocation, budget reprioritisation, national health insurance and others to ensure that our health programmes continue to function and to serve our people as before.\n\nI am glad that the move by the United States government came when we were already engaged in processes to develop an HIV sustainability plan, which will be ready soon.\n\nDr Maunganidze said the media, especially editors, should inform the nation about the funding gaps, the discussions and decisions needed to be taken to ensure the Governments response is sustainable and meets the expectations of our people without leaving anyone behind.\n\nYour power is not just in informing and educating but in setting the national policy agenda, reframing narratives and advocating for the health and social transformation envisioned by the Second Republic.\n\nAs a Ministry and working together with the National AIDS Council in this regard, we are aware that the health and well-being of our nation will strongly benefit from this engagement today.\n\nI therefore want to challenge you continue educating the public with accurate, science-backed information, eliminate stigma through responsible, inclusive reporting and to amplify the voices of those living with HIV, ensuring their stories are told with dignity, he said.\n\nDr Maunganidze added that as the nation moves towards the goal of ending AIDS by 2030, his ministry will continue to strengthen partnerships with the media.\n\nAccurate and timely information has always been a vital resource in public health, which policy makers, media practitioners and the public prioritise, he explained.\n\nThe workshop has been convened, rooted in the need to ensure the media continue to prioritise HIV and related morbidities within their coverage and reportage.\n\nGovernment says without correct and timely information, the public is left to the perils of inaccurate information often peddled by social media.\n\nYour role is profound in facilitating accurate, objective, and sensitive reporting, debunking myths, and promoting awareness through responsible media coverage, ultimately contributing to public health and well-being, said Dr Maunganidze.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Dr-Aspect-Maunganidze-680x380.jpg",
            "description": "Africa Moyo in CHINHOYI ZIMBABWE will unveil an HIV sustainability plan expected to address funding issues following the suspension of development partner support through United States President Donald Trump’s Executive Order, Permanent Secretary for Health and Child Care Dr Aspect Maunganidze said yesterday. Speaking at a two-day editors workshop organised by the National AIDS Council […]",
            "time": "06:35",
            "date": "02 Apr 2025"
        },
        {
            "title": "Tagwirei co-option will enrich ruling party — Mutsvangwa",
            "url": "https://www.herald.co.zw/tagwirei-co-option-will-enrich-ruling-party-mutsvangwa/",
            "content": "Joseph Madzimure-Zimpapers Politics Hub\n\nTHE proposed co-option of businessman Cde Kudakwashe Tagwirei into the Zanu PF Central Committee is set to strengthen the partys business interests, ensuring closer alignment with the economic sector, a senior official has said.\n\nOn Monday, the Zanu PF Harare provincial executive recommended the co-option of Cde Tagwirei into the ruling partys Central Committee  the highest decision making body outside Congress.\n\nAddressing a press conference in Harare yesterday, Zanu PF Secretary for Information and Publicity, Cde Christopher Mutsvangwa, said the co-option of Cde Tagwirei into the Central Committee would help the party and Government remain alive to business needs, given the sectors broad impact on society.\n\nSince the business community is involved in the sale of goods and services, their impact on the community is much bigger nowadays. To have Cde Tagwirei in the ranks of Zanu PF in Harare province is a noble thing, more so at the stage where the reforms of the President have taken traction. We are beginning to see big investors coming from outside, he said.\n\nCde Mutsvangwa likened Cde Tagwireis potential influence on Zanu PF and the nation to that of billionaire Mr Elon Musk, who serves as an advisor to United States President Donald Trump.\n\nFor him to become part of the Zanu PF leadership, his vast business experience, his entrepreneurial argument will also enrich the proceedings of Harare province.\n\nIf I can draw allusions, we can see how Elon Musk, a senior advisor to President Trump and other business people have enriched the second term of President Trump. And just last week, the American leadership and the Chinese leadership were having a meeting with his business class.\n\nAll the new entrepreneurs who are deep-seeker entrepreneurs in artificial intelligence and a gamut of other Chinese business people in robotics, in drones, across the board, were in attendance. So the business class is a good thing for it to be identified with the ruling party, he said.\n\nCde Mutsvangwa said collaboration with business leaders like Cde Tagwirei will be key to achieving Vision 2030.\n\nIt is a timely move for Cde Tagwirei to come to the party, and we hope that his example will be followed by more and more business people.We, of course, take pride in that we are a mass membership party because we are democratic, but we also want to be enriched by ideas of those people who are in charge of producing goods and services within the country, within the region and for the global marketplace, he said.\n\nWe want them to be in Zanu PF so that they fertilise the entrepreneurial discourse which may be going on at any particular time. We welcome Cde Tagwirei, well done Harare province for embracing him.\n\nCde Mutsvangwa implored Zanu PF Harare province members to give Cde Tagwirei as much support as they can for him to flourish in politics.\n\nI also hope he learns as much as he can about the ethos of Zanu PF as a party of the permanent Zimbabwe revolution, a party which aspires to make sure that there is shared progress and common prosperity, he said.\n\nZanu PF Harare province chairperson Cde Godwills Masimirembwa confirmed that the recommendation for Cde Tagwireis co-option had been submitted to the party Secretary General Cde Obert Mpofu who will provide further guidance on the next steps.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Cdes-Mutsvangwa-and-Marapira-680x380.jpg",
            "description": "Joseph Madzimure-Zimpapers Politics Hub THE proposed co-option of businessman Cde Kudakwashe Tagwirei into the Zanu PF Central Committee is set to strengthen the party’s business interests, ensuring closer alignment with the economic sector, a senior official has said. On Monday, the Zanu PF Harare provincial executive recommended the co-option of Cde Tagwirei into the ruling […]",
            "time": "06:35",
            "date": "02 Apr 2025"
        },
        {
            "title": "SADC, EAC to merge DRC peace frameworks",
            "url": "https://www.herald.co.zw/sadc-eac-to-merge-drc-peace-frameworks/",
            "content": "Wallace Ruzvidzo-Herald Reporter\n\nSADC and the East African Community (EAC) are completing the development of a framework that will see the merging of the Luanda and Nairobi processes.\n\nApart from that, the terms of reference for the appointed facilitators to the Democratic Republic of Congo conflict have been completed and soon SADC Chairman President Mnangagwa and his Kenyan counterpart William Ruto, who is EAC Chairman, will convene a meeting on the way forward.\n\nLetters of appointment have since been sent to former Nigerian President Olusegun Obasanjo, former Kenyan President Uhuru Kenyatta, former South African President Kgalema Motlanthe, former Central African Republic President Catherine Samba Panza and former Ethiopian President Sahle-Work Zewde, pending their confirmation of availability.\n\nResponding to a question posed by The Herald at yesterdays post-Cabinet media briefing held in Harare, Foreign Affairs and International Trade Minister Professor Amon Murwira said the merging of the Luanda and Nairobi processes as well as the development of the terms of reference was almost complete.\n\nThe Luanda Process was established as part of the 2022 Luanda Roadmap, aimed at defusing tensions between Rwanda and the DRC, while the Nairobi Process is a regional peace initiative aimed at resolving the conflict in the Eastern parts of the DRC.\n\nThey (appointed panel) have to respond affirming that they are available and the terms of reference are being developed by SADC and EAC, these terms of reference are about to be finished, said Prof Murwira.\n\nThere is also a framework document that is going to be produced, joining the Luanda and the Nairobiprocesses.\n\nAs you know, the Rwanda process is the one that is trying to mediate between DRC and Rwanda as states and the Nairobi process is the one that is trying to bring the Congolese together, the warring Congolese people together.\n\nSo these are going to be merged and then be led by the facilitation teams, or the facilitation team that has been suggested and this is to happen soon.\n\nThe convening of the High-level meeting to be held by Presidents Mnangagwa and Ruto had a seven-day framework which ended yesterday.\n\nThe completion of the process was supposed to be in seven days, the completion of the process of doing this, and the seventh day is today (yesterday), said Prof Murwira.\n\nTheir Excellencies will meet very soon with the facilitators to brief them on the task ahead, brief them on the expectation, which is the terms of reference, brief them on the framework that is the Rwanda and Nairobi process framework, but at the same time involve the African Unionin that process.\n\nSo all these preparations are being met, and we expect that meeting to occur very soon, having fulfilled these conditions that I talked about; the submission of the letters appointing the facilitators, the response of those facilitators, the completion of the framework document joining the Rwanda and the Nairobi process, as well as the terms of reference that are required for that meeting to take place. So its going to happen very soon.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/DRC-Peace-Process-Leaders-2-680x380.jpg",
            "description": "Wallace Ruzvidzo-Herald Reporter SADC and the East African Community (EAC) are completing the development of a framework that will see the merging of the Luanda and Nairobi processes. Apart from that, the terms of reference for the appointed facilitators to the Democratic Republic of Congo conflict have been completed and soon SADC Chairman President Mnangagwa […]",
            "time": "06:35",
            "date": "02 Apr 2025"
        },
        {
            "title": "Govt sets up department to monitor service delivery",
            "url": "https://www.herald.co.zw/govt-sets-up-department-to-monitor-service-delivery/",
            "content": "Blessings Chidakwa-Herald Reporter\n\nTHE Ministry of Local Government and Public Works has introduced an Inspectorate Department responsible for monitoring service provision in councils.\n\nThe Inspectorate Department is in line with President Mnangagwas blueprint titled, A Call to Action No Compromise on Service Delivery: First Stage of Interventions to Modernise the Operations of Local Authorities Towards Vision 2030, that was launched last year to guide local authorities towards improving service delivery in tandem with the national development aspirations.\n\nAccording to the blueprint, President Mnangagwa directed that each local authority develops its unique operating procedures and systems to ensure compliance with the law and the achievement of minimum service delivery standards.\n\nWhile fielding questions in Parliament regarding ratepayers paying for non-existent services, Local Government and Public Works Deputy Minister Benjamin Kabikira said the ministry had established minimum service delivery standards for all local authorities across various service categories.\n\nIn addition, the Government has also created an Inspectorate Department that will be responsible for monitoring service provision in local authorities. The performance of local authorities will now be measured using the minimum service delivery standards performance assessment system, with inspections conducted by the Inspectorate Department, the deputy minister said recently.\n\nAccording to the blueprint, inspection and systems audits by the Ministry of Local Government and Public Works will be structured in such a manner that all local authorities are continuously reviewed to ensure compliance with the law, minimum service delivery levels, and respective standard operating procedures.\n\nAt the launch of the blueprint, President Mnangagwa emphasised that service delivery must be prioritised, adding that ratepayers have the right to demand accountability from those who fail to deliver. Several directives highlighted in the Presidents blueprint include awarding the best-performing local authorities and council officials.\n\nThe blueprint also directs all local authorities to establish fully-fledged planning departments to the satisfaction of the Ministry of Local Government and Public Works.\n\nThe Government is taking planning issues seriously to curb the proliferation of haphazard structures, particularly in urban settlements.\n\nFurthermore, President Mnangagwa has instructed that all local authorities develop master plans, implement functional Enterprise Resource Planning (ERP) systems, and maintain up-to-date valuation rolls. The blueprint also prohibits the construction of permanent structures, as well as the sale or transfer of land titles on servitudes, ensuring that the Government can reclaim land when necessary.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/10/Deputy-Minister-Benjamin-Kabikira.jpg",
            "description": "Blessings Chidakwa-Herald Reporter THE Ministry of Local Government and Public Works has introduced an Inspectorate Department responsible for monitoring service provision in councils. The Inspectorate Department is in line with President Mnangagwa’s blueprint titled, “A Call to Action No Compromise on Service Delivery: First Stage of Interventions to Modernise the Operations of Local Authorities Towards […]",
            "time": "06:35",
            "date": "02 Apr 2025"
        },
        {
            "title": "Geza motivated by financial selfish gains — Tungwarara",
            "url": "https://www.herald.co.zw/geza-motivated-by-financial-selfish-gains-tungwarara/",
            "content": "Herald Reporter\n\nTHE Special Presidential Investment Advisor, Dr Paul Tungwarara, has described renegade war veteran Blessed Geza as a failed politician whose recent rants are motivated by selfish interests.\n\nHe urged the former Zanu PF Central Committee member to issue a public apology to President Mnangagwa and stop being used by self-exiled individuals who would want to reverse the gains achieved by the Second Republic.\n\nDr Tungwarara said President Mnangagwa is a forgiving father and a listening man, who is always open to dialogue even with those who have opposed him.\n\nHis remarks come in the wake of the failed March 31 demonstration, which he claims was not driven by genuine political grievances but by financial interests.\n\nThe March 31 demonstration has failed, and evidence suggests it was a money scheme. The call for demonstrations was motivated by financial gain, Dr Tungwarara said.\n\nHis call for an apology aligns with the administrations broader approach of engaging critics through dialogue rather than confrontation.\n\nIn the past few months, Dr Tungwarara has spearheaded several programmes that have improved the livelihoods of Zimbabweans including war veterans, youth, and rural communities. These efforts are in sync with President Mnangagwas Vision 2030, focusing on inclusive economic development and empowerment.\n\nDr Tungwarara has been instrumental in launching the War Veterans Welfare Fund, which is designed to honour and support those who participated in Zimbabwes liberation struggle.\n\nHe announced a nationwide allocation of $1,5 million, with each of Zimbabwes 10 provinces receiving $150 000.\n\nThis interest-free fund is designed to support short-term projects that empower war veterans and contribute to the countrys economic growth.\n\nBeyond financial assistance, each veteran is set to receive a rural house and a borehole at their homestead, enhancing their living conditions and promoting economic self-sufficiency.\n\nAlso recognising the pivotal role of youths in national development, Dr Tungwarara is overseeing the Youth Fund, an initiative providing financial support, training, and mentorship to young Zimbabweans.\n\nThis programme aims to empower the next generation of leaders and entrepreneurs, enabling them to pursue innovative ventures and contribute meaningfully to the nations economic landscape.\n\nOn rural development, Dr Tungwarara has played a key role in the establishment of Village Business Units (VBUs) under the Presidential Rural Development Programme.\n\nThese VBUs are registered rural enterprises designed to stimulate economic activity and improve livelihoods in rural communities.\n\nEach unit typically consists of a one-hectare plot equipped with irrigation systems, greenhouses, and other agricultural infrastructure, enabling villages to produce and market agricultural products effectively.\n\nTo accelerate the setup of these units, contractors have been deployed to fast-track the construction of solar-powered boreholes in rural districts.\n\nThe Governments ambitious plan aims to establish 10 000 VBUs by the end of the year, each comprising a solar-powered borehole, storage tanks, a drip-irrigated horticulture garden, and fish ponds.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Dr-Paul-Tungwarara-680x380.jpg",
            "description": "Herald Reporter THE Special Presidential Investment Advisor, Dr Paul Tungwarara, has described renegade war veteran Blessed Geza as a failed politician whose recent rants are motivated by selfish interests. He urged the former Zanu PF Central Committee member to issue a public apology to President Mnangagwa and stop being used by self-exiled individuals who would […]",
            "time": "06:35",
            "date": "02 Apr 2025"
        },
        {
            "title": "Editorial Comment: High salaries at council must match service delivery",
            "url": "https://www.herald.co.zw/editorial-comment-high-salaries-at-council-must-match-service-delivery/",
            "content": "HARARE City Council is still paying its top officials, and in particular the town clerk and departmental heads, far above the pay scales approved by the Local Government Board, especially once all allowances are factored in.\n\nThis board, appointed by the Government, keeps a watchful eye on what all local authorities are doing and has set a sliding scale of pay schedules for top administrative staff that take into account the size of the city, town or rural district council that the administrators work for, and the sort of qualifications they are expected to hold.\n\nThis is meant to create a reasonably uniform structure for local government across the country.\n\nIt also stops a council from trying to economise by hiring sub-standard staff at ultra-low pay, as well as attacking what is now seen in Harare of senior staff padding their pay.\n\nGenerally the pay scales and qualifications for local government are supposed to be in line with those for civil servants in central government, so that everyone in the public sector is in the same sort of groups.\n\nIt is fairly obvious that the low calibre of so many city councillors in Harare in recent years, a problem that a succession of mayors from the same opposition party as the majority of councillors have highlighted in recent years, has allowed senior officials to run rings around their supposed masters when it comes to employment contracts.\n\nThe fact that the same officials have been happy to sign off the allowances paid to councillors for attending meetings, and arrange workshops with large subsistence and travel allowances for councillors in resorts some distance from Harare, suggests there could well be a bit of mutual back scratching when it comes to city finances.\n\nThe reason for zero action on the directives of the Local Government Board is obvious: the administrative officials who are supposed to implement the directive and draw up the approved conditions of service and pay scales to replace those declared null and void are precisely the same people who have been living in clover on the inflated scales.\n\nSo Harare continues to pay US$500 000 a month in salaries and allowances to its top officials, with the town clerk able to pull in US$30 000 a month. Besides this ordinary high pay, the top officials also benefit from some other fancy perks, such as holiday allowances which include travel and hotel costs for resorts in Zimbabwe, in the region and worldwide.\n\nMiddle and lower level council staff, and this includes the technical staff battling to keep basic services functioning even when the council cannot provide the capital equipment and the money for things like water treatment chemicals, are not being overpaid and are on the sort of standard pay scales for their levels of responsibility and qualifications found through the public sector.\n\nKnowing now, thanks to evidence presented to the Commission of Inquiry into the affairs of Harare City Council, what was going on, the senior management suites cannot be fostering staff morale that wonderful in the municipal offices.\n\nOrdinary staff have had delayed pay days and all sorts of other problems even getting what they are owed, thanks to the way liquid cash is siphoned off to the top dogs.\n\nWe suspect that when the pay of top council officials was being pushed up beyond the limits set by the Local Government Board, the usual arguments were presented, that high level staff would leave the councils service for the private sector if they were not paid this sort of money and given these sort of perks.\n\nWell, considering how the top officials, with perhaps one or two exceptions, are ruining the city, most residents would be happy to see them storm out and join the private sector, although we suspect that having high-end city council service on your CV is unlikely to produce job offers at anything like the salaries they now earn. Residents would cheer as they walked out.\n\nThe Local Government Board may have to intervene more decisively if the Harare City Council, guided by its own defaulting officials, does not draw up a proper grading framework and salary scales.\n\nThis might mean sending in a team borrowed from the Public Service Commission who would know the public sector grading structure inside out and would be able to quickly draw up an appropriate grading and salary structure for Harare City Council.\n\nIndeed, even if Harare is prepared to do the work itself, it would seem sensible for it to get technical advice from the Local Government Board and the Public Service Commission so that it gets it right on the first attempt, rather than having a structure going backwards and forwards between the board and the council until the present crowd of city officials have all reached retirement age.\n\nAt the same time, the council, backed by the board or even directed by the board, should be implementing the sort of performance contracts for its top officials that the President considers so essential for the top layers of the civil service.\n\nUnder-performing officials, especially of they are seriously under-performing, could be reassigned to posts more suitable for their talents, or encouraged to leave council service.\n\nAt the same time, some sort of basic qualifications need to be laid down for local government councillors, especially those on the councils of complex organisations like a major city. In the past, city councillors were usually people who would have made their mark in life, in a profession or in business, and want to give back to their community or at least sort out what they saw as irritating deficiencies.\n\nThese days a lot of councillors try to live off their allowances, which were originally paid so that councillors were not out of pocket for expenses, being able to buy petrol to drive to meetings and pay their phone bills when replying to residents queries and the like.\n\nRegardless of party, councillors should have some basic skills and professional background if they are to be any good.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2018/12/Town-House-1.jpg",
            "description": "HARARE City Council is still paying its top officials, and in particular the town clerk and departmental heads, far above the pay scales approved by the Local Government Board, especially once all allowances are factored in. This board, appointed by the Government, keeps a watchful eye on what all local authorities are doing and has […]",
            "time": "06:35",
            "date": "02 Apr 2025"
        }
    ]
}