{
    "news": [
        {
            "title": "‘Accountants must drive growth, modernisation’",
            "url": "https://www.herald.co.zw/accountants-must-drive-growth-modernisation/",
            "content": "Zvamaida Murwira, Senior Reporter\n\nACCOUNTANTS are gatekeepers of the countrys national resources and their financial insights must help support business growth, leading to modernisation, industrialisation and overall cross-sectoral economic growth, President Mnangagwa has said.\n\nOfficially opening the Chartered Accountants Conference hosted by the Public Accounts and Auditors Board Zimbabwe in Harare yesterday, the President said it was the responsibility of accountants to maintain discipline and integrity so that the country cannot suffer from the consequence of unethical financial conduct through manipulation of financial reports and money laundering, among other vices.\n\nMy Government recognises the role of accountants in supporting private sector growth and investment through maintaining accurate financial records, helping businesses to attract investment, access funding, and comply with financial regulations, he said.\n\nAccountants are also key in driving digital transformation and financial inclusion as well as enhancing corporate governance and ethical standards. Your strategic financial insights must support business growth so that enterprises are competitive, innovative and sustainable. The role you play in our economy should ultimately facilitate industrialisation, modernisation and overall economic growth across all sectors.\n\nThe President challenged accountants in both the public and private sectors to be trustworthy gatekeepers of national resources.\n\nEvery dollar spent must be accounted for, he said.\n\nSome of the stakeholders follow proceedings at the official opening of the Zimbabwe Accountants Conference (ZAC) at a local hotel in Harare yesterday.- Picture: Edward Zvemisha\n\nThe President said accountants were architects of economic transformation and ought to be transparent in their work.\n\nAs you are aware, accountants are not mere record-keepers of financial transactions. You are architects of economic transformation, custodians of corporate and public finance, and enablers of national development. Whether in the private sector or the public domain, your work directly influences the efficiency, transparency and accountability of Zimbabwes economic activities, he said.\n\nPresident Mnangagwa called for stronger regulation in the accounting and auditing professions.\n\nLoopholes that allow financial mismanagement, illicit financial flows, and corporate fraud must be closed with no exceptions. We must ensure that financial professionals operate within the highest ethical and professional standards, in line with the International Federation of Accountants (IFAC) Code of Ethics.\n\nIntegrity, discipline, and ethics must define the Zimbabwean accountant. I, therefore, challenge the Public Accountants and Auditors Board (PAAB) and other regulatory bodies to strengthen all oversight mechanisms that govern your profession. Our economy cannot afford manipulation of financial reports, money laundering, and tax evasion, as these malpractices erode investor confidence and derail development efforts.\n\nHe challenged the Public Accountants and the Auditors Board to jealously guard the profession by making sure that only those who are qualified and registered, perform the duties of professional accountants.\n\nThe Public Accountants and Auditors Act should be enforced to the letter and other stakeholders engaged in dealing with unlicenced and rogue practitioners in our market. As a nation, we cannot suffer from the consequences of unethical financial practices, including mismanagement of public funds, insolvency, and stalled economic progress. Corruption is an enemy of development, and it is incumbent upon the accounting profession to take a firm stand against it. Zimbabwe will not tolerate corruption, said President Mnangagwa.\n\nSome of the stakeholders follow proceedings at the official open\n\nAccountants, he said, play a crucial role in strengthening Public Financial Management (PFM).\n\nFurther, they are key cogs that enhance financial transparency, accountability and efficiency in public sector entities.\n\nGovernment counts on professionals in this field to ensure the proper implementation of our budget, the reduction of corruption and improvements in audit processes throughout all our institutions, President Mnangagwa said.\n\nHe implored accountants to act with propriety and a fiduciary mind in the fight against corruption.\n\nAs accounting professionals, you are in almost every facet of our economy, including in Government institutions, private corporations, financial services, and development projects. You see the numbers. You know when financial irregularities occur. It is, therefore, your duty to speak out and refuse to be complicit in fraudulent activities. I urge you to act with propriety and fiduciary in the fight against corruption by upholding the principles of transparency, accountability and good governance, he said.\n\nThe future of accounting, he said, is evolving, shaped by digital transformation, artificial intelligence, and global financial trends.\n\nA future-ready profession must embrace innovation, while ensuring financial sustainability. Zimbabwes accountants must be at the forefront of integrating technology, improving financial reporting systems, and enhancing management frameworks that align with international best practices, the President said.\n\nSpeaking at the same occasion, Finance, Economic Development and Investment Promotion Minister, Professor Mthuli Ncube, commended the Public Accounts and Auditors Board for representing the accounting profession, providing technical and regulatory assistance.\n\nAs the authoritative body overseeing the profession, the PAEB ensures that Zimbabwes accounting standards align with global best practices, thereby fostering trust in our financial systems. Through its mandate to set and enforce high-quality auditing, accounting, and financial reporting standards, the PAAB safeguards public interest and strengthens corporate governance. My message to you as professionals is that as professionals tasked with ensuring financial propriety and corporate governance, you are the backbone of Zimbabwes financial system, said Prof Ncube.\n\nPAEB chairperson Valentine Mushayakarara commended the Government for its commitment towards the success of the accounting profession.\n\nThe event was attended by Government Ministers, captains of industry, heads of parastatals and state entities, private sector representatives among others.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/HE1-2.jpg",
            "description": "Zvamaida Murwira, Senior Reporter ACCOUNTANTS are gatekeepers of the country’s national resources and their financial insights must help support business growth, leading to modernisation, industrialisation and overall cross-sectoral economic growth, President Mnangagwa has said. Officially opening the Chartered Accountants Conference hosted by the Public Accounts and Auditors Board Zimbabwe in Harare yesterday, the President said […]",
            "time": "06:41",
            "date": "11 Apr 2025"
        },
        {
            "title": "President hands back 480ha to PPC Zimbabwe",
            "url": "https://www.herald.co.zw/president-hands-back-480ha-to-ppc-zimbabwe/",
            "content": "Rumbidzayi Zinyuke, Senior Reporter\n\nPRESIDENT Mnangagwa yesterday handed back 480 hectares of land previously acquired by the Government to PPC Zimbabwe.\n\nThe Arlington property, which is adjacent to Robert Gabriel Mugabe International Airport in Harare, was initially owned by Portland Holdings (Private) Limited, now operating as PPC Zimbabwe.\n\nIt had been acquired as part of the Airport expansion programme in 2010.\n\nSpeaking after the handover of title deeds by President Mnangagwa at State House yesterday, PPC Zimbabwe head of Legal and Compliance Mr Tawanda Chiurayi said they appreciated the Governments move to restore the companys ownership of the property.\n\nPPC owned the Arlington property prior to 2010 when it was erroneously acquired. We then engaged the Government and they resolved to give the land back to us given the circumstances. Today was the ceremonial handover of title deeds to us, he said.\n\nThe Government maintained that the land had been reserved for expansion of the airport and placed under the Civil Aviation Authority of Zimbabwe (CAAZ).\n\nIt was further stated that plans approved in 1976 showed that the land had been set aside for a second runway for the airport.\n\nHowever, following a formal request by the company, which cited extensive investment and planned developments on the site, the Government reinstated its ownership.\n\nThe move underscores the Second Republics commitment to promoting industrialisation and private sector-led growth as outlined in the National Development Strategy 1 (NDS1).\n\nIt also supports the attainment of Vision 2030, which aims to transform Zimbabwe into an upper-middle-income economy.\n\nAlthough the specific use of the land is yet to be finalised, Mr Chiurayi said evaluations were underway.\n\nWe are in the process of assessing the available options. Once a clear decision is made, we will make an official announcement, he added.\n\nAfter the ceremony, PPC Zimbabwe presented President Mnangagwa with 60 tonnes of cement as a token of appreciation to support his philanthropic initiatives across the country.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/PCC1.jpg",
            "description": "Rumbidzayi Zinyuke, Senior Reporter PRESIDENT Mnangagwa yesterday handed back 480 hectares of land previously acquired by the Government to PPC Zimbabwe. The Arlington property, which is adjacent to Robert Gabriel Mugabe International Airport in Harare, was initially owned by Portland Holdings (Private) Limited, now operating as PPC Zimbabwe. It had been acquired as part of […]",
            "time": "06:41",
            "date": "11 Apr 2025"
        },
        {
            "title": "MPs get stands, to pay for them",
            "url": "https://www.herald.co.zw/mps-get-stands-to-pay-for-them/",
            "content": "Blessings Chidakwa, Herald Reporter\n\nLEGISLATORS from the 8th, 9th and 10th Parliaments have started benefiting from a Government programme offering them residential stands as part of a broader package of non-monetary incentives to improve their welfare and working conditions.\n\nWhile beneficiaries will pay at a discount, the allocation of stands is not a recurring benefit, but a once-off entitlement provided as part of the legislators conditions of service.\n\nThe initiative stems from a policy position adopted in 2013 when the Ministry of Local Government and Public Works partnered the Parliament of Zimbabwe to provide urban and peri-urban residential stands to Members of Parliament, beginning with those in the 8th Parliament.\n\nBeyond residential stands, the Government has over the years introduced several other non-monetary empowerment mechanisms for legislators.\n\nThese include vehicle loan schemes, improved access to office resources in constituencies and support for constituency development projects through tools such as the Constituency Development Fund (CDF).\n\nZanu PF chief whip Cde Pupurai Togarepi yesterday confirmed that the legislators will pay for their stands.\n\nWe are glad that the parcelling out of stands is going on smoothly with both sitting and past MPs from the 8th and 9th Parliaments benefiting. All the MPs are going to pay for their stands. This will be a huge relief to the fiscus as Treasury will save on the hotel wage bill for sitting MPs, he said.\n\nAddressing a Press conference in Harare yesterday, Local Government and Public Works Minister Daniel Garwe, said a total of 70 residential stands were allocated on April 9, 2025 to sitting and former legislators from the 8th, 9th, and 10th Parliaments.\n\nMinistry of Local Government and Public Works Daniel Garwe speaks during Media Press Conference in Harare yesterday.- Picture: Charles Muchakagara\n\nHe said the stands were located in Killarney (Goromonzi), Penrose (Zvimba) and Mabelreign (Harare), with the latter receiving the largest share of 40 stands.\n\nThe Ministry of Local Government and Public Works in 2013 partnered with the Parliament of Zimbabwe to avail residential stands in urban and peri-urban areas for allocation to Honourable members, effective the 8th Parliament and forward, said Cde Garwe.\n\nHe said since the inception of the programme in 2013, over 250 stands have been allocated across the country, including 188 in Goromonzi, 49 in Bulawayo, 12 in Chiredzi, nine in Kadoma and five in Beitbridge.\n\nThis facility is a once-off entitlement given as non-monetary benefit, which is part of their (MPs) conditions of service, Cde Garwe said.\n\nThe latest allocation is not only a welfare measure, but also an obligation, aligning with the Governments broader agenda to provide housing for targeted groups, including civil servants, war veterans, youth, and women.\n\nIn implementing this programme, Government is fulfilling its commitment of enhancing the welfare of the Honourable members, as it is doing for war veterans, women, the youth and civil servants, Cde Garwe said.\n\nImplementation of programmes aimed at providing housing to targeted communities is being done in fulfilment of provisions contained in the Constitution of Zimbabwe.\n\nAs for the CDF, it allows MPs to initiate and manage small-scale development initiatives in their areas, thereby directly responding to community needs.\n\nMoreover, there has been increased collaboration between Parliament and various Government ministries to provide capacity-building workshops for legislators, aimed at strengthening their role in legislative drafting, policy analysis, and budget oversight.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/DN1-1.jpg",
            "description": "Blessings Chidakwa, Herald Reporter LEGISLATORS from the 8th, 9th and 10th Parliaments have started benefiting from a Government programme offering them residential stands as part of a broader package of non-monetary incentives to improve their welfare and working conditions. While beneficiaries will pay at a discount, the allocation of stands is not a recurring benefit, […]",
            "time": "06:41",
            "date": "11 Apr 2025"
        },
        {
            "title": "Africa must turn words into action, says UN",
            "url": "https://www.herald.co.zw/africa-must-turn-words-into-action-says-un/",
            "content": "Wallace Ruzvidzo in KAMPALA, Uganda\n\nAFRICA must turn its words into action as it currently stands at a pivotal moment of immense opportunities, United Nations (UN) Deputy Secretary General Amina Mohammed has said.\n\nThe Deputy Secretary General said this at the 11th session of the Africa Regional Forum on Sustainable Development held here on Wednesday.\n\nIn her remarks, she said with only five years remaining to achieve the UNs 2030 Agenda for Sustainable Development, it was time that Africas voice shapes the achievement of global milestones.\n\nNow we must turn words into actionacross these efforts, Africas leadership and innovation continue to inspire.\n\nFrom local solutions to global negotiations, African countries are driving forward a bold vision for inclusive, sustainable development.\n\nAfrica stands at a pivotal moment, not only of challenges but of immense opportunity. With just five years remaining to achieve the 2030 Agenda, and the second decade of Agenda 2063 now underway, we must confront the hard truths and match them with bold and courageous solutions, she said.\n\nMs Mohammed said despite various global adversities, Africa had accounted for nine of the worlds fastest-growing economies last year, signifying its immense potential.\n\nAfrica is not standing still. We are staggering up. Despite global headwinds, our continent accounted for nine of the worlds fastest-growing economies in 2024.\n\nAfricas voice must shape every one of these global milestones, she said.\n\nEvidence of this, said the UN Deputy Secretary General, was progress made by African countries in combating the HIV/AIDS epidemic.\n\nOn its part, Zimbabwe is one of the countries in the Southern Africa region that has managed to reach the 95-95-95 targets, as 98 percent of people living with HIV know their status, 97 percent are on anti-retroviral therapy (ART), while 96 percent have achieved viral suppression.\n\nProgress against HIV and AIDS is encouraging, with nearly two dozen countries recording significant declines in new infections, she said.\n\nMs Mohammed said while African countries continued to make tremendous progress, the burden of debt was suffocating some their economies.\n\nIn the case of Zimbabwe, the country launched the High-level Arrears Clearance and Debt Resolution Platform, with President Mnangagwa stressing the importance of cushioning the general citizenry as the debt obligations are serviced.\n\nIn 2023, 25 African countries spent more on external debt servicing than on health and education combined. This is unacceptable. Over 60 percent of countries are now in or at higher risk of debt distress.\n\nIn too many countries, more than half of government revenue goes to debt repayments, undermining vital investments in people, resources, jobs and growth, Ms Mohammed said.\n\nThe Deputy Secretary General said although the statistics were worrying these figures do not define Africa.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2017/05/Amina-mohammed1-710x434.jpg",
            "description": "Wallace Ruzvidzo in KAMPALA, Uganda AFRICA must turn its words into action as it currently stands at a pivotal moment of immense opportunities, United Nations (UN) Deputy Secretary General Amina Mohammed has said. The Deputy Secretary General said this at the 11th session of the Africa Regional Forum on Sustainable Development held here on Wednesday. […]",
            "time": "06:41",
            "date": "11 Apr 2025"
        },
        {
            "title": "VP Chiwenga lights Independence Flame",
            "url": "https://www.herald.co.zw/vp-chiwenga-lights-independence-flame/",
            "content": "Patrick Chitumba\n\nVICE PRESIDENT Dr Constantino Chiwenga yesterday officially lit and handed over the Independence Flame to the Midlands Province, marking a significant milestone in the build-up to the 45th national Independence Day celebrations.\n\nThe symbolic ceremony took place at the historic Mtapa Hall in Gwerus Mtapa suburb, drawing hundreds of people.\n\nThe Independence Flame will now tour districts across the province  including Mberengwa, Zvishavane, Shurugwi, Kwekwe and Gokwe  before arriving at Nembudziya Open Grounds for the main celebrations on April 18.\n\nThis years commemorations are being held under the theme: Zim@45: Devolve and Develop Together Towards Vision 2030.\n\nVP Chiwenga was accompanied by senior Government officials, among them Minister of Home Affairs and Cultural Heritage Kazembe Kazembe, Minister of Sports and Recreation Anselem Sanyatwe, Minister of Veterans of the Liberation Struggle Monica Mavunga and Midlands Provincial Affairs and Devolution Minister Owen Ncube.\n\nIn his keynote address, VP Chiwenga described the Independence Flame as a lasting symbol of Zimbabwes struggle, sacrifice, triumph and national spirit.\n\nWe gather at this significant site  Mtapa Hall  the venue of the inaugural Zimbabwe African National Union (Zanu) Congress held from May 21 to 23, 1964, he said.\n\nBut let us not forget that the party had been formed earlier on 8 August 1963 in Highfields, at the home of the late Cde Enos Nkala, following the split from Zapu.\n\nVP Chiwenga emphasised that the formation of Zanu, followed by the later unification with Zapu under the Unity Accord of December 22, 1987, was instrumental in the countrys path towards development.\n\nIt is only in unity that we uphold the idealism of a unitary state  one that embraces all people from the north, south, east, and west as one nation, he said.\n\nVP Chiwenga described the 1964 Zanu Congress as a pivotal moment in Zimbabwes history, the turning point where the decision to take up arms against colonial rule was made under the banner: We are our own liberators through the barrel of the gun.\n\nThe Congress elected key founding leaders of the liberation movement, including Cde Ndabaningi Sithole (President), Cde Leopold Takawira (Vice President), Cde Robert Mugabe (Secretary General), Cde Herbert Chitepo (National Chairman), Cde Enos Nkala (Treasurer), Cde Michael Mahwema (Organising Secretary) and Cde Edson Zvobgo (Deputy Secretary General), among others.\n\nVP Chiwenga said these comrades played crucial roles in the liberation struggle.\n\nTodays ceremony provides a rare opportunity to reflect on the significance of that Congress.\n\nWe recall and celebrate the contributions of those who came before us, both the living and those resting in marked and unmarked graves in Zimbabwe and neighbouring countries, their sacrifices towards our liberation, he said.\n\nVP Chiwenga noted that among the delegates at the 1964 Congress was President Mnangagwa, then a young nationalist recently trained in China. Another one was Cde Shadreck Chipanga, a former CIO Director General, who had been released from Wha Wha Prison after being detained for civil disobedience and acts of sabotage.\n\nThey later escaped for training in Ghana after Zanu was banned in September 1964, he said.\n\nThe Vice President said the Congress helped shape the collective vision of the liberation movement, rekindling national resolve and a desire for self-determination.\n\nChange chiri chitsidzo chekudeurwa kwe ropa kuti nyika isununguke, he said, highlighting the depth of commitment required for independence.\n\nVP Chiwenga stressed that the 1964 Congress also laid the foundation for alliances with other African nationalist movements and international organisations, a vital step in gaining support for the liberation war.\n\nMore importantly, it marked a turning point in Zanus relationship with colonial authorities, as the leadership adopted more radical and confrontational tactics, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/VP1.jpg",
            "description": "Patrick Chitumba VICE PRESIDENT Dr Constantino Chiwenga yesterday officially lit and handed over the Independence Flame to the Midlands Province, marking a significant milestone in the build-up to the 45th national Independence Day celebrations. The symbolic ceremony took place at the historic Mtapa Hall in Gweru’s Mtapa suburb, drawing hundreds of people. The Independence Flame […]",
            "time": "06:41",
            "date": "11 Apr 2025"
        },
        {
            "title": "Zim, UAE launch Digital Skills programme",
            "url": "https://www.herald.co.zw/zim-uae-launch-digital-skills-programme/",
            "content": "Freeman Razemba, Senior Reporter\n\nZIMBABWE and the United Arab Emirates (UAE) yesterday launched the countrys Digital Skills Programme, an initiative born out of a fruitful partnership between the two Governments under the Government Experience Exchange Programme.\n\nThe event was attended by the Minister of Information Communication and Technology, Postal and Courier Services, Dr Tatenda Mavetera, and the Deputy Minister of Cabinet Affairs and Government Experience Exchange Programme in the UAE, Abdullar Lutah, among other senior government officials from both countries.\n\nMinister Mavetera said the programme was crucial towards the realisation of a collective dream of a prosperous, inclusive, and technologically advanced nation.\n\nToday marks a significant milestone in our journey towards a digitally empowered Zimbabwe. It is my honour to stand before you at the launch of the Zimbabwe Digital Skills Programme, an initiative born out of a fruitful partnership with the United Arab Emirates Government under the Government Experience Exchange Programme, she said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/10/Cde-Tatenda-Mavetera.jpg",
            "description": "Freeman Razemba, Senior Reporter ZIMBABWE and the United Arab Emirates (UAE) yesterday launched the country’s Digital Skills Programme, an initiative born out of a fruitful partnership between the two Governments under the Government Experience Exchange Programme. The event was attended by the Minister of Information Communication and Technology, Postal and Courier Services, Dr Tatenda Mavetera, […]",
            "time": "06:41",
            "date": "11 Apr 2025"
        },
        {
            "title": "Private sector intensifies renewable energy investments for self-sufficiency",
            "url": "https://www.herald.co.zw/private-sector-intensifies-renewable-energy-investments-for-self-sufficiency/",
            "content": "Martin Kadzere\n\nZimbabwes private sector is intensifying its investment in the power sector to secure a reliable supply, increasingly focusing on renewable energy to meet their own consumption needs.\n\nLatest data from the Zimbabwe Energy Regulatory Authority (ZERA) reveals a total of 29 projects underway, promising to add a substantial 1 688 megawatts (MW) to the countrys energy mix.\n\nA notable trend in the private ventures is the strong focus on solar photovoltaic (PV) technology. With 25 projects in the pipeline, solar power accounts for a significant 403 MW of the capacity, highlighting the growing appeal and viability of solar energy for businesses seeking sustainable power solutions.\n\nWhile solar leads in the number of projects, coal-fired power represents the largest share in terms of capacity, according to ZERA. Three thermal projects are set to contribute a significant 1 265 MW. This shows that while renewable energy is gaining traction, traditional sources remain a key component of private power generation plans, likely driven by the energy demands of specific industries.\n\nOther sources in the mix include a single gas-powered project with a capacity of 20 MW. Notably, there are no current projects for bagasse, biomass, waste to energy, hydro, concentrated solar power, or hybrid (solar or diesel) for companies establishing plants for their own use.\n\nAn analysis of recent data highlights key players and the intended capacity they are bringing to the grid.\n\nLeading the pack in terms of sheer scale is Prestigious Preserve, with a massive 1 200 MW coal-fired thermal project situated in the River Ranch area of Beitbridge, Matabeleland South Province. The project represents the largest capacity addition among the ongoing projects.\n\nAnother significant thermal venture is being undertaken by Max Mind Investments, targeting 240 MW.\n\nThe data also reveals a growing interest in renewable energy, particularly solar power. Caledonia Mining Corporation is building its second solar plant with a production capacity of 5,3 MW at its Blanket gold mine in Gwanda, Matabeleland South. Rio Zims Cam and Motor has multiple solar sites totaling 30 MW.\n\nOther notable solar projects include Renco Mine (15 MW), Dalny Solar (15 MW), Zimplats Phase 2 (155 MW), London Bridge Power (40 MW), Gridpro (56,25 MW), and Dolcin Trading (50 MW).\n\nIn an interview this week, ZERA chief executive Mr Edington Mazambani said the success rate of entities and institutions installing solar plants for their own use has been remarkably high at almost 100 percent.\n\nThis stands in stark contrast to Independent Power Producers (IPPs) aiming to generate power for grid supply, many of whom encounter difficulties in securing financial closure. Faced with ongoing power challenges, several corporates have turned to investing in solar energy to secure a reliable supply.\n\nThe 100 percent success rate is attributable to the fact that these companies made a strategic business decision to invest in self-use power plants to ensure a reliable supply, said Mr Mazambani.\n\nThe limited generation capacity often falls short of the countrys growing energy demand. Furthermore, the national power utility, ZESA Holdings, has grappled with financial constraints, a substantial debt burden, and difficulties in securing foreign currency for essential maintenance and upgrades, hindering its ability to ensure a consistent power supply.\n\nSeveral other corporations in Zimbabwe have invested in establishing their own solar power plants for self-consumption, driven by the need for a reliable power supply amidst persistent grid challenges and the long-term cost benefits of renewable energy. Caledonia Mining Corporation has integrated solar power into its mining operations for a more consistent energy supply.\n\nSchweppes Zimbabwe, a major beverage producer, has also adopted solar energy to ensure uninterrupted operations.\n\nLarge-scale mining operations like Zimplats and Bikita Minerals have also incorporated solar into their energy mix.\n\nThe telecommunications sector has also seen significant adoption, with Econet Wireless Zimbabwe launching a substantial 466 KW industrial solar plant at its Willowvale complex in Harare, spearheaded by their subsidiary Distributed Power Africa (DPA). This initiative is part of a broader green strategy. Agro-processing giant Tongaat Hulett, horticultural firm Nhimbe Fresh, and petroleum company Puma Energy have also invested in solar solutions for their own energy needs.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Untitled-19.jpg",
            "description": "Zimbabwe’s private sector is intensifying its investment in the power sector to secure a reliable supply, increasingly focusing on renewable energy to meet their own consumption needs.",
            "time": "06:41",
            "date": "11 Apr 2025"
        },
        {
            "title": "EDITORIAL COMMENT: Africa can and must move forward as a continent",
            "url": "https://www.herald.co.zw/editorial-comment-africa-can-and-must-move-forward-as-a-continent/",
            "content": "AFRICA needs to take full responsibility for developing the continent and building the sort of economy and society we all desire and that will give us the sort of life we need and deserve.\n\nThe fundamental bits are there. Almost every mineral known, including the carbon and hydrocarbon minerals, is mined somewhere in Africa, and deposits of the odd rarer mineral that is not mined are known and mapped.\n\nEvery known crop is grown, somewhere in Africa and production of all crops can be increased and new varieties generated that will increase yields.\n\nWe have four of the biggest river systems in the world and our energy resources, both in the older coal and oil reserves and the newer green energy potential, including hydro, solar and wind, are immense, so we can back up the resources with the energy needed to develop them.\n\nAll African countries have been boosting their education systems and skills training, and Africans in any case are generally thirsty to push their own qualifications and skills as high as they can as part of desirable modern culture existing on the continent.\n\nSo the bits for development are all there. We have the raw materials, but we tend to export them as raw materials and even then quite often as ores, or raw harvested crops, or at best partially processed minerals and crops.\n\nWe also as a continent tend to export skills, as some of our best move into the wider world to find the opportunities they should find at home or at least on the continent.\n\nWe also need to realise that while the continent as a whole has the breadth as well as the depth of raw materials and energy resources, and that the continents skills base is good, the building blocks of the future we want are not concentrated in every country. In fact, no country, even the largest, has all the bits needed for rapid development and most African countries are quite small.\n\nTrying as individual countries to achieve all the economic and development goals would be like a single Chinese province being self-sufficient, or a single US state or a single EU member country. We need to move together and tie the bits together as a continent. In any case we will need the combined market of the whole continent to make many of the proposed industries and processes viable.\n\nPresident Mnangagwa brought this up at the 11th Africa Regional Forum on Sustainable Development, speaking both as one of the regional leaders, the chair of SADC, as well as Zimbabwean President.\n\nThe urgency of the need for Africa to grab the opportunities and move forward as a continent is becoming ever more apparent. It has been obvious for some time that, as the President noted, development will not occur by chance. We need to be in the driving seat.\n\nRecent events have made this need for internal development even more obvious.\n\nAfrica will suffer most from climate change, experts agree, but it is now fairly clear that the sort of external resources once partially promised to help drive greener development and mitigate against climate change are simply not going to come.\n\nWhile many countries are still willing to play their part in curbing and eventually eliminating global warming, we have seen the largest global economy, that of the US, pulling out of all commitments and even slashing or reversing its own national programmes. Aid levels are generally going to fall, in some cases being eliminated and in other cases being reduced.\n\nHowever, the present uncertainty over international trade pans out, with tariff barriers and trade wars set and then suspended, it is clear that older certainties have gone and a lot will depend on how each country, or group of countries or, in the case of Africa, a continent of countries is going to adapt.\n\nA smart choice would be to push the African Continental Free Trade Area as hard as possible, to create the markets that move so much investment from a marginal possibility to a viable certainty.\n\nThere is still plenty of investment money around the world, although Africa also needs to build up its own saving levels so that we have the best of all worlds, high levels of local investment and a lot of inward direct investment.\n\nAfCFTA came into existence in 2018 and while work has been done to set the rules of origin for many products, and the prospective vast free-trade market has attracted some direct investors wanting their footprint inside the market, there is still a long way to go before it is a full and living reality, with most trade in most countries being done on the continent.\n\nAfrica does not have to develop the same way as Europe or North America or even more recently Asia. We can avoid some mistakes; we can build cleaner and more people-oriented; we can, to be blunt, build better.\n\nDespite the clear vision of many African leaders, there is still a tendency among many people to see Africa as a continent that things happen to, rather than as a continent that can drive and create its own future.\n\nWe need to remember that we managed to get rid of the colonialists, sometimes peacefully with just mass action, sometimes having to go to the extent of liberation war. But the point is we won our freedom and there was in that political and military struggle, a high degree of hope through Pan-Africanism.\n\nWe need some of that idealism once again, of everyone contributing to freedom, this time the economic freedom and the development freedom, but seeing Africa as a united continent.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/10/African-Continental-Free-Trade-Area-AfCFTA.jpg",
            "description": "AFRICA needs to take full responsibility for developing the continent and building the sort of economy and society we all desire and that will give us the sort of life we need and deserve. The fundamental bits are there. Almost every mineral known, including the carbon and hydrocarbon minerals, is mined somewhere in Africa, and […]",
            "time": "06:41",
            "date": "11 Apr 2025"
        },
        {
            "title": "Bosso leaks frustrate KK",
            "url": "https://www.herald.co.zw/bosso-leaks-frustrate-kk/",
            "content": "Innocent Kurira, Zimpapers Sports Hub\n\nHIGHLANDERS coach Kelvin Kaindu is not amused with the manner in which Bosso have been conceding goals which he believes is too soft for a team of the Bulawayo giants stature.\n\nBosso are preparing for a massive Battle of the Cities in a Castle Lager Premier Soccer League showdown against CAPS United at Barbourfields on Sunday.\n\nKaindu speaking during his teams regular media briefing, voiced deep concern over his sides persistent defensive lapses, warning that their habit of conceding soft goals is undermining their ambitions.\n\nHighlanders are battling to end a long-dragging championship drought that stretches back to 2006 when they last won the title under club legend Methembe Ndlovu.\n\nBosso have looked lively in attack, but remain worryingly fragile at the back  leaking five goals in as many matches, a statistic Kaindu finds unacceptable.\n\nThe goals, he argues, havent come from moments of brilliance by the opposition, but from glaring errors within his own ranks.\n\nWe have been conceding goals we shouldnt be conceding, a visibly frustrated Kaindu said.\n\nIt has been a major concern for us. Our opponents have punished us for the mistakes we have made, and its something we need to address. These are soft goals  avoidable ones.\n\nThe Highlanders defence, once their hallmark, has faltered under pressure this season. Goalkeeping mistakes have contributed to their vulnerability, with the backline often caught flat-footed. While Bosso have found the net eight times, averaging a goal per game, their inability to protect leads has been their Achilles heel.\n\nKaindu, whose side have collected just six points from five outings, knows the margin for error is narrowing. And with pressure mounting from a restless Bosso fanbase, Sundays showdown against old rivals CAPS United now carries extra weight.\n\nAdding to Kaindus worries is the fitness of versatile defender Andrew Mbeba, who was stretchered off during Highlanders 1-1 draw with Triangle United at Gibbo last weekend. The influential defender has not returned to training and remains doubtful for the CAPS United clash.\n\nWe have almost a full squad that is training apart from Andrew Mbeba, who picked up an injury in the last game against Triangle, said Kaindu.\n\nHe was stretchered off, and we are yet to get feedback from the doctor. He hasnt been training, but hes feeling slightly better. We will assess him and see if he will be ready for the game.\n\nMbebas potential absence would be a big blow, not only for his defensive reliability but also for his contributions going forward, particularly on set-pieces.\n\nMbeba has been instrumental in our games, and his absence would be felt, Kaindu acknowledged.\n\nBut we are hopeful that we will get positive feedback from the doctors.\n\nDespite their shaky start, both Highlanders and CAPS United remain among the countrys most followed clubs  and whenever they clash, the stakes are rarely low. This weekends fixture, though early in the season, already carries the urgency of a six-pointer.\n\nCAPS United, languishing in the relegation zone with just four points from five matches, are under pressure to bounce back. Highlanders, just two points better, are only slightly more comfortable.\n\nCAPS United are one of the giants in this league. They have pedigree, experience, and are very dangerous going forward, warned Kaindu.\n\nTheir wide players are key, and we know that they will raise their game against us. Its always a tough match when we face them.\n\nLast season, the fixture produced fireworks. Highlanders triumphed 2-0 at Barbourfields in the first leg, but CAPS United returned the favour with a dramatic 3-2 win at Rufaro Stadium in the reverse encounter. Another tightly contested battle is expected.\n\nFor Kaindu, the path to victory is clear: plug the defensive holes and hold the lead when they get in front.\n\nWeve been good going forward  weve scored in almost every game apart from one. Our main issue is defending our leads, Kaindu said.\n\nWe need to be more disciplined and avoid the errors that have led to the goals we have conceded.\n\nBosso fans will be hoping their side can rise to the occasion and that Barbourfields, their spiritual fortress, becomes the setting for a defensive turnaround  and perhaps the first statement victory of their season.\n\nFixtures:\n\nSaturday: Scottland v Yadah Stars (Rufaro), TelOne vs Ngezi Platinum Stars (Ascot), Bikita Minerals vs Triangle United (Gibbo), FC Platinum vs Green Fuel (Mandava), ZPC Kariba vs Kwekwe United (Nyamhunga), Simba Bhora vs Manica Diamonds (Wadzanayi)\n\nSunday: Highlanders vs CAPS United (Barbourfields)\n\nDynamos v Chicken Inn (Rufaro), Herentals v MWOS (Wadzanayi)\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/03/Kelvin-Kaindu.jpg",
            "description": "Innocent Kurira, Zimpapers Sports Hub HIGHLANDERS coach Kelvin Kaindu is not amused with the manner in which Bosso have been conceding goals which he believes is too soft for a team of the Bulawayo giants’ stature. Bosso are preparing for a massive Battle of the Cities in a Castle Lager Premier Soccer League showdown against […]",
            "time": "06:41",
            "date": "11 Apr 2025"
        },
        {
            "title": "Uhuru economic empowerment drives local success in Zimbabwe’s key sectors",
            "url": "https://www.herald.co.zw/uhuru-economic-empowerment-drives-local-success-in-zimbabwes-key-sectors/",
            "content": "Business Reporter\n\nAs Zimbabweans prepare to commemorate the countrys 45th independence anniversary on Friday next week, there is an admission by the majority that there has been significant strides in economic empowerment for the local population, particularly in mining and agriculture.\n\nIndigenous people have grabbed the opportunities created by the Government of Zimbabwe to venture into other lucrative services sectors including public transport and retail among others.\n\nHowever, the mining and agriculture sectors, that are the backbone of Zimbabwes economy, provide intriguing insights as they achieved significant success in the empowerment of indigenous people, with locals now playing a growing role in driving growth and development in these key industries.\n\nIt is quite a positive development that locals are actively participating in these key sectors and creating wealth for themselves and the country at large.\n\nCritically, the significant successes being recorded in these sectors are predominantly a result of deliberate policy implementation that drives indigenous economic empowerment.\n\nMining and agriculture have helped to redistribute national wealth among ordinary Zimbabweans willing to participate in the sectors.\n\nFirms in the agro-processing value chains, have also benefited immensely from increasing output being recorded by the indigenous farmers.\n\nMining\n\nThe 45th anniversary of independence is coming when the gold sector realised a record 36,5 tonnes in gold deliveries to Fidelity Printers and Refiners in 2024.\n\nOut of the 36,5 tonnes of gold delivered during the year, the artisanal and small-scale mining sector contributed 65 percent, while 35 percent came from large-scale miners.\n\nThis impressive output not only exceeded the Governments target of 35 tonnes annually, but also marked a 21 percent surge from the 30,1 tonnes recorded in 2023.\n\nThis is so, thanks to the empowerment drive that has seen the advent and legal recognition of artisanal and small-scale miners.\n\nParticularly, gold deliveries have been improving after the decriminalisation of artisanal mining, which has immensely encouraged artisanal miners to sell their gold formally.\n\nInitiatives that include the decentralisation of offices that grant mining permits to ordinary citizens have also enhanced the allocation of mining claims and the participation of ordinary citizens in this once-fenced sector.\n\nPolicies have been drafted to ensure the recognition of artisanal and small-scale miners whose operations were previously criminalised.\n\nConsequently, the contribution of artisanal and small-scale miners to total national exports has significantly increased compared to previous years, playing a crucial role in the countrys economy.\n\nThe Mines and Minerals Bill of 2022 also intends to promote ease of doing business in this mining sector with a view to attract more investors.\n\nThe impact of small-scale mining extends beyond gold production, as it provides employment and income for millions of people.\n\nIn fact, the artisanal and small-scale mining sector now employs approximately 10 times more people than large-scale mining, providing significant benefits to a larger workforce.\n\nMining contributes significantly to Zimbabwes revenue inflows, with gold as a major mineral export, followed by platinum, collectively accounting for over half of Zimbabwes export revenue.\n\nThe sector is projected to play a pivotal role in the attainment of the countrys vision of becoming an Upper Middle-Income Economy by 2030, as enshrined in the National Development Strategy 1 (NDS1).\n\nThe mining sector has significant potential for growth and the government aims to boost mineral production, with small-scale mining ventures expected to play a key role in achieving this goal. However, the regulatory framework governing small-scale mining, including laws such as the Mines and Minerals Act and the Gold Trade Act, may require updates to accommodate the sectors growth.\n\nDespite encountering a fair share of challenges, small-scale miners are vital to Zimbabwes gold sector, and their contributions have the potential to drive economic growth and development.\n\nYoung Miners Foundation (YMF) chief executive, Mr Payne Kupfuwa, said he was indebted for the empowerment initiative, which has enabled them to enjoy mining rights for different minerals.\n\nAs Young Miners Foundation (YMF), we are grateful for the empowerment drive because since our inception in 2010, we have managed to get access to mining rights. Young people now own gold claims, chrome claims, iron and even gemstones. As small-scale miners, we now run more formalised and professional mining enterprises in the mining value chain.\n\nWe have also been getting some financing through some institutions like the MMCZ for training on formalisation and fundamentals in small-scale mining management. We are grateful for the opportunity because it was unheard of in the past that black people own a mine, said Mr Kupfuwa.\n\nAgriculture\n\nTobacco has been central to the agrarian economy of Zimbabwe since the early 1900s, when it became the backbone of the new settler economy following colonisation.\n\nToday, smallholder farmers, particularly those on resettlement land, are the primary producers of tobacco in the country, thanks to the local empowerment policies, particularly the hugely successful land reform programme.\n\nSince the land reform of 2000, tobacco has gained new momentum, with production frequently surpassing that of white former commercial farming in the 1990s.\n\nIn recent times, the number of tobacco farmers has skyrocketed due to the governments economic empowerment initiatives.\n\nNotably, more smallholder farmers in resettled and communal areas, as well as former farm workers, are now entering tobacco production across various farming sectors.\n\nFrom a low of 6 310 smallholder tobacco farmers who produced 7 583 million kilogrammes of tobacco in 2000, the number rose nationally to an average of 79 000 smallholder growers during the period from 2013-17.\n\nFast forward to 2024, according to the Tobacco Industry Marketing Board (TIMB), more than 107 000 tobacco growers registered for the 2024-2025 cropping season, marking a 16 percent increase from the 92 862 growers registered for the 2023-2024 cropping season.\n\nExciting is the fact that the youths are actively participating in this thriving sector, having been given opportunities to contribute to their countrys economy.\n\nThe significant increase in the number of registered growers reflects the sectors continued expansion and potential in recent years.\n\nIn the 2023 tobacco marketing season, farmers delivered a record 294 million kg of the golden leaf, to the tune of US$890,9 million, surpassing the record of 261 million kg that was set in 2019, further highlighting the success of the countrys agrarian reform.\n\nIt was also just two percent shy of the 300 million kg target that was projected for the year by the government. The 2025 tobacco cropping season is also expected to bring out a positive performance for the sector.\n\nThe golden leaf is a significant foreign currency earner and, since 2009, has been pivotal in supporting the liquidity situation in the country.\n\nWomen Farmers Association Trust president, Mrs Dephina Nkomo, indicated that empowerment had uplifted the lives of many Zimbabweans, particularly those involved in the agriculture value chain.\n\nEconomic empowerment programmes since independence have uplifted our lives in a very big way. We are now able to farm and produce on a larger scale due to land reform, which addressed imbalances in terms of land ownership. Everyone, including youths and women, now has access to use land and are producing for the economy.\n\nThe empowerment drive has given women the opportunity to own land and to cultivate crops like tobacco, which were only a preserve for commercial white farmers, and the country now produces record tobacco output, said Mrs Nkomo.\n\nDue to the aforementioned indigenous economic empowerment policies, the participation of locals in wheat and maize production has been growing.\n\nIn 2024, Zimbabwes agricultural sector achieved a significant milestone, with the countrys wheat harvest reaching a record-breaking 563 961 tonnes. This figure not only surpasses the previous seasons yield of 468 000 tonnes but also stands as the highest wheat production level since the country began cultivating the crop in 1966.\n\nThis remarkable production level substantially reduced the countrys reliance on wheat imports, which had previously cost the nation millions of dollars.\n\nThe growth in wheat production trajectory is likely to have a positive impact on the countrys economy, enhancing food security and creating new opportunities for farmers and stakeholders.\n\nAlso, due to the growing participation of locals and indigenous economic empowerment, Zimbabwes maize yield has consistently been growing, peaking at 2.28 million tonnes in 2022, followed by 2.1 million tonnes in 2017\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Untitled-18.jpg",
            "description": "As Zimbabweans prepare to commemorate the country’s 45th independence anniversary on Friday next week, there is an admission by the majority that there has been significant strides in economic empowerment for the local population, particularly in mining and agriculture.",
            "time": "06:41",
            "date": "11 Apr 2025"
        }
    ]
}