{
    "news": [
        {
            "title": "Moza impasse: Sadc intervenes . . . Unrest affects regional trade",
            "url": "https://www.herald.co.zw/moza-impasse-sadc-intervenes-unrest-affects-regional-trade/",
            "content": "Wallace Ruzvidzo-Herald Reporter\n\nTHE political and security situation in Mozambique is affecting countries in the region, including Zimbabwe, as it hinders regional trade in critical sectors of agriculture, energy and transport, the SADC Troika has said.\n\nMozambique is a vital trade route for SADC, with Zimbabwe, in particular, relying on the Beira Corridor for the transportation of fuel, grain, fertilisers as well as coal from Maputo to Zambia.\n\nBeira and Maputo ports serve as important harbours for Zimbabwes imports, and mineral and commodity exports.\n\nThe Beira Corridor is one of southern Africas main transport routes and is a critical road and rail network linking Zimbabwe, Zambia, Malawi and Mozambique to the port of Beira on the Indian Ocean.\n\nA Communiqu released by the SADC Secretariat following a virtual Extraordinary Summit of the Organ Troika held on January 5, 2025 noted that the unrest in Mozambique was negatively impacting socio-economic activities in the entire region, a situation which cannot be left unchecked.\n\nThe Troika Summit was chaired by Tanzanian President Dr Samia Suluhu Hassan as chairperson of the SADC Organ on Politics, Defence and Security Cooperation which reports to President Mnangagwa as the current Chair of the regional body.\n\nIn a recent statement, President Mnangagwa, who oversees the highest level of the governance structure of SADC, said thefostering of peace, stability and normalcy in Mozambique was of paramount importance to the region.\n\nSADC, thus, expects all parties to the electoral process, both individually and collectively, to abide by the decision of the Council which should provide a constitutional way forward for the country, and facilitate the way to greater peace, normalcy, and stability in the interest of all Mozambicans, he said.\n\nIn the latest communique, the Chairperson of the SADC Organ, Dr Hassan, said the SADC region could not afford to ignore what is happening in Mozambique, especially when it directly impacts the socio-economic fabric of the entire SADC region.\n\nIn his contribution, Outgoing Chairperson of the Organ, His Excellency President Hichilema of the Republic of Zambia, highlighted that the political and security situation in Mozambique is not only affecting the people of Mozambique but also hindering regional trade in critical sectors like energy and transport.\n\nHe underscored the need for the SADC Community to firmly support interventions aimed at restoring peace and stability in Mozambique through collective action in promoting regional security and co-operation, reads the Communique.\n\nSADC Executive Secretary Mr Elias Magosi underscored SADCs solidarity with the people of Mozambique in the spirit of unity and co-operation to pave the way for the people of Mozambique to return to a normal life of peace and prosperity.\n\nAs such, the Summit mandated the SADC Panel of Elders, supported by the Ministerial Committee of the Organ (MCO) Troika Member States- Malawi, Zambia and Tanzania, and the SADC Secretariat, to engage with the Government of Mozambique as well as key leaders of the opposition on the post-election environment.\n\nThe Summit noted with concern the deteriorating post-election political and security situation in the Republic of Mozambique, including the socio-economic impact in the country and the adverse effects on the supply chains of essential commodities.\n\nThe Summit directed the Inter-state Defence and Security Committee to propose measures to protect the regional trade routes, humanitarian corridors, and energy supplies while finding solutions to the political and security challenges in the Republic of Mozambique, reads the Communique.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/President-Mnangagwa-SADC-Chair.jpg",
            "description": "Wallace Ruzvidzo-Herald Reporter THE political and security situation in Mozambique is affecting countries in the region, including Zimbabwe, as it hinders regional trade in critical sectors of agriculture, energy and transport, the SADC Troika has said. Mozambique is a vital trade route for SADC, with Zimbabwe, in particular, relying on the Beira Corridor for the […]",
            "time": "06:32",
            "date": "09 Jan 2025"
        },
        {
            "title": "Stop arm-twisting parents, Govt warns schools",
            "url": "https://www.herald.co.zw/stop-arm-twisting-parents-govt-warns-schools/",
            "content": "Remember Deketeke-Herald Reporter\n\nGOVERNMENT has urged school heads to stop engaging in unethical practices, such as demanding full fees in foreign currency, turning away learners for non-payment, and soliciting bribes for placements.\n\nThis announcement was made by Primary and Secondary Education Permanent Secretary Mr Moses Mhike in response to complaints from parents.\n\nMr Mhike said school fees must be paid in local currency, in line with the Secretarys Circular No. 10 of 2022.\n\nNo school should force any parent to pay fees or levies exclusively in foreign currency. Parents are free to pay in any currency of their choice, as Zimbabwe operates under a multi-currency regime, he said.\n\nMr Mhike said if fees are pegged in foreign currency for value preservation, parents must be allowed to pay in local currency at the prevailing interbank rate on the day of the transaction.\n\nRegarding school uniforms and stationery, he reiterated that parents are free to purchase these items wherever they find them cheaper, in accordance with school specifications.\n\nHeads of schools and responsible authorities are therefore warned to abide by this directive and refrain from mandating parents to buy uniforms and stationery exclusively at their schools, Mr Mhike said.\n\nInspectors will be dispatched to ensure compliance with these directives.\n\nSome schools have been accused of cashing in on desperate parents as schools are set to open next week.\n\nAmong other charges, schools have been accused of selling uniforms at exorbitant prices, exclusively demanding school fees in foreign currency, and also sidelining children on the Governments Basic Education Assistance Model (BEAM).\n\nAhead of schools opening on Tuesday, The Herald has been inundated with calls from distressed parents, who are accusing school authorities of sucking them dry.\n\nOn his part, Zimbabwe National Union of School Heads Secretary-General Munyaradzi Majoni indicated that preparations for the first term of 2025 are well underway and urged parents to pay fees on time.\n\nWe anticipate a smooth opening of schools next week. Most administrators are finalising preparations for a seamless transition into the first term of 2025 and urging parents to make every effort to pay their fees in full by the first day of school, he said.\n\nMr Majoni noted the late introduction of the heritage-based curriculum syllabus, and said there is a need for workshops to equip teachers effectively.\n\nWe encourage our principals to fast-track these workshops to fulfil their mandated work, he said.\n\nMr Majoni called on the media to play a critical role in educating school administrators and ensuring accountability for any wrongdoing.\n\nThe Governments firm stance on fees seeks to protect parents and learners from exploitative practices as the new school term approaches.\n\nIn a related matter, on Tuesday police warned school authorities to refrain from storing large amounts of cash on their premises, especially during this time of year when criminals are increasingly targeting educational institutions.\n\nArmed robberies involving guns, machetes, and iron bars have been on the rise, particularly as schools reopen and parents pay fees.\n\nMost schools, instead of banking, keep the fees in their safes, attracting robbers.\n\nIn an interview, national police spokesperson Commissioner Paul Nyathi emphasised the necessity for schools to enhance security measures and deposit cash at financial institutions.\n\nWe urge school authorities to step up security measures at schools and employ guards from reputable security service providers who can constantly monitor and review deployments.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/01/Mr-Moses-Mhike.jpg",
            "description": "Remember Deketeke-Herald Reporter GOVERNMENT has urged school heads to stop engaging in unethical practices, such as demanding full fees in foreign currency, turning away learners for non-payment, and soliciting bribes for placements. This announcement was made by Primary and Secondary Education Permanent Secretary Mr Moses Mhike in response to complaints from parents. Mr Mhike said […]",
            "time": "06:32",
            "date": "09 Jan 2025"
        },
        {
            "title": "Defer polls to 2030 for continued development: CCC",
            "url": "https://www.herald.co.zw/defer-polls-to-2030-for-continued-development-ccc/",
            "content": "Farirai Machivenyika-Senior Reporter\n\nTHE countrys main opposition party, CCC, is in agreement with a resolution by the ruling Zanu PF party to postpone the next harmonised elections from 2028 to 2030 to allow developmental projects initiated by President Mnangagwa and the Second Republic to come to fruition.\n\nZanu PF made the resolution at its National Peoples Conference held in Bulawayo last year, saying President Mnangagwa deserved to continue in office in light of the remarkable progress the country has achieved under his watch.\n\nIn an interview yesterday, CCC chief whip Mr Charles Moyo said the deferment of elections to 2030 would also allow smooth implementation of National Development Strategy 2 (NDS2) that is being formulated and is expected to be launched in November this year.\n\nAs CCC, we are lobbying for the deferment of elections, we are proposing dialogue as the CCC together with the revolutionary party Zanu PF, he said.\n\nAsked how long the deferment should be, Mr Moyo said postponing the 2028 harmonised elections to 2030 would be ideal.\n\nDeferment to 2030 would be ideal as it is in concurrence or in sync with the (implementation of) NDS 2, he said.\n\nThe implementation of NDS 2 is expected to run from this year to 2030 and Mr Moyo said the country should then use the deferment period for national and consensus building, fostering unity and improving service delivery.\n\nSince the advent of the Second Republic under President Mnangagwa, the country has seen massive infrastructure projects that include roads and dam construction, power generation projects that are expected to solve the electricity woes being experienced in the country and record-breaking wheat yields that have made the nation self-sufficient in terms of flour availability.\n\nCde Pupurai Togarepi, Zanu PF chief whip in the National Assembly, said as the ruling party, they would take a position on the deferment if the CCC brings a motionon that issue to Parliament.\n\nThats their view (deferment of elections), it is allowed in a mature democracy. When the motion comes to Parliament, we will scrutinise the movers prayer for its reasonableness and allow all Parliamentary processes before we take a position.\n\nI am happy that they recognise the importance of various Government policies such as NDS blueprints to the development of Zimbabwe. Lets cross the bridge when we get there. We have always supported progressive and objective ideas brought forward during debates in Parliament, he said.\n\nJustice, Legal and Parliamentary Affairs Minister Ziyambi Ziyambi, said the Constitution would be amended to extend the Presidents term if that is the wish of the majority of Zimbabweans.\n\nShould the generality of Zimbabweans want the President to continue in office then the law can be changed because Zimbabwe is a democracy and no law is cast in stone except the 10 Commandments. So, the law can be changed if thats what the majority of Zimbabweans want, Minister Ziyambi said.\n\nIn October last year, Zanu PF was unanimous that President Mnangagwas term of office must be extended to 2030 to enable him to fulfill his unprecedented transformative developmental programmes.\n\nPresenting resolutions at the partys 21st National Peoples Conference that was held in Bulawayo, the Zanu PF Secretary for Legal Affairs, Cde Patrick Chinamasa, said the resolution on the extension of the Presidents term appeared in all thematic committee resolutions and across the countrys 10 provinces.\n\nAt the conference, delegates overwhelmingly and unanimously endorsed a resolution to extend the Presidents term, directing the Government to proceed with the necessary constitutional amendments needed to clear the path for President Mnangagwa to stay on.\n\nRecently, Zanu PF Central Committee member Cde Jenfan Muswere clarified the partys resolution making process, saying decisions made at the recent Annual National Peoples Conference are binding because they were unanimously adopted.\n\nCde Muswere, who is also Information, Publicity and Broadcasting Services Minister, and legislator for Makoni West Constituency, emphasised that the call for President Mnangagwas continued leadership was an agreed party position, resolved and adopted at the Annual National Peoples Conference.\n\nHe was responding to a question raised by Cde Gilbert Zowa, a recently elected war veterans association member, to clear the air on the ED2030 slogan.\n\nCde Zowa had sought clarity on the ED2030 slogan, noting that President Mnangagwa himself had expressed disinterest in extending his term beyond 2028, despite the partys enthusiasm for his continued leadership.\n\nThe ED2030 slogan has garnered significant traction as party supporters overwhelmingly urge President Mnangagwa to extend his Presidency beyond the current constitutional two-term limit.\n\nCde Muswere said the resolution to extend President Mnangagwas leadership beyond 2030 is in line with Zanu PFs constitution, since the conference that endorsed the resolution had a full quorum, making it legally and properly constituted.\n\nHe highlighted the importance of maintaining constitutional integrity and adherence to party principles and values when implementing such resolutions.\n\nCde Muswere said the extension of President Mnangagwas leadership is an opportunity to consolidate the ongoing economic, infrastructural and social transformation programmes, guaranteeing continuity in policies aimed at achieving Vision 2030.\n\nStability and consistency in leadership, he said, are crucial for realising the countrys long-term goals.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Mr-Charlses-Moyo-680x380.jpg",
            "description": "Farirai Machivenyika-Senior Reporter THE country’s main opposition party, CCC, is in agreement with a resolution by the ruling Zanu PF party to postpone the next harmonised elections from 2028 to 2030 to allow developmental projects initiated by President Mnangagwa and the Second Republic to come to fruition. Zanu PF made the resolution at its National […]",
            "time": "06:32",
            "date": "09 Jan 2025"
        },
        {
            "title": "Harare City Council rotten: Minister",
            "url": "https://www.herald.co.zw/harare-city-council-rotten-minister/",
            "content": "Wallace Ruzvidzo-Herald Reporter\n\nHARARE City Council is rotten and is being run by corrupt officials, hence Central Government will stop at nothing to restore order and sanity in the local authority, Local Government and Public Works Minister Daniel Garwe has said.\n\nSewer bursts, water woes, uncollected garbage, poor street lighting, a dysfunctional billing system and corruption have been the order of the day in the opposition-run local authority.\n\nSpeaking at a Ministers Meet the Media platform organised by Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere in Harare on Monday, Minister Garwe had no kind words for Harare City Council.\n\nCity of Harare is a problem (something) which we all know, that is why we have a Commission of Inquiry right now to interrogate and investigate and recommend to Central Government what course of action we have to take on City of Harare.\n\nWhat I can tell you is that City of Harare is rotten. It is corrupt, it is being run by corrupt people that must be brought to book, he said.\n\nMinister Garwe said Harare City Councils misplaced priorities had resulted in Harare residents being shortchanged, a situation Government was moving in to resolve.\n\nRecently, HCC had announced plans to demolish over 5 000 houses after having issued 48-hour eviction notices to those who built without approval on land reserved for public amenities.\n\nSome of the properties targeted were in Mabelreign, Kuwadzana, Budiriro, Kuwadzana, Mabvuku and Glen View.\n\nTheir wiring is wrong, that is why we called the Mayor (Councillor Jacob Mafume) and his team and told them if they try to demolish the houses they would see what would happen to them.\n\nWe told them that we would lock them up. The local authority is a child to Central Government and if you see your child misbehaving, you reserve the right to put them in order, he said.\n\nGovernments argument was that some of these houses had been built with the blessing of council officials as they regularly assessed the construction progress.\n\nMinister Garwe said the most sensible action to have been taken was for Harare City Council to bring to a stop the building of houses as soon as it started, not seek to demolish the houses when people have just moved in, worse still, at the onset of the rainy season.\n\nYou want to demolish peoples houses when we are now in the rainy season, where do you want them to go?\n\nThere are no 5 000 houses that are going to be demolished by City of Harare. We must do things properly, he said.\n\nIn this instance, the same local authority was in certain instances inspecting these houses while they were being built, yes, they have built on an irregular location but you were the ones who were supervising them as they were building . . . we are saying, why did you (HCC) not stop it when it started, that is what they should have done.\n\nMinister Garwe said the populist approach that the Harare councillors had been trying to use to score cheap political points was uncouth and Government would not let it fly.\n\nGoing to the media and saying we are now armed with a court order. We are human beings, we must be morally correct, said the Minister.\n\nInstead of being true city fathers, Harare councillors have sought to inflate prices for basics such as desktop computers.\n\nHarare City Council also rejected a US$350 000 locally-developed enterprise resource planning (ERP) system from Harare Institute of Technology opting for a US$2,1 million system supplied by a foreign company.\n\nThe city could also have been prejudiced of US$816 000 by a water treatment chemicals supplier, Nanotech Water Solutions, that only acquitted US$252 000 from US$1,1 million availed from Devolution Funds to improve the citys water purification system.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Minister-Garwe-680x380.jpg",
            "description": "Wallace Ruzvidzo-Herald Reporter HARARE City Council is “rotten and is being run by corrupt officials”, hence Central Government will stop at nothing to restore order and sanity in the local authority, Local Government and Public Works Minister Daniel Garwe has said. Sewer bursts, water woes, uncollected garbage, poor street lighting, a dysfunctional billing system and […]",
            "time": "06:32",
            "date": "09 Jan 2025"
        },
        {
            "title": "‘National handicraft sector poised for sustainable economic growth’",
            "url": "https://www.herald.co.zw/national-handicraft-sector-poised-for-sustainable-economic-growth/",
            "content": "Mutsawashe Mashandure and Obey Musiiwa-Herald Correspondents\n\nTHE national handicraft sector is poised for sustainable economic growth in 2025, Women Affairs, Community and Small and Medium Enterprises Development Permanent Secretary Dr Mavis Sibanda has said.\n\nAddressing stakeholders during a strategic review and planning workshop at the Mandel Training Centre in Harare yesterday, Dr Sibanda underscored the importance of the handicraft sector and community heritage in driving economic development.\n\nTo effectively develop and market handicrafts both locally and internationally, collaboration among the Ministry, the National Handicraft Development and Marketing Centre, and all stakeholders is crucial, she said.\n\nDr Sibanda called for the creation of strategic documents to guide the Centres initiatives in 2025, ensuring a clear and co-ordinated approach to promoting Zimbabwean handicrafts.\n\nShe praised the Centre for its role in preserving Zimbabwes cultural identity, noting, As a beacon of Zimbabwean creativity, the Centre is dedicated to showcasing the artistry and skill of passionate craftsmen and women from various provinces, including the youth.\n\nThe Centre aims to collect, promote and market unique crafts, such as the renowned Binga basket, to a global audience.\n\nDr Sibanda urged stakeholders to align their plans with national development blueprints, including Vision 2030 and the National Development Strategy 1.\n\nThis alignment will ensure that our activities meet the identified needs of crafters, communities and related sectors, she said.\n\nDr Sibanda emphasised the need for active participation and constructive discussions, invoking President Mnangagwas mantra, Nyika Inovakwa Nevene Vayo, which calls for collective national development.\n\nBoard chairperson of the Handicraft Centre, Councillor Sandra Ndebele, echoed similar sentiments, highlighting the need to revive the industry in line with the Presidents vision of making Zimbabwe open for business.\n\nAs we aim to fulfil Vision 2030 of an upper-middle-income society, close collaboration with our parent ministry for policy guidance is crucial, she said.\n\nClr Ndebele urged her team to engage fully in the strategic planning processes ahead.\n\nAs Helen Keller once said, Alone we can do so little; together we can do so much. Together we will pave the way for a brighter future for the National Handicrafts Centre, she added.\n\nClr Ndebele said the centre has not had a functional board since 2017, making this strategic planning session a crucial first step in establishing a new vision for the organisation.\n\nThe task before us is indeed a mammoth one. However, I am confident that our minister has appointed a capable board with experienced individuals who bring a wealth of knowledge to help turn this organisation around, she said.\n\nAs the national handicraft sector prepares for a transformative year ahead, the commitment to sustainability and collaboration stands as a beacon of hope for economic growth and cultural preservation in Zimbabwe.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Sandra-Ndebele-680x380.jpg",
            "description": "Mutsawashe Mashandure and Obey Musiiwa-Herald Correspondents THE national handicraft sector is poised for sustainable economic growth in 2025, Women Affairs, Community and Small and Medium Enterprises Development Permanent Secretary Dr Mavis Sibanda has said. Addressing stakeholders during a strategic review and planning workshop at the Mandel Training Centre in Harare yesterday, Dr Sibanda underscored the […]",
            "time": "06:32",
            "date": "09 Jan 2025"
        },
        {
            "title": "Govt probes fatal crane collapse",
            "url": "https://www.herald.co.zw/govt-probes-fatal-crane-collapse/",
            "content": "Freeman Razemba-Senior Reporter\n\nGOVERNMENT has initiated an investigation into the tragic crane collapse at the Trabablas Interchange construction site in Harare, which resulted in the death of an employee on Monday.\n\nTransport and Infrastructural Development Minister Felix Mhona confirmed the investigation in a statement released on Tuesday.\n\nWe extend our condolences to the family, friends, and colleagues of the deceased. The incident occurred during the de-erection of cranes, attributed to mechanical failure. A thorough investigation, involving relevant authorities and the contractor, is currently underway, he said.\n\nAccording to a statement from Tefoma Construction, the company overseeing the interchange project, the mechanical failure occurred while dismantling a static tower crane managed by Manzlink, a contracted rigging specialist firm.\n\nThe failure led not only to the collapse of the static tower crane, but also to a mobile crane involved in the operation. The victim was an employee of Manzlink (Pvt) Ltd, the subcontracted company on site.\n\nTefoma Construction expressed its regret over the incident.\n\nWe deeply mourn the fatal injury and are committed to providing support to the family of the deceased and their employer during this difficult time.\n\nThe company underscored its dedication to maintaining rigorous safety standards across all project sites and pledged to co-operate fully with the ongoing investigation.\n\nAs inquiries proceed, Tefoma Construction assured the public that further updates will be provided.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/05/Felix-Mhona.jpg",
            "description": "Freeman Razemba-Senior Reporter GOVERNMENT has initiated an investigation into the tragic crane collapse at the Trabablas Interchange construction site in Harare, which resulted in the death of an employee on Monday. Transport and Infrastructural Development Minister Felix Mhona confirmed the investigation in a statement released on Tuesday. “We extend our condolences to the family, friends, […]",
            "time": "06:32",
            "date": "09 Jan 2025"
        },
        {
            "title": "Councils and RIDA combine efforts to rebuild infrastructure",
            "url": "https://www.herald.co.zw/councils-and-rida-combine-efforts-to-rebuild-infrastructure/",
            "content": "Conrad Mupesa-Mashonaland West Bureau\n\nWhile farmers in Mashonaland West welcomed the long-awaited rains in late December, the heavy downpours unfortunately led to significant infrastructure damage, including homes, classroom blocks, roads and bridges.\n\nThe Civil Protection Department reported widespread destruction across the province.\n\nIn response, rural district councils and the Rural Infrastructure Development Agency (RIDA) have commenced efforts to rehabilitate the roads affected by the incessant rains.\n\nThis initiative is part of a broader exercise by RIDA, which recently received 26 tractors from central Government to facilitate road repairs and maintenance.\n\nIn Sanyati district, the rains severely impacted both main and feeder roads.\n\nThe chief executive officer of Sanyati RDC Mr Achim Shadaya, noted that the council, supported by local farmers and miners, has begun addressing the damaged road sections.\n\nWe have started hauling and dumping gravel, after which our grader will be assigned for spreading, he said.\n\nSo far, the council has successfully covered 23km of the Kadoma-Alabama Road and six kilometres of the Inskilling Road.\n\nIn Makonde, the rains also destroyed roads in Mhangura and Makonde Constituencies, hampering the movement of people and farming inputs.\n\nThe Makonde RDC is collaborating with local legislator and Health and Child Care Minister Dr Douglas Mombeshora to rehabilitate the affected roads.\n\nMr Paradzayi Innocent Munyede, the chief executive officer of Makonde RDC, expressed gratitude to the Minister for his support.\n\nWe are also grateful to our Minister, Dr Mombeshora, who availed fuel and funds for regrading some roads in the Doma area, he said.\n\nAlthough the rains have not significantly affected road conditions in Makonde yet, the council has proactively deployed teams to work on roads to prevent future issues.\n\nMs Felistus Muteta, acting chief executive officer of Hurungwe RDC, said, So far we have not received any reports of damaged roads. However, we are rehabilitating the roads to ensure they remain accessible.\n\nRIDA has mobilised all 26 tractors for road maintenance and rehabilitation across its service centres in Mashonaland West.\n\nMr Erikana Chikande, RIDAs provincial director, confirmed that the agency is actively working on repairing damaged roads, but has yet to provide specific details on the kilometres covered.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/11/Roads.jpg",
            "description": "Conrad Mupesa-Mashonaland West Bureau While farmers in Mashonaland West welcomed the long-awaited rains in late December, the heavy downpours unfortunately led to significant infrastructure damage, including homes, classroom blocks, roads and bridges. The Civil Protection Department reported widespread destruction across the province. In response, rural district councils and the Rural Infrastructure Development Agency (RIDA) have […]",
            "time": "06:32",
            "date": "09 Jan 2025"
        },
        {
            "title": "Chimombe, Mpofu  bail ruling reserved",
            "url": "https://www.herald.co.zw/chimombe-mpofu-bail-ruling-reserved/",
            "content": "Fidelis Munyoro-Chief Court Reporter\n\nTHE High Court has reserved its ruling on a fresh bail application filed by business partners Mike Chimombe and Moses Mpofu who are embroiled in a scandal surrounding the Presidential Goat Pass-On Scheme.\n\nThe courts decision follows a two-day hearing during which Justice Pisirayi Kwenda heard submissions from both the defence and the prosecution.\n\nThe judge emphasised the need for sufficient time to thoroughly examine the arguments before rendering an appropriate judgment. He will deliver his ruling on January 15.\n\nIn their submissions, the defence urged the court to treat the bail application as a fresh matter, arguing that the prosecution had failed to establish any compelling grounds to justify continued detention.\n\nLed by Professor Lovemore Madhuku and Advocate Tapson Dzvetero, the defence asserted that the State bore the burden of proving why bail should not be granted.\n\nProf Madhuku said: The State has not placed before the court any compelling reasons as required by the law. We are unable to discern the States position from the document it presented, which is riddled with contradictions. There has been no substantive response to this specific application.\n\nConversely, the prosecution, represented by Mr Whisper Mabhaudhi, contended that the matter had already been resolved through an earlier ruling on bail.\n\nMr Mabhaudhi maintained that there were no new circumstances warranting a fresh application, emphasising that the accused remained a flight risk, particularly as their case had taken a turn for the worse.\n\nThe accused have failed to demonstrate any changed circumstances that would justify the relief they seek, even on a balance of probabilities, he argued.\n\nThe existing judgment of this court cannot simply be disregarded. The genuine fear that the accused may abscond persists.\n\nAfter considering the arguments from both sides, Justice Kwenda indicated that he would require time to deliberate on the matter, adding that his ruling would be delivered on January 15.\n\nChimombe and Mpofu face allegations of defrauding the Presidential Goat Pass-On Scheme of US$7.7 million.\n\nTheir legal troubles have been marked by a series of contentious proceedings, including a failed attempt last month to escalate the matter to the Constitutional Court.\n\nThat application, which sought to challenge their arrest, detention, and pre-trial processes on grounds of alleged constitutional violations, was dismissed by Justice Kwenda.\n\nHe characterised their effort as a calculated manoeuvre to delay the legal process, underscoring the courts intolerance for procedural tactics aimed at frustrating the course of justice.\n\nThe ruling not only dashed their hopes of higher court intervention, but also signalled the Judiciarys growing impatience with such attempts to derail the trial.\n\nThis dismissal added yet another chapter to a legal saga.\n\nInitially scheduled for October last year, the trial was postponed due to the defences unsuccessful bid to take the matter to the Constitutional Court.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/10/Mike-Chimombe-and-Moses-Chimombe.jpg",
            "description": "Fidelis Munyoro-Chief Court Reporter THE High Court has reserved its ruling on a fresh bail application filed by business partners Mike Chimombe and Moses Mpofu who are embroiled in a scandal surrounding the Presidential Goat Pass-On Scheme. The court’s decision follows a two-day hearing during which Justice Pisirayi Kwenda heard submissions from both the defence […]",
            "time": "06:32",
            "date": "09 Jan 2025"
        },
        {
            "title": "Farmer field schools transforming agriculture",
            "url": "https://www.herald.co.zw/farmer-field-schools-transforming-agriculture/",
            "content": "Precious Manomano-Herald Reporter\n\nThe Farmer Field School (FFS) training programme is transforming agricultural education and extension by enhancing productivity and promoting sustainable farming practices.\n\nWith over 500 Farmer Field Schools established, more than 2 536 376 farmers have already benefited from this innovative approach.\n\nThe FFS concept is inherently participatory and farmer-centred, focusing on demand-driven solutions to the challenges faced in agriculture.\n\nThis methodology has particularly empowered women, allowing them to play active roles in addressing agricultural productivity issues.\n\nPermanent Secretary for Lands, Agriculture, Fisheries, Water and Rural Development, Professor Obert Jiri, underscored the Governments commitment to utilising the FFS methodology as a cornerstone of its agricultural extension strategy.\n\nHe said by establishing 35 000 field schools, one in each village, the ministry aims to enhance agricultural extension services and revolutionise the production of traditional crops.\n\nThe training provided to extension officers has significantly improved service delivery to farmers.\n\nMaster trainers are essential in equipping farmers with practical skills, which leads to enhanced agricultural practices, increased climate resilience, and improved livelihoods.\n\nThese master trainers are now equipped with practical training methodologies and participatory adult learning techniques, Professor Jiri explained, allowing for active engagement and knowledge sharing among farmers.\n\nIn collaboration with the Agricultural Advisory and Rural Development Service and other partners, farmer field schools are also being established at the ward level. These schools teach rural farmers skills in organic fertiliser manufacturing and sustainable farming practices in response to climate change.\n\nThis initiative promotes smart agricultural practices and aims to boost food security and nutrition at the household level, particularly targeting vulnerable households, where many active participants are women.\n\nA farmer field school operates as a collaborative learning process, enabling participants to conduct experimental activities that deepen their understanding of their farming ecology.\n\nThrough simple experiments and group analysis, farmers learn to make informed decisions about their agricultural practices, moving away from the generalized recommendations imposed by outsiders.\n\nEach school typically comprises 10 to 30 members, all focused on conservative, sustainable, and cost-effective organic farming techniques that revitalise the soil.\n\nThe impact of this training is evident in personal success stories from the participants.\n\nMrs Chambika Nyamunganga, from Nyezi village, shared her experience.\n\nBefore enrolling at the school, I had spent years cultivating a small piece of land producing less yield. Now, I am able to cultivate a larger area, and in the last farming season, I recorded a good harvest. She expressed pride in her accomplishments, noting that she was able to sell some of her produce and improve her homestead, leading to a more decent meal for her family.\n\nAnother participant, Ms Lunia Siziba, highlighted the newfound independence granted by the programme. We thank the Government for introducing the school. We no longer rely on our husbands for money, as we are able to generate our own income, she said, emphasising the empowerment gained through FFS training.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/professor-obert-jiri-old.jpg",
            "description": "Precious Manomano-Herald Reporter The Farmer Field School (FFS) training programme is transforming agricultural education and extension by enhancing productivity and promoting sustainable farming practices. With over 500 Farmer Field Schools established, more than 2 536 376 farmers have already benefited from this innovative approach. The FFS concept is inherently participatory and farmer-centred, focusing on demand-driven […]",
            "time": "06:32",
            "date": "09 Jan 2025"
        },
        {
            "title": "Editorial Comment: Let’s help police catch  hit-and-run drivers",
            "url": "https://www.herald.co.zw/editorial-comment-lets-help-police-catch-hit-and-run-drivers/",
            "content": "A RISING road crime is the hit-and-run accident where a driver hits a pedestrian and either kills or injures them, but just drives off without giving assistance or reporting the accident.\n\nAt present the police are seeking the drivers of 15 vehicles that were involved in hit-and-run accidents, one even striking a police officer directing traffic and then speeding off. But there are other past accidents where the driver was never found and there are thus people driving around our roads who killed someone, and were never caught.\n\nWhen these drivers are caught and brought to trial, quite often the fact that they did not stop and render assistance is treated far more severely than the injuring or killing of a pedestrian. In many cases, there is blame on both sides when a car hits a pedestrian and magistrates take this into account, along with the driving conditions and the speed the car was moving at.\n\nYou can get speeding drunk drivers veering off the road and ploughing into pedestrians on the verge, and they are obviously looking at a serious prison sentence, which will be extended if they did not stop and had to be hunted down later.\n\nBut you also get pedestrians who suddenly leap out into the road almost in front of a driver proceeding soberly and carefully but who simply has no time or space to stop. That driver might well be cleared of the accident in the subsequent court case, but still go to jail if they failed to stop and render assistance.\n\nMost accidents involving a vehicle and a pedestrian fall between these extremes, but generally the punishment for not stopping after the accident is higher than the punishment for the initial accident, even if that did lead to the death of a pedestrian. There has to be a high element of recklessness or drunkenness or other aggravating factor to see the driver imprisoned for the accident, while the failure to stop is almost always a prison sentence.\n\nHunting these hit-and-run drivers is difficult. While a vehicle suffers minor damage in the accident, dents and abrasions perhaps, many vehicles on Zimbabwean roads have similar damage so the accident damage does not stand out.\n\nWhile respectable panel beaters usually want to know how the damage occurred, and will tell the police if they think there is something suspicious, a lot more panel beating is now done informally and regrettably the police do not always have reasonable contacts with these panel beaters and backyard mechanics. But there are still panel beaters who will inform the police if they see something odd about the job they are doing.\n\nIn past decades a fair number of hit-and-run drivers were turned in by one of the very few panel beaters then in the country, after they recognised that the accident damage they were supposed to fix could not have been hitting a fence pole or another car or caused by the excuse given by the driver.\n\nThese days those who do run down and hit a pedestrian might well feel they have a reasonable chance of getting away with this. This is one reason why the police are so keen on talking to possible witnesses, or getting tip-offs from family and friends of the driver.\n\nOnce they have identified the car, forensic examination of the paint and any threads or other debris on the car at the point of collision, combined with any flakes at the accident site, can usually provide enough evidence to convict. The problem is finding that car.\n\nWe have other hit-and-run accidents, but fortunately without death and injury. There are people who scrape a car in a car park, or bump into another vehicle and then speed off. Often someone will see the number plate and record the number, but sometimes again the offending driver will get away with it, especially if they are missing number plates and have a common sort of car.\n\nThere have been drivers in court cases who have said they were frightened to stop, frightened of either a growing crowd assembling or frightened that they were being set up in some sort of trap by a gang of robbers at night.\n\nMagistrates have made it clear that they will only consider such evidence if the driver can show that within a couple of minutes, they managed to phone the police or emergency services, detailing where the accident took place, and then co-operated fully with the authorities and followed instructions.\n\nBut someone trying to claim a few days later when tracked down that they were frightened has not much a leg to stand on. They failed totally in their duty and so have to face the music without an excuse. They left someone hurt lying in the street, or someone dying on the side of the road or the middle of the road. They neither offered help, not sought help from someone else.\n\nThe reason we are all obliged to stop at an accident is to render what assistance we can. The most important point is to try and save lives and ensure whoever is hurt is treated as quickly as possible. Sometimes the driver hitting a pedestrian is the person who can get an injured pedestrian to hospital the quickest and so must do that.\n\nEven when the police are called and arrive promptly, their first action will be making sure the injured are looked after and are taken to hospital if they require treatment.\n\nOnly when the lifesaving part is over, do the police start recording statements and crafting the accident report, working out who was a fault and how. The investigation of an accident can wait when necessary so that all available resources are mobilised to save lives.\n\nDrivers, even if they are at fault, need to be involved in this, and practically the fact that they do stop and render all the assistance they can will influence a magistrate passing sentence in their favour, just as a refusal to stop will influence the magistrate far more severely.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2014/05/car-accident-hit-and-run.jpg",
            "description": "A RISING road crime is the hit-and-run accident where a driver hits a pedestrian and either kills or injures them, but just drives off without giving assistance or reporting the accident. At present the police are seeking the drivers of 15 vehicles that were involved in hit-and-run accidents, one even striking a police officer directing […]",
            "time": "06:32",
            "date": "09 Jan 2025"
        }
    ]
}