{
    "news": [
        {
            "title": "‘Respect Moza’s sovereignty’",
            "url": "https://www.herald.co.zw/respect-mozas-sovereignty/",
            "content": "Fungi Kwaramba-News Editor\n\nThe international community should respect the sovereign will of the people of Mozambique and support all processes towards peace, law and order, Sadc Chairman President Mnangagwa has said.\n\nThis follows the Mozambican Constitutional Councils Monday ruling that upheld results of the October elections, reaffirming the governing Frelimo partys decades-long hold on power.\n\nIn a ruling on Monday, judges of the Constitutional Council named Cde Daniel Chapo as the next president, confirming that the Frelimo candidate won 65 percent of the vote while his main challenger, Venancio Mondlane, got a 24 percent share of the vote.\n\nSADC urges the international community to respect the sovereign will of the people and the Republic of Mozambique, exhorting all concerned to constructively support all processes towards peace, law and order which the country and people sorely need and deserve, the President said.\n\nThis year the SADC region, and Africa at large, have witnessed elections in several countries with the plebiscites largely peaceful save for a few exceptions.\n\nThe President said this is a loud testimony that democracy continues to find deeper roots and to flourish in our SADC Region.\n\nIn his statement, President Mnangagwa said the Constitutional Councils Monday ruling exhausted all lawful processes for determining election results, both under Mozambican laws and SADC Election Guidelines and expectations, and thus all parties need to abide by the countrys apex courts ruling.\n\nThe Southern Africa Development Community, SADC, notes and acknowledges the ruling and confirmation on Monday, 23rd December 2024, by the Constitutional Council of Election Results held in the Republic Mozambique on 9th October this year.\n\nThe ruling by that countrys top electoral court, which upheld FRELIMO Partys victory, completes and thus exhausts all lawful processes on determining election results, in line with that countrys national laws, and in keeping with SADCs Election Guidelines and expectations. SADC thus expects all parties to the electoral process, both individually and collectively, to abide by the decision of the Council which should provide a constitutional way forward for the country, and facilitate the way to greater peace, normalcy and stability in the interest of all Mozambicans.\n\nFurther, the President said, the rule of law is sacrosanct and SADC, as the regional mother body, stands ready to assist the people of Mozambique in deepening and consolidating democracy.\n\nSADC stands ready to assist the incoming Government, and People of Mozambique, in consolidating their electoral democracy on the basis of the aforesaid Court decision which should be held sacrosanct by all. Indeed, this is what the rule of law is all about, the President said.\n\nIn the October elections, Cde Chapo won by a massive landslide; his party, Frelimo, also improved its parliamentary majority in the 250-seatlegislature.\n\nHowever, the opposition led by Mr Mondlane has refused to accept defeat, leading to sporadic protests in the gas-rich southern African country, concentrated mainly in the urban centres.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/President-Mnangagwa-SADC-Chair.jpg",
            "description": "Fungi Kwaramba-News Editor The international community should respect the sovereign will of the people of Mozambique and support all processes towards peace, law and order, Sadc Chairman President Mnangagwa has said. This follows the Mozambican Constitutional Council’s Monday ruling that upheld results of the October elections, reaffirming the governing Frelimo party’s decades-long hold on power. […]",
            "time": "09:46",
            "date": "27 Dec 2024"
        },
        {
            "title": "I use Xmas to reflect on strengths, weaknesses: President",
            "url": "https://www.herald.co.zw/i-use-xmas-to-reflect-on-strengths-weaknesses-president/",
            "content": "Zvamaida Murwira-Senior Reporter\n\nPresident Mnangagwa says he spends Christmas Day reflecting on weaknesses and strengths and how to improve Government programmes and policies given that there will be fewer engagements and phone calls on the day.\n\nThe Head of State and Government said a day like Christmas was also an opportunity to review the efficacy of his Cabinet team with a view to establishing if every team member was pulling or needed replacement.\n\nHe said this in an interview with a ZBC news crew which visited the First Family at its official residence in Harare to establish how they spend their Christmas day.\n\nWhen the ZBC news team arrived, the President was busy with official duties in his office at the residence while the First Lady, Dr Auxillia Mnangagwa, was doing her household chores, preparing food in anticipation of a visit from their grandchildren.\n\nIn an interview held under a relaxed environment as they strolled around the residences garden and yard, President Mnangagwa said on Christmas Day, he interacts with his grandchildren for some time before leaving them with their grandmother and then retreats to his home office to brainstorm on the years Government performance.\n\nChristmas is a day to rest. I was at my office at my official residence, reflecting on who will remain, who will go, who is working hard, and what new things I can initiate. So Christmas Day is a day to brainstorm, plan, it is the day for that because all other people will be busy at their homes, there will be less disturbances, there will be fewer phone calls, said President Mnangagwa as he strolled around the driveway of his yard.\n\nAsked if he rests during the Christmas period, he said: Yes, at home I play with grandchildren. They came last night, and they will come again later in the afternoon, I play and interact with them briefly and I revert to my work in my office which is here. I have a lot of work to do. Today there are fewer phone calls.\n\nHe said he could not switch off his mobile phone to concentrate on his work because he had to run a country through teamwork.\n\nThe country does not stop working, it (Christmas Day) is the time to reflect without disturbances, we are headed for New Year. We must introduce new programmes, new policies. We must introspect about the past, our weaknesses, our strengths . . .to say this was my team, is it the team that has delivered our vision or does it require interrogation? he said.\n\nAsked if he would continue with his team going into the new year, the President said he would make a statement to the nation about his vision and programmes at the commencement of the New Year.\n\nI cannot release it now. I will make my statement after the 1st of January, because just now, everyone is happy, they are celebrating Christmas day and for you to call to tell them that you are no longer part of my team, it would not augur well, but that is the time I reflect how we have worked as a team, what weaknesses have I identified, what is necessary to execute Government programmes, he said.\n\nRecounting how Christmas was celebrated during his boyhood days, President Mnangagwa said it was a joyous event as they would collectively eat food prepared by his mother.\n\nIn the 1940s and 50s at Christmas, our mothers would cook food in huge pots, prepare bread delivered to us in winnowing baskets, for you(present generation) these things are now just normal, he said.\n\nHe said when he rests, mostly on Sundays, he goes to his farm in Kwekwe to assess the crops and livestock, among other tasks.\n\nFirst Lady, Dr Mnangagwa said on Christmas day she takes it upon herself to prepare food for her grandchildren.\n\nI had a message sent to me by my grandchildren, saying they are coming today and they want me to cook for them. They said they wanted some chips. I have prepared cabbages, butternut and so forth, I have prepared food which I want them to eat. I feel very happy because it is not often that we see them because of our busy schedule, she said.\n\nShe said her upbringing is what makes her work hard despite her status as the Mother of the Nation.\n\nAsked what Cde Mnangagwas favourite food is, the First Lady said the President, while she likes meat, preferred kapenta and milk.\n\nFrom the time I knew him, yes inasmuch as he wants to see meat in the relish, but what he likes most is kapenta and milk. I actually have them now. Even if we visit, we have no problems about what he eats, its kapenta and milk, she said.\n\nOn Wednesday, Zimbabwe joined the Christian world to celebrate Christmas Day meant to mark the birth of Jesus Christ.\n\nSome went to the rural areas, others went to holiday resorts while others were at home with their families to celebrate the day.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/President-Mnangagwa-5.jpg",
            "description": "Zvamaida Murwira-Senior Reporter President Mnangagwa says he spends Christmas Day reflecting on weaknesses and strengths and how to improve Government programmes and policies given that there will be fewer engagements and phone calls on the day. The Head of State and Government said a day like Christmas was also an opportunity to review the efficacy […]",
            "time": "09:46",
            "date": "27 Dec 2024"
        },
        {
            "title": "Over 200 babies born on Christmas Day",
            "url": "https://www.herald.co.zw/over-200-babies-born-on-christmas-day/",
            "content": "Nyasha Motsi-Herald Correspondent\n\nMore than 200 babies were born on Christmas Day in the countrys major hospitals in Harare, Bulawayo and Chitungwiza.\n\nSally Mugabe Central Hospital recorded 54 births, Parirenyatwa Group of Hospitals 42, while Chitungwiza Central Hospital recorded 24.\n\nAt United Bulawayo Hospitals (UBH), 26 children were born on Christmas Day, 13 boys and 13 girls while at Mpilo Central Hospital 20 babies were delivered, (13 girls) and seven boys.\n\nThe Christmas birth statistics for the major hospitals indicate a slight predominance of girls.\n\nSally Mugabe Central Hospital senior nursing officer Mrs Ruth Rukarwa confirmed that they received 54 live births and one loss.\n\nWe had 54 live beds. Unfortunately, we missed one baby, Mrs Rukarwa said.\n\nShe added that, from the 55 that we had, 28 were baby girls and 27 were baby boys.\n\nFrom the two delivery methods that we had last Christmas, the major was the normal vertex delivery with 45, where we say this is a normal delivery and nine deliveries were through Caesarean section, she said.\n\nMrs Rukarwa said among mothers who delivered their babies on Christmas Day were two teenagers who gave birth safely.\n\nWe delivered three live babies from the teenagers, a boy and a girl from 17 year old mothers and a baby girl also from a 15-year-old mother.\n\nThe mothers who spoke to The Herald expressed their delight for giving birth on Christmas Day.\n\nI am very happy to give birth to my first-born daughter on the day that our Jesus Christ was born, Mrs Felistas Mbakureya, one of the mothers at Parirenyatwa Group of Hospitals said.\n\nThe City of Harare maternity clinics across the city recorded 50 births with 26 girls and 24 boys.\n\nAt the city clinics, the first Christmas baby was received at 0005 hours at Budiriro Polyclinic and a set of twin girls was delivered at Rujeko Polyclinic in Dzivarasekwa.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Christmas-Day-babies.jpg",
            "description": "Nyasha Motsi-Herald Correspondent More than 200 babies were born on Christmas Day in the country’s major hospitals in Harare, Bulawayo and Chitungwiza. Sally Mugabe Central Hospital recorded 54 births, Parirenyatwa Group of Hospitals 42, while Chitungwiza Central Hospital recorded 24. At United Bulawayo Hospitals (UBH), 26 children were born on Christmas Day, 13 boys and […]",
            "time": "09:46",
            "date": "27 Dec 2024"
        },
        {
            "title": "Gen Tongogara memorial monument complete",
            "url": "https://www.herald.co.zw/gen-tongogara-memorial-monument-complete/",
            "content": "Mukudzei Chingwere-Herald Reporter\n\nGovernment has completed the construction of a memorial monument and health centre in Masinga, Mozambique, dedicated to the late national hero and liberation war stalwart General Josiah Magama Tongogara, who died in a car accident in the neighbouring country on December 26, 1979.\n\nPermanent Secretary in the Ministry of Defence Mr Aaron Nhepera announced the completion of the monument at this years commemorations of the late Zanla military supremo at the National Heroes Acre yesterday.\n\nThis project aims to honour his legacy and serve as a place of remembrance for Gen Tongogara, celebrating his leadership and commitment to the fight for freedom.\n\nThe accompanying health centre will provide medical services to the community, reflecting Zimbabwes dedication to enhancing healthcare access in the country and beyond.\n\nMr Nhepera said invitations will be extended to the President of Zimbabwe and his Mozambican counterpart for the commissioning ceremony once the security situation in Mozambique stabilises.\n\nUs as Government through the Ministry of Defence and the Ministry of Home Affairs and Cultural Heritage, we are constructing a memorial monument in Mozambique in Masinga as well as a health centre, said Mr Nhepera.\n\nWe have already finished these construction works and the centre should have been opened this year but we could not do so because of the situation in Mozambique.\n\nWe will plan another date for the two Presidents of Zimbabwe and Mozambique to be there so that it will be officially opened. We are committed as Government, particularly through the Ministry of Defence to continue honouring the legacy of Gen Tongogara, said Mr Nhepera.\n\nVeterans of the Liberation Struggle Affairs Minister Monica Mavhunga emphasised the importance of preserving the legacy of the liberation struggle as well as documenting the struggles history.\n\nI want to thank President Mnangagwa who has enabled the creation of a department in my Ministry responsible for the documentation of the war, said Minister Mavhunga.\n\nWe must not forget the sacrifices of our comrades and also of the younger generation. I urge you to preserve this legacy and shun away from vices like drug and substance abuse.\n\nFamily and beneficiaries of the Tongogara Trust expressed their gratitude for the project, noting the importance of honouring Gen Tongogaras legacy.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Mrs-Angeline-Tongogara.jpg",
            "description": "Mukudzei Chingwere-Herald Reporter Government has completed the construction of a memorial monument and health centre in Masinga, Mozambique, dedicated to the late national hero and liberation war stalwart General Josiah Magama Tongogara, who died in a car accident in the neighbouring country on December 26, 1979. Permanent Secretary in the Ministry of Defence Mr Aaron […]",
            "time": "09:46",
            "date": "27 Dec 2024"
        },
        {
            "title": "AU calls for calm as Mozambique faces post-election violence",
            "url": "https://www.herald.co.zw/au-calls-for-calm-as-mozambique-faces-post-election-violence/",
            "content": "Herald Reporter\n\nThe African Union (AU) has appealed for a peaceful resolution to the escalating violence in Mozambique following the general elections held on October 9.\n\nThe Chairperson of the African Union (AU), Moussa Faki Mahamats statement comes in the wake of significant unrest that has resulted in multiple fatalities since the announcement of the election results by the Mozambican Constitutional Council.\n\nThe AU chair reaffirmed their commitment to collaborating with the Mozambican Government, national stakeholders, and regional bodies such as the SADC to halt the violence and uphold constitutional democracy in Mozambique.\n\nIn his statement, the AU chair expressed deep concern over the ongoing violence and extended his condolences to the families of those who have lost their lives, emphasising the urgent need for calm and restraint among all parties involved.\n\nThe AU Chairperson called upon the Mozambican Government and all political and social actors to engage in dialogue aimed at resolving the crisis.\n\nHe warned that failure to seek a peaceful solution could lead to further loss of life and destruction of property, exacerbating an already volatile situation.\n\nThe AU statement is in stark contrast to the meddlesome statement that was released by the United States which sought to disregard the sovereignty of the people of Mozambique and its judiciary.\n\nThe United States is concerned by the December 23 announcement by the Mozambican Constitutional Council regarding the October 9 national elections, the US said in a statement following the court ruling upholding Daniel Chapos win.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Faki-Muhamat.jpg",
            "description": "Herald Reporter The African Union (AU) has appealed for a peaceful resolution to the escalating violence in Mozambique following the general elections held on October 9. The Chairperson of the African Union (AU), Moussa Faki Mahamat’s statement comes in the wake of significant unrest that has resulted in multiple fatalities since the announcement of the […]",
            "time": "09:46",
            "date": "27 Dec 2024"
        },
        {
            "title": "Kariba Dam structurally safe: ZRA",
            "url": "https://www.herald.co.zw/kariba-dam-structurally-safe-zra/",
            "content": "Sifelani Tsiko-Innovations Editor\n\nThe latest tremor with a magnitude of 4,9 experienced in Kariba and surrounding areas on December 23 has not affected the structural integrity of the Kariba Dam which was built about 61 years ago, the Zambezi River Authority (ZRA) has said.\n\nThe authority which manages the Kariba Dam on behalf of the Zimbabwean and Zambian governments, confirmed the occurrence of heightened seismic activity in Kariba and surrounding areas this month.\n\nThe epicentre of the first six earthquakes on December 7, 8 and 11, with a magnitude ranging between 4,1 and 4,7 was located between 19km and 40km south-south-east of Kariba town in the Charara Safari Area.\n\nA magnitude 4,3 earthquake incident on December 11, the seventh was triangulated approximately 106km away from Kariba Dam in the Hurungwe District while the epicentre of the most recent earthquake incident on December 23 was approximately 10km within the Kariba reservoir, directly behind the Antelope Island in Zimbabwe.\n\nWithin this context, the earthquakes that have been experienced in Kariba, Siavonga and surrounding areas since the construction of the Kariba Dam are relatively small and have not generated large ground accelerations or vibrations as to cause concern regarding the safety of the dam wall, the ZRA said in a latest update.\n\nThe inspections and analysis of data from the various monitoring instruments after the earthquakes referred to above did not reveal any unusual observations and the dam continued to exhibit normal behaviour that is consistent with prevailing loading conditions.\n\nTremors of such a nature are a common occurrence in the area around the Kariba Dam.\n\nExperts refer to these tremors as load induced tremors, or specifically reservoir induced tremors in the case of the Kariba Dam, and are a result of the earth crusts response to the water load or weight of water given the size of the dam.\n\nEver since 1963 when the Kariba Dam started filling, more than 1 000 tremors of magnitude 4.0 have been experienced.\n\nThe earthquakes are not only peculiar to Kariba, but have also been reported from the filling and subsequent operation of several other large dams and reservoirs worldwide.\n\nMost tremors around Lake Kariba have been barely perceptible to humans. These reservoirs induced seismic events pose little risk of damage to buildings or humans.\n\nThey are better described as tremors or more neutrally as seismic events rather than the more emotive  though common  term earthquake.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Kariba-Dam-.jpg",
            "description": "Sifelani Tsiko-Innovations Editor The latest tremor with a magnitude of 4,9 experienced in Kariba and surrounding areas on December 23 has not affected the structural integrity of the Kariba Dam which was built about 61 years ago, the Zambezi River Authority (ZRA) has said. The authority which manages the Kariba Dam on behalf of the […]",
            "time": "09:46",
            "date": "27 Dec 2024"
        },
        {
            "title": "High Court calls for expansion of magistrates’ sentencing powers",
            "url": "https://www.herald.co.zw/high-court-calls-for-expansion-of-magistrates-sentencing-powers/",
            "content": "Fidelis Munyoro-Chief Court Reporter\n\nThe Judiciary has called upon the legislature to urgently expand the sentencing jurisdiction of regional magistrates, enabling them to impose penalties that reflect the gravity of the offences they preside over.\n\nThis call comes against the backdrop of new sentencing guidelines which prescribe a presumptive penalty of 20 years imprisonment for robbery committed under aggravating circumstances.\n\nHowever, the sentencing powers of regional magistrates remain capped at a mere 12 years, a limitation that undermines their ability to deliver justice in serious and complex criminal cases.\n\nThis legislative gap was starkly highlighted in the High Court case of Israel Mufure (22) and Charles Murinda (55)  two armed robbers who unleashed terror on a primary school in Norton, robbing teachers with brazen aggression using a pellet gun to instil fear.\n\nThe duo was convicted of five counts of robbery and one count of unlawful entry, receiving a consolidated 10-year sentence for the robberies and an additional 10 years for unlawful entry.\n\nHowever, Justice Esther Muremba and Deputy Judge President Garainesu Mawadze, expressed profound concern over the inadequacy of the sentence, viewing it as incompatible with the severity of the crimes committed.\n\nJustice Muremba, writing for the court, underscored the troubling disparity between the presumptive penalty of 20 years for robbery under aggravating circumstances and the regional magistrates jurisdictional limit of 12 years.\n\nShe characterised the imposed sentence as unduly lenient, particularly given the egregious nature of the offences.\n\nThe judge further noted that the sentencing magistrate failed to fully appreciate or apply the new sentencing framework, raising questions about whether the magistrates approach aligned with the legislative intent of the presumptive guidelines.\n\nWhen I queried the learned regional magistrate about the 10-year sentence for five counts of robbery committed under aggravating circumstances, given the presumptive penalty of 20 years for one count, she replied that her jurisdiction in robbery cases is limited to 12 years under section 51(3) of the Magistrates Court Act [Chapter 7:10], Justice Muremba remarked.\n\nYet, the magistrate did not expound on how this limitation influenced her sentencing decision or reconcile the discrepancy between the higher presumptive penalty and her imposed sentence.\n\nJustice Muremba said that the magistrate should have explicitly acknowledged this jurisdictional limitation in her judgment and provided a reasoned explanation for her approach in light of the sentencing guidelines.\n\nThe court expressed dismay at the apparent misconception that the magistrates maximum sentencing jurisdiction equates to the normal sentencing range for such offences.\n\nJustice Muremba cautioned that this view risks creating a disconnect between the sentencing framework and the realities of the crimes magistrates frequently adjudicate.\n\nShe remarked, While adhering to jurisdictional limits is necessary, this view may indicate a disconnect from the sentencing guidelines, which suggest a presumptive penalty of 20 years. It appears the learned regional magistrate has not fully embraced or given due weight to the new sentencing framework.\n\nThe judges also stressed that regional magistrates often handle robbery cases involving aggravating circumstances, making it imperative to enhance their sentencing powers.\n\nExpanding the sentencing jurisdiction of regional magistrates is crucial to ensuring that penalties adequately reflect the severity of offences. This would not only enhance judicial efficiency but also strengthen the publics trust in the justice system, Justice Muremba stated.\n\nThe current requirement to refer cases involving sentences beyond the magistrates jurisdiction to the High Court was described as cumbersome and counterproductive.\n\nJustice Muremba highlighted the delays and inefficiencies caused by this process, which often prolongs the resolution of cases and hampers the delivery of justice.\n\nShe argued that empowering magistrates to impose higher sentences would streamline the judicial process, reduce backlogs, and ensure that justice is served both swiftly and effectively.\n\nThe judges called for legislative intervention to amend the Magistrates Court Act [Chapter 7:10], aligning magistrates sentencing jurisdiction with the presumptive penalties prescribed by the guidelines.\n\nThey said that such a move would foster consistency and uniformity in sentencing, a cornerstone of a fair and credible judicial system.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2018/10/0310-1-1-JUSTICE_ESTHER_MUREMBA.jpg",
            "description": "Fidelis Munyoro-Chief Court Reporter The Judiciary has called upon the legislature to urgently expand the sentencing jurisdiction of regional magistrates, enabling them to impose penalties that reflect the gravity of the offences they preside over. This call comes against the backdrop of new sentencing guidelines which prescribe a presumptive penalty of 20 years’ imprisonment for […]",
            "time": "09:46",
            "date": "27 Dec 2024"
        },
        {
            "title": "Medical Aid societies to fall under IPEC",
            "url": "https://www.herald.co.zw/medical-aid-societies-to-fall-under-ipec/",
            "content": "Zvamaida Murwira-Senior Reporter\n\nGovernment has gazetted the Insurance and Pensions Commission Amendment Bill which will result in the establishment of a policyholder and pension protection fund while medical aid societies will now fall under the Insurance and Pension Commission (IPEC) as the Second Republic seeks to reshape the insurance industry.\n\nThe gazetting of the Bill was announced by Clerk of Parliament, Mr Kennedy Chokuda in a Government Gazette published recently and is expected to be tabled before Parliament when it resumes sitting next year.\n\nThe proposed Bill is expected to strengthen the regulatory framework overseeing Zimbabwes insurance and pensions sectors and has far-reaching implications for insurers, pension funds, asset managers, and medical aid societies, which will now fall under IPECs regulatory scope.\n\nFor the first time, IPECs regulatory powers are expanded to include the oversight of medical aid societies, ensuring a more comprehensive regulatory framework.\n\nClause Four of the Bill states functions of IPEC among others to register insurers, mutual insurance societies, insurance brokers and medical aid societies to ensure that they maintain set standards and ensure compliance with the Insurance Act.\n\nAnother role listed is to monitor, regulate and supervise those entities.\n\nTo promote the maintenance of a fair, safe and stable insurance and pensions sector for the benefit and protection of policy owners and pension fund members, and to research and recommend on the international best practices in the insurance and pensions sector, and to conduct investigations into any particular registered person or class of registered persons, where the Commission considers such an investigation necessary for the purpose of preventing, investigating or detecting a contravention of this Act or any other law governing the insurance and pensions sector, reads the Bill.\n\nClause 12 of the Bill has several provisions, chief among them is the establishment a Policyholder, Pensions, Provident Members Protection Fund to be administered by a Board.\n\nThe objective of the Fund will be to compensate policyholders and pension, provident or retirement annuity fund members for losses directly incurred by them in the event of insolvency by an insurer or pension fund.\n\nFinancing for the Fund will come from contributions from insurers and pension funds, as well as income from investments, unclaimed benefits, and other sources such as penalties and donations.\n\nA new Board will manage the Fund, with members from key industry stakeholders, including insurers, pension fund representatives, and the Insurance and Pensions Commission.\n\nCompensation will depend on the type of insurance or pension policy and may be adjusted based on any payments already made by the contributors liquidator or insurer\n\nIPEC is given authority to approve service providers such actuaries, asset managers, credit rating agencies to operate within the insurance and pensions sectors.\n\nThe Bill also revises the composition and qualifications of the IPEC Board to between 7 to 9 members, with a stronger emphasis on experience in fields such as actuarial science, law and finance.\n\nDirectors will now be subject to stricter conflict of interest provisions, with disqualifications introduced for individuals with ties to regulated entities or conflicting interests.\n\nTerm limits for directors are clarified, allowing a maximum of two consecutive four-year terms.\n\nIn terms of the Bill, IPEC shall keep and maintain asset registers for insurers, insurance brokers, medical aid societies, and none shall dispose any of its asset without giving 14 days prior notice to IPEC.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Health-Insurance.jpg",
            "description": "Zvamaida Murwira-Senior Reporter Government has gazetted the Insurance and Pensions Commission Amendment Bill which will result in the establishment of a policyholder and pension protection fund while medical aid societies will now fall under the Insurance and Pension Commission (IPEC) as the Second Republic seeks to reshape the insurance industry. The gazetting of the Bill […]",
            "time": "09:46",
            "date": "27 Dec 2024"
        },
        {
            "title": "Zanu PF to step up economic transformation in 2025",
            "url": "https://www.herald.co.zw/zanu-pf-to-step-up-economic-transformation-in-2025/",
            "content": "Joseph Madzimure-Senior Reporter\n\nZANU PF will continue to drive economic transformation that resonates with the peoples aspirations in 2025, the partys National Political Commissar, Cde Munyaradzi Machacha said.\n\nIn an interview, Cde Machacha highlighted the partys commitment to ensuring that the general populace benefits from its polices.\n\nWe must make sure our people are empowered and participate in the economy. We need to close the poverty gap that exists in our communities, so there is a lot that needs to be done. The party is gearing itself to empower the people. I want to believe that the year 2025 will be equally a busy year.\n\nSince the establishment of the Second Republic, significant progress has been made in infrastructure development, including the construction of dams, roads, innovation hubs at tertiary institutions, and the provision of safe drinking water through borehole drilling.\n\nThe administration of President Mnangagwa has spearheaded these initiatives, which have created numerous job opportunities and fostered economic growth.\n\nDespite challenges in accessing external credit due to the debilitating illegal economic sanction, the Second Republic, using its own resources, has prioritised infrastructural development as a vital component of economic transformation.\n\nCde Machacha also addressed the importance of strengthening party structures, noting that ZANU PF conducts annual cell verification exercises to account for both old and new members.\n\nThis initiative aims to ensure the integrity of the partys membership in accordance with its constitutional requirements.\n\nI want to believe that next year will be another busy year. We must build a formidable party by ensuring our structures are in place and authentic. We will also address the ideological gap between the elders and the youth through training, workshops, and outreach programs, he remarked.\n\nThe ongoing restructuring includes the computerisation of membership records in new cell and village registers. ZANU PF is leveraging technological advancements to implement a comprehensive computerisation program for party membership, enhancing organisational efficiency and effectiveness.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Machacha.jpg",
            "description": "Joseph Madzimure-Senior Reporter ZANU PF will continue to drive economic transformation that resonates with the people’s aspirations in 2025, the party’s National Political Commissar, Cde Munyaradzi Machacha said. In an interview, Cde Machacha highlighted the party’s commitment to ensuring that the general populace benefits from its polices. “We must make sure our people are empowered […]",
            "time": "09:46",
            "date": "27 Dec 2024"
        },
        {
            "title": "Editorial Comment: Mozambican losers must accept electoral defeat peacefully",
            "url": "https://www.herald.co.zw/editorial-comment-mozambican-losers-must-accept-electoral-defeat-peacefully/",
            "content": "The reluctance of some losers in some elections to accept their loss and to encourage, or at least condone violence by their supporters negates the whole point of multi-party democracy, that the majority chooses who runs the Government and legislature of acountry.\n\nCentral to the whole democratic process is that someone wins each election with the obvious corollary that everyone else loses the election. If there were no losers there would be no multi-party democracy and no real election, simply the imposition of candidates and electorates limited to choosing, if choice was offered, from a very narrow range of approved candidates from one party.\n\nIt can be hard to lose, but that is the result of democracy, that more people voted for the other candidate or other party and so someone else had the most votes and won. Losers should brace themselves, accept the result, work out why they had fewer votes and try and offer better candidates and policies the next time round.\n\nThey also need to reign in their most enthusiastic supporters who might want to vent their disappointment through violence, or, as has happened, hope for violence to mask other criminal activity such as looting.\n\nAfrica has had more than its fair share of losers refusing to accept results, creating headlines of contested election results when usually the election results are not contested, but rather losing candidates refusing to accept them.\n\nBut Africa is not alone as the refusal by a large block of Republican Party voters showed in their refusal to accept the 2020 American election results, with resulting violence and some deaths. So this problem of refusing to accept results, violence and deaths can happen anywhere.\n\nMozambique, after a string of peaceful elections across SADC in recent years, is the latest country in the region to have the second-placed presidential candidate and the second largest parliamentary party refusing to accept results and their supporters taking to the streets and indulging in violence.\n\nThe Mozambique Constitutional Council, the top court for deciding all issues based on the constitution and the final court for all election petitions, ruled on Monday that the results of the October Presidential and Parliamentary elections did see Daniel Chapo win the Presidency with 65 percent of the vote and his Frelimo party winning an increased Parliamentary majority.\n\nMozambique has been seeing very high economic growth rates in recent years, and the militant insurgency in the north has been largely successfully dealt with as Mozambican security forces, backed by SADC, boosted their training and efficiency and found effective ways of dealing with the menace.\n\nThese sort of successes almost certainly increased the Frelimo vote as more people thought the party was the best for developing the country and coping with non-democratic violence. Openings for the opposition to leverage on were limited when the government was doing so well.\n\nBut the constitutional ruling resulted within hours with more violence, at least in Maputo and Beira, the two largest cities, and another 21 people killed, including two police officers, plus 13 civilians and 12 police injured and 25 vehicles set on fire, including two police vehicles. Once again large numbers took advantage of the violence to engage in burning and looting shops, according to video footage.\n\nThere has been a tendency in some new reports to blame the violence since October on the Government suppressing protests, but the fact that police are dying and comprise almost half the injured suggests otherwise, and that police are being targeted by violent protesters. The widespread looting is not a protest, but rather widespread thieving and crime, and the setting of vehicles on fire seems to be pure arson, not politics.\n\nSADC itself through its observer mission, as did the African Union, confirmed earlier that the elections, despite the odd hiccup, had been effective in finding out the will of the Mozambican population and that the results would be accurate. The Mozambican courts of course would have delved further, looking at all the objections and petitions that elections can generate, and then on the evidence making the final decision.\n\nSADC itself does not have any opinion of who should win any election in the region, except that the winners must have the majority support of their own population. Some elections result in a governing party maintaining its majority, some result in a change of government and a president from another party.\n\nThis year Botswana changed its government in an election, and every SADC leader sent their congratulations and the neighbours turned up at the inauguration. A few years ago Zambia saw the same, and once again that was accepted by all and once again the new president was congratulated. When a president wins another term, or at least their partys designated successor wins that is accepted and congratulations follow as has happened this year in South Africa, Namibia and now Mozambique.\n\nThe point is that SADC does not choose the winners, only confirms that the elections were adequately run and the local courts have settled any disputes. Presidents, governments and parties are chosen by the people.\n\nBut where SADC does make a stand after an election is that its recognises the winner, as SADC Chairperson President Mnangagwa did this week when the Mozambique Constitutional Council made its ruling, and makes it clear that it will support the country and those whom a majority of the people selected.\n\nThis support has been unconditional and absolute since SADC was formed, as the region saw so many violent wars before all people could vote freely and recognises that only the people can choose governments.\n\nLosers need to recognise this. Just because they cannot imagine voting for the winner does not mean that others may come to different opinion and they need to accept that despite their own opinion of the respective talents and policies, the people thought differently.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Daniel-Chapo.jpg",
            "description": "The reluctance of some losers in some elections to accept their loss and to encourage, or at least condone violence by their supporters negates the whole point of multi-party democracy, that the majority chooses who runs the Government and legislature of a  country. Central to the whole democratic process is that someone wins each election […]",
            "time": "09:46",
            "date": "27 Dec 2024"
        }
    ]
}