{
    "news": [
        {
            "title": "Police intensify crack down on illegal kombis",
            "url": "https://www.herald.co.zw/police-intensify-crack-down-on-illegal-kombis/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nThe Zimbabwe Republic Police (ZRP) has intensified its ongoing operation, No to Mushikashika and Lawlessness on the Roads, aimed at restoring order and promoting public safety in the country.\n\nThis comes amid growing concerns over the proliferation of unregistered kombis and pirate taxis disrupting traffic and endangering lives.\n\nIn a statement, ZRP national spokesperson, Commissioner Paul Nyathi said there is need for compliance and warned operators that are flouting the law.\n\nWe want to make it clear that only registered kombis with verifiable documentation will be allowed to operate as public service vehicles, said Commissioner Nyathi.\n\nUnregistered kombis and pirate taxis have no place on our roads, and we urge operators to comply with the law to avoid facing legal consequences.\n\nThe police have also highlighted that unroadworthy vehicles, illegal pick-up and drop-off points and corruption have exacerbated road safety concerns.\n\nCommissioner Nyathi called on the public to exercise caution when choosing transporters.\n\nPassengers must avoid boarding ramshackled kombis, especially those without registration plates or with windows covered by makeshift materials like cardboard boxes. Public safety is a collective effort and we urge everyone to play their part, he said.\n\nThe ZRP has also vowed to address internal corruption within its ranks.\n\nCommissioner Nyathi said the police are determined to root out corrupt elements and restore public trust.\n\nThe police are also focusing on illegal operations along high-traffic routes such as the Chitungwiza-Harare Central Business District corridor.\n\nUnregistered kombis dropping passengers near Seke Bridge have come under scrutiny, with the police pledging decisive action.\n\nZRP Commissioner-General Stephen Mutamba has also directed Police Commanders to facilitate the smooth passage of fully compliant kombis at checkpoints to avoid unnecessary delays.\n\nMeanwhile, the public has been encouraged to report any instances o\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/images-10.jpeg",
            "description": "Ivan Zhakata Herald Correspondent The Zimbabwe Republic Police (ZRP) has intensified its ongoing operation, “No to Mushikashika and Lawlessness on the Roads,” aimed at restoring order and promoting public safety in the country. This comes amid growing concerns over the proliferation of unregistered kombis and pirate taxis disrupting traffic and endangering lives. In a statement, […]",
            "time": "18:34",
            "date": "28 Jan 2025"
        },
        {
            "title": "Vagrant in court for killing a man in Harare’s CBD",
            "url": "https://www.herald.co.zw/vagrant-in-court-for-killing-a-man-in-harares-cbd/",
            "content": "Prosper Dembedza\n\nHerald Correspondent\n\nA 20-year-old vagrant yesterday appeared in court on allegations of killing a man (57) in Harares central business district.\n\nLeeroy Sambureni was remanded in custody to February 7 by Harare magistrate, Mr Sheunesu Matova.\n\nProsecutor Mr Rufaro Chonzi said on January 15 this year at around midnight, Mr Forbes Jile left Big Apple Sports Bar on his way to Dzivarasekwa.\n\nAs Mr Jile was walking along Nelson Mandela Street in Harares CBD, Sambureni approached him from behind, grabbed his sling bag and pushed him to the ground.\n\nMr Jiles head hit the tarmac.\n\nSambureni searched Mr Jiles pockets and took his wallet that had US$10.\n\nHe also took his cell phone then ran away, leaving him lying on the tarmac.\n\nMr Jiles body was discovered by an informant who then made a police report.\n\nA post mortem conducted concluded that the cause of Mr Jiles death was due to head trauma.\n\nOn January 26, the police received information on the whereabouts of Sambureni.\n\nHe was subsequently arrested.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/courthammer-680x380.jpg",
            "description": "Prosper Dembedza Herald Correspondent A 20-year-old vagrant yesterday appeared in court on allegations of killing a man (57) in Harare’s central business district. Leeroy Sambureni was remanded in custody to February 7 by Harare magistrate, Mr Sheunesu Matova. Prosecutor Mr Rufaro Chonzi said on January 15 this year at around midnight, Mr Forbes Jile left […]",
            "time": "18:34",
            "date": "28 Jan 2025"
        },
        {
            "title": "Police impound truck full of smuggled goods",
            "url": "https://www.herald.co.zw/police-impound-truck-full-of-smuggled-goods/",
            "content": "Freedom Mupanedemo\n\nMidlands Bureau\n\nPolice in Gweru have impounded a truck that was travelling from South Africa to Kadoma with smuggled goods worth thousands of United States dollars.\n\nThe syndicate evaded police roadblocks through a surveillance car that was travelling ahead and communicating with those in the truck through a radio.\n\nOfficer Commanding Gweru Urban District, Chief Superintendent Leon Marongedza said the police have also impounded the signal radios that the syndicate was using to communicate.\n\nThey had a small surveillance car that was travelling ahead with signal radios to identify and communicate the position of police roadblocks, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/WhatsApp-Image-2025-01-28-at-14.43.28-680x380.jpeg",
            "description": "Police in Gweru have impounded a truck that was travelling from South Africa to Kadoma with smuggled goods worth thousands of United States dollars.",
            "time": "18:34",
            "date": "28 Jan 2025"
        },
        {
            "title": "Kwekwe man jailed 26 years for rape, robbery",
            "url": "https://www.herald.co.zw/kwekwe-man-jailed-26-years-for-rape-robbery/",
            "content": "Anesu January\n\nHerald Correspondent\n\nA Kwekwe man has been sentenced to 26 years in prison for raping a woman five times before robbing her.\n\nThe 40-year-old man appeared before the Kwekwe Magistrates Court facing charges of rape and robbery.\n\nThe court heard that on January 18, the man forcefully entered the complainants workplace while she was sleeping.\n\nHe threatened her with a knife and raped her five times without protection.\n\nOn the same day, the man hurt the complainant on her pelvis with an iron bar before forcefully taking US$80 and groceries worth US$623.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/11/Jailed.jpg",
            "description": "A Kwekwe man has been sentenced to 26 in prison for raping a woman five times before robbing her.",
            "time": "18:34",
            "date": "28 Jan 2025"
        },
        {
            "title": "Student teacher found dead in Gweru",
            "url": "https://www.herald.co.zw/student-teacher-found-dead-in-gweru/",
            "content": "Crime Reporter\n\nA student teacher was found dead at Guinea Fowl School in Gweru over the weekend.\n\nPolice have since launched a manhunt for the victims boyfriend, identified as Valentine Tamuka Zireva (27), in connection with the case.\n\nIn a statement, national police spokesperson Commissioner Paul Nyathi said, Police in Gweru are investigating a case of murder that occurred at Guinea Fowl School, Gweru, on January 25. A student teacher, Keener Tsanana (21) was found dead with a swollen forehead and bruises all over the body.\n\nThe victims boyfriend, Valentine Tamuka Zireva aged 27 is being sought in connection with the case. Anyone with information that might assist with investigations should contact the nearest police station, said Commissioner Nyathi.\n\nMeanwhile, police have also confirmed a fire incident that occurred in Rujeko, Masvingo, on January 24 in which a boy aged 14 died while two women sustained severe burns after the house they were in caught fire.\n\nThe fire emanated from a pot of hot cooking oil after one of the victims added onions to the oil.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Screenshot-2025-01-28-at-14.42.32-680x380.png",
            "description": "A student teacher was found dead at Guinea Fowl School in Gweru over the weekend.",
            "time": "18:34",
            "date": "28 Jan 2025"
        },
        {
            "title": "Commissioner Charity Gezi bids farewell to Mashonaland Central",
            "url": "https://www.herald.co.zw/commissioner-charity-gezi-bids-farewell-to-mashonaland-central/",
            "content": "Fungai Lupande\n\nMashonaland Central Bureau\n\nThe Officer Commanding Zimbabwe Prisons and Correctional Service Mashonaland Central, Commissioner Charity Gezi has bid farewell to the province after she was transferred to Harare Province.\n\nCommissioner Gezi will be succeeded by Commissioner Gilbert Marange.\n\nMashonaland Central Provincial Affairs and Devolution Minister Christopher Magomo said Commissioner Gezi is leaving behind a legacy of exceptional leadership and authority.\n\nHe said she is a shining example of what women can achieve.\n\nCommissioner Gezi has proven that women can do everything that men can do, said Minister Magomo.\n\nHer accomplishments have inspired countless women and girls, demonstrating that with determination and hard work, they too can reach great heights.\n\nMinister Magomo also praised Commissioner Gezi for her loyalty and support towards Government programmes.\n\nThe farewell ceremony was attended by captains of industry, traditional leadership, churches, non-governmental organisations and retired officers, as well as the Commissioners family and friends.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Screenshot-2025-01-28-at-14.36.56-680x380.png",
            "description": "The Officer Commanding Zimbabwe Prisons and Correctional Service Mashonaland Central, Commissioner Charity Gezi has bid farewell to the province after she was transferred to Harare Province.",
            "time": "18:34",
            "date": "28 Jan 2025"
        },
        {
            "title": "Developers with no Environmental Impact Assessment certificates face legal action",
            "url": "https://www.herald.co.zw/developers-with-no-environmental-impact-assessment-certificates-face-legal-action/",
            "content": "Mutsawashe Mashandure\n\nHerald Correspondent\n\nAs Zimbabwe prepares to commemorate World Wetlands Day on February 2, the Environmental Management Agency (EMA) has said developers operating without valid Environmental Impact Assessment (EIA) certificates face legal action.\n\nThis year, the day will be commemorated under the theme Wetlands Action for People and Planet.\n\nThe theme aligns with the global Ramsar Conventions mission to promote the conservation and sustainable use of wetlands.\n\nIn a statement issued on Tuesday, EMA spokesperson Ms Amkela Sidange said the agency is committed to promoting preservation efforts to protect wetlands.\n\nTogether with our stakeholders, we will conduct awareness campaigns to educate people on the crucial role played by wetlands in our lives, she said.\n\nWetlands perform critical functions, including protecting us from floods, droughts, and other disasters. They provide food and livelihoods to millions of people, support rich biodiversity and store more carbon than any other ecosystem.\n\nThey remain vital to human existence, she explained.\n\nMs Sidange urged stakeholders to keep the environment clean.\n\nWe do not want a repeat of what happened at Lake Chivero, where pollution, primarily from raw sewage, posed significant health risks to humans and animals, she said.\n\nIf we work together to keep our wetlands reserved and clean, we will avoid such situations.\n\nIt is not only EMAs duty but everyones responsibility. Together, we can restore and protect Zimbabwes wetlands.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/04/EMA.jpg",
            "description": "Mutsawashe Mashandure Herald Correspondent As Zimbabwe prepares to commemorate World Wetlands Day on February 2, the Environmental Management Agency (EMA) has said developers operating without valid Environmental Impact Assessment (EIA) certificates face legal action. This year, the day will be commemorated under the theme “Wetlands Action for People and Planet”. The theme aligns with the […]",
            "time": "18:34",
            "date": "28 Jan 2025"
        },
        {
            "title": "ZimParks receives vehicles from UAE",
            "url": "https://www.herald.co.zw/zimparks-receives-vehicles-from-uae/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nZimbabwe Parks and Wildlife Management Authority (ZimParks) has received 10 vehicles from United Arab Emirates (UAE) wildlife conservation company, Umlando, through the Embassy of the UAE in Zimbabwe.\n\nThe 10 Isuzu double cab all-terrain vehicles are meant for operational activities.\n\nZimParks director-general Professor Edson Gandiwa received the vehicles.\n\nProf Gandiwa said the donation marks the dawn of a new era.\n\nThis act of support signals a new level of unquestionable commitment and the commencement of a strategic partnership between the Authority and Umlando. That partnership strives to contribute towards the attainment of our shared objectives on sustainable conservation of Zimbabwes wildlife heritage, he said.\n\nIt is important to note that this nature of support and strategic partnership is coming at a time when the Authority, just like many organisations in the country and beyond, is still recovering from disasters such as the Covid-19 pandemic and the El Nino-induced drought, among others.\n\nThe need for resources for wildlife conservation is much greater as we endeavour to implement our five-year strategic plan and ensure effective conservation of Zimbabwes wildlife heritage.\n\nThis plan will contribute to the National Development Strategy and ultimately to Vision 2030 which aims to transform Zimbabwe into an upper middle-income economy by 2030, said Prof Gandiwa.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/b42f5c5a-79f5-4e77-bd8b-d1057319eefb-1-680x380.jpeg",
            "description": "Zimbabwe Parks and Wildlife Management Authority (ZimParks) has received 10 vehicles from United Arab Emirates (UAE) wildlife conservation company, Umlando, through the Embassy of the UAE in Zimbabwe.",
            "time": "18:34",
            "date": "28 Jan 2025"
        },
        {
            "title": "Government signs agreement for US$110m Old Gwanda Road upgrade",
            "url": "https://www.herald.co.zw/government-signs-agreement-for-us110m-old-gwanda-road-upgrade/",
            "content": "Freeman Razemba\n\nSenior Reporter\n\nThe Government has signed a concession agreement with a local contractor, Zwane Enterprise, to carry out the reconstruction of the 120km Old Gwanda Road.\n\nPermanent Secretary in the Ministry of Transport and Infrastructural Development, Engineer Joy Makumbe signed the agreement on behalf of the Government while Zwane Enterprises was represented by its chief executive officer,\n\nEngineer Bekithemba Mbambo.\n\nThis comes after Cabinet last year approved the US$110 million Public-Private-Partnership investment for the upgrading of the road.\n\nGovernment recently revealed that it will be engaging the private sector in the construction of major roads under the Built-Operate and Transfer model.\n\nIn the past few months, the Zwane has been conducting feasibility studies and a total of 43 families are expected to be relocated due to the project.\n\nTwo tollgates are expected to be placed along the Old Gwanda Road.\n\nWhile the project was initially estimated to cost US$110 million, Eng Mbambo recently revealed that the figure may be closer to US$150 million, with US$40 million assigned to enhance the roads elements and cultural storytelling.\n\nOur Bulawayo Bureau obtained exclusive access to the roads architectural designs, which show how it aims to promote the diverse tourism offerings of Matabeleland South, with prominent tourist facilities and cultural sites integrated.\n\nThe innovative approach aligns with Governments recognition of the role played by roads in tourism development by fostering smoother connections between travel enthusiasts and their dream destinations.\n\nThe Ministry of Transport and Infrastructural Development, together with the Ministry of Tourism and Hospitality Industry, have already forged partnerships to revitalise the countrys roads and airports.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Screenshot-2025-01-28-at-14.18.55-680x380.png",
            "description": "The Government has signed a concession agreement with a local contractor, Zwane Enterprise, to carry out the reconstruction of the 120km Old Gwanda Road.",
            "time": "18:34",
            "date": "28 Jan 2025"
        },
        {
            "title": "Dynamos Football Club founding member’s judgement set for January 31",
            "url": "https://www.herald.co.zw/dynamos-football-club-founding-members-judgement-set-for-january-31/",
            "content": "Prosper Dembedza\n\nHerald Correspondent\n\nThe defence case in the trial of Dynamos Football Club founding member Bernard Marriott Lusengo kicked off on Monday with him denying the charges.\n\nLusengo, who is facing allegations of corruptly acquiring 51 percent shareholding in the club and allocating shares to undeserving people who are not the clubs original members, said the complainants in the matter are not entitled to any shares in the company.\n\nHe argued that nobody challenged the registration of Dynamos Club Private Limited.\n\nLeslie Gwindi is the complainant in the matter.\n\nDuring cross-examination, the State led by Ms Dzidzai Josiah read a Supreme Court judgement which states that the club should be run in terms of its 1963 constitution.\n\nA section in the clubs constitution states that former players (one of whom is a complainant in the matter) are entitled to a one percent share.\n\nThe State also said Lusengo held an extraordinary meeting in the absence of the complainants and repealed the 1963 constitution.\n\nThe presiding magistrate, Ms Yeukai Dzuda, deferred the matter to January 31 for judgement.\n\nInvestigations established that Lusengo allegedly declared himself the clubs chairman, and is said to have acted against a High Court order which awarded each founding member a one percent share.\n\nThe then High Court judge, Justice Luke Malaba gave the order after the ownership wrangle spilt into court in 2005.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/07/dynamos-11.jpg",
            "description": "The defence case in the trial of Dynamos Football Club founding member Bernard Marriott Lusengo kicked off on Monday with him denying the charges.",
            "time": "18:34",
            "date": "28 Jan 2025"
        }
    ]
}