{
    "news": [
        {
            "title": "Beitbridge Hospital gets solar-powered borehole",
            "url": "https://www.herald.co.zw/beitbridge-hospital-gets-solar-powered-borehole/",
            "content": "Thupeyo Muleya\n\nBeitbridge Bureau\n\nA group of cross-border transporters operating under the Crossborders for Economic Development (Crossborders for ED) donated a solar-powered borehole to Beitbridge District Hospital today.\n\nThey also committed to providing a water tank and offering additional support to the 140-bed health institution, which has been facing intermittent water supply challenges, adversely affecting the quality of care provided to patients.\n\nCrossborders for ED chairperson (Beitbridge), Mr Blessing Mureyani said the group mobilised resources through its members to help enhance health services at the hospital.\n\nThis is just the beginning, we are also looking at other areas to support our community, he said.\n\nWe believe this will in a long way in complement what Government is already doing in upgrading this health facility.\n\nMr Mureyani said it is critical for other community members to join in supporting the hospital to ensure the continuity of quality health services.\n\nBeitbridge District Hospital serves a local population of 250 000, alongside approximately 13 000 people transiting through the town daily and others from neighbouring districts such as Gwanda, Mberengwa, and Mwenezi.\n\nThe hospital handles an average of 350 births per month, including caesarean sections, which require consistent and adequate water supplies.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/ef4fe8a1-bc61-4590-bb4e-09dddcf4ae4b-680x380.jpg",
            "description": "A group of cross-border transporters operating under the Crossborders for Economic Development (Crossborders for ED) donated a solar-powered borehole to Beitbridge District Hospital today.",
            "time": "20:26",
            "date": "17 Mar 2025"
        },
        {
            "title": "Mother seeks protection after son forces her into squatter camp",
            "url": "https://www.herald.co.zw/mother-seeks-protection-after-son-forces-her-into-squatter-camp/",
            "content": "Anotida Chonzi\n\nCourt Correspondent\n\nA Harare woman has taken her son to court seeking a protection order after he allegedly harassed her until she left her own home to live in a squatter camp.\n\nAppearing before Harare Civil Court magistrate, Ms Meenal Narotam, Ms Lydia Sibanda accused Nyasha Manyenga of verbally and physically abusing her.\n\nShe said Manyenga calls her a witch.\n\nI have been living in a squatter camp because he chased me away from my own house, Sibanda told the court.\n\nShe said Manyenga is aggressive towards her, even poking her with his finger during confrontations.\n\nShe also told the court that her son steals household items, including clothes, mats, plates and curtains, to get money for alcohol.\n\nI do not even have curtains anymore because he took them down and sold them, she said.\n\nIn his defence, Manyenga denied forcing his mother out of the house.\n\nHe admitted to selling the curtains but insisted it was out of desperation, as he had been unemployed for seven months.\n\nI only took the curtains and sold them to buy groceries because we were starving, he said.\n\nMs Narotam granted the protection order in Ms Sibandas favour.\n\nShe ordered Manyenga to stop insulting his mother and to refrain from any actions that could lead to her displacement from her home.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/court-1.jpg",
            "description": "A Harare woman has taken her son to court seeking a protection order after he allegedly harassed her until she left her own home to live in a squatter camp.",
            "time": "20:26",
            "date": "17 Mar 2025"
        },
        {
            "title": "Money laundering suspect tells court he is being ‘fixed’",
            "url": "https://www.herald.co.zw/money-laundering-suspect-tells-court-he-is-being-fixed/",
            "content": "Prosper Dembedza\n\nCourt Correspondent\n\nA Chitungwiza man who was arrested last year on allegations of money laundering has told the court that he earned the money in South Africa.\n\nIshmaal Shayanewako highlighted that his warned and cautioned statement has robbery allegations while the State charge sheet has money laundering charges.\n\nHe said this shows that the police who arrested him only want to fix him.\n\nWhile in South Africa, I did not tell anyone about the money as I was afraid of being robbed, he said.\n\nWhen I got to the border, I told the clearing agents that I had some money in my bag but they didnt give me a declaration form. They told me that the country warmly receives investors as l had hinted on my plans, Shayanewako told the court.\n\nAccording to prosecutor Loveit Muringwa, on October 23 last year, detectives from Chitungwiza received information that Shayanewako was on a spending spree.\n\nActing on the information, they arrested the accused who was driving a Toyota Hilux GD6 vehicle he had just bought for US$36 000.\n\nThe accused was escorted to CID Chitungwiza where a search was conducted in his vehicle. A wallet containing ZAR 198 800 was recovered.\n\nFurther investigations revealed that he had also recently purchased a five-roomed house in Manyame Park, Chitungwiza, for US$27 000.\n\nThe court heard that Shayanewako was quizzed about the source of the money but he failed to give a satisfactory response.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/court-hammer.jpg",
            "description": "A Chitungwiza man who was arrested last year on allegations of money laundering has told the court that he earned the money in South Africa.",
            "time": "20:26",
            "date": "17 Mar 2025"
        },
        {
            "title": "Defence seeks fresh trial in Presidential Goat Scheme corruption case",
            "url": "https://www.herald.co.zw/defence-seeks-fresh-trial-in-presidential-goat-scheme-corruption-case/",
            "content": "Fidelis Munyoro\n\nChief Court Reporter\n\nThe defence in the corruption trial of businessmen Mike Chimombe and Moses Mpofu, accused of misappropriating millions from the Presidential Goat Pass-On Scheme, has formally notified the prosecution of its intention to seek new trial.\n\nThis follows the recent appointment of two new assessorsMr Temba Kuwanda, a regional magistrate, and Ms Margaret Chitsigato join Justice Pisirayi Kwenda on the bench.\n\nThe defence argues that the reconstitution of the court necessitates a trial de novo, a complete retrial in which both factual and legal matters are considered afresh, as though the previous proceedings never occurred.\n\nAcknowledging this procedural turn, Justice Kwenda, with the agreement of both the defence and prosecution, adjourned the matter to Friday to hear the application.\n\nThe prosecution, led by Mr Whisper Mabhaudhi, has signaled its opposition to the defences interpretation of the law regarding the implications of the courts reconstitution.\n\nThe allegations against Chimombe and Mpofu centre on their purported orchestration of a scheme to divert funds from the Presidential Goat Pass-On Scheme, a Government programme aimed at empowering rural communities through the distribution of livestock.\n\nProsecutors claim that the pair falsified compliance certificates from the Zimbabwe Revenue Authority (Zimra) and the National Social Security Authority (Nssa), fraudulently issued under Blackdeck Private Limited.\n\nInvestigations have since revealed that Blackdeck was deregistered from the Nssa system in January 2016.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/6f99b5c2-1392-4045-bc5f-da4eea6f8d90-680x380.jpeg",
            "description": "The defence in the corruption trial of businessmen Mike Chimombe and Moses Mpofu, accused of misappropriating millions from the Presidential Goat Pass-On Scheme, has formally notified the prosecution of its intention to seek new trial.",
            "time": "20:26",
            "date": "17 Mar 2025"
        },
        {
            "title": "Truck crash spills beer on Chinhoyi-Chegutu Highway",
            "url": "https://www.herald.co.zw/truck-crash-spills-beer-on-chinhoyi-chegutu-highway/",
            "content": "Conrad Mupesa\n\nMashonaland West Bureau\n\nA 30-tonne truck loaded with Chibuku opaque beer was involved in an accident at the 10 km peg along the Chinhoyi-Chegutu Highway today, resulting in a stampede for crates of beer that were strewn all over the tarmac.\n\nBy 1 pm, the scene had become chaotic as motorists and passersby joined in looting the beer near Swanaepol Farm.\n\nIt was not immediately clear how the accident happened but there were no fatalities.\n\nThe driver and crew sustained minor injuries.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/1a9e7b93-8d81-45d7-a958-73871ea519c0-680x380.jpg",
            "description": "A 30-tonne truck loaded with Chibuku opaque beer was involved in an accident at the 10 km peg along the Chinhoyi-Chegutu Highway today, resulting in a stampede for crates of beer that were strewn all over the tarmac.",
            "time": "20:26",
            "date": "17 Mar 2025"
        },
        {
            "title": "ZICC reinforces transparency in security sector",
            "url": "https://www.herald.co.zw/zicc-reinforces-transparency-in-security-sector/",
            "content": "Obey Musiwa\n\nHerald Reporter\n\nThe Zimbabwe Independent Complaints Commission (ZICC) is making headway in its mandate to investigate complaints of misconduct against members of the security sector.\n\nThe Commission is taking shape through capacity building and recruitment of key personnel, including investigators and legal officers.\n\nSpeaking at a strategic planning workshop held in Darwendale, ZICC chairperson Justice Webster Chinamora said they handle complaints in a transparent and fair manner.\n\nThe Commission is mandated to ensure that there is a fair mechanism for receiving complaints from members of the public, he said.\n\nEstablished by the Constitution of Zimbabwe, the Commission aims to provide an effective and independent mechanism for addressing public grievances.\n\nWe investigate those complaints with an open-mind, without prejudging any issues, and making appropriate recommendations.\n\nAnd those recommendations include, in deserving cases, referral for prosecution by the National Prosecution Authority, he said.\n\nHe emphasised the importance of stakeholder collaboration.\n\nAs a Commission, we are guided by the need to improve national and human security through fair, timely and transparent handling of complaints.\n\nWe are, at this stage, in the process of developing the necessary tools that will enable us to receive complaints.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Justice-Webster-Chinamora.jpg",
            "description": "The Zimbabwe Independent Complaints Commission (ZICC) is making headway in its mandate to investigate complaints of misconduct against members of the security sector.",
            "time": "20:26",
            "date": "17 Mar 2025"
        },
        {
            "title": "Rwanda cuts diplomatic ties with Belgium, expels diplomats amid rising tensions",
            "url": "https://www.herald.co.zw/rwanda-cuts-diplomatic-ties-with-belgium-expels-diplomats-amid-rising-tensions/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nRwanda has officially severed diplomatic relations with Belgium, ordering all Belgian diplomats to leave the country within 48 hours.\n\nThe Rwandan government announced the decision today citing Belgiums alleged interference in regional affairs and its historical role in fuelling instability.\n\nIn a statement, Rwandas Ministry of Foreign Affairs and International Cooperation accused Belgium of engaging in pitiful attempts to sustain its neocolonial delusions and taking sides in the ongoing conflict in the Democratic Republic of Congo (DRC).\n\nBelgium has consistently undermined Rwanda, both well before and during the ongoing conflict in the DRC, in which Belgium has a deep and violent historical role, especially in acting against Rwanda, reads the statement.\n\nThe Rwandan government further alleged that Belgium was systematically mobilising against Rwanda in different forums and accused Brussels of harbouring groups that propagate genocide denial.\n\nThis decision reflects Rwandas commitment to safeguarding our national interests and the dignity of Rwandans, as well as upholding the principles of sovereignty, peace, and mutual respect, reads the statement.\n\nThe diplomatic fall-out comes amid heightened tensions in the Great Lakes region, with Rwanda facing accusations of backing M23 rebels in eastern DRCclaims that Kigali denies.\n\nThe rift also follows Rwandas suspension of its development cooperation agreement with Belgium earlier this year, after accusing its former colonial power of politicising aid.\n\nBelgium has not yet issued a formal response.\n\nAs Rwanda enforces its expulsion order, diplomatic observers warn that the severing of ties could further strain international efforts to mediate peace in the DRC.\n\nThe move also marks a significant escalation in Rwandas long-standing grievances with Belgium, whose colonial legacy remains a point of contention in Rwandan politics.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/09/1709-1-1-KAGAME.jpg",
            "description": "Rwanda has officially severed diplomatic relations with Belgium, ordering all Belgian diplomats to leave the country within 48 hours.",
            "time": "20:26",
            "date": "17 Mar 2025"
        },
        {
            "title": "President meets Tanzanian envoy",
            "url": "https://www.herald.co.zw/president-meets-tanzanian-envoy/",
            "content": "Zvamaida Murwira\n\nSenior Reporter\n\nSadc Chairperson, President Mnangagwa is meeting Tanzanian Foreign Affairs and East Africa Cooperation Minister, Ambassador Thabit Mahmoud Kombo at State House in Harare.\n\nAmbassador Kombo, a special envoy for Tanzanian President Samia Suluhu Hassan, is expected to deliver a message from her.\n\nPresident Hassan is Sadc chairperson for the Organ of Politics, Defence and Security Cooperation.\n\nThe two are currently holding bilateral talks.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/b9a5b3b6-5f63-4ade-8081-c3e427074c6d-680x380.jpeg",
            "description": "Sadc Chairperson, President Mnangagwa is meeting Tanzanian Foreign Affairs and East Africa Cooperation Minister, Ambassador Thabit Mahmoud Kombo at State House in Harare.",
            "time": "20:26",
            "date": "17 Mar 2025"
        },
        {
            "title": "Judgment reserved in Blessed Mhlanga’s case",
            "url": "https://www.herald.co.zw/judgment-reserved-in-blessed-mhlangas-case/",
            "content": "Fidelis Munyoro\n\nJudgment has been reserved in the matter involving Alpha Media Holdings (AMH) news reporter Blessed Mhlanga, who stands accused of transmitting messages alleged to incite public violence.\n\nThis follows the conclusion of submissions by both the defence and the prosecution.\n\nMhlanga sought relief from the High Court after being denied bail by the Magistrates Court.\n\nThe Magistrates Court found that granting bail posed a risk of witness interference.\n\nDuring proceedings, Justice Gibson Mandaza dismissed the defences request to introduce electronic evidence, which the defence argued was essential to support Mhlangas bail application.\n\nThe court ruled that releasing and reviewing such evidence at this stage would amount to pre-trial conduct.\n\nJustice Mandaza said such evidence would only be considered during the trial phase.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/04/Blessed-Mhlanga.jpg",
            "description": "Fidelis Munyoro Judgment has been reserved in the matter involving Alpha Media Holdings (AMH) news reporter Blessed Mhlanga, who stands accused of transmitting messages alleged to incite public violence. This follows the conclusion of submissions by both the defence and the prosecution. Mhlanga sought relief from the High Court after being denied bail by the […]",
            "time": "20:26",
            "date": "17 Mar 2025"
        },
        {
            "title": "Zanu PF Masvingo starts work on new offices",
            "url": "https://www.herald.co.zw/zanu-pf-masvingo-starts-work-on-new-offices/",
            "content": "George Maponga in Masvingo\n\nZanu PF Masvingo has mobilised resources to build its provincial headquarters.\n\nMobilisatin of building materials for the offices is almost complete after the Special Presidential Investment Advisor to the United Arab Emirates Dr Paul Tungwarara donated 50 000 bricks and 600 bags of cement for the project.\n\nThe offices are being constructed in the Clovelly area on the western side of Masvingo City.\n\nSpeaking on behalf of Dr Tungwarara, Masvingo Provincial Affairs and Devolution Minister Cde Ezra Chadzamira said Zanu PF is now set to have its own permanent home in the province.\n\nMinister Chadzamira said by December this year, the project would have been completed.\n\nZanu PF Masvingo provincial chair Cde Rabson Mavhenyengwa said the project will culminate in the building of a conference centre with the capacity to accommodate 10 000 people.\n\nWe will also have space to hold our inter-district meetings on top of the conference centre that will accommodate 10 000 people. This is a new era for Masvingo, he said.\n\nZanu PF does not have permanent offices in Masvingo and is currently operating from leased premises that serve as the provincial headquarters.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/11867fd2-bc0e-42cb-8fed-621d9af2dda1-680x380.jpeg",
            "description": "Zanu PF Masvingo has mobilised resources to build its provincial headquarters.",
            "time": "20:26",
            "date": "17 Mar 2025"
        }
    ]
}