{
    "news": [
        {
            "title": "Live coverage: Zimbabwe bids farewell to national hero Cde Chigudu",
            "url": "https://www.herald.co.zw/live-coverage-zimbabwe-bids-farewell-to-national-hero-cde-chigudu-2/",
            "content": "All set for Cde Chigudus burial\n\nThousands of people from across the country are gathered at the National Heroes Acre for the burial of National Hero, Cde Tinaye Elisha Nzirasha Chigudu.\n\nBuses ferrying mourners from the provinces are still arriving, setting the stage for a huge send-off.\n\nThe former Zanu PF Manicaland provincial chairperson and a distinguished civil servant, Cde Chigudu, died last Wednesday and was declared a national hero by the President on Friday.\n\nChigudu a stern disciplinary\n\nNational Hero, Cde Tinaye Elisha Nzirasha Chigudu, has been described as a stern no-nonsense disciplinarian.\n\nZanu PF Council of Elders member Cde David Parirenyatwa whose late father and national hero Tichafa Samuel Parirenyatwa worked with Cde Chigudu during the liberation struggle, said he was a straight forward man.\n\nYes, my father, as you know, was the vice president of ZAPU, before the formation of ZANU PF. They worked very closely with my father.\n\nThe type of person who was, what I can tell you, he was a stern disciplinarian, that I know, that he really loved discipline, he said.\n\nCde Parirenyatwa added: I think he has been well-recognized by his Excellency, the President, Dr Mnangagwa and I think its a well-deserved national national hero\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/live1-680x380.jpg",
            "description": "All set for Cde Chigudu’s burial Thousands of people from across the country are gathered at the National Heroes Acre for the burial of National Hero, Cde Tinaye Elisha Nzirasha Chigudu. Buses ferrying mourners from the provinces are still arriving, setting the stage for a huge send-off. The former Zanu PF Manicaland provincial chairperson and […]",
            "time": "09:46",
            "date": "10 Feb 2025"
        },
        {
            "title": "DRC crisis: Sadc, EAC set peace tone. . . seek direction on ceasefire",
            "url": "https://www.herald.co.zw/drc-crisis-sadc-eac-set-peace-tone-seek-direction-on-ceasefire/",
            "content": "Fungi Kwaramba recently in DAR ES SALAAM, Tanzania\n\nChiefs of Defence Forces from SADC and the East Africa Community have been given five days to provide technical direction that will ensure immediate ceasefire enforcement in the Democratic Republic of Congo, facilitate humanitarian aid and develop a security plan for Goma and surrounding areas.\n\nAt the same time, African countries that were backing rebels in the DRC were directed to immediately leave to give the people of the vast and resource-endowed nation a chance to live in sustainable peace.\n\nSpeaking to journalists upon his return from the joint SADC-EAC summit on Saturday night, President Mnangagwa said the meeting underscored the need for regional cooperation in addressing insecurity in the eastern parts of DRC.\n\nHe said the two blocs had resolved that no individual country should support armed groups responsible for conflict and displacement in the region.\n\nThe summit, co-chaired by President Mnangagwa in his capacity as SADC chairperson and Kenyan President William Ruto as EAC chairperson, focused on strategies to restore peace in the conflict-riddled region.\n\nWell, it was a joint summit of SADC and East African communities and the main issues were the issues of insecurity in the Eastern DRC, said the President.\n\nIt was an attempt by the two blocs  SADC and East African Community  to deal with that insecurity, trying to find ways where the two blocs can help create peace in that region and identify the parties that are involved in the military contestation in the Eastern DRC.\n\nMap of the Democratic Republic of Congo. Wires\n\nDespite the complexity of the situation, President Mnangagwa said, consensus was reached that all member States must refrain from supporting or arming any militant groups operating in the region.\n\nOf course, it was very difficult but in the end, it was resolved that all member States should make sure that they do not support groups, armed groups in the region, to cause insecurity on the continent and in that particular area.\n\nOf course, no member State came forward to say they were supporting an army, but it was very clear that these (rebel) groups were actually allowed to operate from a certain member State.\n\nIt was agreed that everything must be done to silence the guns, and that they (armed groups) should not be rendered any support by any member State.\n\nIn its communiqu, the joint summit directed that modalities for the withdrawal of uninvited foreign armed forces from the territory of the DRC, be developed and implemented by the two regional bodies top military officials.\n\nThe joint summit reaffirmed solidarity and unwavering commitment to continue supporting the DRC in its pursuit of safeguarding its independence, sovereignty and territorial integrity, as well as sustainable peace, security and development, read the communiqu in part.\n\nThe summit decided that similar consultations shall be convened at least once every year and as and when the need arises to review matters of common interest to the two regions.\n\nApart from that, the summit directed that a joint meeting of ministers of EAC and SADC convenes within the next 30 days to deliberate on:\n\n(a) the report of the joint meeting of CDFs on the ceasefire and cessation of hostilities\n\n(b) establishment of a secretariat-level technical coordination mechanism to monitor implementation of the joint summit decisions\n\n(c) an elaborate road map detailing immediate, medium- and long-term implementation measures, including financing modalities, and address all other residual issues relating to the attainment of sustainable peace and security in the eastern DRC and make appropriate recommendations to the next joint meeting of the EAC-SADC Summit.\n\nThe regional leaders also directed the resumption of direct negotiations with all State and non-State actors, including M23, within the Luanda/Nairobi process framework, while calling for implementation of the Concept of Operations (CONOPS) to neutralise the FDLR and facilitating Rwandas disengagement from the DRC.\n\nSADC and the EAC convened Saturdays joint summit to try and find a lasting solution to the DRC crisis, which has seen rebel groups taking over towns in the eastern parts of the vast country.\n\nApart from SADC Chairman President Mnangagwa, his EAC Counterpart President Ruto, and the host Tanzanian President Samia Suluhu Hassan, there was a huge turnout of regional leaders.\n\nDRCs President Felix Tshisekedi, who accuses Rwanda of backing the rebels in his country, attended the joint summit virtually.\n\nRwandan President Paul Kagame, Ugandan President Yoweri Museveni, South African leader Cyril Ramaphosa, Somalian President Hassan Sheikh Mohamoud and Zambian President Hakainde Hichilema, attended the high-stakes joint summit.\n\nLeaders of Burundi, Angola, Malawi, South Sudan and Madagascar were represented by ministers.\n\nOn Saturday President Mnangagwa told his fellow leaders that Africa must draw from its shared historical solidarity and the unity it used to dismantle colonialism to free the people of the DRC from internecine wars and conflict that undermine development.\n\nAddressing the opening session of the joint summit, President Mnangagwa said Africa should not let the people of DRC down but must, through honest dialogue, find a solution to silence the guns and engender enduring peace in the Great Lakes region.\n\nThe unity, solidarity and unbreakable bonds of the peoples of the continent must stand the test of such trying times, he said.\n\nWe must remain as solidly united as we were during the struggle for the complete emancipation and independence of Africa from colonialism.\n\nWe, thus, have a duty and collective responsibility to comprehensively, frankly, tackle and address the various challenges that are impeding the realisation of peace and security for the people of Eastern DRC.\n\nDrawing from our rich African values and heritage, and further emboldened by the spirit and letter of the United Nations Charter; the Constitutive Act of the African Union as well as the treaties of both SADC and the EAC; let us seize this opportunity to ensure convergence and a coordinated response which is mutually reinforcing towards one common objective.\n\nTowards the ultimate objective of finding last peace in the DRC, President Mnangagwa said talks among regional leaders must always be carried with openness, honesty, flexibility and a commitment to building lasting peace.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/HE-3.jpg",
            "description": "Fungi Kwaramba recently in DAR ES SALAAM, Tanzania Chiefs of Defence Forces from SADC and the East Africa Community have been given five days to provide technical direction that will ensure immediate ceasefire enforcement in the Democratic Republic of Congo, facilitate humanitarian aid and develop a security plan for Goma and surrounding areas. At the […]",
            "time": "09:46",
            "date": "10 Feb 2025"
        },
        {
            "title": "President mourns Namibia’s founding leader Nujoma",
            "url": "https://www.herald.co.zw/president-mourns-namibias-founding-leader-nujoma/",
            "content": "Ivan Zhakata, Herald Correspondent\n\nZimbabwe has joined the rest of Africa in mourning the death of Namibias founding President, Dr Sam Shafiishuna Nujoma, late on Saturday.\n\nPresident Mnangagwa expressed deep sorrow over Dr Nujomas death, describing him as the last in an iconic generation of leaders of our liberation movements and nations of our Southern Africa region.\n\nIn a statement yesterday, the President hailed Dr Nujomas unwavering dedication to the liberation of Namibia and his commitment to the unity of the Southern African Development Community (SADC).\n\nWe hurt and grieve deeply at the passing on of this gallant freedom fighter and visionary icon who led and delivered Independence and nationhood to the Namibian people, said President Mnangagwa.\n\nZimbabwe and Namibia share strong historical ties, dating back to the liberation struggles of both nations.\n\nPresident Mnangagwa acknowledged Dr Nujomas steadfast support for Zimbabwe, particularly during the Land Reform Programme, when he stood by Harare despite international pressure.\n\nZimbabwe will always remember and cherish Dr Nujomas principled and unconditional support as our nation faced concerted onslaught by vindictive countries of the West, he said.\n\nPresident Mnangagwa said Dr Nujomas legacy was that of a true Pan-Africanist, who championed the independence and sovereignty of African nations and that Africa must remain vigilant against new challenges of resource-induced encroachments.\n\nDr Nujomas demise comes after the death in office of former Namibia President Dr Hage Geingob on February 4 last year, compounding the nations grief.\n\nPresident Mnangagwa expressed solidarity with the Namibian people during this difficult period.\n\nI have no doubt that these repeated tragic losses do not just test your nation; rather, they spur all Namibians on, as they rally together in even greater and stronger unity to move your nation forward, he said.\n\nOn behalf of Government, the ruling Zanu PF party and the people of Zimbabwe, President Mnangagwa extended his deepest, heartfelt condolences to Namibian President Dr Nangolo Mbumba, the SWAPO party, the Namibian Government and the Nujoma family.\n\nAs Namibia prepares to bid farewell to its founding father, the legacy of Dr Nujoma as a liberation icon and Pan-African visionary remains deeply etched in the history of Southern Africa.\n\nThe news of President Nujomas death was broken early yesterday by Namibian President Nangolo Mbumba, noting that the government would announce a period of mourning for the late anti-apartheid activist leader.\n\nDr Nujoma served as Namibias first president between 1990 and 2005.\n\nHe was among the last African remaining revolutionaries of his era.\n\nPresident Mbumba said the founding father lived a long and consequential life during which he served the people of his beloved country.\n\nDr Nujoma heroically marshalled the Namibian people during the darkest hours of the liberation struggle until the attainment of freedom and independence from Apartheid South Africa on March 21,1990.\n\nPresident Mbumba hailed founding Dr Nujoma as a visionary leader, who provided maximum leadership to the Namibian nation.\n\nHe said Dr Nujoma did not only blaze the trail to freedom, but also inspired Namibians to rise and become masters of this vast land of our ancestors\n\nDuring this period of national mourning, we should be comforted by the unmatched leadership and extraordinary contributions of President Nujoma to the liberation struggle, as well as the development and unity of the Namibian people, he remarked.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Untitled-120-680x380.jpg",
            "description": "Ivan Zhakata, Herald Correspondent Zimbabwe has joined the rest of Africa in mourning the death of Namibia’s founding President, Dr Sam Shafiishuna Nujoma, late on Saturday. President Mnangagwa expressed deep sorrow over Dr Nujoma’s death, describing him as “the last in an iconic generation of leaders of our liberation movements and nations of our Southern […]",
            "time": "09:46",
            "date": "10 Feb 2025"
        },
        {
            "title": "All set for national hero’s burial today",
            "url": "https://www.herald.co.zw/all-set-for-national-heros-burial-today/",
            "content": "Samuel Kadungure and Freeman Razemba\n\nAll is set for the burial of National Hero, Cde Tinaye Elisha Nzirasha Chigudu, today at the National Heroes Acre.\n\nPresident Mnangagwa is expected to preside over the burial.\n\nMourners are expected to be seated by 7am.\n\nBuses to ferry mourners from the provinces had been organised by late yesterday, setting the stage for a huge send-off.\n\nThe former Zanu PF Manicaland provincial chairperson and a distinguished civil servant, Cde Chigudu, died last Wednesday and was declared a national hero by the President on Friday.\n\nYesterday, mourners gathered at Chigudu Village in Chiendambuya, Makoni North in Manicaland, to pay their last respects to a man whose legacy as a war veteran, public servant and lawyer will be remembered for generations.\n\nMany people suspended their busy schedules to honour Cde Chigudus life, with some along the way to his rural home ululating and waving at the hearse as his body was taken to his village by road. It was not airlifted because of rains in Harare and nearby areas.\n\nHe was described as a forthright, unwavering, and goal-oriented leader.\n\nOthers described him as humble, friendly, non-selective, non-intimidating, caring, and generous. Chief mourner Advocate Misheck Mugadza, Manicaland Minister of State for Provincial Affairs and Devolution, highlighted that Cde Chigudus legacy extends beyond his impressive career.\n\nAdv Mugadza acknowledged Cde Chigudu as a champion of the land reform, facilitating many peoples access to land during his tenure as Governor for Manicaland.\n\nCde Chigudu was remembered for his remarkable contributions to Zimbabwes liberation and development, with President Mnangagwas decision to confer national hero status on him being widely appreciated by his family, community, and fellow war veterans.\n\nHe was described as a shrewd intelligence officer during the liberation struggle, gathering critical information that assisted guerrilla operations. After independence, he spearheaded various development projects in Manicaland, including water development and womens empowerment programmes.\n\nChief mourner, the Minister of State for Provincial Affairs and Devolution, Advocate Misheck Mugadza, said Cde Chigudus legacy extends beyond his impressive career.\n\nHe noted that Cde Chigudu was a champion of land reform, facilitating many peoples access to land during his tenure as Governor of Manicaland, and his commitment to the people was unwavering, making his passing a significant loss to the nation.\n\nHe expressed gratitude to President Mnangagwa for conferring national hero status on Cde Chigudu, describing him as a gallant, illustrious and devoted nationalist.\n\nMinister Mugadza acknowledged Cde Chigudus remarkable career.\n\nThis man, Cde Tinaye Chigudu, was a wonderful blessing, not only to your community here, but to Makoni, Manicaland and our great nation at large. This is why we should thank His Excellency the President, Cde Dr ED Mnangagwa for conferring the honour of national hero on our gallant, illustrious, devoted and nationalist son. Here lies an intelligence supremo of the province, an astute legal mind, revered public servant who worked at the apex of the public service structure as a Permanent Secretary and a wise politician, whose political wisdom saw him serve as the Governor for Manicaland Province, a position that I now serve, albeit as a reconfigured Office of the Minister of State for Provincial Affairs and Devolution.\n\nMy office is a replica of what Cde Chigudu was doing when he served as Governor; principally that of serving the community of Manicaland. He committed himself to delivering Government programmes with delicate appreciation that serving his beloved society with humility was why he took up arms to crush the self-serving whims of the colonial regime.\n\nSitting behind the chair that Cde Chigudu used to sit as the Governor of Manicaland, I now know too well what he has had to deal with on a daily basis, ensuring that the people of Manicaland are served well.\n\nCde Chigudu has left a mark as a dedicated and fearless son of the soil. When it was risky for anyone to pursue the war, he chose the path to defend our nation. At a very tender age of 22, Cde Chigudu committed to national activism, a sacrifice which saw him imprisoned for 12 years. A number of our young men and women at this age are struggling with drug abuse, unplanned pregnancies and other youth delinquencies that are increasing worry to the Government. Yet Cde Chigudu is an example which we call upon all youth to emulate. In his young age, he became a dependable intelligence operative, providing protective security that our liberation cadres needed. Yet now we have young people in our midst, willing to sell our country for a song, to the extent of calling for sanctions against our kith and kin. Cde Chigudu would never have borne such sell-out mentality.\n\nCde Chigudu has remained an unrelenting supporter of our land reform programme, being one of its pioneers. He has remained of the strong conviction that this is the only way to redress past imbalances. As Governor, he has facilitated for many to secure land. It thus is a heavy loss that his demise comes at a point when the Second Republic is pursuing aggressive efforts to guarantee security of tenure for land acquired through the land reform programme which he pioneer. This is a monumental victory which we undoubtedly attribute to the heroic exploits of Cde Chigudu, said Minister Mugadza.\n\nZanu PF Central Committee Member, Cde Shadreck Chipanga shared a personal anecdote, describing Cde Chigudu as more than a friend and colleague, who would offer counsel and support during challenging times, demonstrating his commitment to unity and leadership.\n\nZanu PF provincial chairman Cde Tawanda Mukodza praised Cde Chigudu for paving the way for his own leadership role, highlighting his ability to unite and lead the party to electoral victory.\n\nProvincial War Veterans League chairman Cde Sendekera Musendo described the national hero as a mentor and advisor, noting that his demise is a significant loss to both the Chigudu family and war veterans.\n\nCde Musendo decried the fact that war veterans are dwindling, with no new ones being born.\n\nThe Chigudu family spokesperson, Mr Newton Chigudu, expressed gratitude for the national hero status conferred upon his brother saying their familys name has been etched in history.\n\nWar veteran, Cde Cosmas Chiringa, who worked with the late Cde Chigudu during his tenure as Manicaland Governor and ZANU PF Manicaland provincial chairman, described him as a forthright, unwavering, and goal-oriented person.\n\nI was both the district administrator and Zanu PF provincial secretary for administration. I worked with him as a politician and public servant, which gave me the opportunity to interact with him daily.\n\nWe worked well together, spearheading the development of and ZANU PF hegemony in Manicaland. He was straightforward and forthright. Cde Chigudu would not tolerate nonsense.\n\nDuring our interactions, I found him to be knowledgeable and understanding, with a wealth of political experience. He loved his party, Zanu PF, he said.\n\nThe body of the national hero left Chiendambuya in Makoni North last night for Harare where it lay in state at his Mt Pleasant home ahead of todays burial.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/TC1-1.jpg",
            "description": "Samuel Kadungure and Freeman Razemba All is set for the burial of National Hero, Cde Tinaye Elisha Nzirasha Chigudu, today at the National Heroes Acre. President Mnangagwa is expected to preside over the burial. Mourners are expected to be seated by 7am. Buses to ferry mourners from the provinces had been organised by late yesterday, […]",
            "time": "09:46",
            "date": "10 Feb 2025"
        },
        {
            "title": "Pressure to formalise businesses intensifies",
            "url": "https://www.herald.co.zw/pressure-to-formalise-businesses-intensifies/",
            "content": "Business Reporter\n\nIn a significant move towards economic stabilisation and growth, Reserve Bank of Zimbabwe Governor Dr John Mushayavanhu has expressed strong support for efforts to formalise the informal sector.\n\nThe push is part of broader measures outlined in the 2025 Monetary Policy Statement announced last Thursday, aimed at enhancing Government tax revenues and stabilising the economy.\n\nLast week, Finance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube announced measures to rein in a burgeoning informal sector that was threatening the survival of formal businesses.\n\nThe Monetary Policy emphasises the need for both the informal and formal sectors to align, creating a more cohesive economic environment.\n\nDr Mushayavanhu is advocating the integration of informal businesses into a system that includes dual currencies, bank accounts, and electronic payments, which is essential for achieving the Governments economic goals.\n\nUnder the new regulations, items on a list of commonly smuggled goods will be presumed smuggled unless merchants can provide valid customs clearance.\n\nThis initiative places pressure on businesses to ensure compliance and legitimacy in their operations.\n\nGovernment will implement a presumptive retail-level VAT that manufacturers must collect when selling to small or informal businesses lacking tax clearance certificates.\n\nThis measure restricts wholesalers from engaging with unlicensed entities, further pushing informal businesses towards formalisation.\n\nThe introduction of elevated presumptive taxes presents a significant challenge for unregistered businesses, with a quarterly tax liability of US$9 000 for an unregistered tuckshop, compelling owners to register with the Zimbabwe Revenue Authority (Zimra) to avoid such hefty charges.\n\nIn alignment with the 2025 Monetary Policy, Dr Mushayavanhu has laid out specific conditions for small businesses seeking formalisation, including mandatory bank accounts to manage financial transactions effectively.\n\nAcceptance of a dual-currency point-of-sale (POS) system is now required, allowing customers to choose their preferred currency during transactions.\n\nThese conditions are designed to facilitate compliance with tax regulations while encouraging a smoother transition into the formal economy.\n\nTo support small businesses, both Prof Ncube and Dr Mushayavanhu have ensured that minor electronic transactions will not incur taxes or bank charges.\n\nFor transactions under US$5, there will be zero POS fees, and transactions below US$100 will face no banking fees.\n\nThis strategy aims to alleviate the financial burden on small businesses and encourages the use of electronic payments.\n\nAs formal sector retailers push for a level playing field, they are likely to encounter fierce competition from newly formalised small businesses.\n\nThese family-run or one-person operations typically have lower overhead costs and can thrive alongside larger supermarket chains by focusing on high-demand items and fostering strong customer relationships.\n\nThe pressure for formalisation is mounting in Zimbabwes business landscape.\n\nThe 2025 Monetary Policy not only highlights the need for compliance among informal businesses but also sets the stage for a more structured and competitive economic environment that benefits all stakeholders.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/03/Minister-Mthuli-Ncube.jpg",
            "description": "Business Reporter In a significant move towards economic stabilisation and growth, Reserve Bank of Zimbabwe Governor Dr John Mushayavanhu has expressed strong support for efforts to formalise the informal sector. The push is part of broader measures outlined in the 2025 Monetary Policy Statement announced last Thursday, aimed at enhancing Government tax revenues and stabilising […]",
            "time": "09:46",
            "date": "10 Feb 2025"
        },
        {
            "title": "VP Mohadi grieves for Cde Chigudu",
            "url": "https://www.herald.co.zw/vp-mohadi-grieves-for-cde-chigudu/",
            "content": "Africa Moyo, Deputy News Editor\n\nVice President Kembo Mohadi has joined President Mnangagwa and the nation at large in mourning the death of national hero Cde Tinaye Elisha Nzirasha Chigudu, who is set to be buried at the National Heroes Acre this morning.\n\nPresident Mnangagwa declared Cde Chigudu a national hero last Friday, after considering the roles he played before and after independence.\n\nHe died last Wednesday at his Mt Pleasant, Harare, home after a long illness.\n\nHe was 82.\n\nIn a statement yesterday through his Chief-of-Staff Dr Clever Chirume, VP Mohadi said it was devastating that Cde Chigudu had died barely a month after the passing on of other illustrious sons of the soil namely Ambassador John Shumba Mvundura, Cde Chenhamo Chen Chakezha Chimutengwende, Major-General (Retired) Solomon Siziba and Cde Justin Mupamhanga.\n\nThe Vice President joins His Excellency the President and the nation in mourning Cde Tinaye Chigudu, who has since been declared a national hero.\n\nIt is sad that yet another gallant son of the liberation struggle has died a few weeks after we buried four others.\n\nFurthermore, it is unfortunate that those of us who participated first-hand in the liberation struggle are now leaving when their wisdom and guidance is still required. This is the generation that demonstrated loyalty and resilience against the colonial regime, qualities we require to attain Vision 2030 of an empowered upper-middle-income society, said.\n\nIn his condolence message last Friday, President Mnangagwa said Cde Chigudu demonstrated bravery when he became one of the first cadres to be trained to fight in the liberation struggle.\n\nHe was one of the first combatants to be sent for training in North Korea under the Zimbabwe Peoples Revolutionary Army (ZPRA), the military wing of the Zimbabwe African Peoples Union (ZAPU), he said.\n\nCde Chigudu also demonstrated bravery when he was deployed as an intelligence operative in the then Salisbury, and the critical information he gathered regarding the methods of operation of the racist Rhodesian forces assisted the guerilla operations and recruitment of young Zimbabweans for guerilla training.\n\nAt the time of his death, he was farming in Makoni District.\n\nCde Chigudu was born on August 13, 1942.\n\nHe had his early education at Chigudu School, Cyrene Mission and Harare Secondary School where he was expelled in 1964 because of his political activism.\n\nHe left the country in 1964 and went to Zambia under ZAPU. He then trained guerilla warfare in the Democratic Republic of Korea as a ZIPRA cadre.\n\nUpon return, he was deployed in the country as an intelligence officer. In May 1965, he was captured and detained in Gonakudzingwa, Gweru and finally Whawha.\n\nHe was in detention for 12 years and was released in 1977 and exiled. He went to the UK and was enrolled at Exeter University where he studied law between 1978 and 1981.\n\nOn coming home, he joined the civil service, first as under Secretary (Legal Affairs) Ministry of Transport from 1981. He was appointed Deputy Secretary for the Ministry of Home Affairs and then Permanent Secretary in the same Ministry from 1994 to 2004.\n\nHe later became Permanent Secretary for Mines and Mining Development from 2004 to 2005. He was then appointed Governor and Resident Minister of Manicaland in 2005 and retired in 2008.\n\nCde Chigudu is the former ZANU PF Provincial Chairman of Manicaland and worked as a senior consultant under the United Nations Development Programme to structure the Ministry of Interior for South Sudan.\n\nHe is survived by wife, Mrs Esther Chigudu (nee Dumba) and seven children.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Kembo-Mohadi.jpg",
            "description": "Africa Moyo, Deputy News Editor Vice President Kembo Mohadi has joined President Mnangagwa and the nation at large in mourning the death of national hero Cde Tinaye Elisha Nzirasha Chigudu, who is set to be buried at the National Heroes Acre this morning. President Mnangagwa declared Cde Chigudu a national hero last Friday, after considering […]",
            "time": "09:46",
            "date": "10 Feb 2025"
        },
        {
            "title": "President revives Guruve chieftainship",
            "url": "https://www.herald.co.zw/president-revives-guruve-chieftainship/",
            "content": "Daniel Chigunwe, Herald Correspondent\n\nThe people of Guruve District in Mashonaland Central Province have expressed their appreciation to President Mnangagwa and the Second Republic for reviving the Chimbwerere Chieftaincy.\n\nThe Chimbwerere Chieftaincy was abolished by the colonial administration in 1963 after its leaders refused to pay homage to the then-native district commissioner, a Mr Leat.\n\nChief Director of the Department of Traditional Leadership Support Services, Mr Felix Alexander Chikowo, confirmed the resuscitation of the Chimbwerere Chieftaincy.\n\nHe said proper protocols were in place for the installation of the new chief.\n\nI confirm that the Chimbwerere Chieftaincy was resuscitated by President Mnangagwa, who, according to the constitution, has the mandate to restore chieftaincies abolished by the colonial administration, he said.\n\nThe legislation allows the President to reinstate those chieftaincies that were abolished, not those that became extinct due to conquest. We conducted archival research and found that (the) Chimbwerere Chieftaincy was abolished for resisting colonial rule, which justifies its revival.\n\nThe next stage is for the Provincial Assembly of Chiefs in Mashonaland Central to select a candidate from the Chimbwerere clan, who will be submitted to the National Chiefs Council for installation.\n\nIt is expected that the process would be completed this month.\n\nArchival records indicate that the Chimbwerere Chieftaincy had existed for centuries, dating back to its founding Chief Nyamanhindi, in what is now Guruve.\n\nChief Nyamanhindi and his Chidziwo clan occupied the eastern part of the Shinje River.\n\nHistorically, the chieftaincy was established by Mutota, who left Nyamanhindi in charge of the area to prevent anyone from following him, hence the nickname Chidziwo Chamutota, from which their chidao/chidawo is derived.\n\nDuring the early 1900s, all traditional leaders were required to register their chieftainships. At that time, Sumbu, Chief Chimbwerere, sent emissaries Katsiru and Bangira to collect the wachi (token) of recognition in Salisbury (now Harare).\n\nHowever, the two returned out of fear it was a trap, recalling the fate of Chief Nyamhondoro and his aides, who were killed on a similar journey.\n\nIn 1963, the Chimbwerere dynasty was downgraded when Johannes Chido Mutuwa was unilaterally appointed Headman Chimbwerere by Mr Leatt, the district commissioner. Many clansmen were dissatisfied with this demotion, as they sought official recognition of their chieftaincy.\n\nMr Washington Chidziwo, spokesperson for the Chimbwerere clan, expressed gratitude for the Governments decision to revive the chieftaincy.\n\nOn behalf of the Chimbwerere clan, we thank President Mnangagwa and his Second Republic for resuscitating our chieftaincy.\n\nWe began this process during the previous era, and for years, we have awaited this good news. There existed an administrative vacuum in the communities directly and symbolically under Chief Chimbwerere, which are rich in minerals like gold and chrome.\n\nWe hope the chieftaincy will ensure that the exploitation of these resources benefits the community, in line with Vision 2030 and the Presidents mantra of leaving no one and no place behind, said Mr Chidziwo.\n\nIn March 2023, President Mnangagwa said Government will continue resuscitating chieftainships abolished by the Rhodesian settler regime and in December that year, the Hwadalala Chieftaincy in Gwanda District was revived after being abolished over 70 years ago by the colonial regime.\n\nIn 2019, the Bere Chieftaincy in Mashava was resuscitated by the Second Republic after its abolishment nearly a century ago.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Washington-Chidziwo.jpg",
            "description": "Daniel Chigunwe, Herald Correspondent The people of Guruve District in Mashonaland Central Province have expressed their appreciation to President Mnangagwa and the Second Republic for reviving the Chimbwerere Chieftaincy. The Chimbwerere Chieftaincy was abolished by the colonial administration in 1963 after its leaders refused to pay homage to the then-native district commissioner, a Mr Leat. […]",
            "time": "09:46",
            "date": "10 Feb 2025"
        },
        {
            "title": "EDITORIAL COMMENT: Monetary policy pushing ZiG, electronic payments",
            "url": "https://www.herald.co.zw/editorial-comment-monetary-policy-pushing-zig-electronic-payments/",
            "content": "Two main goals from the Reserve Bank of Zimbabwe (RBZ)s Monetary Policy Statement presented last week are to increase use of an ever-more-stable ZiG and to reinforce the measures of the Ministry of Finance, Economic Development and Investment Promotion to effectively formalise the informal sector.\n\nIn his 2025 Monetary Policy Statement, RBZ Governor Dr John Mushayavanhu was building on the successes since the introduction of the new ZiG local currency on April 5 last year, particularly the strong control of liquidity and building of reserves to ensure all ZiG in circulation are exceptionally well covered so that the ZiG is actually a fundamentally stronger currency than the interbank market, let alone the black market, suggests.\n\nThe growth in reserves saw gold holdings of the Reserve Bank increase last year from 1,5 tonnes to 2,7 tonnes, and with the rising prices of gold and the other reserves, mainly foreign currency, the value of the reserves has now reached around US$500 million.\n\nThis will increasingly allow the RBZ to perform the important central bank function of being able to intervene in the market through purchases and sales of foreign currency to even out fluctuations in exchange rates and simply allow the general trend to be seen.\n\nThe tight monetary policy of the Reserve Bank, backed by the Government, has seen the growth in ZiG money supply to be low, significantly below the growth in reserves, and so removing one of the major inflationary pressures that have bedevilled the economy for so long.\n\nThis has also resulted in tighter liquidity in the economy, with businesses complaining about this.\n\nThe business sector was complaining in the past about the results of too much liquidity, the high inflation rates and the dramatically declining exchange rate for the local currency although it enjoyed swimming in the flood of extra liquidity.\n\nDr Mushayavanhu has found a clever way to boost liquidity, without increasing money supply and without seeing that extra liquidity being channelled into consumer spending and so feeding inflation.\n\nBanks have to deposit with the central bank a fixed percentage of the deposits, 30 percent of their demand deposits and 15 percent of their savings deposits. This means they cannot lend that money.\n\nHowever, Dr Mushayavanhu is now willing to see at least some of these statutory reserves being lent out, but only to productive borrowers who want to borrow to increase capacity rather than just spend the money on consumption or use it for speculation. The statutory reserves will now be used to fund the new Targeted Finance Facility that opened last month.\n\nThis means that there is no printing of money, that is no increase of money supply, to finance the facility, but at the same time the new use of the pool of statutory reserves cannot fuel inflation. Retailers can now also benefit from the facility, presumably to increase working capital which has been eroded in real value. In effect the statutory reserves pool is now being used as a way for the Reserve Bank to control consumer spending while boosting productive borrowing.\n\nBanks have tended to allow a far higher percentage of their loan book to be used for consumer spending, with the salary-backed loans being the most obvious, and borrowers were also abusing these consumer loans for speculation. To keep the consumer loans within limits, the Reserve Bank is maintaining the 35 percent bank rate, the minimum interest that a bank can charge for a loan.\n\nAs part of the gradual movement to having the ZiG being the normal currency in Zimbabwe, exporters can now only retain 70 percent of their export earnings in the foreign currency accounts, rather than the 75 percent that has been the norm for some years. The extra 5 percent of export earnings will be used to feed the foreign currency markets. However, in case an exporter does not want to use the extra ZiG from the compulsory sale immediately, they can now deposit that 5 percent in a new special US dollar-denominated deposit facility until they need the ZiG which will be withdrawn at the prevailing rate on that date.\n\nThis will protect exporters from exchange rate fluctuations from a weaker ZiG, although not from fluctuations from a falling US dollar. That is possible as last month saw for the first time in Zimbabwe a higher rate of inflation in US dollar terms than in ZiG terms, and the desired policies of the new US Government might see more tariffs in the US as a permanent economic policy, which is likely to push up US inflation.\n\nThe general improvement in foreign currency availability is expected to continue, with the balance of payments rising to a surplus of more than US$500 million this year. This is the positive gap between inflows, largely from exports and diaspora payments, and outflows, mainly imports and foreign currency payments by Government, such as for debt servicing.\n\nThe combination of a lower export retention percentage and a larger surplus on the current account means that the Reserve Bank has been able to remove the previous limits on weekly trading and has increased the amount that can be spent using international foreign currency cards to US$1 million a year. While the tight controls on how much can be taken out of the country in banknotes remain, both formal and informal traders can take out more in a card, although the informal traders will need to open bank accounts to do this, something they will be having to do as they formalise.\n\nDr Mushayavanhu was also keen on seeing more people using bank accounts. Transactions below US$100 will no longer attract bank charges, and point of sale transactions below US$5 will no longer attract charges, meaning that electronic purchases with a card can be used for even tiny sums, as these are not subject to the transaction tax by Zimra.\n\nDual currency PoS machines are now compulsory for all businesses, no matter how small, under the new rules in the Monetary Policy Statement, with banks required to issue them and the traders formalising to avoid the new ultra-high presumptive taxes compelled to accept them before they can be licensed. The problem of traders continuing to demand banknotes is being tackled by making banks report those customers who are not using their machines.\n\nZimbabweans wanting to keep their money in US dollar banknotes have been hit in recent times by armed robbers, who see them as easy targets. Some have wanted to use banks for security, but not bank accounts that can be tracked, and so stack their banknotes in safe deposit boxes.\n\nDr Mushayavanhu has killed this option.\n\nThe upshot of the changes announced in the statement are to continue the normalisation of the economy towards using more and more local currency, to move away from cash towards near universal electronic payments, and to make sure that any easing of liquidity is reserved for production, not consumption.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/10/ef.jpg",
            "description": "Two main goals from the Reserve Bank of Zimbabwe (RBZ)’s Monetary Policy Statement presented last week are to increase use of an ever-more-stable ZiG and to reinforce the measures of the Ministry of Finance, Economic Development and Investment Promotion to effectively formalise the informal sector. In his 2025 Monetary Policy Statement, RBZ Governor Dr John […]",
            "time": "09:46",
            "date": "10 Feb 2025"
        },
        {
            "title": "RBZ predicts inflation  to trend down in 2025",
            "url": "https://www.herald.co.zw/rbz-predicts-inflation-to-trend-down-in-2025/",
            "content": "Michael Tome-Business Reporter\n\nRESERVE Bank of Zimbabwe (RBZ) is confident that the inflation rate will continue to trend down and has forecast the monthly rate to average three percent or less this year.\n\nThe bank has predicted the local currency annual rate to close the year between 20 and 30 percent on account of durable exchange rate stability.\n\nThe central bank attributed its projected inflation decline to its commitment to continue implementing tight monetary policies, including prudent reserve money targeting, which entails carefully managing money supply to curtail excessive liquidity.\n\nIt will also implement measures to stabilise the exchange rate, a crucial factor in influencing price movements in the multi-currency environment.\n\nThe commitment by the reserve bank to pursue optimal monetary policies through prudent reserve money targeting and strategic interventions in the foreign exchange market will stabilise the exchange rate, which is a key driver of price dynamics in a multi-currency environment.\n\nGiven the base effects caused by the spike in monthly inflation in October 2024, annual inflation is expected to be elevated from April 2025 to September 2025 before significantly moderating to end the year between 20-30 percent, said RBZ Governor, Dr John Mushayavanhu while presenting the 2025 Monetary Policy Statement.\n\nThe RBZ aims to create a stable monetary framework that supports low inflation and exchange rate stability.\n\nZimbabwe uses a dual currency system, mainly the US dollar and Zimbabwe Gold (ZiG), with the greenback being the predominant foreign currency used.\n\nThis comes after the January 2025 monthly inflation surged to 10,5 percent in ZiG terms, from Decembers rate of 3,7 percent while the US dollar rate rose by 11,5 percent in January following a 0,6 percent increase in December.\n\nThe RBZs tight monetary policy stance since April 2024 has brought about a modicum of exchange rate and inflation stability last year.\n\nThe Monetary Policy Committee (MPC) of the bank further reinforced efforts to stabilise inflation and the exchange rate by adjusting the Bank Policy Rate from 20 percent to 35 percent.\n\nConcurrently, minimum and maximum corporate lending rates were increased from 24,2 percent to 40 percent and 32, 4 percent to 45, 6 percent respectively.\n\nAs a result, inflationary pressures began to ease from October 2024, with monthly ZiG inflation rates decreasing significantly, from a high of 37,2 percent in October 2024 to a more manageable 3, 7 percent by December 2024.\n\nThe monetary policy measures also assisted in slowing credit growth, thereby impacting positively on inflation and the exchange rate.\n\nManaging inflation remains the banks top priority and the countrys economic stability hinges on sustaining the current slowdown in ZiG inflation while keeping US dollar inflation in check.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Dr-Mushayavanhu-1-680x380.jpg",
            "description": "Michael Tome-Business Reporter RESERVE Bank of Zimbabwe (RBZ) is confident that the inflation rate will continue to trend down and has forecast the monthly rate to average three percent or less this year. The bank has predicted the local currency annual rate to close the year between 20 and 30 percent on account of durable […]",
            "time": "09:46",
            "date": "10 Feb 2025"
        },
        {
            "title": "Mushrooming cluster  homes a cause for concern",
            "url": "https://www.herald.co.zw/mushrooming-cluster-homes-a-cause-for-concern/",
            "content": "Trust Freddy, Herald Correspondent\n\nConcerns are growing over the potential transformation of Harares low-density suburbs into high-density areas within the next five years, reportedly driven by councillors approving cluster housing developments in exchange for kickbacks from developers.\n\nThe City of Harare has not allocated stands for cluster house development in the past seven years, creating a policy vacuum that councillors are allegedly exploiting for personal gain.\n\nReports indicate that councillors are involved in the technical assessments of sites for cluster houses, despite lacking the necessary training. They conduct site visits and inspections, raising concerns about potential bribes from developers eager to commence their projects.\n\nMr Addmore Nhekairo, the director of housing at Harare City Council, said: I am not allocating any such stands for cluster homes.\n\nAs I indicated, these are the formerly big stands, which individual owners are now applying to subdivide into clusters.\n\nHe acknowledged the possibility of councillors extorting funds from developers.\n\nHowever, he emphasised that the proliferation of clusters is, in his opinion, a needs-driven occurrence where people are desirous of accommodation.\n\nResidents from suburbs such as Mt Pleasant and Groombridge have expressed their opposition to the new cluster housing policy.\n\nThey demand that the council first upgrade existing infrastructure before any further developments.\n\nTheir concerns include the impact on sewer and water systems, as well as the availability of essential services like schools.\n\nAdded Mr Nhekairo: The town planner is now mindful of the concerns of residents and the impact it is having on not only sewer and water reticulation infrastructure but also the availability of ancillary facilities like schools.\n\nThe ongoing developments pose a significant threat to the character of low-density suburbs in Harare.\n\nResidents are urging the city council to prioritise infrastructure improvements and address the governance issues that have contributed to the current situation.\n\nIn Newlands, there are concerns that the mushrooming of apartments accommodating many families is resulting in increased demand for electricity, causing faults most of the time.\n\nWith more people in Newlands, the drilling of boreholes has also increased, leading to the water table going further down.\n\nSome residents say they have raised the issue with council but nothing has been done so far.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/06/Addmore-Nhekairo.jpg",
            "description": "Trust Freddy, Herald Correspondent Concerns are growing over the potential transformation of Harare’s low-density suburbs into high-density areas within the next five years, reportedly driven by councillors approving cluster housing developments in exchange for kickbacks from developers. The City of Harare has not allocated stands for cluster house development in the past seven years, creating […]",
            "time": "09:46",
            "date": "10 Feb 2025"
        }
    ]
}