{
    "news": [
        {
            "title": "Tragic accident claims lives on Bulawayo Road",
            "url": "https://www.herald.co.zw/tragic-accident-claims-lives-on-bulawayo-road/",
            "content": "Arron NyamayaroSeveral people are feared dead, and others are seriously injured following a tragic accident involving a commuter omnibus and a truck in the early hours along Bulawayo Road in Harare.\n\nThe collision occurred at the Dzivarasekwa turn-off, an area that has seen recent fatalities due to road safety violations.\n\nIn a previous incident, a kombi driver went towards oncoming traffic, resulting in the loss of lives.\n\nAuthorities are investigating the circumstances surrounding the latest accident.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/04/accident-6.jpg",
            "description": "Several people are feared dead, and others are seriously injured following a tragic accident involving a commuter omnibus and a truck in the early hours along Bulawayo Road in Harare.",
            "time": "08:38",
            "date": "19 Mar 2025"
        },
        {
            "title": "President raises the stakes on empowerment…Launches Presidential Youth Fund tomorrow",
            "url": "https://www.herald.co.zw/president-raises-the-stakes-on-empowerment-launches-presidential-youth-fund-tomorrow/",
            "content": "Joseph Madzimure\n\nSenior Reporter\n\nPRESIDENT Mnangagwa will tomorrow launch the revolving Presidential Youth Fund at Harare International Conference Centre, a landmark initiative aimed at empowering young people.\n\nThe fund is part of the Presidents broader vision to drive economic development and support young people in acquiring education, skills and employment opportunities.\n\nThe initiative recognises the youth as the backbone of the nations progress and seeks to equip them with the tools to thrive in a rapidly evolving global economy.\n\nThe fund will focus on education and skills development, providing financial support for youth-led projects in sectors such as mining, agriculture, tourism, and entrepreneurship.\n\nAt least 5 000 youths from across Zimbabwes 10 provinces are expected to attend the launch.\n\nThe initiative is designed as a revolving fund, ensuring accountability and sustainability by requiring beneficiaries to repay the funds, which can then be reinvested to support other youth initiatives.\n\nThe President has also introduced the Presidential War Veterans Fund, which provides direct financial support to Zimbabwes former liberation war fighters.\n\nThis initiative seeks to improve the quality of life for war veterans and honour their contributions to the countrys liberation struggle.\n\nAt the launch, mining and agricultural equipment will also be distributed under the Farm Mechanisation Programme, as well as pushcarts donated by Dairibord Holdings Limited and Varun Beverages to help youths start their own businesses.\n\nZanu PF deputy secretary for Youth Affairs, Cde John Paradza, said the fund was designed to provide starter packs for youths to kick-start their ventures, whether in mining, agriculture, tourism, or other sectors.\n\nPresident Mnangagwa will be giving starter packs to the youth so they can start their businesses, be it in mining, agriculture, tourism, or any other business. Its a revolving fund, he said.\n\nThe launch of the Youth Fund is expected to be attended by investors from Asia, who are keen on investing in the country and creating jobs for the youth. Invited by Special Presidential Investment Advisor to the United Arab Emirates Dr Paul Tungwarara, four business tycoons, with a combined net worth of nearly US$500 million, will be at the launch.\n\nThe investors, poised to inject fresh capital, are scouting for opportunities to drive the countrys economic growth across multiple sectors, including education, renewable energy, and healthcare.\n\nAmong the investors are Dr Ajeenkya Patil, Mr Rajat Verma and Mr Ravi Reddy, renowned multimillionaires from India, as well as Mr Lalu Samuel, a prominent millionaire from the United Arab Emirates.\n\nIn a letter to the President, Dr Tungwarara said: Dr Ajeenkya Patil serves as the chairman of the DYPATIL Group, a prominent organisation based in Pune, India, that operates across education healthcare, and skills development.\n\nFinancially, the group has demonstrated stability, with audited revenues of US$144 million in 2023, primarily generated from tuition fees, healthcare services, and corporate training.\n\nMr Reddys net worth is over US$140 million.\n\nRavi Reddy is the managing director and CEO of the Viceroy Group, a luxury hospitality chain with properties in India and the UAE, and has diversified into coal mining and solar panel manufacturing.\n\nIn terms of financial stability, the hospitality division generated US$120 million in revenue in 2023, while the solar division contributed an additional US$25 million.\n\nMr Vermas firms generated annual revenues exceeding US$45 million, with projections indicating a growth of over 200 percent by 2026, while Mr Samuels business ventures boast revenues of over US$80 million annually.\n\nThese investors present valuable opportunities for Zimbabwes economic growth across various sectors, including education, renewable energy, and healthcare.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Untitled-50.jpg",
            "description": "PRESIDENT Mnangagwa will tomorrow launch the revolving Presidential Youth Fund at Harare International Conference Centre, a landmark initiative aimed at empowering young people.",
            "time": "08:38",
            "date": "19 Mar 2025"
        },
        {
            "title": "Boost for infrastructure development agenda",
            "url": "https://www.herald.co.zw/boost-for-infrastructure-development-agenda/",
            "content": "Africa Moyo and Freeman Razemba\n\nZimbabwes infrastructure development agenda is gaining momentum, with public-private partnerships (PPPs) adopted for road projects and US$2,5 million released to accelerate the construction of Lake Gwayi-Shangani, Finance, Economic development and Investment Promotion Minister, Professor Mthuli Ncube, has said.\n\nThe transformative Lake Gwayi-Shangani construction project aims to enhance water supply to Bulawayo and its surrounding areas.\n\nStarted in 1912 by the settler colonial regime, the construction project failed to take off on several occasions until the advent of the Second Republic in November 2017.\n\nOut of the 72 metres of the dam wall to be constructed, 39 metres had been completed as of last year.\n\nNot much work was done on the dam wall last year, with most efforts dedicated towards the 10 megawatt hydroelectric project being developed on site.\n\nLake Gwayi-Shangani, designed by Zinwa and constructed by China Water and Electric Corporation, will have a capacity of 650 million cubic metres.\n\nIn an exclusive interview with The Herald, Prof Ncube said there was no going back on infrastructure projects, which have been the signature of the Second Republic, adding that Government was also embracing a public-private partnership model\n\nfor road construction.\n\nPPPs are critical in funding infrastructure projects as they reduce the burden on Treasury.\n\nThe Government is still focused on the public sector investment programme for roads, dams, and other areas. Now, its also true that last year we had quite a cluster around the SADC Summit on the northern side of Harare, also around the New City, to get ready for the summit, and that was a good thing, but infrastructure still needed to be done, said Prof Ncube.\n\nThe general infrastructure programme is still on course and the Government is focused on it. I mean, there are still some points of completion to be done on the Harare-Beitbridge Road, we have started on the Harare-Chirundu Road as well, but also we are now blending the model for road construction with the public-private partnership model.\n\nYou will notice that, for instance, for the Harare-Nyamapanda Road, including the border post, that has been concessioned out to the private sector, with a 25-year concession, and the private sector will invest and then recoup its investment through the toll fees.\n\nHe said the same model applies for the Beitbridge-Bulawayo-Victoria Falls Road, some of whose stretches are presently in bad shape.\n\nProf Ncube said Government is concessioning the modernisation of that highway although in the meantime, there will be some work to patch up the worst parts of the road, especially near the Hwange area, while the private sector player mobilises resources and contracts are finalised.\n\nWe also continue to invest in the water sector. For example, last week, we released about US$2,5 million towards the Gwayi-Shangani Dam, as an example. And then for the Glass Block Dam in Bulawayo, we are again saying the (Bulawayo) City Council should go ahead and have that done on a public-private partnership basis.\n\nWe continue again to work on Kunzvi Dam, to supply water to Harare. So really, the infrastructure agenda continues. By the way, it is infrastructure investment that also drives economic growth. That is how you invest in future growth in the first place.\n\nSo as a Government, we cannot afford to pull back on that, because then we will be pulling back on investment and growth, said Prof Ncube.\n\nThe Second Republic led by President Mnangagwa has prioritised completion of the Lake Gwayi-Shangani as it is primed to provide essential water resources and support agricultural activities, ultimately contributing to food security.\n\nDespite the challenges posed by limited resources, the Government remains resolute in its commitment to infrastructure development.\n\nAnother key project, the Mbudzi Interchange in Harare, set to be named Trabablas Interchange on completion, is also on track to be finalised by May 31, according to Transport and Infrastructural Development Minister Felix Mhona.\n\nThis US$88 million project, located at the intersection of Simon Mazorodze Road, Chitungwiza Road, and High Glen Road, is a key infrastructure development aimed at alleviating traffic congestion in southern Harare.\n\nIt features 15 bridges, all of which have been completed.\n\nThe Mbudzi Interchange is expected to significantly improve traffic flow, reduce transit times, and minimise accidents in the area.\n\nIt is being funded through local financial institutions and executed by a joint venture of three local construction companies: Tensor Systems, Fossil Contracting, and Masimba Construction, operating under the banner of Tefoma Construction.\n\nMinister Mhona said other major road projects, including the Harare-Beitbridge Highway, which has 88km remaining to be completed, are progressing well.\n\nContractors have already mobilised to finish this stretch, which includes 15 bridges, mini-interchanges at Rothmans and ZBC, and other critical infrastructure.\n\nMinister Mhona expressed confidence that the entire highway, including all bridges and interchanges, will be completed this year.\n\nYou have seen that the strategy of the ministry is to attend to our trunk roads. We shall then connect with other neighbouring countries, he said.\n\nNow you have witnessed the North-South Corridor and the Beira Corridor, where we are connecting with other countries. I am happy, again, to say we are completing the Beitbridge-Harare section.\n\nContractors have started mobilising again back to site and as we speak, they are attending to their sections. So we assure the people of Zimbabwe that come this year, the road will be complete with all the 15 bridges.\n\nWe are talking of bridges across rivers, bridges over rail. We have got two on that particular stretch. We have got also mini-interchanges.\n\nMinister Mhona said they have been monitoring the project since it is one of their flagship projects.\n\nHe also confirmed that they were starting to progress on the Harare-Chirundu Road and they were already working on a finance arrangement so they do the entire 352km right up to the border post and also rehabilitate the Chirundu Border Post.\n\nThe Makuti section of this road is already being worked on by the Japan International Co-operation Agency (JICA), and contractors have mobilised to complete the remaining sections.\n\nMinister Mhona said another significant project in the pipeline is the Christmas Pass bypass in Mutare, aimed at diverting heavy traffic away from the accident-prone area.\n\nGovernment has partnered Leengate (Private) Limited to construct a 26km road that will provide an alternative route to the Forbes Border Post.\n\nBut Prof Ncube called on contractors to do a thorough job to avoid being asked by the Ministry of Transport to redo any stretches that get damaged quickly.\n\nFossil Contracting has already been ordered to redo Mama Mafuyane Drive, formerly Lorraine Drive in Harare, after the road crumbled in no time.\n\nSaid Prof Ncube: There have been a few cases where the Ministry of Transport has instructed contractors to come and redo or revamp roads. Thats not abnormal for them to act in that way.\n\nSo this is clearly an area where, again, we have to always set aside budgets for upgrades, for maintenance, but also be tough on the quality of the roads in the first place.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/12/Professor-Mthuli-Ncube.jpg",
            "description": "Zimbabwe’s infrastructure development agenda is gaining momentum, with public-private partnerships (PPPs) adopted for road projects and US$2,5 million released to accelerate the construction of Lake Gwayi-Shangani, Finance, Economic development and Investment Promotion Minister, Professor Mthuli Ncube, has said.",
            "time": "08:38",
            "date": "19 Mar 2025"
        },
        {
            "title": "Captains of industry hail taxes, regulatory costs review plans",
            "url": "https://www.herald.co.zw/captains-of-industry-hail-taxes-regulatory-costs-review-plans/",
            "content": "Tapiwanashe Mangwiro\n\nSenior Business Reporter\n\nCAPTAINS of industry and economic analysts have welcomed the Governments plans to streamline taxes and reduce the cost of regulatory compliance, which continue to weigh on the operations and viability of businesses.\n\nThe Confederation of Zimbabwe Industries (CZI), economists, and other business leaders have, for long, pleaded with the Government to streamline taxes and regulatory compliance requirements to reduce the cost of doing business.\n\nCZI chief executive officer (CEO) Ms Sekai Kuvarika said in an interview this week that the industrial lobby group was pleased with the Governments pronouncements regarding the multiplicity of taxes and the cost of regulatory compliance.\n\nMs Kuvarika was reacting to reports that Finance, Economic Development, and Investment Promotion Minister, Professor Mthuli Ncube, planned to review some of the taxes and the regulatory requirements in the next six months.\n\nWe really believed that regulatory reform needed a step change and a directive from His Excellency as Head of State with clear time-bound targets, she said.\n\nRecently, Prof Ncube said: We are undertaking a comprehensive review to streamline our tax and regulatory framework. Our objective is clear; to identify and eliminate unnecessary taxes and regulatory fees that hinder business operations.\n\nAccording to CZI, the business community has been in constant dialogue with the Government over the past few years regarding the various factors that have a bearing on the cost of doing business, which is driven by numerous taxes and the burden of regulatory compliance.\n\nWe noticed the increase in both regulations and regulatory entities over the past 10 years and even hypothesised that in some instances, regulatory authorities may be collecting more revenue from certain companies than Treasury as they collect either on volumes produced or before\n\nproduction.\n\nIn January 2025, the CZI implored the Government to implement radical deregulation measures to cut the high cost of doing business.\n\nCZI said compliance accounted for 18 percent of total overheads, with manufacturing firms required to comply with at least nine regulatory bodies. Businesses are also dedicating significant time and resources, with an average of three full-time employees handling regulatory issues and 10 days per month spent on compliance.\n\nThe business lobby group pointed out that local businesses had to navigate 51 different taxes and regulatory fees, compared to just seven in South Africa.\n\nTo address the situation, CZI proposed a Presidential directive to cut regulatory costs by at least 70 percent by June 2025 and freeze new regulations unless they improve competitiveness.\n\nEconomic analyst Mr Tafara Mtutu said: It is a good thing, Zimbabwes formal sector is laden with a lot of taxes and cutting some of those taxes and removing some altogether has a positive impact on businesses. For one, it will certainly encourage more businesses to become formal.\n\nSecondly, it will also help the formal sector become more competitive in comparison to the informal sector.\n\nMr Mtutu believes it becomes a win-win situation, at both micro and macro levels.\n\nEconomist Gladys Shumbambiri-Mutsopotsi welcomed the Governments plans but called for a balanced approach.\n\nReducing regulatory fees and licensing costs is a positive step towards easing the cost of doing business in Zimbabwe, she noted.\n\nHowever, the Government must ensure that in streamlining these fees, essential oversight and quality standards are not compromised. The key challenge will be maintaining efficiency in revenue collection while fostering a more investor-friendly environment.\n\nShe also emphasised the importance of transparency in the process.\n\nBusinesses need clarity on which fees will be scrapped and which will remain. A continued consultation process with the private sector will be crucial in ensuring these reforms have a meaningful impact.\n\nEconomist Enoch Rukarwa believes the move will free more funds for companies to use in their operations.\n\nThe measure will most likely induce cashflow relief for companies in the short to medium term all things being equal which can create space for reinvestment, boost profitability and overall operations, he said.\n\nAccording to Ms Kuvarika, Minister Ncubes tax and regulatory compliance reform proposals would provide a clear and positive direction for the Zimbabwean business environment and hopefully, some changes will take much less than six months.\n\nCZI said it considered the review of taxes and the cost of regulatory compliance a priority and the foundation for industrial transformation.\n\nMinister Ncube emphasised the need to create a dedicated committee to oversee this reform initiative.\n\nWe are focused on aligning our business licensing and tax requirements with international standards, he said. This entails reducing the number of steps and licenses required to start and operate a business.\n\nThe industry lobby group warned that Zimbabwe risked losing investment to neighbouring countries under the African Continental Free Trade Area (AfCFTA) if issues relating to taxes and regulatory compliance are not addressed.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/01/Ms-Sekai.jpg",
            "description": "CAPTAINS of industry and economic analysts have welcomed the Government’s plans to streamline taxes and reduce the cost of regulatory compliance, which continue to weigh on the operations and viability of businesses.",
            "time": "08:38",
            "date": "19 Mar 2025"
        },
        {
            "title": "Farmers assured of non-stop electricity, water supplies",
            "url": "https://www.herald.co.zw/farmers-assured-of-non-stop-electricity-water-supplies/",
            "content": "Wallace Ruzvidzo\n\nHerald Reporter\n\nFARMERS have been assured of uninterrupted electricity and water supplies during the forthcoming winter cropping season.\n\nIn terms of electricity, 150MW will be ring-fenced to ensure non-stop supplies, up from 120MW during last years winter cropping season.\n\nRegarding water for irrigation, 151 major dams have been monitored to assess their irrigation capacity with dam levels standing at 88,5 percent full, compared to 82 percent this time last year.\n\nResponding to a question posed by The Herald at yesterdays post-Cabinet media briefing, Lands, Agriculture, Fisheries, Water and Rural Development Minister, Dr Anxious Masuka, said farmers should not worry about electricity supplies in the coming season.\n\nHe said Energy and Power Development Minister July Moyo was also working flat out to ensure Hwanges Units 7 and 8, are available by March 29.\n\nOf the 21 enablers that we track for winter especially, number one is power; the assurance of uninterrupted supply of electricity.\n\nLast year, we had 120MW ringfenced for use by farmers. This year, this has increased to 150MW.\n\nDr Masuka said an Inter-Ministerial Taskforce on Power working to establish the wheat growing clusters, is in place to ensure dedicated supply.\n\nAdditionally, farmers are supplying the GPS coordinates of their meters so that ZESA can work with them to ensure that there is an uninterrupted power supply, he said.\n\nYou will note that generation at Kariba is also currently at 500MW a day, and that will really go a long way in ensuring that the winter season will proceed as planned.\n\nOn water supplies, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere said to effectively support the 2025 winter plan, 151 major dams were monitored to verify existing irrigation capacities.\n\nAs at 13 March 2025, dams across the countrys 10 provinces are 88,5 percent full. The average national levels are above the 82 percent recorded during the same time last season, he said.\n\nThe 2025 winter cereal production target for three major crops is 135 250 hectares, with wheat on 120 000 hectares, barley 6 500 hectares and Irish potatoes 8 750 hectares.\n\nDr Muswere said the wheat plan aims to produce 600 000 tonnes, surpassing the national annual requirement of 360 000 tonnes, barley 39 000 tonnes and potatoes 263 250 tonnes.\n\nTo ensure the plans success, Government will closely monitor 21 critical enablers, including power, water, seed, fertiliser and fuel, financial support enablers comprising farmer payments, finance, and insurance; operational efficiency enablers comprising mechanisation, coordination and contract farming; risk management enablers comprising migratory pests, land issues, security, and veld fire management; as well as other enablers such as capacity-building, the policy regulatory environment, soil management, marketing, and monitoring and evaluation.\n\nA whole-of-Government and indeed, a whole-of-sector approach, will be used to achieve the set target, he said.\n\nMeanwhile, Dr Muswere said Cabinet received and noted the report on the Food Deficit Mitigation Programme, as presented by Public Service, Labour and Social Welfare Minister, Edgar Moyo.\n\nThe 4th Blitz Food Distribution exercise is underway and will continue to cushion the most vulnerable food insecure households as they await harvest of their produce.\n\nNationally, a cumulative total of 45 513,23 metric tonnes of grain has been distributed to the communities in need under the exercise.\n\nIn addition, the cumulative distribution under the Zunde raMambo/Isiphala SeNkosi stands at 4 372.51 metric tonnes of grain. Processes are underway to replenish grain stocks allocated to the Chiefs.\n\nMeanwhile, the Cash-for-Cereal Programme continues, Dr Muswere said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Untitled-49.jpg",
            "description": "FARMERS have been assured of uninterrupted electricity and water supplies during the forthcoming winter cropping season.",
            "time": "08:38",
            "date": "19 Mar 2025"
        },
        {
            "title": "‘DRC conflict resolution to come from within’",
            "url": "https://www.herald.co.zw/drc-conflict-resolution-to-come-from-within/",
            "content": "Blessings Chidakwa\n\nHerald Reporter\n\nAS violence continues unabated in eastern Democratic Republic of Congo (DRC), African regional blocs are intensifying efforts to find a lasting solution, relying on home-grown strategies rather than international interventions.\n\nThe renewed push for a unified African-led approach signals a shift away from external involvement, with hopes that regional leadership will finally bring peace to the resource-rich but war-torn nation.\n\nThis was revealed in Harare yesterday during a tour of Liberation City, which houses the Museum of African Liberation, by the East African Community (EAC) Secretariat Executive.\n\nEAC Executive Secretary, Veronica Nduva, said: We just concluded a very good ministerial meeting between EAC and the Southern African Development Community (SADC) on the situation in the DRC.\n\nSpeaking on the ongoing crisis, EAC Deputy Secretary General Andrea Ariik stressed the need for collaboration between regional organisations, adding that the key to peace lies with the Congolese people themselves.\n\nHe said the conflict, driven by a mix of national, regional, and international players, remains complex.\n\nThe problem in the DRC is not only Congolese. It has so many players, national players, regional players, and international players. So, its a bit complicated, but the way forward is for the Congolese to come together, discuss their issues, and reach an agreement.\n\nWe dont expect solutions to come from the international community. African problems must be addressed by Africans, and in this case, the Congolese must talk to each other and find a solution, Mr Ariik said.\n\nHe said their duty was to facilitate discussions among Congolese groups.\n\nOur duty is also to be there as guarantors as they build trust among themselves.\n\nMr Ariik acknowledged that while the conflict in the DRC has persisted for a long time, regional blocs remain committed to addressing it.\n\nEAC is trying, SADC is trying, but now we have decided to merge our efforts and work together, because our focus is on stabilising the security situation in the DRC, and our leaders are determined to resolve the problem, he said.\n\nWhile SADC and EAC have previously operated independently in peacekeeping and mediation efforts in the DRC, officials now believe a joint approach will be more effective.\n\nThe conflict, pitting DRC government forces against the armed M23 group, has resulted in thousands of deaths and the displacement of millions, including women, children, people with disabilities, and the elderly.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Untitled-48.jpg",
            "description": "AS violence continues unabated in eastern Democratic Republic of Congo (DRC), African regional blocs are intensifying efforts to find a lasting solution, relying on home-grown strategies rather than international interventions.",
            "time": "08:38",
            "date": "19 Mar 2025"
        },
        {
            "title": "Court hears how slain Byo cop met her fate",
            "url": "https://www.herald.co.zw/court-hears-how-slain-byo-cop-met-her-fate/",
            "content": "Peter Matika\n\nBulawayo Bureau\n\nIN a shocking turn of events, a Bulawayo court yesterday heard that Detective Constable Cassandra Hove tragically died when a bullet ricocheted off a suspected armed robber and struck her on the left breast.\n\nThe incident occurred during a covert operation in Pumula South suburb early this month.\n\nThe case has captured the nations attention with its surprising developments, after a police detective stationed at Hillside Police Station, Nomore Muradzikwa (37), allegedly confessed to the fatal shooting.\n\nMuradzikwa yesterday appeared before Bulawayo magistrate Mr Maxwell Ncube on charges of murder.\n\nHe was not asked to plead and remanded in custody to April 1.\n\nMuradzikwa, who was being represented by Mr Tinashe Tashaya of Sengweni Legal Services, was advised to apply for bail at the High Court of Zimbabwe in Bulawayo.\n\nMs Nkanyezi Xaba represented the State.\n\nAccording to the State outline, the fatal shooting occurred on March 6 when Muradzikwa and the late Hove were part of a team engaged in a covert operation to apprehend suspected armed robbers in Pumula South.\n\nThe accused was armed with a CZ pistol serial number BSAP 44 when he advanced towards Fikile Ncube aged 26, a male adult, NR 28-160313 K 28 residing at house number 14804 Pumula South, Bulawayo, a suspect in a robbery case investigated by CID Homicide, Ms Xaba told the court.\n\nHe cocked his firearm and shot at him hitting him once on the left elbow after which the bullet ricocheted and hit the deceased once on the left breast, resulting in her death, read the State outline.\n\nMuradzikwa was escorted into the courts by detectives from CID Homicide yesterday morning, with the matter only being heard in the afternoon.\n\nHowever, some of Hoves family members who attended the court hearing said they only learnt of Muradzikwas alleged confession through social media.\n\nThey also expressed dissatisfaction with the police whom they accuse of not informing them of the developments.\n\nMr Abias Hove, a brother to the late Cassandra, said it would have been prudent for the police to notify them so that all relatives could attend court to hear the series of events of that night.\n\nWe just learnt of this today after seeing the developments on online papers and social media. Procedurally I thought police should inform us about this, but we are disappointed that they did not do so, said Mr Hove.\n\nHe said there were many questions that needed answers to put their hearts and minds at ease.\n\nIts disenchanting that this man only confessed now, two weeks after the death of our sister. Where and what was he doing all this time?\n\nWhat were the police doing? There are a lot of questions that need to be answered, said Mr Hove.\n\nThe late Hove died at the age of 37 and is survived by four children. A member of Bulawayos elite all-female CID unit known as Team Lozikeyi, she was buried at her rural home in Mataruse Village, Mberengwa District in the Midlands Province.\n\nThe incident occurred around 8.40pm in the Habbek area of Pumula South suburb, where initial reports suggested that Hove and her colleagues were pursuing suspects involved in a series of armed robberies.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/unnamed-file.jpg",
            "description": "IN a shocking turn of events, a Bulawayo court yesterday heard that Detective Constable Cassandra Hove tragically died when a bullet ricocheted off a suspected armed robber and struck her on the left breast.",
            "time": "08:38",
            "date": "19 Mar 2025"
        },
        {
            "title": "Benin eye Warriors’ scalp",
            "url": "https://www.herald.co.zw/benin-eye-warriors-scalp/",
            "content": "Zimpapers Sports Hub\n\nBENIN gaffer and former Nigeria Super Eagles coach, Genort Rohr, has expressed his desire to retain their spot at the top of the 2026 World Cup football qualifying Group C as marathon resumes with the Match-day five and six assignments starting tomorrow.\n\nRohr has also literally dared the Warriors, refusing to consider them a factor in the bid for World Cup qualification.\n\nInstead, the veteran coach has installed South Africa as his favourites, while insisting that his Benin are in no mood to let-up on joint top spot as they step up to face a Warriors side still in buoyant mood after a fine 2025 Africa Cup of Nations qualification campaign.\n\nThe Cheetahs might be in third place but they are joint leaders in a cagey Group C that has Rwanda as the surprise leaders ahead of South Africa with the trip all on seven points but separated by goal difference.\n\nZimbabwe anchor the group standings with two points from four matches while giants and pool favourites Nigeria are a rung above them with three and Lesotho sit on fourth place with five.\n\nAs the race for places at the World Cup, to be jointly hosted by the United States, Mexico and Canada resumes, Rohrs team will be in Durban, South Africa, tomorrow for a date with the Warriors at Moses Mabhida stadium (6pm).\n\nBenin just like the Warriors and Lesotho do not have a stadium that meets the Confederation of African Football standards and the Cheetahs have been using their adopted home in Abidjan, Cote dIvoire, where they will clash against South Africa days after meeting Zimbabwe.\n\nThe Warriors on their part will head to Uyo, soon after tomorrows game to take the Super Eagles next Tuesday\n\nBut as his charges prepared for their first meeting with the Warriors, Rohr, who will have a battle of wits with fellow German Michael Nees, spoke about tomorrows key encounter.\n\nRohr said he was surprised to see his team among the leaders but fancies their chance to stay top at the end of the incoming international window.\n\nIt is really a surprise that we (Benin), Rwanda and South Africa are the leaders after the four opening rounds of matches in this tough Group C, Rohr said via Nation Sports.\n\nWe won our two last games in Abidjan and now we are going to play away (against Zimbabwe in Durban) and the next against South Africa in Abidjan on March 25.\n\nIt may be a surprise but we are here (top of Group C) and we want to stay here and do even better.\n\nAfter four matches, Rohrs men have won two matches including a stunning 2-1 win over Nigeria last June.\n\nThey have also drawn one match while also losing once.\n\nThe Super Eagles have so far failed to win any match in the series and join Zimbabwe in that unwanted record.\n\nUnder new coach Eric Chelle, the Super Eagles will also face Rwanda in Kigali on Friday, before they host the Warriors in Uyo.\n\nWhile he might be in charge of Beni, Rohr has actually installed Bafana Bafana as group favourites and says South Africa are in a better position to qualify for the even ahead of his former side Nigeria.\n\nSouth Africa, who finished third at the last Africa Cup of Nations in Cote dIvoire, are only second on the current World Cup Group C standings behind Rwanda due to an inferior goal difference.\n\nRohr reckoned that while the Super Eagles and South Africa are the favourites, the latter hold a better chance of making it to the World Cup ahead of his former side despite admitting that both teams have quality players in their ranks.\n\nSouth Africa and Nigeria are the favourites in this Group C, and I quite agree, said the German coach upon touching down in South Africa for their clash against Zimbabwe at the Moses Mabhida Stadium, according to NationSports.\n\nThey can win the group when you look at the quality of their players, even though some of them are not even playing regularly (with their clubs) because they are not fit enough.\n\nYou can say they are favourites, especially South Africa, but we shall see. But for us, we are preparing well.\n\nWe are already here in Durban with some players already, and more coming in tomorrow (today); so, we have started preparations already.\n\nIt was a long trip to Durban, and we had about a six-hour stopover in Johannesburg before we connected to Durban, but we are expecting about four more players tonight. soccernetng/punchng\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Untitled-45.jpg",
            "description": "BENIN gaffer and former Nigeria Super Eagles coach, Genort Rohr, has expressed his desire to retain their spot at the top of the 2026 World Cup football qualifying Group C as marathon resumes with the Match-day five and six assignments starting tomorrow.",
            "time": "08:38",
            "date": "19 Mar 2025"
        },
        {
            "title": "EDITORIAL COMMENT : Africa must take responsibility for its own health",
            "url": "https://www.herald.co.zw/editorial-comment-africa-must-take-responsibility-for-its-own-health/",
            "content": "IT has now become urgent for Africa to take full responsibility for its health affairs, leveraging on the continents high levels of training of professional staff and the large internal continental market to support a high-end pharmaceutical and vaccine industry.\n\nPresident Mnangagwa spoke on the changes when he was discussing SADCs unanimous choice of the best candidate to be the next regional director for the World Health Organisation Africa Region, a post that has become a lot more important as the continent needs to fill the gaps caused by declining levels of international aid.\n\nAfrica has been very reliant on development partners when it comes to financing for health, although almost all staff from community health worker level to the highest levels of specialist physicians and surgeons are African.\n\nMost of these have had at least much of their training in Africa even if they were some spending time outside the continent seeking the most advanced skills. But those have been bringing back those skills and training their compatriots, so Africa is largely self-sufficient in skills.\n\nThe gaps are largely financial, plus partly in the research areas over new diseases. The continent also needs to build up a substantial pharmaceutical industry and ensure that most equipment and health materials can be made in Africa. Any imported equipment can be maintained in Africa by local technical staff.\n\nTo a degree Africa has been fortunate. Support for health services and emergency food support do top the agendas of foreign development partners, so Africa has been backed by these partners. But it now seems likely that such support will be at a much lower level, at least in total. The US withdrawal from WHO will obviously affect that organisations ability to support Africa without more support from African countries.\n\nIn 2001, African Heads of State and Government pledged the Ajuba Declaration on continental health, a declaration that still makes very good sense. Among other measures it set a target of a minimum of 15 percent of national budgets being allocated to health, to close the obvious major gap and one where Africa was probably over-reliant on external support.\n\nThe percentage might have been somewhat arbitrary but it was set taking into account that most health services in Africa need a high level of State support, rather than being built around the private sector. So African countries needed to talk about health budgets rather than the percentage of GDP spent on health.\n\nThe declaration was also made as the full extent of the HIV pandemic had become apparent, and the need for major resources there. But on a more positive note it had also come after one of the most spectacular decades in the upgrade in primary health and the huge advances seen from the late 1980s as universal vaccination for a wide range of childhood illnesses backed by some basic primary health had more than halved infant mortality rates.\n\nThe combination of a need for more money, but also the promise of major gains as money was spent more precisely with respectable budgets for preventing disease rather than just reacting to disease, made sorting out the continental health finances very worthwhile. In 2001, no African country was close to 15 percent of its budget allocated to health, and the percentage seemed ambitious. Since then African countries have been pushing up the percentages, with Zimbabwe among the leaders now on 13 percent. The target no longer seems over-ambitious or out of reach and in fact might even be found to be on the low side once it has been achieved.\n\nAlong with more money raised from its own resources, Africa also needs to maximise the bang for the buck of that extra money, and here a more continental approach is required.\n\nThere are islands of pharmaceutical industry on the continent, but a lot more could be done with a continental approach to fill the continental market. Some common medications can be made in just about every country. Some might need the huge markets of entire regions or even the continent as a whole before manufacturing is viable and the cost of those medicines is as low as possible.\n\nIndia has become a giant in the global pharmaceutical industry, supplying a large percentage of the generic drugs around the world. Having that huge home market as a starting point must have been a major plus. The African market is of comparable size and while many countries have only modest populations, between us we can support a very full pharmaceutical industry.\n\nThis industry also needs to ensure that Africa is self-sufficient in all vaccines, and can move forward in research for new vaccines. We at least have learned the incredible value of vaccination for so many diseases, such as far fewer graves for children, that we need to be in the forefront of research even if others want to back out.\n\nDisease research has not been a major priority in Africa, despite outbreaks of new diseases like ebola or mpox and the likelihood of other such crossover diseases from remote animal populations. Again such research will be far more effective when done on a continental scale rather than by an affected country with some modest support from a development partner.\n\nAnd we need to be practical. The research is likely to be better when it is directed by top-end scientists whose relatives are more likely to be infected, and paid for by Governments who are hurriedly working out the far higher costs of doing nothing.\n\nAgain this is something that the new WHO Africa director needs to take in as part of their duties and as part of converting the post into an effective co-ordinator of African health initiatives, so that the continent can assume the responsibility it must now take on.\n\nWe do not have to be reliant on others, although any support they offer will be gratefully received, but we do have to be exceptionally efficient in how we use the resources we can mobilise and must mobilise internally, and that requires this efficiency at both national and continental levels. So the search and the endorsement of a new WHO Africa director is important as we need the right professional. President Mnangagwa once again saw the critical point.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/01/Africa.jpg",
            "description": "IT has now become urgent for Africa to take full responsibility for its health affairs, leveraging on the continent’s high levels of training of professional staff and the large internal continental market to support a high-end pharmaceutical and vaccine industry.",
            "time": "08:38",
            "date": "19 Mar 2025"
        },
        {
            "title": "Art, digitalisation to empower Mbare youths",
            "url": "https://www.herald.co.zw/art-digitalisation-to-empower-mbare-youths/",
            "content": "Tafadzwa Zimoyo\n\nEntertainment Editor\n\nFollowing our published feature last week titled Mbare Youths Use Mural Art To Combat Drug Abuse The Mbare Renewal Projects have gained significant attention after a visit from Minister of Information Communication Technology, Postal and Courier Services, Tatenda Mavetera.\n\nThe minister endorsed their innovative approach to revitalising the community through art and a newly established computer lab, highlighting the critical role of digital literacy in combating drug abuse among the youth.\n\nTransforming Block 8 of Matapi into a colourful canvas of mural art, the Mbare Renewal Projects have taken a bold step in addressing pressing social issues.\n\nThis initiative not only beautifies the community but also serves as a powerful tool for engaging young people. With over a hundred families residing in the area, the murals reflect themes of hope and resilience, aiming to inspire the youth to embrace a brighter future.\n\nLast week marked a significant milestone for the project as they opened a free computer lab designed to empower local youths through digital literacy.\n\nMinister Mavetera expressed her enthusiasm during the tour, emphasizing the importance of such initiatives in fostering a sense of purpose and direction among young people.\n\nWe are here to represent the interest of the youth, and I am pleased with what I see; not one face is showing signs of drug abuse. You are taking the lead in revitalising and empowering each other, she stated, praising the commitment of the Mbare community.\n\nThe emphasis on digitalisation is particularly crucial in todays rapidly evolving world.\n\nMinister Mavetera highlighted the necessity for the Mbare community to embrace technology, noting that the future will increasingly rely on digital tools and platforms.\n\nYoung people are dying because of drug abuse. Mbare community needs to be digitalised; we need to start now appreciating the phenomenon, she insisted, reinforcing the idea that digital skills can provide pathways to better opportunities and healthier lifestyles.\n\nChairperson of the Mbare Renewal Projects, Oliver Olembe Vellem, echoed these sentiments, illustrating how art and technology can be intertwined to create a meaningful impact.\n\nVellem, who leads a dedicated team of nine youths, is passionate about restoring the communitys spirit through artistic expression while addressing the rising tide of drug abuse and theft.\n\nIt started as a dream, and we are using mural art to fight drug abuse in our community. As we speak today, a day does not pass without a young man or woman visiting our premises, admiring the art and wanting to understand what it means, he shared.\n\nThe murals not only serve as eye-catching artworks but also as conversation starters, allowing the team to engage with the youth about the dangers of drug use. Through these interactions, Vellem and his team provide rehabilitation support and guidance, encouraging young people to channel their energy into creative pursuits instead of harmful behaviors.\n\nThe newly opened computer lab is pivotal in this vision, offering training programs that cover basic computer skills, online safety, and digital citizenship. These skills empower young individuals to navigate the digital landscape effectively, enhancing their employability and career prospects.\n\nWe have partnered with the Ministry of ICT, Postal and Courier Services Zimbabwe, encouraging the youths to participate in a free computer training program, Vellem explained. By tapping into their creativity, participants can explore their feelings, gain insights into their addiction, and develop new coping skills.\n\nThe Mbare Renewal Projects aim to complete all mural installations by the end of the year, with hopes of significantly reducing drug abuse in the community by 2030. Their commitment to merging art and education provides a unique model for other communities facing similar challenges.\n\nResearch shows that drug abuse is a pervasive issue that affects millions worldwide, wreaking havoc on individuals and families alike. The Mbare Renewal Projects stand as a beacon of hope, demonstrating that through creativity and digital engagement, communities can come together to forge a brighter, drug-free future.\n\nBy promoting art and digital literacy, the Mbare Renewal Projects are not only transforming their environment but also empowering the next generation to make informed choices, ultimately steering them away from the perils of drug abuse.\n\nThe synergy of art and technology proves to be a powerful antidote to the challenges faced by todays youth, paving the way for a healthier, more vibrant community.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Untitled-40.jpg",
            "description": "Following our published feature last week titled ‘‘Mbare Youths Use Mural Art To Combat Drug Abuse’ The Mbare Renewal Projects have gained significant attention after a visit from Minister of Information Communication Technology, Postal and Courier Services, Tatenda Mavetera.",
            "time": "08:38",
            "date": "19 Mar 2025"
        }
    ]
}