{
    "news": [
        {
            "title": "Zim, Afghanistan ODI match abandoned",
            "url": "https://www.herald.co.zw/zim-afghanistan-odi-match-abandoned/",
            "content": "Zimpapers Sports Hub\n\nTHE first ODI between Zimbabwe and Afghanistan at Harare Sports Club has been abandoned due to persistent rain.\n\nThe contest had been reduced to 28 overs aside after the toss was delayed by almost four hours due to the showers that started early in the morning.\n\nAfghanistan won the toss and put Zimbabwe in to bat first when the showers stopped around midday.\n\nBut only 9.2 overs were bowled when the rains returned in the afternoon. This forced officials to abandon the match. Zimbabwe had started on the backfoot after sliding to 44/5.\n\n",
            "image_url": null,
            "description": "Zimpapers Sports Hub THE first ODI between Zimbabwe and Afghanistan at Harare Sports Club has been abandoned due to persistent rain. The contest had been reduced to 28 overs aside after the toss was delayed by almost four hours due to the showers that started early in the morning. Afghanistan won the toss and put […]",
            "time": "21:07",
            "date": "17 Dec 2024"
        },
        {
            "title": "Mudslinging, namedropping intensify ahead of ZIFA polls",
            "url": "https://www.herald.co.zw/mudslinging-namedropping-intensify-ahead-of-zifa-polls/",
            "content": "Tadious Manyepo\n\nSports Reporter\n\nZIFA presidential candidates seem to be on an audacious bid to elbow each other off the race at a time when vetting of their credentials by authorities is in full-throttle.\n\nThe polls to usher in a new ZIFA executive will be held on January 25 but all prospective runners in the election from presidential to board members are being assessed by a team of experts with the final list of those who would have come out clean to be released on December 23.Thereafter, the campaigns will be fully blown.However, with up to 10 presidential aspirants having thrown their names into the hat, individuals have been popping up to object the candidature of certain aspirants who they want disqualified.The objections are targeting the three front-runners in the election, including Martin Kweza, Philemon Machana and Walter Magaya.Yesterday, a Terrence Pachirere wrote to the ZIFA Ethics and Integrity Committee objecting to the nomination of Kweza whom they are accusing of having had some legal issues at his workplace, which was then put under investigation.No conviction in any criminal matter was levelled against Pachirere.One K Mugadzaweta is also requesting for an investigation into some financial misconduct by Machana, who is one of the favourites.The letter dated 13 December and addressed to the Zimbabwe Anti-Corruption Commission Chair raised a litany of allegations against Machana, purportedly committed when he was still on the ZIFA board between December 2018 and November 2021.Machana and some of his colleagues from that ZIFA board were recently acquitted of various charges, some of which were related to those raised in the letter in question.In the same vein, Magayas nomination is also being objected by one M Chigwedere who says the Prophetic, Healing and Deliverance Ministries leader was once convicted and has other cases before the courts.However, ZIFA Normalization Committees legal brains Nyasha Sanyamandwe, in laying out the expectations of the authorities to those who were eager to enter the race, said they would follow the ZIFA Disciplinary and Ethics Code to come out with a determination pertaining to the elimination of candidates.As ZIFA, we have got the Disciplinary and Ethics Code and we have since put it in the nomination forms. Candidates should declare that they have not been convicted of any offense. The answer that we wanted from that nomination form is a yes or a no. If its a yes, then you include a bit of notes to at least explain what offences you were convicted of, said Sanyamandwe.The code will guide us but we also need to be guided by Art: 24 Para 8 of the ZIFA statutesSo we will look into those offences and also in our criminal jurisprudence, we know there are minor and major offences, surely a road traffic accident will not stop someone from running for the election. So the ethics committee will assist us in completing that eligibility test or interpreting the ethics code.Other ZIFA presidential aspirants include Nqobile Magwizi, Themba Mliswa, Benjani Mwaruwari, Makwinji Soma-Phiri, Twine Phiri, Martial Gore and Farai Jere.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/05/ZIFA-680x380.jpeg",
            "description": "Tadious Manyepo Sports Reporter ZIFA presidential candidates seem to be on an audacious bid to elbow each other off the race at a time when vetting of their credentials by authorities is in full-throttle. The polls to usher in a new ZIFA executive will be held on January 25 but all prospective runners in the […]",
            "time": "21:07",
            "date": "17 Dec 2024"
        },
        {
            "title": "Sunshine City lights on for Christmas",
            "url": "https://www.herald.co.zw/sunshine-city-lights-on-for-christmas/",
            "content": "Obey Musiwa and Nyasha Motsi\n\nHerald Reporters\n\nHarare residents assembled at Africa Unity Square yesterday to witness the Christmas lights switching-on ceremony.\n\nThe evenings festive mood reached its apex as Harare Mayor Jacob Mafume initiated a 10-second countdown, culminating in the Christmas lights mesmerising display of colours all-over the garden.\n\nMayor Mafume emphasised the importance of the seasons mood and reminded the gathering of the upcoming celebrations.\n\nWe are gathered here to mark the beginning of this years festive season and the mood we have witnessed here needs to go into the next few weeks as we celebrate the birth of our Lord Jesus Christ, he said.\n\nLet me remind you that as we work to create light for others, we naturally light our own way, said the Mayor.\n\nCity of Harares Information and Publicity Committee chairman Mr Happymore Gotora said the lights signify more than just a holiday but represent the birth of Jesus Christ.\n\nAs we begin this festive season, we need to appreciate the significance of this event, and I am more than happy to do so as I am a pastor.The lights switched on today (Monday) symbolise more than just a holiday, they represent the celebration of our Lord Jesus Christ who br\n\nought us hope for everlasting life.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/WhatsApp-Image-2024-12-17-at-14.00.36-680x380.jpeg",
            "description": "Obey Musiwa and Nyasha Motsi Herald Reporters Harare residents assembled at Africa Unity Square yesterday to witness the Christmas lights switching-on ceremony. The evening’s festive mood reached its apex as Harare Mayor Jacob Mafume initiated a 10-second countdown, culminating in the Christmas lights’ mesmerising display of colours all-over the garden. Mayor Mafume emphasised the importance […]",
            "time": "21:07",
            "date": "17 Dec 2024"
        },
        {
            "title": "Zimbabwe unlocks 200 investment opportunities through sports",
            "url": "https://www.herald.co.zw/zimbabwe-unlocks-200-investment-opportunities-through-sports/",
            "content": "Herald Reporter\n\nZimbabwe has unlocked more than 200 investment opportunities by marketing the country through sports at the ongoing T10 tournament in Sri Lanka.\n\nSpeaking from Sri Lanka, T Ten Global Sports chairman, Shaji Ul Mulk said Zimbabwe has managed to capture the limelight on the international stage.\n\nWe have received more than 200 investment inquiries, which we are processing and working with Dr Paul Tungwarara (Special Presidential Investment Advisor) to bring the investors to Zimbabwe. This has been a very successful programme.\n\nIn a very short time, the world has woken up to the possibilities of the investments of Zimbabwe in all industries  mining, agriculture, ICT, manufacturing, etcetera. So l think next year we will see a lot of delegations coming to Zimbabwe, he said.\n\nDr Tungwarara said Zimbabwe will continue to leverage on international platforms to showcase its enormous economic potential.\n\nOur gratitude goes to His Excellency President Dr Mnangagwa for giving us the opportunity to amplify Zimbabwes profile and economic prospects.\n\nThe number of investment inquiries coming is proof that the country is on the right path, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/open-680x380.png",
            "description": "Herald Reporter Zimbabwe has unlocked more than 200 investment opportunities by marketing the country through sports at the ongoing T10 tournament in Sri Lanka. Speaking from Sri Lanka, T Ten Global Sports chairman, Shaji Ul Mulk said Zimbabwe has managed to capture the limelight on the international stage. “We have received more than 200 investment […]",
            "time": "21:07",
            "date": "17 Dec 2024"
        },
        {
            "title": "Community-built school opens in Mwenezi",
            "url": "https://www.herald.co.zw/community-built-school-opens-in-mwenezi/",
            "content": "George Maponga in Mwenezi\n\nCommunity members in Joseph Village pooled resources to build a school in their area under the Joseph Institute of Development.\n\nRixile Primary School has since opened its doors to learners and has an enrolment of 80 pupils in Early Childhood Development up to Grade 2.\n\nThe development has improved the education system in Joseph Village and surrounding areas.\n\nGuests follow proceedings at the Joseph Institute of Development (JID) during the official opening of Rixile Primary School which was built by JID in Joseph village under Chief Negari in Mwenezi.\n\nEconet chief executive officer Dr Douglas Mboweni and his wife Mrs Sarudzayi Mboweni are part of those who contributed towards the construction of the state-of-the-art facility.\n\nLearners at the school have access to computers at the school, which has revolutionised education in the area.\n\nThe school is currently operating as a satellite of the nearby Mutande Primary School, with plans to get it registered next year.\n\nRixile is a Shangaan word that means its dawn.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/mboweni-680x380.png",
            "description": "George Maponga in Mwenezi Community members in Joseph Village pooled resources to build a school in their area under the Joseph Institute of Development. Rixile Primary School has since opened its doors to learners and has an enrolment of 80 pupils in Early Childhood Development up to Grade 2.   The development has improved the […]",
            "time": "21:07",
            "date": "17 Dec 2024"
        },
        {
            "title": "Northside Community Church food pantry initiative brings hope to local families",
            "url": "https://www.herald.co.zw/northside-community-church-food-pantry-initiative-brings-hope-to-local-families/",
            "content": "Peter Tanyanyiwa\n\nHerald Correspondent\n\nThis festive season, Northside Community Church in Borrowdale has launched its Food Pantry Ministry to support families in need within the church and the wider Harare community.\n\nThe initiative, which began a few years ago, has significantly expanded its reach, and now provides food hampers to over 300 families.\n\nPastor Verengerai Mavesere said: We started this to help our members who are going through rough patches. When they are in need, they can shop for foodstuffs from our pantry for free. As they get back on their feet, we hope they will stop coming. This gives a smile to those in need.\n\nThis year, we aimed to provide 300 hampers to families in need, said Pastor Mavesere.\n\nThe church has partnered with Zimworks, thereby enabling them to maximize their impact.\n\nIn addition to the food pantry, the church is also focusing on womens empowerment through a sewing project that produces sanitary wear.\n\nInstead of just giving them fish, we want to give them the fishing rod that empowers them, Pastor Mavesere said.\n\nMr Louis Mnyama expressed his support for the initiative.\n\nThe hampers for the needy is part of our commitment to lightening the load for those struggling during the festive season. Many people are going through difficult times, and it is our role to step up and lend a hand, said Mr Mnyama.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/vengerai-2-680x380.png",
            "description": "Peter Tanyanyiwa Herald Correspondent This festive season, Northside Community Church in Borrowdale has launched its Food Pantry Ministry to support families in need within the church and the wider Harare community. The initiative, which began a few years ago, has significantly expanded its reach, and now provides food hampers to over 300 families. Pastor Verengerai […]",
            "time": "21:07",
            "date": "17 Dec 2024"
        },
        {
            "title": "42 gender champions fight GBV in Mbire",
            "url": "https://www.herald.co.zw/42-gender-champions-fight-gbv-in-mbire/",
            "content": "Fungai Lupande\n\nMashonaland Central Bureau\n\nForty-two men and women who volunteered to fight gender-based violence in Mbire District have been honoured for their dedication.\n\nThe group recently completed the Start Awareness Support Action (SASA) programme which was being spearheaded by Katswe Sistahood with support from the National AIDS Council (NAC).\n\nThe project was praised for fighting violence against women.\n\nMbire District Development Coordinator, Mr George Nyarugwe said the SASA champions and Katswe Sistahood have been doing incredible work.\n\nWe recognise the unwavering commitment, resilience, and courage that the SASA champions exhibited in the fight against GBV, he said.\n\nKatswe Sistahood played a significant role in complementing Government efforts to address the pressing issue. Many GBV cases remain unreported as cultural norms and societal attitudes mostly perpetuate violence against women and girls.\n\nHe said GBV hinders community development, and the stigma surrounding it often leaves survivors isolated and with no access to crucial support.\n\nOne of the gender champions, Mrs Chipo Jongoro said the programme initially faced resistance as the empowerment of women was viewed as a threat.\n\nShe said SASA champions had to introspect and become the change they wished to see in the community.\n\nCommunities initially resisted because violence against women and girls was seen as normal. However, with the support from chiefs, the Ministry of Women Affairs, and Katswe Sistahood, we began to notice some changes, she said.\n\nMiss Chengetai Chininga, head of operations at Katswe Sistahood, said the 42 gender champions volunteered to transform society without expecting any financial gain.\n\nShe said the programme was initially implemented in Wards 2 and 3 before it expanded to Wards 4 and 12.\n\nDue to the high incidence of GBV along the border of Mozambique and Mbire, Wards 5, 13, 14, and 16 have now been selected for the programme, she added.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Screenshot-4-680x380.png",
            "description": "Fungai Lupande Mashonaland Central Bureau Forty-two men and women who volunteered to fight gender-based violence in Mbire District have been honoured for their dedication. The group recently completed the Start Awareness Support Action (SASA) programme which was being spearheaded by Katswe Sistahood with support from the National AIDS Council (NAC). The project was praised for […]",
            "time": "21:07",
            "date": "17 Dec 2024"
        },
        {
            "title": "Armed robbers prowling Bindura",
            "url": "https://www.herald.co.zw/armed-robbers-prowling-bindura/",
            "content": "Fungai Lupande\n\nMashonaland Central Bureau\n\nArmed robbers targeted a Bindura couple and demanded cash through the window before forcing them to open the door.\n\nThis was after the couple had peeped outside after hearing suspicious movements.\n\nAccording to provincial police spokesperson Inspector Milton Mundembe, the incident occurred on December 8 at around 1:30 am.\n\nCarlingtin Zingani and his wife Thelma Gambe were asleep when Gambe heard some noise outside. She woke her husband up, and they peered out to investigate.\n\nThe couple saw three men standing outside, with one of them wielding a pistol. The robber demanded cash through the window. Gambe took her wallet containing US$1 600 and handed it over to the robbers.\n\nThe armed robber then insisted on entering the house for a thorough search. Armed with a pistol and a shovel, the intruders entered and ransacked the house.\n\nAfter failing to find more money, they stole three cellphones.\n\nAs they were leaving, the robbers locked the door from outside and placed the keys on a car that was parked outside.\n\nShortly afterwards at around 1:45 am, the same gang broke into Passmore Antonios house.\n\nOne of the robbers was armed with a black firearm, while another was wielding a hammer and an axe.\n\nAntonio screamed for help and began to wrestle with one of the robbers. However, he was overpowered, and one of the robbers struck him once on the left shoulder with the axe.\n\nThe robbers searched the house and stole US$120 and two cell phones.\n\nAs they exited, they locked the door from outside.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/05/armed-robbers-used-gun-robbery-260nw-1495712093.jpeg",
            "description": "Fungai Lupande Mashonaland Central Bureau Armed robbers targeted a Bindura couple and demanded cash through the window before forcing them to open the door. This was after the couple had peeped outside after hearing suspicious movements. According to provincial police spokesperson Inspector Milton Mundembe, the incident occurred on December 8 at around 1:30 am. Carlingtin […]",
            "time": "21:07",
            "date": "17 Dec 2024"
        },
        {
            "title": "Mazowe man dies after consuming illicit beer",
            "url": "https://www.herald.co.zw/mazowe-man-dies-after-consuming-illicit-beer/",
            "content": "Fungai Lupande\n\nMashonaland Central Bureau\n\nA 42-year-old man from Harmony Compound in Mazowe died after consuming illicit beer.\n\nProvincial police spokesperson, Inspector Milton Mundembe said on December 6 at around 5pm, Chamunorwa Chikaramba arrived at Harmony shops holding illicit beers and appeared to be intoxicated.\n\nHe purchased an energy drink and two more illicit beers.\n\nChikaramba then returned to the compound and went to bed on an empty stomach.\n\nThe following day at around 9 am, he went back to the shops and bought two more illicit beers before leaving.\n\nAfter becoming heavily intoxicated, he fell asleep in a shed within the compound.\n\nAt around 2 pm, Stephen Francis found Chikaramba lying unconscious.\n\nUnfortunately, efforts to resuscitate him were unsuccessful.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/02/death.jpg",
            "description": "Fungai Lupande Mashonaland Central Bureau A 42-year-old man from Harmony Compound in Mazowe died after consuming illicit beer. Provincial police spokesperson, Inspector Milton Mundembe said on December 6 at around 5pm, Chamunorwa Chikaramba arrived at Harmony shops holding illicit beers and appeared to be intoxicated. He purchased an energy drink and two more illicit beers. […]",
            "time": "21:07",
            "date": "17 Dec 2024"
        },
        {
            "title": "“TikTok appeals to US Supreme Court to block looming ban amid national security concerns”",
            "url": "https://www.herald.co.zw/tiktok-appeals-to-us-supreme-court-to-block-looming-ban-amid-national-security-concerns/",
            "content": "TikTok has asked the US Supreme Court to block a law requiring its parent company, ByteDance, to divest the app by January 19 or face a ban. TikTok and ByteDance filed an emergency request to halt the ban while appealing a lower court ruling. The law, passed in April, cites national security concerns due to TikToks data access and content manipulation capabilities.\n\nThe US Court of Appeals for the DC Circuit upheld the law, rejecting TikToks free speech arguments. TikTok argues that users should choose whether to use the app despite risks. The company claims a ban would cause significant user loss and harm its business.\n\nPresident-elect Donald Trump, who previously tried to ban TikTok, has promised to save it. TikTok seeks a Supreme Court decision by January 6 to manage a potential shutdown. The dispute highlights US-China trade tensions. TikTok denies sharing US user data and calls the law a free speech violation.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/08/Court.jpg",
            "description": "TikTok has asked the US Supreme Court to block a law requiring its parent company, ByteDance, to divest the app by January 19 or face a ban. TikTok and ByteDance filed an emergency request to halt the ban while appealing a lower court ruling. The law, passed in April, cites national security concerns due to […]",
            "time": "21:07",
            "date": "17 Dec 2024"
        }
    ]
}