{
    "news": [
        {
            "title": "President celebrates Kirsty Coventry’s historic IOC victory",
            "url": "https://www.herald.co.zw/president-celebrates-kirsty-coventrys-historic-ioc-victory/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nPresident Mnangagwa has hailed the former Minister of Sport, Recreation, Arts and Culture, Kirsty Coventry, for making history as the first African and first female president of the International Olympic Committee (IOC).\n\nSpeaking at a banquet held at State House this evening to celebrate her victory, President Mnangagwa described Coventrys election as a defining moment for Zimbabwe, the SADC region and the entire African continent.\n\nHe praised her for her unwavering dedication to sport, both as a seven-time Olympic medalist and as a transformational leader in Zimbabwes sports administration.\n\nPresident Mnangagwa also said Coventrys journey from the swimming pool to the highest office in global sports governance is proof of her resilience and determination.\n\nYour election is a testament that Africa is ready to lead, he said.\n\nBreaking records is in your nature, and you have done it again.\n\nPresident Mnangagwa\n\nThe President applauded Coventrys role in the development of sports infrastructure, the success of national teams in global competitions and Zimbabwes increasing presence in international sporting events.\n\nPresident Mnangagwa said he is confident that under her leadership, the Olympic movement will thrive, fostering a spirit of excellence, inclusion and unity across nations.\n\nAs a country, we stand proudly behind you, he said. Your success is our success, and we honour you as a symbol of national and continental pride.\n\nThe evening ended in celebration, with Zimbabweans united in recognizing one of their own rising to the pinnacle of global sports leadership.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/5e2e1530-cf62-459b-896b-1e16d3ed4df3-680x380.jpg",
            "description": "President Mnangagwa has hailed the former Minister of Sport, Recreation, Arts and Culture, Kirsty Coventry, for making history as the first African and first female president of the International Olympic Committee (IOC).",
            "time": "21:46",
            "date": "25 Mar 2025"
        },
        {
            "title": "President appoints Lieutenant General Sanyatwe as Minister of Sports",
            "url": "https://www.herald.co.zw/president-appoints-lieutenant-general-sanyatwe-as-minister-of-sports/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nPRESIDENT Mnangagwa has appointed Lieutenant General Anselem Nhamo Sanyatwe as the new Minister of Sport, Recreation, Arts and Recreation following the election of Kirsty Coventry as president of the International Olympic Committee last week.\n\nThe President has also relieved Coventry from her position following last weeks development.\n\nIn a statement, Chief Secretary to the President and Cabinet Dr Martin Rushwaya said the appointment of Lieutenant General Snyatwe is with immediate effect.\n\nIn terms of Section 216 (2) (Command of Defence Forces) as read with Section 340 (1) (f) of the Constitution of Zimbabwe and Section 115 (Commander in Chief Prerogative) of the Defence Act [Chapter 11:02], the President, in his capacity as Commander in Chief of the Defence Forces, has relieved and retired Lieutenant General Anselem Nhamo Sanyatwe from the Zimbabwe Defence Forces and as Commander of the Zimbabwe National Army with immediate effect, reads the statement.\n\nAnd in terms of Section 104 (3) of the Constitution, he appoints Lieutenant General (Rtd) Anselem Nhamo Sanyatwe as Minister of Sport, Recreation, Arts and Culture with immediate effect.\n\nIn a separate statement, Dr Rushwaya said: Acting in terms of Section 108 (1) (a) of the Constitution of Zimbabwe, His Excellency President Dr E.D Mnangagwa has relieved Honourable Kirsty Coventry from her position as Minister of Sport, Recreation, Arts and Culture following her well deserved election as the president of the International Olympic Committee, reads the statement.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Lieutenant-General-Anselem-Nhamo-Sanyatwe-680x380.jpg",
            "description": "PRESIDENT Mnangagwa has appointed Lieutenant General Anselem Nhamo Sanyatwe as the new Minister of Sport, Recreation, Arts and Recreation following the election of Kirsty Coventry as president of the International Olympic Committee last week.",
            "time": "21:46",
            "date": "25 Mar 2025"
        },
        {
            "title": "Suspected robber arrested after escaping from custody",
            "url": "https://www.herald.co.zw/suspected-robber-arrested-after-escaping-from-custody/",
            "content": "Crime Reporter\n\nAn armed inmate who recently staged a dramatic escape from Zimbabwe Prisons and Correctional Services (ZPCS) officers at the Harare Magistrates Court has been arrested.\n\nLuke Zinyengerere was arrested together with four of his relatives.\n\nIn a scene reminiscent of a movie, Zinyengerere recently pointed a gun at the officers escorting prisoners to their transport van, hijacked a vehicle and speed off.\n\nIn a statement, national police spokesperson Commissioner Paul Nyathi confirmed the arrest.\n\nReference is made to the Zimbabwe Republic Polices statement released on March 22, 2025. The Zimbabwe Republic Police confirms the arrest of Luke Zinyengere (29) in connection with a case of escaping from lawful custody, armed robbery and unlawful possession of a firearm.\n\nThe police also arrested the suspects relatives, Tatenda Zinyengere (19), Kelvin Chinganga (31), Siphelile Zinyengere and Obey Rwaendepi (28) for assisting the suspect to escape from the court premises. After the escape, they harboured Zinyengere, he said.\n\nPreliminary investigations revealed that Zinyengeres young brother, Tatenda Zinyengere, allegedly provided the pistol that was used in escaping from custody and robbing Tinashe Chiyamuro of his Mazda Demio vehicle.\n\nThe vehicle was then abandoned along Kaguvi Street in Harare.\n\nZinyengerere then joined the other suspects and they attempted to facilitate his escape to a neighbouring country.\n\nThe Zimbabwe Republic Police warns the public against harbouring criminals and defeating or obstructing the course of justice.\n\nMembers of the public are implored to report criminal activities on national complaints number (0242) 703631, on WhatsApp 0712 800107 or at the nearest police station, said Comm Nyathi.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Assistant-Commissioner-Paul-Nyathi.jpg",
            "description": "An armed inmate who recently staged a dramatic escape from Zimbabwe Prisons and Correctional Services (ZPCS) officers at the Harare Magistrates Court has been arrested.",
            "time": "21:46",
            "date": "25 Mar 2025"
        },
        {
            "title": "Legacy TV honours VP Mohadi with Indunamatshe Leadership Excellence Award",
            "url": "https://www.herald.co.zw/legacy-tv-honours-vp-mohadi-with-indunamatshe-leadership-excellence-award/",
            "content": "Blessings Chidakwa\n\nHerald Reporter\n\nVice President Kembo Mohadi has been honoured with the prestigious Indunamatshe Leadership Excellence Award in recognition of his unwavering loyalty to the countrys liberation efforts, leadership acumen, and contributions to the agricultural sector.\n\nThe organisation honoured VP Mohadi at his offices in Harare.\n\nLegacy TV executive director Pardon Mangwende said the accolade is a testament to Vice President Mohadis enduring commitment to Zimbabwes development.\n\nVice President Mohadi has played a pivotal role in shaping the nations trajectory through his dedication to liberation efforts, his strong leadership skills, and his significant contributions to agriculture.\n\nThis award is a symbol of appreciation for his service to the country, he said.\n\nLegacy TV has also honoured President Mnangagwa with the Mutapa Leadership Excellence Award for his role in steering Zimbabwes economic and political landscape.\n\nVice President Dr Constantino Chiwenga was also honoured with the Chaminuka Leadership Excellency Award, recognising his contributions to governance and national development.\n\nLegacy TVs awards highlight the achievements of leaders who have played a fundamental role in Zimbabwes progress across various sectors.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/2507fcd6-6ae5-4b20-a4e9-2c809b55a349-680x380.jpg",
            "description": "Vice President Kembo Mohadi has been honoured with the prestigious Indunamatshe Leadership Excellence Award in recognition of his unwavering loyalty to the country’s liberation efforts, leadership acumen, and contributions to the agricultural sector.",
            "time": "21:46",
            "date": "25 Mar 2025"
        },
        {
            "title": "Nees tweaks Warriors squad",
            "url": "https://www.herald.co.zw/nees-tweak-warriors-squad/",
            "content": "Michael Nees knows just as well that the nation is awaiting a positive result from Nigeria.\n\nHe knows Zimbabwes slim chances of reaching the 2026 World Cup hinges on winning the showdown against Nigeria at the Godswill Akpabio Stadium in Uyo.\n\nAnd he has made a single change to the squad that started the 2-2 draw against Benin last Thursday.\n\nBarring any late alterations to his plans, Nees seems to have patched up Prince Dubes place with Walter Musona with the former set to start on the bench.\n\nWarriors Probable 11\n\nWashington Arubi, Emmanuel Jalai, Divine Lunga, Munashe Garananga, Gerald Takwara, Marshal Munetsi, Andy Rinomhota, Jordan Zemura, Khama Billiat, Knowledge Musona, Walter Musona\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Warriors-680x380.jpg",
            "description": "Michael Nees knows just as well that the nation is awaiting a positive result from Nigeria. He knows Zimbabwe’s slim chances of reaching the 2026 World Cup hinges on winning the showdown against Nigeria at the Godswill Akpabio Stadium in Uyo. And he has made a single change to the squad that started the 2-2 […]",
            "time": "21:46",
            "date": "25 Mar 2025"
        },
        {
            "title": "Gokwe school closes due to spiritual attack scare",
            "url": "https://www.herald.co.zw/gokwe-school-closes-due-to-spiritual-attack-scare/",
            "content": "Blessings Chidakwa-Herald Reporter\n\nZhomba High School in Gokwe has been temporarily shut down as students are under a suspected spiritual attack.\n\nGokwe North District Development Coordinator, Mr Martin Musakanda, said authorities are on their way to assess the situation.\n\nSchool head Mr Washington Chikunichawa said the disturbances began on Monday with one affected learner, adding that as of now, eight students have been affected.\n\nI directed learners to go home due to their bizarre behaviour. The district leadership, including chiefs, is meeting today to decide the way forward, he said.\n\nGokwe-Kabuyuni legislator, Cde Spencer Tshuma, said the school has a history of mysterious occurrences.\n\nLast year, a whirlwind swept away an exam answer sheet, which was later found 500 meters away from the classroom.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Zhomba-School2-680x380.jpg",
            "description": "Blessings Chidakwa-Herald Reporter Zhomba High School in Gokwe has been temporarily shut down as students are under a suspected spiritual attack. Gokwe North District Development Coordinator, Mr Martin Musakanda, said authorities are on their way to assess the situation. School head Mr Washington Chikunichawa said the disturbances began on Monday with one affected learner, adding […]",
            "time": "21:46",
            "date": "25 Mar 2025"
        },
        {
            "title": "SA faces points deduction, lifeline for Zim?",
            "url": "https://www.herald.co.zw/sa-faces-points-deduction-lifeline-for-zim/",
            "content": "Sports Reporter\n\nZIMBABWE could get a lifeline in the 2026 World Cup Qualifiers if South Africa is sanctioned for allegedly using a player supposed to have been on suspension.\n\nMamelodi Sundowns Teboho Mokoena had accumulated two yellow cards in the build-up to the Lesotho 2-0 win.\n\nHowever, there is a technicality that the issue was not reported during the stipulated window for protests.\n\nThat win over Lesotho took South Africa to the top of Group C with 10 points, seven ahead of bottom-placed Zimbabwe.\n\nIf Zimbabwe can win against Nigeria today while South Africa gets points deducted, the Warriors, at six points, will be firmly back in the race.\n\nManaging player suspensions falls under the responsibility of the team manager.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Group-C-log-680x380.jpg",
            "description": "Sports Reporter ZIMBABWE could get a lifeline in the 2026 World Cup Qualifiers if South Africa is sanctioned for allegedly using a player supposed to have been on suspension. Mamelodi Sundowns Teboho Mokoena had accumulated two yellow cards in the build-up to the Lesotho 2-0 win. However, there is a technicality that the issue was […]",
            "time": "21:46",
            "date": "25 Mar 2025"
        },
        {
            "title": "Samsung co-CEO dies",
            "url": "https://www.herald.co.zw/samsung-co-ceo-dies/",
            "content": "Samsung Electronics co-CEO Han Jong-Hee died from cardiac arrest today, a spokesperson for the South Korean tech giant has said.\n\nHan was 63.\n\nBorn in 1962, Han was named Samsung Electronics vice chairman and CEO in 2022.\n\nHans co-CEO, Jun Young-Hyun, was appointed to the position last week.\n\nThe spokesperson told CNN that Jun will be the companys sole CEO after Hans death.\n\nIn an internal message seen by CNN, Samsung paid tribute to Han, saying he had dedicated more than 37 years of his life to leading Samsungs TV business.  CNN\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Han-Jong-Hee-680x380.jpg",
            "description": "Samsung Electronics co-CEO Han Jong-Hee died from cardiac arrest today, a spokesperson for the South Korean tech giant has said. Han was 63. Born in 1962, Han was named Samsung Electronics vice chairman and CEO in 2022. Han’s co-CEO, Jun Young-Hyun, was appointed to the position last week. The spokesperson told CNN that Jun will […]",
            "time": "21:46",
            "date": "25 Mar 2025"
        },
        {
            "title": "Flight turns around after pilot forgets passport",
            "url": "https://www.herald.co.zw/flight-turns-around-after-pilot-forgets-passport/",
            "content": "A United Airlines Boeing 787 jetliner flying from Los Angeles to Shanghai had to turn around last weekend after it was discovered that one of the pilots had forgotten his passport.\n\nFlight UA 198 departed LAX at around 2 pm on March 22, bound for Chinas largest city.\n\nAbout two hours later, the plane turned around and was redirected to San Francisco, where it landed around 5 pm.\n\nThe pilot did not have their passport onboard, United said in the statement. We arranged for a new crew to take our customers to their destination that evening.\n\nThe flight with the new crew took off around 9 pm and landed in Shanghai about six hours behind schedule.\n\nYang Shuhan, a Chinese passenger on board, told CNN that she heard the pilots very frustrated voice over the intercom, saying he forgot his passport.\n\nIts quite embarrassing, Shukor Yusof, founder of Singapore-based Endau Analytics, told CNN.\n\nHe added that the mistake is unacceptable for a global airline like United and it shows a lack of discipline.\n\nShukor noted that the absent-mindedness reflected in the incident could cost the airline dearly, taking into account the costs of things like the jet fuel they had to dump before diverting and compensation for the passengers.- CNN.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/United-plane2-680x380.jpg",
            "description": "A United Airlines Boeing 787 jetliner flying from Los Angeles to Shanghai had to turn around last weekend after it was discovered that one of the pilots had forgotten his passport. Flight UA 198 departed LAX at around 2 pm on March 22, bound for China’s largest city. About two hours later, the plane turned […]",
            "time": "21:46",
            "date": "25 Mar 2025"
        },
        {
            "title": "Warriors face Nigeria in high-stakes World Cup qualifier match: All you need to know",
            "url": "https://www.herald.co.zw/warriors-face-nigeria-in-high-stakes-world-cup-qualifier-match-all-you-need-to-know/",
            "content": "Fungai Muderere\n\nThe Warriors will play Nigeria this evening at the Godswill Akpabio Stadium on Matchday 6 of the 2026 FIFA World Cup Qualifiers Group C match.\n\nKick-off is at 6 pm.\n\nMedia coverage\n\nSuperSport TV on DStv has confirmed that it will show the game live.\n\nThe FIFA Plus App will also stream the game live, while heraldonline.co.zw will give you blow-by-blow updates of the game.\n\nZBC TV and SABC Sport are yet to confirm in their TV guide.\n\nMatch officials:\n\nEritrean officials will take charge.\n\nTeklu Mogos Tsegay will be the centre referee, while compatriots Michael Eyobel and Sirak Samuel Mengis will be the first and second assistants respectively.\n\nMohammed Osman, also from Eritrea, will be the fourth official.\n\nGhanaian Prosper Harrison Addo will be the commissioner while Paulin Ilboudo from Burkina Faso will serve as referees assessor.\n\nWhat the coaches said\n\nNigerias Eric Chelle: We need to be ready for this game. I prefer to focus on my team rather than discussing weaknesses. My priority is analysing and improving.\n\nWarriors Michael Nees: Nigeria is at the absolute top level. We cannot allow a slow start to the game to happen. We must be there from the beginning of our game. Our concentration must be there.\n\nTeam news:\n\nThere are no changes for both sides in their squads that played last week on Matchday 5 of the qualifiers.\n\nHowever, Bright Osayi-Samuel remains a doubt starter for the Super Eagles after suffering a leg injury in their match against Rwanda.\n\nForm guide\n\nNigeria heads into the match sitting on position four, with one win from five games.\n\nThe Super Eagles only victory in the qualifiers came last week against Rwanda, where Victor Osimhens brace secured the victory.\n\nZimbabwe is at the bottom of Group C, having failed to win any of their five matches so far.\n\nThey drew 2-2 against Benin last Thursday.\n\nHead to head\n\nNigeria have dominated the fixture for over four decades now.\n\nThe only time the Warriors defeated the Super Eagles was in an international friendly back in 1981.\n\nThe recent fixture, played in November 2023, ended in a 1-1 draw.\n\nFIFA world ranking:\n\nNigeria: 44\n\nZimbabwe: 121\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Warriors-squad-680x380.jpg",
            "description": "Fungai Muderere The Warriors will play Nigeria this evening at the Godswill Akpabio Stadium on Matchday 6 of the 2026 FIFA World Cup Qualifiers Group C match. Kick-off is at 6 pm. Media coverage SuperSport TV on DStv has confirmed that it will show the game live. The FIFA Plus App will also stream the […]",
            "time": "21:46",
            "date": "25 Mar 2025"
        }
    ]
}