{
    "news": [
        {
            "title": "President dares opposition MPs",
            "url": "https://www.herald.co.zw/president-dares-opposition-mps/",
            "content": "Wallace Ruzvidzo in Kwekwe\n\nOpposition legislators must actively scrutinise and hold Zanu PF Members of Parliament to account so that they deliver for the general citizenry, President Mnangagwa has said.\n\nHe said opposition legislators should give their ruling party counterparts a hard time in Parliament to build and develop Zimbabwe.\n\nThe President made the remarks during a familiarisation tour of the First Familys Pricabe Farm by the countrys legislators drawn from both the ruling party Zanu PF and the opposition CCC.\n\nDo not make the ruling party (MPs) sit, you should criticise them a lot and when you do, they will work in Parliament.\n\nAs the opposition, be serious with your opposition because where they (Zanu PF MPs) have erred, they will fix it and that will help us remain in power and you will stay in the opposition, said the President with a chuckle.\n\nTurning to the business of the day, the President said it was critical that Zimbabwe maintains its food self-sufficiency.\n\nBecause we are aspiring for the best, to me, the first and best principle for a country is the ability to feed itself. A country must be able to feed itself. If a country can feed itself, it earns respect and I am happy that in Zimbabwe, we can feed ourselves. We must not lose that position, he said.\n\nTo this end, President Mnangagwa said the Government would continue to capacitate farmers at all levels.\n\nPresident Mnangagwa and First Lady Dr Auxillia Mnangagwa arrive at Pricabe Farm for a tour by legislators in Kwekwe yesterday.- Picture: Justin Mutenda\n\nTheir capacitation, he said, was far much better than spending foreign currency on imports.\n\nGovernments role is to capacitate our farmers at every level . . . you may think it is expensive. No, it is cheaper for us to capacitate every single farmer to produce, than not to capacitate them and then import because when you import, you are sending your own resources outside.\n\nIt is particularly important that you capacitate your own people to have the capacity to produce at every level. We (Government) do our best to make sure we support our farming sector. That way, we remain a food-secure nation and I am happy that so far, we have managed to remain a fully secure country, he said.\n\nOn climate change, which has brought with it various phenomena such as droughts, the President said the Government was putting in place measures to increase the countrys irrigation capacity.\n\nWe can always mitigate the impact of weather by creating water bodies and promoting irrigation countrywide.\n\nI believe that, I have discussed with my Minister of Agriculture and said to my Minister, Minister, suppose there was no rain in the country, but our people wanted to eat food, whether there is rain or there is no rain . . . now, work out how much hectares of land should be under irrigation, so that whether there is rain or there is no rain we guarantee food security in our country. And my minister has done that.\n\nThe President said although the set target was yet to be met, there was commendable progress towards that goal.\n\nIt is necessary to make sure we guarantee ourselves food security by making sure that when there is severe drought, we still have enough hectares in the country under irrigation, which guarantees us food, said the President.\n\nFirst Lady Dr Auxillia Mnangagwa shows legislators the chicken she prepared for lunch while President Mnangagwa looks on during a field day at Pricabe Farm in Kwekwe yesterday.  Picture: Justin Mutenda\n\nHe said the First Family, which has thriving maize, potatoes and soya bean crops, coupled with abundant livestock, was playing its part in contributing to the countrys food security.\n\nPresident Mnangagwa said the farms success was a result of a highly mechanised operations system and learning from other farmers.\n\nWe are a small farm, not very big, but I can assure you we are productive. I am satisfied that we are very productive on the piece of land which we were given. In the winter, in the summer, this place is kept productive. We are highly mechanised (and) we do our best to contribute to national food security as a family, he said.\n\nThe President said both himself and the First Lady were from agricultural backgrounds, hence their passion for farming.\n\nBoth myself and my wife are from very humble beginnings, so to us, farming is in our blood so we keep our little farm highly productive, he said.\n\nIn her brief remarks, First Lady Amai Auxillia Mnangagwa applauded the legislators, especially those from the opposition, for visiting the farm to witness the works being done by the First Family.\n\nThis, she said, was very productive and unifying.\n\nAs the First Lady, I am very happy and elated because this has never happened before, seeing both ruling party and opposition MPs here. We never used to see eye-to-eye . . . this is very brave, it was not something that would have ordinarily happened, she said.\n\nThe President greets opposition leader in Parliament Senator Sengezo Tshabangu of CCC at Pricabe Farm\n\nAmai Mnangagwa said she considered all legislators to be her children. Their visit had thus made a happy mother.\n\nToday I am overjoyed as a mother to see legislators united like this . . . I consider you (MPs) to be my children so I thank God that you have come to be with the father and mother (President Mnangagwa and First Lady), she said.\n\nThe First Lady gifted the legislators some of the farms produce.\n\nMidlands Province Minister of Provincial Affairs and Devolution Cde Owen Ncube said the President was leading from the front.\n\nSpeaker of Parliament Advocate Jacob Mudenda said President Mnangagwa had demonstrated that economic freedom was possible.\n\nThe tour was attended by MPs, senators, chiefs, ministers, deputy ministers and senior Government officials.\n\nPresident Mnangagwa poses for a picture with legislators including Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere (right) and Skills Audit and Development Minister Prof Paul Mavima (left) during a tour of Pricabe Farm in Kwekwe yesterday\n\nFirst Lady Dr Auxillia Mnangagwa prepares chicken for the visiting legislators lunch during a field day at Pricabe Farm in Kwekwe yesterday\n\nLegislators follow proceedings during the tour of the Presidents Pricabe Farm in Kwekwe yesterday\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/HE1.jpg",
            "description": "Wallace Ruzvidzo in Kwekwe Opposition legislators must actively scrutinise and hold Zanu PF Members of Parliament to account so that they deliver for the general citizenry, President Mnangagwa has said. He said opposition legislators should give their ruling party counterparts a hard time in Parliament to build and develop Zimbabwe. The President made the remarks […]",
            "time": "06:10",
            "date": "13 Jan 2025"
        },
        {
            "title": "Lawmakers endorse  extended Presidential term",
            "url": "https://www.herald.co.zw/lawmakers-endorse-extended-presidential-term/",
            "content": "Wallace Ruzvidzo in Kwekwe\n\nZanu PF and CCC legislators have agreed that President Mnangagwa should stay on as the countrys leader beyond 2028, saying the countrys current development trajectory should not be disturbed.\n\nParliamentarians yesterday toured the First Familys Pricabe Farm in Kwekwe with the Leader of the Opposition in Parliament, Mr Sengezo Tshabangu, saying: If we approve your (President Mnangagwa) stay in power and the people of Zimbabwe are happy, let it be\n\nZanu PFs Deputy Political Commissar Cde Webster Shamu said ruling party and opposition legislators were yearning for President Mnangagwa to stay beyond 2028.\n\nRambai muripo 2030 vana (the MPs) vachema kwatikubva uko kuti rambai muchitonga (The legislators have voiced their concern that they want you to stay as the countrys President beyond 2028), said Cde Shamu.\n\nMr Tshabangu said President Mnangagwa was leading by example in all areas, hence he must be supported.\n\nWe are Zimbabweans, we should be singing together, playing together, celebrating together. When I walk out here (Pricabe Farm) I will face criticism and it does not matter because it improves us as Zimbabweans.\n\n . . . when we go to Parliament, I can assure you that we are going to unpack the blueprint to bring the people of Zimbabwe together. We need to coexist and live together, he said.\n\nBoth ruling party and opposition legislators were mesmerised by the First Familys farming prowess with Mr Tshabangu saying it was a symbol of what Zimbabwe needs going forward.\n\nIf we can have this kind of production in this country, then we will be able to grow and improve the food basket of our nation. This is so amazing and incredible stuff that His Excellency has shown. He is actually leading by example, said the opposition Senator.\n\nIn an interview, CCC National Assembly proportional representation member, Dr Thokozani Khupe, said the President had demonstrated unparalleled leadership qualities.\n\nWe are here at the Presidents farm to look and learn because when you are talking about development, it is not rocket science, it is about copying from other people.\n\nAs MPs we have come to see what the President is doing because he is doing very well. People must learn to dissociate politics from good things.\n\nWhat we have seen at the Presidents farm is that we can restore Zimbabwe to being the Breadbasket of Africa, she said.\n\nMinister of State for Provincial Affairs and Devolution Cde Owen Ncube also voiced the provinces desire for the President to stay beyond 2028.\n\nAs a province, we continue to call for your continued stay as President beyond 2030, said Minister Ncube.\n\nZanu PF Chief Whip Cde Pupurai Togarepi said the MPs had been yearning to come and learn from the First Familys agricultural operations and they were grateful to have been accorded the opportunity.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2017/11/0711-1-1-WEBSTER-SHAMU-E1342774785440.jpg",
            "description": "Wallace Ruzvidzo in Kwekwe Zanu PF and CCC legislators have agreed that President Mnangagwa should stay on as the country’s leader beyond 2028, saying the country’s current development trajectory should not be disturbed. Parliamentarians yesterday toured the First Family’s Pricabe Farm in Kwekwe with the Leader of the Opposition in Parliament, Mr Sengezo Tshabangu, saying:  […]",
            "time": "06:10",
            "date": "13 Jan 2025"
        },
        {
            "title": "Preps for schools opening at 100pc: Govt",
            "url": "https://www.herald.co.zw/preps-for-schools-opening-at-100pc-govt/",
            "content": "Trust Freddy, Herald Correspondent\n\nGovernment says the level of preparedness for the opening of schools is at 100 percent, with Primary and Secondary Education Minister Torerai Moyo expected to tour schools tomorrow to assess the situation on the first day of the new term.\n\nThis comes as the new heritage-based curriculum will be rolled out in full starting tomorrow.\n\nYesterday, parents and guardians were busy making last-minute preparations for their children, with many spending a significant part of the day ensuring that everything was in place for a smooth start to the new school year.\n\nThe impending opening of schools has evoked mixed emotions among pupils, particularly Form One learners, who gathered at various pick-up points around the city with their parents and guardians to board buses to their new schools.\n\nWhile some were excited to start this new chapter away from home, others were anxious about the new curriculum that will be introduced starting tomorrow.\n\nForm One learners usually travel earlier for the first term for orientation as schools seek to better equip them for adaptation in the new stage of their education.\n\nTanaka Tandi, a Form One pupil who was heading to Pure Academy in Murehwa, said: I am excited to start this new chapter of my life, but at the same time, Im nervous about the new curriculum. Some are saying its more challenging than the old one, and Im not sure if its true, but I will see it for myself.\n\nAnother Form One learner, who only identified herself as Rutendo, shared similar sentiments.\n\nI am looking forward to making new friends and learning new things, but I am also worried about the workload. I have heard that high school requires a lot of project work and presentations, which makes me a bit anxious.\n\nOn the other hand, some students were more optimistic about the new curriculum.\n\nI think its a great opportunity for us to learn new skills and gain more practical knowledge, said Tinashe Kamwaza, who got a Form One place at Kwenda High School.\n\nThe Government has launched an intensive training programme to prepare teachers for the implementation of the new heritage-based curriculum.\n\nIn an interview yesterday, Minister Torerai Moyo said all was set for a smooth start to the first term, adding that lessons will start on opening day.\n\nThe Ministry of Primary and Secondary Education is happy to inform all the stakeholders that the level of preparedness for the opening of the First Term is 100 percent, he said.\n\nBoarders are travelling back to their schools on Monday (today), and l wish all of them safe travels. However, all the schools open for the beginning of the first term on Tuesday. Lessons will begin in earnest on the opening day. I will personally tour the schools from Tuesday to assess the smooth opening of schools. Minister Moyo said all the countrys 10 provinces had received the new curriculum syllabuses, with teachers set to undergo training for effective implementation.\n\nWe started rolling out the Heritage Based Curriculum in March 2024 after Cabinet had approved the New Curriculum. All 10 provinces and 64 administrative districts have received syllabi for all the learning areas for both primary and secondary schools.\n\nThe Ministry of Primary and Secondary Education with the help of our global partners in education have begun rolling out workshops. The workshops are so important because they enable our teachers to effectively implement the new curriculum.\n\nMinister Moyo also revealed that Government had initiated in-service training for teachers on coding and robotics.\n\nThis helps our educators to supervise students on innovative ways of addressing challenges they face in life. Necessity is the mother of invention. Education undoubtedly contributes to economic growth and development, said the Minister.\n\nHe also issued a strong warning to schools to strictly abide by the Governments regulations, particularly those that reject the local currency as a form of fee payment.\n\nSchool authorities should respect our circulars and regulations, he said.\n\nCompliance is mandatory. If any school authorities defy Government regulations, we have a cocktail of measures to deal decisively with culprits. However, we havent received any reports of schools that are rejecting the ZIG.\n\nThe warning comes as the Government aims to crack down on schools that insist on foreign currency payments only, which can be a significant burden on parents.\n\nMeanwhile, teachers have also indicated that they were ready to start the new year, expecting the Government to intensify the rollout of training on the new curriculum and improve their remuneration.\n\nIn an interview yesterday, Zimta chief executive Dr Sifiso Ndlovu said: We are looking forward to the Ministry escalating training on the new curriculum, and we want every teacher to be trained.\n\nWe are looking forward to a year where the new curriculum will start on a high note, and teachers will definitely be looking forward to starting the new year. We are also looking forward to the employer supporting the hardworking teachers in terms of their remuneration.\n\nZimbabwe National Union of School Heads secretary-general Mr Munyaradzi Majoni told The Herald last week that they were expecting parents to pay fees on time.\n\nWe anticipate a smooth opening of schools next week. Most administrators are finalising preparations for a seamless transition into the first term of 2025 and urging parents to make every effort to pay their fees in full by the first day of school, he said.\n\nA snap survey carried out by The Herald yesterday showed that most of the small and large-scale school uniform makers and suppliers were working round the clock with some opening their shops as early as 7am in Harare.\n\nStreet vendors were also selling school stationery on the pavements at discounted prices.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/02/cde-Torerai-Moyo.jpg",
            "description": "Trust Freddy, Herald Correspondent Government says the level of preparedness for the opening of schools is at 100 percent, with Primary and Secondary Education Minister Torerai Moyo expected to tour schools tomorrow to assess the situation on the first day of the new term. This comes as the new heritage-based curriculum will be rolled out […]",
            "time": "06:10",
            "date": "13 Jan 2025"
        },
        {
            "title": "JSC in historic calendar opening",
            "url": "https://www.herald.co.zw/jsc-in-historic-calendar-opening/",
            "content": "Farirai Machivenyika, Senior Reporter\n\nAll is set for the historic official opening of the 2025 Legal Year that will be held in Bulawayo today, the first time the event has been held outside Harare, in line with Governments policy to decentralise national events.\n\nThe decision by the Judicial Services Commission (JSC) to have the main event in Bulawayo is in line with the Governments broader devolution policy aimed at fostering inclusivity and unity.\n\nChief Justice Luke Malaba, who will preside over the main event at the High Court in Bulawayo, is set to articulate the Judiciarys vision and set the tone for the legal calendar ahead.\n\nThe theme for this year is, Building Public Confidence in the Judiciary Through Stakeholder Participation, a clarion call to strengthen trust and engagement with the justice system, underscores the Judiciarys commitment to inclusivity, transparency, and accountability.\n\nYesterday, the JSC Executive Secretary, Mr Walter Chikwana said everything was in place for todays main event in the countrys second-largest city.\n\nOur main programme will be held in Bulawayo and will be presided over by the Chief Justice. As you know, we have usually held the main event in Harare, but we have this year, decided to have it in Bulawayo in the spirit of devolution and decentralisation.\n\nWe are finalising our preparations for tomorrows (today) event and we are also going to have other events running simultaneously with the main event in other parts of the country, Mr Chikwana said.\n\nJustice, Legal and Parliamentary Minister, Ziyambi Ziyambi, Bulawayo Provincial Affairs Minister, Ms Judith Ncube and her counterpart in Matabeleland South, Dr Evelyn Ndlovu and Matabeleland Norths Mr Richard Moyo are also expected at the event.\n\nThe president of the Zimbabwe Council of Chiefs, Chief Mtshane Khumalo, other traditional leaders from Matabeleland North and South and the president of the Pan African Parliament, Chief Fortune Charumbira are also expected to attend the event.\n\nHe said other dignitaries that will sit at the bar during the ceremony in Bulawayo include, the Prosecutor-General, Justice Loice Matanda-Moyo, the Attorney General, Mrs Virginia Mabiza and the vice president of the Law Society of Zimbabwe Mr Lison Ncube.\n\nIn Harare, the Deputy Chief Justice, Elizabeth Gwaunza, will preside over proceedings, while Justice Anne-Mary Gowora of the Constitutional Court will lead the Masvingo ceremony.\n\nJustice Ben Hlatshwayo, also of the Constitutional Court, will oversee the ceremony in Mutare, and Deputy Judge president, Justice Garainesu Mawadze will lead proceedings at the Chinhoyi High Court.\n\nIn line with President Mnangagwas promise to leave no one and no place behind, the main Independence Day celebrations will this year be held outside Harare for the fourth time since 1980.\n\nThe decision to host the commemorations in Gokwe-Nembudziya underscores the administrations commitment to decentralisation and inclusive development, demonstrating that the governments efforts to bring national events closer to the people are firmly on track.\n\nThe Judiciary is no exception to this drive for inclusivity and decentralisation.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/06/Mr-Walter-Chikwanha.jpg",
            "description": "Farirai Machivenyika, Senior Reporter All is set for the historic official opening of the 2025 Legal Year that will be held in Bulawayo today, the first time the event has been held outside Harare, in line with Government’s policy to decentralise national events. The decision by the Judicial Services Commission (JSC) to have the main […]",
            "time": "06:10",
            "date": "13 Jan 2025"
        },
        {
            "title": "Cuba to hand over artefacts to liberation museum",
            "url": "https://www.herald.co.zw/cuba-to-hand-over-artefacts-to-liberation-museum/",
            "content": "Ivan Zhakata, Herald Correspondent\n\nCuba will this week hand over a variety of artefacts for display at the Museum of African Liberation, which is being constructed by the Institute of African Knowledge (INSTAK) with Government support.\n\nPresident Mnangagwas Special Envoy on the Museum of African Liberation, Ambassador Simbarashe Mumbengegwi, will this week take receipt of the artefacts from the President of the Council of the Republic of Cuba, Miguel Diaz-Canel Bermudez.\n\nAccompanying Ambassador Mumbengegwi to Cuba is the chief executive of INSTAK, Ambassador Kwame Muzawazi, and other delegates.\n\nAmbassador Mumbengegwi will also deliver a special message from President Mnangagwa to President Diaz-Canel Bermudez.\n\nAmong the items that the Republic of Cuba is handing over are armoured vehicles used in the historic Battle of Cuito Cuanavale, a pistol that belonged to the iconic leader of the Cuban Revolution, Fidel Castro and other artefacts and paraphernalia related to Cubas immense contribution to African liberation struggles.\n\nAmbassador Muzawazi described the handover as a momentous marker in the implementation of the Museum of African Liberation project.\n\nAmbassador Muzawazi said Cuba played a pivotal role in the liberation and post-colonial development of Africa, and the handover of artefacts for display at the Museum of the African Liberation was a historic landmark in the long-standing and deep-seated ties between Cuba and Africa.\n\nSuccessive generations must be reminded that Cuba is the only non-African country that actually deployed its own troops to confront apartheid in Africa, he said.\n\nCubas most telling contribution to the liberation of Africa was its involvement in the Battle of Cuito Cuanavale from November 1987 to March 1988. In that battle, Cuban soldiers got into the trenches with Angolan and Namibian freedom fighters to first stop the advance of apartheid forces, and then to repel them and send them retreating like a rag-tag army back to South Africa.\n\nThat colossal victory greatly weakened imperialist-backed rebels in Angola, speeded up Namibias quest for independence, and paved the way for majority rule in South Africa. Even today, the SADC region observes 23 March, which was the last day of the Battle of Cuito Cuanavale, as Southern Africa Liberation Day.\n\nAmbassador Muzawazi said before Cuito Cuanavale, Cuba was already supporting Africas liberation and development, with such support dating as far back as 1961 when Havana extended military and civilian assistance to the Algerian National Liberation Front.\n\nAfter independence, Cuba has continued to support Africa, particularly in the areas of health, education, and diplomatically at international fora.\n\nAmbassador Muzawazi expressed his deep gratitude to President Mnangagwa for his crucial support for the Museum Project.\n\nIn July 2022, President Mnangagwa dispatched a delegation to Cuba to initiate discussions on cooperation on the Museum of African Liberation Project. Led by Special Envoy Ambassador Mumbengegwi, the delegation met President Diaz-Canel Bermudez, and other senior officials.\n\nThe Cuban President warmly welcomed President Mnangagwas invitation to participate in the Museum of African Liberation. There were several subsequent engagements on the matter and today we are humbled and honoured to announce that historic artefacts pertaining to Cubas contributions to African liberation will now be on display at the Museum.\n\nThe Republic of Cuba is one of three non-African countries whose flag has been raised at the Museum of African Liberation, with the other two being the Peoples Republic of China and the Russian Federation.\n\nThe Museum of African Liberation in Harare is part of a 101-hectare multipurpose development known as Liberation City, which is being spearheaded by the Pan-African think tank INSTAK, with support from the Government of Zimbabwe.\n\nThough based in Zimbabwe, the Museum houses material from all African countries that waged armed struggles to liberate themselves, in addition to documenting the contributions of African, non-African countries and organisations that supported the liberation struggle politically, militarily, diplomatically and morally.\n\nThe Museum of African Liberation is conceived as a monument to the epic struggle to liberate the African people from European colonialism and apartheid.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/museum_of_african_liberation.jpg",
            "description": "Ivan Zhakata, Herald Correspondent Cuba will this week hand over a variety of artefacts for display at the Museum of African Liberation, which is being constructed by the Institute of African Knowledge (INSTAK) with Government support. President Mnangagwa’s Special Envoy on the Museum of African Liberation, Ambassador Simbarashe Mumbengegwi, will this week take receipt of […]",
            "time": "06:10",
            "date": "13 Jan 2025"
        },
        {
            "title": "‘Slothful public officers threaten Vision 2030’",
            "url": "https://www.herald.co.zw/slothful-public-officers-threaten-vision-2030/",
            "content": "Sikhulekelani Moyo, Bulawayo Bureau\n\nMinister of State for Bulawayo Provincial Affairs and Devolution Judith Ncube is concerned over the lack of dedication displayed by some public service heads in the city.\n\nSpeaking at the strategic planning workshop run by the Office of the President and Cabinet in Bulawayo on Friday last week, Minister Ncube warned that this lackadaisical approach could seriously jeopardise the attainment of Vision 2030.\n\nShe rebuked some public officers for their lack of commitment, stressing that their apathy frustrates the second capital citys efforts to drive progress and achieve the ambitious goals outlined in Vision 2030.\n\nPublic service, sometimes I end up thinking of suggesting to the President to say, your Excellency, allow us to do our own recruitment in Bulawayo because others frustrate Bulawayos plans to drive Vision 2030.\n\nSome of us are so relaxed in the offices. Maybe you didnt want to be deployed in Bulawayo; go back to the employer and ask to be deployed in areas of your choice.\n\nI feel pity for the permanent secretary. Sometimes, I end up telling him to go home and rest, as I will be seeing that he is exhausted. Its not supposed to be like that; things should flow, said Minister Ncube.\n\nThe Minister underlined the importance of teamwork in public service offices, urging all staff to work together towards achieving Vision 2030.\n\nEach office, each officer, each director, each staff member has a drivers licence to take us to Vision 2030. But if you wake up and do nothing and expect to reach Vision 2030, after punching the car or removing the wheels or draining the fuel, then we have a problem.\n\nBulawayo will be the province contributing to the failure to attain Vision 2030. So, I want to plead with all of us, wherever you are deployed, see to it that your vehicle will take us to Vision 2030, said Minister Ncube.\n\nMinister Ncube underscored the Office of the Presidents unwavering commitment to high standards of public service.\n\nShe said that total dedication to duty, unwavering loyalty, and a relentless focus on achieving results are non-negotiable expectations for all public officers.\n\nThis mandate, she stressed, encompasses leading the entire Government machinery in formulating, advocating for, and effectively implementing policies, programmes, and projects that drive sustainable economic growth and improve the livelihoods of Zimbabweans.\n\nThis includes the successful implementation of the National Development Strategy 1, a crucial roadmap towards achieving the ambitious goal of becoming a prosperous and empowered upper-middle-income society by 2030.\n\nThe Minister highlighted the inherent contradiction of a successful performance review for the Office of the President while simultaneously acknowledging dismal performance across various ministries, departments, and agencies.\n\nShe said that such a discrepancy would be unacceptable and undermine the credibility of the entire government system.\n\nThe centres performance should be a true reflection of the performance of the agencies it superintends over.\n\nDuring this workshop, as we plan for the year 2025, being the apex office, we should think seriously about a new and strengthened office of the Minister of State for Provincial Affairs and Devolution for Bulawayo Metropolitan Province that can whip ministries, departments and agencies into line in order to deliver on their assigned NDS1 performance targets.\n\nOur failure to provide the required leadership has a bearing on the performance of ministries, departments and agencies, and this will reflect negatively on us as well.\n\nShe said that President Mnangagwa demanded tangible outcomes, highlighting that the aspirations of the ZANU PF party aligned with those of the people.\n\nThese aspirations are reflected in the results anticipated by the public when ministries, departments and agencies effectively implemented NDS1.\n\nThis is only possible if you lead from the front and make ministries, departments and agencies accountable, said Minister Ncube.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/04/Minister-Judith-Ncube.jpg",
            "description": "Sikhulekelani Moyo, Bulawayo Bureau Minister of State for Bulawayo Provincial Affairs and Devolution Judith Ncube is concerned over the lack of dedication displayed by some public service heads in the city. Speaking at the strategic planning workshop run by the Office of the President and Cabinet in Bulawayo on Friday last week, Minister Ncube warned […]",
            "time": "06:10",
            "date": "13 Jan 2025"
        },
        {
            "title": "EDITORIAL COMMENT: Vocational subjects need to be studied by all",
            "url": "https://www.herald.co.zw/editorial-comment-vocational-subjects-need-to-be-studied-by-all/",
            "content": "The new curriculum and the move from continuous assessment to school projects starting this year will upgrade secondary education, make it more useful to many and give better value to taxpayers for the largest single vote in the national Budget.\n\nContinuous assessment was introduced so that school pupils were not judged entirely on how they performed in an examination of one or two hours.\n\nSome might have been off colour, some might find examinations so nerve-wracking that they cannot cope. But the idea was that the way they progressed week by week and month by month should be part of their final assessment.\n\nMany problems have been identified, including different assessment standards and the different results likely from children with many facilities at home compared to those with none.\n\nThe idea was still worth pursuing, but has now been replaced by a more school-centred project system that seems more effective at measuring what pupils can do besides an examination and has the advantage of being fairer and less susceptible to parental manipulation.\n\nThis comes through this year for all examination forms with last year being the last year of the formal CALA continuous assessment, and no one is shedding any tears at seeing it go.\n\nIt was a good idea that simply did not work as well as expected, and so the Ministry of Primary and Secondary Education looked for something better that would also measure understanding as well as an ability to write examinations.\n\nPerhaps more important is the decision to bring vocational training into the secondary schools, especially for those pupils who are highly unlikely to pass a batch of academic OLevel subjects and have, until now, simply left school with little in the way of usable skills and no measure of what they did know, which was probably quite a bit, but not producing an OLevel certificate.\n\nThis streaming acquired a very bad reputation in the final years of the colonial era with the separate F2 schools in the Division of African Education in the Education Ministry, that only went as far as Form Two.\n\nThese were all upgraded soon after independence to become indistinguishable from the academic F1 schools that prepared all children for OLevel within four years.\n\nThe problem, regrettably, is that OLevel is an examination designed for a significant minority, but not a majority of the population, and largely designed as an entry point for further academic education of one form or another.\n\nUnder the new curriculum changes now coming in, not only will those studying academic subjects have to learn some of the practical applications of those subjects, as part of that general upgrade of all education but that there will be clear vocational-orientated education paths at all schools.\n\nOddly enough, with the F2 schools and their bad reputation, no one closely looked at the old white schools, except those whose children attended them, and especially the technically-orientated high schools. The colonialists made sure their children left school with skills and certificates.\n\nWhile the top third did go on to write O Level in four years, the other two thirds had compulsory vocational and practical subjects added to an academic base, as well as a lower level examination that they wrote before O Level, for which they had a fifth year for that attempt, so that they would leave school with measured skills.\n\nThe point all along was that all the settler children were in single schools of all abilities, and could study and be examined at different levels for different subjects. There was no division between F1 and F2.\n\nThe new system is obviously considerably developed from what the old colonials had for their own children, but the crucial concept that all children should leave high school with something that will allow them to continue their skills development and measure their abilities and skills is now in place.\n\nWe would like to see a return to the lower level examination, something useful and above junior certificate, that would provide the less academically gifted with a measured statement of their progress and knowledge, rather than just a fail grade at OLevel, with the opening to proceed to OLevel in those subjects where they were most able.\n\nMore importantly vocational subjects should also be properly examined and graded. Some will be looking for formal employment, probably in factories, and some will be wanting to set up their own businesses.\n\nIn all cases having a proper examination result in all subjects, including vocational subjects, will be useful. Future employers and future bank managers will both be more impressed by measured skills levels across a range of subjects and examination levels.\n\nWe also think it is important that even the most academically-gifted have to formally study at least one vocational subject as part of their eight OLevel subjects.\n\nThis, along with the practical application projects that now go with all subjects, will also ensure that they are far better prepared for further studies and being able to eventually earn a living.\n\nIt will also stress that vocational subjects are not second-class options but a crucial part of the education of everybody and that vocational skills are needed by every person, along with the ability to apply theory and academic knowledge in practical applications.\n\nThe old English dichotomy between middle-class salaried white-collar workers and working class weekly waged blue-collar workers is simply not needed in a modern society and it was a great pity that it was introduced into colonial Zimbabwe.\n\nEveryone needs to work with both hands and minds and the only differences arise over the precise level of what the hands and minds are doing.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/02/CALA.jpg",
            "description": "The new curriculum and the move from continuous assessment to school projects starting this year will upgrade secondary education, make it more useful to many and give better value to taxpayers for the largest single vote in the national Budget. Continuous assessment was introduced so that school pupils were not judged entirely on how they […]",
            "time": "06:10",
            "date": "13 Jan 2025"
        },
        {
            "title": "Police intensify drive to bring back sanity on roads",
            "url": "https://www.herald.co.zw/police-intensify-drive-to-bring-back-sanity-on-roads/",
            "content": "Crime Reporter\n\nThe ongoing police safety operation targets anyone who poses a danger to other motorists by causing congestion, picking up and dropping passengers at undesignated points, creating imaginary lanes, or driving the wrong way down a one-way street.\n\nAlso targeted are those operating as public service vehicles, generally unregistered kombis and mushikashika, who do not have relevant permits, route authority and vehicle fitness certificates, national police spokesperson Commissioner Paul Nyathi said.\n\nThe crackdown has seen the mushikashika and those kombis that are not fully registered or compliant, and without registered routes, diverting to little-used side roads instead of the main roads to avoid the police checks.\n\nThe compliant kombis, whose owners usually belong to the major associations that have been working to clean up the business, use the correct routes and drive through the check points with little delay after the police check the required paperwork that the drivers usually have on their dashboards.\n\nThe polices sentiments come after several comments on social media by members of the public about the operation code-named: No to mushikashika, pirate taxis and lawlessness on the roads.\n\nIn a statement, national police spokesperson Commissioner Nyathi said: The Zimbabwe Republic Police notes and appreciates the varied comments on social media by the public and interested groups on the operation. In this regard, the police implore all motorists to be law-abiding citizens by exhibiting good driving conduct on the roads.\n\nThe current operation will target everybody who is posing as a danger to other innocent motorists by causing congestion, picking up and dropping passengers at undesignated points, creating imaginary lanes, driving against the flow of traffic (one-way) and those operating as public service vehicles but they do not have relevant permits, route authority and vehicle fitness.\n\nHe said the police were aware that some kombi operators and crew have removed the official registration number plates, the red numbers on white plates, and are now operating with ordinary black-on-yellow registration number plates, while playing hide and seek with law enforcement officers.\n\nThe police will therefore arrest anyone engaged in reckless driving conduct irrespective of the fact that one is driving a company vehicle, family vehicle or public service vehicle. The law is the law. Let us all comply for the effective maintenance of law and order in the country and road safety.\n\nIn the same vein, those motorists who will try to bribe Zimbabwe Republic Police members will face stern action, Comm Nyathi said.\n\nHe said transporters or public service vehicle operators should ensure that their drivers follow the law and are exemplary on the roads.\n\nAll in all, no one will be arrested or inconvenienced by the police as long as one is driving properly and following the countrys road rules and regulations.\n\nThe Zimbabwe Republic Police reiterates that all Zimbabweans should cooperate with police officers deployed for this operation to promote road safety for all, Comm Nyathi said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/kombi.jpg",
            "description": "Crime Reporter The ongoing police safety operation targets anyone who poses a danger to other motorists by causing congestion, picking up and dropping passengers at undesignated points, creating imaginary lanes, or driving the wrong way down a one-way street. Also targeted are those operating as public service vehicles, generally unregistered kombis and mushikashika, who do […]",
            "time": "06:10",
            "date": "13 Jan 2025"
        },
        {
            "title": "ZIDA unveils high impact investment opportunities",
            "url": "https://www.herald.co.zw/zida-unveils-high-impact-investment-opportunities/",
            "content": "Tapiwanashe Mangwiro\n\nSenior Business Reporter\n\nTHE Zimbabwe Investment and Development Agency (ZIDA) has unveiled some high-impact investment opportunities, with potential investors being offered avenues in real estate and agriculture.\n\nWith a combined value of about US$100 million, the projects are meant to address urban housing shortages, stimulate tourism growth and position Zimbabwe as a leading hub for high-tech agriculture.\n\nZIDA is a Government agency established to foster and facilitate both domestic and foreign investment in Zimbabwe.\n\nIts core functions encompass investment promotion including actively engaging in activities that attract investors, such as showcasing opportunities, participating in international trade fairs and building relationships with potential investors.\n\nUnder investment facilitation role, it provides a comprehensive support to investors throughout their investment journey, including offering one-stop shop services to streamline the investment process by providing guidance on regulations, licenses, and other necessary approvals.\n\nTopping the list of investment opportunities being facilitated by ZIDA is a real estate project in Harares Central Business District.\n\nThe Government is seeking investors to redevelop three dilapidated structures, replacing them with modern 10-story blocks comprising 300 residential units.\n\nThis project will directly support urban regeneration goals outlined in the National Development Strategy 1, said Engineer Theodius Chinyanga, Secretary for National Housing and Social Amenities.\n\nThe US$28 million projected will be executed under a Build-Operate-Transfer (BOT) model.\n\nThe Government will contribute US$4,1 million in land and professional services, while investors are sought to fund the remaining US$24 million. Investors will recoup their investment through a 13-year concession period.\n\nAnother key project is the Prospect Waterfalls Flats, specifically targeting high-income earners and corporate clients within Harares expanding housing market.\n\nValued at US$63 million, the project envisions the development of 100 three-story blocks, offering 1 200 units alongside a daycare centre and other essential amenities.\n\nThe Government will contribute US$10,6 million, while private investors are expected to cover the remaining US$52,4 million under a Public-Private Partnership (PPP) model.\n\nAlso on offer is the Hilltop Hotel project, a 60-room facility in the Midlands Province strategically designed to attract both business and leisure travellers. With 56 percent of construction already completed, the project requires US$240 000 in funding to complete essential aspects such as building services, interior finishing and marketing initiatives.\n\nThis investment offers a robust return, with an IRR of 53 percent and a payback period of just under two years, said Charles Tawonezvi, head of business development for Shurugwi Town Council.\n\nIn transformative move for the countrys agricultural sector, the Goromonzi Agro-Industrial Park will encompass 1 025 hectares, with a focus on horticulture, cannabis, and industrial hemp.\n\nThis project is a game-changer for Zimbabwean agriculture, said Thabo Ruswa, project advisor for the Goromonzi Agro-Industrial Company.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/07/ZIDA.jpg",
            "description": "Tapiwanashe Mangwiro Senior Business Reporter THE Zimbabwe Investment and Development Agency (ZIDA) has unveiled some high-impact investment opportunities, with potential investors being offered avenues in real estate and agriculture. With a combined value of about US$100 million, the projects are meant to address urban housing shortages, stimulate tourism growth and position Zimbabwe as a leading […]",
            "time": "06:10",
            "date": "13 Jan 2025"
        },
        {
            "title": "Zim tourism poised for growth on improved connectivity",
            "url": "https://www.herald.co.zw/zim-tourism-poised-for-growth-on-improved-connectivity/",
            "content": "Michael Tome\n\nBusiness Reporter\n\nImproved destination connectivity and enhanced marketing are expected to significantly boost the performance of the tourism sector in 2025, Tourism and Hospitality Secretary Dr Takaruza Munyanyiwa said.\n\nIn an interview, Dr Munyanyiwa said Zimbabwe was poised to significantly benefit from increased air connectivity as entry of new airlines, coupled with a surge in air travel, was expected to bolster the tourism sector.\n\nThe upgrades to the R.G. Mugabe International Airport and the Victoria Falls International Airport are anticipated to attract more international airlines, ultimately leading to a substantial increase in tourist arrivals.\n\nUganda Airlines recently commenced operations on the Harare-Entebbe route on September 25, 2024, joining a roster of airlines including Kenya Airways, South African Airways, Ethiopian Airlines, Qatar Airways, and Emirates.\n\nThe airlines play a vital role in connecting international tourists to Zimbabwes renowned tourism destinations.\n\nDr Munyanyiwa also said aggressive marketing initiatives to extend the average tourist stay from the about three days to six days would be pursued, allowing tourists to spend more, thereby generating increased revenue for the country. This would be in addition to developing new tourist attractions, he said.\n\nHe said Zimbabwe was also planning to participate in key global events, including the World Tourism Market and ITB Berlin in Spain, as well as events in the United States.\n\nLast year, the country conducted strategic roadshows across several cities, including Bournemouth, Manchester, and London in the United Kingdom, as well as Cape Town and Johannesburg. The shows were aimed at educating the homecoming diaspora community and encouraging them to explore domestic tourism opportunities.\n\nDr Munyanyiwa said the country was focused on capitalising on the Meetings, Incentives, Conferences, and Exhibitions (MICE) segment, a vital component of the tourism industry.\n\nMICE tourism not only attracts high-spending visitors but also generates substantial revenue, significantly benefiting local economies.\n\nIt also stimulates investment in crucial infrastructure developments, including convention centres, hotels, and transportation systems.\n\nOur projected growth is premised on aggressive marketing, for both domestic and international tourists, our strategy also entails cluster and MICE approach to stimulate growth.\n\nWe also have up to 11 tourism clusters that we have developed and these include religious, sports and agro-tourism.\n\nZimbabwes tourism is a critical pillar of the countrys economy, contributing approximately 12 percent to the Gross Domestic Product (GDP) and major source of foreign exchange. This year, it is expected to grow by 4,3 percent.\n\nTourism is considered a low-hanging fruit for the country in terms of foreign currency generation and employment creation and is part of key sectors that will be critical in achieving sustainable economic growth as enunciated in the National Development Strategy 1 (NDS 1).\n\nThe Governments initiatives to bolster the tourism sector coincide with the country receiving United Nations approval to establish the International Culinary Academy in Victoria Falls. This development is poised to be a transformative game-changer for the tourism industry.\n\nThe tourism industry generating up to US$1,2 billion a year, we really need to be supported so that we can double those figures, said Dr Munyanyiwa.\n\nZimbabwe boasts a diverse range of attractions, offering visitors a unique blend of natural wonders, cultural heritage and thrilling adventures.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Tourists-view-the-Victoria-Falls.jpg",
            "description": "Michael Tome Business Reporter Improved destination connectivity and enhanced marketing are expected to significantly boost the performance of the tourism sector in 2025, Tourism and Hospitality Secretary Dr Takaruza Munyanyiwa said. In an interview, Dr Munyanyiwa said Zimbabwe was poised to significantly benefit from increased air connectivity as entry of new airlines, coupled with a […]",
            "time": "06:10",
            "date": "13 Jan 2025"
        }
    ]
}