{
    "news": [
        {
            "title": "Govt takes provincial media tours to Mash East",
            "url": "https://www.herald.co.zw/govt-takes-provincial-media-tours-to-mash-east/",
            "content": "Blessings Chidakwa\n\nHerald Reporter\n\nGovernment has taken the provincial media tour to Mashonaland East province where the fourth estate will get an opportunity to appreciate some of the flagship projects being undertaken by the Second Republic both completed and underway.\n\nInformation, Publicity, and Broadcasting Services Minister Jenfan Muswere will be leading the tour.\n\nAmong the areas to be visited on Friday are Mahusekwa hospital, Hwedza to Mushandirapamwe road rehabilitation works, Hwedza Government Complex and Civil Registry offices. Others are Chivhu Dam, Irrigation and Water treatment plant.\n\nMashonaland East province becomes the second stop after Harare which was toured yesterday on sites including the temporary Mbare Traders Market, one of the Trababalas Interchange bridges, Madokero Creek, Madokero Mall, Dzivaresekwa Flats, Robert Mugabe International Airport and several roads.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/11/Untitled-73.jpg",
            "description": "Government has taken the provincial media tour to Mashonaland East province where the fourth estate will get an opportunity to appreciate some of the flagship projects being undertaken by the Second Republic both completed and underway.",
            "time": "09:46",
            "date": "03 Jan 2025"
        },
        {
            "title": "President signs laws giving 2025 Budget effect",
            "url": "https://www.herald.co.zw/president-signs-laws-giving-2025-budget-effect/",
            "content": "Farirai Machivenyika-Senior Reporter\n\nPRESIDENT Mnangagwa has signed into law two Acts operationalising the ZiG276,4 billion 2025 National Budget presented by Finance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube on November 28 last year.\n\nThe Appropriation Act, which authorises the bulk of Government spending for this year, the rest being set as permanent spending in other Acts, and Finance Act, which enacted the changes in taxation announced in the Budget, were published in an Extraordinary Government Gazette on Monday after President Mnangagwa assented to them.\n\nThis means the Government can now spend the money allocated by Parliament and collect taxes at the changed rates and any new taxes imposed with new taxpayers, such as the swathe of the informal sector, now legally obliged to pay taxes that others were already paying.\n\nThe Budget comprises ZiG234 688 015 000 in expected revenues charged to the Consolidated Revenue Fund and ZiG6 248 797 000 in retention funds that are meant for specific purposes as provided for by the Public Finance Management Act.\n\nParliament passed the Budget last month after lengthy debates that lasted five days with legislators across the political divide interested to know how it builds resilience for different groups of people and grows the economy.\n\nIn response, Prof Ncube said support for agriculture, for example, through investment in dam construction which in turn supports irrigation, was one way the budget would building resilience for farmers against climate shocks and food insecurity.\n\nThere was also a lot of interest in terms of how the Budget is building resilience for women and female entrepreneurs. In that respect, the Budget will support the capitalisation of the Empowerbank as well as Womens Bank, he said.\n\nProf Ncube said provision of sanitary wear to young girls, generally through the public schools system, was a topic for debate and ZiG211 million was set aside for that.\n\nThe Budget builds resilience against currency and other shocks by maintaining fiscal discipline where the deficit will be kept within 0,4 percent of Gross Domestic Product, or at least below 1 percent of GDP.\n\nIn terms of allocations, the Ministry of Primary and Secondary Education got the highest vote of ZiG46,7 billion while the Ministry of Health and Child Care was allocated ZiG28,8 billion.\n\nLands, Agriculture, Fisheries, Water and Rural Development was allocated ZiG22,9 billion while the Finance, Economic Development and Investment Promotion Ministry got ZiG28,7 billion. The Ministry of Defence was allocated ZiG18,05 billion.\n\nThe Ministry of Public Service, Labour and Social Welfare was allocated ZiG10,7 billion while that of Transport and Infrastructure Development got ZiG5,4 billion. Parliament got ZiG2,7 billion.\n\nThe Finance Act, while maintaining tax bands in US dollars, converted these to ZiG at current exchange rates so incomes from 0 up to ZiG33 600 a year will not be taxed, from ZiG33 601 to ZiG100 800 will be taxed at 20 percent, from ZiG100 801 to ZiG336 000 at 25 percent, between ZiG336 000 and ZiG672 000 at 30 percent, between ZiG672 001 and ZiG1 008 000 at 35 percent and anything above ZiG1 008 001 a year at 40 percent tax.\n\nThose into sport betting will now pay a 10 percent tax of their winnings deducted when they are paid out and sent to Zimra by the betting house, while the betting houses will pay three percent of their gross monthly income.\n\nA half percent surcharge is now being charged on the sale value of less healthy fast foods that include burgers, pizza, chips, chicken and doughnuts among others that will be announced in regulations to be published later.\n\nA 20 percent surcharge will now apply on the sale value of non-renewable plastic carrier bags whether manufactured locally or imported.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/President-Mnangagwa-680x380.jpg",
            "description": "Farirai Machivenyika-Senior Reporter PRESIDENT Mnangagwa has signed into law two Acts operationalising the ZiG276,4 billion 2025 National Budget presented by Finance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube on November 28 last year. The Appropriation Act, which authorises the bulk of Government spending for this year, the rest being set as permanent spending […]",
            "time": "09:46",
            "date": "03 Jan 2025"
        },
        {
            "title": "SDA community projects commended",
            "url": "https://www.herald.co.zw/sda-community-projects-commended/",
            "content": "Tafadzwa Zimoyo-Entertainment Editor\n\nPRESIDENT Mnangagwa has commended the Seventh Day Adventist Church for consistently demonstrating dedication to the nation and effectively participating in community development projects.\n\nIn a televised address to a New Year Crossover Night dubbed, Celestial Chorus Volume 2 Soiree,at Rainbow Towers in Harare on December 31, the President praised the SDA for its unwavering devotion and commitment to the nation.\n\nThe event was attended by Cabinet Ministers, diplomats, celebrities, musicians and adventists.\n\nI extend my heartfelt gratitude to all members of the Seventh-Day Adventist Church for your unwavering devotion and commitment to our nation.\n\nFor a long time, the Seventh Day Adventist Church has consistently demonstrated its dedication by actively participating in national development programmes. Your contributions in education, health care, social welfare, and spiritual awareness have led to this change, President Mnangagwa said.\n\nThe Seventh Day Adventist Church, he said, had uplifted communities and was advancing the countrys shared vision of a prosperous Zimbabwe.\n\nPresident Mnangagwa quoted Psalm 127, verse 1, reminding people that God is the ultimate builder and that they should involve Him in every project.\n\nAs we reflect on the importance of nurturing strong families, I commend your continued efforts to promote family-centred values. Indeed, as the Bible says, If the Lord does not build a home, they labour in vain they that build it.\n\nI urge you to continue standing as a pillar of support, guiding parents, children and building strong communities, moral integrity, and spirituality.\n\nStrong families lead to a strong nation, and the commitment to building family life aligns perfectly with our national goal of creating a society founded on love, harmony, and prosperity, he said.\n\nThe President also expressed a desire for the community to come together, support one another, and spread joy and kindness throughout the year.\n\nDuring the festive season, and as we look forward to the dawn of a New Year, I offer heartfelt wishes for a blessed celebration and a fruitful 2025.\n\nMay this period bring joy, renewed hope, and a deep compassion to all. I urge every member of the Seventh-Day Adventist Church and indeed all communities of faith to stay in a spirit of collaboration in the New Year, he said.\n\nWork hand in hand to realise our common aspirations for a better Zimbabwe.\n\nPresident Mnangagwa urged various faiths to keep the countrysleadership in their prayers.\n\nWe encourage you to keep us every day in your prayers as you steer this country towards an upper middle-income economy.\n\nMay the grace of God continue to guide your endeavours as you serve and uplift our nation. With hope, faith, and love, let us embrace this New Year together in line with our countrys mantra,Nyika Inovakwa Nevene Vayo, Inotongwa Nevene Vayo, Inonamatirwa Nevene vayo.\n\nSpeaking at the same event, Seventh-Day Adventist Church leader and businessman Mr Kudakwashe Tagwireyi urged youths to dedicate themselves to the Lords work.\n\nHe lauded the presence of the Minister of Youth Empowerment, Development and Vocational Training, Tino Machakaire, his Deputy Kudakwashe Mupamhanga and the Permanent Secretary Mr Solomon Mhlanga.\n\nMr Tagwireyi emphasised that in these challenging times, it was crucial for young people to stand up and make their presence felt, not just by being counted, but by becoming active advocates for democracy.\n\nI want to encourage you, because we are in a war, that you are going to stand up and be counted. Stand up, not only to be counted, but stand up and become a soldier, a soldier of democracy. Thats the other challenge, he said.\n\nMr Tagwireyi also encouraged people to always be a friend to all and an enemy to none and strive to make a positive impact in whatever they touch.\n\nI hope with this New Year, you will be able to encourage yourself to see your enemy as your friend. That is what I want you to do, and that way you become a better person because of your faith. And that is what I pray for, and that is what I wish for. And I hope that all of what you do is going to make history in our country.\n\nThe event saw top regional and local gospel musicians such as Janet Manyowa, Everton Mlalazi who doubled as host of the night, Natasha Mlalazi, Blue and Tadiwa, Xola Toto, Fisani, Rudo Madindi, Khaya Mthethwa, Mmatema and Canaan Nyathi sharing the stage as they dished out Seventh-Day Adventist Church popular hymns.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Minister-Machakaire-and-Tagwirei-680x380.jpg",
            "description": "Tafadzwa Zimoyo-Entertainment Editor PRESIDENT Mnangagwa has commended the Seventh Day Adventist Church for consistently demonstrating dedication to the nation and effectively participating in community development projects. In a televised address to a New Year Crossover Night dubbed, “Celestial Chorus Volume 2 Soiree”,  at Rainbow Towers in Harare on December 31, the President praised the SDA […]",
            "time": "09:46",
            "date": "03 Jan 2025"
        },
        {
            "title": "Signature projects ignite new year on high note",
            "url": "https://www.herald.co.zw/signature-projects-ignite-new-year-on-high-note/",
            "content": "Blessings Chidakwa-Herald Reporter\n\nALL 15 bridges for Mbudzi Interchange in Harare, to be called Trabablas on completion,are almost complete, as is the temporary Mbare Market that traders will occupy starting February 1, signalling the start of the year on a high note through completion of signature projects.\n\nInfrastructure development is at the heart of the Second Republic, with several flagship projects completed last year which President Mnangagwa commissioned nationwide.\n\nThe Government yesterday commenced provincial media tours, starting with Harare Metropolitan to have a first-hand feel of life-changing projects that it is undertaking with the private sector.\n\nThe provincial tours started at the roundabout connecting the Harare-Bindura Highway and Boulevard Road, the main entrance to Mount Hampden, where Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere led the tour accompanied by Minister of State for Provincial Affairs and Devolution for Harare Metropolitan Charles Tavengwa.\n\nAmong other areas toured are the temporary Mbare Traders Market, one of the Trababalas Interchange bridges, Madokero Creek, Madokero Mall, Dzivaresekwa Flats, Robert Mugabe International Airport and several roads.\n\nDr Muswere said the provincial tours were a new strategy employed by Government as the media played an important role in terms of nation-building, educating and informing the rest of the nation.\n\nSo the provincial media tours that we are currently undertaking are also part of the new media strategy wherein we interact with all citizens across the country to get to appreciate their thinking and so they can appreciate the impact of several projects that have been undertaken under the leadership of President Mnangagwa, he said.\n\nThe provincial tours started at the roundabout connecting the Harare-Bindura Highway and Boulevard Road, the main entrance to Mount Hampden, where Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere led the tour accompanied by Minister of State for Provincial Affairs and Devolution for Harare Metropolitan Charles Tavengwa.\n\nThe tour included several infrastructure projects such as the upgrading of the terminals at Robert Gabriel International Airport from a capacity of 1,5 million passengers yearly to plus 6 million passengers.\n\nIt also included several infrastructure projects including bridges, houses and several social activities that are supported by infrastructure initiatives.\n\nSo, this provincial media tour is there for the year 2025 and will continue. Tomorrow (today) we are going to Mashonaland East and then to all the other provinces. So, this allows the media an opportunity to be able to get to see and appreciate a number of these projects and also to interact with the public as we journey towards an upper middle-income society, Dr Muswere said.\n\nSpeaking on progress at the Trabablas Interchange, Fossils Contracting head of operations Engineer Kudakwashe Maguta said all 15 bridges are now at 97 percent completion.\n\nAll the 15 bridges are now done up to deck level. 13 bridges completed, 100 percent. The last two bridges are the ones we poured the decks in December, which are bridges one and three.\n\nOtherwise, all the bridges are now complete on the interchange. And coming on to the earthworks, we have got a road network of about 21 kilometres. This is now standing at 80 percent complete. The overall progressis 86 percent for the Trabablas Interchange.\n\nAs for the temporary traders market at Mbare Musika in Harare, Masimba Holdings said progress now stood at 82 percent with traders set to occupy the market by February 1.\n\nPresident Mnangagwa declared a state of disaster for Mbare Traders Market following an inferno that destroyed stalls and wares late last year.\n\nMasimba Holdings chief executive Mr Fungai Matahwa said the temporary market will accommodate 5,000 traders.\n\nIn terms of progress, we are sitting at 82 percent complete. We will complete it in the third week and officially on February 1 traders will be using the market, he said.\n\nConstruction of the permanent three-storey Mbare Traders Market is now coming to fruition as all modalities are in place.\n\nMinister Charles Tavengwa (left), Minister Jenfan Muswere (second from left) and other officials meet some of Budiriro 5B residents , Cleopatra Marwa(right) and Judith Mhuriyenda who benefited at Dziwarasekwa flats in Harare today.Picture : Joseph Manditswara.\n\nAt least 108 new modern houses and flats are being constructed behind Madokero Shopping Mall as part of efforts to ensure that the Governments one million housing units are met by year-end.\n\nThe Second Republic has delivered 700 000 houses and flats under National Development Strategy 1, more than triple its initial target of 220 000 and is now almost reaching the new one million target.\n\nSpeaking during the Harare provincial media tour of Madokero Creek and Madokero Mall, Exodus and Company chief executive Progress Mambo said the mall was financed by the Public Service Pension Fund.\n\nWe are also working with them to do the apartments I mentioned earlier, the 108 flats just behind this shopping mall.\n\nThis mall was officially opened by the President in December 2022 as the first phase, then the second phase was opened in June 2024, he said.\n\nTwenty-eight families that moved from Budiriro suburb to avoid being flooded out by the Marimba River are now housed at Dzivaresekwa flats. They heaped praise on President Mnangagwas administration for honouring his pledge of providing shelter to them.\n\nOne of the beneficiaries, Mrs Cleopatra Mahwa, said initially they had lost hope but were pleasantly surprised when they were offered shelter.\n\nI am glad that l now have decent accommodation courtesy of the Government. Although l still somehow experience fear when there are heavy rains that I might lose a child again, eventually l feel comforted knowing that l am at a safer place, she said.\n\nAnother beneficiary, Ms Judith Muriyenda, said had it not been for the benevolence of the President, life would have remained tough for her.\n\nIt took President Mnangagwas love to rescue us. At first, we thought the Government was just speaking without action. I nearly lost hope but thanks to our President for providing us with shelter, she said.\n\nSpeaking at the roundabout at the intersection of the Harare-Bindura Highway and Boulevard Road, Exodus and Company director (projects) Mr Alex Mashangu said infrastructure development was the new norm.\n\nThis is an exciting period in the nation in terms of infrastructure development, which covers roads, residential, and commercial. We are so excited about what weve done here in terms of contributing to the infrastructure around Harare.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Minister-Muswere-in-Madokero-680x380.jpg",
            "description": "Blessings Chidakwa-Herald Reporter ALL 15 bridges for Mbudzi Interchange in Harare, to be called Trabablas on completion,  are almost complete, as is the temporary Mbare Market that traders will occupy starting February 1, signalling the start of the year on a high note through completion of signature projects. Infrastructure development is at the heart of […]",
            "time": "09:46",
            "date": "03 Jan 2025"
        },
        {
            "title": "Plans to reverse Chivero pollution unveiled",
            "url": "https://www.herald.co.zw/plans-to-reverse-chivero-pollution-unveiled/",
            "content": "Remember Deketeke-Herald Reporter\n\nA COMPREHENSIVE plan to tackle the environmental threats facing vital freshwater resources, particularly Lake Chivero, has been unveiled by Government.\n\nThe initiative follows a severe environmental disaster late last year, caused by cyanobacteria linked to the Harare City Councils discharge of raw sewage and the dumping of industrial waste by local companies.\n\nLake Chivero, situated about 40km southwest of Harare, is experiencing alarming levels of pollution, siltation and ecological disturbances.\n\nThe issues not only threaten biodiversity, but also impact over 20 000 families who rely on the lake for water and their livelihoods, particularly in fishing.\n\nAt a press conference addressing critical environmental issues in Harare yesterday, Environment, Climate and Wildlife Minister, Dr Sithembiso Nyoni, emphasised the urgency of dealing with the Lake Chivero situation.\n\nLake Chivero is vital for drinking water and supports local biodiversity, she said.\n\nMany are now left with nothing to do. There is an urgent need for the Ministry, in collaboration with other relevant agencies, to take immediate action to restore the lakes health.\n\nAs part of the Governments initiative, Minister Nyoni outlined several measures, including formation of an Inter-Ministerial Committee to coordinate efforts in addressing water pollution.\n\nThe other plan is to have real-time monitoring systems installed to track pollution levels and inform management decisions while a proposal for over US$250 million has been set in motion to revamp aging wastewater management systems and replace outdated sewer infrastructure.\n\nMinister Nyoni also highlighted the necessity for additional funding to assist in cleaning out the dams.\n\nNotably, the lakes maximum depth has decreased from 27 metres to 20,7 metres, largely due to sediment accumulation, which poses a significant threat to aquatic life and overall biodiversity.\n\nGovernments commitment underscores the urgent need for decisive action to restore Lake Chivero and protect the livelihoods of the communities that depend on it.\n\nRecently, the Zimbabwe Parks and Wildlife Management Authority (ZimParks) said cyanobacteria caused the death of wildlife and fish in Lake Chivero.\n\nZimParks said thorough investigations conducted by the University of Zimbabwe and their own Veterinary and Capture Unit, conclusively showed that cyanobacteria was responsible for the deaths.\n\nThe Authority also said it was committed to ensuring that the problem affecting Lake Chivero was rectified to preserve natural heritage.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Minister-Muswere-and-Minister-Nyoni-680x380.jpg",
            "description": "Remember Deketeke-Herald Reporter A COMPREHENSIVE plan to tackle the environmental threats facing vital freshwater resources, particularly Lake Chivero, has been unveiled by Government. The initiative follows a severe environmental disaster late last year, caused by cyanobacteria linked to the Harare City Council’s discharge of raw sewage and the dumping of industrial waste by local companies. […]",
            "time": "09:46",
            "date": "03 Jan 2025"
        },
        {
            "title": "Motorbike boost for Angel of Hope outreach programmes",
            "url": "https://www.herald.co.zw/motorbike-boost-for-angel-of-hope-outreach-programmes/",
            "content": "Tendai Rupapa-Senior Reporter\n\nINSPIRED by First Lady Dr Auxillia Mnangagwas efforts to ease the plight of the needy, including the elderly and the sick across all communities in the country, Gellos Motorcycles has gifted her Angel of Hope Foundation with a fuel efficient motorbike for use in her outreach programmes, unlocking convenience to the vulnerable in rural communities.\n\nAs the countrys Health Ambassador, the First Lady conducts countless medical outreach programmes in communities working with the Ministry of Health and Child Care.\n\nThose who cannot walk to the nearest clinic in remote areas can have health officials visiting them to make follow-ups thus requiring transport to ferry medicines where they are needed despite the terrain so that every corner of the country is covered.\n\nThe coming in of Gellos Motorcycles shows that her efforts are not going unnoticed as she fights tooth and nail to leave no place and no one behind.\n\nA fuel-efficient motorbike gifted by Gellos Motorcycles to Angel of Hope Foundation patron, First Lady Dr Auxillia Mnangagwa recently in Harare on display.\n\nThis is the second time the firm has stepped in to assist the mother of the nation in her philanthropic work after giving her two brand new motorcycles in 2023.\n\nMario Pereira, son to the owner of Gellos Motorcycles, Mr Angello Pereira, said the motorbike, which can be used comfortably in any terrain, is affixed with a radio, a television and can cover 40 kilometres on a single litre of fuel.\n\nHis elder brother, Angello Pereira Junior, expressed their companys willingness to continue working with the First Lady in her mission to ease the plight of vulnerable groups.\n\nToday we would like to donate a new model WQ150 to the First Lady for her outreach programmes through her Angel of Hope Foundation. This would help her in areas that are hard-to-reach, especially in remote areas.\n\nMotorbikes are a good mode of transport as they are very cheap on fuel as well. This one could help a lot in carrying goods and items about in remote areas. The bike will help AoHF to go around visiting the elderly and the sick, he said.\n\nThe Pereira brothers said they were inspired by the First Ladys hard work.\n\nMario Pereira (left), son to Gellos Motorcycles owner Mr Angello Pereira looks on as his colleague tests the motorbike gifted to Angel of Hope Foundation patron, First Lady Dr Auxillia Mnangagwa to assist in her philanthropic initiative across all communities.\n\nWe are inspired by the Angel of Hope Foundation and its patron, the First Lady. Her philanthropic work has made us join in and help her. We commend our First Lady because she is doing so much good out there for people who need help.\n\nThis is not the first time we are donating to the foundation. We are in the process of manufacturing a three-wheeler which can work as an ambulance and we hope to donate that to the foundation as well, they said.\n\nAccording to the First Lady, no donation is too big or too small for her as she finds use for everything she receives.\n\nAngel of Hope Foundation is a private entity which is not Government-funded and relies on well-wishers to undertake various works across the length and breadth of the country.\n\nThrough her foundation, Dr Mnangagwa has received goods and services, which she has committed to areas of need and has maintained the confidence of various stakeholders because of her transparency.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Motobikes1-680x380.jpg",
            "description": "Tendai Rupapa-Senior Reporter INSPIRED by First Lady Dr Auxillia Mnangagwa’s efforts to ease the plight of the needy, including the elderly and the sick across all communities in the country, Gellos Motorcycles has gifted her Angel of Hope Foundation with a fuel efficient motorbike for use in her outreach programmes, unlocking convenience to the vulnerable […]",
            "time": "09:46",
            "date": "03 Jan 2025"
        },
        {
            "title": "Wet spell to continue till mid-January",
            "url": "https://www.herald.co.zw/wet-spell-to-continue-till-mid-january/",
            "content": "Precious Manomano-Herald Reporter\n\nTHE current wet spell in Zimbabwe is expected to persist until the middle of this month, the Meteorological Services Department has said.\n\nRecent thunderstorms have brought significant rainfall across the country, with notable amounts recorded in Rusape with 53mm, Hwange 46mm, Goetz Observatory in Bulawayo 30mm, Kadoma 27mm, and Matobo 22mm.\n\nLooking ahead, tomorrow morning is forecast to be partly cloudy and mild, with potential morning rain in the Midlands and northern regions.\n\nIn the afternoon, widespread thunderstorms are expected nationwide, particularly with heavier rainfall anticipated in areas north of Mashonaland West.\n\nAmid these promising weather patterns, Agricultural and Rural Development Advisory Services (ARDAS) chief director Mr Leonard Munamati highlighted the urgency for farmers to finalise planting due to the increasing likelihood of a short growing season.\n\nAreas have received rainfall during the festive season, and we are quite excited because most areas received heavy rainfall.\n\nFarmers who have planted are now expecting germination and looking forward to improved rains.\n\nMost crops are currently in the vegetative stage, allowing for fertiliser application. We encourage split applications to enhance crop conditions. Time is running out, and we want our farmers to plant on time, he said.\n\nThe recent rainfall offers a glimmer of hope for Zimbabwean farmers who have been battling the effects of a prolonged dry spell. As they adapt to the changing weather, the emphasis remains on timely planting and effective pest management to maximise crop yields.\n\nAgritex deputy director Ms Rutendo Nhongonhema urged farmers to adopt good agronomic practices to speed up germination and growth.\n\nWe should come early with our top dressing and subsequent top dressing should be frequent with little amount of top dressing being applied so that we give our crop a comparative advantage and it grows fast to cater for the heat units, she said.\n\nMs Nhongonhema stressed the importance of scouting for pests, especially the fall armyworm, which peaks from December to January, recommending checks at least twice a week.\n\nFurthermore, farmers are encouraged to keep their fields weed-free, especially during the crucial six weeks of crop establishment, as improper weed management can lead to significant yield losses.\n\nUp to 50 percent losses can be incurred if weeds are not managed properly. Farmers are encouraged to implement an integrated weed management plan.\n\nThis includes chemical, physical, and biological control. During incessant rains, it may be difficult to use chemical control, so we advise methods like slashing, hand-pulling, or using hoes, Ms Nhongonhema said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Screenshot-2024-12-31-at-11.18.33-680x380.jpg",
            "description": "Precious Manomano-Herald Reporter THE current wet spell in Zimbabwe is expected to persist until the middle of this month, the Meteorological Services Department has said. Recent thunderstorms have brought significant rainfall across the country, with notable amounts recorded in Rusape with 53mm, Hwange 46mm, Goetz Observatory in Bulawayo 30mm, Kadoma 27mm, and Matobo 22mm. Looking […]",
            "time": "09:46",
            "date": "03 Jan 2025"
        },
        {
            "title": "Zim poised for positive economic prospects",
            "url": "https://www.herald.co.zw/zim-poised-for-positive-economic-prospects/",
            "content": "Zvamaida Murwira-Senior Reporter\n\nZIMBABWE is poised for bright economic prospects and better fortunes that will be anchored on agriculture, mining and new innovation from institutions of higher learning despite El Nino-induced drought setback that affected the country and the Sadc region last year.\n\nAnalysts and experts have noted that agriculture remains the engine of growth for this year as it will have downstream benefits in electricity generation, industry and the economy in general.\n\nIn an interview, different analysts and experts were upbeat about the prospects for the year.\n\nPermanent Secretary for Lands, Agriculture, Fisheries, Water and Rural Development Professor Obert Jiri said interventions by the Government will spur economic growth.\n\nIn the outlook we envisage rebounding of the agricultural sector on the back of a successful 2024 winter season and on the better 2024-2025 rainfall season.\n\nThe climate-proofing agenda for the agricultural sector continues on two fronts: the household level and the national level. At the household level, the Pfumvudza/Intwasa is key, as well as the agro-ecologocal tailoring and matching for maize and traditional grains. At the national level, the emphasis is on irrigation development, said Prof Jiri.\n\nConfederation of Retailers Association president Mr Denford Mutashu said they remained hopeful about the prospects for 2025.\n\nCZR hopes the ongoing engagement between Government and the private sector will regenerate a conducive business environment for both commerce and industry. Expectations remain high on levelling the playing field, improving competitiveness and restoration of formal businesses, said Mr Mutashu.\n\nEconomic analyst, Dr Prosper Chitambara said the economy was going to perform better than last year as that was hinged on a good rainfall season.\n\nWe are expecting industry and the economy in general to outperform last year. This expectation is based on the assumption that we are going to have a normal to above normal rainfall season that will boost agricultural production and ultimately help industry and the rest of the economy, said Dr Chitambara.\n\nAnother economic analyst, Mr Brains Muchemwa expressed optimism about this years prospects, but implored policy makers to address macro-economic fundamentals like power generation.\n\nBarring another drought and on the back of the multiple currency environment, the economic prospects for 2025 generally remain positive although persistent power shortages and the tight liquidity conditions in the economy will curtail the extent of the rebound.\n\nWhat is key, going forward, is for policy makers to protect the solvency of the domestic United States dollar clearing and settlement system through strict adherence to a prudent fiscal budget in order to see through the multiple currency regime all the way to 2030, he said.\n\nA legal practitioner, Advocate Ngobizitha Mlilo said the year will be good, but implored unity among Zimbabweans.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/professor-obert-jiri-old.jpg",
            "description": "Zvamaida Murwira-Senior Reporter ZIMBABWE is poised for bright economic prospects and better fortunes that will be anchored on agriculture, mining and new innovation from institutions of higher learning despite El Nino-induced drought setback that affected the country and the Sadc region last year. Analysts and experts have noted that agriculture remains the engine of growth […]",
            "time": "09:46",
            "date": "03 Jan 2025"
        },
        {
            "title": "Sigh of relief for 63 death row inmates",
            "url": "https://www.herald.co.zw/sigh-of-relief-for-63-death-row-inmates/",
            "content": "Blessing Chidakwa-Herald Reporter\n\nAT least 63 prisoners on death row will now be re-sentenced by the High Court following the abolition of the death penalty.\n\nThis momentous shift has been met with widespread acclaim from analysts and advocates alike.\n\nIn a nation that has not witnessed an execution since 2005, those condemned to death will now find themselves summoned back to the High Court, where their fate will be reconsidered under the new maximum sentence of life imprisonment or substantial determinate terms.\n\nThe landmark signing of the Death Penalty Abolition Bill into law by President Mnangagwa marks a profound transformation in the nations legal landscape, heralding the definitive end of capital punishment.\n\nJustice, Legal and Parliamentary Affairs Minister Ziyambi Ziyambi announced with conviction that the long-dreaded prospect of hanging will now become a relic of the past for those previously sentenced to death.\n\nSection 2 of the Act unequivocally states that no death sentence shall be executed, regardless of its imposition. Instead, the High Court is tasked with the solemn duty of imposing an appropriate substitute sentence, he said.\n\nMinister Ziyambi further emphasised that the Minister of Justice and the Commissioner-General of Prisons must ensure that those under death sentences are appropriately brought before the High Court for re-sentencing.\n\nMr Mlondolozi Ndlovu, a passionate anti-death penalty activist, expressed profound gratitude for the Presidents courageous decision, asserting that history will forever honour this pivotal legislative act.\n\nFor years, civil society, religious organisations, and compassionate individuals have rallied for the abolition of this heinous practice, which stands as a cruel, degrading, and inhumane form of punishment, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2020/08/1908-1-1-PAGE-2-ZIYAMBI.jpg",
            "description": "Blessing Chidakwa-Herald Reporter AT least 63 prisoners on death row will now be re-sentenced by the High Court following the abolition of the death penalty. This momentous shift has been met with widespread acclaim from analysts and advocates alike. In a nation that has not witnessed an execution since 2005, those condemned to death will […]",
            "time": "09:46",
            "date": "03 Jan 2025"
        },
        {
            "title": "President promotes  27 Air Force officers",
            "url": "https://www.herald.co.zw/president-promotes-27-air-force-officers/",
            "content": "Remember Deketeke-Herald Reporter\n\nCommander-in-Chief of the Zimbabwe Defence Forces, President Mnangagwa, yesterday promoted 27 Air Force of Zimbabwe officers.\n\nThe President made the promotions in terms of Section 15 (1) (b) of the Defence Act, which reads: His Excellency the President of the Republic of Zimbabwe and Commander in Chief of the Zimbabwe Defence Forces may, on the advice of the minister acting on the recommendation of the commander, promote or temporarily appoint an officer to a higher rank.\n\nTwo Air Commodores, 11 Group Captains and 16 Wing Commanders were among the promoted Air and Senior officers. However, one Air Commodore and one Group Captain are currently out of the country on duty.\n\nSpeaking during the promotion of Air and Senior officers ceremony at the Josiah Magama Tongogara Barracks in Harare, Commander Air Force of Zimbabwe Air Marshal John Jacob Nzvede said the promotions highlight how crucial performance-based appointments are to achieving Vision 2030.\n\nThe President and Commander in Chief of the Zimbabwe Defence Forces, Cde Mnangagwa, has underscored the importance of performance-based appointments as one of the key enablers in attaining Vision 2030, he said.\n\nIt is against this background that the President and the Commander in Chief of the Defence Forces saw it fit to promote these air and senior officers.\n\nAir Marshal Nzvede there is no room for chancers to earn promotion.\n\nHaving earned this promotion, it is a joyous moment for the elevated individuals and the organisation. The next step is to justify this elevation by performing to the expected standards, he said.\n\nThe Airforce of Zimbabwe and the nation are faced with several challenges that require ingenuity. I therefore challenge the promoted officers and all officers in the Airforce of Zimbabwe to go beyond the routine tasks to become innovative leaders.\n\nSpeaking after their promotion, Air Commodore Morris Mujikwa thanked the AFZ Commander and the command element for approving his promotion.\n\nHe added he will lead with compassion so that subordinates are motivated to serve the organisation and the nation to the best of their abilities.\n\nGroup Captain Lysinda Mahere pledged to give back to the AFZ and the entire nation.\n\nI want to thank our Commander in Chief of the Zimbabwe Defence Forces, President Emmerson Mnangagwa, for promoting me to the rank of group captain.\n\nI also promise that I will work hard for the nation to achieve its target of becoming an upper-middle-income society by 2030. Lastly, to my fellow women, I implore them to work hard and that is the secret behind every success.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Air-Force-promotions-680x380.jpg",
            "description": "Remember Deketeke-Herald Reporter Commander-in-Chief of the Zimbabwe Defence Forces, President Mnangagwa, yesterday promoted 27 Air Force of Zimbabwe officers. The President made the promotions in terms of Section 15 (1) (b) of the Defence Act, which reads: “His Excellency the President of the Republic of Zimbabwe and Commander in Chief of the Zimbabwe Defence Forces […]",
            "time": "09:46",
            "date": "03 Jan 2025"
        }
    ]
}