{
    "news": [
        {
            "title": "Midlands heightens preps for Uhuru celebrations",
            "url": "https://www.herald.co.zw/midlands-heightens-preps-for-uhuru-celebrations/",
            "content": "Richard Muponde\n\nZimpapers Politics Hub\n\nPREPARATIONS for this years national Independence Day celebrations have accelerated, with construction materials and equipment now on site.\n\nWorkers are upgrading access roads to facilitate travel to and from Gokwe North.\n\nThis years celebrations will take place at Nembudziya Growth Point Open Ground in Gokwe North, under the theme Zim@45: Devolve and Develop Together towards Vision 2030.\n\nOrganisers expect the April 18th celebrations to draw over 60, 000 people from all ten provinces of Zimbabwe. The Second Republic introduced a rotational system for hosting the Uhuru celebrations, and last year, Murambinda in Buhera hosted the event.\n\nIn an interview with Zimpapers Politics Hub, Midlands Minister of State for Provincial Affairs and Devolution, Mr Owen Ncube, said that preparations are progressing well.\n\nWe have received materials and equipment is now on site. We are working diligently to complete all access roads to Gokwe South within the next 30 days, Minister Ncube said. We are improving the Kwekwe-Chitekete Road and all access roads leading to the venue. Additionally, we are drilling boreholes and planting lawn on the soccer pitch, which will host the Independence match. Everything is proceeding according to plan.\n\nAs per tradition, the Childrens Party will precede the main celebrations on April 17th at Nyamuroro High School, followed by the Independence Gala at Nembudziya Government High School on the eve of April 18th.\n\nOn Monday, Minister Ncube presided over a preparatory meeting in Midlands province to assess preparations for the grand national event.\n\nAt the meeting, it was revealed that the venue and access roads have been revamped, whilst over 200 beasts have been secured.\n\nAlso, transportation arrangements are in place to accommodate the tens of thousands of people that will throng Gokwe North.\n\nThe national Independence Day celebrations are expected to usher in massive developmental projects for Gokwe Nembudziya, including infrastructure upgrades on roads, clinics, schools and network base stations.\n\nConstruction of legacy projects is underway at the main arena in Gokwe North Open Grounds, the gala site at Nembudziya Government High School, and the Childrens Party venue at Nyamuroro High School.\n\nTo transport delegates to the venues, the Government has mobilised over 369 buses for equitable distribution across the countrys provinces.\n\nThe First Family will host 3,050 child delegates at Nyamuroro High School on April 17th. Child delegates will arrive at Nyamuroro High School on April 15th and depart on April 19th.\n\nHighlights of the events leading up to the celebrations include the customary torch relay and the lighting of the Independence Flame en route to the main venue. A diverse group of artists and dance groups from Kwekwe, Gokwe, and other districts will perform during the celebrations.\n\nSimba Bhora and FC Platinum football clubs, the top two teams in the Premier League, will play during the main Independence Day Anniversary celebrations. Herentals Queens and Black Rhinos Football Clubs will play during the 2025 Childrens Party celebrations. Last year, Dynamos and Highlanders played during the Uhuru celebrations in Buhera.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/06/OWEN-NCUBE-680x380.png",
            "description": "PREPARATIONS for this year’s national Independence Day celebrations have accelerated, with construction materials and equipment now on site.",
            "time": "21:07",
            "date": "12 Mar 2025"
        },
        {
            "title": "DRC government to have direct talks with M23 rebels",
            "url": "https://www.herald.co.zw/drc-government-to-have-direct-talks-with-m23-rebels/",
            "content": "Zimpapers Politics Hub\n\nThe Government of Angola on Tuesday announced that the Democratic Republic of Congo (DRC) has agreed to have direct talks with the M23 rebels to bring peace to the vast African country.\n\nThis marks a shift from previous peace talks which excluded M23 and instead focused on Rwandas role in the conflict.\n\nIn a statement released by the Angolan Presidents office on Tuesday, Angola said it will act as a mediator in the ongoing conflict between the DRC and M23 rebel group.\n\nFollowing the brief working visit of His Excellency Flix Tshisekedi to Luanda, the Angolan side, in its capacity as mediator in the conflict affecting eastern DRC, will establish contacts with the M23 so that delegations from the DRC and the M23 can hold direct talks in the coming days in Luanda, with a view to negotiating a definitive peace in this sister country, reads the statement issued after the Congolese presidents visit.\n\nDRC President was in Angola on Tuesday where he met his Angolan counterpart, Joao Lourenco, to explore the possibility of a peace process.\n\nThe Luanda government confirmed that it had begun establishing contact with both Kinshasa and M23 rebels, with direct negotiations set to take place in the coming days.\n\nM23 is one of the over 100 armed groups operating in mineral-rich eastern DRC where conflict has resulted in one of the worlds worst humanitarian crises, internally displacing more than 7 million people.\n\nThe news of the planned direct talks between the DRC government and the M23 rebels comes as good news ahead of the ongoing Sadc Extraordinary Summit of Heads of State and Government that is scheduled to start on Thursday.\n\nM23 recently seized control of Goma, the largest city in eastern DRC, and captured Bukavu, the second capital of that eastern part of the country.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/05bef931-cab2-4fa0-a629-1bdb55edae6b.jpeg",
            "description": "The Government of Angola on Tuesday announced that the Democratic Republic of Congo (DRC) has agreed to have direct talks with the M23 rebels to bring peace to the vast African country.",
            "time": "21:07",
            "date": "12 Mar 2025"
        },
        {
            "title": "Youth key in shaping Africa’s land governance",
            "url": "https://www.herald.co.zw/youth-key-in-shaping-africas-land-governance/",
            "content": "Blessings Chidakwa\n\nHerald Reporter\n\nThe Pre-International Youth Summit on Land and Economic Liberation opened with a strong call for youth involvement in shaping Africas land governance and economic future.\n\nAddressing delegates at the highly subscribed summit in Harare, Lands, Agriculture, Fisheries, Water and Rural Development Permanent Secretary, Professor Obert Jiri said youths play a critical role in land reform and sustainable development.\n\nThis summit comes at a crucial time. Africas youth must take an active role in land and economic matters. Their participation is not optional, it is imperative, he said.\n\nThe summit, organised by the Africa Youth Congress (AYC) chairperson Cde Taurai Kandishaya, aims to educate, empower, and engage youth in policy discussions, ensuring they play a central role in land governance.\n\nProf Jiri said Zimbabwes land tenure reforms aim to unlock economic value, improve land security, and drive economic growth.\n\nWe have entered a new era. All beneficiaries of the land reform under 99-year leases, offer letters, and permits will receive bankable, registrable, and transferable documents. This will enhance land security and boost investment, he said.\n\nProf Jiri also highlighted the Governments indefinite moratorium on issuing new 99-year leases, offer letters, and permits for agricultural land, ensuring better governance and sustainable land usage.\n\nZimbabwes reforms are not just transformative for us they offer a model for other African nations. Land is more than an asset. It is our heritage, our identity, and the foundation of our economies.\n\nProf Jiri said the future belongs to those who use land wisely.\n\nTogether, we can build a future where every citizen has access to land, opportunities, and prosperity, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/professor-obert-jiri-old.jpg",
            "description": "The Pre-International Youth Summit on Land and Economic Liberation opened with a strong call for youth involvement in shaping Africa’s land governance and economic future.",
            "time": "21:07",
            "date": "12 Mar 2025"
        },
        {
            "title": "Government issues 48-hour ultimatum to night vendors",
            "url": "https://www.herald.co.zw/government-issues-48-hour-ultimatum-to-night-vendors/",
            "content": "Rumbidzayi Zinyuke\n\nSenior Reporter\n\nThe Government has given local authorities a 48-hour deadline to clear illegal vendors, particularly night traders, from undesignated areas in cities and towns across the country.\n\nCiting serious health, safety, and security concerns, the Minister of Local Government and Public Works Daniel Garwe warned that the mushrooming of unregulated marketplaces has disrupted legally registered businesses.\n\nHe said it had also increased unfair competition, and created unsanitary conditions that posed a risk of disease outbreaks such as cholera and typhoid.\n\nTo enforce the directive, local authorities will be supported by law enforcement agencies to restore order.\n\nLocal authorities must enforce regulations requiring that all traders hold valid licenses and operate only in designated areas equipped with adequate sanitary facilities, he said.\n\nThe Government remains committed to fostering a safe, clean, and orderly environment for all citizens and will take further measures as necessary to address these challenges.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/cf47a06d-0d57-49e6-9b7f-053800082ad9-680x380.jpeg",
            "description": "The Government has given local authorities a 48-hour deadline to clear illegal vendors, particularly night traders, from undesignated areas in cities and towns across the country.",
            "time": "21:07",
            "date": "12 Mar 2025"
        },
        {
            "title": "Chipinge dam collapse: Two children missing",
            "url": "https://www.herald.co.zw/chipinge-dam-collapse-two-children-missing/",
            "content": "Ray Bande in Mutare\n\nThe search for two children who went missing when a dam collapsed at Bandama Farm in Chipinge on Sunday continues, even though continued rainfall is complicating the task.\n\nChipinge District Development Coordinator Mr William Mashava said Government departments are searching for eight-year-old Grace Mlambo and four-year-old Juliet Mhlanga.\n\nWe are still searching for the two missing children. Continued rainfall being experienced here is complicating the task but relevant Government departments have joined hands with locals in the search. We have not lost hope of finding their bodies, said\n\nMr Mashava.\n\nAfter Sundays dam breach that killed five people, Mr Mashava said modalities for the movement of people to higher ground are being worked out as advised by Deputy Ministers that visited the area,given that the dam structures have weakened.\n\nLands, Agriculture, Fisheries, Water and Rural Development Deputy Minister Vangelis Haritatos and his Local Government, Public Works and National Housing counterpart, Engineer Benjamin Kabikira yesterday led a delegation that visited the area to asses the damages and map out modalities for Government intervention.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/01/missing1.jpg",
            "description": "The search for two children who went missing when a dam collapsed at Bandama Farm in Chipinge on Sunday continues, even though continued rainfall is complicating the task.",
            "time": "21:07",
            "date": "12 Mar 2025"
        },
        {
            "title": "Tributes pour in for Cocoa Tea after veteran reggae singer dies at 65: ‘Rest in power’",
            "url": "https://www.herald.co.zw/tributes-pour-in-for-cocoa-tea-after-veteran-reggae-singer-dies-at-65-rest-in-power/",
            "content": "Shortly after the news of Cocoas death broke, fans flocked to social media to pay tribute to the reggae icon.\n\nHe was 65.\n\nReggae legend Cocoa Tea died on Tuesday after being diagnosed with cancer in 2019.\n\nBorn Colvin Scott, the Jamaican singer-songwriter passed away early Tuesday morning at a hospital in Florida. In the days leading up to his tragic death, the Rikers Island hitmaker had been suffering from pneumonia, his wife, Malvia Scott, revealed to\n\nJamaica Gleane.\n\nShortly after the news of Cocoas death broke, fans flocked to social media to pay tribute to the reggae icon. Rest in power, Cocoa Tea. Your voice and music will always be remembered, The Wailers wrote on X.\n\nJamaicas Prime Minister Andrew Holness also shared a statement on his official X account mourning Cocoas loss.\n\nI extend condolences to the family, friends, and supporters of Calvin George Scott, affectionately known as Cocoa Tea, he wrote.\n\nHolness called Cocoa a beacon of kindness and generosity who always uplifted the less fortunate and embodied the warmth of our nation.\n\nAs we mourn his passing, let us celebrate the rich legacy he leaves behind, a legacy of melody, compassion, and cultural pride. May his soul rest in eternal peace, the Jamaican leader added.\n\n HindustanTimes\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Cocoa-Tea.jpg",
            "description": "Shortly after the news of Cocoa’s death broke, fans flocked to social media to pay tribute to the reggae icon.",
            "time": "21:07",
            "date": "12 Mar 2025"
        },
        {
            "title": "Sadc committed to lasting peace in the DRC",
            "url": "https://www.herald.co.zw/sadc-committed-to-lasting-peace-in-the-drc/",
            "content": "Richard Muponde\n\nZimpapers Politics Hub\n\nThe Southern African Development Community (Sadc) continues to demonstrate its determination to address the escalating security crisis in the eastern Democratic Republic of Congo (DRC), with its recent Extraordinary Troika Summit focusing on strategies to counter the threat posed by the M23 rebel group and to restore lasting peace in the region.\n\nSadc held a virtual Extraordinary Troika Summit on March 6, 2025, which was chaired by Tanzanian President Samia Suluhu Hassan, the chairperson of the Troika on Politics, Defence and Security.\n\nPresident Hassan emphasised the importance of regional solidarity and collective action to support the DRC.\n\nThe Summit brought together key regional leaders, including President Lazarus McCarthy Chakwera of Malawi, the incoming Troika chairperson, President Hakainde Hichilema of Zambia, the outgoing Troika chairperson, President Cyril Ramaphosa of\n\nSouth Africa, part of the Sadc Mission (SAMIDRC), and DRC President Flix Antoine Tshisekedi.\n\nIt focused on reviewing the mandate of the SAMIDRC following the recent intensification of violence in the eastern parts of DRC.\n\nPresident Hassan set the tone in her opening remarks by reiterating the commitment of the regional bloc to find a lasting solution to the conflict.\n\nThe Sadc region will do its best to assist the DRC. Sadc is in solidarity with the Congolese people, she said.\n\nHer sentiments reflect Sadcs long-standing commitment to regional security, as enshrined in the Sadc Mutual Defence Pact of 2003, which obliges Member States to collectively address threats to peace and stability.\n\nThe Summit also paid tribute to the soldiers from Tanzania, South Africa, and Malawi who lost their lives during recent clashes in the eastern DRC while serving under SAMIDRC.\n\nRegional leaders expressed their condolences and reaffirmed their commitment to the mission.\n\nThe DRC crisis has drawn not only Sadcs attention but also that of the East African Community (EAC). While Sadc has been actively involved through SAMIDRC, the EAC has also deployed a regional force to counter the rebellion and stabilise the region.\n\nThe collaboration between SADC and the EAC underscores the necessity of regional partnerships in tackling complex security challenges. Both blocs continued engagements signal a shared determination to find a lasting solution.\n\nThe outcomes of the Troika Summit will be presented at an upcoming Extraordinary SADC Heads of State and Government Summit.\n\nThis meeting will likely refine and strengthen SAMIDRCs mandate, ensuring that it aligns with the evolving security landscape in the DRC.\n\nDuring a ZANU PF Politburo meeting last week, President Emmerson Mnangagwa, in his capacity as the Sadc chairperson, reaffirmed his commitment to addressing the ongoing crisis in DRC.\n\nHe emphasised the importance of regional unity and dialogue in resolving the conflict.\n\nThe DRC crisis is not just a Congolese problem, it is a regional challenge that requires a collective response. As Sadc, we are committed to ensuring peace and stability in the region, and we will continue to work tirelessly to support the DRC in its quest for lasting peace, President said.\n\nHe also highlighted the need for a balanced approach that combines military interventions with dialogue and peace building efforts.\n\nWhile we recognise the importance of military action in neutralising armed groups, we must also prioritise dialogue and inclusive solutions that address the root causes of the conflict, he said.\n\nAs leaders deliberate on the next steps, the people of the DRC, particularly those in its conflict-ridden eastern provinces, await a lasting solution to the conflict.\n\nThe DRC government, on the other hand, has offered a reward of US$5million for those who can help in arresting three leaders of the M23 rebel group.\n\nCorneille Nangaa, a former head of DRCs electoral commission, now leads the Congo River Alliance, which includes the M23 rebel group. He has addressed large rallies in the cities under the groups control.\n\nThe bounty is also on offer for M23 leaders Sultani Makenga and Bertrand Bisimwa.\n\nLast year, the three men were prosecuted in absentia by a military court and were given death sentences for treason.\n\nThe M23 rebel groups occupation of key areas in the region has exacerbated the humanitarian crisis and displaced thousands.\n\nA reward of US$4m was also offered for the arrest of two journalists living in exile and others that have been described by the DRC government as accomplices.\n\nIn recent weeks, the rebels captured large parts of the mineral-rich eastern DRC, including the regions two largest cities  Goma and Bukavu.\n\nHowever, the road ahead remains fraught with challenges, and both Sadc and the EAC must translate their commitments into tangible actions that address the root causes of the conflict and lay the groundwork for lasting peace. -@muponderichard\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/8c10dd39-a1d8-4f91-9773-2ac411bf5967-680x380.jpeg",
            "description": "The Southern African Development Community (Sadc) continues to demonstrate its determination to address the escalating security crisis in the eastern Democratic Republic of Congo (DRC), with its recent Extraordinary Troika Summit focusing on strategies to counter the threat posed by the M23 rebel group and to restore lasting peace in the region.",
            "time": "21:07",
            "date": "12 Mar 2025"
        },
        {
            "title": "Cimas leads in fight against kidney diseases",
            "url": "https://www.herald.co.zw/cimas-leads-in-fight-against-kidney-diseases/",
            "content": "Fatima Bulla-Musakwa\n\nCimas Groups state-of-the-art Haemodialysis Centre in Harare has become the go to place for kidney patients for the past three decades due to its quality services.\n\nCimas Haemodialysis Centre is powered by a 65Kv solar system and 85Kv back-up generators that ensure uninterrupted services for chronic and acute kidney failure patients.\n\nAdditionally, a Gambro WRO 103H water purification system and 50 000-litre reservoir tanks ensure a steady supply of purified water, crucial for dialysis procedures.\n\nThere are also kidney transplant work-up services at the centre.\n\nThe treatment capacity of the facility has significantly helped in reducing the strain on the dialysis unit at Parirenyatwa Hospital, where many renal patients receive care.\n\nCimas Health Groups chief executive officer, Mr Vuli Ndlovu said the self-sufficiency in power and water resources significantly enhanced the institutions ability to provide consistent, high-quality care to patients regardless of external challenges.\n\nThrough our Haemodialysis Centre, we are actively addressing the increasing demand for dialysis treatment while integrating sustainable, innovative solutions to enhance patient care, he said.\n\nCimas Haemodialysis Centre Clinic manager, Sister Mystica Ruzengwe said they currently have 50 chronic kidney disease patients on haemodialysis who are responding well to treatment.\n\nThe centres dialysis services are supported by an experienced nephrologist, on-site service engineers, skilled intensive care nurses, and dedicated administrative staff.\n\nIt also offers mobile haemodialysis services for patients admitted in intensive care units, as well as renal treatment for patients over 60.\n\nAs Zimbabwe joins the world in marking World Kidney Day on March 13 under the theme Are your kidneys OK?, kidney failure has become a significant health concern worldwide due to limited access to early diagnosis and treatment, which helps manage the disease in its initial stages.\n\nMonitoring blood pressure, maintaining a balanced diet and physical activity are crucial in contributing to better kidney health.\n\nZimbabwe records about 1 000 kidney failure cases annually, with only 700 having access to dialysis treatment.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Untitled-143-680x380.jpg",
            "description": "Cimas Group’s state-of-the-art Haemodialysis Centre in Harare has become the go to place for kidney patients for the past three decades due to its quality services.",
            "time": "21:07",
            "date": "12 Mar 2025"
        },
        {
            "title": "Mhlanga’s bail hearing put on hold",
            "url": "https://www.herald.co.zw/mhlangas-bail-hearing-put-on-hold/",
            "content": "Fidelis Munyoro\n\nThe High Court has indefinitely put on hold the bail hearing of Alpha Media Holdings news reporter, Blessed Mhlanga.\n\nJustice Gibson Mandaza paused proceedings to deliberate on the defences request for further details.\n\nMhlanga is accused of transmitting messages meant to incite public violence.\n\nBoth sides will be notified once the Judge is ready to proceed.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/04/Blessed-Mhlanga.jpg",
            "description": "The High Court has indefinitely put on hold the bail hearing of Alpha Media Holdings news reporter, Blessed Mhlanga.",
            "time": "21:07",
            "date": "12 Mar 2025"
        },
        {
            "title": "Philippine ex-President Duterte to face charges for drug war killings at ICC",
            "url": "https://www.herald.co.zw/philippine-ex-president-duterte-to-face-charges-for-drug-war-killings-at-icc/",
            "content": "Rodrigo Duterte, who is accused of crimes against humanity over his deadly war on drugs, could become the first Asian former head of state to be tried by the International Criminal Court in The Hague.\n\nDuterte, who led the Philippines from 2016 to 2022, was arrested early Tuesday in Manila, marking the biggest step yet in the ICCs investigation into alleged crimes against humanity during an anti-drug crackdown that killed thousands and drew condemnation around the world.\n\nThe ICCs warrant for his arrest says that as president, Duterte created, funded and armed death squads in his war on drugs that carried out murders of purported drug users and dealers.\n\nIn coming days, he will be brought before a judge and will have the allegations read out in court. Prosecutors accuse him of crimes against humanity for systematic attacks that led to dozens of murders.\n\nA source at the ICC, who spoke on condition of anonymity, said the plane carrying the former president to Rotterdam, the airport serving The Hague, had taken off from Dubai, which was also confirmed by flight tracker websites.\n\nPhilippine President Ferdinand Marcos Jr. told a news conference on Tuesday that the plane carrying Duterte was en route to The Hague, saying that would allow the former president to face charges of crimes against humanity in relation to his bloody war on drugs.\n\nDutertes youngest daughter, Veronica, plans to file a habeas corpus request with the Philippine Supreme Court to compel the government to bring him back, said Salvador Panelo, his former chief legal counsel. nbcnews.com\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2016/08/president-rodrigo-duterte-preen-e1462878578448.jpg",
            "description": "Rodrigo Duterte, who is accused of crimes against humanity over his deadly war on drugs, could become the first Asian former head of state to be tried by the International Criminal Court in The Hague.",
            "time": "21:07",
            "date": "12 Mar 2025"
        }
    ]
}