{
    "news": [
        {
            "title": "EU commends Zim progress",
            "url": "https://www.herald.co.zw/eu-commends-zim-progress/",
            "content": "Wallace Ruzvidzo, Herald Reporter\n\nThe European Union (EU) has acknowledged Zimbabwes significant progress in constitutional reforms, paving the way for strengthened cooperation between Harare and Brussels, representative of the Polish Presidency of the EU Council Mr Radoslaw Sikorski has said.\n\nSince the coming in of the Second Republic, relations between Zimbabwe and the EU have continued to thaw on the back of President Mnangagwas engagement and re-engagement drive that has built bridges with formerly hostile nations.\n\nMr Sikorski, who is also Polands Minister of Foreign Affairs, was in the country at the weekend to co-chair the SADC-EU Ministerial Partnership Dialogue in Harare.\n\nHis visit was the first by a high-ranking EU official in almost over two decades.\n\nIn an interview on Saturday evening, the EU representative said relations were progressing in the right direction.\n\nYou have constitutional progress in the works . . . we are watching it closely and sympathetically, he said.\n\nIn terms of the EU sanctions regime, Mr Sikorski said what was only left was an arms embargo.\n\nThe EU late last month removed the Zimbabwe Defence Industries (ZDI) from its list of sanctioned entities, as relations between Harare and Brussels improve.\n\nI am told that the only thing that remains is now an arms embargo, so there are no restrictions, and there is the mechanism . . . the more progress Zimbabwe makes, the faster the remaining restrictions will be removed . . . but I think we have progressed in the right direction, he said.\n\nEU Ambassador to Zimbabwe, Mr Jobst von Kirchmann weighed in on the sanctions matter, saying there was hope of lifting the remaining arms embargo in the foreseeable future.\n\nAs the minister said very clearly, there are no asset freezes. The EU has no restrictive measures left except an arms embargo, and I think collectively, we hope that with the Government, we will be able in the foreseeable future to also get rid of the mechanism which is still there, said the Ambassador.\n\nOn Zimbabwes debt overhang, the EU described the countrys present efforts to clear its arrears as positive.\n\nIn 2022 Zimbabwe initiated the High Level Structured Dialogue Platform on Arrears Clearance and Debt Resolution, which has seen positive outcomes towards the full servicing of the countrys debts.\n\nI understand that we regard some of this process as positive, said Mr Sikorski, with Ambassador von Kirchmann interjecting and adding And indeed, there have been several positive signs, in particular on land. The historic payment of farmers compensation, I think is something we have applauded publicly as  well.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/President-Mnangagwa-6.jpg",
            "description": "Wallace Ruzvidzo, Herald Reporter The European Union (EU) has acknowledged Zimbabwe’s significant progress in constitutional reforms, paving the way for strengthened cooperation between Harare and Brussels, representative of the Polish Presidency of the EU Council Mr Radoslaw Sikorski has said. Since the coming in of the Second Republic, relations between Zimbabwe and the EU have […]",
            "time": "09:30",
            "date": "17 Mar 2025"
        },
        {
            "title": "No title deeds for illegally acquired land: Govt",
            "url": "https://www.herald.co.zw/no-title-deeds-for-illegally-acquired-land-govt/",
            "content": "Blessings Chidakwa, Herald Reporter\n\nGovernment has said it will not issue title deeds for houses built on land illegally parcelled out by land barons to clamp down on dubious land allocations.\n\nApart from that, only settlements that meet regulatory standards and have proper infrastructure will be regularised, National Housing and Social Amenities Minister Zhemu Soda said in an interview with our sister paper The Sunday Mail.\n\nThis comes as rogue land barons seek to take advantage of the Governments Kwangu/Ngakwami Presidential Title Deeds Programme, an initiative designed to help ordinary Zimbabweans secure ownership of their homes.\n\nMinister Soda made it clear that title deeds will only be issued after thorough assessments confirm that a settlement is suitable for regularisation.\n\nWe are not issuing title deeds for houses built on land allocated by land barons, he said.\n\nWe are working with the Kwangu/Ngakwami Trust to mobilise resources for regularisation, including road construction and water and sewer system installations. Once assessments confirm a settlement is suitable, title deeds will be issued.\n\nThe Government, in collaboration with Kwangu/Ngakwami Trust, is focusing on developing essential infrastructure such as roads, water, and sewer systems in settlements that meet the required standards.\n\nThe move aims to ensure that only legally acquired and properly developed properties are eligible for title deeds.\n\nMeanwhile, the Government has started issuing 21 000 title deeds for properties acquired through state-sanctioned housing schemes.\n\nHomeowners eligible for title deeds are encouraged to visit district offices with the necessary documents, including identity documents, proof of payment, lease agreements, and sales agreements.\n\nOur ministry prepares the files, which are then sent to the Deeds Office for issuance, Minister Soda said.\n\nSignificant progress has been made in Epworth, where the Kwangu/Ngakwami Trust has established field offices to facilitate the process.\n\nThe initiative covers properties from both Government housing schemes and State land allocated by local councils. Issuing title deeds not only empowers citizens but also improves security of tenure and increases property values. Minister Soda also issued a stern warning to citizens against engaging intermediaries or land barons, urging them to deal directly with Government offices to avoid falling victim to fraud.\n\nWe urge citizens to take title deeds seriously and to avoid intermediaries. We work directly with citizens and do not want them to lose their money to unscrupulous activities by land barons.\n\nThe Government remains committed to addressing the countrys housing challenges, with several projects underway across the country. These include: Dzivaresekwa: Flats commissioned last year.\n\nIn Marondera construction of four blocks of flats in Dombotombo suburb, is expected to be completed by early 2025, while in Lupane houses built to cater to the towns growing status as Matabeleland Norths provincial capital are set to be commissioned soon.\n\nNew houses are set to be constructed in Siakobvu, while in Mutawatawa flats being built for civil servants, as well as the Crownlands project in Chinhoyi, which will provide over 1,000 serviced stands for Government employees.\n\nThere are several other housing projects that are underway across the country and Minister Soda reaffirmed the Governments dedication to improving housing conditions, reducing commuting costs for civil servants, and ensuring homeownership security.\n\nHe emphasized that while the housing sector is poised for transformation, citizens must acquire properties through legal channels to avoid falling victim to land barons.\n\nWith various efforts underway, Zimbabwes housing sector is set for a major transformation, he said. But citizens must be cautious and only acquire properties through legal channels.\n\nAs the Government continues to roll out its housing initiatives, the focus remains on providing secure, affordable, and well-serviced homes for all Zimbabweans.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/10/Untitled-44.jpg",
            "description": "Blessings Chidakwa, Herald Reporter Government has said it will not issue title deeds for houses built on land illegally parcelled out by land barons to clamp down on dubious land allocations. Apart from that, only settlements that meet regulatory standards and have proper infrastructure will be regularised, National Housing and Social Amenities Minister Zhemu Soda […]",
            "time": "09:30",
            "date": "17 Mar 2025"
        },
        {
            "title": "Uhuru preps: Nembudziya becomes confluence of progress",
            "url": "https://www.herald.co.zw/uhuru-preps-nembudziya-becomes-confluence-of-progress/",
            "content": "Patrick Chitumba, Midlands Bureau\n\nNEMBUDZIYA Open Grounds are becoming a confluence of progress in Gokwe North.\n\nThe sites rapid development ahead of the 45th Independence Day and Uhuru Cup, exemplifies this years celebrations themed Zim @ 45: Devolve and Develop Together Towards Vision 2030 ethos.\n\nThe convergence of national celebration and infrastructural advancement is set to leave a lasting mark, with over 100 000 participating in this historic moment.\n\nLeading up to the main celebrations, the Childrens Party, hosted by the First Family is scheduled for April 17th at Nyamuroro High School, with the Independence Gala taking place at Nembudziya Government High School the same evening.\n\nOver 3 000 child delegates will be accommodated at Nyamuroro High School from April 15th to 19th.\n\nMajor infrastructure projects are progressing well at the principal event arena, the gala site, and the Childrens Party venue.\n\nThe Government has drilled over 120 boreholes across Gokwe North and South, including the event sites.\n\nThe celebrations will feature the lighting of the Independence Flame, the traditional Torch Relay and a variety of cultural performances by dance troupes and artists from Kwekwe, Gokwe and other districts.\n\nFootball enthusiasts can look forward to matches between Simba Bhora and FC Platinum during the main celebrations, while Herentals Queens and Black Rhinos will play at the Childrens Party.\n\nIn previous years, Harare has been the host of the national festivities, but under the Second Republic, President Mnangagwa has directed that the commemorations be rotated across the different provinces, aligning with his administrations vision of leaving no one and no place behind. Rotating the celebrations ensures that all regions of the country benefit from the legacy projects associated with hosting the main event.\n\nEngineer Akim Maravira, Director of the Ministry of Local Government and Public Works, confidently said that key infrastructure projects are well beyond the halfway mark, guaranteeing the event.\n\nEveryone is busy here in Gokwe Nembudziya, where the 2025 Independence Day Celebrations will be held. We have accelerated our pace, and works are at 75 percent completion, with a target of April 10th for all works to be finalised, he said.\n\nOne of the road contractors, Mr Benny Majoni, confirmed that the road connecting Kadoma, Sanyati, and Nembudziya is currently under rehabilitation, with works progressing rapidly.\n\nWe are working on the Kadoma-Sanyati road and are progressing well. We are pleased that this years Independence Day Celebrations will be held in our area for the first time, thanks to the Second Republic, he said.\n\nLocal youths and the community have welcomed the developments, praising the Second Republics inclusive development agenda.\n\nWe thank the government for creating employment for us; roads are being rehabilitated, and the area has been upgraded, thanks to the Second Republic for adhering to the mantra of leaving no one and no place behind, said Mr Amon Ncube.\n\nLast week, Zanu PF Midlands Provincial party chairperson, Cde Edson Chiherenge, noted the significant progress in Gokwe North District.\n\nThe Independence Day celebrations have brought with them substantial development in Gokwe North and South Districts. As of today (Thursday), most projects are at 70 percent completion as we approach the April 18th celebrations, he stated.\n\nCde Chiherenge emphasised that the Government is constructing two state-of-the-art boys and girls hostels at Nyamuroro Secondary School, the venue for the Childrens Party. Furthermore, the celebrations will include the commissioning of a state-of-the-art nursing school at Nembudziya District Hospital.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Uhuru.jpg",
            "description": "Patrick Chitumba, Midlands Bureau NEMBUDZIYA Open Grounds are becoming a confluence of progress in Gokwe North. The site’s rapid development  ahead of the 45th Independence Day and Uhuru Cup, exemplifies this year’s celebrations’ themed “Zim @ 45: Devolve and Develop Together Towards Vision 2030” ethos. The convergence of national celebration and infrastructural advancement is set […]",
            "time": "09:30",
            "date": "17 Mar 2025"
        },
        {
            "title": "SADC and EAC convene in Harare to address Eastern DRC crisis",
            "url": "https://www.herald.co.zw/sadc-and-eac-convene-in-harare-to-address-eastern-drc-crisis/",
            "content": "Mukudzei Chingwere,Herald Reporter\n\nSENIOR officials from SADC and the East African Community (EAC) convened in Harare yesterday to prepare for todays Council of Ministers meeting, which will focus on the escalating crisis in the Democratic Republic of Congo.\n\nThe meeting comes amid heightened tensions following SADCs recent decision to withdraw its troops from the conflict-ridden region, underscoring the urgency of diplomatic efforts to restore peace and stability.\n\nCo-chaired by Zimbabwes Permanent Secretary for Foreign Affairs and International Trade Ambassador Albert Chimbindi and his Kenyan counterpart, Brigadier General Edward Rugendo, the meeting aimed to address the worsening humanitarian situation in the eastern DRC, particularly its impact on women and children.\n\nAmbassador Chimbindi opened the session with a call for unity and commitment among member states.\n\nWe convene today with a sense of urgency and regret that, despite our previous efforts, the situation continues to worsen, necessitating our collective action, said Ambassador Chimbindi.\n\nOur meeting demonstrates our firm commitment to finding durable peace in the eastern Democratic Republic of Congo as part of our collective aspirations to achieve the Africa we want.\n\nHe said there was need to implement directives from the recent EAC-SADC summit, which called for a comprehensive roadmap to peace.\n\nThe officials reviewed a joint roadmap outlining immediate, medium, and long-term plans to address the crisis. This roadmap included the establishment of a technical coordination mechanism to monitor the implementation of joint decisions, a critical step in addressing residual issues related to peace and security in the eastern DRC.\n\nOur meeting will consider the EAC-SADC joint roadmap, which details immediate, medium, and long-term implementation plans for our mechanism, said Amb Chimbindi.\n\nBrigadier General Rugendo highlighted the importance of learning from past interventions, including the involvement of the United Nations and the East African Community Regional Force. The situation in the Eastern Democratic Republic of Congo has been there for quite some time. Various interventions have happened, said Brig Gen Rugendo.\n\nThe United Nations has been there for a couple of years. The East African Community Regional Force was there for one year. The SAMIDRC has been there for the last one year. We have all learnt lessons from our successes and challenges.\n\nHe stressed the need for an inclusive dialogue to address the root causes of the conflict, in line with UN Security Council Resolution 2773 of 2025, which emphasises that military solutions are not viable.\n\nThe discussions yesterday were critical in shaping the outcomes of todays Council of Ministers meeting. Both chairpersons emphasised the importance of collaboration and sustainable solutions.\n\nWe cannot afford to fail our ministers, said Brigadier Rugendo. It is therefore important that we approach our engagement with open minds, a spirit of collaboration, and a firm resolve to advance sustainable solutions.\n\nWith the eastern DRC crisis posing a significant threat to regional stability and prosperity, todays Council of Ministers meeting is expected to lay the groundwork for effective strategies to restore peace. The joint efforts of SADC and EAC underscore the importance of regional co-operation in addressing complex security challenges.\n\nAs the two blocs work towards a co-ordinated response, the focus remains on achieving lasting peace and stability in the eastern DRC, a goal that is vital for the prosperity of both the SADC and EAC regions.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/SADC.jpg",
            "description": "Mukudzei Chingwere,  Herald Reporter SENIOR officials from SADC and the East African Community (EAC) convened in Harare yesterday to prepare for today’s Council of Ministers meeting, which will focus on the escalating crisis in the Democratic Republic of Congo. The meeting comes amid heightened tensions following SADC’s recent decision to withdraw its troops from the conflict-ridden […]",
            "time": "09:30",
            "date": "17 Mar 2025"
        },
        {
            "title": "Zim-China business ties deepen",
            "url": "https://www.herald.co.zw/zim-china-business-ties-deepen/",
            "content": "Zimpapers Politics Hub\n\nWISDOM, adaptability and transformation are key to strengthening business partnerships between China and Zimbabwe, a senior Chinese official has said.\n\nSpeaking at a cocktail hosted by First Capital Bank to mark belated celebrations of the Chinese New Year, Economic and Commercial Counsellor at the Chinese Embassy in Harare, Mr Huang Minghai commended the deepening relationship between the Chinese business community and local institutions in Zimbabwe.\n\nMr Huang described the relationship between the China Chamber of Commerce in Zimbabwe (CCEZ) and First Capital Bank as a symbol of shared commitment to fostering stronger economic ties.\n\nThis event is not just a celebration of the Chinese New Year; it is also a celebration of the trust, collaboration, and mutual respect that define our partnership, he said.\n\nHe reiterated CCEZs commitment to supporting its members and building positive relationships with local partners.\n\nTogether, we can create opportunities for growth and development that benefit both our communities, he added.\n\nFirst Capital Bank chief executive officer, Mr Tapera Mushoriwa, underscored the importance of the presence and positive impact of Chinese businesses in sectors such as manufacturing, mining, agriculture, telecoms, services and transport.\n\nWe recognise your need for tailor-made solutions, access to cash-flow, a solid exchange control framework, cross-border transaction solutions, and a one-stop-shop banking experience, he said.\n\nWe are proud of our robust correspondent banking network, which enables us to transact in your home currency, the Chinese yuan, along with a broad range of other international currencies, Mr Mushoriwa added.\n\nThis years Chinese Lunar New Year 2025 fell on January 29, with the celebrations running up to February 12.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/06/MUSHORIWA.jpg",
            "description": "Zimpapers Politics Hub WISDOM, adaptability and transformation are key to strengthening business partnerships between China and Zimbabwe, a senior Chinese official has said. Speaking at a cocktail hosted by First Capital Bank to mark belated celebrations of the Chinese New Year, Economic and Commercial Counsellor at the Chinese Embassy in Harare, Mr Huang Minghai commended […]",
            "time": "09:30",
            "date": "17 Mar 2025"
        },
        {
            "title": "Presidential youth fund roll out this week",
            "url": "https://www.herald.co.zw/presidential-youth-fund-roll-out-this-week/",
            "content": "Blessings Chidakwa, Herald Reporter\n\nPresident Mnangagwa is set to launch the Presidential Youth Fund, a nationwide initiative aimed at providing financial support to young Zimbabweans.\n\nThis fund is designed to enable the youths to start businesses, pursue education and skills development, and actively contribute to the nations economy.\n\nThe Presidential Youth Fund follows the successful implementation of the Presidential War Veterans Fund, which has positively impacted the lives of Zimbabwes liberation fighters.\n\nDr Paul Tungwarara, a special advisor to the President, will oversee the launch of the fund.\n\nAfter the overwhelming response to the War Veterans Fund, we are now targeting the youths, we are also going to roll-out a similar facility for women, this is in line with President Mnangagwas policy of leaving no one and no place behind. We are going to reach out to everyone out there, said Dr Tungwarara.\n\nHe said millions of dollars will be distributed to young people across the country to empower them economically through a revolving fund.\n\nThis initiative aligns with President Mnangagwas vision to empower young people and promote economic development in Zimbabwe.\n\nYoung people across the country have welcomed the proposed launch of the fund with Mr Tafara Munonde, a youth entrepreneur from Highfield, Harare, expressing optimism.\n\nThe Presidential Youth Fund will go a long way in empowering young people, the majority of whom struggle to raise capital to start businesses.\n\nDue to the high rate of unemployment, entrepreneurship is the way to go, and the fund will be pivotal in empowering youth to run their own businesses, he said.\n\nMiss Agnes Muzondo, a 27-year-old dressmaker from Nyika Growth Point in Bikita, hopes to apply for funding to expand her business.\n\nWe are making work suits and corporate wear for various companies here at Nyika Growth Point. I hope to employ other youth.\n\nI would like to use the Presidential Youth Fund to buy industrial sewing machines to expand my business, she said.\n\nThe fund is set to be distributed across provinces, ensuring that young people from all regions of Zimbabwe have access to this opportunity.\n\nThis initiative is part of President Mnangagwas broader strategy to empower the youth and promote economic development, demonstrating his commitment to supporting the countrys youth and creating opportunities for them to thrive.\n\nAs Zimbabwe recently celebrated Youth Day, the launch of the Presidential Youth Fund serves as a timely reminder of the importance of investing in the countrys young people.\n\nWith this initiative, President Mnangagwa is sending a clear message that the youth are a priority and that his administration is committed to creating opportunities for them to thrive.\n\nThe Presidential Youth Fund is expected to provide financial support to young people across the country, enabling them to start businesses, pursue education and skills development, and contribute meaningfully to the economy.\n\nThe fund will be distributed to all the countrys 10 provinces, ensuring that young people from all regions of Zimbabwe have access to this opportunity.\n\nThis initiative is part of President Mnangagwas vision to empower young people and promote economic development in Zimbabwe.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/08/Untitled-6.jpg",
            "description": "Blessings Chidakwa, Herald Reporter President Mnangagwa is set to launch the Presidential Youth Fund, a nationwide initiative aimed at providing financial support to young Zimbabweans. This fund is designed to enable the youths to start businesses, pursue education and skills development, and actively contribute to the nation’s economy. The Presidential Youth Fund follows the successful […]",
            "time": "09:30",
            "date": "17 Mar 2025"
        },
        {
            "title": "EDITORIAL COMMENT: Self-sufficiency in health sector critical",
            "url": "https://www.herald.co.zw/editorial-comment-self-sufficiency-in-health-sector-critical/",
            "content": "ZIMBABWE, like others in Africa, is already taking steps to cope with suspensions and possible ceasing of health support from the United States with measures already being implemented to create more efficient health systems as well as make sure there are no gaps.\n\nLast week, Health and Child Care Minister Dr Douglas Mombeshora made it clear that there were two essential areas that had to be kept going without pause or disruption regardless of what decisions were made in the US.\n\nThe first was keeping the medical staff doing a first-class job, continuing to do so, by bringing them onto the State payroll. The second was to start ordering shipments of critical drugs that had been paid for by the US so that there would never be a shortage.\n\nMoves were already being made last year to bring the almost 20 000 health workers paid through foreign aid channelled through non-governmental organisations (NGOs) into the public health system and formalising the ties that the more sensible had already established.\n\nThere was also a need to ensure that all health initiatives at least fitted in with Zimbabwes professionally-guided system that followed best international practice.\n\nFrosty ties between Zimbabwe and the US since the Land Reform Programme at the beginning of the century meant that US aid for Zimbabwe was almost entirely concentrated in the health sector and was largely channelled through NGOs, a preference of the US, rather than as direct support through the Ministry of Health and Child Care.\n\nThis worked reasonably well, if not perfectly, since a large majority of the actual health workers paid via NGOs were sensible people who kept in close contact with the ministrys administrative system, built around provincial medical directors and district health officers, but extending right down to the sisters in charge of clinics.\n\nBut there were problems with people who might or might not be at work, with no way of finding out why they might be missing. And there were always dangers that some of the curiosities of non-scientific health practices common in America, such as the anti-vaccination movements, could hit chunks of Zimbabwes health programmes under the direction of a similarly orientated NGO.\n\nSo the Health Ministry had already started working with the Ministry of Finance, Economic Development and Investment Promotion to work out how to bring almost 20 000 health workers employed by the NGOs, and largely funded through USAID, into the regular Government-employed health workforce.\n\nMost of these, around 19 000, are classified as community health workers, who have become the backbone of many health programmes, being in the frontline of the highly successful anti-malarial battle.\n\nThey have also been helping to ensure that all those who should be tested for HIV actually get tested, and making sure that the anti-retroviral medication gets to those who are on the programme, almost 100 percent of those who have tested positive for HIV these days.\n\nThis is besides having someone sensible in every village who can give good advice on general hygiene and preventative medicine and help make sure that those who need to go the nearest clinic can go.\n\nThey have also performed magnificently in such areas as the vaccination drives, and came in for particular praise from district medical officers fighting the last measles outbreak for their ability and hard work in getting the vaccination message through to mothers in communities where there was resistance to vaccination.\n\nThe idea that they should be dumped has obviously horrified the medical staff who have come to admire, respect and rely-on these community health workers as an essential part of the chain of health services.\n\nThey have more than justified their movement into the Ministry.\n\nThere are also a little under 1 000 more specialist doctors and nurses who have been providing services whom the Health Ministry wants to bring into the formal structure, again most of them already cooperating with the Ministry so this should not present any problems.\n\nThe use of NGOs as employers and channels of aid did create higher administrative costs, as there was that belt of administrators and NGO heads who added little value that could not be done by the Ministry administrative staff, which is kept very tight as Ministers of Health like to see their staff budget going to health professionals providing health services rather than to administration.\n\nDr Mombeshora wants the health professionals and community health workers, but is unlikely to want a pile of extra bureaucrats.\n\nSo, while Zimbabwe will have to find a significant chunk of the money that might be lost if the US decides to withdraw all or most of its health aid, the higher levels of efficiency and simpler reporting structures and better use of medical staff will mean that not every dollar has to be replaced.\n\nDr Mombeshora was also anxious to reassure those who have been receiving medication with significant levels of US aid funding, including quite large chunks of the anti-retrovirals and tuberculosis medication for example, that steps were already being taken to buy the next shipments required with the present respectable stocks able to last to June.\n\nThe Health Ministry and the Government in general does not expect any disruptions, regardless of what final decisions are made in the United States.\n\nAs we have commented before, the Second Republic has been able to cope with budgetary emergencies remarkably smoothly since it reformed the whole fiscal system in 2018.\n\nThe Covid-19 emergency and the need to feed several millions of Zimbabweans for almost a year after the last harvest was so badly hit by severe drought were both largely funded by some rapid and sensible rebudgeting.\n\nThe probable need for a higher health budget has already been addressed by the Ministry of Finance, Economic Development and Investment Promotion, which is looking at ring-fencing more taxes for health, as well as intensifying efforts to make sure that those who are supposed to pay taxes establish their relationship with Zimra so they do pay.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/11/Dr-Mombeshora.jpg",
            "description": "ZIMBABWE, like others in Africa, is already taking steps to cope with suspensions and possible ceasing of health support from the United States with measures already being implemented to create more efficient health systems as well as make sure there are no gaps. Last week, Health and Child Care Minister Dr Douglas Mombeshora made it […]",
            "time": "09:30",
            "date": "17 Mar 2025"
        },
        {
            "title": "ZRP, journalists strengthen ties to enhance media freedom",
            "url": "https://www.herald.co.zw/zrp-journalists-strengthen-ties-to-enhance-media-freedom/",
            "content": "Ivan Zhakata, Herald Correspondent\n\nThe Zimbabwe Republic Police (ZRP) and the Zimbabwe Union of Journalists (ZUJ) have reaffirmed their commitment to fostering a collaborative working relationship aiming to enhance media freedom and safety of journalists in the country.\n\nThe development follows a high-level meeting between ZUJ and the newly appointed ZRP Commissioner-General Stephen Mutamba where discussions centred on strengthening cooperation and addressing key concerns affecting the media fraternity.\n\nZUJ Secretary-General Perfect Hlongwane who led the delegation described the engagement as a positive step towards sustaining professional relations between the police and journalists.\n\nThe 2017 ZRP/Media Action Plan was a game-changer in how we interact with law enforcement. It significantly reduced violations against journalists, especially during elections. We aim to build on that progress and ensure that both journalists and police officers understand their roles in a democratic society.\n\nThe meeting also revealed the need for continued engagement between journalists and police officers on the ground.\n\nA proposal was made to involve new media graduates and police cadets in regular interactions to foster mutual respect and understanding from the onset of their careers.\n\nFurther discussions addressed the protection of journalists from cyberbullying, particularly female reporters, and the importance of maintaining ethical journalism to counter misinformation spread by unverified social media sources.\n\nIn a bid to strengthen public trust, both parties explored joint initiatives, such as awareness campaigns against social ills like drug abuse. Collaboration on societal issues will help reinforce the role of both journalists and police officers as key players in informing and protecting the public, Mr Hlongwane said.\n\nZRP and ZUJ also committed to resolving disputes internally where possible to prevent unnecessary conflicts.\n\nWith media freedom remaining a crucial pillar of democracy, the renewed partnership between the police and journalists signals a step in the right direction toward ensuring a safe and professional working environment for all.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Perfect-Hlongwane.jpg",
            "description": "Ivan Zhakata, Herald Correspondent The Zimbabwe Republic Police (ZRP) and the Zimbabwe Union of Journalists (ZUJ) have reaffirmed their commitment to fostering a collaborative working relationship aiming to enhance media freedom and safety of journalists in the country. The development follows a high-level meeting between ZUJ and the newly appointed ZRP Commissioner-General Stephen Mutamba where […]",
            "time": "09:30",
            "date": "17 Mar 2025"
        },
        {
            "title": "Life assurers urged to build sector’s resilience",
            "url": "https://www.herald.co.zw/life-assurers-urged-to-build-sectors-resilience/",
            "content": "Nelson Gahadza\n\nSenior Business Reporter\n\nThe Life Officers Association (LOA) says sector players should take advantage of the prevailing stability to build resilience in Zimbabwes life insurance industry, which is key in mobilising long-term savings for the economy.\n\nLOA represents life insurance companies in Zimbabwe and was established to promote the industrys growth and sustainability. It also collaborates with regulators, policymakers, and financial institutions.\n\nThe insurance and pensions industrys penetration rate, which peaked at 5,7 percent in 2004, is currently at between 1,5 and 2 percent.\n\nStakeholders that include sector players, the Government, and the Insurance and Pensions Commission (Ipec), are engaged ininitiatives to restore trust and grow the penetration rate.\n\nLOA Secretary General Mr Rufai Mavukeni told media engagement on Friday said to build resilience in the sector, assets related to the customers need to be protected.\n\nCurrently we are in a multi-currency environment, but we are proposing that by 2030 we should have a mono-currency arrangement.\n\nAs the industry, we are saying from experience the assets related to our policyholders need to be protected to avoid loss of value that has happened before, he said.\n\nMr Mavukeni said in the future, the industry would work with policymakers to come up with policies that will protect the assets against inflation.\n\nWe were allowed to start investing offshore last year to protect some of the values that we hold on behalf of our customers.\n\nHowever, the procedure to invest offshore will be simplified this year, and that will allow us to be able to raise our investments outside, he said.\n\nThe Justice George Smith-led Commission of Inquiry set up by the Government in 2015 found that some policyholders and pension scheme members were prejudiced by the conversion process during dollarisation and recommended they be compensated.\n\nThe commission blamed the value erosion on poor regulatory enforcement and the demonetisation of the local currency.\n\nFrom these experiences, policyholders and pension scheme members feel that they were shortchanged, and as a result, their confidence in insurance and pensions industry ebbed.\n\nAs part of efforts to finalise the compensation, Ipec has since halted the dissolution of pension funds pending the conclusion of pre-2009 compensation to ensure fairness among members.\n\nCompensation is one of the initiatives recommended by the Government to restore confidence within the pensions and financial services sectors.\n\nAs a result, the government set aside US$175 million towards that effort, and pension funds were asked to come up with their frameworks and payment plans.\n\nMr Mavukeni said after 2030, either the multicurrency regime should continue or the investment that has been made should be ring-fenced in order to protect policyholders.\n\nBut we are proposing that beyond 2030 the multicurrency regime should continue given a semblance of stability in the currency market. It is the stable currency that we are looking for so that our industry can grow, he said.\n\nMr Mavukeni said the industry should also be innovative and invest in alternative asset classes that can be able to save the value of investments.\n\nWe are encouraging our members to be innovative and invest in information technology (IT). For instance, through IT, that is how Ecosure Life is meeting the market, he said.\n\nHe said the members should also be more involved in investment on the Zimbabwe Stock Exchange (ZSE) and the Victoria Falls Stock Exchange (VFEX).\n\nWe would like the Securities and Exchange Commission of Zimbabwe (SecZim) to deepen the investment market so that we are given more options to invest our savings. That way we can create value for the customers, said Mr Mavukeni.\n\nHe said policymakers should ensure consistency of policies to sustain a stable environment where the industry is able to trade without fear of losing value.\n\nWe also believe that our industry should be involved in the modern system of investment, such as issues like blockchain and mobile money platforms that are very useful in todays world. They improve transparency, efficiency, and premium collection, said Mr Mavukeni.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/LOA-Secretary-General-Mr-Rufai-Mavukeni-680x380.jpg",
            "description": "The Life Officers Association (LOA) says sector players should take advantage of the prevailing stability to build resilience in Zimbabwe’s life insurance industry, which is key in mobilising long-term savings for the economy.",
            "time": "09:30",
            "date": "17 Mar 2025"
        },
        {
            "title": "Zanu PF youths urged to remain united",
            "url": "https://www.herald.co.zw/zanu-pf-youths-urged-to-remain-united/",
            "content": "Walter Nyamukondiwa\n\nMashonaland West Bureau Chief\n\nThere is no chance of a crisis in ZANU PF for as long as the membership does not allow people outside the party to use them to speak on their behalf, Politburo member Cde Ziyambi Ziyambi has said.\n\nAddressing the Mashonaland West Provincial Coordinating Committee meeting in Chinhoyi yesterday, Cde Ziyambi said party members should be wary of remnants of the G40, colonialists and other detractors bent on causing divisions in the party for a political comeback.\n\nAt every stage as Zanu PF we have several enemies that would want to celebrate the demise of the party. We have the opposition, remnants from the G40, remnants from the colonialists and other detractors, said Cde Ziyambi.\n\nI want to focus on remnants of the G40 and the opposition (CCC). They will take every opportunity to fan the flames of divisions within the party and its leadership.\n\nParty members, he said, should be careful not to be used as mouthpieces of the G40 and opposition.\n\nHe said enemies of the party had deployed misinformation and overplaying non-existent divisions in the partys leadership in a bid to weaken the party.\n\nWe should not allow people who are not in Zanu PF to use our mouths to speak for them. You should be careful that you are not used by the G40 to speak on their behalf to cause divisions in the party.\n\nWe are now being used by the enemy to be their mouthpiece to cause divisions so that they takeover the running of the country. So if as a party we make a decision, we stick with the decision, he said.\n\nIn his entire life in Government, he said, there was not a single time he had seen or heard the Vice Presidents General (Retired) Constantino Chiwenga and Colonel (Rtd) Kembo Mohadi and the National Chairman Cde Oppah Muchinguri-Kashiri being disrespectful to the President.\n\nCde Ziyambi said Zanu PF was a strong and resilient party that had always managed to deal with internal contradictions throughout its history by observing a strict disciplinary code that espouses the revolutionary ethos.\n\nDetractors of the party, he said, have waded into the partys 2030 Conference Resolution as if they were in the party.\n\nThey take the 2030 Resolution as if its theirs, or it has anything to do with them. This is a Zanu PF resolution and they start suggesting that so and so should be taking over, but there is no such provision in the Zanu PF constitution.\n\nIt doesnt talk of a sun that hasnt set and how the setting sun should set and how the rising sun should rise. There is no other sun that rises before the one that has risen sets, he said.\n\nThe Zanu PF constitution, said Cde Ziyambi, was clear on what happens when the incumbent is leaving.\n\nIf you find yourself having another chairman for Mash West when the incumbent (Cde Mary Mliswa-Chikoka) is still there, then there is a problem, he said.\n\nCde Ziyambi implored party members to be vigilant and ensure that their actions do not destabilise the party.\n\nCde Mliswa urged party members to shun social media groups that fan divisions in the party.\n\nShe said Zanu PF had laid down procedures, which should be followed.\n\nDeputy national political commissar Cde Webster Shamu said party members should shun abuse of social media as it had the potential to affect the party.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/10/Untitled-13-1.jpg",
            "description": "Walter Nyamukondiwa Mashonaland West Bureau Chief There is no chance of a crisis in ZANU PF for as long as the membership does not allow people outside the party to use them to speak on their behalf, Politburo member Cde Ziyambi Ziyambi has said. Addressing the Mashonaland West Provincial Coordinating Committee meeting in Chinhoyi yesterday, […]",
            "time": "09:30",
            "date": "17 Mar 2025"
        }
    ]
}