{
    "news": [
        {
            "title": "Grade 7 learner killed by kombi, body dumped at Chitungwiza Hospital",
            "url": "https://www.herald.co.zw/grade-7-learner-killed-by-kombi-body-dumped-at-chitungwiza-hospital/",
            "content": "Crime Reporter\n\nThe body of a 13-year-old boy who died after being hit by a commuter omnibus was dumped by the kombi crew at Chitungwiza Hospital on Sunday afternoon.\n\nThe incident occurred along New Chitungwiza Road when a Nissan Caravan hit the boy at around 13:52 hours.\n\nIn a statement, national police spokesperson Commissioner Paul Nyathi confirmed the incident.\n\nThe ZRP reiterates that motorists must stop, render first aid and report road traffic accidents to the police.\n\nThe ZRP is investigating a fatal road traffic accident in which a Grade 7 learner aged 13 died after being hit by a motorist who was driving a Nissan Caravan (registration number AGZ 0118), along New Chitungwiza Road on December 15.\n\nThe driver dumped the body and the kombi at Chitungwiza Hospital and fled. Anyone with information should report at the nearest police station, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/04/accident-6.jpg",
            "description": "Crime Reporter The body of a 13-year-old boy who died after being hit by a commuter omnibus was dumped by the kombi crew at Chitungwiza Hospital on Sunday afternoon. The incident occurred along New Chitungwiza Road when a Nissan Caravan hit the boy at around 13:52 hours. In a statement, national police spokesperson Commissioner Paul […]",
            "time": "09:46",
            "date": "18 Dec 2024"
        },
        {
            "title": "Goverment takes major steps in protecting children with disabilities",
            "url": "https://www.herald.co.zw/goverment-takes-major-steps-in-protecting-children-with-disabilities/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nIn a significant move to safeguard children with disabilities across Zimbabwe, Government, through the Ministry of Public Service, Labour and Social Welfare, has made notable strides with the introduction of the Disability Inclusive Parenting Programme.\n\nThis initiative, aimed at empowering caregivers, is transforming the way children with disabilities are cared for, particularly in remote districts, by replacing outdated superstitions with knowledge, skills and access to modern healthcare.\n\nLaunched in collaboration with UNICEF and the Zimbabwe Parents of Handicapped Children Association (ZPHCA), the programme is challenging long-held myths about disabilities while encouraging parents and caregivers to seek professional medical care for their children.\n\nThe programme provides training for caregivers, equipping them with the necessary tools to play an active role in their childrens rehabilitation.\n\nIt is funded by the Swedish International Development Agency (SIDA), which is committed to strengthening the capacity of caregivers and advocating for free access to disability-specialised services, ensuring no child with a disability is left behind.\n\nZPHCA programmes manager Mr Regis Manjoro said the initiative, which began during the Covid-19 pandemic when many children were unable to attend school, is having an impact.\n\nWhen schools were closed due to the pandemic, we took the opportunity to teach parents basic techniques to stimulate their childrens learning at home. This led to the establishment of stimulation centres focused on disability-inclusive parenting, in line with the National Disability Policy, he said.\n\nThe programme, which is running in Harare, Bulawayo, Zvishavane, BeitBridge, and Mutasa, has already seen the creation of 18 specialised centres.\n\nThese centres provide essential services such as physiotherapy and psychosocial support, helping children with disabilities not only to survive but thrive in a more inclusive environment.\n\nGovernments commitment to the cause reflects a broader effort to ensure that children with disabilities receive the protection and care they need, thereby marking a significant step forward in the fight for disability rights in Zimbabwe.\n\nThrough the initiative, Zimbabwe is paving the way for a more inclusive society where every child, regardless of their abilities, has the chance to live a fulfilling life.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Untitled-39.jpg",
            "description": "Ivan Zhakata Herald Correspondent In a significant move to safeguard children with disabilities across Zimbabwe, Government, through the Ministry of Public Service, Labour and Social Welfare, has made notable strides with the introduction of the Disability Inclusive Parenting Programme. This initiative, aimed at empowering caregivers, is transforming the way children with disabilities are cared for, […]",
            "time": "09:46",
            "date": "18 Dec 2024"
        },
        {
            "title": "Harare Wetlands Trust demands urgent decontamination of Lake Chivero",
            "url": "https://www.herald.co.zw/harare-wetlands-trust-demands-urgent-decontamination-of-lake-chivero/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nEnvironmental and water rights advocates, the Harare Wetlands Trust (HWT) have issued a 48-hour ultimatum to the City of Harare, the Environmental Management Agency (EMA) and the Upper Manyame Sub-Catchment Council (UMSCC) to immediately address the severe contamination of Lake Chivero to avoid a lawsuit.This comes after the recent deaths of numerous animals, including rhinos, zebras and wildebeests due to cyanobacteria poisoning.HWT said the continuous discharge of raw sewage into the lake by the City of Harare has created a toxic environment that poses significant risks to both wildlife and human health.In letters sent to the relevant authorities, HWT highlighted the constitutional rights of citizens to a safe and healthy environment.They emphasised the potential health hazards associated with consuming contaminated water and fish from the lake.The environmental group called upon the authorities to urgently facilitate decontamination and cease discharging sewerage into the water body.HWT said legal action will be taken if the authorities fail to comply with their demands.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Lake-Chivero-contamination.jpg",
            "description": "Ivan Zhakata Herald Correspondent Environmental and water rights advocates, the Harare Wetlands Trust (HWT) have issued a 48-hour ultimatum to the City of Harare, the Environmental Management Agency (EMA) and the Upper Manyame Sub-Catchment Council (UMSCC) to immediately address the severe contamination of Lake Chivero to avoid a lawsuit. This comes after the recent deaths […]",
            "time": "09:46",
            "date": "18 Dec 2024"
        },
        {
            "title": "Armed robber hits on cross-border traveller, gets 10 years in jail",
            "url": "https://www.herald.co.zw/armed-robber-hits-on-cross-border-traveller-gets-10-years-in-jail/",
            "content": "Thupeyo Muleya\n\nBeitbridge Bureau\n\nA 31-year-old man who is part of an armed robbery gang that is believed to be targeting cross-border travellers in South Africa has been jailed for an effective 10 years by a Beitbridge regional court.Nomore Shava was recently arrested after robbing a Beitbridge woman of a Toyota Runx vehicle, two cellphones and R6000 while in the company of two others who are still at large.\n\nThe woman had just arrived in Musina, South Africa, around 3am when Shava and crew pounced on her while armed with a gun.\n\nAlthough Shava denied the charge of armed robbery, Beitbridge regional magistrate Ms Charity Maphosa convicted him last Friday on the strength of the States evidence.\n\nProsecuting, Mr Willbrought Muleya said on November 5, a woman drove to Musina to visit a relative.\n\nAs she disembarked from her car, Shava and his two associates emerged and pointed a black pistol at her.\n\nThey then took two cell phones, car keys and R6000 and drove away. The stolen items were all worth R66000.\n\nThe matter was reported to the police in Musina and the complainant returned to Beitbridge where she did a SIM swap and managed to trace her phone to a local dealer in Dulivhadzimu.\n\nShe teamed up with cellphone dealers and located her phones. Shava had handed them over to a cellphone dealer to sell them on his behalf.\n\nThe court heard that Shava was expected to collect his money later that day from the cellphone dealer.\n\nAn ambush was then laid by the police. Shava was arrested when he came to collect his money.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/02/Jailed.jpg",
            "description": "Thupeyo Muleya Beitbridge Bureau A 31-year-old man who is part of an armed robbery gang that is believed to be targeting cross-border travellers in South Africa has been jailed for an effective 10 years by a Beitbridge regional court. Nomore Shava was recently arrested after robbing a Beitbridge woman of a Toyota Runx vehicle, two […]",
            "time": "09:46",
            "date": "18 Dec 2024"
        },
        {
            "title": "Kutsaga phases out hazardous agro-chemical",
            "url": "https://www.herald.co.zw/kutsaga-phases-out-hazardous-agro-chemical/",
            "content": "Edgar Vhera\n\nAgriculture Specialist Writer\n\nKUTSAGA Tobacco Research Centre has announced the phasing out of Ethylene Dibromide (EDB) in tobacco production with effect from December 31, citing its highly hazardous properties and potential negative impact on human and environmental health.\n\nIn a notice to tobacco growers, contractors, merchants and agro-chemical companies, Kutsaga said the move was necessary, as it ensured that the countrys tobacco meets international standards, hence the need stop the use of banned agro-chemicals forthwith.\n\nNo person shall treat any tobacco with a remedy which is not registered nor reap or offer for sale any tobacco treated with a non-registered remedy. Furthermore, any tobacco so treated will be destroyed without compensation to the grower, read the notice.\n\nEDB has been widely used for soil fumigation in tobacco farming for many years and its use will be phased out at the end of December 2024. There are, however, several alternative nematicides and soil fumigation formulations available for nematode control.\n\nKutsaga said new active ingredients were currently being evaluated to give growers a wide variety to select from.\n\nA list of 15 fungicides, growth regulators, herbicides, insecticides, nematicides and suckercides have been banned. These include benomyl, butralin, alachlor, dimethenamid, metolachlor, trifluralin, acephate, chlorpyrifos, fenvalerate, methamidophos, methomyl, monocrotophos, thiodicarb, aldicarb and pendimenthalin.\n\nThe list of approved agro-chemicals bears both the chemical and trade names of the products, company distributor, old and new certificate number, as well as the expiry date with October 18, 2027 being the last expiry date for sanctioned chemicals.\n\nThe list also includes fungicides, herbicides, suckericides, growth regulators and fertilisers, insecticides and nematicides.\n\nThe Tobacco Research Board as mandated by the Tobacco Marketing and Levy Act [Chapter 18:20] continually tests, approves and monitors all crop protection agents (CPAs) for use on tobacco under the pesticide approval scheme service (PASS).\n\nThis legislation has been used to destroy tobacco in the field or offered for sale where the regulations are infringed.\n\nAs over 90 percent of Zimbabwes tobacco crop is exported, therefore it must meet stringent international agro-chemical regulations for acceptance and maintenance of markets, especially in an increasingly competitive global market.\n\nFurthermore, compliance with global health standards, correct and safe use of crop protection agents as well as good agronomic practices in tobacco production are key to sustainable agriculture, Kutsaga further explained.\n\nAgro-chemicals not appearing in the table are either not currently countenanced by Kutsaga or have been removed from the list of approved agrochemicals based on the provisions of the PASS, which came into effect in 2011.\n\nKutsaga also encouraged farmers to refer to the flue-cured tobacco handbook for rates and recommendations and also be aware of the toxicity colour triangle codes.\n\nThe EDB discontinuation notice comes on the backdrop of projected record-breaking tobacco yields for the 2024/25 agriculture season, thanks to heightened prospects of a good rainfall season due to the forecast La Nina weather phenomenon and the increase in average prices in the 2024 marketing\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/09/Kutsaga.jpg",
            "description": "Edgar Vhera Agriculture Specialist Writer KUTSAGA Tobacco Research Centre has announced the phasing out of Ethylene Dibromide (EDB) in tobacco production with effect from December 31, citing its highly hazardous properties and potential negative impact on human and environmental health. In a notice to tobacco growers, contractors, merchants and agro-chemical companies, Kutsaga said the move […]",
            "time": "09:46",
            "date": "18 Dec 2024"
        },
        {
            "title": "Spices and herbs exports reach US$4m",
            "url": "https://www.herald.co.zw/spices-and-herbs-exports-reach-us4m/",
            "content": "Edgar Vhera\n\nAgriculture Specialist Writer\n\nEXPORT earnings from the spice and herbs segment of the horticulture sector hit US$4 million between January and September this year incited by a high demand for African products by European markets.\n\nStatistics from the Zimbabwe National Statistics Agency (ZimStats) show that the country has earned US$4 097 181 from the export of 1 965 368 kg of spices and herbs.\n\nDried, crushed or ground pepper, dried fruits of the genus capsicum or pimenta, crushed or ground fruits of genus capsicum or pimenta and chillies are among the products under the spices and herbs section.\n\nThe lockdown induced by the Covid-19 virus in 2019 resulted in many consumers being health conscious with the spices and herbs section endearing to a lot of consumers, who prefer nutrient rich products for healthy eating. This has resulted in the countrys spices and herbs export earnings rising a whopping 120 percent from US$ 2 345 948 in 2021 to US$5 171 898 in 2023.\n\nSource: ZimStats\n\nA local global good agronomic practice (Global GAP) certified and Sedex Members Ethical Trade Audit (SMETA) registered company, Dombera Farm, is supporting smallholder farmers to access international markets.\n\nDombera Farm managing director, Mrs Claire Bailey said her organisation provided farmers with top quality plant genetics to produce African Bird Eye Chilli and training on sustainable farming techniques that protect their natural resources and boost their income.\n\nAs one of the five lead firms in Zimbabwe selected to participate in the UK Trade Partnerships Programme (UKTP), Dombera Farm acts as a centralised hub to grade and package products, provides transport and ultimately creates market linkages. We currently have 70 smallholder farmers on seven hectares of land, said Mrs Bailey.\n\nThe growing appetite for spicy foods has resulted in Europe becoming the second biggest importer of dried chillies in the world and developing countries are the major producers. High quality and sustainably produced chillies fetch high prices on the market.\n\nZimbabwe produces chillies with no artificial colours or flavours under high adherence to environmental and international standards. The countrys unique selling point is the slow grown, mountain chillies of superior colour and taste, sustainably produced by smallholder farmers under high environmental standards.\n\nRecently, the centre for the promotion of imports from developing countries (CBI) said the global supply of spices was changing and disrupting the European supply chain.\n\nShipping issues (Red Sea obstruction) are causing delays and extra supply costs, consumption growing faster than production in key producing origins (Indonesia, India, China) and crop failure (floods and droughts) as a result of climate change are causing this disruption.\n\nMany African countries have good climatic conditions for growing spices and are nearer than the traditional sources like India or Indonesia, the analysis showed.\n\nIt revealed that European imports from Africa had been on an upward trajectory from 2020 to 2023 with capsicum, ginger, seeds of anise, cloves and coriander seeds being the most traded spices.\n\nThe top five African exporting countries to Europe are Zambia, Egypt, Madagascar, Nigeria and Morocco.\n\nThe main success factors for African spices to capture the EU market are compliance with EU quality regulations, embracing sustainability, investing in market development and adoption to customer needs.\n\nMain hazards in spices are residues of agro-chemicals exceeding EU maximum residue levels (MRL), microbiological hazards, salmonella, mycotoxins, authenticity and food-approved packaging and correct labelling.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/zimstate-680x380.jpeg",
            "description": "  Edgar Vhera Agriculture Specialist Writer EXPORT earnings from the spice and herbs segment of the horticulture sector hit US$4 million between January and September this year incited by a high demand for African products by European markets. Statistics from the Zimbabwe National Statistics Agency (ZimStats) show that the country has earned US$4 097 181 […]",
            "time": "09:46",
            "date": "18 Dec 2024"
        },
        {
            "title": "Positive start for pilot cotton seed trading on ZMX",
            "url": "https://www.herald.co.zw/positive-start-for-pilot-cotton-seed-trading-on-zmx/",
            "content": "Edgar Vhera\n\nAgriculture Specialist Writer\n\nBuyers purchased 401 tonnes of cotton at an average price of US$223 per tonne following the convergence of cotton seed bids and offers at the Zimbabwe Mercantile Exchange (ZMX)s pilot trading of the commodity this season.\n\nThis follows the Governments recent decision to add cotton and its by-products to the basket of commodities to be traded under the ZMX warehouse receipt system (WRS) to aid in financial inclusion and price discovery following the gazetting of Statutory Instrument (SI) 173 of 2024, Warehouse Receipt Act (Chapter 18:25), substitution of schedule notice 2024.\n\nZMX chief executive officer, Mr Collen Tapfumaneyi said the pilot cotton seed trading followed the successful registration of suppliers and cotton merchants as potential buyers of cotton seed on the ZMX platform.\n\nFive depots were inspected and successfully registered by the registrar of warehouses and these were certified by ZMX, marking a major milestone for the project.\n\nAfter warehouse certification, warehouse receipts for the cotton seed were issued after the weighing and grading of the available cotton seed, he said.\n\nStatistics from ZMX show that no trade was recorded on the first day due to a price deadlock.\n\nThe second and third auctions had an average closing price of US$220 per tonne with the final pilot auction closing at an average price of US$223 per tonne.\n\nA total of 401 tonnes of cotton seed was traded during these auctions, according to the figures.\n\nMr Tapfumaneyi said the ZMX auction platform effectively showcased the price discovery process, featuring the active involvement of both large and small merchants.\n\nParticipants provided positive feedback, demonstrating to ZMX that the industry is now prepared for full engagement with the platform after the next harvest, he said.\n\nAgriculture expert and Stockfeed Manufacturers Association of Zimbabwe (SMAZ) executive administrator, Dr Reneth Mano said the introduction of the ZMX spot market auction system for cotton seed was a good move, which had been long overdue.\n\nThe arrival of ZMX auction for cotton seed heralds a new era for cotton farmers, as it presents to farmers and Government new ways for organised cotton farmers associations to market their crop and unlock value, especially where the Cotton Company of Zimbabwe (Cottco) and other private cotton ginneries offer toll ginning services to cotton farmers.\n\nAn appropriately structured ZMX auction system can offer cotton farmers the opportunity to interface directly with final buyers of the three tradable cotton products (bales of seed cotton straight from the field, bales of ginned cotton lint and tonnes of ginned cotton seeds) and get paid for their cotton products directly through ZMX auction system without burdening Treasury, Dr Mano said.\n\nToll ginning of cotton bales at ginneries for a fee will allow organised cotton farmers to process their seed cotton into lint and cotton seed, both of which are internationally valuable and highly tradable products.\n\nWhen ZMX spot market auction floors are open to both domestic and global buyers, cotton farmers will secure globally competitive export prices for cotton seed of US$223 per tonne and for cotton lint US$1 656 per tonne free on board (FOB).\n\nWhen fully operational, the ZMX auction system has the potential to increase the net incomes of organised cotton farmers by 55 percent through selling ginned products directly to domestic and global off-takers, he explained.\n\nDr Mano believes the making of ZMX the central domestic spot auction market for all cotton products was the global best practice and recipe for stimulating sustained market-driven growth in Zimbabwes cotton production.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/old1-680x380.png",
            "description": "Edgar Vhera Agriculture Specialist Writer Buyers purchased 401 tonnes of cotton at an average price of US$223 per tonne following the convergence of cotton seed bids and offers at the Zimbabwe Mercantile Exchange (ZMX)’s pilot trading of the commodity this season. This follows the Government’s recent decision to add cotton and its by-products to the […]",
            "time": "09:46",
            "date": "18 Dec 2024"
        },
        {
            "title": "‘2024 Cabinet calendar a success’ . . . We implemented impactful policies: President",
            "url": "https://www.herald.co.zw/2024-cabinet-calendar-a-success-we-implemented-impactful-policies-president/",
            "content": "Zvamaida Murwira-Senior Reporter\n\nGovernment has made headway in advancing a people-centred national development agenda through initiating policies and projects that have great impact on the collective aspirations of all Zimbabweans, President Mnangagwa has said.\n\nThe President made the remarks at State House yesterday while addressing the last Cabinet meeting for this year.\n\nToday marks the last Cabinet Meeting for the 2024 Cabinet Calendar. A synopsis of the business transacted during the year reveals that, as Government, we have made notable headway in our people-centred national development agenda. In this respect, during the course of the year, we crafted, reviewed and implemented impactful policies, programmes as well as projects in our quest to fulfil the collective aspirations of our citizens. In a nutshell, the 2024 Cabinet Calendar was a success, with its robust and frank deliberations, said the President.\n\nThese discussions were facilitated by the greatly improved quality of memoranda submitted to Cabinet. Guided by the principle of collective responsibility, it was pleasing that as ministers, you rose above your respective sectoral interests, in favour of objectivity and the common national good, with coordination being more seamless. Congratulations.\n\nPresident Mnangagwa chronicled several achievements registered during the year in different sectors that include, energy, agriculture and health.\n\nHe said adequate grain continued to be distributed to citizens under the food deficit mitigation programme following the declaration of a State of Disaster for the 2023-2024 Summer Season, due to the El Nino-induced drought.\n\nThe timely delivery of food aid as well as agriculture inputs to our people at the grassroots level must be prioritised while complaints that transport costs are sometimes passed on to our people, must be honestly addressed. I, therefore, challenge the relevant Ministries, Departments and Agencies to apply themselves and devise strategies that will increase transport and logistical efficiency in getting aid and support to our people, he said.\n\nOn health, President Mnangagwa commended stakeholders in the sector for implementing multi-pronged intervention measures which saw the country combat the cholera outbreak during the first half of the year.\n\nHe said mechanisms were in place to deploy the recently approved Multi-Hazard Contingency Plan to curtail the effects of floods and other national disaster emergencies.\n\nI call upon you to provide leadership and assist your communities to mitigate damage and harm to property and life in the wake of the ensuing rainfall season. On the economic front, the revision of economic growth projections, on the back of the El Nino-induced droughts negative impact on agricultural output, was inevitable. However, we remain resolute and optimistic that the fiscal and monetary reforms introduced during the year will increasingly underpin currency stability and usher economic rebound, he said.\n\nTurning to the energy sector, President Mnangagwa said while there was a shortage of power owing to low generation at Kariba Hydropower Station, the improved use and exploitation of renewable energy sources in the country, particularly solar by companies and households, continued to reduce national grid power demand.\n\nThe initiatives by ZESA through new models of Independent PowerProducers are welcome moves to crowd in the private sector in power generation, specifically for their respective energy needs. More campaigns should be mounted to encourage our people, in both rural and urban areas to adopt renewable energy for domestic use,\n\nOn housing, President Mnangagwa said the Government will continue to channel resources towards housing delivery, as well as the upgrading and rehabilitation of both residential and institutional accommodation nationwide.\n\nThe strides made by local authorities during the course of the year are commendable. These include the conclusion of Master Plans by most local authorities. There are also glimpses of mindset change within that sector. Regrettably, cases of corruption emanating from the sector remain worrisome. The bold decision by Harare City Council to transfer waste disposal and management to private entities should be supported and replicated in other local authorities. Quality service delivery to our citizens remains the core objective, said President Mnangagwa.\n\nThe decentralisation and devolution agenda, said President Mnangagwa, has led to an improved standard of life and living environments for people with enhanced basic social services infrastructure.\n\nHe said the Government will continue prioritising the digital economy and empowerment of youths, women and small to medium enterprises.\n\nPresident Mnangagwa also called for innovative financing models to accelerate the reconstruction of the Mbare Traders Market following a fire incident that gutted the place recently.\n\nThe digital technology revolution is the cornerstone of modernisation, industrialisation and efficient service delivery to drive sustainable economic growth, he said.\n\nHowever, the digitalisation of Government information and services was occurring at a slow pace, something he said was worrisome.\n\nPresident Mnangagwa implored Ministers to ensure that Government continues to provide service to the public during the Cabinet break.\n\nAs Cabinet takes a well-deserved break, let us take note that we are not shutting down Government business and the subsequent delivery of service. Mechanisms must be put in place to balance the demands of a family and associated festivities with serving the people of our great motherland, Zimbabwe. The service delivery demands of the people of Zimbabwe must be responded to timely. After all, we are a Government by the people and for the people, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/President-Mnangagwa-cabinet.jpg",
            "description": "Zvamaida Murwira-Senior Reporter Government has made headway in advancing a people-centred national development agenda through initiating policies and projects that have great impact on the collective aspirations of all Zimbabweans, President Mnangagwa has said. The President made the remarks at State House yesterday while addressing the last Cabinet meeting for this year. “Today marks the […]",
            "time": "09:46",
            "date": "18 Dec 2024"
        },
        {
            "title": "President cracks whip on errant ministers",
            "url": "https://www.herald.co.zw/president-cracks-whip-on-errant-ministers/",
            "content": "Zvamaida Murwira-Senior Reporter\n\nPresident Mnangagwa yesterday slammed some ministers for failing to attend Cabinet meetings and committees, saying they should toe the line or risk appropriate consequences.\n\nHe said it was critical for Cabinet ministers to realise that Cabinet meetings take precedence over all other businesses they might have.\n\nThe President said this yesterday while addressing the last Cabinet meeting for the year.\n\nHe said while most ministers rose above their respective sectoral interests in favour of achieving the common national good, there was a worrisome tendency by some ministers and senior Government officials who were not attending meetings.\n\nLet me however, hasten to emphasise that Cabinet processes are anchored on the timely submission of vital documents and regular attendance by Ministers and officials. These include both ad-hoc as well as standing Cabinet Committees. The worrisome tendency by Ministers and senior officials to absent themselves from meetings is untenable, said President Mnangagwa.\n\nIn some cases, junior officials are delegated to attend and merely warm bench the meetings. This culture is tantamount to dereliction of duty. Permanent Secretaries should ensure that in their absence, only directors and above should attend working party meetings.\n\nHe directed the Chief Secretary in the Office of the President and Cabinet, Dr Martin Rushwaya to monitor Ministers attendance of the meetings.\n\nIn the 2025 calendar year, the Chief Secretary is directed to strictly monitor individual attendance and ensure that errant Ministers and officials toe the line or risk dire consequences. Ministers should remain mindful that Cabinet business takes precedence over all other business, said President Mnangagwa.\n\nHe said Deputy Ministers should be adequately briefed to help them represent the Government when they attend meetings.\n\nIn cases where Deputy Ministers are assigned, they should be adequately capacitated to enable active participation in the requisite deliberations.\n\nTo this end, I direct that in the 2025 programme cycle and going forward, Deputy Ministers must now sign performance contractors. It is incumbent upon Ministers to ensure that their deputies are comprehensively briefed on Government business and given the latitude for effective involvement, he said.\n\nA few years ago, President Mnangagwa introduced performance contracts for Cabinet Ministers, Permanent Secretaries and heads of parastatals and State entities as a way of encouraging hard work and results oriented workmanship.\n\nHe has also been conferring awards to top-performing Ministers, Permanent Secretaries, and heads of Government departments as the Second Republic continues to foster a culture of excellence, work ethic and servant leadership in its quest to attain Vision 2030.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Ministers-at-Cabinet-meeting.jpg",
            "description": "Zvamaida Murwira-Senior Reporter President Mnangagwa yesterday slammed some ministers for failing to attend Cabinet meetings and committees, saying they should toe the line or risk appropriate consequences. He said it was critical for Cabinet ministers to realise that Cabinet meetings take precedence over all other businesses they might have. The President said this yesterday while […]",
            "time": "09:46",
            "date": "18 Dec 2024"
        },
        {
            "title": "One million rural homes to get solar power",
            "url": "https://www.herald.co.zw/one-million-rural-homes-to-get-solar-power/",
            "content": "Rumbidzayi Zinyuke-Senior Reporter\n\nA solar power initiative is poised to transform the lives of over one million rural households across eight provinces by providing reliable and sustainable energy.\n\nThe implementation plan for the Presidential Rural Solarisation Project received Cabinet approval yesterday, with roll-out expected to commence next year.\n\nDuring a post-Cabinet media briefing, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere said the project sought to provide solar power to at least 200 000 households annually over the next five years.\n\nCabinet approved the Presidential Solarisation Project which is a livelihoods initiative aimed at providing sustainable renewable solar energy to household beneficiaries in the eight rural provinces of the country. The project targets approximately 200 000 beneficiaries a year and will run for a period of five years starting from 2025, he said.\n\nThis initiative is expected to enhance energy access, improve living conditions, and promote sustainable development in rural communities.\n\nThe project is part of the broader Rural Development 8.0 Strategy, with a goal to uplift rural livelihoods, enhance agricultural productivity, and boost food security.\n\nDr Muswere said the Rural Infrastructural Development Agency (RIDA) will oversee the implementation of the project through an Inter- Ministerial Steering Committee architecture comprising experts from local universities.\n\nThe project will be financed by the Government and other stakeholders and will provide affordable but advanced solar technologies (batteries, inverters, solar panels and cables) to power gadgets such as light bulbs, radios, televisions, phone chargers, laptops, small refrigerators, submersible pumps and Wi-Fi, he said.\n\nHe said local youths and women will be trained to participate in the installation programmes implemented in the districts and villages across the eight rural provinces of the country.\n\nZimbabwes traditional power generation infrastructure is currently facing challenges in meeting the national electricity demand.\n\nWhile the refurbishment and expansion of the Kariba and Hwange power plants are underway, Government is also pushing increased uptake of renewable energy to close the gap.\n\nThe key step toward improving renewable energy comes at a time when the Zimbabwe and many other countries in the Southern African region have been hit by successive droughts, reducing the amount of electricity generated through hydro power.\n\nThrough the National Renewable Energy Policy, Zimbabwe aims to achieve 1100MW of renewable energy capacity by 2025.\n\nThe Presidential Solarisation Project is one such key intervention which is expected to boost domestic productivity and create employment opportunities in rural communities in line with Vision 2030.\n\nIt also complements other projects already underway including the Gwanda Solar Project and the US$250 million floating solar plant to be built in the Kariba Dam.\n\nZimbabwes renewable energy transition aligns perfectly with global sustainable development goals, particularly SDG 7 which speaks to affordable and clean energy and SDG 13 on Climate Action.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Dr-Muswere-Post-Cabinet-briefing.jpg",
            "description": "Rumbidzayi Zinyuke-Senior Reporter A solar power initiative is poised to transform the lives of over one million rural households across eight provinces by providing reliable and sustainable energy. The implementation plan for the Presidential Rural Solarisation Project received Cabinet approval yesterday, with roll-out expected to commence next year. During a post-Cabinet media briefing, Information, Publicity […]",
            "time": "09:46",
            "date": "18 Dec 2024"
        }
    ]
}