{
    "news": [
        {
            "title": "Protests flop . . . Peace prevails nationwide . . . Govt commends Zimbabweans for ignoring illegal demos",
            "url": "https://www.herald.co.zw/protests-flop-peace-prevails-nationwide-govt-commends-zimbabweans-for-ignoring-illegal-demos/",
            "content": "Herald Reporters\n\nA PLANNED demonstration that had been called for yesterday by former Zanu PF Central Committee member, Blessed Geza, was a monumental flop as Zimbabweans chose to uphold the peace and tranquillity prevailing in the country.\n\nPeace prevailed nationwide, with no meaningful demonstrations recorded as it was business as usual.\n\nSchools were open and learners attended classes as usual.\n\nThe day served as a testament to the resilience and commitment of Zimbabweans to maintain harmony in their communities, despite the call for unrest.\n\nInformation, Publicity and Broadcasting Services Minister Dr Jenfan Muswere expressed gratitude to the general citizenry for choosing to maintain law and order in the country.\n\nInformation, Publicity and Broadcasting Services Minister Dr Jenfan Muswere expressed gratitude to the general citizenry for choosing to maintain law and order in the country.\n\nWe would like to thank all Zimbabweans for the peace and tranquillity experienced throughout the country. It was business as usual.\n\nThe illegal primary wish of the cyber terrorists did not materialise, he said.\n\nDr Muswere rallied the nation to remain united, vigilant and steadfast.\n\nAs we continue to appreciate the role of the security sector in the maintenance of law and order, we must remain united, vigilant and steadfast against any attempts to disrupt development.\n\nTogether we have a shared responsibility to develop our country.\n\nWe are masters of our destiny. Nyika inovakwa nevene vayo/Ilizwe lakhiwa, libuswe, likhulekelwe ngabanikazi balo, he said.\n\nNational police spokesperson Commissioner Paul Nyathi told The Herald last night that the situation was generally calm countrywide.\n\nThe situation was generally calm today (yesterday) and we would want to applaud the public for being responsible and shunning any acts of disorder. We will however, be issuing out a comprehensive statement tomorrow (today) morning, he said.\n\nComm Nyathi implored the public to ignore the misinformation being peddled on social media platforms.\n\nThe ZRP reiterates that the situation in Harare CBD is normal and calm including at Robert Mugabe Square where some social media sites are falsely claiming that there are people barricading roads with stones.\n\nThis is not correct.\n\nThe public should ignore calls by individuals and syndicates through some social media sites to engage in unlawful public gathering activities. The police warn social media sites against the circulation of old videos with the aim of causing alarm and despondency in the country, he said.\n\nEarlier in the day, Comm Nyathi had said the ZRP assures the public that the situation in the country is peaceful.\n\nAs police officers conduct patrols, the public should feel free to embark on their day to day activities.\n\nHe said people were conducting their day to day businesses without any hassles and that police will remain firm on the ground.\n\nComm Nyathi warned some online media outlets against circulating old videos alleging that they were demonstrations that were going on in some cities, especially Bulawayo.\n\nHe said some of these videos are meant to cause despondency and alarm among the public.\n\nThe ZRP warns Zim/Global Eye WhatsApp Channel against circulating old videos of alleged demonstrations in Bulawayo today. Bulawayo is calm and peaceful. The public should ignore the video posted by Zim/Global Eye WhatsApp Channel as it is false. Facts on the ground in Bulawayo clearly speak for themselves. Police officers are fully deployed on the ground, Comm Nyathi said.\n\nIn Masvingo it was business as usual residents and businesses operated normally in a peaceful and tranquil environment.\n\nNo incidences of violence were reported in Masvingo City and other parts of the province where people conducted their business as usual while major shops and supermarkets including banks were open like any normal day.\n\nSchools also conducted lessons just like any other day with pupils reporting for classes at institutions such as Victoria Primary and High schools, Masvingo Christian and Mucheke High schools in Mucheke.\n\nThe majority of small shops that trade in motor vehicle spare parts and building materials were also open together with pharmacies.\n\nVehicular traffic in the city centre was around 70 percent in Masvingo City from morning which indicated that people were going about their business as usual.\n\nOnly a limited number of small shops were closed in the city centre while it was all calm in the suburbs with residents going about their business.\n\nMasvingo provincial police spokesperson Inspector Kudakwashe Dhewa said there had been no incidents of violence or disturbances since morning across the province.\n\nEverything is quiet and normal and people are going about their business peacefully. We have not received a single report of violence and disturbances and we continue to monitor the situation closely, said Insp Dhewa.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Customers-buying-food-after-work-680x380.jpg",
            "description": "Herald Reporters A PLANNED demonstration that had been called for yesterday by former Zanu PF Central Committee member, Blessed Geza, was a monumental flop as Zimbabweans chose to uphold the peace and tranquillity prevailing in the country. Peace prevailed nationwide, with no meaningful demonstrations recorded as it was business as usual. Schools were open and […]",
            "time": "08:45",
            "date": "01 Apr 2025"
        },
        {
            "title": "Justice Ndewere dismissal above board: ConCourt",
            "url": "https://www.herald.co.zw/justice-ndewere-dismissal-above-board-concourt/",
            "content": "Fidelis Munyoro-Chief Court Reporter\n\nThe Constitutional Court (ConCourt) has declared that President Mnangagwa acted within his constitutional mandate when he dismissed former High Court judge Justice Erica Ndewere.\n\nThis decision followed a tribunals recommendation, four years ago, that she be removed from office due to gross incompetence.\n\nJustice Ndewere had challenged her dismissal before the Constitutional Court, seeking a declaration that the President had not fulfilled his constitutional obligations when he removed her from the bench on 17 June 2021.\n\nShe also sought reinstatement as a judge, with back pay and benefits, arguing that the tribunals recommendation was invalid and unlawful.\n\nRepresented by Ms Beatrice Mtetwa, Ndewere contended that the tribunal had overstepped its authority and failed to follow the procedures outlined in the Constitution and the Judicial Service (Code of Ethics).\n\nThe Constitutional Court, consisting of Justices Paddington Garwe, Rita Makarau, Anne-Mary Gowora, Ben Hlatshwayo, Bharat Patel, Tendai Uchena, and Nicholas Mathonsi, ruled unanimously against her.\n\nJustice Garwe, delivering the judgment, stated that the President had acted by section 187 of the Constitution. The court found no legal basis for Ndeweres claim and dismissed her application.\n\nThere can be no gainsaying that the President fulfilled his constitutional obligations in section 187 of the Constitution. In the circumstances, the applicant has no cause of action against the President, ruled Justice Garwe.\n\nJustice Garwe further observed that Ndeweres application failed to comply with well-established legal principles.\n\nHe remarked: An applicant who seeks to vindicate a constitutionalright by impugning the conduct of a State functionary must identify the functionary and the impugned conduct with reasonable precision. In the present matter, there has been glaring failure on the part of the applicant to comply with this very clear position of the law.\n\nNdewere had argued that her removal violated her right to equality before the law, claiming she was treated differently from other judges who had faced disciplinary proceedings.\n\nShe alleged that Chief Justice Luke Malaba bypassed the requirement to appoint a panel of three judges to investigate the allegations against her, as mandated by the Judicial Service (Code of Ethics). She also claimed that the charges presented by the Judicial Service Commission (JSC) and the tribunal were inconsistent and discriminatory.\n\nMs Mtetwa argued that the tribunal and the JSC had failed to follow the proper procedures, rendering their recommendations unlawful.\n\nShe submitted that the President should not have acted on the tribunals advice without ensuring that all constitutional processes had been observed.\n\nHowever, the court rejected these arguments, emphasising that the Presidents role, under section 187(8) of the Constitution, is to act on the tribunals recommendations without questioning their validity.\n\nMrs Venrandah Munyoro, representing the President, maintained that the Constitution does not grant the President discretion to assess the legality of the tribunals processes.\n\nShe argued that the President had fulfilled his constitutional duty by implementing the tribunals recommendations, as required by law.\n\nThe court also noted that Ndeweres application failed to meet the legal standard for challenging the Presidents actions.\n\nJustice Garwe referred to a previous case, Joyce Teurai Ropa Mujuru v The President of Zimbabwe & Five Others, to highlight the need for applicants to identify the constitutional obligation at issue and demonstrate how it was violated.\n\nHe stated that Ndeweres application lacked specificity and precision, rendering her claim untenable.\n\nThe court concluded that Ndewere did not establish a valid cause of action against the President.\n\nDespite the serious accusations Ndewere made against the Chief Justice, the JSC, and the tribunal, she did not cite them as respondents.\n\nJustice Garwe described this omission as significant and noted that it undermined her case.\n\nThe court ruled that no costs would be awarded, considering the circumstances of the matter.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/07/justice-erica-ndewere.jpeg",
            "description": "Fidelis Munyoro-Chief Court Reporter The Constitutional Court (ConCourt) has declared that President Mnangagwa acted within his constitutional mandate when he dismissed former High Court judge Justice Erica Ndewere. This decision followed a tribunal’s recommendation, four years ago, that she be removed from office due to gross incompetence. Justice Ndewere had challenged her dismissal before the […]",
            "time": "08:45",
            "date": "01 Apr 2025"
        },
        {
            "title": "Land barons to lose ill-gotten real estate",
            "url": "https://www.herald.co.zw/land-barons-to-lose-ill-gotten-real-estate/",
            "content": "Nyore Madziyanike\n\nLand barons and institutions pursuing unclaimed and idle land across the nation since independence have found themselves exposed following a landmark ruling from the High Court, making it mandatory for Government to provide maps for all land.\n\nThis pivotal decision empowers the State to take ownership of such land.\n\nRecently, Justice Pisirai Kwenda issued a ruling that seeks to reshape land ownership and distribution in the country.\n\nThe ruling obliges the Surveyor General to provide maps and diagrams of these parcels upon State request, facilitating title registration under the Deeds Registry Act.\n\nJustice Kwenda granted both declaratory and consequential relief in the case in which The Registrar of Deeds and the Surveyor General were named as first and second respondents.\n\nIt is confirmed that the pieces of land known as Stands numbers 105 to 120 under Surveyor Generals Diagram S.G. Number 894/76 and General Plan BG3178, located in Waterfalls Induna Township 6 of Lot 10 of Waterfalls, Salisbury, belong to the State.\n\nThe First Respondent is ordered to register title to the aforementioned land in the name of the State in accordance with the Deeds Registry Act.\n\nThe Second Respondent is instructed to provide all necessary diagrams related to the land to the Applicant for the purpose of conveying title to the State.\n\nThis ruling follows an application by Prosecutor-General Justice Loyce Matanda-Moyo to the High Court for a declaratory and consequential relief order aimed at reclaiming and safeguarding State land.\n\nIn her application, prepared by Chief Law Officer Mr Chris Mutangadura, the Prosecutor General highlighted a prime parcel of land in Waterfalls, Harare, registered in 1977 as Induna Township 6 of Lot 10.\n\nThis land has drawn the interest of land barons due to its ambiguous status.\n\nCourt documents reveal that the Prosecutor Generals involvement was prompted by a tip-off from a whistle-blower regarding the property, leading to an investigation into its ownership.\n\nThe Prosecutor General obtained a copy of the Surveyor-Generals diagram and contacted the Registrar of Deeds in January 2022 to ascertain whether the land was privately owned or held by any entity.\n\nInvestigations determined that no title deed had ever been issued for the land, confirming its status as unclaimed and unoccupied.Further inquiries by the police revealed that the City of Harare had no record of the lands allocation, producing only a 1976 document indicating that the property had been surveyed and earmarked for development, without naming a beneficiary.\n\nIn her application, Justice Matanda-Moyo asserted her constitutional duty under Section 258 to prosecute individuals targeting State land.\n\nIt is clear that the applicant, under Section 258 of the Constitution of Zimbabwe, is mandated by law to undertake any necessary functions related to the prosecution of persons who have set their sights on idle land, which, for all intents and purposes, belongs to the State, the application states.\n\nIn Zimbabwe, land ownership falls into various categories: urban or town land held through title deeds, rural district land managed through leases or permits, agricultural land under title deeds, and communal land overseen by traditional leaders.\n\nThe land in question lacks clarity regarding ownership and the supposed owner, said Justice Matanda-Moyo.\n\nThe State remains uncertain as to whether it or the Harare City Council governs the land. Furthermore, no one possesses or occupies the land. While the applicant could have proceeded under the Money Laundering Act, the circumstances do not reveal any identifiable individual, aside from the whistle-blower information indicating that land barons target any available space, exploiting the States ignorance regarding its land.\n\nShe further argued that the land qualifies as res nullius, or property without an owner, and is thus subject to State protection.\n\nAn application for title registration under Section 3, in conjunction with Section 7 of the Titles Registration and Derelict Lands Act, is not valid, as the land has never been lawfully owned or possessed by anyone. This property has mysteriously eluded both the relevant ministry and the Derelict Lands Board, established under the Land Acquisition Act to investigate and manage derelict land in accordance with the provisions of the Act.\n\nJustice Matanda-Moyo argued as it stands, this property remains unacquired by the Government despite allegations suggesting its abandonment.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/01/High-court.jpg",
            "description": "Nyore Madziyanike Land barons and institutions pursuing unclaimed and idle land across the nation since independence have found themselves exposed following a landmark ruling from the High Court, making it mandatory for Government to provide maps for all land. This pivotal decision empowers the State to take ownership of such land. Recently, Justice Pisirai Kwenda […]",
            "time": "08:45",
            "date": "01 Apr 2025"
        },
        {
            "title": "Zanu PF Harare recommends Tagwirei for Central Committee co-option",
            "url": "https://www.herald.co.zw/zanu-pf-harare-recommends-tagwirei-for-central-committee-co-option/",
            "content": "Joseph Madzimure-Zimpapers Politics Hub\n\nTHE Zanu PF Harare provincial executive has recommended the co-option of businessman Cde Kudakwashe Tagwirei into the ruling partys Central Committee.\n\nThe Central Committee is the principal organ of Congress which acts on its behalf when it is not in session. Among other things, it implements all policies, resolutions, directives, decisions and programmes enunciated by Congress.\n\nCde Tagwirei is one of Zimbabwes most prominent businesspersons with interests in several sectors, including energy, mining, transport, construction and agriculture.\n\nCde Tagwirei\n\nHe is the founder and chief executive officer of the petroleum giant, Sakunda Holdings Group, and over the years, has expanded his business empire to cover key sectors of the economy.\n\nSpeaking at the Zanu PF Harare Provincial Co-ordinating Committee (PCC) meeting at the partys offices in the capital yesterday, provincial chair Cde Godwills Masimirembwa said members of the Central Committee in Harare had proposed that Cde Tagwirei be recommended for co-option into the Central Committee of Zanu PF.\n\nCde Tagwirei is a party member in the Harare Metropolitan Province. He is a well-known business strategist, he said. According to Cde Masimirembwa, Cde Tagwireis forward-thinking business leadership will bring immense value to the party.\n\nHe described Cde Tagwirei as an indispensable force, destined to spearhead a new era of economic prosperity for the party.\n\nSo, the proposal was put forward by members of the Central Committee and the PCC unanimously agreed to recommend him for co-option into the Central Committee of Zanu PF. We are going to submit this recommendation to the partys Secretary General Dr Obert Mpofu stating that this is the recommendation from Harare Province, said Cde Masimirembwa.\n\nHe also revealed that President Mnangagwa had encouraged the province to hold two PCC meetings: one for economic issues and one for political issues.\n\nZanu PF Harare province deputy secretary for Economic Development Cde Andy Mhlanga said Cde Tagwirei has been a long-time benefactor of the party and as such, the moment is opportune for him to assume a leadership position.\n\nZanu PF Harare Youth chairman, Cde Emmanuel Mahachi, commended the decision taken by the province and said Cde Tagwirei has been instrumental in mobilising resources for the party.\n\nWe are happy that Cde Tagwirei will give advice and direction in the growth of the party. He is always available in times of need for the party. We support the co-option of Cde Tagwirei into the highest party organ, said Cde Mahachi.\n\nThe PCC also co-opted Cde Voyage Dambuza as the Harare province Political Commissar taking over from Cde Kudakwashe Damson, who is now an ordinary card-carrying member.\n\nMeanwhile, Cde Masimirembwa also revealed that the PCC conducted its meeting peacefully, as the majority of Zimbabweans shunned calls for street protests by fugitive ex-Zanu PF Central Committee member Blessed Geza.\n\nThe province, he said, is fully behind the visionary leadership of President Mnangagwa to continue working towards fulfilling Vision 2030 of an upper-middle-income economy.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Cde-Masimirembwa-680x380.jpg",
            "description": "Joseph Madzimure-Zimpapers Politics Hub THE Zanu PF Harare provincial executive has recommended the co-option of businessman Cde Kudakwashe Tagwirei into the ruling party’s Central Committee. The Central Committee is the principal organ of Congress which acts on its behalf when it is not in session. Among other things, it implements all policies, resolutions, directives, decisions […]",
            "time": "08:45",
            "date": "01 Apr 2025"
        },
        {
            "title": "Zimbabwe rice production gets major boost . . . as First Lady effort yields results",
            "url": "https://www.herald.co.zw/zimbabwe-rice-production-gets-major-boost-as-first-lady-effort-yields-results/",
            "content": "Tendai Rupapa-Senior Reporter\n\nJAPAN through its International Cooperation Agency (JICA) has expanded its New Rice for Africa (Nerica) production sites in Zimbabwe, which were secured by Agric4She patron First Lady Dr Auxillia Mnangagwa during her 2022 visit to Japan.\n\nCurrently, there are 28 sites in several provinces across the country where the production of Nerica is taking place, fulfilling Dr Mnangagwas dream for Zimbabwe to produce rice on a large scale to reduce reliance on imports and improve food security.\n\nThis was revealed when Japanese Ambassador to Zimbabwe Mr Shinichi Yamanaka, the JICA resident representative Mr Shigeki Furuta, and other Japanese officials paid a courtesy call on the First Lady at her offices yesterday.\n\nThey expressed confidence in Zimbabwes agricultural sector, especially the Agric4She programme, saying they intended to partner Dr Mnangagwa in sesame production under the programme supporting female farmers particularly in drought-prone areas, with a focus on exporting the crop to Japan.\n\nThe delegation also expressed its keen interest to partner the First Lady in the health sector, education, cultural heritage, tourism, and women empowerment.\n\nAmbassador Yamanaka said Amai Mnangagwa was an inspiration through her sterling work in the mentioned areas.\n\nNerica rice is a disease- and drought-resistant African-Asian hybrid.\n\nIn 2022, Dr Mnangagwa attended the Asia Pacific Africa Womens Economic Exchange Summit in Japan, which explored ways of securing food self-sufficiency.\n\nIt is during this conference that Dr Tatsushi Tsuboi, an expert in rice production, made a presentation on Nerica production in African countries and how women were playing an active role in its production.\n\nZimbabwe, however, was not mentioned as a beneficiary of the rice production prompting Amai Mnangagwa to hold side meetings with Dr Tsuboi and other JICA senior officials, during which she requested Nerica rice production initiatives in Zimbabwe.\n\nThe following year, she invited Dr Tsuboi to Zimbabwe to lay the groundwork for large-scale rice production.\n\nWhen the experts came, Dr Mnangagwa roped in the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development to make the rice venture possible.\n\nToday, Zimbabwe is reaping huge benefits from the First Ladys hard work.\n\nThe ambassador informed the First Lady on the current position of Nerica production.\n\nWe are glad to inform you your Excellency that our cooperation for Nerica rice cultivation is expanding. We have come to explain to you the current situation which Mr Shigeki Furuta will explain further. We have also come to discuss with you on other areas of collaboration, he said.\n\nHe mentioned that he was focused on the cooperation for the production of sesame seed in Zimbabwe, assuming the export to Japan.\n\nBesides rice cultivation, Japan is also focusing on other areas to support agriculture in Zimbabwe, for example, Sesame seed production. Sesame is not so popular among Zimbabwean people, but its very important for Japanese cuisine, including sesame oil. Sesame is essential food in Japan. The Japanese trading company is interested in exporting Zimbabwes sesame to Japan. It started exports last year and we are expecting to expand the volume. Japan is also supporting the production of the seed. Besides collaboration in agriculture, we also intend to work with you by providing support in the areas of health, education, and gender, he said.\n\nHe expressed his willingness to work with the Angel of Hope Foundations patron in various areas, including women empowerment.\n\nThere are possibilities for us to work with the First Lady and women under her Agric4she programme in sesame production and horticulture to empower the women. Also, we are going to cooperate in the education sector, such as setting up elementary school for culture exchange, he said.\n\nThe Ambassador also extended an invitation to the First Lady for her to participate at the Osaka Expo to be held in Japan this year.\n\nCulture exchange is important. We are pleased that pop culture is getting popular in Zimbabwe, such as the manga and anime. At the Osaka Expo, it will be a very good chance and occasion to expand our mutual understanding between our two countries.\n\nIt is also important to let Japanese people know about the Zimbabwean culture, such as its sculptures and traditional music and instruments like mbira, he said\n\nMr Furuta shed more light on the expansion of Nerica rice production sites across the country.\n\nFollowing the First Ladys request for rice cultivation in Zimbabwe, as Jica, we responded to that request. Dr Tsuboi visited three times last year, and now we have two rice experts working in Zimbabwe for the expansion of the rice production. Nerica is good for climate in Zimbabwe, and it grows very well. Together with the farmers, we are very excited to expand the production sites. We gradually expanded the production of the seeds.\n\nWe are hopeful that soon the size of the production will grow on a large scale. We are also working on mechanisation research for post harvest, he said.\n\nThe First Lady, who is already promoting womens participation in the agriculture value chain, expressed gratitude to Japanese delegates for expanding the NERICA rice project across the country.\n\nShe also welcomed the idea of Zimbabwean women producing sesame seed for export to Japan, indicating that the involvement of women will yield positive outcomes since women are the backbone of any society.\n\nWhen I visited Tokyo for the Women Economic Exchange Summit, i had meetings with rice experts and JICA officials and made a humble plea for rice production in Zimbabwe. I want to thank JICA for giving us rice experts to continue with this programme of Nerica production in Zimbabwe.\n\nThe meetings that I had at that time came to fruition, and I am grateful. Dr Tsuboi came here many times doing soil research to see if it was suitable for the rice production.\n\nIn April 2024, we went to Manicaland, Marange area, where we harvested the first crop with Dr Tsuboi. We harvested more than expected. Dr Tsuboi taught us how to cut the rice and the equipment to use. So I am so grateful that this programme is continuing, she said.\n\nAmai Mnangagwa also welcomed the partnership in the mentioned sectors.\n\nDr Mnangagwa, who is the countrys tourism patron, noted that cultural exchange programmes between Japan and Zimbabwe were key in the growth of the tourism sector.\n\nI am also the patron of culture and heritage in the Ministry of Primary and Secondary education. I am also thinking if we can collaborate and have a school here in Zimbabwe so that our children get to know the Japanese culture and it becomes an exchange programme. This will be a twinning arrangement. Culture exchange programmes can be very beneficial for tourism, fostering sustainable and enriching travel experiences by promoting deeper engagement with local cultures and communities. It also allows tourists to immerse themselves in different cultures, traditions, and lifestyles. We have many tourist sites in Zimbabwe, she said.\n\nAmai Mnangagwa further spoke about her Agric4she programme and how it is economically empowering women countrywide. She welcomed the sesame seed production.\n\nI am the Agric4She patron, and i am excited that we can collaborate in sesame seed production. This will benefit our women in Zimbabwe. Our women are hard workers. If you give them something to do, they will bring results, she said.\n\nThe countrys annual rice demand is 300 000 metric tonnes, but local production remains low at only 2 900 metric tonnes from traditional rice varieties. Therefore, the expansion of Nerica is a game changer.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/First-Lady-Dr-Auxillia-Mnangagwa-680x380.jpg",
            "description": "Tendai Rupapa-Senior Reporter JAPAN through its International Cooperation Agency (JICA) has expanded its New Rice for Africa (Nerica) production sites in Zimbabwe, which were secured by Agric4She patron First Lady Dr Auxillia Mnangagwa during her 2022 visit to Japan. Currently, there are 28 sites in several provinces across the country where the production of Nerica […]",
            "time": "08:45",
            "date": "01 Apr 2025"
        },
        {
            "title": "Japan, Australia, Zim strengthen economic ties ahead of key events",
            "url": "https://www.herald.co.zw/japan-australia-zim-strengthen-economic-ties-ahead-of-key-events/",
            "content": "Farirai Machivenyika Senior Reporter\n\nJAPAN Ambassador to Zimbabwe, Shinichi Yamanaka, yesterday met with Foreign Affairs and International Trade Minister, Professor Amon Murwira, where they discussed strengthening economic ties ahead of the Osaka Kansai Expo 2025 and the 9th edition of the Tokyo International Conference on Africas Development.\n\nThe Osaka Expo will run from April 13 to October 13, while the 9th Tokyo International Conference on African Development will be held in August.\n\nJapans Ambassador to Zimbabwe Shinichi Yamanaka meets Foreign Affairs and International Trade Minister Amon Murwira at his Munhumutapa Office yesterday.\n\nWe had a quite fruitful and forward-looking discussion with Professor Murwira, Minister of Foreign Affairs and International Trade. This year we have two important events for Zimbabwe and Japan, which is Osaka Kansai Expo and TICAD 9, Ambassador Shinichi said.\n\nSo, taking this opportunity, we discussed expanding and strengthening the business relations and the friendship between our two countries.\n\nThe 9th edition of TICAD will bring together African leaders and their Japanese counterparts to discuss Japans cooperation and contribution to Africas development. Ambassador Shinichi said the launch of ZimSat-1 was one of the success stories of Zimbabwe and Japans cooperation.\n\nOne of the success stories is ZimSat-1, the first Zimbabwean satellite, which was initiated during this TICAD meeting by the initiative of Professor Murwira, Ambassador Shinichi said.\n\nAustralias Ambassador to Zimbabwe, Minoli Perera, also paid a courtesy call on Professor Murwira where she congratulated Zimbabwe on the election of former Sports Minister Kirsty Coventry to be president of the International Olympic Committee.\n\nIn todays meeting, we covered a number of topics. I congratulated Zimbabwe on the election of former Honourable Minister Kirsty Coventry as president of the IOC, she said.\n\nHonourable Minister Coventrys very first Olympics were in fact in Sydney, Australia, and she has very fond memories of Australia as a result of that. And we fondly remember her as a young athlete at the start of her Olympic journey. So, its very, very pleasing to see her now being elected to such a position of leadership as the first woman, as the first African to be elected to that position.\n\nAmbassador Perera added that they also discussed the Australia Awards scholarship programme.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Minister-murwira-with-Australian-Ambassador-to-Zim-680x380.jpg",
            "description": "Farirai Machivenyika –Senior Reporter JAPAN Ambassador to Zimbabwe, Shinichi Yamanaka, yesterday met with Foreign Affairs and International Trade Minister, Professor Amon Murwira, where they discussed strengthening economic ties ahead of the Osaka Kansai Expo 2025 and the 9th edition of the Tokyo International Conference on Africa’s Development. The Osaka Expo will run from April 13 […]",
            "time": "08:45",
            "date": "01 Apr 2025"
        },
        {
            "title": "Insiza North MP dies",
            "url": "https://www.herald.co.zw/insiza-north-mp-dies/",
            "content": "Rutendo Nyeve\n\nINSIZA North legislator and businessman Cde Farai Taruvinga has died.\n\nHe was 53.\n\nCde Taruvinga succumbed to cancer yesterday at his family home in Hillside suburb, Bulawayo. Matabeleland South Zanu PF Provincial chairman Cde Mangaliso Ndlovu confirmed Cde Taruvingas death.\n\nI can confirm that we have lost the Member of the National Assembly for Insiza North. He had been unwell for some time, said Cde Ndlovu.\n\nA close friend of the legislator, Mr Sifiso Mafifi Mpofu, said Cde Taruvinga had been battling cancer. He passed on at around 8AM at his home in Hillside, Bulawayo. He had been battling high-grade sarcoma cancer, he said.\n\nMr Mpofu said more details regarding funeral arrangements will be shared by the family in due course.\n\nCde Taruvinga was serving his second term as a Member of the National Assembly and was a well-established businessman with interests in mining, retail and entertainment.\n\nHe was the director of Progress Mine, Filabusi Abattoir, Skuta Irrigation Scheme, Anradel Cattle Ranch and Marvel Shopping and Leisure Centre.\n\nDuring his tenure as MP, he initiated various developmental projects aimed at improving Insiza North. His long-term vision included transforming the district into a thriving economic hub. One of his flagship projects was the construction of a multi-million-dollar upmarket business complex in Gwatemba, which has been driving economic activity in the remote area.\n\nCde Taruvinga was also recognised for his entrepreneurial success, winning the Zimbabwe National Chamber of Commerce (ZNCC) Entrepreneur of the Year Award. Beyond business and politics, he was dedicated to community development and philanthropy.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Cde-Farai-Taruvinga-680x380.jpg",
            "description": "Rutendo Nyeve INSIZA North legislator and businessman Cde Farai Taruvinga has died. He was 53. Cde Taruvinga succumbed to cancer yesterday at his family home in Hillside suburb, Bulawayo. Matabeleland South Zanu PF Provincial chairman Cde Mangaliso Ndlovu confirmed Cde Taruvinga’s death. “I can confirm that we have lost the Member of the National Assembly […]",
            "time": "08:45",
            "date": "01 Apr 2025"
        },
        {
            "title": "Council under fire for ignoring pay order",
            "url": "https://www.herald.co.zw/council-under-fire-for-ignoring-pay-order/",
            "content": "Remember Deketeke-Herald Correspondent\n\nHarare City Councils Human Capital Development department has come under fire for allegedly ignoring a directive from the Local Government Board to restructure salaries and grades for directors and senior council employees.\n\nThe Local Government Board declared the current salaries and grading framework at Harare City Council null and void, but still the council bosses continue to pocket eye-popping salaries while service delivery remains at its lowest.\n\nActing director Human Capital Development director Mr Bossman Mutengarufu, is facing criticism from both councillors and ratepayers.\n\nLast month, it emerged that the council was shelling out about US$500 000 a month towards salaries for executives. The town clerk receives a monthly salary of US$27 000, which can increase to US$30 000 with additional perks while the least-paid executive earns US$15 000 per month.\n\nNone of these salaries and perks have the approval of the Local Government Board.\n\nThe Local Government Board then directed the council to immediately begin restructuring, aligning the grading system and salaries with Government-approved guidelines.\n\nI raised this issue a long time ago, questioning how a committee can convene when there is a letter affecting employees and the council. If we continue making payments or operating under a structure that the Local Government Board has declared invalid, we are knowingly disregarding their directive, said Mayor Mafume.\n\nThey were considerate enough to inform us and communicate this to the ministry, expecting us to take action rather than ignore it. At the very least, a report should have been submitted to the committee outlining the situation, its implications, and the necessary steps to be taken. This is a critical matter.\n\nThe Local Government Board made it clear why we cannot proceed as we have been.\n\nHowever, the process has stalled amid allegations of dishonesty and resistance from senior officials.\n\nMr Mutengarufu, when asked by Mayor Mafume, initially denied receiving a directive to implement the restructuring exercise.\n\nHowever, it later emerged that the acting Town Clerk had handed him the letter instructing him to commence the process.\n\nFaced with mounting evidence, Mr Mutengarufu was forced to apologise for misleading the council.\n\nThe matter was brought before a special council meeting last week, where tempers flared as officials debated the way forward.\n\nSome councillors accused senior management of deliberately delaying the restructuring to maintain their current salary structures.\n\nThe Local Government Board has made it clear that our current grading structure is invalid. It is unacceptable that some officials are trying to ignore this directive.\n\nWe will not allow this matter to be swept under the rug. The grading system must be reviewed as directed by the Local Government Board, said Mayor Mafume.\n\nIf it means taking further action to enforce compliance, we are prepared to do so. This issue affects the integrity and efficiency of council operations.\n\nMeanwhile, the Human Capital Director was also under fire after conducting interviews in private disregarding a council resolution that stipulates that every interview for a position from grade one to three must be televised or publicised.\n\nMr Mutengarufu said the Local Government Board had barred them from being publicised, a claim that was later corrected by Clr Ngadziore who said the board only changed the composition of the interviewing board.\n\nThe board has not changed anything on publicising interviews for Grade 1-3 but what they have changed is the composition of the interviewing board which reduced the number of councillors who sit in the interviewing board, narrated Clr Ngadziore.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/09/Mayor-Jacob-Mafume.jpg",
            "description": "Remember Deketeke-Herald Correspondent Harare City Council’s Human Capital Development department has come under fire for allegedly ignoring a directive from the Local Government Board to restructure salaries and grades for directors and senior council employees. The Local Government Board declared the current salaries and grading framework at Harare City Council null and void, but still […]",
            "time": "08:45",
            "date": "01 Apr 2025"
        },
        {
            "title": "100 women undergo health screenings",
            "url": "https://www.herald.co.zw/100-women-undergo-health-screenings/",
            "content": "Mutsawashe Mashandure Herald Correspondent\n\nAT least 100 women, including members of the press, have received complimentary health screenings for endometriosis, diabetes, hypertension and breast cancer.\n\nThis is part of the private sectors efforts to support Government initiatives promoting womens health.\n\nThe programme, conducted by local telemedicine service provider ZimSmart Villages, in partnership with the Zimbabwe Confederation of Midwives and a local media communications group, initially targeted female journalists but ultimately benefited non-journalists as well.\n\nSpeaking during the screenings at the ZIFM Stereo gardens in Harare last Friday, ZimSmart Villages chief medical officer, Dr Admore Jokwiro, said the programme aimed to democratise access to healthcare through innovative telehealth and artificial intelligence (AI)-driven diagnostic tools.\n\nWe are conducting breast cancer screening using a newer approach that is AI-guided. This is just a basic test for free, but if we found out you are suffering from such diseases, people should now have to use those results to get treated without paying money for screening; hence, less money is needed.\n\nDr Jokwiro stressed that it was crucial to expose the use of artificial intelligence for wellness and for preventive health approaches.\n\nAl health machines enhance these scans by improving accuracy in detecting and characterising endometriotic lesions.\n\nTo manage endometriosis effectively, healthcare providers may recommend a combination of pain management, hormonal therapies, and, in some cases, surgical intervention to remove the abnormal tissue. Regular follow-ups and tailored treatment plans are essential for optimal outcomes.\n\nHe also urged women to be screened frequently for such kinds of diseases.\n\nOne in nine women is affected by endometriosis, yet many suffer in silence as their pain is dismissed as normal period cramps. Today, we are not only screening but also educating women to take better care of themselves.\n\nMs Loveness Kashaya, a beneficiary of the programme, described the screening as crucial, as she gained more knowledge about endometriosis.\n\nZimSmart Villages is also partnering with the Government to establish 150 additional telehealth kiosks and 750 telehealth booths in rural areas.\n\nThis initiative is a result of a public-private partnership between the Ministry of Information Communication Technology, Postal and Courier Services, and ZimSmart Villages.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Women-go-through-health-screening-680x380.jpg",
            "description": "Mutsawashe Mashandure –Herald Correspondent AT least 100 women, including members of the press, have received complimentary health screenings for endometriosis, diabetes, hypertension and breast cancer. This is part of the private sector’s efforts to support Government initiatives promoting women’s health. The programme, conducted by local telemedicine service provider ZimSmart Villages, in partnership with the Zimbabwe […]",
            "time": "08:45",
            "date": "01 Apr 2025"
        },
        {
            "title": "Editorial Comment: Thank you Zimbabwe for snubbing senseless demo call",
            "url": "https://www.herald.co.zw/editorial-comment-thank-you-zimbabwe-for-snubbing-senseless-demo-call/",
            "content": "We salute the generality of Zimbabweans for snubbing the call for senseless demonstrations by former Zanu PF Central Committee member Blessed Geza and conducting themselves in a peaceful and dignified manner.\n\nAs expected the call for demonstrations and protests was a complete flop.\n\nThe police kept a light presence, in fact in large parts of Harare including swathes of the city centre, there were no police to be seen most of the time although presumably they were on call if needed.\n\nThe police in fact seemed to be following a very commendable combination of being ready for anything without being in your face, following best democratic practices.\n\nThis is not to say that all that activity on social media by those who were hoping for trouble, or at least relishing in the possibility of trouble, had no effect. People have been talking about it for some days and the resulting social media frenzy and many were worried.\n\nA common reaction was that while they and their colleagues and their neighbours were obviously not going to protest or cause trouble, they were worried that there might be some living elsewhere who would more pliant towards these calls, and that criminals might take advantage of the atmosphere. They did not want to be caught up in any violence.\n\nSo quite a lot of business people decided to remain closed yesterday, just in case, although the level of closures varied quite strongly depending on an area. A lot, but not all, city centre businesses decided not to open, giving their competition who did open a clear run.\n\nAt suburban shopping centres there were clear signs that there had been talk last week, with either most agreeing to open or most agreeing to close. The different decisions could be seen in shopping centres just a couple of kilometres apart along the same highway.\n\nThe one serious downside, at least in Harare, was the decision by so many bus and kombi owners, or their contract drivers, not to risk operating yesterday, causing severe transport problems on many routes.\n\nThose who were operating, and working even more freely than usual since the police were not really interested in unscheduled stops and other minor misdemeanours, made good money with full passenger loads in both directions. But those who rely on public transport did often face delays.\n\nThis also affected businesses whose staff rely on public transport to get to and from work and so the transport shortage did cause some of the closed businesses, who were unable to open because staff could not get to work on time.\n\nIn light of the total calm across the country yesterday, we would hope that people will be more reluctant in future to give the credence they were giving to many social media posts and sites who they now know are not really that knowledgeable or even connected to reality.\n\nThe damage to the reputations of so many so-called gurus who pontificate on social media may make the loss of business yesterday a cheap price if future forecasts of disaster by these same self-appointed experts and would-be agitators are ignored.\n\nBut the feeding frenzy of self-appointed commentators who are so reluctant to check facts and are continually predicting disaster, added to those who amplify the voice of anyone agin the Government to maximum volume.\n\nThis is one of the downsides of the modern opening of communications and the easy access everyone has to social media and web pages on their phones. It can and should make it easy for people to connect with everyone else and become true citizens of the world. But it also allows trivia and falsehoods to be propagated at the same speed as serious fact and argument.\n\nAround the world there are calls for more fact checking on social media and for at least the marking of the more dangerous views. Most people access social media through a handful of platforms. And many of these platforms have little or no controls on what people are allowed to say and how much of what they say is true and how much false.\n\nSo we are back with those who do the accessing to develop judgment to be able to assess whether what they read or hear or see is likely to be accurate. We all did this before social media when talking with relatives, friends and acquaintances, but then we did know more about who we were listening to and could make accurate assessments of how much we needed to believe.\n\nBut trusting total strangers on social media to have high levels of accurate knowledge seems to also require that they should be able to show their sources and prove that they do care about accuracy and that they go through processes to check their facts before just wanting to tell a good story and make peoples toes curl.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Mbare-Musika-680x380.jpg",
            "description": "We salute the generality of Zimbabweans for snubbing the call for senseless demonstrations by former Zanu PF Central Committee member Blessed Geza and conducting themselves in a peaceful and dignified manner. As expected the call for demonstrations and protests was a complete flop. The police kept a light presence, in fact in large parts of […]",
            "time": "08:45",
            "date": "01 Apr 2025"
        }
    ]
}