{
    "news": [
        {
            "title": "Seven injured in Wedza-Sadza road accident",
            "url": "https://www.herald.co.zw/seven-injured-in-wedza-sadza-road-accident/",
            "content": "Victor MaphosaMashonaland East Bureau\n\nSeven people were injured when a Toyota Hilux GD6 side-swiped a Honda Fit at the 19 km peg along the Wedza-Sadza road on Tuesday.\n\nThe injured were rushed to Sadza Hospital for medical assistance.\n\nNational police spokesperson Commissioner Paul Nyathi confirmed the accident.\n\nPolice in Marondera are investigating a serious road traffic accident which occurred at the 19 km peg along Wedza-Sadza Road on December 24, 2024, at around 4 pm in which seven people were injured, he said.\n\nA Toyota Hilux GD6 with seven passengers on board side-swiped a Honda Fit with two passengers on board.\n\nResultantly, the Toyota Hilux GD6 veered off the road and landed on the bridge. The injured victims were taken to Sadza Hospital for treatment.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/04/accident-2.jpg",
            "description": "Victor Maphosa Mashonaland East Bureau Seven people were injured when a Toyota Hilux GD6 side-swiped a Honda Fit at the 19 km peg along the Wedza-Sadza road on Tuesday. The injured were rushed to Sadza Hospital for medical assistance. National police spokesperson Commissioner Paul Nyathi confirmed the accident. “Police in Marondera are investigating a serious […]",
            "time": "08:35",
            "date": "26 Dec 2024"
        },
        {
            "title": "ZimParks reveals cause of wildlife, fish death at Lake Chivero",
            "url": "https://www.herald.co.zw/zimparks-reveals-cause-of-wildlife-fish-death-at-lake-chivero/",
            "content": "Victor Maphosa\n\nHerald Reporter\n\nZimbabwe Parks and Wildlife Management Authority (ZimParks) says cyanobacteria caused the death of wildlife and fish in Lake Chivero recently.\n\nIn a statement today, ZimParks said they have noted with concern a letter circulating on social media alleging that the recent deaths of wildlife and fish at Lake Chivero are attributed to cyanide poisoning.\n\nWe wish to assure the public that thorough investigations conducted by the University of Zimbabwe and our own Veterinary and Capture Unit have conclusively shown that the deaths are, in fact, caused by cyanobacteria.\n\nThe Authority categorically distances itself from any misinformation circulating on various social media platforms. We urge the public to disregard such unfounded claims and rely on official communication channels for accurate information, read the statement.\n\nZimParks said it is committed to ensuring that the problem affecting Lake Chivero is rectified to preserve natural heritage.\n\nWe are working tirelessly with relevant stakeholders to address the issue and prevent future occurrences.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/04/ZimParks.jpg",
            "description": "Victor Maphosa Herald Reporter Zimbabwe Parks and Wildlife Management Authority (ZimParks) says cyanobacteria caused the death of wildlife and fish in Lake Chivero recently. In a statement today, ZimParks said they have noted with concern a letter circulating on social media alleging that the recent deaths of wildlife and fish at Lake Chivero are attributed […]",
            "time": "08:35",
            "date": "26 Dec 2024"
        },
        {
            "title": "Second Republic sparks construction boom",
            "url": "https://www.herald.co.zw/second-republic-sparks-construction-boom/",
            "content": "Mukudzei ChingwereHerald Reporter\n\nZimbabwes economy is experiencing a significant construction boom, driven by increased business activity and strategic initiatives from the Second Republic aimed at fostering economic growth, industry experts have observed.\n\nDespite this growth, many industry players feel that the positive developments are not receiving the attention they deserve.\n\nThe focus often remains on project completion, overshadowing the broader economic benefits that arise from these activities.\n\nSince his inauguration in 2017, President Emmerson Mnangagwa has championed economic growth, implementing actionable strategies under the banner of Zimbabwe is Open for Business.\n\nThis initiative aims to attract Foreign Direct Investment (FDI) and propel the country toward achieving upper middle-income status by 2030.\n\nAs a result, numerous capital-intensive projects are taking shape, with local construction companies actively participating in the infrastructure development sector.\n\nZimbabwe Building and Contractors Association (ZBCA) president Dr Tinashe Manzungu praised President Mnangagwas commitment to contracting local firms for the rehabilitation of key infrastructure, such as roads.\n\nEmploying local companies significantly benefits the economy by enhancing infrastructure while promoting local participation in economic activities, said Dr Manzungu.\n\nLocal hiring creates jobs and provides training opportunities that might otherwise be unavailable.\n\nAs the CEO and director of Zimbuild Property Investments Dr Manzungu said they have a responsibility to match the quality of their multinational counterparts.\n\nWe are committed to delivering high-quality work and these opportunities have elevated our status in the industry.\n\nManah Buildings Construction director Mr Arthar Mafuya and the ZBCA 2024 contractor of the year expressed gratitude to the Government for awarding larger contracts to local firms.\n\nWe are thankful for the trust placed in us by the Government. We promise not to betray this trust and will deliver our projects with the utmost quality and integrity, said Mr Mafuya.\n\nThe Nyika inovakwa Nevene Vayo policy is in full effect and local construction companies are actively participating in building our nation.\n\nOur company has seen rapid growth due to the contracts awarded to us and I am pleased to report that many of our colleagues in the construction sector are delivering excellent work, said Mr Mafuya.\n\nAs Zimbabwe continues to build its infrastructure, the collaboration between the Government and local companies stands to benefit the economy and pave the way for sustainable development.\n\nIn separate interviews, industry stakeholders echoed sentiments of increased business activity and a favorable business climate which are crucial in reducing unemployment rates.\n\nFrogmerge Construction Company managing director Engineer Shingi Vhiriri commended the Government for its focus on empowering local entities.\n\nBy employing local companies, the Government is not only providing livelihoods but also fostering economic growth, said Engineer Vhiriri.\n\nWhen we secure contracts, the proceeds are reinvested locally rather than repatriated abroad.\n\nEngineer Vhiriri implored fellow construction professionals to uphold quality standards, emphasising that local companies should only accept projects they can competently execute.\n\nNonaly Trading director Mr Nobioth Magwizi noted that contracting local firms has significantly promoted the growth of small and medium enterprises (SMEs) within the construction sector.\n\nThe trust and confidence placed in local companies by the Government is invaluable. We consistently complete projects ahead of schedule, said Mr Magwizi.\n\nThe New Dispensation has markedly increased the awarding of contracts to local firms, enhancing the standing of SMEs in the construction industry.\n\nThis affirmative action has created equal employment opportunities that were previously dominated by larger firms, said Mr Magwizi.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/HE.jpg",
            "description": "Mukudzei Chingwere Herald Reporter Zimbabwe’s economy is experiencing a significant construction boom, driven by increased business activity and strategic initiatives from the Second Republic aimed at fostering economic growth, industry experts have observed. Despite this growth, many industry players feel that the positive developments are not receiving the attention they deserve. The focus often remains […]",
            "time": "08:35",
            "date": "26 Dec 2024"
        },
        {
            "title": "SADC rallies Mozambique parties to abide by ruling on election results",
            "url": "https://www.herald.co.zw/sadc-rallies-mozambique-parties-to-abide-by-ruling-on-election-results/",
            "content": "Africa Moyo\n\nDeputy News Editor\n\nPresident Mnangagwa, who is also SADC Chairman, has called on all parties to the Mozambique electoral process to respect the ruling of that countrys Constitutional Council of Election Results.\n\nIn its ruling released Monday, the Council upheld the results of the October 9 elections that saw the ruling party, Frelimo, winning by a landslide.\n\nIn a statement today, the SADC Chairman President Mnangagwa said the region notes and acknowledges the ruling and confirmation on Monday, 23rd December 2024, by the Constitutional Council of Election Results held in the Republic Mozambique on 9th October this year.\n\nThe ruling by that countrys top electoral court, which upheld Frelimo Partys victory, completes and thus exhausts all lawful processes on determining election results, in line with that countrys national laws, and in keeping with SADCs Election Guidelines and expectations. SADC, thus, expects all parties to the electoral process, both individually and collectively, to abide by the decision of the Council which should provide a constitutional way forward for the country, and facilitate the way to greater peace, normalcy, and stability in the interest of all Mozambicans, said President Mnangagwa.\n\nHe added that SADC stands ready to assist the incoming government, and people of Mozambique, in consolidating their electoral democracy on the basis of the court decision, which should be held sacrosanct by all.\n\nIndeed, this is what the rule of law is all about. Further, SADC urges the international community to respect the sovereign will of the people and the Republic of Mozambique, exhorting all concerned to constructively support all processes towards peace, law and order which the country and people sorely need and deserve.\n\nOur region witnessed a record number of national elections in the last two years, itself a loud testimony that democracy continues to find deeper roots and to flourish in our SADC region, he said.\n\nThe calls for peace in Mozambique come after opposition parties, which lost by a wide margin, rejected the ruling and started mobilising their supporters to destabilise the country.\n\nAlready, there are reports that since Mondays court ruling, 21 people, including two police officers, have died and 25 others injured.\n\nLaw enforcement remains on the ground to ensure peace and stability.\n\nFrelimo won the presidential election with 65,17 percent of votes cast, while Venncio Mondlane got 24,19 percent, Ossufo Momade of Renamo 6,62 percent, and Lutero Simango 4,02 percent.\n\nConstitutional Council President Lcia Ribeiro acknowledged irregularities in the electoral process, like any other election, but said they did not influence the outcome.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/11/Untitled-124.jpg",
            "description": "Africa Moyo Deputy News Editor President Mnangagwa, who is also SADC Chairman, has called on all parties to the Mozambique electoral process to respect the ruling of that country’s Constitutional Council of Election Results. In its ruling released Monday, the Council upheld the results of the October 9 elections that saw the ruling party, Frelimo, […]",
            "time": "08:35",
            "date": "26 Dec 2024"
        },
        {
            "title": "CCC councillor accused of taking Sanyati RDC managerial roles",
            "url": "https://www.herald.co.zw/ccc-councillor-accused-of-taking-sanyati-rdc-managerial-roles/",
            "content": "Conrad Mupesa Mashonaland West Bureau\n\nSanyati Rural District Council Ward 18 councillor who was elected on a Citizens for Coalition Change (CCC) ticket has been accused of fanning divisions in the district.\n\nThe councillor, Kudzanai Murungweni is being accused of wanting to take over managerial roles.\n\nCllr Murungweni made headlines last week after alleging that the council had adopted a disputed 2025 budget without consulting all stakeholders, including residents, the business community, and some ward councillors.\n\nDespite his accusations, some residents, business people and ward councillors confirmed that consultations were conducted where they aired their voices and views.\n\nMr Mirirai Mapfumo a businessman at ARDA Growth Point Sanyati, said he was optimistic that his contributions during budget consultations were taken into consideration.\n\nWe had our budget consultations where the business people and residents shared their views, he said.\n\nThe approach is in line with President Mnangagwas mantra of leaving no one and place behind. We hope our views were considered, Mr Mapfumo said.\n\nMrs Sibongile Bhebhe, who is from the same area, also shared her views and expectations during the consultations.\n\nOther residents said they were included in the budget formulation making the 2025 budget for the people.\n\nThe consultations were also taken to the people of Marimari where Mr Mavelas Machingura among others gave their contributions.\n\nCouncil chairperson, Cllr Stanford Chaombezvi said the councillors accusations were baseless.\n\nBudget consultations were conducted in all the wards for Sanyati RDC but there were only a few individuals at one of our townships Sanyati Growth Point who obstructed the budget consultation process upon the instigation of Councillor Murungweni whose motive is bent on advancing his political agenda, he said.\n\nCouncillor Murungweni opposes almost every council development project and in certain instances, he wants to assume managerial functions, a scenario which creates conflicts between himself and council executives.\n\nHe also claimed there was a review of the 2024 financials as stipulated in the guidelines.\n\nA full council meeting also took place and endorsed the budget.\n\nCouncillor Murungweni was also accused of discouraging people from paying their due to council since August 2023, a claim he refuted.\n\nOut of 18 Wards in the district, only one has people who are against the budget and want it to be thrown away. Their rejection is based on political grounds because they are from the opposition party.\n\nThis has affected the councils revenue inflows, obviously the effect of such misdirected efforts is poor revenue inflows resulting in dwindling service delivery, said Cllr Chaombezvi.\n\nThe council has been coming under fire from residents for its failure to send monthly bills and collect refuse from businesses and residential areas.\n\nThe council also confirmed its advanced plans to issue monthly electronic bills. The chairperson also said the council had included lower fees for people who want to occupy market stalls it built last year to attract occupants.\n\nThe stalls had remained vacant because of exorbitant rental fees. The councillor allegedly refused to go to the Chitepo School of Ideology for orientation that was attended by other councillors from urban and rural councils earlier this year.\n\nCllr Murungweni also refused to attend the training sanctioned by the Local Government and Public Works Ministry.\n\nHe is bent oncausing confusion and all the claims are baseless. The councillor is anti-government as he refused to attend Chitepo School of Ideology which all the councillors from our council attended, added Chaombezvi.\n\nCouncillor Kudzanai Murungweni however maintained that there was never a review of the current years financials as required under stipulated guidelines.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/IMG-20241225-WA0018.jpg",
            "description": "Conrad Mupesa Mashonaland West Bureau Sanyati Rural District Council Ward 18 councillor who was elected on a Citizens for Coalition Change (CCC) ticket has been accused of fanning divisions in the district. The councillor, Kudzanai Murungweni is being accused of wanting to take over managerial roles. Cllr Murungweni made headlines last week after alleging that […]",
            "time": "08:35",
            "date": "26 Dec 2024"
        },
        {
            "title": "Enjoy Christmas holidays responsibly — President",
            "url": "https://www.herald.co.zw/enjoy-christmas-holidays-responsibly-president/",
            "content": "Wallace Ruzvidzo, Herald Reporter\n\nAs Zimbabwe celebrates Christmas and prepares for a new year, President Mnangagwa has called for responsible behaviour among the general citizenry.\n\nThe President spread some holiday cheer by wishing Zimbabweans a merry Christmas and a prosperous New Year.\n\nIn his Christmas and New Year message delivered at State House at the weekend, the President urged the general citizenry to celebrate responsibly and safely, especially when travelling.\n\nPresident Mnangagwa expressed optimism for the countrys future, stating that Zimbabwe will achieve greater prosperity in the coming year.\n\nAs we celebrate this important national holiday, let us do so responsibly and safely, especially for the travelling and commuting public.\n\n . . . on my own behalf, that of Government and indeed my family, I wish all fellow citizens, at home and abroad, a Merry Christmas and a prosperous 2025. May the New Year ahead bring hope and greater prosperity for our motherland, Zimbabwe, he said.\n\nIn Zimbabwe, Christmas is a time for family, unity, and spirituality.\n\nZimbabweans are embracing the holiday season with enthusiasm and optimism, reflecting the countrys rich cultural heritage and strong sense of community.\n\nThe President said Zimbabwe remained a composite and solid unitary state despite its diverse norms, customs, languages and culture.\n\nFrom Zambezi to Limpopo, from Plumtree to Mutare, and across the most remote villages in our country, we sing with pride one national anthem and fly one national flag. We are diverse, but one.\n\nTo this end, this past week saw my administration concretise the Constitutionally enshrined obligation to give rights to every Zimbabwean citizen to hold and occupy agricultural land.\n\nHence, the bold decision to empower the beneficiaries of the Land Reform Programme through the issuance of Deeds of Transfer that will unlock the value of our land.\n\nThrough this historic act, these new tenure documents will be issued to the over 23 500 A2 and over 360 000 A1 farmers.\n\nThe celebration of this years Unity Day is, therefore, equally a jubilant occasion affirming that the land is now irreversibly with its people, and the people with their land, said President Mnangagwa.\n\nUnity, patriotism, peace, love and respect, he said, remained indispensable values in the countrys development matrix.\n\nI, therefore, call upon all citizens to commemorate this National Unity Day with sober reflections and recommit to the rich national heritage embodied in the historic Accord of 1987.\n\nNever, never, never again, should anything ever divide us.\n\nUnited we must stand, strong and solid as the walls of Great Zimbabwe, from which we derive our nations name.\n\nHand-in-hand, in unity, from village to the provincial level; sector-by-sector and industry-by-industry, Vision 2030 shall surely become a reality, said President Mnangagwa.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/President-Mnangagwa-4.jpg",
            "description": "Wallace Ruzvidzo, Herald Reporter As Zimbabwe celebrates Christmas and prepares for a new year, President Mnangagwa has called for responsible behaviour among the general citizenry. The President spread some holiday cheer by wishing Zimbabweans a merry Christmas and a prosperous New Year. In his Christmas and New Year message delivered at State House at the […]",
            "time": "08:35",
            "date": "26 Dec 2024"
        },
        {
            "title": "Muswere clarifies Zanu PF resolution-making process",
            "url": "https://www.herald.co.zw/muswere-clarifies-zanu-pf-resolution-making-process/",
            "content": "Samuel Kadungure, Manicaland Bureau\n\nZanu PF Central Committee member Cde Jenfan Muswere has clarified the partys resolution making process saying decisions made at the recent Annual Peoples Conference are binding because they were unanimously adopted.\n\nCde Muswere said when the resolutions were read out to the conference delegates, none in the house opposed them.\n\nAmong the several key resolutions the Zanu PF Annual Peoples Conference held in October in Bulawayo passed was extending President Mnangagwas terms by two years to allow him to steer his Vision 2030 agenda to fruition.\n\nThe Delegates to the ZANU PF 21st National Peoples Conference resolve as follows: the President and First Secretary of ZANU PF Party, His Excellency, Cde. Dr E. D. Mnangagwas term of office as President of the Republic of Zimbabwe and First Secretary of ZANU PF be extended beyond 2028 to 2030. The Party and Government should, therefore, set in motion the necessary amendments to the National Constitution so as to give effect to this resolution, reads the resolution.\n\nCde Muswere said any other meetings outside Zanu PF forums were private and of no relevance to partys processes.\n\nHe said noise makers outside Zanu PF were not part of the decision-making process.\n\nCde Muswere recently took time to explain and defend the partys ED2030 slogan and growing calls for President Mnangagwa to remain in office and continue the development trajectory beyond 2030.\n\nCde Muswere, who is also Information, Publicity and Broadcasting Services Minister, and legislator for Makoni West Constituency, emphasised that the call for Mnangagwas continued leadership was an agreed party position, resolved and adopted at the annual national peoples conference.\n\nHe was responding to a question raised by Cde Gilbert Zowa, a recently elected war veterans association member, to clear the air on the slogan.\n\nCde Zowa had sought clarity on the ED2030 slogan, noting that President Mnangagwa himself had expressed disinterest in extending his term beyond 2028, despite the partys enthusiasm for his continued leadership.\n\nHe raised the issue during the Zanu PF Makoni District Coordination Committee (DDC) meeting held at the Makoni Rural District Council boardroom in Rusape.\n\nThe ED2030 slogan has garnered significant traction as party supporters overwhelmingly urge President Mnangagwa to extent his Presidency beyond the current constitutional two-term limit.\n\nCde Muswere said the resolution to extend President Mnangagwas leadership beyond 2030 is in line with Zanu PFs constitution, since the conference that endorsed the resolution had a full quorum, making it legally and properly constituted.\n\nHe highlighted importance of maintaining constitutional integrity and adherence to party principles and values when implementing such resolutions.\n\nCde Muswere said the extension of President Mnangagwas leadership is an opportunity to consolidate the ongoing economic, infrastructural and social transformation programmes, guaranteeing continuity in policies aimed at achieving Vision 2030. Stability and consistency in leadership, he said, are crucial for realising the countrys long-term goals.\n\nRegarding the ED2030 slogan, as Cde (Gilbert) Zowa mentioned, the President made his own announcement. However, our guiding principle on this matter should be the ZANU PF constitution, which stipulates the holding of the annual National Peoples Conference. The last conference was held in Bulawayo, which was attended by all the requisite party organs. Most of you here today attended that conference. This conference was attended by various party organs, including the Central Committee. It was legally and properly constituted, with the required quorum, he said.\n\nThe Central Committee report, which encompassed all resolutions from Provincial Coordination Committees (PCCs), was tabled. The resolutions from Zanu PF provinces were read out and unanimously adopted. The meeting also reviewed thematic committees deliberations. Most of you were in attendance at the conference, which was chaired by Zanu PF national chairperson, Cde Oppah Muchinguri-Kashiri. Together with other leaders, Cde Muchinguri-Kashiri requested the adoption of the resolutions asking the President to remain in office beyond 2030, in order to continue pursuing the countrys development trajectory, said Cde Muswere.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/10/Muswere-1.jpg",
            "description": "Samuel Kadungure, Manicaland Bureau Zanu PF Central Committee member Cde Jenfan Muswere has clarified the party’s resolution making process saying decisions made at the recent Annual People’s Conference are binding because they were unanimously adopted. Cde Muswere said when the resolutions were read out to the conference delegates, none in the house opposed them. Among […]",
            "time": "08:35",
            "date": "26 Dec 2024"
        },
        {
            "title": "Budget to withstand fiscal risks: Mthuli",
            "url": "https://www.herald.co.zw/budget-to-withstand-fiscal-risks-mthuli/",
            "content": "Zvamaida Murwira, Senior Reporter\n\nGovernments forecast of 6 percent economic growth for next year has undergone a stress test to assess its realism, taking into account various fiscal risks, including exchange controls and natural disasters, along with other macro-economic fundamentals.\n\nFinance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube said the 2025 National Budget sought to build resilience and the Government forecast a brighter future going into the New Year.\n\nProf Ncube said this in Senate last week while responding to concerns raised by lawmakers during a debate on the 2025 National Budget that the Legislature has since passed.\n\nHave we taken care of risks that might arise as we focus on such a brighter future for the country into next year? We have done a stress test of the Budget by considering various scenarios to say, suppose we have some macro-economic risks and maybe we are wrong in terms of our Gross Domestic Product forecast of 6 percent for whatever reason, suppose it turns out to be 2 percent lower and what will happen and we do those simulations.\n\nWe also look into how, for instance, exchange rate risks could impact the budget. We look into the impact of commodity risks and some other contingent liabilities that come out of nowhere but impact the fiscal position. We also consider the impact of natural disasters that are unforeseen and some public debt risk, he said.\n\nProf Ncube said the national budget also focussed on building resilience and not necessarily as a recurrent budget alone as what was suggested by some Senators.\n\nEarlier, some Senators had said the budget was skewed towards more recurrent expenditure as opposed to investment or capital expenditure thereby compromising its resilience.\n\nRecurrent expenditure can have resilience characteristics. Resilience is quite broad. Our expenditure on the Pfumvudza/Intwasa Programme speaks to building resilience in our rural areas so as to cushion our rural farmers from the vagaries of climate. By the way, 60 percent of Pfumvudza/Intwasa farmers are women. So, you can see the impact of that Budget expenditure item on the gender equity issues, but also our overall social protection on the budget, whether it is Basic Education Assistant Module (BEAM) or whether it is looking at the grey mitigation programme, all those social protection programmes which are just simple recurrent expenditure programmes, our items speak to resilience, he said.\n\nBoth recurrent expenditure and investment can have resilience characteristics, said Prof Ncube.\n\nThe resilience characteristics from infrastructure will come from investment in irrigation. I think that is an obvious one or indeed, building dams, but with a view of evacuating the water onto the fields and eventually irrigation. So, all of that is a resilience which the budget is supporting, he said.\n\nProf Ncube said in terms of foreign currency receipts, he acknowledged the role played by the diaspora adding he expected them to send more money to Zimbabwe next year.\n\nHe said the Treasury had also made initiations to stimulate domestic car production through the retention of duty on bus imports.\n\nWe believe now we have quite a lot of buses and we have re-introduced duty on commuter buses. We are supporting a programme of incentivising the import of knocked down kits which will then be assembled at facilities such as Willowvale, Deven Engineering or Quest among others. We are encouraging the use of greener cars in order to reduce pollution, he said.\n\nZanu PF Chief Whip, Cde Pupurai Togarepi expressed optimism that the Budget will cater for key Government operations necessary to achieve Vision 2030.\n\nThe vision aims to achieve an upper middle-income economy by 2030 and the Budget spoke to this vision by providing vital resources to productive sectors of the economy.\n\nAs you are aware, our productive sectors include agriculture, mining, industry and commerce and tourism. These sectors were adequately equipped to ensure they continue to contribute to economic growth which is projected to leapfrog by 6 percent by the end of 2025.\n\nOther sectors such as transport and energy which provide essential infrastructure and power to facilitate industrial activities were also catered for and we expect the energy generation capacity to improve by midyear, he said.\n\nCde Togarepi noted that through the Finance Bill, the Budget tried to strike a balance between reducing the tax burden on companies while also ensuring that the Government had adequate funding to run its operations.\n\nNo country can prosper without its citizens paying taxes. MPs encouraged the Minister to widen the tax base. A culture of paying tax is key to economic development, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/03/Minister-Mthuli-Ncube.jpg",
            "description": "Zvamaida Murwira, Senior Reporter Government’s forecast of 6 percent economic growth for next year has undergone a stress test to assess its realism, taking into account various fiscal risks, including exchange controls and natural disasters, along with other macro-economic fundamentals. Finance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube said the 2025 National Budget […]",
            "time": "08:35",
            "date": "26 Dec 2024"
        },
        {
            "title": "Police ready to maintain law, order during, after holidays",
            "url": "https://www.herald.co.zw/police-ready-to-maintain-law-order-during-after-holidays/",
            "content": "Crime Reporter\n\nTo maintain peace and order, the Zimbabwe Republic Police have reassured the country that they have placed enough officers on all major thoroughfares, residential neighbourhoods, central business districts, and locations where people congregate to celebrate.\n\nThere will be heightened roadblocks, traffic blitzes, stop and searches, and motorised and cycle patrols to curb crime and road traffic accidents.\n\nNational police spokesperson Commissioner Paul Nyathi said police will ensure that the public will celebrate Christmas and New years holidays in peace and in a crime free environment.\n\nAs the police, we are ready to ensure that the public celebrates Christmas Day and Christmas Eve peacefully. We shall be conducting patrols, stop searches as well as manning roadblocks, he said.\n\nHe also urged all stakeholders, including transporters, to prioritise the safety and security of the public.\n\nWe have however noted several issues concerning the safety and security of the public such as motorcyclists who are riding or moving on the roads without helmets.\n\nAs the ZRP we would like to warn all motorcyclists who are riding or moving on the roads with no helmets, with some carrying passengers, that arrests will be effected and the law will take its course without fear or favour. Motorcyclists are accordingly urged to be law-abiding citizens and promote road safety in the country, Comm Nyathi said.\n\nHe also warned drivers of private and public service vehicles against speeding saying they would be arrested.\n\nComm Nyathi said bus and truck drivers should not leave their vehicles in the middle of the road whenever they experience a breakdown as this endangers other road users.\n\nHe said it was worrisome to note that some trucks are left on the road for more than a week after a break down.\n\nMost of these drivers do not even put reflective triangles to warn other motorists and instead they resort to putting tree branches, stones and containers which is against the law. We will not hesitate to arrest anyone found on the wrong side of the law for the law to take its course, he said.\n\nComm Nyathi said proper red reflective triangles should always be used in case of a breakdown to increase visibility.\n\nHe said those who failed to adhere to this requirement would be dealt with in terms of the Road Traffic Act and Road Motor Transportation Act.\n\nThe ZRP said they have taken note of reports of liquor outlets in some central business districts and residential areas, which are not observing the provisions of the Liquor Act, by operating outside their stipulated opening and closing times.\n\nSome of the beer outlets are also allowing minors to access alcohol.\n\nPolice will also take action on those engaging in drug and substance abuse, adding that as the public celebrates the cross-over into the New Year, individuals, institutions and businesspersons must adhere to the provisions of the law on the use of fireworks, firecrackers and other gadgets that may disturb the safety and security of the people.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/08/Paul-Nyathi.jpg",
            "description": "Crime Reporter To maintain peace and order, the Zimbabwe Republic Police have reassured the country that they have placed enough officers on all major thoroughfares, residential neighbourhoods, central business districts, and locations where people congregate to celebrate. There will be heightened roadblocks, traffic blitzes, stop and searches, and motorised and cycle patrols to curb crime […]",
            "time": "08:35",
            "date": "26 Dec 2024"
        },
        {
            "title": "A Lifeline from the Sky: Air ambulance saves pre-term twins in rural Chegutu",
            "url": "https://www.herald.co.zw/a-lifeline-from-the-sky-air-ambulance-saves-pre-term-twins-in-rural-chegutu/",
            "content": "Emmanuel Kafe\n\nIn the quiet, rural expanse of Chegutu, Linda Jose, a mother of twins, never imagined that the day she gave birth would become one of the most life-changing and harrowing experiences of her life.\n\nThe farming community, where she had lived for years, was far removed from bustling cities with state-of-the-art medical facilities.\n\nTo get to understand Lindas story, it is good that we start from the beginning. Her pain began suddenly, setting off a whirlwind of hope and fear. Linda was already in labour when she arrived at the local hospital in Chegutu.\n\nI started feeling pain while I was pregnant here in Chegutu, and then I went into labour, she recalls.\n\nWhat she didnt expect was the arrival of an air ambulance, which would become a lifeline for her and her two premature babies.\n\nThe pain was intense, but nothing could have prepared her for the shock of giving birth to twinstwo tiny girls, weighing only 850 grams and 1 000 grams, respectively.\n\nAs minutes passed, complications aroseone of the twins began to show signs of distress, turning yellow and exhibiting symptoms of jaundice, a common condition among premature infants.\n\nAt this point, the hospital staff realised they lacked the necessary treatment and equipment.\n\nWhat happened next was nothing short of extraordinary.\n\nA helicopter, dispatched by Helidrive Zim, an air ambulance service provider, arrived to transport Linda and her critically ill twins to Chinhoyi Provincial Hospital, a major medical facility capable of handling such delicate neo-natal cases.\n\nIt was such a strange feeling. I never thought a helicopter would come to my rescue, especially living in such a remote place, Linda said, her voice trembling with gratitude.\n\nI thought they would come for someone from the city, not someone like me from a farm. It felt like a miracle. If the helicopter hadnt come, my babies wouldnt have survived, she said.\n\nFor Linda and her family, the air ambulances presence meant the difference between life and death.\n\nThe babies were transported in on board incubators, surrounded by life-support equipment that kept them stable during the flight.\n\nThe swift and efficient transfer ensured they received the critical care they needed in time.\n\nTo many in Lindas community, the sight of a helicopter arriving in their rural village was a surreal moment.\n\nWe were shocked to see a helicopter come to rescue someone like Linda, who lives on a farm, said Abigail, a neighbour from the area.\n\nTo actually witness a helicopter airlift her without her having to pay anythingits incredible. We never imagined something like that could happen here.\n\nAbigail, like many in the community, had never seen such a high-tech, life-saving operation take place in such an isolated location.\n\nTo actually witness a helicopter airlift her without her paying any moneyits unbelievable, she said.\n\nDr Freddy Mhondiwa, the medical director at Helidrive Zimbabwe said since August of this year, the service had airlifted 154 patients, many of whom were children, including two VIP patients.\n\nConcession, Mashonaland Central Province, leads in maternity cases requiring emergency assistance, accounting for 60 percent of cases.\n\nSince August 2024, up until the beginning of this month, weve managed 154 flights, transporting patients from various hospitals to central hospitals.\n\nThe majority of our patients are maternity cases, making up around 30 percent of our flights. These are often urgent cases coming from central hospitals, he added.\n\nDr Mhondiwa continued: Recently, we had a case of a mother with twins. She was coming from Chegutu, unable to deliver at the local hospital. We airlifted her in a critical condition, both for her life and her babies. Were proud that we were able to transport her and that she delivered safely. Now, theyre back home. That was, I would say, one of our best rescue missions.\n\nThough Lindas story is unique, it is becoming increasingly common as rural communities realise that help can indeed come from the sky.\n\nThe government-run air ambulance service, which operates free of charge has saved many lives across the country.\n\nIts a service that not only offers hope but delivers it swiftly, at a time when every second counts.\n\nFor Linda, the memory of that day will stay with her forever.\n\nShe speaks softly but passionately, Im so grateful for the helicopter, and for the people who made it possible.\n\nIt gave my babies a chance to live.\n\nToday, Lindas twins, though still small, are thriving.\n\nTheir premature birth, once a cause for fear, is now a distant memory, replaced by the overwhelming relief that their lives were saved by an air ambulance that arrived just in time.\n\nHelidrive Zim, which operates the air ambulance service, is part of a transformative effort by the Government to improve universal health coverage across the country.\n\nThe air ambulance that came to Lindas rescue was not just a mode of transport; it was a mobile intensive care unit in the sky, equipped with state-of-the-art technology and staffed by skilled medical professionals.\n\nThe Second Republic has been actively working to modernise the countrys health sector, focusing on innovative solutions to ensure that healthcare is accessible to every citizen, no matter where they live.\n\nIn June, the President travelled to Russia to seek investors for establishing air ambulance services for the public health sector.\n\nThis collaboration has led to the creation of the air ambulance network that is already saving lives in the country. Air ambulances are essential, especially in rural areas like Chegutu, where medical facilities are often under-resourced.\n\nThese specialised helicopters can bypass the geographical barriers that isolate rural areas from more advanced healthcare. With highly trained doctors, nurses, engineers, and pilots on board, air ambulances deliver the same level of care found in intensive care units, ensuring that patients, especially vulnerable newborns, are stabilised during transport to higher-level hospitals.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Linda.jpg",
            "description": "Emmanuel Kafe In the quiet, rural expanse of Chegutu, Linda Jose, a mother of twins, never imagined that the day she gave birth would become one of the most life-changing and harrowing experiences of her life. The farming community, where she had lived for years, was far removed from bustling cities with state-of-the-art medical facilities. […]",
            "time": "08:35",
            "date": "26 Dec 2024"
        }
    ]
}