{
    "news": [
        {
            "title": "Zimra clamps down on Limpopo River smuggling, burns 21 smuggling boats",
            "url": "https://www.herald.co.zw/zimra-clamps-down-on-limpopo-river-smuggling-burns-21-smuggling-boats/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nThe Zimbabwe Revenue Authority (Zimra) working with other border agencies on Tuesday intercepted and destroyed 21 boats which were being used to move contrabands between Zimbabwe and South Africa along the Limpopo River.\n\nMost of the boats were identified with the aid of drone surveillance technology. In a statement Zimras Commissioner General Ms Regina Chinamasa said they confiscated and destroyed 21 smuggling boats and 20 paddles along the Limpopo River.\n\nThis operation, a testament to Zimbabwes strengthened border security measures, highlights the growing impact of drone surveillance and a whole-of-government approach to tackling illicit trade, said Ms Chinamasa.\n\nThe sting operation saw Zimras elite Drone Operations Team, Customs Officers, and other border security stakeholders patrolling key smuggling hotspots, providing real-time aerial intelligence that led to the swift interception and destruction of smuggling infrastructure.\n\nShe said the drones have revolutionised border security, providing unparalleled aerial surveillance and tracking smugglers in real time, even in remote areas that were previously difficult to monitor.\n\nThe commissioner general added that the drones were also equipped with night vision and high-resolution cameras.\n\nShe said the drones have been instrumental in identifying illegal crossing points and exposing deeply entrenched smuggling networks.\n\nThis is a game-changer in our fight against smuggling. The use of drones has allowed us to detect smuggling activities with precision and speed, ensuring that illicit goods never make it into the market, said the Commissioner General Chinamasa.\n\nSmuggling is not just about tax evasionits an attack on Zimbabwes economy, local industries, and the safety of our communities. Through this collaborative approach, we are sending a strong message: Zimbabwes borders will not be a playground for criminals.\n\nMs Chinamasa said the latest intelligence-driven operation targeted five notorious smuggling corridors, informally known as Valley 1 and 2, Proof, Godfather, and Thembani.\n\nShe said at these illegal crossing points, the surveillance teams uncovered a fleet of inflatable boats strategically positioned on both the South African and Zimbabwean sides; vehicles on standby, ready to transport smuggled goods inland; donkey-drawn carts, motor vehicles, and boats, being used to ferry illicit goods across the border.\n\nShe said the revenue collector will continue to intensify aerial patrols, deployment of more drones, and increase joint border operations with security agencies to completely dismantle smuggling syndicates.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/32983af7-677b-4714-bb44-f8c7bf119700-680x380.jpeg",
            "description": "Thupeyo Muleya, Beitbridge Bureau The Zimbabwe Revenue Authority (Zimra) working with other border agencies on Tuesday intercepted and destroyed 21 boats which were being used to move contrabands between Zimbabwe and South Africa along the Limpopo River. Most of the boats were identified with the aid of drone surveillance technology. In a statement Zimra’s Commissioner […]",
            "time": "21:05",
            "date": "11 Feb 2025"
        },
        {
            "title": "Avondale West community leader appeals",
            "url": "https://www.herald.co.zw/avondale-west-community-leader-appeals/",
            "content": "Diana Nherera\n\nSuburban Reporter\n\nAvondale West community leader Eyahra Mathazia is appealing for building materials and other forms of support to rebuild a house belonging to an Avondale West resident Gogo Malisela that was destroyed by a fire last month.\n\nShe said Gogo Malisela is a pillar in her community and does a lot of work within the church and community.\n\nSo we feel the need to support the cause. We are appealing and challenging community trailblazers especially the property development and hardware consumable fields to come to the front and assist Gogo with this important rebuild, she said.\n\nWhat is needed are bricks, cement, electrical reticulation, plumbing, consumables, roofing, tiling, fixtures and fittings and the beams for roof and finishings like doors.\n\nMathazia said Zesa has given the greenlight to the Malisela family to clear off all the debris.\n\nThey have done their investigations so there was phenomenal support that came through from men at the Roman Catholic church which she belongs to, she said.\n\nThey have managed to remove rubble from three rooms in the house but had to stop due to the weather. We are going to go by the engineers report which was so kindly done pro-bono.\n\nThey said they need to look at the floor to make sure that it is not cracked. If its cracked then we will have to replace the floor and the demolish the walls and then build up\n\nMathazia said before the rebuild, they need to have the plan of the house so that they can get a quantity surveyor to survey and provide the quantities for building materials\n\nMathazia said the Malisela family has enough clothing, bedding from donations.\n\nShe said this week she is expecting to circulate a petition for Gogo Malisela to replace important documents relating to her house.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/44472c80-c4e1-4832-8042-7b7730cc82f6-680x380.jpeg",
            "description": "Diana Nherera Suburban Reporter Avondale West community leader Eyahra Mathazia is appealing for building materials and other forms of support to rebuild a house belonging to an Avondale West resident Gogo Malisela that was destroyed by a fire last month. She said Gogo Malisela is a pillar in her community and does a lot of […]",
            "time": "21:05",
            "date": "11 Feb 2025"
        },
        {
            "title": "National Assembly honours Namibia’s late President Nujoma",
            "url": "https://www.herald.co.zw/national-assembly-honours-namibias-late-president-nujoma/",
            "content": "Farirai Machivenyika\n\nSenior Reporter\n\nThe National Assembly on Tuesday observed a moment of silence to honour the late former Namibian President, Sam Nujoma, who died on Saturday.\n\nPresident Nujoma (95) was one of the last surviving icons of his generation who fought against white colonial rule not only in the Sadc region but in Africa as a whole.\n\nCCC legislator Ms Maureen Kademaunga also proposed that the Government declare a day of mourning in honour of the late former Namibian President and founding father.\n\nMeanwhile, the National Assembly also observed a moment of silence in honour of the late CCC Glen View South legislator, Mr Grandmore Hakata, who died last month.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/4d21d601-244a-48fa-a153-f87657fd86c2-680x380.jpeg",
            "description": "Farirai Machivenyika Senior Reporter The National Assembly on Tuesday observed a moment of silence to honour the late former Namibian President, Sam Nujoma, who died on Saturday. President Nujoma (95) was one of the last surviving icons of his generation who fought against white colonial rule not only in the Sadc region but in Africa […]",
            "time": "21:05",
            "date": "11 Feb 2025"
        },
        {
            "title": "Police recover 681 boxes of counterfeit brake fluid and adhesives",
            "url": "https://www.herald.co.zw/police-recover-681-boxes-of-counterfeit-brake-fluid-and-adhesives/",
            "content": "Crime Reporter\n\nPolice have recovered 681 boxes of counterfeit brake fluid and prime bond multipurpose adhesives which were being sold to unsuspecting customers at Keacy Motor Spares along Harare Street.\n\nThe 88 boxes of prime bond (8 800 units) and 593 boxes of brake fluid (26 000 units) were recovered by a team of officers from the ZRP Licence Inspectorate who were patrolling Harare Street.\n\nSelina Nyurwa and Ashley Kasambarara, employers at the shop, were arrested in connection with the crime, while the prime bond and brake fluid were taken to Harare Central Police Station for further investigations.\n\nA manhunt has since been launched for the company directors.\n\nNational police spokesperson, Commissioner Paul Nyathi said investigations are in progress.\n\nWe have launched a manhunt for the company owners as investigations into this case continue, he said.\n\nThese two suspects are just employees. We are appealing for information that might assist us with investigations.\n\nSince last month, there has been an operation targeting counterfeit products.\n\nThe crackdown, led by the Consumer Protection Commission (CPC) in collaboration with other Government agencies, aims to combat business malpractice.\n\nCabinet ordered the operation which involves inspections conducted by the CPC along with the Ministry of Industry and Commerce, Trade Measures Department, the Zimbabwe Revenue Authority, the Zimbabwe Republic Police, and the\n\nMinistry of Health and Child Care.\n\nThis has resulted in the prosecution of over 90 businesses in Zimbabwe, with a shop in Bindura, suspected of being a major supplier of illegally repacked sugar, having been closed.\n\nThe Bindura shop was selling 1,6kg of sugar in 2kg packets.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/22982cf2-df13-4161-b358-f374713a8196-680x380.jpeg",
            "description": "Crime Reporter Police have recovered 681 boxes of counterfeit brake fluid and prime bond multipurpose adhesives which were being sold to unsuspecting customers at Keacy Motor Spares along Harare Street. The 88 boxes of prime bond (8 800 units) and 593 boxes of brake fluid (26 000 units) were recovered by a team of officers […]",
            "time": "21:05",
            "date": "11 Feb 2025"
        },
        {
            "title": "Zimbabwean remanded in custody for smuggling R14 million cigarettes",
            "url": "https://www.herald.co.zw/zimbabwean-remanded-in-custody-for-smuggling-r14-million-cigarettes/",
            "content": "Thupeyo Muleya\n\nBeitbridge Bureau\n\nA Zimbabwean truck driver, Jiant Janos Bimha (44), has been further remanded in custody by a Musina Magistrates Court after he was arrested for allegedly smuggling cigarettes worth R14 million into South Africa.\n\nBimha was arrested on January 18, 2025, after he was allegedly found in possession of the contraband at Beitbridge Border Post soon after entering the neighbouring country.\n\nThe police have since confiscated the 710 boxes of the illicit cigarettes and a truck tanker valued at R2 500 000.\n\nSouth Africas spokesperson for the National Prosecuting Authority (NPA) in Limpopo Province, Ms Mashudu Malabi-Dzhangi said the matter was postponed to March 7 for bail application.\n\nThe smuggling of cigarettes has become a perennial headache for both Zimbabwe and South Africa and authorities are collaborating to curb the vice.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/11/remanded-custody-rubber-stamp-remanded-custody-red-rubber-stamp-over-white-background-118861806.jpeg",
            "description": "Thupeyo Muleya Beitbridge Bureau A Zimbabwean truck driver, Jiant Janos Bimha (44), has been further remanded in custody by a Musina Magistrates Court after he was arrested for allegedly smuggling cigarettes worth R14 million into South Africa. Bimha was arrested on January 18, 2025, after he was allegedly found in possession of the contraband at […]",
            "time": "21:05",
            "date": "11 Feb 2025"
        },
        {
            "title": "Zimbabwe begins historic compensation of BIPPA-protected farmers",
            "url": "https://www.herald.co.zw/zimbabwe-begins-historic-compensation-of-bippa-protected-farmers/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nThe Government has begun compensating foreign investors whose farms were acquired during the Land Reform Programme, thereby marking a major step in the countrys economic reforms.\n\nThe payments, drawn from a US$20 million allocation in the 2024 National Budget, target 94 farms protected under Bilateral Investment Protection and Promotion Agreements (BIPPAs).\n\nGovernment has committed an additional US$20 million in the 2025 National Budget, with full payments expected by 2028.\n\nEligible investors are from Denmark, Germany, the Netherlands, Switzerland, and former Yugoslavia.\n\nFinance Minister Professor Mthuli Ncube said the move is a milestone in Zimbabwes economic recovery efforts.\n\nI am pleased to announce that the compensation process has begun. This is crucial for building trust, honouring commitments, and addressing Zimbabwes debt challenges.\n\nAmbassadors from Germany, the Netherlands, and Switzerland welcomed the development, calling it a historic achievement.\n\nThey urged Zimbabwe to maintain momentum towards a comprehensive and fair settlement for all affected investors.\n\nThe compensation is part of Zimbabwes Arrears Clearance and Debt Resolution Process, launched in 2022.\n\nDr Akinwumi Adesina, president of the African Development Bank, commended the initiative.\n\nThis demonstrates Zimbabwes goodwill and commitment to investor confidence. The progress calls for support from development partners.\n\nPresident Mnangagwa, speaking at a November 2024 high-level meeting, reaffirmed Governments dedication to reforms and said they are essential for economic growth.\n\nAs Zimbabwe advances the implementation of its National Development Strategy 1 (2021-2025), the compensation plan is a crucial step towards unlocking external financing and fostering economic stability.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/07/c0d6de7b-5d63-4d31-985e-6d18ca0e33b6-680x380.jpeg",
            "description": "Ivan Zhakata Herald Correspondent The Government has begun compensating foreign investors whose farms were acquired during the Land Reform Programme, thereby marking a major step in the country’s economic reforms. The payments, drawn from a US$20 million allocation in the 2024 National Budget, target 94 farms protected under Bilateral Investment Protection and Promotion Agreements (BIPPAs). […]",
            "time": "21:05",
            "date": "11 Feb 2025"
        },
        {
            "title": "17 drug dealers arrested",
            "url": "https://www.herald.co.zw/17-drug-dealers-arrested/",
            "content": "Crime Reporter\n\nPolice have arrested 17 drug dealers countrywide as the crackdown against them continues.\n\nThe suspects whose cases are still pending before the courts were arrested between January 8 and February 11.\n\nNational police spokesperson Commissioner Paul Nyathi confirmed the development in a statement.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/04/Say-no-to-drug-abuse.jpg",
            "description": "Crime Reporter Police have arrested 17 drug dealers countrywide as the crackdown against them continues. The suspects whose cases are still pending before the courts were arrested between January 8 and February 11. National police spokesperson Commissioner Paul Nyathi confirmed the development in a statement.",
            "time": "21:05",
            "date": "11 Feb 2025"
        },
        {
            "title": "Rain expected across central Zimbabwe",
            "url": "https://www.herald.co.zw/rain-expected-across-central-zimbabwe/",
            "content": "Online Reporter\n\nTHE Meteorological Services Department (MSD) has predicted heavy rainfall across central parts of Zimbabwe, with warnings of potential thunderstorms and flooding.\n\nThis comes after some parts of the country, particularly in the south and east, have experienced significant rainfall over the past 24 hours.\n\nThe cloud system currently moving over the southern and eastern parts of the country has resulted in heavy rainfall, with the highest rainfall amounts exceeding 50mm in 24 hours, said the MSD.\n\nAreas such as Zvishavane and Gwanda recorded the highest rainfall at 96mm and 91mm respectively.\n\nHeavy rainfall is likely over much of Masvingo, Midlands, Manicaland and all Matabeleland Provinces, said the department.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Rains.jpg",
            "description": "Online Reporter THE Meteorological Services Department (MSD) has predicted heavy rainfall across central parts of Zimbabwe, with warnings of potential thunderstorms and flooding. This comes after some parts of the country, particularly in the south and east, have experienced significant rainfall over the past 24 hours. “The cloud system currently moving over the southern and […]",
            "time": "21:05",
            "date": "11 Feb 2025"
        },
        {
            "title": "Bulawayo man jailed 15 years for indecent assault",
            "url": "https://www.herald.co.zw/bulawayo-man-jailed-15-years-for-indecent-assault/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nA 47-year-old man from Mpopoma, Bulawayo, has been sentenced to 15 years in prison for aggravated indecent assault.\n\nThe man appeared before the Western Commonage Magistrates Court.\n\nThe incident occurred on October 16, 2024, when the man assaulted an 11-year-old girl who was helping his daughter with homework.\n\nThe mans daughter fell asleep and he approached the complainant and indecently assaulted her repeatedly.\n\nThe victim reported the incident to her teacher, leading to the mans arrest.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/11/Jailed.jpg",
            "description": "Ivan Zhakata Herald Correspondent A 47-year-old man from Mpopoma, Bulawayo, has been sentenced to 15 years in prison for aggravated indecent assault. The man appeared before the Western Commonage Magistrates’ Court. The incident occurred on October 16, 2024, when the man assaulted an 11-year-old girl who was helping his daughter with homework. The man’s daughter […]",
            "time": "21:05",
            "date": "11 Feb 2025"
        },
        {
            "title": "Mbare woman jailed 5 years over 6,3 kg of mbanje",
            "url": "https://www.herald.co.zw/mbare-woman-jailed-5-years-over-63-kg-of-mbanje/",
            "content": "Thupeyo Muleya\n\nBeitbridge Bureau\n\nA 33-year-old woman from Mbare, Harare, has been jailed for five years by a Beitbridge magistrate after she was found with 6,3 kg of dagga that is believed to have been smuggled from South Africa.\n\nHowever, Brenda Chipfunde will spend four years and two months in jail after 10 months were suspended on the condition that she does not commit a similar offence in the next five years.\n\nChipfunde was convicted on her own plea of guilty when she appeared before Mr Mbonisi Kaweni.\n\nProsecuting, Mr Tawanda Chigavazira said on February 7 at around 6pm, detectives from Beitbridge Police Station were on patrol when they got information that Chipfunde was planning to transport dangerous drugs from Beitbridge to Harare.\n\nThe officers then tracked her to a hiking spot along the Beitbridge-Harare Highway where they found her looking for transport.\n\nThe police detectives identified themselves and requested to search her luggage, resulting in the discovery of 12 cobs of dagga that were wrapped in a duvet.\n\nChipfunde was subsequently arrested and the dagga was taken for weighing.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/09/Jailed.jpg",
            "description": "Thupeyo Muleya Beitbridge Bureau A 33-year-old woman from Mbare, Harare, has been jailed for five years by a Beitbridge magistrate after she was found with 6,3 kg of dagga that is believed to have been smuggled from South Africa. However, Brenda Chipfunde will spend four years and two months in jail after 10 months were […]",
            "time": "21:05",
            "date": "11 Feb 2025"
        }
    ]
}