{
    "news": [
        {
            "title": "‘Africa should manage own health affairs’",
            "url": "https://www.herald.co.zw/africa-should-manage-own-health-affairs/",
            "content": "Zvamaida Murwira, Senior Reporter\n\nPRESIDENT Mnangagwa yesterday met a special envoy from Tanzanian President Dr Samia Suluhu Hassan with a call to have Africa become independent in managing its health affairs in the wake of the withdrawal of technical support from development partners from Western countries.\n\nTanzanias Foreign Affairs and East Africa Co-operation Minister, Ambassador Thabit Mahmoud Kombo, delivered a special message to President Mnangagwa at State House in Harare where they held bilateral discussions.\n\nBriefing journalists after the meeting, Amb Kombo said the primary objective was to present Professor Mohamed Yakub Janabi, a Sadc endorsed candidate for the next regional director for the World Health Organisation African region.\n\nFive candidates nominated by their countries are competing for the position, which became vacant following the death of Dr Faustine Ndugulile, the former WHO regional director-elect for Africa and former Tanzanian Minister of Health, who passed away on November 27, 2024.\n\nI came with a special message from my President Dr Samia Suluhu Hassan who calls President Mnangagwa her senior elder brother to deliver a message.\n\nWe thank him for the kind and warm welcome and the hosting that we have always enjoyed as Sadc members and him, President Mnangagwa, as our Sadc Chair.\n\nI came also with another message about a candidate that will be running for the Afro Region World Health Organisation director, as you know we lost the previous one who was from Tanzania, Dr Faustine Ndugulile; we lost him just before starting his term as director of WHO for African region.\n\nBecause of the sudden loss, we have put up another candidate and according to the procedure of WHO, we have to go through all the member States, said Amb Kombo.\n\nHe added that in terms of their tradition as Tanzanians, they start by meeting elders and the elder in the region is Sadc, which has 16 countries.\n\nFrom SADC, which is the sub-regional body, they go to the African Union.\n\nWe have already been to AU as our elder brother, we met President (Joao) Laurenco (of Angola) and today we are meeting another elder brother, Chairperson of our own Sadc region.\n\nHe received our message very well. This candidate I have is Prof Janabi, he has already been endorsed by the Sadc region as our sole candidate for all the 16 countries, Amb Kombo said.\n\nProf Janabi said his objective was to bring transformative changes in African health discourse and make ensure the continent becomes independent.\n\nOne of the goals which I want to do is the transformative changes, which I am picking the baton from Dr Matshidiso Moeti, to continue the transformative changes if elected, especially now that we are all aware of the geopolitical tension with the donors in WHO.\n\nSo, I think you can look at it in two ways; you can look at it as a challenge or you can look at it as an opportunity. I look at it as an opportunity for the Afro region, which has got 47 countries.\n\nI think its high time we should think of being independent in managing our health matters, because African problems are supposed to be solved by Africans ourselves, said Prof Janibi, a cardiologist.\n\nHe said he would ensure universal health for everyone if elected, using his vast experience in health issues.\n\nI am the chief executive officer of Muhimbili National Hospital, our largest hospital in the country with 2 400 beds (and) 4 000 staff. We see roughly 4 000 patients every day, but on top of that, I am senior advisor to the current President Dr Hassan on health matters, policy and nutrition.\n\nSo, I do advise a lot on primary healthcare, universal health coverage, and equity, because what we want is universal health coverage, so there should be equity. Every citizen, the 47 member States, should get the basic services, he said.\n\nApart from Prof Janabi, other contenders are Dr Nda Konan Michel Yao from Cte dIvoire, Dr Dram Mohammed Lamine from Guinea, Dr Boureima Hama Sambo from Niger and Prof Mijiyawa Moustafa from Togo.\n\nAccording to the WHO appointment process, any member State of the African region may propose a candidate for the post of regional director.\n\nThe nomination is conducted by secret ballot during a private meeting of the regional committee session scheduled to take place on May 18, 2025, in Geneva, Switzerland.\n\nFollowing the regional committee meeting, the nominated regional director will be officially appointed by the WHO Executive Board, based on the nomination made by the WHO Regional Committee for Africa.\n\nThe WHO regional director serves a five-year term, with the possibility of one reappointment.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/HE1-1.jpg",
            "description": "Zvamaida Murwira, Senior Reporter PRESIDENT Mnangagwa yesterday met a special envoy from Tanzanian President Dr Samia Suluhu Hassan with a call to have Africa become independent in managing its health affairs in the wake of the withdrawal of technical support from development partners from Western countries. Tanzania’s Foreign Affairs and East Africa Co-operation Minister, Ambassador […]",
            "time": "06:30",
            "date": "18 Mar 2025"
        },
        {
            "title": "Retail sector on path to recovery",
            "url": "https://www.herald.co.zw/retail-sector-on-path-to-recovery/",
            "content": "Blessings Chidakwa, Herald Reporter\n\nZIMBABWEs retail sector is showing signs of recovery as Government reforms, especially on exchange rate determination, take effect, with listed retail giant OK Zimbabwe Limited among those on the rebound.\n\nGovernment launched the Zimbabwe Industrial Reconstruction and Growth Plan for the period 2024-2025 aimed at enhancing the domestic economy by promoting the procurement of locally produced goods.\n\nWith the Governments ongoing economic reforms, there is renewed optimism that Zimbabwes retail sector is on track for sustainable growth, providing relief to both businesses and consumers.\n\nThis emerged yesterday during an assessment by the Parliamentary Committee on Industry and Commerce, which is conducting nationwide evaluations to gauge the ease of doing business and engage directly with retailers to understand their challenges.\n\nThe committee, led by its chairperson, Clemence Chiduwa, toured OK Zimbabwe Limited outlets in Harare to assess its current operations.\n\nSpeaking during an outreach visit to OK Mart in Hillside, Cde Chiduwa, who is also Zaka South Member of Parliament (Zanu PF), said the Governments efforts to stabilise the economy and support the revival of retail businesses were yielding positive results.\n\nObviously, for us, we are looking at the revival of the retail sector, and we are happy that the Government is working hard on that, he said.\n\nWe have seen the reforms that are going on, especially on exchange rate determination. And all this should assist the sector to grow again.\n\nOK Zimbabwe coperations director, Vupenyu Gumbo (left) leads the Parliamentary Portifolio Committee on Industry and Commerce led by chairperson, Clemence Chiduwa (second from left) at a tour of OK Mart in Hillside, Harare yesterday as part of a nation- wide tour of formal and informal retailers.- Picture: Edward Zvemisha\n\nCde Chiduwa said the visit to OK Mart was part of a broader effort to understand retail sector operations.\n\nI think if you wait a number of years, you will know the problems that are being faced by the retail sector. But what came out from the deliberation mostly is only exchange rate issues, he said.\n\nCde Chiduwa said findings from these visits will be consolidated into a report for Parliament, with recommendations aimed at further strengthening the sector.\n\nDespite signs of recovery, Cde Chiduwa acknowledged some lingering challenges shared by retailers, including distortions in the exchange rate market, foreign currency shortages, inconsistent power supply, and regulatory hurdles.\n\nThe distortions that are happening in the exchange rate market, the shortages of foreign currency, power, regulatory requirements. And we are upset, he said.\n\nCde Chiduwa said beyond major retail outlets, the committee is also focusing on Zimbabwes vast informal sector, which plays a crucial role in the economy.\n\nAfter we are done here, we are also going to the downtown area, where we are going to look at the compliance level, especially in the informal sector, he said.\n\nCde Chiduwa said the committees outreach extends across multiple cities, including Harare, Mutare, Chiredzi, Bulawayo, and Gweru.\n\nSpeaking during the tour of OK Mart, the group company secretary, Mrs Margaret Munyuru, said the firm was now on a recovery path.\n\nWe have already started restocking. A few weeks ago, even a month and a half ago, you would have noticed that even Mazoe was missing on the shelves. The shelves are now filling up, she said.\n\nLast month, OK Zimbabwes former chief executive officer, Mr Willard Zireva, returned to lead the retail group and help lift it from its current operational challenges, which have seen the company closing five branches.\n\nLate last year, the retail giant struggled to restock its branches across the country, citing a tough trading environment and a growing debt burden.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Ok.jpg",
            "description": "Blessings Chidakwa, Herald Reporter ZIMBABWE’s retail sector is showing signs of recovery as Government reforms, especially on exchange rate determination, take effect, with listed retail giant OK Zimbabwe Limited among those on the rebound. Government launched the Zimbabwe Industrial Reconstruction and Growth Plan for the period 2024-2025 aimed at enhancing the domestic economy by promoting […]",
            "time": "06:30",
            "date": "18 Mar 2025"
        },
        {
            "title": "EU diplomat happy with Zim trajectory",
            "url": "https://www.herald.co.zw/eu-diplomat-happy-with-zim-trajectory/",
            "content": "Wallace Ruzvidzo, Herald Reporter\n\nEUROPEAN Union Ambassador to Zimbabwe Jobst von Kirchmann says Harare is committed to having a Staff Monitored Programme (SMP) with the International Monetary Fund (IMF), whose preconditions have already been agreed to.\n\nThis comes after an IMF team conducted a staff mission to Harare from January 30 to February 13, culminating in the conclusion of engagements with Government officials and key stakeholders on Zimbabwes SMP.\n\nIn an interview at the weekend, Ambassador von Kirchmann said the commencement of the SMP, which would be a milestone achievement for Zimbabwe, was not far.\n\nI think we are not far away from it (SMP), and we hope it will be signed soon, he said.\n\nAnd that would be a milestone achievement. I believe pre-conditions have been discussed and we are close to, I hope we are close to signing.\n\nRepresentative of the ongoing Polish Presidency of the EU Council Mr Radoslaw Sikorski, who was in the country for a landmark visit, then weighed in expressing his confidence in the success of the SMP once it begins.\n\nThe IMF has signed agreements on curing economies with dozens of countries over the last 40 years.\n\nThey are really experienced in how to help an economy, but also how to monitor the conditionality, the fulfillment of conditions.\n\nYou do not have to reinvent the wheel, if you just listen to the IMF, you will be fine, he said.\n\nMr Sikorski, who is also Polands Minister of Foreign Affairs, said Warsaw had previously had a similar experience to Harare.\n\nWe had a very similar experience to you. We had shops for using the local currency and shops for using the dollar.\n\nToday the Zloty (Polands official currency) is actually gaining against the dollar and the Polish economy is doing very well.\n\nThere are ways of dealing with it, he said.\n\nPresident Mnangagwa has already expressed Zimbabwes commitment to the success of the SMP.\n\nTo anchor implementation of further economic reforms under the Arrears Clearance and Debt Resolution Process, Government is currently negotiating a Staff Monitored Programme (SMP), with the International Monetary Fund, said the President at the 6th High-Level Structured Dialogue Platform Forum: Arrears Clearance and Debt Resolution Process held last November.\n\nThe implementation of any reforms under the SMP, however, impacts negatively on the vulnerable groups of our population.\n\nIn this regard, the protection of the vulnerable groups, through effective social protection programmes, is of critical importance to my Government.\n\nOn Zimbabwes economic potential, Mr Sikorski said it was immense, while expressing the blocs interest in partnering African countries like Harare.\n\nYou have wonderful tourist attractions. You have raw materials that we need. We recognise the huge economic potential of this part of the world, and we would like to be your partners in mutually beneficial enterprises and ventures, he said.\n\nAmbassador von Kirchmann said trade figures between Zimbabwe and the EU were low but there was scope to get them much higher.\n\nI do not have the figures at my fingertips, but they (trade figures) are far too low. They could be much, much higher, just starting with tourism.\n\nI mean, Victoria Falls is a wonder of the universe.\n\nMany more people would love to see it. You have a wonderful climate. You have talented and hardworking people, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/05/Jobst-von-Kirchmann-680x380.jpg",
            "description": "Wallace Ruzvidzo, Herald Reporter EUROPEAN Union Ambassador to Zimbabwe Jobst von Kirchmann says Harare is committed to having a Staff Monitored Programme (SMP) with the International Monetary Fund (IMF), whose preconditions have already been agreed to. This comes after an IMF team conducted a staff mission to Harare from January 30 to February 13, culminating […]",
            "time": "06:30",
            "date": "18 Mar 2025"
        },
        {
            "title": "SADC, EAC renew peace calls in DRC",
            "url": "https://www.herald.co.zw/sadc-eac-renew-peace-calls-in-drc/",
            "content": "Mukudzei Chingwere, Herald Reporter\n\nTHE Southern African Development Community (SADC) and East African Community (EAC) have agreed to reinvigorate their collective efforts towards peace in the Democratic Republic of Congo (DRC).\n\nThis came out during a high-stakes SADC-EAC Ministerial meeting held in Harare yesterday.\n\nThe decisive gathering, which followed earlier discussions by senior officials and previous meetings of Heads of State, focused on addressing the ongoing conflict that has destabilised Eastern DRC for years.\n\nThe Zimbabwe and SADC delegation was led by the Minister of Foreign Affairs and International Trade, Professor Amon Murwira and comprised Defence Minister Oppah Muchinguri-Kashiri, State Security Minister Lovemore Matuke, Home Affairs and Cultural Heritage Minister Kazembe Kazembe, and Tourism and Hospitality Industry Minister Barbara Rwodzi.\n\nAlso present at yesterdays meeting were the Chiefs of Defence Forces from the represented countries, adding a significant military perspective to the discussions.\n\nThe high-level participation underscored the importance of a co-ordinated response to the challenges at hand.\n\nAt the end of the meeting by the two regions, Prof Murwira gave highlights of the meeting, saying they made significant progress in implementing the decisions of their principals.\n\nWe have agreed that the security situation in the DRC demands that we reinvigorate our collective efforts towards peace, with a sense of urgency and in the spirit of Pan-Africanism, he said.\n\nIt is our conviction that the decisions we have adopted will provide impetus to our peace efforts towards resolving the protracted conflict in our sister Republic, given that none but ourselves will bring the peace we want in our two regions.\n\nProf Murwira said they also pledged to urgently put to action the joint roadmap, which elaborates a comprehensive approach encompassing both political and military interventions required to address the complex security and humanitarian situation in the DRC, in the immediate, medium, and long-term.\n\nAs we head back to our capitals, it is important that we not only take concrete steps to operationalise our decisions, but also ensure their timely execution, he said.\n\nProf Murwira said the Technical Co-ordination mechanism is critical in facilitating the implementation of the decisions and helping monitor and evaluate progress achieved, and any areas requiring further attention.\n\nEarlier in his opening remarks, Prof Murwira called for peace and an end to the ongoing humanitarian crisis, urging everyone to focus on achieving broader, lasting peace.\n\nHe emphasised that the true battle lies against poverty and deprivation, which can only be fought through knowledge and skills.\n\nReflecting on the conflict, Prof Murwira reminded delegates that the weapons causing destruction are not of the regions making.\n\nHe warned that if the regions fail to act decisively, history will judge them harshly, stressing the importance of considering the needs of the millions displaced by conflict and calling for the establishment of clear timelines for implementation.\n\nProf Murwira said Zimbabwe and SADC envision Africa as a tree of life, rather than a tree of death, calling for unity in building a brighter future for all.\n\nCabinet Secretary for Foreign and Diaspora Affairs of Kenya and Co-Chairperson of the SADC-EAC Joint Ministerial Meeting, Dr Musalia Mudavadi, underscored the profound impact of the crisis on vulnerable populations, particularly children and women.\n\nHe cited the UN figures that show over 700 000 individuals have been displaced, stressing the critical importance of achieving lasting peace and the need for the African Union and SADC to collaborate effectively in implementing the agreements reached.\n\nDr Mudavadi also commended the AU for endorsing their previous communique, reinforcing the collective commitment to resolving the challenges faced by the region.\n\nI also want to point out that the ministers meeting is a herald of the summit of Heads of State and Government and therefore the ministerial meeting should refine several proposed strategies for onward consideration by the Heads of State and Government before implementation, said Dr Mudavadi.\n\nIn our conversations, we have to underscore that the humanitarian toll continues to rise, amplifying calls for urgent regional and international intervention to prevent further suffering and displacement.\n\nI also want to highlight the impact on the vulnerable, especially children and women. For instance, the United Nations Childrens Fund (Unicef) estimates that the resurgence of conflict in the province of South Kivu in the Eastern DRC has forced more than 700 000 people, nearly half of them children, to flee their homes.\n\nDr Mudavadi thanked the represented countries for demonstrating commitment to the welfare of the Congolese people through co-operation towards establishing a roadmap for peace in DRC.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/SD1.jpg",
            "description": "Mukudzei Chingwere, Herald Reporter THE Southern African Development Community (SADC) and East African Community (EAC) have agreed to reinvigorate their collective efforts towards peace in the Democratic Republic of Congo (DRC). This came out during a high-stakes SADC-EAC Ministerial meeting held in Harare yesterday. The decisive gathering, which followed earlier discussions by senior officials and […]",
            "time": "06:30",
            "date": "18 Mar 2025"
        },
        {
            "title": "Zanu PF begins construction of new provincial HQ in Masvingo",
            "url": "https://www.herald.co.zw/zanu-pf-begins-construction-of-new-provincial-hq-in-masvingo/",
            "content": "George Maponga, Masvingo Bureau\n\nTHE ruling Zanu PF party in Masvingo has commenced construction of a state-of-the-art office complex that will serve as its permanent provincial headquarters.\n\nThe new facility, located in the Clovelly area on the western outskirts of the ancient city, will include a conference centre with a seating capacity of 10 000 people.\n\nThe project received a huge boost yesterday when Special Presidential Advisor Dr Paul Tungwarara donated 600 bags of cement and 50 000 face bricks.\n\nThis donation brings the total number of bricks available for the project to 80 000.\n\nCurrently, Zanu PF operates from rented premises in Masvingo province, as it lacks permanent offices.\n\nThe groundbreaking project marks a new chapter for the party in the region.\n\nDuring the handover ceremony at the construction site, Minister of State for Masvingo Provincial Affairs and Devolution, Ezra Chadzamira, who represented Dr Tungwarara, described the construction of the new headquarters as a historic milestone for the ruling party.\n\nThis will be the first time our province has its own offices as the revolutionary party. By December this year, this project will be complete. We are grateful for the donation of 50 000 bricks and 600 bags of cement, which, combined with the existing materials, brings us to 80 000 bricks, said Minister Chadzamira.\n\nHe added that the project is nearing completion, with supporters pledging to furnish the new offices and roofing work already in progress.\n\nThis is a new milestone for Zanu PF under President Mnangagwas leadership, Minister Chadzamira said.\n\nHe said the construction of the new headquarters reflects confidence in President Mnangagwas leadership and aligns with his transformative vision for the country.\n\nThose who dream of another leader before 2030 should seek exorcism of evil spirits because President Mnangagwa is our God-ordained leader, shepherding the country towards Vision 2030, Minister Chadzamira said.\n\nZanu PF Masvingo Provincial Chairperson, Cde Rabson Mavhenyengwa, revealed that the new complex will feature a conference centre capable of hosting 10 000 people.\n\nOnce completed, all our meetings, including inter-district conferences, will be held here at Clovelly, said Cde Mavhenyengwa.\n\nHe also expressed gratitude to President Mnangagwa and Dr Tungwarara for their support in initiating the project.\n\nThe construction is expected to create employment opportunities for locals, as the labour force will be sourced from the surrounding communities.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2020/08/1408-1-1-EZRA-CHADZAMIRA.jpg",
            "description": "George Maponga, Masvingo Bureau THE ruling Zanu PF party in Masvingo has commenced construction of a state-of-the-art office complex that will serve as its permanent provincial headquarters. The new facility, located in the Clovelly area on the western outskirts of the ancient city, will include a conference centre with a seating capacity of 10 000 […]",
            "time": "06:30",
            "date": "18 Mar 2025"
        },
        {
            "title": "Government cracks down on night vending, counterfeit goods",
            "url": "https://www.herald.co.zw/government-cracks-down-on-night-vending-counterfeit-goods/",
            "content": "Joseph Madzimure, Senior Reporter\n\nGOVERNMENT has issued a stern warning against night vending, citing the proliferation of counterfeit products and the chaos caused by unregulated street trading.\n\nLast week, local authorities were given a 48-hour ultimatum to clear night vendors from the streets of cities and towns across the country.\n\nThis move comes in response to a surge in night vending over recent months, which has led to increased human traffic, widespread littering, and disruptions to businesses operating in central business districts.\n\nNow, all vendors are required to possess valid licenses and operate exclusively from designated areas.\n\nSpeaking at the 2025 World Consumer Rights Day commemorations, the Minister of Industry and Commerce, Mangaliso Ndlovu, said there is a need for regulation and consumer protection to protect the public from harmful goods that are being sold on the streets.\n\nTo those involved in night street vending, be warned: if you believe your trade is necessary, seek appropriate authority so that it can be supervised and protected.\n\nOperating without such authority is a violation of the law and puts both you and consumers at risk. This is unacceptable, he said.\n\nMinister Ndlovu urged consumers to be cautious of counterfeit products flooding the market, many of which are produced or repackaged in unregistered backyard industries.\n\nOur street pavements have turned into market stalls, filled with everything from designer-label clothes and shoes to foodstuffs, beverages, and even medicines.\n\nMost of these products are unregulated, posing serious risks to consumer health and safety.\n\nWhile we want to harness the entrepreneurial spirit of our people, it must be done correctly, without endangering the very people we aim to serve, he said. Minister Ndlovu said many of these counterfeit goods are smuggled into the country through undesignated crossing points, allowing traders to evade taxes and sell products at low prices. However, he warned that these low prices come at a significant cost to consumer health and safety.\n\nI appeal to all consumers not to fall for this brazen deception. The risks far outweigh the benefits, Minister Ndlovu said.\n\nParticipants follow proceedings during World comsumer rights day commemorations in Harare yesterdy. -Picture: Memory Mangombe.\n\nHe commended the Minister of Local Government and Public Works, Daniel Garwe, for directing local authorities to remove vendors from undesignated areas.\n\nMinister Ndlovu also reaffirmed the Governments commitment to protecting consumer rights and fostering a fair and transparent marketplace.\n\nTogether, we can build a future where every citizen can participate in the marketplace with confidence, knowing their rights are protected and their voices are heard. By fostering a culture of fairness and transparency, we can achieve our Vision 2030 and create a prosperous and inclusive Zimbabwe for all, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/WC.jpg",
            "description": "Joseph Madzimure, Senior Reporter GOVERNMENT has issued a stern warning against night vending, citing the proliferation of counterfeit products and the chaos caused by unregulated street trading. Last week, local authorities were given a 48-hour ultimatum to clear night vendors from the streets of cities and towns across the country. This move comes in response […]",
            "time": "06:30",
            "date": "18 Mar 2025"
        },
        {
            "title": "EDITORIAL COMMENT: Normalisation of EU-Zim ties benefits all",
            "url": "https://www.herald.co.zw/editorial-comment-normalisation-of-eu-zim-ties-benefits-all/",
            "content": "THE near total normalisation of relations between Zimbabwe and the European Union, with only the largely a symbolic arms embargo left of the old sanctions regime, shows the gains of the Second Republics pragmatic foreign policy of engagement and re-engagement.\n\nOn its part, the EU has also displayed remarkable magnanimity and open-mindedness in acknowledging the immense progress achieved under President Mnangagwa since he took the reins of power in 2017.\n\nThe new normal was seen at the weekend when Polish Foreign Minister Mr Radoslaw Sikorski visited Zimbabwe to co-chair a SADC-EU Ministerial meeting. During Polands Presidency of the EU Council, this is a duty that falls to Polish Ministers and so Mr Sikorski was representing the EU, and while his presence was obviously normal, he was still the highest ranking EU representative in the country for more than 20 years.\n\nBut in many ways more importantly was the step last week, when the last EU sanctions targeted entity in Zimbabwe, the Zimbabwe Defence Industries, was removed from the list. It is very unlikely that there are any ties between that company and any European business, but the removal meant that there were no longer any EU sanctions targets in Zimbabwe.\n\nThis is important. The problem with so-called targeted sanctions is that there is serious collateral damage on ordinary people and the country as a whole.\n\nEuropean companies doing business in Zimbabwe had to make sure that no person or entity targeted was involved in any way in the deal. In the same vein, European banks in particular had to make sure that every payment from a Zimbabwean business for something they bought from a European company and every payment to a Zimbabwean company did not involve a target.\n\nThis imposed practical restrictions on a lot of business and financing, as checks had to be made and when the profits of a deal, or the banking fee, were to be chewed up by the costs of a required check then often the decision was made not to bother.\n\nNow any European company and any European bank can go ahead and conduct normal business with Zimbabwean customers and suppliers without having to look over its shoulder.\n\nThe final EU sanction, the arms embargo, does not have this effect since all arms sales in every country go through a separate defined route and need positive approval from the selling companys Government, so there is never that need for major checks that the targeted sanctions demand.\n\nIn any case the lifting of that sanction would be largely symbolic, as Zimbabwe is not a major buyer of arms and has assured suppliers for the routine supplies of things like generic ammunition and the very modest supplies of equipment. The lifting of that embargo would thus just be a signal that there were no sanctions whatsoever, and so total normality of relations.\n\nThe EU joined the American and British sanctions in response to the land reform programme almost 25 years ago. They drew up their own lists of sanctioned individuals and companies and had their own set of financial sanctions.\n\nAt the same time many EU-Zimbabwe ties were put on the back burner, along with ties between Zimbabwe and many EU- member states.\n\nThe advent of the Second Republic and its policy of engaging with everyone attracted a response from the EU and from many European states. What we saw was largely a willingness to be open-minded and to look at what was happening, rather than looking at the past or wanting to remain entrenched.\n\nThat open-minded approach in response to the openness displayed by the Second Republic saw steady progress in the improvement of relations between Zimbabwe and the EU.\n\nIn recent years, EU member states and their Ambassadors have become noticeably very business orientated and tend to stress the positive aspect of relations rather than dwelling on the diminishing number of disagreements. The problem of Zimbabwes debt arrears, the difficulty of any new funding from international development institutions and the difficulty of sorting out rescheduling and other measures are still there but are being addressed.\n\nThe EU has made it clear that it sees the present progress in a very positive light, including that deal made a few years ago with the former commercial farmers fulfilling the Constitutional requirement for proper compensation for the improvements the farmers had made on the acquired farms. That compensation is being paid but it will be paid a lot faster once access to global development finance is possible.\n\nZimbabwe itself, for its own reasons and its own needs rather than in response to outside pressure, had put in place its new home-grown Constitution and started the lengthy process of bringing hundreds of pieces of legislation into line with the Constitutional requirements set by the people when they approved the new basic law. That included practical fulfilment of the compensation for improvements.\n\nIt has been apparent for some time that any attempt to block a debt-clearance arrangement that includes the normal rescheduling and other measures, along with a payment plan for Zimbabwe, would require the European countries to vote against relief for Zimbabwe. Even their abstentions would probably be enough to ensure the passing of a properly-worked out arrangement. So the present warming of relations makes an effective deal far more likely.\n\nThe new levels of EU-Zimbabwe relations, along with other diplomatic progress, has shown the practical benefits of President Mnangagwas engagement policy, and his determination to be a friend to all and an enemy to none.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Radoslaw-Sikorski.jpg",
            "description": "THE near total normalisation of relations between Zimbabwe and the European Union, with only the largely a symbolic arms embargo left of the old sanctions regime, shows the gains of the Second Republic’s pragmatic foreign policy of engagement and re-engagement. On its part, the EU has also displayed remarkable magnanimity and open-mindedness in acknowledging the […]",
            "time": "06:30",
            "date": "18 Mar 2025"
        },
        {
            "title": "Coventry aims to make history",
            "url": "https://www.herald.co.zw/coventry-aims-to-make-history/",
            "content": "SPORTS Minister, Kirsty Coventry will make sporting history if she is elected president of the International Olympic Committee (IOC) at its General Assembly on Thursday.\n\nShe would be the first woman and first person from Africa to head the IOC.\n\nShe would also be the youngest since Pierre de Coubertin, the founding father of the modern Olympic Games. The Frenchman founded the IOC in 1894 and took over the presidency two years later at the age of 33.\n\nCoventry, a 41-year-old former world-class swimmer from Zimbabwe , has always had a strong will and vision.\n\nWhen I was 9 years old, I told my dad I wanted to go to the Olympics and win gold. He told me it would be a rough road ahead, he explained how difficult it was just to make the Olympic team let alone win a medal, but he believed in me, she wrote in a Facebook post a few years ago.\n\nAt the age of 20, she made her dream come true. At the 2004 Games in Athens, Coventry won the gold medal in the 200-meter backstroke.\n\nFour years later, in 2008 in Beijing, she won gold again. In addition to those two gold medals, she collected four Olympic silver medals and one bronze.\n\nThis makes Coventry Africas most successful female Olympian of all time. The only African, who has had more success at the Olympics, is long-distance runner Tirunesh Dibaba of Ethiopia  who won three gold medals (and two bronze).\n\nI have been to five Olympic Games, won seven individual Olympic medals, broken multiple world records and had one of the best World Championship careers of all time, Coventry wrote on her Linkedin profile.\n\nWhile still an active swimmer, Coventry was elected to the IOC Athletes Commission in 2013.\n\nShe represented the interests of athletes for eight years, including three years as chairperson. More recently, she has been a member of the IOC Executive Board.\n\nThe increased influence of the Zimbabwean has raised hopes in Africa that the Summer Olympics could be hosted on the African continent for the first time.\n\nAlthough South Africa and Egypt have expressed their interest, Coventry has played down such expectations.\n\nThe interest is there and now we need to ensure that were working closely with all of these countries that are interested so that they fully understand the magnitude of the Olympic Games, she said.\n\nThe countries of Africa, Coventry said in a Q&A session organised by the Association of International Sports Journalists (AIPS), should really strategically look from the African Union point of view on how we can develop through the All Africa Games our infrastructure that can then be followed up and used by an Olympic Games bid.\n\nCoventry knows from experience just how tough such political processes can be. She has been Zimbabwes Minister of Sport since 2018.\n\nShe says she now has definitely a thicker skin than she used to as an athlete.\n\nKirsty Coventry is not only a sports administrator and politician, but also a mother. She gave birth to her second daughter less than six months ago. Her eldest is six years old.\n\nBy the time she was one year old, she had already been to 10 different countries around the world, Coventry said.\n\nI have an incredible network of support from my husband and family. This is a normal way of life for us. I think its a good way to show that women are just as capable as men even if we are to be expected to be full-time mothers, wives, daughters etc.\n\nWe still have a lot of work to do, and I am excited about leading this movement, Coventry said of gender equality.\n\nWomen are ready to lead. I look at it as an opportunity to push through boundaries so that when my two girls are growing up, they dont have the same boundaries.  DW/MSN/Sports Reporter.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/09/Untitled-183.jpg",
            "description": "SPORTS Minister, Kirsty Coventry will make sporting history if she is elected president of the International Olympic Committee (IOC) at its General Assembly on Thursday. She would be the first woman and first person from Africa to head the IOC. She would also be the youngest since Pierre de Coubertin, the founding father of the […]",
            "time": "06:30",
            "date": "18 Mar 2025"
        },
        {
            "title": "Kuvimba targets 13pc jump in gold output",
            "url": "https://www.herald.co.zw/kuvimba-targets-13pc-jump-in-gold-output/",
            "content": "Business Reporter\n\nKUVIMBA Mining House (KMH) is targeting 3 600 kilogrammes of gold this year, driven by higher ore volumes and improved processing plant efficiencies.\n\nThe projected production represents a 12,5 percent jump from the 3 200kg the company realised in the previous year.\n\nKMH expects improved quality ore and enhanced operational efficiency across its portfolio of gold mines namely Freda Rebecca Gold Mine, Shamva Mine and Jena Mine.\n\nKMH, which is now 70 percent owned by Mutapa Investment Fund, recently said it was seeking to raise US$950 million from development banks, mining companies and traders to fund the development of its lithium, platinum and gold assets.\n\nIf completed the capital raise initiative is expected to bolster the groups operational efficiencies and buoy output.\n\nFor the current year, ending March 31, we project gold production of approximately 3 600kg, representing a 12,5 percent increase from the previous year.\n\nThis growth is primarily driven by a higher ore grade, increased tonnage of processed ore and enhanced operational efficiencies at our two plants.\n\nOur goal as a cluster has been to maximise gold production, capitalising on the rising gold price trend. We are pleased to have successfully leveraged the thriving gold market to achieve our target, said KMH head of gold cluster Mr Patrick Shayawabaya.\n\nThis comes after Finance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube recently said that the contribution of the mining sector to the economy had been steadily growing, rising from 11,5 percent of the countrys Gross Domestic Product in 2018 to 13,3 percent presently.\n\nSimilarly, the mining sector growth is projected at 2,3 percent and 5,6 percent for 2024 and 2025, respectively.\n\nGold is Zimbabwes largest foreign currency earner while mining in general accounts for more than three quarters of Zimbabwes export earnings.\n\nThe growth is driven by increased output, the discovery of new minerals (lithium) and investments in additional capacities.\n\nThis comes after the gold price earlier this month rose to a record, breaching the US$3 000-an-ounce followingUS President Donald Trumps aggressive tariff agenda, which fanned concerns about the potential hit to growth, hurting demand for risk assets and aiding flows into bullion-backed funds.\n\nGold peaked at US$3004.84 an ounce on March 14, 2024.\n\nThe yellow metal has performed robustly in the first quarter of 2025, extending a strong annual gain in 2024.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Untitled-302-680x380.jpg",
            "description": "KUVIMBA Mining House (KMH) is targeting 3 600 kilogrammes of gold this year, driven by higher ore volumes and improved processing plant efficiencies.",
            "time": "06:30",
            "date": "18 Mar 2025"
        },
        {
            "title": "Judgment reserved in Mhlanga bail hearing",
            "url": "https://www.herald.co.zw/judgment-reserved-in-mhlanga-bail-hearing/",
            "content": "Fidelis Munyoro, Chief Court Reporter\n\nJUDGMENT has been reserved in the case of Alpha Media Holdings (AMH) senior reporter Blessed Mhlanga, who faces allegations of transmitting messages to incite public violence.\n\nThis decision follows the conclusion of arguments presented by both the defence and the prosecution before Harare High Court judge, Justice Gibson Mandaza yesterday.\n\nMhlanga approached the High Court seeking bail after the magistrates court denied his application, citing concerns over the risk of witness interference.\n\nDuring the proceedings, Justice Mandaza dismissed the defences attempt to introduce electronic evidence, which had been argued as critical to Mhlangas bail application.\n\nThe court ruled that admitting such evidence at this stage would amount to pre-trial conduct, affirming that it is only admissible during the trial itself.\n\nMhlanga, represented by his lawyer Mr Chris Mhike, argued that he is a suitable candidate for bail and maintains a plausible defence to the charges.\n\nMr Mhike insisted that Mhlanga had no involvement in the alleged transmission of a video recorded at a press conference held by war veteran Blessed Geza.\n\nThe accused has presented a logical and plausible defence, Mr Mhike told the court. He was not present at the press conference, nor did he transmit any of the recorded content. The ownership of the video is attributed to HSTV on YouTube, and my client is not connected to HSTV in any way.\n\nMr Mhike further argued that the States case rests on a false premise that Mhlanga is HSTV, the broadcaster of the content.\n\nThe State alleges that the transmission of the video is an uncontested fact, but it fails to establish who actually transmitted it. There is no evidence linking my client to the act of broadcasting or transmitting the video.\n\nThe defence contended that the State did not allege or provide evidence showing Mhlanga operating a computer or otherwise transmitting the video in question.\n\nThe lawyer emphasised that the quoted words, allegedly inciting violence, were uttered by Geza, not Mhlanga.\n\nThere is no logical connection between my client and the statements attributed to the video. The arrest was baseless, and the State has failed to demonstrate a compelling case against him.\n\nMr Mhike also criticised the magistrates court for denying bail on grounds that the offence posed a threat to public peace and security, arguing that the alleged crime is not a scheduled offence under the law.\n\nHe pointed to what he termed errors in the magistrates reasoning, including the failure to consider Mhlangas co-operation with law enforcement.\n\nAppearing for the State, Mr Fungai Nyahunzvi indicated that the prosecution stands by its written submissions and offered no additional arguments.\n\nJustice Mandaza reserved judgment, leaving the matter pending further deliberation.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2018/01/courthammer14-305x175-680x380.jpg",
            "description": "Fidelis Munyoro, Chief Court Reporter JUDGMENT has been reserved in the case of Alpha Media Holdings (AMH) senior reporter Blessed Mhlanga, who faces allegations of transmitting messages to incite public violence. This decision follows the conclusion of arguments presented by both the defence and the prosecution before Harare High Court judge, Justice Gibson Mandaza yesterday. […]",
            "time": "06:30",
            "date": "18 Mar 2025"
        }
    ]
}