{
    "news": [
        {
            "title": "SA authorities crack down on overloaded omalayitsha",
            "url": "https://www.herald.co.zw/sa-authorities-crack-down-on-overloaded-omalayitsha/",
            "content": "Thupeyo Muleya\n\nBeitbridge Bureau\n\nSouth Africas Department of Traffic and Community Safety has launched a crackdown on overloaded vehicles, among them small cross border transporters commonly known as omalayitsha.\n\nOmalayitsha mostly transport goods for Zimbabweans and Malawians based in South Africa.\n\nIn a statement, the departments spokesperson Ms Tidimalo Chuene said overloaded vehicles are a major threat to road safety.\n\nSince the beginning of December, they have screened 1449 vehicles and charged them for overloading.\n\nAs part of the crackdown, overloaded vehicles are directed to adjust and offload before proceeding with their journeys.\n\nWe are specifically targeting overloaded public transport vehicles and light delivery vehicles towing heavily loaded trailers, commonly known as omalayitsha.\n\nThese vehicles are mostly found on the N1 road stretching from Peinaarsreievr in the Waterberg District to Beitbridge Border Post in Musina, said Ms Chuene\n\nOverloaded vehicles are a major threat to road safety. They are more likely to have tyre bursts and brake failures, which can cause serious accidents. Overloading also affects the vehicles stability, handling and stopping power, thereby putting drivers , passengers and other road users at risk.\n\nShe said the department is operating seven traffic control centres strategically located across Limpopo Province to monitor and screen vehicle loads.\n\nThese centres are in Mantsole, Zebediela, and Groblersburg in the Westerburg district; Polokwane in Capricorn district, Musina at Beitbridge, Mooketsi in Mopani District and Rathoke in Sekhukhune District.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/omalayitsha.jpg",
            "description": "Thupeyo Muleya Beitbridge Bureau South Africa’s Department of Traffic and Community Safety has launched a crackdown on overloaded vehicles, among them small cross border transporters commonly known as omalayitsha. Omalayitsha mostly transport goods for Zimbabweans and Malawians based in South Africa. In a statement, the department’s spokesperson Ms Tidimalo Chuene said overloaded vehicles are a […]",
            "time": "21:46",
            "date": "18 Dec 2024"
        },
        {
            "title": "Cops in court for assaulting ZACC officers",
            "url": "https://www.herald.co.zw/cops-in-court-for-assaulting-zacc-officers/",
            "content": "Crime Reporter\n\nTwo policemen based at Sakubva Police Station in Mutare who were arrested on allegations of assaulting Zimbabwe Anti-Corruption Commission (ZACC) officials have appeared in court.\n\nSergeant Mduduzi Makina (39) and Constable Elliot Gava (42) allegedly manhandled and injured ZACC investigators who had arrested a police officer on allegations of bribery.\n\nMakina and Gava have since appeared before the Magistrates Court.\n\nThey were released on US$100 bail each and will appear in court on January 10, 2025.\n\nThe crime allegedly occurred on December 11, 2024.\n\nAccording to the State, Makina and Gava were on duty at a roadblock along the Mutare-Masvingo Road near Mutare Teachers College when the ZACC team arrived.\n\nDuring surveillance, the ZACC investigators noticed that some police officers were soliciting for bribes from motorists.\n\nThe ZACC team moved in to arrest Constable Peace Muchenje.\n\nThereafter, they seized a roadblock declaration book which they intended to hold as an exhibit.\n\nIt is alleged that Makina and Gava then confronted the ZACC officers, insisting that they should hand over the declaration book.\n\nThey pulled one of the ZACC investigators from the drivers seat, removed the car keys from the ignition and twisted his arm.\n\nThe duo then grabbed the declaration book and fled from the scene.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/courthammer-680x380.jpg",
            "description": "Crime Reporter Two policemen based at Sakubva Police Station in Mutare who were arrested on allegations of assaulting Zimbabwe Anti-Corruption Commission (ZACC) officials have appeared in court. Sergeant Mduduzi Makina (39) and Constable Elliot Gava (42) allegedly manhandled and injured ZACC investigators who had arrested a police officer on allegations of bribery. Makina and Gava […]",
            "time": "21:46",
            "date": "18 Dec 2024"
        },
        {
            "title": "2024 African Spelling Bee Competition postponed",
            "url": "https://www.herald.co.zw/2024-african-spelling-bee-competition-postponed/",
            "content": "Trust Khosa\n\nSix Zimbabwean learners who were set to compete in the African Spelling Bee Competition in Abuja, Nigeria, will now have to wait until April 2025 as the contest has been postponed.\n\nOriginally scheduled to run from today until December 22, the event aims to promote literary and linguistic diversity among young participants.\n\nThe competition caters to two age categories  juniors aged 8 to 12 and seniors aged 13 to 18.\n\nThe contest will now take place from April 9 to 13, 2025.\n\nIvainashe Mbanda, Chelsea Mbanda, and Lorraine Phillips will represent Zimbabwe in the junior category, while Alois Ngwenya, Shamiso Mutsahuni, and Anisha Zvina will compete in the senior category.\n\nIn an interview, Zimbabwean coordinator Enny Chomsara confirmed the postponement.\n\nThe competition has been moved to April next year as some countries were not yet ready. Some participants faced visa challenges, while flights were overbooked due to the holiday season, she explained. We have communicated with our representatives and their guardians about this development, and they understand that the challenges were beyond our control.\n\nChomsara assured the six learners that they will participate in the contest next year.\n\nOf course, our national champions are disappointed, but in life, everything happens for a reason. The students will still have the opportunity to shine in Nigeria, and the 2024 edition will definitely take place next year. The dates (April 913) still stand, and we encourage learners to be patient.\n\nThe competition, a brainchild of US-based lawyer Advocate James Bayanai attracted over 10 000 students nationwide this year.\n\nAdvocate Bayanai visited Zimbabwe earlier this month to meet some of the winners and their guardians and is working closely with the Ministry of Primary and Secondary Education, which has endorsed the programme.\n\nMeanwhile, Chomsara and Advocate Bayanai are set to unveil the 2025 programme in February.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/spelling.jpg",
            "description": "Trust Khosa Six Zimbabwean learners who were set to compete in the African Spelling Bee Competition in Abuja, Nigeria, will now have to wait until April 2025 as the contest has been postponed. Originally scheduled to run from today until December 22, the event aims to promote literary and linguistic diversity among young participants. The […]",
            "time": "21:46",
            "date": "18 Dec 2024"
        },
        {
            "title": "Government targets US$1.9 billion livestock sector by 2025",
            "url": "https://www.herald.co.zw/government-targets-us1-9-billion-livestock-sector-by-2025/",
            "content": "Mutsawashe Mashandure\n\nHerald Correspondent\n\nIn a move set to transform the countrys agricultural landscape, the Government has set its sight on developing a US$1.9 billion livestock economy by 2025.\n\nDuring a stakeholder workshop for the new Zimbabwe Livestock Growth Programme, Professor Obert Jiri, Permanent Secretary in the Ministry of Lands, Agriculture, Fisheries, Water, and Rural Development emphasised the need for innovative and sustainable practices in enhancing the sector.\n\nSome of the key targets specific to livestock in the NDS1 and the Livestock Growth Plan include the beef cattle sector. We aim to improve the beef herd from 5.5 million in 2019 to 6 million by 2025, enhance the calving rate from 45 percent to 55 percent , and increase offtake rates from six percenr to 20 percent .\n\nFor the dairy value chain, we plan to raise the dairy herd from 38 000 in 2019 to 60 000 by 2025 and increase milk production from 79.9 million liters to 150 million by 2025 , he said.\n\nThrough better breeding practices, veterinary services, and nutrition management, we expect to see a significant boost in the health and productivity of our livestock.\n\nBy facilitating access to markets and improving supply chains, we aim to enhance the income of livestock farmers, contributing to overall economic growth in rural areas, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/professor-obert-jiri-old.jpg",
            "description": "Mutsawashe Mashandure Herald Correspondent In a move set to transform the country’s agricultural landscape, the Government has set its sight on developing a US$1.9 billion livestock economy by 2025. During a stakeholder workshop for the new Zimbabwe Livestock Growth Programme, Professor Obert Jiri, Permanent Secretary in the Ministry of Lands, Agriculture, Fisheries, Water, and Rural […]",
            "time": "21:46",
            "date": "18 Dec 2024"
        },
        {
            "title": "Beitbridge disaster response team ready to deal with flash floods as rains begin",
            "url": "https://www.herald.co.zw/beitbridge-disaster-response-team-ready-to-deal-with-flash-floods-as-rains-begin/",
            "content": "Thupeyo Muleya\n\nBeitbridge Bureau\n\nThe Civil Protection Committee in Beitbridge says it has activated its Disaster Rapid Response (DRR) teams to be on high alert following the rains that started pounding the district today (Wednesday).\n\nCommittee chairperson Mrs Sikhangezile Mafu-Moyo said their teams are ready and on the ground.\n\nShe said although it has been raining continuously in most areas across the district, there has not been any reports of damages linked to the rains.\n\nMrs Mafu-Moyo said they are conducting awareness campaigns in areas that are prone to rainfall related disasters.\n\nThese areas include Shashe, Tshituripasi, Tshikwalakwala, Makakavhule, Tongwe, Umzingwane and Tshathapita, among others.\n\nLow lying area around Dulivhadzimu Bus Terminus, the stadium and the council hostels are also perennially hit by flash floods.\n\nWe are on high alert and we continue to urge people to be safe and to use the DRR committees on the ground to relay information on imminent danger linked to heavy rains, said Mrs Mafu-Moyo.\n\nChildren should not play in water bodies and people should avoid crossing flooded rivers on foot or while driving. Those in low lying areas should be ready to move when they face danger.\n\nShe said it is important for members of the community to continuously follow weather updates from the Meteorological Services Department (MSD) or the civil protection committee to minimise the effects of climate related disasters.\n\nThe committee has also identified areas of shelter in the event that flash floods occur in the district.\n\nThe areas include churches, community halls and schools on higher ground.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/floods-680x380.jpg",
            "description": "Thupeyo Muleya Beitbridge Bureau The Civil Protection Committee in Beitbridge says it has activated its Disaster Rapid Response (DRR) teams to be on high alert following the rains that started pounding the district today (Wednesday). Committee chairperson Mrs Sikhangezile Mafu-Moyo said their teams are ready and on the ground. She said although it has been […]",
            "time": "21:46",
            "date": "18 Dec 2024"
        },
        {
            "title": "Vision Board Workshop set to shape 2025",
            "url": "https://www.herald.co.zw/vision-board-workshop-set-to-shape-2025/",
            "content": "Elliot Ziwira\n\nSenior Writer\n\nAs 2024 draws to an end, Zimbabweans have embraced the Vision Board Workshop, conceived by certified life coach and author, Fortunate Kufakunesu.\n\nCommencing in Mutare today and scheduled for Harare on December 20, participants at the workshop create physical boards representing their aspirations.\n\nThe concept seeks to empower individuals to plan and visualise their goals for the upcoming year.\n\nThemed 2025 is on the Horizon, the workshop was launched in 2021.\n\nIn an interview on the sidelines of the opening event, Kufakunesu emphasised the workshops impact.\n\nOverall, the ladies are excited and looking forward to 2025 because they have testimonies from previous workshops, she said.\n\nCreate time to be there, and I will create time to attend to each participant. Bring a friend, together we can make a difference.\n\nA returning participant shared her experience.\n\nThis workshop helped me to overcome procrastination, stay focused, and achieve milestones, including travelling to China to connect with suppliers.\n\nThe workshop is useful in self-improvement as it encourages personal growth.\n\nUltimately, it connects individuals whose shared goal is economic empowerment.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Fortunate-Kufakunesu.jpg",
            "description": "Elliot Ziwira Senior Writer As 2024 draws to an end, Zimbabweans have embraced the Vision Board Workshop, conceived by certified life coach and author, Fortunate Kufakunesu. Commencing in Mutare today and scheduled for Harare on December 20, participants at the workshop create physical boards representing their aspirations. The concept seeks to empower individuals to plan […]",
            "time": "21:46",
            "date": "18 Dec 2024"
        },
        {
            "title": "Festive season road safety awareness campaign launched",
            "url": "https://www.herald.co.zw/festive-season-road-safety-awareness-campaign-launched/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nGOVERNMENT in partnership with other stakeholders has launched a road safety awareness campaign as the country prepares for a busy festive season.The launch was done at Sunny Yi Feng Tiles along the Harare-Bulawayo Road.\n\nIt was attended by the Minister of Transport and Infrastructure Development Felix Mhona, his deputy Joshua Sacco, Deputy Minister of Home Affairs and Cultural Heritage Chido Sanyatwe, Traffic Safety Council of Zimbabwe board chair Bishop Kura Sibanda, senior Government officials and other stakeholders in the transport sector.\n\nSpeaking at the launch, Minister Mhona said high traffic is expected during the 2024 festive season.\n\nOur beloved relatives and friends and tourists from other countries will be travelling in and around Zimbabwe through our busy border and highways, he said.\n\nAs we celebrate the gift of life and reunions with relatives and friends, there will be competition for space on our highways and ports. As the citizenry we need to police ourselves.\n\nDeputy Minister Sanyatwe said road safety is a collective responsibility that requires all stakeholders to have hands on deck.\n\nThis years launch of the festive season road safety campaign is unique not only because it is being held outside Harare but also along one of the major transport corridors.\n\nThe world over, road accidents cause injuries and deaths more than all other incidents.\n\nMany of the acidents can be attributed to human error, with very few being mechanical faults. It is therefore irrefutable that simple reminders of proper road safety can go a long way in reducing road safety risks.\n\nBishop Sibanda said road traffic deaths and injuries make road safety a top priority.\n\n",
            "image_url": null,
            "description": "Ivan Zhakata Herald Correspondent GOVERNMENT in partnership with other stakeholders has launched a road safety awareness campaign as the country prepares for a busy festive season. The launch was done at Sunny Yi Feng Tiles along the Harare-Bulawayo Road. It was attended by the Minister of Transport and Infrastructure Development Felix Mhona, his deputy Joshua […]",
            "time": "21:46",
            "date": "18 Dec 2024"
        },
        {
            "title": "Two lives lost due to Gweru road traffic accidents",
            "url": "https://www.herald.co.zw/two-lives-lost-due-to-gweru-road-traffic-accidents/",
            "content": "Midlands Bureau\n\nTwo passengers died in two separate accidents that occurred in Gweru on Saturday and Sunday.Midlands Provincial police spokesperson Inspector Emmanuel Mahoko confirmed the two road traffic accidents.He said the accidents claimed the lives of two women aged 80 and 40 years respectively.The accidents occurred along the Harare-Bulawayo Road on 14 and 15 December, he said.Inspector Mahoko said on Saturday at about 7:20am, Ray Murefu (53) of Bulawayo was driving a Toyota Hilux along the Harare-Bulawayo Road with three passengers on board.On reaching the 322 km peg, the rear right tyre of his vehicle burst. As a result, the vehicle veered off the road and overturned, he said.Inspector Mahoko said the police attended the scene and took Murefu and his passengers to Gweru Provincial Hospital where Zondi Murefu (80) was pronounced dead on admission.In the second incident, the now deceased Siyenzeni Helegwa (40) was aboard a Ford Bantam motor vehicle which was being driven by Tafadzwa Helegwa (41) of Redcliff.There were three other passengers in the motor vehicle. Upon reaching the 223 km peg along the same road, the vehicle veered off the road and hit a tree, he said.Inspector Mahoko said the police attended the scene and ferried the accident victims to Kwekwe District Hospital where Helegwa was pronounced dead on admission.Others are still admitted at the hospital. They have varying degrees of injuries, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/04/accident-4.jpg",
            "description": "Midlands Bureau Two passengers died in two separate accidents that occurred in Gweru on Saturday and Sunday. Midlands Provincial police spokesperson Inspector Emmanuel Mahoko confirmed the two road traffic accidents. He said the accidents claimed the lives of two women aged 80 and 40 years respectively. “The accidents occurred along the Harare-Bulawayo Road on 14 […]",
            "time": "21:46",
            "date": "18 Dec 2024"
        },
        {
            "title": "20 000 receive food aid in Binga",
            "url": "https://www.herald.co.zw/20-000-receive-food-aid-in-binga/",
            "content": "Precious Manomano\n\nHerald Reporter\n\nAn estimated 20 000 people in Binga are set to get food aid from the Government through the Zimbabwe Red Cross Society and its partners as part of the response to the El Nino-induced drought.\n\nThe Zimbabwe Red Cross Society is working with the Danish Red Cross, the Finnish Red Cross, the International Federation of Red Cross and Red Crescent Societies in Binga Districts five hardest-hit wards.\n\nHeadman Chatyololo II of Manjolo Village said the food aid will go a long way in eradicating hunger and child marriages in his community.\n\nWe greatly appreciate the role that Government, through the Red Cross, is doing to fight hunger in our area. Many children are getting into marriages because of food shortages in their families. We hope the availability of food will eliminate child marriages, said Headman Chatyololo II.\n\nMr Windasi Muleya, who is wheelchair-bound following a crocodile attack, said the assistance he is getting is appreciated.\n\nI cannot provide anything for my family. All my legs and an arm were amputated. This support is critical, especially for people like me, said Mr Muleya.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Screenshot-9-3-680x380.png",
            "description": "Precious Manomano Herald Reporter An estimated 20 000 people in Binga are set to get food aid from the Government through the Zimbabwe Red Cross Society and its partners as part of the response to the El Nino-induced drought. The Zimbabwe Red Cross Society is working with the Danish Red Cross, the Finnish Red Cross, […]",
            "time": "21:46",
            "date": "18 Dec 2024"
        },
        {
            "title": "Community Share Ownership Trusts on the spotlight",
            "url": "https://www.herald.co.zw/community-share-ownership-trusts-on-the-spotlight/",
            "content": "Walter Nyamukondiwa in KADOMA\n\nChiefs and other stakeholders, including representatives of Community Share Ownership Trusts (CSOT) have gathered in Kadoma to review and formulate strategies to improve their operations.\n\nAt least 15 chiefs from across the country are attending the workshop that was organised by the Ministry of Industry and Commerce.\n\nRepresentatives of Mhondoro-Ngezi-Chegutu-Zvimba, Gwanda, Tongogara, and Chiadzwa CSOTs, among others, have presented on their operations and the challenges they are facing in giving back to communities they operate in.\n\nIndustry and Commerce Minister Mangaliso Ndlovu said the workshop was organised to explore ways of enhancing the performance of CSOTs.\n\nMashonaland West Provincial Affairs and Devolution Minister Marian Chombo commended the Zimplats Mhondoro-Ngezi-Chegutu-Zvimba CSOT for being innovative and running successful ventures for the communities.\n\nChief Chikwaka called on Government to tighten mining laws to help protect sacred sites and the environment.\n\nSeveral other chiefs echoed his sentiments and said mining operations are overriding traditional governance systems.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/55abfd3e-09f3-467c-93c9-e63c8ed2325e-1-680x380.jpeg",
            "description": "Walter Nyamukondiwa in KADOMA Chiefs and other stakeholders, including representatives of Community Share Ownership Trusts (CSOT) have gathered in Kadoma to review and formulate strategies to improve their operations. At least 15 chiefs from across the country are attending the workshop that was organised by the Ministry of Industry and Commerce. Representatives of Mhondoro-Ngezi-Chegutu-Zvimba, Gwanda, […]",
            "time": "21:46",
            "date": "18 Dec 2024"
        }
    ]
}