{
    "news": [
        {
            "title": "Siziba, Chimutengwende declared national heroes",
            "url": "https://www.herald.co.zw/siziba-chimutengwende-declared-national-heroes/",
            "content": "Nqobile Tshili and Joseph Madzimure\n\nPRESIDENT Mnangagwa yesterday conferred national hero status on Major-General (Retired) Solomon Siziba and former Information, Posts and Telecommunications Minister Cde Chenhamo Chen Chakezha Chimutengwende, in recognition of their contributions to the country before and after independence.\n\nMaj-Gen Siziba died on Wednesday and will be buried at the National Heroes Acre in Harare next week while burial arrangements for Cde Chimutengwende will be announced in due course as his family was expected to meet Government representatives today.\n\nMaj-Gen Siziba died at Josiah Magama Tongogara Barracks Camp Hospital in Harare after battling cancer.\n\nHe was 67.\n\nBulawayo Provincial Affairs and Devolution Minister Judith Ncube delivered news of the national hero status to the Siziba family at his Killarney residence in Bulawayo yesterday evening after receiving communication from the Presidents Office.\n\nThis message comes from Dr Martin Rushwaya, the Chief Secretary in the Office of the President and Cabinet, and is referenced: National Hero Status, the late Maj-Gen (Rtd) Solomon Siziba. His Excellency, the President and First Secretary of Zanu PF, Cde. Dr. E.D Mnangagwa, has conferred national hero status on the late Cde Maj Gen (Rtd) Solomon Siziba, who died on the 15th of January 2025.\n\nMourners are gathered at 527 Bulawayo Drive, Killarney, Bulawayo. The late Maj Gen (Rtd) Siziba will be interred at the National Heroes Acre in Harare at a date to be announced. I shall be most grateful if you would make the usual arrangements for his burial and payment of benefits to his family, said Minister Ncube\n\nShe described Maj-Gen Sizibas death as a great loss, saying her office had started initiating processes consistent with the handling of a funeral of a national hero.\n\nMajor-General (Retired) Solomon Siziba\n\nMaj-Gen Sizibas brother, Mr Leonard Siziba, expressed gratitude to the President for declaring his brother a national hero.\n\nThe status, he said, was befitting for a man who served the country since his childhood as a learner at Manama High School, where he and other learners joined the armed struggle.\n\nWe want to thank His Excellency, the President, for declaring my brother a national hero. We also want to thank the Minister of State for Provincial Affairs and Devolution for delivering the message to the family. My brother joined the armed struggle when he, together with other learners from Manama, left school and crossed into Botswana.\n\nHe did his primary level at Nhwali Primary School and proceeded to Manama High School in 1976, where he started his Form One.\n\nHe was part of the group that joined the armed struggle from Manama Mission in 1977. He did his military training in Zambia, and during the ceasefire, he was attested into the Zimbabwe National Army. He was stationed at the Zimbabwe Military Academy, where he rose to the rank of Captain. He was then transferred to the ZNA, where he worked until 2005, rising to the position of Lieutenant-Colonel. He was posted to Botswana as Defence Attach from 2005 to 2013, stationed at the Zimbabwean Embassy, he said.\n\nUpon his return to Zimbabwe in 2013, Rtd Maj-Gen Siziba was appointed Deputy Commander of One Brigade and had been elevated to the rank of Colonel.\n\nFrom 2013 to 2018, he was appointed Director of Administration at the National Prosecuting Authority.\n\nMaj-Gen Siziba returned to the ZNA in 2018 and was elevated to the rank of Brigadier-General and was assigned to the Brigadier-General Inspectorate position, a post he held until he retired from the military last year. He was elevated to the position of Maj-Gen upon his retirement.\n\nThe brother said Maj-Gen Siziba had become a father figure in the family. The Government has already taken over the funeral processes, including the provision of meals, tents, and other necessities.\n\nMaj-Gen Sizibas body is expectedto arrive in Bulawayo today and will be received at HQ One Brigade Barracks (Mzilikazi Barracks). After that, it will be taken to Doves Funeral Parlour. Tomorrow, a send-off funeral service will be held at his rural home in Nhwali, Gwanda, Matabeleland South.\n\nMatabeleland South Provincial Affairs and Devolution Minister Dr Evelyn Ndlovu, service chiefs, and other senior government officials were among the mourners at the familys residence.\n\nCde Chimutengwende died on Thursday and was declared a national hero last night.\n\nZanu PF National Political Commissar Cde Munyaradzi Machacha delivered the message to the family at their Milton Park, Harare, home.\n\nCde Machacha was accompanied to the Chimutengwende family home by Home Affairs and Cultural Heritage Minister Kazembe Kazembe, who is also the Zanu PF Mashonaland Central provincial chairman.\n\nEarlier in the day, Zanu PF National Chairman and Defence Minister Oppah Muchinguri-Kashiri had told the media that Mashonaland Central province had written to the national leadership requesting national hero status for Cde Chimutengwende.\n\nShe described Cde Chimutengwende as a strong member of the ruling party Zanu PF, who played a major role before and after independence.\n\nHe was a principled person who persevered and was consistent and these are some of those values that we consider (when declaring one a national hero), Cde Muchinguri-Kashiri said.\n\nCde Chimutengwende served as a Government Minister, Member of Parliament for Mazowe and a Politburo member.\n\nHe succumbed to chronic kidney disease.\n\nBorn on August 28, 1943, Cde Chimutengwende first became a Zanu PF Member of Parliament in 1985 in Mazowe, and served as a legislator for over 25 years.\n\nHe also served for 14 years as a Cabinet Minister.\n\nCde Chimutengwende served as Senator and Deputy President of the Senate, Member of the Pan-African Parliament (PAP) and Head of the Zimbabwe delegation to the PAP.\n\nHe earned a Masters degree in Social Science and a PhD from the University of Bradford in the UK.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/President-Mnangagwa-5.jpg",
            "description": "Nqobile Tshili and Joseph Madzimure PRESIDENT Mnangagwa yesterday conferred national hero status on Major-General (Retired) Solomon Siziba and former Information, Posts and Telecommunications Minister Cde Chenhamo “Chen” Chakezha Chimutengwende, in recognition of their contributions to the country before and after independence. Maj-Gen Siziba died on Wednesday and will be buried at the National Heroes Acre […]",
            "time": "08:23",
            "date": "19 Jan 2025"
        },
        {
            "title": "Zimsec O-Level results improve",
            "url": "https://www.herald.co.zw/zimsec-o-level-results-improve/",
            "content": "Ivan Zhakata and Tapiwa Chikuhwa\n\nTHE Zimbabwe School Examinations Council (ZIMSEC) has released 2024 Ordinary Level examination results, with a national pass rate of 33.19 percent.\n\nThe increase in the pass rate is however, well below the 50 percent benchmark.\n\nDespite this, the results show progress compared to the previous years 29.41 percent, with gains recorded across most categories.\n\nAddressing journalists in Harare yesterday, Zimsec board chairperson, Professor Paul Mapfumo, acknowledged the improvements and said there was need for interventions to enhance performance.\n\nThis years results show a marginal improvement in performance across most categories, he said.\n\nHowever, we must confront the reality that two-thirds of candidates are still failing to meet the benchmark of passing five or more subjects. This calls for urgent interventions at all levels of the education system.\n\nA record 291 341 candidates sat for the 2024 exams, a 7.85 percent increase compared to 2023.\n\nAmong them, 199 258 wrote five or more subjects, with only 66 130 achieving five or more passes at Grade C or better.\n\nSchool candidates posted a pass rate of 33.70 percent, an improvement from 30.19 percent in 2023, while private candidates saw their pass rate rise significantly from 21.85 percent to 29.60 percent.\n\nFemale candidates outperformed males, with pass rates of 33.54 percent and 32.65 percent, respectively.\n\nSpecial needs candidates also showed remarkable progress, achieving a 36.36 percent pass rate compared to 25.79 percent in 2023.\n\nEducational experts cited factors such as limited resources, teacher shortages, and economic pressures as key contributors to the low pass rate.\n\nProf Mapfumo urged stakeholders to take action.\n\nWhile we celebrate the incremental progress, these results are a stark reminder of the disparities in access to quality education, particularly in rural areas. We need to ensure that every child is given an equal opportunity to  succeed.\n\nThe Ministry of Primary and Secondary Education has committed to addressing challenges by improving school infrastructure, teacher remuneration, and access to learning materials.\n\nWhile the improvements in the 2024 results are encouraging, they also reveal the urgent need for broader reforms to uplift the performance of Zimbabwes education system.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/ZIMSEC.jpg",
            "description": "Ivan Zhakata  and Tapiwa Chikuhwa THE Zimbabwe School Examinations Council (ZIMSEC) has released 2024 Ordinary Level examination results, with a national pass rate of 33.19 percent. The increase in the pass rate is however, well below the 50 percent benchmark. Despite this, the results show progress compared to the previous year’s 29.41 percent, with gains […]",
            "time": "08:23",
            "date": "19 Jan 2025"
        },
        {
            "title": "Minister hails new Mozambican president",
            "url": "https://www.herald.co.zw/minister-hails-new-mozambican-president/",
            "content": "Joseph Madzimure, Senior Reporter\n\nZIMBABWE is optimistic that newly-elected Mozambican President Daniel Chapo will focus on fostering unity and rebuilding the nation, Defence Minister Oppah Muchinguri-Kashiri has said.\n\nAddressing a Press Conference in Harare yesterday, Minister Muchinguri-Kashiri, who attended President Chapos inauguration in Maputo on Wednesday on behalf of President Mnangagwa, who is on his annual leave, said the proceedings were peaceful and Mozambicans had confidence in their leader.\n\nShe said the new government would need all the support it can get from the Sadc region and the wider African continent to steer the country forward.\n\nIn his address, President Chapo, who was the Frelimo candidate in the October 9 elections, committed to devoting himself fully to promoting unity and reconstruction.\n\nHe emphasised the importance of collaboration, saying in politics, there are no enemies, only adversaries.\n\nMinister Muchinguri-Kashiri hoped for a united and peaceful political landscape in Mozambique.\n\nWe are very happy that as SADC, all the countries had representatives and this was to render our full support, she said.\n\nMinister Muchinguri-Kashiri stressed the importance of strengthening bilateral relations among SADC countries, noting that President Chapo aimed to renegotiate partnerships with developing nations and financial institutions to ensure continued assistance, acknowledging that Mozambique cannot succeed alone.\n\nShe congratulated Mozambiques opposition parties that attended the inauguration, viewing their presence as a positive sign for a new era in their country.\n\nMozambique has a history of resolving its own conflicts, particularly between Frelimo and Renamo.\n\nThe Minister conveyed a message from President Mnangagwa, appreciating the peaceful conditions during the elections and the timely constitutional process leading to the election results that were confirmed by the Mozambican constitutional council after all electoral petitions were dealt with.\n\nThe inauguration ceremony also included the swearing-in of new parliamentary members.\n\nMinister Muchinguri-Kashiri noted the excitement and optimism among the Mozambican populace, who have endured significant violence in recent months.\n\nHigh-profile attendees included South African President Cyril Ramaphosa, Equatorial Guinea President Teodoro Obiang Nguema Mbasogo, and several African vice presidents and prime ministers, demonstrating broad support for the new government.\n\nMinister Muchinguri-Kashiri highlighted President Chapos inaugural speech, which addressed the need for unity and dialogue among political players, and acknowledged the economic, political, and social challenges facing Mozambique.\n\nOn the economic front, President Chapo identified governance structures as a significant barrier to development, announcing plans to streamline government operations by abolishing several ministries to create a more efficient administration.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/OMK.jpg",
            "description": "Joseph Madzimure, Senior Reporter ZIMBABWE is optimistic that newly-elected Mozambican President Daniel Chapo will focus on fostering unity and rebuilding the nation, Defence Minister Oppah Muchinguri-Kashiri has said. Addressing a Press Conference in Harare yesterday, Minister Muchinguri-Kashiri, who attended President Chapo’s inauguration in Maputo on Wednesday on behalf of  President Mnangagwa, who is on his […]",
            "time": "08:23",
            "date": "19 Jan 2025"
        },
        {
            "title": "Govt, World Bank economic growth projections align",
            "url": "https://www.herald.co.zw/govt-world-bank-economic-growth-projections-align/",
            "content": "Herald Reporters\n\nZimbabwes economy is poised for significant growth this year and next year, outpacing the broader Sub-Saharan Africa (SSA) region, according to latest projections from the World Bank.\n\nThe nations Gross Domestic Product (GDP) is expected to expand by 6,2 percent in 2025 and 4,8 percent in 2026, surpassing the Sub-Saharan African countries averages of 4,1 percent and 4,3 percent, respectively.\n\nThe estimates are contained in the World Banks newly-released annual Global Economic Prospects report and are within the range of Governments own projections of two percent growth in 2024 and a forecast of six percent this year.\n\nThis optimistic outlook marks a substantial recovery from the modest 2 percent growth recorded in 2024, a year marred by the worst drought in over four decades.\n\nThe El Nio-induced drought severely impacted agricultural output, leading to a significant downturn in the sector.\n\nStaple maize production plummeted by 72 percent during the 2023/24 season, necessitating the importation of approximately 1,4 million tonnes of grain to meet domestic demand.\n\nThe World Banks projections align closely with the Governments forecasts, reflecting a shared confidence in the nations economic trajectory.\n\nFinance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube remains optimistic about the countrys economic prospects, maintaining a 6 percent growth forecast for 2025.\n\nHe attributes this anticipated rebound to a recovery in agriculture, bolstered by improved rainfall patterns, and enhanced electricity generation.\n\nProf Ncube, while acknowledging the challenges posed by delayed rains, has expressed confidence in achieving the growth target.\n\nIf the weather patterns continue on this kind of trajectory, we should be able to achieve or at least get close to achieving the 6 percent target rate of growth this year, he told The Herald this week.\n\nThe local economic resurgence is further bolstered by ongoing infrastructure investments aimed at driving long-term growth. The Government has prioritised projects in energy, transport, and water supply to create a conducive environment for economic activities.\n\nKey initiatives include the expansion of the Hwange Thermal Power Station, which is expected to enhance electricity supply reliability, and the Beitbridge Border Post modernisation to facilitate trade.\n\nAdditionally, investments in irrigation systems are poised to mitigate the impact of erratic rainfall on agriculture. These infrastructure upgrades are not only expected to support immediate economic recovery but also lay the groundwork for sustained growth in the coming years.\n\nEconomist Gladys Shumbambiri-Mutsopotsi said the mining sector is a pivotal contributor to Zimbabwes economic resurgence.\n\nShe noted the sectors resilience amid global commodity price fluctuations and local operational challenges, emphasising its steady expansion.\n\nMs Shumbambiri-Mutsopotsi also highlighted the importance of electricity generation, which saw a 22 percent growth, in supporting industrial activities and boosting investor confidence.\n\nThe tourism sector is also poised for a rebound, driven by a resurgence in international travel as global economies recover from stagnation.\n\nAs more countries emerge from economic stagnation, international travel is set to rebound, benefitting nations like Zimbabwe with untapped tourism potential.\n\nHowever, the World Bank cautions that commodity exporters like Zimbabwe face risks from potential economic slowdowns in major markets such as China, which could adversely affect demand for minerals and metals.\n\nDespite these potential challenges, Zimbabwes diversified economic strategy, focusing on revitalising agriculture, bolstering mining activities, and rejuvenating tourism, positions the country favourably for sustained growth.\n\nThe anticipated economic expansion in 2025 and 2026 not only signals a robust recovery from recent adversities but also sets the stage for Zimbabwe to outpace its regional counterparts in economic performance.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/03/Minister-Mthuli-Ncube.jpg",
            "description": "Herald Reporters Zimbabwe’s economy is poised for significant growth this year and next year, outpacing the broader Sub-Saharan Africa (SSA) region, according to latest projections from the World Bank. The nation’s Gross Domestic Product (GDP) is expected to expand by 6,2 percent in 2025 and 4,8 percent in 2026, surpassing the Sub-Saharan African countries’ averages […]",
            "time": "08:23",
            "date": "19 Jan 2025"
        },
        {
            "title": "SA mine disaster: Zim Embassy starts verification",
            "url": "https://www.herald.co.zw/sa-mine-disaster-zim-embassy-starts-verification/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nTHE Zimbabwean Embassy in South Africa has sent a team to work with the host government to verify if there are any of its nationals who could have been rescued or died at Buffelsfontein Mine in Stilfontein, North West Province.\n\nA total of 87 people of various nationalities died in the North West mine disaster recently, mostly artisanal miners.\n\nScores of illegal miners were recently trapped underground in the area when most of them opted to stay underground fearing arrest when they came out of the mineshaft after authorities launched an operation dubbed Vala Umgodi with a view to minimising illegal mining activities.\n\nZimbabwes Ambassador to South Africa, David Hamadziripi, said a team was already on the ground.\n\nThe Embassy wishes to inform members of the public that it is working closely with the South African government to identify and verify the nationalities of the alleged Zimbabwe nationals retrieved from the Buffelsfontein Mine in Stilfontein, North West Province under the on-going rescue operations, said the Ambassador in a statement.\n\nFurther to screening the 465 alleged undocumented Zimbabwe nationals currently in South African Police Service (SAPS) custody, the Embassy is seeking to establish whether there are any Zimbabwe nationals among 87 deceased individuals retrieved at the shaft, whose identities and nationalities are yet to be established.\n\nHe said the embassy sought to identify the deceased individuals through Deoxyribonucleic Acid (DNA) testing of relatives.\n\nAmbassador Hamadziripi encouraged Zimbabweans who have reason to believe that their relatives might be part of the rescued group of individuals in Stilfontein to urgently contact the Consulate in Johannesburg.\n\nHe said they may use the following contact details, Hotline/ Emergency Line: +27610373400 or visit the consulate in person at its Johannesburg offices, 20 Ernest Oppenheimer Avenue, in Bruma.\n\nThe Government of Zimbabwe is working on arrangements on how to assist with the repatriation of remains positively identified as Zimbabwe nationals, said Ambassador Hamadziripi.\n\nThe countrys consul-general in Johannesburg, Mr Eria Phiri, last night said so far, 10 Zimbabweans who were rescued had appeared in court and were fined R15 000 (or six months in jail) wholly suspended sentence for illegal mining.\n\nThese, he said, were deported during the course of the week.\n\nMr Phiri said they expected to have a full update from the team on the ground when they complete their mission between yesterday and Sunday.\n\nOur team is already on site and we expect to get detailed feedback after Sunday. However, what we have established so far is that 10 Zimbabweans have been deported after appearing in court and getting wholly suspended six months imprisonment sentences, said the Consul-General.\n\nWe are going to be interviewing those rescued and are in police custody to find out if there are any other Zimbabweans among them or among those who may have died in the mineshaft.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/03/David-Hamadziripi-680x370-680x380.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau THE Zimbabwean Embassy in South Africa has sent a team to work with the host government to verify if there are any of its nationals who could have been rescued or died at Buffelsfontein Mine in Stilfontein, North West Province. A total of 87 people of various nationalities died in the […]",
            "time": "08:23",
            "date": "19 Jan 2025"
        },
        {
            "title": "First Lady’s impactful programmes transform livelihoods",
            "url": "https://www.herald.co.zw/first-ladys-impactful-programmes-transform-livelihoods/",
            "content": "Tendai Rupapa, Senior Reporter\n\nEMPOWERMENT champion First Lady Dr Auxillia Mnangagwa has initiated countless life-transforming initiatives to benefit vulnerable members of society mainly womenfolk countrywide to boost productivity, end poverty and ensure they generate income to sustain their livelihoods.\n\nThe First Lady, who is the Agric4She patron, also uses the initiatives to curb domestic violence, drug and substance abuse as well as prostitution, among many other social ills.\n\nRecently, in Honde Valley, Manicaland Province Amai Mnangagwa launched the Banana4She, Pfumvudza4She, Fisheries4She, Poultry4She and Horticulture4She programmes to boost the nations food security in the aftermath of the El Nino-induced drought which affected crops last season.\n\nAll the projects are flourishing with prospects of realising high returns and food security.\n\nThe projects also bode well for unity since beneficiaries are working in groups as instructed by the First Lady ensuring no place and no one is left behind.\n\nIn Hauna, Honde Valley, where she launched the five farming programmes, there is a massive platform for skills and knowledge transfer.\n\nThose who were trained by extension officers on how to undertake the projects are also training their peers in a train the trainer programme, hence no woman is left behind.\n\nThe women are also practising the pass-on arrangement.\n\nPart of the farming inputs for Pvumvudza4she that were sourced and handed over by First Lady Dr Auxillia Mnangagwa to women in Honde Valley to economically empower them\n\nThe projects also highlight the First Ladys undying love to transform the lives of ordinary people as well as a non-selective approach as she works with anyone anywhere to realise their goals.\n\nFrom Manicaland via Kanyemba to Plumtree, her empowerment footprints are there for all to see.\n\nManicaland Provincial Affairs and Devolution Minister Advocate Misheck Mugadza paid tribute to the impact of the First Ladys empowerment programmes.\n\nJust like other provinces across Zimbabwe, Manicaland Province has immensely benefited from various empowerment programmes initiated and driven by the mother of the nation, Her Excellency, the First Lady of the Republic of Zimbabwe, Dr A Mnangagwa. Among others, the empowerment programmes which primarily targeted the vulnerable in our society including elderly women, widows, orphans, and those with disabilities among others, the empowerment programmes have benefited more than 5000 households in 2024 alone.\n\nUnder the flagship Agric4SHE initiative, a wide range of support schemes which were recently rolled out in Manicaland include Pfumvudza4SHE initiative where thousands of elderly women were generously provided with agricultural inputs which enabled them to establish 3 000 maize plots, particularly in Honde Valley of Mutasa district, he said.\n\nCourtesy of extension support from experts, Adv Mugadza said the beneficiaries have produced a very healthy maize crop that is predominantly at the vegetative phase.\n\nThe beneficiary households are certainly guaranteed bumper harvests and household food security post the 2025 summer season harvest. The Fisheries4She initiative was received by beneficiary farmers given that Manicaland is one of the fastest-growing aquaculture farming enterprises in the country due to its abundant water resources. More than 10 000 fish fingerlings were recently distributed to already trained women farmers resulting in a project success rate of more than 90 percent, he said.\n\nThe fish, Adv Mugadza said, is now at the juvenile stage and these will tremendously improve nutrition status at the household level whilst also generating income for the previously marginalised women beneficiaries.\n\nThe Horticulture4SHE, he said, had also been widely welcomed.\n\nManicaland is a household player in the horticulture agriculture sub-sector due to its enabling climatic conditions. The introduction of the Horticulture4SHE initiative by Her Excellency, the First Lady, was, therefore, received with unparalleled enthusiasm by beneficiary communities. Hundreds of households were given vegetable combo packs and banana suckers for planting in their gardens and fields.\n\nIt is imperative to highlight that the resultant banana plots are thriving and this will see thousands more farmers also receiving planting material under a prudently managed pass-on arrangement, Adv Mugadza said.\n\nHe said more women also benefited from the Poultry4SHE programme.\n\nThe Poultry4SHE initiative was enthusiastically received by more than 1000 women who have since creatively established several groups for the purpose of facilitating a pass-on mechanism. It is, therefore, anticipated that the initiative will see thousands of households ultimately benefiting from it through improved motivation, security and enhanced income from the sale of chickens within their communities, the minister said.\n\nAdv Mugadza gave the First Lady plaudits for implementing the Widows Empowerment scheme in his province.\n\nThe Manicaland Widows empowerment initiative is one of the most successful schemes introduced by Her Excellency, the First Lady. The beneficiary widows have since established thriving grocery shops at Murambinda growth point in Buhera.\n\nEstablished in 2024, the business has since grown by more than 20 percent and has significantly helped in stabilising maize meal prices at the growth point given the shops commendable practice of selling the product at highly reasonable prices. Indeed, the initiatives by Her Excellency, the First Lady, have evidently registered a transformative impact in the lives of vulnerable members of the Manicaland community across the province, he said.\n\nIt is anticipated that the First Ladys empowerment initiatives will have a multiplier effect in the province, thereby significantly contributing towards the achievement of Vision 2030.\n\nOn behalf of the people of Manicaland Province and indeed on my own behalf, let me express our collective appreciation to Her Excellency, the First Lady of the Republic of Zimbabwe, Dr A Mnangagwa for all these life-changing empowerment initiatives whose effect is already being felt across the province, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/FL1.jpg",
            "description": "Tendai Rupapa, Senior Reporter EMPOWERMENT champion First Lady Dr Auxillia Mnangagwa has initiated countless life-transforming initiatives to benefit vulnerable members of society mainly womenfolk countrywide to boost productivity, end poverty and ensure they generate income to sustain their livelihoods. The First Lady, who is the Agric4She patron, also uses the initiatives to curb domestic violence, […]",
            "time": "08:23",
            "date": "19 Jan 2025"
        },
        {
            "title": "EDITORIAL COMMENT: PSL should ride on new wave of moneybags",
            "url": "https://www.herald.co.zw/editorial-comment-psl-should-ride-on-new-wave-of-moneybags/",
            "content": "AS the local Premier Soccer League clubs re-group in their various camps to prepare for the 2025 season, excitement and anxiety is brewing among the games stakeholders and even neutrals.\n\nThe refreshing excitement has been brought about by the arrival of big-spending newboys Scottland Football Club.\n\nAlthough they might not be the first Premiership new kids on the block to spend big, there is a greater element of swag and a different approach that Scottland are bringing into Zimbabwean football.\n\nThey arrive in the PSL as the first club in the history of the elite league to own their own ambulance, a key asset in the welfare of athletes, in this case players welfare.\n\nThe biggest carrot they have dangled for players is their ability to pay hefty salaries and to ensure that their biggest assets, the players and their coach, are well-motivated.\n\nOften-times there has been talk in Zimbabwean football circles that the game needs to be commercialised.\n\nHowever, we have noted with concern that the so-called commercialisation of domestic football has largely been lip-service.\n\nBut when you get a club arriving on the stage and paying Khama Billiat well enough for the former Mamelodi Sundowns and Kaizer Chiefs talisman to feel comfortable, then that can only up the standards of the game in the country.\n\nIn the last two seasons, we have seen how businessman Simba Ndoro has transformed the face of football in Mashonaland Central province and in the mining town of Shamva in particular.\n\nNdoros investment in Simba Bhora, which included refurbishment of Wadzanai stadium in Shamva, helped bring the Premiership to the mining town, to the benefit of surrounding areas like Madziwa and Murehwa.\n\nSimilarly, Scottland are not only restricting themselves to ensuring their players who include Ronald Pfumbidzai, Lynoth Chikuhwa, Walter Musona and Lincoln Zvasiya, will be looked after well.\n\nScottland owner Pedzai Scott Sakupwanya has told this publication a number of times that he wants his football project to also help build communities in Mabvuku and Tafara, which is the constituency that he represents in Parliament.\n\nThe businessman and legislator has embarked on an audacious project to turn a ground in his township Mabvuku into a world class stadium.\n\nIt would be easy for the narrow-eyed to dismiss Scottland and Simba Bhora as either flamboyant or mere big spenders.\n\nThe wider-eyed would however, welcome anyone investing hugely into local football. The arrival of such teams like Scottland and Simba Bhora means the local Premiership will be able to retain some of its best players.\n\nMaybe, now that we have actors in the elite league like Simba Bhora and Scottland, we could in the 2025 season and beyond see prolific strikers who can break the late Norman Marotos record of 22 goals.\n\nThe late Maroto, who featured for Dynamos, Buymore and Gunners, achieved the 22-goal feat in 2010 when leading the line for the now defunct Gunners.\n\nSince then, local football has struggled to retain top players including strikers as anyone who showed glimpses of talent was snapped up by clubs in South Africa, Botswana, Mozambique and Tanzania.\n\nThus, we believe that the more big-spending clubs we have in our Premiership, the healthier our football will become.\n\nThe development will no doubt push up the standards and that is why we applaud the emergence of such clubs at any given time.\n\nIn the era of Blackpool, competition became stiffer in the PSL and that Dynamos needed a superior goal difference to pip them for the 1995 title, spoke volumes of the impact that the team they called Ndochi had on the league.\n\nAmaZulu also positively impacted on the competitiveness of the national game as did FC Platinum who would go on to become the first team from outside Harare and Bulawayo to win the league title in more than five decades.\n\nThat FC Platinum became a dominant force for four seasons and knocking Dynamos, Highlanders and CAPS United off the perch, is stuff that can make Zimbabwean football healthier.\n\nWhile Dynamos, Highlanders and CAPS United remain the traditional giants, they will be the first to acknowledge that their dominance, just like Kaizer Chiefs and Orlando Pirates in South Africa, has now been confined more to the annals of history.\n\nIn South Africa, Mamelodi Sundowns arrived with a culture of free-spending to get the best talent and the results have been there for all to see.\n\nWe believe that the clubs with fatter cheque books, often called moneybags in our football, should in fact, be encouraged to retain their investment in the game and even set up commercial structures for sustainability.\n\nWith world football governing body FIFA introducing Club Licensing regulations aimed at enhancing governance of the sport in an environment that is increasingly becoming commercial, our PSL needs to ride on the emergence of more moneybags.\n\nThere is also a need for more company-owned teams to help the PSL up the ante.\n\nMoney traditionally follows where there is money and for Zimbabwean football to evolve into the megabucks industry that we all yearn for; it must start with the PSL clubs being able to pay well and attract the best talent from within and outside the countrys borders.\n\nIf at the start of every season there is a club in the mould of Scottland, Simba Bhora, FC Platinum, Ngezi Platinum and GreenFuel, who have financial stability, the PSL will rank among the top leagues in Africa.\n\nAnd that will result in the national teams having a healthy balance of local and foreign-based talent that is able to compete with the best.\n\nSouth Africas Bafana Bafana are already benefitting from the fact that their top clubs have invested heavily in players and thus can draw their squad from their domestic league.\n\nWe hope and pray there will be more money bags in the PSL to stimulate more competition and more crowds at local games.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/08/Simba-Ndoro.jpg",
            "description": "AS the local Premier Soccer League clubs re-group in their various camps to prepare for the 2025 season, excitement and anxiety is brewing among the game’s stakeholders and even neutrals. The refreshing excitement has been brought about by the arrival of big-spending newboys Scottland Football Club. Although they might not be the first Premiership new […]",
            "time": "08:23",
            "date": "19 Jan 2025"
        },
        {
            "title": "Carter praised for contribution to independence",
            "url": "https://www.herald.co.zw/carter-praised-for-contribution-to-independence/",
            "content": "Wallace Ruzvidzo, Herald Reporter\n\nThe late former US president Jimmy Carters commitment to human rights and justice was instrumental during Zimbabwes independence journey, Foreign Affairs and International Trade Minister Professor Amon Murwira has said.\n\nJimmy Carter served as the 39th president of the United States from 1977 to 1981 and died on December 29 last year.\n\nSpeaking at a tribute event held in Harare on Thursday, Prof Murwira chronicled how President Carter had facilitated the Lancaster House talks, leading to Zimbabwes first democratic elections and majority rule in 1980.\n\nThis event is not just a commemoration, it serves as a testament to the power of perseverance, diplomacy, and the unwavering pursuit of justice.\n\nFormer President Jimmy Carters commitment to human rights and justice was instrumental during Zimbabwes journey to independence.\n\nThe administration of Jimmy Carter facilitated the Lancaster House Talks, which began in September 1979 and culminated in an agreement signed on 21 December 1979.\n\nThis landmark agreement effectively ended the second Chimurenga and set the stage for Zimbabwes independence in April 1980, he said.\n\nProf Murwira said the Carter-led administration had also provided essential diplomatic and financial support to address land reform issues which were critical components of the negotiations.\n\nThis support helped pave way for a peaceful transition to independence through elections, marking a significant milestone in Zimbabwes history and laying the groundwork for its future governance.\n\nPresident Carters intervention was important and the outcomes of his efforts were profound.\n\nThe successful conclusion of the Lancaster House Talks not only facilitated Zimbabwes transition to a ceasefire but also laid the groundwork for significant land reforms in the establishment of a democratic governance structure, he said.\n\nUS Ambassador to Zimbabwe Pamela Tremont said President Carters principle of leadership and commitment to Zimbabwe would remain etched in the hearts and history of the US.\n\nPresident Carters tenure as the 39th President of the United States was marked by his unwavering dedication to health, human rights and peace.\n\nHis support for Zimbabwes freedom and independence reflects his lifelong commitment to justice and equality.\n\nAnd looking back at the events of 1979 and 1980, what strikes me is the shared faith and optimism, commitment to human rights, and the dedication to the hard work ahead that was shared by both President Carter and the new Zimbabwean leadership, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Murwira.jpg",
            "description": "Wallace Ruzvidzo, Herald Reporter The late former US president Jimmy Carter’s commitment to human rights and justice was instrumental during Zimbabwe’s independence journey, Foreign Affairs and International Trade Minister Professor Amon Murwira has said. Jimmy Carter served as the 39th president of the United States from 1977 to 1981 and died on December 29 last […]",
            "time": "08:23",
            "date": "19 Jan 2025"
        },
        {
            "title": "15 new magistrates sworn in to enhance justice delivery",
            "url": "https://www.herald.co.zw/15-new-magistrates-sworn-in-to-enhance-justice-delivery/",
            "content": "Yeukai Karengezeka, Court Correspondent\n\nTHE Judicial Service Commission (JSC) yesterday swore in 15 magistrates at the Harare Magistrates Court as part of efforts to strengthen the countrys justice delivery system.\n\nThe Chief Magistrate, Mrs Vongai Guwuriro, presided over the ceremony, which saw the induction of 12 women and three men into the judiciary.\n\nThe new magistrates are: Bentone Matope, Blessing Makaripe, Blessing Shumba, Daphne Maruta, Gillian Padzakashamba, Lawrence Mubvumbi, Marvellous Joma, Moreblessing Mahaso, Nyasha Mangezi, Nyengeterai Bushu, Rufaro Musiiwa, Samantha Ruponga, Samukelisiwe Mpande, Tariro Hove, and Tendai Nyagura.\n\nThis development comes as the JSC intensifies efforts to improve the efficiency and accessibility of the justice system for all citizens.\n\nAfter the ceremony, Chief Magistrate Guwuriro explained the importance of fast-track courts, which she described as a game changer in ensuring timely justice delivery.\n\nThe fast-track courts will be fully functional at all stations dealing with all types of cases.\n\nWe are going to be working together in collaboration with other stakeholders. From the police, a matter can enter straight into a fast-track court, allowing witnesses to testify promptly and return to their normal lives. A person must come to court only when their evidence is required, she said.\n\nMrs Guwuriro further revealed that fast-track courts, which had previously operated on a limited scale, would now be established at all court stations across the country.\n\nPreviously, this type of court system was primarily used to handle sexual offences in regional courts. Now, it will cover a broader range of cases, she added.\n\nTo match the growing demand for justice services, the chief magistrate noted that the JSC had expanded its magistrates pool and opened new court stations.\n\nHarare has been split into two provinces, resulting in the establishment of two additional functional courts: Chinhamora and Beatrice courts. These new appointments will help staff these stations and reduce the backlog of cases, Mrs Guwuriro said.\n\nThe recruitment of additional magistrates is expected to improve access to justice, reduce case backlogs, and enhance the overall efficiency of the judicial system.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/MGs.jpg",
            "description": "Yeukai Karengezeka, Court Correspondent THE Judicial Service Commission (JSC) yesterday swore in 15 magistrates at the Harare Magistrates Court as part of efforts to strengthen the country’s justice delivery system. The Chief Magistrate, Mrs Vongai Guwuriro, presided over the ceremony, which saw the induction of 12 women and three men into the judiciary. The new […]",
            "time": "08:23",
            "date": "19 Jan 2025"
        },
        {
            "title": "Hundreds lose money in fake driver’s licence scam",
            "url": "https://www.herald.co.zw/hundreds-lose-money-in-fake-drivers-licence-scam/",
            "content": "Freeman Razemba, Senior Reporter\n\nMORE than 100 people in Harare have fallen victim to suspected fraudsters masquerading as distributors of drivers licence discs.\n\nThese alleged scammers have been sending fake text messages, soliciting payments from unsuspecting individuals in exchange for drivers licences.\n\nThe fraudsters direct victims to the Vehicle Inspectorate Department (VID) offices in Eastlea, demanding a fee before vanishing. Investigations indicate that the scammers typically charge US$50.\n\nIn a statement, the Civil Vehicle Registry (CVR) Department Registrar Mr Saston Muzenda confirmed such cases.\n\nIt has come to the attention of the Central Vehicle Registry (CVR) that a fraudster with the following Econet numbers  0779 171 199 and 0783 123 505  is sending text messages to prospective drivers advising them that their drivers licences are ready for collection.\n\nHe interchanges the following names Mr Moyo, Mr Sibanda, Mr Nkomo or Mr Dube from VID Eastlea. Once the victims arrive in Harare, he directs them to deposit US$ 50 into either OneMoney or EcoCash account, whose details are 0715 107 676 or 0715 107 468 Ecocash 0786 721 613, he said.\n\nMr Muzenda said once the money is deposited, the suspect then blocks the victims.\n\nHe urged the public to be vigilant and report such incidents to the nearest police station.\n\nSecondly, do not deposit any money into an account provided by a stranger. Report to the nearest police station if you are texted by any of the above listed numbers to help the Zimbabwe Republic Police apprehend the fraudsters, Mr Muzenda said.\n\nIn June 2023, Government gazetted new regulations over the recently launched new standard plastic drivers licence linked to a database that will replace the metal licences and has reset the classes of licence, split both the bus and heavy truck classes and added in a sub-class for tri-bikes and quad bikes.\n\nThis followed the gazetting of new regulations, Statutory Instrument 119 of 2023 under the Road Traffic (Licensing of Drivers) Regulations, 2023, by the Minister of Transport and Infrastructural Development Felix Mhona.\n\nThe new Zimbabwean licence is scannable and meets standards of SADC, the Common Market for Eastern and Southern Africa (COMESA) and the East African Community. In the region, South Africa and some other countries already use plastic licences also known as plastic polymer licences.\n\nAt present, those who pass the Zimbabwe driving tests at VID depots countrywide are immediately issued with a temporary paper licence before obtaining the metal licence a few months later.\n\nOne of the advantages of the new plastic licences is that they will be printed instantly and have security features that will make them difficult to forge, as well as being scannable so checks can immediately confirm the authenticity and reveal any legal issues.\n\nThe new standard plastic drivers licence launched in Harare in 2023 to replace the metal licences will clear a backlog of approximately 600 000 applicants who were waiting for their drivers licences to be printed and issued since 2019.\n\nThe backlog was created by the use of obsolete equipment at the Central Vehicle Registry (CVR), as well as a shortage of materials to produce the costly metal discs.\n\nDrivers will now be able to receive their licence within seven to 10 days from the day they pass their tests and will pay US$5, or the equivalent at the official exchange rate on the day of payment, for the disc. An online booking platform is available for applicants to make appointments for the capture of biometric details.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/06/Mhona.jpg",
            "description": "Freeman Razemba, Senior Reporter MORE than 100 people in Harare have fallen victim to suspected fraudsters masquerading as distributors of driver’s licence discs. These alleged scammers have been sending fake text messages, soliciting payments from unsuspecting individuals in exchange for driver’s licences. The fraudsters direct victims to the Vehicle Inspectorate Department (VID) offices in Eastlea, […]",
            "time": "08:23",
            "date": "19 Jan 2025"
        }
    ]
}