{
    "news": [
        {
            "title": "Zim inventor gets Presidential nod",
            "url": "https://www.herald.co.zw/zim-inventor-gets-presidential-nod/",
            "content": "Wallace Ruzvidzo, Herald Reporter\n\nZIMBABWEANS are capable of spearheading game-changing first-of-a-kind innovations that challenge the worlds traditional ways of doing things, President Mnangagwa has said.\n\nThe President said this yesterday when Zimbabwean innovator and inventor Mr Maxwell Chikumbutso paid a courtesy call on him at State House in Harare to showcase his latest invention of the worlds first self-powering vehicles and motorbikes that run on radio waves.\n\nSuch inventions, said President Mnangagwa, were testament that Zimbabweans were skilled enough to usher leading inventions that defy logic.\n\nThis is the only vehicle (of its kind) that exists in the world, there is no other. This is the only vehicle in the world and it is here in Zimbabwe.\n\nHe (Mr Chikumbutso) is so gifted that you will not believe it . . . when he first came to talk to me, I thought he was not properly wired in his head, but I now know that he is well connected, he said with a laugh.\n\nPresident Mnangagwa said he was personally supporting Mr Chikumbutso in his endeavours.\n\nAmericans had initially offered the 44-year-old high school dropout millions of dollars to stay and continue his work in the United States, an offer he refused.\n\nThey offered him US$3 million to stay there and I told him to let them have their US$3 million.\n\nYes he never went far with school, but he is more educated than engineers with his Form 2.\n\nAll this . . . from the time he began doing these things, I have been supporting him throughout, President Mnangagwa said.\n\nThe President had nothing but praises for Mr Chikumbutsos innovations which include a wireless self-powering unmanned aerial vehicle (UAVs), commonly known as a drone, and television sets among other inventions.\n\nPresident Mnangagwa said he actually had the television set at home and had watched it.\n\nHe brought the television to my house . . . the television has no wiring (for connection), you can watch the television, all the stations you want on a tarmac. He has been doing that at my house. But you will not believe it until you see it.\n\nAbout two years ago he said he would make a drone, and he made one, he said.\n\nMr Chikumbutso narrated the modalities of his latest invention.\n\nAs you know, radio frequencies are measured in nanovolts, meaning to say they are less than a voltbut we find a way of harnessing it through the creation of 70 percent of the components in the microsonic energy, which I have tailor-made.\n\nSo those are the components that enable the radio frequency to be transferred into pure, useful energy and this is the first of its kind in the world, he said.\n\nThe inventor chronicled how he and his colleague were poisoned in the United States of America because their idea was deemed unconventional.\n\nMr Chikumbutsos colleague succumbed to the poisoning incident.\n\nWith that technology, it violates the laws of energy in thermodynamics and also the first law of energy as well he said, before President Mnangagwa interjected saying, So they wanted to arrest him for changing physics.\n\nMr Chikumbutso continued recounting his ordeal of persecution.\n\nEven when we tried to file a patent, they (Americans) said we were violating the natural laws of physics, so it is not industrially applicable. We decided to take the trade secret route after that, he said.\n\nMr Chikumbutso said his latest vehicle invention could even be used to power houses, terming it a moving generator.\n\nSo with this car, you can also use it to power your house, it is a moving generatorit gives you 15 kilowatts to power your house, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/HE1-1.jpg",
            "description": "Wallace Ruzvidzo, Herald Reporter ZIMBABWEANS are capable of spearheading game-changing first-of-a-kind innovations that challenge the world’s traditional ways of doing things, President Mnangagwa has said. The President said this yesterday when Zimbabwean innovator and inventor Mr Maxwell Chikumbutso paid a courtesy call on him at State House in Harare to showcase his latest invention of […]",
            "time": "09:08",
            "date": "29 Jan 2025"
        },
        {
            "title": "Zanu-PF, war vets stand firm on conference resolutions",
            "url": "https://www.herald.co.zw/zanu-pf-war-vets-stand-firm-on-conference-resolutions/",
            "content": "Joseph Madzimure, Senior Reporter\n\nZanu PF and veterans of the liberation struggle have reaffirmed their commitment to resolutions made at the 21st Annual National Peoples Conference, which called for the extension of President Mnangagwas term of office beyond 2028.\n\nThe partys Secretary for War Veterans, Ex-Political Prisoners, Detainees, and Restrictees, Cde Douglas Mahiya, said the decision reflects the will of the majority and seeks to ensure the President completes his vision of transforming Zimbabwe into an Upper Middle-Income Society by 2030.\n\nThis comes amid opposition from a small group of war veterans led by Cde Blessing Runesu Geza, who have been criticised for undermining the partys resolutions.\n\nIn an interview in Harare yesterday, Cde Mahiya dismissed their stance as a foreign agenda designed to create discord within the party.\n\nZanu PF will not listen to misguided elements. Cde Gezas sentiments do not represent the position of war veterans. They are advancing the interests of their handlers, who are yet to be identified. This is a foreign agenda meant to cause disharmony within the party, he said.\n\nCde Mahiya reiterated that the War Veterans League was a wing of the party and must abide by decisions made at the conference or congress.\n\nOnce a decision is made at the conference or congress, war veterans cannot oppose it. The decision of the majority will stand, he said.\n\nAt the conference held in Bulawayo in October last year, delegates unanimously endorsed the resolution to extend President Mnangagwas term, directing the Government to initiate the necessary constitutional amendments to facilitate this move.\n\nYesterday, Mashonaland East Zanu-PF provincial chairman Cde Daniel Garwe assured Zimbabweans that rogue elements who were expelled and suspended from Zanu PF, could not stop the peoples will.\n\nHe said the attacks on President Mnangagwa by some expelled rogue elements such as Godwin Gomwe and Godfrey Tsenengamu will not deter the people s wishes.\n\nWhether they like it or not; Whether they like the President or not, whether they denigrate the President or not; it will not stop the extension of President Mnangagwas term of office beyond 2028, Cde Garwe said.\n\nAlready, Government has started implementing various resolutions adopted at the Zanu PF Annual National Peoples Conference.\n\nThese resolutions cover key areas such as the economy, social services, poverty eradication, infrastructure, value addition, liberation war heritage, climate change, and engagement with the international community.\n\nThe first and most significant resolution was the unanimous agreement to extend President Mnangagwas term to 2030, enabling him to complete his transformative developmental programmes.\n\nJustice, Legal, and Parliamentary Affairs Minister, Ziyambi Ziyambi, recently said the resolutions are not individualistic but collective, reflecting the will of the people.\n\nThe resolutions are a product of wide consultation and consensus from districts to provinces, leading up to their adoption at the conference. Once resolutions are adopted, each respective ministry will take up issues raised within their portfolio. The party Secretary-General will also write to each ministry, highlighting issues raised within their purview, Minister Ziyambi said.\n\nHe added that ministries will consider the resolutions and, where necessary, initiate legislative processes to enact the required changes.\n\nThe resolution to extend President Mnangagwas term beyond 2028 will require a constitutional amendment.\n\nMinister Ziyambi outlined the process, stating that it will follow the normal legislative procedures.\n\nOnce issues arise that require legislative interventions, the relevant legislative process will be initiated. The normal process of coming up with principles for consideration by Cabinet will be done, followed by the drafting of the Bill once Cabinet has approved the principles. The Attorney-Generals department will then draft the Bill and conduct nationwide consultations to inform their drafting process, he said.\n\nThe Governments commitment to implementing the conference resolutions underscores its dedication to achieving Vision 2030 and ensuring the continued development of Zimbabwe under President Mnangagwas leadership.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/05/Cde-Douglas-Mahiya.jpg",
            "description": "Joseph Madzimure, Senior Reporter Zanu PF and veterans of the liberation struggle have reaffirmed their commitment to resolutions made at the 21st Annual National People’s Conference, which called for the extension of President Mnangagwa’s term of office beyond 2028. The party’s Secretary for War Veterans, Ex-Political Prisoners, Detainees, and Restrictees, Cde Douglas Mahiya, said the […]",
            "time": "09:08",
            "date": "29 Jan 2025"
        },
        {
            "title": "Govt courts new partners in energy development",
            "url": "https://www.herald.co.zw/govt-courts-new-partners-in-energy-development/",
            "content": "Blessings Chidakwa, Herald Reporter\n\nZIMBABWE is actively seeking new partnerships in the energy sector to meet the growing demand driven by rapid modernisation and the expansion of infrastructure projects across the country, President Mnangagwa has said.\n\nIn a speech read on his behalf by Energy and Power Development Minister July Moyo at the Africa Heads of State Energy Summit at Julius Nyerere International Convention Centre in Dar es Salaam, Tanzania, yesterday, President Mnangagwa said Zimbabwe was facing energy challenges due to recurrent droughts which have affected power generation at its hydropower plants on Lake Kariba.\n\nThe summit, attended by 20 Heads of State and other top dignitaries, is running under the theme Mission 300.\n\nIt aims to address energy sector gaps, infrastructure needs, and critical reforms to attract investment and mobilise resources across five key pillars.\n\nThese include expanding cost-competitive generation, enhancing regional power sector integration, and promoting distributed renewable energy (DRE) and clean cooking solutions to increase affordable and sustainable energy access.\n\nClimate change is real and a cause for concern. Zimbabwe and Zambia have experienced frequent droughts, which have devastated power supplies from hydroelectric plants. We need to mitigate against such future occurrences by diversifying our energy sources. There is an urgent need to increase the share of other renewable sources such as solar, wind, and biomass in the energy mix, said President Mnangagwa.\n\nHe added that Zimbabwe has created an enabling environment for private investors, offering tax incentives and cost-reflective tariffs to attract investment in the energy sector.\n\nWe invite international cooperating partners to partner with us and play a catalytic role in this programme, the President said.\n\nHe said energy is critical for achieving Vision 2030, which aims to transform Zimbabwe into an upper-middle-income economy.\n\nPresident Mnangagwa also expressed enthusiasm about the proposed interconnector between Zambia and Tanzania, funded by the World Bank, which will enhance regional energy integration.\n\nHowever, he cautioned that commitments made through the Dar es Salaam Declaration would remain theoretical without tangible funding.\n\nI wish to express my gratitude to the African Development Bank and the World Bank for their continued support. We are determined to develop our Energy Compact in the next phase of the initiative, President Mnangagwa said.\n\nCurrently, Zimbabwes average electricity access rate stands at 62 percent, with Government aiming for universal access by 2030.\n\nThis ambitious goal requires electrifying more than 500 000 households annually, up from the current average of 30 000.\n\nTo bridge this gap, the Government is promoting the use of solar systems in rural areas, targeting the distribution of 1.2 million solar home systems by 2030.\n\nThis will be financed mostly through local resources, President Mnangagwa said.\n\nThe President highlighted that massive developmental projects, such as the Dinson Iron and Steel Plant, the largest integrated steel production facility in Africa, are driving up energy consumption.\n\nThe processing of minerals is energy-intensive. There is a correlation between a countrys socio-economic development and its energy consumption level, he said.\n\nZimbabwes current maximum energy demand is around 1 900 MW, but this is projected to rise to 5 600 MW by 2030.\n\nHowever, the countrys installed capacity of 2 950 MW is underutilised, with only 1 300 MW achievable due to low water levels at the Kariba Hydro Power Plant and unreliable generation at aging thermal plants.\n\nThe deficit is currently covered by imports from South Africa and Mozambique.\n\nZimbabwe is interconnected to its neighbours through four 400 kVA interconnectors; Songo (Mozambique), Matimba (South Africa), Phoebe (Botswana), and another to Zambia.\n\nDespite this, the countrys energy consumption per capita of 500 kWh lags behind other middle-income nations like South Africa, which has a per capita consumption of 3 000 kWh.\n\nPresident Mnangagwa challenged fellow leaders to consider the plight of those still living without electricity.\n\nThink about the child using candles to study, the pregnant woman delivering a baby in darkness, and the household without potable water. This situation is typical of many countries in Africa, and the major cause is the failure to access electricity services, he said.\n\nThe Presidents call for partnerships and investment in the energy sector underscores Zimbabwes commitment to achieving sustainable development and improving the quality of life for its citizens.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/President-Mnangagwa.jpg",
            "description": "Blessings Chidakwa, Herald Reporter ZIMBABWE is actively seeking new partnerships in the energy sector to meet the growing demand driven by rapid modernisation and the expansion of infrastructure projects across the country, President Mnangagwa has said. In a speech read on his behalf by Energy and Power Development Minister July Moyo at the Africa Heads […]",
            "time": "09:08",
            "date": "29 Jan 2025"
        },
        {
            "title": "Govt warns rogue elements",
            "url": "https://www.herald.co.zw/govt-warns-rogue-elements/",
            "content": "Herald Reporter\n\nThe Government has registered its disappointment following reactionary and unmerited polemic sentiment shared by a handful of war veterans it says are going against the established principles of revolutionary discipline to undermine President Mnangagwas integrity.\n\nIn a statement last night, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere said the unwarranted show of hypocrisy by Cde Blessed Geza in a recent rant was not only concerning, but surprising.\n\nWe are concerned about the extent to which these individuals, while purporting to be members of the ruling party (and) bona fide members of the War Veterans fraternity, are not using legal and relevant structures to discuss their grievances.\n\nIt is unfortunate that these individuals have also played to the whims of demonising the President for reasons best known to them.\n\nWhat is surprising is that such individuals, including Cde Blessed Geza, was one of the lead proponents of Resolution Number 1 of the 21st National Peoples Conference which underscores the need for the President to remain in office until 2030. Cde Geza was among the conference delegates who lobbied for that resolution to be passed.\n\nTherefore, it is surprising that today he is turning his back against a resolution he helped create. It is unfortunate that the bitterness he suffered from the 2018 primary election defeat is now causing him to go as far as rewriting the history of the President, said Dr Muswere.\n\nHe said Cde Gezas tantrums were disappointing, especially considering that the Second Republic had actualised the constitutional recognition of war veterans.\n\nThis sense of self-contradiction and hypocrisy goes against principles of basic honesty we expect from senior citizens and genuine war veterans.\n\nThis charade is very disappointing considering the magnitude of economic transformation that Zimbabwe has enjoyed under the leadership of the President His Excellency Cde Dr Emmerson Dambudzo Mnangagwa.\n\nSection 84 of the Constitution of Zimbabwe obliges all State institutions and progressive Zimbabweans to recognise Rights of Veterans of the Liberation Struggle.\n\nThese architects of our national liberation include those who fought in the War of Liberation; the virtuous gallant Sons and Daughters of the Soil who assisted the fighters in the war of liberation; and anti-colonial visionaries who were imprisoned, detained and restricted for political reasons during the liberation struggle. Through their unflinching resolve, independent Zimbabwe was born.\n\nPursuant to this clear Constitutional position, the Second Republic, under the revolutionary leadership of the President of the Republic of Zimbabwe, His Excellency Cde Dr E.D. Mnangagwa has championed a deliberate welfare support for the veterans of the liberation struggle, said Dr Muswere.\n\nHe said President Mnangagwa had ensured that war veterans were duly recognised by establishing a stand-alone ministry for their welfare as well as a war veterans wing in the ruling Zanu PF party.\n\nThis, he said, was to ensure the total inclusion and participation of veterans of the liberation struggle in the economy.\n\nThe actualisation of this constitutional recognition of this important class of distinguished patriots has been facilitated by the establishment of a standalone ministry which caters for the socio-economic needs of veterans of the liberation struggle.\n\nFor the first time, four decades after the attainment of Zimbabwes independence, the Second-Republic strengthened the constitutional recognition of the veterans of the liberation struggle by ensuring that the ruling ZANU PF now has a stand-alone War Veterans Wing.\n\nThis dedicated support to our War Veterans further gestures the total respect which the President Cde Dr. E.D. Mnangagwa accords to his fellow anti-colonial stalwart counterparts, said the minister.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/05/Untitled-263.jpg",
            "description": "Herald Reporter The Government has registered its disappointment following “reactionary and unmerited polemic sentiment” shared by a handful of war veterans it says are going against the established principles of revolutionary discipline to undermine President Mnangagwa’s integrity. In a statement last night, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere said the unwarranted show […]",
            "time": "09:08",
            "date": "29 Jan 2025"
        },
        {
            "title": "India commends impressive ties",
            "url": "https://www.herald.co.zw/india-commends-impressive-ties/",
            "content": "Ivan Zhakata and Obey Musiwa\n\nIndia has commended President Mnangagwa and the Zimbabwean Government for unwavering support in fostering a strong partnership between the two nations.\n\nThe praise came during the celebration of India National Day in Harare yesterday, where Indian Ambassador to Zimbabwe, Mr Bramha Kumar, highlighted the deep historical and political ties between the countries as they mark 45 years of diplomatic relations.\n\nAmbassador Kumar said India has long been a steadfast supporter of Zimbabwes liberation struggle and continues to value the historical connections that date back to the era of the Munhumutapa Kingdom.\n\nIndian merchants established strong trade links with Zimbabwe, exchanging textiles, minerals, and metals. Sons of the Munhumutapa royal family even travelled to India to further their education.\n\nIn the 17th century, Dom Miguel, a prince, priest, and heir to the Mutapa throne, studied in Goa. His legacy is immortalised by an inscribed pillar at a chapel in Goa, a testament to his intellectual stature, said Ambassador Kumar.\n\nHe added that the historical and political ties are now transforming into robust economic relations, with Indian private sector investments in Zimbabwe estimated at US$600 million.\n\nThese investments have directly created jobs for 5 000 people and indirectly supported another 10 000.\n\nThe number of Indian companies and professionals in Zimbabwe is growing, and several expansion projects are underway. One such project was recently inaugurated by President Mnangagwa last month.\n\nI am confident that the Indian business sector will play a significant role in restructuring Zimbabwes economy, Ambassador Kumar added.\n\nDeputy Minister of Foreign Affairs and International Trade, Sheilla Chikomo, echoed these sentiments, emphasising the long-standing friendship between Zimbabwe and India, which began in the 14th and 17th centuries during the height of trade between Indian merchants and the Munhumutapa Empire.\n\nThe trade involved gold, ivory, textiles, beads, and precious metals. Members of the Munhumutapa royal family also travelled to India, where they gained education and distinguished themselves as traders and cultural ambassadors, Deputy Minister Chikomo said.\n\nShe highlighted Indias support during Zimbabwes liberation struggle and its continued diplomatic and economic cooperation post-independence.\n\nOur bilateral relations are multifaceted and mutually beneficial. Recently, Vice President Constantino Chiwenga visited India in August 2024 for the Confederation of Indian Industries (CII) India-Africa Business Conclave, further strengthening our ties, she added.\n\nDeputy Minister Chikomo also acknowledged the contributions of the Indian diaspora in Zimbabwe, particularly in business, trade, education, and culture.\n\nShe praised the 17 Indo-Zim Technological Centres established across Zimbabwe, which were upgraded with state-of-the-art Computer Numerical Control (CNC) machines in 2022.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/india.jpg",
            "description": "Ivan Zhakata and Obey Musiwa India has commended President Mnangagwa and the Zimbabwean Government for unwavering support in fostering a strong partnership between the two nations. The praise came during the celebration of India National Day in Harare yesterday, where Indian Ambassador to Zimbabwe, Mr Bramha Kumar, highlighted the deep historical and political ties between […]",
            "time": "09:08",
            "date": "29 Jan 2025"
        },
        {
            "title": "Zanu PF team monitors Beitbridge operations",
            "url": "https://www.herald.co.zw/zanu-pf-team-monitors-beitbridge-operations/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nTHE ruling Zanu PF party has deployed its senior Economic Development Cluster members on a two-day working visit to track and monitor the full implementation of its economic development policies at the Beitbridge Border Post.\n\nIt is understood that the move is part of the many resolutions made at the 21st Annual National Peoples Conference held in Bulawayo in October last year.\n\nThe team is led by the partys National Secretary for Economic Affairs, Retired Lieutenant-General Engelbert Rugeje, Secretary for Business Development Cde Elifasi Mashaba and the director of Economic Affairs, Cde Anastacia Ndlovu.\n\nSpeaking during the tour yesterday, Lt-Gen (Rtd) Rugeje, who is also a Politburo member, said the visit was, among other things, anchored on ensuring there was ease of doing business and smooth trade facilitation through the ports of entry.\n\nHe said Beitbridge Border Post was the nexus of regional and international trade and hence the need to ensure there was proper synchronisation and coordination between the party (Zanu PF) and the Government.\n\nThe US$300 million Beitbridge modernisation project has transformed the critical gateway, reducing congestion and clearing times for cargo and travellers that had become a major bottleneck to trade and free movement of people in the SADC region.\n\nAs you may be aware the party (Zanu PF) is supreme to the Government and we deploy people and policies to drive national economic development, said Lt-Gen (Rtd) Rugeje.\n\nSo, the idea is that there must be proper coordination between the party and the Government which draws its programme from our manifesto and party resolutions made at various platforms such as the peoples conference, Central Committee and Politburo and so on.\n\nOur visit here is in line with many resolutions made by the party members in Bulawayo last year where we undertook to ensure that the Zimbabwe Revenue Authority (Zimra) working with the law enforcement agencies, develop and implement a robust system that curbs leakages of unprocessed natural resources and the smuggling of goods in and out of the country.\n\nHe said indications were that the country was losing revenue due to intrusive leakages and the non-payment of customs duty.\n\nLt-Gen (Rtd) Rugeje said it was important for the duty payment regime to be implemented in a way that strikes a balance between the interests of the Government and the general  citizenry.\n\nHe said the team was engaging cross border traders, transporters, small to medium enterprises, law enforcement agencies, informal traders among other actors to ensure that there was a clear understanding of the national economic development policies.\n\nWe have had fruitful discussions and we are going to take the feedback from these meetings back to the Politburo for discussion, said Lt-Gen (Rtd) Rugeje.\n\nYou will note that we have developed a tracking system of all Government programmes in line with our party programmes and this falls under the Ministry of Presidential Affairs. So, here we are following up on the progress and making recommendations for reviews where necessary.\n\nHe said the success of the economic development policies was critical to drive the envisaged vision 2030 where the countrys economy should grow to an upper middle income level.\n\nThe partys national Secretary for Business Development, Cde Mashaba, said the Second Republic through a partnership with the Zimborders Consortium had invested a lot of resources into transforming the Beitbridge Border Post and it was necessary for service delivery to match the magnificent infrastructure.\n\nA lot of money was put into this project and our thinking is that there should be a change of attitude towards work, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/BB.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau THE ruling Zanu PF party has deployed its senior Economic Development Cluster members on a two-day working visit to track and monitor the full implementation of its economic development policies at the Beitbridge Border Post. It is understood that the move is part of the many resolutions made at the 21st […]",
            "time": "09:08",
            "date": "29 Jan 2025"
        },
        {
            "title": "EDITORIAL COMMENT: DRC protagonists must cease hostilities",
            "url": "https://www.herald.co.zw/editorial-comment-drc-protagonists-must-cease-hostilities/",
            "content": "THE breaching of the ceasefire and peace process in the Democratic Republic of Congo by the M23 rebel movement, culminating in the attacks on SADC and UN peacekeeping forces, killing 13 peacekeepers, and the seizure of the major city of Goma, must be met by effective action.\n\nPresident Mnangagwa, speaking as chairperson of SADC, went beyond condemning these attacks and military action by M23 in his statement on Monday night and made it clear that SADC will assume its full responsibility and take action to deal with the deteriorating security and humanitarian situation in Eastern DRC.\n\nHe also made it clear that those responsible for the situation should be held accountable.\n\nHundreds of thousands of people have been displaced in the fighting that re-erupted, with 400 000 displaced by early this month and many more since, and hundreds have been killed in the attacks on and around Goma.\n\nSADC has had a peacekeeping and monitoring mission in eastern DRC for over a year, having renewed its mandate late last year and this mission works with the United Nations mission in Congo, Monusco.\n\nSouth African and Malawian soldiers with the SADC mission were killed plus Uruguayan troops with the UN force in attacks over the last few days.\n\nSADC took the lead in the peace process when former SADC chairperson President Joo Manuel Goncalves Lourenco of Angola, with full Africa Union backing for the regional initiative, agreed to take on the role with both SADC and AU credentials.\n\nAfter some very difficult negotiations, he hammered out a peace deal with both the DRC government and M23, and reportedly with other involved parties giving their assent in a major effort by Angolan diplomacy determined to cover all angles.\n\nIt is this deal that M23 has so flagrantly breached in its recent military action and shown just how little its word is worth. It is likely that it must be receiving arms and ammunition from outside the DRC to be able to sustain the strong military initiative and capture a city of more than one million people, rather than just using up supplies it already held.\n\nSo the situation has gone far beyond banditry by indisciplined rebel fighters turning to crime.\n\nIt must be understood that SADC always backs the legitimate and elected Government of its member states.\n\nIn fact President Felix Tshisekedi of DRC was an opposition leader when President Joseph Kabila lost the delayed 2018 elections. The DRC Constitutional Court confirmed the result in early 2019, and SADC played a part in ensuring that this first ever peaceful transfer of government in the DRC went ahead smoothly. President Tshisekedi won re-election at the end of 2023.\n\nThe normal democratic process where the voters decide who forms their Government is highlighted by the fact that former President Kabila still lives in the DRC as an important farmer near Kinshasa and, by a clause in the DRC constitution, as a former president, sits in Parliament as a senator for life.\n\nEveryone assumed that with this sort of normality in democratic processes, and President Lourencos magnificent diplomatic efforts on behalf of SADC and the AU that reached a deal last year, the people of DRC could finally enjoy a peaceful and democratic future after so many decades of war and autocracy.\n\nThe SADC Secretariat, in its detailed reaction now fully backed politically by President Mnangagwa as chairperson, has made it clear that all parties to the conflict in the eastern DRC must adhere to the peace agreements and M23 must withdraw from any territory it has occupied since the ceasefire came into effect.\n\nFormer rebel movements in SADC and Africa have become legitimate political parties under peace agreements, renouncing violence and moving into the democratic process of trying to win votes, and in other cases have either merged with existing parties or simply packed up politics and their members joining the existing political set up as individuals.\n\nAll these options were open to M23 and its members. Now the breach of the ceasefire and the decision to trample over the peace deal means that, as President Mnangagwa said, those responsible must be held accountable and SADC has to take effective action.\n\nIt has to be acknowledged that the eastern DRC is also a victim of the grave troubles that occurred elsewhere in the Great Lakes region, with refugees and former militia members seeking refuge in what was then a poorly governed DRC before the restoration of democracy. And there might be extreme nervousness among neighbours that those who sought sanctuary could be troublesome.\n\nBut the democratic DRC under both President Kabila and President Tshisekedi restored effective administration outside the modest rebel areas of the east, and it is impossible to imagine that the DRC would ever allow its territory to be used as a base for attacks on its neighbours.\n\nIf the DRC Government had proper control of all its territory it would prevent any such action, and then use diplomacy and normal international standards to clear up the refugee mess. So a successful end of rebellion in eastern DRC is in everyones interests.\n\nNeighbouring states can be involved in peace agreements, at least to the extent of wanting to see a secure eastern border on the DRC, but guaranteed secure borders is one of the cornerstones of the African Union from its very inception as the OAU. We cannot see any problem as a proper peace process unfolds in the eastern DRC, of effective enforcement of that principle.\n\nThe breakdown of the peace process that we thought had been secured last year by President Lourenco will require, as President Mnangagwa intimated, more action from SADC with possibly a greater range of diplomatic efforts to cut off any support for rebel groups while stronger action is taken against active rebels. This worked in Mozambique.\n\nSuch action will, of course, need to be tightly co-ordinated but SADC has been rather good at doing this effectively and the AU itself has made it clear that it will back the SADC effort, as it has done by giving President Lourenco continental credentials as he leads the diplomatic efforts. What cannot be tolerated is that an armed rebel group can be used to further political aims of internal and external interests.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/01/President-elect-Felix-Tshisekedi-680x380.jpg",
            "description": "THE breaching of the ceasefire and peace process in the Democratic Republic of Congo by the M23 rebel movement, culminating in the attacks on SADC and UN peacekeeping forces, killing 13 peacekeepers, and the seizure of the major city of Goma, must be met by effective action. President Mnangagwa, speaking as chairperson of SADC, went […]",
            "time": "09:08",
            "date": "29 Jan 2025"
        },
        {
            "title": "Zacc compiles 470 dockets",
            "url": "https://www.herald.co.zw/zacc-compiles-470-dockets/",
            "content": "Freeman Razemba, Crime Reporter\n\nThe Zimbabwe Anti-Corruption Commission (ZACC) undertook rigorous investigations, resulting in the compilation of 470 dockets across the nation, last year.\n\nOut of these, 343 dockets were submitted to the National Prosecuting Authority (NPA) for prosecution.\n\nZACC chairperson Mr Michael Reza confirmed this, stating that their mandate ends upon submitting completed dockets to the NPA.\n\nIn the previous year, we sent or completed 470 dockets, and of those, we sent 343 to the National Prosecuting Authority, he explained in an interview.\n\nOver and above that, we had 50 cases sent to the NPA, which are high profile in nature.\n\nMr Reza said the anti-graft body also recovered over 350 vehicles illegally imported through the abuse of the civil servants vehicle rebate scheme, which allows civil servants to import vehicles duty-free.\n\nJoint investigations involving ZACC, the Zimbabwe Republic Police, and the Zimbabwe Revenue Authority led to the recovery.\n\nMr Reza highlighted the success of the inter-agency collaboration, adding that investigations remain ongoing and more vehicles are expected to be recovered.\n\nThe vehicle rebate scheme was introduced as an incentive for civil servants with at least 10 years of service, allowing duty-free vehicle imports.\n\nHowever, the scheme prohibits selling, leasing, or hiring the vehicles within five years of import without written permission from ZIMRA. Despite these regulations, many car dealers in Harare have exploited the scheme by colluding with civil servants and using their names to import vehicles duty-free.\n\nIn addition to recovering assets, ZACC is focusing on compensating for damages inflicted on the State and victims of corruption.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Mr-Michael-Reza-680x380.jpg",
            "description": "Freeman Razemba, Crime Reporter The Zimbabwe Anti-Corruption Commission (ZACC) undertook rigorous investigations, resulting in the compilation of 470 dockets across the nation, last year. Out of these, 343 dockets were submitted to the National Prosecuting Authority (NPA) for prosecution. ZACC chairperson Mr Michael Reza confirmed this, stating that their mandate ends upon submitting completed dockets […]",
            "time": "09:08",
            "date": "29 Jan 2025"
        },
        {
            "title": "NEES, BROOS, HASSAN BRACE FOR SHOWDOWN",
            "url": "https://www.herald.co.zw/nees-broos-hassan-brace-for-showdown/",
            "content": "Eddie Chikamhi, Zimpapers Sports Hub\n\nTHERE are still 11 months before the Warriors plunge into their sixth Africa Cup of Nations finals in Morocco and coach Michael Nees believes with good preparation, Zimbabwe will be able to stand their ground and progress to the second round for the first time.\n\nThe German coach was a satisfied man after seeing the draw conducted in the host nation, Morocco, on Monday night, as his Warriors were placed in Group B, where they will face old enemies South Africa, Angola and North African giants, Egypt.\n\nIt is a group that promises fireworks, given that Zimbabwe, Angola and South Africa enjoy a COSAFA rivalry that has spanned more than 25 years.\n\nJust like Nees, Bafana Bafana coach Hugo Broos of South Africa and Egypts Hossam Hassan yesterday also came out bullish about their teams chances.\n\nThe tournament will take place from December 21, 2025, to January 18, 2026.\n\nZimbabwe are going to the AFCON finals for the sixth time but are yet to proceed beyond the group stage.\n\nThey qualified for the coming edition on the back of an encouraging run that saw them losing only once to group winners Cameroon in the last match of the campaign last November.\n\nOrdinarily, the huge time gap between the end of the qualifiers and the final tournament should come as a worrying factor, but this could be a blessing in disguise as it gives teams time to focus and prepare.\n\nNees, who is no stranger to duels with South Africa, told the ZIFA media yesterday that proper preparation will be key ahead of the AFCON 2025 battles.\n\nWe need to be up to the challenge straight from the beginning, but with good preparations we can meet the challenge, said Nees.\n\nAs any other team, we want to go to the second round.\n\nWe respect our opponents, but we have all the self-belief in our own strength and skills to achieve this objective. The tournament will set new standards for an AFCON, I am sure, and the conditions and facilities will be quite fair and equal for all the teams, said Nees.\n\nWith three teams in the group hailing from the COSAFA region, familiarity could be a huge determinant.\n\nNo secrets here; the teams know each other very well. A derby against rivals Bafana Bafana again, and a clash with a skilful Angola side that have a different playing style.\n\nNot to mention North African powerhouses Egypt, record champions and one of the tournament favourites, who will come to Morocco definitely with all their stars and their best team.\n\nIn my opinion, its a very balanced, strong, and competitive group.\n\nZimbabwe will play their first match against the Pharaohs in Aghadir, then face Angola and Bafana Bafana in the last group game in Marakesh, where they will be based for the tournament.\n\nBroos yesterday also told the South Africa Football Association media that he has more information on Zimbabwe after playing the Warriors in the 2026 World Cup qualifiers last year.\n\nHe could have seen more of the contests between the neighbours but Zimbabwe could not participate in the 2023 AFCON edition due to a FIFA suspension despite the teams having been placed in the same qualifying group again.\n\nZimbabwe is a neighbour of South Africa, and its always a very difficult game for us. On the other hand, in all the games we played already against Zimbabwe, we played one draw, and we won three times.\n\nSo, winning against Zimbabwe is very possible in the AFCON, said Broos.\n\nThe 72-year-old Belgian, who led Bafana Bafana to a bronze medal in the last edition in Cote dIvoire, is returning to the continental finals for the third time.\n\nHe won the AFCON tournament on his first attempt after guiding Cameroon to the 2017 gong.\n\nBroos has rated seven-time champions Egypt as the biggest threat in the group.\n\nSo, in general, I think we can be satisfied. It is not a very easy group. On the other hand, I think we have a great opportunity to qualify for the next round of the AFCON.\n\nAnd then, as you know, in the AFCON, after the group stages, anything is possible. So, we will do everything to do better than the last AFCON, he said.\n\nThe Bafana Bafana coach said, on paper at least, Egypt could be the biggest threat in Group B despite their struggles the last time out.\n\nWhen I look at our opponents for AFCON, I think that Egypt is the favourite to win the group. They didnt do very well at the last AFCON . . . they didnt perform like everybody expected, and they were very soon out of the tournament.\n\nBut I think in the last year and a half they have built a very good team. They did very well in the qualifiers, so they will be the team to beat for first place, said Broos.\n\nUnlike the Warriors, who finished as runners-up, the trio of Bafana Bafana, Angola, and Egypt finished undefeated and perched at the summit of their groups in the qualifying campaign last year.\n\nHowever, the Pharaohs have been struggling at the continental finals, having been knocked out by DRC in the round of 16 in Cote dIvoire.\n\nEgypts last AFCON title was 15 years ago when they won the competition in Angola, but their coach, the legendary Hossam Hassan, believes tables will turn, beginning at the group stage. Hassan, however, refused to underrate Zimbabwe or any of the opponents in Group B.\n\nIt is a strong group, especially since football in Africa is developing for the better, and there are no longer weak teams, as evidenced by the results witnessed in recent years and championships and the brilliance of new teams in the upper echelons of African football.\n\nOf course, as Egypt is the most winning team in the Cup of African Nations, we always play to achieve championships, and this will be our goal, said Hassan.\n\nAngolas Portuguese coach Pedro Goncalves was yet to comment but is no stranger to the AFCON spotlight after steering the Palancas Negras to the quarter-finals in 2023.\n\nThis was their best performance in years.\n\nGoncalves has transformed Angola into a formidable side with just one loss in their last 15 matches across all competitions.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Michael-Nees.jpg",
            "description": "Eddie Chikamhi, Zimpapers Sports Hub THERE are still 11 months before the Warriors plunge into their sixth Africa Cup of Nations finals in Morocco and coach Michael Nees believes with good preparation, Zimbabwe will be able to stand their ground and progress to the second round for the first time. The German coach was a […]",
            "time": "09:08",
            "date": "29 Jan 2025"
        },
        {
            "title": "Focus on major offences, police urged",
            "url": "https://www.herald.co.zw/focus-on-major-offences-police-urged/",
            "content": "Crime Reporter\n\nPOLICE officers conducting traffic operations under the ongoing campaign against lawlessness have been urged to prioritise major traffic offences that promote road safety and responsible driving, rather than concentrating on minor infractions.\n\nThis follows complaints from motorists that some officers are overly focused on trivial offences, such as the type of fire extinguisher or reflective vests carried by drivers.\n\nDuring recent roadblocks, police have been checking for a wide range of items, including drivers licences, reflective triangles, reflective vests, specific types of fire extinguishers, spare wheels, brake and indicator functionality, and reflectors.\n\nWhile these checks are part of routine policing, motorists have raised concerns that the focus on minor details detracts from addressing more critical road safety issues.\n\nIn response, National Police spokesperson, Commissioner Paul Nyathi, said officers should concentrate on key traffic offences.\n\nThe police should focus on key issues which promote road safety and responsible driving. Yes, we have taken note of some of the complaints raised by the public.\n\nHowever, they should also know that some of these issues are highlighted in the countrys laws. Our officers have been fully briefed on what they should check at police checkpoints, said Comm Nyathi.\n\nComm Nyathi expressed gratitude to the public for their support and cooperation in the ongoing operation, No to Mushikashika and Lawlessness on the Roads.\n\nHe reiterated that only registered kombis with all relevant and verifiable documents would be allowed to operate as public service vehicles.\n\nNo unregistered kombis or pirate taxis will be allowed to conduct business as public service vehicles. Kombi owners must lead by example and ensure compliance with road rules and regulations. All kombis on the roads must be registered and licenced through the relevant Government arms.\n\nComm Nyathi also urged passengers to avoid boarding unroadworthy kombis, especially those without registration plates or with windows covered by cardboard boxes and other materials.\n\nHe advised the public to wait for transport only at designated pickup points to avoid disrupting traffic flow.\n\nThe Zimbabwe Republic Police Command is taking decisive action on corrupt elements within the rank and file of the police. This includes unregistered kombi operators who are now working with unruly elements to perpetuate corrupt activities on the roads, Comm Nyathi said.\n\nHe highlighted that Commissioner-General of Police, Stephen Mutamba, has directed all police commanders to ensure that duly registered and compliant kombis are allowed passage at checkpoints without unnecessary delays.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/08/Paul-Nyathi.jpg",
            "description": "Crime Reporter POLICE officers conducting traffic operations under the ongoing campaign against lawlessness have been urged to prioritise major traffic offences that promote road safety and responsible driving, rather than concentrating on minor infractions. This follows complaints from motorists that some officers are overly focused on trivial offences, such as the type of fire extinguisher […]",
            "time": "09:08",
            "date": "29 Jan 2025"
        }
    ]
}