{
    "news": [
        {
            "title": "Bulawayo gears up for 45th Independence Day celebrations",
            "url": "https://www.herald.co.zw/bulawayo-gears-up-for-45th-independence-day-celebrations/",
            "content": "Sikhumbuzo Moyo, Senior Reporter\n\nITS a drizzling morning in Bulawayo, with overcast clouds, as the City prepares to celebrate the countrys 45th independence, which also coincides with the start of the Easter weekend.\n\nOn this day, Jesus Christ shed blood as he was crucified to cleanse the world of its sins and bring peace.\n\nFor Zimbabwe, its sons and daughters took up arms to fight the brutal colonial regime and during the armed conflict, blood was shed, lives were lost, as brave sons and daughters of the soil were eager to cleanse the country of the evil leadership and bring peace by allowing the majority black to rule themselves.\n\nIt was a bloody and brutal war, but 45 years ago, the Union Jack was lowered at a packed Rufaro Stadium in Harare, giving birth to a new and free country called Zimbabwe.\n\nThe Bulawayo provincial Independence celebrations are set for the sentimental White City Stadium, a stones throw away from Father Zimbabwe, the late Vice President Dr Joshua Mqabuko Nkomos Pelandaba House.\n\nThe days programme was initially set to kick off with a procession led by drum majorettes from D Square near Mpopoma High School along Nketa Drive to the main venue, but weather conditions may have forced organizers to cancel the procession.\n\nWeather reports indicate that the day will be overcast for the better part, with a 20 percent chance of intermittent showers.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/ba0a8b06-27d8-46e5-acd3-d70409fc778b-680x380.jpeg",
            "description": "IT'S a drizzling morning in Bulawayo, with overcast clouds, as the City prepares to celebrate the country's 45th independence, which also coincides with the start of the Easter weekend.",
            "time": "09:46",
            "date": "18 Apr 2025"
        },
        {
            "title": "LIVE: Happy birthday, Zimbabwe!",
            "url": "https://www.herald.co.zw/live-happy-birthday-zimbabwe/",
            "content": "\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Count-down.png",
            "description": "",
            "time": "09:46",
            "date": "18 Apr 2025"
        },
        {
            "title": "‘Education key to solving community challenges’",
            "url": "https://www.herald.co.zw/education-key-to-solving-community-challenges/",
            "content": "Blessings Chidakwa in GOKWE\n\nGOVERNMENT is working tirelessly to ensure universal access to education for all children to prepare them for a brighter future so that they can contribute meaningfully to national development, President Mnangagwa has said.\n\nSpeaking at the 45th Independence Childrens Party at Nyamuroro High School in Gokwe yesterday, President Mnangagwa said unity, innovation and hard work are key to securing a prosperous future for all Zimbabweans.\n\nHe urged the nation to continue to respect the heroes and heroines who made it possible for the children of Zimbabwe to have access to education, health care and opportunities.\n\nAs the nation commemorates Independence Day today, the President said Uhuru is a time to reflect on the countrys journey and citizens should come together to build a shared vision.\n\nHe said this years Independence Day Celebrations theme, Zimbabwe at 45: Devolve and Develop Together Towards Vision 2030, must remind children that, as Government and elders, they want them to have equal development, opportunities and access to Information Communication Technology, whether they live in rural or urban areas.\n\nOur national Independence represents the struggles and sacrifices made by many young boys and girls of the past, who were just like you and fought for our freedom.\n\nIt is a time to reflect on our liberation history, to also celebrate the progress we have made as a nation, and to look ahead to a brighter future, he said.\n\nPresident Mnangagwa said learners should be able to relate to relevant education so that they can solve the challenges which communities face on a day-to-day basis.\n\nThe reviewed curriculum is also meant to address the needs of the 21st-century economy. This demands a robust education system that produces graduates with the right characteristics that enable them to be competitive in the global environment.\n\nIf you are educated, you should be able to produce services and goods, not just be fluent in the Queens language, he said.\n\nBuilding from the skills-oriented curriculum framework, my Government has put in place the required changes for our children to acquire scientific, innovative, vocational and technical skills that empower them to develop enterprises and contribute to the nations socio-economic transformation.\n\nPresident Mnangagwa said as the nation celebrates Independence Day, he is proud of the vast potential, talent and brilliance of the countrys children.\n\nIn that regard, he said the Government is implementing programmes that focus on increasing youth participation in development and decision-making processes.\n\nThey (children) are torchbearers of the dreams and aspirations for a better, modern and industrialised Zimbabwe. I assure you that the Second Republic will support the young people of our country by providing the necessary teaching and learning resources to promote both quality and inclusive education for a higher quality of life for all our people, President Mnangagwa said.\n\nMy Administration is prioritising an e-teaching and e-learning policy within our schools. To make sure that this runs smoothly, electricity, internet connectivity, and related ICT equipment to schools including those in marginalised communities is being provided.\n\nThe President called upon the Ministries of Energy and Power Development, as well as Information Communication Technology, Postal and Courier Services, among other service providers, to speedily implement projects and programmes in schools.\n\nThis should see our schools, especially those in rural and resettlement areas, recording critical infrastructure improvements that enhance the learning experiences of pupils, he said.\n\nPresident Mnangagwa urged all citizens to continue working together to build a nation that is just, equitable and prosperous for children, where they grow up with hope, dignity, and pride.\n\nMy Government will continue to equip you, our children, to face your future with confidence, zeal and determination so that you lay a strong foundation to play your part in transforming the socio-economic development of our nation.\n\nIn all that we do, we must be guided by our philosophy: Nyika inovakwa, inotongwa, inonamatirwa nevene vayo/Ilizwe lakhiwa, libuswe, likhulekelwe ngabanikazi balo, he said.\n\nPresident Mnangagwa said the Government is also engaging various stakeholders to guarantee the provision of quality education that is affordable to all children, as well as the promotion of learning skills to make learners ready for the world of the future.\n\nThrough the Ministry of Primary and Secondary Education, we are progressing well to realise universal primary and secondary education, the promotion of foundational learning, and ensuring that all children of school-going age have the relevant skills and equipment to innovate for employment creation and entrepreneurship.\n\nUnder our education system, boys and girls are being given equal opportunities to achieve their full potential, he said.\n\nPresident Mnangagwa said the health and well-being of every citizen, including school-going children, is critical for unlocking the countrys economic potential.\n\nIt is our collective responsibility to address the plight of vulnerable and disadvantaged pupils in schools. No matter where they are, they too must be facilitated to enrol for their education and pursue fulfilling careers, he said.\n\nPresident Mnangagwa also took a swipe at the scourge of cyberbullying and drug and substance abuse.\n\nLet us join hands to fight substance and drug abuse, a moral cancer affecting mostly young boys and girls. The peddling of drugs, as well as the abuse of social media platforms, should be rejected by our children and the youth throughout the country. Say no to drugs and harmful substances. Say no to cyberbullying, he said.\n\nEarlier on, President Mnangagwa had led Government officials, including Vice President Dr Constantino Chiwenga and school children in planting 45 trees at Nyamuroro High School.\n\nThe 45 trees signify the countrys years of self-rule.\n\nPresident Mnangagwa planted the Red Mahogany, whose botanic name is Khaya Anthotheca or Mubarwa, Muwawa or Mururu in Shona.\n\nFirst Lady Dr Auxillia Mnangagwa, who is the countrys patron of the Environment, joined President Mnangagwa, top Government officials and schoolchildren in planting trees at the venue.\n\nThe First Lady planted the Mahogany or Muwawa tree which is endemic in Manicaland Province and is the biggest tree in the Sadc region.\n\nThe tree has acclimatised in all the regions due to its fast-growing attributes and is one of the countrys commercial indigenous tree species.\n\nIn line with Dr Mnangagwas reafforestation drive, the event also saw the establishment of a Trabablas Arboretum at the school, which is a combination of indigenous tree species to be used for educational and research purposes.\n\nDr Mnangagwa is leading the domestication of indigenous trees in cooperation with community livelihoods and this is one of the trees that she is promoting to reclaim forests and land degraded areas.\n\nThe First Lady, who has a passion for the welfare of children, took time to interact with them on various social issues affecting todays youths.\n\nThe First Lady, who was bubbling with joy, praised the children and urged them to take to heart all the life lessons they were drawing from her Gota/Nhanga/Ixhiba programme, aimed at moulding morally upright citizens.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/HE-1.jpg",
            "description": "Blessings Chidakwa in GOKWE GOVERNMENT is working tirelessly to ensure universal access to education for all children to prepare them for a brighter future so that they can contribute meaningfully to national development, President Mnangagwa has said. Speaking at the 45th Independence Children’s Party at Nyamuroro High School in Gokwe yesterday, President Mnangagwa said unity, […]",
            "time": "09:46",
            "date": "18 Apr 2025"
        },
        {
            "title": "Presidential Internet Scheme launched",
            "url": "https://www.herald.co.zw/presidential-internet-scheme-launched-2/",
            "content": "Farai Dauramanzi in NEMBUDZIYA, Gokwe\n\nPRESIDENT Mnangagwa yesterday launched the Presidential Internet Scheme during the Childrens Party at Nyamuroro High School in Nembudziya, Gokwe.\n\nThis is a transformative initiative aimed at delivering high-speed broadband connectivity to all 2 400 administrative wards across Zimbabwe.\n\nAs part of the programme, President Mnangagwa also handed over 2 000 Starlink gadgets to boost connectivity at schools, clinics and police camps in areas where there is no internet connectivity.\n\nThe Presidential Scheme is being administered by the Ministry of Information Communication Technology, Postal and Courier Services.\n\nSpeaking on the sidelines of the launch, ICT, Postal and Courier Services Minister Tatenda Mavetera said the programme is meant to ensure connectivity of all Government departments.\n\nThe Presidential Internet Scheme is meant to connect all Government departments and avail connectivity to all these places, she said.\n\nWe previously had programmes where we used fibre to connect various places across the country, but we realised that there was a need to adopt the various technologies that are coming up, especially the low earth orbit satellites, and see how best we can reach out, especially to underserved areas.\n\nMinister Mavetera added that the ministry conducted a broadband mapping exercise and realised a gap in some areas.\n\nSo this is the gap that we want to fill with the Presidential Internet Scheme that will see us connecting all marginalised areas using Low-Earth Orbit satellites and all fibre technology.\n\nWe are going to co-ordinate with all companies that are into low-earth orbit satellite and fibre technology, she said.\n\nThe Presidential Internet Scheme will connect schools, clinics and all courts, including traditional courts.\n\nDuring the Childrens Party proceedings, President Mnangagwa also launched the school business units at Nyamuroro High School and Nyamuroro Primary School.\n\nThe business units comprise a garden, fish ponds and solar-powered boreholes.\n\nThe units are part of village and school business units being established across the country under the ongoing Presidential Rural Development Programme, which seeks to radically improve rural livelihoods and transform rural communities into active economic participants.\n\nPresident Mnangagwa also led top Government officials and school children in planting 45 trees, a number that signifies the countrys years of self-rule.\n\nWhile delivering his welcome remarks at the Childrens Party, Primary and Secondary Education Minister Dr Torerayi Moyo said school children in the country are grateful to President Mnangagwa for the various initiatives his Government is implementing.\n\nThey are especially grateful for the increased investment in infrastructure development, the provision of basic education, the introduction of digital learning platforms in schools, and the prioritisation of learner welfare through school feeding programmes and subsidised examination fees, especially for those coming from indigent backgrounds.\n\nThey are thankful that all these initiatives have not only improved access to education but have also enhanced the learning environment, allowing every child, regardless of background or location, to dream bigger, learn better, and aspire to become productive citizens of a prosperous Zimbabwe, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/TM.jpg",
            "description": "Farai Dauramanzi in NEMBUDZIYA, Gokwe PRESIDENT Mnangagwa yesterday launched the Presidential Internet Scheme during the Children’s Party at Nyamuroro High School in Nembudziya, Gokwe. This is a transformative initiative aimed at delivering high-speed broadband connectivity to all 2 400 administrative wards across Zimbabwe. As part of the programme, President Mnangagwa also handed over 2 000 […]",
            "time": "09:46",
            "date": "18 Apr 2025"
        },
        {
            "title": "First Lady heralds new era for Women’s Parly Caucus",
            "url": "https://www.herald.co.zw/first-lady-heralds-new-era-for-womens-parly-caucus/",
            "content": "Tendai Rupapa, Senior Reporter\n\nAN air of buoyancy and cordiality pervaded through Parliament on Wednesday as women parliamentarians toasted to the dawn of a new era with First Lady Dr Auxillia Mnangagwa as ambassador of the Zimbabwe Womens Parliamentary Caucus.\n\nThe parliamentarians body language and unity of purpose as they sang and danced spoke volumes about their acceptance of their ambassador across the political divide.\n\nOn her part, Dr Mnangagwa yesterday looked radiant as she held a first-of-its-kind meeting with the women parliamentarians whom she praised for daring to step into the arena of leadership and raise their voices to shape the nations future.\n\nThe meeting touched on a range of issues, including womens empowerment, 50-50 representation, collaboration with the Angel of Hope Foundation, business, etiquette, public speaking, dressing, and the need to mentor young political aspirants.\n\nThe First Lady brought along speakers from the school of public speaking, Dr Blessing Mandipira and Ms Ruvimbo Chitsungo, to talk to the women to build confidence in them, promoting etiquette, personal branding, and teaching them how to carry themselves and their approach to people they represent.\n\nThe confluence of minds and spirits, the First Lady said, was not merely a formality, but a testament to the unwavering spirit of Zimbabwean women.\n\nThis gathering is a beacon illuminating the path towards a more inclusive, equitable, and prosperous future for all. Honourable members, allow me to express my honour in accepting the role of ambassador for your caucus as I pledge my unwavering commitment to advancing gender equality and womens empowerment in our society, she said.\n\nPresident Mnangagwa shows First Lady Dr Auxillia Mnangagwa, Vice President Dr Constantino Chiwenga and Mrs Chiwenga how leg chains were used to cuff him during his detention at Khami Maximum Prison in Bulawayo in the 1960s. He was touring a mock cell during the 45th Independence Childrens Party in Gokwe yesterday.  Pictures: Presidential Photographer: John Manzongo\n\nThe Zimbabwe Women Parliamentary Caucus, Dr Mnangagwa said, has made remarkable progress in advancing the 50-50 agenda, particularly through the extension of the womens quota system in Parliament until 2033.\n\nThis initiative has yielded significant results, increasing womens representation in Parliament from 18 percent in 2008 to 35 percent in 2013, thereby surpassing the initial 30 percent target. We gather at a critical juncture in our nations history, a time filled with both challenges and immense opportunities. Your presence in Parliament is a powerful act of reclaiming our space of ensuring that the unique insights and experiences of Zimbabwean women are brought to the forefront of national discourse and policy formulation, she said.\n\nThe womens caucus, Dr Mnangagwa said, must be the torch bearer in the march of the unity of purpose. For that reason, our performance in constituency-based elections also requires attention, she said.\n\nIn recent polls, only 11 percent of women succeeded under the first-past-the-post system, declining from 12 percent. While the womens quota has increased the overall representation of the female Members of Parliament, we must ensure that it does not become a limitation which confines women solely to quota-based positions. Given these sobering statistics, the ZWPC must reflect and strategise on how to enhance the influence of women in our electoral processes. Your key entry point is to win in the partys primary elections. Persuade your political parties to act accordingly, she said.\n\nFirst Lady Dr Auxillia Mnangagwa interacts with children during the 45th Independence Childrens Party in Gokwe yesterday\n\nAs a former Member of Parliament for Chirumanzu-Zibagwe Constituency, Dr Mnangagwa said she had experienced first-hand the challenges women face in winning elections in constituencies.\n\nThe obstacles are significant and multifaceted. Most political parties lack written policies on gender selection for candidates, particularly in the first-past-the-post electoral systems, which results in limited participation by women in these electoral contests.\n\nEsteemed parliamentarians, our vision of full and equal participation of women in a democratic and gender-responsive environment can only be realised through collective effort and persevering dedication. His Excellency Dr ED Mnangagwas vision of an empowered and prosperous upper-middle-income society by 2030 requires the full participation of women across all socio-economic spheres. Indeed, the mantra Leaving no one and no place behind must become a reality for Zimbabwean women in their journey towards gender parity, she said.\n\nSince women comprise 52 percent of the population, Dr Mnangagwa said, their participation in all aspects of national life was not just a goal, but a compelling imperative necessity.\n\nShe invited the legislators to engage in open dialogue about their current limitations and challenges, strategies to enhance parliamentary visibility, ways to improve effectiveness in parliamentary roles, and potential areas of collaboration with her office.\n\nFirst Lady Dr Auxillia Mnangagwa distributes goodies to children during the 45th Independence Childrens Party in Gokwe yesterday.\n\nOccupying positions of leadership, the First Lady said, was not without demands and responsibilities.\n\nAs women in the public eye, you are not only representatives of your constituencies but also role models for the young girls and women of our nation. Your actions, your words, and your very presence carry a powerful message, shaping perceptions and inspiring aspirations. Honourable parliamentarians, I urge each and every one of you to find your voice and contribute actively and confidently to the debates that shape the future of our beloved Zimbabwe. Be confident, have a voice, and say something. Do not be dissuaded by dismissive sneers or comments. If you have something to say, then say it. Let your perspectives be heard, for they are invaluable and essential in crafting legislation that truly reflects the needs and aspirations of our citizens. Do not be swayed by fear and disagreement or counter arguments, rather, embrace these moments as opportunities for growth, refinement of your ideas, and the strengthening of our parliamentary discourse, she said.\n\nDr Mnangagwa reminded the parliamentarians to dress well and to be presentable at all times.\n\nIn the realm of public service, your attire becomes a visual representation of the dignity of your office. It should be respectful of the traditions and values of our society while also reflecting your personal style and manner that is both confident and appropriate, paying attention to details such as neat hair, clean attire, and polished shoes demonstrates a commitment to excellence and a respect for the people you serve.\n\nFurthermore, Honourable Members of Parliament, our responsibility extends beyond the walls of this assembly. We have a profound duty to nurture the next generation of female leaders in Zimbabwe. This will help increase the percentage of female parliamentarians in our country, she said.\n\nMrs Chiwenga distributes goodies to children during the 45th Independence Childrens Party in Gokwe yesterday\n\nThe mother of the nation implored the legislators to seek out young women with budding political aspirations and take them under their wings.\n\nImpart your knowledge, share your experiences, and offer unwavering guidance to help them navigate the path of public service. I challenge each of you to identify and commit to mentoring at least three young women, grooming them with the hope that they, too, will stand within these chambers, their voices strong and their contributions significant. By investing in these young minds, we are not only empowering individuals but also strengthening the future of our nation and ensuring a continued legacy of female leadership in Zimbabwe. I challenge you for our next meeting to bring three or more young women with political aspirations that you have brought under your wings for mentorship and demonstrate how you are guiding your mentees as they navigate the landscape of politics. We want our numbers as women to increase in Parliament and indeed it is entirely up to us samadzimai, she said to applause.\n\nGoing forward, Dr Mnangagwa said she abhors women who pull their peers down.\n\nWe say no to the PHD syndrome (pull her down). What we want is unity and development as women. I want to work with people who are not discriminatory and do not leave others behind. I touch many areas like disability, health, education, the elderly, the less privileged, social services, GBV, among many others; therefore, come with me as we work for the nation. I will be moving with you on some occasions but when tied up, I can assign you to represent me. I am glad you have shown me that you are one and all our discussions are non-partisan. I want us to mentor other women who are keen on politics. Lets go out there and get would-be parliamentarians, and they will join us in our next meeting.\n\nYou raised many issues where you want us to work together, the issues are to do with womens empowerment. I will engage Womens Bank for you to have a separate, stand-alone account for women parliamentarians to get revolving funds to do empowerment projects in your constituencies. It is also good for us to engage established businesswomen for skills training so that we are empowered business-wise, she said.\n\nAmbassador of the Zimbabwe Women Parliamentary Caucus First Lady Dr Auxillia Mnangagwa shares a lighter moment with Senate President Mable Chinomona and Speaker of Parliament Adv Jacob Mudenda during an inaugural meeting at Parliament Building in Harare on Wednesday\n\nTo encourage women, the First Lady spoke about some of the projects she is personally undertaking using locally available resources.\n\nLet us work, we are hard workers, madzimai. We will engage business women for workshops and learn from them. Minister Mutsvangwa, what do you say about this?\n\nMinister Mutsvangwa welcomed the suggestions and initiatives proposed by Amai Mnangagwa.\n\nThe First Lady further told the women that she has an open-door policy and is always ready to give advice and assistance to women.\n\nShe advised the women to form groups and come up with their business proposals.\n\nYou can embark on farming projects; horticulture brings quick returns. You are mothers. What have you done to feed your family, your community, and your nation? Also, teach your children to make use of their hands and shun social vices. Also, education is critical, and it has no limit. Let us go to school so that when you debate in Parliament, you submit meaningful points, she said.\n\nAmai touched on dressing, encouraging women parliamentarians to always dress presentable, saying it builds their confidence.\n\nTo add colour to the meeting, she invited the women to showcase their attire, much to their delight.\n\nThe women did a mini catwalk while Amai and other women became judges.\n\nIn conclusion, Amai said she will execute her ambassadorial role to the best of her ability.\n\nHon Bridget Sibanda gives her points during a meeting of female parliamentarians with the Ambassador of the Zimbabwe Women Parliamentary Caucus First Lady Dr Auxillia Mnangagwa at Parliament Building in Harare on Wednesday\n\nSpeaker of Parliament Advocate Jacob Mudenda hailed the appointment of the First Lady as ambassador of the Womens Caucus as a progressive step.\n\nThe Womens Caucus will create those fruits, developmental fruits that will uplift the female parliamentarian. Number two, the fruits that will uplift the developmental mantra of Zimbabwe, the fruits that will enable the women parliamentarians to contribute nationally, continentally, and internationally. Therefore, Honourable Members, do not disappoint because you have a dependable mentor who you have to walk with all the time from today. Let me thank you once again, Your Excellency, for accepting the responsibility, and I have no doubt that you will carry the responsibilities to the best of your abilities, he said.\n\nSenate President, Senator Mabel Chinomona extended the caucuss appreciation to the First Lady for accepting the role of ambassador.\n\nThis progressive and historic collaboration between the caucus and the Office of the First Lady will undoubtedly propel the work and activities of the caucus to greater heights and elevate the status of women in Zimbabwe.\n\nWe, therefore, welcome you, Amai, to this inaugural meeting. Your work through the Angel of Hope Foundation has already laid a strong foundation for the empowerment of women and children in Zimbabwe.\n\nThe Foundations focus on health, education, and economic empowerment aligns seamlessly with the objectives of the caucus. We have witnessed the massive impact of your initiatives from the provision of maternal health services in rural areas to the support for income-generating projects for women.\n\nThese initiatives have not only transformed the lives of the beneficiaries but have inspired hope and resilience within communities across this nation. As emphasised by His Excellency, the President, Dr ED Mnangagwa Nyika inovakwa nevene vayo the ZWPC remains unwavering in its commitment to improving the livelihoods of women. We will never rest on our laurels as we tirelessly strive to uplift and empower women in our society, she said.\n\nHon Thokozani Khupe gives her points during a meeting of female parliamentarians with the Ambassador of the Zimbabwe Women Parliamentary Caucus First Lady Dr Auxillia Mnangagwa at Parliament Building in Harare on Wednesday\n\nSen Chinomona challenged women in Parliament and leadership positions to harness their numerical advantage as demographic trends favour them, to enact transformative decisions that propel the socio-economic advancement of the nation.\n\nChairperson of the Zimbabwe Womens Parliamentary Caucus, Maybe Mbowa, presented a position paper on behalf of fellow women parliamentarians.\n\nAs women, we collectively represent the aspirations of 52 percent of Zimbabwes population, which demands that our rights be respected and upheld throughout the country.\n\nToday marks a special moment for the women of Zimbabwe as we have been granted this opportunity to engage with you, our Ambassador and First Lady. I firmly believe this meeting heralds the beginning of positive and tangible developments for Zimbabwean women. This partnership has the potential to strengthen our collective efforts in addressing womens challenges, promoting their rights, and achieving gender equality, she said.\n\nDr Thokozani Khupe shared her challenges with cancer and sought to work with the mother of the nation in the fight against cancer.\n\nYour Excellency, cancer is indisputably a rising epidemic. This is evidenced by the number of people who are dying as a result of cancer. We recently lost a Member of Parliament who succumbed to cancer. The issue of cancer is supposed to be given attention. Your Excellency, sexual reproductive health rights are very fundamental in ensuring the well-being of women and communities and women at large.\n\nSo, as the Womens Parliamentary Caucus, Your Excellency, we would like to appreciate you so very much and acknowledge the good work that you are doing in raising cancer awareness and also in providing screening facilities for women across the board and across the nation.\n\nSo many women have benefited. Your Excellency, as you know that I am a cancer survivor, I have gone through a lot of trials and tribulations and we have decided that we as parliament take the issue of cancer to a higher level by establishing a parliamentary cancer caucus whose role will be to make sure that we do cancer awareness programmes in all the 210 constituencies which is going to further cascade to all the wards so that at least people will know that there is this scourge called cancer, she said.\n\nHonourable Biata Nyamupinga, hailed Dr Mnangagwa for her interventions.\n\nThank you Amai for alleviating the plight of people with disabilities. You are doing the work wholeheartedly; we see your passion. You are not doing it just because you are the First Lady, its evident in your work that you are truly passionate about assisting the needy. On the disability side, we wish to work with you closely, she said.\n\nAmbassador of the Zimbabwe Women Parliamentary Caucus First Lady Dr Auxillia Mnangagwa interacts with female parliamentarians during an inaugural meeting at Parliament Building in Harare on Wednesday.  Pictures: John Manzongo\n\nZimbabwe Women Parliamentary Caucus Ambassador First Lady Dr Auxillia Mnangagwa commends Hon Rose Mpofu for being well dressed and presentable during her teachings on etiquette and grooming for female parliamentarians at an interactive meeting at Parliament Building in Harare on Wednesday\n\nZimbabwe Women Parliamentary Caucus Ambassador First Lady Dr Auxillia Mnangagwa commends Hon Sisasenkosi Ndebele for being well dressed and presentable during her teachings on etiquette and grooming for female parliamentarians at an interactive meeting at Parliament Building in Harare on Wednesday\n\nZimbabwe Women Parliamentary Caucus Ambassador First Lady Dr Auxillia Mnangagwa receives motivational textbooks from Mr Blessing Mandipira which she donated to female parliamentarians during an interactive meeting at Parliament Building in Harare on Wednesday\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/F1.jpg",
            "description": "Tendai Rupapa, Senior Reporter AN air of buoyancy and cordiality pervaded through Parliament on Wednesday as women parliamentarians toasted to the dawn of a new era with First Lady Dr Auxillia Mnangagwa as ambassador of the Zimbabwe Women’s Parliamentary Caucus. The parliamentarians’ body language and unity of purpose as they sang and danced spoke volumes […]",
            "time": "09:46",
            "date": "18 Apr 2025"
        },
        {
            "title": "Afreximbank predicts steady growth for Zimbabwe",
            "url": "https://www.herald.co.zw/afreximbank-predicts-steady-growth-for-zimbabwe/",
            "content": "Tapiwanashe Mangwiro, Senior Business Reporter\n\nINTERNATIONAL Financial Institution, Afreximbank, forecasts a 3,8 percent economic growth for Zimbabwe in 2025 and steady growth over the next several years, according to its latest African Trade and Economic Outlook report.\n\nThe pan-African financier projects Zimbabwes annual growth at 3,8 percent in 2025, with rates of 3 percent in 2024, 3,3 percent in 2026, and 3,6 percent in 2027.\n\nDespite global shocks, a favourable agricultural season, expansion in mining activities and stable economic conditions will spur growth in Zimbabwe, the bank noted.\n\nSuch a forecast places Zimbabwe amongst the fastest-growing economies on the continent, emerging as a key beneficiary of intra-African trade.\n\nThese projections are in line with predictions from several international financial institutions. The International Monetary Fund, World Bank, and African Development Bank have also signalled robust recovery prospects for Zimbabwe.\n\nWhile the AfDB anticipates a growth rate of 5,3 percent in 2025, the Ministry of Finance, Economic Development and Investment Promotion, which initially forecast 6 percent growth, has hinted at a possible review of forecasts, a revision that could be triggered by the performance of key sectors in the first quarter of the year.\n\nAn economist familiar with regional trends, Dr Tendai Chikwanha, said: The convergence of these positive indicators from multiple IFIs reinforces Zimbabwes potential. However, the ministrys caution about reviewing forecasts suggests that sectoral performance in the short term remains a critical variable.\n\nMoving deeper into the countrys macroeconomic environment, Afreximbanks report also highlights significant improvements in other key metrics.\n\nThe recent period has witnessed pronounced disinflationary trends across Central, Eastern and Southern Africa. Locally, the effect has been particularly notable, with inflation experiencing a marked decline that aligns with the broader regional trend, a fall from levels seen in previous years.\n\nRegional inflation is projected to decrease from 20,1 percent in 2024 to 18,8 percent in 2025, then further dipping to 15,7 percent in 2026, and stabilising at 14,7 percent by 2027.\n\nWithin this scenario, Zimbabwe is set for an impressive contraction of approximately 32,2 percentage points over the forecast horizon, reflecting effective inflation control measures.\n\nFiscal consolidation is another bright spot, with the continent expecting its average fiscal deficit to narrow from 5,8 percent of GDP in 2024 to 4 percent by 2027.\n\nZimbabwe, alongside Malawi, Mozambique, Zambia and South Africa, is anticipated to implement stringent measures that will gradually improve fiscal health, albeit with differences in magnitude.\n\nDebt-to-GDP ratios in Southern Africa are similarly trending downwards, as exemplified by the countrys expected debt reduction by 8,3 percentage points over the forecast period.\n\nThese fiscal and monetary adjustments are critical for maintaining investor confidence and sustaining the growth momentum, said Dr Chikwanha.\n\nThe comprehensive policy stance, including targeted fiscal measures and improved monetary discipline, positions Zimbabwe favourably for medium-termeconomic recovery, notwithstanding potential external headwinds.\n\nIn a separate but equally impactful development, Afreximbank announced a substantial dividend declaration following its stellar financial performance over the past year.\n\nThe bank reported a profit of US$973,53 million in the fiscal year ending December 31, 2024, marking a significant jump from US$756,1 million in the previous period. With robust increases in net interest income and net fee and commission income, up by 25,4 percent and 32,45 percent respectively, the banks performance has far exceeded market expectations.\n\nDue to the higher net income achieved during the year under review and in line with historical trends, Directors recommended a dividend payout of US$300 million, up from US$264,6 million in 2023, to shareholders, representing a payout ratio of 31 percent, Afreximbank stated in its financial results announcement.\n\nZimbabwe, notably, stands as the banks fifth-largest shareholder with a stake of 5,71 percent. This dividend decision not only affirms Afreximbanks financial resilience but also provides Zimbabwe with a tangible return on its equity position, an encouraging sign for local investors and policymakers alike.\n\nMr Raymond Madziva, a prominent banker, said: The dividend declaration underscores not only the banks strong performance but also its commitment to rewarding shareholders. For Zimbabwe, this translates into a boosted investor sentiment and a potentially positive multiplier effect in the broader economy.\n\nOverall, the multifaceted outlook for Zimbabwe, as painted by Afreximbank and echoed by other leading IFIs, signals a cautiously optimistic future. The forecast growth is anchored in favourable conditions within key sectors such as agriculture and mining, while positive trends in inflation control and fiscal consolidation add to the narrative of resilience.\n\nConcurrently, strategic dividend payouts by major financial institutions like Afreximbank further enhance the countrys financial landscape, demonstrating the tangible benefits of robust performance in the regional banking sector.\n\nAs experts like Dr Chikwanha and Mr Madziva emphasise, the composite view of steady growth, improved macroeconomic stability, and rewarding dividends points to a brighter financial future for the nation.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Afreximbank.jpg",
            "description": "Tapiwanashe Mangwiro, Senior Business Reporter INTERNATIONAL Financial Institution, Afreximbank, forecasts a 3,8 percent economic growth for Zimbabwe in 2025 and steady growth over the next several years, according to its latest African Trade and Economic Outlook report. The pan-African financier projects Zimbabwe’s annual growth at 3,8 percent in 2025, with rates of 3 percent in […]",
            "time": "09:46",
            "date": "18 Apr 2025"
        },
        {
            "title": "‘Relations with Beijing to advance common interests’",
            "url": "https://www.herald.co.zw/relations-with-beijing-to-advance-common-interests/",
            "content": "Mukudzei Chingwere, Herald Reporter\n\nZIMBABWE hopes that the momentum it has achieved in bilateral and economic relations with China will continue to advance common interests in a mutually beneficial manner, Foreign Affairs and International Trade Minister Professor Amon Murwira has said.\n\nThe two countries are marking the 45th anniversary of their diplomatic ties, emphasising the enduring friendship and co-operation that have deepened over the decades.\n\nBoth countries expressed their commitment to further enhancing their relationship.\n\nAs we celebrate this momentous occasion, we wish to express our satisfaction with the excellent and long-standing bond of friendship that exists between our two countries and peoples, said Prof Murwira.\n\nHe said it was his sincere hope that the momentum achieved over the years, in bilateral and economic relations, will continue to advance the two countries common interests in a mutually rewarding manner.\n\nThis milestone is not just a testament to our enduring friendship and partnership, but also a reminder of the mutual respect, understanding and shared values that continue to cement the ties between our two nations, Prof Murwira said.\n\nHe said the elevation of the relationship to a Comprehensive Strategic Partnership of Cooperation, in 2018, marked a high point in all aspects of the relationship, which saw an upward trajectory of trade and investment and ever-growing government-to-government and party-to-party interactions.\n\nYour Excellency and Dear Brother, Zimbabwe is committed to further deepening the China-Zimbabwe Comprehensive Strategic Partnership of Cooperation, through the five-star ironclad cooperation framework recently announced by His Excellency President Xi Jinping.\n\nWe look forward to continued cooperation on multilateral issues of common interest, as we strive to attain global peace, progress, prosperity and sustainable development, to achieve a shared future for all mankind, said Prof Murwira.\n\nMember of the Political Bureau of the CPC Central Committee and Foreign Minister of China Wang Yi echoed these sentiments, reflecting on the traditional friendship that has weathered various global changes.\n\nThe collaboration is expected to strengthen further under the recently announced five-star ironclad cooperation framework, aimed at addressing multilateral issues and promoting global peace and sustainable development.\n\nChina and Zimbabwe enjoy a profound traditional friendship, which has stood the test of time and remained rock-solid amid the changing international landscape, said Minister Wang.\n\nSince the establishment of diplomatic ties 45 years ago, our two countries have always treated each other as equals with sincerity and friendship, and stayed committed to mutual benefit and common development.\n\nIn recent years, he said, under the strategic guidance of President Xi Jinping and President Mnangagwa, China and Zimbabwe have continuously deepened political mutual trust and achieved notable results in practical cooperation, delivering tangible benefits to our two peoples.\n\nI stand ready to work with you to take the 45th anniversary of our diplomatic ties as an opportunity to intensify exchanges and cooperation between our two foreign ministries, and implement the outcomes of the Beijing Summit of the Forum on China-Africa Cooperation, said Minister Wang.\n\nThe important consensus between our two presidents, and firm up mutual support, with a view to further enhancing the China-Zimbabwe comprehensive strategic partnership of cooperation and jointly building a high-level China-Zimbabwe community with a shared future.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/02/Professor-Amon-Murwira.jpg",
            "description": "Mukudzei Chingwere, Herald Reporter ZIMBABWE hopes that the momentum it has achieved in bilateral and economic relations with China will continue to advance common interests in a mutually beneficial manner, Foreign Affairs and International Trade Minister Professor Amon Murwira has said. The two countries are marking the 45th anniversary of their diplomatic ties, emphasising the […]",
            "time": "09:46",
            "date": "18 Apr 2025"
        },
        {
            "title": "China willing to partner Zim in mineral beneficiation",
            "url": "https://www.herald.co.zw/china-willing-to-partner-zim-in-mineral-beneficiation/",
            "content": "Remember Deketeke, Herald Correspondent\n\nCHINA is willing to extend its vast mineral beneficiation expertise to Zimbabwe, the head of a visiting Chinese delegation, Deputy Mayor of Hunan City, Mr Cao Zhiqiang, has said.\n\nHe was speaking after a meeting with the Minister of Mines and Mining Development, Cde Winston Chitando in Harare yesterday.\n\nChina is one of the global leaders in mineral beneficiation and its willingness to partner Zimbabwe is likely going to give the country a lift in its quest to locally beneficiate its natural resources.\n\nThe engagement underscored deepening economic ties between Zimbabwe and China, with particular focus on cooperation in the mining sector, one of Zimbabwes most strategic pillars for economic transformation.\n\nSpeaking during the interface, Minister Chitando applauded Chinas historic and unwavering support for Zimbabwes liberation struggle and post-independence economic development.\n\nZimbabwe is open for business. Our mining sector is under-explored, yet it holds more than 60 minerals, he said.\n\nStrategic partnerships such as this one with Hunan are critical to unlocking the full value of our resources.\n\nMinister Chitando noted that under the Second Republic led by President Mnangagwa, the Government has pursued a three-pronged strategy in the mining sector, reopening closed mines, activating operations where minimal exploration is needed and expanding new exploration through licensing.\n\nCollaboration with China, especially with Hunans advanced technology and mining infrastructure, he said, would not only bring investment into the mining value chain but also accelerate beneficiation and infrastructure development, which are crucial to realising Vision 2030.\n\nZimbabwe is targeting a $12 billion mining economy and the cooperation with China is expected to inject capital into underutilised resources and catalyse growth in key sectors such as lithium, ferrochrome, coal, and steel.\n\nGoing forward, we are focusing on three major investment areasjoint ventures in existing operations, quick wins in low-exploration areas, and capital for greenfield exploration. Additionally, we seek infrastructure investments in transport, laboratories, and mineral beneficiation, Minister Chitando added.\n\nIn response, the Hunan Vice Governor extended a formal invitation to President Mnangagwa to attend the China Economic and Trade Expo from June 1215 and reaffirmed Hunans commitment to Zimbabwes development agenda.\n\nHunans industrial base is solid, boasting leading clusters in engineering machinery, aerospace, and rail, he said.\n\nWe have 137 universities, including strong institutions in mining and geology. This co-operation with Zimbabwe is not only strategic, it is historic.\n\nMr Cao said Hunans total trade with Zimbabwe had grown by 73 percent in 2023, with over 80 Hunan enterprises now operating in Zimbabwe.\n\nChinese contractual investments stand at over US$30 million, a figure expected to grow with the new agreements.\n\nMr Cao also revealed that Hunans mining sector surpassed RMB 600 billion (approximately US$83 billion) in output last year and brought with it key mineral groups interested in resource exploration, green energy, and value-added processing in Zimbabwe.\n\nHunans commitment is clear, we will partner with Zimbabwe in mining exploration, processing, and infrastructure development, he said.\n\nWe also want to bring innovation through the China-Africa Economic and Trade Expo and cooperation platforms.\n\nThe partnership is set to address Zimbabwes key development needs, modern exploration techniques, value addition, infrastructure, and industrialisation making it a cornerstone in the achievement of the National Development Strategy 1 and ultimately Vision 2030.\n\nWith mineral beneficiation, increased investment, and infrastructure support on the horizon, the Zimbabwe-Hunan co-operation may well be the catalyst that transforms Zimbabwes vast mineral wealth into real socio-economic growth.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Chitando.jpg",
            "description": "Remember Deketeke, Herald Correspondent CHINA is willing to extend its vast mineral beneficiation expertise to Zimbabwe, the head of a visiting Chinese delegation, Deputy Mayor of Hunan City, Mr Cao Zhiqiang, has said. He was speaking after a meeting with the Minister of Mines and Mining Development, Cde Winston Chitando in Harare yesterday. China is […]",
            "time": "09:46",
            "date": "18 Apr 2025"
        },
        {
            "title": "EDITORIAL COMMENT: Lets build on the gains  of Independence",
            "url": "https://www.herald.co.zw/editorial-comment-lets-build-on-the-gains-of-independence/",
            "content": "TODAY we celebrate the 45th anniversary of our Independence which came on the back of a protracted liberation struggle against white colonial rule. As we commemorate this important day, we need to remember the sacrifices made by the gallant sons and daughters of the soil who sacrificed their lives so that a new, free and sovereign Zimbabwe could be born.\n\nAs we reflect on the past 45 years of self-rule and determination, it is important to take stock of the gains and successes of Independence while looking ahead to a brighter, prosperous future.\n\nA majority of Zimbabweans were born after independence and many more have grown up since independence and some of these are now even moving into leadership positions in the public and private sectors. A lot of that movement is possible because they grew up in a free and open society that allows people to move ahead based on their talents and hard work, a society which they see as normal.\n\nThat normality is perhaps the greatest result of independence, that people are not judged or held back because others are in control who fear their advance and will do anything to prevent it. The struggle for independence in Zimbabwe was a double struggle, against both the admittedly declining imperialism of the far off metropolitan country, and far more bitterly against the colonial settler regime and society that was so determined to maintain its control forever.\n\nSo the struggle for independence was not just a struggle for political independence, important as that was, but also a struggle to transform a most peculiar society and that also meant that people had to realise that they were able to take control of their own lives. And it was this second struggle that was the harder.\n\nFor many Zimbabweans the struggle for independence is something learned from history books and history lessons in schools, or perhaps from what parents or grandparents may say. So they are properly grateful that the struggle was successful, but perhaps do not see immediate relevance to the issues of today and the needs of tomorrow.\n\nYet everything is linked, and there are no great breaks in human society and human progress, and so the spirit of independence is as relevant today as it was 45 years ago.\n\nAs older people look back to April 1980, the lasting memory is the sense of optimism and hope that lit up the nation, the whole nation, that all things were now possible. The struggles for independence had been very hard and bitter, but had been successful so other struggles were equally likely to be a success.\n\nThe victory had been marked by celebration, but also by a sense of reconciliation and the need to recommit to maintaining freedom and building something a great deal better than what was inherited.\n\nThe people who thronged the stadiums across the country, and the special flag-raising district ceremonies after the main event in Rufaro Stadium, were gathering to express both joy and hope. Joy that we had, as a nation, won our freedom and our right to decide our own future and hope that we would be building something a lot better.\n\nA lot of that was done, perhaps not always continuously but adding up over the decades, and where mistakes were made there have been efforts to get back on the correct course, a course which does change as new generations come to the forefront since we are continually building on what has gone before.\n\nBut despite the tacking and problems, we need to maintain that sense of everything being possible, that we are the builders of our own future, and that we need to make sure that we build better all the time.\n\nPresident Mnangagwa has in recent years been stressing this idea that Zimbabweans and Africans must take more responsibility for their destiny; that we have to rely more on ourselves since others are not going to do it for us.\n\nThat is the serious lesson that he and many others learnt in the long liberation struggle and the liberation war, that if they did not do it themselves then liberation would simply not happen. That those who did not want it to happen would remain in control and would maintain the society that allowed them to automatically exclude most Zimbabweans.\n\nIt was that dedication of so many who had pushed for freedom, struggled for freedom, fought for freedom, suffered and died for freedom, that lit up the stadium at the moment of victory. While todays struggles might be different, we will, because we are human, always be struggling to build something better and we will always need that dedication.\n\nSo Independence Day is not just an anniversary of the day when the new Zimbabwe flag fluttered in the sky for the first time, or even when the countrys name changed to the name everyone wanted. If it was just that, then it would be a low-key public holiday.\n\nRather it must be the day when we can concentrate on what sort of Zimbabwe we want, a Zimbabwe that we have to build ourselves because we are independent, we are now responsible for our own tomorrows. We then need to use the opportunity to rededicate ourselves to that future progress and to rededicate ourselves to maintaining our freedoms.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Zim@45.jpg",
            "description": "TODAY we celebrate the 45th anniversary of our Independence which came on the back of a protracted liberation struggle against white colonial rule. As we commemorate this important day, we need to remember the sacrifices made by the gallant sons and daughters of the soil who sacrificed their lives so that a new, free and […]",
            "time": "09:46",
            "date": "18 Apr 2025"
        },
        {
            "title": "Unlocking Mutapa’s true potential",
            "url": "https://www.herald.co.zw/unlocking-mutapas-true-potential/",
            "content": "Jimmy Murwira\n\nProjected to more than double its value to over US$30 billion by 2030, MIF is quickly climbing the ladder to become one of Africas largest sovereign wealth funds. But while this projection sparks excitement, it also invites a deeper question: will the growth of this fund finally bridge the gap between Zimbabwes rich resources and the economic wellbeing of its people?ZIMBABWEs Mutapa Investment Fund (MIF) is on the cusp of something potentially transformative not just for the fund itself, but for the entire Zimbabwean economy.\n\nLet us unpack what this valuation means and why, beyond the numbers, MIFs performance is about trust, transparency, and tangible development.\n\nNot so long ago, state-owned enterprises in Zimbabwe were largely synonymous with mismanagement, underperformance, and mounting debts. But MIFs trajectory appears to be bucking that trend. Independent accounting firms last year pegged the funds value at over US$16 billion, which already made it a regional heavyweight.\n\nThe growth since then, driven largely by surging global gold prices, improved governance, and strategic recapitalisation, now positions the fund to possibly contribute up to 20 percent of Zimbabwes GDP by 2030.\n\nTo put that into perspective, this is no longer a fledgling state asset manager. If the US$30 billion projection materialises, MIF will outpace many better-known African funds, such as Botswanas Pula Fund (US$5.3 billion), Angolas FSDEA (US$2.98 billion), and Namibias Welwitschia Fund (US$15 million). Only Ethiopia, South Africa, and Libya would have larger disclosed asset bases.\n\nThis is not just impressive. It is monumental.\n\nMuch of the funds momentum is tied to Zimbabwes resource-rich mining sector, which has long been the bedrock of its economic output. When MIF was first valued, gold was trading at about US$1 800 per ounce.\n\nToday, its past US$3 160 per ounce. The result? A dramatic increase in the valuation of MIFs gold assets, especially those under Kuvimba Mining House, which is part of the funds sprawling portfolio.\n\nBut MIF is not betting solely on gold. The fund is backing energy exploration through its investment in Invictus Energy, the Australian company searching for oil and gas in Muzarabani. A US$5 million capital injection in 2024 helped support flow testing at the Mukuyu-2 well and other preparatory works.\n\nIf commercial production kicks off and all signs indicate its on the horizon, this single project could turbocharge Zimbabwes entry into the oil and gas industry, a sector it has long watched from the sidelines.\n\nThe strategic vision does not end there. According to Dr John Mangudya, CEO of MIF, the fund is pouring resources into exploration projects for lithium, chrome, and other critical minerals, ensuring that valuations are based on verified reserves through internationally recognised reporting standards like the JORC   Code.\n\nThis meticulous groundwork does more than boost investor confidence; it changes the narrative. It tells the world that Zimbabwe is open for business, and we know exactly what we are offering.\n\nWhile mining is the anchor, MIFs portfolio is not a one-trick pony. The fund has ownership stakes in strategic companies across transport (NRZ, Air Zimbabwe, Zupco), telecommunications (TelOne, Telecel), energy (Zesa, Petrotrade, ZPC), financial services (POSB, Homelink), and agriculture (Arda Seeds, Cold Storage Commission).\n\nThis kind of diversity provides a hedge against volatility in any single sector. If properly managed, MIF could offer Zimbabwe the kind of macroeconomic stability that other resource-dependent nations struggle to maintain when commodity prices tumble.\n\nMore importantly, it could finally give Zimbabweans visible returns on their vast natural resource wealth in the form of better infrastructure, more jobs, and improved public services.\n\nAs President Mnangagwa stated in his 2024 State of the Nation Address, MIF is envisioned to bolster performance and revenue from the mining and other sectors, ultimately to benefit all Zimbabweans. That sentiment must translate into  action.\n\nThe global shift toward green energy and new technologies has made minerals like lithium, nickel, and rare earths more valuable than ever. Zimbabwe possesses these in abundance. If the Mutapa Investment Fund can position itself as a credible, transparent custodian of these resources and channel their value into national development, it could redefine Zimbabwes economic destiny.\n\nIt is not an exaggeration to say that Mutapa could be Zimbabwes ticket to true economic sovereignty.\n\nBut this moment will not last forever. Commodity prices are cyclical. Geopolitical winds shift. And investors, both local and international, need certainty. Thats why MIF must move with urgency but also with integrity.\n\nIn theory, sovereign wealth funds are the ultimate symbols of intergenerational responsibility, a way for countries to convert finite natural resources into lasting national wealth. In practice, they are only as successful as the systems that support them.\n\nMutapa Investment Fund has the ingredients of a success story: a strong asset base, rising global demand for its holdings, and a strategic plan backed by executive support.\n\nNow it needs to prove that it can rise above the politics, the past missteps, and the temptations of short-termism.\n\nIf it does, Zimbabwe will have more than just a well-performing fund. It will have built a platform for shared prosperity, economic dignity, and global respect.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/08/Dr-Mangudya.jpg",
            "description": "Jimmy Murwira Projected to more than double its value to over US$30 billion by 2030, MIF is quickly climbing the ladder to become one of Africa’s largest sovereign wealth funds. But while this projection sparks excitement, it also invites a deeper question: will the growth of this fund finally bridge the gap between Zimbabwe’s rich […]",
            "time": "09:46",
            "date": "18 Apr 2025"
        }
    ]
}