{
    "news": [
        {
            "title": "7 more firms for Byo-Vic Falls road upgrade",
            "url": "https://www.herald.co.zw/7-more-firms-for-byo-vic-falls-road-upgrade/",
            "content": "Sikhumbuzo Moyo\n\nGOVERNMENT has engaged seven more contractors to work on the rehabilitation of Bulawayo-Victoria Falls road.\n\nThe seven firms join Bitumen World, which was initially awarded the tender to work on the 435km road which leads to the countrys premier tourism destination.\n\nUnder the new arrangement, which is similar to what is happening on the Harare-Beitbridge road where different contractors were engaged, each company will work on a 51km stretch.\n\nIn in an interview after commissioning the 230-metre long Somgolo Bridge in Lupanda Village, Lupane District on Friday, Matabeleland North Provincial Affairs and Devolution Minister Cde Richard Moyo said the companies were scheduled to start work last week, but were delayed by administrative issues.\n\nCabinet agreed to engage seven more contractors to join Bitumen World and each company will rehabilitate a 51km stretch, said Minister Moyo.\n\nHe said the contractors will not be doing pothole patching, but will completely overhaul the badly damaged road, which has seen motorists who in the past used to take about five hours from Bulawayo to Victoria Falls now taking eight hours or more.\n\nThe Government has resolved to reconstruct this badly damaged road like what is being done on the Harare-Beitbridge road, hence this time the work the companies have been engaged to do is not pothole patching. The road is worn out and the Government wants a complete overhaul, said Minister Moyo.\n\nThis busy highway is in a state of disrepair partly because of the increased number of haulage trucks and incessant rains.\n\nWork was supposed to start on April 3, but administrative issues delayed the programme, said Minister Moyo.\n\nDeveloping a sound transport infrastructure is key to achieving the nations vision of an upper-middle-income economy by 2030.\n\nPresident Mnangagwa has already outlined the key infrastructural projects that his Government will undertake this year, which include the construction of roads and dams.\n\nThe Beitbridge-Bulawayo-Victoria Falls is one of the key priority projects given its economic impact as it connects local businesses with Southern African countries such as Zambia, DRC and South Africa.\n\nThe route is also a strategic access point to the countrys tourist destinations such as the Hwange National Park and Victoria Falls.\n\nSome sections of the highway are now littered with potholes making it difficult for motorists to navigate.\n\nThe Government has said the permanent solution to fixing the Beitbridge-Bulawayo-Victoria Falls Highway is to do a complete reconstruction like what is being done on the Harare-Beitbridge road.\n\nLast October, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere said Cabinet had considered and adopted the proposed Public-Private Partnership between Government and Bitumen World for the immediate rebuilding of the Beitbridge-Bulawayo-Victoria Falls road.\n\nThe Second Republic, under President Mnangagwa, has continued to prioritise infrastructural development countrywide under the Emergency Road Rehabilitation Programme (ERRP2) and various other initiatives, which have transformed the economy as well as creating employment.\n\nThe Second Republic has invested significantly in infrastructural development as a key enabler to economic transformation despite limited access to external lines of credit.\n\nSo far, more than 50 000km of roads have been rehabilitated, while 2 000 structures have been attended to since the start of the ERRP2 in 2021.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/07/0i0-11.jpg",
            "description": "Sikhumbuzo Moyo GOVERNMENT has engaged seven more contractors to work on the rehabilitation of Bulawayo-Victoria Falls road. The seven firms join Bitumen World, which was initially awarded the tender to work on the 435km road which leads to the country’s premier tourism destination. Under the new arrangement, which is similar to what is happening on […]",
            "time": "06:40",
            "date": "14 Apr 2025"
        },
        {
            "title": "Zanu PF breaks jinx, reclaims Glen View South seat",
            "url": "https://www.herald.co.zw/zanu-pf-breaks-jinx-reclaims-glen-view-south-seat/",
            "content": "Joseph Madzimure and Richard Muponde\n\nZANU PF has reclaimed Glen View South constituency, breaking the oppositions two-decade stranglehold.\n\nThe opposition had controlled the seat since the turn of the millennium before the ruling party broke the jinx on Saturday.\n\nThe last Zanu PF female legislator to win the seat was Cde Idah Mashonganyika, who is now an Elders Council member and this time again, a woman has snatched victory for the ruling party.\n\nZanu PF candidate, Cde Tsitsi Tawomhera, garnered 3 392 votes to seal victory in the by-election held on Saturday to fill the vacant parliamentary seat in the constituency.\n\nThe results were released by the Zimbabwe Electoral Commission yesterday.\n\nThe seat fell vacant following the death of Grandmore Hakata, who was the constituencys legislator.\n\nCde Tawomhera trounced other four aspirants: three independent candidates; Tungamirai Madzokere (234), Tonderai Chakaredza (993), George Makwangwaidze (681) and National Constitutional Assembly (NCA) candidate Perpetua Mukanda (77).\n\nRunning a campaign focused on community development, service delivery, and inclusive representation, her strategy struck a powerful chord with voters seeking committed and responsive leadership.\n\nHer message of inclusivity, progress, and empowerment appealed to a wide cross-section of the electorate, particularly the youth and women who have increasingly become pivotal in shaping the countrys political direction.\n\nThe latest victory has cemented Zanu PFs domination in the once opposition stronghold due to theSecond Republics commitment to improve the livelihoods of the general public under the mantra leaving no one and no place behind.\n\nSpeaking after her victory, Cde Tawomhera thanked Glen View South residents for their trust and vowed to prioritise service delivery, job creation, and infrastructure rehabilitation.\n\nThis victory is not mine aloneit belongs to every resident tired of empty promises. Under President Mnangagwas leadership, we will transform Glen View South into a model of urban prosperity, she declared.\n\nThe oppositions mismanagement of urban councils has plunged residents into worsening poverty due to corruption, inefficiency, and a lack of patriotic leadership.\n\nUnder the stewardship of President Mnangagwa, the ruling party is reclaiming urban spaces to restore service delivery, economic growth, and sustainable development.\n\nBy exactly 7 am, all polling stations had opened for the voting process and closed by 7 pm for collation purposes.\n\nThere were 43 polling stations in the constituency with a 31 519 voter population.\n\nZanu PF Harare provincial Political Commissar Cde Voyage Dambuza said the victory is due to efforts made by President Mnangagwa to improve the livelihoods of the people in the area.\n\nPresident Mnangagwa has managed to bring water to the people under the Presidential Borehole Scheme; major roads are being rehabilitated; ICT centres were opened in Glen View and business units are being established. This shows that Zanu PF is connected to the needs of the people, said Cde Dambuza.\n\nGlen View South will never be the same again under the Zanu PF leadership.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Tawomhera.jpg",
            "description": "Joseph Madzimure and Richard Muponde ZANU PF has reclaimed Glen View South constituency, breaking the opposition’s two-decade stranglehold. The opposition had controlled the seat since the turn of the millennium before the ruling party broke the jinx on Saturday. The last Zanu PF female legislator to win the seat was Cde Idah Mashonganyika, who is […]",
            "time": "06:40",
            "date": "14 Apr 2025"
        },
        {
            "title": "Zim to produce solar panels, lithium batteries",
            "url": "https://www.herald.co.zw/zim-to-produce-solar-panels-lithium-batteries/",
            "content": "Herald Reporter\n\nZimbabwe will soon start large-scale manufacturing of solar panels and lithium batteries as the Government moves to capacitate local universities to collaborate with international companies to bring expertise and technology.\n\nThis follows the approval of a Memorandum of Understanding with the International Solar Alliance (ISA) to establish a Solar Technology Application Resource Centre (STAR-C) at Chinhoyi University of Technology.\n\nThe initiative seeks to build capacity for solar energy deployment, research, development and innovation, boosting the countrys renewable energy sector.\n\nSpeaking at the just-ended sixth International Renewable Energy Conference and Expo, Energy and Power Development Minister July Moyo said: We are convinced that the future is here, because of the technology we have. We want to partner our universities, and this week, the Cabinet approved a project to partner with Chinhoyi University of Technology on solar energy, covering all aspects of solar innovation, research, training and potentially manufacturing our own solar panels and exploring battery options, given our lithium resources. We believe the opportunities are now available for everyone to participate.\n\nTo drive the economy forward, Minister Moyo said the country should focus on investing in renewable energy.\n\nWhen we are thinking about these things, solar or renewable energy must be contextualised in our economy, and our economy right now has 17 sectors. The big ones are agriculture, the mining, industry, manufacturing. As stakeholders in renewable energy, we must also focus on these areas and identify opportunities within each one.\n\nThe minister said the use of firewood as an energy source should be a thing of the past, calling on the country to embrace clean energy.\n\nAnd were looking at clean cooking, and when considering clean cooking, we want to liberate ourselves and our women from the smoke produced by wet wood during the rainy season, which can be overwhelming. So, promoting clean cooking is also part of our goals.\n\nHe also urged property owners, businesses and homeowners generating solar energy to participate in net metering to bridge the energy gap.\n\nNet metering is a system that allows solar energy system owners to sell excess electricity, such as quite often happens in the middle of the day, to the national grid and get credit for it.\n\nThey only pay the balance between what they use and what they supply.\n\nThis two-way system allows for more efficient use of renewable energy resources, as households and businesses can both contribute to and benefit from the national grid.\n\nEnergy efficiency is no longer an optionit is a necessity, he added. It is one of the most cost-effective ways to expand energy access, reduce emissions, and support economic productivity across all sectors.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/10/Minister-July-Moyo.jpg",
            "description": "Herald Reporter Zimbabwe will soon start large-scale manufacturing of solar panels and lithium batteries as the Government moves to capacitate local universities to collaborate with international companies to bring expertise and  technology. This follows the approval of a Memorandum of Understanding with the International Solar Alliance (ISA) to establish a Solar Technology Application Resource Centre […]",
            "time": "06:40",
            "date": "14 Apr 2025"
        },
        {
            "title": "Uhuru Day preps almost complete",
            "url": "https://www.herald.co.zw/uhuru-day-preps-almost-complete/",
            "content": "Kuda Bwititi, Zimpapers Politics Hub\n\nPREPARATIONS for Zimbabwes main Independence Day celebrations, slated for Friday in Nembudziya, Gokwe, are in their final stages, with the Government promising an event meeting the highest standards and leaving a legacy of development for the local community.\n\nIn a departure from the four-decade tradition of hosting the national event in Harare, this year marks the fourth consecutive year the commemorations were decentralised, having been previously held in Bulawayo, Mt Darwin and Murambinda.\n\nThe move underscores the Governments commitment to devolution and inclusive development.\n\nIn an interview on Friday, Local Government and Public Works Minister Daniel Garwe confirmed that work at the main venue in Gokwe Nembudziya was progressing rapidly.\n\nPreparations at the main venue are at an advanced stage, he stated.\n\nKey infrastructure, including a new stadium is nearing completion.\n\nThe football pitch is 90 percent complete, with lawn maintenance underway. Ablution blocks are at 90 percent, while terraces and access roads are nearing completion.\n\nBeyond the main arena, significant infrastructure upgrades have been undertaken, designed to benefit the Gokwe North community long after the celebrations conclude.\n\nThese sustainable development projects include a new fully-equipped stadium capable of hosting Division One football matches.\n\nRenovations have been undertaken at the local district hospital, including the VIP ward and a new mortuary, while new boys and girls hostels have been constructed at Nyamuroro High School to accommodate visiting children.\n\nThere have also been extensive upgrades at Nembudziya High School, including new classroom blocks, renovated existing ones, new science labs and administration block improvements.\n\nEnhanced water supply has also been achieved through three new boreholes and water tanks, alongside secured electricity and backup generators.\n\nGokwe and surrounding areas have also seen road improvements managed by the Ministry of Transport and Infrastructural Development.\n\nLogistical arrangements are being streamlined, with 369 buses mobilised to transport attendees from across the country.\n\nThe celebrations commence on April 17th with the traditional Childrens Party at Nyamuroro High School, hosted by President Mnangagwa and First Lady Dr Auxillia Mnangagwa.\n\nOver 3 000 children are expected to attend the event, which features entertainment, educational activities, and a luncheon. New hostels have been constructed at the school specifically for this event.\n\nAn Independence Gala is scheduled for the eve of the 18th at Nembudziya Government High School.\n\nThe main event on April 18th will be held at the Nembudziya Growth Point Open Ground Venue, highlighted by President Mnangagwas address.\n\nFollowing the official proceedings, a football match between Simba Bhora and FC Platinum will entertain the crowds.\n\nMinister Garwe emphasised the positive reception from the Gokwe North community.\n\nThe response has been overwhelmingly positive. Residents have taken pride in hosting a national event, he said.\n\nHe highlighted the long-term benefits, including the new infrastructure and employment opportunities created during the preparation phase, noting that local businesses were engaged for sourcing materials, aligning with the No One and No Place must be left behind mantra.\n\nProvincial commemorations will also occur nationwide, coordinated by Provincial Ministers and District Development Coordinators.\n\nReflecting on Zimbabwes journey since independence, Minister Garwe said: This years celebrations are a reminder of our shared heritage and the ongoing transformation of our nation.\n\nThrough decentralisation, infrastructure development, and community empowerment, we are building a Zimbabwe that leaves no one and no place behind.\n\nSpeaking at the official launch of the lighting of the Independence Flame by Vice President Dr Constantino Chiwenga last Thursday, Midlands Minister of State for Provincial Affairs and Devolution Owen Ncube said:\n\nHosting the independence commemorations has brought enormous attendant developments. Renovations and resuscitation of our Heritage Sites, which include Whawha, Connemara Prisons, Sikombela, and Mtapa Hall, are underway, with major projects that include a stadium, boreholes, schools, communication, and road infrastructure works at various levels of completion in Nembudziya.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/roads-rehab.jpg",
            "description": "Kuda Bwititi, Zimpapers Politics Hub PREPARATIONS for Zimbabwe’s main Independence Day celebrations, slated for Friday in Nembudziya, Gokwe, are in their final stages, with the Government promising an event meeting the “highest standards” and leaving a legacy of development for the local community. In a departure from the four-decade tradition of hosting the national event […]",
            "time": "06:40",
            "date": "14 Apr 2025"
        },
        {
            "title": "Cookout competitions stir hope, inclusion in Manicaland",
            "url": "https://www.herald.co.zw/cookout-competitions-stir-hope-inclusion-in-manicaland/",
            "content": "Tendai Gukutikwa, Mutare Bureau\n\nIn a colourful celebration of Zimbabwean culture and culinary heritage, the Manicaland Provincial Amais Cook-Out Competition held on Friday stood out for its inclusivity, with 10 People with Disabilities (PWDs) taking part.\n\nManicaland is the seventh province to hold its provincial cookout competitions this year, with only three provinces left to host theirs before the national finals slated for Matabeleland South on May 25.\n\nOut of the 50 people who participated, 10 were PWDs.\n\nOfficiating at the event at Mutare Teachers College, Tourism and Hospitality Industry Minister Barbra Rwodzi, who was representing First Lady Dr Auxillia Mnangagwa commended the inclusion of PWDs in the competitions, describing it as a true reflection of the national vision to leave no one and no place behind.\n\nThis years edition is breaking barriers by embracing participants from all walks of life, sending a powerful message of equality, empowerment and national unity through food thus the 10 participants that we had here who are PWDs.\n\nIt is heartening to witness people with disabilities confidently showcasing their culinary talents today, she said. This competition has become more than just about food, it is a platform of empowerment and social inclusion. The First Ladys vision of using gastronomy tourism to unite, uplift and celebrate Zimbabweans is clearly bearing fruit.\n\nMinister Rwodzi praised the First Lady for pioneering the cook-out initiative, which she described as a grassroots revolution in tourism development.\n\nSome of the dishes that were prepared at the cookout competition\n\nShe highlighted how traditional Zimbabwean cuisine is now firmly at the centre of tourism growth strategies.\n\nGastronomy tourism is fast becoming a powerful vehicle in Zimbabwes journey towards the realisation of Vision 2030, which seeks to transform the country into an upper-middle-income economy, she said.\n\nBy celebrating and commercialising traditional cuisine, the country is not only preserving its cultural heritage, but also unlocking new economic opportunities in rural communities through value addition, food entrepreneurship, and culinary tourism.\n\nAs highlighted today, showcasing indigenous dishes plays a pivotal role in boosting local economies, empowering marginalised groups, and attracting both domestic and international tourists, all key pillars in achieving inclusive and sustainable national development.\n\nShe also said innovations in food processing, such as baobab juice, banana flour, and tomato jam that were showcased, demonstrated how gastronomy tourism can empower communities and drive economic growth through value addition.\n\nUsing the heritage-based strategy, our tourism is going higher and higher and this can be evidenced by how the United Nations will be building the first Gastronomy Tourism School in Africa in Victoria Falls, in honour of the First Ladys trailblazing efforts, she said.\n\nThe competition was divided into the communities, persons with disabilities, students and professional chefs categories with two winners from each category set to proceed to the national level.\n\nIn an interview, Manicaland Provincial Affairs and Devolution Minister Advocate Misheck Mugadza said the province fully embraced the spirit of inclusivity that the competitions embodied.\n\nAs Manicaland Province, we are fully appreciative of the drive towards inclusivity that this competition has achieved, particularly in 2025, he said.\n\nTo this end, it is commendable that people with disabilities were included in this years edition. Indeed, disability is not inability. We have today witnessed 10 men and women defying all odds by participating in the competition.\n\nMinister Mugadza added that the move was in line with the recently launched Action Plan for the National Disability Policy, which aims to ensure full participation of PWDs in national development.\n\nHe also noted how the participation of tertiary students was equally encouraging as it allowed for the passing on of indigenous knowledge systems to younger generations.\n\nOn display at the competition were traditional delicacies such as magogoya (yams), madhumbe (yams) and musoni (dried vegetables), which continue to gain popularity among health-conscious Zimbabweans.\n\nAs the cook-out competitions progress towards the national stage, the Manicaland edition has set a strong precedent in celebrating culinary excellence while championing inclusivity.\n\nIt has proven that traditional food is not just a meal, it is a bridge that connects communities, generations and aspirations, all simmering together in the national pot, said Minister Mugadza.\n\nIn an interview, one of the winners from the PWDs category, Mrs Varaidzo Chigidi from Buhera, said she was overjoyed to be recognised for her skills and appreciated the opportunity to represent others living with disabilities.\n\nBeing part of this competition has shown me that we are not forgotten. I felt seen, heard, and respected, she said.\n\nCooking is my passion, and today I proved that disability does not mean inability. I hope my story inspires other women with disabilities in the rural areas to rise up and showcase their talents too.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/CO1.jpg",
            "description": "Tendai Gukutikwa, Mutare Bureau In a colourful celebration of Zimbabwean culture and culinary heritage, the Manicaland Provincial Amai’s Cook-Out Competition held on Friday stood out for its inclusivity, with 10 People with Disabilities (PWDs) taking part. Manicaland is the seventh province to hold its provincial cookout competitions this year, with only three provinces left to […]",
            "time": "06:40",
            "date": "14 Apr 2025"
        },
        {
            "title": "20 686ha gazetted for agric joint ventures",
            "url": "https://www.herald.co.zw/20-686ha-gazetted-for-agric-joint-ventures/",
            "content": "Precious Manomano, Herald Correspondent\n\nThe Government has gazetted 20 686 hectares of irrigable land for joint ventures under Statutory Instrument 38 of 2021, targeting areas with existing irrigation infrastructure in a move aimed at increasing agricultural productivity.\n\nDuring a recent Agricultural Portfolio Committee meeting in Parliament, Lands, Agriculture, Fisheries, Water and Rural Development Permanent Secretary Professor Obert Jiri shared detailed statistics regarding the distribution of gazetted land.\n\nThe land distribution includes 1 628 hectares in Manicaland, 9 383,5ha in Mashonaland Central, 5 600ha in Mashonaland East, 1 437,5ha in Mashonaland West, 378,5ha in Masvingo, 306ha in Matabeleland North, 887ha in Matabeleland South, and 1 066ha in Midlands.\n\nHowever, challenges persist, with only 18 percent of farmers having paid their water bills, leaving the Zimbabwe National Water Authority (ZINWA) stranded.\n\nOnly 18 percent of farmers have managed to settle their obligations. ZINWA is still owed a total of US$610 000 by farmers under the Stop Order Facility as well as US$1,3 million by farmers under the self-financing model, he said.\n\nAdditionally, he highlighted the damaging impact of irrigation infrastructure vandalism on sustainable water supply for farming, indicating the urgent need for cooperative efforts. The Government is also planning to create greenbelts for year-round cropping, with initiatives to open up 50 000ha of new irrigated land along the Tugwi, Runde, and Mwenezi rivers, leveraging the Tugwi Mukosi Dam, Manyuchi Dam, and the proposed Runde Tende Dam.\n\nFurthermore, there are targets to revitalise over 2 500ha of irrigated land at Middle Save and to establish 10 000ha of new irrigated land in Kanyemba, as well as 15 000ha in Binga, utilising the Zambezi River.\n\nIn response to land scarcity, the Government has approved 2 701 land joint ventures covering 234 432ha, aiming to improve productivity and encourage rural industrialisation.\n\nThe Government is also addressing the waiting list issue, which includes 10 000 diasporans and 270 000 locals seeking land.\n\nThe initiative promotes a corporate farming model, inviting those interested in agriculture to participate. Prof Jiri noted that many former dormant farms are now becoming productive as joint venture partnerships show promising results. To facilitate these partnerships, the Government has implemented legal frameworks to protect the rights of all parties involved.\n\nIt is essential that we create an environment where those with land and those with capital can come together, ensuring that all Zimbabweans benefit from our rich agricultural heritage, he asserted.\n\nHe also encouraged landowners to engage with Agritex offices for assistance in finding suitable partners.\n\nLands, Agriculture, Fisheries, Water and Rural Development Minister Dr Anxious Masuka also reinforced the significance of joint ventures as platforms for skill transfer and rural industrialisation.\n\nThese joint venture facilities are practical solutions that we are imploring to enhance partnerships in farming businesses that guarantee productivity, he stated.\n\nHe acknowledged the high demand for land and urged prospective farmers to pursue joint ventures, emphasising that strategic arrangements can optimise land use and productivity.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/04/Professor-Obert-Jiri.jpg",
            "description": "Precious Manomano, Herald Correspondent The Government has gazetted 20 686 hectares of irrigable land for joint ventures under Statutory Instrument 38 of 2021, targeting areas with existing irrigation infrastructure in a move aimed at increasing agricultural productivity. During a recent Agricultural Portfolio Committee meeting in Parliament, Lands, Agriculture, Fisheries, Water and Rural Development Permanent Secretary […]",
            "time": "06:40",
            "date": "14 Apr 2025"
        },
        {
            "title": "EDITORIAL COMMENT: We must build on success of the summer season",
            "url": "https://www.herald.co.zw/editorial-comment-we-must-build-on-success-of-the-summer-season/",
            "content": "Despite what amounted to a short growing season in almost all parts of Zimbabwe, the national maize crop harvest will be close to two million tonnes, more than enough to meet the 1,8 million tonnes needed to be milled into mealie meal.\n\nAfter some reasonable falls in November last year that at least dampened the ground, there was then that long dry spell between mid-November and late December, followed by good rains in most areas between shortly before Christmas and the beginning of this month, with the odd showers since.\n\nUnlike the very damaging dry spell of similar length in the 2021-2022 season in the middle of the season, that caused harvests to be seriously reduced, this seasons dry spell at the beginning of the season at least allowed farmers to cope, even if many had to plant later than they hoped. So we have a reasonable harvest.\n\nInterestingly, the farming experts have noted that along with the irrigated, or partially irrigated, crop the conservation farming techniques demanded by the Pfumvudza/Intwasa programme also coped well with the rainfall patterns we saw.\n\nHaving good water retention from the early rains, and then keeping moisture in the soil through mulching, while making sure that later rains soaked in instead of running off worked.\n\nThis was important since the southern parts of Zimbabwe had rains that were above average by the standards of those more arid areas, the northern parts were a little below normal, especially in the breadbasket province of Mashonaland West.\n\nWhile this was nothing like the drought of last year, it still affected yields. Estimates of the expected harvest from traditional grains have yet to be made, but considering the total rainfall they are likely to be good.\n\nThe huge advantage of our indigenous sorghum and finger millets is that they cannot only cope with lower rainfall, but also with more intermittent rainfall, their growth being halted in dry spells and then resuming when more rain falls.\n\nLast years drought meant those extra rains never fell.\n\nAdded to the maize and traditional indigenous grains, there will be a good harvest of irrigated winter wheat, the dam levels in almost all of Zimbabwe rising during this season to above what was there to irrigate last years record wheat crop.\n\nThe upshot is that in terms of total grain harvests, those of maize, traditional grains and wheat combined, means that Zimbabwe will produce a reasonable surplus this year, but that there will be need to juggle between what is needed by people for their food, what is wanted by people, what is needed to stock feeds and what can be placed in reserve.\n\nClimate change has produced many new variables, as can be seen with the season now ending that was generally regarded as a good season, despite the truncated growing period for the dry-land crops.\n\nIt is becoming increasingly necessary for irrigation to be built up to provide supplementary irrigation in the summer season and full irrigation for the winter crops and the horticulture for much of the year.\n\nFarmers with supplementary irrigation were able to get their maize crop in earlier, cope with the dry spell, and then use rainfall, with just the odd sprinkle from the irrigation during the dry weeks to get a very good crop indeed that will show a profit despite the irrigation water and power costs.\n\nEven in a drought year, farmers using supplementary irrigation will still get more than half their water from the free rainfall.\n\nThis means that as we expand irrigation into the small-scale farming sectors we need to build in flexibility, rather than just commit all irrigation to fixed plots in irrigation schemes.\n\nIt should be possible to have both the partial supplementary irrigation over a far larger area in the summer season, before moving to the full irrigation over a small area for wheat and horticulture.\n\nIt is also becoming obvious that we need to encourage Zimbabweans to adopt far more varied diets when it comes to eating grains, rather than just have almost all meals built on a core of ground white maize.\n\nUntil a little over a century ago traditional grains were the staple diet and maize was largely eaten as a green roasted vegetable at the end of the rainy season.\n\nThe major shift was partly because of the then need for double processing of traditional grains, partly because of initial research to increase maize yields and partly with the fast growing market for maize.\n\nA lot of the best tasting varieties of traditional grains were lost during a drive to improve yields, and it seems worthwhile to recover some of these.\n\nWheat was almost always an urban food, eaten as baked bread with some cake, and totally imported until the late 1960s with growing harvests to our present surpluses over the last three seasons.\n\nWith the sort of harvests we can now expect in what we can think of as ordinary years, measured against what we call the good year we have just seen, it is clear that a far more diversified farming environment and far more varied diet will be required. The expansion in village horticulture as a benefit of the borehole programme means new varieties of vegetables can be introduced.\n\nThat includes a lot more imagination in how we prepare stock feeds where more hay and lucerne seem to be required along with a better mixture of grains.\n\nIt is likely that we will need better fed animals rather than trying to dramatically expand the number of livestock.\n\nIt is the same in oil seeds and cash crops, where we need to make sure we have a good mixture of crops instead of relying on far too small a group that can be hit by drought or flood.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/10/Pfumvudza-1.jpg",
            "description": "Despite what amounted to a short growing season in almost all parts of Zimbabwe, the national maize crop harvest will be close to two million tonnes, more than enough to meet the 1,8 million tonnes needed to be milled into mealie meal. After some reasonable falls in November last year that at least dampened the […]",
            "time": "06:40",
            "date": "14 Apr 2025"
        },
        {
            "title": "Rapist teenager jailed 90 years",
            "url": "https://www.herald.co.zw/rapist-teenager-jailed-90-years/",
            "content": "Herald Reporter\n\nA GOKWE teenager has been jailed for 90 years after he was convicted of raping his employers three children, aged two, six, and seven years, on several occasions after luring them with snacks.\n\nMarkwell Machena (18) of Machena Village under Chief Nekamwe was initially jailed for 90 years when he appeared before Gokwe Regional Magistrate Mr Stanford Mambanje, charged with six counts of rape.\n\nHe had 45 years of his jail term suspended conditionally, leaving him to serve the remaining 45 years behind bars.\n\nThe State, led by Fatuma Tekera, stated that Machena was employed as a helper by the mother of the three children.\n\nThe court heard that Machena was left in the custody of the three minors between March 28 and 30 while their mother was away. He then lured the girls with snacks into his bedroom, where he would tie their legs and hands with ropes and rape them one after the other.\n\nThe matter came to light when their mother found them naked in Machenas bedroom minutes after he had left the room.\n\nOn being quizzed, the girls revealed that they had been raped. She took the matter to the police, leading to Machenas arrest.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/12/court-hammer.jpg",
            "description": "Herald Reporter A GOKWE teenager has been jailed for 90 years after he was convicted of raping his employer’s three children, aged two, six, and seven years, on several occasions after luring them with snacks. Markwell Machena (18) of Machena Village under Chief Nekamwe was initially jailed for 90 years when he appeared before Gokwe […]",
            "time": "06:40",
            "date": "14 Apr 2025"
        },
        {
            "title": "Govt reaffirms commitment to protect industry",
            "url": "https://www.herald.co.zw/govt-reaffirms-commitment-to-protect-industry/",
            "content": "Judith Phiri\n\nBusiness Reporter\n\nTHE Ministry of Industry and Commerce has reaffirmed its commitment to continue developing policies that promote industrial development and improve consumer welfare, key to a more conducive environment for sustained business growth.\n\nThis development comes as the ministry is also implementing President Mnangagwas directive to enhance the ease of doing business to ensure competitiveness and drive sustainable economic growth.\n\nIn his keynote address at the Doing Business in Matabeleland breakfast meeting in Bulawayo on Thursday, Industry and Commerce Minister Mangaliso Ndlovu said that to protect the local industry, the country will no longer be a dumping site.\n\nWe are strengthening our reserve sectors. People will think we are being unfair to our foreign friends, but we aspire to see Zimbabweans creating employment for Zimbabweans. We aspire to see foreigners getting employment from Zimbabweans, he said.\n\nThe Government is resolutely committed to intensifying the fight against smuggling and business malpractices. This is done to protect our vital local industries, create a level playing field for fair competition and ensure consumer protection.\n\nHe said the taskforce on smuggling and business malpractices has registered significant progress across all provinces.\n\nAs of today, inspections stand at 1 907, prosecutions at 137, compliance notices at 247, and 3 987 units of products have been seized.\n\nThe minister said they have now witnessed improvements in sales and shelf occupancy of locally produced goods due to these efforts.\n\nHe added: Together, we can build a stronger, more resilient and ultimately more prosperous industrial and commercial sector for Zimbabwe, and specifically for this vital Matabeleland region.\n\nMinister Ndlovu said the launch of the Zimbabwe Industrial Reconstruction and Growth Plan (ZIRGP) for the period 2024 to 2025 came about to align the new iteration of the Industrial Development Policy with the upcoming National Development Strategy 2 (NDS2) (2026-2030).\n\nHe said the ZIRGP was premised on four pillars: commerce issues supporting industrialisation, measures to promote the growth of the manufacturing sector, implementation, monitoring and evaluation, as well as crafting the Zimbabwe National Industrial Development Policy 2 (ZNIDP) (2026-2030).\n\nIn terms of consumer protection, the minister said they were enforcing consumer protection legislation while also safeguarding against the detrimental effects of smuggled, counterfeit and substandard goods.\n\nMeanwhile, he called on local businesses in the Matabeleland region to take centre stage at the Zimbabwe International Trade Fair (ZITF) 2025 and lead in showcasing their products and services.\n\nThis years theme: Industrialisation: Crafting an Integrated Landscape underscores the critical role of industrialisation in driving Zimbabwes economic growth, showcasing the countrys economic potential, investment incentives and strategic location within SADC, COMESA and the African Continental Free Trade Area (AfCFTA), he said.\n\nZITF is a unique and powerful platform to showcase the remarkable strengths of Zimbabwes industrial capabilities. Government is fully dedicated to ensuring that this years edition is inclusive and impactful.\n\nIn a speech read on her behalf by Mrs Boetsoarelo Noko, Director of Provincial Coordination in the office of the Minister of State for Bulawayo Provincial Affairs and Devolution, Cde Judith Ncube said the citys re-industrialisation focus was gathering momentum in line with Vision 2030.\n\nShe said the event came at a time when the city was preparing for the ZITF 2025, calling for all sectors full participation as the trade fair will showcase Zimbabwes economic potential and attract international exhibitors and investors.\n\nThe event was hosted by CZI in partnership with the Ministry of Industry and Commerce and the Zimbabwe National Chamber of Commerce (ZNCC).\n\nThe cross-sector conversation aimed to highlight industrial growth in Matabeleland, while serving as a public-private engagement on regional industrial development focused on leather, textile, steel and fast-moving consumer goods (FMCG).\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Untitled-1-3-680x380.jpg",
            "description": "THE Ministry of Industry and Commerce has reaffirmed its commitment to continue developing policies that promote industrial development and improve consumer welfare, key to a more conducive environment for sustained business growth.",
            "time": "06:40",
            "date": "14 Apr 2025"
        },
        {
            "title": "Health sector brings  Vision 2030 within reach",
            "url": "https://www.herald.co.zw/health-sector-brings-vision-2030-within-reach/",
            "content": "Rumbidzayi Zinyuke, Senior Health Reporter\n\nAs Zimbabwe celebrates 45 years of Independence under the theme Zim@45: Devolve and Develop Together Towards Vision 2030, the health sector stands as an example of what devolution can achieve when policy meets purpose.\n\nLeaving no place and no one behind is more than a policy statement.\n\nIt is a vision rooted in history.\n\nFrom the foundations laid in 1980, when the country attained independence to todays health system, the Government, through the Ministry of Health and Child Care, has been steadily reshaping healthcare delivery, taking services closer to the people and leaving no district behind.\n\nThe journey towards these milestones began in 1980, in the aftermath of the liberation war, when the health landscape was marked by gross inequalities between urban and rural populations.\n\nToday, with the shift towards devolution, communities that were once far from quality healthcare are now being drawn into the national vision for a healthier, more equitable future.\n\nDevolution is enshrined in the 2013 Constitution, but its implementation began in earnest with the coming in of the Second Republic under President Mnangagwa as part of efforts to enhance infrastructure development in line with Vision 2030, which seeks to create an upper-middle-income economy.\n\nAccording to Health and Child Care Secretary Dr Aspect Maunganidze, this years Independence theme isnt just timely, it is symbolic of the Ministrys core agenda.\n\nZim@45: Devolve and Develop Together Towards Vision 2030 is a good theme that we need to carry forward as the Ministry of Health and Child Care on the foundations that have been laid over the last 45 years since independence.\n\nOur health system has developed in leaps and bounds. We have been devolving and developing with all our structures in the country, leaving no place behind, he said.\n\nWhat began in the early 80s as a mission to expand primary healthcare to underserved rural areas has now morphed into a full-scale devolution programme, with governance, training, infrastructure, medicine supply, and even emergency care now decentralised to meet local needs more effectively.\n\nDr Maunganidze said devolution, in its purest sense, starts with strengthened health systems across the board.\n\nOver the years, he said, the ministry had entrenched governance structures across the countrys 10 provinces and their districts.\n\nWe have got our provinces, which have a provincial health executive headed by provincial medical directors who run with devolved health service delivery strategies, he said.\n\nThis continues down to district health executives, who are empowered in procurement, infrastructure, and human resource management which has been done to make sure that it all speaks to the needs of each district, each province.\n\nHuman resource development: Training for communities, by communities\n\nThis empowerment has been matched with training and mentorship programmes, done in collaboration with the Health Services Commission, to ensure that both provincial and district leaders are equipped not only administratively, but also strategically.\n\nHuman capital remains the heartbeat of any health system. Recognising this, the Ministry has localised the recruitment and training of nurses, giving priority to district and provincial candidates.\n\nRecognising this, Dr Maunganidze said, each school of nursing is now recruiting with a special focus on the district and province it is in.\n\nThis has ensured that health workers are trained close to home, and when they graduate, they can also serve those same communities.\n\nThe revival of the Primary Care Nurse training programme also underscores this focus on local communities as it mandates deployment to underserved areas, bridging the urban-rural gap in professional coverage.\n\nSpecialist services, which were once the preserve of urban hospitals, have also been decentralised. From Gweru to Mutare, specialist doctors in surgery, medicine, and paediatrics are increasingly being deployed at provincial level.\n\nWe want to continue devolving to the districts, so that all the major specialist areas are available on the ground, said Dr Maunganidze.\n\nInfrastructure that reflects need, not geography\n\nInfrastructure investment has been one of the most visible markers of devolution. The ministry has made it a point to prioritise areas with the greatest need, often in remote rural districts.\n\nUnder the NMS programme, new hospitals and clinics are being constructed in the grassroots and being equipped.\n\nWhile Stoneridge and Cowdray Park hospitals have already been commissioned, the Government is set to commission Mataga Hospital in Mberengwa and ground has already been broken in Manhize (Chivhu) for another hospital.\n\nThe same is set to happen in Paradza, Rudhanda in Zaka as well as in Bulilima districts. To ensure all health facilities are not affected by power shortages are able to continue providing services, over 1 000 clinics have been solarised and the Ministry is now upgrading from gel to lithium batteries for even greater sustainability.\n\nThe Last Mile: Medicines, technology and accountability\n\nOne of the less visible, but critical successes of devolution is in the medical supply chain.\n\nThe Ministry of Health has adopted the last mile delivery model for medicines and commodities, ensuring that even the most remote clinics are stocked with essential drugs.\n\nTo cut down on drug shortages, wastage and pilferage, Dr Maunganidze said the Ministry was rolling out an electronic logistics management information system (eLMIS), replacing a paper-based system riddled with inefficiencies.\n\nWe had nightmares with physical requisitions with increased losses. The new system will ensure accountability of every drug in the pipeline, he added.\n\nRadiotherapy services are being expanded too, with new machines being procured for Parirenyatwa and Mpilo Hospitals.\n\nFunctional older equipment as well as new machines expected to be purchased soon will be redistributed to other provinces like Gweru and Mutare, ensuring more equitable access to cancer treatment.\n\nEmergency response: Taking action where it happens\n\nEmergency and disaster response is no longer coordinated solely from Harare. Through devolution, the Ministry of Health has set up provincial Public Health Emergency Operating Centres (PHEOCs) in Midlands, Mashonaland Central, and Manicaland  ensuring real-time response to outbreaks like cholera, typhoid or mpox and other emerging diseases.\n\nWe are expanding on emergency response and we have devolved this aspect. Initially we had a national public health emergency operating centre, but we have gone on to decentralise and commission these in Midlands, Masvingo and Manicaland, he said.\n\nWe want all the provinces to have these PHEOCs which will then coordinate the response. You must realise that our systems have remained robust in the public health area. Our surveillance system and ability to detect diseases and prevent them from coming into the country has enabled us to make Zimbabwe safe when we report diseases that affect our region.\n\nIn particular, Mpox, Marburg and even Ebola have not affected our countries because of the robust surveillance system which we have devolved to all the port health centres.\n\nAlso being decentralised is trauma and emergency care, as the Ministry is now building trauma centres along highways such as Harare-Masvingo and Harare-Chirundu roads where the highest number of road accidents are reported. Air ambulance services are also being expanded to cover more areas.\n\nToward 2030: Cementing the legacy\n\nWith less than five years to go before the countrys Vision 2030 deadline, the Ministry of Health is focused on consolidating gains and completing the devolution journey.\n\nAll the progress weve made since 1980, we now want to solidify and cement it as we go towards 2030. We believe that the Ministry of Health is on the right trajectory to achieve this, he said.\n\nThe spirit of devolving and developing together goes beyond being just a theme, it serves as a guiding roadmap, particularly in the health sector, where it has actively transformed lives and shaped a more inclusive, responsive system of care.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/11/Dr-Aspect-Maunganidze.jpg",
            "description": "Rumbidzayi Zinyuke, Senior Health Reporter As Zimbabwe celebrates 45 years of Independence under the theme “Zim@45: Devolve and Develop Together Towards Vision 2030,” the health sector stands as an example of what devolution can achieve when policy meets purpose. “Leaving no place and no one behind” is more than a policy statement. It is a […]",
            "time": "06:40",
            "date": "14 Apr 2025"
        }
    ]
}