{
    "news": [
        {
            "title": "Legacy TV honours VP Mohadi with Indunamatshe Leadership Excellence Award",
            "url": "https://www.herald.co.zw/legacy-tv-honours-vp-mohadi-with-indunamatshe-leadership-excellence-award/",
            "content": "Blessings Chidakwa\n\nHerald Reporter\n\nVice President Kembo Mohadi has been honoured with the prestigious Indunamatshe Leadership Excellence Award in recognition of his unwavering loyalty to the countrys liberation efforts, leadership acumen, and contributions to the agricultural sector.\n\nThe organisation honoured VP Mohadi at his offices in Harare.\n\nLegacy TV executive director Pardon Mangwende said the accolade is a testament to Vice President Mohadis enduring commitment to Zimbabwes development.\n\nVice President Mohadi has played a pivotal role in shaping the nations trajectory through his dedication to liberation efforts, his strong leadership skills, and his significant contributions to agriculture.\n\nThis award is a symbol of appreciation for his service to the country, he said.\n\nLegacy TV has also honoured President Mnangagwa with the Mutapa Leadership Excellence Award for his role in steering Zimbabwes economic and political landscape.\n\nVice President Dr Constantino Chiwenga was also honoured with the Chaminuka Leadership Excellency Award, recognising his contributions to governance and national development.\n\nLegacy TVs awards highlight the achievements of leaders who have played a fundamental role in Zimbabwes progress across various sectors.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/2507fcd6-6ae5-4b20-a4e9-2c809b55a349-680x380.jpg",
            "description": "Vice President Kembo Mohadi has been honoured with the prestigious Indunamatshe Leadership Excellence Award in recognition of his unwavering loyalty to the country’s liberation efforts, leadership acumen, and contributions to the agricultural sector.",
            "time": "18:37",
            "date": "25 Mar 2025"
        },
        {
            "title": "Nees tweaks Warriors squad",
            "url": "https://www.herald.co.zw/nees-tweak-warriors-squad/",
            "content": "Michael Nees knows just as well that the nation is awaiting a positive result from Nigeria.\n\nHe knows Zimbabwes slim chances of reaching the 2026 World Cup hinges on winning the showdown against Nigeria at the Godswill Akpabio Stadium in Uyo.\n\nAnd he has made a single change to the squad that started the 2-2 draw against Benin last Thursday.\n\nBarring any late alterations to his plans, Nees seems to have patched up Prince Dubes place with Walter Musona with the former set to start on the bench.\n\nWarriors Probable 11\n\nWashington Arubi, Emmanuel Jalai, Divine Lunga, Munashe Garananga, Gerald Takwara, Marshal Munetsi, Andy Rinomhota, Jordan Zemura, Khama Billiat, Knowledge Musona, Walter Musona\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Warriors-680x380.jpg",
            "description": "Michael Nees knows just as well that the nation is awaiting a positive result from Nigeria. He knows Zimbabwe’s slim chances of reaching the 2026 World Cup hinges on winning the showdown against Nigeria at the Godswill Akpabio Stadium in Uyo. And he has made a single change to the squad that started the 2-2 […]",
            "time": "18:37",
            "date": "25 Mar 2025"
        },
        {
            "title": "Gokwe school closes due to spiritual attack scare",
            "url": "https://www.herald.co.zw/gokwe-school-closes-due-to-spiritual-attack-scare/",
            "content": "Blessings Chidakwa-Herald Reporter\n\nZhomba High School in Gokwe has been temporarily shut down as students are under a suspected spiritual attack.\n\nGokwe North District Development Coordinator, Mr Martin Musakanda, said authorities are on their way to assess the situation.\n\nSchool head Mr Washington Chikunichawa said the disturbances began on Monday with one affected learner, adding that as of now, eight students have been affected.\n\nI directed learners to go home due to their bizarre behaviour. The district leadership, including chiefs, is meeting today to decide the way forward, he said.\n\nGokwe-Kabuyuni legislator, Cde Spencer Tshuma, said the school has a history of mysterious occurrences.\n\nLast year, a whirlwind swept away an exam answer sheet, which was later found 500 meters away from the classroom.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Zhomba-School2-680x380.jpg",
            "description": "Blessings Chidakwa-Herald Reporter Zhomba High School in Gokwe has been temporarily shut down as students are under a suspected spiritual attack. Gokwe North District Development Coordinator, Mr Martin Musakanda, said authorities are on their way to assess the situation. School head Mr Washington Chikunichawa said the disturbances began on Monday with one affected learner, adding […]",
            "time": "18:37",
            "date": "25 Mar 2025"
        },
        {
            "title": "SA faces points deduction, lifeline for Zim?",
            "url": "https://www.herald.co.zw/sa-faces-points-deduction-lifeline-for-zim/",
            "content": "Sports Reporter\n\nZIMBABWE could get a lifeline in the 2026 World Cup Qualifiers if South Africa is sanctioned for allegedly using a player supposed to have been on suspension.\n\nMamelodi Sundowns Teboho Mokoena had accumulated two yellow cards in the build-up to the Lesotho 2-0 win.\n\nHowever, there is a technicality that the issue was not reported during the stipulated window for protests.\n\nThat win over Lesotho took South Africa to the top of Group C with 10 points, seven ahead of bottom-placed Zimbabwe.\n\nIf Zimbabwe can win against Nigeria today while South Africa gets points deducted, the Warriors, at six points, will be firmly back in the race.\n\nManaging player suspensions falls under the responsibility of the team manager.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Group-C-log-680x380.jpg",
            "description": "Sports Reporter ZIMBABWE could get a lifeline in the 2026 World Cup Qualifiers if South Africa is sanctioned for allegedly using a player supposed to have been on suspension. Mamelodi Sundowns Teboho Mokoena had accumulated two yellow cards in the build-up to the Lesotho 2-0 win. However, there is a technicality that the issue was […]",
            "time": "18:37",
            "date": "25 Mar 2025"
        },
        {
            "title": "Samsung co-CEO dies",
            "url": "https://www.herald.co.zw/samsung-co-ceo-dies/",
            "content": "Samsung Electronics co-CEO Han Jong-Hee died from cardiac arrest today, a spokesperson for the South Korean tech giant has said.\n\nHan was 63.\n\nBorn in 1962, Han was named Samsung Electronics vice chairman and CEO in 2022.\n\nHans co-CEO, Jun Young-Hyun, was appointed to the position last week.\n\nThe spokesperson told CNN that Jun will be the companys sole CEO after Hans death.\n\nIn an internal message seen by CNN, Samsung paid tribute to Han, saying he had dedicated more than 37 years of his life to leading Samsungs TV business.  CNN\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Han-Jong-Hee-680x380.jpg",
            "description": "Samsung Electronics co-CEO Han Jong-Hee died from cardiac arrest today, a spokesperson for the South Korean tech giant has said. Han was 63. Born in 1962, Han was named Samsung Electronics vice chairman and CEO in 2022. Han’s co-CEO, Jun Young-Hyun, was appointed to the position last week. The spokesperson told CNN that Jun will […]",
            "time": "18:37",
            "date": "25 Mar 2025"
        },
        {
            "title": "Flight turns around after pilot forgets passport",
            "url": "https://www.herald.co.zw/flight-turns-around-after-pilot-forgets-passport/",
            "content": "A United Airlines Boeing 787 jetliner flying from Los Angeles to Shanghai had to turn around last weekend after it was discovered that one of the pilots had forgotten his passport.\n\nFlight UA 198 departed LAX at around 2 pm on March 22, bound for Chinas largest city.\n\nAbout two hours later, the plane turned around and was redirected to San Francisco, where it landed around 5 pm.\n\nThe pilot did not have their passport onboard, United said in the statement. We arranged for a new crew to take our customers to their destination that evening.\n\nThe flight with the new crew took off around 9 pm and landed in Shanghai about six hours behind schedule.\n\nYang Shuhan, a Chinese passenger on board, told CNN that she heard the pilots very frustrated voice over the intercom, saying he forgot his passport.\n\nIts quite embarrassing, Shukor Yusof, founder of Singapore-based Endau Analytics, told CNN.\n\nHe added that the mistake is unacceptable for a global airline like United and it shows a lack of discipline.\n\nShukor noted that the absent-mindedness reflected in the incident could cost the airline dearly, taking into account the costs of things like the jet fuel they had to dump before diverting and compensation for the passengers.- CNN.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/United-plane2-680x380.jpg",
            "description": "A United Airlines Boeing 787 jetliner flying from Los Angeles to Shanghai had to turn around last weekend after it was discovered that one of the pilots had forgotten his passport. Flight UA 198 departed LAX at around 2 pm on March 22, bound for China’s largest city. About two hours later, the plane turned […]",
            "time": "18:37",
            "date": "25 Mar 2025"
        },
        {
            "title": "Warriors face Nigeria in high-stakes World Cup qualifier match: All you need to know",
            "url": "https://www.herald.co.zw/warriors-face-nigeria-in-high-stakes-world-cup-qualifier-match-all-you-need-to-know/",
            "content": "Fungai Muderere\n\nThe Warriors will play Nigeria this evening at the Godswill Akpabio Stadium on Matchday 6 of the 2026 FIFA World Cup Qualifiers Group C match.\n\nKick-off is at 6 pm.\n\nMedia coverage\n\nSuperSport TV on DStv has confirmed that it will show the game live.\n\nThe FIFA Plus App will also stream the game live, while heraldonline.co.zw will give you blow-by-blow updates of the game.\n\nZBC TV and SABC Sport are yet to confirm in their TV guide.\n\nMatch officials:\n\nEritrean officials will take charge.\n\nTeklu Mogos Tsegay will be the centre referee, while compatriots Michael Eyobel and Sirak Samuel Mengis will be the first and second assistants respectively.\n\nMohammed Osman, also from Eritrea, will be the fourth official.\n\nGhanaian Prosper Harrison Addo will be the commissioner while Paulin Ilboudo from Burkina Faso will serve as referees assessor.\n\nWhat the coaches said\n\nNigerias Eric Chelle: We need to be ready for this game. I prefer to focus on my team rather than discussing weaknesses. My priority is analysing and improving.\n\nWarriors Michael Nees: Nigeria is at the absolute top level. We cannot allow a slow start to the game to happen. We must be there from the beginning of our game. Our concentration must be there.\n\nTeam news:\n\nThere are no changes for both sides in their squads that played last week on Matchday 5 of the qualifiers.\n\nHowever, Bright Osayi-Samuel remains a doubt starter for the Super Eagles after suffering a leg injury in their match against Rwanda.\n\nForm guide\n\nNigeria heads into the match sitting on position four, with one win from five games.\n\nThe Super Eagles only victory in the qualifiers came last week against Rwanda, where Victor Osimhens brace secured the victory.\n\nZimbabwe is at the bottom of Group C, having failed to win any of their five matches so far.\n\nThey drew 2-2 against Benin last Thursday.\n\nHead to head\n\nNigeria have dominated the fixture for over four decades now.\n\nThe only time the Warriors defeated the Super Eagles was in an international friendly back in 1981.\n\nThe recent fixture, played in November 2023, ended in a 1-1 draw.\n\nFIFA world ranking:\n\nNigeria: 44\n\nZimbabwe: 121\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Warriors-squad-680x380.jpg",
            "description": "Fungai Muderere The Warriors will play Nigeria this evening at the Godswill Akpabio Stadium on Matchday 6 of the 2026 FIFA World Cup Qualifiers Group C match. Kick-off is at 6 pm. Media coverage SuperSport TV on DStv has confirmed that it will show the game live. The FIFA Plus App will also stream the […]",
            "time": "18:37",
            "date": "25 Mar 2025"
        },
        {
            "title": "Breaking: Zimbabwean arrested in connection with SA mass murder",
            "url": "https://www.herald.co.zw/breaking-zimbabwean-arrested-in-connection-with-sa-mass-murder/",
            "content": "South Africa Police Minister Senzo Mchunu announced the arrest of a Zimbabwean national in connection with the brutal murder of five community patrollers over the weekend in Soshanguve, Pretoria.\n\nMchunu, accompanied by his deputy, Cassel Mathale, Gauteng Premier Panyaza Lesufi, and Provincial Police Commissioner General Tommy Mthombeni, visited the area on Tuesday morning.\n\nThe man arrested is in the country illegally, Mchunu said.\n\nWe are still investigating how and when he entered South Africa, but it is confirmed that he is an undocumented foreigner.\n\nThe suspect was also found in possession of an unlicensed firearm, Mchunu added.\n\nSeveral others are being questioned about the mass murder.\n\nMchunu extended his condolences to the families of the victims.\n\nOn Saturday, four people were shot and partially burned during a confrontation between a community patroller and a group of individuals in Soshanguve.\n\nPolice arrived at 6am and found four bodies with gunshot wounds, while eight others were rushed to hospital, but one later died.\n\nPreliminary investigations indicate that around 3am, a group of patrollers encountered five individuals on the street, leading to the deadly altercation. The motive is still under investigation.\n\nOn Monday, IOL News reported that Lesufi revealed the recent murders of the five-night patrollers were suspected to be linked to extortion.\n\nIn the area, residents pay patrollers R50 for safety, another R50 for water, and R350 for electricity. A kingpin, believed to be in jail, is suspected of coordinating the operation.\n\nI have detailed information, including about people in prison who are still overseeing activities outside, Lesufi said. IOL News\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/South-Africa-Police-Minister-Senzo-Mchunu-680x380.jpg",
            "description": "South Africa Police Minister Senzo Mchunu announced the arrest of a Zimbabwean national in connection with the brutal murder of five community patrollers over the weekend in Soshanguve, Pretoria. Mchunu, accompanied by his deputy, Cassel Mathale, Gauteng Premier Panyaza Lesufi, and Provincial Police Commissioner General Tommy Mthombeni, visited the area on Tuesday morning. “The man […]",
            "time": "18:37",
            "date": "25 Mar 2025"
        },
        {
            "title": "God’s will at Godswill Akpabio as Warriors take on Nigeria’s Super Eagles",
            "url": "https://www.herald.co.zw/gods-will-at-godswill-akpabio-as-warriors-take-on-nigerias-super-eagles/",
            "content": "Rungano Gwanzura-Audiovisual Editor\n\nThe Godswill Akpabio International Stadium in Uyo, Nigeria, is indeed an impressive venue, and its history is a testament to Nigerias investment in sports infrastructure.\n\nThe stadium, which was built over two years at a cost of US$96 million, boasts top-notch facilities and can accommodate up to 30 000 spectators.\n\nFor Zimbabwean fans, watching their beloved Warriors play at such a state-of-the-art stadium must be a thrilling experience, especially considering the challenges faced in hosting international matches at home.\n\nThe fact that Zimbabwe has been playing home matches in South Africa and Zambia due to the unavailability of a suitable venue back home makes this encounter even more significant.\n\nAs the Warriors take on the Super Eagles this evening, the electric atmosphere at the Godswill Akpabio International Stadium will undoubtedly add to the excitement of the match.\n\nWith the stadiums impressive facilities and the Nigerian teams strong home record, the Warriors will need to be at the top of their game to secure a positive result.\n\nDespite the challenges, the Warriors are determined to make a statement, with players like Knowledge Musona expressing confidence in their ability to secure a win.\n\nWith the teams morale boosted by their recent 2-2 draw against Benin, they will be looking to build on that momentum and cause an upset against the Super Eagles.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Godswill-Akpabio-Stadium-680x380.jpg",
            "description": "Rungano Gwanzura-Audiovisual Editor The Godswill Akpabio International Stadium in Uyo, Nigeria, is indeed an impressive venue, and its history is a testament to Nigeria’s investment in sports infrastructure. The stadium, which was built over two years at a cost of US$96 million, boasts top-notch facilities and can accommodate up to 30 000 spectators. For Zimbabwean […]",
            "time": "18:37",
            "date": "25 Mar 2025"
        },
        {
            "title": "Transporters, 14 drug dealers arrested",
            "url": "https://www.herald.co.zw/transporters-14-drug-dealers-arrested/",
            "content": "Crime Reporter\n\nPolice have arrested three transporters and 14 drug dealers in Harare and Beitbridge, leading to the recovery of unregistered medicines and 175kg of mbanje.\n\nThe suspects were arrested on Monday and will appear in court soon.\n\nNational police spokesperson, Commissioner Paul Nyathi confirmed the arrests.\n\nOn March 24, 2025, police in Harare arrested three transporters and 11 drug barons for unlawful possession of unregistered medicines.\n\nSubsequently, 1 098 boxes of Broncleer cough syrup, Adco Saltapen cough syrup, Bernlin Codeine cough syrup, Astrapen and Stilpane were recovered, he said.\n\nIn Beitbridge, police arrested Sydney Ndlovu (39), Delight Ndlovu (37) and Diana Moyo for unlawful possession of 175 kilogrammes of mbanje.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Drug-dealers2-680x380.jpg",
            "description": "Crime Reporter Police have arrested three transporters and 14 drug dealers in Harare and Beitbridge, leading to the recovery of unregistered medicines and 175kg of mbanje. The suspects were arrested on Monday and will appear in court soon. National police spokesperson, Commissioner Paul Nyathi confirmed the arrests. “On March 24, 2025, police in Harare arrested […]",
            "time": "18:37",
            "date": "25 Mar 2025"
        }
    ]
}