{
    "news": [
        {
            "title": "Beitbridge’s Headman Mabidi dies",
            "url": "https://www.herald.co.zw/beitbridges-headman-mabidi-dies/",
            "content": "Thupeyo Muleya,\n\nBeitbridge Bureau\n\nBeitbridge has been plunged into mourning following the passing of Headman Mabidi (57), born Mina Mine Mbedzi, on Wednesday morning.\n\nHe died at United Bulawayo Hospitals, where he had been admitted following a short illness.\n\nThe late headman, among other things, was an environmentalist who fought hard to protect grazing lands, the bushes and the wanton cutting down of trees in Beitbridge West under Chief Tshitaudze area.\n\nDistrict Development Coordinator (DDC) Sikhangezile Mafu-Moyo said they had lost one of the hard-working traditional leaders.\n\nAt the same time, I want to express my heartfelt condolences to the community of Beitbridge and his relatives. This is a loss to all of us within Beitbridge, she said.\n\nMrs Mafu-Moyo said the late traditional leader was born on February 3 1968, in Beitbridge and was confirmed substantive headman in September 2019.\n\nChief Tshitaudze said: This is a blow to us as traditional leaders. He championed several community development projects around the district. He had a passion for development and the preservation of our tradition and culture as the Vha Venda people. We will greatly miss him.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/12/herald-newspapers1.jpg",
            "description": "Beitbridge has been plunged into mourning following the passing of Headman Mabidi (57), born Mina Mine Mbedzi, on Wednesday morning.",
            "time": "18:34",
            "date": "16 Apr 2025"
        },
        {
            "title": "Former MP accuses suspected land barons of trying to overturn High Court order",
            "url": "https://www.herald.co.zw/former-mp-accuses-suspected-land-barons-of-trying-to-overturn-high-court-order/",
            "content": "Prosper Dembedza\n\nHerald Correspondent\n\nFORMER Member of Parliament for Mount Pleasant, Jason Pasade, on Tuesday accused Eastwind Trust owners Rodgers Pote and Trymore Arineshito, who are facing charges of contempt of court and carrying out development on an illegal settlement without approval, of trying to force the lower court to overturn a High Court order to evict them.\n\nDuring cross-examination, Mr Pasade said the pair, through their defence, were trying to force the court to overturn a High Court ruling that evicted them.\n\nHe added that so far, the pair and their company had lost four cases of the same nature at the High Court.\n\nThe matter was deferred to May 13 for trial continuation.\n\nDuring the previous sitting, Mr Pasade told the court that the two were disowned by Harare City Councils director of Housing in an affidavit.\n\nHe said Arineshito and Pote were ordered by the High Court to vacate the premises, but they are not abiding by that order.\n\nMr Pasade produced an affidavit written by the citys Director of Housing, Mr Addmore Nhekairo, in which he said he never allocated them any land.\n\nHe said he knew the accused persons not only in connection with this case but also as land barons at Melfort Farm, Ruwa.\n\nMr Pasade said in 2020, his company entered into an agreement to develop land on behalf of the Freedom Fighters Development Trust.\n\nHe said his company started to carry out developments. Roads were opened while most developments were already at an advanced stage.\n\nHowever, the accused persons started illegally selling and allocating stands in the area. Mr Pasades company allegedly went to court and acquired a High Court order which gave it the authority to remove the illegally settled people.\n\nHowever, the accused persons did not vacate the stands, contrary to the court order. It is the States case that on November 2023, the High Court issued a provisional order against Eastwind Trust.\n\nAfter the order was granted, the accused were served by the Sheriff, but continued invading the area in violation of the order.\n\nThe complainant is Homegram Investments Limited, represented by Mr Pasade.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/court-1.jpg",
            "description": "FORMER Member of Parliament for Mount Pleasant, Jason Pasade, on Tuesday accused Eastwind Trust owners Rodgers Pote and Trymore Arineshito, who are facing charges of contempt of court and carrying out development on an illegal settlement without approval, of trying to force the lower court to overturn a High Court order to evict them.",
            "time": "18:34",
            "date": "16 Apr 2025"
        },
        {
            "title": "Shurugwi head squanders 77 candidates’ exam fees",
            "url": "https://www.herald.co.zw/shurugwi-head-squanders-77-candidates-exam-fees/",
            "content": "Midlands Bureau\n\nA headmaster at Dombojena Primary School in Shurugwi has been arrested for allegedly misappropriating over $1 700 in Zimsec examination fees.\n\nEmmanuel Hove (52) appeared before a Shurugwi magistrate, Ms Patricia Gwetsai, facing one count of fraud.\n\nHove was granted US$100 bail.\n\nHe was ordered not to interfere with State witnesses, to report at Shurugwi Police Station every Friday and to continue residing at his homestead under Chief Nhema.\n\nProsecutor Ms Kwanele Njini said Hove allegedly squandered the students examination fees amounting to US$1 745.\n\nThe court heard that the registration fees were for 77 candidates who want to sit for the November Zimsec examinations.\n\nSince Dombojena Primary School is not an examination centre, Hove was supposed to go and register the pupils at Railway Block Primary School, which is also in Shurugwi.\n\nThe alleged fraud was discovered when Dombojena deputy head Mr Kundai Pedzi visited Railway Primary School and discovered that the registration fees for the 77 pupils had not been processed.\n\nA report was made to the police, leading to Hoves arrest.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/06/exam-fees.jpeg",
            "description": "A headmaster at Dombojena Primary School in Shurugwi has been arrested for allegedly misappropriating over $1 700 in Zimsec examination fees.",
            "time": "18:34",
            "date": "16 Apr 2025"
        },
        {
            "title": "Harare Province gears up for Independence Day",
            "url": "https://www.herald.co.zw/harare-province-gears-up-for-independence-day/",
            "content": "Obey Musiwa\n\nHerald Reporter\n\nPreparations for the upcoming 45th Independence Day celebrations at Epworth High School in Harare are now almost complete, the Minister of State for Harare Metropolitan Provincial Affairs and Devolution, Senator Charles Tawengwa has said.\n\nSpeaking at the final rehearsals today, Minister Tawengwa said Harare will experience a celebration like never before.\n\nWe expect a full house, even an overflow, as everyone is excited about the festivities. There will be soccer, entertainment, music, traditional dances, and so much more happening here in Epworth, he said.\n\nThis years commemorations are themed Zim@45: Devolve and Develop Together Towards Vision 2030, which showcases the countrys progress and future development plans.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/09/charles-tavengwa.jpg",
            "description": "Preparations for the upcoming 45th Independence Day celebrations at Epworth High School in Harare are now almost complete, the Minister of State for Harare Metropolitan Provincial Affairs and Devolution, Senator Charles Tawengwa has said.",
            "time": "18:34",
            "date": "16 Apr 2025"
        },
        {
            "title": "Zim’s public, private sectors join hands for maximum benefits at Expo 2025 Osaka",
            "url": "https://www.herald.co.zw/zims-public-private-sectors-join-hands-for-maximum-benefits-at-expo-2025-osaka/",
            "content": "Hebert Zharare in OSAKA, Japan\n\nZimbabwe is leaving no stone unturned in its quest to ensure that both public and private sector players derive maximum value from the countrys participation at the Expo 2025 Osaka in Japan.\n\nIt has emerged that strategic links have already been forged here with key organisations to help pair key economic players with Zimbabwean organisations seeking partnerships.\n\nAccording to official reports, strategic partnerships and stakeholder engagement to strengthen Zimbabwes dialogue with the Japanese business community have been formed with the Embassy of Zimbabwe in Japan and relevant Japanese trade agencies such as JETRO to co-host business sessions and encourage participation from their networks.\n\nIt has also emerged that Zimbabwe will engage the diaspora business community in Japan to leverage existing business relationships and facilitate networking opportunities between Zimbabwean and Japanese enterprises on the sidelines of the Expo.\n\nZimbabwe will engage reputable Japanese consultancies with expertise in business matchmaking to identify and link Zimbabwean businesses with potential Japanese partners ahead of the business forums.\n\nThese consultancies will facilitate targeted outreach to Japanese industry associations, chambers of commerce and key sector players to secure their participation, reads the report.\n\nMr Allan Majuru, Zimbabwes Commissioner General to the Expo confirmed the development and said plans are being made to ensure that the country successfully hosts the business forum for the benefit of Zimbabwean businesses.\n\nWe are going to have a business forum on July 15, where we are going to be focusing on tourism, investment, and trade.\n\nOn the 16th of July, President Mnangagwa will come through. Some agreements will be signed to make sure that we are not just counting the numbers, but that we are also looking at the value that is going to come out, he Mr Majuru.\n\nWe have linked up with potential partners. When we were preparing for the Expo, it was more of a joint initiative with public and private sector players working together  the likes of CZI, ZNCC, ZIDA and Tourism Business Council, among others.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Majuru.jpg",
            "description": "Zimbabwe is leaving no stone unturned in its quest to ensure that both public and private sector players derive maximum value from the country’s participation at the Expo 2025 Osaka in Japan.",
            "time": "18:34",
            "date": "16 Apr 2025"
        },
        {
            "title": "Former ‘Isidingo’ star Don Mlangeni Nawa dies",
            "url": "https://www.herald.co.zw/former-isidingo-star-don-mlangeni-nawa-dies/",
            "content": "Legendary South African actor Don Mlangeni Nawa has died.His family confirmed the news in a statement.\n\nThe screen veteran has been one of the most recognisable faces on the small box for at least three decades.\n\nHe is famously known for portraying Zebedee Matabane on the former SABC 3 soapie Isidingo. He portrayed the role for 16 years.\n\nHe was the heart of our family  a loving father, brother, and friend. To the world, he was a gifted and respected actor whose presence lit up every stage and screen he graced. His legacy lives on in the lives he touched, the stories he told, and the love he gave so freely, read the statement.\n\nIn 2018, the thespian was awarded a Lifetime Achievement Award at the Royalty Soapie Awards. He is known for his role on productions such as The Estate, The Throne, Legacy, Sgudi Snaysi, Uzalo, and Abomama.\n\nFollowing news of the actors passing, tributes have been shared on social media by those who worked with him and his fans.-iolnews\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/FB_IMG_1744814881139-680x380.jpg",
            "description": "Legendary South African actor Don Mlangeni Nawa has died.",
            "time": "18:34",
            "date": "16 Apr 2025"
        },
        {
            "title": "Holy Ten album launch showcases emerging talent",
            "url": "https://www.herald.co.zw/holy-ten-album-launch-showcases-emerging-talent/",
            "content": "Trust Khosa\n\nZimpapers Arts and Entertainment Hub\n\nHOLY Tens album launch, scheduled for Independence Day at the 7 Arts Theatre in Avondale, Harare, has garnered attention from a host of emerging stars who are making waves in the local music scene.\n\nTitled Zvaiwana Ngwarati, the event promises to showcase the fresh talent of the Young Turks, thanks to a collaboration between Samanyanga Records and Dee Nosh Harare.\n\nThe star-studded line-up features Feli Nandi, Bling 4, Bagga, Kae Chaps, Terry Afrika, Runna Rulez, Scrip Mulla, Probeats and Kayflow.\n\nA representative of Samanyanga Records confirmed that the launch will attract hordes of fans.\n\nThe launch will go according to plan, and this is the best way to celebrate our Independence Day with our fans in Harare. We are glad that preparations are well underway, and we urge fans to show up in large numbers to join us for this double celebration, as we are honouring both the Independence Day holiday and Holy Tens milestone, noted the representative.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Holy-Ten-old-1.jpg",
            "description": "HOLY Ten’s album launch, scheduled for Independence Day at the 7 Arts Theatre in Avondale, Harare, has garnered attention from a host of emerging stars who are making waves in the local music scene.",
            "time": "18:34",
            "date": "16 Apr 2025"
        },
        {
            "title": "Mitambo Festival brings the world together",
            "url": "https://www.herald.co.zw/mitambo-festival-brings-the-world-together/",
            "content": "Trust Khosa\n\nZimpapers Arts and Entertainment Hub\n\nORGANISERS of the annual Mitambo International Theatre Festival have confirmed the participation of groups from Spain and Switzerland at this years edition, running from September 11 to 13 at Reps Theatre in Harare.\n\nNow in its seventh year, the festival provides a platform for learning, networking and exposure, and is being organised by the Zimbabwe Theatre Academy.\n\nIn an interview with Zimpapers Arts and Entertainment Hub, the festivals artistic director, Teddy Mangawa, confirmed these developments.\n\nWe can confirm participation from groups in Zimbabwe, South Africa, Malawi, Spain, and Switzerland, he said. Locally, we have secured collaborations with local institutions. To date, we have hosted six successful editions.\n\nThe 2025 edition will be our seventh, and what sets it apart is the deliberate inclusion of community-based performances and a strong focus on digital theatre and sustainability.\n\nWere curating a bold mix of traditional and experimental work under the theme #Redefine, pushing boundaries and challenging norms.\n\nThis years edition will primarily be hosted at Reps Theatre. We are also exploring community spaces where we will conduct a clown tour in Harare, Chimanimani, and Chipinge, including the Tongogara Refugee Camp.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Untitled-1-copy-1.jpg",
            "description": "ORGANISERS of the annual Mitambo International Theatre Festival have confirmed the participation of groups from Spain and Switzerland at this year’s edition, running from September 11 to 13 at Reps Theatre in Harare.",
            "time": "18:34",
            "date": "16 Apr 2025"
        },
        {
            "title": "Why ZANU PF triumphed in Glen View South",
            "url": "https://www.herald.co.zw/why-zanu-pf-triumphed-in-glen-view-south/",
            "content": "Joseph Madzimure\n\nZimpapers Politics Hub\n\nIn the recently held Glen View South Constituency by-elections where ZANU PF candidate, Cde Tsitsi Tawomhera romped to victory, the Second Republics deliverables carried the day for the ruling party.\n\nIn its campaign messages, the ruling party told voters that the ZANU PF Government is taking the lead in infrastructure development in cities, including the refurbishment of roads after years of neglect by opposition-led councils.\n\nUnder its Urban Renewal Initiative, the ruling party has also been drilling boreholes to ease water challenges.\n\nA number of houses are now connected to solar power, in addition to receiving electricity from the national grid.\n\nAny opposition member interpreting the by-election results as a fluke is being insincere, as the failure by the opposition to manage councils is no longer a subject of debate.\n\nIts clear urbanites are now disillusioned by the never-ending feuds within the opposition, which have negatively affected service delivery.\n\nUncollected garbage, potholed roads, and outbreaks of cholera and dysentery are all consequences of mismanagement and incompetence.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/2D1D1D-680x380.jpg",
            "description": "In the recently held Glen View South Constituency by-elections where ZANU PF candidate, Cde Tsitsi Tawomhera romped to victory, the Second Republic’s deliverables carried the day for the ruling party.",
            "time": "18:34",
            "date": "16 Apr 2025"
        },
        {
            "title": "Niece takes Aunt to court for spreading rumours",
            "url": "https://www.herald.co.zw/niece-takes-aunt-to-court-for-spreading-rumours/",
            "content": "Spiwe Sarakunze\n\nHerald Reporter\n\nSPREADING rumours about her nieces health status landed a Harare woman in court on Tuesday.\n\nMs Sekai Tekeno of Dzivarasekwa took her aunt Ms Jane Tekeno to court on allegations that she disclosed her health status to people in their neighbourhood.\n\nShe disclosed my status to an extent that l am now embarrassed to walk in the streets since people are laughing at me, she said.\n\nI told her to stop telling people about my condition and she threatened to petrol bomb my house. l am now afraid that she might do it one day.\n\nSekai said Jane sold the house to her, but she was now claiming that she still owns it.\n\nShe said her aunt wanted to evict her from the house and she is afraid that if she succeeds, she would have nowhere to live since everyone was told about her condition.\n\nI found out that many people now know my status and l have lost confidence due to that, she said.\n\nJane disputed the allegations, saying that she only wants her house back so that she will stop bothering her niece.\n\nI own the house she is living in and l never spread rumours about her health status, said Jane.\n\nPresiding magistrate granted a protection order in favour of Sekai.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/court-hammer.jpg",
            "description": "SPREADING rumours about her niece's health status landed a Harare woman in court on Tuesday.",
            "time": "18:34",
            "date": "16 Apr 2025"
        }
    ]
}