{
    "news": [
        {
            "title": "DRC crisis: Sadc mission to silence guns persists",
            "url": "https://www.herald.co.zw/drc-crisis-sadc-mission-to-silence-guns-persists/",
            "content": "Wallace Ruzvidzo, Herald Reporter\n\nAs SADC Heads of State and Government convene virtually for an urgent Extraordinary Summit today, the regional blocs commitment to the Democratic Republic of Congos (DRC) independence, peace, sovereignty and territorial integrity has been reaffirmed by its Executive Secretary Mr Elias Magosi.\n\nTodays crunch meeting will be chaired by SADC Chairperson President Mnangagwa, who continues to rally member states defending the DRC Governments cause.\n\nIn his remarks yesterday at the SADC Council of Ministers meeting in Harare, Mr Magosi said the region remained resolute in efforts to find lasting peace and security in the vast central African country.\n\nIn the spirit of solidarity and collective defence, we have been resolute in our efforts to find lasting peace and security in the eastern part of the DRC.\n\nThe security and humanitarian situation in Eastern DRC remains precarious and worrisome to the region as a whole. We wish to reaffirm our commitment to the DRCs independence, sovereignty, and territorial integrity, he said.\n\nThe Executive Secretary said peace and security remained critical to the regions integration and economic development.\n\nHe extended the blocs condolences to those who have lost their loved ones in the raging conflict, where peace has so far remained elusive.\n\nIn recent weeks, the M23 armed group has carried out attacks on Congolese security forces, SADC troops and civilians in the region, scores of peacekeepers have been killed along with thousands of civilians.\n\nWe also wish to extend our heartfelt condolences to the people of the DRC and member States and families of the fallen heroes and heroines who lost their lives while serving in the SADC Mission in the DRC.\n\nMay the souls of our departed troops rest in eternal peace, he said.\n\nTodays Extraordinary Summit is being convened following the virtual Extraordinary SADC Organ Troika Summit held last week.\n\nOn his part, Foreign Affairs and International Trade Minister Professor Amon Murwira, who was host of yesterdays Council of Ministers, said SADC must continue to take ownership of its peace, stability and development.\n\nThe SADC we want, can only be built by its own people, lest we forget, SADC was formed to foster collective self-sufficiency of the region, and we shall vigorously pursue this goal.\n\nIn line with His Excellency the President of the Republic of Zimbabwe and SADC Chairperson, Dr ED Mnangagwas doctrine, and I quote, the SADC we want is built by its people, he said.\n\nProf Murwira said the operationalisation of the Regional Development Fund would go a long way in ushering in a developed SADC where the peoples basic needs were met.\n\nIn our efforts to ensure sustainable financing, our meeting will consider progress made towards the operationalisation of the Regional Development Fund.\n\nIt is paramount that we operationalise the Regional Development Fund as a matter of urgency, given its key role in supporting infrastructural projects and the industrialisation of our economies, both of which are vital in propelling our regional integration agenda, he said.\n\nGiven the increasingly unpredictable nature of donor funding amid shifting global geopolitics, Prof Murwira said the region needed to take ownership of its development agenda.\n\nSADC was formed exactly to achieve this, by leveraging our domestic resources, our human capital, our natural capital, and reducing reliance on external funding.\n\nThe marked reduction in donor support that we are currently witnessing should therefore serve as a wake-up call every day, that no one but ourselves will drive and build the SADC we want, he said.\n\nThe need for peace and security, and economic and social development through regional integration are the reasons that SADC was established in 1992.\n\nSADC region has for decades been developing and strengthening regional cooperation in the Defence Sector. It is this cooperation that underpinned the establishment of the Inter-State Defence and Security Committee (ISDSC) in 1977, which is a forum for defence, and security cooperation. The Inter-State Defence and Security Committee played a crucial role in the liberation struggles against colonial and racist regimes and in the maintenance of the national sovereignty and territorial integrity of the Member States.\n\nThe Protocol on Politics, Defence and Security Cooperation states that it is desirous to ensure that close cooperation on matters of politics, defence and security shall at all times promote the peaceful settlement of disputes by negotiation, conciliation, mediation or arbitration. Protocol on Politics, Defence and Security Cooperation provides for regional intervention in the case of intrastate conflict, but only for purposes of mediation, and does not provide for military assistance.\n\nArticle 3 of the Mutual Defence Pact 2003 states that: State Parties shall, by the principles of the Charter of the United Nations, settle any international dispute in which they may be involved, by peaceful means, in such a manner that regional and international peace, security and justice are enhanced. Article 6 goes on to say that An armed attack against a State Party shall be considered a threat to regional peace and security and such an attack shall be met with immediate collective action.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/HE-3.jpg",
            "description": "Wallace Ruzvidzo, Herald Reporter As SADC Heads of State and Government convene virtually for an urgent Extraordinary Summit today, the regional bloc’s commitment to the Democratic Republic of Congo’s (DRC) independence, peace, sovereignty and territorial integrity has been reaffirmed by its Executive Secretary Mr Elias Magosi. Today’s crunch meeting will be chaired by SADC Chairperson […]",
            "time": "09:09",
            "date": "13 Mar 2025"
        },
        {
            "title": "Cash discounts for war vets, civil servants title deeds payments",
            "url": "https://www.herald.co.zw/cash-discounts-for-war-vets-civil-servants-title-deeds-payments/",
            "content": "Zvamaida Murwira and Columbus Mabika\n\nGovernment has introduced a cash discount for farmers, war veterans and civil servants paying for their farms under the Presidential Title Deed Implementation Programme.\n\nThe initiative will extend to those who make cash payments.\n\nIn an interview yesterday, Lands, Agriculture, Fisheries, Water and Rural Resettlement Minister Dr Anxious Masuka said the discount was part of a deliberate thrust by the Government to provide incentives to farmers as well as acknowledge contributions made by different categories of people in national development and in the liberation struggle.\n\nThe President has introduced a more secure tenure by way of title deeds. And on the title deeds, we looked at sectors of the spectrum of beneficiaries and said what other incentives can we bring for the people who have worked so hard in the civil service, worked 20 years or more? You have a certain level of discount if you have worked less, there is a certain level of discount, said Dr Masuka.\n\nWe are also mindful that political independence came at the background of a very bitter and protracted armed struggle and that the land revolution itself was a struggle, so we want to reward those who played a role in the liberation of our country and those who participated in liberating our land, so this is the rational this concept of discounts on title deeds is meant for.\n\nThose farmers who make cash payments and war veterans will get a 15 percent discount while civil servants with a minimum of 20 years service are entitled to a five percent discount. Those with a minimum of 10 years will get a 2,5 percent discount.\n\nHe said they had identified four banks that they will be working with to provide mortgage financing for those farmers who might not have the money to cover the purchase price of their farms.\n\nThere is a land implementation technical committee working on this aspect and we have identified four banks and they are finalising the papers. There shall be a one-stop centre at Makombe Building where banks shall be establishing their offices and shall be operational by 31 March 2025, so there is a window for those that are able to pay over a defined period and you also realise that there ought to be a window for those that are unable to pay therefore the Government has linked with these banks to ensure that no one and no place is left behind, he said.\n\nIn a statement issued yesterday, the Ministry of Lands, Agriculture, Fisheries, Water and Rural Resettlement said the war veterans, civil servants and those who make cash payments will enjoy discounts while processing of title deeds will be done in three days.\n\nThe Presidential Title Deed Implementation Committee has commenced the process of issuing title deeds to holders of valid offer letters, A2 permits, 99 year leases, A1 settlement, A1 temporary permits and ALSA leases. Kindly visit our one stop centre located at the Land Development and Administration Department Block 2 Makombe Complex, Corner Harare Street and Herbert Chitepo, Harare, reads the statement.\n\nThe forms will be processed within three days for farmers paying cash on the purchase price. Those farmers who will pay the purchase price within 90 days will have the tittle deeds processed upon payment of deposit and will collect them after full payment. Farmers who need mortgage arrangement are advised that Government is finalising the modalities with selected banks for this facility. Once the modalities are completed, we will inform the nation.\n\nThe issuance of title deeds marks a significant milestone in land ownership. It reinforces the Governments Land Reform Programme, which was initiated in 2000. This system aims to ensure the bankability and transferability of titles, aligning with the countrys Vision 2030 goals.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/01/EfYme5CX0AACo8O.jpg",
            "description": "Zvamaida Murwira and Columbus Mabika Government has introduced a cash discount for farmers, war veterans and civil servants paying for their farms under the Presidential Title Deed Implementation Programme. The initiative will extend to those who make cash payments. In an interview yesterday, Lands, Agriculture, Fisheries, Water and Rural Resettlement Minister Dr Anxious Masuka said […]",
            "time": "09:09",
            "date": "13 Mar 2025"
        },
        {
            "title": "Night vendors get 48-hour ultimatum",
            "url": "https://www.herald.co.zw/night-vendors-get-48-hour-ultimatum/",
            "content": "Rumbidzayi Zinyuke, Senior Reporter\n\nGovernment has issued a 48-hour ultimatum to local authorities to clear night vendors from the streets of cities and towns countrywide.\n\nThis comes amid a surge in night vending over the past few months, leading to increased human traffic, widespread littering and disruptions to other businesses operating in central business districts.\n\nAddressing a media briefing in Harare yesterday, Local Government and Public Works Minister Daniel Garwe said all vendors must possess valid licences and operate exclusively from designated areas across the country.\n\nIllegal vending perpetuates unsanitary conditions as vendors operate in areas without potable water and ablution facilities, which poses a significant risk for disease outbreaks such as typhoid, dysentery and cholera, he said.\n\nFurthermore, the accumulation of waste from these vendors has rendered some roads, sanitary lanes, and sidewalks impassable, exacerbating public health and security issues.\n\nIn light of these pressing issues, the Government is directing all local authorities to clear vendors from undesignated points within 48 hours. During this operation, local authorities will be supported by law enforcement agents to ensure the maintenance of law and order.\n\nMinister Garwe reiterated the Governments commitment to creating a safe, clean, and orderly environment for all citizens.\n\nIn the matrix of small to medium enterprises, even in our laws, there is no provision for night trading in our cities. There is no room for creating capacity for night vendors.\n\nZimbabwe is an economy which operates during the day so we are not going to create a night economy which is driving hate, drug abuse, illicit deals and a lot of ugly issues. For our vendors who operate during the day, we have existing facilities where they can go and operate from, he said.\n\nIn the past, council police and the Zimbabwe Republic Police have been involved in running battles with illegal vendors in a bid to remove them from the CBD.\n\nBut there have been allegations that some officers accept bribes to turn a blind eye to illegal vending activities.\n\nIn response, Home Affairs and Cultural Heritage Deputy Minister Chido Sanyatwe said the Government was prepared to root out corrupt police officers if sufficient evidence of such malpractices is provided.\n\nSpeaking at the same occasion, Harare Mayor, Councillor Jacob Mafume, said the city council is prepared to work towards restoring sanity in the capital.\n\nWe are also committed as a council to the enforcement of bylaws. I stated earlier that there is no permission for night vending as the Minister said.\n\nEven during the daytime, there are laws that control vending. People are not supposed to operate anywhere and everywhere they see fit, he said.\n\nClr Mafume said council would also consider introducing name tags on the uniforms of council police officers to enhance accountability and enable citizens to identify those involved in corrupt practices.\n\nI dont see any challenge in us having name tags. If its the best practice that is being done by the ZRP as well, I am sure we will adopt that method as soon as possible. We need to identify and be able to know who is asking you to comply with the law. Its international best practice and well adopt it as well, he said.\n\nSimultaneously, authorities are cracking down on errant kombi drivers to restore order and sanity in the capital city.\n\nOn the issue of unregulated kombi operations, national police spokesperson Commissioner Paul Nyathi emphasised their unwavering stance on enforcing the law.\n\nIn every entity, there are laws which regulate how we behave, how we conduct ourselves. The same applies to the kombi operators.\n\nWe have close to 16 000 kombis, but only 2 500 to 3 000 are registered. The rest are playing hide and seek with the law. So theres no going back in enforcing the Governments laws, and we are not apologetic about that, he said.\n\nComm Nyathi called for a shift in attitude among Zimbabweans to support the countrys development.\n\nHe said since January this year, the police have impounded nearly 10 000 vehicles, which are being screened in collaboration with the Vehicle Inspectorate Department (VID), local government, and other relevant entities to ensure only roadworthy vehicles are permitted back on the streets.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/DG.jpg",
            "description": "Rumbidzayi Zinyuke, Senior Reporter Government has issued a 48-hour ultimatum to local authorities to clear night vendors from the streets of cities and towns countrywide. This comes amid a surge in night vending over the past few months, leading to increased human traffic, widespread littering and disruptions to other businesses operating in central business districts. […]",
            "time": "09:09",
            "date": "13 Mar 2025"
        },
        {
            "title": "Zimbabwe strengthens regional  cooperation against counterfeit trade",
            "url": "https://www.herald.co.zw/zimbabwe-strengthens-regional-cooperation-against-counterfeit-trade/",
            "content": "Blessings Chidakwa and Nelson Gahadza\n\nZIMBABWE is enhancing regional cooperation, policy harmonisation and information sharing to effectively combat the rising threat of counterfeit products, Industry and Commerce Minister, Mangaliso Ndlovu, has said.\n\nMinister Ndlovu, represented by his deputy Raj Modi, said without synchronised enforcement through bodies like SADC and the COMESA Competition Commission, fragmented efforts will continue to weaken the countrys ability to curb illicit goods crossing its borders.\n\nThis came out yesterday at an indaba between the Government, captains of industry, and other key stakeholders that deliberated on the consequences of counterfeit products.\n\nThe Ministry of Industry and Commerce, in collaboration with the National Economic Consultative Forum (NECF), hosted the indaba under the theme, Combating counterfeit products in Zimbabwe and fostering economic growth.\n\nMinister Ndlovu said the fact that counterfeit products often cross national borders through smuggling, makes the issue a regional challenge.\n\nTo date, over 1 400 businesses have been inspected for compliance, with non-compliant businesses receiving guidance on remedial actions, while some are facing prosecution and penalties. Over 2 000 product units have been seized and confiscated for non-compliance with various pieces of legislation under the taskforces mandate, he said.\n\nMinister Ndlovu said consumer complaint hotlines have been set up in all 10 provinces to receive reports, with efforts underway to make them toll-free to ensure consumers do not bear the cost.\n\nGovernment is increasingly concerned about the proliferation of counterfeit products, some of which are manufactured in backyard industries, while others are repackaged fake imitations of locally produced goods.\n\nOther counterfeits are also smuggled from neighbouring countries, said Minister Ndlovu.\n\nAt the end of the day, our local industry suffers huge market losses, as consumers only look at the cheap prices that informal traders offer without considering that they do not pay any taxes to the Government.\n\nRepackaged products are often sold using the wrong packaging, and some are not labelled at all, thereby deceiving and short-changing vulnerable consumers, said Minister Ndlovu.\n\nThe Minister further noted that counterfeit goods are typically sold in unregistered shops, informal tuckshops, and on the informal market, with some of the most commonly counterfeited products including luxury goods, foodstuffs, beverages, electronics, and pharmaceuticals.\n\nHe also urged businesses to prioritise quality production and uphold ethical business practices.\n\nI would also like to say to vulnerable consumers: Do not be fooled by the incredibly low prices of products in the informal market.\n\nThey come with all sorts of hidden defects that you may only discover when it is too late. As the old adage says: All that glitters is not gold! Think carefully before making a purchase, said Minister Ndlovu.\n\nDeputy Chief Secretary in the Office of the President and Cabinet, Engineer Amos Marawa, warned that illicit trade undermines local industries, reduces tax revenues, and endangers consumers.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/07/Untitled-91-1.jpg",
            "description": "Blessings Chidakwa   and Nelson Gahadza ZIMBABWE is enhancing regional cooperation, policy harmonisation and information sharing to effectively combat the rising threat of counterfeit products, Industry and Commerce Minister, Mangaliso Ndlovu, has said. Minister Ndlovu, represented by his deputy Raj Modi, said without synchronised enforcement through bodies like SADC and the COMESA Competition Commission, fragmented efforts […]",
            "time": "09:09",
            "date": "13 Mar 2025"
        },
        {
            "title": "New law to govern social media",
            "url": "https://www.herald.co.zw/new-law-to-govern-social-media/",
            "content": "Rumbidzayi Zinyuke, Senior Reporter\n\nGOVERNMENT is crafting new law to govern social media platforms to address the growing challenges posed by unregulated use.\n\nSpeaking at a Ministers Meet the Media meeting in Harare yesterday, Information, Publicity and Broadcasting Services Minister, Dr Jenfan Muswere, said the new law would help enhance governance of social media, which is lacking not only in Zimbabwe, but across Africa.\n\nSocial media is not properly governed, and this has led to a situation where people are chasing shadows  shadows that have no meaning, shadows run by ghost accounts operated by individuals seeking to demonise their own country, said Dr Muswere.\n\nIn other cases, we have people who have transitioned from journalists to cashvists and politicians and they do not have any iota of information in terms of the access to information and the current Government structure.\n\nSocial media laws are regulations, statutes and guidelines that govern the usage of social networking sites by making the users accountable without denying them their fundamental rights.\n\nThe laws differ widely in other countries, although many African countries do not have the laws yet.\n\nAdded Dr Muswere: Part of our responsibility as a ministry is to ensure that social media is governed effectively.\n\nWe are preparing new legislation to regulate these platforms and hold users accountable.\n\nHe also said Zimbabwe has a robust governance architecture that ensured access to information through ministers, commissioners, permanent secretaries and other officials.\n\nThe media has a critical role in nation-building, in terms of identifying any issues, negative or positive that impact on our Vision 2030. We urge journalists to be ethical, verify facts, and seek information from official Government platforms. At the same time, journalists should always be ethical and give an opportunity to verify facts and to validate any issues, he said.\n\nTo further demonstrate the Governments transparency, Dr Muswere said the ministry would continue with the question and answer sessions with ministers as well as media tours to familiarise journalists with Government projects.\n\nWe are a transparent, efficient, and effective Government. This tour will provide the media with first-hand access to our achievements, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Dr-Jenfan-Muswere.jpg",
            "description": "Rumbidzayi Zinyuke, Senior Reporter GOVERNMENT is crafting new law to govern social media platforms to address the growing challenges posed by unregulated use. Speaking at a Ministers Meet the Media meeting in Harare yesterday, Information, Publicity and Broadcasting Services Minister, Dr Jenfan Muswere, said the new law would help enhance governance of social media, which […]",
            "time": "09:09",
            "date": "13 Mar 2025"
        },
        {
            "title": "First Lady takes schools’ feeding programme to Mash Central",
            "url": "https://www.herald.co.zw/first-lady-takes-schools-feeding-programme-to-mash-central/",
            "content": "Tendai Rupapa, Senior Reporter\n\nHEALTH Ambassador First Lady Dr Auxillia Mnangagwa yesterday took her schools feeding Programme to Mashonaland Central province where African diplomats accredited to Zimbabwe joined her in preparing and serving the learners a nourishing meal.\n\nThe ambassadors then donated sanitary wear to school girls from various schools to ensure they did not abscond from classes during their monthly cycles.\n\nThe ambassadors said they were inspired by the First Ladys works, hence their commitment to be part of the programme and efforts to mobilise reusable and disposable sanitary pads.\n\nAmbassadors and representatives who attended the event included Rwandan Ambassador to Zimbabwe James Musoni, who is the dean of the diplomatic corps, Sudanese Ambassador to Zimbabwe Thomas Vigilio Jada Morbe, Ambassador of Egypt Mrs Salwa Mowafi, Mr Rashid Mohammed Abdulwahid Ethiopian Ambassador to Zimbabwe, Mr Mohammed Seoudi Ambassador of Algeria, Kenyas Deputy Ambassador Justine Ikumiru, Mrs Banabotlhe Mello Minister Counsellor Botswana Embassy, Mr Kenneth Moeng Counsellor Political Botswana Embassy, Mozambique 3rd secretary Mrs Cremilde Uachisso and Mrs Zemha Gawachas, the Deputy Ambassador of Namibia.\n\nThe meals served to the learners comprised sadza, rice, sugar beans, cabbage, beef, sorghum sadza, and dried and fresh green vegetables.\n\nDr Mnangagwa interacted with the learners as they ate their well-cooked meal, showing delight and finishing their portions.\n\nShe also interacted with school children, warning them against drugs, love affairs, sexual relationships, and teen pregnancies.\n\nBefore giving her remarks, the First Lady started by introducing the diplomats to the people.\n\nElderly women were all smiles as they carried home the food hampers they received from First Lady Dr Auxillia Mnangagwa in Mashonaland Central yesterday\n\nAddressing the gathering, Dr Mnangagwa said Zimbabwe must break barriers that hold girls back and empower them to reach their full potential.\n\nShe said menstruation was a natural part of life that should never hold anyone back.\n\nLet me begin by extending a warm welcome to our very important guests whom I have come with. Please join me in welcoming our dear friends, the ambassadors of the African group who have made this day possible.\n\nI am honoured to be part of this special occasion where we gather to support and empower our young girls.\n\nToday we are taking a significant step towards ensuring that our children stay in school confident and focused on their education. Your Excellencies, I stand before you today with immense gratitude and appreciation for the generous donation of sanitary pads that we shall hand over to our young girls after the national schools feeding programme, which we did this morning.\n\nThe gesture is a testament to the compassion and commitment of the African group of ambassadors to the well-being and empowerment of the girl child. Let me give a special mention of Her Excellency Stella Munyi, the former ambassador of Kenya, and her team of female African ambassadors who contributed this brilliant initiative.\n\nLet us give them a big round of applause because as children you have been remembered by our ambassadors, she said.\n\nSchoolchildren in Mashonaland Central enjoy their meal during a feeding programme organised by First Lady Dr Auxillia Mnangagwa yesterday\n\nThe donation, Dr Mnangagwa said, had come at an opportune moment as the nation continues womens month celebrations in recognition of contributions that women have and continue to make for the good of the society.\n\nOn 8 March in Manicaland Province, Zimbabwean women also celebrated International Womens Day. Your Excellencies and distinguished guests, Zimbabwe has made commendable progress in upholding the human rights of women and girls as a signatory to international treaties and conventions. Zimbabwes commitment to advancing the womens agenda has been strong. In partnership with the United Nations, we continue to focus on advancing Sustainable Development Goal Number 5 under the United Nations Sustainable Development cooperation framework 2022 to 2026, she said.\n\nThe mother of the nation shared insights into challenges faced by girls in pursuit of their education.\n\n As we gather here, I am reminded of the countless challenges that our girls face in their pursuit of education. Menstrual hygiene is a critical issue not only for their health, but also their dignity and self-esteem. In some cases, it results in absenteeism and school dropouts. Your donation, Your Excellencies, is therefore a significant step towards addressing these challenges and ensuring that our girls can attend school with confidence and pride. I launched the reusable pads programme as a means to offer both economic empowerment and sanitary comfort to our girls. Most of them who benefited from this initiative also learnt how to sew their own reusable pads, she said.\n\nAfrican Diplomats accredited to Zimbabwe distribute sanitary wear they donated to Angel of Hope Foundation to school girls in Mashonaland Central yesterday\n\nDr Mnangagwa praised the ambassadors for their benevolence.\n\nTo the African group of ambassadors, I would like to extend my profound gratitude for choosing to partner with me in this journey of assisting children, in particular the girl child. To the students, I want to tell you that you are capable, strong and deserving of every opportunity. Remember, menstruation is a natural part of life and should never hold you back, remember that education is the key to unlocking your dreams.\n\nI have no doubt that you will make the most of this opportunity and many others that are presented to you. Let us continue to work together to create a world where every girl has access to quality education, healthcare and opportunities. Let us break down the barriers that hold our girls back and empower them to reach their full potential. Thank you to our donors, teachers and everyone who has made this possible. Together we can make a difference, she said.\n\nDr Mnangagwa implored the children to make informed choices when selecting their career paths.\n\nMy children, make sure you know what you want to be career wise. I learnt at Kakora and those of you who are of age, know how I grew up. We were orphaned but I focused on education. Tell yourself that I need to have a professional name. There are many professions needing people, yet you focus on pregnancy. Parents here are marrying off children at tender ages. Statistics show Mashonaland Central is number one when it comes to child marriages. We do not want to hide behind religion and traditionalism by appeasing avenging spirits with our children. Let the children grow and make their own choices. You learners stay away from drugs. I hear some women are baking cakes laced with drugs just because of the love of money. In the process, you are destroying somebodys child. Its destroying their critical body parts.\n\nVabereki, do not drive your children into prostitution. Some parents ask children what they have brought from school? This is the time to choose who you want to be in the future. This is the time to choose subjects that suit your dreams. Let us look after these children together, she said.\n\nRwandas Ambassador to Zimbabwe Mr James Musoni greets the crowds as African Diplomats from South Sudan, Egypt, Kenya, Mozambique, Ethiopia, Namibia, Algeria and Botswana who are accredited to Zimbabwe were being introduced by First Lady Dr Auxillia Mnangagwa where they fed children and donated sanitary wear to school girls in Mashonaland Central yesterday.  Pictures: John Manzongo\n\nThe First Lady spoke to mothers-in-law and their daughters-in-law.\n\nAn elderly woman said she wants a daughter-in-law who is loving, respectful, and cooks for her when hungry.\n\nSimilar words were echoed by her age-mate, who said she wanted a daughter-in-law who would unify her family and dress properly in front of the people.\n\nI want a daughter-in-law who is loving. I want someone humble who accepts corrections and also corrects me when in the wrong, said a contributor.\n\nDaughters-in-law also said they wanted in-laws who were constructive.\n\nA daughter-in-law must be treated as a child and with love. I do not want a mother-in-law who rules in my house. Some mothers-in-law act as though they have slanging matches with the daughters-in-law, she said.\n\nThe First Lady urged families to love one another and live in peace and harmony.\n\nShe donated food hampers to the elderly, maize meal, and sugar beans to the community.\n\nExpecting mothers were also given baby preparation kits.\n\nAfrican Diplomats accredited to Zimbabwe serve food to schoolchildren during a school feeding programme organised by First Lady Dr Auxillia Mnangagwa in Mashonaland Central yesterday. From left are Ambassador Thomas Vigilio Jada Morbe (South Sudan), Ambassador Salwa Mowafi (Egypt), Ambassador Rashid Mohammed Abdulwahid (Ethiopia), Ambassador Mohamed Seoudi (Algeria) and Namibia Deputy Ambassador Zemha Gawachas\n\nAmbassador Musoni, said he was inspired by Dr Mnangagwas work.\n\nAs the African Group of Ambassadors, we came together. This is not the first time to associated with the First Ladys programme because firstly, Her Excellency the First Lady is spearheading programmes that touch the lives of the people. As Africans, we feel very inspired. We feel we should be close to supporting her efforts. The ambassadors who are here have been actively involved in the serving of food to the young ones.\n\nWe commend the First Lady of Zimbabwe for this very good initiative to have the school feeding, thus complementing the Governments efforts. The First Lady is promoting the well-being of the people of Zimbabwe, especially the young ones. Also, what we witnessed here is that the First Lady goes to the people. She is in touch with ordinary people. We feel inspired, and we are very much willing to keep working with her in her programme, he said.\n\nAmbassador Mowafi praised the First Lady for the work that she is doing countrywide and efforts to empower the girl child.\n\nThis is my first time in Mashonaland Central Province. Its something I give thanks to the First Lady, Her Excellency, for giving us this opportunity. If I talk of the work of the First Lady, you can see it everywhere, all over the country, and its noticeable not only in Zimbabwe but all over Africa. I am here to present the donation presented by African ambassadors accredited to Zimbabwe. It consists of sanitary wear and its a token of solidarity and gratitude for Zimbabwe and the people of Zimbabwe who are our brothers and sisters. The efforts being done by the First Lady are so much appreciated because girls and children are the future of Africa, so we are taking care of the assets of the next generation. The efforts of the First Lady are not for the present time but for the future and this leaves a good legacy, she said.\n\nAmbassador Abdulwahid described the First Ladys work as inspiring as it was essential to ensure learners were well-fed to realise their full potential.\n\nThis is important work and we are complementing the First Ladys work in trying to address some of the challenges that we have because everywhere you go, students have the same kind of problems and the First Lady is going an extra mile to make sure that the kids are well-fed before going to school that is why we came here and we support her initiative and we have done a lot of work with her. We will support the First Lady in her endeavours because we, diplomats are human beings and we live in communities so we contribute our fair share and make sure that the young generation get a chance to be well-fed and attend school, he said.\n\nAmbassador Morbe said he was touched by the First Ladys hard work and efforts to ease the plight of vulnerable communities. He said he was always willing to complement her efforts.\n\nIt has been a good pleasure for us to attend the activities that the First Lady is always doing. We have been engaged with the First Lady and she is always open to us. And as African ambassadors, we feel we are in the second home of our country. So we are not in a foreign land; we are in our second home. Thats why any activity that is needed, whether from the First Lady or from the President, or from wherever we are here, we are ready. And thats why we go anywhere. We are ready to support Amai by all means possible, he said.\n\nPrimary and Secondary Education Minister Torerayi Moyo praised the First Lady for her interventions.\n\nWe gather here today to witness the handover of sanitary wear. We are ready for any needed activity, whether from the First Lady or the President, or wherever. We are here and support for the home-grown school feeding programme by Her Excellency the First Lady of the Republic of Zimbabwe Dr Auxillia Mnangagwa. I want to express my sincere gratitude for this opportunity to share vital knowledge as we celebrate the noble initiative that enhances health services for our learners. It is our Governments mandate to improve the quality of education for all Zimbabweans by providing access to good health and quality education in alignment with the African Union Agenda 2063 and sustainable development goals.\n\nThe Zimbabwe School Health Policy plays a crucial role in the continental education strategy addressing the health and nutrition needs essential for quality education. The Commission of Inquiry into Education and Training of 1999 recommended strategies to enhance the adequate health and education support that is accessible in all institutions. It emphasises the importance of creating a supportive environment that includes access to health information in schools to promote overall well-being. Your Excellency, the Ministry of Primary and Secondary Education is committed to delivering inclusive, quality and equitable education to all learners. Through its heritage-based curriculum, the Ministry empowers students with knowledge and skills on health-related topics such as nutrition, water, sanitation, hygiene and the implementation of the school-feeding programme, he said.\n\nOne of his ministrys key learning outcomes, Minister Moyo said, was ensuring access to education and providing sanitary wear to disadvantaged female learners in upper primary and secondary schools.\n\nIn this noble endeavour, Her Excellency the First Lady, Dr A. Mnangagwa has been a beacon of hope and support. Her philanthropic efforts truly exemplify her role as the mother of the nation. The provision of sanitary wear under her leadership does more than enhance personal hygiene. It significantly impacts retention pass rates, and completion rates while effectively reducing school dropouts. This remarkable initiative empowers female learners to manage their menstrual hygiene in culturally accepted and health-safe ways, fostering an environment where they can thrive academically and personally. Through her unwavering commitment, Dr Mnangagwa not only uplifts individual lives but also enriches our society, demonstrating her dedication to the well-being of our children and the future of the nation, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/FL1-3.jpg",
            "description": "Tendai Rupapa, Senior Reporter HEALTH Ambassador First Lady Dr Auxillia Mnangagwa yesterday took her schools feeding Programme to Mashonaland Central province where African diplomats accredited to Zimbabwe joined her in preparing and serving the learners a nourishing meal. The ambassadors then donated sanitary wear to school girls from various schools to ensure they did not […]",
            "time": "09:09",
            "date": "13 Mar 2025"
        },
        {
            "title": "EDITORIAL COMMENT: New farming card scheme  a masterstroke",
            "url": "https://www.herald.co.zw/editorial-comment-new-farming-card-scheme-a-masterstroke/",
            "content": "SINCE coming into office, the Second Republic has provided the essential framework for all farmers to have access to inputs and advice, along with guaranteed markets for almost anything they want to sell.\n\nThis has been reflected in first the restoration of agriculture and now in the record harvests for many crops.\n\nA lot of thought went into the systems, both technical in terms of farming methods, and financial to make sure farmers were backed but in ways that ensured they would not abuse inputs or finance. A few people were caught diverting inputs and charged and jailed, and that along with the checks has prevented widespread abuse.\n\nThe small-scale farmers, with their Pfumvudza/Intwasa schemes, epitomised the progress with an almost foolproof system put in place. These farmers receive free inputs of seed and fertiliser, up to a modest limit and for the crops deemed most suitable for their area.\n\nThey cannot even start entering the allocation process until they have been on a brief local course. They also should have dug or cleaned up previously dug holes in approved plots and collected at least part of the mulch their modern agriculture methods demand. The local agricultural extension officer has to check them off, and all this also automatically guarantees that the farmer has some sort of land right in a communal or resettlement area.\n\nAfter planting is supposed to have been done, the routine visits by the extension officers act as a further check that the seed was planted and the fertiliser used, although these visits are intended for the far nobler purpose of helping farmers overcome any problems.\n\nBut the officers will notice if someones plot that was supposed to be sprouting a particular crop is barren, implying seed was diverted. Similarly if the crop is some spindly near a useless set of plants, compared to the lusher growth on neighbouring farms, this would imply that the fertiliser was diverted. In an area of smallholder farmers, neighbours will also automatically see what their compatriots are doing.\n\nBut there have arisen some interesting schemes among some of the farmers with larger farms, who have access to loans through Government-guaranteed schemes and access to physical inputs through an ARDA contract arrangement. Some have gone for both, so getting a crop from the physical inputs and having money in addition, and then trying to welsh on repayments.\n\nIn normal farm loans, repayment is almost automatic via the same sort of stop-order that works so well in the tobacco trade.\n\nIn this case, when the farmer delivers the crop to the contractor or the Grain Marketing Board or other approved buyer, the loan is deducted. But when the crop can go to one contractor who provided physical inputs, the money may not be noticed.\n\nThis has a double detrimental effect. First, there are the honest farmers, who might well complain almost continually in the nature of farmers, but still operate properly within the systems, fulfil their contract requirements and repay loans.\n\nThese farmers might find it harder to get inputs or loans if contractors and bankers feel that farmers in general are too high a risk. These farmers need a simple path they can race along and get what they need.\n\nThe second detrimental effect is that the fund that is supposed to be increasing each year as farmers pay back loans and new funds are granted instead is decreasing, as loans just disappear.\n\nThere is not enough new money to keep resupplying the fund in its entirety and the whole business relies on a high level of repayment so the fund is growing.\n\nThe Ministry of Lands, Agriculture, Fisheries, Water and Rural Development has, in conjunction with other authorities, found a solution using modern technology.\n\nFarmers and their dealing go into a data base, so all relevant information is available to anyone authorised to look at it, and the farmer gets a smart card that can be used to collect inputs.\n\nThe level of their credit will largely be determined by the value of the farm if the farmer already has title deeds or if they can be helped to obtain these under the new programme now being implemented.\n\nThis allows a return to the old system where borrowing farmers left their title deeds with their banker.\n\nThe problem, in the unlikely event that the farm needs to be sold, that someone will start re-accumulating the huge estates that were broken up during land reform, can easily be solved by simply enforcing the maximum farm sizes already laid down, and making it clear that some people are simply not allowed to bid for land being sold.\n\nThe Ministry is keen on seeing this system extend to the Pfumvudza farmers, and this is correct.\n\nFor a start, we do not need to have a dual system of separate sets of farmers, rather than just having farmers all of whom are now expected to have a commercial orientation, regardless of farm size.\n\nThe pure Pfumvudza input scheme operates up to a limit, and we should now be seeing some of the more productive and go-ahead Pfumvudza families wanting to increase their cropping, meaning they have to move into the more commercial programmes. This needs to be encouraged and it needs to be simple for a farmer to operate when they upgrade and expand.\n\nThis already is assumed to be the norm in the important tobacco cropping and trade, where all farmers are basically equal, regardless of whether they grow half a hectare or a couple of hundred hectares.\n\nWe need to see ever more of such equality, and a continuum of farmers, rather than distinct groups that do not overlap.\n\nBy using smart technology, the costs of enforcing schemes that speed up progress for the honest farmers, cut out cheating and remove some of the grey areas that some exploit, are very low.\n\nSo the savings are not chewed up in administrative costs.\n\nInstead life becomes easier for the hardworkers who do not try and fiddle, and the fiddling largely becomes impossible.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/10/Pfumvudza.jpg",
            "description": "SINCE coming into office, the Second Republic has provided the essential framework for all farmers to have access to inputs and advice, along with guaranteed markets for almost anything they want to sell. This has been reflected in first the restoration of agriculture and now in the record harvests for many crops. A lot of […]",
            "time": "09:09",
            "date": "13 Mar 2025"
        },
        {
            "title": "Crackdown on drugs intensifies",
            "url": "https://www.herald.co.zw/crackdown-on-drugs-intensifies/",
            "content": "Crime Reporter\n\nTHE nationwide operation against drug dealers has successfully confiscated over five tonnes of illicit substances, including mbanje (marijuana) and crystal Meth, commonly known as mutoriro.\n\nSeveral suspects have been arrested, with some co-operating with police investigations, while others are facing court proceedings.\n\nThe police are actively conducting roadblocks and stop-and-search operations across the country, alongside raids on companies suspected of involvement in drug trafficking.\n\nNational police spokesperson Commissioner Paul Nyathi said over the weekend, five suspected drug dealers were apprehended, including two individuals in Masvingo found with 200kg of mbanje.\n\nThe suspects, Limbikani Mwanandi (36) and Speakmore Mhonda (39), were caught transferring drugs from a broken-down bus to a Nissan Caravan.\n\nIn Harare, Petronella Masauso (36), Maryland Tarusarira (29), and Achford Mavhima (30) were arrested for unlawful possession of 5,5kg of mbanje.\n\nFurthermore, a 39-year-old man from Bulawayo, Tigor Tyron Seigfried, was arrested after being found with 1,9kg of crystal meth.\n\nBetween March 2 and March 4, 2025, eight other suspects were arrested in Harare and Beitbridge for possession of various drugs.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/02/Assistant-Commissioner-Paul-Nyathi.jpg",
            "description": "Crime Reporter THE nationwide operation against drug dealers has successfully confiscated over five tonnes of illicit substances, including mbanje (marijuana) and crystal Meth, commonly known as mutoriro. Several suspects have been arrested, with some co-operating with police investigations, while others are facing court proceedings. The police are actively conducting roadblocks and stop-and-search operations across the […]",
            "time": "09:09",
            "date": "13 Mar 2025"
        },
        {
            "title": "Govt hails progress at US$300m housing development estate",
            "url": "https://www.herald.co.zw/govt-hails-progress-at-us300m-housing-development-estate/",
            "content": "Trust Freddy, Herald Correspondent\n\nTHE Government has expressed satisfaction with the progress of the US$300 million Hills Luxury Golf Estate construction project in Harare, which features over 862 residential units capable of accommodating approximately 4 310 residents.\n\nThe project, spearheaded by West Properties Private Limited in partnership with the City of Harare, will also feature a shopping mall, clinic, swimming and tennis academy, and a state-of-the-art golf course.\n\nNational Housing and Social Amenities Minister Soda Zhemu, accompanied by his deputy Musa Ncube, yesterday toured the multi-million dollar project to inspect its progress since President Mnangagwa launched it last year.\n\nWe are actually impressed with the progress that has been made here, Minister Zhemu said. Speaking to them, they indicated that they are now above 80 percent of the roads that they are constructing within the first phase. On the stormwater drainage facilities we have been shown, more than 60 percent has been achieved.\n\nFor the first phase, which is the housing aspect, we have seen the roads that have so far been constructed. They have done the first application of the bases and they will be doing the second application before the application of the tar.\n\nMinister Zhemu said the planned waste management system, which will harness energy generation, will come in handy.\n\nThey have addressed several sustainability issues, including converting sewer disposal for recycling, which will enable them to reuse water for irrigating vegetation within the facility.\n\nAdditionally, they will implement a biogas system to generate electricity for use within the facility, along with other sustainable activities. This is quite impressive, and within six months since the groundbreaking, we are happy with the achievements made so far.\n\nWest Property chief projects officer Mr Mandla Ndebele said: The Hills development is a mixed-use development. We are currently developing phase one of the residential development. That development in its own totality will have over 800 residential units. Thats incorporating villas, apartments, town houses, and standalone homes. So that mix is what we will incorporate into the first phase of the residential development.\n\nHe also revealed that over 40 apartments will be completed within the shortest time period.\n\nIn our first phase, we call it phase 1A, were currently developing about 48 apartments, 12 villas, 30 town houses, and about seven exclusive garden homes.\n\nWhat we have done is we have started off with the civil infrastructure, which is our roads, water, and sewer infrastructure, which is what youre seeing today.\n\nPresident Mnangagwa last year presided over the projects groundbreaking ceremony in Mabelreign, with the estate poised to be a major boost to the countrys tourism and sports industries once completed.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/ZS.jpg",
            "description": "Trust Freddy, Herald Correspondent THE Government has expressed satisfaction with the progress of the US$300 million Hills Luxury Golf Estate construction project in Harare, which features over 862 residential units capable of accommodating approximately 4 310 residents. The project, spearheaded by West Properties Private Limited in partnership with the City of Harare, will also feature […]",
            "time": "09:09",
            "date": "13 Mar 2025"
        },
        {
            "title": "Slain detective: Police chief orders probe",
            "url": "https://www.herald.co.zw/slain-detective-police-chief-orders-probe/",
            "content": "Peter Matika, Bulawayo Bureau\n\nPOLICE Commissioner-General Stephen Mutamba has ordered a comprehensive investigation into circumstances surrounding the death of detective Constable Cassandra Hove while assuring the family that no stone will be left unturned.\n\nComm-Gen Mutamba, through police national spokesperson Commissioner Paul Nyathi, said all concerns raised by the late Hoves family and the public had been noted.\n\nHe has since ordered full-scale investigations into the case. The Zimbabwe Republic Police once again assures the public that no stone will be left unturned to establish what transpired on the day, said Comm Nyathi.\n\nHe said police would release a statement once investigations are complete.\n\nThe police will certainly update the family and public in due course once the current comprehensive investigations are complete. The investigations cover all the aspects raised by The Chronicle, said Comm Nyathi.\n\nHoves death has become a matter of public interest as it recently emerged that she was allegedly shot by a colleague in a shoot-out with robbers during a raid in Pumula South, Bulawayo, on Thursday last week.\n\nEarlier on, it had been reported that she had been shot by robbers during a covert operation. It was only after Hoves family raised concerns as to how she was killed that the matter raised eyebrows. She was 37.\n\nDuring her funeral service at a funeral parlour in Bulawayo on Sunday, emotions ran high as family members confronted the police, accusing them of concealing the truth. They alleged that Hove was not killed by robbers, but by one of her colleagues and demanded clarification on whether this was an accident or intentional.\n\nAccording to official police reports, Hove sustained gunshot wounds to her upper body during an exchange of fire with the suspects at around 8.40pm.\n\nShe was rushed to a nearby private clinic where she was pronounced dead on arrival.\n\nThe family is demanding to know the identities of the officers deployed in the Pumula South raid and the individual who authorised Hoves post-mortem, arguing that they were not involved in the process and were shocked to learn that someone else had signed documents at the hospital as Hoves next of kin.\n\nHoves death came at a tragic time, as she had recently secured a scholarship to study forensic investigations in Russia. She is survived by four children and was buried at her rural home in Mberengwa on Monday.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Cassandra-Hove-680x380.jpg",
            "description": "Peter Matika, Bulawayo Bureau POLICE Commissioner-General Stephen Mutamba has ordered a comprehensive investigation into circumstances surrounding the death of detective Constable Cassandra Hove while assuring the family that no stone will be left unturned. Comm-Gen Mutamba, through police national spokesperson Commissioner Paul Nyathi, said all concerns raised by the late Hove’s family and the public […]",
            "time": "09:09",
            "date": "13 Mar 2025"
        }
    ]
}