{
    "news": [
        {
            "title": "World Bank projects boom. . .‘Mining, agribusiness and tourism sectors untapped’",
            "url": "https://www.herald.co.zw/world-bank-projects-boom-mining-agribusiness-and-tourism-sectors-untapped/",
            "content": "Michael Tome, Business Reporter\n\nTHE World Bank says Zimbabwes mining, agribusiness and tourism sectors remain largely untapped, urging the private sector to take advantage of the opportunities to drive economic growth.\n\nThe Second Republic, led by President Mnangagwa, is championing economic diplomacy under the Zimbabwe is open for business mantra and anchor foreign policy thrust, friend to all and enemy to none. It has also implemented ease of doing business reforms to encourage private sector investment.\n\nThe World Bank said Zimbabwe had a better comparative advantage in the identified sectors than other regional economies.\n\nThis is in light of emerging global trends and limitless opportunities for value addition.\n\nWorld Bank senior country economist for Zimbabwe Mr Victor Steenbergen said this last week while delivering a presentation entitled, Mobilising the Private Sector in Support of Economic Transformation, at a Confederation of Zimbabwe Industries (CZI) Business and Economic Outlook Symposium for 2025.\n\nHe said Zimbabwes agriculture and agribusiness sectors played a vital role in the countrys economy, providing livelihoods for around 70 percent of the population and accounting for approximately 40 percent of the nations export earnings.\n\nMr Steenbergen pointed out that horticulture, in particular, offered relatively higher profit margins and significant opportunities for value addition, particularly in the food and beverage sectors.\n\nThe sector also has significant connections with the manufacturing sector, which creates a valuable multiplier effect, driving growth in production and employment opportunities.\n\nHe highlighted opportunities in the mining sector, noting that it provides a range of highly sought-after global commodities, including gold and Platinum Group Metals (PGMs).\n\nMr Steenbergen cited the growing demand for energy transition minerals, notably lithium, nickel, copper and platinum, saying Zimbabwe had immense platinum and lithium reserves that have not been fully exploited.\n\nLithium, a key mineral in the production of electric vehicle batteries and many modern electrical gadgets, is one of the most sought-after minerals, and Zimbabwe has the largest lithium reserves in Africa.\n\nThe countrys lithium deposits are primarily found in petalite, lepidolite, and spodumene forms, making it an attractive area for investors.\n\nTourism is another strategic economic sector with significant potential to propel Zimbabwes economy, given the countrys storied history and rich cultural and natural endowments.\n\nZimbabwe, which has already achieved its target of a US$5 billion tourism economy, is actively pursuing initiatives to drive short-term to medium-term growth via its vibrant tourism.\n\nMr Steenbergen said Victoria Falls, in particular, the countrys premier tourist destination, was thriving, and its success could be replicated in other world-class attractions to drive growth in Zimbabwes tourism sector.\n\nZimbabwes unique geographic location also presents opportunities for network tourism, which can be leveraged to attract more visitors.\n\nHe said Zimbabwe could capitalise on its natural beauty and cultural heritage to create a more diverse and resilient tourism industry.\n\nWe looked at global demand prospects and areas that Zimbabwe has a comparative advantage in; looking at exports in particular, and how that compares to the global average share of exports in that sector.\n\nIf that is higher, there might be a basis for competitiveness.\n\nAgriculture and agribusiness provide about 40 percent of national earnings, so it is very critical.\n\nA growing demand for energy transition minerals, notably lithium, nickel, copper and platinum suggests that this is an opportunity for investment in the mining industry, and Zimbabwe has large platinum and lithium reserves, he said.\n\nDespite the vast opportunities, he noted that Zimbabwe faces significant hurdles, primarily in the form of legal and regulatory challenges, which can hinder the countrys ability to fully capitalise on its potential.\n\nHe also talked about challenges regarding macro-economic stability, particularly the limited access to funding for the private sector and the high cost of doing business in the country.\n\nThese are the issues which the Government is working at redressing.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/06/World-Bank.jpg",
            "description": "Michael Tome, Business Reporter THE World Bank says Zimbabwe’s mining, agribusiness and tourism sectors remain largely untapped, urging the private sector to take advantage of the opportunities to drive economic growth. The Second Republic, led by President Mnangagwa, is championing economic diplomacy under the “Zimbabwe is open for business” mantra and anchor foreign policy thrust, […]",
            "time": "06:08",
            "date": "10 Mar 2025"
        },
        {
            "title": "President gazettes Zim, Belarus tax agreement",
            "url": "https://www.herald.co.zw/president-gazettes-zim-belarus-tax-agreement/",
            "content": "Farirai Machivenyika, Senior Reporter\n\nPRESIDENT Mnangagwa has officially gazetted the tax agreement between Zimbabwe and the Republic of Belarus, concluded in January 2023.\n\nThis announcement appears in Proclamation 2 of 2025, included in Statutory Instrument 18 of 2025, published in an Extraordinary Government Gazette last week.\n\nThe agreement aims to avoid double taxation and prevent tax evasion concerning income and property taxes.\n\nIt seeks to regulate tax relations between the two nations and promote trade and economic co-operation on mutually beneficial terms.\n\nThe proclamation states: Whereas, it is provided for by section 91 of the Income Tax Act that the President may enter into agreements with the government of any other country or territory to prevent, mitigate, or discontinue the levying of taxes on the same income . . . \n\nThe agreement was finalised with the Belarusian Government on January 31, 2023, and has now been officially proclaimed.\n\nIn the previous year, Zimbabwe hosted the inaugural session of the Zimbabwe-Belarus Joint Permanent Commission on Cooperation (JPCC) in Harare, leading to several memoranda of understanding, agreements, and commercial contracts between the two countries.\n\nCooperation spans various sectors, including mining, infrastructure development, science and innovation, agriculture and industry.\n\nBelarus has supplied Zimbabwe with tractors, earth-moving trucks, and firefighting equipment.\n\nPresident Mnangagwa and his Belarusian counterpart, Aleksandr Lukashenko, have engaged in State visits and met at various international forums, further strengthening their diplomatic and economic ties.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/President-Mnangagwa-2.jpg",
            "description": "Farirai Machivenyika, Senior Reporter PRESIDENT Mnangagwa has officially gazetted the tax agreement between Zimbabwe and the Republic of Belarus, concluded in January 2023. This announcement appears in Proclamation 2 of 2025, included in Statutory Instrument 18 of 2025, published in an Extraordinary Government Gazette last week. The agreement aims to avoid double taxation and prevent […]",
            "time": "06:08",
            "date": "10 Mar 2025"
        },
        {
            "title": "Harare to host Sadc Council of Ministers meeting",
            "url": "https://www.herald.co.zw/harare-to-host-sadc-council-of-ministers-meeting/",
            "content": "Wallace Ruzvidzo, Herald Reporter\n\nZIMBABWE will host the Ordinary SADC Council of Ministers meeting from Wednesday to Saturday in Harare this week, where they will assess the progress of regional projects and programmes.\n\nForeign Affairs and International Trade Minister Professor Amon Murwira will preside over the meeting as the Chairperson of the SADC Council of Ministers.\n\nA statement from the SADC Secretariat said the ministers will review the SADC annual corporate plan and budget for the 2025-2026 financial year.\n\nThe Ministers will review the implementation of Council and Summit Decisions; and the theme for the 44th SADC Summit of Heads of State and Government which is Promoting innovation to unlock opportunities for sustained economic growth and development towards an industrialised SADC.\n\nThe Ministers will also review the SADC annual corporate plan and budget for the 2025-2026 financial year to interventions in support of key regional priorities outlined in the SADC regional indicative strategic development plan for 2020-2030), said the statement.\n\nThe SADC Council of Ministers plays a crucial role in overseeing the function and development of SADC.\n\nIt consists of Ministers from each of the 16 SADC member States, typically from ministries related to Foreign Affairs, Economic Planning, Finance, or Trade, and meets biannually in March and August.\n\nDuring the meeting, the Ministers will focus on the theme of the 44th SADC Summit of Heads of State and Government: Promoting innovation to unlock opportunities for sustained economic growth and development towards an industrialised SADC.\n\nThat summit was held in Zimbabwe in August last year, culminating in President Mnangagwa taking over as SADC Chairperson.\n\nThe SADC development plan outlines six strategic priority areas: Peace, security, and good governance; industrial development and market integration; infrastructure development for regional integration; social and human capital development; gender, youth, environment, and climate change; and disaster risk management.\n\nPrior to this meeting, SADC senior officials reviewed the mid-term implementation of the plan, and a Finance Committee meeting was held last Saturday.\n\nThis gathering reflects SADCs commitment to fostering regional co-operation and addressing key developmental challenges in Southern Africa.\n\nAccording to the programme, SADC Executive Secretary Mr Elias Magosi will make the welcome remarks on Wednesday, followed by Prof Murwira.\n\nOn Friday, there will be a closing ceremony with Prof Murwira making the closing remarks.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/02/Professor-Amon-Murwira.jpg",
            "description": "Wallace Ruzvidzo, Herald Reporter ZIMBABWE will host the Ordinary SADC Council of Ministers meeting from Wednesday to Saturday in Harare this week, where they will assess the progress of regional projects and programmes. Foreign Affairs and International Trade Minister Professor Amon Murwira will preside over the meeting as the Chairperson of the SADC Council of […]",
            "time": "06:08",
            "date": "10 Mar 2025"
        },
        {
            "title": "President to hand over  516 offer letters to youths",
            "url": "https://www.herald.co.zw/president-to-hand-over-516-offer-letters-to-youths/",
            "content": "Remember Deketeke recently in CHINHOYI\n\nPRESIDENT Mnangagwa is set to officially present at least 516 offer letters for agricultural land measuring 10 hectares each to youths in Mashonaland West.\n\nThe programme has been tentatively set for March 20.\n\nThe initiative aims to unlock significant financial opportunities, enhance land security, and drive economic growth for Zimbabwean youths.\n\nIt is expected to create substantial opportunities for young people, enabling them to play a pivotal role in the nations development through agriculture.\n\nYouth Empowerment, Development and Vocational Training Minister, Tino Machakaire, spoke about the importance of youths in driving Zimbabwes development.\n\nYouths have always been the key drivers of development and are a key component for Zimbabwes achievement of Vision 2030, he said during an inter-district meeting in Chinhoyi on Saturday.\n\nMinister Machakaire urged the youths to focus on constructive decision-making rather than engaging in divisive actions on social media, stressing that their influence is crucial for national progress.\n\nMinister of State for Mashonaland West Provincial Affairs and Devolution, Marian Chombo, said the initiative will create more jobs within the province and boost economic opportunities for local communities.\n\nBy empowering our youth and local businesses, we can drive sustainable development, she said, emphasising the need for collaboration among all stakeholders for the success of the initiative.\n\nBoth ministers reiterated that real transformation comes from action and dedication, not just slogans, as the country works towards achieving its Vision 2030 of an empowered upper-middle income society.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Minister-Machakaire-680x380.jpg",
            "description": "Remember Deketeke recently in CHINHOYI PRESIDENT Mnangagwa is set to officially present at least 516 offer letters for agricultural land measuring 10 hectares each to youths in Mashonaland West. The programme has been tentatively set for March 20. The initiative aims to unlock significant financial opportunities, enhance land security, and drive economic growth for Zimbabwean […]",
            "time": "06:08",
            "date": "10 Mar 2025"
        },
        {
            "title": "Nation makes deliberate efforts to include women in ICT",
            "url": "https://www.herald.co.zw/nation-makes-deliberate-efforts-to-include-women-in-ict/",
            "content": "Mutsawashe Mushandure, Herald Reporter\n\nIN a move aimed at bridging the digital divide, the Government has launched the 4Es initiativewhich stand for education, empowerment, elevation, and encouragementto promote womens participation in the Information and Communication Technology (ICT) sector.\n\nThe initiative is part of the Ministry of Information Communication Technology, Postal and Courier Services commitment to ensuring that no one is left behind in the digital era, reinforcing the Governments focus on universal development.\n\nAt the third annual Women in ICT Zimbabwe Conference, ICT Minister Tatenda Mavetera highlighted the strides the country has made with the Giga project.\n\nThis ambitious initiative seeks to provide connectivity to schools across the country, tackle language barriers, and address other challenges hindering digital access.\n\nThe Giga project is not just about connectivity; its about creating opportunities for our youth and particularly empowering women in ICT, said Minister Mavetera.\n\nShe also announced plans for an Acceleration Centre that will be hosted within the Giga project, focusing specifically on advancing Fish Intelligence, which aims to foster innovation and research within the ICT space.\n\nWe have realised that many organisations need to encourage participation in ICT programmes, especially in STEM (science, technology, engineering and mathematics) fields, she said, underscoring the need for a more inclusive approach.\n\nInformation Communication Technology (ICT), Postal and Courier Services, Dr Tatenda Mavetera follower the proceedings at 3rd annual women in ICT Zimbabwe conference in Harare yesterday. Picture-: Tanyaradzwa Tanyanyiwa\n\nIn a recent development, President Mnangagwa launched a digital skills programmes aimed at fostering collaboration among various sectors, ensuring that no one and no place is left behind in the quest for digital inclusion.\n\nWe are excited that women are now taking a more active role in ICT. The establishment of a Women in ICT Chamber is a vital step towards bridging the ICT gap, she said.\n\nMinister Mavetera said while the initiative is focused on women, it does not exclude men.\n\nBy attracting investors, we can develop and advance ICT systems. We are also providing scholarships to support the girl child in acquiring ICT skills, she said, emphasising the Governments commitment to a balanced approach.\n\nThe Minister also highlighted efforts to enhance internet connectivity for women, especially in rural areas, where access remains a challenge.\n\nThe rules and regulations apply equally to everyone, including telecom players. All companies, regardless of size, are required to comply with the same regulations, she said.\n\nIn light of growing cybersecurity concerns, the Government has introduced new regulations aimed at training data protection officers to safeguard peoples data.\n\nWe are in the process of establishing a Security Operations Centre that will ensure the safety of our nation by monitoring activities in real-time, Minister Mavetera said.\n\nInformation Communication Technology (ICT), Postal and Courier Services, Dr Tatenda Mavetera gives her keynote address to the audiance at 3rd annual women in ICT Zimbabwe conference in Harare yesterday. Picture-: Tanyaradzwa Tanyanyiwa\n\nCollaboration is seen as a key challenge in strengthening partnerships and information exchange, which are crucial for the success of the Giga project and the broader digitalisation of the economy.\n\nAt the conference, Mrs Joyce Beza from the Computer Society of Zimbabwe emphasised the importance of equipping young learners with ICT skills from an early age.\n\nOur STEM programmes span from lower grades to higher education, designed to nurture skills that students can carry into their future careers, she said.\n\nMs Ruvarashe Chikunya, an alumni of Chinhoyi University of Technology, called for more women to explore opportunities in the ICT field.\n\nConfidence is crucial. Women are just as capable as men, if not more. The industry is becoming increasingly inclusive, she said.\n\nMrs Blessing Moyo, an ICT professional, stressed the importance of introducing girls to technology early on to bridge the gender gap.\n\nWhen I was in university, the field was predominantly male. We need to ensure girls grow up confident and familiar with technology, she said.\n\nThe discussions and initiatives underscore ongoing efforts to promote gender equality and skills development within the ICT sector, paving the way for a more inclusive and diverse future in technology.\n\nGovernments commitment to empowering women in ICT is not just a policy; it is a vital strategy for national development and economic growth.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/TM1.jpg",
            "description": "Mutsawashe Mushandure, Herald Reporter IN a move aimed at bridging the digital divide, the Government has launched the 4Es initiative—which stand for education, empowerment, elevation, and encouragement—to promote women’s participation in the Information and Communication Technology (ICT) sector. The initiative is part of the Ministry of Information Communication Technology, Postal and Courier Service’s commitment to […]",
            "time": "06:08",
            "date": "10 Mar 2025"
        },
        {
            "title": "Young lady wins Zanu PF primaries for  Glen View South",
            "url": "https://www.herald.co.zw/young-lady-wins-zanu-pf-primaries-for-glen-view-south/",
            "content": "Joseph Madzimure, Senior Reporter\n\nTHE Secretary for Environment in the Zanu PF Youth League, Cde Tsitsi Taomera, has emerged victorious in primary elections for the Glen View South constituency.\n\nThe achievement came in a male-dominated race, and the 37-year-old will represent the ruling party in by-elections scheduled for April 12.\n\nThe seat became vacant following the death of Gladymore Hakata from the opposition CCC.\n\nCde Taomera garnered 315 votes, surpassing her competitorsCdes Jabulani Mbetu, Tawanda Utete, and Bwanyu Muchakachi.\n\nCde Paul Mangwana, a member of the Zanu PF Politburo and Secretary for Mines and Mining Development, announced the results at the Glen View Community Hall yesterday.\n\nHe emphasised the importance of unity among all contestants for the partys success in the forthcoming elections.\n\nThe elections were just an internal process. What is now more important is to win the by-elections against the opposition, said Cde Mangwana.\n\nHe urged party members in Glen View to remain loyal and support the youthful candidate.\n\nCde Emmanuel Mahachi, the Zanu PF Harare provincial youth chairman, expressed confidence in the partys campaign efforts, adding that the youth will work vigorously to back Cde Taomera.\n\nGlen View South used to be a stronghold for the opposition, but this time around, we will turn the tables, said Cde Mahachi.\n\nTsitsi Tawomera (fourth from left) is joined by the community of Glenview in celebration of her recent win of the Glenview by-elections held in Harare yesterday.-Picture:Joshua Muswere\n\nHe criticised the opposition for alleged corruption and misuse of public funds, urging voters to recognise the development initiatives under President Mnangagwas leadership.\n\nCde Taomera has pledged to collaborate with the losing candidates to strengthen Zanu PFs presence in the constituency.\n\nIn unity we will conquer. Lets work hard to bring the seat to Zanu PF, she said.\n\nAs the party gears up for the by-elections, Cde Taomera remains optimistic about reclaiming the seat, highlighting the necessity of collective efforts for success.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/TT1.jpg",
            "description": "Joseph Madzimure, Senior Reporter THE Secretary for Environment in the Zanu PF Youth League, Cde Tsitsi Taomera, has emerged victorious in primary elections for the Glen View South constituency. The achievement came in a male-dominated race, and the 37-year-old will represent the ruling party in by-elections scheduled for April 12. The seat became vacant following […]",
            "time": "06:08",
            "date": "10 Mar 2025"
        },
        {
            "title": "EDITORIAL COMMENT: Formalisation of all businesses to help grow the economy",
            "url": "https://www.herald.co.zw/editorial-comment-formalisation-of-all-businesses-to-help-grow-the-economy/",
            "content": "A MAJOR joint drive to bring the large informal sector in Zimbabwe into the realm of the formal economy was set in motion by fiscal authorities in the last Budget and subsequent tax laws for this year.\n\nThis was further reinforced by monetary authorities in the last monetary policy statement.\n\nWith so many people earning their living through the informal sector, no one, least of all the Government or the Reserve Bank of Zimbabwe, wants to see this sector crushed or closed.\n\nEveryone in fact wants to see it flourish as part of that general effort to see major growth in the micro, small and medium businesses.\n\nBut this flourishing needs to be done within the general legal and regulatory network that all businesses in Zimbabwe, from the smallest to the largest, need to follow.\n\nThere are many reasons for this from ensuring that due taxes are paid, and these may well be minute or even zero for the smallest, and that all business is connected through the banking sector and can serve all potential customers.\n\nThere is also a need to ensure that all businesses operate with the appropriate licence from their local authority, partly because they want the services that this council is supposed to provide and partly to ensure that they meet whatever safety and health standards are seen as absolutely essential.\n\nThe Reserve Bank, through the Bankers Association of Zimbabwe, is now implementing one strand of this formalisation strategy.\n\nAll businesses now require a bank account and a Point-Of-Sale machine before they can be licensed by their local authority. This will require dual pressure by the Reserve Bank and the local authorities, the councils sending their inspectors out to exert pressure and the banks ready and willing to open at least basic bank accounts and issue the POS machines.\n\nVery small businesses have complained that often the bank charges and licence fees are high compared to their turnover and while this is a common complaint right along the business sectors, there could well be a need for special small business licences and cheap basic bank accounts.\n\nThis, after all, seems to fall within the Government policy of backing measures that make doing business ever easier.\n\nHarare City Council inherited a dual licensing system from the settler days, with cheap hawker licences as well as shop licences and this worked well by making sure anyone selling anything in the city had a licence, but in a large group of cases, a very cheap licence.\n\nWe would imagine a triple licensing structure, with three levels of licence, could easily be implemented to ensure universal coverage, but with a strong element of fairness.\n\nBanks have come under pressure from the Reserve Bank to depend less on fee income and continually adding costs to customers and instead return to their traditional role of borrowing from savers and lending to borrowers and making their serious money from the gap between the two interest rates.\n\nIn any case, a basic zero-overdraft bank account for a small business seems a good place to start.\n\nPOS machines that have been stocked include suitable machines for areas where there is no mobile-phone network, not very few, and the more numerous areas where power supplies rely on what sort of solar charging screen the business can mount. That is a good start.\n\nWe also think that customers must be given a real choice about using these POS machines and suggest that businesses are forced to put up the appropriate sticker from their bank, and that there are hotlines that customers can use to register complaints.\n\nWe have seen large formal businesses apologising for having broken POS machines, when they are just switched off and hidden, and this will be a serious temptation for smaller businesses as well. Those claiming a broken machine should be visited promptly, with repair or replacement for a genuine problem and a stiff service fee when the machine is in fact sound.\n\nAt the end of this month a set of very high presumptive taxes come into effect for a wide range of informal businesses. Small informal businesses were encouraged to register with Zimra to avoid these and pay what will be, in the overwhelming majority of cases, a far smaller calculated tax and in a reasonable group of cases perhaps no tax if the profit for a sole trader is within the zero percent tax bracket.\n\nMost will have to pay something, but not very much since they are small businesses. But if they have not registered with Zimra and kept the basic sort of books required, a list of incoming revenue and outgoing costs and expenses would probably work at this level since it is assumed in many cases that they are remarkably flourishing businesses.\n\nA tuckshop for example, with a US$9 000 presumptive quarterly tax bill, will be assumed to be making a profit of almost US$12 000 a month, which would in turn require considerably over US$100 000 a month coming over the counter before stock is bought, wages paid, rentals paid and all the other legitimate expenses, including of course bank charges and licence fees.\n\nHardly any of these little businesses come even close to these levels and would be far better off if they just went legal and paid the far smaller sums that would then be required in almost all cases. The huge presumptive taxes were set to make sure the ultimate exceptions paid enough tax, but tiny businesses will be caught in the net if they do not register and pay their tiny taxes.\n\nSmall family businesses, and this definition covers a vast swathe of the informal sector, flourish as small formal businesses across many countries.\n\nEven what we tend to call tuckshops are seen as the corner grocery convenience stores and mom and pop family stores in many cities and villages, competing against supermarkets with their lower costs, convenience and special services to their customers.\n\nThe formalisation drive, with sensible costs and fees as well as maintaining the progressive tax structure with its lower rates for small sole-traders, must be pressed so we can have what we need, a flourishing and large small business sector.\n\nThis sector must, at least in aggregate when all the little tax payments and special licence fees are added together, make a fair contribution to public finances and offer its customers a safe and secure environment, as well as maintaining the convenience and special service that makes these businesses so desirable and viable.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/04/SME.jpg",
            "description": "A MAJOR joint drive to bring the large informal sector in Zimbabwe into the realm of the formal economy was set in motion by fiscal authorities in the last Budget and subsequent tax laws for this year. This was further reinforced by monetary authorities in the last monetary policy statement. With so many people earning […]",
            "time": "06:08",
            "date": "10 Mar 2025"
        },
        {
            "title": "MUZ launches Fashion, Dining Market",
            "url": "https://www.herald.co.zw/muz-launches-fashion-dining-market/",
            "content": "Entertainment Editor\n\nIn an electrifying lead-up to the highly anticipated Miss Universe Zimbabwe pageant, organisers have unveiled an ambitious initiative: the Fashion and Dining Market.\n\nThis ground-breaking event, a first in Zimbabwes pageantry history, is aimed at blending the vibrancy of fashion with the allure of culinary delights, creating a unique platform for talent and creativity.\n\nSet to be launched in two weeks time at the chic Laparada in Harare, the Fashion and Dining Market is poised to be an unmissable event for fashion enthusiasts and aspiring models alike.\n\nThe evening will be graced by reigning Miss Universe Zimbabwe, Sakhile Dube, who will share her journey and insights with the next generation of beauty queens, offering invaluable advice and inspiration.\n\nIn an insightful interview, the logistics director for Miss Universe Zimbabwe, Alison Makusha, shared the organisations vision for this innovative event.\n\nI am sure you are aware that we have begun our registry for this years edition, and so far, we are overwhelmed with aspiring models who want to take part in Miss Universe Zimbabwe 2025, she said.\n\nMakusha emphasised that the responsibilities of the Miss Universe Zimbabwe organisation extend well beyond the auditions and the final show.\n\nMiss Universe Zimbabwe is a full-time job; there must always be something happening every season. We are moving with pageantry trends in a bid to continue promoting the modelling industry in Zimbabwe, she added, highlighting the dynamic nature of their work.\n\nShe said the Fashion and Dining Market aims to create a vibrant hub where local designers, boutiques, and fashion brands can showcase their collections.\n\nWe are calling on fashion designers, fashion houses, boutiques, couture brands, high street brands, hair shops, makeup brands, shoe brands, and handbag brands, among others, to come and exhibit, Makusha said.\n\nThe event seeks to engage the broader modelling community, offering a platform for collaboration and networking. This is a different event from the pageant, but we will also have models. The concept is done worldwide, and as Zimbabwe, this is our first time having such an event. We are contemplating inviting fashion enthusiasts from other countries, but we want to start with our own to promote local talent, she explained, expressing her commitment to nurturing homegrown talent.\n\nThe Fashion and Dining Market will not only spotlight local designers but will also serve as a promotional vehicle for the Miss Universe pageant itself, which is scheduled for May 17 at Hippodrome in Harare.\n\nWe have released the roadmap for this years edition, and we have started the auditions in various parts of the country. On April 26, we will host the Miss Universe Charity Run and reveal our top 12 who will vie for the coveted title, said Makusha.\n\nMeanwhile, reigning queen Sakhile Dube, who made a remarkable impression by finishing in the top 30 at the Miss Universe pageant in Mexico last year, has been busy launching her own initiatives.\n\nShe recently founded the Zibusiso Foundation and Zie The Label, two projects close to her heart.\n\nExplaining her mission, Sakhile said, The Zibusiso Charity Foundation is a non-profit organisation dedicated to improving the lives of underprivileged communities through education, healthcare, and empowerment initiatives.\n\nHer foundation aims to provide vital resources and support to those in need, fostering sustainable development and long-term positive change.\n\nOn the fashion front, Sakhiles Zie The Label is a clothing brand that merges style with purpose.\n\nIt aims to create trendy, high-quality apparel. Each collection is designed not only to look good but also to make a difference, with a portion of proceeds supporting charitable causes, including those championed by the Zibusiso Charity Foundation, she explained passionately.\n\nBoth initiatives reflect Sakhiles unwavering commitment to social responsibility and community upliftment, embodying the spirit of empowerment that the Miss Universe platform stands for.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/11/Sakhile-Dube.jpg",
            "description": "Entertainment Editor In an electrifying lead-up to the highly anticipated Miss Universe Zimbabwe pageant, organisers have unveiled an ambitious initiative: the “Fashion and Dining Market.” This ground-breaking event, a first in Zimbabwe’s pageantry history, is aimed at blending the vibrancy of fashion with the allure of culinary delights, creating a unique platform for talent and […]",
            "time": "06:08",
            "date": "10 Mar 2025"
        },
        {
            "title": "ZIFA, MOROCCO FA STRIKE LANDMARK DEAL",
            "url": "https://www.herald.co.zw/zifa-morocco-fa-strike-landmark-deal/",
            "content": "Langton Nyakwenda, Zimpapers Sports Hub\n\nTHE Warriors are set to play high-profile international friendly matches against 2022 World Cup semi-finalists Morocco, who are currently Africas number one ranked team.\n\nExchange programs between ZIFA and the Royal Moroccan Football Federation (FRMF), which will create opportunities for local coaches and administrators across the national structure, are also in the pipeline.\n\nDomestic womens football, for years a marginalised sector, will also have a huge bite of this delicious cake being baked in the smart partnership between Zimbabwe and Morocco.\n\nThis has been made possible thanks to a landmark partnership deal between ZIFA and the FRMR that was thrashed out on Saturday night in the North African country.\n\nZIFA President Nqobile Magwizi was in the North African country, where he signed a two-year agreement with his Moroccan Football Association counterpart, Fouzi Lekjaa.\n\nAccording to a ZIFA communique, the historic deal is expected to strengthen football development in both nations.\n\nThis is set to be done through initiatives, which include:\n\nTraining programs for coaches, referees, and administrators.\n\nYouth and womens football development.\n\nFriendly matches for senior and youth teams.\n\nExchange programs and joint events.\n\nThe North Africans, whose world-class facilities have been an inspiration to many countries, are also billed to host and support ZIFA delegations, while Zimbabwe will, among other obligations, facilitate tours by Moroccan teams.\n\nIn the build-up to his January 25 election into ZIFA, Magwizi had pledged that he would work on establishing international synergies with other successful associations.\n\nThe ZIFA boss and his executive committee, aware of much ground the association needs to cover in areas of development and capacity building, have immediately put shoulders to the wheel in trying to transform an organisation that had lost its way over the years, amid a plethora of challenges that eventually torched Government intervention.\n\nThere have been tangible deliverance on promises inside the boards first 50 days.\n\nAnd the deal with the Morocco FA, one of a number expected to be thrashed with fellow FIFA and CAF member associations, could also transform Zimbabwean football and improve the welfare of players while building the capacities of coaches, other technical officials, and administrators.\n\nPossible friendly matches against Moroccos Atlas Lions could be a boon for Zimbabwe, who are bracing for a sixth appearance at the Africa Cup of Nations finals.\n\nCoincidentally, Morocco will host the 2025 Africa Cup of Nations in December.\n\nThe Moroccans will also stage the 2026 CAF Womens Africa Cup of Nations.\n\nWhile the Warriors will be part of the AFCON jamboree in December, the Mighty Warriors came a cropper in their bid to be at the 2026 WAFCON following their elimination by Angola.\n\nThat ZIFA have sought to emulate the Moroccans is a commendable gesture, especially in view of the fact that junior development had stalled in the country.\n\nMorocco have re-emerged as one of the main actors in the development of football on the continent.\n\nThe North Africans have awakened from a slumber and have transformed into a football powerhouse, with the Atlas Lions now rated the best African side.\n\nTheir rise has been anchored on a sound football development strategy that has groomed star players who include Paris Saint Germain and former Real Madrid right back Achraf Hakimi.\n\nThe other renowned players from Morocco include goalkeeper Yassine Bonou, former Manchester United midfielder Sofyan Amrabat, and ex-Chelsea star Hakim Ziyech. Morocco became the first African country to reach the World Cup semi-finals in 2022.\n\nThe Atlas Lions are also ranked number 14 in the world.\n\nZIFA also underscored the sign they are attaching to development.\n\nThis engagement underscores ZIFAs commitment to fostering strong partnerships with leading football associations across the continent.\n\nMorocco has emerged as a key player in African football development, and this dialogue presents valuable opportunities for collaboration in areas such as technical development, infrastructure, and administration, ZIFA said in a statement shortly before Magwizi flew to Morocco.\n\nThe ZIFA president also toured Niger and had some insight into the West African countrys development programmes and the associations academy.\n\nThis comes as ZIFA have undertaken a massive refurbishment of the ZIFA Village in Mt Hampden using financial assistance from FIFA, which was first availed to the Normalisation Committee.\n\nThere is hope that at the completion of the works, the ZIFA Village will become a fully fledged training centre with boarding lodges, offices, training pitches, and boardrooms where national teams can camp. The new ZIFA board has identified infrastructure development as one of the key deliverables.\n\nResultantly, an Infrastructure Committee led by Harare businessman and board member Brighton Ushendibaba has been established to oversee the improvements and construction of facilities.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/ZIFA-1.jpg",
            "description": "Langton Nyakwenda, Zimpapers Sports Hub THE Warriors are set to play high-profile international friendly matches against 2022 World Cup semi-finalists Morocco, who are currently Africa’s number one ranked team. Exchange programs between ZIFA and the Royal Moroccan Football Federation (FRMF), which will create opportunities for local coaches and administrators across the national structure, are also […]",
            "time": "06:08",
            "date": "10 Mar 2025"
        },
        {
            "title": "200 houses on Harare Drive face demolition",
            "url": "https://www.herald.co.zw/200-houses-on-harare-drive-face-demolition/",
            "content": "Trust Freddy, Checkpoint Desk\n\nTWO-HUNDRED houses and properties, including two opulent mansions on the foothills of the National Heroes Acre, were illegally constructed on land reserved for the Harare Drive expansion project and now face demolition, The Herald can exclusively reveal.\n\nThis comes as Harare City Council has vowed to demolish all illegally constructed structures, emphasising that Harare Drive was designed to form a circular route around the city, with no changes to its original plan.\n\nDespite councils threats, the Constitutional Court recently ruled that demolishing homes without a court order was unconstitutional, presenting a significant obstacle for local authorities.\n\nHarare Drive is intended to alleviate congestion and provide an alternative route for many, but its expansion is being hindered by land barons and corrupt council officials who have illegally allocated residential stands on land reserved for the project.\n\nAn investigation by The Herald uncovered numerous properties encroaching on the roads designated reserve, threatening its intended purpose.\n\nAccording to the original 1998 detailed engineering designs, the missing links of the Harare Drive ring road are intended to connect key areas, including:\n\nSolomon Mujuru Drive (formerly Kirkman Road) at Warren Hills to Gleneagles Road in Southerton, Houghton Park through Mainway Meadows, Retreat to Seke Road, then to Twentydales Road in Hatfield to Mutare Road in Msasa.\n\nA week-long fact-finding mission revealed widespread encroachment, particularly in Waterfalls and Retreat suburbs, where more than 100 houses are built on the Harare Drive road reserve.\n\nIn Waterfalls, Mainway Meadows, a visible divide exists between areas where residents acknowledge the future path of Harare Drive, leaving a 60-metre wide corridor free of development.\n\nBut in areas like Retreat, construction continues unchecked, with land barons reportedly pegging stands on an area that had been left in anticipation of the road development.\n\nResidents expressed confusion and concern over the status of their homes.\n\nDo you want to demolish our houses? a seemingly panicky Retreat resident asked when he saw this reporter and three city planners counting houses built on Harare Drive.\n\nMine is not on the road, even if you check on your GPS, he added without being asked.\n\nThe man, who requested anonymity, acknowledged that several people were aware that their houses were on Harare Drive.\n\nI think everyone is aware that there must be a road, but they were hoodwinked into thinking their properties would be regularised.\n\nAnother resident, who also requested anonymity, said the talk of Harare Drive had been ongoing, and had halted construction of her house.\n\nI am now confused, she said.\n\nWe were told that Harare Drive was supposed to pass through here, so for the meantime, I have halted plans to build my full house. Others are also saying the road will be diverted.\n\nA man who preferred to be identified only as Mr Tawanda, said: The unbuilt area reserved for Harare Drive has been pegged for new houses.\n\nMy plea to the Government is to complete the entire road to avoid confusion.\n\nA nicely built Church of Grace Ministries in Retreat was also constructed on the path that Harare Drive will take.\n\nHowever, church leader, Minister Oliver Makoni, refuted that.\n\nWe have never been informed by the City Council about any encroachment issues, he said.\n\nWe have a site plan, and our papers are in order, all the papers are at Rowan Martin. Why cant you obtain a GPS report, they have that GPS. It can verify whether we have encroached or not.\n\nMinister Makoni indicated that they were even given an account and pay rates to the City Council every month.\n\nIts nearly 10 years now, but above all the City should know that peoples lives are important than a road.\n\nA further investigation revealed that Retreat residents have been living in the area for over 10 years, with some even constructing permanent homes, even though they had been provided with accurate information regarding the planned route of Harare Drive.\n\nHarare City acting director of urban planning, Mr Samuel Nyabezi, acknowledged the existence of many houses built on Harare Drive, particularly in the Retreat area.\n\nYes, there are many houses that have been built on Harare Drive, particularly in Retreat, but at some point, those structures shall be demolished because our plan for Harare Drive road expansion is clear.\n\nHe also told The Herald that two mansions were built on Harare Drive close to the National Heroes Acre.\n\nThose are two real mansions, and from our plan, it shows that all those two encroached into Harare Drive. I have told the owners that there will be no negotiations; the houses will be demolished.\n\nMr Nyabezi said the homeowners are being hoodwinked by land barons to build without plans. The city council will never approve a house to be built on land reserved for a road. These people are just getting site plans and going on to build a full house.\n\nAt some point, those structures shall be demolished because our plan for Harare Drive road expansion is clear, he said.\n\nHarare mayor, Councillor Jacob Mafume, reiterated the citys commitment to demolishing all illegal structures.\n\nWe will demolish all those illegal structures. If you ask me to provide a solution, I will only push for demolition, because surely, you cannot build on land reserved for a road.\n\nIts perhaps the government that will stop us. You cannot build on land reserved for a road, said Clr Mafume.\n\nThis situation unfolds amid ongoing investigations by the Zimbabwe Anti-Corruption Commission (ZACC), which has warned city officials that their days are numbered.\n\nZACC Chairperson Mr Michael Reza said: We will allow the commission to complete its report and submit it to His Excellency, after which we will be guided on the way forward.\n\nAs the situation develops, residents, officials, and the city council remain at an impasse over the future of Harare Drive and the homes built on its planned route.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/houses.jpg",
            "description": "Trust Freddy, Checkpoint Desk TWO-HUNDRED houses and properties, including two opulent mansions on the foothills of the National Heroes Acre, were illegally constructed on land reserved for the Harare Drive expansion project and now face demolition, The Herald can exclusively reveal. This comes as Harare City Council has vowed to demolish all illegally constructed structures, […]",
            "time": "06:08",
            "date": "10 Mar 2025"
        }
    ]
}