{
    "news": [
        {
            "title": "‘Zim on real path to industrialisation’",
            "url": "https://www.herald.co.zw/zim-on-real-path-to-industrialisation/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nZimbabwe is on the right path to industrialisation with more strategic investors now gaining confidence in the Governments national development trajectory anchored on the robust re-engagement and engagement policy, President Mnangagwa has said.\n\nThe President said the country was attracting more investment in the infrastructure, mining and energy sectors from both new and old strategic partners.\n\nHe made the remarks while presiding over the groundbreaking ceremony at the Palm River Energy Project in Beitbridge where the Government, in collaboration with a Chinese mining company, is setting up a US$3.6 billion Energy Metallurgical Special Economic Zone and Industrial Park.\n\nPresident Mnangagwa said the development of industries and embracing value addition were critical in driving the countrys economic growth.\n\nThis project is a testament to the many successful partnerships between the Government and the private sector, as we work together to ensure the development of our country, said the President.\n\nThis ceremony follows hard on the heels of other projects which are at various stages of implementation, since the advent of the Second Republic.\n\nThe progress we are seeing here is also a positive result of my Governments Engagement and Re-Engagement Policy that has led to growing confidence in Zimbabwe as a favourable investment destination.\n\nMore companies from our strategic friends and partners, the Peoples Republic of China, and indeed from across the world, remain welcome to invest in our country, he said.\n\nPresident Mnangagwa added that the mining sector plays a crucial role in fostering economic development.\n\nHe said it is a major creator of both direct and indirect employment opportunities, which significantly impact local communities.\n\nThrough investments by industry players, he said, mining operations can improve infrastructure such as roads, schools and healthcare facilities.\n\nIn our economy, the sector not only contributes through export revenue and taxes but also supports ancillary businesses of related downstream industries and services, further driving economic activity, said the President.\n\nThe project, located 20km west of Beitbridge town, seeks to introduce the production of stainless steel.\n\nThe establishment of the park as an integrated mining and energy hub follows discussions between the chairman of Palm River Energy, Mr Xong Xi Dong and President Mnangagwa.\n\nThe first phase of the project, which has been completed, was carried out through a joint venture between the Government, Xintai Resources and Tuli Coal.\n\nAlready a 100 MW thermal power generation plant is currently being commissioned which should produce 50 MW by the end of March.\n\nThe coal wash plant, with a 160 000 tonnes per year capacity, has been completed as well as the chrome smelting plant.\n\nThe park comprises a coking plant that will have an annual capacity of one million tonnes of coke, a ferrochrome smelting plant that will produce 100 000 tonnes of high-carbon ferrochrome and a 1 200MW thermal power plant.\n\nAny surplus electricity will be transmitted to the national grid, while the ferrochrome plant will facilitate the production of special and stainless steel and castings.\n\nIn this regard, it is my expectation that the Palm River Energy Metallurgical Special Economic Zone project will play its part as a critical block for our nations industrialisation and modernisation.\n\nWe look forward to this project helping to drive our national economy forward and unlocking unprecedented opportunities for employment, technological progress and social development, as we march towards the attainment of Vision 2030.\n\nThe President also commended the Zimbabwe Xintai Resources (Pvt) Co. Ltd, under the investment entity Xinganglian (Shanxi) Holding Group Co. Ltd, for their bold decision to invest US$3,6 billion into the Beitbridge metallurgical and energy hub.\n\nHe said it was also important to note that at the heart of the Special Economic Zone lies the integration of energy and metallurgy, which are two critical sectors that have the potential to redefine the industrial landscape.\n\nThese integrated systems and processes highlight the drive towards issues of sustainable mining, low greenhouse gas emissions, low waste production and energy self-sufficiency through recycling of the resultant waste.\n\nI applaud the fact that the project targets the production of 2 million tonnes of chromium-based materials and one million tonne of coke per year, he said.\n\nWhile the growing demand for minerals and metals provides economic opportunities, significant challenges are likely to emerge if the climate-driven clean energy transition is not managed responsibly and sustainably. The planned construction of a 1 200 MW green power and integrated power generation plant by Zimbabwe Xintai Resources (Pvt) Co. Ltd is a welcome initiative, said President Mnangagwa.\n\nHe said some of the ongoing projects by the company as part of its corporate and social responsibility programmes had created employment for the locals, and also provided job training for surrounding communities, as well as offered attachment opportunities for learners in the area.\n\nI am informed that the company, in conjunction with the local leaders, have drilled boreholes, availing clean water for the local community. Plans to set up a clinic as well as a recreational park, among other social infrastructure projects, should be speeded up, he added.\n\nThe Chinese Embassy in Zimbabwes Economic and Commercial Counsellor Mr Huang Mingahai said the country was abundant with economic development opportunities and that the Presidents transformative Zimbabwe is open for business mantra had created a lot of strategic investment opportunities.\n\nHe said a large number of Chinese companies contribute to the countrys economic development with nearly half of them investing in the mining sector.\n\nMr Huang said China and Zimbabwe have common interests to promote mining cooperation based on mutual benefit and win-win outcomes.\n\nChinese enterprises have long prioritised partnerships that align with Zimbabwes socio-economic development goals, he said.\n\nVice Presidents Constantino Chiwenga and Kembo Mohadi, Cabinet Ministers, senior Government officials and the business community witnessed the ground-breaking ceremony.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/HE1-8.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau Zimbabwe is on the right path to industrialisation with more strategic investors now gaining confidence in the Government’s national development trajectory anchored on the robust re-engagement and engagement policy, President Mnangagwa has said. The President said the country was attracting more investment in the infrastructure, mining and energy sectors from both […]",
            "time": "08:41",
            "date": "25 Feb 2025"
        },
        {
            "title": "President signs Nujoma condolences book",
            "url": "https://www.herald.co.zw/president-signs-nujoma-condolences-book/",
            "content": "Mukudzei Chingwere, Herald Reporter\n\nPresident Mnangagwa has described the relationship between Zimbabwe and Namibia as that of twins, deeply intertwined in history, culture and mutual respect.\n\nSpeaking after signing the book of condolences for Namibias founding President Dr Sam Nujoma yesterday at the Namibian Embassy in Harare, President Mnangagwa, who is the SADC Chairman, said the late revered Pan-Africanist had a huge impact in the region.\n\nWe are saddened by the passing on of this great leader of Southern Africa. We, Zimbabwe, cherish his leadership. We were like twins, Zimbabwe and Namibia. So, we say to our brothers and sisters in Namibia we mourn with you, said President Mnangagwa.\n\nCde Nujoma passed on early this month, leaving behind a legacy of leadership in the fight for independence in Namibia and Southern Africa, and his burial is scheduled for Saturday at the National Heroes Acre in the capital Windhoek.\n\nDr Nujoma served as Namibias first president after independence between 1990 and 2005.\n\nIn his condolence message issued soon after the announcement of the death of Namibias founding leader, President Mnangagwa described Dr Nujoma as the last in an iconic generation of leaders of our liberation movements and nations of our Southern Africa region.\n\nWe hurt and grieve deeply at the passing on of this gallant freedom fighter and visionary icon who led and delivered Independence and nationhood to the Namibian people, said President Mnangagwa.\n\nZimbabwe and Namibia share strong historical ties, dating back to the liberation struggles of both nations.\n\nPresident Mnangagwa acknowledged Dr Nujomas steadfast support for Zimbabwe, particularly during the Land Reform Programme, when he stood by Harare despite international pressure, mainly from the West.\n\nZimbabwe will always remember and cherish Dr Nujomas principled and unconditional support as our nation faced concerted onslaught by vindictive countries of the West, he said.\n\nPresident Mnangagwa said Dr Nujomas legacy was that of a true Pan-Africanist, who championed the independence and sovereignty of African nations and urged Africa to remain vigilant against new challenges of resource-induced encroachments.\n\nDr Nujomas demise came after the death in office of President Dr Hage Geingob on February 4 last year, compounding the nations grief.\n\nPresident Mnangagwa expressed solidarity with the Namibian people during this difficult period.\n\nI have no doubt that these repeated tragic losses do not just test your nation; rather, they spur all Namibians on, as they rally together in even greater and stronger unity to move your nation forward, he said.\n\nOn behalf of the Government, the ruling Zanu PF party and the people of Zimbabwe, President Mnangagwa extended his deepest, heartfelt condolences to Namibian President Dr Nangolo Mbumba, the SWAPO party, the Namibian Government and the Nujoma family.\n\nAs Namibia prepares to bid farewell to its founding father, the legacy of Dr Nujoma as a liberation icon and Pan-African visionary remains deeply etched in the history of Southern Africa.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/SM1.jpg",
            "description": "Mukudzei Chingwere, Herald Reporter President Mnangagwa has described the relationship between Zimbabwe and Namibia as that of “twins”, deeply intertwined in history, culture and mutual respect. Speaking after signing the book of condolences for Namibia’s founding President Dr Sam Nujoma yesterday at the Namibian Embassy in Harare, President Mnangagwa, who is the SADC Chairman, said […]",
            "time": "08:41",
            "date": "25 Feb 2025"
        },
        {
            "title": "President set to honour Sam Nujoma at burial",
            "url": "https://www.herald.co.zw/president-set-to-honour-sam-nujoma-at-burial/",
            "content": "Nduduzo Tshuma in Windhoek, Namibia\n\nSADC Chairman President Mnangagwa is set to arrive here on Friday for the burial of Namibias founding father and liberation struggle icon Dr Sam Nujoma who died early this month.\n\nThe revered revolutionary leader died at 95 in a Windhoek hospital on February 8 and has been hailed for his rich legacy at home and across the region.\n\nA memorial service for the late Dr Nujoma will be held at the Independence Stadium on Friday, where President Mnangagwa will be among the key speakers, before burial the next day at Namibias National Heroes Acre in Windhoek.\n\nZimbabwean Ambassador to Namibia Melody Chaurura said yesterday that the Presidents visit highlights the strong bilateral ties between the two countries, dating back to liberation struggle times.\n\nThe Presidents visit speaks to the deep relationship that exists between the two countries, a relationship rooted in the struggle for freedom that delivered the free and independent Namibia we have today, as well as the free and independent Zimbabwe we have today, she said.\n\nIt reflects the depth of our cooperation, which extends beyond politics to Government-level collaboration. It is, therefore, significant that the President is coming to join the Namibian nation at the memorial service on 28 February, which will be followed by the burial on 1 March.\n\nAmbassador Chaurura said Dr Nujomas death was a heavy blow to the Namibian people, coming just a year after the death of the countrys third President, Hage Geingob.\n\nYou can feel it; you could tell from the way the news was received that it was profound, especially considering that President Nujoma was not only a former President but the founding father of Namibia.\n\nIt is no wonder he has also been declared the Father of the Namibian Nation, said Amb Chaurura.\n\nIt has been a very difficult time for the people of Namibia, but the prevailing sentiment is that of continuing the struggle started by the late founding father.\n\nThe people are determined not to betray the spirit of liberation ignited during the fight for independence.\n\nAmbassador Chaurura said Zimbabwe looked forward to deepening bilateral ties with Namibia, building on the solid foundation laid by their forebears and advancing beyond political freedom towards economic emancipation.\n\nOur cooperation with Namibia is strong, but we are working hard to ensure that we fully leverage our solid bilateral relations to enhance business and trade cooperation, she said.\n\nWe still have much work to do to achieve that goal, and we are grateful that Namibia has provided Zimbabwe with a dry port. This will help us realise our vision for regional integration, boosting trade and economic relations between the two countries and across the SADC region.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Untitled-120-680x380.jpg",
            "description": "Nduduzo Tshuma in Windhoek, Namibia SADC Chairman President Mnangagwa is set to arrive here on Friday for the burial of Namibia’s founding father and liberation struggle icon Dr Sam Nujoma who died early this month. The revered revolutionary leader died at 95 in a Windhoek hospital on February 8 and has been hailed for his […]",
            "time": "08:41",
            "date": "25 Feb 2025"
        },
        {
            "title": "Harare has no businesses database",
            "url": "https://www.herald.co.zw/harare-has-no-businesses-database/",
            "content": "Blessings Chidakwa, Herald Reporter\n\nHarare City Council is currently functioning without a comprehensive database of shops and businesses within the city, raising concerns about mismanagement and corruption at the local authority.\n\nThis lack of oversight has reportedly allowed council bosses to allocate themselves sectors to manage, potentially lining their own pockets, The Herald can reveal.\n\nCompounding the issue, the city has been without an Enterprise Resource Planning (ERP) system for six years, leading to significant failures in tracking overall cash flows.\n\nAs a result, Harare has been unable to collect revenue from its 130 beerhalls for 13 years, with three of these establishments having been corruptly sold due to the absence of a proper database.\n\nThe prevalence of fake shop licences has surged, causing the local authority to miss out on potential revenue.\n\nBoth legitimate council officials and impersonators are exploiting loopholes in the business licensing department, extorting money and goods from shop owners without licences.\n\nHarare Mayor Jacob Mafume confirmed the absence of a database.\n\nA contract to monitor those (shops and businesses) was suspended mid-way, he said.\n\nWhen pressed to elaborate, Councillor Mafume became evasive.\n\nHowever, a letter written to Clr Mafume by Ten Ten Tech, which was once engaged by Harare City Council for partial management of its business premises, revealed that in just four years, the private company had collected more than US$20 million.\n\nThe system was in operation from October 2017 to May 2021 and provided comprehensive daily reports regarding the revenue that was collected. This allowed City of Harare officials to be fully aware of revenues accrued at all times.\n\nOver the period that the system was operational a total of US$15 062 851 and ZWL 49 944 432 was collected, reads the letter.\n\nTen Ten Techs contract was terminated amid a cloud of chaos and presently the company is still seeking to be paid for services rendered.\n\nOn his part, Councillor Denford Ngadziore, chairperson of the Small and Medium Enterprises Committee, said that the city is now charging US$50 monthly for small shop licences.\n\nThis is a reduction from the previous US$600 licence fee, which he said had become untenable for many small businesses. The new policy allows for charging fees rather than licences, accommodating the numerous subdivided shops in the city.\n\nYet Clr Ngadziore could not reveal the number of shops that are operating in Harare, which have been accused of snatching customers from established businesses and not paying taxes.\n\nAccording to Clr Ngadziore, the Ministry of Women Affairs, Community, Small and Medium Enterprises Development recognises businesses operating within a 10 by 10-metre space as fitting under the SMEs policy.\n\nThe full implementation of this policy is expected to create an additional 150 000 trading spaces throughout Harare and that could earn the local authority no less than US$7.5 million per month but nothing of that sort exists.\n\nMr Rueben Akili, director of the Combined Harare Residents Association, linked the lack of a business database to the absence of a functional ERP system, suggesting deliberate negligence to enable arbitrage and abuse.\n\nThe failure by the local authority to have a functional ERP system is deliberate so that people may abuse/loot council resources, he said.\n\nMr Precious Shumba, director of the Harare Residents Trust, criticised the councils management, saying that individual managers are looting money without restraint.\n\nHe said, as exposed by the Harare Commission of Inquiry, the chaos within the council benefits corrupt cartels, hampering efforts for proper governance and accountability.\n\nThe city is financially porous and opaque, Mr Shumba noted.\n\nResidents are suffering from inadequate water supplies, uncollected refuse and poorly maintained roads while sewer and water pipe bursts are not addressed promptly.\n\nA special committee report on Rufaro Marketing, which manages council beerhalls, indicated that both current and former council officials were subletting these properties in foreign currency while paying minimal fees to the municipality. Furthermore, the Harare Quarry company has reportedly not remitted any revenue to the city, raising suspicions of collusion between company bosses and council officials.\n\nThe Commission of Inquiry into the affairs of Harare recently heard that top council officials were earning hefty salaries and allowances with some pocketing up to US$30 000 monthly.\n\nAmid all the chaos the local authority has maintained an opaque financial system, with the last audit conducted in 2020, exacerbating concerns about governance and accountability in Harare.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/09/Mayor-Jacob-Mafume.jpg",
            "description": "Blessings Chidakwa, Herald Reporter Harare City Council is currently functioning without a comprehensive database of shops and businesses within the city, raising concerns about mismanagement and corruption at the local authority. This lack of oversight has reportedly allowed council bosses to allocate themselves sectors to manage, potentially lining their own pockets, The Herald can reveal. […]",
            "time": "08:41",
            "date": "25 Feb 2025"
        },
        {
            "title": "VPs hail Beitbridge Economic Zone as key to Mat South’s growth",
            "url": "https://www.herald.co.zw/vps-hail-beitbridge-economic-zone-as-key-to-mat-souths-growth/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nVice Presidents Constantino Chiwenga and Kembo Mohadi have described the US$3,6 billion Energy Metallurgical Special Economic Zone and Industrial Park, that has been set up in Beitbridge, as a game changer which can drive economic development in Matabeleland South.\n\nVice President Chiwenga said the ground-breaking ceremony by President Mnangagwa was a significant milestone in Zimbabwes journey towards industrialisation, sustainable development and economic growth.\n\nPresident Mnangagwas steadfast commitment to engagement and re-engagement has made significant strides in improving the countrys investment climate, streamlining the ease of doing business and building investor confidence, he said.\n\nThe Government had laid a solid foundation for sustainable economic growth and the prioritisation of economic diplomacy was critical in strengthening international relations and positioning the country as a leading destination for investment.\n\nWe are thankful to his life of dedication to transforming our economy and uplifting the livelihoods of the people\n\nHe said the Metallurgical Special Economic Zone, located 20km west of Beitbridge town, seeks to introduce the production of stainless steel in the country.\n\nThis would create more jobs for the Beitbridge community and also have spillover positive effects on related downstream industries.\n\nThe energy and steelworks initiative has already employed 400 local workers in its first year, with the expectation that it will ultimately employ over 2 000 people once it becomes fully operational.\n\nOn his part, VP Mohadi said the Second Republic under President Mnangagwa continued to roll out life changing projects.\n\nWe appreciate this Special Economic Zone project which will drive the economy of Matabeleland South and also feed into the national development growth initiatives, said Vice President Mohadi.\n\nThis project also comes after the milestone Beitbridge border modernisation project which is a high-impact project that has also created thousands of jobs for the local community.\n\nI want to commend our President for his visionary leadership that has also contributed to the growth of key investments countrywide.\n\nVP Mohadi said Government would continue to promote investment in key infrastructure development countrywide. He said it was also important for community members to embrace economic development programmes and actively participate in nation-building.\n\nMatabeleland South Minister of State for Provincial Affairs Dr Evelyn Ndlovu said; We appreciate this kind of investment in our province which signals the beginning of a long journey to industrialise Matabeleland South. This industrial park will play a crucial role in the attainment of the envisaged vision 2030.\n\nIn line with the devolution of power, the project would provide over 10 000 jobs over 12 years reducing unemployment and boosting the local economy through generating revenue for the much-needed public service in terms of taxes.\n\nThe Minister said the completion of the initiative will contribute to driving mining development in the province and nationally.\n\nChairman of the Xinganglian Metallurgy company, Mr Zhou Xudong, the implementing partner in the project, said they would introduce a scholarship fund worth US$500 000 in the next two years to fund the education of exceptional students from Beitbridge to study in China.\n\nThey would also build a clinic and help improve the learning facilities at the Makakavhule primary school which is located within the industrial parks catchment area.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/VPs.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau Vice Presidents Constantino Chiwenga and Kembo Mohadi have described the US$3,6 billion Energy Metallurgical Special Economic Zone and Industrial Park, that has been set up in Beitbridge, as a game changer which can drive economic development in Matabeleland South. Vice President Chiwenga said the ground-breaking ceremony by President Mnangagwa was a […]",
            "time": "08:41",
            "date": "25 Feb 2025"
        },
        {
            "title": "Zim death penalty abolition: Human rights milestone",
            "url": "https://www.herald.co.zw/zim-death-penalty-abolition-human-rights-milestone/",
            "content": "Herald Correspondent\n\nZimbabwe has taken a historic step in advancing human rights by officially abolishing the death penalty, Minister of Justice, Legal and Parliamentary Affairs Ziyambi Ziyambi told the High-Level Segment of the 58th Session of the Human Rights Council in Geneva, Switzerland, yesterday.\n\nMinister Ziyambi said the Death Penalty Abolition Act, enacted on December 31, 2024, aligns Zimbabwes legal framework with international human rights standards.\n\nThe right to life is the cornerstone of all human rights.\n\nThis milestone strengthens our justice system, ensuring it is built on dignity, equity and respect for the sanctity of human life.\n\nThe new law removes all references to capital punishment from Zimbabwes statutes and, most particularly, as a sentence for aggravated murder by a adult male, the one crime where the Constitution still allowed Parliament the option to pass a law allowing a death penalty, an option Parliament has now renounced.\n\nThose previously sentenced to death will be resentenced under a system that prioritises fairness and human dignity. The abolition Act allows sentences of between 20 years and life imprisonment for aggravated murder, depending on circumstances.\n\nZimbabwe has also introduced major judicial reforms to improve access to justice.\n\nCourts and the Legal Aid Directorate have been decentralised and a performance management system has been implemented to enhance judicial efficiency.\n\nAdditionally, the Integrated Electronic Case Management System is being expanded to lower courts, improving legal processes.\n\nWe are committed to ensuring that justice is not only accessible but also efficient and effective, said Minister Ziyambi.\n\nThe Minister also addressed Zimbabwes climate challenges, which have been worsened by El Nio-induced droughts. To mitigate the impact, the Government is implementing the Presidential Climate-Proof Agriculture Production Scheme, which prioritises mechanisation and irrigation.\n\nAs a result, Zimbabwe has achieved self-sufficiency in wheat production and was awarded the 2024 Africa Food Prize for its efforts in sustainable agriculture and food security.\n\nRegionally, Zimbabwe continues to play a leadership role as the current SADC Chair.\n\nMinister Ziyambi said the country remained committed to fulfilling its international human rights obligations.\n\nZimbabwe will submit its required periodic in March and will host the Working Group on Violence Against Women and Girls in August.\n\nMinister Ziyambi condemned the unilateral coercive measures imposed by Western nations on Zimbabwe saying they negatively impacted Zimbabwes economy and the well-being of its people.\n\nThese measures violate the UN Charter, and we strongly denounce them, he said while calling for their immediate and unconditional lifting.\n\nMinister Ziyambi reaffirmed Zimbabwes dedication to justice, human rights and sustainable development.\n\nIn unity, we can overcome adversity and emerge stronger, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/ZZ.jpg",
            "description": "Herald Correspondent Zimbabwe has taken a historic step in advancing human rights by officially abolishing the death penalty, Minister of Justice, Legal and Parliamentary Affairs Ziyambi Ziyambi told the High-Level Segment of the 58th Session of the Human Rights Council in Geneva, Switzerland, yesterday. Minister Ziyambi said the Death Penalty Abolition Act, enacted on December […]",
            "time": "08:41",
            "date": "25 Feb 2025"
        },
        {
            "title": "EDITORIAL COMMENT: Cooperation can  overcome our emergencies",
            "url": "https://www.herald.co.zw/editorial-comment-cooperation-can-overcome-our-emergencies/",
            "content": "When Zimbabweans pull together we are able to achieve some quite astonishing successes, even when we might not really notice how successful we are since everything worked so smoothly.\n\nThe latest example of this is how we coped as a nation with the worst drought in living memory last year, with most rural households seeing little or nothing in the way of a harvest, the commercial crop with its supplementary irrigation being very limited, and the reserve stocks built up in the previous season and carried over being quite inadequate to fill all needs although extremely useful.\n\nThe Government moved rapidly and in time to work out a rational and workable swathe of solutions to ensure that not only would no one go hungry, but that we would all have to pull together and no one would be able to profiteer. The private sector would thus be able to keep functioning and be part of the solution.\n\nThere was some emergency rebudgeting to ensure that the Government had the money to buy the grain needed to supply every rural family that was going to be short of food with a monthly ration of grain, with this scheme widened later to ensure that very vulnerable urban families had a modest monthly allowance to buy commercial mealie meal.\n\nThe fiscal discipline of the Second Republic ensured that this could be done, and while there was some very worthwhile response to President Mnangagwas international appeal for help, Zimbabwe had to do much of the required financing itself to keep hunger at bay.\n\nThe Government made the second major decision when it decided that it would buy the carried-over reserves held by the Grain Marketing Board and buy the very modest surpluses, largely from farmers in exceptionally good areas most of whom also had some supplementary irrigation. That gave it, with the odd adjustments and including wheat reserves, enough grain for the tri-monthly rations to the vulnerable rural households.\n\nThe milling companies were told they would be unable to buy maize from the GMB and would have to import, enough warning being given when it became obvious that the harvest was going to be bad so they could set up their supply chains and get together with their bankers to work out the advance financing and the foreign currency that would be required.\n\nThere was an obvious danger that while everyone hoped most private sector companies would behave responsibly, there was bound to be someone, based on previous experience, who might try to profiteer through assorted skulduggery.\n\nImport permits could perhaps be accumulated so that everyone else would have to pay a fee to the lucky holder, or someone could try and create an artificial shortage and so drive up prices. There were a host of possibilities.\n\nThe Government announced it would be monitoring orders, deliveries and supplies but perhaps the smartest move taken was to make sure that there was no rationing and that any miller seeking an import permit could have one. That led to permits for more than 5 million tonnes of grain, possibly a three-year supply assuming that our farmers grew absolutely nothing over that time.\n\nObviously nothing like that was going to be imported, since no one had the money to do so and no one would be so irrational, but it did mean that no one could manipulate the markets. Millers, when Zimbabwean harvests are adequate, do buy some of their local grain in advance, but also rely on normal commercial cash flows to buy from the GMB as and when they need grain. At worst you can buy from the GMB on Monday, mill the grain on Tuesday, deliver the bags of mealie meal on Wednesday and start having your money back by Friday, although it is very rarely that extreme.\n\nThe imports meant that more payments were needed in advance, to cope with the longer delivery times if nothing else although there was also need to secure supplies. Bankers were thus also monitoring, and wanted to ensure that anybody having to borrow for a shipment was going to pay back, soon. The interest rates would also ensure that borrowers did not want long loans tied up in overstocking, especially as competitors could also arrange their own imports, thanks to the Government refusal to ration licences and might do so more efficiently.\n\nSo it worked rather well and more than 1 million tonnes of maize was almost routinely imported by the millers, who kept their factories working well and kept their competitive market supplied, which meant normal business for retailers and normal supplies for customers. You can walk into a supermarket and find several brands on the shelves, which is a sign of competitive normality.\n\nSo it has all worked out rather well, and by April we are all hoping to see at least a reasonable harvest starting to come in and probably one with some surpluses that can help rebuild the emergency strategic stockpile so we are ready for the next bad season.\n\nThe millers hope for the same and will be eagerly waiting for the go-ahead to return to local buying. It is far simpler and easier to send your trucks round to the nearest GMB depot, or have a contract with a local farmer, than have to work out complex ordering and delivery logistics with imports. So unused licences will remain unused. Those who hoped to make money from a permit through manipulation are already sitting with unusable paper, as the Government saw through the potential schemes from the start and was by simple policies able to block them without any fuss.\n\nWhen we think about it, we have that remarkable achievement of everyone pulling in the same direction to make sure that as households and as a country we did not run short of food. A set of sensible, and self-correcting, Government policies created the framework for this spectacular success, and then we had that remarkable co-operative set of Government and private sector efforts that made sure we had enough food on our plates wherever we lived.\n\nThis is what happens in Zimbabwe when we do pull together. We have done it before; we just need to think about that Covid-19 pandemic to remember what happens when we are all playing on the same team with our Government policies providing a proper framework.\n\nThis sort of pulling together, within a given framework that encourages responsible efforts and makes a lot of dubious paper shuffling impossible, should be routine as we overcome our challenges and move forward, individually, as families, as communities, as businesses and as a country.\n\nA serious emergency last year was overcome, and when we reflect on the apparent ease of that success, we need to remember that it was achieved because a lot of people played their parts to perfection and so all those efforts added up to a major success.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2013/11/The-Grain-Marketing-Board.jpg",
            "description": "When Zimbabweans pull together we are able to achieve some quite astonishing successes, even when we might not really notice how successful we are since everything worked so smoothly. The latest example of this is how we coped as a nation with the worst drought in living memory last year, with most rural households seeing […]",
            "time": "08:41",
            "date": "25 Feb 2025"
        },
        {
            "title": "‘Strengthen wildlife protection for future generations’",
            "url": "https://www.herald.co.zw/strengthen-wildlife-protection-for-future-generations/",
            "content": "Ivan Zhakata, Herald Correspondent\n\nMINISTER of Environment, Climate and Wildlife, Dr Sithembiso Nyoni has called on the Zimbabwe National Parks and Wildlife Management Authority (ZimParks) board and newly appointed director-general Professor Edson Gandiwa to enhance efforts to preserve Zimbabwes wildlife for the future.\n\nSpeaking at a meeting at the ZimParks headquarters, Minister Nyoni said the Authority plays an important role as a source of national pride.\n\nShe urged the board to restore the cultural and historical significance of parks like Matobo, which was once known for its rocky terrain and rain-making mountains before colonial influences reshaped its meaning.\n\nNational parks are a source of national pride which must be preserved for the benefit of future generations, Minister Nyoni said.\n\nI urge the board to work together with management to restore the glory that our parks such as Matobo formerly had.\n\nWhile commending ZimParks for its achievements in reducing poaching and human-wildlife conflicts, Minister Nyoni set clear goals for 2025.\n\nShe called for a hands-on approach in managing Zimbabwes conservation areas which cover 13 percent of the countrys land.\n\nI expect the board to be hands-on, and not remote control, Minister Nyoni said urging improved law enforcement to protect key species such as elephants, rhinos and lions.\n\nShe also urged the board to find solutions to mitigate conflicts with communities near parks.\n\nMinister Nyoni said there was also need for resource mobilisation, suggesting partnerships with corporations and foundations to fund conservation projects.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/12/Cde-Sithembiso-Nyoni.jpg",
            "description": "Ivan Zhakata, Herald Correspondent MINISTER of Environment, Climate and Wildlife, Dr Sithembiso Nyoni has called on the Zimbabwe National Parks and Wildlife Management Authority (ZimParks) board and newly appointed director-general Professor Edson Gandiwa to enhance efforts to preserve Zimbabwe’s wildlife for the future. Speaking at a meeting at the ZimParks headquarters, Minister Nyoni said the […]",
            "time": "08:41",
            "date": "25 Feb 2025"
        },
        {
            "title": "Musician revives Maungwe legacy",
            "url": "https://www.herald.co.zw/musician-revives-maungwe-legacy/",
            "content": "Trust Khosa\n\nPhenomenal lyricists Leonard Zhakata and the late Thomas Makion were in a league of their own.\n\nTheir remarkable success has left an indelible mark, which put Manicaland province on the international map through their beautiful music. Twenty-four years after Makions death, many still feel the absence of this dynamic duo, who penned chart-toppers like Tungidza Gwenya and Shungu Dzemoyo before their split at the peak of their careers.\n\nAt the height of their careers with the Maungwe Brothers, Zhakata composed the hit song Mugove, while Makion delivered the club banger Makorokoto, solidifying their impact on the music scene.\n\nFollowing the death of Makion, there were genuine concerns that their unique touch might never be replicated, especially in the absence of heirs.\n\nHowever, Freddy Biggaz Zhakata, a relative to both Makion and Zhakata, believes he has what it takes to carry on the family legacy. With Zhakata still alive, Biggaz has a torchbearer from whom to learn.\n\nBiggaz expressed confidence that the familys musical legacy continues to inspire generations.\n\nHis remarks come at a time when he is preparing to release his third album, coinciding with the 24th anniversary of his uncle Makions passing.\n\nMakion, who died in August 2001, was also Biggazs uncle, making Zhakata his other uncle. In an interview with The Herald Arts, Biggaz shared his optimism about keeping the family legacy alive:\n\nComing from a rich musical background has its fair share of challenges, but I am not the one to shy away. I am currently in the studio working on my third album titled Kasumbu/Full Package, which is set to launch in conjunction with the 24th anniversary of my uncle Thomas Makion.\n\nI am nearing the end of the production process, and I believe this album will inspire both old and new fans of Makion and Zhakata.\n\nThe 43-year-old, who has released two albums  Bhora Mberi in 2015 and Iniwo Zvangu in 2017 along with a series of singles  has vowed to make a lasting impression on the local music landscape. I dont want to promise too much, but I assure Team Maungwe (Biggazs band name) that we are not here to add numbers.\n\nWe have given fans several singles like Dzingori Hope, Vanodongorera, and Zvese Imomo, which are still doing well. The single Zvese Imomo which has an accompanying video, topped the charts at our Manicaland radio station, Diamond FM, and many people have been wondering who is behind the track, prompting me to step in, he stressed. To ensure that Makions beautiful voice is not interred with his remains, he has roped in Thomas Makion Junior for possible collaborations. I cannot afford to ignore Junior (Makions son) because we are the rightful people to keep this legacy going. We might not reach their level, but I can assure you that we have what it takes to do better and be counted among the stars.\n\nIt has always been my wish to ensure that we put our family name on the world map for good reasons. I am beginning to see light at the end of the tunnel because we are super talented and united as the children of the pioneers of Maungwe music, started by our elders.\n\nBiggaz, whose originality has been under scrutiny over the years, noted that it was hard to please people.\n\nI appreciate constructive criticism because it allows us to grow and be counted among the top stars. Of course, my music will always carry some elements of Makion and Zhakatas feel, but on this album that we are recording at Chrome Studios in Mabvuku, I have tried my best to be distinct. I have created a new sound that many people will certainly identify me with.\n\nI love music because its therapy on its own, helping people recover from stress-related challenges. In my case, I am also creating music to help those in despair and the downtrodden by penning powerful compositions that will be cherished for years to come, he said. Biggaz lamented the lack of sponsorship as one of his major challenges.\n\nIn Zimbabwe, its very difficult to break through or win the hearts of top music promoters without connections.\n\nMost promoters tend to favour those who have already made a breakthrough or established names in showbiz. It is no longer about arts promotion but business, as promoters are jostling for the same artistes who are already popular, leaving emerging musicians with potential at risk of being forgotten or remaining nonentities despite their talent, he bemoaned.\n\nBorn in Rusape, Biggaz completed both his primary and secondary education in rural areas. He only moved to Harare after graduating from high school and began marketing. Now a city dealer, Biggaz has not forsaken his undying love for music. He is married and blessed with three kids  one girl and two boys. With age still on his side, he believes he has plenty to offer and aims to make his uncle Makion smile from his grave.\n\nHe considers himself lucky that Zhakata is still alive to guide him.a\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Freddy-Zhakata.jpg",
            "description": "Trust Khosa Phenomenal lyricists Leonard Zhakata and the late Thomas Makion were in a league of their own. Their remarkable success has left an indelible mark, which put Manicaland province on the international map through their beautiful music. Twenty-four years after Makion’s death, many still feel the absence of this dynamic duo, who penned chart-toppers […]",
            "time": "08:41",
            "date": "25 Feb 2025"
        },
        {
            "title": "ZIM, IRELAND T20I FINALE UNDER FLOODLIGHTS",
            "url": "https://www.herald.co.zw/zim-ireland-t20i-finale-under-floodlights/",
            "content": "Eddie Chikamhi, Zimpapers Sports Hub\n\nThe last match of Irelands tour of Zimbabwe will be played under floodlights at Harare Sports Club this evening as the hosts look to script a happy ending to this burgeoning cricket rivalry.\n\nThe match is scheduled to start at 6:30pm.\n\nBarring adverse weather conditions, the third Twenty20 International should provide a befitting finale for the enthusiastic home cricket fans.\n\nThe supporters left the stadium in a celebratory mood on Sunday after the Chevrons sneaked home to an unlikely victory and took a 1-0 lead in the three-match series.\n\nInterestingly, Zimbabwe hosted Ireland for their first-ever international match under the lights at Harare Sports Club in December 2023.\n\nThat series saw the Chevrons clinch a 2-1 victory, marking their last series win until now.\n\nZimbabwe have since faced a series of droughts in T20I, but their recent performance against Ireland in the One Day Internationals hints at renewed faith and determination.\n\nThe Chevrons recently ended a two-year ODI series jinx when they edged the visitors 2-1 at the same venue.\n\nHistorically, clashes between Zimbabwe and Ireland are known for their intensity and closely contested out-comes.\n\nStatistics reveal an evenly matched rivalry, with each team winning eight out of their 17 T20I encounters since 2014.\n\nThere has been only one no result, following the abandonment on Saturday of the first T20I because of rain.\n\nBut on Sunday, middle-order batsman Tony Munyonga was the toast of the Zimbabwean team after he turned the game on its head to give the hosts a hard-fought win from a difficult position.\n\nJust as many were tempted to give up hope as the Chevrons continued to lose wickets chasing Irelands 137/8, Munyonga ensured the home team crossed the line with his resolute batting.\n\nHis unbeaten 43 runs from just 30 balls won him the Man of the Match, after Zimbabwe finished 141/7 and claimed a three-wicket win.\n\nMunyonga looked unfazed despite the top-order batting challenges that haunted players from both sides, with Ireland bowlers looking threatening after claiming a couple of wickets.\n\nThe 26-year-old right-hander kept the home team in the hunt after featuring in partnerships with Sikandar Raza, Wellington Masakadza, and then a crucial 29-run partnership with Richard Ngarava, who made an important cameo with his 12 runs off seven deliveries.\n\nWe sort of liked to put ourselves in a position where we just needed to keep on batting and get the team over the line, said Munyonga.\n\nObviously, thats the end goal, but being in the process and enjoying the moment as well. I think that was the most important thing that we talked about (in the middle).\n\nZimbabwe would need to work more on their top order, which has not done justice in the two innings of this series.\n\nZimbabwe lost their top three wickets inside the opening four overs, with Tadiwanashe Marumani, Brian Bennett, and Wessly Madhevere departing for single-digit scores in the last match and piled the pressure on the middle order.\n\nThe top-order batters know they owe the team some runs and would need to make amends if they get the thumbs up to start.\n\nSkipper Raza and Ryan Burl held the innings together in the middle overs with a 48-run partnership. But then most of the work was left for the lower middle order, where Munyonga demonstrated composure and the zeal to win. Skipper Raza is tipping Munyonga to continue with his form.\n\nIm just really happy for Tony (Munyonga) as well. Hes gone back to domestic cricket.\n\nHe was one of the leading run scorers in the List A competition as well, and so Im really, really happy for him, and for him to be awarded the Man of the Match is, I think, Im a lot happier for him than he is for himself as well.\n\nAnd hopefully, this is the start of many more Man of the Matches to come for him.\n\nWe know we can hit a long ball as well. Sometimes you need luck, and we have that, but I thought Tony was a lot calmer, and he hit those gaps and hit those pockets, and he ran really well.\n\nSo, that was a credit to those two as well.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/TONY-MUNYONGA.jpg",
            "description": "Eddie Chikamhi, Zimpapers Sports Hub The last match of Ireland’s tour of Zimbabwe will be played under floodlights at Harare Sports Club this evening as the hosts look to script a happy ending to this burgeoning cricket rivalry. The match is scheduled to start at 6:30pm. Barring adverse weather conditions, the third Twenty20 International should […]",
            "time": "08:41",
            "date": "25 Feb 2025"
        }
    ]
}