{
    "news": [
        {
            "title": "Ministers July Moyo, Edgar Moyo reassigned",
            "url": "https://www.herald.co.zw/ministers-july-moyo-edgar-moyo-reassigned/",
            "content": "Online Reporter\n\nPresident Mnangagwa has swapped Public Service, Labour and Social Welfare Minister July Moyo and Energy and Power Development Minister Edgar Moyo with immediate effect.\n\nThe reassignment means Minister July Moyo is now Energy and Power Development Minister while Minister Edgar Moyo is now Public Service, Labour and Social Welfare Minister.\n\nThe Chief Secretary to the President and Cabinet Dr Martin Rushwaya announced the reassignment in a statement issued on Friday evening.\n\nMinister Edgar Moyo\n\nThe reassignments were made in terms of Subsection 1 of Section 104 of the Constitution of Zimbabwe,\n\nMeanwhile, the President has also appointed Zimbabwe Parks and Wildlife Management Authority Director General Dr Fulton Mangwanya as the Director General in the Presidents Department with immediate effect.\n\nThe appointment was also announced by the Chief Secretary to the President and Cabinet Dr Martin Rushwaya.\n\nIt was done in terms of Section 226(1) of the Constitution of Zimbabwe.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/10/Minister-July-Moyo.jpg",
            "description": "Online Reporter President Mnangagwa has swapped Public Service, Labour and Social Welfare Minister July Moyo and Energy and Power Development Minister Edgar Moyo with immediate effect. The reassignment means Minister July Moyo is now Energy and Power Development Minister while Minister Edgar Moyo is now Public Service, Labour and Social Welfare Minister. The Chief Secretary […]",
            "time": "20:39",
            "date": "03 Jan 2025"
        },
        {
            "title": "Heavy rainfall expected this weekend",
            "url": "https://www.herald.co.zw/heavy-rainfall-expected-this-weekend/",
            "content": "Precious Manomano\n\nHerald Reporter\n\nThe Meteorological Services Department is forecasting heavy rainfall this weekend, particularly on Saturday and Sunday afternoon, in Mashonaland, Manicaland, and Midlands provinces.\n\nOn Saturday morning, weather conditions are expected to be partly cloudy and mild, with a chance of showers in Matabeleland North and Mashonaland West.\n\nAs the day progresses, the rest of the country will remain partly cloudy and warm.\n\nIn light of the forecasted thunderstorms, the department urges the public to stay indoors when thunder is heard to ensure safety.\n\nThe country is currently experiencing moist and unstable weather, which has led to widespread thunderstorms and heavy rainfall.\n\nRecent rainfall data indicates that significant amounts were recorded in the past 24 hours, with Binga receiving 130 mm, followed by Matopos (35 mm), Kadoma (33 mm), Plumtree (32 mm), and Gokwe (30 mm).\n\nGweru recorded 21 mm, Chibhero (26 mm), Zvishavane and Kezi (19 mm) each. Other areas reported rainfall amounts below 15 mm.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/The-Meteorological-Services-Department.jpg",
            "description": "Precious Manomano Herald Reporter The Meteorological Services Department is forecasting heavy rainfall this weekend, particularly on Saturday and Sunday afternoon, in Mashonaland, Manicaland, and Midlands provinces. On Saturday morning, weather conditions are expected to be partly cloudy and mild, with a chance of showers in Matabeleland North and Mashonaland West. As the day progresses, the […]",
            "time": "20:39",
            "date": "03 Jan 2025"
        },
        {
            "title": "Vision 2030 fast becoming a reality",
            "url": "https://www.herald.co.zw/vision-2030-fast-becoming-a-reality/",
            "content": "Blessings Chidakwa\n\nHerald Reporter\n\nThe realisation of vision 2030 is fast becoming a reality as witnessed by various signature projects completed and ongoing nationwide.\n\nSpeaking during a Mashonaland East provincial media tour, Information, Publicity, and Broadcasting Services Minister Dr Jenfan Muswere said the construction of Chivhu Dam was not an end itself but has unlocked vast opportunities that feed into the economy and eventually Vision 2030.\n\nChivhu Dam represents an integration of a number of activities to ensure that the dam on its own is an integral part of the economy, he said.\n\nIt does not only become an end in itself but also develops many other tributaries that are related to tourism, related to domestic and industrial use of water and also in terms of irrigation development, which development is currently supporting more than 70 households.\n\nMinister Muswere said the dam also includes economic empowerment, which is direct in that all the farmers around the dam infrastructure will be supported in terms of agriculture.\n\nAs we all know that plants, crops do not actually need rainfall, but they need water. So by developing the damning infrastructure it is an integral part of road development, he said.\n\nIt ensures that we achieve an upper middle-income society, which is empowered society by the 2030.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/06/Dr-Muswere.jpg",
            "description": "The realisation of vision 2030 is fast becoming a reality as witnessed by various signature projects completed and ongoing nationwide.",
            "time": "20:39",
            "date": "03 Jan 2025"
        },
        {
            "title": "HARARE Athletic Board to host season opener",
            "url": "https://www.herald.co.zw/harare-athletic-board-to-host-season-opener/",
            "content": "Ellina Mhlanga\n\nZimpapers Sports Hub\n\nHARARE Athletic Board will get their 2025 activities underway on Sunday with a cross-country season opener at David Livingstone School.\n\nThe event is targeting athletes from as young as Under-10s to seniors. Senior men and women will compete in 8km while the Under-18 boys, Under-20 girls and Under-20 boys compete in 6km.\n\nUnder-18 girls and Under-16 boys will run 4km. Under-16 girls will be up for the 3km race while the Under-14s and Under-10s will compete in 2km and 1km events respectively.\n\nThe boards vice chairperson Aaron Whyte said being a season opener, the event is open to all athletes including sprinters as athletes and coaches assess their preparedness for the season.\n\nIt is a transition from pre-competition to the competition phase, but also, we need to take cognisance that we have got other athletes who are not specifically middle long-distance runners, like some sprinters, who might want to use cross-country just for conditioning. So, we also want to accommodate those athletes, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/s-1-680x380.jpg",
            "description": "Ellina Mhlanga Zimpapers Sports Hub HARARE Athletic Board will get their 2025 activities underway on Sunday with a cross-country season opener at David Livingstone School. The event is targeting athletes from as young as Under-10s to seniors. Senior men and women will compete in 8km while the Under-18 boys, Under-20 girls and Under-20 boys compete […]",
            "time": "20:39",
            "date": "03 Jan 2025"
        },
        {
            "title": "Chivhu water woes to end",
            "url": "https://www.herald.co.zw/chivhu-water-woes-to-end/",
            "content": "Blessings Chidakwa in CHIVHU\n\nWater shortages that used to bedevil Chivhu Town are now a thing of the past as the Government has constructed a water treatment plant at the Chivhu dam with reservoirs now only the outstanding issue.\n\nThe earth dam with a holding capacity of 26 million cubic metres, will see the town increasing its pumping capacity from 150 cubic metres of water per hour to 450 cubic metres.\n\nSpeaking during a Mashonaland East provincial media tour at Chivhu Dam, Mashonaland East Provincial Affairs and Devolution Minister Dr Apolonia Munzverengwi said the development taking place in the province is through the visionary leadership of President Mnangagwa.\n\nSo apart from the dam, you are going to see the other projects, the treatment plant. Chivhu town was experiencing shortage of water, she said.\n\nNow it is going to be a thing of the past. All, what we are requesting from the engineer and the Agricultural Minister Anxious Masuka, is to finish the last part, the construction of the tanks. so that the water can now go into our household in town, she said.\n\nInformation, Publicity, and Broadcasting Services Minister Dr Jenfan Muswere is leading the provincial tours.\n\nChikomba West legislator also Minister of Information Communication Technology, Postal and Courier Services Dr Tatenda Mavetera and Information, Publicity and Broadcasting Services Deputy Minister Omphile Marupi are among also part of the delegation.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Dr-Muswere-Post-Cabinet-briefing-1.jpg",
            "description": "Blessings Chidakwa in CHIVHU Water shortages that used to bedevil Chivhu Town are now a thing of the past as the Government has constructed a water treatment plant at the Chivhu dam with reservoirs now only the outstanding issue. The earth dam with a holding capacity of 26 million cubic metres, will see the town […]",
            "time": "20:39",
            "date": "03 Jan 2025"
        },
        {
            "title": "PAZ slams route wars among public transport operators",
            "url": "https://www.herald.co.zw/paz-slams-route-wars-among-public-transport-operators/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nPassengers Association of Zimbabwe (PAZ) has raised alarm over the escalating route wars among rival public transport operators saying the clashes were putting passengers safety at serious risk.\n\nIn a statement, PAZ national coordinator Mr Tafadzwa Goliati expressed concern over the growing incidents of intimidation, violence and coercion in the public transport sector.\n\nThese route wars are creating a hostile and unsafe environment for passengers, Mr Goliati said.\n\nThe aggressive competition among operators is overshadowing the core principles of safety and customer satisfaction, which should be the bedrock of public transport.\n\nReports indicate that rival operators were increasingly resorting to violence to dominate lucrative routes, with passengers often caught in the crossfire.\n\nSome passengers have reported being forced to board specific vehicles or face harassment.\n\nNo one should be compelled to board a vehicle against their will, Mr Goliati said.\n\nPassengers have the fundamental right to choose their preferred operator. Any form of intimidation or coercion is unacceptable and must be condemned.\n\nThe association has called on the Government and relevant authorities to take decisive action to regulate the public transport sector and prevent further incidents.\n\nWe urge authorities to intervene swiftly to restore order and protect the rights of passengers, Mr Goliati said.\n\nAt the same time, we encourage passengers to report any cases of violence or intimidation to PAZ or law enforcement.\n\nAs Zimbabwes public transport system grapples with these challenges, PAZ has urged all stakeholders to work collaboratively to build a safe, reliable and customer-focused network.\n\nThe safety and well-being of passengers must come first. Let us prioritise this as we address these pressing issues, Mr Goliati said.\n\nThe escalating tension among operators highlights the urgent need for reforms to ensure the public transport sector serves its primary purpose: the safe and efficient movement of people.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/a-680x380.jpg",
            "description": "Passengers Association of Zimbabwe (PAZ) has raised alarm over the escalating “route wars” among rival public transport operators saying the clashes were putting passengers’ safety at serious risk.",
            "time": "20:39",
            "date": "03 Jan 2025"
        },
        {
            "title": "Chivhu dam transforming lives",
            "url": "https://www.herald.co.zw/chivhu-dam-transforming-lives/",
            "content": "Blessings Chidakwa\n\nHerald Reporter\n\nChivhu Dam has been a game changer transforming lives through various supporting initiatives around it such as an irrigation scheme, a water treatment plant as well as a fisheries project\n\nTourism is also set to benefit from the water body, with recreational activities such as boating, fishing, picnic, camping and other water activities coming in play.\n\nSince 2017 when President Mnangagwa came into office he has initiated various water projects across the country, with many of them already completed.\n\nOther projects are still going on, and at different levels of completion. The benefits were evident during a Mashonaland East provincial media tour at Chivhu Dam where Information, Publicity, and Broadcasting Services Minister Dr Jenfan Muswere, Mashonaland East Provincial Affairs and Devolution Minister Dr Apolonia Munzverengi among other Government officials.\n\nSpeaking during the media tour, Chikomba West legislator, who is also Information Communication Technology, Postal and Courier Services Minister Dr Tatenda Mavetera said the visionary leadership of President Mnangagwa was transforming lives.\n\nWe really want to thank his Excellency our President for his visionary leadership, which has also seen him coming up with this project, which has benefitted the people of Chikomba West, she said.\n\nWe are also happy that even in terms of the fisheries, we have got various groups that are here, from the war veterans, from the women, from the youth, which are also benefitting.\n\nMinister Mavetera said she was also happy that the dam has really brought employment for youths in Chikomba West.\n\nNo one is being left behind. We are also happy that projects are happening to our own Chikomba West, she said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/8fef4e63-7599-4e9d-8552-107504fcf4c1-680x380.jpeg",
            "description": "Chivhu Dam has been a game changer transforming lives through various supporting initiatives around it such as an irrigation scheme, a water treatment plant as well as a fisheries project.",
            "time": "20:39",
            "date": "03 Jan 2025"
        },
        {
            "title": "Mutamba takes over reins at ZRP",
            "url": "https://www.herald.co.zw/mutamba-takes-over-reins-at-zrp/",
            "content": "Zvamaida Murwira\n\nSenior Reporter\n\nNewly appointed Zimbabwe Republic Police Commissioner General Steven Mutamba has officially taken over the reins at the countrys law enforcement agency at a colourful ceremony held on Friday at Mkushi Police Academy.\n\nFormer Commissioner-General Godwin Matanga hands over the flag to incoming Commissioner General Stephen Mutamba.\n\nComm Gen Mutamba took over from Comm Gen Godwin Matanga who retired at the end of 2024.\n\nIt was a hive of activity as guests that included Home Affairs and Cultural Heritage Minister Kazembe Kazembe witnessed change of guard at the police service.\n\nThe showers that fell during the event did not deter the spirit of guests, senior and junior officers that attended the event.\n\nIn his speech Comm Gen Mutamba pledged to utilise the experience he got from Comm Gen Matanga to steer the ship.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/1a92d94c-a3a6-453b-9832-4c9f101d4a54-680x380.jpeg",
            "description": "Zvamaida Murwira Senior Reporter Newly appointed Zimbabwe Republic Police Commissioner General Steven Mutamba has officially taken over the reins at the country’s law enforcement agency at a colourful ceremony held on Friday at Mkushi Police Academy.   Comm Gen Mutamba took over from Comm Gen Godwin Matanga who retired at the end of 2024. It […]",
            "time": "20:39",
            "date": "03 Jan 2025"
        },
        {
            "title": "Deadline for destroying tobacco seedbeds extended",
            "url": "https://www.herald.co.zw/deadline-for-destroying-tobacco-seedbeds-extended/",
            "content": "Precious Manomano\n\nHerald Reporter\n\nLands, Agriculture, Water, Fisheries, and Rural Development Minister Dr Anxious Masuka has announced an extension for the deadline to destroy tobacco seedbeds from December 31 to January 15, 2025.\n\nThis decision responds to delayed rains and a prolonged dry spell, providing growers with additional time to transplant their crops and safeguard their investments.\n\nThe Plant Pests and Diseases (Tobacco) Regulations, 1979, mandate that all tobacco seedbeds be destroyed by December 31 to break the life cycle of pests and diseases that could affect tobacco plants.\n\nHowever, many farmers relying on rain-fed dryland tobacco were unable to transplant in time due to erratic rains.\n\nIn light of these challenges, the Tobacco Industry and Marketing Board (TIMB) has issued a statement.\n\nConsidering these challenges, the decision ensures that farmers can preserve their investments and benefit from their months of hard work, said the organisation.\n\nThis advocacy led to the extension of the deadline.\n\nTobacco production involves a detailed process that includes sowing seeds, maintaining a seedbed for three months, preparing land, and creating ridges for transplanting seedlings.\n\nDestroying tobacco plants in seedbeds prevents farmers from transplanting, which can significantly impact their yield.\n\nThe recent December rains have brought relief and hope for dryland tobacco growers, marking a potential turning point for the 2024/25 season.\n\nStatistics from TIMB indicates that as of 27 December 2024, growers had transplanted 84 661 hectares, surpassing the 82 392 hectares recorded during the same period in 2023.\n\nAdditionally, the number of registered growers has increased to 126 092, up from 112 904 last year. These figures reflect the industrys resilience and growth, with a national target of 300 million kilograms of tobacco set for the season.\n\nTo ensure success this season, the focus remains on adopting climate-smart agriculture practices that enhance resilience against erratic weather patterns.\n\nTobacco growers are encouraged to control weeds to reduce competition for water, use potholes to capture rainfall and prevent runoff, and maintain proper ridges for efficient drainage.\n\nMeanwhile, the harvesting of the early irrigated crop is underway, with reports indicating promising leaf quality in areas where good agronomic practices have been followed. Maintaining high-quality tobacco is crucial, and growers are encouraged to prioritise agronomy.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/06/Minister-Masuka-1.jpg",
            "description": "Precious Manomano Herald Reporter Lands, Agriculture, Water, Fisheries, and Rural Development Minister Dr Anxious Masuka has announced an extension for the deadline to destroy tobacco seedbeds from December 31 to January 15, 2025. This decision responds to delayed rains and a prolonged dry spell, providing growers with additional time to transplant their crops and safeguard […]",
            "time": "20:39",
            "date": "03 Jan 2025"
        },
        {
            "title": "Over 7 000 goats distributed under Presidential Goat Scheme",
            "url": "https://www.herald.co.zw/over-7-000-goats-distributed-under-presidential-goat-scheme/",
            "content": "Precious ManomanoHerald Reporter\n\nMore than 7 000 goats have been distributed under the Presidential Goat Scheme since its launch in 2022.\n\nThe scheme aims to improve livestock genetics and enhance both crop and livestock productivity.\n\nStatistics from the Ministry of Lands, Agriculture, Fisheries, Water, and Rural Development show that 64 goats were distributed in Chivi District, 25 in Masvingo Province, and 39 in Manicaland.\n\nThe Government is working on the modalities for the continuation of the scheme, with a comprehensive business plan for breeding and multiplying goats and other livestock at youth hubs that was produced in March of last year, now awaiting approval and implementation.\n\nThis initiative is part of the Governments broader strategy to accelerate rural development and align with the goal of achieving upper middle-income status by 2030.\n\nUnder the full scheme, a total of 35 000 bucks and 597 000 does are set to be distributed across all villages, further enhancing the livelihoods of rural communities\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/04/Untitled-48.jpg",
            "description": "More than 7 000 goats have been distributed under the Presidential Goat Scheme since its launch in 2022.",
            "time": "20:39",
            "date": "03 Jan 2025"
        }
    ]
}