{
    "news": [
        {
            "title": "SA border authorities intercept R500k Zim-bound contraband",
            "url": "https://www.herald.co.zw/sa-border-authorities-intercept-r500k-zim-bound-contraband/",
            "content": "Thupeyo Muleya\n\nBeitbridge Bureau\n\nSouth African border authorities on Saturday intercepted an assortment of goods worth an estimated R500 000 that were being smuggled into Zimbabwe via the Limpopo River.\n\nSmuggling syndicates are using inflatable boats to smuggle goods between the two countries.\n\nLimpopo police spokesperson Lieutenant Colonel Stephen Thakeng said the suspects escaped to Zimbabwe in eight boats after being intercepted by security officials.\n\nThe South African Police Service (SAPS) Operation Vala Umgodi National Intervention Roving Team has successfully thwarted a major smuggling operation along the Limpopo River, leading to the confiscation of goods valued at approximately R500 000, he said.\n\nOn Saturday morning at around 11:20 am, the team was conducting a routine patrol near Tshirundu Village when they received a tip-off that eight small boats were smuggling some goods.\n\nUpon seeing the police, the suspects quickly got into the boats and fled back into Zimbabwe, abandoning most of the goods.\n\nHe said the contraband included alcoholic beverages, energy drinks, baked goods, flour, and other consumer goods, along with a fridge.\n\nAll seized items were taken to Musina SAPS.\n\nThe development comes as Zimbabwean authorities are also cracking down on smuggling syndicates operating between Zimbabwe and South Africa.\n\nThe crackdown is being led by the Ministry of Industry and Commerce, alongside the Zimbabwe Revenue Authority (Zimra), the Zimbabwe Republic Police, the Reserve Bank of Zimbabwe (RBZ), and the Consumer Protection Commission.\n\nThe goal is to halt the influx of illicit goods into local markets. Recent efforts have resulted in the interception of numerous buses loaded with smuggled goods.\n\nAccording to security officials, smugglers are avoiding the border and are using the border flanks. To enhance surveillance, authorities are deploying high-tech security systems, including drone surveillance.\n\nSince the introduction of these systems as well as fast cargo scanners, Zimra has been able to intercept more smuggled goods.\n\nDrones and scanners are set to be deployed to other entry border posts like Forbes and Chirundu.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/w4tw4t4wt-680x380.jpg",
            "description": "Thupeyo Muleya Beitbridge Bureau South African border authorities on Saturday intercepted an assortment of goods worth an estimated R500 000 that were being smuggled into Zimbabwe via the Limpopo River. Smuggling syndicates are using inflatable boats to smuggle goods between the two countries. Limpopo police spokesperson Lieutenant Colonel Stephen Thakeng said the suspects escaped to […]",
            "time": "20:27",
            "date": "13 Jan 2025"
        },
        {
            "title": "Mimosa warns public against scams",
            "url": "https://www.herald.co.zw/mimosa-warns-public-against-scams/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nLeading mining company Mimosa has cautioned the public against responding to fraudulent job advertisements circulating online urging people to verify all recruitment information through official channels.\n\nIn a statement, Mimosa clarified its recruitment process saying it advertises job openings exclusively through mainstream media and its official website.\n\nMimosa wishes to advise members of the public that it recruits through placing adverts with the companys official logo in the mainstream media and on our website, read the statement.\n\nMimosa also warned job seekers against engaging in unverified communication.\n\nWe urge the public to disregard any communication outside these platforms inviting them to apply for jobs in our organisation. Beware of fake job adverts circulating online, read the statement.\n\nMimosa will not be held responsible or liable for any prejudice, loss, claim, expenses or any other inconveniences resulting from or connected to these fake adverts.\n\nJob seekers, it said are encouraged to verify opportunities by visiting Mimosas official website or contacting the company directly.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2014/01/MIMOSA-MINES.jpg",
            "description": "Ivan Zhakata Herald Correspondent Leading mining company Mimosa has cautioned the public against responding to fraudulent job advertisements circulating online urging people to verify all recruitment information through official channels. In a statement, Mimosa clarified its recruitment process saying it advertises job openings exclusively through mainstream media and its official website. “Mimosa wishes to advise […]",
            "time": "20:27",
            "date": "13 Jan 2025"
        },
        {
            "title": "Masvingo High Court judges’ work ethic commended",
            "url": "https://www.herald.co.zw/masvingo-high-court-judges-work-ethic-commended/",
            "content": "George Maponga in Masvingo\n\nConstitutional Court Judge Justice Anne-Marie Gowora has commended the Masvingo High Court for its work ethic after two judges at the station finalised over 1 700 criminal cases last year.\n\nSpeaking at the official opening of the 2025 Legal Year at the Masvingo High Court today, Justice Gowora commended Justices Sunsley Zisengwe and Helena Charewa for finalising the cases in 2024.\n\nThis, she said, was despite the fact that the Masvingo High Court is understaffed as the size of the court requires three judges.\n\nJustice Charewa and her counterpart Justice Zisengwe cleared 1 719 criminal cases last year, out of a total 1 909 cases that were filed last year and in 2023.\n\nIn the civil division, the two Masvingo judges finalised 810 cases out of a total of 913.\n\nJustice Gowora said this demonstrates the two judges dedication to duty.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/05/Justice-Anne-Mary-Gowora.jpg",
            "description": "George Maponga in Masvingo Constitutional Court Judge Justice Anne-Marie Gowora has commended the Masvingo High Court for its work ethic after two judges at the station finalised over 1 700 criminal cases last year. Speaking at the official opening of the 2025 Legal Year at the Masvingo High Court today, Justice Gowora commended Justices Sunsley […]",
            "time": "20:27",
            "date": "13 Jan 2025"
        },
        {
            "title": "Kenya’s Raila Odinga seeks Zimbabwe’s support for top AU post",
            "url": "https://www.herald.co.zw/kenyas-raila-odinga-seeks-zimbabwes-support-for-top-au-post/",
            "content": "Rumbidzayi Zinyuke\n\nSenior Reporter\n\nPresident Mnangagwa today (Monday) received Kenyan opposition leader Mr Raila Odinga who is in Zimbabwe to request support for his candidature for the African Union Commission chairpersonship.\n\nMr Odinga is one of four candidates in the race to succeed the incumbent, Moussa Faki, who has held the position since 2017.\n\nHe is vying for the post against Djibouti Foreign Affairs Minister Tahtoud Ali Youssof, Somalias Fawzia Yusuf Adam, and Seychelles former Vice President Vincent Meriton.\n\nMr Odinga said he is happy that his meeting with President Mnangagwa was fruitful and expressed hope that Zimbabwe and the rest of the SADC region will support his bid for the top AU post.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/tehtyh-680x380.jpg",
            "description": "Rumbidzayi Zinyuke Senior Reporter President Mnangagwa today (Monday) received Kenyan opposition leader Mr Raila Odinga who is in Zimbabwe to request support for his candidature for the African Union Commission chairpersonship. Mr Odinga is one of four candidates in the race to succeed the incumbent, Moussa Faki, who has held the position since 2017. He […]",
            "time": "20:27",
            "date": "13 Jan 2025"
        },
        {
            "title": "Mbire woman, boy swept away while crossing flooded river",
            "url": "https://www.herald.co.zw/mbire-woman-boy-swept-away-while-crossing-flooded-river/",
            "content": "Daniel Chigunwe\n\nHerald Correspondent\n\nIn a tragic incident, two people from Mbire district in Mashonaland Central province lost their lives on Saturday after they were swept away while attempting to cross a flooded river.\n\nMrs Mahabhe Zengeretsi (65) and a 16-year-old boy from Masoka village, ward 11 under Chief Chisunga were confirmed dead after they were swept away by the flooded Manongora River.\n\nThis was confirmed by Mbire Rural District Council chairman Cllr Ishmael Chaukura, I confirm the tragic death of a Mbire woman and a boy after being swept away while trying to cross the flooded Manongora River on Saturday morning.\n\nFor the past few days Mbire has been receiving a lot of rain which has resulted in many rivers like Dande and Angwa flooding, he said.\n\nWe are putting in place measures to minimise disasters due to flooding since we are a region perennially haunted by floods in this Zambezi basin. We are always on high alert.\n\nIn a separate incident, another Mbire woman was killed last week after being attacked by a crocodile while fishing, and her remains have not yet been found.\n\nRinda Koza (80) of Makuwerere village under Chief Chitsungo in ward 10 was attacked by a crocodile while fishing in a river, her remains have not been found, said Cllr Chaukura.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/sdgsrgrw-680x380.jpg",
            "description": "Daniel Chigunwe Herald Correspondent In a tragic incident, two people from Mbire district in Mashonaland Central province lost their lives on Saturday after they were swept away while attempting to cross a flooded river. Mrs Mahabhe Zengeretsi (65) and a 16-year-old boy from Masoka village, ward 11 under Chief Chisunga were confirmed dead after they […]",
            "time": "20:27",
            "date": "13 Jan 2025"
        },
        {
            "title": "Police urge transporters to prioritise the safety of school children",
            "url": "https://www.herald.co.zw/police-urge-transporters-to-prioritise-the-safety-of-school-children/",
            "content": "Crime Reporter\n\nThe Zimbabwe Republic Police has urged parents and transporters to prioritise the safety of learners as schools open tomorrow (Tuesday).\n\nTransport operators have been urged to ensure that their vehicles are roadworthy and certified fit for carrying passengers before transporting children to their respective schools.\n\nIn a statement, national police spokesperson Commissioner Paul Nyathi said drivers should also obey traffic rules and regulations.\n\nAs schools open for the new term, the Zimbabwe Republic Police is appealing to parents, guardians, school authorities, and the general public to prioritise the safety and security of children, he said.\n\nThe safety of learners during movements to and from school is of paramount importance. We urge transport operators to ensure that their vehicles are roadworthy and certified fit for carrying passengers before transporting children to schools.\n\nDrivers should exercise caution, avoid speeding, and above all comply with all road rules and regulations to prevent road traffic accidents.\n\nHe advised parents and school authorities to ensure that learners do not travel at night, as this can expose them to various risks, including road traffic accidents.\n\nAdditionally, school authorities are advised to deposit school fees and tuition-related costs at financial institutions. This precautionary measure will help minimise the risk of robbery and theft, as large sums of cash at school premises attract criminal attention.\n\nCriminals often gather information from individuals close to school authorities and staff and end up targeting the schools.\n\nIn this regard, school authorities should be careful about how financial transactions are conducted.\n\nHe urged the public to be vigilant and report suspicious criminal activities to the police immediately.\n\nThe public should report these activities on the National Complaints Desk number (0242) 703631, WhatsApp 0712 800 197 or at the nearest police station.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/06/zrp-329.jpg",
            "description": "Crime Reporter The Zimbabwe Republic Police has urged parents and transporters to prioritise the safety of learners as schools open tomorrow (Tuesday). Transport operators have been urged to ensure that their vehicles are roadworthy and certified fit for carrying passengers before transporting children to their respective schools. In a statement, national police spokesperson Commissioner Paul […]",
            "time": "20:27",
            "date": "13 Jan 2025"
        },
        {
            "title": "2025 legal year officially opened",
            "url": "https://www.herald.co.zw/2025-legal-year-officially-opened/",
            "content": "Online Reporters\n\nChief Justice Luke Malaba has officially opened the 2025 legal year at the Bulawayo High Court.\n\nThe landmark event, traditionally held at the Constitutional Court in Harare, signifies a significant shift in the judiciarys approach, aligning with the Governments devolution agenda.\n\nReplica ceremonies were held concurrently in Harare, Mutare, Masvingo, and Chinhoyi.\n\nDeputy Chief Justice Mrs Elizabeth Gwaunza presided over the event in Harare, while Mrs Marie-Anne Gowora, a judge of the Constitutional Court, oversaw the ceremony in Masvingo.\n\nIn Mutare, Justice Ben Hlatshwayo, also a judge of the Constitutional Court, headlined proceedings, while the Deputy Judge President, Justice Garainesu Mawadze, presided over proceedings at Chinhoyi High Court.\n\nThis years theme, Building Public Confidence in the Judiciary Through Stakeholder Participation, highlights the judiciarys commitment to fostering greater trust, inclusivity, transparency, and accountability within the justice system.\n\nDuring his address at the main event in Bulawayo, Chief Justice Malaba said the courts cannot deliver justice without collaboration with other stakeholders.\n\nThe judiciary will work with other stakeholders to ensure that justice is served, he said.\n\nHe acknowledged the role of the media and non-governmental organisations in informing the public on the importance of justice delivery.\n\nChief Justice Malaba said the Judiciary Service Commission should put in place policies and measures to ensure that the courts are independent in making their decisions and accountable for the decisions.\n\nIn her address in Harare, Deputy Chief Justice Gwaunza said this years theme serves as a clarion call to strengthen collaboration and engagement between the judiciary and the public.\n\nThis years theme reminds us of the power of collective effort in delivering justice, said Justice Gwaunza.\n\nBy working together with all stakeholders, we can strengthen public trust in the judiciary and ensure that it continues to serve with transparency and fairness.\n\nShe also reflected on the achievements of the Judicial Service Commission (JSC) in 2024, while candidly acknowledging the challenges encountered along the way.\n\nThe ceremony also provided an opportunity to strategise on how the judiciary can continue to improve its services in the face of evolving societal needs.\n\nThe prestigious events were graced by a broad spectrum of stakeholders, including Government officials, leading lawyers, judges, magistrates, and other key players in the justice sector.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/bfe79ab8-a6c2-4494-bf09-7db3add18fba-680x380.jpeg",
            "description": "Online Reporters Chief Justice Luke Malaba has officially opened the 2025 legal year at the Bulawayo High Court. The landmark event, traditionally held at the Constitutional Court in Harare, signifies a significant shift in the judiciary’s approach, aligning with the Government’s devolution agenda. Replica ceremonies were held concurrently in Harare, Mutare, Masvingo, and Chinhoyi. Deputy […]",
            "time": "20:27",
            "date": "13 Jan 2025"
        },
        {
            "title": "Shurugwi man jailed for kidnapping, indecently assaulting minor",
            "url": "https://www.herald.co.zw/shurugwi-man-jailed-for-kidnapping-indecently-assaulting-minor/",
            "content": "Tapiwa Chikuhwa\n\nHerald Reporter\n\nA 21-year-old Shurugwi man has been sentenced to four years in prison for kidnapping and indecently assaulting a minor.\n\nThe man appeared before the Shurungwi Magistrates Court.\n\nThe court heard that on December 24 last year, the three-year-old victim and other children were playing when the accused person came and took her away.\n\nThe man detained the minor for about 30 minutes. The complainants father heard that the accused had taken his daughter and made a follow-up.\n\nThe victims father found his daughter standing naked, wearing the accuseds necklace. The accused escaped, leaving his cell phone behind.\n\nThe matter was reported to the police, leading to the accused persons arrest.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/courthammer-680x380.jpg",
            "description": "Tapiwa Chikuhwa Herald Reporter A 21-year-old Shurugwi man has been sentenced to four years in prison for kidnapping and indecently assaulting a minor. The man appeared before the Shurungwi Magistrates’ Court. The court heard that on December 24 last year, the three-year-old victim and other children were playing when the accused person came and took […]",
            "time": "20:27",
            "date": "13 Jan 2025"
        },
        {
            "title": "Suspected thief murdered in Budiriro",
            "url": "https://www.herald.co.zw/suspected-thief-murdered-in-budiriro/",
            "content": "Crime Reporter\n\nA suspected thief was fatally assaulted by a group of people in Budiriro last Thursday after he allegedly broke into a house where a 19-year-old woman was sleeping.\n\nThe incident occurred around 3 am.\n\nNational police spokesperson Commissioner Paul Nyathi confirmed the incident.\n\nPolice in Harare are investigating a case of murder which occurred along Gunguwo Street, Budiriro, Harare on January 10 at around 3 am. The victim died and he was identified as Honest, he said.\n\nThe victim was apprehended by a mob on allegations of unlawful entry into a house in Budiriro 5B where he allegedly grabbed the complainant who was sleeping in her bedroom.\n\nThe mob indiscriminately assaulted the victim using wooden logs and left him for dead. He succumbed to the injuries.\n\nThe body of the victim was taken to Sally Mugabe Hospital mortuary for post-mortem. Anyone with information that might assist with investigations should contact the nearest police station, said Commissioner Nyathi.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/07/1705-1-1-PAUL-THEMBA-NYATHI-1.jpg",
            "description": "Crime Reporter A suspected thief was fatally assaulted by a group of people in Budiriro last Thursday after he allegedly broke into a house where a 19-year-old woman was sleeping. The incident occurred around 3 am. National police spokesperson Commissioner Paul Nyathi confirmed the incident. “Police in Harare are investigating a case of murder which […]",
            "time": "20:27",
            "date": "13 Jan 2025"
        },
        {
            "title": "Financial institution loses US$3 500 to robbers",
            "url": "https://www.herald.co.zw/financial-institution-loses-us3-500-to-robbers/",
            "content": "Crime Reporter\n\nThree armed robbers raided a financial institution in Beatrice and got away with US$3 500 on Saturday.\n\nThe three were travelling in a silver Toyota Sienta and were armed with pistols.\n\nNo arrests have been made and the police are investigating the case.\n\nNational police spokesperson Commissioner Paul Nyathi confirmed the incident in a statement.\n\nThe ZRP is investigating a case of robbery which occurred at Beatrice Township on January 11 at around 9 am, he said.\n\nThree unidentified male suspects who were armed with pistols and wearing face masks pounced at a local financial institution and demanded keys to the tellers booth.\n\nThe suspects gained entry into the booth and stole US$3 500 and three cellphones. The suspects locked the teller in the booth and drove off in a silver Toyota Sienta with no number plates.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/08/Untitled-169.jpg",
            "description": "Crime Reporter Three armed robbers raided a financial institution in Beatrice and got away with US$3 500 on Saturday. The three were travelling in a silver Toyota Sienta and were armed with pistols. No arrests have been made and the police are investigating the case. National police spokesperson Commissioner Paul Nyathi confirmed the incident in […]",
            "time": "20:27",
            "date": "13 Jan 2025"
        }
    ]
}