{
    "news": [
        {
            "title": "Three ivory dealers run into police trap",
            "url": "https://www.herald.co.zw/three-ivory-dealers-run-into-police-trap/",
            "content": "Thupeyo Muleya\n\nBeitbridge Bureau\n\nThree Beitbridge based ivory dealers were on Friday arrested by the police while looking for buyers for two elephant tusks.\n\nNokhukanya Gumede (34), Phakamani Maphosa (32) and Josephe Muleya (30) were arrested after being lured by police detectives to a service station where the sale was supposed to be concluded.\n\nUpon their arrest, they were found with 4.1kgs of raw ivory worth US$1472.54.\n\nThe trio were not asked to plead when they appeared before Ms Vavariro Gabi on Saturday.\n\nThey were remanded in custody to 4 April.\n\nProsecuting, Mr Tawanda Chigavazira said on March 21, the police got a tip off that the three were selling ivory.\n\nThe detectives set up a trap and posed as potential buyers after contacting the accused persons.\n\nThey agreed to conclude the deal at a local service station.\n\nGumede and Maphosa arrived with one of the elephant tusks.\n\nThe two were arrested upon arrival and Muleya was also arrested when he arrived with the other tusk.\n\nThe raw ivory was confisticated.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2013/11/Ivory-629x380.jpg",
            "description": "Three Beitbridge based ivory dealers were on Friday arrested by the police while looking for buyers for two elephant tusks.",
            "time": "18:33",
            "date": "24 Mar 2025"
        },
        {
            "title": "Car cleaner steals US$10k from client’s vehicle",
            "url": "https://www.herald.co.zw/car-cleaner-steals-us10k-from-clients-vehicle/",
            "content": "Prosper Dembedza\n\nHerald Correspondent\n\nA Harare car cleaner has appeared in court on allegations of stealing US$10 000 from a clients car in Mabelreign.\n\nAlbert Chimukuyu appeared before magistrate Isheunesu Matova yesterday.\n\nHe was remanded in custody.\n\nAccording to the State, on Saturday at around noon, the unnamed complainant went to a car wash at Mabelreign Shopping Centre.\n\nThe complainant left a bag containing US$10 000 and a 9mm Makarov pistol with a magazine of 09 live rounds in his cars glove compartment.\n\nThe accused person washed the car and later stole the bag containing the firearm and cash.\n\nHe then handed over the car keys to the complainant and fled the scene, the State said.\n\nThe court heard that the complainant discovered the offence and filed a police report.\n\nOn 23 March, detectives from CID Homicide Harare heard that the accused person was hiding at a lodge in Glaudina, Harare.\n\nActing on the information, detectives proceeded to the lodge. The accused person was subsequently arrested.\n\nA search was conducted and it led to the recovery of US$1850 and the pistol with a magazine of 09 live rounds, the State said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/court-hammer.jpg",
            "description": "A Harare car cleaner has appeared in court on allegations of stealing US$10 000 from a client's car in Mabelreign.",
            "time": "18:33",
            "date": "24 Mar 2025"
        },
        {
            "title": "Zim gears for digital economy",
            "url": "https://www.herald.co.zw/zim-gears-for-digital-economy/",
            "content": "Blessings Chidakwa and Remember Deketeke\n\nThe countrys digital landscape has taken a major step forward with the official opening of the IMC Communications Digital Experience Centre in Avondale, Harare.\n\nInformation Communication Technology (ICT), Postal and Courier Services Minister Tatenda Mavetera said IMC is set to revolutionize how Zimbabweans interact with mobile and satellite connectivity.\n\nSpeaking at the official opening, Minister Mavetera said the state-of-the-art facility is a crucial milestone in the countrys push for digital transformation, aligning with the countrys Vision 2030, which aims to attain an upper-middle-income economy through technological advancements.\n\nThis centre is a celebration of how mobile connectivity shapes our future, she said.\n\nIt is directly contributing to the Governments goal of establishing Zimbabwes digitally empowered economy.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/09/Minister-Mavetera.jpg",
            "description": "The country's digital landscape has taken a major step forward with the official opening of the IMC Communications Digital Experience Centre in Avondale, Harare.",
            "time": "18:33",
            "date": "24 Mar 2025"
        },
        {
            "title": "Court dismisses Madzibaba Ishmael’s application for Constitutional Court referral",
            "url": "https://www.herald.co.zw/court-dismisses-madzibaba-ishmaels-application-for-constitutional-court-referral/",
            "content": "Prosper Dembedza-Court Correspondent\n\nApostolic sect leader Madzibaba Ishmaels application for his case to be referred to the Constitutional Court has been dismissed by Norton Magistrate Ms Christina Nyandoro.\n\nThe magistrate ruled that the application was frivolous and vexatious, and therefore did not warrant referral.\n\nIn his application, Madzibaba Ishmael argued that it was unconstitutional for the court to deny him the opportunity to have his witnesses testify before he presents his defence.\n\nHe said his witnesses should be allowed to speak on his behalf while he exercises his right to remain silent.\n\nHowever, the prosecution, led by Mr Tafara Chirambira and Ms Sheila Mupindu, opposed the application.\n\nThey argued that the request was just a delaying tactic with no legal basis.\n\nThe State said an accused person must either testify or choose to remain silent, adding that there is no provision allowing witnesses to testify before the accused makes a decision.\n\nFurthermore, they said if Ishmael intends to exercise his right to silence, he should simply declare it, rather than basing it on what might be said by the witness.\n\nMs Nyandoro ruled that Ishmael had not raised any valid constitutional concerns.\n\nThe trial was postponed to April 2 as the defence lawyer was attending a funeral.\n\nMadzibaba Ishmael, also known as Chokurongerwa, is facing three charges  ill-treatment of children, conducting a burial without a burial order, and failing to register the birth and death of a person.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/01/istockphoto-626502360-170667a.jpeg",
            "description": "Prosper Dembedza-Court Correspondent Apostolic sect leader Madzibaba Ishmael’s application for his case to be referred to the Constitutional Court has been dismissed by Norton Magistrate Ms Christina Nyandoro. The magistrate ruled that the application was frivolous and vexatious, and therefore did not warrant referral. In his application, Madzibaba Ishmael argued that it was unconstitutional for […]",
            "time": "18:33",
            "date": "24 Mar 2025"
        },
        {
            "title": "Government commends Katanga Drop-In Centre for addressing drug abuse",
            "url": "https://www.herald.co.zw/government-commends-katanga-drop-in-centre-for-addressing-drug-abuse/",
            "content": "Precious Manomano-Herald Reporter\n\nGovernment has praised the Katanga Drop-In Centre for its critical role in tackling drug and substance abuse.\n\nEstablished by the Fight Against Substance Abuse and Addictions (FASSA) and the Inspired Angels Network, the centre is strategically located in Katanga, a high-density suburb that is notorious for elevated cases of drug abuse.\n\nDuring a stakeholders meeting at the centre last Friday, Mashonaland West Minister of State for Provincial Affairs and Devolution Marian Chombo, through a representative, reaffirmed the Governments commitment to supporting the initiative.\n\nShe emphasised the importance of collaboration with local authorities, community leaders, and stakeholders to address the root causes of substance abuse.\n\nI commend the centres efforts in providing a comprehensive range of services, Minister Chombo said.\n\nThese include assessment and referral services to connect individuals with appropriate treatment programmes, free counselling for vulnerable populations, peer support, and a safe space for individuals to access services without fear of stigma.\n\nThese services are essential in addressing drug and substance abuse in our communities.\n\nFASSA director, Dr Abigail Magwenzi described the centre as a safe haven for individuals battling addiction.\n\nWe catch them before they become psychotic, Dr Magwenzi explained. This centre acts as a referral point to mental health institutions.\n\nWe have engaged over 300 caregivers to ensure a smooth workflow. We have transformed many lives, and the community has become our key stakeholders after witnessing the recovery of drug users.\n\nSince the programmes inception two years ago, over 300 individuals have been successfully rehabilitated at the centre.\n\nFarai, known as Captain Tumbwa, began using substances at the age of 16.\n\nAlcohol was my stimulant. I didnt realize the damage I was doing to myself, he said. I left a good job because of drugs, but now I have completely transformed into a better person.\n\nSeveral individuals also testified about their relatives transformations, noting their newfound engagement in community projects and church activities.\n\nThe Katanga Drop-In Centre continues to be a beacon of hope, minimising drug abuse and fostering recovery within the community.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Minister-Chombo-680x380.jpg",
            "description": "Precious Manomano-Herald Reporter Government has praised the Katanga Drop-In Centre for its critical role in tackling drug and substance abuse. Established by the Fight Against Substance Abuse and Addictions (FASSA) and the Inspired Angels Network, the centre is strategically located in Katanga, a high-density suburb that is notorious for elevated cases of drug abuse. During […]",
            "time": "18:33",
            "date": "24 Mar 2025"
        },
        {
            "title": "Sadc discusses formalisation of informal economy",
            "url": "https://www.herald.co.zw/sadc-discusses-formalisation-of-informal-economy/",
            "content": "Online Reporter\n\nThe meeting of Sadc Ministers of Employment and Labour and Social Partners has started in Victoria Falls amid calls for the region to come up with policies that can formalise the informal sector to achieve sustainable development.\n\nThe week-long meeting opened this morning with the senior officials meeting, which was officiated by Permanent Secretary for Public Service, Labour and Social Welfare, Mr Simon Masanga.\n\nMr Masanga is the chairperson of the Sadc Employment and Labour Sector Senior Officials.\n\nOfficiating at the meeting, Mr Masanga said the region faces numerous challenges, including high levels of informal employment, limited access to decent work and a skills gap that hinders productivity.\n\nHe said employment remains at the core of sustainable development and industrialisation.\n\nAs we meet under the theme of the 44th Sadc Summit Promoting Innovation to unlock opportunities for sustained economic growth and development towards an industrialised Sadc, it is important that we reflect on how employment and labour can contribute to this vision.\n\nInformal employment which accounts for a significant share of economic activity in many Sadc Member States, presents opportunities and challenges.\n\nOn the one hand, it provides livelihoods for millions while on the other, informal employment often lacks social protection, fair wages and adequate working conditions. We must work towards formalisation of the informal economy, which according to the International Labour Organisation, is around 58.8 percent in Africa.\n\nAddressing informality through appropriate policies and strategies is important for promoting decent work, reducing poverty and achieving sustainable development.\n\nIn addition, the integration of small to medium enterprises into the formal economy is important given their role as engines of job creation and innovation in our region, said Mr Masanga.\n\nHe said there is need to create an environment that fosters innovation, entrepreneurship and sustainable job creation.\n\nThe meeting continues with closed-door meetings that will culminate in the ministerial session on Thursday.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Sadc1-680x380.jpg",
            "description": "Online Reporter The meeting of Sadc Ministers of Employment and Labour and Social Partners has started in Victoria Falls amid calls for the region to come up with policies that can formalise the informal sector to achieve sustainable development. The week-long meeting opened this morning with the senior officials meeting, which was officiated by Permanent […]",
            "time": "18:33",
            "date": "24 Mar 2025"
        },
        {
            "title": "Protection order against old flame",
            "url": "https://www.herald.co.zw/protection-order-against-old-flame/",
            "content": "Anesu January-Herald Correspondent\n\nA Harare woman has been granted a protection order against her boyfriend who has been allegedly harassing her.\n\nSherry Chidziva told Harare Civil Court Magistrate Ms Meenal Narotam that her ex-boyfriend, Malvin Zuva, has been harassing her.\n\nHe came to my place and started hitting me. About two weeks back, he took my phone and twisted my arm.\n\nHe stalks me on my way from work. If I am accompanied by another man, he drags me or shouts at me.\n\nZuva did not deny the allegations.\n\nMs Narotam granted the protection order in Chidzivas favour and barred Zuva from harassing or assaulting her.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2020/09/protection-order-680x380.jpg",
            "description": "Anesu January-Herald Correspondent A Harare woman has been granted a protection order against her boyfriend who has been allegedly harassing her. Sherry Chidziva told Harare Civil Court Magistrate Ms Meenal Narotam that her ex-boyfriend, Malvin Zuva, has been harassing her. “He came to my place and started hitting me. About two weeks back, he took […]",
            "time": "18:33",
            "date": "24 Mar 2025"
        },
        {
            "title": "Government honours top performers across ministries and public entities",
            "url": "https://www.herald.co.zw/government-honours-top-performers-across-ministries-and-public-entities/",
            "content": "Anesu January-Herald Correspondent\n\nPresident Emmerson Mnangagwa this morning awarded Government officials from various sectors for their exceptional performance that is contributing to the development of the nation.\n\nTransport and Infrastructural Development Minister Felix Mhona was recognised as the best-performing minister, while Lands, Agriculture, Fisheries, Water and Rural Development Minister, Dr Anxious Masuka is the first runner-up.\n\nFormer Public Service, Labour and Social Welfare Minister July Moyo, who is now the Minister of Energy and Power Development, is the second runner-up.\n\nThe Permanent Secretary in the Ministry of Transport and Infrastructural Development, Engineer Joy Makumbe, was recognised as the best performer.\n\nPermanent Secretary in the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development came second, while at third place was Dr Mavis Sibanda, Permanent Secretary in the Ministry of Women Affairs, Community, Small and Medium Enterprises.\n\nAt provincial level, Permanent Secretary for Masvingo Provincial Affairs and Devolution Dr Addmore Pazvakavambwa emerged as the best performer while Permanent Secretary for Midlands Provincial Affairs and Devolution, Dr Edgar Seenza, claimed second place.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/AWARD9-680x380.jpg",
            "description": "Anesu January-Herald Correspondent President Emmerson Mnangagwa this morning awarded Government officials from various sectors for their exceptional performance that is contributing to the development of the nation. Transport and Infrastructural Development Minister Felix Mhona was recognised as the best-performing minister, while Lands, Agriculture, Fisheries, Water and Rural Development Minister, Dr Anxious Masuka is the first […]",
            "time": "18:33",
            "date": "24 Mar 2025"
        },
        {
            "title": "Government stops Seke Road cemetery project",
            "url": "https://www.herald.co.zw/government-stops-seke-road-cemetery-project/",
            "content": "Zvamaida Murwira-Senior Reporter\n\nHealth and Child Care Minister Douglas Mombeshora has stopped construction of a private cemetery project that was approved by the Harare City Council indicating it is located over the main trunk of Prince Edward Water Treatment Plant, which would pose a serious health risk for Harare residents.\n\nHarare City Council issued a permit approving Watervlei Burial Memorial Park along Seke Road.\n\nHowever, residents and other stakeholders raised concerns over the risks associated with decomposing human remains, which may lead to contamination of both treated and raw water supplies should there be a a burst pipe within the cemetery.\n\nThis saw the Ministry of Health and Child Care instituting an inquiry to establish the suitability of the cemetery project.\n\nMinister Mombeshora has since written a letter to his counterpart, Local Government and Public Works Minister Daniel Garwe, objecting to the construction of the project.\n\nMinister Mombeshora also noted that developers failed to hold public consultations as provided for by the law.\n\n.The proposed project is located next to Prince Edward Water Treatment Plant. This violates World Health Organisation guidelines that indicate that a cemetery should be at least 1-2 km from a water treatment site.\n\nIn addition, a buffer zone is required between the cemetery and the water treatment plant. There are water pipes that run through the cemetery and this exposes the water to contamination from fluids and chemicals from graves, reads Minister Mombeshoras letter.\n\nIt is my duty as Minister of Health and Child Care to enforce laws and regulations that protect public health and safety; and (n) to administer the provisions of the Public Health Act. In the interest of public health, this project must be stopped. The council is advised to be guided by a health impact assessment when dealing with such projects.\n\nThe Harare City Council had issued a permit for the project despite an earlier warning from the Harare Water Department.\n\nEarly this year, Minister Garwe expressed strong objections to the councils decision, attributing it to possible corruption and lack of due diligence.\n\nHe said initially, some councillors from Harare City Council had been sold the land through corrupt means as stands, but the Government reversed the decision. This prompted some crooked council officials to change plans and seek to establish a cemetery.\n\nHarare City Council acting director of Urban Planning, Mr Samuel Nyabezi had defended their decision to issue a permit before an Environmental Impact Assessment was done saying the EIA process is expensive, adding that it would not be proper for one to incur such high costs when there was no guarantee that a permit would be granted.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/10/IMG-20241013-WA0062-680x380.jpg",
            "description": "Zvamaida Murwira-Senior Reporter Health and Child Care Minister Douglas Mombeshora has stopped construction of a private cemetery project that was approved by the Harare City Council indicating it is located over the main trunk of Prince Edward Water Treatment Plant, which would pose a serious health risk for Harare residents. Harare City Council issued a […]",
            "time": "18:33",
            "date": "24 Mar 2025"
        },
        {
            "title": "Mash Central celebrates women",
            "url": "https://www.herald.co.zw/mash-central-celebrates-women/",
            "content": "Fungai Lupande-Mashonaland Central Bureau\n\nHundreds of people recently gathered at Wadzanai Business Centre in Shamva to celebrate the progress made towards achieving gender equality in the province.\n\nMinister of State for Mashonaland Central Provincial Affairs and Devolution Christopher Magomo said International Womens Day is a celebration of the social, economic, cultural, and political achievements of women and girls around the world.\n\nHe said this years theme, For All Women and Girls: Rights, Equality, Empowerment, serves as a reminder of the ongoing struggle for gender equality and the importance of inclusive and collective action.\n\nWomen and girls continue to face significant barriers in achieving their full potential. From discriminatory laws and policies to societal norms and stereotypes, women and girls are often marginalized, excluded, and silenced, he said.\n\nHowever, we acknowledge the incredible progress that has been made towards achieving gender equality.\n\nEmpowering women is not just the right thing to do, it is a critical ingredient in the fight against poverty, illiteracy, hunger, and malnutrition.\n\nMs Simbisai Ndige, a development officer from the Ministry of Women Affairs, Community, Small and Medium Enterprises Development, said the celebrations will be cascaded to ward level.\n\nMs Rujeko Chibaya, a programmes officer under African Women Educationists (FAWEZI), encouraged parents and guardians to send their girl children to school.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Women1-680x380.jpg",
            "description": "Fungai Lupande-Mashonaland Central Bureau Hundreds of people recently gathered at Wadzanai Business Centre in Shamva to celebrate the progress made towards achieving gender equality in the province. Minister of State for Mashonaland Central Provincial Affairs and Devolution Christopher Magomo said International Women’s Day is a celebration of the social, economic, cultural, and political achievements of […]",
            "time": "18:33",
            "date": "24 Mar 2025"
        }
    ]
}