{
    "news": [
        {
            "title": "Zhombe man stabbed to death",
            "url": "https://www.herald.co.zw/zhombe-man-stabbed-to-death/",
            "content": "Midlands Bureau\n\nA 21- year-old man died after he was stabbed with a Colombian knife in a revenge attack at Zvibhawabhawa Business Centre, Zhombe on Monday.\n\nMidlands Provincial police spokesperson Inspector Emmanuel Mahoko confirmed the fatal attack that happened on December 30 at around 9pm.\n\nThe now deceased Lloyd Zhakata of Joseph Village under Chief Ntabeni, Zhombe was approached by one Tichaona Sibanda (22) of Manhamo Village, while drinking beer at Zvibhawabhawa Business Centre, Zhombe, he said.\n\nInsp Mahoko said Sibanda allegedly indicated that he wanted to avenge the assault of his young Custo Sibanda by Zhakatas young brother.\n\nTichaona suddenly produced a Knife from his trousers pocket and stabbed Zhakata in the chest. Zhakata tried to run away but he fell down and died instantly, he said.\n\nInsp Mahoko said the police were appealing for information that may lead to the arrest of the suspect.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/08/mahoko-1.jpg",
            "description": "Midlands Bureau A 21- year-old man died after he was stabbed with a Colombian knife in a revenge attack at Zvibhawabhawa Business Centre, Zhombe on Monday. Midlands Provincial  police spokesperson Inspector Emmanuel Mahoko confirmed the fatal attack that happened on December 30 at around 9pm. “The now deceased Lloyd Zhakata of Joseph Village under Chief […]",
            "time": "20:39",
            "date": "02 Jan 2025"
        },
        {
            "title": "Harare’s world-class dream crumbles as service delivery falters",
            "url": "https://www.herald.co.zw/harares-world-class-dream-crumbles-as-service-delivery-falters/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nHarares ambitious promise of achieving world-class city status by 2025 is in tatters since the new year has been ushered in with nothing to show that the capital is anywhere near being a world-class city.\n\nThe opposition-led City Council, which once rallied citizens with the mantra of a modern, clean and efficient urban environment, is now facing harsh criticism for failing to deliver on basic services.\n\nResidents have expressed frustration over deteriorating service delivery, citing mounting issues such as uncollected garbage, erratic water supply, crumbling roads, and inadequate street lighting. Far from the envisioned world-class standards, Harare appears to be sinking deeper into urban decay.\n\nIn 2018, the councils leadership announced its ambitious vision of transforming Harare into a beacon of modern urban living by 2025.\n\nThe blueprint included improved waste management systems, consistent potable water supplies, upgraded road infrastructure and a smart urban transport system.\n\nHowever, seven years later, progress has been scant.\n\nWe were promised a city we could all be proud of, but it is a nightmare now. Refuse goes uncollected for weeks, and potholes have turned roads into death traps, lamented Tafadzwa Moyo, a resident of the high-density suburb of Mbare.\n\nOne of the most glaring failures has been waste management. Heaps of garbage are now a common sight across the city, posing serious health risks.\n\nReports indicate that the citys refuse trucks are frequently grounded due to poor maintenance, while budget constraints have stalled the procurement of new vehicles.\n\nWater provision, a long-standing challenge, has worsened. Many households receive water only a few days a week, forcing residents to rely on unsafe boreholes.\n\nThe opposition-led council blame obsolete water infrastructure and a lack of central Government support as the main hurdles.\n\nThe citys road network, once a point of pride, is now riddled with potholes, contributing to increased road accidents.\n\nDespite promises of regular maintenance and upgrades, little has been done to address this critical issue.\n\nStreet lighting is virtually non-existent in many areas, plunging neighborhoods into darkness and increasing crime rates.\n\nCritics have accused the opposition-led council of prioritising political battles and looting over service delivery.\n\nResidents argue that resources meant for development projects have been mismanaged, while others blame the councils failure to engage the central Government effectively for financial support.\n\nThis is not about politics, it is about governance. We are tired of leaders who use excuses instead of solutions, said a disgruntled resident.\n\nCouncil officials, however, argue that their hands are tied due to limited funding and interference from the central government.\n\nWe have faced constant sabotage in our efforts to secure funding and implement our plans, Mayor Jacob Mafume is on record saying.\n\nHe further highlighted that the city requires over US$100 million annually to meet its operational needs, yet revenue collections remain low.\n\nThe failure to deliver on promises has left residents disillusioned and questioning the competence of their leaders.\n\nHarares decline underscores the urgent need for a paradigm shift in urban governance, where leadership transcends political squabbles to prioritise the needs of its citizens.\n\nAs the council grapples with its challenges, residents can only hope that the next chapter brings real action instead of empty promises.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/10/harare-city-council.jpg",
            "description": "Harare's ambitious promise of achieving world-class city status by 2025 is in tatters since the new year has been ushered in with nothing to show that the capital is anywhere near being a world-class city.",
            "time": "20:39",
            "date": "02 Jan 2025"
        },
        {
            "title": "R440 000 fraudster escapes judgement, court issues warrant of arrest",
            "url": "https://www.herald.co.zw/r440-000-fraudster-escapes-judgement-court-issues-warrant-of-arrest/",
            "content": "Prosper Dembedza\n\nHerald Correspondent\n\nHarare regional magistrate Mr Stanford Mambanje has issued a warrant of arrest for an accused person who allegedly defrauded a South African based mining company of R440 000 after he failed to show up in court for judgement.\n\nCalton Mudiwiwa (39) is facing fraud charges. The complainant in this case is Davure Mining, represented by its manager Masimba Mukarati.\n\nDavure Mining is a holding company, which has subsidiaries in South Africa and Zimbabwe and has interests in mining, cattle ranching and agriculture.\n\nThe court heard that on October 20, 2021, Mukarati wanted to acquire a Toyota Hilux Legend 50 double-cab from South Africa and he shared the information with Mudiwiwa, who subsequently volunteered to assist him in importing the vehicle.\n\nDavure Mining had free funds in its South Africa FNB Bank account and paid to Wish Worthy Investments for the vehicle on the instruction of Mudiwiwa.\n\nAfter the payment, Mukarati reportedly availed proof of payment to Mudiwiwa for ease of reference, but the latter allegedly failed to import the vehicle.\n\nMudiwiwa started giving false promises and later became evasive, the prosecution alleged.\n\nMukarati then reported the matter to the police, leading to Mudiwiwas arrest.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Calton-Mudiwiwa-.jpg",
            "description": "Harare regional magistrate Mr Stanford Mambanje has issued a warrant of arrest for an accused person who allegedly defrauded a South African based mining company of R440 000 after he failed to show up in court for judgement.",
            "time": "20:39",
            "date": "02 Jan 2025"
        },
        {
            "title": "Lotteries and Gaming Board acts on excessive gambling in Beitbridge",
            "url": "https://www.herald.co.zw/lotteries-and-gaming-board-acts-on-excessive-gambling-in-beitbridge/",
            "content": "Thupeyo Muleya\n\nBeitbridge Bureau\n\nThe Lotteries and Gaming Board with the support of the police is carrying out an operation to stop illegal gaming activities around Beitbridge district.\n\nA number of operators have installed illegal gaming devices in their houses especially in Beitbridge town.\n\nResidents have been expressing concern over the proliferation of unlicensed gambling machines in high-density suburbs, which are reportedly attracting young children.\n\nLotteries and Gaming Board Secretary, Dr Misheck Chingozha said the operation started on December 31 and would continue indefinitely.\n\nHe said they were covering all rural and urban business centres where the illegal gaming devices had been installed.\n\nWe cannot fold our hands while people break the law willy-nilly, said Dr Chingoizha.\n\nThe police officer commanding Beitbridge district (Dispol), Chief Superintendent Melusi Ncube said so far they had recovered 75 illegal gaming devices from Lutumba and Beitbridge urban areas.\n\nWe are not relenting and we wont condone excessive gambling activities which are harmful to the society especially children, he said.\n\nWe have arrested 16 offenders who will be dealt with according to the laws of the land. Our team together with the enforcement officers from the Lotteries and Gaming Board are on the ground and will continue until we restore sanity in our policing area.\n\nIn separate interviews recently, community members voiced frustration, describing the issue as a serious challenge for parents in the border town.\n\nThey condemned individuals for exposing their children to gambling at an early age, warning that is could have long-term consequences.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/49d061ad-911d-4952-b9c0-0d92e04ac64d-680x380.jpeg",
            "description": "The Lotteries and Gaming Board with the support of the police is carrying out an operation to stop illegal gaming activities around Beitbridge district.",
            "time": "20:39",
            "date": "02 Jan 2025"
        },
        {
            "title": "Madzibaba Joshua remanded in custody",
            "url": "https://www.herald.co.zw/madzibaba-joshua-remanded-in-custody/",
            "content": "Yeukai Karengezeka\n\nCourt Correspondent\n\nA self-styled prophet from Glen View, Marvelous Tunha, popularly known as Madzibaba Joshua, has been remanded in custody on charges of having sexual intercourse with a minor.\n\nTunha, the founder and leader of St. Joshua Apostolic Church, appeared before Harare magistrate Mrs Winfilder Tiyatara, who remanded him to January 13.\n\nHe is denying the charges. The complainant is a 14-year-old girl. According to prosecutor Ms Tariro Janhi, Tunha was a spiritual advisor to the complainants mother, who frequently sought his assistance for spiritual matters.\n\nThe complainant and her mother were regular visitors to Tunhas shrine at Churu Farm in Glen View for spiritual healing.\n\nAt some point, Tunha reportedly requested the complainants cellphone number, which he was given.\n\nThe two began communicating via WhatsApp. In October 2024, Tunha allegedly proposed love to the complainant, which she accepted.\n\nThe court heard that later that month, Tunha phoned the complainant and arranged to meet her at Glen View 3 Turn-Off.\n\nHe allegedly picked her up in a white Toyota Quantum and drove to a lodge in Kuwadzana 2. Tunha asked for sex and the minor agreed and the slept together once without protection.\n\nIn November, Tunha reportedly contacted the complainant again via text message and arranged another meeting.\n\nThe complainant agreed, and he picked her up from Glen View 3 Turn-Off and drove to an unknown lodge.\n\nOn this occasion, they allegedly engaged in consensual sex once with protection. Afterwards, Tunha reportedly dropped the complainant in Glen View around 7pm.\n\nThe matter came to light in December when the complainants mother went through her cellphone and discovered explicit messages she had exchanged with Tunha.\n\nConcerned, the mother took the complainant to Matrix Disciplinary and Training Centre on December 22, where she was interviewed by the operations manager, Mr Kudakwashe Katandika.\n\nDuring the interview, the complainant revealed details of her sexual relationship with Tunha. Following this revelation, the complainant underwent a medical examination. A report was then filed to the police which led to Tunhas arrest.\n\nMadzibaba Joshua was represented lawyers messrs Mr Rungano Mahuni, Mr Stead Kachere Kachere and Emmanuel Samundombe.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/01/Remanded-in-custody.jpg",
            "description": "A self-styled prophet from Glen View, Marvelous Tunha, popularly known as Madzibaba Joshua, has been remanded in custody on charges of having sexual intercourse with a minor.",
            "time": "20:39",
            "date": "02 Jan 2025"
        },
        {
            "title": "Farmers urged to stop planting major crops",
            "url": "https://www.herald.co.zw/farmers-urged-to-stop-planting-major-crops/",
            "content": "Precious Manomano\n\nHerald Reporter\n\nExperts have indicated that the planting window for major crops, particularly maize has expired, although farmers targeting to produce sunflower and sugar bean can still plant.\n\nThey recommend that any new plantings should be of short-season varieties, and for cereals, they advised the planting of traditional grains and ultra-short season maize varieties.\n\nAgricultural and Rural Development Advisory Services (ARDAS) chief director Mr Leonard Munamati, emphasised several important practices that farmers should adhere to improve this years yield.\n\nHe stated that farmers should apply top dressing fertiliser to early-planted crops, using split applications to mitigate the effects of excess rainfall, which can cause leaching.\n\nFurthermore, he said vigilance against pests like Fall armyworm and African armyworm was crucial and farmers were encouraged to report infestations to local Agritex officers or the Migratory Pests Department.\n\nMr Munamati also stressed the importance of controlling weeds to reduce competition for nutrients and moisture.\n\nFarmers should adopt moisture conservation techniques, such as mulching and water harvesting, and farmers practicing Pfumvudza must mulch their crops, he said.\n\nAdditionally, he advised that irrigation schemes that have not yet planted should focus on short-season varieties that can be harvested by April, in preparation for wheat planting.\n\nRecent weather developments have brought significant rainfall across various provinces, providing much-needed moisture.\n\nMr Munamati noted that the rains in Matabeleland were particularly beneficial.\n\nThe rains received in Matabeleland provinces were a great relief, he said.\n\nLands, Agriculture, Fisheries, Water, and Rural Development permanent secretary Professor Obert Jiri, reiterated that the maize planting window has closed.\n\nPlease be advised that the planting window for major crops like maize has closed. Let us adhere to this guidance to avoid potential losses, he said.\n\nWhile the maize planting period is over, he encouraged farmers to continue growing crops such as sunflower and sugar beans, which can still thrive with the available moisture\n\nZimbabwe Commercial Farmers Union (ZCFU)president Dr Shadreck Makombe echoed this sentiment, warning that late-planted maize varieties may not mature in time due to potential rainfall shortages in March.\n\nHe urged farmers to engage agriculture extension officers for suitable planting advice.\n\nFarmers should stop planting because failure to do that may lead to losses, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/v-680x380.jpg",
            "description": "Experts have indicated that the planting window for major crops, particularly maize has expired, although farmers targeting to produce sunflower and sugar bean can still plant.",
            "time": "20:39",
            "date": "02 Jan 2025"
        },
        {
            "title": "Traders to occupy Mbare market on February 1",
            "url": "https://www.herald.co.zw/traders-to-occupy-mbare-market-on-february-1/",
            "content": "Blessings Chidakwa\n\nHerald Reporter\n\nCONSTRUCTION of the temporary traders market at Mbare Musika in Harare by Masimba Holdings is moving swiftly and is now 82 percent complete with traders set to occupy the market by February 1.\n\nPresident Mnangagwa declared a state of disaster for Mbare following an inferno that destroyed stalls and wares late last year directing for the swift construction of the new mall.\n\nSpeaking during a Harare Provincial Media tour at the Mbare site, Masimba Holdings chief executive Mr Fungai Matahwa said the market will accommodate 5 000 traders.\n\nIn terms of progress we are sitting at 82 percent complete. We will complete it in the third week and officially on February 1 traders will be using the market, he said.\n\nThe opening of the market will allow traders to be moved into a secure marketplace while a three-storey modern Traders Market is being built.\n\nThe modernisation of Mbare Traders Market is now coming to fruition as all modalities are in place for modernisation works as Government is building better in line with Vision 2030.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/a6f2a84f-c3ff-4c9d-b6ad-31a7c3a5213b-680x380.jpeg",
            "description": "CONSTRUCTION of the temporary traders’ market at Mbare Musika in Harare by Masimba Holdings is moving swiftly and is now 82 percent complete with traders set to occupy the market by February 1.",
            "time": "20:39",
            "date": "02 Jan 2025"
        },
        {
            "title": "Bindura man sentenced to two years in prison for failing to pay child support",
            "url": "https://www.herald.co.zw/bindura-man-sentenced-to-two-years-in-prison-for-failing-to-pay-child-support/",
            "content": "Fungai Lupande\n\nMashonaland Central Bureau\n\nA Bindura man, Abuneshi Bvochora (34) spent Christmas behind bars after he was sentenced to two years in prison for failing to pay child support, which had accrued to US$2 000.\n\nBvochora, from Garikai in Bindura, pleaded guilty to defaulting on maintenance when he appeared before Provincial Magistrate Mr Tinanshe Ndokera.\n\nHis two-year sentence will be set aside if he settles the US$2000 in full. Prosecutor Gertrude Mayenyeso told the court that in April 2023, Bvochora was ordered by the court to pay $100 per month for the support of his three minor children.\n\nIn September of the same year, the complainant, Saymore Dube, requested an increase in the maintenance order to $150 per month.\n\nBvochora failed to make consistent payments, resulting in the total arrears reaching $2 000.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/09/Jailed.jpg",
            "description": "A Bindura man, Abuneshi Bvochora (34) spent Christmas behind bars after he was sentenced to two years in prison for failing to pay child support, which had accrued to US$2 000.",
            "time": "20:39",
            "date": "02 Jan 2025"
        },
        {
            "title": "108 new units on cards at Madokero",
            "url": "https://www.herald.co.zw/108-new-units-on-cards-at-madokero/",
            "content": "Blessings Chidakwa\n\nHerald Reporter\n\nAt least 108 modern housing units are being constructed behind Madokero Shopping Mall by the Public Service Pension Fund as part of efforts to ensure that Governments one million housing units by year end are met.\n\nThe construction is being undertaken by Exodus and Company which constructed similar facilities around the area including Madokero Creek which was commissioned by President Mnangagwa last year.\n\nSpeaking during the Harare provincial media tour of Madokero Creek and Madokero Mall, Exodus and Company chief executive Progress Mambo said the Madokero Mall was financed by the Public Service Pension Fund.\n\nThey also provided funding for the other project where we were at Madokero Creek. We are also working with them on apartments I mentioned earlier, the 108 units just behind this shopping mall, he said..\n\nThis mall was officially opened by the President in December 2022 as first phase, then the second phase was opened in June 2024.\n\nMr Mambo said the Madokero Mall was financed by the Public Service Pension Fund.\n\nThe leasing arrangement was done in a way that ensures everything that the local community needs is available, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/1dffb958-65f0-4e8a-b4f8-16edf15b1244-680x380.jpeg",
            "description": "At least 108 modern housing units are being constructed behind Madokero Shopping Mall as part of efforts to ensure that Government’s one million housing units by year end are met .",
            "time": "20:39",
            "date": "02 Jan 2025"
        },
        {
            "title": "Budiriro flood victims heap praise on Government",
            "url": "https://www.herald.co.zw/budiriro-flood-victims-heap-praise-on-government/",
            "content": "Blessings Chidakwa\n\nHerald Reporter\n\nTWENTY-EIGHT Budiriro flood victims have heaped praise on President Mnangagwas administration for honouring its pledge of providing them with shelter as they are now housed at Dzivaresekwa flats.\n\nThis was revealed during a media tour of Government projects in Harare provincial, led by Information, Publicity, and Broadcasting Services Minister Jenfan Muswere.\n\nMinister Muswere is accompanied by Minister of State for Provincial Affairs and Devolution for Harare Metropolitan Province Charles Tavengwa.\n\nOne of the beneficiaries, Mrs Cleopatra Mahwa said initially they had lost hope but were taken aback when they were offered shelter.\n\nI am glad that l now have decent accommodation courtesy of the Government. Although l still experience fear that l might lose a child again whenever there are heavy rains , but the feeling eventually goes away because I am comforted knowing that l am at a safer place, she said.\n\nAnother beneficiary, Judith Muriyenda said had it not been the benevolence of the President life would have remained a thorn in the flesh for her.\n\nIt took President Mnangagwas love to rescue us. At first we thought the Government was just speaking without action.\n\nI nearly lost hope but thanks to our President for providing us with shelter, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/d67700e5-db68-470c-bc0f-6e7985bf2895-680x380.jpeg",
            "description": "TWENTY-EIGHT Budiriro flood victims have heaped praise on President Mnangagwa's administration for honouring its pledge of providing them with shelter as they are now housed at Dzivaresekwa flats.",
            "time": "20:39",
            "date": "02 Jan 2025"
        }
    ]
}