{
    "news": [
        {
            "title": "SADC pledges tough action on Eastern DRC",
            "url": "https://www.herald.co.zw/sadc-pledges-tough-action-on-eastern-drc/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nThe Southern African Development Community (SADC) has expressed deep concern over the worsening security and humanitarian situation in Eastern Democratic Republic of Congo (DRC).\n\nIn a statement, SADC chairman President Mnangagwa condemned the actions of the M23 rebels and vowed decisive regional intervention.\n\nSADC will assume its full responsibility and take action to deal with the deteriorating security and humanitarian situation in Eastern DRC. Those responsible for the situation should be held accountable, he said.\n\nPresident Mnangagwa further denounced the recent attacks on UN and SADC peacekeepers which have resulted in casualties.\n\nThe cowardly attacks on the UN and SADC peacekeepers that have resulted in some of them paying the ultimate sacrifice for the cause of peace in the eastern DRC are unreservedly condemned, he said.\n\nExtending his condolences, President Mnangagwa added, The Chairman of SADC presents his condolences to the families of the deceased peacekeepers and wishes those injured a quick recovery.\n\nThe security situation in the eastern DRC continues to deteriorate as the M23 rebel group intensified its offensive, displacing thousands of civilians and exacerbating an already dire humanitarian crisis.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/President-Mnangagwa1-680x380.jpg",
            "description": "The Southern African Development Community (SADC) has expressed deep concern over the worsening security and humanitarian situation in Eastern Democratic Republic of Congo (DRC).",
            "time": "21:06",
            "date": "27 Jan 2025"
        },
        {
            "title": "KCD Mohadi sports tournament to boost grassroots sports development – Deputy Minister",
            "url": "https://www.herald.co.zw/kcd-mohadi-sports-tournament-to-boost-grassroots-sports-development-deputy-minister/",
            "content": "Thupeyo Muleya\n\nBeitbridge Bureau\n\nThe establishment of the KCD Mohadi sports tournament is set to go a long way in the promotion of sports development from the grassroots around Matabeleland South province, the Deputy Minister of Sports, Recreation, Arts and Culture, Cde Emily Jesaya has said.\n\nShe made the remarks at Phelandaba Stadium in Gwanda on Sunday where 12 teams representing all the constituencies in the province gathered for netball and soccer competitions.\n\nDuring the same program, youths were also taught various sporting disciplines including volleyball.\n\nThe KCD Mohadi sport tournament is a brainchild of the Zanu PF Youth League Matabeleland South Chapter and it will be held annually in honour of Vice President Mohadis leadership qualities.\n\nThe Vice President who is from Beitbridge in Matabeleland South also attended the colourful event that attracted a full house.\n\nGwanda Tshitaudze constituencys soccer and netball team won both soccer and netball competitions.\n\nToday I stand before you with immense pleasure as we gather here in Matabeleland South Province, affectionately known as the Rainbow Province, to celebrate the life and legacy of the Honourable Vice President Mohadi. We honour his guidance and commitment through a vibrant display of sports and various exhibitions, said the deputy minister.\n\nAs the Ministry of Sport, Recreation, Arts and Culture, we are delighted to witness the grassroots initiatives led by the Zanu PF ruling partys Matabeleland South Provincial Youth League under the astute leadership of Cde Moses Langa.\n\nThe Games have successfully progressed from the ward level to constituencies, and today, we gathered for the much-anticipated final competitions, a true testament to our continuity and dedication to youth engagement.\n\nCde Jesaya said the National Development Strategy 1 (NDS 1) underscores the importance of youth participation in sports, highlighting how these games serve as a premier platform for discovering and nurturing talent.\n\nShe added that such a platform offers a pathway for youth development and empowerment, fostering good health, promoting Unhu/Ubuntu values, inspiring entrepreneurship, and striving for sporting excellence.\n\nCde Jesaya said among other things the athletes had engaged in edutainment activities designed to educate them about the dangers of drug and substance abuse.\n\nThese activities also equip them with vital social skills and values necessary for navigating their lives. Topics covered included HIV and AIDS awareness, sexual reproductive health, and various forms of abuseissues that are crucial for our youths well-being, she said.\n\nOn this significant day, January 26, 2025, I challenge all the youth present to embrace sports wholeheartedly. Participating in sports not only allows our youth to experience success and have fun but also instils a strong sense of patriotism.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/3d142a77-31e4-40b9-a2e6-4f22bfd0c4a7.jpeg",
            "description": "The establishment of the KCD Mohadi sports tournament is set to go a long way in the promotion of sports development from the grassroots around Matabeleland South province, the Deputy Minister of Sports, Recreation, Arts and Culture, Cde Emily Jesaya has said.",
            "time": "21:06",
            "date": "27 Jan 2025"
        },
        {
            "title": "Zim man in court for smuggling R14 million cigarettes into SA",
            "url": "https://www.herald.co.zw/zim-man-in-court-for-smuggling-r14-million-cigarettes-into-sa/",
            "content": "Thupeyo Muleya\n\nBeitbridge Bureau\n\nThe 44-year-old Zimbabwean man who was recently caught smuggling a contraband of cigarettes worth R14 million into South Africa will make a formal bail application on February 6 at the Musina Magistrates Court in that country.\n\nJaint Janos Bimha was arrested on January 18 after he was allegedly found in possession of illicit cigarettes at the Beitbridge Border Post.\n\nThe National Prosecuting Authority (NPA) spokesperson for Limpopo Ms Mashudu Malabi Dzhangi said Bimha briefly appeared at the court on Monday.\n\nLimpopo police spokesperson, Brigadier Hlulani Mashaba said Bimha was driving a white truck with a tanker trailer when he was stopped by the police at the port of entry.\n\nThe police searched the vehicle and it was discovered that the tanker was fully loaded with illicit cigarettes.\n\nBimba failed to provide a satisfactory explanation regarding the cigarettes and he was arrested.\n\nWe have since confiscated 710 boxes of illicit cigarettes with an estimated street value of R14 449 363, said Brigadier Mashaba.\n\nThe smuggling of cigarettes has become a perennial headache for both Zimbabwe and South Africa and authorities are collaborating to curb the vice.\n\nIndications are that at least one-third of cigarettes on the South African market are smuggled from Zimbabwe.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/download-1.png",
            "description": "The 44-year-old Zimbabwean man who was recently caught smuggling a contraband of cigarettes worth R14 million into South Africa will make a formal bail application on February 6 at the Musina Magistrates’ Court in that country.",
            "time": "21:06",
            "date": "27 Jan 2025"
        },
        {
            "title": "2025 3rd African Women in Dialogue conference starts",
            "url": "https://www.herald.co.zw/2025-3rd-african-women-in-dialogue-conference-starts/",
            "content": "From Ruth Butaumocho in JOHANNESBURG, South Africa\n\nThe 2025 third African Women in Dialogue (AfWID) conference that brings over 1 000 women from 55 African countries kicked off in Johannesburg, South Africa on Monday with participants calling for the removal of the systematic barriers that hinder womens progress.\n\nIn her welcoming remarks, Women Development Trust chief executive officer Ms Riah Phiyega called on governments to push for policies that empower women in all spheres of life.\n\nWe must challenge the systemic barriers that hinder our progress and we must stand united in our fight against exclusion, gender-based violence in its multiple forms, and discrimination, she said.\n\nWe recognise the unique struggles faced by rural poor women across our continent and globe. These women are the backbone of their communities, yet they face tremendous hardships daily.\n\nThey toil tirelessly, often with limited access to education, healthcare, and economic opportunities. They are disproportionately affected by poverty, lack of infrastructure, and the impacts of climate change. Their voices are often unheard, and their needs unmet.\n\nWhile acknowledging the continued challenges that women in Africa continue to face, Ms Phiyega applauded positive spins off the continent has recorded from the recommendations of The Beijing Platform for Action.\n\nThe landmark Beijing Conference on Gender Equality held in 1995, brought some noticeable advancements in tempering with stubborn gender inequality elements, she said.\n\nHowever, we must continue to build on this legacy and address the persistent gaps and emerging challenges.\n\nOur journey is far from over, our agenda for gender equality is loud and clear. We must remain vigilant and committed to achieving true and just equality for women.\n\nA brainchild of Mrs Zanele Mbeki, the week-long African Women in Dialogue (AfWID) conference will review the critical areas of concern identified in 1995 (BPFA) highlighting progress made, gains, and achievements.\n\nIt will also review the challenges and constraints on the advancement of African women, prospects for increased future advancements, and positive change.\n\nSixteen women, among them entrepreneurs in various fields and female councilors from Kwekwe, Murehwa, Masvingo and Bulawayo are part of the Zimbabwean delegation attending the week-long conference.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/women-680x380.jpg",
            "description": "From Ruth Butaumocho in JOHANNESBURG, South Africa The 2025 third African Women in Dialogue (AfWID) conference that brings over 1 000 women from 55 African countries kicked off in Johannesburg, South Africa on Monday with participants calling for the removal of the systematic barriers that hinder women’s progress. In her welcoming remarks, Women Development Trust […]",
            "time": "21:06",
            "date": "27 Jan 2025"
        },
        {
            "title": "UAE reaffirms commitment to strengthening bilateral relations with Zimbabwe",
            "url": "https://www.herald.co.zw/uae-reaffirms-commitment-to-strengthening-bilateral-relations-with-zimbabwe/",
            "content": "Remember Deketeke\n\nThe United Arab Emirates (UAE) has reiterated its interest to enhance bilateral relations with Zimbabwe through investment in various sectors.\n\nZimbabwe Business Council board member, Mr Chad Mhako, said this during a press conference this afternoon.\n\nZimbabwe presents an intriguing opportunity for investors from all directionswhether from the east, west, north or south, Mr Mhako said, highlighting the countrys potential as a viable investment destination.\n\nHe also shared insights from a recent meeting with the Ambassador of the UAE to Zimbabwe and his team.\n\nI believe we had a very productive discussion regarding the advancement of trade and investment cooperation between Zimbabwe and the UAE, he said.\n\nThe UAEs commitment to investing in Zimbabwe is expected to open new avenues for economic growth and development, thereby fostering a mutually beneficial relationship between the two nations.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Screenshot-40-1-680x380.png",
            "description": "Remember Deketeke The United Arab Emirates (UAE) has reiterated its interest to enhance bilateral relations with Zimbabwe through investment in various sectors. Zimbabwe Business Council board member, Mr Chad Mhako, said this during a press conference this afternoon. “Zimbabwe presents an intriguing opportunity for investors from all directions—whether from the east, west, north or south,” […]",
            "time": "21:06",
            "date": "27 Jan 2025"
        },
        {
            "title": "R440 000 fraudster convicted",
            "url": "https://www.herald.co.zw/r440-000-fraudster-convicted/",
            "content": "Yeukai Karengezeka\n\nCourt Correspondent\n\nHarare regional magistrate Mr Stanford Mambanje has convicted a man who defrauded a South African-based mining company of R440 000.\n\nCalton Muduwiwa (39) was convicted of fraud after a full trial.\n\nProsecutor Mr Ngoni Kaseke submitted that the accused was facing a serious offence that could attract a sentence of up to 35 years.\n\nHe said the amount involved was huge, adding that the complainant would not be able to recover it.\n\nMr Kaseke also said the accused was the complainants friend, hence he broke his trust.\n\nThe complainant in this case is Davure Mining, represented by its manager Masimba Mukarati.\n\nDavure Mining has subsidiaries in South Africa and Zimbabwe and has interests in mining and agriculture.\n\nThe court heard that on October 20, 2021, Mukarati wanted to acquire a Toyota Hilux Legend 50 double-cab from South Africa. He shared the information with Muduwiwa, who subsequently volunteered to assist him in importing the vehicle.\n\nActing upon Muduwiwas instruction, Davure Mining paid Wish Worthy Investments for the vehicle.\n\nAfter the payment, Mukarati reportedly availed proof of payment to Muduwiwa, but the vehicle was not availed.\n\nMuduwiwa later became evasive.\n\nMukarati then reported the matter to the police, leading to Muduwiwas arrest.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/04/Trial.jpg",
            "description": "Yeukai Karengezeka Court Correspondent Harare regional magistrate Mr Stanford Mambanje has convicted a man who defrauded a South African-based mining company of R440 000. Calton Muduwiwa (39) was convicted of fraud after a full trial. Prosecutor Mr Ngoni Kaseke submitted that the accused was facing a serious offence that could attract a sentence of up […]",
            "time": "21:06",
            "date": "27 Jan 2025"
        },
        {
            "title": "Women mediators’ network aims to transform peacebuilding in Southern Africa",
            "url": "https://www.herald.co.zw/women-mediators-network-aims-to-transform-peacebuilding-in-southern-africa/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nIn a landmark event that is set to boost peacebuilding and mediation efforts in the region, the Southern African Development Community (SADC) is set to launch the Network of Women Mediators in Southern Africa in South Africa on Tuesday.\n\nThe initiative, launched in partnership with the Swiss Federal Department of Foreign Affairs and the African Centre for the Constructive Resolution of Disputes (ACCORD), will be officiated by former Malawian President and SADC Panel of Elders member Joyce Banda.\n\nThe network seeks to amplify the role of women in mediation and peace processes across the region.\n\nIn a statement, the SADC secretariat said the network will be significant in fostering lasting peace and stability.\n\nThe launch of the Network of Women Mediators marks a pivotal moment for our region, reads part of the statement.\n\nIt is a clear demonstration of our commitment to empowering women as key drivers of peace, while addressing the critical need for inclusive mediation processes in Southern Africa.\n\nThe networks creation aligns with SADCs mission to promote sustainable development, regional integration, and good governance.\n\nAs conflict resolution remains a key priority for the organisation, this platform will provide female mediators with the tools and support necessary to contribute effectively to peace-making efforts.\n\nThe launch will bring together policymakers, peace practitioners, and regional stakeholders to discuss the networks objectives and strategies for tackling mediation challenges.\n\nSADC has 16 member States that are committed to regional cooperation and development.\n\nThese are Angola, Botswana, Comoros, Democratic Republic of Congo, Eswatini, Lesotho, Madagascar, Malawi, Mauritius, Mozambique, Namibia, Seychelles, South Africa, Tanzania, Zambia and Zimbabwe.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/SADCC.jpg",
            "description": "Ivan Zhakata Herald Correspondent In a landmark event that is set to boost peacebuilding and mediation efforts in the region, the Southern African Development Community (SADC) is set to launch the Network of Women Mediators in Southern Africa in South Africa on Tuesday. The initiative, launched in partnership with the Swiss Federal Department of Foreign […]",
            "time": "21:06",
            "date": "27 Jan 2025"
        },
        {
            "title": "Council to bar suspected land baron from its offices",
            "url": "https://www.herald.co.zw/council-to-bar-suspected-land-baron-from-its-offices/",
            "content": "Herald Reporter\n\nHarare City Council says it wants to bar a suspected land baron and opposition activist Gilbert Bgwende from visiting its premises amid allegations that he is working in cahoots with some officials to grab council land.\n\nThis is contained in a leaked memo from acting director of human shelter services, Mr Edgar Dzehonye. The memo was addressed to the citys head of public safety and copied to the mayor, the director of housing, the town clerk and the chamber secretary.\n\nMr Dzehonye said he noted with concern the illegal activities by one Bgwende, who is in the habit of illegally grabbing approved lay-out plans and selling council land.\n\nHis illegal conduct is now habitual. This is unwelcome. His illegal activities once saw council taking action against his collaborators through disciplinary action, reads part of the memo.\n\nThis resulted in some casualties in the form of council employees who were dismissed. He must be barred from accessing council premises.\n\nMr Dzehonye said Bgwende ought to be barred as he has also instituted acts of banditry in the past.\n\nThe worst of such acts were in the Highfield Probation area where he shot and injured one Moffatt Swizani sometime in 2019, he said.\n\nThe shooting was done using his 9mm pistol that was acquired for gun club sport purposes.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/03/Harare-City-Council.jpg",
            "description": "Herald Reporter Harare City Council says it wants to bar a suspected land baron and opposition activist Gilbert Bgwende from visiting its premises amid allegations that he is working in cahoots with some officials to grab council land. This is contained in a leaked memo from acting director of human shelter services, Mr Edgar Dzehonye. […]",
            "time": "21:06",
            "date": "27 Jan 2025"
        },
        {
            "title": "National hero Cde Mupamhanga buried",
            "url": "https://www.herald.co.zw/national-hero-cde-mupamhanga-buried/",
            "content": "Zvamaida Murwira\n\nNational hero and career civil servant, Cde Justin Mupamhanga was buried this Monday morning at the National Heroes Acre in Harare at an event that was presided over by Acting President Dr Costantino Chiwenga.\n\nIn his moving eulogy during the burial, Acting President Chiwenga described Cde Mupamhanga as a great patriot.\n\nCde Mupamhanga was a great patriot, demonstrated by tireless dedication and selfless service, he said.\n\nHe understood the sacrifices required for progress and continuously sought to uplift our people, echoing the wartime mantra that called for unity and a collective vision for our nations future.\n\nIn mind comes the song, tose tichanoguta kumusha muZimbabwe yakasununguka. It was a call that helped us endure hardships and gave us a glimpse of the world we were carving through shared sacrifices, said the Acting President.\n\nWe fought for a total Zimbabwe, fought for all its wealth, the minerals, the flora, the fauna, its cultures, its heritage, its identities, its beliefs. Indeed, we fought for its rise as a soaring great nation.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/5b738450-3cd5-4b18-b3ff-02a9cfb4b94e-680x380.jpeg",
            "description": "Zvamaida Murwira National hero and career civil servant, Cde Justin Mupamhanga was buried this Monday morning at the National Heroes Acre in Harare at an event that was presided over by Acting President Dr Costantino Chiwenga. In his moving eulogy during the burial, Acting President Chiwenga described Cde Mupamhanga as a great patriot. “Cde Mupamhanga […]",
            "time": "21:06",
            "date": "27 Jan 2025"
        },
        {
            "title": "Traffic Safety Council board, management sign corporate integrity pledge",
            "url": "https://www.herald.co.zw/traffic-safety-council-board-management-sign-corporate-integrity-pledge/",
            "content": "Freeman Razemba\n\nSenior Reporter\n\nThe Zimbabwe Traffic Safety Council of Zimbabwe (TSCZ) board and management have signed the corporate integrity pledge, reaffirming their commitment to combating corruption and promoting transparency and accountability.\n\nThe signing ceremony, held in Harare this Monday, was overseen by the Zimbabwe Anti-Corruption Commission (ZACC) chairperson, Mr Michael Reza.\n\nTSCZ board members, led by deputy chairperson Ms Lizwe Bhunu, managing director Mr Munesu Munodawafa, and the secretariat, pledged to play their role in fighting corruption.\n\nAn integrity pledge is a social contract through which individuals affirm their commitment to act against corruption.\n\nZACC chairperson Mr Michael Reza said, This strategy seeks to strengthen institutional capacity in the fight against corruption. The Traffic Safety Council of Zimbabwes response is a testimony of the organisations commitment to strengthening the foundations of integrity internally for a corruption-free Zimbabwe.\n\nThe pledge is not just a document, it is a testimony of the organisations solid commitment to ethical conduct, transparency, and accountability.\n\nThe benefits that will accrue from the signing of this pledge are both immediate and long term.\n\nMr Reza said this will strengthen public trust in the institution.\n\nWhen citizens know that an organisation operates with unwavering integrity, they are more likely to participate and embrace the organisations initiatives on campaigns to promote road safety by voluntarily calling out bad behaviour, he said.\n\nThe fight against corruption is not just a matter of policy or law enforcement, it is a moral issue that touches every aspect of our society.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/download-3.png",
            "description": "Freeman Razemba Senior Reporter The Zimbabwe Traffic Safety Council of Zimbabwe (TSCZ) board and management have signed the corporate integrity pledge, reaffirming their commitment to combating corruption and promoting transparency and accountability. The signing ceremony, held in Harare this Monday, was overseen by the Zimbabwe Anti-Corruption Commission (ZACC) chairperson, Mr Michael Reza. TSCZ board members, […]",
            "time": "21:06",
            "date": "27 Jan 2025"
        }
    ]
}