{
    "news": [
        {
            "title": "Education sector milestones bear fruit. . .President meets Moot Court winners",
            "url": "https://www.herald.co.zw/education-sector-milestones-bear-fruit-president-meets-moot-court-winners/",
            "content": "Zvamaida Murwira\n\nSenior Reporter\n\nPRESIDENT Mnangagwa has commended learners who excel in their educational pursuits, saying they deserve recognition as that gives impetus to the countrys Heritage-based Education 5.0 and cements milestones achieved in the education sector.\n\nThe President said this yesterday at State House where he met Team Zimbabwe learners from Heritage School and St Georges College, winners of the prestigious Orate Africa Moot Court Competition for the Sadc region held recently in Gaborone, Botswana.\n\nThe learners are now destined for an African competition to be held in Ghana in August this year.\n\nCommenting on the learners performance, President Mnangagwa said he took pride in pupils who do well in their educational studies.\n\nI delight in meeting our young people who excel. This is critically important. There are so many children of the same age, same school, but those who find their way to this place should feel privileged, but most importantly, it is because they have performed well, that is why they are able to come and meet the Head of State; I congratulate them, he said.\n\nThe Minister of Primary and Secondary Education, Torerayi Moyo, said the awards for the learners spoke volumes of how rich Zimbabwes Heritage-based Education was and lauded the milestones registered in that sector.\n\nThe importance of this competition is that education should be meaningful. Education that does not produce goods and services that our people need is useless and is not important.\n\nThrough the Heritage-based curriculum, we want to identify talents in our students. Those who are good in law, so be it. They were competing as lawyers. A moot court is like a mock court session where we have judges as adjudicators and they have won, said Minister Moyo.\n\nSo the Heritage-based curriculum ensures that they have identified their career pathway. So, on completion of A-Level, I can envision that these students will proceed to university and study law and become lawyers. So that is the advantage of Heritage-based education that our President has approved and we are implementing it very well.\n\nMinister Moyo commended President Mnangagwa for creating an educational environment that allows good students to excel.\n\nI want to appreciate and thank His Excellency, the President, Cde Emmerson Dambudzo Mnangagwa, for affording our students an opportunity to interact and engage with others.\n\nI want to congratulate the students for performing exceptionally well. They managed to come first out of 19 schools, and there were seven countries that participated in the moot court competition.\n\nSo, Zimbabwe will represent the Southern region in the next competition to be held in Ghana in August, and we wish our students very well, he said.\n\nTheir coach, Ms Bernadette Mazambani Chigwida, said it was through sheer hard work that they brought the trophy home.\n\nIt is a competition which is a simulation of your court proceedings. We had seven countries and 19 schools, and out of those 19 schools, our Team Zimbabwe managed to come out first. So we have the best speaker from thecompetition from Zimbabwe; we also have the best female speaker, andI was voted the best adjudicator, said Ms Chigwida.\n\nThe best student speaker, Simbarashe Mujuru, was delighted to meet President Mnangagwa, saying it will spur him to continue working hard.\n\nThe competition was difficult, but through sleepless nights and hard work, we managed to win. The exposure itself and the chance to represent the country is something we will not forget.\n\nThe opportunity to meet the President; this is the person who runs the country and for him to take his time to meet us, is something we appreciate, he said.\n\nThe best female speaker, Kimberly Chamboko, echoed the same sentiments.\n\nIt was very tough  there were many schools, many countries, but we managed to push through many sleepless nights.\n\nIt was a learning experience, trying to learn about the laws and everything, but we managed to come through, and we brought the trophy back home to Zimbabwe, said Chamboko from Heritage School in Borrowdale.\n\nOther students who participated are James Charumbira, Samuelson Kapingidza, and Munotida Foya from St Georges College.\n\nOthers are Trish Kadenhe and Beverly Chifeya from Heritage School.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/thh-680x380.jpg",
            "description": "Zvamaida Murwira Senior Reporter PRESIDENT Mnangagwa has commended learners who excel in their educational pursuits, saying they deserve recognition as that gives impetus to the country’s Heritage-based Education 5.0 and cements milestones achieved in the education sector. The President said this yesterday at State House where he met Team Zimbabwe learners from Heritage School and […]",
            "time": "06:31",
            "date": "08 Apr 2025"
        },
        {
            "title": "New Mbare Market commissioning on Friday",
            "url": "https://www.herald.co.zw/new-mbare-market-commissioning-on-friday/",
            "content": "Blessings Chidakwa\n\nPRESIDENT Mnangagwa will officially open the newly-built Mbare Musika Market in Harare on Friday, as the Mbare Urban Renewal and Regeneration project comes to fruition.\n\nThe market, a key hub for trade, was built from scratch to improve infrastructure and sanitation, with the facelift set to boost local commerce and enhance conditions for both vendors and shoppers.\n\nIn November last year, President Mnangagwa declared a state of disaster in Mbare following an inferno that destroyed stalls and goods, directing that the area be modernised within the shortest possible time.\n\nWith urban renewal and regeneration close to his heart, the rejuvenation of Mbare was undertaken as a prototype to be replicated nationwide.\n\nZimbabwe Stock Exchange-listed firm Masimba Holdings, the main contractor for the Mbare Traders Market, is leading the renewal programme and is expected to also construct the main market.\n\nYesterday, several Cabinet Ministers toured the new Mbare Market, including the Minister of Local Government and Public Works, Daniel Garwe, the Minister of National Housing and Social Amenities, Zhemu Soda; the Minister of Youth Empowerment, Development and Vocational Training, Tino Machakaire; and the Minister of State for Provincial Affairs and Devolution for Harare Metropolitan Province, Charles Tavengwa.\n\nMinister Garwe said everything is in place for the commissioning of the new market.\n\nOn Friday, His Excellency is coming to commission this beautiful traders market and also break ground on the main market at the old traders site.\n\nSo we came here to assess whether our investors and contractors have fulfilled our expectations. We are now at 99,99 percent in terms of readiness, he said.\n\nMinister Garwe said there were a few minor areas still requiring final touches.\n\nSo we came here with the Minister of Womens Affairs, the Minister of State for Harare Province, the traders themselves represented by their leadership, and all other stakeholders. Everyone is ready and waiting for Friday, he said.\n\nMbare Retail Market Traders Association chairperson Mr Erasmus Fofo praised the President for delivering a modern market.\n\nWe have a listening President. Since the time we had the inferno, we never expected such a beautiful market would be built here, he said.\n\nMr Fofo, however urged the local authority to ensure reasonable prices for traders, especially considering the devastating fire they experienced last year.\n\nMinister Tavengwa assured vendors that the Government is implementing measures to reduce rent burdens and ensure that no one is forced out of business due to unaffordable operating costs.\n\nWe are putting in place concrete measures to ease rent burdens, he said.\n\nNo one should be forced out of business due to unaffordable operating costs. The Government is committed to protecting small traders and vendors, who form the backbone of our informal economy.\n\nHarare Mayor Jacob Mafume said the market exemplifies a strong partnership between central Government and local Government.\n\nThis was built after the Government declared a national disaster. We got a contractor Masimba Holdings alongside the Government andthe City of Harare.\n\nIn a collaborative effort, we worked together to construct what is a modern, temporary market, while we prepare to restore and rebuild the main market where vendors had been operating from, he said.\n\nMayor Mafume said this first phase had been completed in record time, as promised.\n\nThe vendors will be housed here temporarily while we build the main vegetable market in Mbare. It will also include better facilities, more space, and larger stores for the traders to operate in, he said.\n\nThe new Mbare Traders Market stands as a testament to President Mnangagwas vision of transforming Zimbabwe into an upper middle income economy by 2030.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Screenshot-2025-04-08-at-00.12.13-680x380.png",
            "description": "Blessings Chidakwa PRESIDENT Mnangagwa will officially open the newly-built Mbare Musika Market in Harare on Friday, as the Mbare Urban Renewal and Regeneration project comes to fruition. The market, a key hub for trade, was built from scratch to improve infrastructure and sanitation, with the facelift set to boost local commerce and enhance conditions for […]",
            "time": "06:31",
            "date": "08 Apr 2025"
        },
        {
            "title": "Independence Day preps 80pc complete",
            "url": "https://www.herald.co.zw/independence-day-preps-80pc-complete/",
            "content": "Blessings Chidakwa and Richard Muponde\n\nPREPARATIONS for the upcoming Independence Day celebrations at Nembudziya Growth Point in Gokwe are now 80 percent complete, with infrastructure development in full swing, including the completion of the football pitch.\n\nThis comes as the official lighting of the Independence Torch will take place at the Museum of Human Sciences in Harare tomorrow.\n\nAnnouncing the programme leading up to the main celebrations on 18 April, the Ministry of Home Affairs and Cultural Heritage said the torch will be taken for a stopover ceremony in Kwekwe where it will be officially presented to the Midlands Provincial leadership at Mutapa Hall on Thursday.\n\nVice President Dr Constantino Chiwenga will preside over the event.\n\nThe official lighting of the torch will take place at Sikombela Detention Camp on April 17, before being relayed to the main venue in Nembudziya by torch-bearers.\n\nVice President Kembo Mohadi will lead the proceedings.\n\nThe Zimbabwe Independence Flame is an enduring symbol of the countrys struggle for freedom and its commitment to building a better future for all its citizens.\n\nAs the flame continues to burn brightly, it serves as a reminder of the sacrifices made by those who fought for Independence and as a beacon of hope for generations to come.\n\nIn terms of infrastructure development, Gokwe North District, where the 45th Independence celebrations will be held, is witnessing significant transformation.\n\nKey among the developments is the completion of roadworks connecting Gokwe to surrounding areas, ensuring easier access for the thousands of people expected to attend.\n\nThe improved road network is seen as both a logistical boost for the celebrations and a long-term investment in local infrastructure.\n\nIn addition to road upgrades, several schools in the district arebeing refurbished with fresh coats of paint, roofing repairs, and improved sanitation facilities.\n\nThe education improvements are part of broader efforts to leave a lasting legacy beyond the festivities.\n\nDrilling of solarised boreholes is also in overdrive, with several having been completed. Another major highlight is the sprucing up of the Nembudziya Mortuary, which is receiving modern equipment and structural upgrades.\n\nThe improvements are part of an ongoing commitment to uplift public health services in the area.\n\nIn an interview yesterday, Zanu PF Midlands provincial chairperson Cde Edson Chiherenge said the province was ready to host the giant event.\n\nNow, we are at 80 percent completion, with only minor outstanding works. All the major works have been completed, including structures for buildings at different schools.\n\nContractors are now at the roofing stage while we are also doing floors and plastering, he said.\n\nCde Chiherenge said roads connecting to Gokwe Nembudziya have been rehabilitated.\n\nRoads that connect to the venue include Chakari, Jakani, Hovano, Galavi, Choda, and Copper Queen, and they have been rehabilitated. Tarring of the growth point has also been done.\n\nConstruction of a mortuary at Nembudziya Hospital is almost complete. Drilling of mechanised solarised boreholes is also underway. The stadium is complete, with roofing of changing rooms underway, he said. Locals have expressed optimism about the pace of progress.This is not just a one-day celebration. It is about showing the world what rural Zimbabwe can achieve when development is prioritised, said Mr Trymore Gumbi, a Gokwe villager. Mrs Anotida Runesu also hailed the progress.\n\nWe thank President Mnangagwa for rotating the hosting of national events. Indeed, he is staying true to his word of leaving no one and no place behind, she said. With just a few days remaining, Gokwe is buzzing with anticipation, ready to welcome the nation for a celebration that promises pride, unity, and progress.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/evgwegwewe-680x380.jpg",
            "description": "Blessings Chidakwa and Richard Muponde PREPARATIONS for the upcoming Independence Day celebrations at Nembudziya Growth Point in Gokwe are now 80 percent complete, with infrastructure development in full swing, including the completion of the football pitch. This comes as the official lighting of the Independence Torch will take place at the Museum of Human Sciences […]",
            "time": "06:31",
            "date": "08 Apr 2025"
        },
        {
            "title": "Sadc in safe hands under ED — outgoing Angola Ambassador",
            "url": "https://www.herald.co.zw/sadc-in-safe-hands-under-ed-outgoing-angola-ambassador/",
            "content": "Farirai Machivenyika\n\nSenior Reporter\n\nOutgoing Angolan Ambassador to Zimbabwe, Agostinho Tavares has said Sadc is in safe hands under the chairmanship of President Mnangagwa.\n\nAmbassador Tavares said this after bidding farewell to Foreign Affairs and International Trade Minister, Professor Amon Murwira at his Munhumutapa Offices in Harare yesterday.\n\nI think Sadc is in good hands. Zimbabwe has a lot of experience so I think His Excellency, the President, Dr Emmerson Dambudzo Mnangagwa is going to lead the Sadc region in good ways to do what is necessary for the development of the region.\n\nSo, Zimbabwe and the Sadc is in good hands, he said.\n\nAs Sadc Chairman, President Mnangagwa has led efforts to find lasting peace in eastern DRC, which has been ravaged by a brutal civil war that has led to the deaths and displacement of millions of people.\n\nThe President has also championed the industrialisation of the region as a way of driving economic growth, improving its peoples livelihoods and promote regional integration.\n\nAmb Tavares also commended Zimbabwe for its hospitality during his tour of duty.\n\nLet me say that Zimbabwe, I feel Zimbabwe is like my second home. I spent five years in Zimbabwe. Zimbabwe received me very well and I think I accomplished my duty in Zimbabwe. Finally, after 32 years, we finally did the Second Session of Bilateral Joint Commission between Angola and Zimbabwe last year in May.\n\nSo, in that session Angola and Zimbabwe signed 11 legal instruments in different areas like cultural cooperation, sport and other ones, memorandums of understanding between Angola and Zimbabwe. So, Im leaving Zimbabwe in a few weeks, maybe the end of this month, but Zimbabwe for me is still my second home.\n\nSo, I feel Zimbabwe, the relationship between Angola and Zimbabwe is more attractive and I made many friends in Zimbabwe and I thank the Ministry of Foreign Affairs for the cooperation and collaboration between Zimbabwe and Angola, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/23ffrf-680x380.jpg",
            "description": "Farirai Machivenyika Senior Reporter Outgoing Angolan Ambassador to Zimbabwe, Agostinho Tavares has said Sadc is in safe hands under the chairmanship of President Mnangagwa. Ambassador Tavares said this after bidding farewell to Foreign Affairs and International Trade Minister, Professor Amon Murwira at his Munhumutapa Offices in Harare yesterday. “I think Sadc is in good hands. […]",
            "time": "06:31",
            "date": "08 Apr 2025"
        },
        {
            "title": "Former Chronicle journalist dies",
            "url": "https://www.herald.co.zw/former-chronicle-journalist-dies/",
            "content": "Herald Reporter\n\nVETERAN journalist and former Chronicle reporter, Herbert Mutugwi, has died.\n\nHe was 58.\n\nMr Ray Mungoshi, executive secretary of the Zimbabwe Mass Media Trust (ZMMT), announced the sad news in a statement yesterday.\n\nHe said the veteran journalist collapsed and died at the New Ziana offices in Harare yesterday where he was now based.\n\nMutugwi cut his teeth in the journalism fraternity when he joined the Chronicle as a cadet reporter in 1987 before he was promoted to the position of Assistant News Editor in 1992.\n\nIn 1997 he assumed the role of News Editor at Manica Post before joining the Community Newspapers Group (New Ziana) as Editor of the Nehanda Guardian in Bindura in 2010.\n\nHe later edited the Masvingo Star and was transferred to Harare to strengthen the New Ziana news agency as a Senior Editor.\n\nThe Board of Trustees of the Zimbabwe Mass Media Trust, along with management and staff, extend our heartfelt condolences to Herberts family and friends during this difficult time, said Mr Mungoshi.\n\nHebert was a valuable member of our team and played a crucial role in the revival efforts of New Ziana. His experience, expertise, and unparalleled ability to mentor young reporters will be deeply missed.\n\nWe have lost a true champion of journalism. His legacy will live on through the many lives he touched.\n\nFuneral arrangements will be announced in due course.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/rthrhrh-680x380.jpg",
            "description": "Herald Reporter VETERAN journalist and former Chronicle reporter, Herbert Mutugwi, has died. He was 58. Mr Ray Mungoshi, executive secretary of the Zimbabwe Mass Media Trust (ZMMT), announced the sad news in a statement yesterday. He said the veteran journalist collapsed and died at the New Ziana offices in Harare yesterday where he was now […]",
            "time": "06:31",
            "date": "08 Apr 2025"
        },
        {
            "title": "Senate president hail IPU",
            "url": "https://www.herald.co.zw/senate-president-hail-ipu/",
            "content": "Farirai Machivenyika\n\nSenior Reporter\n\nSenate president, Cde Mable Chinomona has hailed the Inter Parliamentary Unions (IPU) Forum of Women Parliamentarians for its contribution to Zimbabwes promulgation of laws that advance gender equality and protection of women and girls.\n\nCde Chinomona said this during celebrations to mark the 40th anniversary of the IPU Womens Forum at the ongoing IPU Assembly being held in Uzbekistan.\n\nThe Assembly began on Friday with participants drawn from 181 countries.\n\nParliament said Cde Chinomona had commended the IPU Womens Forum during its celebrations marked under the theme; Lets celebrate-40 years of action, 40 years of impact.\n\nHonourable on Chinomona lauded the significant contribution of the IPUs Forum of Women Parliamentarians to Zimbabwe, particularly in legislative initiatives that protect women and girls, such as the Domestic Violence Act and the Education Amendment Act which ensures access to education for pregnant girls.\n\nFurthermore, she called for collaboration within networks of women parliamentarians to advance gender equality as well as empowering women in leadership. Such collaborations are an imperative towards strengthening women leadership and representation in the decision-making processes, reads the statement .\n\nCde Chinomona shared specific initiatives that Zimbabwean women parliamentarians will champion during the Assembly, such as community engagement programmes, mentorship for young women and lobbying for gender-responsive budgeting in the national budget.\n\nShe also reaffirmed Zimbabwes commitment to International Agreements and the need for collaborating with regional counterparts to enact legislative laws that align with global gender equality standards, further reads the statement.\n\nMeanwhile, Speaker of Parliament Advocate Jacob Mudenda who is leading Zimbabwes delegation at the IPU Assembly, led a successful drafting meeting of the Africa Geopolitical group, as mandated by the Africa Geopolitical Group plenary whose terms of reference were to draft and synchronise an emergency item incorporating the Arab Group.\n\nThe Committee held a joint Meeting with representatives from the Arab Groups proposal which culminated in an agreement to co-sponsor an Emergency Item for possible inclusion on the IPU Assembly Agenda.\n\nThe IPU Assembly was officially opened on Saturday by Speaker of the Legislative Chamber of Uzbekistan, Mr Nuriddinjon Ismailov.\n\nHe welcomed all delegates to the historic IPU Assembly and underscored its significance to the region particularly as it is the first IPU Assembly hosted by a country in Central Asia.\n\nHe added that the 150th Assembly marked a milestone in the countrys engagement with the global community in its quest to promote regional and international cooperation through Parliamentary diplomacy.\n\nIn this context, the Mr Ismailov called for collaborative efforts to ensure sustained global peace and stability for sustainable development.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/12/marble.jpg",
            "description": "Farirai Machivenyika Senior Reporter Senate president, Cde Mable Chinomona has hailed the Inter Parliamentary Union’s (IPU) Forum of Women Parliamentarians for its contribution to Zimbabwe’s promulgation of laws that advance gender equality and protection of women and girls. Cde Chinomona said this during celebrations to mark the 40th anniversary of the IPU Women’s Forum at […]",
            "time": "06:31",
            "date": "08 Apr 2025"
        },
        {
            "title": "Govt goes hi-tech at Beitbridge border post",
            "url": "https://www.herald.co.zw/govt-goes-hi-tech-at-beitbridge-border-post/",
            "content": "Thupeyo Muleya\n\nBeitbridge Bureau\n\nTHE Government has started implementing a host of measures as it embraces digital services to streamline operations and boost the movement of cargo and travellers at Beitbridge Border Post.\n\nThe latest move is part of the Governments drive to match service delivery in line with a modernised Beitbridge Border Post.\n\nSo far the Department of Immigration has introduced the use of automated gates systems, commonly referred to as eGates and the online border management system.\n\nAdditionally, the Zimbabwe Revenue Authority (Zimra) is now using fast cargo scanners, drones, the Zimbabwe Single Window platform and the eTIP (electronic Temporary Import Permit) that has seen services improving.\n\nSpeaking during an oversight visit to the border by the Parliamentary Portfolio Committee on Defence, Home Affairs and Security, the Assistant Regional Immigration officer Beitbridge, Mr Lucky Joe Matyora, said eGates were introduced in October last year.\n\nUnder the new setup, the eGates enable travellers to scan their biometric passports and undergo automated identity verification, replacing the need for manual passport checks by border officials, he said.\n\nThis system is expected to significantly reduce waiting times and improve the efficiency of border control procedures. It is part of the Governments broader efforts to modernise its ports of entry.\n\nIt also aligns with global trends towards more streamlined and secure border management through the use of advanced technologies. We expect to use the same system which we are piloting to efficiently clear an anticipated surge of traffic during the forthcoming Easter holidays.\n\nThe new immigration system is complementary to the current automation system at the border where most services are now being digitised.\n\nThe OBMS is able to capture travellers bio-data, picking flagged travellers, auto generating days for visitors, for example allocating 30 days for those visitors travelling on holidays, seven days for business travel and three days for those transiting through our country.\n\nMr Matyora said the new system has helped reduce human interface and rent seeking activities at the border.\n\nWe are piloting the project and so far we are happy with the situation on the ground, he said.\n\nWe are also working with other border agencies to tighten security through the use of CCTVs and drones. This has seen us being able to detect and weed out undesirable persons at the border and its flanks.\n\nMr Matyora said through collaborations with other border agencies, they have managed to reduce the smuggling of unaccompanied minors through the border.\n\nIn 2023, he said, they intercepted over 300 minors and last year they managed to intercept and process 149 minors.\n\nThe Zimbabwe Revenue Authority (Zimra) manager (Beitbridge), Mrs Winfred Chiyangwa, said they were using the Zimbabwe Electronic Single Window (ZESW) initiative as a way of enhancing the ease of doing business.\n\nThe concept was introduced in 2022 as part of measures to enhance efficient clearance of legitimate traffic and trade facilitation at the countrys ports of entry.\n\nShe said the main objective of the ZESW is to improve trade facilitation and to achieve efficiency to boost revenue collection, enforcement of trade laws, social protection, and providing business intelligence to the government.\n\nZimra is the lead agency ensuring the co-ordination and harmonisation of clearance processes at the countrys ports of entry.\n\nCurrently there are 22 border agencies at major ports authorities including Beitbridge whose operations will be harmonised and streamlined under the ZESW.\n\nUnder the new order clients and stakeholders will not be moving from one agency to another as all the regulatory and transitory services, processes and payments will now be done online through a single platform, thus faster, better, and transparent, she said.\n\nThe major benefits of the Single Window will be compliance among agencies, more efficient and productive use of resources, enhanced collection of fees, duties, and penalties.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/q3f22f2f-680x380.jpg",
            "description": "Thupeyo Muleya Beitbridge Bureau THE Government has started implementing a host of measures as it embraces digital services to streamline operations and boost the movement of cargo and travellers at Beitbridge Border Post. The latest move is part of the Government’s drive to match service delivery in line with a modernised Beitbridge Border Post. So […]",
            "time": "06:31",
            "date": "08 Apr 2025"
        },
        {
            "title": "Cyber-crime: Potraz calls for phone handset registration",
            "url": "https://www.herald.co.zw/cyber-crime-potraz-calls-for-phone-handset-registration/",
            "content": "Richard Muponde\n\nTHE Post and Telecommunications Regulatory Authority of Zimbabwe (POTRAZ) is lobbying the Government for mandatory registration of mobile handsets by SIM card holders to enhance the security of electronic transactions and combat cyber-crimes.\n\nEngineer Hasha Myambo, POTRAZs competition and standards manager, stressed the necessity of registering handsets alongside the existing SIM database to improve transaction security and restore trust in the ICT sector.\n\nThere is a need for appropriate policies to address the different vices that happen in cyberspace, Eng Myambo said.\n\nHe said while there is an instrument compelling operators to register all issued SIM cards, we are lobbying for a corresponding instrument that puts in place a Central Equipment Identification Database for handsets to which operators subscribe.\n\nThis database would enable the blocking of stolen or lost devices from operating on any network shortly after a report is filed.\n\nThe regulator is engaging ICT stakeholders, particularly other regulators, to come up with coherent national plans that integrate ICT-based development to maximise the impact of ICTs on economic growth and social development, Eng Myambo said.\n\nHe said the registration initiative signifies a shift from a command-and-control regulatory approach to a collaborative model, fostering a competitive digital economy.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2020/10/cyberbullying.png",
            "description": "Richard Muponde THE Post and Telecommunications Regulatory Authority of Zimbabwe (POTRAZ) is lobbying the Government for mandatory registration of mobile handsets by SIM card holders to enhance the security of electronic transactions and combat cyber-crimes. Engineer Hasha Myambo, POTRAZ’s competition and standards manager, stressed the necessity of registering handsets alongside the existing SIM database to […]",
            "time": "06:31",
            "date": "08 Apr 2025"
        },
        {
            "title": "Harare council launches emergency pest control in Mbare",
            "url": "https://www.herald.co.zw/harare-council-launches-emergency-pest-control-in-mbare/",
            "content": "Remember Deketeke\n\nHerald Correspondent\n\nTHE Harare City Council yesterday launched an emergency pest control operation in Mbare suburb following growing pressure from residents over infestation of bed bugs in the flats.\n\nThe operation targeted the high-density flats in Mbare, including Matererini, Magaba and Matapi flats, where residents say infestations have worsened since the last exercise in 2019.\n\nDespite being one of Harares oldest suburbs, 74-year-old Mr Jane Kakomwe, who stays in Matereni Flats, alleges the area had been continuously overlooked when it came to pest control and urban sanitation.\n\nWe have been living with bed bugs for years now, she said.\n\nThe last time they came to spray was in 2019, and even then, they did not spray every block. Since then, nothing has been done. As residents, we have been ignored for too long.\n\nIt is now hard to visit people or invite guests. We are embarrassed. People avoid us because they think we are dirty, but this is a result of council failing to deliver services, she said.\n\nAnother resident, Mr John Pakatsi, expressed anger over what he believed was mismanagement of public funds.\n\nFor years we have heard the Government had been providing council with funds for painting, maintenance and respraying of these buildings, Mr Pakatsi said.\n\nBut nothing has been done. We are calling on the Government to track down those responsible for diverting or misusing these funds and hold them accountable.\n\nSpeaking during a community meeting in Mbare, Harare Mayor Jacob Mafume acknowledged the delay in intervention and announced that the city will now calendarise the control mechanism to ensure regular fumigation and monitoring.\n\nThis is not going to be a once-off job, said Clr Mafume. We are putting in place a scheduled pest control programme across all affected suburbs, and Mbare is at the top of that list.\n\nHowever, some residents remain sceptical, pointing to years of broken promises and declining standards of living.\n\nWe want action, not speeches, said a resident who asked not to be named.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/23f3r-680x380.jpg",
            "description": "Remember Deketeke Herald Correspondent THE Harare City Council yesterday launched an emergency pest control operation in Mbare suburb following growing pressure from residents over infestation of bed bugs in the flats. The operation targeted the high-density flats in Mbare, including Matererini, Magaba and Matapi flats, where residents say infestations have worsened since the last exercise […]",
            "time": "06:31",
            "date": "08 Apr 2025"
        },
        {
            "title": "Legends Night to remember",
            "url": "https://www.herald.co.zw/legends-night-to-remember/",
            "content": "Ruth Butaumocho and Tafadzwa Zimoyo\n\nEpic!\n\nThe above describes the inaugural Ecobank Legends Night 2025 that took place on Sunday Night at the Rainbow Towers in Harare.\n\nThe show that attracted music fans from Harare and its environs lived up to its billing as the popular boy band, Intotal Band thrilled legions of music fans with a well-coordinated and rich discography from both living and late Zimbabwean musicians.\n\nFrom sungura, Dendera, Chimurenga music, gospel and urban grooves, the highly expectant music fans danced the night away, singing along to their legends top songs.\n\nFans were taken down memory lane, two or more decades back as they danced to the classic Solo naMutsai from Devera Ngwena Jazz Band, Character from the late music crooner Tendai Mupfurutsa, Calvin and Muzis Tombofara, Leonard Zhakatas Mugove, Andy Browns Mapurisa and Todii from national hero, Dr Oliver Mutukudzi.\n\nThe band churned out the late Andy Browns Mapurisa, Shungu Iwe, Rudo Imoto from Marshall Munhumumwe, Shingisai Sulumas Fara Zvakadaro, Nyoka Musango from Thomas Mapfumo, Huya Uzoona from late Stella Chiweshe and Special Meat from Callisto Nyamhute.\n\nIntotal Band made up of different session musicians was in indeed in control of the musical extravaganza, and proved their mettle in putting together a high octane musical show of just renditions.\n\nThey did not leave any room for flaws either in sound and in voices. The connection they exhibited of both voices and body language showed that they had done their homework well and were prepared to enthral their fans.\n\nThe voice imitations were exuberant, tight and sounded real so much that one would have been mistaken to think that some of the musical legends were actually in the house.\n\nEven the vintage and classic dressing of flared high waist trousers, berry-bottoms, floral waist coats, shiny sequins outfits and long afro hairstyles were befitting costumes for such a show.\n\nObvious it was about the legends, yesteryear music, hence the disco setup style.\n\nTo put icing on the cake, the show also some of the local saxophonists performing together on the song, Ndire, which brought the whole auditorium to standstill.\n\nSpeaking at the show, Ecobank senior executive, Mark Dengwani paid tribute to the fans, saying Legend Nights will be bigger and better next year.\n\nIt is exciting to see music fans from all walksenjoying themselves like this.\n\nWe hope to make the Ecobank Legends Night bigger and better next year, he said.\n\nIn Total band founder member and director Joseph Chinouriri said he was happy and shocked at the same time that they had filled the giant auditorium of Harare International Conference Centre, (HICC).\n\nThis is God and I can tell you I am still in shock. After the change of venue last minuet due to some logistics with the marketed venue (Harare Gardens), I was a bit hesitant as I thought as young as we are, HICC was too big for us, he said.\n\nThree days prior to the show, the tickets started selling like hot cakes and I said to my team this is a miracle.\n\nChinouriri said he was cleared for all copyright acts.\n\nWhat we played was cleared by relevant authorities. We did not do things on our own rather we engaged even the families of the legends. They all know about this.\n\nNext year it will be bigger and better and I want to thank everyone who supported us from the start, our families, fans, stakeholders and not forgetting the InTotal team.\n\nThe saxophonist also confirmed they are taking the show to Bulawayo and United Kingdom this year.\n\nWe are happy to announce that we are taking the concept to Bulawayo on June 14 and as for the United Kingdom fans, they can expect us in August. The logistics are currently taking shape.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/FQFF-680x380.jpg",
            "description": "Ruth Butaumocho and Tafadzwa Zimoyo Epic! The above describes the inaugural Ecobank Legends Night 2025 that took place on Sunday Night at the Rainbow Towers in Harare. The show that attracted music fans from Harare and its environs lived up to its billing as the popular boy band, “Intotal Band” thrilled legions of music fans […]",
            "time": "06:31",
            "date": "08 Apr 2025"
        }
    ]
}