{
    "news": [
        {
            "title": "President lays down the law . . . cracks the whip on under-performing ministers",
            "url": "https://www.herald.co.zw/president-lays-down-the-law-cracks-the-whip-on-under-performing-ministers/",
            "content": "Blessings Chidakwa, Herald Reporter\n\nPRESIDENT Mnangagwa yesterday cracked the whip on under-performing Ministers of State for Provincial Affairs and Devolution who are creating unnecessary glitches in Government operations by failing to submit reports and attend vital Cabinet Committee meetings.\n\nKeeping his hand on the pulse of national development, President Mnangagwa had a lively session with 10 Ministers of State for Provincial Affairs who are in charge of the countrys 10 administrative provinces.\n\nThe meeting was held at State House in Harare.\n\nThe President said for Government to have an effective National Devolution Agenda, Provincial Ministers must submit comprehensive and timely reports.\n\nHe said these include both ad-hoc as well as routine reports on the state of provinces, highlighting all aspects including those on economic affairs.\n\nPresident Mnangagwa said it is unfortunate that some provinces are failing to make these submissions.\n\nThis is unacceptable and tantamount to dereliction of duty. Similarly, the non-attendance to Cabinet Committee meetings by some Ministers of State for Provincial Affairs and Devolution in 2024 was glaring.\n\nAs a result, Cabinet committee submissions missed vital input from Provinces. This anomaly must be adequately addressed. I expect provinces to emerge stronger, dynamic and competitive economic hubs, with marked growth across all sectors, he said.\n\nPresident Mnangagwa said the primary task of Ministers of State for Provincial Affairs and Devolution was to improve the peoples living standards and achieve shared prosperity, as is envisaged in his development philosophy of leaving no one and no place behind.\n\nAs such, the President said the Ministers should be unrelenting in attending to challenges, taking necessary risks to overcome obstacles by implementing solutions that benefit the people.\n\nHesitation, the dragging of feet and fence sitting are not acceptable dispositions under my administration. Additionally, increased momentum to achieve our national development aspirations requires leaders who are bold, focused, hardworking and those prepared to make the requisite personal sacrifices for unprecedented results.\n\nIndividually and collectively decide to be counted as those possessing these traits. This is the spirit that saw us realise our independence, freedom and peace to become masters of our own destiny, he said.\n\nPresident Mnangagwa said Zanu PF, under his leadership, always has people at heart, with Devolution a critical pillar for national unity, social cohesion and safeguarding the indivisibility of Zimbabwe as a sovereign-unitary State.\n\nAs Provincial Ministers, you are directed to demonstrate the leadership capability, integrity and humility that rallies all our communities, across all districts, within provinces, around the common national vision, and the indivisibility of our country, he said.\n\nYou have a duty at the grassroots level to ensure that our society has vitality and hope, living in unity, peace and harmony. It is under such environments that we can realise sustainable development and prosperity for our motherland for both present and future generations.\n\nPresident Mnangagwa said he is now shifting paradigms, transforming Ministries of Provincial Affairs and Devolution from being merely administrative or ceremonial to championing economic development programmes at sub-national level.\n\nThe President said the consistent implementation of a provincial fiscal performance analysis dashboard and monitoring of the socio-economic performance of provinces must be prioritised in the co-ordination of the offices of Ministers of State for Provincial Affairs.\n\nIt is commendable that Provincial Economic Development Plans have since been validated for alignment with our National Development Strategy.\n\nThe implementation of the National Development Strategy 2 must give impetus and greater focus on building modern, sustainable and resilient Provincial economies, he said.\n\nPresident Mnangagwa said all the 10 provinces are blessed with God-given natural resources and the communities must remain good custodians of such endowments and be active players in their transformation into bankable, life changing investment opportunities and projects.\n\nIn the face of natural disasters including the El-Nino induced drought last year, President Mnangagwa urged the Ministers of State for Provincial Affairs to continue ensuring the timely delivery of assistance across districts and wards within provinces.\n\nThe President also took a swipe at some private voluntary organisations that tend to advance clandestine agendas.\n\nI call upon provincial structures to shun and expose any machinations and underhand activities that seek to reverse the progress we have achieved as the Second Republic, he said.\n\nPresident Mnangagwa said the supremacy of the ruling party, Zanu PF, over the Government remains an enduring and integral principle to their work.\n\nProvinces should continue to work with traditional leaders and party structures, so that our people participate in decision-making and also take ownership in the implementation of Government projects and programmes.\n\nJoint meetings and seamless co-ordination with the party and development committees at appropriate levels, should be improved. Programmes and projects being undertaken within the provinces must be clearly articulated, including their overall impact on the livelihoods of our people.\n\nI urge ministries, departments and agencies at provincial level, including councils, to remain duty bound and committed to the realisation and protection of our national interests and development aspirations, he said.\n\nThe President said as the nation builds resilience and adaptive capacity for sustained economic transformation, the business-as usual approach and narrow turf wars should be decisively dismantled.\n\nUnity of purpose, dedication, and innovation coupled with efficient co-ordination in the implementation of Government policies, programmes and projects, the President added, are critical building blocks for the realisation of Vision 2030 and must be key priorities.\n\nMinister of State for Masvingo Provincial Affairs and Devolution, Ezra Chadzamira, said the meeting was vital as it pushes them to work harder in achieving vision 2030.\n\nDuring the meeting with the President we talked about vast achievements gained under the Second Republic. We also talked about some challenges faced, he said.\n\nWe are happy that the President emphasised that we should prioritise all the uncompleted projects so that they add value to citizens while Devolution funds will continue to be disbursed on time. We are grateful to the President for the meeting.\n\nMinister of State for Provincial Affairs and Devolution for Mashonaland East Dr Apollonia Munzverengwi said infrastructural development was now the new norm in her province courtesy of the Presidents guidance.\n\nWe are happy that we have been given the opportunity to meet His Excellency, updating him on what is happening in our respective provinces. l am glad to say Mash East is working together with other provinces.\n\nWe have benefitted from construction of a number of projects including dams. We are the custodians of Muchekeranwa Dam where 75 households are directly benefitting through irrigation, she said.\n\nMinister Munzverengi also said her province has Chivhu Dam which is now moving to ease water shortages for Chivhu town.\n\nThe benefits of the water are going towards the people so we are happy for the ongoing developments, she said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/President-Mnangagwa-2.jpg",
            "description": "Blessings Chidakwa, Herald Reporter PRESIDENT Mnangagwa yesterday cracked the whip on under-performing Ministers of State for Provincial Affairs and Devolution who are creating unnecessary glitches in Government operations by failing to submit reports and attend vital Cabinet Committee meetings. Keeping his hand on the pulse of national development, President Mnangagwa had a lively session with […]",
            "time": "09:30",
            "date": "06 Feb 2025"
        },
        {
            "title": "Zim a unitary State: VP Chiwenga",
            "url": "https://www.herald.co.zw/zim-a-unitary-state-vp-chiwenga/",
            "content": "Mukudzei Chingwere, Herald Reporter\n\nVICE President Dr Constantino Chiwenga has reaffirmed Zimbabwes status as a unitary State, emphasising the essential role of equitable development across all provinces.\n\nHe was speaking during the inaugural devolution and development meeting with Ministers of State for Provincial Affairs and Devolution chaired by President Mnangagwa at State House in Harare yesterday.\n\nThrough the meeting, Government sought to set the tone for a new era of governance and development.\n\nVP Chiwenga reminded Ministers that President Mnangagwa is the only leader elected by the entire nation, underscoring the unity and collective responsibility that comes with this unique mandate.\n\nPresident Mnangagwas interface with Provincial Ministers emphasises the Governments commitment to fostering equitable growth and unity across all provinces.\n\nVP Chiwenga noted that President Mnangagwa had laid the groundwork for national development and emphasised the importance of localised initiatives, insisting that these local efforts must align with and contribute to the broader national vision.\n\nBe reminded that the President is the only one elected by the whole nation as a constituency. In other words, he is the only person in the country elected by the entire country as one constituency, said VP Chiwenga.\n\nAny disparity in development in your provinces reflects back to him who is also the appointing authority and therefore accountable to the development of the whole nation.\n\nYour responsibilities extend beyond the political realm, it impacts social and economic dimensions and your actions have a profound impact on the lives of citizens.\n\nVP Chiwenga reiterated the profound responsibilities placed on the Ministers of State, who are tasked with implementing policies that promote equitable economic development and enhance infrastructure development across the country. He called on them to be the eyes and ears of the President within their provinces, gauging public sentiment and measuring Government performance against the aspirations of citizens.\n\nOur focus on provincial affairs and devolution reflects our shared commitment to ensuring equitable growth, empowerment and unity throughout all provinces.\n\nThe President has entrusted you with the immense responsibility of coordinating and implementing policies that advance economic development, enhance infrastructure development and empower communities.\n\nYou are also instrumental in fostering collaboration between national and sub-national structures, and ensuring equitable resource allocation so that every district and ward is equipped with the necessary tools it needs to thrive, said VP Chiwenga.\n\nThrough this collaborative approach, said VP Chiwenga, the Government is building a Zimbabwe where no one and no place is left behind, resonating with President Mnangagwas guiding principle.\n\nHe said President Mnangagwa has charged Provincial Affairs ministers with the responsibility of ensuring that the success of devolution and the prosperity of the country is rooted in their commitment, vision and leadership.\n\nAs Ministers of State for Provincial Affairs and Devolution, you are the custodians of the hopes and aspirations of millions. Let your work be guided by integrity, empathy and unwavering commitment to progress.\n\nVP Chiwenga said Provincial Affairs Ministers stand as the first point of contact for both the Government and the citizens.\n\nIt is fitting, therefore, that today we will hear from them regarding the current state of affairs in their respective provinces, covering economic, social, political, cultural, environmental and governance matters, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/HE-1.jpg",
            "description": "Mukudzei Chingwere, Herald Reporter VICE President Dr Constantino Chiwenga has reaffirmed Zimbabwe’s status as a unitary State, emphasising the essential role of equitable development across all provinces. He was speaking during the inaugural devolution and development meeting with Ministers of State for Provincial Affairs and Devolution chaired by President Mnangagwa at State House in Harare […]",
            "time": "09:30",
            "date": "06 Feb 2025"
        },
        {
            "title": "Zanu PF lashes out at Geza’s statements",
            "url": "https://www.herald.co.zw/zanu-pf-lashes-out-at-gezas-statements/",
            "content": "Columbus Mabika and Fungai Lupande\n\nTHE ruling Zanu PF party yesterday lashed out at Central Committee member Cde Blessing Geza for making treasonous and outrageous statements calculated to cause alarm and despondency in the country.\n\nAt the same time, war veterans reiterated their clarion call for President Mnangagwas term to be extended to 2030, saying it is the wish of the majority of Zimbabweans as unequivocally expressed at the Zanu-PF Annual National Peoples Conference in Bulawayo last year.\n\nAlthough the ruling party is unanimous that President Mnangagwas term of office must be extended for a further two years, Cde Geza has been trying to derail the peoples train.\n\nIn choreographed Press conferences, Cde Geza has attacked President Mnangagwa and sought to silence the countrywide chorus for the Presidents term of office to be extended.\n\nMashonaland West Province, to which Cde Geza belongs, has since recommended his expulsion from the party with immediate effect.\n\nIn a statement yesterday, Zanu PF secretary for Information and Publicity, Cde Christopher Mutsvangwa, said the utterances by Cde Geza were couched to smear credentials of the majority of war veteran entities in good standing with Zanu PF.\n\nThe outlandish, treasonable and egregious rantings of errant Runesu Geza offended the hallowed tenets of party discipline for a member of the Central Committee.\n\nThey also involved reckless attempts to usurp the credentials of war veteran entities in good standing with Zanu PF, the party of the Permanent Zimbabwe Revolution, he said.\n\nAs such, Cde Mutsvangwa added, relevant organs of the party are currently seized with this contravention as it is holistically and expeditiously handled and dispensed with.\n\nThe party, he said, assures its members of the absolute loyalty of the rank and file to President Mnangagwa and that they retain full confidence in the legal implementation of Resolution Number One adopted at the National Peoples Conference under the aegis of the 2013 Constitution of Zimbabwe.\n\nThe development comes as the Zimbabwe National Liberation War Veterans Association (ZNLWVA) has said President Mnangagwa is the democratically elected President by the majority of Zimbabweans for a five-year term and any utterances calling for his resignation, such as those made by Cde Geza, were improper and careless.\n\nSpeaking at the launch of the Presidential War Veterans Fund in Kujogo Village, Centenary, Muzarabani, Mashonaland Central, the Secretary for War Veterans, Ex-Political Prisoners, Detainees and Restrictees, Cde Douglas Mahiya, it is not forbidden for Zanu PF to support President Mnangagwa to continue at the helm for an extended period.\n\nWho can remember war veterans if he is no longer there? What the party has agreed upon cannot be undone. One individual cannot reverse what the people have agreed to do. To go against the resolutions of the party is to turn against your country.\n\nNo small group of war veterans will dictate to the party; it is the party that guides us. The principles of the revolution dictate that the minority is subordinate to the majority, he said.\n\nCde Mahiya urged all war veterans to align with the party and encouraged them to engage constructively with the President, who he described as a listening leader and a servant of the people.\n\nWe have no right to instruct or threaten the Government or the police. We dont dictate to the Government; they should carry out their work. Dont speak on behalf of other war veterans. We support Zanu PF and President Mnangagwa because leadership is ordained by God, he said in reference to Cde Geza.\n\nRecognising the widows of war veterans, Cde Mahiya announced that the League is in the process of establishing a trust fund to benefit and uplift their livelihoods.\n\nDr Paul Tungwarara, the Special Advisor to the President on Investment, presented US$150,000 allocated for Mashonaland Central.\n\nAdditionally, he awarded US$5,000 to a successful village business unit in Muzarabani, US$3,000 to Drumada village business unit, and US$200 to each of the 80 war veterans who attended the launch.\n\nDr Tungwarara indicated that the fund is accessible to all war veterans, who can borrow it at zero percent interest.\n\nHe also announced a new initiative for borehole drilling at the homes of each war veteran, which was discussed during the event.\n\nDr Tungwarara emphasised that war veterans are foundational figures for every businessman in the country.\n\nPeople died for this country so that business people could engage in mining and other enterprises, he said.\n\nCde Kazembe Kazembe, the Minister of Home Affairs and Cultural Heritage, who is also the Zanu PF provincial chairperson, explained that the fund will empower war veterans to embark on entrepreneurial ventures and sustainable businesses that will improve their livelihoods.\n\nThe loans, managed at the provincial level, will foster self-reliance and restore dignity to our war veterans. We are building an ecosystem where they actively participate in economic maintenance, generating income and employment, he said.\n\nCde Kazembe said the fund would be continuously reviewed and increased based on the diligence and honesty demonstrated by the war veterans in repaying the loans, thereby allowing more beneficiaries to gain access.\n\nHe expressed gratitude for the empowerment of war veterans, saying the province has engaged local councils to set aside quotas for war veterans in the allocation of residential stands.\n\nThey have suffered enough, and as a province, we are focused on how to support our war veterans, Cde Kazembe said.\n\nCde Zhemu Soda, the Member of Parliament for Muzarabani and DCC chairperson, said the launch was held in Muzarabani due to the significant role it played in the liberation struggle.\n\nDespite the short notice, thousands of people attended the launch out of love for the party and President Mnangagwa.\n\nCde Soda said Government programmes and projects are benefitting Muzarabani, particularly in areas like farming and relief efforts.\n\nDeputy Minister of Veterans of the Liberation Struggle, Cde Headman Moyo, expressed deep gratitude to President Mnangagwa for offering an interest-free revolving fund.\n\nCde John Kwara, chairperson of the provincial War Veterans League, expressed his unwavering support for Zanu PF and President Mnangagwa.\n\nThe Chairperson of War Collaborators in Muzarabani, Cde Jeffrey Chigombe, said they were grateful for the Second Republics transformative work and facilitating the vetting process.\n\nPresident Mnangagwa is an able leader together with his deputies. He must see through the developments that he started, including the compensation of war collaborators, he said.\n\nWe failed to attain educational qualifications due to the war. We never turned against Zanu PF because of the delays in compensation. We are confident that our time will come because the President will never forget us.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/04/Untitled-dbeege.jpg",
            "description": "Columbus Mabika and Fungai Lupande THE ruling Zanu PF party yesterday lashed out at Central Committee member Cde Blessing Geza for making treasonous and outrageous statements calculated to cause alarm and despondency in the country. At the same time, war veterans reiterated their clarion call for President Mnangagwa’s term to be extended to 2030, saying […]",
            "time": "09:30",
            "date": "06 Feb 2025"
        },
        {
            "title": "Sadc pushes for DRC to regain control",
            "url": "https://www.herald.co.zw/sadc-pushes-for-drc-to-regain-control/",
            "content": "Wallace Ruzvidzo, Herald Reporter\n\nSADC is working towards ensuring that the Democratic Republic of Congo (DRC)s central Government regains full control of the country, hence the convening of a joint Extraordinary Summit between the regional bloc and the East African Community (EAC) in Tanzania on Saturday, President Mnangagwa has said.\n\nThe President, who is the chair of SADC and his EAC counterpart, Kenyan President William Ruto, will co-chair the joint summit that will tackle the deteriorating security situation in the DRC, which is a member of both regional bodies.\n\nWhen asked by the media at State House in Harare yesterday if history continued to repeat itself in the DRC, President Mnangagwa said not really but both SADC and EAC would continue with efforts that would see one voice in one country.\n\nNot really, the DRC has always been faced with challenges of this nature. Besides, it is a vast country and one would want to see a central Government that is in full control of that vast country, that is the first step, I think.\n\nCurrently, you have various authorities speaking differently in the same countryI do not think that is the best to have in a sovereign country.\n\nSo as we meet as both SADC and the East African Community, we will probe that (question) and see whether it is possible to make sure there is one voice in one country, he said.\n\nThe SADC Chairman said it would be more productive if all parties involved in the crisis attend the Extraordinary Summit.\n\nPresident Mnangagwa will lead a Double Troika, plus the Troop Contributing countries to the joint summit, that he will co-chair with President Ruto.\n\nThe SADC Double Troika comprises the SADC chairman, outgoing chairman and incoming and the Chairperson of the Organ on Politics, Defence and Security Co-operation.\n\nI believe that it will be most fruitful if all the parties to the issue (security situation in DRC) are present.\n\nIt does not help to discuss matters with some of the participants being absent. So it is my belief that my dear brother will invite them, said President Mnangagwa.\n\nAccording to earlier reports, President Ruto said both DRCs President Felix Tshisekedi and Rwandan President Paul Kagame have agreed to attend the Summit.\n\nDRC accuses Rwanda of backing rebels in the mineral resource country, charges which the latter has denied.\n\nPresident Ruto, in a statement earlier this week, also confirmed that he had engaged South African President Cyril Ramaphosa, Ugandan President Yoweri Museveni and other leaders to be part of the process.\n\nClashes between government forces and rebel groups have left an estimated 900 civilians dead, displacing tens of thousands more.\n\nThe recent fighting in eastern DRC, which has been dogged by conflict for more than 30 years since the 1994 Rwandan genocide, has also claimed 16 soldiers from the South African National Defence Force (SANDF) and Malawi, who form part of the SADC Mission in the DRC (SAMIDRC).\n\nAs rebel forces gained the upper hand on the battlefield, capturing much of Goma, the largest city in eastern Congo, South Africa responded with a stern diplomatic warning. The South African government stated that any further attacks on its troops would be regarded as a declaration of war.\n\nIn a swift rebuttal, Rwandas President Kagame accused South Africa of acting as part of a belligerent force. He claimed that South African troops were engaged in offensive combat operations to support the Congolese government in its fight against its own citizens.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/04/President-William-Ruto.jpg",
            "description": "Wallace Ruzvidzo, Herald Reporter SADC is working towards ensuring that the Democratic Republic of Congo (DRC)’s central Government regains full control of the country, hence the convening of a joint Extraordinary Summit between the regional bloc and the East African Community (EAC) in Tanzania on Saturday, President Mnangagwa has said. The President, who is the […]",
            "time": "09:30",
            "date": "06 Feb 2025"
        },
        {
            "title": "‘No feud between President, VP’",
            "url": "https://www.herald.co.zw/no-feud-between-president-vp/",
            "content": "Conrad Mupesa, Mashonaland West Bureau\n\nCONTRARY to unfounded claims by private newspapers and online tabloids and recent rants by renegade war veteran Cde Blessed Geza, the ruling partys Presidium remains united, a Zanu PF Politburo member has said.\n\nSpeaking at the partys Mashonaland West Provincial Coordinating Committee (PCC) meeting in Chinhoyi yesterday, Cde Ziyambi Ziyambi said President Mnangagwa and his deputy, Vice President Constantino Chiwenga were united and working in unison.\n\nThe province has since passed a resolution for the National Disciplinary Committee to expel him.\n\nThe PCC also saw the members throw their weight behind President Mnangagwas term extension beyond 2028 by two years, saying the partys resolution during the 2024 Conference stands.\n\nWe now have a clique of people who are fanning divisions within our party, claiming to be representing and speaking on behalf of our leaders President Mnangagwa and his deputies.\n\nThere is no division between President Mnangagwa and Vice President Chiwenga and claims that there are factional fights within the party are false. I am a Politburo member who has never seen Vice President Chiwenga disobey and denigrate his superior. This should be a shining example for all of us, he said.\n\nWhen Vice President Chiwenga joined Cabinet, he taught me a lot about politics, and the main thing he taught me was to be loyal and respectful. I have never heard President Mnangagwa say he despises his deputy or Vice President Chiwenga. Who are you (Geza) to claim that there is bad blood between the two.\n\nCde Ziyambi also noted that the unfounded claims peddled by Cde Geza and a cabal of rogue war veterans were meant to cause divisions within the party.\n\nLets always learn to respect our leaders, even from the Cell level.\n\nIf one has a misunderstanding or an issue, it has to be addressed amicably lest we bring the name of the party into disrepute.\n\nWe went to Congress and unanimously agreed to make President Mnangagwa our leader for five years. Anyone with objections must wait until 2027, he added.\n\nCde Ziyambi, who is also the Justice, Legal and Parliamentary Affairs Minister, said he once cautioned Cde Geza, but his advice fell on deaf ears.\n\nZanu PF National deputy Political Commissar, Cde Webster Shamu, said although the party was saddened by sacking rogue elements, there was enough evidence needed by the National Disciplinary Committee (NDC) to expel the renegade war veterans.\n\nCde Shamu formed the Zimbabwe National Liberation War Veterans Association together with Cdes Mike Munyati and the late National Hero Brigadier Siziba.\n\nThe party doesnt enjoy seeing its members being sacked, but if one goes astray, there is no alternative. Cadres are guided by the partys constitution which also provides the route for legal action, he said.\n\nProvincial chairman, Cde Mary Mliswa-Chikoka, said Cde Gezas utterances had the consequences of bringing the name of the party and leadership into disrepute.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/10/Untitled-13-1.jpg",
            "description": "Conrad Mupesa, Mashonaland West Bureau CONTRARY to unfounded claims by private newspapers and online tabloids and recent rants by renegade war veteran Cde Blessed Geza, the ruling party’s Presidium remains united, a Zanu PF Politburo member has said. Speaking at the party’s Mashonaland West Provincial Coordinating Committee (PCC) meeting in Chinhoyi yesterday, Cde Ziyambi Ziyambi […]",
            "time": "09:30",
            "date": "06 Feb 2025"
        },
        {
            "title": "First Lady takes medical outreach to Gokwe",
            "url": "https://www.herald.co.zw/first-lady-takes-medical-outreach-to-gokwe/",
            "content": "Tendai Rupapa, Senior Reporter\n\nHEALTH ambassador First Lady Dr Auxillia Mnangagwa warmed many hearts yesterday when she took her two-day medical outreach and wellness programme to Gokwe.\n\nThe programme unlocked access to vital health checks for free, for communities including people living in hard-to-reach areas, and the First Lady gave clinics equipment and medical sundries.\n\nUsing her Angel of Hope Foundation ( AoHF)s mobile hospital and mobile clinic, which were manned by personnel from the Ministry of Health and Child Care, Dr Mnangagwa ensured women were screened for cervical and breast cancer while men were screened for prostate cancer.\n\nOther services offered included HIV and Aids testing, and checks for diabetes, hypertension and other non-communicable diseases so that beneficiaries are well informed about their health.\n\nThe First Lady, through her AoHF, donated tonnes of rice and mealie meal to communities, while clinics received walking aids, wheelchairs, sanitary pads, gloves, and surgical masks.\n\nThe elderly received food and toiletry hampers while pregnant women were given baby preparation kits.\n\nAmai Mnangagwa also donated stationery and sanitary pads to schoolchildren.\n\nI am giving learners these things because I want children to stay in school. At my age, I graduated with a PhD recently and it is my wish to prove to women and children that education is infinite and knows no age, she said to wild applause.\n\nHealth Ambassador First Lady Dr Auxillia Mnangagwa hands over wheelchairs, crutches, sanitary pads and other medical equipment to medical staff for use in hospitals in Gokwe yesterday\n\nWhen she arrived at Mapfungautsi Polyclinic, the mother of the nation started by interacting with women and men who were awaiting their turn to be screened for cervical, breast, and prostate cancer, giving them words of encouragement.\n\nIts not painful my daughters and you grandmothers. I am glad you have come to know where you stand. I go for regular cancer screening, there is nothing fierce or painful. Its good to know where you stand when it comes to your health. It is good to know early before the disease is advanced because if detected early, it can be cured, she said.\n\nShe further commended men who came for prostate cancer screening imploring other men to follow suit.\n\nSo touching was the First Ladys programme that it drove many to tears while some beneficiaries admitted they had never undertaken health checks like cancer screening.\n\nThe First Ladys medical outreach was timely as it came at a time when the Cancer Association of Zimbabwe warned that in Zimbabwe, cancer was a major cause of morbidity and mortality with over 5 000 new diagnoses and over 1 500 deaths per year.\n\nThe number of people developing cancer, the association warned, is expected to increase due to HIV and AIDS and other infections and unhealthy lifestyle choices.\n\nDr Mnangagwa also held an interactive session with the community, promoting the consumption of traditional food that has high nutritional value and medicinal properties.\n\nShe also warned against domestic violence, drug and substance abuse as well as general lawlessness among youths.\n\nFirst Lady Dr Auxillia Mnangagwa hands over books to schoolchildren in Gokwe yesterday.  Pictures: John Manzongo\n\nDr Mnangagwa urged the community to take advantage of the medical outreach to get screened and seek treatment early.\n\nIt is my pleasure to be back here in Gokwe this new year as we thank the Almighty God for pulling us through. I come here in the Midlands Province with an assortment of programmes, but today, I have come primarily focusing on cancer, HIV and Aids, diabetes, hypertension and other non-communicable diseases so that we know where we stand health-wise. I came here with the Nhanga/Gota/Ixhiba programme teaching children good manners. I kindly ask the elderly, our chiefs, and their spouses to carry forward the programme by sitting children down and inculcating in them good morals, she said.\n\nDr Mnangagwa said it was essential for people to know their health status.\n\nToday I encourage everyone present to be screened free of charge and leave this place knowing their health status. We say no to those who ascribe illnesses to unsubstantiated claims of witchcraft; go and be screened so that you get treatment.\n\nCancer is a serious disease, but only you can win the war over it. If you bottle up and do not seek treatment when it is in its initial stages, you cut short your life. Cancer has stages, therefore my appeal to you is to be screened early so that you get treatment before it spreads. I was gratified to see men coming for health checks.\n\nMen seldom come forward for health checks. Mostly men shun having their health checked. For some men, if their wife is said to be healthy, they then conclude that they are also healthy, but this is not the case.\n\nMen must feel free to present for health checks, she said.\n\nFirst Lady Dr Auxillia Mnangagwa hands over sanitary pads to school girls in Gokwe yesterday\n\nThe health ambassador said children were not spared as they needed to be checked too.\n\nEven the younger children get checked as well because HPV Human papillomavirus affects young people. I also warn young girls against rushing into sexual relations before the time is ripe because you place yourselves at risk of contracting many diseases. Virginity is a once-off state. As parents let us cast our eyes on our children, assessing their movements. These children are ruined by drugs and need parental guidance.\n\nCancer is a global challenge and not for Zimbabwe alone. It knows no age, therefore let us guard our health jealously. Statistics show that cervical cancer is not the top of all cancers. I have also brought along experts from the National Aids Council. They have come to warn us against defaulting on taking (ARV) pills even when you reach the stage of not transmitting the infection to others.\n\nSome diseases which mostly affect people are linked to HIV. Some women are exposing themselves to the risk of contracting cervical cancer by inserting herbs in their private parts. Do not do that because you kill yourself. Do not be a backyard nurse without qualifications. I heard from another province that women were inserting herbs in their private parts so that men would not leave them. But if you die, he will continue with life with other women, she said.\n\nThe mother of the nation encouraged communities to take traditional food which has high nutritional value and medicinal properties.\n\nThese medications we receive from hospitals work well with traditional food, which is nutritious. Which vegetables do we get during the rainy season? she asked.\n\nA learner responded by saying munyevhe and when asked where it was found, the child said in the forest.\n\nAngel of Hope Foundation patron First Lady Dr Auxillia Mnangagwa hands over new born baby preparation kits to expecting mothers in Gokwe yesterday\n\nHowever, Amai corrected the child saying nyevhe was found in the fields.\n\nShe encouraged women to dry these vegetables for future consumption.\n\nThe First Lady also urged women to cultivate traditional grains and plant fruit trees at their homesteads as well as rearing chickens and ducks.\n\nDr Mnangagwa also spoke against domestic violence adding that fighting in the home triggered ailments like hypertension.\n\nLet us live in harmony in the homes so that we raise our children in peace.\n\nIf you keep fighting, you lose focus on children and it ends up as a dog-eat-dog affair in the home, she said.\n\nMrs Thobekile Nkala (52) praised the First Lady her for the programme.\n\nI am happy today because the First Lady has brought a hospital to our doorstep.\n\nMost of us women are living in our homes without knowing our breast and cervical cancer status.\n\nI encourage all women out there to come out and be screened.\n\nDr Mnangagwa is doing a wonderful programme for us, free of charge, so let us be screened. This is great work in the country, she said.\n\nMrs Felenzia Mundenda (58) echoed similar sentiments.\n\nI thank the First Lady for rolling out this programme so that we can be screened for breast and cervical cancer.\n\nGetting screened helps us know our status and look after our grandchildren. It gives us strength to work knowing where we stand, she said.\n\nWomen queue for cervical and breast cancer screening from Angel of Hope Foundation mobile hospital and mobile clinic during a medical outreach brought by Health Ambassador First Lady Dr Auxillia Mnangagwa in Gokwe yesterday\n\nMen were upbeat too.\n\nMr Misheck Pumwe was grateful for being afforded the chance to be screened, saying doing so would help save lives.\n\nI have learnt something that I did not know in the past.\n\nI always thought that if my wife is said to be safe, it applies to me as well.\n\nI also need to be tested so that I can start getting treatment to live longer. May God bless our First Lady for her great love, he said.\n\nMr Robert Dhliwayo weighed in saying: This is something I will encourage my peers at work to do.\n\nWe need to be tested regularly because you may be sick, but ignorant of the fact. What the First Lady has said needs to be put into practice so that I can live long enough to see my grandchildren growing up.\n\nDeputy Minister of Health and Child Care, Sleiman Kwidini, thanked the First Lady for her intervention.\n\nWe cannot, as a country, just thank you by word of mouth because you have taken us from where we were and put us on the pedestal of success in terms of health.\n\nThere are some hard-to-reach areas but through your vision Amai and the President, of leaving no place and no one behind, we thank you.\n\nCancer is a serious disease that is troubling us as the Ministry of Health because these deaths are on the increase.\n\nMen were not spared as they are also dying. As health ambassador, our mother is doing good for the country, he said.\n\nIn a speech read on his behalf by Mr Charltone Murove, Director Local Government Services, Minister of State for Midlands Provincial Affairs and Devolution, Owen Ncube, saluted the First Lady for her unconditional love.\n\nAllow me to cordially welcome you and all the distinguished guests to the Midlands Province as we gather for the landmark occasion of the cancer screening and wellness programme here at Mapfungautsi Clinic in Gokwe Central.\n\nTodays programme complements the national health strategy, the NDS1 pillar on health and well-being and the United Nations Sustainable Development Goal Number 3 on Good Health and Well-being passionately pursued by the Second Republic under the able and visionary leadership of President, Dr ED Mnangagwa.\n\nAmai your programmes and projects are transformational.\n\nToday you have bridged the gap between the patients and health personnel.\n\nWe appreciate your commitment and hard work, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/FL1.jpg",
            "description": "Tendai Rupapa, Senior Reporter HEALTH ambassador First Lady Dr Auxillia Mnangagwa warmed many hearts yesterday when she took her two-day medical outreach and wellness programme to Gokwe. The programme unlocked access to vital health checks for free, for communities including people living in hard-to-reach areas, and the First Lady gave clinics equipment and medical sundries. […]",
            "time": "09:30",
            "date": "06 Feb 2025"
        },
        {
            "title": "EDITORIAL COMMENT: Council must cut down on unplanned expenses",
            "url": "https://www.herald.co.zw/editorial-comment-council-must-cut-down-on-unplanned-expenses/",
            "content": "The purchase of a 12-roomed house for US$1 million in the neighbouring local government area of Ruwa by the Harare City Medical Aid Society was even condemned by Mayor Jacob Mafume although so far no action has been taken to reverse the deal or sell off the property.\n\nIt also came to light that the medical aid society covering the 9 000 staff of the Harare City Council has been buying other properties and usually without insisting on title deeds.\n\nThe excuse given was that the medical aid society wanted the Ruwa mansion for a clinic. Perhaps the city council does have a lot of staff who prefer to live outside city limits in a better run council area, but it still does not make much sense to have a clinic for Harare City staff in Ruwa.\n\nAnd even if the medical aid society wanted a major clinic for municipal staff and their families, buying a luxury house in a low-density suburb does not seem like a sensible business decision or a sensible location, since few city employees live in such suburbs.\n\nA really first class clinic could be built from scratch for a lot less money, and have the advantage of being properly designed and sized for the work without the need to adapt a large house with all the alterations required.\n\nPerhaps it would be useful for the Harare City medical aid society to have a dedicated clinic with on-call doctors for staff and their dependants.\n\nSeveral medical aid societies with large membership have found that converting from fee for service coverage to employing their own medical staff on salary can cut costs, with most medical treatment not needing specialist services that can still be outsourced.\n\nBut we are certain that there has been no debate among council workers over such an arrangement, with the different levels of subscriptions being outlined, and certainly such a dedicated clinic would not be outside Harare city in a different local government area, but rather reasonably central and easy to access for all council staff and their dependants.\n\nMany will suspect that the deal was done corruptly for someones personal advantage and the excuse of a clinic was simply used to paper over what should have been a major investigation. Municipal staff of Harare City Council obviously need to bring their medical aid society to book and demand explanations.\n\nCertainly their money has been wrongly and badly spent and an investigation might reveal criminal intent, although there is certainly reckless negligence at the very best.\n\nThe commission of inquiry into Harare City Council chaired by retired judge Justice Maphios Cheda is still gathering vast quantities of the most damaging evidence of corruption, maladministration, favouritism, serious padding of benefits for the top layer of staff and exceptionally poor treatment of most of the workforce who have to do the work and face the public.\n\nWhile staff are rarely paid on time, and sometimes the delays can be long, the top tier of town clerk and directors have still been getting their luxury SUVs and holidays in SADC and the Victoria Falls for themselves and their children, with the town clerk, or acting town clerk, or as at the moment both, allowed paid-for holidays outside Southern Africa.\n\nThe council assets, and we have this from those in the city treasurers department who have to make payments, seem to be at the beck and call of councillors and top officials, regardless of the need to find the equivalent of around US$2 million a month to pay all staff and the larger sums needed to maintain services and make sure the council staff have the right equipment to do their job.\n\nHarare City is the second largest entity in Zimbabwe after the central Government. While the Second Republic has been upgrading services, and for that matter even paying staff properly on time on the agreed pay days for each group of workers, the city council has been failing badly.\n\nYet the rates and other charges should be more than enough to pay staff, buy water treatment chemicals, keep garbage trucks in repair and replace them when they finally wear out, keep fire engines and what used to be such a good ambulance service that no private service could compete.\n\nAnd there would still be enough over in a properly run council to maintain sewage systems and treatment plants and pay for the regular extension of water works and sewage treatment works.\n\nAll this should be routine, rather than seeing a council and its top officials seeing the money that residents pay in being used as a very large cookie jar by councillors and top officials rubbing each others backs and passing resolutions and creating contracts that siphon money from other workers and the proper services to themselves.\n\nPerhaps these resolutions and the contracts and even the mess in the medical aid society are legal, in the sense that those in authority have authorised them.\n\nIt is possible to do this sort of thing legally even if so much has to be kept secret to avoid ratepayers and staff exploding in anger.\n\nOne major advantage we are now seeing from the investigating commission is that so much that councillors and officials wanted to keep secret is coming out into the open, and we are able to see what has been going on, although we bet there are still secrets that have been kept.\n\nIt seems that there are people who work for the city who have a conscience and who have been willing to tell all.\n\nIn any organisation there will be those who do good quality work for a fair days pay, and these are the people who we will need to be pushed up the ladder in Harare, since they have the expertise to fix the problems given some sort of decision making process that allows them to do the work and channels the resources away from perks and other dodgy deals to where they are supposed to go.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Harare-City-Medical-Aid-Society.jpg",
            "description": "The purchase of a 12-roomed house for US$1 million in the neighbouring local government area of Ruwa by the Harare City Medical Aid Society was even condemned by Mayor Jacob Mafume although so far no action has been taken to reverse the deal or sell off the property. It also came to light that the […]",
            "time": "09:30",
            "date": "06 Feb 2025"
        },
        {
            "title": "National Prosecuting Authority calls ZACC to order",
            "url": "https://www.herald.co.zw/national-prosecuting-authority-calls-zacc-to-order/",
            "content": "Zvamaida Murwira, Senior Reporter\n\nTHE National Prosecuting Authority yesterday called the Zimbabwe Anti Corruption Commission (ZACC) to order, saying the anti-graft body should respect the constitutional independence of Government arms.\n\nThe NPA said ZACC should utilise dispute resolution platforms should there be differences on an issue.\n\nThe rebuke, directed at ZACC, followed a statement issued by the Commission expressing concern on why the NPA withdrew fraud charges against Harare City Council Town Clerk Hosiah Chisango and four others over a US$9 million street lights tender.\n\nZACC chairperson, Mr Michael Reza, issued a statement saying his organisation felt that the five were criminally liable and should have defended their actions in court.\n\nThis was after NPA withdrew charges against Chisango (Town Clerk), Never Murerwa Supply Chain Manager), Denford Zhungu (Principal Accountant), Tawanda Mutenhabundo (Engineering Technician), and Artkins Mandaza (Principal Contracts Administrator) over a US$9 million street lights tender.\n\nOnly Harare City Council Principal Buyer, Jabulani Mukomazi, was indicted and is expected to face the charges.\n\nZACC respects the position taken by the NPA and acknowledges that it is the mandate of the prosecuting authority to institute and manage criminal prosecutions in Zimbabwe. The Commission however, maintains that the accused persons are criminally liable for the fraudulent awarding of the tender and should defend their actions in court. Accordingly, ZACC is looking into the matter and will be preferring new charges against the five accused persons, reads a statement from ZACC.\n\nBut in an interview yesterday, Prosecutor General, Justice Loice Matanda-Moyo, described the statement as pre-emptive and premature given that they had a scheduled meeting to discuss the case on Tuesday.\n\nShe said ZACC had failed to utilise an inter-agency platform comprising ZACC, the Zimbabwe Republic Police and NPA that meets to resolve any differences.\n\nIn this particular matter, I have not personally had the opportunity of going through the docket. I had requested a meeting yesterday with the ZACC chairperson and his team, myself and my team so that they bring the docket, we try to iron out the differences between the Prosecutor and the Investigating officers. Before that could be done, I was shocked to find a statement circulating in the media. I do not believe in solving issues through the media and we are still waiting for the meeting with ZACC to resolve our issues, said Justice Matanda-Moyo.\n\nShe said they had a platform, an interagency committee where ZACC is a member and they had agreed on how to resolve their differences.\n\nWe resolve our differences amicably alive to the fact that we are a team and if we break this teamwork, it means the beneficiaries will be the corrupt and the criminals. So I take the issue of collaboration and amicable resolution of disputes seriously because at the end of the day I want to see matters going to trial and that can only happen with the assistance of our stakeholders, ZACC and the police, said Justice Matanda-Moyo.\n\nSo far our relationship has been good and I want to believe it is still good. As the NPA we have not been offended by the statement, but we believe its simply a question of being open, our prosecutor justifying the decision to the investigating officers and the investigating officer must respect the decision taken by the prosecutors, if there is no corruption involved. We have a zero tolerance to corruption, our decisions are based on professional reasons.\n\nJustice Matanda-Moyo said ZACC and the NPA had a common goal of eradicating corruption in the country.\n\nShe said the two arms must remain dedicated and available for any consultation with all stakeholders that include the police and the Zimbabwe Revenue Authority, Financial Intelligence Unit, among others. These different agencies operate independently but for us as NPA, ours is collaborative independence and not isolated independence. These agencies still remain with their discretion on how to proceed with regard to certain matters.\n\nWhile the PG has got the powers in terms of the Constitution to order an investigation, the PG cannot prescribe how such investigations can be conducted, that is the prerogative of ZACC. Equally the NPA has the prerogative and discretion of determining which matters to prosecute in the interest of justice and in so doing we are only guided by evidence on the docket, said Justice Matanda-Moyo.\n\nShe said she directed prosecutors to be responsible for drafting charges on a docket and not take a case to court based on charges drafted by someone else.\n\nWe used to have problems where prosecutors were taking matters into court with charges drafted by investigative authorities and then such charges turned out to be improper charges and they wanted to point a finger at investigative agencies but I said no, the function of drafting charges is the function of the prosecutor. It is the prosecutor who must be satisfied that they have got a case with adequate evidence which they can take into court and secure a conviction. They can never take a matter into court based on any other persons opinion, said Justice Matanda-Moyo.\n\nI have emphasised on the need to be professional and we take pride in that we are an NPA which is transparent. So I am still waiting for that meeting with ZACC, perhaps it will take place tomorrow, so that press release is pre-emptive and premature if you ask me.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/06/Michael-Reza.jpg",
            "description": "Zvamaida Murwira, Senior Reporter THE National Prosecuting Authority yesterday called the Zimbabwe Anti Corruption Commission (ZACC) to order, saying the anti-graft body should respect the constitutional independence of Government arms. The NPA said ZACC should utilise dispute resolution platforms should there be differences on an issue. The rebuke, directed at ZACC, followed a statement issued […]",
            "time": "09:30",
            "date": "06 Feb 2025"
        },
        {
            "title": "US foreign interference machine exposed",
            "url": "https://www.herald.co.zw/us-foreign-interference-machine-exposed/",
            "content": "Tichaona Zindoga, Herald Correspondent\n\nFrom China to Zimbabwe; Latin America to Eastern Europe, the United States has for over half a century been interfering in the internal affairs of other countries using dirty money siphoned from American taxpayers to serve narrow interests, destabilise countries and whole regions.\n\nNow, the Trump administration is likely to stop it all.\n\nElon Musk, appointed by president Donald Trump to oversee a new agency called Department of Government Efficiency (DOGE), has been working to dismantle some of the US entrenched bureaucracies that have not only become anachronistic in 2025, but also responsible for misuse of US money in operations that, all considered, severely compromised Americas relations with other countries.\n\nRecently, Musk has described the US Agency for International Development (USAID) as a criminal organisation and the National Endowment for Democracy (NED) as a scam.\n\nBoth are now on the brink of being shut down; the latest news in the media being that USAID has stopped workers from reporting for duty, while overseas-based operatives have been recalled to the US.\n\nThis has become a hot topic, part of the ongoing funding cut by the administration of Trump whose key philosophy is derived from his America First strategy.\n\nAt a superfluous level, cutting aid means stopping America from assisting countries in the developing world and preventing them from getting aid and assistance to fight hunger and disease or supporting democracy, promoting human rights and liberal values.\n\nHowever, there has always been a deeper, sinister agenda that the so-called American aid has served, namely a sophisticated machinery to loot funds by elites controlling organisations like USAID and NED and obsessively pursuing ideologies at the expense of building meaningful relations and markets for America  which countries that have been targeted such as China and Zimbabwe have long decried.\n\nThe nefarious activities of US organisations have extensively been written about it. In March last year, Zimbabwe deported four USAID operatives, Brenda Lee Pearson, Norma Kriger, Sarah Logan and Loretta Bass who came under the cover of a US government affiliate, Navanti Group, and their mission was ostensibly to carry out a democracy and governance assessment to help the organisation design its local programmes. Local media reported that the team was busted and deported on February 17 after their real agenda or effecting regime change was established.\n\nThe bust sent a huge statement about Zimbabwes concern over activities of USAID, and Zimbabwe has been keeping a wary eye on similar outfits.\n\nLast August, the Ministry of Foreign Affairs in China published a paper stating that NED had long engaged in subverting state power in other countries, meddling in other countries internal affairs, inciting division and confrontation, misleading public opinion, and conducting ideological infiltration, all under the pretext of promoting democracy.\n\nIts innumerable evil deeds have caused grave harm and drawn strong condemnation from the international community, the paper said.\n\nIt added: In recent years, NED has kept changing tactics and gone even further in acting against the historical trend of peace, development and win-win cooperation. It has become more notorious for its infiltration, subversion and sabotage attempts against other countries. It is imperative to unmask NED and alert all countries to the need to see through its true colours, guard against and fight back its disruption and sabotage attempts, safeguard their national sovereignty, security and development interests, and uphold world peace and development and international fairness and justice.\n\nThings have just come to a head.\n\nOn Monday, Elon Musk held a live session on X Spaces, saying he had spoken in detail about USAID with President Trump. He agreed we should shut it down, Musk said.\n\nHe said: It became apparent that its not an apple with a worm it in. What we have is just a ball of worms. Youve got to basically get rid of the whole thing. Its beyond repair . . . Were shutting it down.\n\nThere was drama before that, when USAID officials tried to deny Musks DOGE team access to sensitive data, including funding activities. The fallout saw the administration place two USAID security chiefs, namely director for security John Vorhees and deputy director for security Brian McGill on leave.\n\nEarlier, on Sunday, Musk had written on X that, USAID is a criminal organisation. Time for it to die.\n\nAnd on the same day he wrote: NED is a SCAM, prompting a spirited debate about the organisation whose work has been described as doing overtly what the Central Intelligence Agency (CIA) does covertly.\n\nA few hours earlier, in another post, Musk had stated that NED is RIFE with CORRUPTION, inviting users to reply with a list of evil actions linked to the organisation.\n\nEnd of an era?\n\nUSAID was originally established to support economic and social development in the developing world. A brainchild of President John F. Kennedy, the goal was to unite development into a single agency responsible for administering aid to foreign countries to promote social and economic development.\n\nHowever, over the years, it has become a key tool for advancing US geopolitical objectives. In many African countries, including Zimbabwe, USAID funding has been funnelled into civil society organisations (CSOs) that have positioned themselves as pro-democracy groups, but in practice, have worked to undermine elected governments.\n\nIt is a widely shared view that for decades, US foreign aid, particularly through the USAID, has served a dual purpose, an overt one; and a sinister agenda. (Interestingly it emerged this week that USAID used HIV workshops in Cuba as cover to recruit anti-government activists).\n\nWhile often presented as humanitarian assistance, much of this aid has been channelled through international NGOs and CSOs that engage in political activism under the guise of promoting democracy and human rights.\n\nThe Trump administrations push to reform USAID, could mark a turning point in reducing Washingtons interference in African affairs, including countries like Zimbabwe.\n\nZimbabwe has long accused USAID-backed NGOs of supporting opposition movements under the pretext of promoting human rights.\n\nOrganisations receiving US funding have been involved in activities that go beyond civil society work, including election monitoring with a clear bias, organising anti-government protests, and funding media narratives that align with US foreign policy interests rather than the priorities of the Zimbabwean people.\n\nOn the other hand, the NED was originally conceived in 1981, when US President Ronald Reagan came into office and intended to promote his Project Democracy abroad, and proposed a government-funded and privately-run foundation to openly support democratic movements abroad.\n\nOne of the purposes of NED, when it was created in 1983, was to encourage the establishment and growth of democratic development in a manner consistent both with the broad concerns of US national interests and with the specific requirements of the democratic groups in other countries which are aided by programmes funded by NED.\n\nNED has grown in both funding  with the Congress providing US$18 million annual budget to US$315 million in 2023; as well as in various nefarious activities around the world. These include:\n\nVictims of this interference include, but not limited to, Iran, North African Arab countries, Ukraine, Haiti, North Korea, Mexico, Serbia, Philippines, Nigeria, Iraq, Kosovo and Zimbabwe  of course. Curiously, all these categories of activities have been implemented in Zimbabwe over the past two decades, and they constitute ceaseless regime change attempts by the West.\n\nNED programmes are run under the guidance of the US State Department and embassies abroad.\n\nNED should consult with the State Department on its programme plans to seek foreign policy guidance.\n\nAccording to a USAID report titled Democracy Promotion Programmes Funded by the US Government, NED consults on an ongoing basis with the State Department, through the Bureau of Democracy, Human Rights and Labour, with USAID and with US embassies abroad on programmatic matters?\n\nNED reports to the US government on its work and accepts audit and oversight by the government.\n\nNED is obliged to submit to the US president an annual report for the preceding fiscal year no later than December 31 of each year. The report should include NEDs operations, activities and accomplishments. Audit of NED is conducted annually by the US Government General Accounting Office.\n\nA report of each audit shall be made to the Congress, and a copy of each report shall be furnished to the President.\n\nUnder president Trump, NED, like other outfits as USAID represents wasteful expenditure, which will likely see these cut down or shut completely.\n\nA criminal and a scam\n\nMusks description of USAID and NED in criminal terms is well grounded. The two organisations funding for local activities has been abused by various NGOs, civil society groups and the opposition party outfits that the US supported to effect regime change.\n\nIn fact, a whole regime change industry of NGOs developed in the country based on US funding through USAID, NED, the Open Society Foundations and so on, but while they received funding for democratisation purposes, this money has ended up in private pockets of NGO bosses. The civil society scam is also manifest in the organisations spending the majority of programme funds on administration costs (that is, taking care of officials) while only a fraction goes to the Zimbabwean people for whom these funds were intended.\n\nIt has also to be made clear that, the US and other donor countries channel such resources through NGOs to supplant and subvert Government by providing alternative sources for health, education and livelihoods at a time that Zimbabwe was placed under sanctions that curtail its ability to provide for the people.\n\nBut NGO and opposition party bosses have scammed American and European donor countries and agencies in a big way. One American official stated a few years ago that given the amount of money that poured into Zimbabwe, the goal of regime change could have been achieved already.\n\nThe difference between the funding and the outcomes is essentially what the whole scam is all about  and Musk is right. It is not surprising that local American-linked NGOs, US Embassy (State Department) officials and their criminal networks were afraid of a Trump administration, preferring the Democrats who have not only stuffed the outfits like NED and USAID but also engineered various schemes and ideologies to steal money from American people in the name of promoting democracy in places like Zimbabwe.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/02/Untitled-5-3.jpg",
            "description": "Tichaona Zindoga, Herald Correspondent From China to Zimbabwe; Latin America to Eastern Europe, the United States has for over half a century been interfering in the internal affairs of other countries using dirty money siphoned from American taxpayers to serve narrow interests, destabilise countries and whole regions. Now, the Trump administration is likely to stop […]",
            "time": "09:30",
            "date": "06 Feb 2025"
        },
        {
            "title": "Expo 2025 to jumpstart Zim",
            "url": "https://www.herald.co.zw/expo-2025-to-jumpstart-zim/",
            "content": "Golden Sibanda\n\nZimbabwe may never be the same post its participation at Expo 2025 Osaka, Japan, where it will join more than 150 other countries for the six-month long global exhibition expected to attract over 28 million visitors from across the world, permanent secretary for Tourism and Hospitality Industry Dr Takaruza Munyanyiwa has said.\n\nThe southern African nation will market the numerous tourism, trade and investment opportunities in the country over the duration of the expo, which starts on April 13, 2025, and runs until October 13, 2025.\n\nThis aligns with the Governments economic diplomacy, engagement and re-engagement as well as private sector and export-led growth policy thrust.\n\nZimbabwe is targeting to attract at least 3 million visitors to its strategically located pavilion at the world trade and investment showpiece.\n\nIt will exhibit under the theme Beyond Limits and its pavilion will embrace diversity, innovation and resilience, with the main thrust being how the country is surmounting various impediments through the employment of innovations.\n\nDr Munyanyiwa said outcomes from the global expo would inform and shape the Governments future policy decisions and action plans while the exhibition should help grow and transform the countrys tourism and hospitality sector.\n\nSo, definitely it will shape our plans (and policies) the next time when we are doing our planning because any plan must be organic, must change, it must align to the environment and after this kind of event, Zimbabwe will no longer be the same, he said.\n\nTourism is one of Zimbabwes key economic sectors along with agriculture, mining and manufacturing.\n\nThe country has already achieved its target of a US$5 billion tourism industry by 2025 and discussions are underway for new benchmarks.\n\nZimbabwes tourism, which the Government says has recovered to pre-Covid-19 era levels, which caused countries across the globe into lockdowns to contain the spread of the viral disease, thereby impacting travel and tourism, is expected to attract more than 2 million visitors and raking in US$1,3 billion in receipts this year.\n\nThe recovery has benefited from fresh investments key in infrastructure including the countrys road network, the Robert Mugabe International and Victoria Falls International airports, which together with the various efforts by the Government, among them, the open skies policy, lured back international airlines.\n\nForeign airline numbers have grown to 21, including British Airways, South African Airways, ComAir, Lufthansa, Emirates, Ethiopian and Qatar Airways among others, after plunging to only a handful after the turn of the century.\n\nDr Munyanyiwa, in an interview with Star FMs State of Affairs programme team, said Expo 2025 Osaka presented a unique opportunity to showcase Zimbabwes endowments, trade and investment opportunities, culture and heritage to the rest of the world.\n\nMillions of people patronise this event and a lot of countries are exhibiting.\n\nSo, it is a one-stop shop for promoting your destination.\n\nA lot of business transactions do happen (at this event) and this is where you establish your networks and when you get back home and start following up on those leads.\n\nYou (would) have promoted yourself, you (would) have benchmarked, you know what is happening in the world.\n\nFor tourism, we have got a lot of attractions that we also want to showcase; our world heritage sites like Victoria Falls,Great Zimbabwe, the Eastern Highlands, Matopos; wildlife experience, natural scenery; a diversity of our attractions in all the 10 provinces.\n\nThere is a lot of stuff that we need to be talking about, experiences of Zimbabwes rich traditions and different cultures, our gastronomy, he said.\n\nDr Munyanyiwa said Zimbabwe had a lot to offer, including its unique cuisines.\n\nYou are aware that Zimbabwe has done well in gastronomy through the efforts of the First Lady, Dr Auxilia Mnangagwa, who is spearheading that, he said.\n\nDr Munyanyiwa said Dr Mnangagwas efforts culminated in the country being awarded the right to host the first-ever Africa Gastronomy Forum.\n\nFood is an important part of tourism, he said.\n\nSo, in terms of tourism, we see immediate and future impacts because once you participate at this forum, you have seeded for future development.\n\nThere are a lot of countries in the world that we are unable to visit, but this platform brings countries under one roof and you are benchmarking yourself and you are promoting yourself.\n\nWe need therefore to be there for six months and promote our destination.\n\nHe added the country will also market the unlimited investment potential in infrastructure development.\n\nZimbabwe is under-invested in accommodation. We need more capacity, and we need more investment in accommodation because once there is demand, then we are saying other supporting infrastructure create investment opportunities; road networks for accessibility; we need investment in that and we have to work on that, he said.\n\nHe said from a cluster-based tourism approach, the Government continued to identify where there was this need, including through exploring opportunities in Community-Based Tourism.\n\nSo, there is a huge opportunity in terms of infrastructure and product development, Dr Munyanyiwa said. The objective is to showcase Zimbabwe and tourism is just one aspect within that window that we have.\n\nZimbabwe will also use the global exhibition to showcase its cultural heritage.\n\nDr Munyanyiwa said from a culture-based tourism approach, people across the world were differentiated by their own culture.\n\nAs such, Zimbabwe would have visuals, cultural groups and diverse cuisines as part of its promotional package during Expo 2025 Osaka.\n\nThe country would have ample opportunity to focus on culture and heritage during its own National Day, allocated to every country to celebrate its culture, people and endowments.\n\nWe are going to have a National Day, every country is allocated a National Day, to celebrate your country and we are going to use that platform to promote our fabric, to promote our cuisines, to promote our dance and music and all the heritage that we have, Dr Munyanyiwa said.\n\nThis is expected to boot visitors to Zimbabwe from across the world, including Japan, which is already a key tourist source market for the country.\n\nDr Munyanyiwa noted that increasing tourists traffic was critical given that investors, often, start with ordinary visits, which may culminate in investments.\n\nSo, we want to make sure that we are selling our destination, both to the local population and of course to the international population.\n\nHe said the country would utilise some of the experience gained from its participation at Expo 2020 Dubai, United Arab Emirates, to better prepare and maximise the opportunities presented by Expo 2025 Osaka.\n\nWe have seen a scaling up because every expo we have to learn, we have seen scaling up of our presence; what can we do there; the design of our pavilion; the different offers that we take there and what information we want to send, he said.\n\nExpo 2025 Osaka commissioner General, who is also trade promotion body ZimTrade chief executive Mr Allan Majuru is on record saying the country had noted down its targeted outcomes and the associated numbers, regarding what it seeks to bring back from the global expo after the six months eventhas ended.\n\nJapan Embassy Charge dAffaires, Mr Hiroyuki Kumagai, also said late last year that his country was working tirelessly to deliver a successful expo, adding the event presented huge opportunities for mutual exchanges among participants.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Commissioner-General-of-Zimbabwe-Pavilion-at-Expo-2025-Osaka-Mr-Allan-Majuru-second-left-680x380.jpg",
            "description": "Golden Sibanda Zimbabwe may never be the same post its participation at Expo 2025 Osaka, Japan, where it will join more than 150 other countries for the six-month long global exhibition expected to attract over 28 million visitors from across the world, permanent secretary for Tourism and Hospitality Industry Dr Takaruza Munyanyiwa has said. The […]",
            "time": "09:30",
            "date": "06 Feb 2025"
        }
    ]
}