{
    "news": [
        {
            "title": "President Ruto calls for unified action to resolve DRC conflict",
            "url": "https://www.herald.co.zw/president-ruto-calls-for-unified-action-to-resolve-drc-conflict/",
            "content": "Online Reporter\n\nKenyan President William Ruto has called for urgent, collective, and sustained action to address the ongoing security crisis in the eastern Democratic Republic of Congo (DRC), emphasising the need for diplomatic solutions over military intervention.\n\nSpeaking at the historic joint summit of the East African Community (EAC) and Southern African Development Community (SADC) in Dar es Salaam, President Ruto expressed deep concern over the prolonged conflict, which has devastated the DRC for over two decades.\n\nHe commended Tanzanian President Samia Suluhu Hassan for hosting the summit, underscoring the importance of regional collaboration in resolving the crisis.\n\nWe find ourselves standing face to face with a grave security, diplomatic, and humanitarian crisis in the DRC, a situation that demands our immediate, collective, and sustained attention, he said.\n\nHe highlighted the immense toll the conflict has taken on the DRC, including mass displacement, loss of life, and economic setbacks.\n\nThe recent escalation of violence in Goma and surrounding areas, he warned, serves as a stark reminder of the urgent need for action.\n\nPresident Ruto called on all parties involved in the conflict to immediately cease hostilities, emphasising that military action alone will not bring a lasting solution.\n\nHe specifically urged the M23 rebel group to halt further advancements and called on the armed forces of the DRC to refrain from retaliatory measures.\n\nAn immediate ceasefire is the only way by which we can create necessary conditions for constructive dialogue and implementation of a comprehensive peace agreement, said President Ruto.\n\nHe reaffirmed the commitment of EAC and SADC to the principles of territorial integrity, national sovereignty, and peaceful coexistence. Additionally, he condemned attacks on diplomatic missions, civilians, and peacekeepers, calling such acts a violation of international law.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/1000086760-640x380.jpg",
            "description": "Online Reporter Kenyan President William Ruto has called for urgent, collective, and sustained action to address the ongoing security crisis in the eastern Democratic Republic of Congo (DRC), emphasising the need for diplomatic solutions over military intervention. Speaking at the historic joint summit of the East African Community (EAC) and Southern African Development Community (SADC) […]",
            "time": "06:08",
            "date": "09 Feb 2025"
        },
        {
            "title": "Tanzania’s President calls for urgent action on DRC conflict",
            "url": "https://www.herald.co.zw/tanzanias-president-calls-for-urgent-action-on-drc-conflict/",
            "content": "Online Reporter\n\nTanzanias President Samia Suluhu Hassan has called for immediate and collective action to address the ongoing security crisis in the eastern Democratic Republic of Congo (DRC), warning that inaction would have severe consequences for the region.\n\nSpeaking at the joint East African Community (EAC) and Southern African Development Community (SADC) summit in Dar es Salaam on Saturday, President Hassan emphasised the need for regional leaders to take responsibility in resolving the persistent conflict.\n\nTanzania is profoundly honoured to host this high-level meeting and remains eternally committed to promoting peace and security within the region and beyond, she said.\n\nThe DRC, a member of both EAC and SADC, continues to suffer from prolonged instability, with violence escalating in recent weeks.\n\nPresident Hassan highlighted the devastating impact of the conflict, including loss of life, displacement of civilians, economic disruptions, and threats to cross-border trade.\n\nFor the last couple of weeks, we have witnessed the spread of violence that has caused massive harm to human life, displacement, and insecurity, she sai.\n\nAs regional leaders, history will judge us harshly if we remain still and watch the situation worsen day by day.\n\nStressing the principle of African solutions for Africas problems, the Tanzanian leader called on EAC and SADC member states to take urgent and decisive steps to restore stability in the DRC.\n\nShe urged all parties involved in the conflict to engage in dialogue, prioritise the well-being of civilians, and commit to peaceful coexistence.\n\nThis joint summit presents an opportunity to recommit our collective efforts in addressing the conflicts and reaffirm our commitment to sustainable peace and stability, she said emphasising the need for a long-term solution that upholds sovereignty and inclusivity.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Dr-Samia-Suluhu-Hassan-680x380.jpg",
            "description": "Online Reporter Tanzania’s President Samia Suluhu Hassan has called for immediate and collective action to address the ongoing security crisis in the eastern Democratic Republic of Congo (DRC), warning that inaction would have severe consequences for the region. Speaking at the joint East African Community (EAC) and Southern African Development Community (SADC) summit in Dar […]",
            "time": "06:08",
            "date": "09 Feb 2025"
        },
        {
            "title": "SADC, EAC join hands to silence the guns in DRC",
            "url": "https://www.herald.co.zw/president-leaves-for-joint-sadc-eac-summit-on-drc/",
            "content": "\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Summit1-564x380.png",
            "description": "",
            "time": "06:08",
            "date": "09 Feb 2025"
        },
        {
            "title": "SADC-EAC seek immediate end to DRC conflict",
            "url": "https://www.herald.co.zw/sadc-eac-seek-immediate-end-to-drc-conflict/",
            "content": "Fungi Kwaramba in DAR ES SALAAM, Tanzania\n\nTHE convening of a joint summit between SADC and the East Africa Community (EAC) is testament to the two blocs commitment to the values of the African Union (AU) and must be upscaled to silence guns on the continent, SADC chairperson President Mnangagwa has said.\n\nIn his opening remarks at the joint SADC-EAC Summit that is currently underway in Tanzania, President Mnangagwa said the conflict in DRC has far-reaching consequences for Africa and the world at large.\n\nThis historic summit of our two regional blocs is testament to our shared commitment to the founding values of the African Union, said the President.\n\nSuch joint initiatives must see us scale up bold and decisive actions to silence the guns on our continent, but most immediately, implement lasting solutions to the escalating conflict and humanitarian crisis in eastern DRC.\n\nUndoubtedly, ongoing instability, growing hostilities and the ever-increasing number of internally displaced persons in the eastern DRC has far-reaching consequences, not only for the people of the DRC alone but also for our regions and the African continent as a whole.\n\nSADC and the EAC are meeting in Tanzania to try and find a lasting solution to the DRC crisis, which has seen rebel groups taking over towns in the eastern parts of the vast country.\n\nDRC President Felix Tshisekedi is attending the joint summit virtually, and other Great Lakes region leaders like Paul Kagame and Ugandan President Yoweri Museveni are also in attendance.\n\nA communique on the agreement between the two blocs is expected to be released later today.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/GjQOHKXXEAAcfBf-680x380.jpg",
            "description": "Fungi Kwaramba in DAR ES SALAAM, Tanzania THE convening of a joint summit between SADC and the East Africa Community (EAC) is testament to the two blocs’ commitment to the values of the African Union (AU) and must be upscaled to silence guns on the continent, SADC chairperson President Mnangagwa has said. In his opening […]",
            "time": "06:08",
            "date": "09 Feb 2025"
        },
        {
            "title": "President Mnangagwa to address Summit",
            "url": "https://www.herald.co.zw/president-mnangagwa-to-adress-summit/",
            "content": "Online Reporter\n\nPresident Mnangagwa will address the Summit this morning and later, to wrap up the joint summit.\n\nA Communique of the Joint SADC-EAC Summit of the Heads of State and Government will be later on by the Secretary General of the EAC, Her Excellency Veronica M Nduva\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/3r23r-680x380.jpg",
            "description": "Online Reporter  President Mnangagwa will address the Summit this morning and later, to wrap up the joint summit. A Communique of the Joint SADC-EAC Summit of the Heads of State and Government will be later on by the Secretary General of the EAC, Her Excellency Veronica M Nduva",
            "time": "06:08",
            "date": "09 Feb 2025"
        },
        {
            "title": "SADC and EAC hold joint meeting of the Council of Ministers on DRC crisis",
            "url": "https://www.herald.co.zw/new-sadc-and-eac-hold-joint-meeting-of-the-council-of-ministers-on-drc-crisis/",
            "content": "Online Reporter\n\nTHE Southern African Development Community (SADC) and East African Community (EAC) convened a joint meeting of the Council of Ministers on Friday to assess the worsening security situation in the eastern Democratic Republic of Congo (DRC).\n\nThe meeting set the stage for the joint SADC-EAC Summit of Heads of State and Government scheduled for today in Dar es Salaam, Tanzania.\n\nThe ministerial session was co-chaired by Zimbabwes Minister of Foreign Affairs and International Trade and chairperson of the SADC Council of Ministers Professor Amon Murwira alongside Dr Musaila Mudavadi, Kenyas Prime Cabinet Secretary and Secretary for Foreign and Diaspora Affairs, who led the EAC delegation.\n\nSpeaking at the meeting, Prof Murwira emphasised the need for stronger joint political and diplomatic efforts to restore peace and stability in the eastern DRC.\n\nIt is regrettable that the security and humanitarian crisis in Eastern DRC continues to deteriorate despite the noble efforts through the Luanda and the Nairobi processes, he said.\n\nIt is heartbreaking that around 400 000 people have been displaced in the city of Goma this year alone.\n\nThe crisis in eastern DRC has escalated in recent months, with the ongoing conflict leading to mass displacement, civilian casualties and increased instability in the region.\n\nThe SADC and EAC blocs have been working to implement peace initiatives, including the Luanda and Nairobi processes, aimed at facilitating dialogue and ending hostilities.\n\nSADC Executive Secretary Mr Elias Magosi hailed the joint meeting as a significant step in the spirit of solidarity and collaboration between the two regional blocs in their quest for a lasting solution.\n\nThe decision to convene the joint summit was made during the Extraordinary SADC Heads of State and Government Summit held on January 31, 2025 in Harare.\n\nThat meeting underscored the urgency of addressing the precarious and fast-evolving security situation in the DRC and called for immediate joint action.\n\nThe joint SADC-EAC Summit of Heads of State and Government is expected to outline a collective approach to the crisis, focusing on sustainable security interventions, humanitarian support and reinforcing diplomatic efforts to achieve lasting peace in the region.\n\nAs regional leaders prepare to convene in Dar es Salaam, expectations are high for a unified strategy that can effectively address the ongoing instability in the eastern DRC.\n\nThe collaboration between SADC and EAC reflects a growing commitment to regional security and the collective responsibility of African nations in promoting peace and stability.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/GjMroIhXYAMwthb-680x380.jpg",
            "description": "Online Reporter THE Southern African Development Community (SADC) and East African Community (EAC) convened a joint meeting of the Council of Ministers on Friday to assess the worsening security situation in the eastern Democratic Republic of Congo (DRC). The meeting set the stage for the joint SADC-EAC Summit of Heads of State and Government scheduled […]",
            "time": "06:08",
            "date": "09 Feb 2025"
        },
        {
            "title": "DRC crisis: Sadc, EAC eye peace breakthrough",
            "url": "https://www.herald.co.zw/drc-crisis-sadc-eac-eye-peace-breakthrough/",
            "content": "Fungi Kwaramba in DAR ES SALAAM, Tanzania\n\nSADC Chairperson President Mnangagwa will today chair a joint summit of SADC and the East Africa Community (EAC) along with EAC Chairperson Kenyan President William Ruto to persuade all involved in the Democratic Republic of Congo conflict to lay down arms and return the eastern parts of the resource-rich country to normalcy.\n\nThe President, who arrived here yesterday, will be leading the SADC Double Troika for the crucial indaba with their EAC counterparts in a unique and extraordinary summit that brings all parties involved in the decades-old conflict to the same table.\n\nTodays meeting was preceded by a joint meeting of Councils of Ministers from SADC and the EAC which discussed the deteriorating security situation in Eastern DRC, where rebels have gained a foothold, leaving an estimated 2 000 people dead and thousands more displaced.\n\nThe Joint SADC-EAC Meeting of Ministers was co-chaired by Zimbabwes Foreign Affairs and International Trade Minister Professor Amon Murwira and Kenya Prime Cabinet and Secretary for Foreign and Diaspora Affairs Dr Musaila Mudavadi.\n\nProf Murwira said the joint effort involving Southern Africa and East Africa underlines the importance of joint political and diplomatic efforts for normalcy to prevail in the Eastern DRC.\n\nIt is regrettable that the security and humanitarian crisis in Eastern DRC continues to deteriorate despite the noble efforts through the Luanda and the Nairobi (peace) processes. It is heart-breaking that around 400 000 people have been displaced in the city of Goma, this year alone, said Prof Murwira.\n\nDRC President Felix Tshisekedi, Rwanda President Paul Kagame, Tanzanian President Samia Suluhu Hassan, South Africa President Cyril Ramaphosa, Ugandan President Yoweri Museveni and Somalian President Hassan Sheikh Mohamud are all expected to attend todays make-or-break talks.\n\nSADC has 16 members and the EAC has eight but DRC, which has been plagued by conflicts for years now, is along with Tanzania a member of both blocs.\n\nRwanda, which is accused by the DRC of backing the M23 rebels that have taken key towns in Eastern DRC, is a member of EAC. Rwanda stridently denies sponsoring renegades in its neighbouring country.\n\nYesterday, SADC Executive Secretary Mr Elias Magosi hailed the convening of the Joint Meeting of SADC and EAC as a vital step in the spirit of solidarity and collaboration between members of SADC and EAC in finding a lasting solution to the security situation in the DRC.\n\nThe Joint SADC-EAC Summit will be held in fulfilment of the decision of the Extraordinary Summit of SADC Heads of State and Government of January 31 in Harare, where the summit assessed the precarious and fast-evolving security situation in the Eastern DRC, and called for an immediate joint Summit of SADC and EAC to find the best way forward, and a collective approach to the security situation in the DRC.\n\nSilencing the Guns is a key initiative within the African Unions (AU) Agenda 2063, a long-term plan aiming to achieve peace and sustainable development across the continent by 2063, to end all wars and violent conflicts in Africa by addressing the root causes of conflict and promoting dialogue-based conflict resolution mechanisms; essentially, its a flagship project within Agenda 2063 focused on creating a peaceful Africa through conflict prevention and resolution.\n\nFurther, the summit urged political and diplomatic leaders engaged in the conflict to collaborate in a unified dialogue effort.\n\nThis includes backing the Luanda Process and the United Nations Organisation Stabilisation Mission in the DRC (MONUSCO) to help restore peace and security in Eastern DRC.\n\nBoth the African Union and the United Nations have called for a peaceful resolution to the conflict in DRC, which threatens to throw the whole of the Great Lakes region into a wider conflagration.\n\nAhead of the joint summit, President Mnangagwa has said he is determined to ensure that guns are silenced in the region.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/HE1-1.jpg",
            "description": "Fungi Kwaramba in DAR ES SALAAM, Tanzania SADC Chairperson President Mnangagwa will today chair a joint summit of SADC and the East Africa Community (EAC) along with EAC Chairperson Kenyan President William Ruto to persuade all involved in the Democratic Republic of Congo conflict to lay down arms and return the eastern parts of the […]",
            "time": "06:08",
            "date": "09 Feb 2025"
        },
        {
            "title": "Chigudu declared national hero",
            "url": "https://www.herald.co.zw/chigudu-declared-national-hero/",
            "content": "Zvamaida Murwira, Senior Reporter\n\nFormer Zanu PF provincial chairperson for Manicaland and career civil servant, Cde Tinaye Elisha Nzirasha Chugudu, who died on Wednesday, has been declared a national hero in honour of his contribution to the country before and after independence.\n\nPresident Mnangagwa has since sent a message of condolence to the Chigudu family, describing him as a principled man.\n\nZanu PF Politburo member, Cde Supa Mandiwanzira, was dispatched by the President yesterday to deliver the message of the decision by the party to declare Cde Chigudu a national hero at the deceaseds Mount Pleasant residence in Harare.\n\nCde Mandiwanzira was accompanied by the partys Central Committee member, Dr Jenfan Muswere, who is Information, Publicity and Broadcasting Services Minister and Makoni West legislator.\n\nFormer Buhera North legislator and Zanu PF Central Committee member, Cde William Mutomba, was among mourners at the funeral wake.\n\nPresident Mnangagwa said Cde Chigudu demonstrated bravery when he became one of the first cadres to be trained to fight in the liberation struggle.\n\nI received with deep sorrow and sadness, news of the untimely death of Cde Tinaye Elisha Nzirasha Chigudu, a veteran of our liberation struggle, former Permanent Secretary in the Ministry of Home Affairs, former Governor of Manicaland Province and former ZANU PF Manicaland Provincial Chairman, he said.\n\nCde Chigudu was among the brave sons and daughters of the soil who took a stand and fought for the Independence of Zimbabwe.\n\nHe was one of the first combatants to be sent for training in North Korea under the Zimbabwe Peoples Revolutionary Army (ZPRA), the military wing of the Zimbabwe African Peoples Union (ZAPU).\n\nPresident Mnangagwa said Cde Chigudu demonstrated his bravery when he was deployed as an intelligence operative in the then Salisbury.\n\nThe critical information he gathered regarding the modus operandi of the racist Rhodesian forces assisted the guerilla operations and recruitment of young Zimbabweans for training.\n\nCde Chigudu, said President Mnangagwa, was arrested and imprisoned for 12 years for his revolutionary role.\n\nAs he pursued the important mission, Cde Chigudu was captured and imprisoned for 12 years by the Rhodesian regime. After his release from prison, Cde Chigudu crossed into Zambia, reunited with his fellow comrades and resumed his duties and chores of the armed war of liberation.\n\nCde Chigudu was a principled cadre who served the ruling ZANU PF Party and the Government with unquestionable allegiance, loyalty and dedication, he said.\n\nPresident Mnangagwa described him as a fountain of wisdom who offered wise counsel and advice in conducting both party and Government business, drawing from his vast experiences.\n\nOn behalf of the party, ZANU PF, Government, my family and on my behalf, I wish to express my deepest, heartfelt condolences to the Chigudu Family on this sad loss.\n\nMay the family derive comfort from the contribution he made to this great nation. In recognition of his immense contribution to our nation, both before and after Independence, the ZANU PF Politburo agreed to accord him the status of national hero. May his dear soul rest in eternal peace, said President Mnangagwa.\n\nIn his message to mourners yesterday, Cde Mandiwanzira, who is also Nyanga South legislator, said there was unanimity among Politburo members when the issue of the hero status of Cde Chigudu came up for discussion.\n\nI have come here with a message from His Excellency, President Mnangagwa, who said he was deeply touched by the death of Cde Chigudu. He said Cde Chigudu ought to be conferred with the highest honour of a national hero owing to his contribution.\n\nWhen President Mnangagwa consulted his colleagues, there was unanimity that he deserved to be a national hero, said Cde Mandiwanzira.\n\nHe said Cde Chigudu remained principled and never wavered up until the end.\n\nUnlike cadres who made huge contributions but later deviated from the ethos of the liberation struggle, Cde Chigudu remained steadfast, said Cde Mandiwanzira.\n\nCde Chigudus brother, Mr Tafiramambo Chigudu, said the family felt humbled by the decision of the party and Government to confer their relative the highest honour.\n\nI want to thank the President, the party and the Government for the honour conferred on our relative.\n\nWe do not take this honour for granted because not every person is granted that honour. We are elated as a family, said Mr Chigudu.\n\nIn an interview, his widow, Mrs Ester Chigudu, described him as a loving husband and father.\n\nHe helped a lot of people in the family even within the extended family. His death is quite painful. He has been unwell for a long time, she said.\n\nHis daughter, Rudo, said her father was determined to see them prosper and do well in education.\n\nCde Chigudu was born on August 13, 1942. He had his early education at Chigudu School, Cyrene Mission and Harare Secondary School where he was expelled in 1964 because of his political activism.\n\nHe left the country in 1964 and went to Zambia under ZAPU. He then trained guerilla warfare in the Democratic Republic of Korea as a ZIPRA cadre.\n\nUpon his return he was deployed in the country as an intelligence officer. In May 1965, he was captured and detained in Gonakudzingwa, Gweru and finally Whawha.\n\nHe was in detention for 12 years and was released in 1977 and exiled. He went to the UK and was enrolled at Exeter University where he studied law between 1978 and 1981.\n\nOn coming home, he joined the civil service, first as under Secretary (Legal Affairs) Ministry of Transport from 1981. He was appointed Deputy Secretary for the Ministry of Home Affairs and then Permanent Secretary in the same Ministry from 1994 to 2004.\n\nHe later became Permanent Secretary for Mines and Mining Development from 2004 to 2005. He was then appointed Governor and Resident Minister of Manicaland in 2005 and retired in 2008.\n\nHe is the former ZANU PF provincial chairman of Manicaland and worked as a senior consultant under the United Nations Development Programme to structure the Ministry of Interior for South Sudan.\n\nAt the time of his death, he was farming in Makoni District.\n\nHe is survived by his wife, Mrs Esther Chigudu and seven children.\n\nMourners are gathered at Number 9, Belsize Close, Northwood, Mount Pleasant in Harare.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/TC1.jpg",
            "description": "Zvamaida Murwira, Senior Reporter Former Zanu PF provincial chairperson for Manicaland and career civil servant, Cde Tinaye Elisha Nzirasha Chugudu, who died on Wednesday, has been declared a national hero in honour of his contribution to the country  before and after independence. President Mnangagwa has since sent a message of condolence to the Chigudu family, […]",
            "time": "06:08",
            "date": "09 Feb 2025"
        },
        {
            "title": "President praises outgoing AfDB boss Adesina",
            "url": "https://www.herald.co.zw/president-praises-outgoing-afdb-boss-adesina/",
            "content": "Wallace Ruzvidzo, Herald Reporter\n\nThrough unity, hard honest work, innovation and resilience, Africa can become a modernised and industrialised continent that is truly food and energy secure, peaceful and independent, President Mnangagwa said yesterday.\n\nIn his congratulatory message to African Development Bank (AfDB) president Dr Akinwumi Adesina, who will be leaving the post this year after having served at the helm of the continents development bank for the last 10 years, the President said Dr Adesina had served with distinction.\n\nHe had reignited a sense of hope and confidence in what Africa can achieve, leveraging on its abundant natural resources.\n\nOn behalf of the people and Government of Zimbabwe, and indeed on my own behalf, I congratulate the untiring son of Africa and Africas Optimist-in-Chief, Dr Akinwumi Adesina, for the 10 years of exceptional leadership as President of the African Development Bank Group. Congratulations, Mr President, he said.\n\nIn his 10 years of astute and steadfast service to our continent and the peoples of Africa, Dr Adesina has made us shift our perspectives towards the meaning of development finance. He reignited, among us, a new sense of hope and confidence in what we can achieve as an African people, leveraging on our resources.\n\nPresident Mnangagwa urged the youth and future generations to emulate the passion for Africas development exhibited by Dr Adesina.\n\nThe President appointed the AfDB chief as the Champion of Zimbabwes arrears clearance and debt resolution platform in 2022, a task he undertook with impeccable zeal and commitment.\n\nThis being his farewell year, I challenge current and future generations, the youth and women, to cherish the work of Dr Adesina and many other illustrious sons and daughters of Africa, as we work hard to realise a thriving and prosperous continent.\n\nThrough unity, hard honest work, innovation and resilience, we can realise a modern and industrialised Africa, that is truly food and energy secure, peaceful and independent.\n\nIn 2022, I was pleased to appoint Dr Adesina as the official Champion of the Zimbabwe Arrears Clearance and Debt Resolution process. He has undertaken this arduous task on behalf of my administration with impeccable zeal and commitment, said President Mnangagwa.\n\nAs the Champion of Zimbabwes arrears clearance and debt resolution process, Dr Adesina saw through constructive dialogue and the bringing together of all parties concerned. This has aided the Second Republic in deepening its engagement and re-engagement within the comity of nations.\n\nPresident Mnangagwa said Zimbabwe, as an agro-based economy, had benefitted immensely from Dr Adesinas agriculture credentials and mission to transform Africas rural farmlands into regions of prosperity.\n\nUnder his leadership, the Banks flagship, Technologies for African Agricultural Transformation (TAAT) was launched, delivering climate-smart and weather-resilient staple seeds to more than 40 million smallholder farmers across 30 countries on the continent.\n\nThis is set to see Africa produce an extra 120 million tonnes of food by the end of 2025, he said.\n\nUnder Dr Adesinas leadership, the continents premier development finance institution had grown into a global, award-winning brand.\n\nResultantly, the bank has become a reputable development finance partner of choice. Under his leadership, the African Development Bank Group has emerged as a global champion of inclusive green growth food security, climate-smart infrastructure, energy access for millions of Africans and financial innovation, he said.\n\nThe President went on to describe Dr Adesina as an iconic, true son of Africa.\n\nHaving known and interacted with Dr Adesina for many years, I applaud the numerous milestones he has achieved during his illustrious career.\n\nHe stands tall as one of the iconic and true sons of Africa, always advancing Africas cause and interests. Undoubtedly, his footprint and impact on Africa to realise its development aspirations will remain indelible\n\nMr President, Africa, and Zimbabwe, express their profound gratitude and thank you for your selfless, bold, decisive and dedicated service to our mother continent of Africa and her peoples.\n\nCongratulations once again, Your Excellency, Dr Adesina, for your exceptional leadership during your tenure at the helm of the African Development Bank. I wish you continued success in the years ahead, said President Mnangagwa.\n\nSince assuming the reins at the AfDB in 2015, Dr Adesina, a World Food Prize laureate, has been instrumental in attracting global investment, spearheading innovative development strategies, and consistently positioning Africa as a continent of immense potential and opportunity.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/05/Dr-Akinwumi-Adesina.jpg",
            "description": "Wallace Ruzvidzo, Herald Reporter Through unity, hard honest work, innovation and resilience, Africa can become a modernised and industrialised continent that is truly food and energy secure, peaceful and independent, President Mnangagwa said yesterday. In his congratulatory message to African Development Bank (AfDB) president Dr Akinwumi Adesina, who will be leaving the post this year […]",
            "time": "06:08",
            "date": "09 Feb 2025"
        },
        {
            "title": "‘No problem with Zacc getting certificates to prosecute cases’",
            "url": "https://www.herald.co.zw/no-problem-with-zacc-getting-certificates-to-prosecute-cases/",
            "content": "Zvamaida Murwira, Senior Reporter\n\nThe National Prosecuting Authority will issue the Zimbabwe Anti-Corruption Commission (ZACC) with prosecutorial certificates should they want to prosecute cases.\n\nFor the certificates to be issued, ZACC must be prepared to adhere to prosecutorial guidelines which include a separate prosecution team from the investigators doing the court work.\n\nIn an interview, Prosecutor General Justice Loice Matanda-Moyo said she believed in team work and had no problem with issuing prosecuting certificates to ZACC or any other competent authority.\n\nOver the years, ZACC has been saying it wanted prosecutorial powers as part of efforts to effectively deal with the corruption scourge in the country.\n\nThe investigating arm said the prosecution of cases was sometimes stalled at the NPA, an arm which is also seized with other crimes that might not be related to corruption.\n\nIn an interview this week, Justice Matanda-Moyo said she had no problem issuing prosecuting certificates to ZACC.\n\nIf they want to prosecute matters, they can approach me, I have got powers to issue prosecution certificates, as long as they have a set department which is different from investigations so that we do not have an outcry from the public to say the same person who is investigating is the same person prosecuting, said Justice Matanda-Moyo.\n\nSo I do not see any problem. Because as NPA, we do not hoard the right to prosecute.\n\nI believe in teamwork, so the more people we have on board, the better.\n\nAs long as they report to the Prosecutor General and are bound by our prosecutorial guidelines, follow the guidelines on how we prosecute matters and how we reach decisions on whether a matter can be prosecuted or a matter cannot be prosecuted.\n\nIt is simply a question of that distinction so that there will be no outcry. Personally I do not hold views against getting lawyers from ZACC to prosecute matters here at NPA.\n\nShe said as NPA, they sometimes prioritise crimes that might be prevalent at a given time such as armed robberies and murder and might focus on such crimes ahead of other crimes in their effort to make society safe.\n\nIf another arm, which might be competent in prosecuting crime comes forth, she said, there was nothing wrong with that.\n\nThere might be times when cases of armed robbery are prevalent like now or murder cases might be rife, so we might take a deliberate position to concentrate on such cases, said Justice Matanda-Moyo.\n\nZACC has in the past said it was keen to have prosecutorial powers conferred on it to speed up corruption cases.\n\nThey have also argued that they sometimes did not agree with decisions not to prosecute cases that would have been submitted to the NPA.\n\nZACC has said it was surprised to see prosecutions declined when in their view, they would have attended to all possible areas of the law.\n\nIt was on that basis that ZACC felt that it required prosecuting powers to help expedite cases and push them before courts of law.\n\nLately, the NPA and ZACC have been at loggerheads, after the former withdrew charges against Harare City Council Town Clerk Hosiah Chisango and four others over a $9 million street lights tender.\n\nZACC felt that Chisango and the five others have a case to answer and is now preparing new charges against them.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/07/2607-1-1-LOICE-MATANDA-MOYO.jpg",
            "description": "Zvamaida Murwira, Senior Reporter The National Prosecuting Authority will issue the Zimbabwe Anti-Corruption Commission (ZACC) with prosecutorial certificates should they want to prosecute cases. For the certificates to be issued, ZACC must be prepared to adhere to prosecutorial guidelines which include a separate prosecution team from the investigators doing the court work. In an interview, […]",
            "time": "06:08",
            "date": "09 Feb 2025"
        }
    ]
}