{
    "news": [
        {
            "title": "President calls ministers to action",
            "url": "https://www.herald.co.zw/president-calls-ministers-to-action/",
            "content": "Wallace Ruzvidzo, Herald Reporter\n\nExcellence is not an option, but a guaranteed necessity to propel the countrys national development agenda, hence all Cabinet ministers should recommit to the duty of transforming Zimbabweans livelihoods, President Mnangagwa has said.\n\nIn his opening address at the first meeting of the 2025 Cabinet Year at State House yesterday, the President charged his team to prioritise outcomes that positively affect the lives of the general citizenry.\n\nAll Zimbabweans, including those in the Diaspora, he added, should be well catered for.\n\nAt the outset, all members are reminded of the need to once again recommit ourselves to the duty of transforming livelihoods and developing our great nation towards the achievement of Vision 2030.\n\nThe mandate before us is clear: We must deliver quality services to our citizens, ensuring that their needs are met and lives improved.\n\nAll our collective efforts should be geared towards creating a better future for all, leaving no one and no place behind. In this pursuit, it is critically important to engage with our people, listening to their concerns and responding to their needs.\n\nThe culture of accountability, transparency and excellence within our ministries should be nurtured with a greater sense of urgency for the ultimate objective of achieving transformational results. You must lead by example.\n\nWe must serve all our people from across all the four corners of our country including those in the diaspora he said.\n\nPresident Mnangagwa reiterated that all Cabinet meetings must be attended without fail.\n\nVice President Dr Constantino Chiwenga (left) and Vice President Kembo Mohadi arrive for 2025 Cabinet meeting opening at State House in Harare yesterday.-Picture:Joseph Manditswara\n\nWhere Ministers fail to attend due to approved reasons, they should delegate authority to Deputy Ministers and Permanent Secretaries, who should submit their Ministerial positions thereat.\n\nIn the same vein, Cabinet Members should ensure that Permanent Secretaries attend Working Party Meetings and brief them ahead of Cabinet Committee Meetings.\n\nAs I stated at the closing meeting of 2024 attendance at Cabinet Committee and Working Party meetings will form part of the performance evaluation criteria.\n\nWhile members are required to be abreast with programme implementation at the community level through regular field visits, these should not disrupt and unduly affect workflow in our provinces and districts, he said.\n\nThe President said he demanded boldness and decisiveness in the execution of Ministers duties.\n\nI urge all of us to remain aware that ours is a selfless service to the people of our great motherland Zimbabwe.\n\nI challenge us to undertake our work with utmost humility, sacrifice and commitment. Cabinet is run on the basis of collective responsibility; we must pull in one direction. There is no room for lethargy, fence sitting and dragging of feet, he said.\n\nPerformance contracting, said President Mnangagwa, remained a vital cog in the Second Republics strategy to enhance service delivery and drive the attainment of Vision 2030.\n\nPresident Mnangagwa address 2025 Cabinet meeting opening at State House in Harare yesterday.-Picture:Joseph Manditswara\n\nAs such, he announced that, Deputy Ministers must now also sign performance contracts as part of Governments endeavour to enhance accountability and efficiency.\n\n . . . this year will see us strengthen our focus on measurable outcomes, timely execution of policies, and responsiveness to the needs of our citizens.\n\nI have directed that Deputy Ministers should also sign performance contracts as part of our endeavour of accountability and efficiency.\n\nEvery Ministry, Department, and Agency must uphold the highest standards of professionalism and servant leadership. Excellence is not an option; but a guaranteed necessity to propel our national development agenda.\n\nLet us, therefore, approach 2025 with renewed vigour, guided by our shared vision of progress, prosperity, and people-centred governance, said President Mnangagwa.\n\nOn the economic growth front, the President said emphasis should be put towards ensuring that business is not hindered by prohibitive regulations as well as punitive administrative licenses and fees required by Ministries.\n\nFees, licences, permits and regulations, he added, should instead promote economic development and improve the livelihoods of Zimbabweans.\n\nTo enhance the overall performance of our economy, the Ease of Doing Business Agenda continues to be an important aspect of our programming.\n\nIn that regard, concerted efforts must be made to revisit all the areas that hinder the start or growth of all investments, whether local or foreign. I commend the entrepreneurial spirit among our people. By nature, Zimbabweans are hardworking, he said.\n\nInformation and Communications Technology (ICT), Postal and Courier Services minister Dr Tatenda Mavetera (left) ,Transport and Infrastructural Development Minister Felix Mhona (second from left) National Housing and Social Amenities Minister Zhemu Soda (right) and other ministers follow proceedings during 2025 Cabinet meeting opening at State House in Harare yerday.-Picture:Jopseph Manditswara\n\nGoing forward, President Mnangagwa said there would be no tolerance for corruption. The awarding of Government projects and business should be one merit, he said.\n\nAs we progress with our work in the year ahead, merit and performance must be the basis for awards of Government projects and business.\n\nChicanery, manipulation of processes and outright corruption of any kind, will not be tolerated within Ministries, Departments and Agencies. Ministers are therefore directed to maintain an interest and oversight role over their span of control.\n\nAlways ensure value for money in the implementation of programmes and projects as well as in procurement processes. By the same token, the appointment of persons into public sector boards must be based on merit, competence and the requisite experience, he said.\n\nOn Agriculture, President Mnangagwa said the 2024/2025 farming season was offering hope albeit after a shaky start.\n\nIn light of floods experienced in some parts of the country causing distress, he assured those affected that no community would be left unsupported.\n\nRegrettably, some regions of our country continue to experience floods, causing distress to many families and communities.\n\nSchool infrastructure has suffered extensive damage, while roads, bridges and clinics have not been spared. Infrastructure upgrading, therefore, remains a priority, right from the districts.\n\nProjects will resume with greater momentum once the current wet conditions subside. No community will be left in distress and Government will do its best to support those in need.\n\nThe Ministers of Local Government and Public Works; as well as Public Service, Labour and Social Welfare will soon update us on the extent of the damage and the relief efforts which are underway, he said.\n\nOn international relations, President Mnangagwa said as SADC Chair, Zimbabwe would continue to champion peace initiatives in the region as well as further the engagement and re-engagement drive on the global stage.\n\nOn the international relations front, efforts to promote and entrench regional peace, unity and solidarity will continue to occupy our schedule as the current Chair of SADC.\n\nThe Osaka 2025 Expo, among other high profile international events, requires us, along with the private sector, to apply ourselves fully so that our country reaps optimal socio-economic benefits from this premier global extravaganza, he said.\n\nOverall, the year will be characterised by numerous high profile local, regional and international engagements which will require us all to redouble our efforts to achieve seamless coordination and a result-oriented work ethics.\n\nThe President said the Second Republic would continue with its thrust of decentralising national events.\n\nOf special note are the 45th Independence Day Commemorations which will be held in Gokwe-Nembudziya in line with the thrust of the Second Republic to hold national events rotationally at the grassroots level, he said.\n\nHe also promised that the water supply situation in Bulawayo, Harare and other major cities would continue to be closely monitored.\n\nA firm approach was also required on issues of waste management and disposal beginning at the household level and extending to communities, local councils as well as industry and commerce, said President Mnangagwa.\n\nCouncils must comply with requirement for the approval of their budgets and service delivery plans towards greater efficiency and enhanced accountability.\n\nGoing forward, I am directing that all outstanding budget approvals be concluded, without exception, within the First Quarter of every year, as we build momentum to deliver world-class services to all ratepayers and the general populace, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/HE-4.jpg",
            "description": "Wallace Ruzvidzo, Herald Reporter Excellence is not an option, but a guaranteed necessity to propel the country’s national development agenda, hence all Cabinet ministers should recommit to the duty of transforming Zimbabweans’ livelihoods, President Mnangagwa has said. In his opening address at the first meeting of the 2025 Cabinet Year at State House yesterday, the […]",
            "time": "08:26",
            "date": "12 Feb 2025"
        },
        {
            "title": "President fires Mash East Minister Munzverengwi",
            "url": "https://www.herald.co.zw/president-fires-mash-east-minister-munzverengwi/",
            "content": "Blessings Chidakwa, Herald Reporter\n\nPRESIDENT Mnangagwa has, with immediate effect, removed from office the Minister of State for Mashonaland East Provincial Affairs and Devolution, Cde Appolonia Munzverengwi.\n\nShe has since been replaced by Advocate Itayi Ndudzo, who is Hwedza North Constituency Member of Parliament.\n\nIn separate statements last night, Chief Secretary to the President and Cabinet Dr Martin Rushwaya announced the firing of Cde Munzverengwi and the appointment of Adv Ndudzo to replace her.\n\nHis Excellency the President of the Republic of Zimbabwe, Cde Dr E. D. Mnangagwa has, in terms of Section 108 (1a) of the Constitution of Zimbabwe, removed Honourable Apollonia Munzverengwi from the Office of Minister of State for Provincial Affairs and Devolution, Mashonaland East Province with immediate effect, he said.\n\nIn another statement that followed, Dr Rushwaya announced that Senator Munzverengwi had been replaced by Advocate Ndudzo.\n\nHis Excellency the President of the Republic of Zimbabwe, Cde. Dr. E. D. Mnangagwa has, in terms of Section 104 Subsection (1) of the Constitution of Zimbabwe, appointed Honourable Itayi Ndudzo as Minister of State for Provincial Affairs and Devolution, Mashonaland East Province with immediate effect, said Dr Rushwaya.\n\nSen Munzverengwi was initially appointed Provincial Minister in 2018 before being reappointed after the 2023 harmonised elections.\n\nAdv Ndudzo was elected into the National Assembly in 2023.\n\nThose who know him have described him as an exceptional litigator who specialises in land law, corporate law, administrative law, immigration law, mining law, labour law and constitutional law.\n\nHe has handled high-profile matters in the High Court and Supreme Court of Zimbabwe.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/10/Minister-of-State-for-Provincial-Affairs-and-Devolution-for-Mashonaland-East-province-Apollonia-Munzverengwi.jpg",
            "description": "Blessings Chidakwa, Herald Reporter PRESIDENT Mnangagwa has, with immediate effect, removed from office the Minister of State for Mashonaland East Provincial Affairs and Devolution, Cde Appolonia Munzverengwi. She has since been replaced by Advocate Itayi Ndudzo, who is Hwedza North Constituency Member of Parliament. In separate statements last night, Chief Secretary to the President and […]",
            "time": "08:26",
            "date": "12 Feb 2025"
        },
        {
            "title": "National Youth Day commemorations set for Byo",
            "url": "https://www.herald.co.zw/national-youth-day-commemorations-set-for-byo/",
            "content": "Rumbidzayi Zinyuke, Senior Health Reporter\n\nBulawayo is set to host a total of 20 000 youths from across the country for the National Youth Day commemorations slated for Barbourfields Stadium on February 21.\n\nThe day, which coincides with former President Robert Mugabes birthday, presents a platform for young people to interact with President Mnangagwa and showcase their talents.\n\nAddressing the media at the first post-Cabinet meeting for 2025 yesterday, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere said the hosting of the celebrations in Bulawayo was in line with the thrust of the Second Republic to hold national events rotationally.\n\nAs a national holiday, duly proclaimed and gazette, the event will provide a platform for young people to interact with His Excellency the President of the Republic of Zimbabwe, Dr ED Mnangagwa, showcase youth talents, businesses and contributions to national development, raise awareness on the dangers of drug and substance abuse and to increase awareness, commitment and investment in youth development initiatives, programmes and projects, he said.\n\nThe day will run under the theme Empower Youth, Secure the Future with the 20 000 young people expected to attend the main event February 21 and is the rest of the youths in all the provinces following proceedings in real time at designated Vocational Training Centres and institutions of higher learning.\n\nDr Muswere said foreign visitors, including Ministers and Youth Councils representatives from selected African countries, would also be expected to attend the event.\n\nThe pre-celebrations events on 20th February 2025 will attract an estimated total of 5 000 youths drawn from schools and institutions of Higher and Tertiary Education within Bulawayo Metropolitan Province and the adjoining Provinces.\n\nHighlights of the day will include a sporting and cultural fiesta, youth exhibitions, a clean-up campaign programme, a community outreach programme on Drug and Substance Abuse and the inimitable Ixhiba/ Nhanga/ Gota expose by the First Lady, Amai Dr Auxillia Mnangagwa, Dr Muswere said.\n\nHe said logistical preparations were already underway, with a total of 250 buses earmarked for equitable distribution to the countrys provinces.\n\nAdditionally, 15 shuttle buses will be availed to all constituencies in the Bulawayo Metropolitan Province for a successful 20th February 2025 programme.\n\nResponding to questions from the media, Youth Empowerment, Development and Vocational Training Minister Tino Machakaire said this years commemorations would be different from previous years.\n\nWe have invited quite a number of youth entrepreneurs and they are going to be showcasing their talents, businesses, and we also want our youths to see how they are doing their businesses.\n\nWe want them to learn and get ideas on how to start their own projects, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/JM.jpg",
            "description": "Rumbidzayi Zinyuke, Senior Health Reporter Bulawayo is set to host a total of 20 000 youths from across the country for the National Youth Day commemorations slated for Barbourfields Stadium on February 21. The day, which coincides with former President Robert Mugabe’s birthday, presents a platform for young people to interact with President Mnangagwa and […]",
            "time": "08:26",
            "date": "12 Feb 2025"
        },
        {
            "title": "Govt honours promise to BIPPA farm investors",
            "url": "https://www.herald.co.zw/govt-honours-promise-to-bippa-farm-investors/",
            "content": "Business Reporter\n\nGovernment has started compensating investors whose farms were protected under the Bilateral Investment Promotion and Protection Agreement (BIPPAs) before the 2000 Land Reform Programme, in a development expected to give impetus to the countrys Arrears Clearance and Debt Resolution Process.\n\nFollowing the approval of 94 claims valued at about US$145 million, the Government began payments in the second week of January 2025, Finance, Economic Development and Investment Promotion Minister Prof Mthuli Ncube said in a statement. The funds were provided for in the 2025 National Budget.\n\nI am pleased to announce that the compensation process has begun, said Minister Ncube. We believe that this process is critical for building trust, honouring our commitments and ensuring consistency with our Constitution as we address Zimbabwes debt challenge, he added.\n\nInvestor compensation is a key reform area under Zimbabwes Structured Dialogue Platform for Arrears Clearance and Debt Resolution.\n\nEstablished in December 2022, the platform facilitates engagement with creditors and development partners, focusing on reforms across economic growth and stability, governance, and land tenure, including farm owner compensation and BIPPAs.\n\nAfrican Development Bank (AfDB) President Dr Akinwumi Adesina was appointed by President Mnangagwa to champion the dialogue with former Mozambican President Joaquim Chissano serving as facilitator.\n\nThe BIPPA farmers are being compensated for land and improvements on the farms with only farmers from countries that had signed and ratified BIPPAs by the time the Land Reform Programme was introduced in 2000 eligible for payment.\n\nThe majority of the claims, 46, came from the Netherlands, followed by Switzerland with 27, Germany with 14, Denmark with 6, and Yugoslavia with one.\n\nIn the 2024 National Budget, the Treasury allocated US$20 million for compensation.\n\nThe remaining US$125,9 million will be disbursed through a multi-year plan from 2025 to 2028, with annual budget allocations. An additional US$20 million has been allocated in the 2025 National Budget. Minister Ncube said the compensation marks a historic milestone towards the countrys debt resolution.\n\nSuccessful implementation of the Structured Dialogue Platform reforms is crucial for Zimbabwe to clear arrears, achieve debt sustainability, and unlock new concessional external financing.\n\nThis is critical for achieving the countrys economic development objectives under the National Development Strategy 1 (NDS 1), which ends this year, and its successor, NDS 2, which runs for five years to 2030.\n\nThe compensation demonstrates the Governments goodwill and commitment to building trust in the process and improving investor confidence in the country, said Dr Adesina.\n\nThe progress Zimbabwe has made, the commitment and resilience it is showing calls for support from the development partners to facilitate the countrys effort in implementing the ongoing reforms and to provide the much-needed cushion to particularly the vulnerable members of the population.\n\nIn a statement, the German, Swiss, and Netherlands embassies in Harare applauded the Government for making the compensation a reality, noting that several affected individuals have received initial payouts and that a sense of closure is emerging.\n\nIt marks a significant milestone, and we consider it a very encouraging step towards a comprehensive and fair statement for farmers and investors in Zimbabwe, the embassies said.\n\nZimbabwes total public debt is estimated at US$21 billion, including external and domestic obligations.\n\nAt a recent high-level structured dialogue meeting in Harare, the Working Group on Land Tenure acknowledged significant progress in resolving land tenure issues and farm compensation for improvements on the acquired land.\n\nNotably, in October of last year, a decision was made to provide security of tenure to all beneficiaries of the Land Reform Programme, aiming to boost agricultural productivity and investments.\n\nThe Government has already launched a new initiative to streamline the issuance of title deeds, prioritising A2 farmers under the initial phase.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/03/Minister-Mthuli-Ncube.jpg",
            "description": "Business Reporter Government has started compensating investors whose farms were protected under the Bilateral Investment Promotion and Protection Agreement (BIPPAs) before the 2000 Land Reform Programme, in a development expected to give impetus to the country’s Arrears Clearance and Debt Resolution Process. Following the approval of 94 claims valued at about US$145 million, the Government […]",
            "time": "08:26",
            "date": "12 Feb 2025"
        },
        {
            "title": "Newly-appointed Unicef rep  pays courtesy call on First Lady",
            "url": "https://www.herald.co.zw/newly-appointed-unicef-rep-pays-courtesy-call-on-first-lady/",
            "content": "Tendai Rupapa, Senior Reporter\n\nNEWLY-APPOINTED Unicef representative in Zimbabwe Mrs Etona Ekole, the organisations Chief of HIV/Aids Adolescents youth and gender, and Government officials drawn from several ministries yesterday paid a courtesy call on First Lady Dr Auxillia Mnangagwa where they had heart-to-heart discussions on a wide range of issues concerning children, including prospects for synergies.\n\nAmong those who attended yesterdays meeting were officials from the ministries of Primary and Secondary Education and Public Service, Labour and Social Welfare\n\nThe First Lady, who has a passion for the welfare of children, has many programmes for learners including Gota/Nhanga/Ixhiba aimed at promoting good morals among children.\n\nShe also tackles drug and substance abuse through sport and holds interactive sessions with children teaching them the effects of drug abuse. She also warns communities against selling these harmful substances to children.\n\nThe First Lady also leads from the front in fighting child marriages, while advocating that children who fall pregnant must be given a second chance and return to school so that they realise their full potential.\n\nChildren living and working on the streets also benefit from the First Ladys programmes as they have been housed at Dr Auxillia Mnangagwas childrens home in Chiredzi and in Mbare at her Skills Development Centre where apart from going to school, they are being equipped with skills like carpentry, poultry and gardening so that they can learn a decent living in the future.\n\nHealth Ambassador First Lady Dr Auxillia Mnangagwa interacts with Unicef representative in Zimbabwe Mrs Etona Ekole, her deputy Ms Zeinab Adam, Chief of HIV/AIDS, Adolescents and youth and gender Ms Jacqueline Kabambe and officials from Ministries of Primary and Secondary Education, Public Service, Labour and Social welfare during a meeting at Zimbabwe House yesterday\n\nMrs Ekole said it was an honour to be welcomed at Zimbabwe House and to see where a lot of philanthropic work happens and the impulse for so many great ideas and actions.\n\nWe really are here as we have looked for an opportunity to meet with you Amai so that we could perhaps discuss synergies that Unicef may have with the great work that you do. And already we have benefited from much of your support. I first met you in Victoria Falls during the celebrations of the regional celebrations for World Childrens Day. What a great celebration that was. What a great animation and facilitation of children you did. I was so impressed. And we learned so much as well. So really, its an opportunity to see how Unicef can continue to work with you and your foundation, in promoting the rights of children and how you could also serve as a voice for the work that Unicef is doing, given all the platforms that you occupy, both in the country as well as externally, she said.\n\nThe Unicef representative hailed the First Lady for her interventions, saying they will continue to advocate for the rights of children, especially adolescent girls who require a lot of support.\n\nI mean, the basis of the foundation of any society is really the work that women do. And so, if we have so many young girls dropping out of school, so many young girls who are not protected from sexual violence, and exploitation, and so many young girls who also take on too much responsibility before their time, then we wont have that productive workforce later on.\n\nWe are also very much heartened by the work that you do on HIV and AIDS. And we seek your support also in helping the system, the UN system as a whole, but Unicef in particular, in the efforts that we are putting forward to address issues of paediatric HIV. Because we see that vertical transmission from mother to child is still very present. But also, you know, adolescent girls, more than any other population, are being exposed and run the risk of contracting Aids more than any other population, she said.\n\nMrs Ekole also praised the First Lady for the work that she is doing countrywide.\n\nWe look up to you, Your Excellency, as we pay attention to childrens education. Your Angel of Hope Foundation is doing critical work around children, she said.\n\nIn response, the First Lady expressed gratitude to Unicef for its work in the country and for seeking to work with her Angel of Hope Foundation.\n\nWe have had Unicef in Zimbabwe for a long time and it has been working with the Government. I am grateful that today you are here to find areas where you can work with my office and my Angel of Hope Foundation, especially on health and education of our children. I would also want to commend Unicef for the exceptional organisation of last years regional Childrens Day. It brought together children from different countries.\n\nWe separated boys from girls and held Gota/Nhanga/ Ixhiba. I did this so that we could hear exactly what is happening with the girls and the boys and also, to discuss with the elders what is expected of them. The girls had a lot of questions, they asked us elders, so many questions they wanted to learn from us. And they were so open to even asking everything concerning the girl child. I liked it very much. That openness coming from them showed me that they were hungry to know exactly who is that girl. Who is she? What is expected of her? It was a very warm and educative conversation that we had. I also want to see that continuing, the children coming together, sharing ideas and also me as the First Lady of Zimbabwe also visiting other countries meeting my fellow First Ladies and holding similar discussions with the children there like we did in Victoria Falls, she said.\n\nGirls and boys, the First Lady said, should know their responsibilities and what is expected of them.\n\nWe are here to help our children. Our girls are the mothers of tomorrow, so this is the time when we need to teach them good morals. What we see today is that some parents no longer have time with their children because everything starts at home, so something is lacking within the family unit. So, we are saying, okay, what can we do? We cannot let our girls do as they please just like that.\n\nI have also taken this same issue to the parents so that we teach our children and they have good morals. We do not want blame games that is why I meet with both the father and the mother. I am deeply committed to ensuring that Zimbabwean children grow up with a strong sense of identity, cultural pride and moral values. Every country has different cultures and norms that they follow.\n\nCountries are different, but we have a way of teaching our children, which is not burdening our children. In Zimbabwe, we emphasise our children go to school and be responsible people and work hard in school so that they have their own future which is emulated by many. I also introduced the girls and boys camps where I take them separately to the outskirts and I teach them all what is expected of a girl child and a boy child. I give them the floor to ask anything, she said.\n\nDr Mnangagwa gave the team a glimpse into her work and the various interventions she is undertaking in the health sector.\n\nI am also in the health sector, thousands of adolescent girls have gone through human papillomavirus (HPV) vaccination, a programme I advocated and which is still ongoing. Our girls are even indulging in sexual activities at tender ages and I am saying, I think, as First Ladies we need to sit down, put our heads together and look closely at these issues affecting our children, especially the girl child. Our children both boys and girls are being destroyed by drugs, the menace has spread across countries.\n\nI also managed to take children from the streets and placed them at Dr Auxillia Mnangagwas childrens home in Chiredzi while some are at my Mbare Skills Development Centre. I am also empowering women through various ways including education and income generating projects. This has helped in lowering GBV cases. So, your coming in will see us working together so that we have that morally upright girl child and boy child. I will invite you when I have some of these programmes. I thank you very much for coming here, she said.\n\nSpeaking at the same occasion, Mrs Jacqueline Kabambe Unicef Chief of HIV/AIDS, Adolescents Youth and Gender said a lot needed to be done to curb the spread of HIV/Aids.\n\nThe global target is that at least 95 percent of everyone living with HIV should be on treatment. The others we managed to put them on treatment, the children are lagging behind around 60, 63 and 68 and its a big constituency. At the same time, the adolescents that we are talking about, the girls especially, thats where new infections are coming up. When you look at the statistics, you see that new infections are high among adolescent girls, and young women, when you compare them to adolescent boys and young men. And when we look at what is driving this, especially why are we having new infections?\n\nYou find that pregnant women are not coming on time for antenatal. So, during that time when they delay coming for antenatal, if they were positive, then they pass on the virus. Sometimes they are there, they have accessed ART, and they drop out in the process. Then we also have cases whereby some who are breastfeeding are acquiring new infections. So, there is a combination of things that are driving these new infections among women and children. We really need your help on this Amai as we talk to women through you. We also look forward to your programmes as you also engage men on issues of HIV/AIDS. We wish to work closely with your office, she said.\n\nShe further thanked the First Lady for her efforts in fighting HIV/Aids and commended Zimbabwe for achieving the 95-95-95 target.\n\nMr Shingirai Paungano from the Ministry of Public Service, Labour and Social Welfare praised the First Lady for her countless programmes aimed at educating and protecting young people countrywide.\n\nWe thank you for the work that you are doing particularly for children.\n\n I for one have seen the work that you have been doing through the Nhanga/Gota/Ixhiba and also through the other teachings that you have been emphasising. Even just now, you were speaking about how you are also working with parents to promote good morals among children which also dovetails with our own culture as Zimbabweans because you see that as we strengthen families, parent and caregiver support, we will be able to prevent many things that we are talking about right now, one of them being drug and substance abuse and also children who are living and working on the streets. Most of these children, if you dig deep into their background, you find that most of these children whom we see on the streets, have parents and some of them have relatives but its because of poor parenting that these children end up destitute so this is an area where we also need your support and also your direction to come up with a national parenting model that helps to address some of these challenges that we are grappling with. I know that with your support we will be able to gain the confidence of parents, some of whom have been adamant, but I know because of your influence and position, they will be compelled to do the good thing, he said.\n\nSimilar sentiments were echoed by Mrs Olica Kaira from the Ministry of Primary and Secondary Education.\n\nWe have seen a lot of progress and improvement amongst a number of our wayward pupils who have gone through your Gota/Nhanga/Ixhiba Amai. As a Ministry, we appreciate you. We are also happy Amai on the re-entry policy for former street kids moreso those in Mbare and Chambuta, they are doing very well. Amai as a Ministry we are there to support your vision of seeing every child accessing education despite circumstances. We appreciate all the philanthropy you are doing in support of the heritage-based curriculum. Amai you are also looking at issues of equity, where the urban and rural divide is somehow bridged, the most disadvantaged, the most vulnerable, you reach out to them.\n\nAnd Your Excellency, I do attest that Unicef is an all-weather friend to the Government of Zimbabwe. They do assist the Ministry of Primary and Secondary Education. We also look at issues of inclusivity, where everyone is brought on board, just like Her Excellencys philanthropic work, where no one is left behind, no place is left behind, and no child is left behind. Yes, we have our challenges, but we have our success stories as the ministry. Another strategy and intervention amongst the challenges that the ministry has, Your Excellency, is the embracing and adoption of the early warning system, she said.\n\nMrs Kaira said the early warning system was adopted following the realisation that several secondary girls were dropping out of school due to issues like teenage pregnancy and early marriages.\n\nWe now have the system in place we have the handbooks, and we have piloted the project in 104 secondary schools. We are now reaching out, scaling out to quite several secondary schools. And from the 104, we did realise some successes, we noted that the girls were returning to school through the early warning system intervention, and because of that indicator, we are saying we will continue with that, she said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/FL1-2.jpg",
            "description": "Tendai Rupapa, Senior Reporter NEWLY-APPOINTED Unicef representative in Zimbabwe Mrs Etona Ekole, the organisation’s Chief of HIV/Aids Adolescents youth and gender, and Government officials drawn from several ministries yesterday paid a courtesy call on First Lady Dr Auxillia Mnangagwa where they had heart-to-heart discussions on a wide range of issues concerning children, including prospects for […]",
            "time": "08:26",
            "date": "12 Feb 2025"
        },
        {
            "title": "Zim unveils measures to boost formal business environment",
            "url": "https://www.herald.co.zw/zim-unveils-measures-to-boost-formal-business-environment/",
            "content": "Mukudzei Chingwere, Herald Reporter\n\nCabinet has approved various measures aimed at tackling challenges in the formal business environment and supporting micro, small, and medium enterprises (MSMEs), Information, Publicity and Broadcasting Services Minister, Dr Jenfan Muswere, said after yesterdays Cabinet meeting.\n\nThe Cabinet aims to bring all businesses into the tax bracket and enhance the effectiveness of the foreign exchange market to strengthen the economy.\n\nDr Muswere said the measures encompass immediate actions and long-term strategies designed to streamline operations and improve the business climate.\n\nThe Government seeks to bring all businesses into the tax bracket and enhance the effectiveness of the foreign exchange market.\n\nIn the long-term, Government will address the business environment in order to streamline fees, charges and minimise duplication of work by Government agencies as well as improve electricity supply. Such an environment will enable MSMEs to graduate into formal businesses, said Dr Muswere.\n\nAll businesses will be required to use electronic money, supported by a new compulsory tax payment system to ensure compliance among taxpayers.\n\nA team will be established to ensure tax compliance within the informal sector, with vendor licensing requiring consultation with the central Government.\n\nVendors will be required to obtain Point-of-Sale (POS) machines and open bank accounts upon registration and licensing. Enhancements to the foreign exchange system will reduce the foreign currency retention level for exporters from 75 percent to 70 percent and lower bank charges.\n\nMedium-term measures will focus on lowering the cost of doing business by reducing fees and minimising duplication of work by government agencies.\n\nDr Muswere said strict adherence to the Indigenisation and Empowerment Act will be enforced, promoting local procurement to support the local industry.\n\nGovernment plans to expedite the construction of power plants and upgrade distribution networks to enhance electricity availability.\n\nMeasures will include establishing designated workspaces, creating a favourable regulatory environment, and simplifying taxes and rates.\n\nDr Muswere emphasised that the measures are part of a broader vision to create a robust and resilient economy that supports all sectors, particularly MSMEs, which are vital for job creation and economic growth.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/08/Dr-Jenfan-Muswere.jpg",
            "description": "Mukudzei Chingwere, Herald Reporter Cabinet has approved various measures aimed at tackling challenges in the formal business environment and supporting micro, small, and medium enterprises (MSMEs), Information, Publicity and Broadcasting Services Minister, Dr Jenfan Muswere, said after yesterday’s Cabinet meeting. The Cabinet aims to bring all businesses into the tax bracket and enhance the effectiveness […]",
            "time": "08:26",
            "date": "12 Feb 2025"
        },
        {
            "title": "EDITORIAL COMMENT: New Mbare market needs to be crime-free",
            "url": "https://www.herald.co.zw/editorial-comment-new-mbare-market-needs-to-be-crime-free/",
            "content": "As can have been expected, those running mafia style protection rackets in Mbare are already latching onto the traders who lost almost everything in last years major fire and will soon be moving into a properly-built temporary market while the new giant shelter is being constructed.\n\nThese space barons running the protection racket are demanding US$10 from traders to get them on the allocation list, and as up to 2 000 traders will be accommodated in the temporary market, the final number depending on how much space each trader needs, the criminals are looking at US$20 000, if their schemes mature.\n\nThat is an incredible sum of money and highlights the corruption that has bedevilled Harare City Council for some years, that the space barons can at least get people to think that they can control how councillors and council staff will allocate the spaces for traders. We know that in both legal and illegal markets, this has happened in the past and is still going on in some markets to this day.\n\nFortunately the Government, which has already fulfilled its promises to have the burned down market reopened in temporary premises, is aware of what is going on. When a team of Ministers visited the new temporary market, now 99 percent complete with its ablution and administration facilities, and so about to open, they made it clear that they would be vetting the whole process and making sure that real traders were allocated stalls and that the names would be published in the press, so everyone knew.\n\nWhile Harare City Council is drawing up the lists, Government officials are standing behind them, making sure that the allocations are done properly on the laid down criteria, which do not include bribes to councillors, council officials or the local criminal gangs.\n\nThe Government wants the whole process to be totally transparent, that is conducted in the open and using the previously agreed criteria, so that those who are supposed to benefit, the traders whose stalls and the stock they held was destroyed in the fire, can get back into business and earn their living.\n\nEven the temporary traders market is a considerable advance on what burned down, and now that it is finished, work can start on the new main market, on the old site, which will be a three-storey structure capable of accommodating up to 10 000 traders, again depending on how large a stall each trader wants.\n\nBut even the smaller temporary market maintains Mbares dominance of a large chunk of the informal sector and allows the careful conversion of these traders into formalised businesses.\n\nWe would hope that a simple system of market fees and taxes will be introduced, preferably using a small joint daily payment that is affordable, but which brings the traders into the formal system.\n\nThe markets, both the temporary market and when operating the new market, will need far better policing to make sure that criminals cannot gain a foothold.\n\nSeveral traders have made it clear that they want a system that when some outsider, who is not on the list, comes forward to try and grab an allocated stall or demand a protection money payment, they can simply make the report and watch the criminal disappear in handcuffs.\n\nAt the same time it would be useful if the police could track down those already operating and demanding US$10 payments and take them into custody as well, dampening the enthusiasm some have for living off the hard work of others.\n\nThe attempt to get payments from people who will in any case be allocated stalls, and then if the traders fears are justified, and they have seen this before, going round the stalls and demanding further protection money must now be stopped permanently.\n\nThis is how organised crime operates.\n\nThe criminals make both promises and threats, promises that they can corrupt officials and threats that something will happen to the stall and the stock if they are not paid off.\n\nWe are about to see up to 2 000 honest people being allocated stalls in a defined single building, the temporary market, with adequate ablutions and a proper administrative centre, so we have opened a new chapter in just how this sort of market can operate. Everything can be on record, and remember the names of the allocated traders will be published.\n\nAt the same time we can have a simple, clean and effective administration that keeps the criminals out, and the Government may well have to maintain some sort of presence to make sure the council has such an administration.\n\nThe fire, in many ways, created a clean slate and President Mnangagwa, in the declaration of disaster after the fire, thus allowing the Government to take action in what would otherwise be a pure municipal affair, made it clear that he wants something that fits into the Vision2030.\n\nHe does not want a reconstruction of a colonial or early independence market, and certainly excluding the criminal gangs that have grown up over the last couple of decades, backed by corruption in the city council.\n\nThe temporary market is already a major advance, and we think it could probably be converted into perhaps a bulk market after the new permanent three-storey market is complete. But a lot will depend on having a proper administration and security, which has been missing at council facilities in the past, and this must be in place as the traders move in so the criminals can be excluded, forever.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Mbare.jpg",
            "description": "As can have been expected, those running mafia style protection rackets in Mbare are already latching onto the traders who lost almost everything in last year’s major fire and will soon be moving into a properly-built temporary market while the new giant shelter is being constructed. These “space barons” running the protection racket are demanding […]",
            "time": "08:26",
            "date": "12 Feb 2025"
        },
        {
            "title": "2024 foreign currency receipts top US$13bn",
            "url": "https://www.herald.co.zw/2024-foreign-currency-receipts-top-us13bn/",
            "content": "Business Reporter\n\nZimbabwes foreign currency inflows grew by 21 percent to US$13,3 billion in 2024 compared to US$11 billion in 2023, largely driven by growth in export proceeds.\n\nAccording to the Reserve Bank of Zimbabwe (RBZ) 2025 Monetary Policy Statement (MPS), export receipts at US$7,9 billion contributed 59,2 percent to total inflows, followed by diaspora remittances at US$2,2 billion, representing a 16 percent contribution.\n\nThe central bank noted that merchandise exports totalled US$7,9 billion in 2024, driven by gold and tobacco exports.\n\nIt said mineral exports, which constituted the largest share of merchandise exports, grew by 7,8 percent, from US$5,4 billion in 2023 to US$5,9 billion in 2024.\n\nGold exports recorded a remarkable growth of 37 percent to US$2,5 billion in 2024, from US$1,8 billion in 2023, amid strong global prices.\n\nThis was largely driven by both higher production volumes and favourable global gold prices.\n\nGold purchases by Fidelity Gold Refiners (Private) Limited (FGR) increased from 30,1 tonnes in 2023 to 36,5 tonnes in 2024, representing a 21 percent growth, the RBZ said.\n\nGold prices remained buoyant in 2024, reaching a peak of US$2 700 per ounce in October 2024, and the uptick in gold prices reflected heightened geopolitical tensions, sustained demand from central banks, and the onset of United States monetary policy easing.\n\nCentral banks in emerging markets and developing economies (EMDEs) increased their gold holdings in 2024 as they diversified their international reserve portfolios away from the dollar.\n\nContinued safe-haven demand for gold, on the back of geopolitical tensions and financial and policy uncertainties, will likely sustain the higher gold prices in the near term, reads part of the MPS.\n\nAccording to Equity Axis, in 2024, Zimbabwes gold production surged to 36,47 tonnes, up from 31 tonnes the previous year, marking the highest output on record.\n\nIt said the increase was driven by favourable gold prices, enhanced pricing strategies from Fidelity, the proliferation of gold buying centres nationwide, and Government initiatives aimed at formalising the informal sector.\n\nThese factors collectively contributed to a more robust and structured gold market, positioning Zimbabwe for improved revenue generation in the mining sector, the firm said.\n\nIn 2025, the Government is targeting to produce 40 tonnes of gold. However, the central bank said the improved foreign currency inflows resulted in improved current account performance.\n\nIt said preliminary estimates indicate that the current account recorded a surplus of US$501,2 million in 2024, representing a significant improvement from a surplus of US$133,9 million recorded in 2023.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Month-on-month-inflation.jpg",
            "description": "Business Reporter Zimbabwe’s foreign currency inflows grew by 21 percent to US$13,3 billion in 2024 compared to US$11 billion in 2023, largely driven by growth in export proceeds. According to the Reserve Bank of Zimbabwe (RBZ) 2025 Monetary Policy Statement (MPS), export receipts at US$7,9 billion contributed 59,2 percent to total inflows, followed by diaspora […]",
            "time": "08:26",
            "date": "12 Feb 2025"
        },
        {
            "title": "Celebrating the life, legacy of Tarumbwa, a surgical pioneer",
            "url": "https://www.herald.co.zw/celebrating-the-life-legacy-of-tarumbwa-a-surgical-pioneer/",
            "content": "Rumbidzayi Zinyuke, Senior Health Reporter\n\nZimbabwe has lost one of its most distinguished medical pioneers, Mr Chad Chandisaita Tarumbwa, who died at United Bulawayo Hospitals on Sunday, following complications from diabetes mellitus.\n\nMr T, as he was affectionately known, was a trailblazing surgeon whose contributions over four decades left an indelible mark on the countrys healthcare system.\n\nHe was among the first Zimbabwean surgeons to break barriers in the medical field, training and mentoring generations of doctors while championing advancements in surgical procedures.\n\nHealth and Child Care Secretary Dr Aspect Maunganidze said Mr Tarumbwa opened the doors for many doctors to the field of surgery.\n\nHe left an indelible mark on the medical and surgical landscape and touched the lives of many people in our nation, patients and colleagues alike. He will always be remembered as one who was not shy to defend and push for the cause of his profession. We truly mourn a giant of our era, whose works will always be there for all to see and the nation to benefit, he said.\n\nBorn on September 2, 1951 in Highfield, Harare (then Salisbury), Mr Tarumbwas journey was one of brilliance, determination, and service.\n\nHe began his education in Highfield, where his academic prowess quickly became evident. His exceptional abilities earned him a place at St Augustines Mission (kwaTsambe) for high school, where he continued to excel.\n\nIn 1972, he embarked on his medical career, enrolling in the Bachelor of Medicine and Bachelor of Surgery programme at the then University of Rhodesia.\n\nAfter completing his undergraduate medical training in 1976, Mr Tarumbwa undertook his housemanship at Mpilo Central Hospital in Bulawayo in 1977.\n\nIt was here where his passion for surgery took root.\n\nDetermined to further his expertise, he pursued postgraduate training in general surgery with the Royal College of Surgeons (UK) while continuing to serve at Mpilo. His dedication led him to the United Kingdom, where he completed his training and, in 1985, became a Fellow of the Royal College of Surgeons and Physicians of Glasgow, a testament to his skill and commitment.\n\nUpon his return to Bulawayo, Mr Tarumbwa began offering his expertise as a consultant surgeon, a role he assumed on October 17, 1985.\n\nHe was one of the first two black consultants in general surgery at Mpilo Central Hospital, breaking barriers and paving the way for future generations.\n\nFor over 35 years, he selflessly served the people of in the southern part of Zimbabwe, earning a reputation as a brilliant, hard working, and compassionate surgeon.\n\nBeyond his clinical work, Mr Tarumbwa was a dedicated educator. While employed by the Ministry of Health and Child Care, he generously contributed to the National University of Science and Technology (NUST) Medical School, shaping the minds of future doctors.\n\nHe also served as an external examiner for the Department of Surgical Sciences at the University of Zimbabwe, ensuring the highest standards of surgical education.\n\nMr Tarumbwas leadership extended far beyond the operating theatre. He was a founding member of the Surgical Society of Zimbabwe in 1994 and served as president of the Zimbabwe Medical Association (ZiMA) from 1993 to 1995, a distinction he shares with only one other surgeon, Mr Bonnie Mauchaza.\n\nHis visionary leadership was instrumental in drafting surgical and medical tariffs during his tenure as head of the National Tariffs Liaison Committee of ZiMA. Additionally, he was a Fellow of the College of Surgeons of East, Central, and Southern Africa, further solidifying his standing as a respected figure in the field. In recognition of his long and exceptional service to the nation, the Surgical Society of Zimbabwe awarded Mr Tarumbwa an Excellence in Leadership Award on July 19 last year.\n\nTo the Surgical Society of Zimbabwe, Mr Tarumbwa was more than a colleague; he was a larger-than-life figure whose wisdom, humour, and camaraderie enriched every interaction. His presence was a source of inspiration, and his departure leaves a void that will be deeply felt by all who had the privilege of knowing him.\n\nAs we mourn the loss of this extraordinary individual, we extend our deepest condolences to his family, friends, and all who were touched by his life. May his legacy continue to inspire us, and may his soul rest in eternal peace, said the Surgical Society of Zimbabwe in a statement.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Mr-Tarumbwa.jpg",
            "description": "Rumbidzayi Zinyuke, Senior Health Reporter Zimbabwe has lost one of its most distinguished medical pioneers, Mr Chad Chandisaita Tarumbwa, who died at United Bulawayo Hospitals on Sunday, following complications from diabetes mellitus. Mr T, as he was affectionately known, was a trailblazing surgeon whose contributions over four decades left an indelible mark on the country’s […]",
            "time": "08:26",
            "date": "12 Feb 2025"
        },
        {
            "title": "Master H, Capleton collaboration shakes industry",
            "url": "https://www.herald.co.zw/master-h-capleton-collaboration-shakes-industry/",
            "content": "Trust Khosa\n\nZim dancehall sensation Master H is making waves on the music landscape after releasing a trailer for his upcoming video featuring Capleton.\n\nThe hardworking chanter, who had a successful 2024, shows no signs of slowing down as he continues to receive rave reviews.\n\nCurrently in Kingston, Jamaica, he is collaborating with Capleton on an exciting new project. Although he has yet to reveal the title of the single, he has assured fans through his social media handles that something special is brewing between him and King Shango.\n\nBorn Hillary Marufu, the Chitungwiza-based chanter has been sharing pictures with top Jamaican stars ever since he jetted into the Caribbean last week for a series of shows and engagements with fans.\n\nIn one of the pictures, he was following proceedings at Bob Marleys belated 80th birthday celebration. Marley was born on February 6, 1945, and died on May 11, 1981.\n\nTo show his love for Jamaican music pacesetters, a picture alongside dub-poet Mutabaruka has gone viral.\n\nAlongside Mutabaruka at the 80th earthstrong celebration at the Bob Marley Museum in Kingston, Jamaica, reads the appreciation post.\n\nHe also shared another picture with Luciano, who has a soft spot for Zimbabwe.\n\nLuciano has visited Zimbabwe on two occasions.\n\nIn another post on February 7 in a pub, Master H conceded that he was learning from the best. What an amazing experience at original dancehall Thursday appearance, said Master H in appreciation of Jamaicas rich musical background.\n\nHowever, it was his post with Capleton that sent social media into overdrive.\n\nMaster H hinted that something new was coming between them, and the pairs promotional video is trending.\n\nStar FM presenter Milton DJ Knife Nyabanda was blown away by the chanters ascendancy.\n\nGood going, king, posted Nyabanda.\n\nZimbabwe trap musician and rapper King 98 hailed Master H in his appreciation post, which reads: ZIMBOLIC Movement!\n\nPopular club wheel-spinner Selekta Base was impressed by Master Hs costumes, simply commenting: Outfit.\n\nAnother fan praised Master Hs manager, Mpondasugar, for a sterling journey with the post: Mponda Sugar kwauri ikoko pihwa drink ndouya ndichibhadhara. (Can someone spoil you there? I will refund yiu.)\n\nThe hardworking chanter, who had a successful 2024 season, is the epitome of hard work, judging by his recent endorsements.\n\nLast year alone, he featured at high-profile events, including Chibuku Road To Fame, Castle Tankard, and Doek & Slay, among others.\n\nFor those who have been following him, it was no surprise that he managed to land a collaboration with Capleton. Several local artists have struggled to achieve that feat.\n\nInternational artists of Capletons calibre might be humble and forthcoming, but they dont collaborate with just anyone.\n\nMaster Hs achievement is good news for Zim dancehall, showing that hard work, focus, and dedication pay off.\n\nFor a humble lad like Master H to be hanging around with Jamaicas big names is a plus for the creative sector, proving that its never too late to reinvent the wheel.\n\nHis rare feat will go a long way in inspiring other local chanters that they can easily make it to the top with hard work.\n\nCredit also goes to local arts promoters who have given local chanters the exposure to express themselves.\n\nAlthough dancehall is a borrowed genre that has remained Zim dancehall on home soil, it is never too late for locals to learn from the pioneers of the genre.\n\nFor Master H, he has done the right thing by visiting Jamaica to experience the genre with its rightful owners.\n\nLearning from the source is the best thing that Master H has ever done in his career.\n\nAfter landing this collaboration with Capleton, theres no doubt his name will be heard in the Caribbean and even beyond.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2012/11/capletonjudgement.jpg",
            "description": "Trust Khosa Zim dancehall sensation Master H is making waves on the music landscape after releasing a trailer for his upcoming video featuring Capleton. The hardworking chanter, who had a successful 2024, shows no signs of slowing down as he continues to receive rave reviews. Currently in Kingston, Jamaica, he is collaborating with Capleton on […]",
            "time": "08:26",
            "date": "12 Feb 2025"
        }
    ]
}