{
    "news": [
        {
            "title": "DRC crisis: Joint Sadc, EAC summit called",
            "url": "https://www.herald.co.zw/drc-crisis-joint-sadc-eac-summit-called/",
            "content": "Ivan Zhakata and Wallace Ruzvidzo\n\nSADC has called for an immediate joint summit with the East African Community (EAC) to address the escalating security situation in the Democratic Republic of Congo (DRC).\n\nThis follows a proposal by the 24th Extraordinary Summit of EAC Heads of State held on January 29, 2025, signalling a renewed push for regional collaboration to tackle the instability in eastern DRC.\n\nThe SADC Extraordinary Summit, convened in Harare and chaired by President Mnangagwa yesterday, underscored the need for collective engagement to find a sustainable solution to the conflict.\n\nAnnouncing the agreed course of action in a communiqu, SADC executive secretary Mr Elias Magosi, said the regional bloc was dedicated to peace efforts.\n\nSummit called for an immediate joint Summit of SADC and East African Community (EAC) to deliberate on the way forward regarding the security situation in the DRC as proposed by the 24th Extraordinary Summit of Heads of State of the EAC held on 29th January 2025, he said. As part of its resolutions, the summit mandated the SADC Organ Troika on Politics, Defence and Security Cooperation to intensify diplomatic engagement with all State and non-State actors involved in the conflict.\n\nMr Magosi said ceasefire efforts were of paramount importance.\n\nSummit mandated the SADC Organ Troika on Politics, Defence and Security Cooperation to engage all State and non-State parties to the conflict on a ceasefire process to protect lives and facilitate a smooth flow of humanitarian support to people and communities affected by the armed conflict, he said.\n\nSadc Chairperson President Mnangagwa is joined by fellow leaders for a photo session yesterday\n\nMr Magosi said the summit called for a coordinated approach and urged all political and diplomatic leaders involved in the conflict to engage meaningfully in dialogue.\n\nHe reaffirmed SADCs support for existing peace initiatives.\n\nSummit urged political and diplomatic leaders, who are parties to the conflict, to engage in a coordinated effort of dialogue, including supporting the Luanda Process, MONUSCO and others, to restore peace and security in Eastern DRC.\n\nSADC leaders also reaffirmed their commitment to the DRCs sovereignty, territorial integrity, and long-term stability, pledging ongoing support for its development and security.\n\nSummit reaffirmed its solidarity and unwavering commitment to continue supporting the DRC in its pursuit of safeguarding its independence, sovereignty, and territorial integrity, as well as sustainable peace, security and development, Mr Magosi said.\n\nThe summit commended troops deployed under the SADC Mission in DRC (SAMIDRC) for their dedication and resilience in peacekeeping operations.\n\nSummit expressed solidarity with the DRC and extended its appreciation to the men and women deployed in the SAMIDRC for their dedication, resilience and service to the preservation of peace and security in the region, Mr Magosi said.\n\nRecognising humanitarian efforts, the summit also praised Madagascar for pledging medical support to injured and displaced civilians in the conflict zone.\n\nSadc Chairperson President Mnangagwa, flanked by the regional blocs Executive Secretary Mr Elias Magosi (right) and Foreign Affairs and International Trade Minister Professor Amon Murwira (left) join other delegates in observing a moment of silence in honour of soldiers who lost their lives in Eastern DRC, recently during the Extraordinary Summit of Heads of State and Government regarding the security situation in the eastern Democratic Republic of Congo (DRC) at the New Parliament Building in Mt Hampden yesterday\n\nThe summit further acknowledged the expression of gratitude from DRC President Flix Tshisekedi, who thanked SADC for its continued support.\n\nAdditionally, Tanzanian President Samia Suluhu Hassan, as chairperson of the SADC Organ on Politics, Defence, and Security Cooperation, was commended for her leadership in regional peace and security matters.\n\nThe summit also congratulated Mozambiques newly elected President Daniel Francisco Chapo, on his election and welcomed his participation in SADCs leadership.\n\nIt also thanked President Mnangagwa for convening the Extraordinary SADC Summit and promoting regional cooperation towards peace and stability.\n\nThe SADC Chairperson expressed gratitude to the Heads of State and Government for attending the Summit and for their commitment and cooperation, Mr Magosi said.\n\nIn his closing remarks, President Mnangagwa said he was confident that the concrete decisions adopted yesterday would go a long way in propelling peace efforts.\n\nI am confident that the concrete decisions adopted today will further propel the ongoing joint efforts to find lasting solutions to restore peace and normalcy in the Eastern Democratic Republic of Congo.\n\nUndoubtedly, consolidating solidarity and attaining our common destiny remains a top priority for our region.\n\nThese principles underpin the commitments we made today and are indeed the solid basis upon which the goals we have set for ourselves, will be actioned, he said.\n\nMadagascars President Andry Rajoelina arrives at the new Parliament Building yesterday in the company of National Housing and Social Amenities Minister Zhemu Soda (right) and the Minister of Foreign Affairs and International Trade Professor Amon Murwira (second from left)\n\nAs masters of their own destiny, the President said SADC member states must pull out all the stops to ensure the region and Africa at large play their part on the global stage.\n\nIt is the individual and collective duty of all member states to do much more towards permanently silencing the guns if we are to succeed in achieving these aspirations.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/HE1.jpg",
            "description": "Ivan Zhakata and Wallace Ruzvidzo SADC has called for an immediate joint summit with the East African Community (EAC) to address the escalating security situation in the Democratic Republic of Congo (DRC). This follows a proposal by the 24th Extraordinary Summit of EAC Heads of State held on January 29, 2025, signalling a renewed push […]",
            "time": "08:24",
            "date": "01 Feb 2025"
        },
        {
            "title": "Peace, security shared responsibilities: President",
            "url": "https://www.herald.co.zw/peace-security-shared-responsibilities-president/",
            "content": "Wallace Ruzvidzo, Herald Reporter\n\nSADC stands ready to intensify efforts to protect its citizens from all forms of instability, and ensure lasting peace in the eastern Democratic Republic of Congo (DRC), the regional blocs Chairman, President Mnangagwa, has said.\n\nIn the aftermath of the DRC instability, which has displaced millions and resulted in the death of hundreds of people, including peacekeeping forces and civilians, SADC Heads of State and Government yesterday converged in Harare for an Extraordinary Summit to tackle the deteriorating situation in DRC.\n\nAmong those in attendance were Presidents Samia Suluhu Hassan (Tanzania), Cyril Ramaphosa (South Africa), Daniel Chapo (Mozambique), Duma Boko (Botswana), and Andry Rajoelina (Madagascar) while Felix Tshisekedi (DRC) and Hakainde Hichilema (Zambia) attended virtually.\n\nLesotho Prime Minister Sam Matekane was also in attendance.\n\nIn his opening remarks, President Mnangagwa said regional peace and security were shared responsibilities, hence all member states should join hands in ensuring lasting peace in eastern DRC.\n\nMore, he said, must be done to alleviate the situation, which recently claimed 16 soldiers from South African National Defence Force (SANDF) and Malawi, who form part of the SADC Mission in the DRC (SAMIDRC).\n\nAmong those peacekeeping forces are soldiers from the UN mission in Congo (MONUSCO).\n\nPresident Mnangagwa noted with regret that since an Extraordinary Summit that was held in Harare in November last year, very little progress has been made in our search for lasting peace in the eastern DRC, which is now characterised by escalating hostilities and conflict.\n\nThis culminated in the unfortunate and atrocious attacks carried out on our Mission in Goma, that claimed the lives of several SAMIDRC and MONUSCO peacekeepers, while others sustained serious injuries.\n\nThe people of the eastern DRC have suffered for far too long. SADC condemns in the strongest terms the attacks by aggressor forces. While we pause to mourn our loss, our resolve to ensure collective security cannot be shaken, he said.\n\nPresident Mnangagwa said it was important that dialogue and peace building are boldly pursued to achieve the intended result of peace for the benefit of the people of the Eastern DRC.\n\nTo this end, our region stands ready to intensify efforts to protect the SADC citizens from all forms of instability, in line with the SADC Mutual Defence Pact. The peace and security of our region is a shared obligation.\n\nOur political-will must be strengthened towards a concrete and actionable roadmap that will help accelerate the realisation of peace in the Eastern DRC, he said.\n\nMay we, as Member States, continue to do all we can to support our gallant men and women in the theatre of operations, and ensure that SAMIDRC achieves its important objective.\n\nThe SADC Chairman said the plight of millions of internally displaced populations cannot and should not be ignored.\n\nAs we deliberate on our firm and united response, let us not overlook the humanitarian crises stemming from the prevailing armed conflict in Eastern DRC.\n\nSADC appreciates the support rendered by International Co-operating Partners, in response to the critical needs of the displaced populations, he said.\n\nPresident Mnangagwa conveyed the regional blocs condolences to Member States and families who lost their loved ones in service.\n\nOn behalf of SADC, the Government and people of the Republic of Zimbabwe and indeed on my own behalf, I wish to convey our heartfelt condolences and deepest sympathies to the Member States and families of the brave men and women who lost their lives in the service of the people of DRC, the SADC region and indeed the cause of continental and world peace.\n\nOur condolences also extend to the families of the non-combatant victims who have lost their lives as a result of this conflict. May the souls of the departed rest in eternal peace, he said.\n\nPresident Mnangagwa commended the Heads of State for showing up at the meeting at short notice.\n\nHe also lauded the SADC Troika for convening to deliberate on the security situation in the DRC before the Extraordinary Summit.\n\nI thank you all for taking time to attend this meeting, which was convened on short notice. We meet today, to seek lasting solutions to the challenges faced in the Eastern DRC. I commend the contributions made by fellow Member States and the SADC Secretariat in ensuring our collective security.\n\nI wish to thank the Chairperson of the SADC Troika, Her Excellency, President Samia Hassan and the other members of the Troika as well as Troop Contributing Countries for having convened in Dar es Salaam to deliberate on this very important matter, he said.\n\nThe SADC Chair welcomed the recently inaugurated Mozambiques President Chapo, who was attending the regional bloc gathering for the first time since assuming office.\n\nI extend a special revolutionary welcome to His Excellency, Cde Daniel Francisco Chapo, the President of the Republic of Mozambique.\n\nAs a region, we look forward to working with him in enhancing regional peace, security and integration as well as our collective development agenda, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/President-Mnangagwa.jpg",
            "description": "Wallace Ruzvidzo, Herald Reporter SADC stands ready to intensify efforts to protect its citizens from all forms of instability, and ensure lasting peace in the eastern Democratic Republic of Congo (DRC), the regional bloc’s Chairman, President Mnangagwa, has said. In the aftermath of the DRC instability, which has displaced millions and resulted in the death […]",
            "time": "08:24",
            "date": "01 Feb 2025"
        },
        {
            "title": "New age limit for bus, kombi drivers gazetted",
            "url": "https://www.herald.co.zw/new-age-limit-for-bus-kombi-drivers-gazetted/",
            "content": "Freeman Razemba, Senior Reporter\n\nThe Government has gazetted the age requirement for public service vehicles at 30 years and above in a move aimed at addressing the rising number of fatal accidents and recklessness on the roads.\n\nThe change takes place with immediate effect.\n\nThe decision to increase the minimum age from 25 to 30 seeks to ensure that only mature and experienced drivers operate public service vehicles.\n\nThis development comes as Zimbabwe records over 2 000 road traffic-related deaths annually, with negligent driving identified as a leading cause.\n\nIn a Government Gazette published yesterday, Transport and Infrastructural Development Minister Felix Mhona confirmed the new regulations, which state that drivers must have a minimum of five years experience to qualify to operate public service vehicles.\n\nIt is hereby notified that the Minister of Transport and Infrastructural Development has, in terms of section 81 of the Road Traffic Act [Chapter 13:11], made the following regulations . . .  the Gazette reads.\n\nThe updated requirements state that no individual may operate a passenger public service vehicle unless they are at least 30-years-old and have a minimum of five years of driving experience.\n\nExisting drivers aged between 25 and 30 who were already authorised to drive prior to this regulation will be allowed to continue.\n\nLast year, Minister Mhona told the National Assembly that bus and kombi drivers will have to be aged 30 and above, in move meant to tackle the rising number of traffic accidents and fatalities, largely attributed to reckless driving.\n\nBy increasing the minimum age, the Government hopes to ensure that only mature and experienced drivers are behind the wheel of public service vehicles.\n\nThe new age requirement aligns with regional practices where the minimum age is 30 years for public service vehicles.\n\nThis latest development has been welcomed by transport operators, who see it as a necessary step towards improving road safety.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/06/Mhona.jpg",
            "description": "Freeman Razemba, Senior Reporter The Government has gazetted the age requirement for public service vehicles at 30 years and above in a move aimed at addressing the rising number of fatal accidents and recklessness on the roads. The change takes place with immediate effect. The decision to increase the minimum age from 25 to 30 […]",
            "time": "08:24",
            "date": "01 Feb 2025"
        },
        {
            "title": "Ridigita Prison Farm a beacon of hope",
            "url": "https://www.herald.co.zw/ridigita-prison-farm-a-beacon-of-hope/",
            "content": "Precious Manomano, Herald Reporter\n\nIn a world grappling with food insecurity, solutions often come from unexpected sources, and the Ridigita Prison Farm in Mashonaland East stands as a powerful testament to the transformative potential of agriculture and rehabilitation.\n\nRecently, the Government commended the Zimbabwe Prisons and Correctional Service (ZPCS) garnered for its substantial contributions to national food security through exemplary initiative such as the Ridigita Prison Farm.\n\nJustice, Legal and Parliamentary Affairs Minister Ziyambi Ziyambi visited the 150-hectare maize field at Ridigita Prison Farm and expressed his admiration for the good work the ZPCS was doing at its farm.\n\nWhen I arrived here, I was profoundly impressed by what I saw, he said. The prisoners didnt complain about lacking equipment or resources. Instead, they said, we cant waste this season; lets plant. This positive attitude is truly inspiring, said Minister Ziyambi.\n\nThe 150 hectare maize crop at Ridigita was planted manually showing a commitment to hard work and determination.\n\nDespite the absence of modern machinery, the ZPCS hopes for good yields with 70 hectares of the crop already reaching the tasselling stage while 30 hectares are in the vegetative phase.\n\nFrom this crop, we are expecting at least five tonnes per hectare, Minister Ziyambi noted, highlighting the potential impact of this initiative on national food supplies.\n\nThe significance of Ridigita Prison Farm extends beyond mere agricultural production.\n\nIt represents a holistic approach to rehabilitation, where inmates are engaged in meaningful work that equips them with essential skills for life after prison.\n\nMinister Ziyambi emphasised this dual purpose.\n\nWe are not only focusing on food security but also on empowering these inmates. The correctional officers are doing a commendable job in imparting skills to our inmates, ensuring they can contribute to our food security as productive farmers upon their release, he said.\n\nMinister Ziyambi told the gathering that the work being done at Ridigita had received the endorsement of the highest office in the land.\n\nHis Excellency has commended the work you are doing here. We are advocating for more visits to showcase your accomplishments. You have made us proud, he remarked, recognising the broader implications of the farms productivity.\n\nCommissioner George Sibanda, the ZPCS Officer Commanding Mashonaland East, reiterated the organisations commitment to enhancing food security in Zimbabwe through initiatives like Ridigita Prison Farm.\n\nWe are working diligently to improve the countrys food situation and teach life skills to our inmates. This approach is vital for their reintegration into society, he stated.\n\nThe prison farm exemplifies the potential of utilising available resources and human capital to tackle pressing food security challenges.\n\nBy transforming inmates into skilled agricultural workers, Ridigita Prison Farm is not just cultivating crops but sowing seeds for a more self-sufficient future for Zimbabwe.\n\nAs the world continues to face food shortages and economic challenges, the story of Ridigita Prison Farm serves as a beacon of hope.\n\nIt underscores the importance of resilience, innovation and community support in the pursuit of food security.\n\nWith continued investment and commitment from the Government and stakeholders, initiatives like the Ridigita Prison Farm can pave the way for a more sustainable and food-secure Zimbabwe, turning challenges into opportunities for growth and rehabilitation of convicted offenders.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Ridigita.jpg",
            "description": "Precious Manomano, Herald Reporter In a world grappling with food insecurity, solutions often come from unexpected sources, and the Ridigita Prison Farm in Mashonaland East stands as a powerful testament to the transformative potential of agriculture and rehabilitation. Recently, the Government commended the Zimbabwe Prisons and Correctional Service (ZPCS) garnered for its substantial contributions to […]",
            "time": "08:24",
            "date": "01 Feb 2025"
        },
        {
            "title": "Africa Chrome Field duty suspension extended",
            "url": "https://www.herald.co.zw/africa-chrome-field-duty-suspension-extended/",
            "content": "Farirai Machivenyika, Senior Reporter\n\nThe Government has extended the two-year duty-free fuel import facility for Africa Chrome Fields (ACF) for its energy projects that was supposed to end on December 31 last year to December 31, 2026.\n\nThis is contained in Statutory Instrument 6 of 2025 cited as the Customs and Excise (Suspension) (Amendment) Regulations, 2025 announced by Finance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube in an Extraordinary Government Gazette published this week in terms of the Customs and Excise Act.\n\nThe initial two-year period ran from January 1, 2023 to December 31, 2024 but will now end on December 31 next year following the gazetting of the extension.\n\nIt is hereby notified that the Minister of Finance, Economic Development and Investment Promotion has in terms of Section 235 as read with Section 120 of the Customs and Excise Act made the following regulations.\n\nThe Customs and Excise Suspension Regulations, 2003, published in SI 257 of 2003 are amended in section 9 B as follows- in subsection 2 by the deletion of the words 1st January 2023 to 21st January 2024 and substitution with the words 1st January 2025 to 21st January 2026; approved beneficiary of power generation projects eligible for suspension of duty, read the statutory instrument.\n\nThe facility will ringfence 13,95 million litres of diesel that the company can import duty-free.\n\nACF, which was granted national project status in 2016 and uses the diesel to power its electric arc furnaces at its smelting plant.\n\nThe firm is a leading chrome mining company in Zimbabwe and last year announced ambitious expansion plans as it seeks to gain up to 25 percent global market share for high-grade chrome concentrate by the end of 2026.\n\nOur goal is to position ACF as a major player in the global chrome industry, while setting Zimbabwe apart as the home of high-quality chrome concentrate, and helping to build its reputation for its resource capabilities, said Mr Zunaid Moti, ACF Chairman and Country Representative said then.\n\nACF currently operates six spiral wash plants across the Midlands Province in the Ngezi, Lalapanzi, and Chinyikwa areas.\n\nThe companys plants produce an average of 30,000 tonnes of high-grade chromium concentrate each month, which is used in the production of ferroalloy for high-grade stainless steels.\n\nIts operations contributed over US$40 million in revenue to Zimbabwes fiscus in 2024 alone.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/03/Minister-Mthuli-Ncube.jpg",
            "description": "Farirai Machivenyika, Senior Reporter The Government has extended the two-year duty-free fuel import facility for Africa Chrome Fields (ACF) for its energy projects that was supposed to end on December 31 last year to December 31, 2026. This is contained in Statutory Instrument 6 of 2025 cited as the Customs and Excise (Suspension) (Amendment) Regulations, […]",
            "time": "08:24",
            "date": "01 Feb 2025"
        },
        {
            "title": "Top UN official pays homage to First Lady",
            "url": "https://www.herald.co.zw/top-un-official-pays-homage-to-first-lady/",
            "content": "Tendai Rupapa, Senior Reporter\n\nUNAids country director Mr Henry Domisoni yesterday paid a courtesy call on Health Ambassador First Lady Dr Auxillia Mnangagwa at her offices in Harare where he conveyed his admiration for her sterling works in the health sector, saying as he begins his mandate, he intends to closely work with her.\n\nThe newly appointed UN country director also saluted the First Ladys efforts towards HIV prevention, eradicating gender-based violence and ensuring girls were kept in school to curb early marriages and engagement in activities that could lead to HIV infection.\n\nThe two also discussed a wide range of issues with the mother of the nation giving the UNAids country director insights into her work.\n\nDuring the meeting, Mr Domisoni unveiled a three-point strategy to reduce HIV infections among adolescent girls and young women.\n\nThey also looked at issues around gender-based violence and how it is a contributor to new HIV infections.\n\nAmai Mnangagwa welcomed the envisaged partnership.\n\nDuring the meeting, the First Lady emphasised the need for people to always get regular health checks for various ailments.\n\nShe also highlighted some of the programmes she is implementing including medical outreaches, in her quest to ensure that everyone gets access to quality healthcare services regardless of geographical locations.\n\nThe areas that I deal with as First Lady include advocacy for good health in the family. I am looking at the father, the mother, the boy child, the girl child and the unborn baby, the First Lady said.\n\nI work closely with the Ministry of Health and Child Care and the National Aids Council of Zimbabwe. I am happy to say that, as Zimbabwe, we have reached 95-95-95 goals in the fight against HIV/AIDS. So, we want to continue emphasising to people in society that they should keep on getting tested. I know some people are just moving around, but they do not know their status. So, as First Lady, I lead in ensuring that people get tested and know the ailments that they are living with so that they be placed on medication.\n\nAround the country, the mother of the nation said there are so many programmes that she has rolled out, not only in the health but also in other capacities.\n\nFor example, I work with women. I also have wellness in sports, which I look at all ages. Even the aged people, wherever they are, I always encourage them to be involved in at least one of the sports they can take part in so that they live a healthy life, she said.\n\nDr Mnangagwa also highlighted the life-transforming works that First Ladies were undertaking under the auspices of the Organisation of African First Ladies for Development (OAFLAD).\n\nWe also have a roundtable as First Ladies where we share what is happening in our countries. We also talk about health issues. HIV and Aids affect all countries and made First Ladies go on the front teaching and educating how dangerous any ailment is when not put through treatment. You know, there is this myth that people say in some areas that I am not feeling well because I was bewitched without visiting the clinic. We want to destroy that and encourage our people to visit hospitals for them to be accurately diagnosed and treated, she said.\n\nDr Mnangagwa also spoke at length about the National Human Papillomavirus (HPV) vaccination programme she rolled out countrywide, which benefitted over 800 000 girls aged between 10 and 14.\n\nWe managed to conduct an outreach programme throughout the country to give girls between the ages of 10 and 14 HPV vaccines and we covered a lot of them, over 800 000. It was widespread work that we all put our hands on the deck. So, this is a continuous programme, she said.\n\nDr Mnangagwa expressed dismay at mothers who despised breastfeeding despite its immense benefits to children.\n\nWe are also encouraging breastfeeding. Some of our young mothers do not breastfeed for a long time and introduce baby formulas to babies, but we are saying those are the early stages of a baby that is when he/she wants to be breastfed to have strong bones. Breast milk contains antibodies that help babies develop a strong immune system and protect them from illnesses. I also encourage women to go for ante-natal HIV testing to prevent the transmission of HIV to their unborn babies, she said.\n\nThe First Lady shed light on some of the programmes she has launched to ensure that children stay away from social vices.\n\nThese include Career Guidance, First Ladys Girls and Boys Camp and Gota/Nhanga/Ixhiba moral restoration programme.\n\nDuring these programmes, children are taught a lot of things including cultural norms and values, etiquette and basics that are expected of them.\n\nAmai Mnangagwa said she intends to take the programmes to her counterparts so that children in their countries also benefit.\n\nShe said she would invite Mr Domisoni to some of her outreach programmes.\n\nMr Domisoni expressed delight at the First Ladys long catalogue of nation-building projects.\n\nYour Excellency, let me start by thanking you more sincerely for giving us this opportunity I would like to introduce myself because I know you have been interacting with other UNAids country directors before I came and I thought in the same vein, it would be very nice to introduce myself to you, over and above all getting to appreciate how best we can collaborate.\n\nLet me also take this opportunity to appreciate the commendable work that you are doing Your Excellency. I have taken note of the commendable work that you are undertaking in health and beyond. Though our mandate is HIV, Dr Madzima (NAC CEO) will agree with me there is a saying actually that HIV is the one that is building the health system, so we would like to make that contribution to that bigger picture, so I know from your presentation Your Excellency that you are already working in some of the areas of our interest so in HIV you are already working with the children, women and even the men and we can also put in a broader sense that you are already working in social reproductive health and beyond that also looking at matters of gender-based violence.\n\nBefore I came, I did my research in terms of some of the work that you have contributed to health and the list is endless. I could not find where I could stop. But I did take note in the areas of particular interest that you have been working for the eradication of paediatric aids but over and above that you have also engaged with men in the area of trying to get rid of gender-based violence. As a starting point from our end, we thought maybe we could engage in one area for now and review that relationship as we go. We are also looking at adolescent girls and young people as the primary beneficiaries of our primary interest, he said.\n\nMr Domisoni said in targeting adolescent girls and young people, they were also going to target opinion leaders who they can work with to help curb that unbecoming behaviour.\n\nSo, we thought of working specifically addressing new HIV infections among adolescent girls and young women as a specific project and this is premised on the fact that we are seeing a lot more new infections among adolescent girls and young women. When we sat down and did our little homework, Your Excellency, we discovered that maybe we could employ three strategies. One, is where we are aligning with your ongoing work which is keeping girls in school at least for them to go back to secondary to complete secondary education and we believe through that initiative, it means they will not have the time to engage in other extra-curricular activities where they get infected and possibly end up as a statistic. The other area is gender-based violence. We believe that this is also a significant opportunity to curb HIV infections. The other area, we thought would be in the area of trying to stop early and forced marriages. I am aware, coming from this region, the southern African region, that in as much as we have made some headway, a lot more needs to be done because there are still communities out there which are giving out their young girls for marriage even before its time. We thought if we employ these three strategies, we could be in a position to address the challenge of HIV among adolescent girls and young women, he said.\n\nMr Domisoni was accompanied by officials from his office and NAC CEO Dr Bernard Madzima.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/FL.jpg",
            "description": "Tendai Rupapa, Senior Reporter UNAids country director Mr Henry Domisoni yesterday paid a courtesy call on Health Ambassador First Lady Dr Auxillia Mnangagwa at her offices in Harare where he conveyed his admiration for her sterling works in the health sector, saying as he begins his mandate, he intends to closely work with her. The […]",
            "time": "08:24",
            "date": "01 Feb 2025"
        },
        {
            "title": "EDITORIAL COMMENT: Time for all at ZIFA to put shoulders to the wheel",
            "url": "https://www.herald.co.zw/editorial-comment-time-for-all-at-zifa-to-put-shoulders-to-the-wheel/",
            "content": "SO, the much-awaited Zimbabwe Football Association (ZIFA) elections have come and gone, with Harare businessman and philanthropist Nqobile Magwizi emerging an overwhelming winner.\n\nMagwizi and members of his ZIFA executive committee have, since January 25, been mandated to administer association football in this country on a four-year term.\n\nAs has been widely reported, it was a ZIFA election like no other.\n\nAn election that attracted a record number of candidates across all portfolios.\n\nIt was an epoch election in which for the first time the ZIFA executive committee emerged with three women voted into office.\n\nThey will be four when the leader of the Womens Soccer League (WSL) comes on board in a similar arrangement that also sees the chairperson of the Premier Soccer League (PSL), automatically becoming a member of the ZIFA executive committee.\n\nPreviously only one woman sat on the ZIFA executive committee as an ordinary member and only by virtue of being the chairperson of the WSL.\n\nBut ZIFA, probably taking a cue from a FIFA mantra that was initiated during the Sepp Blatter era that: the future of football is feminine, also increased the size of the women delegates on the ZIFA Congress.\n\nNow women contribute 21 delegates to the ZIFA Congress marking a giant step in having their aspirations and programmes catered for and crucially there is a clause in the associations constitution which demands of the two vice-presidents, one of them must be a woman.\n\nThe dust has barely settled after what was, by all accounts, a bruising and contentious election for the leadership of the countrys flagship sport and yet a problem child for the Sports and Recreation Commission (SRC) and occasionally the Zimbabwe Olympic Committee (ZOC).\n\nIt was a bruising election that witnessed a number of side-shows in the build-up to January 25 and soon after.\n\nFrom candidates being barred by the ZIFA Electoral Committee pre-election ethics committee to allegations of vote-buying and political manoeuvring, the campaign period was anything but smooth.\n\nBut now that the polls are over, we believe every affiliate member of ZIFA, from the PSL, Womens League, Area Zones, Regions, provinces, Futsal to NAPH should quickly move from election mode.\n\nThere is a need to realise and acknowledge that while Magwizi is the leader of the ship, the election was not just about him but about Zimbabwean football.\n\nA new administration is in place and the time for wrangling and backroom deals is gone.\n\nIt is time to get back to what really matters  the business of football.\n\nFor months, the airwaves, boardrooms, and social media platforms have been dominated by discussions of eligibility, ethics, and endorsements rather than development plans, youth structures, and the national teams performances.\n\nThat must change immediately.\n\nThe challenges facing our domestic football are well-documented: underfunded grassroots programmes, inconsistent league structures, wavering sponsorship deals, and national teams struggling for consistency.\n\nThese are the real battles that need urgent attention and all these call for collective efforts by all of ZIFAs structures.\n\nRefreshingly, there are reports that the newly-elected leadership has been extending an olive branch to all stakeholders who are well-meaning to come and work together for the good of the game.\n\nMagwizi and his board have stressed that even those who backed rival candidates are part of the global ZIFA family.\n\nZimbabwean football has been too fractured for many years at the expense of meaningful growth.\n\nThe game cannot afford continued divisions; the sport thrives on unity, collaboration, and shared purpose.\n\nAfter all football is a team sport and not about an individual.\n\nPersonal agendas must take a back seat to the greater good of the game.\n\nThe credibility of the administration will not be judged by how well they won an election but by what they deliver during their tenure in office, and this includes laying the platform for grassroots development anchored on a strategic Long Term Athlete Development plan and a strategic plan that ensures podium performances and capacity building for administrators and coaches.\n\nEqually, those who lost or feel aggrieved must recognise that football is bigger than any individual.\n\nProlonging election grievances through endless court battles, protests, or media wars may only serve to stall progress and yet ZIFA cannot afford to regress into the kind of state they were under their previous board, which later invited the SRCs intervention in November 2021.\n\nConstructive criticism and oversight are necessary, but they should be aimed at ensuring accountability, not settling political scores.\n\nThe message is simple: it is time to roll up our sleeves and do the work. The national teams need proper structures to thrive. The domestic league requires stability. The grassroots programmes demand investment.\n\nSponsors and partners need confidence in the administrations vision.\n\nEvery second spent reliving election disputes is a second stolen from the future of our football.\n\nEach councillor must put shoulders to the wheel in their respective constituencies and move forward.\n\nFootball must be the ultimate winner.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/07/Nqobile-Magwizi.jpg",
            "description": "SO, the much-awaited Zimbabwe Football Association (ZIFA) elections have come and gone, with Harare businessman and philanthropist Nqobile Magwizi emerging an overwhelming winner. Magwizi and members of his ZIFA executive committee have, since January 25, been mandated to administer association football in this country on a four-year term. As has been widely reported, it was […]",
            "time": "08:24",
            "date": "01 Feb 2025"
        },
        {
            "title": "Coach Molly: Zim’s top confidence, grooming and etiquette tutor",
            "url": "https://www.herald.co.zw/coach-molly-zims-top-confidence-grooming-and-etiquette-tutor/",
            "content": "Trust Khosa\n\nLifestyle Writer\n\nHave you ever considered acquiring acceptable social behaviour and norms that govern interactions between individuals in various contexts?\n\nHave you received training on how people should act in social, professional and formal situations?\n\nDo you know how to behave in public, both as a leader and as a subordinate?\n\nThese skills can only be attained through confidence coaching, grooming and etiquette, which help to shape good character and instil discipline.\n\nAlthough etiquette varies widely by culture, setting and occasion, experts value it for instilling elements that facilitate respectful and harmonious interactions among individuals.\n\nMany people in both powerful and low positions need grooming and etiquette coaching.\n\nIn Harare, Molly Chuma, better known as Coach Molly, has made a significant impact in this area.\n\nMolly Chuma in a grooming class\n\nShe is undoubtedly the most sought-after lady for grooming and etiquette and is the answer for those with low self-esteem who are eager to learn.\n\nCoach Molly teaches essential grooming skills, such as politeness, respect and wearing appropriate clothing for specific occasions.\n\nShe has also boosted the confidence of those with low self-esteem by instilling proper communication skills.\n\nCoach Molly pays close attention to dining etiquette, emphasising the importance of following proper table manners during meals.\n\nShe also teaches her clients the need to embrace powerful communication skills, including tone, body language and active listening.\n\nIn her own words, grooming runs in her blood.\n\nGrooming has helped her become a multitasker in various fields, including being an English teacher, content creator, church pastor and makeup artist.\n\nShe has presided over 100 wedding receptions as a makeup artist and director, making her one of Zimbabwes most hardworking ladies in events management and planning.\n\nHer fairy tale came to the spotlight in the last two years after the floodgates of success opened.\n\nIn an interview with The Herald on Saturday Lifestyle, the mother of two remarked that she considers herself a rare and blessed woman.\n\nMolly Chuma and hubby\n\nShe believes she is following her heart and Gods guidance in this area of grooming, confidence-building and etiquette.\n\nTo start with, I can safely say I am a confidence, grooming and etiquette coach, makeup artist, English teacher, and then a pastor, stressed this multitasking lady.\n\nI will be turning 39 in March this year, and I am a mother of two.\n\nI also provide image consultancy services, which contributes to my coaching work. I am a pastor by being married to one (Pastor Mufudzi Chuma) and am also an active member of the UFIC Church (United Family International Church) under Prophet Emmanuel Makandiwa.\n\nWith a busy and demanding schedule on her shoulders, Coach Molly has devised ways to strike a balance in her work.\n\nI am usually busy on weekends when I am doing bridal sequences and makeup. I sometimes start my work at 2 am, and by 8 am I will be done because the brides should be all prepared before the event. Its a routine that I am not used to, and time management has helped me execute my job.\n\nOn Sundays, I will be at church from 9 am to 1pm. At church, I am the first to arrive and the last to leave because I am a pastor who is required to attend to people, she explained.\n\nThe confidence coach, who runs MC School of Etiquette in Harare, has also designed a flexible timetable to cater to individuals and classes.\n\nI do hold childrens classes mid-week as well as sessions for adults, especially those from corporate backgrounds.\n\nWe are open to teaching newly promoted employees how they should carry themselves in public.\n\nSometimes, good educational qualifications are not enough without proper grooming, which then shapes peoples conduct and relationships with others, she said.\n\nIn her spare time, she has become a regular panellist on Capitalk Radio under Zimpapers Group, which airs programmes on grooming.\n\nSometimes I am invited to Capitalk Radio to speak about these issues of grooming and etiquette. Its something that I enjoy the most because I get to interact with listeners who are eager to learn more about grooming.\n\nThe initiative (Capitalk programmes) has also managed to raise the appeal of the brand Coach Molly Chuma since I get a chance to share some tips freely on a bigger platform, she remarked.\n\nAs a makeup artist, she draws inspiration from internationally-acclaimed beautician Jacque Mgido, who has worked with Hollywood stars like Snoop Dogg, R&B singer John Legend, actor and singer Jamie Foxx, and movie star Sylvester Stallone.\n\nI will be blunt on this one: Jacque Mgido is my role model. She has put Zimbabwe on the international stage, which is also my vision as a makeup artist.\n\nI am planning a one-stop-shop in Harare offering beauty products, grooming and all that I have mentioned, she explained.\n\nAs a pastor, Coach Molly saluted Ruth Makandiwa as a perfect example of commitment to Gods ministry.\n\nMolly Chuma with pastor Jefferson Muserera at graduation school\n\nThe person I would mention as a mentor is no doubt Ruth Makandiwa, not because we attend the same church, but because I am close to her and I always meet her at church. I would like to emulate her and continue serving the Lord, she noted.\n\nWhile Coach Molly noted that God has blessed her beyond measure, she also revealed that she has received grooming lessons from professionals.\n\nIn 2023, I was enrolled at Allion Jefferson Academy, where I was taught everything about grooming for half a year.\n\nIt was quite an amazing experience because I can implement some of the things that I have learned. However, God has always used me to help others with confidence building for years, but I only perfected it at the academy, recalled Coach Molly.\n\nWith this list of mentors, Coach Molly is learning from the best and is determined to succeed.\n\nIn her short journey as a multitasker, she described 2024 as one of her most successful years in living memory.\n\nLast year, she attended two major conferences in South Africa as a grooming and etiquette expert.\n\nIn August last year, she was among the panellists at the Womens Talk Conference powered by Victorious Women and UFIC.\n\nShe met some of the best minds in confidence building, including sexual health specialist and family practitioner Dr Nkosilathi Shabalala, psychosocial support and community health expert Nomzano Zikalala, and Zola Shabangu, founder of iGoda Incubator & Instika WIB chairperson, among other grooming experts.\n\nBefore the South African visit, she was among the speakers at the Audacious Queen Summit 2024 held on July 27 in Harare.\n\nCoach Molly was among the speakers hosted by Melody Chipo Makuvaza. Securico founder and managing director Dr Divine Ndlukula, Farai Mpofu (Investor Education Director, Securities and Exchange Commission of Zimbabwe), and Chido Mzondo, a certified talent practitioner and career advisor, spoke at the event.\n\nAfter rubbing shoulders and sharing her wisdom with some of the sub-regions finest motivators and hardworking women, Coach Molly is destined for the stars.\n\nHer fairy tale, written in bold letters, is that of a multitasking woman who has a hunger for whatever she touches.\n\nCoach Mollys passion for boosting peoples confidence, creating memories, and winning the hearts of both the young and old in grooming is hard to ignore.\n\nShe is a big dreamer who is ready to touch many lives as a confidence, grooming, and etiquette coach.\n\nRaised in Harare in a God-fearing family, Coach Mollys calling was clear from the onset: she would serve her nation with pride.\n\nCoach Molly is married to Mufudzi Chuma.\n\nThe couple is blessed with two boys aged 17 and 13 years, respectively.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Molly-Chuma-680x380.jpg",
            "description": "Trust Khosa Lifestyle Writer Have you ever considered acquiring acceptable social behaviour and norms that govern interactions between individuals in various contexts? Have you received training on how people should act in social, professional and formal situations? Do you know how to behave in public, both as a leader and as a subordinate? These skills […]",
            "time": "08:24",
            "date": "01 Feb 2025"
        },
        {
            "title": "Embracing value addition for dairy farmers",
            "url": "https://www.herald.co.zw/embracing-value-addition-for-dairy-farmers/",
            "content": "Precious Manomano, Herald Reporter\n\nIn the heart of Zimbabwes lush landscapes, smallholder farmers are embracing value addition in milk, transforming the dairy industry and paving the way for economic growth.\n\nThese dedicated farmers play a crucial role in fulfilling the nations demand for approximately 150 million litres of raw milk annually.\n\nBy converting raw milk into value-added products, they not only enhance their livelihoods but also strengthen the local economy.\n\nAs dawn breaks, local farmers gather at community milk processing centres like the Rusitu Dairy Scheme in Chipinge, where their fresh milk is transformed into a variety of dairy products such as yoghurt, cheese, and traditional delicacies.\n\nThese centres serve as lifelines for rural communities, creating jobs and providing a steady income source.\n\nThe ability to turn raw milk into more profitable products helps farmers secure their financial futures while contributing to the food security of their families and communities.\n\nProfessor Obert Jiri, the Permanent Secretary for Lands, Agriculture, Fisheries, Water, and Rural Development, said value addition means more earnings for farmers.\n\nEmpowering smallholder farmers to link directly with processing facilities not only boosts their incomes but also strengthens the entire agricultural sector.\n\nHis vision includes a comprehensive approach to improving market linkages, ensuring that farmers can access markets effectively and profitably.\n\nDespite progress, challenges remain. The journey from farm to market can be daunting; milk is perishable and requires swift transportation to maintain its quality. Many farmers face logistical hurdles, and the infrastructure necessary for efficient delivery is often lacking.\n\nAdditionally, large-scale processors struggle with capacity limitations, unable to keep pace with the increasing volumes of milk being produced.\n\nTo address these issues, the Government is investing in infrastructure improvements and expanding processing capabilities. By enhancing transportation networks and creating more efficient processing plants, the goal is to facilitate a smoother transition from farm to market.\n\nThis initiative is vital for ensuring that farmers can deliver their milk quickly, maximising the freshness and quality of the products they produce. Financial sustainability is another critical factor in the dairy industrys growth.\n\nFeed costs can account for a staggering 78 percent of production expenses, making it challenging for farmers to maintain profitability. To address this, experts should advocate for sustainable feeding practices, such as pasture-based systems and on-farm feed production, Professor Jiri explains.\n\nBy teaching farmers how to cultivate their own feed ingredients like soybeans and sunflowers, they can significantly reduce costs and enhance their profit margins.\n\nEducation and training are crucial components of this transformation. Agricultural extension officers and livestock specialists work closely with farmers, providing guidance on best practices and innovative production techniques. This emphasis on knowledge empowers smallholder farmers to adopt efficient methods, leading to increased yields and improved milk quality. Looking to the future, Zimbabwes dairy industry has set ambitious goals. With a target of reaching 220 million litres of milk production by 2025.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/milk.jpg",
            "description": "Precious Manomano, Herald Reporter In the heart of Zimbabwe’s lush landscapes, smallholder farmers are embracing value addition in milk, transforming the dairy industry and paving the way for economic growth. These dedicated farmers play a crucial role in fulfilling the nation’s demand for approximately 150 million litres of raw milk annually. By converting raw milk […]",
            "time": "08:24",
            "date": "01 Feb 2025"
        },
        {
            "title": "‘Conflict in eastern DRC hampers Mpox fight’",
            "url": "https://www.herald.co.zw/conflict-in-eastern-drc-hampers-mpox-fight/",
            "content": "ADDIS ABABA.  The Africa Centers for Disease Control and Prevention (Africa CDC) has warned that the worsening humanitarian situation in the eastern Democratic Republic of the Congo (DRC) hampers the fight against the spread of Mpox in the region.\n\nThe number of Mpox cases reported in Africa this year has surpassed 9 959, as the death toll reached 85, Africa CDC Director-General Jean Kaseya told an online media briefing on Thursday evening.\n\nIn the week alone, eight African countries reported 3 300 new cases, including 914 confirmed ones, according to data from the African Unions specialised healthcare agency.\n\nThe DRC, the epicentre of the ongoing Mpox outbreak in Africa, has recorded 2 707 cases over the past week, of which 516 were confirmed, along with 38 deaths, Kaseya said.\n\nHe warned that the worsening humanitarian crisis in the eastern DRC and the city of Goma, where fighting between the DRC army and M23 rebels has intensified, is stalling efforts against Mpox and other disease outbreaks.\n\nThe humanitarian situation in the DRC is affecting not only Mpox (response efforts), but also a number of other outbreaks, Kaseya said.\n\nHealth infrastructure has been broken, and access to basic services like water and sanitation doesnt really exist.\n\nThis is also an area where, in addition to Mpox, we have cholera, measles, and other disease outbreaks, he said.\n\nHe warned that the large-scale displacement of people could trigger the further spread of the Mpox virus throughout the DRC and the region.\n\nWe are talking about people who are leaving Goma and could spread the disease to other regions of the DRC and neighbouring countries. Guns cannot kill us all, but outbreaks can kill all of us, Kaseya said.\n\nAccording to the Africa CDC, among the 21 countries affected by the ongoing Mpox outbreak since the start of last year, 12 are experiencing active transmission of the virus.\n\nIn mid-August last year, the Africa CDC declared the Mpox outbreak a public health emergency of continental security. Shortly afterward, the World Health Organization designated the viral disease as a public health emergency of international concern, the second time in two years that it activated its highest level of global alert for Mpox.\n\nMpox, formerly known as monkeypox, was first detected in laboratory monkeys in 1958. It is a rare viral disease typically transmitted through body fluids, respiratory droplets, and other contaminated materials. The infection often causes fever, rash, and swollen lymph nodes.  Reuters.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/08/MPOX-outbreak.jpg",
            "description": "ADDIS ABABA. — The Africa Centers for Disease Control and Prevention (Africa CDC) has warned that the worsening humanitarian situation in the eastern Democratic Republic of the Congo (DRC) hampers the fight against the spread of Mpox in the region. The number of Mpox cases reported in Africa this year has surpassed 9 959, as […]",
            "time": "08:24",
            "date": "01 Feb 2025"
        }
    ]
}