{
    "news": [
        {
            "title": "President rewards gallant Sables . . .  Each players pockets US$6.5k  . . .  ‘Sporting excellency actualises NDS1’",
            "url": "https://www.herald.co.zw/president-rewards-gallant-sables-each-players-pockets-us6-5k-sporting-excellency-actualises-nds1/",
            "content": "Tinashe Kusema-Senior Reporter\n\nPRESIDENT Mnangagwa has paid tribute to the Zimbabwe senior mens rugby team, saying their Africa Cup conquest, earlier this year, exemplifies the Governments National Development Strategy 1 (NDS1) call for the development of high-performance sports programmes and elite athletes.\n\nThe President hosted the Zimbabwe Sables at State House in Harare yesterday during which he distributed cash rewards of US$6,500 per player for winning the Rugby Africa Cup in Kampala, Uganda, back in July.\n\nMore importantly, he spoke with pride of the teams success during the 2024 calendar year where the Sables finished unbeaten in 24 matches, won their first Africa Cup in 12 years and beat regional powerhouses, Namibia, for the first time in 23 years en route to the African title.\n\nI am pleased to host you, our national rugby team as we celebrate your remarkable victory at the Rugby Africa Cup held in Uganda.\n\nThe nation honours the teamwork and patriotism that you demonstrated throughout the championship which brought the team this success of being crowned champions, said President Mnangagwa.\n\nThis historic achievement further reflects your dedication and perseverance as players, coaches and support staff.\n\nThe President hosted the Zimbabwe Sables at State House in Harare yesterday during which he distributed cash rewards of US$6,500 per player for winning the Rugby Africa Cup in Kampala, Uganda, back in July.\n\nI am aware that the journey that led to this momentous occasion was not an easy one. As a team, you endured rigorous training sessions, and extraordinary pressure on and off the field as you faced competitive as well as aggressive opponents.\n\nHowever, through every scrum, tackle and ultimately try, you embodied the true meaning of sportsmanship, passion and zeal, he said.\n\nPresident Mnangagwa then drew focus to NDS1, which he said was symbolised by the Sables incredible feat.\n\nAt Government level, the National Development Strategy calls for the development of high-performance sporting disciplines and nurturing of elite athletes.\n\nThe success story of you, our Sables, dovetails with these aspirations. Additionally, the victory of our national rugby team is timely, occurring when our nation is re-asserting its place among sporting countries within the international arena.\n\nThis milestone is therefore another testimony that Zimbabwe is ready to compete and excel at the highest levels of continental and global sport.\n\nI acknowledge and express my profound gratitude to the various stakeholders, particularly families of players whose unwavering support and sacrifices have been instrumental to this success.\n\nThe President called upon the Sports Ministry and other relevant stakeholders to take a page out of the Sables success and come together to further develop Zimbabwe sport.\n\nMay the spirit of this victory inspire many more young people as they strive for greatness, said the President.\n\nALL SMILES . . . PRESIDENT Mnangagwa and Sables skipper Hilton Mudariki hold the Africa Cup while the rest of the Sables delegation watches at State House in Harare yesterday.\n\nThe Ministry of Sport, Recreation, Arts and Culture, industry and business stakeholders are called upon to scale up support for the sport sub-sector towards both quality infrastructure and ensuring that athletes can take sport as a viable career, he said.\n\nZimbabwes rugby team captain Hilton Mudariki described meeting with the President as the highlight of his career.\n\nHe said the meeting now puts the team in good stead as they prepare for the all-important 2025 edition of the Rugby Africa Cup which will double as qualification for the 2027 Rugby World Cup in Australia.\n\nIt is a truly special moment for me and the team, you cant describe it. It is a day that each of us will remember for the rest of our lives, an opportunity to be hosted by His Excellency, President Emmerson Mnangagwa.\n\nIt will definitely act as motivation for us to keep working hard as we prepare for the all-important Africa Cup next year. We have a target on our back as every team will be gunning for us, but we will surely be up for the challenge, Mudariki said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/President-with-Sables-captain.jpg",
            "description": "Tinashe Kusema-Senior Reporter PRESIDENT Mnangagwa has paid tribute to the Zimbabwe senior men’s rugby team, saying their Africa Cup conquest, earlier this year, exemplifies the Government’s National Development Strategy 1 (NDS1) call for the development of high-performance sports programmes and elite athletes. The President hosted the Zimbabwe Sables at State House in Harare yesterday during […]",
            "time": "2024-12-12 08:47:43"
        },
        {
            "title": "Zim grabs global attention through sports",
            "url": "https://www.herald.co.zw/zim-grabs-global-attention-through-sports/",
            "content": "Blessings Chidakwa-Herald Reporter\n\nZIMBABWE is gaining global recognition for positive reasons through sport, with the Zimbabwe Open for Business mantra taking centre stage at a cricket tournament underway in Sri Lanka.\n\nThe country recently hosted a successful T10 tournament in Abu Dhabi and is now competing in Sri Lanka, with plans to move on to the United States of America and then India.\n\nIn these international venues, Zimbabwe is branding itself prominently, with players donning sportswear emblazoned with the Zimbabwe is Open for Business buzzword, as championed by President Mnangagwa.\n\nA few weeks ago, the President was instrumental in capturing global attention through sports after the Government established a strategic partnership with T Ten Global Sports to enhance the nations international profile and attract foreign investment.\n\nZimbabwe has been leveraging international platforms to showcase its substantial economic potential, with Special Advisor to the President on Investment, Dr Paul Tungwarara, playing a key role.\n\nSpeaking about the ongoing tournament, Dr Tungwarara said Zimbabwe will continue to utilise international platforms to highlight its vast economic opportunities, aligning with the Second Republics vision of presenting Zimbabwe as Open for Business.\n\nThe partnership with T Ten Global Sports is a significant move in our engagement and re-engagement strategy, enhancing Zimbabwes international profile and economic prospects, he said.\n\nDr Tungwarara praised President Mnangagwa for ensuring that Zimbabwe shines on the global stage.\n\nThis partnership reflects Zimbabwes forward-looking strategy for international outreach. After Abu Dhabi, we are now in Sri Lanka, followed by the USA andIndia. By leveraging T Tens global media presence, we will amplify the message that Zimbabwe is ready for business and global partnerships.\n\nHe took pride in contributing to this historic initiative, reiterating that this collaboration with T Ten Global Sports underscores Zimbabwes commitment to engaging with the world.\n\nThrough T Tens extensive reach, we will showcase Zimbabwe as a thriving hub for investment and innovation, Dr Tungwarara said.\n\nWith a viewership exceeding 500 million across television and OTT platforms, and a social media reach of 2.5 billion spanning over 100 countries, T Tens cricket leagues provide Zimbabwe with an exceptional platform to promote its investment opportunities.\n\nThese partnerships were launched during the Abu Dhabi T10 Cricket League, positioning Zimbabwe as a premier destination for international business and economic collaboration.\n\nT Ten Global Sports operates five T10 leagues: the Abu Dhabi T10, US Masters T10, Lanka T10 Super League, African T10, and Sri Lanka T10.\n\nIn a recent statement, T Ten Global Sports Chairman Shaji Ul Mulk noted that the partnership signifies a bold step toward economic reform and global engagement, solidifying Zimbabwes position as a premier investment destination.\n\nWe are honoured to partner with Zimbabwe to deliver this transformative vision. Through T Tens five global leagues, we will ensure that Zimbabwes message reaches key markets, connecting the nation with influential investors and creating new opportunities for growth and collaboration, Mr Mulk said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/T-Ten-Global-Sports-chairman-Shaji-Mulk-.jpg",
            "description": "Blessings Chidakwa-Herald Reporter ZIMBABWE is gaining global recognition for positive reasons through sport, with the “Zimbabwe Open for Business” mantra taking centre stage at a cricket tournament underway in Sri Lanka. The country recently hosted a successful T10 tournament in Abu Dhabi and is now competing in Sri Lanka, with plans to move on to […]",
            "time": "2024-12-12 08:47:43"
        },
        {
            "title": "‘Retirement is a time for renewal’",
            "url": "https://www.herald.co.zw/retirement-is-a-time-for-renewal/",
            "content": "Joseph Madzimure-Senior Reporter\n\nRETIREMENT should not be seen as a period of retreat, but rather as a time of renewal and reinvention, President Mnangagwa has said.\n\nIn a speech read on his behalf by Defence Minister Oppah Muchinguri-Kashiri at the inaugural Public Service Commission (PSC) retirement conference 2024 in Harare yesterday, the President said participatory development in communities offers a unique opportunity for retirees to apply their skills where they are most needed, fostering economic and social growth.\n\nThis milestone event is a testimony to the unwavering commitment of the Second Republic to improving the welfare of those who have served our nation with dedication and honour.\n\nThe doctrine of social protection is predicated on dignity in retirement. This dignity is borne out of the prosperity that comes from the sweat of those who selflessly serve the nation, he said.\n\nThe conference, running under the theme, Embracing a New Chapter: Empowering Public Sector Workers for Retirement with Dignity, will end tomorrow.\n\nThe theme, President Mnangagwa said, reflects the significant strides the Government has made through various reforms aimed at strengthening social protection.\n\nAs we write this new chapter, ourfocus is the dignity and empowerment of Government workers. We must ensure that retirement is not an endpoint but a meaningful new chapter contributing to the prosperity of our provinces, districts, and communities, he said.\n\nThe conference, organised by the Public Service Commission, is being attended by retirees; active members of the public service; and retirement experts from different sectors with major focus on discussing opportunities to secure the dignity; financial independence and health of civil servants in retirement.\n\nIt also focuses on financial planning; real estate planning; and life skills capacitation among other issues.\n\nGovernment adopted a Defined-Benefit Pension Scheme which provides eligible employees with guaranteed income for life when they retire.\n\nAs the largest employer in the land, President Mnangagwa said Government guarantees a specific retirement benefit for each participant based on factors such as the employees salary and years of service.\n\nThis means that the Government bears the risk if the returns on the investment do not cover the defined-benefit amount due to a member, he said.\n\nPresident Mnangagwa said as Government improved social protection, there was a need to ignore the benefits associated with a Defined Contribution Pension Scheme which does not promise specific benefits at retirement.\n\nWith a Defined Contribution, risk falls on the contributor in that, pension benefits are pegged in relation to returns that are generated from investments.Thus, low investment returns result in low pension payouts. By adopting a Defined-Benefit Pension Scheme, the Government chose to shoulder the risk and guaranteed a specific pension benefit to all eligible beneficiaries, he said.\n\nCurrently, there are 195 000 to 200 000 retirees benefitting from the pensions payouts.\n\nIn any given year, 300 to 500 civil servants retire from active service.\n\nPresident Mnangagwa emphasised that those who join retirement must remain productive and continue to contribute to nation-building.\n\nGuided by the provision of the Constitution and Vision 2030 with respect to social protection, he said the Second Republics developmental thrust is premised on championing inclusivity, innovation, and progress.\n\nTo this end, my Government has developed an array of social protection policies aimed at improving the welfare of retirees to secure their dignity in retirement. In addition, my Government aims to empower retirees whose shoulders have borne the weight of nation-building. This resonates with our espoused mantra, Nyika inovakwa igotongwa igonamatirwa nevene vayo.\n\nPresident Mnangagwa said retirement should not be seen as merely the end of active service but as a cornerstone of national progress, embodying the values of the liberation struggle and the dividends of peace and unity.\n\nHe hailed the public servants for being at the forefront of implementing policies that drive national development.\n\nThrough hard work and sacrifice, President Mnangagwa said workers have shaped a government that serves its people with integrity, diligence and resolve.\n\nThe Second Republic, he said, stands firm in its commitment to a Zimbabwe where every citizen young or old, retired or in servicehas the opportunity to thrive.\n\nThe conference was also attended by the Minister of Public Service, Labour and Social Welfare, July Moyo, Minister of Veterans of the Liberation Struggle Monica Mavhunga, chairman of the Public Service Commission, Dr Vincent Hungwe, Commissioners of the Public Service Commission, Secretary of the Public Service Commission, Mrs Sibusisiwe Zembe among other senior Government officials.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Minister-Oppah-Muchinguri-Kashiri.jpg",
            "description": "Joseph Madzimure-Senior Reporter RETIREMENT should not be seen as a period of retreat, but rather as a time of renewal and reinvention, President Mnangagwa has said. In a speech read on his behalf by Defence Minister Oppah Muchinguri-Kashiri at the inaugural Public Service Commission (PSC) retirement conference 2024 in Harare yesterday, the President said participatory […]",
            "time": "2024-12-12 08:47:43"
        },
        {
            "title": "President to commission new Shurugwi-Mhandamabwe highway",
            "url": "https://www.herald.co.zw/president-to-commission-new-shurugwi-mhandamabwe-highway/",
            "content": "Freedom Mupanedemo-Midlands Bureau\n\nTHE Second Republic continues to achieve significant milestones in modernisation and infrastructure development, with President Mnangagwa expected to commission the newly-resurfaced Shurugwi-Mhandamabwe Highway in Shurugwi today.\n\nThis road is viewed as a catalyst for enhancing transport movement along the southern corridor and has undergone substantial transformation to improve border-to-border connectivity.\n\nThe Shurugwi-Mhandamabwe Highway primarily connects Beitbridge with other borders, including Chirundu and Nyamapanda.\n\nThe 43-kilometre stretch had deteriorated to such an extent that cross-border trucks resorted to longer routes via Masvingo and Harare.\n\nMidlands Provincial Affairs and Devolution Minister Owen Ncube said all preparations were in place for the event, which he described as a major highlight of the Second Republics infrastructure development drive at the national level.\n\nHe emphasised that Government, under President Mnangagwas leadership, is on track to achieving an upper-middle-income economy by 2030.\n\nI am sure many people know how important this highway is for connecting our border-to-border transport. Its completion and commissioning by the President tomorrow is testament to the Second Republics commitment to achieving its Agenda 2030.\n\nMinister Ncube added that the opening of the road would catalyse increased transport movement along the southern corridor.\n\nFor years, this road posed challenges for motorists, affecting business and trade. We expect to witness a change and increased traffic movement along the corridor, he said.\n\nShurugwi South Member of Parliament Wilson Mhuri also highlighted the positive implications of the roads opening for the constituency and the nation.\n\nThis development will have a significant and positive impact on the development of our district, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/11/Untitled-91-1.jpg",
            "description": "Freedom Mupanedemo-Midlands Bureau THE Second Republic continues to achieve significant milestones in modernisation and infrastructure development, with President Mnangagwa expected to commission the newly-resurfaced Shurugwi-Mhandamabwe Highway in Shurugwi today. This road is viewed as a catalyst for enhancing transport movement along the southern corridor and has undergone substantial transformation to improve border-to-border connectivity. The Shurugwi-Mhandamabwe […]",
            "time": "2024-12-12 08:47:43"
        },
        {
            "title": "Mining value addition takes shape",
            "url": "https://www.herald.co.zw/mining-value-addition-takes-shape/",
            "content": "Mukudzei Chingwere in CHIADZWA\n\nMINERAL value addition is key to transforming the economy with Government supporting all efforts to beneficiate primary products at source, Vice President Dr Constantino Chiwenga has said.\n\nVP Chiwenga said this yesterday after touring the Zimbabwe Consolidated Diamond Company (ZCDC) deep boiling plant.\n\nThe plant is part of the companys strategic development programme with which it is seeking to enhance the value of its precious stones before taking them to the market in order to maximise revenue.\n\nVP Chiwenga said value addition by local companies is a necessity as rough diamonds or any other raw mineral extraction will not be able to foster the kind of mining sector contribution to the national and local economies.\n\nThe brief that we received and the subsequent tour of the deep boiling facility made us appreciate the importance of undertaking basic processes such as removal of the coating of our rough diamonds at the source of production, said VP Chiwenga.\n\nIn the diamond sector, he said, Government envisions the opening of new mines from exploration projects currently ongoing, expansion of existing projects, increased capacity utilisation and value addition and beneficiation.\n\nVP Chiwenga said the diamond industry is dynamic and the sector has been witnessing a revolution which has seen unprecedented challenges and opportunities.\n\nIt is some of these challenges that we continue to resolve in order to be competitive and seize opportunities that manifest in the diamond trading environment.\n\nI am convinced that diamonds are an agent for change and have contributed to the transformation of the African continent, contributing to economic growth and improving the livelihoods of our communities.\n\nDespite the diamond sector in Zimbabwe facing unprecedented challenges a decade ago, he said, the industry has been on a growth trajectory that has seen diamond production output and revenue increasing.\n\nThe consolidation of the diamond mining companies to form Zimbabwe Consolidated Diamond Company has brought about improvements in the sector, said VP Chiwenga.\n\nHe also implored mining companies and investors in general to deliberately tailor interventions that foster sustainable economic benefit for people in areas of their business operations.\n\nThe VP said the upgrade at ZCDC is testament of the work done by President Mnangagwa and the Second Republic in rejuvenating the mining sector so that it plays a key role towards an empowered upper-middle income economy.\n\nSuch investments, he said, should answer to the economic needs of the populace through employment creation and high impact and sustainable corporate social investment.\n\nVP Chiwenga said ZCDC through its Corporate Social Responsibility (CSR) programmes has been playing a transformative role in the lives of the Chiadzwa community and the nation at large.\n\nHe noted that it is gratifying that the company is currently implementing the Sustainable Community Enterprises and Development (SCED) programme in Chiadzwa for local developmental projects.\n\nThe selection of such projects should be done after consultations with the community. I, therefore, implore the community to be united and ensure that the funds availed are used for the intended projects and programmes, said VP Chiwenga.\n\nZCDC has revamped and constructed school blocks for the local community.\n\nThis is commendable and I encourage the company to continue engagements with the local community and their leadership.\n\nWe should all be conscious that diamonds are a finite resource and it is necessary to have Corporate Social Responsibility projects that go beyond the lifespan of our mines.\n\nIt is Government policy under the leadership of President Mnangagwa that communities where mining takes place should be empowered to sustain their livelihoods during and after mining activities have ceased, said VP Chiwenga.\n\nHe urged mining stakeholders to uphold high ethical standards which saw Zimbabwe being certified compliant with the Kimberley Process Certification Scheme in 2022.\n\nDeputy Minister of Mines and Mining Development Polite Kambamura said they are seized with creating a vision of sustainable, responsible and value driven mining operations.\n\nHe thanked the ZCDC for showing them insights into their operations.\n\nZCDC chief operating officer Mr Dennis Mtombeni said the vision of the company is continuous progression in value addition of diamonds.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/VP-Chiwenga-in-Chiadzwa.jpg",
            "description": "Mukudzei Chingwere in CHIADZWA MINERAL value addition is key to transforming the economy with Government supporting all efforts to beneficiate primary products at source, Vice President Dr Constantino Chiwenga has said. VP Chiwenga said this yesterday after touring the Zimbabwe Consolidated Diamond Company (ZCDC) deep boiling plant. The plant is part of the company’s strategic […]",
            "time": "2024-12-12 08:47:43"
        },
        {
            "title": "First Lady gives free eyesight checks, specs, food hampers to vulnerable groups . . . Chinese Embassy fulfils pledge to continue working with her",
            "url": "https://www.herald.co.zw/first-lady-gives-free-eyesight-checks-specs-food-hampers-to-vulnerable-groups-chinese-embassy-fulfils-pledge-to-continue-working-with-her/",
            "content": "Tendai Rupapa-Senior Reporter\n\nHEALTH ambassador First Lady Dr Auxillia Mnangagwa yesterday spread cheer through free eyesight checks and distribution of food and toiletry hampers to hundreds of elderly persons, the disabled and those with albinism as part of her all-inclusive programmes which are leaving no one and no place behind.\n\nIn addition, those with albinism were provided with sunscreen lotions, lip care balms and together with the elderly they enjoyed free eyesight checks and provided with spectacles by eye specialists.\n\nThose with albinism were also provided with sunglasses, thanks to Angel of Hope Foundation and its partners.\n\nChinese Ambassador to Zimbabwe Mr Zhou Ding and his wife provided the sunscreen lotions in fulfilment of a pledge they made during a recent courtesy call to work with the First Lady through the embassy.\n\nAmbassador Zhou was in attendance yesterday and helped the mother of the nation in distributing the lotions.\n\nAmai Mnagagwa was handed an award as disability inclusion champion by Albino Trust Zimbabwe in recognition of her tireless efforts to support and empower people with disabilities.\n\nAddressing the beneficiaries and members of the Chitungwiza community gathered for the event, the First Lady expressed her appreciation to all the attendees for sparing their time for the event which enables the nation to directly interact with persons with disabilities, including children with albinism and the elderly.\n\nShe also thanked the Chinese Embassy for supporting her philanthropic work.\n\nFirst Lady Dr Auxillia Mnangagwa greets Senator Rose Mpofu who is the Special Advisor on disability issues in the Office of the President and Cabinet in Chitungwiza yesterday.\n\nI would like to begin by thanking the Chinese Embassy under the leadership of the Chinese Ambassador His Excellency Mr Zhou Ding and Madam for their continuous support of the philanthropic work I carry out through Angel of Hope Foundation.\n\nToday they have donated lotions to assist those with albinism, a very significant gesture that is of immense help to the specific group here present.\n\nI would like to say to the Ambassador, that I am grateful to the embassy and the Government of China at large for being an all-weather friend to our nation and may our bilateral relations be maintained in the purity of its excellence, she said.\n\nDr Mnangagwa said she wasguided by the mission of the Angel of Hope Foundation to support the most vulnerable persons in society through the provision of access to healthcare, social services, education and economic empowerment initiatives with a focus that includes older persons, women, youths and children, including children with disabilities and their parents.\n\nIn contemplating the myths that surround albinism, the First Lady said she uncovers a troubling belief prevalent in certain communities, the notion that wealth can be attained through physical means, often involving individuals with albinism.\n\nAt the Angel of Hope Foundation in Zimbabwe, we firmly reject these harmful beliefs and practices. Kana wafunga zvekupfuma, chiyenda kuchikoro udzidze or start a business worega kudeura ropa. Munyika muno tinoremekedza those with albinism uye tovada vakadaro. Vana zvipo zvinobva kuna Mwari. I urge everyone to embrace the principle of living in harmony and unity with individuals with disability, fostering a spirit that encourages us to love, protect and support individuals with disabilities. I take pride in the fact that the abhorrent tradition of infanticide against children with disabilities has been eradicated in Zimbabwe.\n\nPart of the crowd that interacted with First Lady Dr Auxillia Mnangagwa and received food, hampers, free eye checks, sunscreen lotions and lip care from Angel of Hope Foundation and its partners in Chitungwiza yesterday.\n\nIt is disheartening to witness some husbands are still choosing to abandon wives for bearing children with disabilities, driven by superstitious beliefs.\n\nIt is crucial to recognise that a mother is not to blame for the circumstances of her childs birth. Ultimately, having a disability does not diminish ones humanity.\n\nRegardless of disability, we are all human beings; our differences lie merely in skin tone, hair colour, eye, colour and other physical attributes, she said.\n\nSome individuals, the First Lady said, are born with disabilities, while others may acquire them during their lives.\n\nIn either case, we are united in our shared humanity. Our elders have contributed immensely to the development of our society, they have worked tirelessly to build the foundations upon which we stand today.\n\nTheir wisdom and experience are invaluable resources that we must cherish and learn upon. Tikati vatidzidzise kwavakabva uye pavakafamba napo, hatishaye dzidziso yatinobva takabata. Asi vamwe nhasi they nolonger relate well with their elderly relatives. Ngatibvise ruzhowa pakati pedu nevakwegura because this is where blessings come from.\n\nChinese Ambassador to Zimbabwe Zhou Ding hands over sunscreen lotions and lip care to people with albinism in Chitungwiza yesterday.\n\nEven the empowerment programmes that I initiate, I make sure that the elderly are included. By giving them, we not only honour their contributions, but also ensure that they feel appreciated.\n\nSupporting the elderly can take many forms. It can be as simple as spending time with them, listening to their stories and showing them that they are valued.\n\nIt can also involve providing assistance, care and other essential services to improve their quality of life. Community programmes and initiatives that focus on the well-being of the elderly are crucial in creating a supportive environment where they can thrive, she said.\n\nAs the First Lady of Zimbabwe, Dr Mnangagwa said she was committed to advocating for the welfare of elderly citizens and her office will continue to work closely with Government agencies and community leaders to develop and implement programmes that address the needs of the elderly.\n\nAll the philanthropic work that I do, I started way before I became the First Lady. I grew up as an orphan and I would regularly assist the elderly in our community with even household chores.\n\nThis is something I am imparting in todays youth nekuti vana vedu havatozive kubatsira vakwegura vedu vanotoda kudzidziswa. I am teaching them through my Gota/Nhanga/Ixhiba programme. Also, as parents, let us teach our children good morals. Shun domestic violence and let the children grow in peaceful homes.\n\nAngel of Hope Foundation, she said, compliments Government efforts towards fulfilling, promoting and respecting the rights of persons with disabilities.\n\nI commend the Department of Disability Affairs in the Ministry of Public Service, Labour and Social Welfare for its efforts towards pushing forward the national disability agenda. Lastly, I would like to encourage all of us to foster a sense of tolerance and acceptance in our community. Let us, where we can, be our brother and sisters keeper, she said.\n\nAmbassador Zhou said the First Ladys tireless compassion and unwavering commitment to uplifting vulnerable communities has continued to inspire many.\n\nThrough the Angel of Hope Foundation, the Ambassador said the First Lady had shown that the true measure of leadership lay in serving those who often felt invisible.\n\nSunscreen lotions which were distributed to people with albinism through the partnership of Angel of Hope Foundation and Chinese Embassy in Zimbabwe.\n\nI would like to extend my deepest appreciation to you for your exemplary dedication to the welfare of the Zimbabwean people. Today, as we come together to celebrate this special programme for people living with albinism, we reaffirm a shared commitment to build an inclusive society that cherishes every individual, celebrates diversity, and leaves no one and no place behind.\n\nChina and Zimbabwe enjoy a friendship that has stood the test of time. Our collaboration spans many sectors: from large-scale infrastructural projects that have transformed the economy, to grassroots initiatives that touch the everyday lives of citizens, he said.\n\nAmbassador Zhou said it was important to emphasize that while big infrastructure projects may capture headlines, their contributions to local communities reflected the heart of partnership between the two nations.\n\nOver the years, China has supported numerous programmes in education, health, and poverty alleviation, underscoring our belief that development is most meaningful when it reaches the most vulnerable.\n\nIn this spirit, we are humbled to extend a donation specifically for Zimbabwes albino population, a group that often faces unique challenges in their daily lives. This gesture is not merely an act of giving; it is a symbol of our shared humanity, a recognition of their strength and dignity, and a commitment to ensure that their voices are heard and their needs are met.\n\nPart of the hampers and sunscreen lotions which were donated by Angel of Hope Foundation patron First Lady Dr Auxillia Mnangagwa to people with albinism, the disabled and the elderly in Chitungwiza yesterday.\n\nToday we are pleased to announce that the Chinese Embassy in collaboration with the Angel of Hope Foundation, will be donating sun protection and lip balm for albinistic skin types respectively, he said.The albino population in Zimbabwe, he said, is a vital part of the nations tapestry, yet they face significant obstaclesfrom health complications due to sun exposure to social stigmatization that can isolate them from their communities. Their courage in the face of these challenges is nothing short of inspiring.\n\nBy providing resources that enhance their quality of life, Ambassador Zhou said, China hopes to reaffirm the inherent value and potential of every individual.\n\nWe are committed to working alongside the Government of Zimbabwe and organisations like the Angel of Hope Foundation to ensure that every person, regardless of their abilities or circumstances, can thrive, he said.\n\nIn a speech read on his behalf by Retired Major Catherine Kampila, Harare Metropolitan Provincial Affairs and Devolution Minister Charles Tawengwa praised the First Lady for her well-thought-out programmes which benefited the nation.\n\nHe thanked the First Lady for leading from the front in supporting vulnerable groups without leaving no place and no one behind.\n\nMr Bruce Nyoni from the Albino Trust Zimbabwe congratulated the First Lady on her recent graduation with a Doctor of Phylosophy Degree in Tourism and Hospitality Management.\n\nCongratulations Amai for the doctorate degree you recently earned from the Midlands State University. As a community we cannot give a blind eye to the efforts you make. The work you are doing isnt impacting Zimbabwe alone, but SADC as a whole.\n\nAs a community we remain grateful for the Disability Policy launched. There are a number of benefits we enjoy because of the policy. We would like to thank you for your unwavering support to the disability community as a whole. We now have a Sadc Declaration on the protection of people with disabilities. To the disability community, the door of progress is upon us, I appeal to you to study. Lets move from the charity model to the developmental model. As we journey towards building our nation lets reflect on what we have achieved through the Disability Policy. Amai we have seen the good works you are doing and as people with disabilities we remain in solidarity with your vision, he said.\n\nHonourable Rose Mpofu, the Presidents Special Advisor on Disability said she was proud of the work being done by the mother of the nation.\n\nWe are proud of you Amai. I thank you for what you and the President His Excellency Cde Mnangagwa are doing. You are advancing Vision 2030. Thank you Amai for assisting people with disabilities through Angel of Hope Foundation, for encouraging the able bodied to always assist others. Amai you always preach the gospel of unity, she said.\n\nChinese Ambassador to Zimbabwe Zhou Ding distributes hampers donated by Angel of Hope Foundation in Chitungwiza yesterday.\n\nAmbassador Nyasha Nhau underscored the need for parents with children living with disabilities to send their offspring to school to unleash their full potential.\n\nI am thankful for this opportunity you have afforded us to gather here as people living with disabilities this month when we are commemorating the International Disability Day. I am also heading the disability desk in Commonwealth countries representing persons with disability. I have mentioned this focusing on parents with children living with disabilities. We must ensure we send our children to school. If you let them acquire education, they will rise to ambassadorial roles just like myself I am in the Commonwealth and the African Union. I wish to thank our First Lady Dr Auxillia Mnangagwa for her love and kindness, he said.\n\nIn a speech read on his behalf by Mr Zimhunga, Public Service and Social Welfare Minister July Moyo praised the First Lady for her dedication and support to persons with disabilities and the elderly.\n\nHe said the sunscreens will go a long way in assisting people with albinism as the nation is currently experiencing a heat wave.\n\nBeneficiaries expressed gratitude to the First Lady.\n\nSekuru Raymond Mukaka said; I was overjoyed by this gesture by the First Lady because I now live a lonely life after losing my wife five years ago. All my children are away working in South Africa and barely send me anything to get by. The First Lady has done a good thing for I now have food and toiletries for Christmas, he said.\n\nEqually elated was Christopher Nzombe who lives with a disability.\n\nAngel of Hope Foundation patron First Lady Dr Auxillia Mnangagwa distributes hampers in Chitungwiza yesterday.Pictures: John Manzongo\n\nThe First Lady has given us a deep sense of belonging. People usually look down upon us, but our mother has a loving heart which accommodates everyone. She has been working tooth and nail to see to it that we are well catered for and for that I am most grateful. In the 52 years of my life, I had never been given such love by someone outside my family. I feel greatly loved, he said with a huge smile.\n\nMs Ronika Bunhe, who lives with albinism was also over the moon.\n\nWe struggle a lot with eyesight and the First Lady today swept to our rescue with free eyesight checks as well as the supply of spectacles to all those who needed them. We also have challenges coping with extremely hot temperatures like those currently being experienced in the country and we desperately needed the sunscreen lotions that she has distributed to us today. People living with albinism often live in isolation as they are not well understood by many people, but the First Lady is an all-embracing mother who regularly comes to visit us and offer us programmes to contribute to economic development and feed our families. She is indeed a great mother, she said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/First-Lady1-2.jpg",
            "description": "Tendai Rupapa-Senior Reporter HEALTH ambassador First Lady Dr Auxillia Mnangagwa yesterday spread cheer through free eyesight checks and distribution of food and toiletry hampers to hundreds of elderly persons, the disabled and those with albinism as part of her all-inclusive programmes which are leaving no one and no place behind. In addition, those with albinism […]",
            "time": "2024-12-12 08:47:43"
        },
        {
            "title": "Botswana to document Zim nationals",
            "url": "https://www.herald.co.zw/botswana-to-document-zim-nationals/",
            "content": "Wallace Ruzvidzo in GABORONE, Botswana\n\nUNDOCUMENTED Zimbabweans living in Botswana will have their stay regularised soon, with President Duma Boko citing Zimbabwes skilled human resources as an asset Botswana can tap into.\n\nPlans are already underway to establish details of Zimbabweans living in Botswana with at least 150 000 locals believed to be living in the country.\n\nIn an interview yesterday, Ambassador to Botswana Henry Mukonoweshuro said Zimbabwe welcomed Botswanas commitment to registering undocumented Zimbabweans living in the country.\n\nWe welcome the pronouncements by the new President Advocate Duma Boko, that his idea is to actually have a number of undocumented Zimbabweans being documented and regularised because it is better to have regularised people whom you can trace and trust and also who can actually now seek jobs.\n\nBecause there is an acknowledgement by our hosts that our people are well-trained, well skilled and they have commitment, so this is a really positive trajectory that we welcome and we are willing to work with the authorities to ensure that we have some sort of special dispensation akin to the one that was given to our country in 2009 in South Africa. We are working out a similar format, he said.\n\nAmbassador Mukonoweshuro said he was set to meet Botswanas Minister of Immigration to action the pronouncement by President Boko.\n\nI am yet to meet the new Minister of Immigration and Human Rights as well as the Permanent Secretary in that office to try and actualise the words by the President, he said.\n\nTurning to consular services at the Zimbabwean Embassy in Gaborone, the Ambassador said they were serving a considerable number of Zimbabweans daily.\n\nThey will be coming for passport renewals, new passports, specific letters pertaining to permit renewals, and birth certificates among other services.\n\nOn a good day especially towards holidays we serve upwards of 100 people a day, sometimes 150 especially when school children are on holiday.\n\nThey are coming for different things like passport renewals, new passports, birth certificate applications and assistance for those that have deceased and those who want to extend their permits. Sometimes its a requirement that the embassy writes papers to authenticate documents, he said.\n\nAmbassador Mukonoweshuro said the Embassy was also in the process of compiling a list of Zimbabweans living in Botswana.\n\nIn a separate interview, Dr Brighton Hurombo, a Zimbabwean lecturing at the University of Botswana, said he was happy with consular services at the embassy.\n\nI am very happy with the services and quality of service being offered here. Today I had come to the Embassy to inquire about my drivers licence and I was very much assisted. Now I will be travelling to Harare for the holidays with no problems, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Henry-Mukonoweshuro.jpg",
            "description": "Wallace Ruzvidzo in GABORONE, Botswana UNDOCUMENTED Zimbabweans living in Botswana will have their stay regularised soon, with President Duma Boko citing Zimbabwe’s skilled human resources as an asset Botswana can tap into. Plans are already underway to establish details of Zimbabweans living in Botswana with at least 150 000 locals believed to be living in […]",
            "time": "2024-12-12 08:47:43"
        },
        {
            "title": "Cyber City construction on track",
            "url": "https://www.herald.co.zw/cyber-city-construction-on-track/",
            "content": "Trust Freddy-Herald Correspondent\n\nCONSTRUCTION at the state-of-the-art Zimbabwe Cyber City in Mount Hampden, just outside Harare, is back on track, with over 50 luxury villas expected to be completed by next year.\n\nEssential infrastructure, including roads, sewer systems, and water reticulation, is nearing completion, signalling the start of an unprecedented real estate boom in the country.\n\nDuring a media tour of the site, Dr Paul Tungwarara, Special Presidential Investment Advisor to the United Arab Emirates (UAE) and chairman of Prevail International Group, who is overseeing the construction, expressed optimism about creating a mini-Dubai in Zimbabwe.\n\nWe are currently focused on infrastructure development, and contractors are actively on site, he said.\n\nFollowing the completion of the 50 villas, construction will shift to a shopping mall. Additionally, a musical fountain, designed to enhance domestic tourism, is nearing completion.\n\nThis fountain utilises water, colour, and music to create an entertaining show.\n\nThis is another indication that we are ready to bring Dubai to Zimbabwe. The fountain will dance to the rhythm of music, resembling the famed dancing waters of Dubai, said Dr Tungwarara.\n\nThe overall development is estimated to cost nearly US$500 million, featuring elaborate designs, including the impressive fountain.\n\nThe Cyber City project is being developed by Mulk International, owned by Dubai-based billionaire Mr Shaji Ul Mulk, who proposed the project to President Mnangagwa during a visit to the UAE.\n\nPresident Mnangagwa subsequently invited Mr Mulk to bring the project to Mount Hampden. The civil works contract has been awarded to Bitumen World, with the first phase already underway. This phase focuses on essential infrastructure such as roads, sewer trenching, and water systems, paving the way for the smart city development.\n\nThe Zim Cyber City will comprise 250 homes, including 80 luxury villas, along with green spaces, offices, and commercial spaces, all connected to Artificial Intelligence (AI) and a digital transport system.\n\nIt represents the first real estate investment in Zimbabwe under the Zimbabwe Global Investments (ZGI) Special Economic Zone (SEZ) programme, which has been approved by President Mnangagwa and facilitated by the Ministry of Finance, Economic Development and Investment Promotion.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/CEF.jpg",
            "description": "Trust Freddy-Herald Correspondent CONSTRUCTION at the state-of-the-art Zimbabwe Cyber City in Mount Hampden, just outside Harare, is back on track, with over 50 luxury villas expected to be completed by next year. Essential infrastructure, including roads, sewer systems, and water reticulation, is nearing completion, signalling the start of an unprecedented real estate boom in the […]",
            "time": "2024-12-12 08:47:43"
        },
        {
            "title": "Innovative thinking  key in AI adoption",
            "url": "https://www.herald.co.zw/innovative-thinking-key-in-ai-adoption/",
            "content": "Ivan Zhakata-Herald Correspondent\n\nINNOVATIVE thinking must be central to approaching and embracing Artificial Intelligence (AI) adoption, Minister of Information Communication Technology (ICT), Postal and Courier Services, Dr Tatenda Mavetera has said.\n\nSpeaking on her behalf at the African Telecommunications Union (ATU) ICT Day conference and expo in Harare yesterday, her deputy, Dingimuzi Phuti, emphasised the importance of collaboration between the public and private sectors, as well as between governments and academia.\n\nThe event, themed Accelerating AI Adoption in Africa Through Policy and Innovation for Sustainable Development, highlighted the critical intersection of technology and governance in advancing Africas digital transformation agenda.\n\nDr Mavetera noted that fostering partnerships allows for the leveraging of diverse perspectives and expertise to develop solutions tailored to unique challenges.\n\nBy promoting collaboration between African nations, we can share knowledge, resources, and best practices, creating a unified front that enhances our collective capabilities, she said.\n\nOur youth are our greatest asset; hence we must equip them with the skills necessary to thrive in an AI-driven economy. This includes integrating AI and digital literacy into our educational curricula, ensuring that the next generation is prepared for the future.\n\nDr Mavetera emphasised that AI has the potential to drive progress towards Sustainable Development Goals (SDGs).\n\nBy aligning our AI initiatives with these goals, we can ensure that our efforts contribute to a sustainable and equitable future for all, she added.\n\nDr Mavetera also commended the exhibitors who won various awards for their contributions.\n\nLet us work together to build the Zimbabwe that we all want. The journey towards accelerated AI adoption in Africa requires commitment, collaboration, and visionary leadership. Let us embrace this opportunity to drive innovation through thoughtful policy, ensuring that our efforts lead to sustainable development across the continent. Together, we can transform Africa into a global leader in AI technology, creating a legacy of prosperity and resilience for generations to come.\n\nDr Gift Machengete, director-general of the Postal and Telecommunications Regulatory Authority of Zimbabwe (POTRAZ), said they are actively working to expand digital infrastructure to ensure that AI technologies reach even the most remote communities.\n\nWe are also promoting research and development to cultivate local AI solutions tailored to African contexts, he said.\n\nFurthermore, the Authority is strengthening digital literacy initiatives to equip our people, especially the youth, including those with disabilities, with the skills required to thrive in an AI-driven world. Importantly, we are working on developing ethical guidelines to safeguard against biases and ensure the responsible use of AI technologies.\n\nDr Machengete emphasised the necessity of collaborative efforts.\n\nThe path to success is one we must walk together. Governments, the private sector, academia, and civil society all have critical roles to play in building the networks, knowledge bases, and partnerships necessary for Africa to lead in AI innovation.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Phuti-old-site.jpg",
            "description": "Ivan Zhakata-Herald Correspondent INNOVATIVE thinking must be central to approaching and embracing Artificial Intelligence (AI) adoption, Minister of Information Communication Technology (ICT), Postal and Courier Services, Dr Tatenda Mavetera has said. Speaking on her behalf at the African Telecommunications Union (ATU) ICT Day conference and expo in Harare yesterday, her deputy, Dingimuzi Phuti, emphasised the […]",
            "time": "2024-12-12 08:47:43"
        },
        {
            "title": "Editorial Comment: Dog licensing, anti-roaming by-laws must be enforced",
            "url": "https://www.herald.co.zw/editorial-comment-dog-licensing-anti-roaming-by-laws-must-be-enforced/",
            "content": "UNTIL the Ministry of Health and Child Care started compiling statistics of how many people are bitten by dogs, very few knew just how serious the problem of uncontrolled and wandering dogs was in Zimbabwe.\n\nBy the fourth week of November, with five weeks still to go before year end, 35 820 dog bites had been reported in Zimbabwe.\n\nThe total number of dog bites must be considerably higher as the figure is for those where someone sought treatment from a clinic, doctor or hospital.\n\nThose who did not bother and just washed the wound at home are not in the total.\n\nThe Ministry figures are bad enough in any case, an average of well over 500 a week or almost 80 a day.\n\nIn the breakdown of the 610 bites in the week to November 24, just under a quarter, 149, were from dogs that proved on investigation to be vaccinated against rabies.\n\nAlmost as many, 135, came from dogs that were definitely not vaccinated against rabies. Most worrying, in about half the bites no one could find out if the dog was vaccinated or not. Rabies is an invariably fatal disease once the symptoms appear.\n\nThe only defence is to be vaccinated promptly after a bite by a rabid animal, or one suspected of being rabid.\n\nIf the dog that bit you cannot be found or identified, and so checked out, there are obviously some difficult decisions to make, based purely on likely probabilities considering the area and its recent history concerning rabies. The huge total of dog bites, and the follow up by the Health Ministry, shows that there are a number of laws and local authority by-laws being broken on a very large scale.\n\nFor a start all dogs in Zimbabwe are supposed to be vaccinated at three-year intervals. Perhaps we have never reached 100 percent, but at times in the past we have come close, and it is generally accepted that at least 70 percent of dogs must be vaccinated to break the chains of infection.\n\nRabies can never be totally eliminated in Zimbabwe, since jackals and some other wild animals can be infected and they in turn bite the first dog in a chain of infection.\n\nBut with more than 70 percent of dogs effectively vaccinated, that chain of infection will be very short, or perhaps not even able to start.\n\nThe dog bite statistics, looking just at the percentage of dogs whose vaccination status could be ascertained, show that only about half of Zimbabwean dogs are vaccinated, and that is a dangerously low fraction.\n\nSo for a start, we need to start checking up on dogs and making sure that the law is followed and that all are vaccinated. It is not expensive and often the Department of Veterinary Services makes sure it is free. While people who climb over a wall or fence or cut through a hedge to gain admission to a property where there is a dog cannot complain if the dog bites them, such legal bites are in a small minority.\n\nMany people keep dogs precisely to deter criminals and since many criminals are either deterred or equipped with poison or weapons to take action to immobilise a dog, few are bitten.\n\nMost people are bitten while going about their lawful business, walking in the streets or on open public land and should be able to do this without worrying that some stray dog will attack them, or some dog will shoot out of an open gate and attack them for walking past its owners house.\n\nSome of these attacks produce severe injuries and wounds, and in the past there have even been people killed by dogs, innocent people who were attacked as they walked past a fence or a gate quite legally and lawfully.\n\nThis year there have been no deaths, but with 26 000 bites that is simply good luck, not something that could have been expected. People are not allowed to let their dogs wander. The law in almost all local authorities is fairly firm on this.\n\nDogs in urban areas must be confined to the premises of their owners, meaning they cannot get into the street or over a boundary into a neighbours property, unless they are under the control of a responsible person, generally meaning being on a lead or being so well trained that they will instantly obey a command to return to the controlling human.\n\nEven rural dogs are not allowed to roam at will and need to be kept on the owners farm or other premises or be under control. They cannot attack schoolchildren passing a village for example.\n\nWhile by-laws exist, and have for decades, enforcement, especially in recent years, has been very slack. Roaming dogs are not reported and gates left open with a dog sitting by them have become all too common, as owners cannot be bothered to stop and get out of their car once they have driven through. All this needs to be reported and then effective action taken.\n\nSometimes the grossly underfunded SPCA (Society for the Prevention of Cruelty to Animals) will round up a bunch of stray dogs, but there are limits and thus local authorities need to attack the menace from the other direction, of fining owners of wandering dogs and those with dogs who leave gates open or walls and fences unrepaired.\n\nThat fine money could even be assigned to more effective action, such as catching and holding stray dogs.\n\nHarare City Council has made promises that it will be enforcing its dog licencing and other dog-orientated by-laws, including limits on how many dogs a household can keep and the need to keep dogs confined on plots or under control.\n\nWe hope arrangements have been made to make the tens of thousands of licence discs in time and have these at all area offices in time, and that inspectors will be going around to ensure the dogs do have collars, again legally required, and that the licence discs are displayed on the collar. The licence money is supposed to cover this enforcement. This is the start of eliminating dog bites, except of criminals climbing clandestinely into private premises.\n\nIt also means every dog owner can be identified through the licence disc and so can be fined for breaches of the by-laws, or can be sued in civil courts for damage or injury inflicted by their dog. And perhaps those bitten by stray dogs will be able in future to sue the dogs owners for medical costs and damages.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Dog-bites-cases.jpg",
            "description": "UNTIL the Ministry of Health and Child Care started compiling statistics of how many people are bitten by dogs, very few knew just how serious the problem of uncontrolled and wandering dogs was in Zimbabwe. By the fourth week of November, with five weeks still to go before year end, 35 820 dog bites had […]",
            "time": "2024-12-12 08:47:43"
        }
    ]
}