{
    "news": [
        {
            "title": "President Mnangagwa appoints Lieutenant General Matatu as ZNA Commander",
            "url": "https://www.herald.co.zw/newpresident-mnangagwa-appoints-lieutenant-general-matatu-as-zna-commander-2/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nPresident Mnangagwa has appointed Major General Emmanuel Matatu to the rank of Lieutenant General and Commander of the Zimbabwe National Army (ZNA).\n\nAnnouncing the appointment, Dr Martin Rushwaya, Chief Secretary to the President and Cabinet, said the appointment was with immediate effect.\n\nHis Excellency, the President of the Republic of Zimbabwe and Commander in Chief of the Zimbabwe Defence Forces, Cde Dr Emmerson Dambudzo Mnangagwa, acting in terms of Section 216(2) as read with Section 89 of the Constitution of Zimbabwe and Sections 11(1)(a) and 11(4) of the Defence Act (Chapter 11:02), has appointed Major General Emmanuel Matatu to the rank of Lieutenant General and Commander of the Zimbabwe National Army with immediate effect, he said.\n\nLieutenant General Matatus appointment reflects Governments confidence in his experience and capabilities in ensuring the security and stability of the nation.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/20250327_191857-680x380.jpg",
            "description": "Ivan Zhakata  Herald Correspondent President Mnangagwa has appointed Major General Emmanuel Matatu to the rank of Lieutenant General and Commander of the Zimbabwe National Army (ZNA). Announcing the appointment, Dr Martin Rushwaya, Chief Secretary to the President and Cabinet, said the appointment was with immediate effect. “His Excellency, the President of the Republic of Zimbabwe […]",
            "time": "21:46",
            "date": "27 Mar 2025"
        },
        {
            "title": "Security services on high alert to ensure public safety",
            "url": "https://www.herald.co.zw/security-services-on-high-alert-to-ensure-public-safety/",
            "content": "Nyore Madzianike\n\nZimbabwes security services are on high alert to maintain public safety and ensure that citizens can go about their socio-economic activities without fear, Minister of Home Affairs and Cultural Heritage Kazembe Kazembe has said.\n\nAddressing the media on Thursday evening, Minister Kazembe said the police have deployed adequate personnel to ensure a safe and conducive environment for business and daily activities.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/grsg-680x380.jpg",
            "description": "Nyore Madzianike  Zimbabwe’s security services are on high alert to maintain public safety and ensure that citizens can go about their socio-economic activities without fear, Minister of Home Affairs and Cultural Heritage Kazembe Kazembe has said. Addressing the media on Thursday evening, Minister Kazembe said the police have deployed adequate personnel to ensure a safe […]",
            "time": "21:46",
            "date": "27 Mar 2025"
        },
        {
            "title": "ZAAC, Anti-Corruption and Civil Rights Commission (ACRC) of the Republic of Korea to sign MOU",
            "url": "https://www.herald.co.zw/zaac-anti-corruption-and-civil-rights-commission-acrc-of-the-republic-of-korea-to-sign-mou/",
            "content": "Herald Reporter\n\nThe Zimbabwe Anti-Corruption Commission (ZACC) and the Anti-Corruption and Civil Rights Commission (ACRC) of the Republic of Korea are set to sign a Memorandum of Understanding (MoU) as part of efforts to strengthen bilateral relations in the fight against corruption between the two nations.\n\nThe MOU will be signed tomorrow in Seoul, South Korea.\n\nThe pact builds on decades of bilateral ties, established in 1994, and follows President Mnangagwas visit to Seoul in June 2024 for the Korea- Africa Summit, where five agreements spanning trade, aviation, agriculture, and private-sector collaboration were sealed.\n\nChampioning President Mnangagwas re-engagement agenda, Zimbabwean Ambassador to the Republic of Korea Stewart Nyakotyo advocated for partnership between the two anti-corruption bodies at a meeting with ACRC chairperson, Mr Ryu Chul Whan.\n\nThe signing of the MoU will be an important milestone in the deepening of bilateral relations between Zimbabwe and Korea, said Ambassador Nyakotyo.\n\nIt will assist in strengthening of international partnerships in line with the foreign policy mantra pronouncement by Dr Mnangagwa that Zimbabwe is a friend to all and an enemy to none.\n\nThe objectives of the MoU will assist Zimbabwe in the attainment of National Development Strategy goals (NDS1) and the soon to be produced NDS2), Ambassador Nyakotyo said.\n\nZACC chairperson Mr Michael Reza said the MoU will strengthen the capacity of the Commission and bolster the fight against corruption.\n\nWe are looking forward to signing an MoU with the ACRC. The Republic of Korea has immeasurable expertise, which we wish to tap into, said Mr Reza.\n\nThe Republic of Korea has supported Zimbabwe through various manpower development programmes.\n\nProfessional training has also been provided in different Korean Universities for postgraduate studies.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/07/ZACC-680x360.jpeg",
            "description": "Herald Reporter The Zimbabwe Anti-Corruption Commission (ZACC) and the Anti-Corruption and Civil Rights Commission (ACRC) of the Republic of Korea are set to sign a Memorandum of Understanding (MoU) as part of efforts to strengthen bilateral relations in the fight against corruption between the two nations. The MOU will be signed tomorrow in Seoul, South […]",
            "time": "21:46",
            "date": "27 Mar 2025"
        },
        {
            "title": "Zanu PF intensifies preps for Gutu East primary elections",
            "url": "https://www.herald.co.zw/zanu-pf-intensifies-preps-for-gutu-east-primary-elections/",
            "content": "Joseph Madzimure\n\nZimpapers Politics Hub\n\nZanu PF is now receiving CVs from members intending to contest in its primary elections for Gutu East Constituency in Masvingo Province.\n\nThe seat fell vacant following the expulsion of former legislator Benjamin Ganyiwa, who was accused of misconduct that undermined party leadership.\n\nGanyiwa was expelled for attempting to unconstitutionally remove six district chairpersons, fuelling factionalism and holding unauthorised meetings where he allegedly criticised the President.\n\nAs a result, Zanu PF recalled him from the National Assembly and formally notified the legislature that he no longer represented the partys interests.\n\nAccording to Section 129(1)(k) of the Constitution, a Parliamentary seat becomes vacant when a legislator ceases to be a member of the party under which they were elected.\n\nThis paved the way for a by-election to fill the vacancy in Gutu East.\n\nSpeaking at the 125th Central Committee meeting in Harare today, President Mnangagwa directed party structures to intensify preparations for the upcoming by-elections in Gutu East and Glen View South constituencies.\n\nThe Glen View South by-election is scheduled for April 12, while dates for the Gutu East poll will be announced in due course.\n\nOur focus now shifts to winning Gutu East and Glen View South Constituency, here in Harare Province, where the youthful Cde Tsitsi Tawomhera is our candidate, said President Mnangagwa.\n\nZanu PF Masvingo provincial chairperson, Cde Robson Mavhenyengwa confirmed that preparations for the Gutu East primary elections are underway.\n\nWe are in the process of receiving CVs from interested candidates, he said.\n\nAfter receiving the CVs, we will be given directions by the Commissariat department.\n\nAs Zanu PF, we are ready for the by-elections.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/b8d35646-4bba-41b3-8609-7f7660a52350-680x380.jpg",
            "description": "Joseph Madzimure Zimpapers Politics Hub Zanu PF is now receiving CVs from members intending to contest in its primary elections for Gutu East Constituency in Masvingo Province. The seat fell vacant following the expulsion of former legislator Benjamin Ganyiwa, who was accused of misconduct that undermined party leadership. Ganyiwa was expelled for attempting to unconstitutionally […]",
            "time": "21:46",
            "date": "27 Mar 2025"
        },
        {
            "title": "Zimbabwe steps up genome editing framework drafting",
            "url": "https://www.herald.co.zw/zimbabwe-steps-up-genome-editing-framework-drafting/",
            "content": "Sifelani Tsiko\n\nInnovations Editor\n\nZimbabwe has stepped up efforts to draft regulations for new biotechnology techniques covering genome editing and genetically modified foods (GMOs) to protect public health and the environment.\n\nPermanent Secretary in the Ministry of Higher and Tertiary Education, Innovation, Science and Technology Development, Professor Fanuel Tagwira said the drafting of regulations is a crucial step in promoting the safe and ethical application of genome editing and GMO technology.\n\nIt is our collective responsibility to ensure that these technologies are developed and applied in a responsible, safe and transparent manner, he said.\n\nA robust regulatory framework is essential to address the challenges posed by genome editing.\n\nSuch a framework must balance the need to promote innovation with the need to protect human health, the environment and animal welfare.\n\nZimbabwe has embraced genome editing technologies as it aligns with Education 5.0, which seeks to develop home-grown solutions and industrial growth.\n\nThe National Biotechnology Authority (NBA) and the African Union Development Agency (AUDA-NEPAD) are holding the workshop to help advance the drafting of the Genome Editing Regulatory Framework for Zimbabwe.\n\nGenome editing refers to a set of biological techniques that allow scientists to make precise alterations to the DNA of an organism.\n\nThese techniques have great potential to improve genetics and performance of crops, livestock and other organisms for agricultural, industrial and medical applications.\n\nWe want to develop regulatory frameworks that are in line with international best practices, said Prof Tagwira.\n\nCreating regulatory frameworks that align with regional and international standards will enable Zimbabwe to develop competitive biotechnology products for regional and global markets.\n\nTo meet the Fourth Industrial Revolution in Zimbabwe and the SADC region, the country has pledged to promote emerging technologies in a number of fields, including robotics, artificial intelligence, nanotechnology, quantum computing, big data, biotechnology, fifth generation wireless technology and 3D.\n\nZimbabwe is participating in a regional genome editing pilot project alongside seven other African countries.\n\nThrough this project, Zimbabwe has drafted a national Genome Editing Communication and Advocacy Strategy that has been reviewed and will soon be launched.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/07/Prof-Fanuel-Tagwira.jpg",
            "description": "Zimbabwe has stepped up efforts to draft regulations for new biotechnology techniques covering genome editing and genetically modified foods (GMOs) to protect public health and the environment.",
            "time": "21:46",
            "date": "27 Mar 2025"
        },
        {
            "title": "CAAZ holds 8th AGM to review 2022 financial year",
            "url": "https://www.herald.co.zw/caaz-holds-8th-agm-to-review-2022-financial-year/",
            "content": "Freeman Razemba\n\nSenior Reporter\n\nThe Civil Aviation Authority of Zimbabwe (CAAZ) held its 8th Annual General Meeting (AGM) this morning to review its operations, financial performance, and overall status for the financial year ending December 31, 2022.\n\nThe meeting comes after the appointment of a new board following the retirement of the previous one in 2023.\n\nThe new board has taken responsibility for preparing the 2022 annual report, ensuring compliance with the Public Entities Corporate Governance Act.\n\nSeveral officials, including acting director for strategic policy planning, monitoring and evaluation in the Ministry of Transport and Infrastructural Development, Mr Takura Vengesa; chairperson of the Parliamentary Portfolio Committee on Transport and Infrastructural Development, Cde Tawanda Kakikoga; CAAZ chairperson Mrs Nonkosi Ncube; deputy chairperson Mr Joshua Muhwati; CAAZ board members; and acting director general Mr Honest Murindagomo, among others, are attending the meeting.\n\nThe annual report highlights CAAZs role in regulating air transport services, aeronautical airport services (including ground handling, in-flight catering and aviation fuelling) and air navigation services.\n\nIt also provides stakeholders with verified insights into the authoritys state of affairs.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/c2613da9-9d6a-4d04-b9da-80d19316fccb-680x380.jpg",
            "description": "The Civil Aviation Authority of Zimbabwe (CAAZ) held its 8th Annual General Meeting (AGM) this morning to review its operations, financial performance, and overall status for the financial year ending December 31, 2022.",
            "time": "21:46",
            "date": "27 Mar 2025"
        },
        {
            "title": "Zanu PF to unveil social media policy",
            "url": "https://www.herald.co.zw/zanu-pf-to-unveil-social-media-policy/",
            "content": "Zvamaida Murwira and Joseph Madzimure\n\nZanu PF is formulating a social media policy to regulate party members conduct on digital platforms and curb the misuse of new media, President Mnangagwa has said.\n\nAddressing the 125th Ordinary Session of the Central Committee at the party headquarters today, President Mnangagwa, who is also the Zanu PF First Secretary, said the policy aims to secure, regulate and govern the partys digital communication and activities.\n\nA social media policy is already under consideration, he said.\n\nThis will secure, regulate, and govern the conduct of our communication and activities in the digital space.\n\nHe urged the Central Committee to remain vigilant in upholding party rules and procedures, ensuring discipline among members.\n\nI commend the party for the bold and timely decision to tighten our policy frameworks and code of conduct, said President Mnangagwa.\n\nThe closed-door session of the Central Committee is expected to deliberate on key party and economic issues affecting the nation.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/675663b3-cfc2-43dc-b37d-118f3e968a7f-680x380.jpg",
            "description": "Zanu PF is formulating a social media policy to regulate party members' conduct on digital platforms and curb the misuse of new media, President Mnangagwa has said.",
            "time": "21:46",
            "date": "27 Mar 2025"
        },
        {
            "title": "Zimbabwe Mercantile Exchange warehouse receipts near 500k tonnes",
            "url": "https://www.herald.co.zw/zimbabwe-mercantile-exchange-warehouse-receipts-near-500k-tonnes/",
            "content": "Online Reporter\n\nLands, Agriculture, Fisheries, Water and Rural Development Minister Dr Anxious Masuka has commended the Zimbabwe Mercantile Exchanges growth trajectory.\n\nThe electronic agricultural commodity platform that was launched in August 2021 facilitates the trade of commodities and connects Zimbabwean traders with regional markets.\n\nIt has established a network of 33 warehouses, providing 642 000 tonnes of storage space in seven of the countrys 10 provinces.\n\nAddressing delegates at the Association of Commodity Exchanges (A-ACX) Annual Conference in Victoria Falls yesterday, Dr Masuka said: The ZMX is increasingly becoming an active trading platform as farmers and traders become more aware of the exchange mechanism that guarantees timely payments.\n\nConsequently, warehouse receipts of 437 000 tonnes of maize, wheat, soya beans, red and white sorghum, ginned cottonseed, sugar beans, white rice and rice bran have been cumulatively issued by ZMX, which is now operating weekly auctions.\n\n",
            "image_url": null,
            "description": "Lands, Agriculture, Fisheries, Water and Rural Development Minister Dr Anxious Masuka has commended the Zimbabwe Mercantile Exchange’s growth trajectory.",
            "time": "21:46",
            "date": "27 Mar 2025"
        },
        {
            "title": "Bryden School secures court order to stop cement plant construction",
            "url": "https://www.herald.co.zw/bryden-school-secures-court-order-to-stop-cement-plant-construction/",
            "content": "Fidelis Munyoro\n\nBryden Country School in Chegutu has obtained a High Court interim order stopping the construction of a cement manufacturing plant near its premises.\n\nThe project, led by Shuntai Investments Private Limited, intends to produce 800 000 tonnes of cement annually and provide 800 jobs.\n\nThe school raised concerns over environmental and health risks associated with the development.\n\nIn response, Justice Regis Dembure instructed Shuntai and its affiliates to suspend all activities related to the cement factory, brick moulding plant, and quarry mining project at Plot 8, Eastbourne in Chegutu.\n\nShuntai had proceeded with the project despite lacking an Environmental and Social Impact Assessment Certificate, development permits, and land tenure documents.\n\nThis violated a previous penalty issued by the Environmental Management Agency for non-compliance.\n\nBryden School, represented by Mr Joshua George Manyumbu and Mr Andrea Dracos of Gollop & Blank, argued that the project could harm buildings, expose students and staff to harmful pollutants such as cement dust and benzene, as well as coal-burning emissions.\n\nShuntai failed to come to court to contest the matter.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/court-hammer.jpg",
            "description": "Bryden Country School in Chegutu has obtained a High Court interim order stopping the construction of a cement manufacturing plant near its premises.",
            "time": "21:46",
            "date": "27 Mar 2025"
        },
        {
            "title": "Stakeholders meet to tackle teen pregnancies",
            "url": "https://www.herald.co.zw/stakeholders-meet-to-tackle-teen-pregnancies/",
            "content": "Walter Nyamukondiwa\n\nGovernment departments and youth-centred organisations are meeting in Darwendale to strategise on the implementation of the Not in My Village Campaign, an initiative aimed at reducing teenage pregnancies in Mashonaland West Province.\n\nThe meeting comes amid alarming statistics indicating that teenagers account for at least 20 percent of all pregnancy bookings at health institutions across the provinces seven districts.\n\nHurungwe District has the highest teenage pregnancy rate at 24 percent, followed by Chegutu at 22 percent.\n\nTo address this issue, Hurungwe and Chegutu will receive support from the United Nations Population Fund (UNFPA) to implement the campaign in collaboration with the National AIDS Council (NAC) and the Government.\n\nThe campaign will also involve key partners such as Safeguard Young People (SYP) and the Young Peoples Network on Health and Wellbeing (YPNHW).\n\nMeanwhile, NAC will support the remaining five districts in tackling teenage pregnancies.\n\nThe meeting is focused on identifying and addressing key drivers of teenage pregnancies, including negative religious practices, the influence of the internet, drug and substance abuse, poverty, cultural norms, and gaps in parenting.\n\nNACs acting provincial manager, Mrs Rumbidzai Manatsa said there is need for a concerted effort to combat teenage pregnancies and child marriages.\n\nThe Not In My Village Campaign is a youth-led initiative by the YPNHW, with financial and technical support from NAC and UNFPA Zimbabwe through the Safeguard Young People Programme and Together for SRHR.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/e759611a-15b1-49db-b7e9-5c83df9ec823-680x380.jpg",
            "description": "Government departments and youth-centred organisations are meeting in Darwendale to strategise on the implementation of the “Not in My Village Campaign”, an initiative aimed at reducing teenage pregnancies in Mashonaland West Province.",
            "time": "21:46",
            "date": "27 Mar 2025"
        }
    ]
}