{
    "news": [
        {
            "title": "Zanu PF candidate Tsitsi Tawomhera wins Glen View South by-election",
            "url": "https://www.herald.co.zw/zanu-pf-candidate-tsitsi-tawomhera-wins-glen-view-south-by-election/",
            "content": "Joseph Madzimure and Richard Muponde\n\nZANU PF candidate Cde Tsitsi Tawomhera has won the Glen View South by-election after garnering 3 392 votes, according to results from the Zimbabwe Electoral Commission (ZEC).\n\nThe seat fell vacancy after the death of Grandmore Hakata.\n\nCde Tawomheras triumph marks a new chapter for Glen View South.\n\nRunning on a platform focused on community development, service delivery and inclusive representation, her campaign struck a chord with voters seeking committed and responsive leadership.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/WhatsApp-Image-2025-04-12-at-6.51.40-PM1-680x380.jpeg",
            "description": "Joseph Madzimure and Richard Muponde ZANU PF candidate Cde Tsitsi Tawomhera has won the Glen View South by-election after garnering 3 392 votes, according to results from the Zimbabwe Electoral Commission (ZEC). The seat fell vacancy after the death of Grandmore Hakata. Cde Tawomhera’s triumph marks a new chapter for Glen View South. Running on […]",
            "time": "20:26",
            "date": "13 Apr 2025"
        },
        {
            "title": "Poor relays turn out Mars Botswana event",
            "url": "https://www.herald.co.zw/poor-relays-turn-out-mars-botswana-event/",
            "content": "Zimpapers Sports Hub\n\nZIMBABWES hopes to qualify for the World Relays in China were left hanging by a thread after the Botswana FNB Golden Grand Prix Championships attracted a poor field on Saturday.\n\nIn fact Zimba were saved the relays as in the womens 4100, mixed relays they were one of two teams and it was worse when in the mens 4x100m relay they ran among themselves as Team A and B.\n\nAfter a promising day in which the other events attracted good fields, the eager to qualify for the Guazhong Championships lads and lasses got a shocker at the starting point on all three.\n\nIn the mens 4x100m Team A romped to victory in 40.66 seconds with their counterparts finishing in 40.99.\n\nThe quartet of Nyasha Doka, Samkeliso Ndebele, Rutendo Vushe and Hayle Chingono gave it their all to clock 45.97 seconds trailing the other opponent Botswana who had a hearty 44.67.\n\nLeeford Zuze ran a magnificent third leg to reduce arrears after a poor second as Zimbabwe finished in 3 minutes 34.90 seconds behind Lesotho who timed 3 minutes 32.93 seconds.\n\nThe relay teams will know on Monday morning if they are among the top 32 countries in each of the relays.\n\nSixteen teams from the Olympics got an automatic entry to the World Relays in China next month.\n\nThe other slots will be concluded by World Athletics on Sunday after collating results from competitions across the globe.\n\nUntil Saturday Zimbabwe were ranked 28th in the world over the 4x400m relay still with a chance.\n\nThe Zimbabwe contingent leaves Botswana on Sunday morning.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/athlete.jpg",
            "description": "Zimpapers Sports Hub ZIMBABWE’S  hopes to qualify for the World Relays in China were left hanging by a thread after the Botswana FNB Golden Grand Prix Championships attracted a poor field on Saturday. In fact Zimba were saved the relays as in the women’s 4×100, mixed relays they were one of two teams and it […]",
            "time": "20:26",
            "date": "13 Apr 2025"
        },
        {
            "title": "Makusha clocks season best of 10.37secs.",
            "url": "https://www.herald.co.zw/makusha-clocks-season-best-of-10-37secs/",
            "content": "Zimpapers Sports Hub\n\nNGONI Makusha finished sixth in the 100m Heat One of the Botswana FNB Golden Grand Prix Athletics Championships in Gaborone.\n\nHe clocked 10.37 seconds, his fastest of the season in a race won by Abduraghmaan Karriem\n\nof South Africa in 10.07 seconds.\n\nPlace Performance Athlete Team\n\n1 10.07 ABDURAGHMAAN  KARRIEM SOUTH AFRICA\n\n2 10.25 MOTHIBI  KARABO BOTSWANA\n\n3 10.28 LETEBELE  KARABO SOUTH AFRICA\n\n4 10.29 OLAOYE  FOLA NIGERIA\n\n5 10.35 ORATILE  JUSTICE BOTSWANA\n\n6 10.37 MAKUSHA  NGONI ZIMBABWE\n\n7 10.43 MAYANA  LARONA BOTSWANA\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/03/Ngoni-Makusha.jpg",
            "description": "Zimpapers Sports Hub NGONI Makusha finished sixth in the 100m Heat One of the Botswana FNB Golden Grand Prix Athletics Championships in Gaborone. He clocked 10.37 seconds, his fastest of the season  in a race won by Abduraghmaan Karriem of South Africa in 10.07 seconds. Place     Performance     Athlete Team 1              10.07     ABDURAGHMAAN – KARRIEM     SOUTH […]",
            "time": "20:26",
            "date": "13 Apr 2025"
        },
        {
            "title": "Low voter turn-out in Glen View South by-election",
            "url": "https://www.herald.co.zw/low-voter-turn-out-in-glen-view-south-by-election/",
            "content": "Joseph Madzimure and Richard Muponde\n\nThere was low voter turnout in the Glen View South by-election held today, with about 14 percent of registered voters having cast their ballots by 4pm.\n\nVoting began smoothly at all 43 polling stations across the constituency, with all stations opening on time at exactly 7am.\n\nThe constituency has a total of 31 519 registered voters.\n\nIn the early hours, voters trickled into polling stations, but the pace slowed down significantly as midday approached.\n\nBy 4pm, only 4 410 votes had been cast, comprising 1 840 male voters and 2 570 female voters, according to figures from the Constituency Command Centre.\n\nConstituency Elections Officer Mr Killian Gambe confirmed the turnout figures and noted that the polling process had proceeded peacefully.\n\nCde Tawomhera\n\nZanu PF candidate Cde Tsitsi Tawomhera cast her vote at Glen View 3 Primary School around 9:30am.\n\nShe expressed confidence in winning the seat.\n\nI am confident of winning the seat for Zanu PF. We have done our work well, she told journalists after voting.\n\nWard 31 Elections Officer Mr Pomerai Coffee confirmed that voting had gone on without incident.\n\nAll polling stations opened on time at 7am. People are coming in to vote, and everything is proceeding peacefully, he said.\n\nThe by-election was triggered by the death of sitting Glen View South legislator Grandmore Hakata.\n\nCde Tawomhera is facing competition from four other candidates: three independents  Tungamirai Madzokere, Toenderai Chakaredza and George Makwangwaidze  and National Constitutional Assembly (NCA) candidate Perpetua Mukanda.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/WhatsApp-Image-2025-04-12-at-6.51.40-PM-680x380.jpeg",
            "description": "Joseph Madzimure and Richard Muponde There was low voter turnout in the Glen View South by-election held today, with about 14 percent of registered voters having cast their ballots by 4pm. Voting began smoothly at all 43 polling stations across the constituency, with all stations opening on time at exactly 7am. The constituency has a […]",
            "time": "20:26",
            "date": "13 Apr 2025"
        },
        {
            "title": "ZANU PF begins process to replace expelled Geza",
            "url": "https://www.herald.co.zw/zanu-pf-begins-process-to-replace-expelled-geza/",
            "content": "Conrad Mupesa\n\nMashonaland West Bureau\n\nZANU PF Mashonaland West province has initiated the process to replace expelled war veteran Mr Blessed Geza in its structures.\n\nMr Geza was dismissed for undermining the authority of the President and is reportedly in hiding.\n\nHe was a member of the partys Central Committee, the highest decision-making body between Congresses.\n\nHe was expelled alongside Gifford Gomwe, also from the same province, who faces similar charges.\n\nSpeaking at a Provincial Coordinating Committee (PCC) meeting held on Saturday at Mbafa Primary School in Chegutu East, Zanu PF Mashonaland West provincial chairperson, Cde Mary Mliswa-Chikoka, confirmed that the party was moving swiftly to fill the vacant positions.\n\nThe disciplinary action comes as the ruling party continues to tighten internal controls and reaffirm loyalty to President Mnangagwas leadership.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/08/Mary-Mliswa-Chikoka.jpg",
            "description": "Conrad Mupesa Mashonaland West Bureau ZANU PF Mashonaland West province has initiated the process to replace expelled war veteran Mr Blessed Geza in its structures. Mr Geza was dismissed for undermining the authority of the President and is reportedly in hiding. He was a member of the party’s Central Committee, the highest decision-making body between […]",
            "time": "20:26",
            "date": "13 Apr 2025"
        },
        {
            "title": "Voting underway in Glen View South by-election",
            "url": "https://www.herald.co.zw/voting-underway-in-glen-view-south-by-election/",
            "content": "Joseph Madzimure and Richard Muponde\n\nVOTING in the Glen View South constituency began smoothly this morning, with a steady stream of voters arriving at polling stations to cast their ballots.\n\nAll 43 polling stations in the constituency opened on time, at exactly 7 am.\n\nGlen View South has a registered voter population of 31 519.\n\nWard 31 elections officer Mr Pomerai Coffee confirmed that the process was proceeding without incident.\n\nWe opened all polling stations at 7am as scheduled. People are coming in to cast their votes, and so far, there have been no reports of violence, said Mr Coffee.\n\nZANU PF candidate Cde Tsitsi Tawomhera cast her vote at Glen View 3 Primary School at 9.30 am.\n\nSpeaking to the media afterwards, she expressed confidence in securing victory.\n\nI am confident of winning the seat for ZANU PF. We have done our groundwork and connected well with the electorate, she said.\n\nThe by-election was triggered by the death of sitting Glen View South legislator Grandmore Hakata.\n\nCde Tawomhera is facing competition from four other candidates: three independents  Tungamirai Madzokere, Toenderai Chakaredza and George Makwangwaidze  and National Constitutional Assembly (NCA) candidate Perpetua Mukanda.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/WhatsApp-Image-2025-04-12-at-10.21.27-680x380.jpeg",
            "description": "Joseph Madzimure and Richard Muponde VOTING in the Glen View South constituency began smoothly this morning, with a steady stream of voters arriving at polling stations to cast their ballots. All 43 polling stations in the constituency opened on time, at exactly 7 am. Glen View South has a registered voter population of 31 519. […]",
            "time": "20:26",
            "date": "13 Apr 2025"
        },
        {
            "title": "‘SMEs major economic drivers’",
            "url": "https://www.herald.co.zw/smes-major-economic-drivers/",
            "content": "Zvamaida Murwira, Senior Reporter\n\nSMALL to Medium Enterprises (SMEs) are a key driver of economic growth, broad-based empowerment, job and wealth creation, contributing significantly to the countrys Gross Domestic Product, President Mnangagwa has said.\n\nCommissioning the Mbare Musika Traders Market Phase 1, a state-of-the-art facility that is set to benchmark the modern SMEs trading environment, President Mnangagwa said the importance of the Small and Medium Enterprises sector to the growth of the economy cannot be over-emphasised.\n\nCompletion of the first phase of the market paved the way for 1 628 traders to begin operations and comes as a timely relief for traders who lost their stalls and stock last year in a fire outbreak.\n\nThe President said the SMEs sector stands as one of the critical pillars of the economy, contributing significantly to the total Gross Domestic Product.\n\nMy Government, thus, recognises that SMEs are a key driver of economic growth, job creation, wealth creation and broad-based empowerment, he said.\n\nPresident Mnangagwa said his just-ended visit to the 11th Session of the Africa Regional Forum on Sustainable Development in Uganda, as Chairman of SADC, discussed the importance of driving job creation and economic growth, mainly through young people and women.\n\nI, therefore, challenge the entrepreneurs of our country to scale up the establishment of small businesses and start-ups in line with emerging trends and digital technologies.\n\nAs a Government, we are ready to support solutions and new products related to agriculture, financial and climate technologies among others that must propel the industrialisation of our country, he said.\n\nAn aerial view of the newly-built Mbare Traders Market in Harare that was commissioned by President Mnangagwa yesterday.  Picture: OPC\n\nPresident Mnangagwa said the facilitation of more opportunities and windows of support such as low-interest financing, business development services, transfer of skills and technologies as well as market access for the sector, will be availed.\n\nHe directed all partners to the Mbare Musika Traders Market and future projects to ensure that levies and rentals are pegged at competitive and affordable levels.\n\nOccupants and customers of the markets were also called upon to be responsible custodians of the modern facilities.\n\nThe President called for collaborative synergies between SMEs and relevant ministries, departments and agencies, saying such collaboration was important towards the formalisation of small businesses and start-ups.\n\nAs we continue to diversify our economy, the formalisation of this sector must never be viewed as a direct threat to the survival and sustainability of your respective businesses.\n\nOn its part, my Government will continue to improve the ease of doing business, through reducing barriers to entry, as well as streamlining business registration, licencing and compliance levies.\n\nDialogue with the SMEs sector is an essential building block for enhanced business productivity. There should not be a them and us mentality, said President Mnangagwa.\n\nHe added that the Government and SMEs sector must act as one for the good of the country.\n\nThe Ministry of SMEs was challenged to deploy innovative initiatives that will see more SMEs becoming fully fledged business entities with footprints beyond Zimbabwe and the SADC region.\n\nGovernment is determined to see the realisation of the Urban Transformation Agenda designed to primarily focus on addressing rapid urbanisation by prioritising safe, inclusive, resilient and sustainable cities and human settlements, in line with Sustainable Development Goal (SDG) Number 11.\n\nPresident Mnangagwa said Phase 2 of the New Mbare Musika is designed to be a multi-storey complex with improved sanitation, fire safety features and organised trading spaces, thus resonating with Vision 2030 and the SDGs.\n\nHe applauded Masimba Construction and Mkambo Misika Hubs, whopartnered the Government in the project, for their professionalism and work ethic, which have ensured the completion of Phase 1 of the market.\n\nEarlier on, President Mnangagwa commended Mbare residents for their consistent support of Zanu PF that saw the revolutionary party winning in that constituency in the 2023 harmonised elections.\n\nBe assured that the interests of the people of our great motherland, Zimbabwe, remain at the core of my Administration. Two weeks ago, I was pleased to receive, at State House, representatives of Vendors and Tuckshops Associations from across the country.\n\nThat engagement, among many others I have had in the recent past, gave me general insights into matters that concern you and the broader Micro, Small and Medium Enterprises sector. Government is seized with facilitating an environment where your businesses can thrive for an improved standard of living for all, he said.\n\nDefence Minister Oppah Muchinguri-Kashiri said the construction of the market resonated with President Mnangagwas national vision spelt out in the National Development Strategy 1 and Governments ultimate goal of elevating Zimbabweans to a prosperous and empowered upper-middle-income society by 2030.\n\nThis bustling market has been a cornerstone of Zimbabwes SMEs and a vital source of livelihood for traders and their families.\n\nThis initiative has not only restored the markets infrastructure but also upgraded it to a cutting-edge facility, demonstrating Governments commitment to creating an enabling environment for businesses to thrive, she said.\n\nLocal Government and Public Works Minister, Daniel Garwe, said the commissioning of the market was a precursor to the second phase of another market to accommodate more people.\n\nThis event also marks the ground-breaking ceremony of the main market, which is going to accommodate 10 000 traders, he said.\n\nMinister Garwe said following the fire disaster that destroyed stock and stalls, President Mnangagwa directed the engagement of domestic investor, Masimba Holdings, in terms of the urban transformation policy to undertake reconstruction works.\n\nThe infrastructure, as you have witnessed, Your Excellency, is augmented by social amenities such as banks, Zimbabwe Republic Police Post, advanced security services, CCTV, advanced ablution facilities, advanced fire suppression systems, and availability of water infrastructure, among others, he said.\n\nWomen Affairs, Community, Small and Medium Enterprises Development Minister, Senator Monica Mutsvangwa, said the new market was set to transform the SMEs sector that has been looked down upon over the years.\n\nMinister of State for Provincial Affairs and Devolution for Harare Metropolitan, Charles Tawengwa, commended President Mnangagwa for restoring the livelihood of traders following the fire outbreak.\n\nYesterdays event was attended by Cabinet Ministers, permanent secretaries, Harare City councillors, captains of industry, Zanu PF leadership, and traders, among others.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/HE1-3.jpg",
            "description": "Zvamaida Murwira, Senior Reporter SMALL to Medium Enterprises (SMEs) are a key driver of economic growth, broad-based empowerment, job and wealth creation, contributing significantly to the country’s Gross Domestic Product, President Mnangagwa has said. Commissioning the Mbare Musika Traders Market Phase 1, a state-of-the-art facility that is set to benchmark the modern SMEs trading environment, […]",
            "time": "20:26",
            "date": "13 Apr 2025"
        },
        {
            "title": "President appoints two ministers",
            "url": "https://www.herald.co.zw/president-appoints-two-ministers-2/",
            "content": "Columbus Mabika, Herald Reporter\n\nPRESIDENT Mnangagwa has appointed Dr Evelyn Ndlovu Environment, Climate and Wildlife Minister with immediate effect.\n\nHe also appointed Cde Albert Nguluvhe as the Minister of State for Matabeleland South Provincial Affairs and Devolution.\n\nCde Albert Nguluvhe\n\nIn a statement last night, Chief Secretary to the President and Cabinet, Dr Martin Rushwaya, said: In terms of Section 104, Subsection 1 of the Constitution of Zimbabwe, His Excellency, the President, Cde Dr Emmerson Dambudzo Mnangagwa, has appointed Honourable Evelyn Ndlovu (MP), as Minister of Environment, Climate and Wildlife with immediate effect.\n\nIn a separate statement, Dr Rushwaya said: His Excellency the President of the Republic of Zimbabwe has in terms of Section 104, Subsection (1) of the Constitution of Zimbabwe, appointed Honourable Albert Nguluvhe (MP), as Minister of State for Provincial Affairs and Devolution, Matabeleland South Province, with immediate  effect.\n\nDr Ndlovu, who has been Minister of State for Matabeleland South Provincial Affairs and Devolution since 2023, replaces Dr Sithembiso Nyoni, who was removed from the ministry about two weeks ago.\n\nShe is a veteran politician who previously served as Minister of Primary and Secondary Education.\n\nCde Nguluvhe is Beitbridge East legislator, having first won the seat in the 2018 harmonised elections.\n\nIn October 2023, Cde Nguluvhe was named Chairperson of the Parliamentary Portfolio Committee on Defence, Home Affairs, Veterans of the Liberation Struggle and Security in the 10th Parliament of Zimbabwe.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/02/Dr-Evelyn-Ndlovu.jpg",
            "description": "Columbus Mabika, Herald Reporter PRESIDENT Mnangagwa has appointed Dr Evelyn Ndlovu Environment, Climate and Wildlife Minister with immediate effect. He also appointed Cde Albert Nguluvhe as the Minister of State for Matabeleland South Provincial Affairs and Devolution. In a statement last night, Chief Secretary to the President and Cabinet, Dr Martin Rushwaya, said: “In terms […]",
            "time": "20:26",
            "date": "13 Apr 2025"
        },
        {
            "title": "PVO Amendment Bill gets Presidential assent",
            "url": "https://www.herald.co.zw/pvo-amendment-bill-gets-presidential-assent/",
            "content": "Farirai Machivenyika, Senior Reporter\n\nPRESIDENT Mnangagwa has assented to the Private Voluntary Organisations Amendment Bill which becomes law.\n\nThe new Act was published in the Government Gazette yesterday by the Chief Secretary to the President and Cabinet, Dr Martin Rushwaya, under General Notice 620 of 2025.\n\nThe following law, which was assented to by His Excellency the President, is published in terms of subsection 6 (a) of section 131 of the PVO Amendment Act (No.1) of 2025, Dr Rushwaya said.\n\nThe new law will ensure the country complies with the recommendations of the Financial Action Taskforce to prevent the abuse of charities for the financing of criminal and terrorist activities.\n\nIt will also streamline the administration, accountability and transparency of charity organisations and provide a more detailed definition and interpretation of terms used in the principal Act.\n\nThe Act provides for the inclusion of the definition of funds or other assets, which is very wide-ranging, to include all financial assets and funds or other assets of any kind.\n\nIt also amended the definition of Private Voluntary Organisation to ensure it covers all relevant organisations that fall under this law, even when the coverage is confined to ensuring an entity is not being used to launder terrorist funds.\n\nIn view of the international dimension of terrorist and proliferation financing through the abuse of charities, a definition for Financial Intelligence Unit of the Reserve Bank is necessary because of the role the unit will play in assisting the Registrar of Private Voluntary Organisations in that regard, reads the preamble of the Act.\n\nThe definition of private voluntary organisation excludes from the scope of that term certain activities, for example, fundraising for schools or hospitals by or on behalf of the schools or hospitals concerned. However, even excluded activities may come within the scope of monitoring against money laundering if the activities are carried on by any high-risk entity.\n\nClause Six repeals the existing section of the principal Act requiring the registration of a PVO and replaces it with a more comprehensive provision that brings within the scope of registration certain trusts that were previously excluded from registration.\n\nIt requires organisations not previously within the scope of the PVO Act to now register as PVOs, but in these cases, time will be given for compliance.\n\nThis means those organisations not registered as trusts, but which receive external funding to pursue objects of a charitable nature, such organisations will be afforded a reasonable period to comply with the Act.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/09/martinrushwaya-451x380.jpg",
            "description": "Farirai Machivenyika, Senior Reporter PRESIDENT Mnangagwa has assented to the Private Voluntary Organisations Amendment Bill which becomes law. The new Act was published in the Government Gazette yesterday by the Chief Secretary to the President and Cabinet, Dr Martin Rushwaya, under General Notice 620 of 2025. “The following law, which was assented to by His […]",
            "time": "20:26",
            "date": "13 Apr 2025"
        },
        {
            "title": "PRAZ to boost economic growth",
            "url": "https://www.herald.co.zw/praz-to-boost-economic-growth/",
            "content": "Mukudzei Chingwere, Herald Reporter\n\nVice President Constantino Chiwenga has said the new PRAZ head office project goes beyond the construction of a physical structure but marks a bold step in strengthening national procurement systems, enhancing transparency, and driving institutional efficiency.\n\nHe was speaking at the groundbreaking ceremony for the new PRAZ head office in Harare yesterday.\n\nMost importantly, it underscores our unwavering commitment to sustainable development and innovation as we strive to build a modern, forward-looking Zimbabwe, said VP Chiwenga.\n\nThe Vice President also encouraged contractors to uphold high standards of workmanship and ethical practices throughout the construction period. His address served as a reminder of the broader implications of the project, which aims to bolster Zimbabwes procurement systems while contributing to local economic growth.\n\nI am particularly pleased to highlight that the design of this new facility incorporates sustainability principles and energy-efficient technologies, said VP Chiwenga.\n\nIn an era where climate consciousness is no longer optional but essential, this project reflects the countrys forward-thinking approach. It will serve as a lasting testament to our responsibility not just to current generations but to those who will inherit the Zimbabwe of tomorrow, said VP Chiwenga.\n\nAs we stand at the start of this exciting journey, let us reflect on the true significance of what we are initiating today. We are laying the foundation not only of a new building but of a renewed procurement system, one that is modern, transparent, and effective.\n\nMinister of State for Harare Metropolitan Province Cde Charles Tavengwa expressed his delight that PRAZ acquired their land legally and that they are building their head office in the Sunshine  City.\n\nContractor and Zimbuild chief executive officer Dr Tinashe Manzungu said they are happy to be entrusted with the project.\n\nWe are honoured to be entrusted with this significant project, which reflects our commitment to quality and innovation in construction, said Dr Manzungu.\n\nOur team is excited to collaborate with local stakeholders and ensure that this development meets the needs of the community while adhering to the highest standards of safety and sustainability. We look forward to making a positive impact through our work and contributing to the countrys growth.\n\nPRAZ chief executive officer Dr Clever Ruswa said the structure will be partially funded by PRAZ with support from the Government.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/VP-1.jpg",
            "description": "Mukudzei Chingwere, Herald Reporter Vice President Constantino Chiwenga has said the new PRAZ head office project goes beyond the construction of a physical structure but marks a bold step in strengthening national procurement systems, enhancing transparency, and driving institutional efficiency. He was speaking at the groundbreaking ceremony for the new PRAZ head office in Harare […]",
            "time": "20:26",
            "date": "13 Apr 2025"
        }
    ]
}