{
    "news": [
        {
            "title": "AFZ pilot dies in plane crash",
            "url": "https://www.herald.co.zw/afz-pilot-dies-in-plane-crash/",
            "content": "Columbus Mabika\n\nHerald Reporter\n\nThe Zimbabwe Defence Forces (ZDF) has announced the death of an Air Force of Zimbabwe pilot, Air Lieutenant Nesbert Tambudza.\n\nAir Lieutenant Tambudza died this afternoon after the Karakorum-8 (K-8) jet trainer aircraft that he was flying crashed in the Guinea Fowl area in Gweru.\n\nIn a statement, ZDF said the accident happened when the pilot was on a solo consolidation general handling navigation training.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Airforce-680x380.jpg",
            "description": "Columbus Mabika Herald Reporter The Zimbabwe Defence Forces (ZDF) has announced the death of an Air Force of Zimbabwe pilot, Air Lieutenant Nesbert Tambudza. Air Lieutenant Tambudza died this afternoon after the Karakorum-8 (K-8) jet trainer aircraft that he was flying crashed in the Guinea Fowl area in Gweru. In a statement, ZDF said the […]",
            "time": "21:46",
            "date": "06 Feb 2025"
        },
        {
            "title": "Former Manicaland Governor Chigudu dies",
            "url": "https://www.herald.co.zw/former-manicaland-governor-chigudu-dies/",
            "content": "Lovemore KadzuraManicaland Bureau\n\nFORMER Manicaland Provincial Governor and liberation war stalwart, Cde Tinaye Elisha Nzirasha Chigudu (83) has died.\n\nCde Chigudu died at his Mt Pleasant home in Harare yesterday night after a long illness.\n\nCde Chigudus brother, Cde Edgar Tafirenyika Chigudu, confirmed the news.\n\nMy brother passed on at his Mt Pleasant home, said Cde Chigudu.\n\nThe late Cde Chigudu fought for the independence of this country under the ZimbabweAfrican Peoples Union military wing ZIPRA.\n\nHe held several posts in the civil service, and also served as the Governor ofManicaland Province.\n\nHe had been unwell for a long time.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/images-17.jpeg",
            "description": "  Lovemore Kadzura Manicaland Bureau FORMER Manicaland Provincial Governor and liberation war stalwart, Cde Tinaye Elisha Nzirasha Chigudu (83) has died. Cde Chigudu died at his Mt Pleasant home in Harare yesterday night after a long illness. Cde Chigudu’s brother, Cde Edgar Tafirenyika Chigudu, confirmed the news. “My brother passed on at his Mt Pleasant […]",
            "time": "21:46",
            "date": "06 Feb 2025"
        },
        {
            "title": "Live Coverage: Commission exposes more rot at Harare City Council",
            "url": "https://www.herald.co.zw/live-coverage-commission-exposes-more-rot-at-harare-city-council/",
            "content": "14.37 The City of Harare has been plagued by corruption, mismanagement, and lack of accountability, according to testimonies made over the last few months before the Commission of Inquiry into the citys governance.\n\nPresident Mnangagwa swore in the five-member Commission in May 2024.\n\nThe Justice Maphios Cheda-led Commission also includes local governance experts Steven Chakaipa, Norbert Phiri, Lucia Gladys Matibenga and Khonzani Ncube.\n\nThe Permanent Secretary for Local Government and Public Works, Dr John Bhasera, is its secretary.\n\nSeveral top officials, including the councils Mayor Jacob Mafume; assistant executive to the town clerk, Matthew Marara; acting finance director Godfrey Kusangaya and acting human capital director, Bosman Matengarufu, among others, have appeared before the Commission.\n\nWith each appearance of a top official, skeletons have been tumbling out of closets.\n\nOne thing is certain, the Commission means business and they will stop at nothing in exposing the rot at the local authority.\n\nAs we cover this intriguing story that looks at how public funds are being abused brazenly, the ride is definitely going to have so many astounding twists and turns.\n\nJust put on your seatbelt and enjoy the ride!\n\n14.37 Harare Mayors house turns out to be vehicle auction site\n\nDrama unfolded in Greendale, Harare today (February 5), as the Commission temporarily adjourned Mayor Mafumes testimony to conduct an onsite inspection at a property he had claimed to be his house.\n\nThe Commissions findings revealed that the property, located on Coronation Road at number 1110 in Greendale, is not a residential area as claimed, but a vehicle auction site.\n\nWhen Mayor Mafume attempted to explain the discrepancy, Judge Cheda instructed him to provide his explanation at a later time.\n\nThe Commission insisted on an inspection in loco after discovering that Mayor Mafume had lied under oath.\n\nMayor Mafume claimed it was a mistake, saying his house was just two blocks away from the initial address.\n\nHowever, the Commission refused to accept this and proceeded with the inspection.\n\n14.45 Eyebrows raised as Harare City buys US$1m Ruwa house\n\nThe Harare City Medical Aid Society has come under fire for purchasing a 12-roomed house in Ruwa for a staggering US$1 million.\n\nThis transaction is drawing scrutiny amid ongoing investigations by the Harare Commission of Inquiry, which aims to expose pervasive corruption within the city council.\n\nThe inquiry has revealed a pattern of mismanagement and financial irregularities in the local authority, where public funds are often misappropriated for personal gains.\n\nRecent reports indicated that the Medical Aid Society acquired properties without obtaining title deeds, which has led to complications in tracing these assets.\n\nThis alarming situation came to light yesterday (February 4) during an inquiry session where Mayor Mafume addressed allegations of corruption and mismanagement within the council.\n\nThe Mayors involvement in the Medical Aid Societys dealings has raised eyebrows, especially since he is largely seen as a ceremonial figure in the council.\n\nBut when questioned about his presence at the Medical Aid Society meetings, Mayor Mafume said his oversight is essential given the magnitude of the alleged theft.\n\nI attended that Medical Aid Society meeting because US$1 million had been stolen. How can it be ordinary? he said.\n\nThe house, which was reportedly owned by Dr Munyaradzi Kereke, is intended to be converted into a clinic.\n\nHowever, the Mayor criticised the decision to spend such an exorbitant sum while city employees struggle to access medical treatment due to financial mismanagement, revealing a disconnect between the councils financial priorities and the welfare of its workers.Mayor Mafume said he is often called to address issues regarding delayed salaries.\n\nMoney is being paid twice, he said, indicating a troubling pattern of financial irregularities that raise concerns about the accountability of council officials.\n\n14.54 Council has no control over its firms: Mayor\n\nHarare City Council risks losing its companies amid indications that the subsidiaries, including Harare Quarry and Rufaro Marketing, are registered in the names of individuals, some of whom have since left the local authority.\n\nFurther, council also offered free land to individuals through verbal agreements.\n\nCity Parking, which is wholly-owned by the local authority, had its papers changed sometime last year as it was in the names of previous directors during the era of former Harare Town Clerk Tendai Mahachi.\n\nThe rot, especially at Rufaro Marketing, resulted in council spending 13 years without collecting a cent from its 130 beerhalls.\n\nA report of the special committee on Rufaro Marketing, mandated to run the beerhalls, showed that current and former council employees were subletting the beerhalls in foreign currency, yet paying a paltry fee to council, if at all.\n\nSpeaking during a special council meeting last year, Mayor Jacob Mafume conceded that the city has no control over its assets.\n\nMayor Jacob Mafume\n\nCannibalism had set-in in council. Share certificates were put in names of certain individuals who were then fired or left council for one reason or the other and it was taking time to find signatories.\n\nWe have ordered that those papers be regularised.\n\nCity Parking papers have since been regularised and we are looking at the Quarry papers for their regularisation, he said.\n\nMayor Mafume said as for Rufaro Marketing, a former chief executive had basically run away with the organisation.\n\nWe have now put in a new board and we are asking that the situation be rectified.\n\n09:02-Mayor feels the heat\n\nHarare Mayor Jacob Mafume is back in the hot seat today (February 6), testifying before the Commission of Inquiry into the affairs of Harare City Council.\n\nThe Commission, led by retired Judge, Justice Maphios Cheda, is investigating the councils operations and business units from 2017 to date, following allegations of widespread irregularities.\n\nMayor Mafume has been asked to read the Commissions of Inquiry Act after he denied that he lied under oath yesterday when he gave a false address of his residence. He claims that it was just a mistake.\n\nAccording to the Commissions of Inquiry Act, any witness who provides false evidence shall be guilty of an offence.\n\n09:12-Mafume admits to lying under oath\n\nMayor Mafume has come clean about lying under oath, although he tried to downplay it as an honest mistake.\n\nHe claimed that he recently moved to a new apartment and said his house is Number 102 Coronation, Greendale, which is just two blocks from the address he initially provided, which is Number 110 Coronation.\n\nThe Mayor also blamed his forgetfulness on a Government trip he took shortly after moving in, saying he was not even in the country to get familiar with the new place.\n\nHowever, the Ministry of Justice, Legal and Parliamentary Affairs Chief Director, Mr Tapiwa Godzi who is one of the leading evidence witnesses, has alleged that Mayor Mafumes false address was a deliberate move to conceal his Greendale house, which he purportedly acquired using proceeds of crime.\n\n11.28 -Harare ignores Mayoral Mansion, acquires house for Mafume\n\nJustice Cheda has said the vehicle, house, and other perks that Mayor Mafume is receiving as benefits are in contravention of a Governments directive.\n\nThis came up as Mayor Mafume was being questioned on why the council acquired a house for him at Number 9 Drummond Chaplin Road in Milton Park. This goes against the Ministry of Local Government and Public Works policy that councillors are only entitled to stands, not houses.\n\nHowever, the Mayor argued that the circular only refers to stands that councillors can buy at a discounted price. He said this does not prevent the council from finding comfortable residence for councillors.\n\nHe says the circular does not explicitly prohibit the council from acquiring a house for him.\n\nWhen asked by Commissioner Tafadzwa Charles Hungwe why the council decided to acquire a stand for him despite the fact that there is a Mayoral mansion, Mafume said it was justified at the time as the property was being used as an office.\n\nHowever, Mr Hungwe argued that the Mayor is no longer entitled to a house as his role is now ceremonial, following the Governments cancellation of all perks.\n\nHe further argued that the Mayor should not be receiving benefits that come with an executive office.\n\n11.52 US$4.5 was stolen at Harare Quarry: Mafume\n\nHarare Mayor Mafume has said a whopping US$4.5 million was embezzled from Harare Quarry, a subsidiary of the Harare City Council.\n\nHowever, Mafume claims that he never bothered to make a police report or to investigate where the money went, despite being in office since 2018.\n\nWhen questioned about his lack of action, he said he only changed the management of the business unit to prevent further financial losses.\n\nMeanwhile, the Commission has adjourned to 11:30 am today.\n\n12:07-l am sorry, says Mafume\n\nHarare Mayor, Councillor Jacob Mafume, has admitted that he is receiving allowances that he is not entitled to.\n\nAppearing before the Commission of Inquiry into Harare City Councils affairs, Councillor Mafume conceded that his actions had negatively impacted service delivery for ratepayers.\n\nThe admission came after the Justice Maphios Cheda chaired inquiry revealed that Mafume is getting benefits that are outside his official entitlements.\n\nIn the context that our interpretation of the Act led to harm and prejudice for ratepayers, I am sorry, said Mafume.He further stated his readiness to correct the misinterpretation of the Government circular outlining his official entitlements.\n\n12:17-City housing director grilled over cluster housesThe Commission of Inquiry into the City of Harares operations is turning up the heat on the local authoritys housing director,\n\nMr Addmore Nhekairo, as he faces intense questioning over the proliferation of cluster houses in Harare.\n\nMr Nhekairo is appearing before the Commission today to explain the city councils role in approving the construction of cluster houses.\n\nThe settlements have been criticized for being poorly planned and inadequately serviced.\n\nThe Commission is demanding to know who is responsible for the mess and why the city council failed to ensure that the cluster houses are properly planned and serviced.\n\n13.26 Council to regularise 16 000 stands\n\nHarare City Council is set to regularise over 16 000 stands that were invaded by land barons and other individuals, the citys housing director has told the Commission.\n\nThis comes amid revelations that council officials are allowing individuals to build on unserviced land in order to pave way for them to loot stands.\n\nWhen asked whether it was a political move to dish out stands ahead of the 2023 elections, Mr Nhekairo said, We were looking at people who had invaded large pieces of land, and we could not move ahead and remove them without an alternative.\n\nThe law dictates that once a person has slept on a property, you will need a court order to remove them.\n\n14.01 ZACC is investigating US$4,5 million loot: Acting chamber secretary\n\nThe Commission of Inquiry into the City of Harares operations has taken a new turn, with the acting chamber secretary, Mr Warren Chiwawa, being called in to testify.\n\nMr Chiwawa is being questioned about the councils slow response in reporting the alleged looting of US$4,5 million from Harare Quarry.\n\nThe council boss denied any wrongdoing, stating that he was not in office when the money went missing.\n\nHowever, he said the matter was reported to the Zimbabwe Anti-Corruption Commission (ZACC) last September.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/c4dd30a0-69c5-495e-bf5b-1350b9c59aee.jpeg",
            "description": "14.37 – The City of Harare has been plagued by corruption, mismanagement, and lack of accountability, according to testimonies made over the last few months before the Commission of Inquiry into the city’s governance. President Mnangagwa swore in the five-member Commission in May 2024. The Justice Maphios Cheda-led Commission also includes local governance experts Steven […]",
            "time": "21:46",
            "date": "06 Feb 2025"
        },
        {
            "title": "US$4.5m was stolen at Harare Quarry: Mayor Mafume",
            "url": "https://www.herald.co.zw/us4-5m-was-stolen-at-harare-quarry-mayor-mafume/",
            "content": "Trust Freddy\n\nHerald Correspondent\n\nHarare Mayor Jacob Mafume has said a whopping US$4.5 million was embezzled from Harare Quarry, a subsidiary of the Harare City Council.\n\nHowever, Mafume claims that he never bothered to make a police report or to investigate where the money went, despite being in office since 2018.\n\nWhen questioned about his lack of action, he said he only changed the management of the business unit to prevent further financial losses.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/e57370dd-8479-46dc-a4c6-665c187dfd92-680x380.jpeg",
            "description": "Trust Freddy Herald Correspondent Harare Mayor Jacob Mafume has said a whopping US$4.5 million was embezzled from Harare Quarry, a subsidiary of the Harare City Council. However, Mafume claims that he never bothered to make a police report or to investigate where the money went, despite being in office since 2018. When questioned about his […]",
            "time": "21:46",
            "date": "06 Feb 2025"
        },
        {
            "title": "CIMMYT donates agricultural implements to Gwebi",
            "url": "https://www.herald.co.zw/cimmyt-donates-agricultural-implements-to-gwebi/",
            "content": "Patience Maturure\n\nAgriculture Reporter\n\nTHE International Maize and Wheat Improvement Centre (CIMMYT) has donated agricultural machinery to Gwebi College of Agriculture to enhance the efficacy of crop breeding cycles and development of new, improved varieties for smallholder farmers.\n\nReceiving the consignment that included a tractor, boom sprayer, plough, breeding support system and weather station on behalf of the institute on Wednesday, Lands, Agriculture, Fisheries, Water and Rural Development permanent secretary, Professor Obert Jiri said CIMMYTS gesture would go a long way in modernising breeding programmes.\n\nI am here because I firmly believe in the importance of research in driving development so we cant talk of agricultural progress if we dont talk about research, it is the basis we might need and get into agriculture.\n\nThe importance of research cannot be over emphasised, as no country develops its agriculture without a strong base of agricultural research and that is why we are here to really celebrate this recognition that CIMMYT has given us and which we accept firmly with gratitude, he said.\n\nProf Jiri disclosed that he was with CIMMYT in 1996 and the institute had been a partner to the country for a long time.\n\nPro Jiri said the institution had evolved over the years and contributed a lot in terms of exchange of genetic material between the Consumer Price Index (CPI) and CIMMYT as well as trainings that happened between Government stuff in CIMMYT Zimbabwe, CIMMYT Mexico and CIMMYT Kenya among others.\n\nThis modernisation that you are pushing now is really critical to ensure that we have the best of breeding improvement. This donation of equipment, which was done within the context of the Crops to End Hunger programme is meant to really modernise breeding programmes and strengthen partnerships that we have and I would want to acknowledge CIMMYTs major role in this project, highlighted Prof Jiri.\n\nAmong the benefits of the modernisation breeding programmes are a reduction in drudgery in field operations, improved access to research and technical roles for women and enhanced quality of breeding activities.\n\nIt takes seven years for a crop variety to complete the cycle of breeding before release on to the market provided there was no disturbance in these years, for instance, through drought or pest outbreaks.\n\nThe location of CIMMYT ensures their maximum contribution in terms of partnership and agricultural development.\n\nCIMMYT country representative Mr Mainassara Zaman-Allah said under the Crops to End Hunger programme they were seized with upgrading facilities on breeding stations, capacitating the stuff to use latest technology and drive genetic gains in developing new varieties.\n\nThe programme is being implemented in 22 countries inclusive of Zimbabwe with the country breeding 13 crop varieties. The programme is meant to make Zimbabwe the leader in improved high yield crop varieties to lift the countrys average maize yield from below one tonne per hectare to over two.\n\nThe CIMMTY representative acknowledged that new diseases and pests had come through and at the moment they were fighting fall army worm, maize streak virus and other diseases.\n\nWe have bred better varieties to withstand those diseases and we need more climate resilient smart varieties with tolerance to high temperatures and low rainfall, he added.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/professor-obert-jiri-old.jpg",
            "description": "  Patience Maturure Agriculture Reporter THE International Maize and Wheat Improvement Centre (CIMMYT) has donated agricultural machinery to Gwebi College of Agriculture to enhance the efficacy of crop breeding cycles and development of new, improved varieties for smallholder farmers. Receiving the consignment that included a tractor, boom sprayer, plough, breeding support system and weather station […]",
            "time": "21:46",
            "date": "06 Feb 2025"
        },
        {
            "title": "Registration of tobacco transporters gets underway",
            "url": "https://www.herald.co.zw/registration-of-tobacco-transporters-gets-underway/",
            "content": "Edgar Vhera\n\nAgriculture Specialist Writer\n\nWITH the 2025 tobacco marketing season fast approaching, the Tobacco Industry and Marketing Board (TIMB) has commenced registering transporters in line with the tobacco transporter administration framework introduced last year.\n\nTIMB has since developed a robust transport administration system to counter challenges of criminal activities such as side marketing, tobacco bale thefts, bale swapping and forgery of stop order facilities.\n\nThis comes as farmers eagerly await the announcement of the dates of the seasons opening.\n\nIn a recent X (formerly Twitter) post targeting transporters, TIMB said: Attention transporters, registration is now open to be a tobacco transporter for the 2025 marketing season. Ensure you have a valid TIMB permit to move tobacco legally and efficiently.\n\nThe registration fee for first timers is US$150 while renewals attract US$100. TIMB also outlined the registration guidelines for individual or company transporters.\n\nFor individual registration, a photocopy of the vehicle registration book and/or agreement of sale if applicable, as well as valid goods in transit insurance are required.\n\nA national identification document (ID), passport or drivers licence together with an affidavit if registering on behalf of absent owners is also necessary, read the post.\n\nCompany registrations require a photocopy of the vehicle registration book in the company name, CR14 and certificate of incorporation, valid tax clearance and in transit insurance certificate.\n\nGrowers transporting own tobacco should obtain a pass from TIMB and clearly mark grower numbers on tobacco bales in transit, TIMB further advised.\n\nTransporters can register at any TIMB office in Harare, Mutare, Rusape, Marondera, Chinhoyi, Karoi, Mvurwi or Bindura before the start of the marketing season.\n\nTIMB public affairs officer, Mrs Chelesani Tsarwe said the framework would work towards developing a vibrant system that monitors the movement of tobacco from the primary source up to the market.\n\nTobacco is a regulated crop that contributes 10 percent to Zimbabwes gross domestic product (GDP) and supports over 100 000 families.\n\nRegistration is essential to ensure transparency, accountability and compliance while preventing illicit trade of the golden leaf, she said.\n\nThe tobacco transporter administration framework also sets guidelines to ensure that only registered and compliant transporters handle tobacco.\n\nMrs Tsarwe said registration also protected farmers from getting robbed of their hard work by unscrupulous transporters whom they would have no way of tracing unless registered by TIMB.\n\nIn cases of misunderstandings with a registered transporter, TIMB can then offer arbitration and ensure the farmer does not lose out.\n\nThe Zimbabwe Republic Police (ZRP) will also require the permit at road blocks they will mount on major roads leading to marketing places to safeguard the interests of all stakeholders, she added.\n\nWhere a tobacco transporter violates any of the conditions, as set out in the transporters framework, TIMB will have the right to suspend the permit for up to four years or even cancel it permanently.\n\nSome of the conditions warranting cancellation or suspension of a tobacco transporter permit include conviction for the offence of furnishing false information, failing to comply with conditions or duties, involvement in criminal activities and violation of expected standards regarding child labour and sustainable production methods.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/07/flue-cured-tobacco-640x380.jpg",
            "description": "  Edgar Vhera Agriculture Specialist Writer WITH the 2025 tobacco marketing season fast approaching, the Tobacco Industry and Marketing Board (TIMB) has commenced registering transporters in line with the tobacco transporter administration framework introduced last year. TIMB has since developed a robust transport administration system to counter challenges of criminal activities such as side marketing, […]",
            "time": "21:46",
            "date": "06 Feb 2025"
        },
        {
            "title": "President lays down the law . . . cracks the whip on under-performing ministers",
            "url": "https://www.herald.co.zw/president-lays-down-the-law-cracks-the-whip-on-under-performing-ministers/",
            "content": "Blessings Chidakwa, Herald Reporter\n\nPRESIDENT Mnangagwa yesterday cracked the whip on under-performing Ministers of State for Provincial Affairs and Devolution who are creating unnecessary glitches in Government operations by failing to submit reports and attend vital Cabinet Committee meetings.\n\nKeeping his hand on the pulse of national development, President Mnangagwa had a lively session with 10 Ministers of State for Provincial Affairs who are in charge of the countrys 10 administrative provinces.\n\nThe meeting was held at State House in Harare.\n\nThe President said for Government to have an effective National Devolution Agenda, Provincial Ministers must submit comprehensive and timely reports.\n\nHe said these include both ad-hoc as well as routine reports on the state of provinces, highlighting all aspects including those on economic affairs.\n\nPresident Mnangagwa said it is unfortunate that some provinces are failing to make these submissions.\n\nThis is unacceptable and tantamount to dereliction of duty. Similarly, the non-attendance to Cabinet Committee meetings by some Ministers of State for Provincial Affairs and Devolution in 2024 was glaring.\n\nAs a result, Cabinet committee submissions missed vital input from Provinces. This anomaly must be adequately addressed. I expect provinces to emerge stronger, dynamic and competitive economic hubs, with marked growth across all sectors, he said.\n\nPresident Mnangagwa said the primary task of Ministers of State for Provincial Affairs and Devolution was to improve the peoples living standards and achieve shared prosperity, as is envisaged in his development philosophy of leaving no one and no place behind.\n\nAs such, the President said the Ministers should be unrelenting in attending to challenges, taking necessary risks to overcome obstacles by implementing solutions that benefit the people.\n\nHesitation, the dragging of feet and fence sitting are not acceptable dispositions under my administration. Additionally, increased momentum to achieve our national development aspirations requires leaders who are bold, focused, hardworking and those prepared to make the requisite personal sacrifices for unprecedented results.\n\nIndividually and collectively decide to be counted as those possessing these traits. This is the spirit that saw us realise our independence, freedom and peace to become masters of our own destiny, he said.\n\nPresident Mnangagwa said Zanu PF, under his leadership, always has people at heart, with Devolution a critical pillar for national unity, social cohesion and safeguarding the indivisibility of Zimbabwe as a sovereign-unitary State.\n\nAs Provincial Ministers, you are directed to demonstrate the leadership capability, integrity and humility that rallies all our communities, across all districts, within provinces, around the common national vision, and the indivisibility of our country, he said.\n\nYou have a duty at the grassroots level to ensure that our society has vitality and hope, living in unity, peace and harmony. It is under such environments that we can realise sustainable development and prosperity for our motherland for both present and future generations.\n\nPresident Mnangagwa said he is now shifting paradigms, transforming Ministries of Provincial Affairs and Devolution from being merely administrative or ceremonial to championing economic development programmes at sub-national level.\n\nThe President said the consistent implementation of a provincial fiscal performance analysis dashboard and monitoring of the socio-economic performance of provinces must be prioritised in the co-ordination of the offices of Ministers of State for Provincial Affairs.\n\nIt is commendable that Provincial Economic Development Plans have since been validated for alignment with our National Development Strategy.\n\nThe implementation of the National Development Strategy 2 must give impetus and greater focus on building modern, sustainable and resilient Provincial economies, he said.\n\nPresident Mnangagwa said all the 10 provinces are blessed with God-given natural resources and the communities must remain good custodians of such endowments and be active players in their transformation into bankable, life changing investment opportunities and projects.\n\nIn the face of natural disasters including the El-Nino induced drought last year, President Mnangagwa urged the Ministers of State for Provincial Affairs to continue ensuring the timely delivery of assistance across districts and wards within provinces.\n\nThe President also took a swipe at some private voluntary organisations that tend to advance clandestine agendas.\n\nI call upon provincial structures to shun and expose any machinations and underhand activities that seek to reverse the progress we have achieved as the Second Republic, he said.\n\nPresident Mnangagwa said the supremacy of the ruling party, Zanu PF, over the Government remains an enduring and integral principle to their work.\n\nProvinces should continue to work with traditional leaders and party structures, so that our people participate in decision-making and also take ownership in the implementation of Government projects and programmes.\n\nJoint meetings and seamless co-ordination with the party and development committees at appropriate levels, should be improved. Programmes and projects being undertaken within the provinces must be clearly articulated, including their overall impact on the livelihoods of our people.\n\nI urge ministries, departments and agencies at provincial level, including councils, to remain duty bound and committed to the realisation and protection of our national interests and development aspirations, he said.\n\nThe President said as the nation builds resilience and adaptive capacity for sustained economic transformation, the business-as usual approach and narrow turf wars should be decisively dismantled.\n\nUnity of purpose, dedication, and innovation coupled with efficient co-ordination in the implementation of Government policies, programmes and projects, the President added, are critical building blocks for the realisation of Vision 2030 and must be key priorities.\n\nMinister of State for Masvingo Provincial Affairs and Devolution, Ezra Chadzamira, said the meeting was vital as it pushes them to work harder in achieving vision 2030.\n\nDuring the meeting with the President we talked about vast achievements gained under the Second Republic. We also talked about some challenges faced, he said.\n\nWe are happy that the President emphasised that we should prioritise all the uncompleted projects so that they add value to citizens while Devolution funds will continue to be disbursed on time. We are grateful to the President for the meeting.\n\nMinister of State for Provincial Affairs and Devolution for Mashonaland East Dr Apollonia Munzverengwi said infrastructural development was now the new norm in her province courtesy of the Presidents guidance.\n\nWe are happy that we have been given the opportunity to meet His Excellency, updating him on what is happening in our respective provinces. l am glad to say Mash East is working together with other provinces.\n\nWe have benefitted from construction of a number of projects including dams. We are the custodians of Muchekeranwa Dam where 75 households are directly benefitting through irrigation, she said.\n\nMinister Munzverengi also said her province has Chivhu Dam which is now moving to ease water shortages for Chivhu town.\n\nThe benefits of the water are going towards the people so we are happy for the ongoing developments, she said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/President-Mnangagwa-2.jpg",
            "description": "Blessings Chidakwa, Herald Reporter PRESIDENT Mnangagwa yesterday cracked the whip on under-performing Ministers of State for Provincial Affairs and Devolution who are creating unnecessary glitches in Government operations by failing to submit reports and attend vital Cabinet Committee meetings. Keeping his hand on the pulse of national development, President Mnangagwa had a lively session with […]",
            "time": "21:46",
            "date": "06 Feb 2025"
        },
        {
            "title": "Zim a unitary State: VP Chiwenga",
            "url": "https://www.herald.co.zw/zim-a-unitary-state-vp-chiwenga/",
            "content": "Mukudzei Chingwere, Herald Reporter\n\nVICE President Dr Constantino Chiwenga has reaffirmed Zimbabwes status as a unitary State, emphasising the essential role of equitable development across all provinces.\n\nHe was speaking during the inaugural devolution and development meeting with Ministers of State for Provincial Affairs and Devolution chaired by President Mnangagwa at State House in Harare yesterday.\n\nThrough the meeting, Government sought to set the tone for a new era of governance and development.\n\nVP Chiwenga reminded Ministers that President Mnangagwa is the only leader elected by the entire nation, underscoring the unity and collective responsibility that comes with this unique mandate.\n\nPresident Mnangagwas interface with Provincial Ministers emphasises the Governments commitment to fostering equitable growth and unity across all provinces.\n\nVP Chiwenga noted that President Mnangagwa had laid the groundwork for national development and emphasised the importance of localised initiatives, insisting that these local efforts must align with and contribute to the broader national vision.\n\nBe reminded that the President is the only one elected by the whole nation as a constituency. In other words, he is the only person in the country elected by the entire country as one constituency, said VP Chiwenga.\n\nAny disparity in development in your provinces reflects back to him who is also the appointing authority and therefore accountable to the development of the whole nation.\n\nYour responsibilities extend beyond the political realm, it impacts social and economic dimensions and your actions have a profound impact on the lives of citizens.\n\nVP Chiwenga reiterated the profound responsibilities placed on the Ministers of State, who are tasked with implementing policies that promote equitable economic development and enhance infrastructure development across the country. He called on them to be the eyes and ears of the President within their provinces, gauging public sentiment and measuring Government performance against the aspirations of citizens.\n\nOur focus on provincial affairs and devolution reflects our shared commitment to ensuring equitable growth, empowerment and unity throughout all provinces.\n\nThe President has entrusted you with the immense responsibility of coordinating and implementing policies that advance economic development, enhance infrastructure development and empower communities.\n\nYou are also instrumental in fostering collaboration between national and sub-national structures, and ensuring equitable resource allocation so that every district and ward is equipped with the necessary tools it needs to thrive, said VP Chiwenga.\n\nThrough this collaborative approach, said VP Chiwenga, the Government is building a Zimbabwe where no one and no place is left behind, resonating with President Mnangagwas guiding principle.\n\nHe said President Mnangagwa has charged Provincial Affairs ministers with the responsibility of ensuring that the success of devolution and the prosperity of the country is rooted in their commitment, vision and leadership.\n\nAs Ministers of State for Provincial Affairs and Devolution, you are the custodians of the hopes and aspirations of millions. Let your work be guided by integrity, empathy and unwavering commitment to progress.\n\nVP Chiwenga said Provincial Affairs Ministers stand as the first point of contact for both the Government and the citizens.\n\nIt is fitting, therefore, that today we will hear from them regarding the current state of affairs in their respective provinces, covering economic, social, political, cultural, environmental and governance matters, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/HE-1.jpg",
            "description": "Mukudzei Chingwere, Herald Reporter VICE President Dr Constantino Chiwenga has reaffirmed Zimbabwe’s status as a unitary State, emphasising the essential role of equitable development across all provinces. He was speaking during the inaugural devolution and development meeting with Ministers of State for Provincial Affairs and Devolution chaired by President Mnangagwa at State House in Harare […]",
            "time": "21:46",
            "date": "06 Feb 2025"
        },
        {
            "title": "Zanu PF lashes out at Geza’s statements",
            "url": "https://www.herald.co.zw/zanu-pf-lashes-out-at-gezas-statements/",
            "content": "Columbus Mabika and Fungai Lupande\n\nTHE ruling Zanu PF party yesterday lashed out at Central Committee member Cde Blessing Geza for making treasonous and outrageous statements calculated to cause alarm and despondency in the country.\n\nAt the same time, war veterans reiterated their clarion call for President Mnangagwas term to be extended to 2030, saying it is the wish of the majority of Zimbabweans as unequivocally expressed at the Zanu-PF Annual National Peoples Conference in Bulawayo last year.\n\nAlthough the ruling party is unanimous that President Mnangagwas term of office must be extended for a further two years, Cde Geza has been trying to derail the peoples train.\n\nIn choreographed Press conferences, Cde Geza has attacked President Mnangagwa and sought to silence the countrywide chorus for the Presidents term of office to be extended.\n\nMashonaland West Province, to which Cde Geza belongs, has since recommended his expulsion from the party with immediate effect.\n\nIn a statement yesterday, Zanu PF secretary for Information and Publicity, Cde Christopher Mutsvangwa, said the utterances by Cde Geza were couched to smear credentials of the majority of war veteran entities in good standing with Zanu PF.\n\nThe outlandish, treasonable and egregious rantings of errant Runesu Geza offended the hallowed tenets of party discipline for a member of the Central Committee.\n\nThey also involved reckless attempts to usurp the credentials of war veteran entities in good standing with Zanu PF, the party of the Permanent Zimbabwe Revolution, he said.\n\nAs such, Cde Mutsvangwa added, relevant organs of the party are currently seized with this contravention as it is holistically and expeditiously handled and dispensed with.\n\nThe party, he said, assures its members of the absolute loyalty of the rank and file to President Mnangagwa and that they retain full confidence in the legal implementation of Resolution Number One adopted at the National Peoples Conference under the aegis of the 2013 Constitution of Zimbabwe.\n\nThe development comes as the Zimbabwe National Liberation War Veterans Association (ZNLWVA) has said President Mnangagwa is the democratically elected President by the majority of Zimbabweans for a five-year term and any utterances calling for his resignation, such as those made by Cde Geza, were improper and careless.\n\nSpeaking at the launch of the Presidential War Veterans Fund in Kujogo Village, Centenary, Muzarabani, Mashonaland Central, the Secretary for War Veterans, Ex-Political Prisoners, Detainees and Restrictees, Cde Douglas Mahiya, it is not forbidden for Zanu PF to support President Mnangagwa to continue at the helm for an extended period.\n\nWho can remember war veterans if he is no longer there? What the party has agreed upon cannot be undone. One individual cannot reverse what the people have agreed to do. To go against the resolutions of the party is to turn against your country.\n\nNo small group of war veterans will dictate to the party; it is the party that guides us. The principles of the revolution dictate that the minority is subordinate to the majority, he said.\n\nCde Mahiya urged all war veterans to align with the party and encouraged them to engage constructively with the President, who he described as a listening leader and a servant of the people.\n\nWe have no right to instruct or threaten the Government or the police. We dont dictate to the Government; they should carry out their work. Dont speak on behalf of other war veterans. We support Zanu PF and President Mnangagwa because leadership is ordained by God, he said in reference to Cde Geza.\n\nRecognising the widows of war veterans, Cde Mahiya announced that the League is in the process of establishing a trust fund to benefit and uplift their livelihoods.\n\nDr Paul Tungwarara, the Special Advisor to the President on Investment, presented US$150,000 allocated for Mashonaland Central.\n\nAdditionally, he awarded US$5,000 to a successful village business unit in Muzarabani, US$3,000 to Drumada village business unit, and US$200 to each of the 80 war veterans who attended the launch.\n\nDr Tungwarara indicated that the fund is accessible to all war veterans, who can borrow it at zero percent interest.\n\nHe also announced a new initiative for borehole drilling at the homes of each war veteran, which was discussed during the event.\n\nDr Tungwarara emphasised that war veterans are foundational figures for every businessman in the country.\n\nPeople died for this country so that business people could engage in mining and other enterprises, he said.\n\nCde Kazembe Kazembe, the Minister of Home Affairs and Cultural Heritage, who is also the Zanu PF provincial chairperson, explained that the fund will empower war veterans to embark on entrepreneurial ventures and sustainable businesses that will improve their livelihoods.\n\nThe loans, managed at the provincial level, will foster self-reliance and restore dignity to our war veterans. We are building an ecosystem where they actively participate in economic maintenance, generating income and employment, he said.\n\nCde Kazembe said the fund would be continuously reviewed and increased based on the diligence and honesty demonstrated by the war veterans in repaying the loans, thereby allowing more beneficiaries to gain access.\n\nHe expressed gratitude for the empowerment of war veterans, saying the province has engaged local councils to set aside quotas for war veterans in the allocation of residential stands.\n\nThey have suffered enough, and as a province, we are focused on how to support our war veterans, Cde Kazembe said.\n\nCde Zhemu Soda, the Member of Parliament for Muzarabani and DCC chairperson, said the launch was held in Muzarabani due to the significant role it played in the liberation struggle.\n\nDespite the short notice, thousands of people attended the launch out of love for the party and President Mnangagwa.\n\nCde Soda said Government programmes and projects are benefitting Muzarabani, particularly in areas like farming and relief efforts.\n\nDeputy Minister of Veterans of the Liberation Struggle, Cde Headman Moyo, expressed deep gratitude to President Mnangagwa for offering an interest-free revolving fund.\n\nCde John Kwara, chairperson of the provincial War Veterans League, expressed his unwavering support for Zanu PF and President Mnangagwa.\n\nThe Chairperson of War Collaborators in Muzarabani, Cde Jeffrey Chigombe, said they were grateful for the Second Republics transformative work and facilitating the vetting process.\n\nPresident Mnangagwa is an able leader together with his deputies. He must see through the developments that he started, including the compensation of war collaborators, he said.\n\nWe failed to attain educational qualifications due to the war. We never turned against Zanu PF because of the delays in compensation. We are confident that our time will come because the President will never forget us.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/04/Untitled-dbeege.jpg",
            "description": "Columbus Mabika and Fungai Lupande THE ruling Zanu PF party yesterday lashed out at Central Committee member Cde Blessing Geza for making treasonous and outrageous statements calculated to cause alarm and despondency in the country. At the same time, war veterans reiterated their clarion call for President Mnangagwa’s term to be extended to 2030, saying […]",
            "time": "21:46",
            "date": "06 Feb 2025"
        },
        {
            "title": "Sadc pushes for DRC to regain control",
            "url": "https://www.herald.co.zw/sadc-pushes-for-drc-to-regain-control/",
            "content": "Wallace Ruzvidzo, Herald Reporter\n\nSADC is working towards ensuring that the Democratic Republic of Congo (DRC)s central Government regains full control of the country, hence the convening of a joint Extraordinary Summit between the regional bloc and the East African Community (EAC) in Tanzania on Saturday, President Mnangagwa has said.\n\nThe President, who is the chair of SADC and his EAC counterpart, Kenyan President William Ruto, will co-chair the joint summit that will tackle the deteriorating security situation in the DRC, which is a member of both regional bodies.\n\nWhen asked by the media at State House in Harare yesterday if history continued to repeat itself in the DRC, President Mnangagwa said not really but both SADC and EAC would continue with efforts that would see one voice in one country.\n\nNot really, the DRC has always been faced with challenges of this nature. Besides, it is a vast country and one would want to see a central Government that is in full control of that vast country, that is the first step, I think.\n\nCurrently, you have various authorities speaking differently in the same countryI do not think that is the best to have in a sovereign country.\n\nSo as we meet as both SADC and the East African Community, we will probe that (question) and see whether it is possible to make sure there is one voice in one country, he said.\n\nThe SADC Chairman said it would be more productive if all parties involved in the crisis attend the Extraordinary Summit.\n\nPresident Mnangagwa will lead a Double Troika, plus the Troop Contributing countries to the joint summit, that he will co-chair with President Ruto.\n\nThe SADC Double Troika comprises the SADC chairman, outgoing chairman and incoming and the Chairperson of the Organ on Politics, Defence and Security Co-operation, the outgoing chair and incoming chair.\n\nI believe that it will be most fruitful if all the parties to the issue (security situation in DRC) are present.\n\nIt does not help to discuss matters with some of the participants being absent. So it is my belief that my dear brother will invite them, said President Mnangagwa.\n\nAccording to earlier reports, President Ruto said both DRCs President Felix Tshisekedi and Rwandan President Paul Kagame have agreed to attend the Summit.\n\nDRC accuses Rwanda of backing rebels in the mineral resource country, charges which the latter has denied.\n\nPresident Ruto, in a statement earlier this week, also confirmed that he had engaged South African President Cyril Ramaphosa, Ugandan President Yoweri Museveni and other leaders to be part of the process.\n\nClashes between government forces and rebel groups have left an estimated 900 civilians dead, displacing tens of thousands more.\n\nThe recent fighting in eastern DRC, which has been dogged by conflict for more than 30 years since the 1994 Rwandan genocide, has also claimed 16 soldiers from the South African National Defence Force (SANDF) and Malawi, who form part of the SADC Mission in the DRC (SAMIDRC).\n\nAs rebel forces gained the upper hand on the battlefield, capturing much of Goma, the largest city in eastern Congo, South Africa responded with a stern diplomatic warning. The South African government stated that any further attacks on its troops would be regarded as a declaration of war.\n\nIn a swift rebuttal, Rwandas President Kagame accused South Africa of acting as part of a belligerent force. He claimed that South African troops were engaged in offensive combat operations to support the Congolese government in its fight against its own citizens.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/04/President-William-Ruto.jpg",
            "description": "Wallace Ruzvidzo, Herald Reporter SADC is working towards ensuring that the Democratic Republic of Congo (DRC)’s central Government regains full control of the country, hence the convening of a joint Extraordinary Summit between the regional bloc and the East African Community (EAC) in Tanzania on Saturday, President Mnangagwa has said. The President, who is the […]",
            "time": "21:46",
            "date": "06 Feb 2025"
        }
    ]
}