{
    "news": [
        {
            "title": "DRC crisis: Sadc convenes Extraordinary Summit",
            "url": "https://www.herald.co.zw/drc-crisis-sadc-convenes-extraordinary-summit/",
            "content": "Wallace Ruzvidzo, Herald Reporter\n\nPRESIDENT Mnangagwa is tomorrow expected to preside over a SADC Extraordinary Summit of Heads of State and Government in Harare, whose deliberations will centre on the security situation in the Democratic Republic of Congo (DRC).\n\nOn Monday, the President, who is chair of SADC, said the bloc will take full responsibility for the situation in the DRC.\n\nHe said they will also take decisive action to deal with the deteriorating security situation in the Eastern parts of the vast and resource-rich country.\n\nIn a statement last night, Foreign Affairs and International Trade Minister Professor Amon Murwira said the Extraordinary Summit was going to be on the Eastern DRC problem.\n\nAs you know, there are negative developments in the east of the DRC, a lot of violence and conflict and you will remember that His Excellency hosted another summit on this matter and that summit was to extend the mission of Summit DRC, but now the Extraordinary Summit is for Heads of State and Government to debate and make decisions on the peace efforts for the Eastern DRC.\n\nWe are expecting Heads of State and Government from all SADC countries to come and this summit is going to be on Friday the 31st of January 2025, said Prof Murwira.\n\nGraphic courtesy of Wires\n\nThe summit, the minister added, will focus on restoring peace and tranquillity in the eastern part of the Democratic Republic of Congo.\n\nAny instability in the SADC region is an affront to the economic development efforts of the region. Therefore, peace is very important. Their Excellencies will be able to be given the extent of the problem on Friday and they will be able to make decisions on this, said Prof Murwira.\n\nYou will remember that His Excellency Dr ED Mnangagwa issued his statement on Monday condemning violence and actually urging SADC to take action. So, SADC is taking action. Thats why theres a summit on Friday. Everything is set for the meeting and we look forward to the resolution of problems in the eastern part of the DRC.\n\nIn a Communiqu yesterday, the SADC Secretariat said the meeting follows the outcome of the Extraordinary Summit of the SADC Organ Troika plus the DRC and Troop Contributing Countries (TCCs) to the SADC Mission in the DRC (SAMIDRC), which was held on Tuesday.\n\nThe Southern African Development Community (SADC) will convene an Extraordinary Summit of Heads of State and Government in Harare, Republic of Zimbabwe, to discuss the security situation in the eastern part of the Democratic Republic of Congo.\n\nThe Summit will be chaired by His Excellency Dr Emmerson Dambudzo Mnangagwa, President of the Republic of Zimbabwe, and Chairperson of SADC.\n\nThe Summit follows the outcome of the Extraordinary Summit of the SADC Organ Troika plus the DRC and Troop Contributing Countries (TCCs) to the SADC Mission in the DRC (SAMIDRC), which was held on 28th January 2025 and was chaired by Her Excellency Dr Samia Suluhu Hassan, the President of the United Republic of Tanzania and Chairperson of the SADC Organ on Politics Defence and Security Cooperation, reads the Communique in part.\n\nThe Extraordinary Summit will be preceded by meetings of the SADC Standing Committee of Senior Officials and the SADC Council of Ministers.\n\nAs of Tuesday night, the death toll from fighting between peacekeeping soldiers and M23 rebels in eastern Congo had reached 17.\n\nThe number includes 13 South African National Defence Force (SANDF) soldiers and others from Malawi and Uruguay deployed as part of the Southern African Development Community (SADC) regional force or under the UN mission in Congo (MONUSCO).\n\nBy the time of going to print, unconfirmed reports were pointing at more casualties.\n\nDirector for International Communication Services in the Ministry of Information Publicity and Broadcasting Services Richard Mahomva said the convening of the Summit was reflective of the high sense of urgency that the regional bloc places on instability in the region.\n\nIn recent weeks, M23 has made rapid advances towards Goma, a city with a population exceeding one million.\n\nIntense fighting in the region has further exacerbated the situation, leading to heightened fears among residents.\n\nAs of early 2025, over 400 000 people had been displaced in the provinces of North and South Kivu, which are located near the border with Rwanda.\n\nThe UNs refugee agency has reported a growing humanitarian need as families are forced to flee their homes in search of safety and shelter.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/President-Mnangagwa-9.jpg",
            "description": "Wallace Ruzvidzo, Herald Reporter PRESIDENT Mnangagwa is tomorrow expected to preside over a SADC Extraordinary Summit of Heads of State and Government in Harare, whose deliberations will centre on the security situation in the Democratic Republic of Congo (DRC). On Monday, the President, who is chair of SADC, said the bloc will take full responsibility […]",
            "time": "06:38",
            "date": "30 Jan 2025"
        },
        {
            "title": "Govt moves to formalise informal sector",
            "url": "https://www.herald.co.zw/govt-moves-to-formalise-informal-sector/",
            "content": "Herald Reporters\n\nGOVERNMENT will soon announce a raft of measures to support the survival of the formal sector and ensure the informal sector complies with legal requirements such as tax compliance, Finance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube has said.\n\nThis comes as retailers have raised concerns over the unregulated informal sector, which they argue offers goods at much lower prices, largely because it operates outside compliance with statutory obligations such as registration, taxes, licensing fees and labour laws.\n\nIn an interview in Harare yesterday, Prof Ncube said the reason why retailers were under pressure was due to increased informalisation of the economy, and rampant smuggling.\n\nSo, the informal sector is really squeezing out the formal sector and as Government, we are going to embark on an accelerated programme to make sure that the informal sector complies with whatever requirements they should comply with  be it licensing requirements, be it payment of taxes, be it selling goods at properly designated areas; for example, where they ought to sell, he said.\n\nSo, compliance issues are a big issue in that sector. For instance, we need to come and formalise the informal sector so that it begins to behave in a manner similar to how the formal sector players are behaving.\n\nApart from ensuring that the informal sector complies with the countrys laws, Prof Ncube said the Government has embarked on a blitz around the countrys borders to reduce smuggling which was also fuelling informalisation and making it harder for the formal sector to compete.\n\nWe also stand ready as Government to support formal retailers for them to ride the storm and this fierce competition from the informal sector.\n\nWe are doing everything we can; we will be announcing and implementing some measures to support the formal sector, but at the same time making sure the informal sector begins to comply with the tax, licensing and registration provisions that were put in place, he said.\n\nSo far the Zimbabwe Revenue Authority (Zimra) has impounded goods valued at approximately US$2,4 million in a multi-agency operation targeting importers and cross-border transporters involved in smuggling and unethical business practices.\n\nThe operation has resulted in the seizure of dozens of vehicles, including cross-border buses and haulage trucks, and confiscation of illicit goods such as foodstuffs and second-hand clothes.\n\nMeanwhile, Zimbabwe National Chamber of Commerce president Mr Tapiwa Karoro shared the same sentiments with Government, adding that there was a need to address economic pressures.\n\nHe said the implementation of measures which address disparities between the formal and informal sectors was welcome.\n\nThe growth of the informal sector, where vendors often sell groceries in front of grocery stores and clothes outside established retailers like Edgars, undermines formal businesses.\n\nThese informal traders operate with fewer regulatory and cost burdens, putting formal players at a competitive disadvantage, Mr Karoro said.\n\nZNCC, he said, was advocating for a collaborative approach to addressing the existing challenges.\n\nKey policy recommendations include:- Liberalising the goods market and providing greater flexibility in the exchange rate to ensure fair competition; streamlining tax burdens and licensing requirements to reduce overhead costs for formal businesses.\n\nOthers are tackling informality by creating incentives for formalisation and enforcing fair market practices, and improving access to affordable financing for businesses to sustain operations and support growth.\n\nAddressing these issues through constructive dialogue and co-ordinated action can help restore stability to the retail sector and the broader economy, said the ZNCC president.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/03/Minister-Mthuli-Ncube.jpg",
            "description": "Herald Reporters GOVERNMENT will soon announce a raft of measures to support the survival of the formal sector and ensure the informal sector complies with legal requirements such as tax compliance, Finance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube has said. This comes as retailers have raised concerns over the unregulated informal sector, […]",
            "time": "06:38",
            "date": "30 Jan 2025"
        },
        {
            "title": "‘NDS2 to catapult Zim to Vision 2030’",
            "url": "https://www.herald.co.zw/nds2-to-catapult-zim-to-vision-2030/",
            "content": "Blessings Chidakwa, Herald Reporter\n\nTHE National Development Strategy 2 (NDS2) blueprint that is expected to catapult Zimbabwe to Vision 2030 will be anchored on fiscal discipline, macro-economic stability, robust trade and investment, effective enforcement of property rights, the Office of the President and Cabinet (OPC) has said.\n\nThe OPC is building on the resounding key milestones achieved under NDS1 initiated in 2020 and ending this year.\n\nYesterday, heads of ministries, departments and agencies attended an NDS2 consolidation workshop in Kadoma spearheaded by the OPC where it highlighted some key achievements scored under NDS1, including improved infrastructure, food security and investment.\n\nActing Chief Secretary in the OPC, Reverend Paul Damasane, said NDS2 will build on successes made under NDS1.\n\nNDS 2 will play a crucial role in steering Zimbabwe towards long-term sustainable economic growth. Addressing growth barriers and fostering a conducive environment for economic transformation will be key, he said.\n\nThis will require steadfast fiscal discipline, macro-economic stability, robust trade and investment, effective enforcement of property rights and sustainable public finance, continuous empowerment and adaptability will be essential in meeting the countrys developmental objectives.\n\nMilestones under NDS1 are in different pillars, including infrastructure and utilities, digital economy, food security and nutrition, economic growth and stability, image building, engagement and re-engagement.\n\nIn an interview, the Deputy Chief Secretary for Policy Analysis, Co-ordination and Development Planning in the Office of the President and Cabinet, Mr Willard Manungo, said all stakeholders from Government, ministries, departments, and the private sector have been invited to give input into the NDS2 mapping.\n\nWe have NDS 1 and it finishes this year, we are now working on NDS2 as a successor programme, we have invited all the ministries, all departments to share their priorities, we have also invited business and industry.\n\nWe are trying to receive all the inputs as provided by all stakeholders, we are now compiling the views to hand over to Cabinet so that it is endorsed at the highest level, he said.\n\nUnder NDS1, success has also been registered in environmental protection, climate resilience and natural resource management, social protection, governance, housing delivery, human capital development and innovation, devolution and decentralisation, and health and well-being, among others.\n\nOn the infrastructure and utilities pillar, the Government implemented projects that focused on provision of road and aviation networks and utilities such as water and electricity.\n\nThey include the expansion and construction of a new VVIP Pavilion at Robert Gabriel Mugabe International Airport in Harare, the Dete Community solar project in Matabeleland North Province and the Harare-Masvingo-Beitbridge Road upgrade.\n\nOthers are the Shurugwi-Mhandamabwe road rehabilitation, the repair of 2 000 boreholes across the country and the drilling of 3 528 boreholes under the Presidential Borehole Drilling Programme.\n\nAdditional projects include the Mbudzi Interchange construction project, the Harare-Kanyemba Road construction, the Great Zimbabwe 5MW Hydro Power Station in Masvingo, and construction of New Parliament Building access roads in Harare, Mashonaland West and Mashonaland Central provinces.\n\nUnder the digital economy pillar, the Government invested in expanding ICT infrastructure, promoting digital literacy, and supporting technology start-ups.\n\nThe start-ups include the Media and Communication Policy, the National E-learning Strategy (computerisation of 1 000 schools to bridge the urban-rural divide), the National ICT Policy launch, the Artificial Intelligence Strategy approval, the licensing of Starlink, electronic passports for citizens in Harare, Guruve, Murehwa, Lupane, Beitbridge, Zvishavane, Marondera and Gweru, among others.\n\nOn the food security and nutrition pillar, many projects including dams were constructed to climate-proof agriculture while irrigation rehabilitation and accelerated dam construction across the country was also done to boost food security.\n\nDams such as Kunzvi in Mashonaland East, Muchekeranwa Dam on the border of Mashonaland East and Manicaland, Tugwi-Mukosi in Masvingo, Semwa in Mashonaland Central and Lake Gwayi-Shangani in Matabeleland North have been constructed and some are complete and already transforming lives while others are over 70 percent complete.\n\nOn the economic growth and stability pillar, the Government initiated many programmes such as the debt and arrears clearance programme, tamed inflation, and introduced a gold-backed currency, among others.\n\nRegarding image building and the engagement and re-engagement programme, the Government rehabilitated infrastructure in foreign missions and installed broadcasting infrastructure, which is critical for enhancing Governments image and improved economic diplomacy.\n\nOn the social protection pillar, the Government focused on the protection of individuals and communities from poverty, vulnerability and social exclusion.\n\nOn governance, there was the construction of magistrate courts, and the implementation and operationalisation of the Integrated Electronic Case Management System, among others.\n\nApart from that, on housing delivery, the Government constructed affordable and decent houses in many towns for its workers.\n\nIn terms of human capital development and innovation, learners were prepared to become socially and economically empowered through quality and innovation education.\n\nYouth, sports and culture emphasis was on fighting socio-economic ills that include drug and substance abuse as well as unemployment.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2017/10/0510-1-1-PAUL-DAMASE.jpg",
            "description": "Blessings Chidakwa, Herald Reporter THE National Development Strategy 2 (NDS2) blueprint that is expected to catapult Zimbabwe to Vision 2030 will be anchored on fiscal discipline, macro-economic stability, robust trade and investment, effective enforcement of property rights, the Office of the President and Cabinet (OPC) has said. The OPC is building on the resounding key […]",
            "time": "06:38",
            "date": "30 Jan 2025"
        },
        {
            "title": "Govt to boost health funding",
            "url": "https://www.herald.co.zw/govt-to-boost-health-funding/",
            "content": "Mukudzei Chingwere, Herald Reporter\n\nGovernment has announced plans to enhance domestic funding and reconfigure existing resources to ensure the continuity of essential health programmes following the United States recent withdrawal of finance for critical healthcare services.\n\nThe US administrations decision to withdraw support for global health initiatives has raised concerns, particularly for developing countries, which relied on this assistance to bolster their healthcare systems.\n\nAlthough a waiver has been issued to maintain aid for other essential services, the impact of the cut on health programmes is massive.\n\nThe Second Republic has made progress in improving the health services which were brought to test with an effective response to the global Covid-19 pandemic and the Government is looking at leveraging on that to provide effective healthcare services.\n\nZimbabwe is on a drive to improve its services sector and social safety nets in line with President Mnangagwas vision of an upper-middle income society and the health services has been identified as one of the sectors in need of a reboot.\n\nIn an interview with The Herald, the Deputy Minister of Health and Child Care Sleiman Kwidini said the Government is taking immediate steps to increase national budget allocation for health services, focusing particularly on areas most affected by the US funding withdrawal.\n\nWe are aware of the challenges posed by the withdrawal of US funding and we are committed to ensuring that our health system remains robust, said Deputy Minister Kwidini.\n\nThe Government is actively increasing domestic funding for health services, which is crucial for our long-term sustainability.\n\nWe are also exploring partnerships with other international organisations to mitigate the impact of this funding gap. Our health system has shown resilience in the past and we will continue to prioritise essential services while improving our operational efficiency.\n\nWe will not allow the withdrawal of external funding to compromise the health of our citizens. Our priority is to safeguard and improve the quality of healthcare across the nation, said Deputy Minister Kwidini.\n\nHe said resources which have been allocated to other critical healthcare services will be reconfigured to ensure that no service will be left behind.\n\nGovernments commitment to improving health services reflects a broader ambition to strengthen the nations healthcare infrastructure.\n\nBy focusing on sustainable funding and resource management, Zimbabwe aims to build a healthcare system that is not only resilient to external challenges but also capable of meeting the evolving needs of its population.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/02/Sleiman-Timios-Kwidini-600x380.jpg",
            "description": "Mukudzei Chingwere, Herald Reporter Government has announced plans to enhance domestic funding and reconfigure existing resources to ensure the continuity of essential health programmes following the United States’ recent withdrawal of finance for critical healthcare services. The US administration’s decision to withdraw support for global health initiatives has raised concerns, particularly for developing countries, which […]",
            "time": "06:38",
            "date": "30 Jan 2025"
        },
        {
            "title": "Security deployed to save livestock farm",
            "url": "https://www.herald.co.zw/security-deployed-to-save-livestock-farm/",
            "content": "Raymond Jaravaza, Bulawayo Bureau\n\nGOVERNMENT has deployed security and environment agencies to the Rhodes Estate in the Matopos National Park to address concerns over rampant illegal gold mining activities, which is threatening livestock production at one of the countrys biggest pedigree cattle farms.\n\nKnown for its famed Brahman and Beefmasters breeds produced by the Pilossof brothers, the farm has been invaded by illegal gold panners whose indiscriminate digging in recent years has caused severe environmental degradation. Many cattle have died after falling into the pits dug by the panners.\n\nThe sprawling 4 000 hectare enterprise, is run by the Pilossof brothers, a household name in the pedigree cattle and genetics business in the country.\n\nIn 2014, the Pilossof brothers entered into an agreement with the Zimbabwe Parks and Wildlife Management Authority (ZimParks) to run their pedigree business in the Rhodes Estates as means to preserve parts of the Matopos National Park  a world heritage site  while at the same time operating a commercially viable livestock project in the park.\n\nFor years, the Pilossof family has been battling an ever growing influx of illegal gold panners who have been digging pits and deep trenches where the cattle are falling in.\n\nYesterday, Matabeleland South Provincial Affairs and Devolution Minister, Dr Evelyn Ndlovu and her delegation of heads of key Government departments visited the farm to have first-hand appreciation of the problem the cattle farmers are facing as a result of the illegal gold mining activities.\n\nPits left unattended after some illegal miners ran away from authorities during the tour by the Matabeleland South Minister of State fro Provincial Affairs and Devolution at Rhodes Estate in Matobo district yesterday.\n\nHead of the farm project, Mr Paul Pilossof, estimated that close to 200 pedigree cattle have died in the last couple of years after falling into the open pits left by the illegal gold panners or from drinking water contaminated with chemicals such as cyanide, whose use is now outlawed in the extraction of gold.\n\nThe pedigree cattle at the farm can cost between US$ 4000 to US$8 000 each.\n\nSome Pilossof Ruvale Brahman bulls from the farm have in the past been sold for as much as US$13 000 each.\n\nOn one end of the farm, at the base of a small mountain, the news crew saw over 30 pits concentrated in a very small area.\n\nA few illegal panners were brave enough to stick around as Minister Ndlovu and her entourage together with officials from ZimParks, Ministry of Mines and Mining Development, Ministry of Lands, Agriculture, Water, Fisheries and Rural Development, the Environment Management Authority (EMA), the police and other stakeholders assessed the damage.\n\nThe rest of the omakorokoza fled or hid in their deep pits to evade possible arrest as the entourage approached.\n\nWe have been at the farm since 2014 after signing an agreement with ZimParks and we have been encountering problems with illegal miners invading our farm and digging for gold, said Mr Pilossof.\n\nThe illegal mining has been happening for years and it appears nothing is being done to stop the activities. We fenced off a large area where illegal mining is taking place in order to keep our cattle away but the mining just keeps spreading and the panners are cutting the fence.\n\nPits left unattended after some illegal miners ran away from authorities during the tour by the Matabeleland South Minister of State fro Provincial Affairs and Devolution at Rhodes Estate in Matobo district yesterday.\n\nMr Pilossof said they are now being forced to move their cattle from the farm because its no longer safe to keep them there.\n\nWe lose an average of 60 pedigree cattle per year from snares, stock theft, cattle falling into pits or dying after drinking cyanide contaminated water, said Mr Pilossof.\n\nMinister Ndlovu said the province is dependent on agriculture and livestock farming contributes significantly to the regions economy.\n\nThe illegal mining activities that are taking place at this farm are counter-productive and cannot be allowed to continue, said Dr Ndlovu.\n\nShe ordered officials from the mines ministry to report back to her office with a list of miners that were allowed to mine at the Rhodes Estates under special permits issued with the consent of ZimParks.\n\nMining and agriculture can be done side by side but only when both parties are working within the confines of the law. I want a list of everyone who is mining legally so that we flush out the illegal miners, said Dr Ndlovu.\n\nMr Chancellor Chidziva, Matabeleland South acting provincial mining director, said his office can only issue out a special mining permit to a miner after the approval of ZimParks.\n\nZimParks are custodians of the Matopos National Park so anyone who wishes to carry out mining in the national park must first seek a special permit from them, he said.\n\nIt is only after Zimparks issues out the special permit that we do the necessary paperwork and grant the individual the right to mine, said Mr Chidziva.\n\nHe however, said he could not immediately provide the number of miners who hold the special permits to mine in the Matopos National Park.\n\nThe special permits expire after two years and are only renewed when the miner meets all the necessary conditions.\n\nZimParks senior area manager, Mr Thembelani Sibanda, said the majority of gold panners did not have special permits to mine in the area and as such were mining illegally.\n\nThe farm was set aside as a reserved area for cattle rearing and only miners with special grants are allowed to work here. ZimParks acknowledges the growing problem of illegal mining in this area and our plea is for all the stakeholders to work together to flush out the illegal gold panners, he said.\n\nConflict of interest between mining and farming is not peculiar to this farm alone so a holistic approach is needed to solve problems that emanate from such situations,\n\nAccording to the EMA provincial manager, Mr Decent Ndlovu, the area in and around the Pilossof farm is one of the worst degraded places in the province as a result of illegal mining activities.\n\nWe classify this area as a hotspot in terms of illegal mining because it is one of the worst degraded places in the province. The farmers have been here since 2014 and have invested a lot in terms of rehabilitating the area and today it keeps thousands of cattle. So, its sad when all that good work is destroyed by illegal mining activities, said Mr Ndlovu.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/MD1.jpg",
            "description": "Raymond Jaravaza, Bulawayo Bureau GOVERNMENT has deployed security and environment agencies to the Rhodes Estate in the Matopos National Park to address concerns over rampant illegal gold mining activities, which is threatening livestock production at one of the country’s biggest pedigree cattle farms. Known for its famed Brahman and Beefmasters breeds produced by the Pilossof […]",
            "time": "06:38",
            "date": "30 Jan 2025"
        },
        {
            "title": "Minister Muswere calls for discipline, proper communication channels",
            "url": "https://www.herald.co.zw/minister-muswere-calls-for-discipline-proper-communication-channels/",
            "content": "Lovemore Kadzura, Manicaland Bureau\n\nInformation, Publicity and Broadcasting Services Minister and ZANU PF Central Committee member, Dr Jenfan Muswere, has called on party members to maintain discipline and use appropriate channels to express their views.\n\nHe was speaking yesterday at the burial of Liberation War Hero Cde Luxon Micheal Mapfumo, a retired Lieutenant Colonel and war veteran, in Mudyarabikwa Village, in Makoni West.\n\nDr Muswere, who is also the Member of Parliament for Makoni West, expressed concern over individuals who resort to publicly criticising the leadership instead of engaging in internal party processes.\n\nIn recent days, we have seen some individuals, when faced with challenges, choose to disparage national leadership. This is not how the party operates, especially for a Central Committee member who attends all meetings, including the National Conference. Such behaviour is unacceptable, he said.\n\nDr Muswere said Cde Mapfumo exemplified the values of consistency, vigilance, and dedication to the revolution.\n\nCde Mapfumo remained steadfast in his commitment to the ideals of the liberation struggle. He worked tirelessly to ensure that by 2030, we achieve a prosperous upper middle-income society. His legacy is one we must all strive to uphold, he said.\n\nAdvocate Misheck Mugadza, Minister of State for Manicaland Provincial Affairs and Devolution, described Cde Mapfumo as a dedicated patriot who played a pivotal role in Zimbabwes independence and its preservation.\n\nCde Mapfumo was an icon and a prototype commander in the Zimbabwe Defence Forces. His exceptional loyalty and patriotism serve as a reminder of the sacrifices made by our liberation heroes. His military prowess in fighting for our freedom and defending our sovereignty after independence remains unmatched, said Adv Mugadza. He urged Zimbabweans to honour Cde Mapfumos legacy by defending the principles of independence and sovereignty.\n\nAs we bid farewell to this gallant son of the soil, let us remember the sacrifices he and others made for our nation. We must uphold the values he stood for and continue to resist neo-colonial machinations, he added.\n\nZANU PF Central Committee member Cde Shadreck Chipanga, Manicaland Provincial Commissar Cde Albert Nyakuedzwa, Cde Kudzi Chipanga, members of the Provincial Joint Operations Command, family, friends, and community members attended the burial.\n\nCde Mapfumo, who died on Thursday last week, was celebrated for his unwavering commitment to Zimbabwes development and his role in shaping the nations history.\n\nHis life serves as a testament to the values of discipline, loyalty, and patriotism, which Dr Muswere and Adv Mugadza urged all Zimbabweans to emulate.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/04/Dr-Jenfan-Muswere.jpg",
            "description": "Lovemore Kadzura, Manicaland Bureau Information, Publicity and Broadcasting Services Minister and ZANU PF Central Committee member, Dr Jenfan Muswere, has called on party members to maintain discipline and use appropriate channels to express their views. He was speaking yesterday at the burial of Liberation War Hero Cde Luxon Micheal Mapfumo, a retired Lieutenant Colonel and […]",
            "time": "06:38",
            "date": "30 Jan 2025"
        },
        {
            "title": "EDITORIAL COMMENT: Intelligent traffic enforcement, proper infrastructure key",
            "url": "https://www.herald.co.zw/editorial-comment-intelligent-traffic-enforcement-proper-infrastructure-key/",
            "content": "Motorists have been complaining that some police officers deployed to roadblocks and checkpoints that are doing such good work have been returning to the days before the Second Republic of concentrating on trivial infringements and overtight enforcement of minor offences.\n\nMost people, and that includes the respectable kombi owners and their drivers and their passengers, go along with the enforcement campaign that has been seeing a lot more public transport owners going through the procedures and registering and licensing their kombis after meeting the set of rational requirements.\n\nThis is enlightened self-interest, since those who do not simply see fines mounting up and risk having their kombis impounded. But a growing percentage of the kombi fleet is now a lot safer and the mushikashika are being tamed at least, even if they still operate on backroads.\n\nNor will most drivers, even if they take chances themselves at times, complain about the police concentrating on proper enforcement of safety laws. So police action to control speeding, drinking while driving, dangerous overtaking, sweeping in front of oncoming traffic when turning and other serious offences will be accepted as right and proper.\n\nBut we have, reportedly, had police officers complaining about the make of fire extinguishers and the colour of reflective jackets, about the type and condition of reflective triangles, about number-plate lights in broad daylight and other trivia. Admittedly laws and regulations need to be enforced but for this sort of offence, if action is thought to be needed, all that is needed is a warning and perhaps an appointment at a local station to show the checking officer the proper extinguisher or whatever in a few days time.\n\nWe have commented before on the need for police to be properly equipped with speed traps and breathalysers. Every traffic expert puts speeding and driving while over the blood-alcohol limit as causing a high proportion of accidents, along with reckless driving which should include unsafe overtaking and swerving suddenly across traffic lanes to make a turn. Even traffic lights and stop signs should be obeyed, although we do not need a return to fining people stopping 2cm over a stop line or stopping for just a second.\n\nTraffic law enforcement requires smart policing, being very tough on the dangerous driving and the dangerous vehicles and putting the public at risk, while at the same time using a combination of warnings and perhaps fix-it checks for minor matters.\n\nFor the very dangerous driving we would like to move away from fines and start seeing community service introduced. Fines are just an irritation for the rich but can hammer the less well off severely. A couple of days of community service would be more egalitarian. Gangs of offenders could be used to cut verge grass and pick up rubbish along our highways.\n\nThe enforcement campaign has also made clear that there is a severe lack of simple and basic infrastructure in some places, and that people were offending because their options were limited.\n\nBus stops are one problem, at least in Harare. There is a serious lack of properly marked bus stops. Informal bus stops can be dangerous for everyone, and we see the point of enforcement to stop their use, but the real bus stops where the bus or kombi pulls into the kerb for a minute or two are safe if they are correctly positioned.\n\nThe city centre terminus is not always the most obvious or convenient place to get off. We would like to see the Harare City Council, in consultation with the major associations representing kombi owners and the police, return to a reasonable grid of proper bus stops as we once had in the city centre and along bus routes.\n\nEach stop might mean the loss of two or three parking bays, but this would be a trivial loss of parking and a massive jump in convenience, as well as removing temptations from kombi drivers anxious to please pleading passengers. We used to have these proper bus stops marked out on the road and with the bus stop signs, made from precast concrete, but they have all gone over the years in the desperate desire to squeeze in just one extra parking bay.\n\nThere is a similar need to have properly signposted bus stops outside the city centre along all bus routes with enough verge graded for a bus to stop, so that buses and kombis can pick up and drop off passengers safely. These stops should not be allowed to become a sort of terminus, with a kombi parked while it awaits customers, those can be at shopping centres, but we do need places where people can wave down a bus or get off to go home.\n\nAnother major jump in safety outside the city centre would be to replace as many suburban traffic lights as possible with roundabouts. Some past city planners used to create road reserves with the adjacent stand corners cut off at major intersections so there is often enough space for a roundabout.\n\nApparently the cost of a roundabout and a set of traffic lights are about the same. So where there is enough space in the road reserve we should go for the roundabout, which enforces a slower speed, works during load shedding, does not have people stopped and waiting for thieves in the middle night, and generally ensures smoother traffic flows.\n\nSpeed humps can help in some places, but again we need proper design rather than a great mound across the road designed to smash the sump on anything smaller than a truck.\n\nThere are some places with low rumble humps, that slow traffic to acceptable speeds but do not force almost everyone to almost stop and this intelligent design should be more common.\n\nThese sort of intelligent infrastructure additions, like proper bus stops, roundabouts, rumble strips and the like can help the police enforce good safety by simply making it a lot harder to commit the offence in the first place, and they work 24 hours a day.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/11/breathalysers.jpg",
            "description": "Motorists have been complaining that some police officers deployed to roadblocks and checkpoints that are doing such good work have been returning to the days before the Second Republic of concentrating on trivial infringements and overtight enforcement of minor offences. Most people, and that includes the respectable kombi owners and their drivers and their passengers, […]",
            "time": "06:38",
            "date": "30 Jan 2025"
        },
        {
            "title": "War veterans denounce Geza",
            "url": "https://www.herald.co.zw/war-veterans-denounce-geza/",
            "content": "Freedom Mupanedemo, Midlands Bureau.\n\nThe Zimbabwe National Liberation War Veterans Association (ZNLWVA) yesterday said President Mnangagwa was democratically elected by the majority of Zimbabweans for a five-year term and any utterances calling for his resignation were improper and careless.\n\nThe associations national chairman, Cde Cephas Ncube was responding to fellow liberation war fighter Cde Blessing Geza, who called for the Presidents resignation in his recent rant.\n\nSpeaking at a Press conference in Gweru yesterday, Cde Ncube said utterances by Cde Geza last week calling the President to resign were irresponsible and careless.\n\nCde Ncube said Cde Gezas utterances were not in line with the associations views and the latter was not speaking for the association, but making personal remarks.\n\nThe current situation which is unfolding in the country does not, will not bring this association on the same page with those who are denouncing the President . . . . The President is there and was elected for five years. This is his second term of office. Why am I making this statement or press statement? There are certain statements which are being made about the President and I dont think they are proper, he said.\n\nCde Ncube said the war veterans body had proper channels of communication and described Cde Gezas recent statements as unconstitutional with potential to destabilise the country.\n\nHe said the war veterans association was fully behind the President and his entire Cabinet to steer the country forward.\n\nIf we find ourselves as war veterans challenging our President and making such statements, I dont think that is proper. Those who feel the President must resign today must revisit the constitution which gives him the mandate because he was voted into office by the majority so they must not make such careless statements, he said.\n\nCde Ncube urged the veterans of the struggle to be patient as the Second Republic was seized with several projects meant to better their lives.\n\nI am pleased to announce that I have managed to meet our Patron President Emmerson Mnangagwa twice since I assumed office. I can safely say we have managed to get a desk at the Ministry of Mines. Minister Chitando has given us a desk where we present grievances. We have also engaged with Minister of Finance and we are compiling projects for Comrades which need start-up capital. When we are done, I will be meeting with President Mnangagwa to give him feedback on our progress. We also have a local businessman who has offered his hospital infrustructure where we can get medical attention for free as war veterans, he said.\n\nPan African Hospital founder Cde Jimayi Muduvuri who also attended the press conference said he established a hospital in Kadoma that will be catering for war veterans.\n\nI want to say as business people, we should be grateful to the gallant sons and daughters who sacrificed their lives for the freedom we enjoy today.\n\nI am building Pan African hospitals in all the countrys provinces which are named after the countrys luminaries.\n\nThese institutions are open for the veterans of the struggle, the elderly as well as people with disabilities who can access services for free, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/10/IMG-20241012-WA0019-680x380.jpg",
            "description": "Freedom Mupanedemo, Midlands Bureau. The Zimbabwe National Liberation War Veterans Association (ZNLWVA) yesterday said President Mnangagwa was democratically elected by the majority of  Zimbabweans for a five-year term and any utterances calling for his resignation were improper and careless. The association’s national chairman, Cde Cephas Ncube was responding to fellow liberation war fighter Cde Blessing […]",
            "time": "06:38",
            "date": "30 Jan 2025"
        },
        {
            "title": "‘Trump’s remarks putting Mideast peace at risk’",
            "url": "https://www.herald.co.zw/trumps-remarks-putting-mideast-peace-at-risk/",
            "content": "CAIRO.  US President Donald Trumps recent remarks on Palestinians have sparked strong rejection across the Arab world, with experts warning of their grave implications for regional peace and stability.\n\nTrump suggested Saturday relocating over a million Palestinians from Gaza to neighbouring countries where they can maybe live in peace for a change, a plan unequivocally rejected by Jordan, Egypt, Palestine, and the Arab League comprising all 22 Arab states.\n\nHis remarks came after Israel and Hamas began implementing a ceasefire agreement on January 19, brokered by Egypt, Qatar, and the United States, halting deadly fighting that had lasted for over 15 months.\n\nPEACE AT RISK\n\nMany Arab experts believed that Trumps proposal limits chances for Middle East peace, derails the two-state solution to the decades-long Israeli-Palestinian conflict, and intensifies tensions in a region already plagued by crises.\n\nAhmed Kandil, head of the international studies unit at Cairo-based Al-Ahram Center for Political and Strategic Studies, said such US ideas ignore the root cause of the conflict, referring to Israels occupation of Palestinian territories.\n\nThe insistence of Trumps administration on not addressing the root causes of the Palestinian issue will only prolong and complicate the crisis and spread chaos in the region, the Egyptian said.\n\nKandil stressed that the solution lies in the UN resolutions that affirm the Palestinian peoples right to establish their independent state on the 1967 borders, warning of the consequences of Washingtons blind support for Tel Aviv.\n\nHe further criticised Trumps idea of relocating Palestinians to neighbouring countries as absurd and illogical.\n\nIt is unreasonable to expect these countries to shoulder the liquidation of the Palestinian cause in favour of Israels far-right movement, Kandil said, warning that such a US approach undermines any prospects for lasting peace.\n\nGiven the regions control of the Suez Canal, a vital route for international trade, and its role as a major oil exporter, any chaos or instability in this region will negatively impact US interests, the interests of its European allies, and the global economy, according to Kandil.\n\nFor his part, former Palestinian Ambassador to Egypt Barakat Al-Farra said that Trumps proposal adds fuel to the fire in a vulnerable region suffering from chaos in several spots, including Lebanon, Yemen, and Syria, among others.\n\nWhen the United States, the worlds greatest power, puts forward such a proposal, it only complicates the problems and worsens the situation in the volatile Middle East region, he said, stressing that the US complete bias towards Israel harms regional peace, security, and stability, as well as the US interests in the region.\n\nThe consequences will be dire if the United States insists on holding onto this vision, Al-Farra said.\n\nGAZANS RETURNING HOME\n\nThe resilience of Palestinians in the face of adversity has been on full display as hundreds of thousands of internally displaced residents have recently returned to their homes in northern Gaza, even though those homes have been reduced to rubble during the conflict that has left over 47,000 Palestinians dead since October 7, 2023, according to Gazas health authorities.\n\nThis remarkable scene of throngs of Palestinians walking back home sends a powerful message about their determination to stay on their land and rejection of any displacement attempts, Al-Farra said.\n\nThe former Palestinian diplomat continued that the relocation proposal, coming from a so-called Mideast peace sponsor, is entirely unacceptable  both in form and substance  not only to Palestinians but to the entire Arab world, noting that it was also rejected by many European, Asian, and Latin American states, as well as Canada and Australia.\n\nAl-Farras view was echoed by Egyptian political science professor Tarek Fahmy, who saw that the return of hundreds of thousands of internally displaced Palestinians to their homes in northern Gaza practically demonstrates their rejection of the idea of displacement.\n\nFahmy highlighted the necessity of bringing the issue to the international arena, noting that Gaza evacuation is regionally and internationally rejected.\n\nIt seems that Trump, instead of calming the conflict in the Middle East, is further exacerbating tensions in the region, said the Egyptian professor.  Xinhua.com\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/06/1006-1-1-DON.jpg",
            "description": "CAIRO. – US President Donald Trump’s recent remarks on Palestinians have sparked strong rejection across the Arab world, with experts warning of their grave implications for regional peace and stability. Trump suggested Saturday relocating over a million Palestinians from Gaza to neighbouring countries “where they can maybe live in peace for a change,” a plan […]",
            "time": "06:38",
            "date": "30 Jan 2025"
        },
        {
            "title": "The soulful journey of ‘Banolila’",
            "url": "https://www.herald.co.zw/the-soulful-journey-of-banolila/",
            "content": "Tafadzwa Zimoyo, Entertainment Editor\n\nThere are some songs that subconsciously spring you into dance and fancy footwork, and before you even think of it, you also find yourself singing along, albeit in intermittent huffs and puffs.\n\nMunditjidzeee wobasekulu,\n\nBanolila bana benyuu,\n\nNdokumbila Maboko Hazwadzi,\n\nNdinginise bana kukwele.\n\nThese stirring lyrics from the timeless song, Banolila resonate deeply, raising a tapestry of emotions that unite generations.\n\nIts infectious rhythm invites all to dance freely, embodying joy and sorrow in a single beat.\n\nAt its core, Banolila translates to they are crying in the Kalanga language, echoing the heart-wrenching tale of a mother pleading for financial support to educate her children.\n\nThis poignant narrative captures the struggles faced by many, making the song a powerful anthem for those navigating lifes challenges.\n\nWell, in showbiz circles they know him as Chase Skuza but his real name is Nicholas Skhuza.\n\nI got the name Chase because I was the fastest runner at school.\n\nI did long-distance running so they nicknamed me Long Chase and I later inherited the name in music, revealed Chase in an interview with The Herald Arts.\n\nA proud super dad of 18 children, the towering vocalist and dancer inherited his brothers band and excelled beyond expectations.\n\nWho remembers or still knows, let alone dance to the tune Banolila?\n\nNot every wedding can pass without the track played.\n\nFirst, according to music record, the song was released in 1983 by the late Solomon Skuza, brother to Chase.\n\nTheir catchy hit Banolila later gained traction in the late 90s, and has become their signature hit.\n\nThe well-knit track, which IYASA made a national anthem at the turn of the new millennium is still as wonderful as ever.\n\nBut where is Chase, besides performing at some of the national gala events, what has he been up to and is he still in the game?\n\nHe explains and clarifies on the Banolila song.\n\nBanolila was composed by my late brother Solomon Skuza, it was composed in Zambia during the liberation struggle, early 1978, then he came in 1980 to Zimbabwe and recorded the single in 1981, he said.\n\nWe had a band called Banolila Band with my late brother Solomon.\n\nHe passed away in 1994 on May 24, then l took over, continuing singing as Chase Skuza.\n\nTrue to this, the song has remained popular among the diverse Zimbabwean groups at weddings and parties.\n\nBesides the famous song where and who is Chase?\n\nI am based in Plumtree, Ntoli Village in Bulilimangwe, under Chief Manguba. I am still in the game though I am now 63 years old.\n\nFor now most of my time I will be in the fields. I am now into farming sorghum, maize, millet, and watermelons.\n\nI have been surviving on this apart from music shows, he said.\n\nThe veteran singer said has been in the music industry for 37 years.\n\nI did my first album  Ukubambana which was recorded in 1988 but before that, I used to work with my brother Solomon.\n\nThis year I have my album which I am currently working on and will be ready by August as I will be launching it at a venue yet to be announced.\n\nI have 35 albums under my sleeve and the new album will be my 36th. It is called, Inhlonipho which means Respect, and will carry eight tracks.\n\nThe album is based on teaching children about respect and to desist from drug abuse and early marriages, he said.\n\nBut how does he stay in shape and balance music and farming as a family man?\n\nI have 18 children and to stay in shape, I work very hard, and drink lots of water. I only eat traditional foods and fruits, I jog every morning and make sure I have enough time to sleep, said Chase.\n\nAsked what is the greatest moment in his career, the musician said was when he did the video of Banolila.\n\nSome say Banolila others Balolila but it is all the same.\n\nIn my career, my greatest moment was when I did a video of the hit song (Balolila), collaborating with IYASA.\n\nI miss that a lot and cherish it. This project stayed on top for seven years even up to date, some weddings without this song will be boring, he said.\n\nChase added that to make it in this industry one needs to be diligent and have integrity.\n\nTalent is an inborn thing that you cant take away from anyone.\n\nHowever, when it comes to the music industry, one needs to have good equipment, transportation to and from one place especially if you stay far away, good management, and be professional.\n\nArtists need to desist from drugs. Drugs are not good for health and mental.\n\nMy role model is Lovemore The Great Majayivana and we had a good working relationship and understanding of each other.\n\nMy band members are doing farming when we are not playing music, I have a project of breeding pigs. So far, the project is doing well, he said.\n\nGiven a chance, Chase said would like to work with the King of Sungura Alick Macheso.\n\nI admire Macheso, his consistency and love for music make me want to work with such a personality.\n\nChase said his last performance was on New Years Day at the Hakuna Keziin, Matabeleland South.\n\nIt is an annual event and this time around they invited me.\n\nThe event served as a gathering for the Kalanga people, a way to revive and celebrate their rich heritage.\n\nAs he continues to inspire through music, Chase remains a vibrant force, intertwining the threads of tradition and modernity, reminding us all of the beauty in both laughter and tears.\n\nThrough his heartwarming melodies and unwavering commitment to his community, Chase embodies the spirit of resilience and hope.\n\nIn every note of Banolila, one can hear the echoes of a life well-liveda life filled with love, struggle, and an unyielding passion for music that transcends time and space.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Skuza.jpg",
            "description": "Tafadzwa Zimoyo, Entertainment Editor There are some songs that subconsciously spring you into dance and fancy footwork, and before you even think of it, you also find yourself singing along, albeit in intermittent huffs and puffs. “Munditjidzeee wobasekulu,” “Banolila bana benyuu,” “Ndokumbila Maboko Hazwadzi,” “Ndinginise bana kukwele….” These stirring lyrics from the timeless song, “Banolila” […]",
            "time": "06:38",
            "date": "30 Jan 2025"
        }
    ]
}