{
    "news": [
        {
            "title": "President lays the law. . . ‘Zanu PF will not brook malcontents’",
            "url": "https://www.herald.co.zw/president-lays-the-law-zanu-pf-will-not-brook-malcontents/",
            "content": "Zvamaida Murwira and Joseph Madzimure\n\nPRESIDENT Mnangagwa has issued a stern warning to rogue party members seeking to disrupt peace, unity, and harmony within Zanu PF, declaring that those who fail to adhere to the party line will face dire consequences.\n\nSpeaking at the 382nd Ordinary Session of the Politburo at the partys headquarters in Harare yesterday, the President  who is also Zanu PFs First Secretary  said the revolutionary party would rigorously enforce its constitution to maintain discipline.\n\nZanu PF is a colossal revolutionary party, we have a job to do and a Vision to deliver for the good of the people of our great motherland, Zimbabwe. I applaud all my fellow citizens from across the country, for their clarity, national consciousness and patriotism that continue to squash efforts by malcontents and rogue delusional elements bent on disturbing our peace, unity and harmony, he said.\n\nOur motherland, Zimbabwe, will forever be a constitutional democratic and sovereign nation, with all of us living in unity, peace and harmony. Vanoukura, vanoramba vachiukura, nyika ichienda mberi. (Those who bark will continue doing so while the country moves forward).\n\nThe President said Zanu PF was an unstoppable train while the party constitution was sacred and those who did not toe the correct line would fall by the wayside.\n\nZanu PF chitima chirikufamba. MuZanu PF tinotevera gwara remusangano, nguva dzose, mangwanani, masikati nemanheru. (We follow the party line all the time, whether in the morning, afternoon or evening.) Our Party Constitution is sacred, it is like roots and the trunk of a tree, and we the members are its branches. As with any other revolution, those who do not toe the correct line of the revolution must fall by the wayside, he said.\n\nPresident Mnangagwa said all party members must be responsive to the needs of the people and ensure that their concerns are addressed.\n\nZanu PF must be first responders to the challenges facing our people and communities. I challenge all party members to walk alongside our people and always seek to respond to their needs. In seamless co-ordination, structures of our party, right from the Cell level, District, Province up to the Central Committee and Politburo, must\n\nprovide honest leadership and guidance, with refocus on matters that affect the livelihoods of our people, he said.\n\nPresident Mnangagwa added that party members must be preoccupied with ensuring that all efforts are directed at developing the country.\n\nAll our energies, hands and minds must be fixated on modernising and growing our party membership base. Undertaking projects and initiatives that improve household incomes and the quality of life of our people must be the main focus of our party and the nation as a whole, he said.\n\nPresident Mnangagwa said the Zanu PF Government was facing challenges head-on and seizing opportunities in the unstoppable march towards the realisation of a shared national Vision and goals.\n\nMore importantly, in the ongoing economic revolution, the peoples needs and aspirations are at the core of our priorities. In the agriculture sector, transformational programmes are underway to guarantee national food security and sovereignty. A clear framework is now in place to facilitate the issuance of title deeds towards guaranteeing security of tenure and access to financing for the sector, he said.\n\nMeanwhile, I call upon stakeholders in the agriculture sector to ramp up preparations for the upcoming 2025 Winter Wheat Season.\n\nWith the rainy season coming to an end, Government is set to resume its infrastructural projects.\n\nInfrastructure projects are set to resume in earnest with the impending end of the rainy season. The housing stock in our country is increasing at a phenomenal pace, with remarkable improvement and modernisation, especially in rural areas and growth points. Tourist arrivals are reaching unprecedented levels, while mining sector projects are coming on stream, and having an overall positive impact on our countrys GDP, said President Mnangagwa.\n\nHe briefed the Politburo that he met yesterday with representatives of small and medium enterprises and vendors in the quest to build consensus and explore policy solutions for formalising and modernising the sector.\n\nThese indicators are evidence that we are a country on the rise and Vision 2030 is attainable. In the sports and recreation sector, our party, Zanu PF, takes pride in the election of the Honourable Minister of Sports, Recreation, Arts and Culture, Kirsty Coventry, as the first female and 10th president of the International Olympics Committee. Indeed, this is a historic and phenomenal feat. Congratulations, Makorokoto Zimbabwe, President Mnangagwa said.\n\nHe commended the party, Youth League, and partners for the unity of purpose and strong collaboration that enabled the successful launch of the Presidential Youth Empowerment Facility.\n\nThe significant participation of industry stakeholders in this strategic initiative re-ignites the Party-State and private sector partnerships. Well done to the Youth League, well done to you all. Support for innovative and private enterprises as well as long-term multi-sectoral empowerment pathways, which benefit the youth and women, are being implemented at an accelerated pace. Under my leadership, Zanu PF is prioritising the dignity of hard honest work, production and productivity, said President Mnangagwa.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/35t35t-680x380.jpg",
            "description": "Zvamaida Murwira and Joseph Madzimure PRESIDENT Mnangagwa has issued a stern warning to rogue party members seeking to disrupt peace, unity, and harmony within Zanu PF, declaring that those who fail to adhere to the party line will face dire consequences. Speaking at the 382nd Ordinary Session of the Politburo at the party’s headquarters in […]",
            "time": "09:46",
            "date": "27 Mar 2025"
        },
        {
            "title": "‘We’ll create conducive  environment for vendors’",
            "url": "https://www.herald.co.zw/well-create-conducive-environment-for-vendors/",
            "content": "Wallace Ruzvidzo\n\nHerald Reporter\n\nGovernments doors are always open to vendors and those in the informal sector as they play a vital role in the countrys economic development, President Mnangagwa has said.\n\nDemonstrating his open-door policy, President Mnangagwa yesterday met representatives of vendors at State House in Harare, where issues afflicting the sector were discussed.\n\nThe President said the Second Republics attempt to formalise the informal sector should not be perceived as a threat, but rather as an initiative to bring order and sanity to the sector.\n\nAs we are all aware, the informal sector plays a crucial role in Zimbabwes economy, providing livelihoods for millions of citizens. However, there have been some worrisome trends affecting the sector, which if left unchecked, will have dire ripple effects on our country and overshadow the important role of this critical sector, he said.\n\nAn attempt by Government to formalise your sector, and create decent work spaces should never be seen by vendors and the informal sector as a direct threat to your survival. As a Government, our doors are always open and we are always ready to hear your concerns.\n\nThe President also called upon vendors and those in the informal sector to complement Government efforts to bring order and sanity to the crucial sector.\n\nI trust that you are also ready to hear our concerns. I hope that this meeting will give insights to Government officials as we address grievances and explore policy solutions for both the formalisation and modernisation of this sector, as well as its integration into the mainstream economy.\n\nBy engaging with vendors and informal traders, the Government hopes to address their challenges and create a more conducive business environment, he said.\n\nUnder my leadership, our national development mantra is Nyika inovakwa, inotongwa, inonamatirwa nevene vayo/Ilizwe lakhiwa, libuswe, likhulekelwe ngabanikazi balo.\n\nThus, the President added, all sectors of the economy had the obligation to contribute positively rather than negatively to the countrys current development trajectory.\n\nWe all have a responsibility to build, modernise and industrialise our country, not only for us but for future generations. This duty lies with all of us, together as a united and patriotic people with one shared vision for Zimbabwe, he said.\n\nPresident Mnangagwa called for free and frank dialogue between Government and informal sector players towards the realisation of national goals.\n\nIt is in this spirit that I urge us to feel free and have frank and honest discussions. I hope that we will also come up with solutions that will move our country forward to prosperity and greater unity.\n\nLet our dialogue, therefore, be guided by the true spirit of nation-building and in the national interest.\n\nPresident Mnangagwa said it was important that Governmentdevelops a framework for structured vendor regulation that balances urban order and the need for vendors to earn a living.\n\nBe assured that my Administration is committed to facilitate the establishment of convenient and accessible decent work spaces for vendors.\n\nEqually, we recognise the need to avail micro-finance and training as well as to ensure that licencing and permits for vendors and the informal sector are streamlined, in line with our ease of doing business reforms.\n\nIt is important that you undertake your trade in an orderly manner, respecting those that operate around you and the broader environment and community where you operate, he said.\n\nPresident Mnangagwa said the maintenance of order was non-negotiable and, in this regard, the Ministry of Local Government and Public Works was directed to work with Local Councils and the private sector to build market stalls and decent work spaces for vendors as a matter of urgency.\n\nHe added that the facilities must include the requisite water and sanitation infrastructure.\n\nWe must have order and as responsible citizens; we should never gloss over this matter. We must be honest that we cannot let the state of our country degenerate right under our eyes, President Mnangagwa said.\n\nHe also rallied vendors to be alert and vigilant and never allow the abuse of their sector by criminal elements and drug king-pins.\n\nWe must take ownership and be upright citizens as a sector for the good of our motherland, Zimbabwe, President Mnangagwa said.\n\nSpeaking after the meeting, Local Government and Public Works Minister Dr Daniel Garwe said the President had warned against night vending.\n\nThe Minister added that Government was concerned that Municipal Police were harassing vendors.\n\nThere are better ways to deal with them, he said.\n\nWomens Affairs, Community, Small and Medium Enterprises Development Minister Monica Mutsvangwa weighed in saying vendors had expressed their commitment to orderly conduct.\n\nThey have been asked to come and talk to the President about the situation on the ground. These vendors are committed to making sure that they meet the cost of bringing up their families. We are seeing everyone becoming very actively involved, she said.\n\nSecretary for all tuckshop associations Mr Lovemore Mudzoki said the informal sector and vendors were willing to play ball for broader national development.\n\nWe are committed to working together with Government and we are saying no to demonstrations because they affect our work. Let us work and solve whatever issues amicably, he said.\n\nThe meeting sought to foster a collaborative relationship between Government and the informal sector, which is a significant contributor to Zimbabwes economy.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/wdqwd-680x380.jpg",
            "description": "Wallace Ruzvidzo Herald Reporter Government’s doors are always open to vendors and those in the informal sector as they play a vital role in the country’s economic development, President Mnangagwa has said. Demonstrating his “open-door policy”, President Mnangagwa yesterday met representatives of vendors at State House in Harare, where issues afflicting the sector were discussed. […]",
            "time": "09:46",
            "date": "27 Mar 2025"
        },
        {
            "title": "Trump funding cut: Health ministry seeks supplementary budget",
            "url": "https://www.herald.co.zw/trump-funding-cut-health-ministry-seeks-supplementary-budget/",
            "content": "Farirai Machivenyika\n\nSenior Reporter\n\nTHE Ministry of Health and Child Care has proposed that Treasury presents a supplementary budget to address the impact of the withdrawal of United States funding for the health sector, especially on HIV/Aids programmes.\n\nThe Permanent Secretary for Health and Child Care, Dr Aspect Maunganidze, said the procurement of Anti-Retroviral drugs, condoms and other measures to prevent the transmission of sexually-transmitted infections had been affected by the withdrawal of the US Presidents Emergency Plan for AIDS Relief (PEPFAR).\n\nDr Maunganidze said this when he appeared before the joint sitting of the Portfolio Committee on Health and Child Care and the Thematic Committee on HIV and Aids to brief them on the impact of the withdrawal of US funding and measures they were taking to alleviate the impact.\n\nSoon after returning to the White House, US President Donald Trump suspended all foreign aid administered through the US Agency for International Aid (USAID). While PEPFAR is overseen by the US State Department, it is implemented primarily by other agencies particularly USAID and the Centre for Disease Control (CDC).\n\nDr Maunganidze said while they had contingency plans for funding withdrawal, the abrupt nature and magnitude of the US action was not expected.\n\nSo, we have noted over the years that there has been a gradual decrease of donor support in general. This was the worst because it was just a cut. But otherwise, knowledge that donors will slowly go away is something that we are aware of, he said.\n\nHowever, for this immediate need that we have, we have to acknowledge that timely and adequate disbursement of allocated budgets from Treasury would go a long way in addressing some of our needs. It might not be enough, but if its timely and as a budget, then at least we know we have something to start with.\n\nDr Maunganidze said in addition, they were also requesting for proper ring-fencing of funds that have been put in place specifically for health.\n\nThese include the Health Life Fund, which has been in existence for some time, where every time you make a call, or you use data, or you send an SMS, a small percentage goes to the Health Life Fund, if this is properly ring-fenced, it will go a long way, he said.\n\nIf this is also properly ring-fenced, it will assist a lot. If there are other taxes that can be specifically, which exist, but can also be specifically ring-fenced, it will go a long way. With the abrupt US government freeze, we foresee a situation where a supplementary budget would be inevitable.\n\nThe ministry has been receiving between 40 percent and 55 percent of its budget from partners, with the remainder coming from the US government.\n\nDr Maunganidze said the establishment of the long-awaited National Health Insurance scheme would also go a long way in addressing funding for the health sector.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/12/Aspect-Maunganidze-46.jpg",
            "description": "Farirai Machivenyika Senior Reporter THE Ministry of Health and Child Care has proposed that Treasury presents a supplementary budget to address the impact of the withdrawal of United States funding for the health sector, especially on HIV/Aids programmes. The Permanent Secretary for Health and Child Care, Dr Aspect Maunganidze, said the procurement of Anti-Retroviral drugs, […]",
            "time": "09:46",
            "date": "27 Mar 2025"
        },
        {
            "title": "BSA Bill to align with public entities",
            "url": "https://www.herald.co.zw/bsa-bill-to-align-with-public-entities/",
            "content": "Farirai Machivenyika\n\nSenior Reporter\n\nInformation, Publicity and Broadcasting Services Minister, Dr Jenfan Muswere yesterday told Senate that the Broadcasting Services Amendment Bill was meant to align the law with the Constitution and the Public Entities and Corporate Governance Act, among other objectives.\n\nDr Muswere said this while presenting his second reading speech in the House following its passage in the National Assembly two weeks ago.\n\nThe objective of the Broadcasting Services Amendment Bill, 2024, is principally to align the Broadcasting Services Act with the Constitution and also with the Public Entities Corporate Governance Act.\n\nCertain sections of the Act have become inconsistent with the new Constitution, something which has necessitated the current alignment process.\n\nTechnology has also evolved rapidly over the last few years pointing to the need for the broadcasting laws to be aligned with other legislations, he said.\n\nThe BSA contains 21 clauses and Clause 2 introduces additional definitions for new classes of broadcasting services licences introduced in section 7 to ensure that all instances of broadcasting that are done over the internet are covered.\n\nClause 3 amends section 2A of the principal Act to provide that the role of the Broadcasting Authority of Zimbabwe (BAZ) as to regulate and manage the broadcasting service bands for sustenance rather than control broadcasting service bands. The intention is to move away from a perception that the legislation is intended to stifle the freedoms guaranteed by section 61 of the Constitution and instead to focus on necessary regulation of the airwaves.\n\nClause 4 amends section 4 of the principal Act is amended to reduce the number of board members from 12 to seven. The Clause also provides for gender balance within the Board. This is to ensure that the number of Board members is commensurate with the size of the Institution and in line with other such as POTRAZ, Dr Muswere said.\n\nThe boards minister added that the Bill in Clause 5 amends section 7(2) of the principal Act, which provides for classes of broadcasting services and systems which may be licensed by the Authority.\n\nThe amendments have been necessitated by developments in technology, where classification of broadcasting services should be independent of the platform from where the service is delivered or received as developments in technology result in new platforms emerging or existing platforms evolving to deliver broadcasting services, which will require frequent reviews to the classification, he added.\n\nClause 6 amends section 10 of the principal Act to introduce predictability in the applications mainly for granting or refusal of licences. What this means is that there will be predictability for licences that make use of the broadcasting frequency spectrum which will be applied for once a year. Amendments to subsection 6 are to ensure that only services that make use of the band spectrum, a national public resource, go through a public inquiry.\n\nClause 7 amends section 11(4) of the principal Act by ensuring that broadcasting service licensees broadcast in all languages spoken in the area they serve to promote the use of officially recognised languages identified in the Constitution.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/qefqef-1-680x380.jpg",
            "description": "Farirai Machivenyika Senior Reporter Information, Publicity and Broadcasting Services Minister, Dr Jenfan Muswere yesterday told Senate that the Broadcasting Services Amendment Bill was meant to align the law with the Constitution and the Public Entities and Corporate Governance Act, among other objectives. Dr Muswere said this while presenting his second reading speech in the House […]",
            "time": "09:46",
            "date": "27 Mar 2025"
        },
        {
            "title": "Govt reaffirms commitment to empowering local communities",
            "url": "https://www.herald.co.zw/govt-reaffirms-commitment-to-empowering-local-communities/",
            "content": "Trust Freddy\n\nHerald Correspondent\n\nEMPOWERING local communities is a major Government policy focusing on equipping individuals and authorities at the sub-district level with necessary skills and resources as espoused in the devolution and decentralisation policy.\n\nThis pledge was made by the Chief Secretary to the President and Cabinet, Dr Martin Rushwaya, at the annual steering committee meeting for the 2022-2026 Zimbabwe UN Sustainable Development Cooperation Framework held in Harare yesterday.\n\nThe meeting was attended by several senior Government officials, including Public Health Advisor to the President, Dr Agnes Mahomva, Industry and Commerce Permanent Secretary Dr Thomas Utete Wushe, and Permanent Secretary for Justice, Legal and Parliamentary Affairs Mrs Vimbai Nyemba.\n\nIn a speech read on his behalf by the Deputy Chief Secretary in the Office of the President and Cabinet, Reverend Paul Damasane, Dr Rushwaya said Government remained committed to the responsibility of equipping the people and authorities at the sub-district level, with the necessary skills and resources to enable them to become active economic participants, and not just beneficiaries.\n\nIt is encouraging to note that the UN Country Team in Zimbabwe shares this vision, and is taking active steps to implement it through the co-operation framework, emphasising the four strategic areas agreed upon.\n\nThe four key areas include people-centred and equitable human development and well-being; environment protection, climatic resilience and natural resource management; economic transformation that is equitable and inclusion; and accountable, equitable and inclusive governance.\n\nGovernment has embraced the concept of devolution and decentralisation to creative economic hubs for development at sub-national level, Dr Rushwaya said.\n\nThis allows provinces to effectively use their resource endowments and comparative advantages. Both NDS1 and the co-operation framework have adopted devolution and decentralisation as a means to achieve our collective goals.\n\nHe urged stakeholders to focus on outcomes and impact, rather than just tracking activities.\n\nLet me reiterate that as we advance towards the realisation of Vision 2030, our focus must shift from activities to outcomes. The real measure of success is not the number of projects initiated and completed, but the tangible improvements on the lives of Zimbabweans.\n\nOther notable figures from the development partners included UN resident and humanitarian coordinator to Zimbabwe Ambassador Edward Kallon, United Nations Development Programme (UNDP) resident co-ordinator Dr Ayodele Odusola, and World Bank country manager for Zimbabwe Eneida Fernandes. As the country moves towards the end of 2026, which is the year that the current Cooperation Framework will end, Dr Rushwaya said focus should be on measuring the impact of interventions.\n\nAs NDS2 is being formulated, Government will mainstream and strengthen the concept of the Whole of Government and Society Approach so that all stakeholders including the UN Country Team play a critical role in the formulation and implementation of this blueprint.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/fefr-680x380.jpg",
            "description": "Trust Freddy Herald Correspondent EMPOWERING local communities is a major Government policy focusing on equipping individuals and authorities at the sub-district level with necessary skills and resources as espoused in the devolution and decentralisation policy. This pledge was made by the Chief Secretary to the President and Cabinet, Dr Martin Rushwaya, at the annual steering […]",
            "time": "09:46",
            "date": "27 Mar 2025"
        },
        {
            "title": "State committed to delivering quality services",
            "url": "https://www.herald.co.zw/state-committed-to-delivering-quality-services/",
            "content": "Wallace Ruzvidzo\n\nHerald Reporter\n\nTHE Second Republic will continue implementing more reforms that will ensure the betterment of Zimbabweans livelihoods, riding on the countrys current economic growth momentum, President Mnangagwa has said.\n\nIn his remarks during the announcement of the 2024 Performance Evaluation Results and 2025 Performance Contracts Signing Ceremony at State House in Harare on Monday, the President reaffirmed Governments commitment to implementing sweeping reforms as the country nears upper-middle-class economic status by 2030.\n\nThe world over, Governments are no longer measured by the promises they make to the people and credibility of their plans, but by high performance, efficient resource utilisation, and delivery of quality services.\n\nIn our case, this (event) attests to the work culture being institutionalised to enhance performance and accountability across the public sector, for high-impact results, he said.\n\nPresident Mnangagwa said Government was rolling out a cocktail of initiatives that would enable the ordinary Zimbabwean to gauge the forward momentum towards the achievement of national goals.\n\nUndoubtedly, Performance Contracting introduced in 2021 has had a propelling effect and enabled stakeholders, including ordinary citizens, to assess progress by Ministries, Departments and Agencies in achieving targets set out in the National Development Strategy and Vision 2030.\n\nIt is commendable that since the introduction of performance contracting, we have witnessed notable milestones across all sectors.\n\nThe growing culture of accountability, integrity, efficiency and effectiveness is also applauded, he said.\n\nThe President renewed his promise to instil a culture of discipline, transparency and results-driven governance among those in public service.\n\nMeanwhile, Performance Contracts and internalisation of the Integrated Result Based Management principles are driving programming and a new work ethic within Government.\n\nFurthermore, the performance ratings, awards and recommendations have also enhanced policy and structural responsiveness, while injecting positive competition among MDAs, he said.\n\nDigitalisation, said President Mnangagwa, was a critical aspect of the countrys modernisation and industrialisation drive, thus, clear deadlines would be given in terms of digital adoption targets.\n\nThe Second Republic, under my leadership, will continue with its modernisation drive by digitalising services and improving efficiencies in all administrative processes.\n\nClear deadlines must now be issued requiring that relevant online services be deployed across the public sector to improve convenience to our citizenry. The provision of online services should be a key result area of your performance evaluation, he said. In line with global standards, the President said Government was working towards certification of MDAs to improve standardisation as well as quality and risk management.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/03/HE-4.jpg",
            "description": "Wallace Ruzvidzo Herald Reporter THE Second Republic will continue implementing more reforms that will ensure the betterment of Zimbabweans’ livelihoods, riding on the country’s current economic growth momentum, President Mnangagwa has said. In his remarks during the announcement of the 2024 Performance Evaluation Results and 2025 Performance Contracts Signing Ceremony at State House in Harare […]",
            "time": "09:46",
            "date": "27 Mar 2025"
        },
        {
            "title": "MPs hail Minister Mhona, team",
            "url": "https://www.herald.co.zw/mps-hail-minister-mhona-team/",
            "content": "Freeman Razemba\n\nSenior Reporter\n\nLEGISLATORS have hailed Transport and Infrastructural Development Minister Felix Mhona for being recognised as the best-performing Cabinet Minister of 2024, as well as other senior officials from the ministry and parastatals under its purview.\n\nThis week, President Mnangagwa awarded Government officials from various sectors for their exceptional performance that is contributing to the development of the nation.\n\nAmong them was the Permanent Secretary in the Ministry of Transport and Infrastructural Development, Engineer Joy Makumbe, who was recognised as the best performer while Zinaras board chair, Dr George Manyaya and Zinara chief executive officer Mr Nkosinathi Ncube were also awarded as the Best Performing officials in their categories.\n\nThe Chairperson of the Parliamentary Portfolio Committee on Transport and Infrastructural Development, Tawanda Karikoga, told Parliament that the Committee was grateful and welcomed the honour that was given to Minister Mhona and his team.\n\nThank you Madam Speaker. I rise to congratulate our Minister of Transport and Infrastructural Development and his team for being named the best performing in 2024.\n\nUs as a Portfolio Committee, we are grateful and we welcome the honour that was given to our Minister.\n\nWe also extend our congratulations to the Permanent Secretary of the same Ministry because she was also named the best performing Permanent Secretary. We have also seen the commitment demonstrated by the Honourable Minister here in Parliament on Wednesdays.\n\nHe is always here, available to answer questions. I also commend his commitment to the business of our Portfolio Committee. He always avails himself and his team to support the Portfolio Committee. The ZINARA Board Chairman and CEO of ZINARA, Dr Manyaya and Mr Ncube respectively, were also named the best performing Board Chair and the best performing CEO, he said.\n\nCde Karikoga said Dr Manyaya and Mr Ncube had managed to ensure that there was accountability and transparency within Zinara since they were appointed. We all know ZINARA was a crime scene but the recognition by the President is welcome to our Portfolio Committee. I also want to thank the wisdom of our President, His Excellency, for committing our ministers into signing performance contracts. This is welcome and gives our citizens confidence in ensuring that our ministers are somehow accountable to their principals. I thank you, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/AWARD9-680x380.jpg",
            "description": "Freeman Razemba Senior Reporter LEGISLATORS have hailed Transport and Infrastructural Development Minister Felix Mhona for being recognised as the best-performing Cabinet Minister of 2024, as well as other senior officials from the ministry and parastatals under its purview. This week, President Mnangagwa awarded Government officials from various sectors for their exceptional performance that is contributing […]",
            "time": "09:46",
            "date": "27 Mar 2025"
        },
        {
            "title": "Farmer in trouble for growing mbanje",
            "url": "https://www.herald.co.zw/farmer-in-trouble-for-growing-mbanje/",
            "content": "Victor Maphosa\n\nMashonaland East Bureau\n\nMutoko farmer Zvenyika Hodzi (48) was recently arrested by police on allegations of illegally planting more than 1 100 mbanje plants in his tobacco field, alternating with the legal tobacco plants, as he moved into commercial production of the illicit drug.\n\nHis operation came to light after the police received information of the illegal activity. Police visited the farm where they uprooted the plants and arrested Hodzi who, Mashonaland East police spokesperson Inspector Simon Chazovachiyi said was now assisting the police with investigations.\n\nCircumstances are that the police received information that Hodzi had cultivated dagga in his tobacco field.\n\nActing upon the information, police proceeded to the said plot and conducted some searches, leading to the recovery of 1163 plants of mbanje planted in between conventional tobacco plants, he said.\n\nInsp Chazovachiyi said following the recovery, Hodzi was immediately arrested.\n\nHe went on to warn the public against illegal cultivation of dagga.\n\nHe also applauded the public for supplying the police with information on illegal activities.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2017/03/Dagga-Marijuana-Mbanje-e1582232134631.jpg",
            "description": "Victor Maphosa Mashonaland East Bureau Mutoko farmer Zvenyika Hodzi (48) was recently arrested by police on allegations of illegally planting more than 1 100 mbanje plants in his tobacco field, alternating with the legal tobacco plants, as he moved into commercial production of the illicit drug. His operation came to light after the police received […]",
            "time": "09:46",
            "date": "27 Mar 2025"
        },
        {
            "title": "Coventry’s historic rise to IOC helm game-changer for global sports",
            "url": "https://www.herald.co.zw/coventrys-historic-rise-to-ioc-helm-game-changer-for-global-sports/",
            "content": "Innocent Mujeri\n\nKirsty Coventrys election as the new president of the International Olympic Committee (IOC) is a defining moment in the history of global sports.\n\nThe Zimbabwean swimming legend, a two-time Olympic champion, has made history as the first woman, the first African, and the youngest person ever to hold this prestigious position at just 41 years old.\n\nHer rise to the helm of the IOC is not just a personal achievement, but a monumental shift in international sports governance, one that carries deep significance for Zimbabwe, Africa, and the broader world of sports diplomacy.\n\nFor Zimbabwe, Coventrys election brings a much-needed moment of pride and recognition on the global stage.\n\nThis moment offers Zimbabwe a chance to reshape its global image, proving that it remains a nation capable of producing world-class talent, not only athletes but in leadership.\n\nCoventrys success is a testament to perseverance and excellence, reinforcing the idea that Zimbabweans can excel in international arenas when given the opportunity.\n\nThis development is particularly significant within the framework of Zimbabwes engagement and re-engagement policy.\n\nAt a time when the country is seeking to rebuild and strengthen its relationships with global partners, Coventrys presence in such a powerful international role can serve as a bridge between Zimbabwe and key stakeholders.\n\nHer influence within the IOC will naturally lead to interactions with world leaders, sports federations, and multinational corporations, placing Zimbabwe in a favourable position to leverage sports diplomacy for greater economic and diplomatic benefits.\n\nSport has long been used as a tool for uniting nations, and Coventrys leadership offers Zimbabwe a unique opportunity to forge new partnerships and foster goodwill on a global scale.\n\nHer election also marks a defining moment for Africa, a continent that has long been underrepresented in global sports governance.\n\nFor years, African athletes have dazzled on the track, in the pool, and on the field, yet the decision-making structures of international sports have often excluded voices from the continent.\n\nCoventrys rise changes that dynamic, ensuring that Africa now has a powerful advocate at the highest level of sports administration.\n\nThis could lead to increased investment in sports infrastructure, greater funding for African athletes, and a stronger push for an African nation to one day host the Olympics.\n\nThe impact of her leadership will extend far beyond Zimbabwe, as her voice will carry the concerns and aspirations of an entire continent. Beyond geography, Coventrys election is also a victory for women around the world, particularly in leadership and sports administration.\n\nThe IOC has traditionally been dominated by men, and the sports industry as a whole continues to struggle with gender disparities in pay, opportunities, and recognition.\n\nCoventrys historic achievement sends a powerful message that women are not only capable of excelling in sports but also of leading the very institutions that govern them.\n\nHer journey from an elite athlete to the president of the IOC is an inspiring narrative for young girls, particularly in Africa, where cultural and societal barriers often limit womens rise to leadership roles.\n\nHer success is a reminder that with determination, talent, and perseverance, women can break through even the most rigid glass ceilings.\n\nIn Zimbabwe, Coventrys leadership could also be a catalyst for sports development and policy reforms. As the countrys former Minister of Sport, Arts, and Recreation, she understands firsthand the struggles faced by Zimbabwean athletes.\n\nLimited funding, inadequate training facilities, and lack of structured development programmes have long hindered the countrys sporting potential.\n\nHer new role could open doors for increased financial support, better infrastructure, and more opportunities for young athletes.\n\nIt is not unrealistic to expect that under her leadership, Zimbabwe could secure international funding and partnerships to improve its sports ecosystem.\n\nHer presidency could also create avenues for Zimbabwe to host more international sporting events, which would not only boost tourism but also generate much-needed economic activity.\n\nFrom a broader economic perspective, Coventrys election could indirectly contribute to Zimbabwes growth.\n\nGlobal attention on Zimbabwe as her home country presents an opportunity to market itself as a destination for sports tourism and investment.\n\nMajor international brands that are involved in the Olympics may now see Zimbabwe in a new light, potentially leading to sponsorship deals, partnerships, and business opportunities in the countrys sports sector.\n\nAt a time when Zimbabwe is looking for ways to revitalise its economy, Coventrys global prominence could be an asset in attracting foreign investment.\n\nOn a global scale, her presidency comes at a crucial time for the IOC. The organisation has faced its fair share of challenges, from corruption scandals to concerns over the rising costs of hosting the Olympics.\n\nHer reputation for integrity and excellence positions her as a leader who can bring about much-needed reforms. With her firsthand experience as an athlete, she is uniquely placed to advocate for policies that prioritise athlete welfare, promote gender equality in sports, and ensure that the Olympic Games remain a force for good.\n\nIssues such as doping, financial transparency, and the environmental impact of the Olympics are all areas where her leadership could make a difference.\n\nAs the world celebrates this historic moment, it is clear that Coventrys election is not just a personal victory but a symbol of progress on multiple fronts.\n\nFor Zimbabwe, it is a chance to rebrand itself on the world stage. For Africa, it is a step towards greater influence in global sports governance.\n\nFor women, it is proof that leadership roles at the highest levels are within reach. And for the global sports community, it signals a new era of leadership that could bring about much-needed change.\n\nCoventrys journeyfrom a young swimmer representing Zimbabwe on the Olympic stage to now leading the very institution that governs the Games  is a story of resilience, excellence, and inspiration.\n\nHer tenure as IOC president will undoubtedly be watched closely, but one thing is certain: the world of sports will never be the same again.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Kirsty-Coventry-1.jpg",
            "description": "Innocent Mujeri Kirsty Coventry’s election as the new president of the International Olympic Committee (IOC) is a defining moment in the history of global sports. The Zimbabwean swimming legend, a two-time Olympic champion, has made history as the first woman, the first African, and the youngest person ever to hold this prestigious position at just […]",
            "time": "09:46",
            "date": "27 Mar 2025"
        },
        {
            "title": "Editorial Comment: Independent power producers now building their stations",
            "url": "https://www.herald.co.zw/editorial-comment-independent-power-producers-now-building-their-stations/",
            "content": "FOR the last few years, independent power producers  private power stations connected to the national transmission and distribution grid  have been seen as an essential pillar of building up Zimbabwes electric generation capacity to cope with the rapidly rising rates of growth in many sectors.\n\nWhile the Second Republic was perfectly aware that the then six units at Hwange Thermal needed to be renovated or even rebuilt, that new units needed to be added, and that plans needed to be made for a third major station, the capital constraints meant that additional investment beyond what Zesa could find would be essential.\n\nWhen the concept of private independent power producers was announced, there was a burst of applications for licences, but nothing much was done on the ground in building private thermal and solar stations. And even the large amount of hot air generated by some of the talk from licence holders was no substitute for a real station generating real electricity for sale.\n\nThere was a growing trend for many businesses without heavy machinery to install solar panels on their roofs to cope with load-shedding and other outages, largely replacing the smaller standby generators at first, but then seen as a useful way of cutting energy bills.\n\nBut these, while reducing demand for grid power from businesses whose most power-hungry equipment might be a modest data-base server and a chain of computer work stations, were in a separate category from what was needed and wanted  multi-megawatt power stations supplementing the big power stations owned by Zesa, which were being expanded and renovated.\n\nIt was soon clear that while a large proportion of the applications from would-be independent power producers were simply speculative, someone getting the paperwork done so that the licence could perhaps be sold later to an investor with actual money, there was also a group of genuine applicants who were worried about the business details.\n\nSo the Government worked out a far more detailed policy that would in effect guarantee sales at a fair price for serious investors, or at least those putting in their money while Zimbabwe was short of power.\n\nAt the same time investors in mining, mineral processing and nascent heavy industry, all with very heavy power requirements, were offered a high level of flexibility if they built big power stations. They would be able to reserve output for their own power-using investments, and be able to transmit that power over the national grid for very modest fees, and still be able to have the contracts a pure power station investor was getting so they could sell the surplus.\n\nThis sorting out of contractual arrangements has provided the spark that was needed to get the serious independent power producers to start building and producing.\n\nAlready, the independents are moving towards 100MW in total, and have more than replaced the three very old small thermals that saw their last new equipment in the 1950s and now are not viably worth being completely rebuilt from scratch.\n\nBut we are on the cusp of a major jump in output with work in advanced levels of progress or just completed on almost another 500MW of mostly thermal but some commercial solar generating capacity.\n\nCabinet saw the list on Tuesday: Construction of the 120MW Maximind thermal in Buhera completed; construction of the 100MW Prestige thermal in Beitbridge on course; construction of the 20MW thermal at Manhize on course; construction of the 240MW Zhongzhing Heli thermal in Hwange on course with the first 20MW already commissioned; the 2,5MW Guruve solar on course, the 10MW New Glovers solar in Kwekwe on course; the 45MW Zimplats solar in Chegutu 45 percent complete.\n\nThere are other power stations in the pipeline from investors who are considered serious. Besides the presently installed capacity plus the 500 MW coming reasonably soon from thermal and solar stations now under construction, these investment certainties are expected to add around 1 000MW.\n\nZimbabwe is now looking at economic growth rates predicted to be around 6 percent a year and that requires a lot of power. The sort of growth we are seeing outside the mining sector was also displayed at the Cabinet meeting.\n\nThis includes more than US$3,2 million in new manufacturing plants in the first three months of the year. There is also the building of new business and industrial parks, plus hundreds of new smaller businesses.\n\nAll of these require electricity. Some can thrive, let alone cope, with a modest solar array on the roof. But some will require grid power. Some of the increased demand for residential and small business purposes, especially in rural areas, will now be met by the community solar mini-grids now being installed in a five-year programme, which will help push up standards of living and, incidentally, make the expansion of reasonably priced data connections and the data backbone, now a priority with Government, important to ending the rural-urban divide.\n\nBuilding a power station, or expanding an existing power station, is not an instant process.\n\nWe are talking about construction, installing equipment, wiring everything up, testing and the commissioning process for each new project.\n\nSo what is important is that engineers and contractors are on site, that work is being done, that equipment is being ordered and delivered, in other words action rather than talk or displays of intent or even applications for licences.\n\nAnd we now have an ever greater flow of such activity in the projects pipeline, thanks to a pro-investment set of specific and detailed Government policies and some serious investors responding to these certainties and prepared to back their plans with hard cash.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/07/Electricity_Station_Prenton_-_geograph.org_.uk_-_198118.jpg",
            "description": "FOR the last few years, independent power producers — private power stations connected to the national transmission and distribution grid — have been seen as an essential pillar of building up Zimbabwe’s electric generation capacity to cope with the rapidly rising rates of growth in many sectors. While the Second Republic was perfectly aware that […]",
            "time": "09:46",
            "date": "27 Mar 2025"
        }
    ]
}