{
    "news": [
        {
            "title": "Bulawayo committed to unity-Minister Ncube",
            "url": "https://www.herald.co.zw/bulawayo-committed-to-unity-minister-ncube/",
            "content": "Nqobile Bhebhe\n\nThe Minister of State for Bulawayo Provincial Affairs and Devolution Judith Ncube says Bulawayo has demonstrated its commitment to unity in the country by hosting the prestigious thanksgiving prayer service.\n\nShe said the city is a symbol of untapped potential and exemplifies the rich opportunities that the country has.\n\nIn her welcome remarks at the 8th National Thanksgiving and Dedication Service in Bulawayo, Minister Ncube said Bulawayo remains steadfast to innovation and spirit of stewardship as the country forges ahead to be an upper middle-income society by 2030.\n\nShe also highlighted the spirit of forgiveness prevailing in the country. This years National Thanksgiving and Dedication Service, hosted by the Inter-denominational churches is being held under the theme: Our Nation, Our Opportunity  Celebrating the progress and acknowledging the potential for our country Zimbabwe.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/951f31c1-a874-4c57-953d-72a8657e9e98-680x380.jpeg",
            "description": "The Minister of State for Bulawayo Provincial Affairs and Devolution Judith Ncube says Bulawayo has demonstrated its commitment to unity in the country by hosting the prestigious thanksgiving prayer service.",
            "time": "20:31",
            "date": "29 Dec 2024"
        },
        {
            "title": "Zimbabwe National Elders Forum assures President on study on oppression",
            "url": "https://www.herald.co.zw/zimbabwe-national-elders-forum-assures-president-on-study-on-oppression/",
            "content": "Nqobile Bhebhe\n\nThe Zimbabwe National Elders Forum (ZNEF) has reassured President Mnangagwa that a true brutal century-long colonial rule account that dispossessed indigenous Zimbabweans of their land and livestock will be documented.\n\nThe idea is to have the British government pay restitution to millions of people affected and restore dignity in the aftermath of the subjugation of indigenous Zimbabweans by the racist colonial regime.\n\nSpeaking at the ongoing 8th Thanksgiving and Dedication Service in Bulawayo, Zimbabwe National Elders Forum chairperson Bishop Felix Mukonowengwe said thorough research on affected people is ongoing.\n\nHe said they are working with traditional chiefs and a team of experts.\n\nWe met with His Excellency and he told us to go and do a thorough research in all communities, he said.\n\nWe are now talking to experts, talking to people gathering tangible information to go with to the United Kingdom.\n\nLet us unite as Zimbabweans and move this program ahead. Over the years, people lost livestock to the whites, we need that to be addressed, livestock should be returned in the form of money. This will happen, President Mnangagwa.\n\nRev Mukonowengwe, said while the history of the country under colonialism had been documented, the trauma experienced by indigenous Zimbabweans has not been fully recorded, which is what they hoped to achieve in the study.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/83440747-4420-40d8-8d27-a1fa6a41c679-680x380.jpeg",
            "description": "Nqobile Bhebhe The Zimbabwe National Elders Forum (ZNEF) has reassured President Mnangagwa that a true brutal century-long colonial rule account that dispossessed indigenous Zimbabweans of their land and livestock will be documented. The idea is to have the British government pay restitution to millions of people affected and restore dignity in the aftermath of the […]",
            "time": "20:31",
            "date": "29 Dec 2024"
        },
        {
            "title": "Raza nominated for T20I Player of the Year",
            "url": "https://www.herald.co.zw/raza-nominated-for-t20i-player-of-the-year/",
            "content": "Brandon Moyo\n\nZIMBABWE T20I captain Sikandar Raza has been nominated for the International Cricket Council (ICC) T20I Player of the Year for the third time running.\n\nThe 39-year-old all-rounder continued to deliver for the Chevrons in 2024, and was instrumental in their unbeaten run in the ICC Mens T20 World Cup sub-regional Africa Qualifier Group B, smashing 199 runs and picking up 10 wickets.\n\nHe is nominated alongside Babar Azam (Pakistan), Travis Head (Australia), and Arshdeep Singh (India).\n\nHe led Zimbabwe to victories over Sri Lanka, Bangladesh, India, Pakistan, and Afghanistan.\n\nAt the sub-regional qualifier, Raza secured his maiden T20I hundred and five-wicket haul, helping Zimbabwe break records at the tournament.\n\nIn 24 T20Is this year, the Chevrons stalwart scored 573 runs at an average of 28.56 with a high score of 133 not out.\n\nHe also picked up 24 scalps at 22.25 with best figures of 5/18.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Sikandar-Raza.jpg",
            "description": "ZIMBABWE T20I captain Sikandar Raza has been nominated for the International Cricket Council (ICC) T20I Player of the Year for the third time running.",
            "time": "20:31",
            "date": "29 Dec 2024"
        },
        {
            "title": "SADC committed to peace and development-President",
            "url": "https://www.herald.co.zw/sadc-committed-to-peace-and-development-president/",
            "content": "Nqobile Bhebhe\n\nTHE Southern Africa Development Community is committed to peace and development, President Mnangagwa has declared.\n\nChurch leaders from various denominations pray for the President and the nation\n\nDelivering his keynote address at the National Thanksgiving and Dedication Service in Bulawayo today, President Mnangagwa who is also the SADC Chairman said the regional bloc is for peace.\n\nMeanwhile, we thank Jehovah God that our SADC region is united in purpose to bring peace, development, and prosperity to all our people, he said\n\nIn this spirit, I recognise and warmly welcome those who are in this service from across the SADC region. Please feel at home, away from home.\n\nWith President Mnangagwa being the SADC chairperson, this years edition of the event assumed a regional dimension.\n\nRepresentatives from SADC member states are part of the worshipers.\n\nThis years National Thanksgiving and Dedication Service, hosted by the Inter-denominational churches is being held under the theme: Our Nation, Our Opportunity  Celebrating the progress and acknowledging the potential for our country Zimbabwe.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/83440747-4420-40d8-8d27-a1fa6a41c679-680x380.jpeg",
            "description": "Nqobile Bhebhe THE Southern Africa Development Community is committed to peace and development, President Mnangagwa has declared. Delivering his keynote address at the National Thanksgiving and Dedication Service in Bulawayo today, President Mnangagwa who is also the SADC Chairman said the regional bloc is for peace. “Meanwhile, we thank Jehovah God that our SADC region […]",
            "time": "20:31",
            "date": "29 Dec 2024"
        },
        {
            "title": "All eyes on President at thanksgiving and dedication service",
            "url": "https://www.herald.co.zw/all-eyes-on-president-at-thanksgiving-and-dedication-service/",
            "content": "Nqobile Bhebhe\n\nFaith for Nation Campaign founder and chairperson Reverend Andrew Wutawunashe has congratulated President Mnangagwa for attending the National Thanksgiving and Dedication Service since its inception in 2017.\n\nWorshipers follow proceedings during the service\n\nIn his remarks at the ongoing annual event, Rev Wutawunashe told President Mnangagwa that delegates from the SADC region were eager to interact with him.\n\nI would like to tell you that your Excellency most delegates from SADC, in one accord, they have been looking forward to hearing from you.\n\nWe are elated to have you here with us, said Rev Wutawunashe.\n\nPresident Mnangagwa assumed the regional bloc chairmanship in August this year.\n\nMost delegates from SADC have said when they return to their countries they will recommend this platform to their clergy. This shows how important this service is, he added.\n\nWith President Mnangagwa being the SADC chairperson, this years edition of the event assumed a regional dimension.\n\nRepresentatives from SADC member states are part of the worshipers.\n\nThis years National Thanksgiving and Dedication Service, hosted by the Inter-denominational churches is being held under the theme: Our Nation, Our Opportunity  Celebrating the progress and acknowledging the potential for our country Zimbabwe.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/8fc72410-1cef-4d80-8596-52dc574389bb-680x380.jpeg",
            "description": "Nqobile Bhebhe Faith for Nation Campaign founder and chairperson Reverend Andrew Wutawunashe has congratulated President Mnangagwa for attending the National Thanksgiving and Dedication Service since its inception in 2017. In his remarks at the ongoing annual event, Rev Wutawunashe told President Mnangagwa that delegates from the SADC region were eager to interact with him. “I […]",
            "time": "20:31",
            "date": "29 Dec 2024"
        },
        {
            "title": "President Mnangagwa arrives for National Thanksgiving and Dedication Service",
            "url": "https://www.herald.co.zw/president-mnangagwa-arrives-for-national-thanksgiving-and-dedication-service/",
            "content": "Nqobile Bhebhe\n\nPresident Mnangagwa has arrived for the 8th annual National Thanksgiving and Dedication Service in Bulawayo amid thunderous applause from thousands of congregants.\n\nThe annual event is held at the Zimbabwe International Exhibition Centre (ZIEC) Hall.\n\nPresident Mnangagwa was accompanied by Faith for Nation Campaign founder and chairperson Reverend Andrew Wutawunashe, Vice Presidents Dr Constantino Chiwenga and Cde Kembo Mohadi, Defence Minister Oppah Muchinguri-Kashiri, and several religious leaders and Government officials.\n\nThis years National Thanksgiving and Dedication Service, hosted by the Inter-denominational churches is being held under the theme: Our Nation, Our Opportunity  Celebrating the progress and acknowledging the potential for our country Zimbabwe.\n\nAs the President and his entourage entered the auditorium, with the energetic youthful Family Voices on stage, and a traditional isiNdebele poet praising the Head of state, there were loud cheers as the procession was beamed on the large screens.\n\nPresident Mnangagwa waved back at the worshipers. With President Mnangagwa being the SADC Chairperson, this years edition of the event assumed a regional dimension.\n\nRepresentatives from SADC member states are part of the worshipers. Musicians from the region such as Mrs Mothibedi (Botswana), Mrs Gwanyanya (Zambia), Mrs Zengeya who is based in the United Kingdom belted out their popular songs.\n\nWorshipers adorning different colorful religious robessome designed from the national fabric sitting side by side, holding their Bibles and tambourines, exhibited a jubilant mood indicative of their eagerness to praise the Almighty.\n\nThe atmosphere is vibrant, characterised by ululation, singing, and dancing within the auditorium\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/ecf84ee4-d799-4b1d-a885-1a6d5060f1a5-680x380.jpeg",
            "description": "President Mnangagwa has arrived for the 8th annual National Thanksgiving and Dedication Service in Bulawayo amid thunderous applause from thousands of congregants.",
            "time": "20:31",
            "date": "29 Dec 2024"
        },
        {
            "title": "All set for National Thanksgiving and Dedication Service",
            "url": "https://www.herald.co.zw/all-set-for-national-thanksgiving-and-dedication-service/",
            "content": "Nqobile Bhebhe\n\nThousands of worshipers are gathered at the Zimbabwe International Exhibition Centre (ZIEC) Hall 4 in Bulawayo for the eighth edition of the National Thanksgiving and Dedication Service.\n\nThe annual event has been conducted since 2017. The service represents a collaborative initiative between the Faith for the Nation Campaign and the Zimbabwe Indigenous Interdenominational Council of Churches (ZIICC), providing an essential platform for believers to intercede for the continued blessings and prosperity of Zimbabwe, while acknowledging the significant role of faith in the nations advancement.\n\nWorshipers, some from neighbouring countries and Europe adorned in various colorful religious robessome designed from the national fabric sitting side by side, holding their Bibles and tambourines, exhibited a jubilant mood indicative of their eagerness to praise the Almighty.\n\nThe atmosphere is vibrant, characterised by ululation, singing, and dancing within the auditorium.\n\nThe diverse assembly of individuals from various religious backgrounds underscores the unity of the body of Christ, Ms Albertina Masuku, a participant said It is a great privilege to be here this year.\n\nMr Gilbert Mlambo of the Family of God Church echoed similar sentiments, We are united in Christ. This spirit of unity will undoubtedly guide the nation through challenging times.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/f82869c6-b645-4fe3-92bf-d81db0c29e94-680x380.jpeg",
            "description": "Nqobile Bhebhe Thousands of worshipers are gathered at the Zimbabwe International Exhibition Centre (ZIEC) Hall 4 in Bulawayo for the eighth edition of the National Thanksgiving and Dedication Service. The annual event has been conducted since 2017. The service represents a collaborative initiative between the Faith for the Nation Campaign and the Zimbabwe Indigenous Interdenominational […]",
            "time": "20:31",
            "date": "29 Dec 2024"
        },
        {
            "title": "‘Cultural creative industries nurture social cohesion’",
            "url": "https://www.herald.co.zw/cultural-creative-industries-nurture-social-cohesion/",
            "content": "Mukudzei Chingwere, Herald Reporter\n\nThe flames of independence were kept ablaze by music before and during the protracted liberation struggle in high-density suburbs like Mbare, Highfield, Makokoba, Mpopoma, Mtapa and Sakubva, among others, President Mnangagwa has said.\n\nHe was speaking at the presentation of gifts to Mbare Chimurenga Choir Groups on Boxing Day at State House.\n\nThe occasion was held to honour the Mbare Chimurenga Choir Groups contributions to Zimbabwes cultural and national identity.\n\nPresident Mnangagwa said cultural creative industries did not only promote economic development through various art forms, but also nurtured social cohesion and cultural identity.\n\nAs you are aware, the cultural creative industries play a vital role in society by fostering economic growth through creative outputs such as music, art, design, fashion and film, among others, said the President.\n\nThey also contribute significantly to social cohesion, cultural identity, innovation and individual well-being by nurturing creativity, expression and engagement within communities.\n\nHonouring the Mbare Chimurenga Choir Groups is appreciation, through them, of the many musicians and artists who continue to use their artistic talents to defend the gains of our Independence and advance our national development identity, image and culture.\n\nIt was in residential areas such as Mbare, Highfield, Makokoba, Mpopoma, Mtapa and Sakubva, among others, where the flames for Independence were kept ablaze before and during our protracted war of liberation, said President Mnangagwa.\n\nPresident Mnangagwa presents hampers to members of Mbare Chimurenga Choir groups while Minister of State for Harare Provincial Affairs and Devolution Charles Tawengwa looks on at State House on Thursday\n\nHe said through song and dance, young people were mobilised to go for military training and subsequently to fight for the freedom of the country.\n\nIn the post-Independence era, said President Mnangagwa, it is groups and musicians such as Mbare Chimurenga Choir Groups who used their exceptional talent to promote cultural diversity and rally younger generations around the various national development programmes.\n\nHe congratulated Mbare Chimurenga Choir Groups for the consistency with which they have utilised their musical talent for the good of the country and the ruling ZANU PF party.\n\nYour music with its educating lyrics is a symbol of the hope and resilience that inspires countless individuals to remain patriotic and safeguard our beloved nation, said President Mnangagwa.\n\nThe performance you have delivered over the years inculcates the values of unity, resilience and love. Your revolutionary spirit is a beacon of light and hope. It is also a reminder of our collective history, our shared struggles, as well as a celebration of our resilience and determination to build a better Zimbabwe.\n\nI applaud you for your current efforts and music compilations which highlight our ongoing national development agenda, vision, policies and programmes.\n\nThrough your efforts along with others in the creative cultural industries, the nation must remain galvanised towards the attainment of our vision of a prosperous and empowered upper-middle-income economy, said President Mnangagwa.\n\nMembers of Mbare Chimurenga Choir groups sing and dance after receiving hampers and awards\n\nThe President handed gifts to the choir and encouraged them to carry the message of love, unity and the need to accelerate development in the country, continue to uplift one another and embrace the values being nurtured by the Second Republic.\n\nGoing forward, I urge you to continue infusing the new crop of musicians, particularly the youth, into your groups, said President Mnangagwa.\n\nIt is equally important that you broaden the reach of your music, riding on the diversity of ICT platforms.As I hand over these gifts, we acknowledge the tireless efforts of every one of you.Your dedication to ZANU PF programmes is commendable and your performances have been a source of joy and entertainment for many, said President Mnangagwa.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/HE1-6.jpg",
            "description": "Mukudzei Chingwere, Herald Reporter The flames of independence were kept ablaze by music before and during the protracted liberation struggle in high-density suburbs like Mbare, Highfield, Makokoba, Mpopoma, Mtapa and Sakubva, among others, President Mnangagwa has said. He was speaking at the presentation of gifts to Mbare Chimurenga Choir Groups on Boxing Day at State […]",
            "time": "20:31",
            "date": "29 Dec 2024"
        },
        {
            "title": "77 perish, 401 injured in road accidents",
            "url": "https://www.herald.co.zw/77-perish-401-injured-in-road-accidents/",
            "content": "Crime Reporter\n\nAt least 77 people were killed while 401 others were injured in 1 211 road traffic accidents recorded countrywide between December 15 and yesterday.\n\nDuring the same period last year, 71 people were killed while 393 others were injured in 1 454 road accidents recorded.\n\nIn a statement, national police spokesperson Commissioner Paul Nyathi said, The Zimbabwe Republic Police has established that, some accidents are caused by fatigue and negligent conduct on the part of drivers. Most road traffic accidents involved private vehicles where either drivers or passengers perished. The only major road traffic accident involving public service vehicles was recorded on 22nd December 2024 where three buses collided and two people died.\n\nHe said on December 22, 2024, 106 road traffic accidents were recorded where seven people were killed while 38 people were injured.\n\nOn Christmas Day, 104 road traffic accidents were recorded where 13 people were killed while 16 others were injured. On December 26, 2024, 87 road traffic accidents were recorded where 11 people were killed while 40 people were injured.\n\nAccidents involving pedestrians trying to cross the roads have also been recorded. Drivers are urged to be observant, especially when approaching built-up areas or places frequented by the public including residential areas, Comm Nyathi said.\n\nMeanwhile, the Zimbabwe Republic Police has reiterated that drivers should avoid speeding and overtaking in circumstances that are clearly not safe to do so.\n\nAbove all, motorists are implored not to overload vehicles when travelling on the countrys roads. The public is advised to report errant drivers on the roads at any nearest police station or call National Complaints Desk number 0242 703631 WhatsApp on 0712 800 197.\n\nThe Zimbabwe Republic Police will continue to enforce all road rules and regulations without fear or favour. On the other hand, motorists are irnplored to be responsible and effectively contribute towards road safety in the country, Comm Nyathi said.\n\nThis week, The Zimbabwe Republic Police assured that they had adequately deployed on all major roads, residential areas, central business districts and places where people converge to make merry to ensure peace and order prevails.\n\nThere are heightened roadblocks, traffic blitzes, stop and searches, motorised and cycle patrols to curb crime and road traffic accidents.\n\nComm Paul Nyathi said police will ensure that the public will celebrate the holidays in a peaceful manner.\n\nHe also urged all stakeholders, who include transporters, to prioritise the safety and security of the public.\n\nThe police warned motorcyclists who are riding or moving on the roads without helmets, with some carrying passengers, that arrests will be effected and the law will take its course without fear or favour.\n\nPolice were also taking action on those engaging in drug and substance abuse, adding that as the public celebrates the cross-over into the New Year, individuals, institutions and businesspersons must adhere to provisions of the law on the use of fireworks, fire crackers and other gadgets that may disturb the safety and security of the people.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/08/Paul-Nyathi.jpg",
            "description": "Crime Reporter At least 77 people were killed while 401 others were injured in 1 211 road traffic accidents recorded countrywide between December 15 and yesterday. During the same period last year, 71 people were killed while 393 others were injured in 1 454 road accidents recorded. In a statement, national police spokesperson Commissioner Paul […]",
            "time": "20:31",
            "date": "29 Dec 2024"
        },
        {
            "title": "French firms happy doing business in Zim",
            "url": "https://www.herald.co.zw/french-firms-happy-doing-business-in-zim/",
            "content": "Gibson Nyikadzino, Herald Correspondent\n\nFRANCE is happy about the improving business and trade ties with Zimbabwe and will continue nurturing them to allow more cooperation between the two countries, French Ambassador to Zimbabwe, Paul-Bertrand Barets, has said.\n\nAmbassador Barets said relations between the two countries can still be improved a lot and developed, adding that French companies operating in Zimbabwe were happy with the environment.\n\nTrade statistics between the two countries are at US$83 million, which the ambassador said was modest when you think of the importance of the French economy and the importance of the Zimbabwean economy in Southern Africa .\n\nSo, there is a real room for improvement. I must say that I am a little bit optimistic as trade increased by more than 30 percent in 2023.\n\nAnd it is rather lively in the fields of mechanical equipment, transport vehicles that we export very much to Zimbabwe, and also you are exporting a lot of things to France, and it is a rather balanced trade relationship, which is also something nice and interesting for both our countries.\n\nThe engagement between President Mnangagwa and 16 French firms whose representatives visited Zimbabwe, the ambassador said, helped identify areas of cooperation and investment in business.\n\nAmbassador Barets said President Mnangagwa urged the two countries to improve their relationship in terms of economic trade.\n\nAs an investment destination, he said areas with potential to invest include infrastructure, water, logistics, transport, energy, and the services sectors.\n\nAmbassador Barets said French companies were satisfied to be operating in Zimbabwe.\n\nThey (French companies) have learned to navigate and to manoeuvre around the difficulties that may arise from challenging macro-economic and financial environments. They are rather satisfied to be here. They are doing good business, and this is a good example for the investors who would like to come.\n\nWe have been addressing the traditional, classical questions that are being raised by investors when they consider investing in Zimbabwe, such as currency stability, the possibility and the security related to the repatriation of benefits.\n\nFrench companies operating in Zimbabwe and the rest of Africa were not out there to come and make money and leave.\n\nIt is really to train the staff and to transfer knowledge, Ambassador Barets said.\n\nThe engagement and re-engagement drive championed by the Second Republic has been crucial in attracting foreign investment under the Zimbabwe is open for business policy.\n\nPolitical relations between Zimbabwe and many countries, mainly in the West, have also improved significantly on the back of the friend to all and enemy to none policy.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/10/Paul-Bertrand-Barets.jpg",
            "description": "Gibson Nyikadzino, Herald Correspondent FRANCE is happy about the improving business and trade ties with Zimbabwe and will continue nurturing them to allow more cooperation between the two countries, French Ambassador to Zimbabwe, Paul-Bertrand Barets, has said. Ambassador Barets said relations between the two countries “can still be improved a lot and developed”, adding that […]",
            "time": "20:31",
            "date": "29 Dec 2024"
        }
    ]
}