{
    "news": [
        {
            "title": "Uhuru preps advanced",
            "url": "https://www.herald.co.zw/uhuru-preps-advanced-2/",
            "content": "Wallace Ruzvidzo, Herald Reporter\n\nMORE than 60 000 people, drawn from all the countrys 10 provinces, are expected to gather at Gokwe Nembudziya Growth Point in the Midlands Province for Zimbabwes 45th Independence Day celebrations, which will be led by President Mnangagwa, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere has said.\n\nThis years commemorations will be held under the theme, Zim@ 45: Devolve and Develop Together towards Vision 2030, and are being held in the Midlands Province in line with the Second Republics strategy of decentralising national events.\n\nAddressing a post-Cabinet media briefing in Harare yesterday, Dr Muswere said preparations were progressing well, with the construction of legacy projects in full swing at the Main Arena at Gokwe North Open Grounds, the gala site at Nembudziya Government High School, and the venue of the Childrens Party at Nyamuroro High School.\n\nAs per tradition, the Childrens Party will precede the main celebrations on April 17 at Nyamuroro High School, while the Independence Gala will be hosted at Nembudziya Government High School on the eve of April 18, 2025.\n\nCabinet received an update on preparations for the 2025 Independence Day Celebrations and Childrens Party, as presented by the Minister of Local Government and Public Works, in his capacity as Acting Chairman of the Cabinet Committee on State Occasions and National Monuments, Honourable Daniel Garwe.\n\nIn line with the thrust of the Second Republic to hold national events rotationally across the countrys Provinces, the 45th Independence Anniversary Celebrations will be held on 18th April 2025 at the Nembudziya Growth Point Open Ground Venue in Gokwe North, Dr Muswere said.\n\nThe Government, he said, had taken steps to guarantee the supply of clean, safe and adequate drinking water as well as logistical modalities for delegates through the drilling of 110 boreholes in Gokwe North and South districts.\n\nIn addition, three boreholes have been drilled at the venue sites.\n\nConcerning the actual transportation of delegates to the venue sites, Government has mobilised more than 369 buses for equitable distribution throughout the countrys provinces, Dr Muswere said.\n\nTurning to the childrens party, the Minister said 3 050 child delegates would be hosted by the First Family at Nyamuroro High School on April 17.\n\nThe child delegates will start arriving at Nyamuroro High School on 15 April 2025 and will depart on 19th April 2025, Dr Muswere said.\n\nHighlights of events leading to the celebrations include the customary Torch Relay and the lighting of the Independence Flame en-route to the main venue.\n\nA multi-talented cast of artists and Dance Groups from Kwekwe, Gokwe and other districts will showcase their talents during the celebrations.\n\nSimba Bhora and FC Platinum Football clubs, which emerged as the first and second positioned teams in the Premier League in 2024, will entertain the crowd during the main Independence Day Anniversary celebrations, while Herentals Queens and Black Rhinos Football Clubs will play during the 2025 Childrens Party celebrations.\n\nMeanwhile, the decentralisation of the Sanganai/Hlanganani Business Expo has been approved by Cabinet.\n\nThe Sanganayi/Hlanganani Expo 2025 will be held from 10 to 12 September 2025, in Mutare, Manicaland Province in line with the devolution principle and the development philosophy of leaving no one and no place behind, Dr Muswere said.\n\nGoing forward, the Sanganai/Hlanganani Tourism Expo will be held on a rotational basis across the 10 provinces. This will enhance the profiling and rebranding of the respective provinces for tourism, trade and investment promotion.\n\nDr Muswere also briefed the media on Zimbabwes participation at the Expo 2025 Osaka to be held in Japan from April 13 to October 13.\n\nHe said plans were at an advanced stage with a 12-member delegation led by a Commissioner-General set to represent Zimbabwe at the high-profile international event.\n\nThe highlights of the 6-month long Expo 2025 programme will include the Zimbabwe National Day to be graced by His Excellency President Cde Dr. E.D. Mnangagwa on 16 July 2025.\n\nThe event will provide a platform to harness investment dividends and other collaborative opportunities, as the President will be engaging both international investors and the Diaspora community in Japan, Dr Muswere said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/HE-1.jpg",
            "description": "Wallace Ruzvidzo, Herald Reporter MORE than 60 000 people, drawn from all the country’s 10 provinces, are expected to gather at Gokwe Nembudziya Growth Point in the Midlands Province for Zimbabwe’s 45th Independence Day celebrations, which will be led by President Mnangagwa, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere has said. This year’s […]",
            "time": "09:31",
            "date": "05 Mar 2025"
        },
        {
            "title": "Tobacco marketing season opens today amid bumper crop",
            "url": "https://www.herald.co.zw/tobacco-marketing-season-opens-today-amid-bumper-crop/",
            "content": "Zvamaida Murwira and Precious Manomano\n\nThis years tobaccos marketing season kicks off today, with the opening ceremony slated for Tobacco Sales Floor in Harare this morning while contract sales, which will handle 95 percent of the crop, will open tomorrow.\n\nTobaccos national production has recorded exponential growth over the past years, creating a middle class in the rural areas among smallholder farmers who continue to produce a quality crop, legislators have heard.\n\nAppearing before Parliaments Portfolio Committee on Lands, Agriculture, Fisheries, Water and Rural Development yesterday, Tobacco Industry and Marketing Board chairperson, Mr Patrick Devenish, said Zimbabwes tobacco was among the best quality crops globally and competed favourably with other leading producers such as Brazil and India.\n\nThe committee, chaired by Chivi South MP Cde Felix Maburutse (Zanu PF), sought to know the preparedness of this years tobacco marketing season.\n\nMr Devenish said there were several issues which contributed to the high quality of the tobacco grown in Zimbabwe.\n\nThe first one is the ministry that has provided superb leadership to the tobacco industry. The contracting system has been around for some time, but it is growing stronger and stronger and that has allowed the development of smallholder farmers.\n\nThe success of the industry is due to the success of smallholder farmers. The yields of smallholder farmers have gone up significantly, so has the quality of the products, said Mr Devenish.\n\nHe said the industry has created a middle class in the rural areas.\n\nWe are looking up to the smallholder sector which I personally believe is the future of the African continent. So, I think that is a big factor.\n\nThe recognition from the global cigarettes and other tobacco manufacturing markets, that Zimbabwe is indeed the best producer of smoking leaf in the world, has made a huge difference.\n\nMr Devenish said TIMB had a strong and dedicated staff, who have managed to deal with several challenges such as side marketing.\n\nWe have 31 licenced buyers and 44 contractors, all of them licensed by TIMB. The crop has done significantly well since the beginning of January and we are expecting a very large crop. As I have said many times, Zimbabwean tobacco has now been globally accepted as the finest smoking leaf in the world. So the focus is for a buoyant selling season this year and a large crop, he said.\n\nAs the marketing season opens today, farmers who spoke to The Herald yesterday said they had made efforts to produce high-quality tobacco, raising hopes for a successful marketing season.\n\nBoth the Tobacco Sales Floor and Premier Tobacco Floors said they were prepared to facilitate operations, and were eagerly welcoming farmers as they delivered their crop for todays sales.\n\nUnder the new payment structure, farmers will receive 70 percent of their sale proceeds in foreign currency, with the remaining 30 percent provided in local currency, converted at the prevailing auction exchange rate on the day of sale.\n\nThe foreign currency will be directly deposited into growers foreign currency accounts, while local currency payments will go into their local bank accounts or e-wallets.\n\nPrices on the auction floors will be determined through a competitive bidding process, where the highest bid sets the final price for each bale of tobacco.\n\nWith favourable rainfall contributing to an anticipated production of 280 million kg of tobacco this year, expectations for both quality and quantity are high.\n\nHowever, amidst this optimism, the TIMB has issued a stern warning against side marketing, a practice that undermines the integrity of Zimbabwes tobacco industry.\n\nFarmers who receive financial and input support from contractors are expected to sell their crops to them as per contractual agreements, while self-financed growers should take their tobacco to the auction floors. Yet, some growers attempt to bypass this system, selling to unauthorised buyers or at unapproved selling points, said TIMB in a statement.\n\nThere is nothing called free tobacco; it is auction tobacco. Contractors and growers alike must adhere to the proper marketing channels to ensure the continued stability and growth of Zimbabwes tobacco industry.\n\nTo combat these illegal practices, TIMB has introduced a biometric grower management system that requires farmers to use their fingerprints for authentication at every stage of production and marketing.\n\nThis initiative seeks to identify self-financed growers trying to sell at contract floors and to catch contracted growers attempting to sell at auction floors or to unauthorised buyers.\n\nIllegal buyers, referred to as Makoronyera, have been a persistent challenge, operating outside TIMB regulations and purchasing tobacco directly from farms at unfair prices.\n\nTo ensure fair compensation for farmers, TIMB has also introduced a new pricing matrix that reinforces the importance of selling through the right channels.\n\nInspectors have been deployed across all tobacco-growing regions to monitor compliance and investigate cases of side marketing, with legal action promised against transporters found aiding illegal sales.\n\nPremier Tobacco Auction Floors executive director, Owen Murumbi, expressed optimism for the upcoming season.\n\nWe are anticipating a good season with farmers expected to get their money on time; the payment systems introduced are friendly to the majority of farmers.\n\nHe highlighted the presence of four banks on-site, including newcomers like InnBucks, to facilitate transactions, a shift towards mobile money that is seen as a significant convenience for farmers.\n\nTo further engage the farming community, promotions will take place on Wednesdays, allowing stakeholders to interact with farmers and reward outstanding growers.\n\nStakeholders will come to participate every Wednesday, advertising their brands and giving farmers prices, Mr Murumbi said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/03/Untitled-105.jpg",
            "description": "Zvamaida Murwira and Precious Manomano This year’s tobacco’s marketing season kicks off today, with the opening ceremony slated for Tobacco Sales Floor in Harare this morning while contract sales, which will handle 95 percent of the crop, will open tomorrow. Tobacco’s national production has recorded exponential growth over the past years,  creating a middle class […]",
            "time": "09:31",
            "date": "05 Mar 2025"
        },
        {
            "title": "US$50bn China-Africa facility: Zim identifies 12 key projects",
            "url": "https://www.herald.co.zw/us50bn-china-africa-facility-zim-identifies-12-key-projects/",
            "content": "Wallace Ruzvidzo, Herald Reporter\n\nZimbabwe has identified 12 key projects for potential funding under Chinas US$50 billion facility aimed at supporting Africas modernisation and industrialisation agenda, as pledged during the Forum on China-Africa Cooperation (FOCAC) last year.\n\nThe projects include the recapitalisation and upgrade of the National Railways of Zimbabwe (NRZ), digital Zimbabwe Project Phase 1, a new State House at the New City in Mount Hampden, five new Government Ministerial buildings at the New City in Mt Hampden, the upgrade of Charles Prince Airport near the New City in Mt Hampden and Feasibility Studies for Upgrading of Irrigation Facilities Project.\n\nOther projects include universal energy access through Community Solar E-Facility Project (Rural Solar E-Facility Project), construction of decentralised solar agro-processing plants and the supply of various farm mechanisation equipment for rural industrialisation and development, rehabilitation of the National Sports Stadium, maintenance of the New Parliament Building, building of a railway line connecting Harare and Chitungwiza and the Schistomiasis Control and Elimination Cooperation Project.\n\nChina made the US$50 billion pledge during one of the biggest diplomatic events on the calendar, FOCAC, held in Beijing in September last year, which President Mnangagwa attended.\n\nPrior to the summit, the President had undertaken a successful State visit to China at the invitation of his counterpart, President Xi Jinping.\n\nActing Foreign Affairs and International Trade Permanent Secretary Mrs Raphael Faranisi yesterday said a third follow up inter-ministerial meeting will be held today.\n\nReference is made to the above subject and to the second follow-up meeting held on 17 December 2024, where it was agreed that Ministries should avail reports on the progress of projects and programmes being implemented within the framework of the Memoranda of Understanding (MoUs) that were signed during His Excellency the Presidents State Visit to China in September 2024.\n\nIn that regard, your Office/Ministry is invited to attend the third inter-ministerial meeting scheduled for Wednesday 5 March 2025, at 1000hrs, in the Munhumutapa Basement Boardroom.\n\nThe objective of the meeting is to follow up on progress on the above-mentioned projects and programmes, she said.\n\nThe relevant ministries will be requested to avail a report on progress of the projects and programmes under implementation in their ministry and provide an update on the status of the 12 projects that were submitted for possible funding, where applicable.\n\nDuring President Mnangagwas State Visit, Harare and Beijing signed 17 agreements including; Establishment of the Investment and Cooperation Working Group; Cooperation Plan on Synergising the Belt and Road Initiative with Zimbabwes Vision 2030; Exchange of Cooperation in the Field of Economic Development; MoU on Establishing a Working Group on Unimpeded Trade.\n\nApart from that, the two countries also signed a Framework Agreement on Economic Partnership for Shared Development; Protocol for Phytosanitary Requirements for Export of Zimbabwean Fresh Avocado to China; MoU on Joint Promotion of Co-operation in the Mining Industry; and Treaty on Mutual Legal Assistance in Criminal Matters.\n\nMoUs on Media Exchange and Co-operation, MoU between China Media Group and the Ministry of Information, Publicity and Broadcasting Services, MoU on Co-operation on Entry and Exit Animal and Plant Quarantine were also signed.\n\nThe two countries also signed Letters of Exchange on the Feasibility Study for Upgrading of Irrigation Facilities Project, and Letters of Exchange for Human Resource Development Co-operation in Railways Management.\n\nAn agreement was also signed on News Exchange and Co-operation between Xinhua News Agency and New Ziana, MoU between China Media Group and Zimbabwe Broadcasting Corporation, and MoU between China Media Group and The Herald of Zimbabwe.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/11/Raphael-Faranisi.jpg",
            "description": "Wallace Ruzvidzo, Herald Reporter Zimbabwe has identified 12 key projects for potential funding under China’s US$50 billion facility aimed at supporting Africa’s modernisation and industrialisation agenda, as pledged during the Forum on China-Africa Cooperation (FOCAC) last year. The projects include the recapitalisation and upgrade of the National Railways of Zimbabwe (NRZ), digital Zimbabwe Project Phase […]",
            "time": "09:31",
            "date": "05 Mar 2025"
        },
        {
            "title": "Support national vision, Diaspora urged",
            "url": "https://www.herald.co.zw/support-national-vision-diaspora-urged/",
            "content": "Joseph Madzimure, Senior Reporter\n\nTHE Diaspora community should continue rallying behind President Mnangagwa as he ushers the country into a new dawn of modernisation and development, Zanu PF Secretary for Information and Publicity, Cde Christopher Mutsvangwa, has said.\n\nPresident Mnangagwa has always emphasised that the Diaspora community is a vital component in the countrys economic growth and development trajectory.\n\nAddressing the Zanu PF United Kingdom District Executive council in London on Monday, Cde Mutsvangwa reaffirmed Zanu PFs commitment to fulfilling its election promises.\n\nThe Presidents intention is to build the countrys economy and fulfil his election manifesto which led to Zanu PFs victory in the 2023 harmonised elections, he said.\n\nCde Mutsvangwa informed the party members in the UK that there were concerted efforts by the former colonisers who sought to destabilise the party leadership through social media, but President Mnangagwa continued to focus on developing the country and the region.\n\nCde Mutsvangwa said as the SADC chairman, President Mnangagwa and the East Africa Community (EAC) Chairperson Kenyan President William Ruto were persuading all parties in the Democratic Republic of Congo conflict to lay down arms and return the eastern parts of the resource-rich country to normalcy.\n\nSince taking office in 2017, President Mnangagwa has demonstrated a proactive commitment to transforming Zimbabwes economy and infrastructure, aiming for an upper middle-class economy by 2030.\n\nInformation, Publicity, and Broadcasting Services Minister Jenfan Muswere (right) Public Service, Labour and Social Welfare Minister Edgar Moyo, (centre), Permanent Secretary Nick Mangwana pre-brief before a post cabinet press conference at Munhumutapa offices in Harare yesterday  Picture: Kudakwashe Hunda\n\nHis administration has successfully completed over 8 000 projects nationwide, showcasing a vigorous approach to governance aligned with the Vision 2030 of an upper middle-class economy.\n\nUpon assuming the reins of power, President Mnangagwa hit the ground running and implemented key strategies, starting with the launch of the Transitional Stabilisation Programme (TSP), which concluded in 2023.\n\nThis was followed by the National Development Strategy 1, the cornerstone of Vision 2030.\n\nUnder the guiding principles of Nyika Inovakwa Nevene Vayo (the country is built by its people) and No one, No Place will be left Behind, the President has fostered citizen participation in the development process, ensuring inclusive progress for all communities.\n\nUnder his leadership, Zimbabwe has seen notable advancements across various sectors.\n\nIn agriculture, the country achieved a record wheat output, surpassing the previous record set in 1964. This achievement not only bolsters food security, but also stimulates the agricultural economy significantly.\n\nMajor infrastructural initiatives, including the construction of power stations, roads, and the New Parliament building, along with improvements at Robert Gabriel Mugabe International Airport, underscore the Governments commitment to modernising the nations infrastructure.\n\nAdditionally, President Mnangagwas administration has prioritised issuing title deeds to farmers, allowing them to leverage their land for financing, thereby enhancing agricultural productivity and promoting financial independence.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/PC1.jpg",
            "description": "Joseph Madzimure, Senior Reporter THE Diaspora community should continue rallying behind President Mnangagwa as he ushers the country into a new dawn of modernisation and development, Zanu PF Secretary for Information and Publicity, Cde Christopher Mutsvangwa, has said. President Mnangagwa has always emphasised that the Diaspora community is a vital component in the country’s economic […]",
            "time": "09:31",
            "date": "05 Mar 2025"
        },
        {
            "title": "Call to scale up funding for conservation, sustainable use of wildlife",
            "url": "https://www.herald.co.zw/call-to-scale-up-funding-for-conservation-sustainable-use-of-wildlife/",
            "content": "Tendai Rupapa, Senior Reporter\n\nZIMBABWE needs to have a coordinated domestic, regional and international response to combat the poaching scourge that threatens some wildlife species with extinction, Environment and Wildlife Patron, First Lady Dr Auxillia Mnangagwa has said.\n\nShe said this in her remarks at the World Wildlife Day commemorations in Harare on Monday.\n\nThe commemorations were held under the theme, Wildlife conservation finance: Investing in people and planet.\n\nAmai Mnangagwa, an avid environmentalist, always reiterates the need for people to protect endangered species so that they are not at a high risk of becoming extinct in the near future.\n\nPangolins are CITES listed species that need special protection as their survival is threatened in some other parts of the world.\n\nRecently, Dr Mnangagwa received a female pangolin from Headman Clive Makusha Chimbi of Mvuma, for onward transmission to the Zimbabwe Parks and Wildlife Management Authority (ZimParks), in her capacity as the patron.\n\nWhen the pangolin was presented to Amai Mnangagwa, it was pregnant and it gave birth the following day.\n\nDuring the World Wildlife Day commemorations, the pangolin and its offspring were shown to the First Lady.\n\nZimbabwe values pangolins, which are an integral part of culture, tradition, and folklore.\n\nCommunities are aware and alive to the protection of natural resources.\n\nWildlife Ambassador First Lady Dr Auxillia Mnangagwa listens to Ms Lisa Chitura from Wildlife Conservation Action as she explained what her organisation is doing in wildlife conservation during the World Wildlife Day commemorations on Monday\n\nDuring the celebrations, all stakeholders thanked the First Lady for her awareness campaigns countrywide on environment and wildlife preservation, which they said culminated into Headman Chimbi coming all the way to Harare to hand over a specially protected animal in the form of a pangolin.\n\nWorld Wildlife Day is celebrated every year on March 3 to celebrate wild animals and plants by recognising their unique roles and contributions to people and the planet.\n\nDr Mnangagwa also held an interactive session with learners drawn from schools around the country, where she reinforced the need for environmental conservation and protection of wildlife.\n\nThe mother of the nation asked the learners about wild animals, their behaviour, what they eat and where they live, to sharpen and widen their knowledge.\n\nA learner spoke about a lion saying it eats other animals, and when asked how the lion survives without prey, he said it turns to grass.\n\nHowever, the First Lady corrected him saying lions were carnivores and do not eat grass.\n\nIn her address, Dr Mnangagwa said World Wildlife Day was celebrated on March 3 every year in line with the United Nations General Assembly resolution that recognises the intrinsic value of wildlife and its contributions to the various dimensions of sustainable development.\n\nOne of the students answers questions about pangolins during their interactive session on wild animals with Wildlife Ambassador Dr Auxillia Mnangagwa at the World Wildlife Day in Harare yesterday\n\nThe World Wildlife Day commemoration, she said, was annually organised by the Convention on International Trade in Endangered Species of wild FAUNA and FLORA (CITES).\n\nZimbabwe is a part to CITES, a convention that provides a framework for regulating legal and sustainable international wildlife trade. Zimbabwe, therefore, strictly adheres to the dictates of the convention in the discharge of its wildlife mandate. Wildlife conservation is a huge and expensive business which cannot be left to the Government alone. It needs the participation and involvement of all stakeholders, she said.\n\nThe 2025 World Wildlife Day, Dr Mnangagwa said, reminds the nation of the need to have a coordinated domestic, regional and international response to combat the growing poaching scourge.\n\nLet us use this commemorative celebration to reflect on how we can effectively combat wildlife crime in all its forms. Recently, the world commemorated other important days, World Pangolin Day and World Hippopotamus Day, both on the 15th of February.\n\nThe two are CITES listed species which need special protection as their survival is threatened in some other parts of the world. In Zimbabwe, we are happy to report that the hippopotamus population is stable and increasing whilst the pangolin remains a specially protected species in terms of our laws. The pangolin remains one of the most heavily legally harvested and trafficked animals in the world.\n\nLets protect and conserve our pangolins. In line with CITES provisions, Zimbabwe places a greater focus on species threatened with extinction and those not yet threatened with extinction, but may become so if not well regulated. Zimbabwe is endowed with a rich biodiversity characterised by huge wildlife populations, she said.\n\nWildlife Ambassador First Lady Dr Auxillia Mnangagwa holds a pangolin offspring which was born a day after its mother was recently picked in Chirumhanzu and presented to her for onward transmission to Zimparks. Pangolins are among the endangered animal species and Dr Mnangagwa while addressing delegates during the World Wildlife Day commemorations in Harare on Monday said they need special protection\n\nUnfortunately, the huge wildlife populations, especially the over abundant elephant populations, the First Lady said, have resulted in extensive damage to ecosystem inhabitants in addition to increasing human wildlife conflict incidences.\n\nCurrently, Zimbabwes elephant population sits at over 85 000, the second largest population in the world, far exceeding its capacity of 45 000 hence we now face an elephant overpopulation problem.\n\nOver the past five years, more than 290 people have been killed and a lot more injured by wild animals. More than 2 000 livestock have been lost to wild animals in addition to loss of property and crops. The need to reduce populations in our protected areas needs no emphasis, she said.\n\nThe environment and wildlife ambassador said there was a need to address the problem of over abundant elephant populations in Zimbabwe.\n\nThis overpopulation problem is further compounded by international commercial elephant and ivory trade restrictions put in place by the CITES. Trading in elephants and ivory is in line with our constitutional mandate of using our natural resources for the benefit of the Zimbabwean citizens.\n\nIt is important to note that Zimbabwes policies that ensure that the use, harvesting and trade of wildlife species is ecologically sustainable, safe, legal and consistent with CITES provisions. Discussions at the 16th Conference of the Parties to the Convention on Biological Diversity meeting held in Colombia and the second resumed session of the same conference held in Rome, Italy and Colombia respectively revolved around biodiversity conservation financing. This shows the importance and centrality of partnerships in financing of biodiversity.\n\nIt is important that as a country we prioritise the implementation of the Kunming Montreal Global Biodiversity Framework, KM-GBF.\n\nThe continued loss of biodiversity poses a significant threat to both nature and the human well-being, making the need for mobilisation of financial resources from all stakeholders much more important.\n\nBoth the global and domestic wildlife conservation financing gap cannot be closed without adopting a whole of society approach in wildlife conservation, she said.\n\nJunior rangers from Masoka Primary School in Mbire display their marching skills during the World Wildlife Day commemorations in Harare on Monday\n\nSuch a need, Dr Mnangagwa said, underscores the importance of development finance for wildlife conservation.\n\nI, therefore, urge all stakeholders to continue exploring opportunities to strengthen cooperation, collaboration and synergies across all relevant sectors of our economy. As a country, we recognise the critical role played by local communities in wildlife conservation and hence we prioritise the contribution of wildlife resources to community livelihoods in line with our National Development Strategy 1. Wildlife occupies an important place in rural economies as it ensures that rural communities are also active players in national economic development.\n\nThis guarantees inclusive national economic development, leaving no place and no one behind, as is often called out by our President, His Excellency, Cde Dr E.D Mnangagwa. Our position as a country is clear. We stand for sustainable use of wildlife resources for the benefit of our people, particularly those who co-exist with wildlife, she said.\n\nThe Parks and Wildlife Amendment Bill, Dr Mnangagwa said, is undergoing the final stages of the legislative process and the gazetting of the Bill will go a long way in closing the information gaps identified over the years by law enforcement agencies as well as the courts of law in the delivery of justice.\n\nIt also addresses the rights of local communities and further protects customary sustainable use by the same. We are grateful for the funding of capacity-building initiatives by our conservation partners in areas such as Matabeleland North, Zambezi Valley, South East Lowveld and many other places. In the spirit of developing the inter-agency coordination and capacities needed to tackle wildlife crime offences, Zimparks partnered with other Government institutions like the Zimbabwe Republic Police, Zimbabwe Revenue Authority, Immigration Department and other Government institutions to improve intelligence sharing and strengthening of border controls through the establishment of the multi-agency crime intelligence units in the Zambezi Valley. Such initiatives improve our capability as a nation to combat poaching and send out a message that there is zero tolerance on poaching she said.\n\nSophisticated transnational organised crimes committed by organised syndicates call for stronger criminal justice systems with robust legal frameworks as well as transparent prosecutorial and judicial processes, she said.\n\nWildlife Ambassador Dr Auxillia Mnangagwa greets junior game rangers from Mbire during the World Wildlife Day in Harare yesterday.  Pictures: John Manzongo\n\nTransnational criminal syndicates can only be busted through international cooperation and cross-border investigations, the First Lady said.\n\nTherefore, the role played by regional and international agreements need no emphasis. Zimbabwe Parks and Wildlife Management Authority has got several co-management agreements which have brought the much-needed financial resources. Such agreements include Gonarezhou Conservation Trust, Matusadona Conservation Trust and partnerships in managing protected areas such as Umfurudzi Park, Chizarira National Park and Mana pools National Park.\n\nSuch partnerships place community development at the centre of their activities. We are grateful to organisations like International Fund for Animal Welfare, the African Wildlife Foundation, Frankfurt Zoological Society, Peace Parks Foundation, African Parks and many others, which have partnered with the Government in building and maintaining infrastructure like roads, houses and equipment. We all have a duty to conserve and sustainably use our natural resources for us to achieve our Sustainable Development Goals, SDGs, especially SDG 15, that calls for protection of sustainable use of terrestrial ecosystem systems and halting biodiversity loss. We must remain united in our commitment to prevent and counter wildlife crime in all its forms and wherever it occurs, she said.\n\nThe First Lady said Zimbabwe empowers its local communities through participation and collaboration to conserve wildlife resources and livelihoods by designating rural district councils as appropriate authorities in wildlife management through the Communal Areas Management Programme for Indigenous Resources Programme (Campfire).\n\nAs I conclude, Zimbabwe will soon engage all stakeholders including fellow countries which are parties to CITES to find common ground on all contentious CITES issues including the elephant trade CITES impasse.\n\nAs is often enunciated by our President, we are a country that firmly believes in engagement and re-engagement, she said.\n\nSpeaking at the same event, Zimparks director-general Professor Edson Gandiwa praised the First Lady for her role and dedication to wildlife conservation issues, especially her assistance in addressing human wildlife conflict issues nationwide.\n\nThank you very much Your Excellency, for being a leading voice in the protection of wildlife. The 2025 Wildlife Day theme is worthy of rallying around as it fosters cooperation in the conservation business. Such partnerships range from local community participation in resource protection to financial investments by such organisations including Non-Governmental Organisations (NGOs). All of you are important to us and we are proud to be associated with all of you, he said.\n\nProf Gandiwa shared basic statistics concerning Zimbabwes wildlife populations.\n\nZimbabwe has over 5 930 vascular plant species, over 670 bird species, over 270 mammal species, more than 256 known reptile species, about 120 amphibian species and approximately 151 fish species. Zimbabwe deservedly prides itself in having the second largest elephant population in the world and fourth largest rhino population in the world.\n\nAbout 28 percent of Zimbabwes surface area is under some form of wildlife management. We also have the most successful crocodile conservation and crocodile ranching industry and a top exporter in the Southern African Development Community (SADC). A huge conservation funding gap exists in biodiversity conservation. Investing in wildlife is a collective responsibility for us all, recognising the whole-of society and whole-of-government approach we commemorate this day.\n\nZimbabwe has a world-class track record in conservation and protection, Prof Gandiwa said.\n\nOur wildlife remains well protected both within and outside protected areas and continues to be a significant attraction to tourists for both consumptive and non-consumptive use. Zimbabwe has Africas big five game, that is, lion, elephant, buffalo, leopard and rhino. The precious international endorsement as a prime destination is deserved and it is our collective responsibility to conserve, he said.\n\nAs a member State of SADC, Prof Gandiwa said Zimbabwe was also implementing the SADC Law-enforcement and Anti-Poaching Strategy to fulfil its aspirations under the SADC Protocol on Wildlife Conservation and Law Enforcement of 1999.\n\nEnvironment, Climate and Wildlife Minister, Dr Sithembiso Nyoni, said World Wildlife Day marks the most important day in wildlife conservation as the world over people gather around to celebrate the worlds wildlife heritage.\n\nCelebrations of this nature are defining moments as we take time to appreciate the importance of wildlife in our lives. Zimbabwes economy is also significantly driven by tourism, which is anchored by rich wildlife populations throughout the country. This underlines the integral role played by wildlife not only in our country, but the world over. Your Excellency, the people that are gathered here have come because they embrace the idea that wildlife conservation is a collective responsibility, it is not the Governments responsibility alone. We fully appreciate your presence here as we are aware of your busy schedule. Thank you for finding space in your busy schedule to join us in celebrating Zimbabwes rich wildlife heritage. Your Excellency, it is my honour to inform you that my Ministry is fully committed to its wildlife conservation mandate as given by the President of the Republic of Zimbabwe, His Excellency, Cde Dr E.D Mnangagwa, she said.\n\nChief Chinamhora said it was critical to protect the environment at all times.\n\nLand, trees, mountains, wildlife and everything that grows on land is our heritage that we need to preserve for generations to come. As chiefs, we are the eyes of the nation for the protection of the environment, the protection of the land, the preservation of forests, preservation of tree species. We know there is nowhere we can celebrate wildlife in the absence of the land, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/FL1.jpg",
            "description": "Tendai Rupapa, Senior Reporter ZIMBABWE needs to have a coordinated domestic, regional and international response to combat the poaching scourge that threatens some wildlife species with extinction, Environment and Wildlife Patron, First Lady Dr Auxillia Mnangagwa has said. She said this in her remarks at the World Wildlife Day commemorations in Harare on Monday. The […]",
            "time": "09:31",
            "date": "05 Mar 2025"
        },
        {
            "title": "Broadcasting Bill sails through",
            "url": "https://www.herald.co.zw/broadcasting-bill-sails-through/",
            "content": "Farirai Machivenyika, Senior Reporter\n\nTHE Broadcasting Services Amendment Bill has sailed through the National Assembly after the last round of debate yesterday.\n\nAfter intense debate on the Bill, the proposed legislation stood the test of parliamentary scrutiny after it was passed by the National Assembly.\n\nIn passing the Bill, parliamentarians unanimously supported Clause 15 of the Bill, which prohibits the sale of motor insurance cover and vehicle licence discs to individuals who do not hold valid ZBC radio licences.\n\nFor me, the two entities should be regulated, and I think there is nothing wrong with this proposal.\n\nI believe the majority of people in Zimbabwe listen to ZBC, and I want to thank the Minister for proposing this, said one Member of  Parliament.\n\nDuring the debate, Information, Publicity and Broadcasting Services Minister, Dr Jenfan Muswere and the Leader of Government Business in the National Assembly and Justice, Legal and Parliamentary Affairs Minister, Ziyambi Ziyambi, clarified some clauses in the Bill.\n\nThe collaboration between ZBC and Zinara is in full compliance with the Constitution. I want to emphasise the distinction between a radio licence and a radio receiver, as the latter is capable of receiving broadcasts, said Dr Muswere.\n\nThe Second Republic has prioritised alignment with constitutional requirements and good governance practices, said Minister Ziyambi stated.\n\nThe Bill will now go to the Parliamentary Legal Committee for cleaning before it is taken to the Senate for further debate.\n\nIt seeks to align the Broadcasting Services Act with the Constitution and the Public Entities Corporate Governance Act.\n\nMutoko West MP Cde Knowledge Kaitano proposed that the Bill enshrine that ZBC and Zinara enter into an operational agreement that sets out obligations for both parties.\n\nThe law should have a caveat on the obligations of the two parties so that they dont short-change each other, he said.\n\nKadoma legislator, Mr Gift Mambipiri, said the ZBC fees were high and would discourage compliance.\n\nThe fees of US$30 per are high and should be revised downwards to ensure compliance, he said. Additional reporting by ZBC\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/09/Untitled-8-1.jpg",
            "description": "Farirai Machivenyika, Senior Reporter  THE Broadcasting Services Amendment Bill has sailed through the National Assembly after the last round of debate yesterday. After intense debate on the Bill, the proposed legislation stood the test of parliamentary scrutiny after it was passed by the National   Assembly. In passing the Bill, parliamentarians unanimously supported Clause 15 of […]",
            "time": "09:31",
            "date": "05 Mar 2025"
        },
        {
            "title": "EDITORIAL COMMENT: Banks need to revert  to core business",
            "url": "https://www.herald.co.zw/editorial-comment-banks-need-to-revert-to-core-business/",
            "content": "BANKS traditionally made most of their money on the gap in the interest they paid depositors and the interest they charged borrowers, with this enhanced as some of the money they lent out was shareholder funds.\n\nThis put banks at the centre of much of the economy, as the middleman and the risk taker in the mobilisation of savings and the direction of the needed lending to the business sectors that would make proper use of this money.\n\nSavers avoided risk, since the bank bundled their deposits together then lent them out, so the cost of the few percent of bad loans was assumed by the bank and the savers could always get their money back.\n\nNow Reserve Bank of Zimbabwe Governor Dr John Mushayavanhu wants banks to seriously return to this traditional function, partly because it is what banks are supposed to do and partly because it will make banks more resilient, to use the jargon, that is cope with economic up and downs.\n\nThe latest bank sources of income contributions at the end of last year, as shown in the latest Monetary Policy Statement by Dr Mushayavanhu, found almost half of all bank income came from revaluing foreign currency and property assets.\n\nTechnically this is income, but no one had to earn it; it just happened and basically it is income created via inflation, rather than any increase in productivity or active banking. It vanishes in better economic times.\n\nSo this is one reason why Dr Mushayavanhu, and other financial commentators, want to see more bank income from lending. This can be far more certain year after year, assuming the bank managers know their job and can calculate risks fairly precisely. Relying on rising property prices and the local currency going south to fund any holes in a set of bank accounts does not seem like a long-term good idea.\n\nOf the half of bank income coming from operations, the interest income was around two thirds of the fees income, showing the dominance of fees and other charges when it comes to running banks. This also explains what are seen as over-high fees within Zimbabwean banking, despite the continued automation of services and the resultant cut in costs.\n\nIn his latest statement, Dr Mushayavanhu warned banks that others could take chunks of their business unless they started working on these problems.\n\nWhen the building society sector was a lot stronger, ordinary people in need of a safe place for their savings and some basic banking services would open a building society account and get these simple services at no charge.\n\nThe compulsory positive balance made sure that they contributed, even if just marginally, to the pool of money being lent out and the lending interest rate was always higher than the deposit interest rate.\n\nThere was always some extra income from fees, but this was icing on the cake or often just recovery of costs, such as the small ledger fees charged on each transaction in an account, while the serious money was made from mobilising, bundling and lending out savings. While some corporate customers might want a range of services, most bank customers paid very little in service fees.\n\nYet this was a time when banks needed far larger staff levels than today, and far larger stationery budgets, as they coped with basic services such as cashing cheques or the nightly meetings when all banks sorted out the exchange of cheques deposited during the day.\n\nThere were also far more tellers on duty each day as almost all transactions needed to be done manually.\n\nThis is all, along with maintaining the customer ledgers, largely done by software these days, and that is far cheaper than having vast numbers of people having to handle every transaction, no matter how small.\n\nNon-interest income started rising sharply in the 1990s and during hyperinflation was obviously the mainstay of the operational income of the banking sector, but this was supposed to be a temporary adjustment, not something permanent. Betting on bad news is not really a viable long-term economic policy.\n\nThe Reserve Bank has been pushing commercial banks to build up their savings rates and encourage customers to keep their money in a bank rather than under the mattress or lent to some sort of con artist.\n\nSome progress has been made but banks are hardly falling over themselves to attract savers or even get their customers to open fix-term deposit accounts.\n\nBut customers do get messages inviting them to pay higher fees for certain types of debit or credit card and can, in most banks, pay even higher fees if they are reluctant to queue and want some sort of priority. Figuring out ways to raise fees rather than reduce them is not exactly what bankers are supposed to do.\n\nZimbabwe like most developing countries is short of capital. Pension funds can help with their automatic mobilisation of savings, but these days are excited about property investment and some equity investment rather than lending out money. Shorter term returns, the sort of thing required by most savers who are saving for something are wanted, and banks need to work out how to attract and use such savings.\n\nThe Chinese economic boom was largely financed by private savings accounts, as at least during the boom times Chinese people did not borrow money but paid cash, and so needed to build up their pile of cash through sensible savings. The banks mobilised these millions of savings accounts to profitably fund the productive expansion by credit worthy entities with good ideas.\n\nThere are several reasons why Zimbabweans and Zimbabwean businesses can be wedded to cash and some of the reasons for not using banks can be pretty weak. But one reason that gets on everyones list is the cost of running a bank account, that is the fees charged by banks. And here the over-reliance on fee income is obviously a major factor.\n\nBanks would be more secure if they earned more in the interest gaps by encouraging more savings and lending to more credit-worthy businesses, as this sort of income does not depend on customers willing to accept high fees but rather on economic fundamentals.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/10/ef.jpg",
            "description": "BANKS traditionally made most of their money on the gap in the interest they paid depositors and the interest they charged borrowers, with this enhanced as some of the money they lent out was shareholder funds. This put banks at the centre of much of the economy, as the middleman and the risk taker in […]",
            "time": "09:31",
            "date": "05 Mar 2025"
        },
        {
            "title": "SA’s Expropriation Act and the obstinate morbidity of whiteness",
            "url": "https://www.herald.co.zw/sas-expropriation-act-and-the-obstinate-morbidity-of-whiteness/",
            "content": "Langton Makuwerere Dube, Herald Correspondent\n\nThe growing diplomatic spat between South Africa and the United States, allegedly over the passing of the Land Expropriation Bill, continues to inundate media spaces.\n\nInterestingly, it has generated competing interpretations within South Africa and across the continent.\n\nAlong the continuum, proponents view the Bill as the overdue remedy for the residual effects of colonialism.\n\nAt the same time, protagonists (primarily whites) see no iota of affirmative action in the policy but, instead, a race-based instrument designed to support or justify a pogrom on the white population.\n\nThe protagonists argument dominates this pieces primary submission.\n\nA section of White South Africans, led by the AfriForum and the solidarity organisations, is growing resistant to land redistribution.\n\nTherefore, as a starting point, I focus on the origins, metaphysics, and dynamics of this white fear, its prejudices, hubris, and white claims of entitlement and belonging, which they have unconsciously projected over the years.\n\nWhite entitlement emanates from a deeply held belief in exceptionalism, one that makes them fail to recognise any civilisation other than theirs.\n\nIn their collective psyche, the colonialists never robbed or displaced anyone from their lands; to them, that part of history is not relevant. Their warped belief that they discovered Africa vast and empty strengthens their sense of entitlement.\n\nInstead, they perch on colonial aesthetics and the white mans burden.\n\nIn their prejudiced colonial worldview, natives were invisible munts who could not pass the master; being oblivious to longitude and latitude, they were just a wandering bundle of drives, energies, and spirits.\n\nTherefore, they continue to ignorantly believe that Africans should be grateful because, had it not been for white ingenuity, maverick frontiersmanship, reflective energy, and collective thrift, modern-day South Africa would have never been realised.\n\nThe combination of land ownership and entrenched values of exceptionalism buttressed by language and culture laid the foundations for what is now known as Afrikaner Nationalism. Throughout the colonial years, onomastic practices solidified their claims of belonging.\n\nAs a result, the narrative that South Africa belongs to all tribes and races that migrated from elsewhere is incorrigible on their part.\n\nHence, they question black South Africans claims of indigeneity.\n\nOn their part, Whites argue that they are not birds of passage. Unfortunately, such a monolithic memory that debases native agency while clinging to colonial aesthetics has not only made them cogitate less about black suffering, but has also created a delusion of grandeur.\n\nAs a corollary, such an obstinate refusal by a section of white South Africans to decentre, de-authorise, and divest themselves of privilege has regrettably sustained and entrenched colonial settler values, pushing the country along the road toward an eventuality that they so dread.\n\nThe negotiated settlement at independence in 1994 and the Truth and Reconciliation Commission did nothing to change their attitudes and prejudices.\n\nLeft to their enlightened self-interest to walk the extra mile, they stubbornly retreated into their enclave mentalities.\n\nAs a result, a cavalier form of independence and reconciliation was bequeathed to the new nation.\n\nPreserving the status quo, it created a rainbow nation in which whites remained economically Alpha.\n\nFast-track to the contemporary. Still trapped in their ossified racial proclivities, the AfriForum, Solidarity, and other like-minded organisations that may be subterranean for now are victims of their colonial amnesia.\n\nThese associations are platforms where Afrikaner nationalists ignorantly commiserate with each other as victims while lobbying the Empire for international support, hoping to circumscribe the inertia of affirmative action.\n\nHoist by their own petard, they are trapped in their delusional enclave society, characterised by a complex web of fear of loss and privilege.\n\nIn their cocoon, they reinforce a nostalgic colonial memory that sanitises their excesses.\n\nTheir fear of land redistribution stems from their guilty conscience from past excesses.\n\nBecause they refused to walk the extra mile to shed their nauseating sense of entitlement and exceptionalism, they fear retribution.\n\nHence, they equate land redistribution with words like reverse racism, genocide, pogrom, and all kinds of nomenclature.\n\nThey may posture themselves as victims, but that is pure bluffing.\n\nThe narrative that whites are systematically being targeted and maimed and that the government intends to grab land from white farmers wantonly is pure mischief, devoid of substance.\n\nBesides, land redistribution is not an avant-garde policy in South Africa; it also has precedence in many countries as a solution to the limitations of post-colonial wealth distribution.\n\nThese parochial Afrikaner nationalists are afraid of a wholesale land expropriation without compensation.\n\nHowever, the government has maintained that redistribution will be undertaken within the confines of the Act and Section 25 of the South African Constitution.\n\nSouth Africa has a liberal democratic system and culture that many can only admire and dream of, but these white goons have been ducking behind it. But that can only go so far because the situation in South Africa is untenable; it is a ticking time bomb.\n\nAs expected, the Empire is fighting back in myriad ways; everyone can smell it from afar.\n\nWhat is happening in South Africa is a regrouping of the Empire and its local surrogates, interlocutors, or appendages. The aim is to resist affirmative action policies and besmirch them as pure chicanery.\n\nJust as the script was read in Zimbabwe, nothing comes as a surprise anymore. They can label the bill as resource nationalism, a race-based tool of white segregation, or anything else. However, the fact is that the overbearing nature of the Empire, the asymmetries of global capitalism, and the racial affluence disposition in South Africa feed and sustain the need for land redistribution.\n\nIn his State of the Nation Address in February, South Africas President Cyril Ramaphosa stated that such imperialist and egotistic tendencies will not bully South Africa.\n\nWhile the Empire clutches at straws as its influence wanes across the continent, what is baffling is that it has learned nothing over the years.\n\nIts tendency to employ a crudely hectoring approach when dealing with matters like these has only pushed target countries to dig in and rally around the flag.\n\nWhether the US is trying to undercut the BRICS forum or make South Africa pay for its stance against Israel on the Palestinian cause, such scare-mongering tactics are always self-defeating. In fact, such an approach, reminiscent of the Empires perfidious Albion, has always worked in favour of countries like China and Russia.\n\nTo those obstinate white South Africans drowning in their colonial morbidities, whether now or in the not-so-distant future, a time is coming when lines will be drawn, and the National Democratic Revolution will be fulfilled.\n\nThe land issue in Southern Africa is not a colonial obsession by the black population; it is modern history. It is only a matter of time before the chickens come home to roost.\n\nDr Langton Makuwerere Dube is a postdoctoral research fellow in the Centre for Africa-China Studies (CACS) at the University of Johannesburgs Confucius Institute (UJCI)\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/10/President-Ramaphosa.jpg",
            "description": "Langton Makuwerere Dube, Herald Correspondent The growing diplomatic spat between South Africa and the United States, allegedly over the passing of the Land Expropriation Bill, continues to inundate media spaces. Interestingly, it has generated competing interpretations within South Africa and across the continent. Along the continuum, proponents view the Bill as the overdue remedy for […]",
            "time": "09:31",
            "date": "05 Mar 2025"
        },
        {
            "title": "KANGWA CHALLENGES CAPS UTD",
            "url": "https://www.herald.co.zw/kangwa-challenges-caps-utd/",
            "content": "Tadious Manyepo, Zimpapers Sports Hub\n\nCAPS United defender Bruce Kangwa feels the Green Machine can turn out to be one of the most competitive teams in the Castle Lager Premier Soccer League this season if everyone thrives to reach their peak.\n\nMakepekepe have one of the strongest squads, at least on paper, but started the term by dropping two points when settling for a 1-1 draw at GreenFuel last Saturday.\n\nThe Harare giants did get what should have been the winning goal when Joseph Mbollo brilliantly shrugged off his marker and turned in a low shot, but the effort was ruled out for offside.\n\nBut that, said Kangwa, will matter less as CAPS United need to pick the right momentum early in the race.\n\nThe positive vibes running at the club have given the former Highlanders more reason to believe the Green Machine will get to punch well this term.\n\nFirst of all, I would like to thank the Almighty God for guiding us throughout our pre-season. Its a new season now, a new different ball game, new players, and new tactics.\n\nSo, we, as CAPS United, know what it takes; we know what the coaches want; and as players, we are working out to get to the required groove, Kangwa said.\n\nEveryone is training hard. Everyone is giving it their all. So far, so good. Everyone is pushing hard. We are chilling out so well. Everyone is taking everything that the coach is giving us, and we, as players, all players, are pushing the new players, and they are doing the same.\n\nWere pushing each other as senior players, pushing the newcomers. You know, when youre in the field of play, theres nothing like big or small. You have to push, according to what the coach is giving us.\n\nWe have to push the team, push yourself to get to know your goals, what you want. As a team, you know what you want. So, we are pushing each other.\n\nAs for us, you know now, as we have new players, everyone is looking upon us, so we as players and the technical team are pushing very hard to work on whatever comes our way.\n\nCAPS United face newboys Scottland, where two of their best players from last season, Godknows Murwira and Kingsley Mureremba, have gone, at Rufaro on Sunday.\n\nScottland are walking with a spring in their step after beating Triangle 1-0 in their opening game at the same venue last Friday.\n\nBut for Kangwa, all that doesnt matter, as Makepekepe are looking at nothing less than picking the maximum points.\n\nSo now we have played our game against GreenFuel. Its now under the bridge. We are looking forward to our next game against Scottland, everyone is working so hard for our next game; we are pushing.\n\nWe know what we are coming up against, Scottland. We know they have good players. But we have good players too, so we are working hard, and at the end of the day, only God knows what will happen, but we will push for a win.\n\nWith everything looking good for CAPS United, they have also sought to galvanise their technical team by roping in former Bulawayo City and Arenel Movers coach Farai Tawachera.\n\nHe is coming in as a replacement for the late Nelson Matongorere, who died last year.\n\nTawachera is excited about the development and has described his boss, Lloyd Chitembwe, as a good teacher.\n\nLloyd Chitembwe is a good teacher. Ive known him for a long time. We have been sharing a lot of information in terms of our coaching careers, but what Ive experienced on the pitch is a good teacher, a very good teacher, a father figure. He makes you feel comfortable; he puts you there.\n\nHe doesnt believe in saying, Im the head coach. Im the head coach.\n\nHe gives you a chance to say, Look, give me your input. Give me your idea. What do you think? What should we do? So consultative. So that makes my stay easy. Im enjoying it, said Tawachera.\n\nHe reckons that CAPS United have a strongly assembled team capable of winning any game.\n\nI think, if Im looking at what we have got here, and if we put our heads together and everyone works extra hard, I think we are within reach to get the challenge. We can really challenge anyone for anything.\n\nIf you look at what we have got in terms of quality, honestly, we have got a very big chance of getting to the top if we really push for what we want. CAPS United is a big team; its different from small clubs. Small clubs just try to hang in there. But here is a big brand.\n\nHeres a challenge to us as technical teams; its a challenge to the players. Our fans want to see us doing good things, of which we endeavour to go there. We want to be somewhere better than what weve done in the past.\n\nWhile they may have ground out a win over Triangle, Scottland knows that the first real test of life in the Premiership begins with a clash against one of the leagues traditional Big Three  CAPS United.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Kangwa.jpg",
            "description": "Tadious Manyepo, Zimpapers Sports Hub CAPS United defender Bruce Kangwa feels the Green Machine can turn out to be one of the most competitive teams in the Castle Lager Premier Soccer League this season if everyone thrives to reach their peak. Makepekepe have one of the strongest squads, at least on paper, but started the […]",
            "time": "09:31",
            "date": "05 Mar 2025"
        },
        {
            "title": "Zim, Cuba celebrate 45 years of good ties",
            "url": "https://www.herald.co.zw/zim-cuba-celebrate-45-years-of-good-ties/",
            "content": "Blessings Chidakwa, Herald Reporter\n\nZIMBABWE and Cuba celebrated their long-standing diplomatic relationship spanning 45 years at Heritage Village in the Liberation City in Harare on Monday, highlighting decades of collaboration in healthcare, education and agriculture. Both governments reaffirmed their commitment to solidarity and shared values of independence and self-determination.\n\nThe Cuban delegation was led by the president of the National Assembly Esteban Lazo Hernandez.\n\nSpeaking on behalf of Cuba during the commemorations, president of the Cuban Institute of Friendship Fernando Gonzalez emphasised that his country would continue to stand with Zimbabwe.\n\nCde Gonzalez said the strong bonds that have united the two nations since their diplomatic relations were formalised in 1980, were guided by principles of solidarity, mutual respect, and a shared fight for justice and sovereignty.\n\nThis anniversary of diplomatic relations is a testament to the strength of a friendship that has withstood the passage of time and the challenges of a world where egoism often prevails, and the interests of powerful nations dominate, he said.\n\nOur peoples walked together in the fight against colonialism, and today they march together in creating opportunities through mutual solidarity to ensure that our two peoples benefit from their resources and talents.\n\nCde Gonzalez acknowledged Cubas health and education collaborators in Zimbabwe, who have been instrumental in counteracting sanctions.\n\nWe thank you, and we are immensely proud of your work. Zimbabwe, like Cuba, has felt the weight of coercive and unilateral measures imposed by external forces seeking to undermine our sovereignty and right to self-determination, he said.\n\nCde Gonzalez reiterated Cubas unwavering support for Zimbabwe in its fight against economic, commercial, and financial blockades imposed by the United States.\n\nAs you have heard, Cuba has been re-included on a list of States allegedly linked to terrorism by the new U.S. government. This unjust measure seeks to tarnish the image of a country that has dedicated its efforts to peace, co-operation, and international solidarity, he said.\n\nCde Gonzalez also expressed gratitude to the Cuban Solidarity Movement for its support in the fight against unjust policies.\n\nYou have raised your voices demanding an end to the blockade and have stood by us in our most difficult moments. This shows the empire that we are not alone, he said.\n\nOn this 45th anniversary of our brotherhood, we reaffirm our commitment to continue working together for a fairer and more just world, where we respect creation and promote peace.\n\nDeputy Minister of Foreign Affairs and International Trade Sheillah Chikomo said the visit was a clear testament to the close relations between the two sister republics.\n\nThese relations were forged in the 1960s and 1970s when we were comrades in arms during our liberation struggle. At that time, Cuba embraced Zimbabwes liberation cause, training our combatants and providing arms and materials for our fight, she said.\n\nAfter supporting us in the struggle for freedom, Cuba was among the first countries to recognise Zimbabwe as a sovereign nation, underscoring its belief in our right to self-determination.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Esteban-Lazo-Hernandez.jpg",
            "description": "Blessings Chidakwa, Herald Reporter ZIMBABWE and Cuba celebrated their long-standing diplomatic relationship spanning 45 years at Heritage Village in the Liberation City in Harare on Monday, highlighting decades of collaboration in healthcare, education and agriculture. Both governments reaffirmed their commitment to solidarity and shared values of independence and self-determination. The Cuban delegation was led by […]",
            "time": "09:31",
            "date": "05 Mar 2025"
        }
    ]
}