{
    "news": [
        {
            "title": "Govt rolls out 250k housing stands",
            "url": "https://www.herald.co.zw/govt-rolls-out-250k-housing-stands/",
            "content": "Wallace Ruzvidzo, Herald Reporter\n\nGOVERNMENT, in partnership with private players, has rolled out 250 000 developed residential stands and flats in Manyame, which will benefit both civil servants and ordinary citizens.\n\nOut of the residential stands, 20 000 have been ring-fenced for civil servants.\n\nAlready, the Government has surpassed its target of ensuring one million housing units by the end of this year, and has subsequently revised the target to 2 million units.\n\nSpeaking at a signing ceremony of a Memorandum of Understanding between the Government and Pinnacle Holdings in Harare yesterday, Local Government and Public Works Minister Dr Daniel Garwe said Zimbabweans were guaranteed well-designed, well-constructed and well-planned houses.\n\nThe availing of housing for all and sundry, he said, was an important pillar for the attainment of Vision 2030.\n\nWe are now sitting at 1 million stands for housing and development of flats. This is the beginning of 2025 and the target was for December 2025 and we have hit that target at the beginning of January 2025.\n\nI am even more confident to revise the figures that by the end of 2025, we should be able to reach another one million which means we will revise the figures from one million by 2025 to 2 million by 2025.\n\nThis is the trajectory that Vision 2030 directs us to take, this is what the President is talking about in his mantra that Nyika Inovakwa Nevene Vayo. This is the country that we have and this is the country that we must develop, Minister Garwe said.\n\nLocal Government and Public Works Minister Daniel Garwe (right) exchanges documents with Pinnacle Property Holdings Limited owner Mr Philip Chiyangwa at the signing of an agreement to avail stands for civil servants in Harare yesterday.  Picture: Charles Muchakagara\n\nThe development of the 250 000 stands will be done in Manyame, just behind the sprawling town of Chitungwiza.\n\nSuch projects, said Minister Garwe, were a fulfilment of President Mnangagwas desire to see every Zimbabwean, including civil servants, owning a residential stand, flat or house.\n\nI want to thank Honourable (Philip) Chiyangwa and his team and the financial institutions that are here, that have heard the call from His Excellency that let us develop our country.\n\nThe President wants to see every civil servant with at least a stand, a flat, a house, because the President is saying no place and no one must be left behind.\n\nBe that as it may, the President is not saying let us just focus on civil servants, he is saying let us focus on providing accommodation to every Zimbabwean, he said.\n\nMinister Garwe said more housing projects were set to be launched in other provinces.\n\nWe are going to be witnessing the launch of programmes such as the Nyore Nyore programme in Manyame, in other provinces.\n\nI know that in Chinhoyi we are going to be launching very soon the development of about 500 000 stands and units.\n\nThe Nyore Nyore programme in Manyame is about 250 000 stands plus flats. This is a huge development in the building environment.\n\nWe are responsible, as the Ministry of Local Government and Public Works, to ensure that we provide well-planned and well-governed settlements, he said.\n\nPinnacle Holdings chairman, Dr Chiyangwa promised to deliver 1,2 million housing units in various provinces across the country.\n\nSo in the new programme we have 1,2 million (housing units), we have given you a look at what we are doing in the Manyame area which is 250 000.\n\nWe have another million out of a few provinces, the big one is the one in Mashonaland West Province, he said.\n\nLocal Government and Public Works Minister Daniel Garwe (right) and Pinnacle Property Holdings Limited businessman Phillip Chiyangwa sign of MOU documents to avail stands for Civil Servants at Makombe Building in Harare yesterday.- Picture: Charles Muchakagara\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/President-Mnangagwa-4.jpg",
            "description": "Wallace Ruzvidzo, Herald Reporter GOVERNMENT, in partnership with private players, has rolled out 250 000 developed residential stands and flats in Manyame, which will benefit both civil servants and ordinary citizens. Out of the residential stands, 20 000 have been ring-fenced for civil servants. Already, the Government has surpassed its target of ensuring one million […]",
            "time": "06:27",
            "date": "11 Jan 2025"
        },
        {
            "title": "‘Expect new ways of doing business’",
            "url": "https://www.herald.co.zw/expect-new-ways-of-doing-business/",
            "content": "Africa Moyo, Deputy News Editor\n\nZIMBABWEANS should expect to see a marked change in the way the Second Republic conducts its business this year, as all systems are being improved to respond to the peoples needs, Acting President Kembo Mohadi said yesterday.\n\nIn an interview at his offices in Harare, the Acting President said 2025 promised to be exciting on the back of the current wet spell being experienced across the country, giving hope for a good cropping season and pastures for livestock.\n\nHigh impact projects such as dam and road construction, together with provision of decent and affordable housing, would be continued, he added.\n\nWe are all enthused about the prospects for the year. The Gods have smiled on us. We are receiving rain which is good for our crops and pastures, said Acting President Mohadi.\n\nI am happy to inform the nation that the Whole-of-Government remains steadfast on President Mnangagwas commitment to realise his Vision 2030 for Zimbabwe. Even as the President is on leave, we are busy fine-tuning the Whole-of-Government architecture, to be responsive to the needs of the people. It cannot be business as usual. You will see marked changes in the way we conduct business.\n\nThe good rains were expected to help the country save a lot of money that would ordinarily go towards making sure extra food reached a lot of people who would have lost their crops, as well as the cost of imports.\n\nWith prospects of a decent harvest, extra funds will now be channelled towards development, which has been the hallmark of the Second Republic led by President Mnangagwa since 2018.\n\nIn the last summer cropping season, Zimbabwes yields were affected by the erratic rains due to the El-Nino weather phenomenon, resulting in Government funds being used to provide grain for many rural families and cash allowances for the poorest of the urban families as a result Presidents call of ensuring that no one should starve.\n\nActing President Mohadi said the Government needed the hunter spirit in its operations, adding that sufficient preparations for a successful year have been made, riding on the milestones achieved last year.\n\nAsked if last year was a success, he said: Depending on how you view it yourselves, I would describe 2024 as a year in which as Government, we took bold and decisive decisions to pursue and consolidate our development thrust towards the attainment of Vision 2030.\n\nLast year many achievements were recorded in terms of economic stabilisation, health sector improvement, commendable regional contributions and good performances in the agricultural sector, among other milestones.\n\nOn economic reforms, Acting President Mohadi said Government, through the Reserve Bank of Zimbabwe (RBZ), introduced the Zimbabwe Gold (ZiG) currency to replace the Zimbabwe dollar.\n\nThis move stabilised the economy, as it laid the foundation for sustained economic growth, he said, reiterating that no country in the world can develop without its own currency.\n\nTurning to infrastructure development, Acting President Mohadi said the impact of last years severe drought affected progress on many fronts, including infrastructure development as resources had to be diverted towards mitigating the effects of drought.\n\nHowever, Zimbabwe completed 520km of the Harare-Beitbridge Highway and 1 500km of road rehabilitation.\n\nWe also saw the commissioning of the new Robert Gabriel Mugabe International Airport by His Excellency (President Mnangagwa), which increased the airports passenger capacity.\n\nOn digital transformation, the major development was the licensing of Starlink, a satellite internet service in the country.\n\nThe coming of Starlink, said Acting President Mohadi, was an acknowledgement of the information sector as a major contributor to the economy. Following the investments by other local companies and the coming of Starlink, overall internet penetration increased from 63 percent in 2023 to the present levels of 75 percent in 2024.\n\nIn the agricultural sector, Zimbabwe set a new wheat harvest record after attaining over 550 000 tonnes following heavy investments in irrigation while farmers were provided uninterrupted electricity supply.\n\nActing President Mohadi said another bold and decisive step of the Government last year was the issuing of new land title deeds that give indigenous farmers direct ownership of their land, allowing them to use the land as collateral for loans or sell it for investment.\n\nPresident Mnangagwa launched the new land title deeds programme at Precabe Farm on December 20, with the first beneficiaries receiving their title deeds.\n\nOn the political front, the country remained peaceful, despite unfounded reports of divisions in some sections of the media.\n\nAs a people we have remained united. The divisions we hear about, if any, are those we read from newspapers and social media.\n\nThe year 2024, saw the successful launch of the Gukurahundi Community Engagement Outreach by the President, His Excellency Dr Mnangagwa. This initiative seeks to address the historical grievances arising from the Gukurahundi disturbances.\n\nThis programme, spearheaded by our traditional leaders, identifies individuals and communities directly and indirectly affected, captures their views, and establishes community-led solutions to their grievances. Their involvement ensures that the process is inclusive, culturally sensitive, and reflective of the aspirations of affected communities, he said.\n\nZimbabwe also hosted a successful 44th SADC Summit in Harare in August, attracting a record number of delegates from the region.\n\nIn November, Zimbabwe also hosted an Extraordinary Sadc Summit to resolve some emerging issues in the region.\n\nActing President Mohadi said as Zimbabwe continued to assert its leadership role within SADC, several milestones were achieved including regional integration, peace and sustainable development.\n\nOn the health front, Government procured cancer machines for Parirenyatwa and Mpilo hospitals and also implemented a basic diagnostic tool for village health workers to screen and diagnose basic conditions.\n\nIn response to concerns from many football fans where the national football team, the Warriors, has been staging its home games in other countries, Acting President Mohadi said Government is now finalising the long-awaited installation of the bucket seats at the National Sports Stadium.\n\nOther sporting facilities such as Magamba, will be modernised.\n\nActing President Mohadi added that as a proud Zanu PF cadre, it would be amiss for him to discuss political developments in the country without acknowledging his partys role.\n\nThe revolutionary party, he said, held a successful 21st Zanu PF Annual National Peoples Conference in Bulawayo in October.\n\nThis is a pivotal event in our partys calendar and the highest expression of democracy within Zanu PF. The conference allowed us to reflect on our achievements and identify areas where we need to improve as a Government.\n\nImportantly, the resolutions adopted were rooted in the aspirations and voices of the people, he said.\n\nTurning to his own health, Acting President Mohadi, who was said to be unwell on social media, dismissed the reports.\n\nArriving for the interview earlier, he asked photographers if they needed his pictures before letting them embark on a five minute photo shoot.\n\nThe Acting President then asked them, jokingly, if they needed more time, to which they said they were fine.\n\nLater in his address, he referred to the social media allegations of ill health, and scoffed at claims he was in India to seek medical attention.\n\nActing President Mohadi said by being at the media engagement, that should dispel reports he was battling for his life.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/KM1.jpg",
            "description": "Africa Moyo, Deputy News Editor ZIMBABWEANS should expect to see a marked change in the way the Second Republic conducts its business this year, as all systems are being improved to respond to the people’s needs, Acting President Kembo Mohadi said yesterday. In an interview at his offices in Harare, the Acting President said 2025 […]",
            "time": "06:27",
            "date": "11 Jan 2025"
        },
        {
            "title": "Zim, Ghana plan to hold Joint Permanent Commission",
            "url": "https://www.herald.co.zw/zim-ghana-plan-to-hold-joint-permanent-commission/",
            "content": "Remember Deketeke, Herald Reporter\n\nPLANS are underway for the holding of a Joint Permanent Commission on Co-operation (JPCC) between Zimbabwe and Ghana.\n\nDefence Minister Oppah Muchinguri-Kashiri announced this development following her attendance of the inauguration ceremony of Ghanas new President John Mahama during the week.\n\nWe also value His Excellencys visit last year during the launch of the African Import-Export Bank conference in Ghana. President Mnangagwa participated in the African Import-Export Bank conference where he held a meeting that led to an agreement aimed at strengthening relations between the two countries, she said.\n\nThe discussions focused on various areas, including agriculture, gender issues, and STEM (Science, Technology, Engineering, and Mathematics) education.\n\nWe are pleased that draft MOUs were prepared in Zimbabwe and presented to the Ghanaian authorities and anticipate that this year will see the inaugural meeting of the Joint Permanent Commission for Cooperation (JPCC).\n\nMinister Muchinguri-Kashiri recounted the genesis of the relationship between the two countries.\n\nAs a nation, we must recognise the many commonalities we share with Ghana. Ghana gained its independence in 1957 under the leadership of the late pan-Africanist and icon, former President Kwame Nkrumah, who inspired numerous African countries to pursue liberation from colonial rule, she said.\n\nZimbabwe has enjoyed a strong mutual relationship with Ghana, which supported us during our liberation struggle by training several freedom fighters, including Comrade Ndangana. This historical bond continues to strengthen our ties today.\n\nSome of our pilots were trained in Ghana, and scholarships continue to be extended to Zimbabwe, which we greatly appreciate.\n\nThe swearing in ceremony of President Mahama was attended by several African leaders, including Rwandas Paul Kagame, Kenyas William Ruto, DRCs Felix Tshisekedi and Burkina Fasos Captain Ibrahim Traore.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/OM.jpg",
            "description": "Remember Deketeke, Herald Reporter PLANS are underway for the holding of a Joint Permanent Commission on Co-operation (JPCC) between Zimbabwe and Ghana. Defence Minister Oppah Muchinguri-Kashiri announced this development following her attendance of the inauguration ceremony of Ghana’s new President John Mahama during the week. “We also value His Excellency’s visit last year during the […]",
            "time": "06:27",
            "date": "11 Jan 2025"
        },
        {
            "title": "2025 Legal Year opening ceremony slated for Byo",
            "url": "https://www.herald.co.zw/2025-legal-year-opening-ceremony-slated-for-byo/",
            "content": "Fidelis Munyoro, Chief Court Reporter\n\nIn a symbolic break from tradition, the Judicial Service Commission (JSC) has selected Bulawayo as the venue for its flagship ceremonial opening of the 2025 Legal Year, a powerful gesture of inclusivity and transformation.\n\nThe momentous and highly anticipated ceremony is set to take place on Monday.\n\nThis deliberate move to decentralise the official opening of the legal year aligns seamlessly with President Mnangagwas devolution policy, which has recently seen national events being rotated across various provinces.\n\nBy bringing judicial milestones closer to the people, this effort bridges distances, fosters unity, and redefines access to justice across the nation.\n\nThis occasion, steeped in tradition and significance, will be headlined by Chief Justice Luke Malaba, who is set to articulate the Judiciarys vision and set the tone for the legal calendar ahead.\n\nUnder the resonant theme, Building Public Confidence in the Judiciary Through Stakeholder Participation, the Chief Justice will preside over the main proceedings at the iconic Bulawayo High Court.\n\nThis theme, a clarion call to strengthen trust and engagement with the justice system, underscores the Judiciarys commitment to inclusivity, transparency, and accountability.\n\nSpeaking on this shift, Mr Daniel Nemukuyu, Head of Corporate Services for the JSC, said the event would be graced by nearly 200 delegates.\n\nAdding to the occasions grandeur, Chief Justice Malaba will host an exclusive dinner in honour of the distinguished guests.\n\nThis year, we are doing things differently, said Mr Nemukuyu.\n\nIn addition to the main event in Bulawayo, simultaneous ceremonies will take place across the nation, ensuring that every corner of the country shares in this pivotal moment for the Judiciary.\n\nIn Harare, the Deputy Chief Justice, Elizabeth Gwaunza, will preside over proceedings, while Justice Anne-Mary Gowora of the Constitutional Court will lead the Masvingo ceremony.\n\nJustice Ben Hlatshwayo, also of the Constitutional Court, will oversee the ceremony in Mutare, and Deputy Judge president, Justice Garainesu Mawadze will lead proceedings at the Chinhoyi High Court.\n\nThe opening of the legal year is far more than a ceremonial gathering, it is a profound and symbolic re-commitment to the ideals of justice and the rule of law.\n\nReflecting on its significance, Mr Nemukuyu said: This event marks the dawn of a new legal year, a fresh chapter in our Judiciarys journey. It is a time to reaffirm our dedication to upholding justice, safeguarding rights, and fortifying public trust.\n\nHe emphasised the reflective and collaborative spirit of the occasion.\n\nIt is an opportunity for judicial officers and legal professionals to take stock of the previous years legal milestones, challenges, and triumphs, Mr Nemukuyu said.\n\nBeyond that, it serves as a powerful platform for fostering dialogue and collaboration among judges, lawyers, and stakeholdersa coming together of minds that strengthens the very foundations of our legal system.\n\nAs the nation counts down to this day, the Judiciary is poised to inspire confidence and hope, reaffirming its role as the firm guardian of justice.\n\nIn line with President Mnangagwas campaign promise to leave no one and no place behind, the main Independence Day celebrations this year will be held outside Harare for the fourth time since 1980.\n\nThe decision to host the commemorations in Gokwe Nembudziya underscores the administrations commitment to decentralisation and inclusive development, demonstrating that the governments efforts to bring national events closer to the people are firmly on track.\n\nThe Judiciary is no exception to this drive for inclusivity and decentralisation.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/02/Daniel-Nemukuyu.jpg",
            "description": "Fidelis Munyoro, Chief Court Reporter In a symbolic break from tradition, the Judicial Service Commission (JSC) has selected Bulawayo as the venue for its flagship ceremonial opening of the 2025 Legal Year, a powerful gesture of inclusivity and transformation. The momentous and highly anticipated ceremony is set to take place on Monday. This deliberate move […]",
            "time": "06:27",
            "date": "11 Jan 2025"
        },
        {
            "title": "Zimsec A-Level results out",
            "url": "https://www.herald.co.zw/zimsec-a-level-results-out-4/",
            "content": "Ivan Zhakata, Herald Correspondent\n\nTHE Zimbabwe School Examinations Council has released the results of last Novembers A-Level examinations with a national pass rate of 94.58 percent, nearly identical to the 2023 performance.\n\nAddressing a Press conference in Harare yesterday, Zimsec board chairperson Professor Paul Mapfumo said he was satisfied with the consistency in the national pass rate, recognising the collective effort of all involved.\n\nWe are pleased with the stability of our results, which reflect the dedication of our students, teachers and other stakeholders, he said.\n\nA total of 33 585 candidates sat for the examinations in 2024, slightly fewer than the 34 437 who wrote in 2023, showing a 2.47 percent decrease in candidature.\n\nOf these, 33 246 candidates wrote two or more subjects. Out of this group, 31 443 achieved a Grade E or better leading to a pass rate of 94.58 percent which mirrors last years results.\n\nGender differences were notable in the results. Female candidates saw a remarkable improvement, recording a pass rate of 95.94 percent for those who sat for two or more subjects.\n\nThis was a marked increase from the 92.32 percent pass rate in 2023.\n\nWe are thrilled to see our female candidates excelling and continuing to outperform their male counterparts, said Prof Mapfumo.\n\nIn comparison, male candidates posted a pass rate of 93.13 percent which was slightly lower than the previous years rate of 93.95 percent.\n\nHowever, the overall performance of male candidates remained stable.\n\nWhile the performance of male candidates remains steady, there is always room for improvement, Prof Mapfumo added.\n\nSpecial needs candidates also made significant progress this year and out of the 40 special needs candidates who sat for the exams, 38 passed with a Grade E or better, resulting in a pass rate of 95 percent.\n\nThis marked a substantial improvement from 2023, when 29 out of 34 candidates passed, yielding a pass rate of 84.62 percent.\n\nThe success of our special needs candidates reflects the ongoing efforts to make education more inclusive and accessible, said Prof Mapfumo.\n\nThe 2024 examination season saw a total of 29,041 school candidates, a slight decrease from 29 910 in 2023.\n\nOf the 28 900 who wrote two or more subjects, 27 509 achieved a Grade E or better, leading to a pass rate of 95.18 percent.\n\nThis closely mirrored the previous years performance, which had a pass rate of 95.19 percent.\n\nPrivate candidates, who numbered 4 544 in 2024, saw a slight increase in the number of candidates writing two or more subjects compared to the previous year.\n\nA total of 4 346 private candidates sat for two or more subjects, with 3 934 passing, resulting in a pass rate of 90.52 percent. In 2023, the pass rate for private candidates stood at 90.57 percent.\n\nCandidates were able to access their results online via the ZIMSEC portal with effect from 4 pm yesterday, with the portal open for five days only.\n\nHeads of examination centres will be able to collect the results for their schools from provincial offices on Monday, January 13.\n\nProf Mapfumo also extended gratitude to all involved in the administration of the exams.\n\nWe would like to thank the school administrators, teachers, markers, and other stakeholders for their dedication. The successful completion of these exams is a direct result of the collective effort to maintain the integrity of the system, he said.\n\nThe 2024 A-Level results reflect not only the continued strength of Zimbabwes education system but also the resilience and dedication of its students, teachers and education stakeholders.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/06/1106-1-1-VC-PROF-MAPFUMO.jpg",
            "description": "Ivan Zhakata, Herald Correspondent THE Zimbabwe School Examinations Council has released the results of last November’s A-Level examinations with a national pass rate of 94.58 percent, nearly identical to the 2023 performance. Addressing a Press conference in Harare yesterday, Zimsec board chairperson Professor Paul Mapfumo said he was satisfied with the consistency in the national […]",
            "time": "06:27",
            "date": "11 Jan 2025"
        },
        {
            "title": "Patel appointed Special Presidential Investment Adviser",
            "url": "https://www.herald.co.zw/patel-appointed-special-presidential-investment-adviser/",
            "content": "Africa Moyo, Deputy News Editor\n\nPRESIDENT Mnangagwa has approved the appointment of businessman Mr Elesh Patel as Special Presidential Investment Adviser focusing on Bangladesh, Thailand and Vietnam.\n\nMr Patel has been a board member of the National Railways of Zimbabwe (NRZ) since February 2022.\n\nForeign Affairs and International Trade Minister, Professor Amon Murwira, met Mr Patel in Harare on Thursday to hand him the letter of appointment.\n\nIn his remarks afterwards, Prof Murwira said to promote industrialisation through international investments, Zimbabwe needs to expand into Bangladesh, Vietnam, and Thailand.\n\nWe know that those areas are good in textiles, most of those, in the cotton value chain, and we really look forward to that kind of specialty coming to this country, working with them and doing everything in our power to encourage them to come here and work with us, for mutual benefit for business on their part as well as for business on Zimbabwes part, he said.\n\nIn his remarks, Mr Patel thanked President Mnangagwa for bestowing this very, very prestigious appointment to me, which I will endeavour to execute in the highest possible way and keep the flag of Zimbabwe running very high.\n\nBefore this latest appointment, Mr Patel contributed towards the development of the transport system in Zimbabwe during his tenure as NRZ board member and the Government acknowledged his willingness and determination to serve the country as Special Presidential Investment Adviser.\n\nThe Government emphasises the importance of his role in contributing to the attainment of Vision 2030 of an empowered upper-middle income society through securing foreign direct investment and strategic partnerships, which will not only contribute to the textile industry, but also have a larger impact on economic development.\n\nThe Second Republic led by President Mnangagwa says beneficiation and value addition initiatives in various sectors of the economy are critical to national development.\n\nAs part of his duties, Mr Patel is expected, among other issues, to promote the development of commercial and economic relations between Zimbabwe, Bangladesh, Thailand and Vietnam.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/M1.jpg",
            "description": "Africa Moyo, Deputy News Editor PRESIDENT Mnangagwa has approved the appointment of businessman Mr Elesh Patel as Special Presidential Investment Adviser focusing on Bangladesh, Thailand and Vietnam. Mr Patel has been a board member of the National Railways of Zimbabwe (NRZ) since February 2022. Foreign Affairs and International Trade Minister, Professor Amon Murwira, met Mr […]",
            "time": "06:27",
            "date": "11 Jan 2025"
        },
        {
            "title": "EDITORIAL COMMENT: Fifa setting tone for Zifa growth",
            "url": "https://www.herald.co.zw/editorial-comment-fifa-setting-tone-for-zifa-growth/",
            "content": "ZIMBABWEAN football has for over 18 months been under the administration of the games international federation FIFA and the period of Normalisation is proving to be just what the doctor may have ordered for the countrys flagship sport.\n\nFor the last four years, the countrys football has endured a largely difficult and forgettable period during which the game, like all disciplines, was first halted by the Covid-19 pandemic in 2020.\n\nThis was followed by suspension from the international football family by FIFA after which the world body lifted the sanctions and appointed Lincoln Mutasas Normalisation Committee to spearhead a major reform process.\n\nThat reform process was also anchored on a Memorandum of Understanding (MOU) entered into between FIFA, the government through the Sports and Recreation Commission (SRC) and ZIFA.\n\nHaving an MOU struck between the three major players in the administration of football has paved the way for normalcy to return to ZIFA.\n\nIn fact, we believe that with the goodwill that ZIFA is enjoying from FIFA, the association in particular and the sport at large are poised for exponential growth.\n\nUpon their entry into office on Jully 11, 2023, the Normalisation Committee with the help of FIFA secured a more spacious and upmarket office from where the secretariat could operate.\n\nThey also restructured the secretariat and put in place operating systems that are in keeping with current business trends in global football.\n\nFIFA undertook to pay the salaries for the national teams coaches  Michael Nees for the Warriors and SithetheleIwe Kwinji 15 Sibanda for the womens side for the next two years.\n\nNow that should ease some of ZIFAs major worries as over the years the association and successive administrators have been dragged to court and even to FIFA for failing to pay coaches their dues.\n\nThis week, FIFA made yet another huge legacy mark after releasing funds that will see the ZIFA Village finally being turned into the ideal football house that any association needs.\n\nWhile the property might have been acquired by the Leo Mugabe-led administration during the era of the FIFA Goal Project, the Mt Hampden venue had only seen minimal work done on it for it to look anything like a football training centre.\n\nSuccessive leaders in the post Mugabe era failed to turn the ZIFA Village into the place it ought to be  a top-notch training centre with training pitches, lecture rooms, offices and accommodation where national teams and even local club sides could camp.\n\nResultantly ZIFA have, over the years, ignored the ZIFA Village.\n\nInstead, large sums of money were spent on hotels and hiring training grounds when all that could have been saved, had ZIFA been using their own facilities.\n\nAs reported in yesterdays edition of this publication, it has been a refreshing period with ZIFA commencing massive refurbishment works at the Village and even giving themselves a 70-day deadline by which the first phase should have been completed.\n\nAnd that has been made possible through FIFA Forward Funds.\n\nThe project, according to ZIFA, begins with a phase, which will focus on the refurbishment of the boarding house and the transformation of the technical centre into a modern office block and conference room.\n\nNow that is a sound commercial and football investment.\n\nThis phase is set to significantly improve the functionality of the ZIFA Village by addressing the accommodation challenges faced by national teams during their assignments and competitions.\n\nAdditionally, the upgraded facilities will serve as a hub for hosting the associations activities and events and these include meetings of Congress, referees, coaches and administrators training workshops.\n\nWe believe that FIFA, through the Normalisation Committee, have done their part to set the tone for ZIFAs growth.\n\nMutasa and his committee have stressed that efforts are being made to ensure timely completion while adhering to the highest standards of quality and with the guiding hand of consultants hired by FIFA, we have reason to believe they will meet their targets.\n\nIn the next phase, ZIFA want to embark on the construction of a standard technical centre and football pitches.\n\nThus, the rehabilitation of the ZIFA Village is a testament to FIFAs commitment to drive development in member associations.\n\nThe ZIFA Village refurbishment also presents the executive committee that will be elected on January 25, with a platform from which to kick-start their tenure in office.\n\nIt also poses a strong challenge to the new ZIFA leadership to jealously guard the ZIFA Village, especially from litigation.\n\nZIFA cannot afford to go back to the dark era when the Deputy Sheriff could be seen stripping the artificial turf at the Village because it would have been attached because of the associations failure to settle a debt.\n\nThere are numerous examples where FIFAs help has changed lives in Rwanda, Sierra Leone, Botswana, ESwatini and Lesotho and Zimbabwe could be next and we believe Zimbabweans have the pedigree to even come out tops.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/07/Untitled-71-3.jpg",
            "description": "ZIMBABWEAN football has for over 18 months been under the administration of the game’s international federation FIFA and the period of Normalisation is proving to be just what the doctor may have ordered for the country’s flagship sport. For the last four years, the country’s football has endured a largely difficult and forgettable period during […]",
            "time": "06:27",
            "date": "11 Jan 2025"
        },
        {
            "title": "When the sugar is no longer sweet",
            "url": "https://www.herald.co.zw/when-the-sugar-is-no-longer-sweet/",
            "content": "Walter Nyamukondiwa, Mashonaland West Bureau Chief\n\nMusic artist Taruvinga Sugar Sugar Manjokoto feels some promoters, choices he made and the bad hand that the banker in the wild casino of life dealt him have combined to relegate him to the peripheries of the music industry.\n\nWith it comes a life of struggle, unfulfilled dreams, mockery from some once adoring fans whom he rubs shoulders with in public transport, leaving him a tormented soul yearning for a breakthrough.\n\nWas it a case of fame without fortune, talent tainted by misfortune, lack of proper management or imprudent use of resources at his peak?\n\nFrom a stint on the top table of the countrys music industry where he easily rubbed shoulders with the finest of the time, Sugar Sugar dropped off and now sweeps up crumbs at the bottom.\n\nHis story of triumph, misfortune and loss, narrated with a tinge of humour, lament and regret reads like a movie script.\n\nThe journey that I have travelled in music has been very painful and these days I have to endure being mocked as someone who was famous but of no means.\n\nPeople say painful things, said Sugar Sugar with teary eyes.\n\nHis first love, music, took him to Mozambique, South Africa and Malawi among other places in search of a decent life and a quest to expand his career but the cloak of misfortune seemed stuck on him.\n\nIn South Africa, where he stayed for four years, fear and terror was the motif of his stay, making the trek back home the natural choice.\n\nHaving a fan shot at the gate at one of his shows, to having security at the gate raided during another show with the assailants making off with the gate takings sapped all the hope Sugar Sugar had of a musical breakthrough in that country.\n\nI could have stayed in South Africa longer but I was living under constant fear because of the nature of the people I often encountered during our shows, said a dejected Manjokoto.\n\nDuring one of our shows, a fan was shot at the gate while waiting to play by some unknown people, affecting the image of our brand.\n\nIn another incident some armed men came and raided the security team at the gate and went away with the money while I was playing inside. I played for nothing on the day.\n\nIt became difficult to hold shows and he had to undertake some menial jobs to survive, prompting the decision to head back home.\n\nI could have been a target one of the days, he noted.\n\nAsked about royalties from music sales from his then record label, Gramma, Sugar Sugar said nothing meaningful came from the sale of his chart-topping albums including Chamungarwire, which took the country by storm.\n\nThe album seemed to be the climax of his music career drawing sold out concerts and a chance to share the stage with the evergreen Sungura maestro Alick Macheso, the late Tongai Moyo, Nicholas Zakaria and Leonard Zhakata among others.\n\nThere wasnt much money that came every three months from the record label and I would say the only time it seemed to be much was when the royalties accumulated when I stayed in Mozambique, he explained.\n\nI got home and got a lump sum but the bulk of the money went to settle debts accumulated by the family during my absence.\n\nI bought groceries for my parents when I went to visit them after a long time away and that was it.\n\nThis brings to the fore the uneasy relationship between record labels and the artists they contract.\n\nRecently, Paradzai Mesi indicated that most artists would get about 15 percent of record sales with no proper system for artists to track how well their music was doing.\n\nHe later negotiated for an upward variation to around 20 percent.\n\nThis was said to be the rate across the board, prompting most artists including the late Oliver Mtukudzi and Simon Chimbetu to jump ship at the lapse of the alleged exploitative contracts for better ones.\n\nFor Sugar Sugar, he was at perfect bliss with whatever, the record label gave him without consideration of whether it was fair value or not.\n\nThat is when I discovered the importance of being educated because I was content with what I was given and not what was due to me.\n\nIt is only now that I look back and realise I could have benefited more from my talent, he said.\n\nDont they say ignorance is bliss?\n\nThe sting of ignorance also continues to prick him as he is unable to exploit the social media space and online music distribution channels.\n\nInstead, he looks up to willing people to upload his music and monetise his platforms.\n\nHowever, the road has been fraught with opportunists who are exploiting his works for their benefit.\n\nI dont know how it is done. I see my music on the internet but I am not getting anything from it, he lamented.\n\nHis biggest regret has been his decision to wean himself from businesswoman Mai Chitagu, also known as Mai Charehwa, who ran some bottle-stores in Budiriro 2 and sponsored him during his glory years.\n\nMai Charehwa promoted Manjokoto for seven years, which proved to be his purple patch.\n\nThe woman would do everything for me for seven years and one day I just decided that I should relieve pressure from her and get support from other promoters and benefactors, he narrated.\n\nI just said she had come a long way providing everything for me so I needed to give her a break.\n\nThat was to be the nasty turning point of his career.\n\nIt is the decision he regrets to this day.\n\nA costly decision!\n\nHis roller coaster rise to fame punctuated by hit songs such as Mairosi, Juliana and Zvaonekwa among others captured the attention of the nation between 2004 and 2015.\n\nWith 11 albums under his belt, Sugar Sugar believes he still has the magic touch that captured the attention of the nation.\n\nWhen he realised that purported angels in shining armour who had promised to fill in the gap were opportunists who saw him as a big catch for business, it was too late to go back to Mai Charehwa.\n\nShe had moved on into mining and other businesses.\n\nThe train had already left the station.\n\nAll I need is support with shows from promoters and also other established artists so that I can showcase my talent.\n\nThe team I worked with on the explosive albums including our unique chanter Kudzanai Gwachiware is still available, he said.\n\nGwachiware of thebhazi rapinda musimende(a rural bus has now entered the tarred roads of the city) chant on one of Manjokotos songs was rumoured to have died, but he is alive and features on his soon to be released albums.\n\nThe title of an album set for release in March, Chimbondionaiwo, speaks of a man who has been in the wildness for a long time and is appealing to the divine, promoters and philanthropists such as Wicknell Chivhayo to extricate him from his lifes struggles.\n\nThe hurt and struggles in the music industry have left him on the verge of giving up and try other things but the bond has been too strong to sever.\n\nThese days, the man from Buhera is in Lions Den where he is visiting his in-laws but has decided to look for shows in the farming and mining communities.\n\nThe world is replete with music artists, athletes and businessmen who have scaled the heights of stardom, only to fizzle out into oblivion or penury.\n\nSome are victims of the unforgiving hand of the taxman, associated flamboyance, including catering for hangers on and slay queens that suck them dry before moving onto the next victim.\n\nThe proverbs Look before you leap rings hauntingly true for Sugar Sugar and so does dont throw away what you have in hand in a bid to receive what has been promised.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Taruvinga-“Sugar-Sugar”-Manjokoto.jpg",
            "description": "Walter Nyamukondiwa, Mashonaland West Bureau Chief Music artist Taruvinga “Sugar Sugar” Manjokoto feels some promoters, choices he made and the “bad hand” that the banker in the wild casino of life dealt him have combined to relegate him to the peripheries of the music industry. With it comes a life of struggle, unfulfilled dreams, mockery […]",
            "time": "06:27",
            "date": "11 Jan 2025"
        },
        {
            "title": "A 33-year odyssey: Witnessing evolution of newspaper industry",
            "url": "https://www.herald.co.zw/a-33-year-odyssey-witnessing-evolution-of-newspaper-industry/",
            "content": "Rungano Washington Gwanzura, Group Design Editor\n\nAs I sit here, reflecting on my 33-year journey at Zimpapers, I am filled with a sense of nostalgia and awe.\n\nThursday, January 9, 2025, marked a significant milestone in my career, and I am honoured to have been a part of this incredible journey.\n\nI joined Zimpapers on January 9, 1992, when the industry was still rooted in traditional printing methods.\n\nThe letterpress, linotype, and lithographic systems were the backbone of our production process. I vividly remember the distinct smell of ink, the sound of clanking metal, and the sense of satisfaction that came with seeing the days edition roll off the presses.\n\nMy immediate boss at the time was the renowned Charles CNN Mabika.\n\nI had only known him from his radio broadcasts, but when I met him in person, I was struck by his humility.\n\nThe editor of The Herald at the time was Tommy Sithole, a man feared and respected by all.\n\nHe was also the Editor-in-Chief of all Zimpapers publications, which included The Herald, The Sunday Mail, Chronicle, Sunday News, The Manica Post, Kwayedza, and Umthunywa.\n\nThe dawn of the new millennium brought with it a seismic shift in the industry.\n\nComputer systems and digital pagination replaced traditional printing methods, increasing efficiency and reducing production time.\n\nThis period also saw the rise of online news platforms, which would eventually change the way we consumed and interacted with news.\n\nUnder the leadership of our current CEO, Pikirayi Deketeke, Zimpapers has continued to evolve and adapt to the changing media landscape.\n\nWe have successfully expanded our operations to include radio and TV stations, emulating the likes of Nation Media in Kenya.\n\nToday, Zimpapers boasts an impressive array of publications, including H-Metro, B-Metro, Business Weekly, Suburban, Kwayedza Dzidza, BH24, Agriculture Journal, The Herald Agric ePaper, and many more.\n\nThe past decade has been marked by a fundamental transformation in the way we create, distribute, and consume news.\n\nThe advent of social media, online news aggregators, and mobile devices has forced the industry to adapt and evolve.\n\nOur newsroom is now a hub of digital activity, with journalists, editors, and producers working together to create engaging, interactive content for our online audiences.\n\nAs I reflect on my 33-year journey, I am struck by the resilience and adaptability of our industry. Despite the challenges posed by technological disruption, changing reader habits, and economic pressures, we have continued to evolve and thrive.\n\nI have learned that the key to success lies in embracing change, investing in innovation, and staying true to the core values of journalism: accuracy, fairness, and a commitment to telling the stories that matter.\n\nAs I look to the future, I am excited by the possibilities that lie ahead. The newspaper industry will continue to evolve, driven by advances in technology, changing reader preferences, and the need for sustainable business models.\n\nOne thing, however, will remain constant  our commitment to quality journalism, our passion for storytelling, and our dedication to serving our audiences.\n\nMy 33-year journey at Zimpapers has been an incredible odyssey, filled with challenges, opportunities, and lessons learned. As I celebrate this milestone, I am grateful for the experience, proud of our accomplishments, and excited for the future ahead.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/WG.jpg",
            "description": "Rungano Washington Gwanzura, Group Design Editor As I sit here, reflecting on my 33-year journey at Zimpapers, I am filled with a sense of nostalgia and awe. Thursday, January 9, 2025, marked a significant milestone in my career, and I am honoured to have been a part of this incredible journey. I joined Zimpapers on […]",
            "time": "06:27",
            "date": "11 Jan 2025"
        },
        {
            "title": "Zifa dismiss fake Fifa letter . . . Association not reinstating disqualified candidates",
            "url": "https://www.herald.co.zw/zifa-dismiss-fake-fifa-letter-association-not-reinstating-disqualified-candidates/",
            "content": "Zimpapers Sports Hub\n\nZIFA have branded as a shameless act of deceit, a letter purportedly sent by FIFA and which claimed that the world football bodys independent ethics committee was probing Nqobile Magwizis candidature.\n\nMagwizi has emerged a front runner in the race to become the next substantive ZIFA president at the associations January 25 elections.\n\nIt will be the first elections at ZIFA since December 2018 when Felton Kamambos leadership was voted into office before their ignominious exit from the scene in November 2021.\n\nZIFAs Normalisation Committee led by Lincoln Mutasa were however, yesterday taken aback by sensational and yet false claims that they were being probed by FIFA for the manner in which they had accepted Magwizis nomination.\n\nMutasa also dismissed false, claims that his committee had overturned their disqualifications and would invite back, everyone who had entered the ZIFA elections race.\n\nWe hear there are false claims being made that everyone who had wanted to compete has been invited back, there is no such development, Mutasa said.\n\nOn the allegations that Mutasa was probed, the claims were being made in a letter supposedly written by Martin Ngoga, a FIFA Ethics Committee vice-chairman.\n\nBut in the unsigned letter, Ngoga is given the title of chairperson of the committee.\n\nAn anonymous investigative sports journalist was said to have red-flagged Magwizis candidature in yet another attempt to smear the Harare businessman and advertising gurus image.\n\nAnd Mutasa last night scoffed at the claims that his Normalisation Committee may have breached the ZIFA constitution in the manner they went about accepting and rejecting nominations by the associations board aspirants.\n\nThere is no such official correspondence to us from FIFA save for what has been circulated on social media.\n\nThis is indeed the silly season, Mutasa said.\n\nThe former Dynamos chairman insisted that his committee had done a diligent job so far on the build-up to the elections.\n\nWe are very clear that the process we used which was guided by the ZIFA constitution of October 2024 was above board and it was applied to all aspirants equally.\n\nThere were no special rules for any particular candidates.\n\nEverything that was required by the statutes, whether it was about OLevel certificates, or that one should be resident in Zimbabwe and that one should get nominations from bona fide ZIFA members, it all in the statutes.\n\nFor the nominations it says a ZIFA member can only and with a resolution by that member to back-to-back the nomination was followed.\n\nMutasa also said it was frivolous for those targeting his committee or other candidates to suggest that the Sports and Recreation Commission had a hand in the selection of candidates.\n\nIt is very much imagination to suggest that SRC were involved in the nomination of candidates when everyone who took part knows only bona fide members of ZIFA signed the nominations.\n\nMaybe it is the work attention seekers because if one looks at ZIFA now, one has to appreciate the work that has been done in the reform process to such an extent that there has been a huge turnout of people of now wanting to be elected into ZIFA, added Mutasa.\n\nWhile Magwizi has been on whirlwind campaign trail around the country to meet with the electorate, better known as the councillors, is has emerged that some of his rivals have turned to a smear campaign to tarnish his image and even claim he should have been ruled ineligible on the basis that he was once on the United States sanctions.\n\nThe letter which Mutasa dismissed read in part: Thank you for bringing your concerns to the attention of FIFA. We acknowledge receipt of your formal complaint dated 07/01/25 regarding the nomination of Mr Nqobile Magwizi for the presidency of the Zimbabwe Football Association (ZIFA).\n\nFIFA takes allegations of unethical practices, non-compliance with constitutional requirements, political interference, and vote-buying with utmost seriousness. The issues raised in your correspondence, including the allegations of undue political influence, vote-buying, and OFAC sanctions are of significant concern to FIFAs commitment to integrity and ethical governance.\n\nIn response to your complaint, the matter has been referred to the FIFA Ethics Committee, under the leadership of Chairperson Mr Martin Ngoga, for a thorough investigation.\n\nThe committee is committed to conducting a detailed and impartial review of the allegation, ensuring full compliance with FIFA statutes and ethical standards.\n\nThe FIFA Ethics Committee will engage with relevant parties, including ZIFA and the Sports and Recreation Commission (SRC), to examine the integrity of the electoral process and address any breaches of governance, ethics, or FIFAs principles of fair play and political neutrality.\n\nAn analysis of the letter, however, also cast a shadow on its authenticity and credibility.\n\nThe purported FIFA letter is also dated 10 January 2014.\n\nThat Ngogas signature conspicuous by its absence also raises questions given the tradition that all correspondence from FIFA bears the authors signature.Curiously not even the Confederation of African Football, a key player on the Zimbabwe question were copied.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Mutasa.jpg",
            "description": "Zimpapers Sports Hub ZIFA have branded as a shameless act of deceit, a letter purportedly sent by FIFA and which claimed that the world football body’s independent ethics committee was probing Nqobile Magwizi’s candidature. Magwizi has emerged a front runner in the race to become the next substantive ZIFA president at the association’s January 25 […]",
            "time": "06:27",
            "date": "11 Jan 2025"
        }
    ]
}