{
    "news": [
        {
            "title": "President appoints two new deputy ministers",
            "url": "https://www.herald.co.zw/president-appoints-two-new-deputy-ministers/",
            "content": "Online Reporter\n\nPresident Emmerson Mnangagwa has appointed Caleb Makwiranzou as the Deputy Minister of Mines and Mining Development responsible for Oil and Gas Research including other Strategic Minerals Exploration with immediate effect and Albert Tawanda Mavunga, as the Deputy Minister of Local\n\nGovernment and Public Works responsible for Local Authorities and Traditional Leadership.\n\nCaleb Makwiranzou\n\nThe appointments, which were announced by the Chief Secretary in the Office of the President and Cabinet Dr Martin Rushwaya are with immediate effect.\n\nAlbert Tawanda Mavunga\n\nBoth appointments, Dr Rushwaya said were made in terms of Section 104, Subsection 2 of the Constitution of Zimbabwe.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/President-Mnangagwa-3.jpg",
            "description": "Online Reporter President Emmerson Mnangagwa has appointed Caleb Makwiranzou as the Deputy Minister of Mines and Mining Development responsible for Oil and Gas Research including other Strategic Minerals Exploration with immediate effect and Albert Tawanda Mavunga, as the Deputy Minister of Local Government and Public Works responsible for Local Authorities and Traditional Leadership. The appointments, […]",
            "time": "21:06",
            "date": "13 Feb 2025"
        },
        {
            "title": "President Mnangagwa declares Beitbridge accident national disaster",
            "url": "https://www.herald.co.zw/president-mnangagwa-declares-beitbridge-accident-national-disaster/",
            "content": "Online Reporter\n\nPresident Mnangagwa has declared the Beitbridge accident which claimed 24 lives a national disaster and said the deceased will be accorded State-assisted burials.\n\nIn a statement, the President said he was horrified and heartbroken by the tragic loss of lives.\n\nThe death of 24 Zimbabweans in a head-on collision between an Urban Connect bus and a commercial haulage truck along the Beitbridge-Masvingo Highway this morning left me horrified and heart-broken.\n\nFellow Zimbabweans, our nation does not deserve this at all, let alone experiencing such a bloody incident at the beginning of the year. We have to do all that is possible to curb this unjustified loss of life, he said.\n\nPresident Mnangagwa appealed to all motorists to exercise extreme caution on the roads, for the sake of both fellow road users and themselves.\n\nAll arms of the Government that are responsible for ensuring safety on our roads are thus constantly reminded to work around the clock and evoke all legal means and powers available to them to reduce and subsequently put an end to such carnage.\n\nGovernment has therefore declared this incident a national disaster and will accord victims of this horrendous crash State-assisted burial.\n\nAs I express my deepest, heartfelt condolences to families and relatives who have lost their loved ones in this horrific crash, I also heartly and prayerfully reach out to all those injured and hospitalised, wishing them speedy recovery, said the President.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/94e72635-9583-48f8-8835-13d3f6a63004-680x380.jpeg",
            "description": "Online Reporter President Mnangagwa has declared the Beitbridge accident which claimed 24 lives a national disaster and said the deceased will be accorded State-assisted burials. In a statement, the President said he was horrified and heartbroken by the tragic loss of lives. “The death of 24 Zimbabweans in a head-on collision between an Urban Connect […]",
            "time": "21:06",
            "date": "13 Feb 2025"
        },
        {
            "title": "Valentine’s Day fever boosts sales",
            "url": "https://www.herald.co.zw/valentines-day-fever-boosts-sales/",
            "content": "Nyasha Motsi\n\nHerald Reporter\n\nThe Valentines Day fever has gripped the nation with some people already receiving gifts at their workplaces and homes a day before the celebrations.\n\nThere was a lot of activity in gift shops as people made last-minute shopping for their loved ones.\n\nA survey conducted by our crew revealed that popular gifts include flowers, perfumes, chocolates, high-end jewellery, and fine wines.\n\nSocial media platforms such as Instagram, Facebook and TikTok are also vibrant as people wait eagerly for the day.\n\nHarare resident Mrs Mufaro Zvinokwazvo said she is anticipating a Valentines gift from her husband.\n\nReceiving a Valentines gift from your partner makes you feel appreciated, she said.\n\nMrs Zvinokwazvo said Valentines Day gifts should not be limited to romantic partners or spouses, but can also be used to show appreciation for other loved ones, such as mothers or sisters.\n\nA Harare resident who wished to remain anonymous and was shopping for his girlfriend at Joina City said Valentines Day is an opportunity for men to appreciate and pamper their loved ones.\n\nl have bought these gifts worth more than US$50 to appreciate my girlfriend, he said.\n\nLadies are very important in our lives, they deserve to be loved and appreciated.\n\nHowever, Sam Magaya, offered a contrasting view on Valentines Day.\n\nMagaya said every day should be Valentines Day.\n\nI do not celebrate Valentines Day because I do not appreciate its origins, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/rgreg-680x380.jpg",
            "description": "Nyasha Motsi Herald Reporter The Valentine’s Day fever has gripped the nation with some people already receiving gifts at their workplaces and homes a day before the celebrations. There was a lot of activity in gift shops as people made last-minute shopping for their loved ones. A survey conducted by our crew revealed that popular […]",
            "time": "21:06",
            "date": "13 Feb 2025"
        },
        {
            "title": "Beitbridge accident: Bus tried to overtake",
            "url": "https://www.herald.co.zw/beitbridge-accident-bus-tried-to-overtake/",
            "content": "Sidumisile Mabena\n\nPOLICE have said 24 people died in a tragic accident on the Masvingo-Beitbridge highway on Thursday at around 8am.\n\nIn a statement, National Police spokesperson Commissioner Paul Nyathi said an Urban Connect bus carrying 65 passengers had a head on collision with an Auro Transport haulage truck with four occupants, resulting in the death of 24 people.\n\nThe bus was travelling from Harare to Beitbridge while the truck was travelling in the opposite direction, said Commissioner Nyathi.\n\nHe said preliminary investigations suggest that the accident occurred as the bus attempted to overtake another vehicle.\n\nThe number of injured people is still being determined. The bodies of the victims have been taken to Beitbridge District Hospital mortuary for post-mortem, while the injured are receiving treatment at the same hospital, said Commissioner Nyathi.\n\nHe said police are investigating the scene and more details will be released as they become available.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/94e72635-9583-48f8-8835-13d3f6a63004-680x380.jpeg",
            "description": "Sidumisile Mabena POLICE have said 24 people died in a tragic accident on the Masvingo-Beitbridge highway on Thursday at around 8am. In a statement, National Police spokesperson Commissioner Paul Nyathi said an Urban Connect bus carrying 65 passengers had a head on collision with an Auro Transport haulage truck with four occupants, resulting in the […]",
            "time": "21:06",
            "date": "13 Feb 2025"
        },
        {
            "title": "Heavy rains pound Masvingo Province",
            "url": "https://www.herald.co.zw/heavy-rains-pound-masvingo-province/",
            "content": "Wilson Kakurira\n\nThe recent downpours received in parts of Masvingo Province have significantly boosted water levels in Shagashe and Mucheke Rivers.\n\nWhile this is a huge relief for farmers, most bridges across the province are submerged in water.\n\nChimusana Bridge which is across Mucheke River is also submerged, thereby forcing motorists and pedestrians to rely on Mucheke Bridge to travel to and from town.\n\nAll traffic heading to and from Beitbridge is also using the same bridge. This has resulted in a build-up of traffic over the last few days.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/42dd6417-0b18-431e-be83-97f57079be6c-680x380.jpeg",
            "description": "Wilson Kakurira The recent downpours received in parts of Masvingo Province have significantly boosted water levels in Shagashe and Mucheke Rivers. While this is a huge relief for farmers, most bridges across the province are submerged in water. Chimusana Bridge which is across Mucheke River is also submerged, thereby forcing motorists and pedestrians to rely […]",
            "time": "21:06",
            "date": "13 Feb 2025"
        },
        {
            "title": "Bogus agents issue fake licences",
            "url": "https://www.herald.co.zw/bogus-agents-issue-fake-licences/",
            "content": "Trust Freddy\n\nHerald Correspondent\n\nThe Government has warned the public about bogus individuals who are masquerading as its agents to issue fake private security guard licences.\n\nIn a statement, the Ministry of Home Affairs and Cultural Heritage said it does not have any authorised agents to issue such licences.\n\nAccording to the ministry, any individual or entity claiming to offer such services is fraudulent.\n\nIt has come to our attention that some bogus individuals and companies are misleading the public by claiming to be the ministrys agents who can facilitate the issuance of private security guard licences, reads part of the statement.\n\nPlease be informed that the ministry has never engaged any individual or company to act on its behalf in the issuance of those licences. Anyone who purports to be doing so on behalf of the Ministry of Home Affairs and Cultural\n\nHeritage is a fraudster who should be reported to the police so that the law may take its course. Please be guided accordingly.\n\nThe statement reiterated that the responsibility of issuing private security guard licences lies solely with the Ministry of Home Affairs.\n\nThe ministry also reminded security companies to renew their licences annually.\n\nRenewal of licences is currently underway and companies are encouraged to visit the Controller at Mukwati Building, 20th Floor, Corner O.R Tambo and 5th Street in Harare.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/min-680x380.jpg",
            "description": "Trust Freddy Herald Correspondent The Government has warned the public about bogus individuals who are masquerading as its agents to issue fake private security guard licences. In a statement, the Ministry of Home Affairs and Cultural Heritage said it does not have any authorised agents to issue such licences. According to the ministry, any individual […]",
            "time": "21:06",
            "date": "13 Feb 2025"
        },
        {
            "title": "President leaves for AU Summit",
            "url": "https://www.herald.co.zw/president-leaves-for-au-summit-5/",
            "content": "President Mnangagwa, who is also the SADC chairperson, has left the country for Addis Ababa, Ethiopia, where he will join other African leaders for the 38th Ordinary Session of the African Union summit which will tackle political, economic and social issues affecting the continent.\n\nThe President was seen off at Robert Gabriel Mugabe International Airport by Vice Presidents Constantino Chiwenga and Kembo Mohadi,Government Ministers, Service Chiefs and senior Government officials.\n\nAt the sidelines of the summit, President Mnangagwa is also expected to hold bilateral meetings with other leaders aimed at deepening cooperation.\n\nThe summit is running under the Theme, Justice for Africans and People of African Descent Through Reparations.\n\nThis theme was decided on by the Heads of State and Government at the 37th Ordinary Session of the Assembly of the Union held in February 2023 in Addis Ababa, Ethiopia.\n\nAhead of the main weekend summit, the leaders will hold an emergency session on Friday to discuss the violence in DRC, where the M23 armed group has seized parts of the mineral-rich east part of the country.\n\nThis follows a joint summit of eastern and southern African blocs last week which called for a ceasefire.\n\nAngolan President Joao Lourenco, will take over the rotating presidency of the AU at the weekend while a new chairman will be chosen by vote.\n\nIncumbent Moussa Faki Mahamat of Chad, has reached the two-term limit and the trio of Djiboutis Foreign Minister Mahmoud Ali Youssouf, Kenyan Raila Odinga and Madagascars ex-foreign minister Richard Randriamandrato is vying to replace him.\n\nThis time, the position is reserved for an East African.\n\nOur Reporter Garikai Fadzi will be giving us live updates as events unfold in Ethiopia over the next few days.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/92eb2e9c-9fe6-4506-a661-8fc0a65e0bca-680x380.jpeg",
            "description": "President Mnangagwa, who is also the SADC chairperson, has left the country for Addis Ababa, Ethiopia, where he will join other African leaders for the 38th Ordinary Session of the African Union summit which will tackle political, economic and social issues affecting the continent. The President was seen off at Robert Gabriel Mugabe International Airport […]",
            "time": "21:06",
            "date": "13 Feb 2025"
        },
        {
            "title": "Zanu PF conducts cell verification exercise in Harare",
            "url": "https://www.herald.co.zw/zanu-pf-conducts-cell-verification-exercise-in-harare/",
            "content": "Jerry Chifamba\n\nThe ruling Zanu PF party will conduct a cell verification exercise in Harare this weekend.\n\nCde Douglas Mombeshora, a Central Committee member, will lead the exercise.\n\nThe initiative seeks to strengthen the partys cell structure and its grassroots.\n\nSpeaking during a Special Provincial Coordinating Committee meeting at the party headquarters on Wednesday, Zanu PF National Political Commissar Cde Munyaradzi Machacha underscored the importance of a strong membership base.\n\nAs Zanu PF, cells are our foundation. If we have a weak foundation, we will be shaken, he said.\n\nThe verification process, which commenced in Bulawayo, will extend to other provinces by March.\n\nIt seeks to assess current membership and recruit new members, with a particular focus on engaging the youth.\n\nZanu PF Harare Province chairperson, Cde Godwills Masimirembwa said the province has successfully registered over 400 000 members.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/08/Zanu-PF-LOGO.jpg",
            "description": "Jerry Chifamba The ruling Zanu PF party will conduct a cell verification exercise in Harare this weekend. Cde Douglas Mombeshora, a Central Committee member, will lead the exercise. The initiative seeks to strengthen the party’s cell structure and its grassroots. Speaking during a Special Provincial Coordinating Committee meeting at the party headquarters on Wednesday, Zanu […]",
            "time": "21:06",
            "date": "13 Feb 2025"
        },
        {
            "title": "President leaves for AU Summit",
            "url": "https://www.herald.co.zw/president-leaves-for-au-summit-4/",
            "content": "Garikai Fadzi\n\nPresident Mnangagwa, who is also the SADC chairperson, has left the country for Addis Ababa, Ethiopia where he will join other African leaders for the 38th Ordinary Session of the African Union summit which will tackle political, economic and social issues affecting the continent.\n\nThe President was seen off at Robert Gabriel Mugabe International Airport by Vice Presidents Constantino Chiwenga and Kembo Mohadi,Government Ministers, Service Chiefs and senior Government officials.\n\nAt the sidelines of the summit, President Mnangagwa is also expected to hold bilateral meetings with other leaders aimed at deepening cooperation.\n\nThe summit is running under the Theme, Justice for Africans and People of African Descent Through Reparations.\n\nThis theme was decided on by the Heads of State and Government at the 37th Ordinary Session of the Assembly of the Union held in February 2023 in Addis Ababa, Ethiopia.\n\nAhead of the main weekend summit, the leaders will hold an emergency session on Friday to discuss the violence in DRC, where the M23 armed group has seized parts of the mineral-rich east part of the country.\n\nThis follows a joint summit of eastern and southern African blocs last week which called for a ceasefire.\n\nAngolan President Joao Lourenco, will take over the rotating presidency of the AU at the weekend while a new chairman will be chosen by vote.\n\nIncumbent Moussa Faki Mahamat of Chad, has reached the two-term limit and the trio of Djiboutis Foreign Minister Mahmoud Ali Youssouf, Kenyan Raila Odinga and Madagascars ex-foreign minister Richard Randriamandrato is vying to replace him.\n\nThis time, the position is reserved for an East African.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/92eb2e9c-9fe6-4506-a661-8fc0a65e0bca-680x380.jpeg",
            "description": "  Garikai Fadzi President Mnangagwa, who is also the SADC chairperson, has left the country for Addis Ababa, Ethiopia where he will join other African leaders for the 38th Ordinary Session of the African Union summit which will tackle political, economic and social issues affecting the continent. The President was seen off at Robert Gabriel […]",
            "time": "21:06",
            "date": "13 Feb 2025"
        },
        {
            "title": "US$2,7 million robbery haunts suspect",
            "url": "https://www.herald.co.zw/us27-million-robbery-haunts-suspect/",
            "content": "Yeukai Karengezeka\n\nCourt Correspondent\n\nA 33-year-old Murewa man who was last year acquitted in a US$2,7 million armed robbery case involving ZB Bank has returned to court on fresh charges of money laundering.\n\nDennis Madondo now stands accused of using proceeds from criminal activities to purchase a luxury vehicle.\n\nThe trial, which began on Wednesday before regional magistrate Mr Taurai Manuwere, is being prosecuted by Mr Ngoni Kaseke.\n\nMr Kaseke said between January 5 and January 13, 2021, Madondo bought a Mercedes Benz E320 for US$9 000 and was found in possession of US$62 500.\n\nDetectives from CID Homicide arrested Madondo at Chitowa Shopping Centre in Murewa while he was driving the vehicle in question.\n\nAuthorities suspect that the funds were linked to criminal activities.\n\nDuring interrogation, Madondo allegedly failed to provide a satisfactory explanation on the source of the money and car, thereby prompting his arrest.\n\nHowever, in his defence outline through his lawyer, Madondo argued that the fresh charges were a rehash of the armed robbery case he was acquitted of.\n\nHe invoked the legal principle which protects individuals from being tried twice over the same offence.\n\nHe said both the cash and the vehicle were presented as evidence in his prior trial.\n\nMadondo insists that the funds and vehicle were lawfully acquired through his informal business dealings over eight years, including farming, gold trading, and vehicle sales.\n\nThe trial is set to resume today.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/01/84181_generic-wpvi-robbery-IMG.jpeg",
            "description": "Yeukai Karengezeka Court Correspondent A 33-year-old Murewa man who was last year acquitted in a US$2,7 million armed robbery case involving ZB Bank has returned to court on fresh charges of money laundering. Dennis Madondo now stands accused of using proceeds from criminal activities to purchase a luxury vehicle. The trial, which began on Wednesday […]",
            "time": "21:06",
            "date": "13 Feb 2025"
        }
    ]
}