{
    "news": [
        {
            "title": "President in Ethiopia for Summit",
            "url": "https://www.herald.co.zw/president-in-ethiopia-for-summit/",
            "content": "Garikai Fadzi in ADDIS ABABA, Ethiopia\n\nSadc Chairperson, President Mnangagwa, arrived here last night for the 38th Ordinary Session of the African Union and went straight into a series of engagements with senior officials.\n\nHe was received at Bole International Airport by Foreign Affairs and International Trade Minister Professor Amon Murwira, Zimbabwes Permanent Representative to the AU Commission, Sophia Nyamudeza and Ethiopias Minister of Transport and Logistics, Dr Alemu Sime.\n\nThe summit is running under the theme, Justice for Africans and people of African descent through reparations.\n\nThe theme was decided on by the Heads of State and Government at the 37th Ordinary Session of the Assembly of the AU held in February 2023 in Addis Ababa.\n\nThe summit is expected to draw African Heads of State and Government, as well as leaders from international organisations.\n\nProf Murwira, who had earlier attended the 46th Ordinary Session of the AU Executive Council, said this years theme speaks towards Africas long cherished dream of demanding reparations for losses suffered during decades of colonial subjugation.\n\nThe AU aims to define a unified vision for reparations, including financial compensation, formal acknowledgment of past injustices, and policy reforms.\n\nWe believe that this is a very important topic for us, especially us as Zimbabwe after having gone through a gruelling phase of our liberation struggle and facing a lot of adversity in the process.\n\nWe believe that Africa has to talk about that topic, it has to have a position on that topic because it is a just topic for Africa, he said.\n\nProf Murwira said President Mnangagwa had a series of bilateral engagements lined up, especially now that he was the SADC Chairperson.\n\nHis Excellency is the Chairman of the SADC region, and in that capacity, it gives him more responsibilities.\n\nSo, we are looking forward to his coming here and sharing with his colleagues the future plans for Africa, he said.\n\nAhead of the main weekend summit, the leaders will hold an emergency session today to discuss the violence in the DRC, where the M23 armed group has seized large parts of the east of the mineral-rich country.\n\nSADC and the East African Community recently held a joint summit in Tanzania to deliberate on the war in the DRC and called for a cessation of hostilities.\n\nPresident Mnangagwa, in his capacity as SADC Chairperson, and his Kenyan counterpart President William Ruto, the EAC Chairperson, co-chaired the summit held in the Tanzanian capital Dar es Salaam.\n\nAngolan President Joao Lourenco, will take over the rotating presidency of the AU at the weekend while a new AU Commission Chair would be chosen by vote.\n\nIncumbent Mr Moussa Faki Mahamat of Chad, has reached the two-term limit and the trio of Djiboutis Foreign Minister Mahmoud Ali Youssouf, Kenyan politician Raila Odinga and Madagascars ex-foreign minister Mr Richard Randriamandrato is vying to replace him.\n\nIn the spirit of rotation, the AU Commission chairs post is reserved for East Africa.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/HE1-4.jpg",
            "description": "Garikai Fadzi  in ADDIS ABABA, Ethiopia Sadc Chairperson, President Mnangagwa, arrived here last night for the 38th Ordinary Session of the African Union and went straight into a series of engagements with senior officials. He was received at Bole International Airport by Foreign Affairs and International Trade Minister Professor Amon Murwira, Zimbabwe’s Permanent Representative to […]",
            "time": "09:08",
            "date": "14 Feb 2025"
        },
        {
            "title": "State-assisted burial for B/Bridge crash victims",
            "url": "https://www.herald.co.zw/state-assisted-burial-for-b-bridge-crash-victims/",
            "content": "Thupeyo Muleya,Beitbridge Bureau\n\nPresident Mnangagwa has declared the head-on collision which claimed 25 people in Beitbridge yesterday morning a national disaster, with victims set to be accorded State-assisted burials.\n\nThe accident was allegedly caused by the Urban Connect Bus driver who made an overtaking error at the 21km peg north of Beitbridge town in the Tshapfutshe area near the Lutumba tollgate, before colliding head-on with haulage truck.\n\nBoth drivers survived, but sustained critical injuries.\n\nIn a statement yesterday, President Mnangagwa said: The death of fellow Zimbabweans in a head-on collision between an Urban Connect bus and a commercial truck along the Beitbridge-Masvingo highway this morning (yesterday), left me horrified and heartbroken.\n\nFellow Zimbabweans, our nation does not deserve this at all, let alone experiencing such a bloody incident at the beginning of the year. We have to do all that is possible to curb this unjustified loss of life.\n\nThe President appealed to drivers to exercise caution on the roads for the sake of fellow road users and themselves.\n\nAll arms of Government responsible for ensuring safety on the roads have been directed to work around the clock and evoke all legal means and powers available to them to reduce road carnage.\n\nAdded President Mnangagwa: Government has, therefore, declared this incident a national disaster and will accord victims of this horrendous crash State-assisted burial.\n\nAs I express my deepest, heartfelt condolences to families and relatives who have lost their loved ones in this horrific crash, I also heartily and prayerfully reach out to all those injured and hospitalised, wishing them speedy recovery.\n\nBeitbridge district medical officer, Dr Lenos Samhere, said 17 passengers died on the spot while eight others who had sustained head injuries, died upon admission at the Beitbridge District Hospital.\n\nFifty-three others were admitted for medical attention, with 10 of them who were critical, being transferred to Gwanda Provincial Hospital.\n\nAmong the injured are 26 men and 30 women who have varied injuries and are admitted at the hospital, said Dr Samhere.\n\nTragedy struck when the Beitbridge-bound Urban Connect bus collided head-on with a commercial truck travelling to Chirundu, carrying 34 tonnes of magnesium. The injured were rescued by other motorists, the police and other stakeholders working together with the local Civil Protection Committee.\n\nIn a statement yesterday, Urban Connect Bus Company expressed condolences to the grieving families and the nation.\n\nThe company pledged compassionate assistance of US$500 to each grieving family.\n\nAs Urban Connect, we want to express our heartfelt condolences to families and relatives of our fellow Zimbabweans who passed on in the bus accident on Thursday 13 February 2025 near the Lutumba Tollgate along the Masvingo-Beitbridge Highway.\n\nWe wish a speedy recovery to those injured. We will offer compassionate assistance to relatives of the departed and we have started rendering assistance to the injured.\n\nIn addition, we pledge to cooperate with authorities in investigations into this accident, a company representative said.\n\nNational police spokesperson, Commissioner Paul Nyathi, said the bodies of all victims had been taken to Beitbridge District Hospital mortuary for post-mortems.\n\nPolice will release more details when available.\n\nWhen The Herald news crew arrived at the scene yesterday, the police, community members and the Municipality of Beitbridge emergency services were pulling out some bodies trapped in the wreckage of the bus.\n\nA crowd had also formed around the accident scene, with curious residents checking for possible relatives who could have been victims of the fatal accident.\n\nOne of the first people to attend the scene, Mr Thomas Nhundu who works for a funeral parlour and was driving towards Beitbridge, said he, together with other people living close to the highway, retrieved some of the injured from the bus.\n\nThe bus had just overtaken and when we arrived there were bodies all over the tarmac. The injured whom we pulled out of the wreckage were transported to the hospital by the police, other motorists and various Government agencies, said Mr Nhundu.\n\nAnother witness, Mr Leonard Wanderson, a resident of Tshapfutshe said he rushed to the scene after hearing a loud bang near the tollgate.\n\nI had seen the bus passing through our business centre when suddenly I heard a loud bang and I rushed here. Together with other community members, we then started rescuing those who were injured and covering dead bodies with blankets and some clothes that were strewn all over the scene, he said.\n\nMr Wanderson said most of the passengers who were sitting on the front seats were thrown on the tarmac on impact.\n\nFollowing the accident, some panic-stricken residents thronged the hospital to check on their relatives who were reported to have been travelling from Harare.\n\nOthers said they were at the hospital to offer compassion to the bereaved and material support to the hospital.\n\nIn separate interviews, some survivors said they were sleeping by the time of accident, only to wake up on the tarmac and later to hospital.\n\nI was awoken by the large bang and I saw a lot of bodies lying on the road. I became very scared and in a few moments, I was rushed to the hospital where medical staff attended to me and the other injured passengers, said Mr Tinsahe Chingo from Chitungwiza.\n\nMs Tambudzai Mugasa said she became frightened after noticing that the bus was about to collide with the truck.\n\nI just stared at death haplessly and put everything in Gods hands when I noticed that the bus was about to collide with the truck. The next thing, I found myself outside the bus next to several dead bodies, she said.\n\nEnvironmental Management Agency spokesperson, Ms Amkela Sidange, said the magnesium that had spilled on the accident scene was likely to cause minimal effect on the environment.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/accident.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau President Mnangagwa has declared the head-on collision which claimed 25 people in Beitbridge yesterday morning a national disaster, with victims set to be accorded State-assisted burials. The accident was allegedly caused by the Urban Connect Bus driver who made an overtaking error at the 21km peg north of Beitbridge town in the […]",
            "time": "09:08",
            "date": "14 Feb 2025"
        },
        {
            "title": "President appoints two deputy ministers",
            "url": "https://www.herald.co.zw/president-appoints-two-deputy-ministers-2/",
            "content": "Mukudzei Chingwere, Herald Reporter\n\nPresident Mnangagwa has appointed two more members of the National Assembly as Deputy Ministers with immediate effect.\n\nCde Albert Mavunga of Nketa constituency is now a Deputy Minister of Local Government and Public Works responsible for Local Authorities and Traditional Leadership.\n\nCde Caleb Makwiranzou of Mutoko North is now a Deputy Minister of Mines and Mining Development responsible for Oil and Gas Research including other strategic minerals exploration.\n\nChief Secretary to the President and Cabinet Dr Martin Rushwaya made the announcements in two separate statements yesterday.\n\nCde Albert Mavunga\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Cde-Caleb-Makwiranzou.jpg",
            "description": "Mukudzei Chingwere, Herald Reporter President Mnangagwa has appointed two more members of the National Assembly as Deputy Ministers with immediate effect. Cde Albert Mavunga of Nketa constituency is now a Deputy Minister of Local Government and Public Works responsible for Local Authorities and Traditional Leadership. Cde Caleb Makwiranzou of Mutoko North is now a Deputy […]",
            "time": "09:08",
            "date": "14 Feb 2025"
        },
        {
            "title": "Zim economy recovering, says IMF",
            "url": "https://www.herald.co.zw/zim-economy-recovering-says-imf/",
            "content": "Business Reporter\n\nThe International Monetary Fund (IMF) has said Zimbabwes economy has started recovering from the effects of the El Nio-induced drought, amid growing stability anchored by the central banks tight monetary policy stance.\n\nThis comes after an IMF team, led by Mr Wojciech Maliszewski, which conducted a staff mission to Harare from January 30 to February 13, 2025, concluded engagements with Government officials and key stakeholders on Zimbabwes Staff Monitored Programme (SMP).\n\nMr Maliszewski, in a statement after the mission, said Zimbabwes economic growth slowed from 5,3 percent to an estimated 2 percent in 2024, after the drought lowered agricultural output by 15 percent.\n\nThis was compounded by reduced electricity production and declining prices for key mineral exports such as platinum and lithium.\n\nThat said, strong remittances continued supporting activity in domestic trade, services, and construction and improved the current account surplus to an estimated US$500 million, which is 1,4 percent of GDP in 2024, he said.\n\nFinance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube projected in the 2025 National Budget that the economy will grow by 6 percent this year, driven by normal to above-normal rainfall, which will boost agricultural output.\n\nThe minister is optimistic about the countrys economic prospects, saying it can also capitalise on emerging energy minerals to sustain economic momentum, and he emphasised the importance of maintaining the tight monetary stance, which has yielded positive results in supporting the value of the ZiG and ensuring fiscal discipline with controlled budget deficits.\n\nThe IMF noted that the ZiG willing-buyer willing-seller (WBWS) exchange rate was stable since the currencys introduction in April 2024, with the local currency monthly inflation averaging 2,3 percent until September, 2024 when the currency weakened substantially following its devaluation by the central bank.\n\nThe devaluation was designed to correct price distortions arising from formal and open market exchange rate disparities.\n\nRelative stability returned with the tightening of monetary policy since September, and the WBWS and parallel market exchange rates have stabilised, and the gap between these rates has narrowed, said Mr Maliszewski.\n\nZimbabwe is also maintaining a tight fiscal policy thrust, limiting unnecessary public spending and expanding the fiscal base to control inflation and stabilise the local currency.\n\nThe Reserve Bank of Zimbabwe (RBZ) has also reaffirmed its commitment to a tight monetary stance, maintaining the bank policy rate at 35 percent and statutory reserve ratios at 30 percent and 15 percent for current accounts and savings as well as time deposits, respectively, across both ZiG and US dollar holdings.\n\nMeanwhile, the IMF said fiscal pressures intensified owing, in large part, to the transfer of the RBZs quasi-fiscal operations to the Treasury. Mr Maliszewski said strong revenue collection helped limit the 2024 budget deficit to an estimated 1 percent of GDP, but fiscal pressures resulted in an accumulation of domestic expenditure arrears, leading to the Government implementing emergency spending cuts.\n\nGoing forward, growth in 2025 is projected to increase to 6 percent, with the recovery in agriculture output due to better climate conditions and the projected improvement in the terms of trade.\n\nAgainst this background, the Zimbabwe authorities had requested an SMP to support their efforts to stabilise the economy and re-engage with the international community on the arrears clearance and debt resolution process.\n\nThe main objective of the SMP would be to durably anchor macroeconomic stability, building on policy recommendations from the 2024 Article IV consultation, he said.\n\nThe IMF official added that building on the progress achieved during the mission on the ongoing SMP discussions, the funds staff would continue working closely with the authorities on defining the key parameters and modalities of the programme.\n\nMr Maliszewski said discussions included adjusting the fiscal position to avoid recourse to monetary financing and new arrears and building foundations for a durable fiscal consolidation, fiscal risks residing off-budget, including from the operations of the Mutapa Investment Fund.\n\nFocus will also be on the effectiveness of the monetary policy framework for the ZiG and reforms to strengthen economic governance.\n\nInternational re-engagement remains critical for debt resolution and arrears clearance, which would open the door for access to external financing.\n\nThe authorities re-engagement efforts, through the Structured Dialogue Platform (SDP), are key for attaining debt sustainability and gaining access to concessional financial support.\n\nIn this context, the SMP will help in enhancing policy credibility and advancing the reform agenda embedded in the SDP, said Mr Maliszewski.\n\nIn December 2022, the Government launched SDP for dialogue on arrears clearance, as the countrys debt has been constraining its ability to pursue development initiatives.\n\nImplementation of the debt reforms is being spearheaded by the sector working groups (SWG) task of focusing discussions on the Governments implementation of reforms under the three key strategic pillars.\n\nThese include economic growth and stability reforms; governance reforms and land tenure reforms; compensation for former farm owners (FFOs); and the resolution of Bilateral Investment Protection and Promotion Agreements (BIPPAs). The African Development Bank (AfDB) president, Dr Akinwumi Adesina, was appointed by President Mnangagwa in 2023 to be the champion of Zimbabwes debt resolution process, while former Mozambique President, Joaquim Chissano, was designated high-level facilitator.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/06/Mr-Wojciech-Maliszewski.jpg",
            "description": "Business Reporter The International Monetary Fund (IMF) has said Zimbabwe’s economy has started recovering from the effects of the El Niño-induced drought, amid growing stability anchored by the central bank’s tight monetary policy stance. This comes after an IMF team, led by Mr Wojciech Maliszewski, which conducted a staff mission to Harare from January 30 […]",
            "time": "09:08",
            "date": "14 Feb 2025"
        },
        {
            "title": "Modern technologies transform mining landscape: VP Mohadi",
            "url": "https://www.herald.co.zw/modern-technologies-transform-mining-landscape-vp-mohadi/",
            "content": "Blessings Chidakwa and Victor Maphosa\n\nVice President Kembo Mohadi yesterday called on mining firms to continue embracing modern technologies and practices to improve efficiency and sustainability.\n\nSpeaking during a tour of Prospect Lithium Zimbabwe in Goromonzi, VP Mohadi said Government applauds the efforts being made towards leapfrogging Zimbabwe to an empowered upper-middle-income society by 2030.\n\nI am pleased to note the massive infrastructural development at this place, which I witnessed during the tour, he said.\n\nThe Government welcomes the modern mining technologies and practices brought about by Prospect Lithium Zimbabwe into the country. These include more efficient extraction methods, improved ore processing techniques as well as advanced safety protocols. We must leverage these advancements to improve overall efficiency and sustainability in the whole mining sector.\n\nVP Mohadi said Government was alive and mindful of the many benefits and contributions that the mining industry contributes to the economy such as an increase in the Gross Domestic Product and employment opportunities.\n\nIt, therefore, comes as no surprise that Prospect Lithium Zimbabwe has created jobs in Mashonaland East Province, employing close to 2 000 young men and women from surrounding rural communities, he said.\n\nThrough President Mnangagwas mantra that Zimbabwe is open for business, the country has witnessed a surge in foreign direct investment, said VP Mohadi. The investment by Chinas Huayou Cobalt into Zimbabwes mining sector through Prospect Lithium Zimbabwe, added VP Mohadi, is one of the fruits of the Presidents visionary leadership.\n\nChinese investment in lithium mining has increased mining output for Zimbabwe, making the country a significant player in the global lithium market, he said.\n\nVP Mohadi also lauded Prospect Lithium Zimbabwe for its social corporate responsibility.\n\nI am told that PLZ is constructing roads in the district, especially the highway that connects the whole district from Majuru Shopping Centre.\n\nThese are vital infrastructure projects which improve the transport network system that benefits the whole community, he said.\n\nSince its inception two and a half years ago, the company has invested over US$3 million into corporate social responsibility projects, which include community health interventions, the construction of classroom blocks, and the provision of furniture and books to six schools surrounding the mine. For that, I commend PLZ.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/VP-1.jpg",
            "description": "Blessings Chidakwa and Victor Maphosa Vice President Kembo Mohadi yesterday called on mining firms to continue embracing modern technologies and practices to improve efficiency and sustainability. Speaking during a tour of Prospect Lithium Zimbabwe in Goromonzi, VP Mohadi said Government applauds the efforts being made towards leapfrogging Zimbabwe to an empowered upper-middle-income society by 2030. […]",
            "time": "09:08",
            "date": "14 Feb 2025"
        },
        {
            "title": "First Lady takes medical outreach to Masvingo",
            "url": "https://www.herald.co.zw/first-lady-takes-medical-outreach-to-masvingo/",
            "content": "Tendai Rupapa in MASVINGO\n\nHEALTH Ambassador First Lady Dr Auxillia Mnangagwa yesterday rolled out free prostrate cancer, breast cancer and cervical cancer checks among a host of other health services for thousands of people from Masvingo Province under her medical outreach programme as she leads the fight against non-communicable diseases which are afflicting and claiming millions of lives across the globe.\n\nNon-communicable diseases are diseases that are not spread through infection or through other people, but are typically caused by unhealthy behaviours. They are the leading cause of death worldwide and present a huge threat to health and development, particularly in low- and middle-income countries.\n\nWith the assistance of practitioners from the Ministry of Health and child Care, the First Lady availed her fully-equipped Angel of Hope Foundations mobile hospital and mobile clinic to ensure beneficiaries were screened for cancers, hypertension, diabetes, HIV and provided with family planning services.\n\nAlso catered for were minor ailments like flu, headaches and stomach aches.\n\nThere were other supporting tents serving people.\n\nThe mother of the nation also held an interactive session with members of the community tackling social issues like domestic violence, drug and substance abuse as well as the need for schoolchildren to focus on their studies.\n\nElderly men carry home the food hampers they received from Angel of Hope Foundation patron First Lady Dr Auxillia Mnangagwa in Masvingo yesterday\n\nShe counselled married couples to observe peace at all times.\n\nI urge couples to live in peace and harmony and shun domestic violence. To those in the homes and are newly married, how are you faring, she asked.\n\nA young couple said all was well.\n\nAmai, we got married last year and we are getting along well without violence, the young man said as he commended his wife for being a good partner.\n\nAmai, I am head over heels in love with your daughter-in-law and she loves me too. She is well-cultured, dignified and God-fearing. I am smart because I am being looked after. I do not bath with the phone near me because I have nothing to hide. We listen to your advice and warnings against domestic violence, he said. Another young daughter-in-law said she got married in 2022.\n\nAsked as to whether they were tested before staying together, she quipped: Yes and even up to this day we regularly get tested and we are living in peace. Its been three years, but your son-in-law has never laid his hand on me. We are still in our honeymoon phase and I dont see it ending anytime soon.\n\nComing barely a week after a similar arrangement in Gokwe, the Masvingo medical outreach was oversubscribed because as early as 8am, people from all the districts of Masvingo had started queuing to be served to by health personnel.\n\nFirst Lady Dr Auxillia Mnangagwa assists an elderly woman to carry the mealie meal and food hamper she gave the elderly in Masvingo yesterday\n\nDr Mnangagwa urged beneficiaries to visit all tents where health services were being offered so that they were tested and know where they stand.\n\nMakadii vana mai nana baba, vakomana nevasikana. I am happy nekuuya kwamaita kuti muongororwe hutano. I urge you to visit all stations besides cancer screening stations, which are dealing with headaches, diabetes hypertension, HIV and other ailments. Today and tomorrow we will be focusing on health. Do not get used to waking up with pain and saying today I am better without visiting health centres. Get checked and know were you stand health wise. Good health defines an individual. You have to be healthy so that you look after the family. Vanamai, everything about life is centred on women and your health is important, she said.\n\nAs patron of the environment, Dr Mnangagwa started by leading in tree planting.\n\nThe elderly and those with disabilities were given food hampers while schoolchildren received stationery plus sanitary pads for girls.\n\nExpecting mothers were handed baby preparation kits.\n\nIn addition, Amai Mnangagwa donated tonnes of rice and mealie-meal to the communities.\n\nAs Agric4She patron, the mother of the nation handed over inputs that include sunflower seeds, velvet bean seed, cow peas seeds, sunflower seeds, sweet potatoes, pesticides and knapsack sprayers to women.\n\nOne of the elderly beneficiaries of the food hampers shed tears saying the First Ladys love was so deep, such that it drove her to tears.\n\nAgric4She patron First Lady Dr Auxillia Mnangagwa hands over knapsack sprayers, chemicals and inputs to one of the elderly women in Masvingo yesterday\n\nIn her remarks, Dr Mnangagwa underscored the benefits of regular health checks and importance of being on treatment.\n\nI have come here with happiness, I came here on Tuesday because was filled with the joy of being with you. Last week I was in Gokwe with the same medical outreach programme and today I have brought the same here so that you may be checked and know where you stand in terms of health. I am grateful that you came out in huge numbers.\n\nHere in Masvingo, the rains are pouring, I saw rivers flowing therefore lets beware of being swept away. Do not cross flooded rivers. We also have to monitor our livestock and our children. I always come here with many programmes and today I have brought a medical outreach programme. Let us follow the advice of health personnel so that we may heal. Cancer is wreaking havoc, but when detected early it can be cured. Let us consume nutritious food like traditional dishes so that when given medication, it is helped by healthy food and we heal fast, she said.\n\nThe First Lady implored the community to take advantage of the programme so that they get checked free of charge.\n\nI thank my children from the health sector here present who have come to cure us and let us utilise these services. To men out there, it is my encouragement that we regularly have health checks. Here I encourage you to be checked for prostate cancer because cancer is a silent killer. Do not leave without being checked from children right up to adults. We want all those found to be affected to be commenced on treatment early. I have brought the mobile hospital and clinic so that you may be examined, she said. Dr Mnangagwa had words of advice for schoolchildren.\n\nI am pained seeing learners rushing into marriage, leaving their education midway. Every girl must look after herself properly and the same applies to boys. Do not impregnate the girls before the time is ripe because sexual relations expose you to various health challenges.\n\nStay away from drugs, be friends with your studies so that you succeed and have a brighter future. To parents lets keep an eye on our children analysing how they move and ensure they leave bad manners. They need parental guidance. These children are the future, she said.\n\nAngel of Hope Foundation patron First Lady Dr Auxillia Mnangagwa interacts with women queued for cervical and breast cancer screening from her mobile hospitals in Masvingo yesterday\n\nAccording to health experts, the First Lady said, some cancers are linked to HIV hence the need for people to know where they stand.\n\nThat is why I brought in the National Aids Council for HIV/Aids testing and counselling. Girls it is also necessary to be vaccinated for Human papillomavirus (HPV) which affects young people. When getting married, I encourage you to be tested for HIV before sleeping together.\n\nThose who dread visiting hospitals trade witchcraft accusations with others saying they are being bewitched yet the disease will be curable. Lets utilise our health centres around our communities, she said.\n\nAmai urged women to dress in a dignified way, adding that some grown up women were dressing improperly. She urged them to be role models to the younger generation.\n\nI have brought zvishoma zvandauya nazvo for you. I have brought tonnes of rice and maize-meal for everyone. I also brought inputs, I also came with food hampers for the elderly and those with disabilities. Pregnant women I have brought you baby preparation kits.\n\nTo learners, I want you to stay in school. I have brought you stationery and sanitary pads. I do not want you to absent yourselves from school, she said.\n\nSenator Ottillia Maluleke gave her testimony as a cancer survivor.\n\nI was treated in 2017. Thank you Amai for coming to encourage your children to be screened for cancer and get treatment. You have brought us hospitals to our doorsteps so that we survive. I thank you for teaching us as your children, he said.\n\nSo pleased with the medical outreach were the people of Masvingo that they expressed gratitude to the First Lady for valuing peoples health.\n\nFirst Lady Dr Auxillia Mnangagwa hands over new born baby preparation kits to expecting mothers in Masvingo yesterday\n\nMr Shingirai Mukwerena describe the programme as well-thought-out.\n\nThe First Lady really takes her time in planning programmes that benefit the majority of the people. Her medical outreach will help improve the health of the people since most of them thought health checks were for the affluent.\n\nEveryone needs proper health checks and management and this is what the First Lady is doing and I thank her greatly for that, he said.\n\nThe sentiments dovetailed with those of Mrs Shylet Shonhiwa (72).\n\nSince birth 72 years ago, I had never undergone any health check due to lack of knowledge. Today I feel greatly empowered by our loving and caring mother who has told us the benefits of being screened for cancer and tested for other ailments.\n\nThis helps us fight ill-health and plan for our families without hindrance. I really thank the mother of the nation for her great contribution towards the improvement in health management for vulnerable people like us, she said with a broad smile.\n\nGracious Nakaniso, who is expecting her second child, thanked the First Lady for giving her baby preparation set.\n\nMy coming here for this great programme has been worth the while because I have been given a food hamper and a baby preparation set which showed our mothers love and gave me a deeper sense of belonging. Our mother is doing great things for the people of Zimbabwe and may God grant her a long life filled with blessings, she said.\n\nWomen queue for free cervical and breast cancer screening from Angel of Hope Foundation mobile hospitals and were also checked for other ailments during a free medical outreach by Angel of Hope Foundation patron First Lady Dr Auxillia Mnangagwa in Masvingo yesterday\n\nSekuru Charles Manjeya said he was grateful for being tested and commenced on hypertension tablets.\n\nAll along I was suffering from headache oblivious to the fact that I had hypertension. Today I was lucky to be checked and was commenced on treatment which therefore gives me relief and ensures I can work for myself and my family. I am thankful to the First Lady for this medical outreach, he said.\n\nAn elderly lady wept uncontrollably after being given a food hamper and farming inputs.\n\nGod has remembered me today. I was going hungry together with my orphaned grandchildren and now I have been saved. The love we are getting from the First Lady is too deep and driving us to tears, she said.\n\nMasvingo Provincial Affairs and Devolution Minister Hon Ezra Chadzamira the First Ladys philanthropic work .\n\nYour being here today is not only an inspiration, but also proof of the importance you attach to improving the well-being and quality of life of the people of Zimbabwe. Your unwavering dedication to universal health, courage and wellness continues to shine as a bright light in our communities. On behalf of the province and indeed on my own behalf and that of the communities before you, Amai we are truly honoured to have you as our mother, providing guidance and support to us.\n\nIndeed, you are an all-encompassing icon leaving a lasting legacy of caring and ensuring the welfare of the vulnerable. We thank you VaMamoyo. We thank you so much. We gather with joy, not just as individuals, but as a united family community rallying behind you towards raising awareness and taking protective steps in the fight against cancer and other health-related challenges.\n\nThese are affecting many lives, families and communities. In addition, todays programme compliments the national health strategy 2021-2025 on health and well-being and United Nations Sustainable Development Goal Number 3 on good health and wellbeing.\n\nThese are the critical programmes being passionately pursued by the Second Republic under the able, astute and visionary leadership of President Mnangagwa, he said.\n\nCelebrated comedian Sabhuku Vharazipi and his crew raised awareness on the importance of getting regular health checks through a play.\n\nFirst Lady Dr Auxillia Mnangagwa comforts Gogo Eunice Mazanhi who shed tears of joy in appreciation of the food hampers she gave her. Gogo Mazanhi is taking care of her orphaned grandchildren and she said the food hamper came at the right time.  Pictures: John Manzongo\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/FL1-4.jpg",
            "description": "Tendai Rupapa in MASVINGO HEALTH Ambassador First Lady Dr Auxillia Mnangagwa yesterday rolled out free prostrate cancer, breast cancer and cervical cancer checks among a host of other health services for thousands of people from Masvingo Province under her medical outreach programme as she leads the fight against non-communicable diseases which are afflicting and claiming […]",
            "time": "09:08",
            "date": "14 Feb 2025"
        },
        {
            "title": "EDITORIAL COMMENT: Police need to be tough on the vehicles lacking number plates",
            "url": "https://www.herald.co.zw/editorial-comment-police-need-to-be-tough-on-the-vehicles-lacking-number-plates/",
            "content": "The police have once again warned that they are looking out for vehicles not fitted with number plates and that these vehicles will be impounded.\n\nThis warning has been given in the past, with little effect. This time the police need to carry it through and the vehicles need to be impounded until the owner or approved agent turns up with the registration sheet for the vehicle, plus currency insurance and current licence, plus a set of number plates that can be fitted then there.\n\nNumber plates are no longer in short supply since the University of Zimbabwe started manufacturing them in a secured business innovation. Since legal changes a few years back, new owners can take over the old number plates when they buy a car inside Zimbabwe.\n\nSo a car without plates is an import, and it is quite likely that the required taxes have not been paid to Zimra and the necessary procedures then followed to get the vehicle registered and licensed. This well-founded suspicion of unpaid taxes probably gives the police more than enough legal authority to hang onto the vehicle. They do not have to rely totally on the road traffic laws.\n\nSystems were put in place to allow vehicles to be registered after being cleared at a border post, with the temporary plates that were once popular and significantly abused phased out. If there is still some loophole at border posts this needs to be closed, so that a vehicle cannot be driven away from a border post, or from very near a border post, without being totally compliant on taxes, registration, insurance, licensing and plates.\n\nThe first tollgate from the border post should have the extra function of making sure that the vehicle is legally in the clear.\n\nThe need for all vehicles to have proper legal number plates is not just to ensure that every vehicle can be identified on the road by police and other law enforcement. It allows ordinary people to be able to make a complaint, or given police vital information in the case of many crimes, from hit-and-run accidents onwards.\n\nWe can also use modern technology to make going through a barrier, such as the boom as a tollgate, much simpler. Several countries have systems that see vehicle owners or drivers keeping a positive balance in a prepaid float, and when they come up to a tollgate a scanner reads their plate, the software deducts the toll fee, and the boom opens, without the driver even having to stop although they do have to drive slowly.\n\nIt is fairly easy to have on multiple lanes at a tollgate, having a reserved lane for those using this system so they do not have to queue and pay at the toll window but can just drive through without even coming into contact with a human member of staff.\n\nSimilar systems have been introduced at car parks in some cities and countries and there are other opportunities to make life much easier for the compliant.\n\nAlready tollgate receipts record whether the vehicle has an up-to-date licence, with a one month grace period allowed. After your licence has expired for more than a month, you simply cannot go through a tollgate, so the scanning technology is already in use.\n\nA lot of people still try and assume that paying taxes is voluntary. A vehicle licence with its radio adjunct can be thought legally as a tax, just as the vehicle import duties and the registration fee are also legally taxes. Everyone needs to understand that paying taxes is not voluntary. We are now at the start of the process of getting the informal sector to understand that taxation is compulsory and this goes for vehicles as well.\n\nWe have in the past pressed the police to look at more automatic enforcement of laws, with those automatic speed readers being one of the ways that can be used to put technology to work to give the police far more coverage in their law enforcement.\n\nWe note that this technology does require a readable number plate to identify the speeding vehicle, which is another good reason for making sure all vehicles have number plates. To check on this, and the basic cleanliness that is needed to make plates readable, we could easily have the scanners and booms that should be a tollgates at automatic roadblocks, perhaps close to the automatic speedtraps.\n\nThe non-speeding vehicles with readable number plates simply go through as the boom lifts, while the speeders and the those with dirty plates have to turn off for tickets and fines and any other action seen as legal and appropriate. Such checking software could even decide on the red-on-white plates needed by buses and kombis whether these are compliant with the additional licensing requirements for public service vehicles.\n\nThe small cost of the extra technology will be more than recovered from the fines, or better still from the lack of money spent on health care for the injured since there will be fewer of these. A bonus is that it is impossible to bribe a computer, so the problem of potential corruption is automatically eliminated.\n\nMeanwhile, let us this time round make sure that the plateless vehicles are impounded until the plates turn up and that those who feel they do not need number plates to drive around start understanding that this is not the option. The options are to register and get the plates, or walk.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/NP.jpg",
            "description": "The police have once again warned that they are looking out for vehicles not fitted with number plates and that these vehicles will be impounded. This warning has been given in the past, with little effect. This time the police need to carry it through and the vehicles need to be impounded until the owner […]",
            "time": "09:08",
            "date": "14 Feb 2025"
        },
        {
            "title": "Zim seeks US$950m in new  bid to kick-start mining firm",
            "url": "https://www.herald.co.zw/zim-seeks-us950m-in-new-bid-to-kick-start-mining-firm/",
            "content": "Zimbabwes state miner is planning a fresh bid to kick-start a range of projects a year after the Government took full control of the company.\n\nKuvimba Mining House, under new ehief executive officer Trevor Barnard, is looking to development banks, mining companies and traders to raise US$950 million to develop lithium, platinum and gold assets, he said in an interview.\n\nAccess to all the large development banks, to all the funding, to all the major traders has just opened up, said Barnard, without identifying the potential financiers.\n\nThe change in the ownership structure has been really a very good move for Kuvimba.\n\nEarlier attempts to hold an initial public offering and form a venture with Russian investors were abandoned.\n\nMore than half of the amount the company plans to raise will go toward a building an underground platinum mine at the long-delayed Darwendale project, according to Barnard, who took up his post in December.\n\nA lithium project the company estimates will cost as much as US$275 million may be quicker to develop, he said.\n\nThe company has agreed a lithium joint venture with Chinese mining firms, and will finalise the deal by March before proceeding to build the first phase of the project known as Sandawana.\n\nIt will take about 15 months after signing to start production that will ultimately reach 500 000 tonnes of lithium concentrate per annum, Barnard said.\n\nThe Chinese partners will finance the project and transfer it back to Kuvimba once the loan is repaid, a process he estimated would take less than five years.\n\nKuvimba also plans to develop a second area at Sandawana.\n\nMr Barnard said the company has already received interest from potential investors, including Cluff Africa Ltd. and a major European commodity trader that he declined to name. Other Chinese investors are also keen, he said, adding Kuvimba may sign a deal within six to 12 months.\n\nCluff didnt immediately respond to an emailed request for comment.\n\nAt the Darwendale platinum deposit, the company initially plans to develop a smaller open-pit mine this year that will cost about $50 million to dig.\n\nIt will pay another mining company to process that ore, according to Mr Barnard.\n\nKuvimba is in talks with development banks for loans to finance the bigger, underground project and processing facilities, he said, without giving more detail. The targeted start date is within three years.\n\nZimbabwe holds the worlds second-biggest platinum reserves after South Africa and is Africas biggest lithium producer.\n\nKuvimba is now 70 percent-owned by the state sovereign wealth fund known as Mutapa Investment Fund, with entities held by the finance ministry, including state pension funds, power utilities and a deposit insurance fund, holding the rest, Barnard said.  Bloomberg.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/DFBDFB-680x380.jpg",
            "description": "Zimbabwe’s state miner is planning a fresh bid to kick-start a range of projects a year after the Government took full control of the company. Kuvimba Mining House, under new ehief executive officer Trevor Barnard, is looking to development banks, mining companies and traders to raise US$950 million to develop lithium, platinum and gold assets, […]",
            "time": "09:08",
            "date": "14 Feb 2025"
        },
        {
            "title": "Meet Dr Kanyepi, Zimbabwe’s first female heart surgeon",
            "url": "https://www.herald.co.zw/meet-dr-kanyepi-zimbabwes-first-female-heart-surgeon/",
            "content": "Phyllis Kachere and Donald Mujiri\n\nIn the intricate world of cardiothoracic surgery, a field renowned for its complexity and often dominated by men, Dr Kudzai Kanyepi has emerged as a beacon of hope and inspiration.\n\nAs Zimbabwes first female cardiothoracic surgeon, and the 12th to qualify in Africa, her journey from a curious medical student to a pioneering specialist is a captivating tale of resilience, determination, and the relentless pursuit of excellence.\n\nZimbabwe has only five cardiothoracic surgeons; four of them being men.\n\nDr Kanyepis ascent is not just a personal victory; it represents a significant breakthrough for women in medicine across Africa, where the surgical landscape remains largely male-dominated.\n\nHer groundbreaking career as a heart and lung surgeon is a testament to her unwavering commitment to bettering healthcare and empowering future generations of female doctors. She stands as a proud symbol of what is possible when barriers are shattered and dreams are pursued.\n\nShe was part of a group of surgeons who successfully performed open heart surgery on 12 people at Parirenyatwa Group of Hospitals.\n\nNot only do I mend broken hearts physically, as a cardiothoracic surgeon, I also perform surgery on the lungs and the aesophagus. Congenital heart, chuckled Dr Kanyepi.\n\nIn an interview, she said medicine was not her choice.\n\nAfter A level, I had four subjects and could have become anything. My mother wanted me to be a medical doctor but I went to the National University of Science and Technology in Bulawayo, intending to study electrical engineering.\n\nBy some stroke of misfortune, they said their electrical engineering class was full and they recommended that I take up the medicine class. I reluctantly did so, but soon found myself back in Harare because I missed home. I then continued with my studies at the University of Zimbabwe, she said.\n\nQUEEN OF HEARTS . . . Dr Kudzai Kanyepi\n\nOnce enrolled in medicine she realized she had a profound fascination with science and a deep-seated desire for surgery, but was not sure in which field.\n\nFrom the outset of her studies, she said she was drawn to the operating room, captivated by the precision and technical prowess required in surgery  an arena where the potential for life-saving impact aligned seamlessly with her passion.\n\nI knew I wanted to be a surgeon once I enrolled to study medicine, she recalls, her eyes sparkling with nostalgia. But as I progressed in my studies, I became increasingly drawn to the complexities of cardiothoracic surgery. Its a field where you can change lives, offering patients a second chance through intricate procedures that are vital for life.\n\nHer academic journey took her from the University of Zimbabwe to South Africa, where she specialised in cardiothoracic surgery and met Dr Lindiwe Sidali, the first female black cardiothoracic surgeon. The rigorous training was merely the beginning; the real challenges awaited her in a field that had often been unwelcoming to women.\n\nCardiothoracic surgery is one of the most demanding disciplines in medicine, requiring not only technical skill, but also the ability to operate under tremendous pressure. For years, females were few and far between in this arena, and Dr Kanyepi was determined to defy the odds.\n\nInitially, she faced scepticism from some male colleagues who doubted her capabilities. Yet, rather than allowing this to deter her, Dr Kanyepi channelled her energy into hard work and focus. I encountered scepticism, especially from some male colleagues, she admits. But I didnt let this discourage me. I worked harder, stayed focused, and pushed forward. I knew I had the skills and the passion to succeed.\n\nHer persistence bore fruit. During her training in South Africa, she gained invaluable hands-on experience in the operating room, gradually earning the respect of her mentors and peers. It was never easy, but I always felt capable, she reflects. If I kept proving myself in the operating theatre, I would earn my place. My passion for this field kept me going, knowing that I could help those in need, particularly in my home country.\n\nToday, Dr Kanyepi practices at the Parirenyatwa Group of Hospitals in Harare, one of Zimbabwes largest referral hospitals.\n\nHere, she performs intricate procedures, including heart bypass surgeries, valve replacements, and operations for congenital heart defects.\n\nEach procedure she undertakes carries the weight of hope and the promise of a new lease on life for her patients.\n\nThe work we do here at Parirenyatwa is transformative, she explains, her voice imbued with a sense of purpose. As a cardiothoracic surgeon, I have the ability to change the course of a persons life with a single procedure. Knowing that my work can directly affect the health outcomes of my patients is both a huge responsibility and a great privilege.\n\nBut Dr Kanyepis influence extends far beyond the operating room. She is a leading educator and mentor, firmly committed to training young doctors, especially women, interested in surgery. Her passion for mentorship shines through in her interactions with aspiring surgeons.\n\nMentoring young women in the medical field is something I am deeply passionate about, she asserts. Women are under-represented in surgery, but they bring a unique set of skills and perspectives to the profession. Its crucial to create an environment where young women feel empowered to pursue their dreams in medicine.\n\nDr Kanyepis impact is felt not only in the lives of her patients but also in the hearts of those she mentors. She invests time and energy in providing guidance, support, and encouragement, ensuring that the next generation of medical professionals has the tools they need to succeed. Her belief in their potential resonates with many young women who see her as a role model.\n\nDr Kanyepi is a staunch advocate for healthcare equity, tirelessly working to address the disparities in healthcare access, particularly in Zimbabwes underserved regions. Cardiovascular diseases remain one of the leading causes of death in the country, and many patients face significant delays in receiving necessary treatment.\n\nIve seen many patients who have waited for months or even years for the surgeries they need, she reflects, a note of sorrow in her voice. These delays are heartbreaking, and thats why Im dedicated to raising awareness of heart disease and advocating for improved healthcare resources.\n\nIn addition to clinical work, Dr Kanyepi actively participates in public health education campaigns and screenings aimed at preventing heart disease and increasing early detection.\n\nShe is particularly committed to educating communities about the importance of maintaining a healthy lifestyle and the necessity of regular check-ups. Prevention is key, she asserts. We need to empower individuals to take responsibility for their health and seek medical attention before a problem becomes life-threatening.\n\nDr Kanyepi understands the weight of her role  not just as a practitioner, but as a mentor and advocate. She has made it her mission to provide young women with the encouragement and belief that they, too, can succeed in medicine.\n\nThere are still many barriers that women face in healthcare, she says with conviction.\n\nBut we have the power to change that. Through mentorship, training, and creating opportunities for women to enter the field, we can make healthcare more inclusive and diverse.\n\nDr Kanyepis career is still in its early stages, yet her vision for Zimbabwes healthcare system remains ambitious. She continues to strive for excellence in her practice while hoping to contribute significantly to improving heart disease treatment in Zimbabwe and beyond.\n\nI am proud of how far Ive come, she reflects, but I am constantly reminded that there is so much more to be done. My goal is to continue raising awareness of heart disease, improving treatment, and inspiring the next generation of medical professionals.\n\nHer ground-breaking achievements not only redefine the boundaries of what women can accomplish in surgery, but also position her as a key player in shaping the future of Zimbabwes healthcare.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Kanyepi.jpg",
            "description": "Phyllis Kachere and Donald Mujiri In the intricate world of cardiothoracic surgery, a field renowned for its complexity and often dominated by men, Dr Kudzai Kanyepi has emerged as a beacon of hope and inspiration. As Zimbabwe’s first female cardiothoracic surgeon, and the 12th to qualify in Africa, her journey from a curious medical student […]",
            "time": "09:08",
            "date": "14 Feb 2025"
        },
        {
            "title": "The changing face of  Zim’s retail sector",
            "url": "https://www.herald.co.zw/the-changing-face-of-zims-retail-sector/",
            "content": "Kundai Marunya, Correspondent\n\nTHE recent wave of big retail outlets closing or scaling down operations in Zimbabwe has sparked concern among consumers and economic analysts.\n\nHowever, a closer look at the situation reveals that these closures do not necessarily indicate a worsening economy, but rather a shift in business models.\n\nLarge retail chains, once dominant in the sector, are struggling to adapt to an environment now dominated by small to medium enterprises (SMEs) and tuckshops, which are proving to be more elastic and responsive to consumer needs.\n\nThe recent closure of several outlets under the N. Richards Group, coupled with Spar Zimbabwes painful decision to shut down Queensdale Spar, Choppies Zimbabwes exit from the market, and Mahommed Mussas significant reduction of shop space by 60 percent highlights the growing crisis, said Confederation of Zimbabwe Retailers (CZR) president Denford Mutashu. the growing levels of informalisation have led to a significant loss of market share for formal businesses.\n\nOver the past few years, the retail industry in Zimbabwe has seen a shift from large supermarket chains and hypermarkets towards smaller, independently owned businesses.\n\nThis trend is evident in the closure of several big retailers, some of which had been household names for decades. However, instead of leaving behind vacant buildings and declining commerce, these closures have paved the way for a surge in new businesses.\n\nA prime example is the transformation of the former Jaggers Msasa, a retail giant that eventually shut down. Its premises were left vacant for just a short time, as TM Pick n Pay swiftly moved in and successfully adapted to the changing market.\n\nSimilarly, Choppies in Ruwa recently closed its doors, but the premises were quickly taken over by Gain Cash & Carry. This pattern demonstrates that the retail sector is not collapsing but rather evolving, with new players entering the market and succeeding where previous ones struggled.\n\nOne of the biggest challenges for traditional retail chains in Zimbabwe has been the rise of SMEs and tuckshops. These smaller businesses, often run by indigenous entrepreneurs, have become the preferred choice for thousands of consumers.\n\nUnlike large retailers that have high operating costs, strict corporate structures and rigid pricing models, SMEs are flexible, allowing them to quickly adjust prices, source products from diverse suppliers, and maintain lower overhead costs.\n\nIt has always been the nature of business that those who are rigid will find themselves breaking, said economist John Muleya.\n\nBig retailers lack the flexibility that small businesses have to adapt to the ever changing playing field. Even major wholesalers are adapting to this new reality. Mohammed Musa, one of Zimbabwes largest wholesalers, has significantly reduced the trading space at its flagship store in Harare to accommodate smaller businesses.\n\nInstead of relying solely on the wholesale trade, the company has shifted towards renting out sections of its premises to various SMEs. This move has proven to be highly profitable, as the company now generates more revenue from rental income than it would have from traditional wholesale operations.\n\nThis shift in strategy highlights how the retail sector in Zimbabwe is moving from the dominance of large corporations towards a more decentralised model, where smaller businesses play a more significant role. Zimbabwe is not the only country experiencing this shift in retail trends.\n\nIn South Africa, major retailers like Checkers have responded to the changing business environment by embracing smaller, community-focused stores. Instead of relying solely on large supermarkets, Checkers has introduced container stores in high-density areas, making essential goods more accessible to customers.\n\nThis strategy has allowed Checkers to compete with informal traders while maintaining a presence in areas that were previously underserved. The concept of container stores and smaller retail outlets could be an effective model for Zimbabwean retailers looking to remain competitive.\n\nInstead of investing in massive buildings with high operational costs, businesses can open strategically placed small shops that cater to specific community needs. One of the most significant outcomes of the changing retail landscape in Zimbabwe is the increase in locally owned businesses.\n\nHistorically, the countrys retail sector was dominated by corporations controlled by wealthy white investors and a handful of black elites. These companies had significant financial backing, access to foreign suppliers, and control over major retail spaces.\n\nHowever, with the rise of SMEs, more indigenous entrepreneurs have entered the market, challenging the previous status quo. This shift is not only democratising the retail sector but also ensuring that more money circulates within the local economy rather than being repatriated by foreign-owned corporations.\n\nThe growing dominance of indigenous businesses also reflects the resilience and adaptability of Zimbabwean entrepreneurs. Many of these small-scale retailers started as informal traders before expanding into more structured businesses.\n\nUnlike large corporations that struggle to adjust to economic fluctuations, these businesses are highly flexible, allowing them to thrive even in a challenging economic environment.\n\nRecognising the rise of SMEs and informal businesses, the Government has taken steps to integrate them into the formal economy. Finance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube recently announced new measures aimed at formalising the informal sector.\n\nThese measures include mandatory licensing for informal traders, ensuring that they operate within the confines of the law. The Government will enforce tax collection from informal businesses to ensure they contribute to the national fiscus.\n\nAdditionally, informal traders will be encouraged to sell goods in specific zones rather than operating from unregulated street markets, and there will be a crackdown on smuggling, which has given an unfair advantage to informal traders over formal retailers.\n\nThese measures aim to level the playing field between formal and informal businesses while ensuring that the Government collects revenue from all commercial activities. However, some business owners fear that over-regulation could stifle the growth of small businesses, making it necessary for the Government to strike a balance between formalisation and supporting entrepreneurship.\n\nWhile SMEs and tuckshops are flourishing, larger retailers still have an opportunity to remain competitive if they adapt to the changing market. Some of the challenges they need to address include high operational costs, as large stores require significant resources to maintain, making them less profitable in an economy where consumers prioritise affordability.\n\nUnlike SMEs, which can adjust their prices based on market conditions, large retailers often have fixed pricing models that make them less competitive. Consumer preferences are also shifting, with Zimbabwean shoppers increasingly opting for convenient shopping experiences, while going for smaller stores closer to residential areas over large supermarkets.\n\nTo stay relevant, big retailers could adopt strategies similar to those seen in South Africa, such as opening smaller neighbourhood outlets, partnering with SMEs, or shifting towards online and mobile retailing.\n\nThe ongoing transformation of Zimbabwes retail sector is not a sign of economic failure, but rather a reflection of a business environment that is evolving.\n\nThe closure of big retailers should not be viewed in isolation, but rather as part of a broader shift towards a more diverse and inclusive economy. With SMEs and tuckshops playing an increasingly significant role, the retail sector is becoming more competitive and dynamic.\n\nThis change is also creating opportunities for indigenous entrepreneurs, ensuring that economic benefits are distributed more evenly across society.\n\nAs the Government continues to implement policies to formalise the informal sector, it will be crucial to ensure that these measures do not stifle the growth of small businesses. Instead, policies should focus on supporting entrepreneurship, fostering innovation and creating an environment where both small and large retailers coexist.\n\nUltimately, Zimbabwes retail sector is not in decline but rather in transition. Businesses that can adapt to the new landscape  whether through innovation, flexibility or strategic partnerships  will thrive in the years to come.  The Patriot\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/04/Untitled-sdvsvsv.jpg",
            "description": "Kundai Marunya, Correspondent THE recent wave of big retail outlets closing or scaling down operations in Zimbabwe has sparked concern among consumers and economic analysts. However, a closer look at the situation reveals that these closures do not necessarily indicate a worsening economy, but rather a shift in business models. Large retail chains, once dominant […]",
            "time": "09:08",
            "date": "14 Feb 2025"
        }
    ]
}