{
    "news": [
        {
            "title": "Collaboration between Government and private sector critical: ZNCC",
            "url": "https://www.herald.co.zw/collaboration-between-government-and-private-sector-critical-zncc/",
            "content": "Judith Phiri\n\nThe Zimbabwe National Chamber of Commerce (ZNCC) has emphasised the importance of continued collaboration between the Government and the private sector, highlighting that a competitive environment is essential for the success of Zimbabwean businesses.\n\nDelivering the vote of thanks at the inaugural two-day Competitiveness Summit held in Bulawayo, ZNCC chief executive officer Mr Christopher Mugaga noted the importance of a competitive business environment.\n\nHe also said there is a need to address the regulatory framework to ensure competitiveness.\n\nMr Mugaga called upon all stakeholders  both private and public  to take competitiveness seriously in the face of the AFCFTA which calls for a borderless Africa.\n\nHe said as the country celebrates the National Youth Day Commemoration tomorrow, it is important for young people to understand the aspects of competitiveness.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/a8645984-9802-4919-a041-47894c3c81ed-1-680x380.jpeg",
            "description": "Judith Phiri The Zimbabwe National Chamber of Commerce (ZNCC) has emphasised the importance of continued collaboration between the Government and the private sector, highlighting that a competitive environment is essential for the success of Zimbabwean businesses. Delivering the vote of thanks at the inaugural two-day Competitiveness Summit held in Bulawayo, ZNCC chief executive officer Mr […]",
            "time": "21:06",
            "date": "20 Feb 2025"
        },
        {
            "title": "Zimbabwe commits to enhancing ease of doing business, boosting competitiveness",
            "url": "https://www.herald.co.zw/zimbabwe-commits-to-enhancing-ease-of-doing-business-boosting-competitiveness/",
            "content": "Rutendo Nyeve\n\nIn a bid to accelerate Zimbabwes economic transformation, the Ministry of Industry and Commerce has reaffirmed its dedication to implementing President Mnangagwas directive to enhance the ease of doing business to ensure competitiveness and drive sustainable economic growth.\n\nSpeaking at the official opening of the National Competitiveness Commissions (NCC) inaugural Competitiveness Summit in Bulawayo, Industry and Commerce Minister Mangaliso Ndlovu outlined the Governments commitment to fostering a competitive and business-friendly environment.\n\nMinister Ndlovu said competitiveness remains a cornerstone for achieving sustainable national growth.\n\nCompetitiveness is a key driver of sustainable economic growth. Zimbabwes efforts to achieve Vision 2030 hinge on creating a conducive business environment, said Minister Ndlovu.\n\nHe praised President Mnangagwas unwavering support for economic transformation, industrial growth, and private sector development, noting that the Presidents leadership has been instrumental in inspiring efforts to position Zimbabwe as a globally competitive economy.\n\nThe Presidents dedication to economic prosperity, sustainable industrialisation, and private sector development aligns with our collective vision of transforming Zimbabwe into a globally competitive economy, said Minister Ndlovu.\n\nThe summit comes just a week after President Mnangagwa issued a directive for Ministers to address the challenges faced by businesses due to bureaucratic red tape, exorbitant fees, and over-regulation.\n\nConcerted efforts must be made to revisit all areas that hinder the start and growth of investments. Businesses should not suffer from regulations, punitive administrative licenses, or excessive fees. These measures should instead promote economic development and improve the livelihoods of our people.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/10/minister-Mangaliso-Ndlovu.jpg",
            "description": "Rutendo Nyeve In a bid to accelerate Zimbabwe’s economic transformation, the Ministry of Industry and Commerce has reaffirmed its dedication to implementing President Mnangagwa’s directive to enhance the ease of doing business to ensure competitiveness and drive sustainable economic growth. Speaking at the official opening of the National Competitiveness Commission’s (NCC) inaugural Competitiveness Summit in […]",
            "time": "21:06",
            "date": "20 Feb 2025"
        },
        {
            "title": "VP Chiwenga commends President Mnangagwa for promoting Zimbabwe’s competitiveness",
            "url": "https://www.herald.co.zw/vp-chiwenga-commends-president-mnangagwa-for-promoting-zimbabwes-competitiveness/",
            "content": "Nqobile Bhebhe\n\nVICE President Constantino Chiwenga has praised President Mnangagwa for consistently championing efforts to enhance Zimbabwes global competitiveness.\n\nSpeaking at the inaugural Competitiveness Summit in Bulawayo, Dr Chiwenga said the President is committed to economic transformation.\n\nThe summit is running under the theme Building Sustainability Towards Enhanced Productivity and Competitiveness in Zimbabwe.\n\nIt is gratifying that President Mnangagwa has consistently championed the improvement of Zimbabwes global competitiveness, he said.\n\nVP Chiwenga noted the transformative journey the country has undertaken under President Mnangagwas leadership, particularly on productivity, ease of doing business, and fostering an investment-friendly environment.\n\nUnder his dynamic and results-oriented leadership, the country has embarked on a transformative journey focusing on boosting productivity, enhancing the ease of doing business, and fostering an ecosystem that attracts both domestic and foreign investment, said the Vice President.\n\nHe noted that the summits theme aligns with President Mnangagwas commitment to sustainable, inclusive, and equitable economic growth as outlined in National Development Strategy 1.\n\nThis trajectory will continue to inform and guide us into National Development Strategy 2, he added.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/d701b969-0794-49d5-8b69-67ea645dcd73-680x380.jpeg",
            "description": "Nqobile Bhebhe VICE President Constantino Chiwenga has praised President Mnangagwa for consistently championing efforts to enhance Zimbabwe’s global competitiveness. Speaking at the inaugural Competitiveness Summit in Bulawayo, Dr Chiwenga said the President is committed to economic transformation. The summit is running under the theme “Building Sustainability Towards Enhanced Productivity and Competitiveness in Zimbabwe.” “It is […]",
            "time": "21:06",
            "date": "20 Feb 2025"
        },
        {
            "title": "Government ready to support NCC: President",
            "url": "https://www.herald.co.zw/government-ready-to-support-ncc-president/",
            "content": "Zvamaida Murwira in Bulawayo\n\nThe Government is ready to support the National Competitiveness Commission so that it focuses on competitive strategy, which is key in guiding national policy formulation, President Mnangagwa has said.\n\nThe Head of State and Government said this while delivering his keynote address at the inaugural Competitive Summit organised by the National Competitiveness Commission in Bulawayo.\n\nIt is pleasing to note that the Ministry of Industry and Commerce, through the National Competitiveness Commission, will focus on developing a National Competitiveness Strategy this year which will be instrumental in guiding national policy formulation, he said.\n\nGovernment stands ready to lend you as much support as possible on this very noble endeavour.\n\nThe inaugural competitive summit has therefore come at a very opportune moment for us. I would like to take this opportunity to urge the Commission to leverage the invaluable networks it presents.\n\nThe summit provides a platform for stakeholders to reflect on strategies to enhance competitiveness in the country and come up with resolutions for presentation to the Government.\n\nTodays event was attended by Vice President Constantino Chiwenga and Cabinet Ministers, among other senior Government officials.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/President-Mnangagwa-4.jpg",
            "description": "Zvamaida Murwira in Bulawayo The Government is ready to support the National Competitiveness Commission so that it focuses on competitive strategy, which is key in guiding national policy formulation, President Mnangagwa has said. The Head of State and Government said this while delivering his keynote address at the inaugural Competitive Summit organised by the National […]",
            "time": "21:06",
            "date": "20 Feb 2025"
        },
        {
            "title": "Employee converts US$50k to own use",
            "url": "https://www.herald.co.zw/employee-converts-us50k-to-own-use/",
            "content": "Yeukai Karengezeka\n\nCourt Correspondent\n\nA Harare man who allegedly stole over US$50 000 collected from his employers clients has been arraigned before the courts.\n\nInnocent Stanley Nyahodza (42) appeared before Harare Magistrate Mr Isheunesu Matova facing charges of theft.\n\nHe was remanded out of custody on US$300 bail and is set to return to court on March 14.\n\nThe complainant in the case is Warpack Zimbabwe Sales and Merchandising Company, represented by its sales manager, Mr Tanyanyiwa Ray Chamunorwa.\n\nWarpack Zimbabwe is a distributor and sales representative for major producers of groceries, detergents, dog food, and health and hygiene products.\n\nThe court heard that Nyahodzas role at the company included securing customer orders, following up on payments, and collecting funds from clients.\n\nThe State, represented by Mr Rufaro Chonzi, said between January 1 and February 2025, Nyahodza received payments amounting to US$50 131 from several customers.\n\nInstead of remitting the funds to the company, Nyahodza allegedly converted the money to his personal use.\n\nThe offense came to light on February 13 when a customer contacted Warpack Zimbabwe to place an order for some products.\n\nDuring the conversation, Warpack reminded the customer of an outstanding balance of US$11 000.\n\nHowever, the customer insisted that the balance had already been cleared.\n\nThis prompted Warpack to launch an internal investigation, which confirmed that Nyahodza had received US$11 000 but had not surrendered it to the company.\n\nFurther inquiries revealed that Nyahodza had also misappropriated funds from other clients, leading to a total prejudice of US$50 131.\n\nThe complainant reported the matter to the police, resulting in Nyahodzas arrest.\n\nNone of the funds have been recovered.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Court-fraud-680x380.jpg",
            "description": "Yeukai Karengezeka Court Correspondent A Harare man who allegedly stole over US$50 000 collected from his employer’s clients has been arraigned before the courts. Innocent Stanley Nyahodza (42) appeared before Harare Magistrate Mr Isheunesu Matova facing charges of theft. He was remanded out of custody on US$300 bail and is set to return to court […]",
            "time": "21:06",
            "date": "20 Feb 2025"
        },
        {
            "title": "Madzibaba Ishmael wants matter referred to Constitutional Court",
            "url": "https://www.herald.co.zw/madzibaba-ishmael-wants-matter-referred-to-constitutional-court/",
            "content": "Prosper Dembedza\n\nHerald Correspondent\n\nApostolic sect leader Madzibaba Ishmaels case stalled today after he filed an application seeking the referral of his matter to the Constitutional Court.\n\nMadzibaba Ishmael, who is facing multiple charges, argued that the courts refusal to allow his witnesses to testify before he takes the stand violates his constitutional rights.\n\nIshmael asserted that it is his right to have his witnesses speak on his behalf while he reserves the option to remain silent.\n\nHowever, the State led by prosecutors Mr Tafara Chirambira and Ms Sheila Mupindu, opposed Ishmaels application.\n\nThe prosecution argued that the application was frivolous and its intension was to delay proceedings.\n\nThey maintained that under the law, an accused person must either testify first or choose to remain silent before calling any witnesses.\n\nThe State said if Ishmael wished to exercise his right to remain silent, he should do so rather than making it depend on what his witnesses might say.\n\nMadzibaba Ishmael, whose full name is Chokurongerwa, is facing three charges  ill-treatment of children, conducting a burial without a burial order, and failing to report the birth and death of a person.\n\nThese charges have drawn significant public interest, given his status as a well-known religious figure.\n\nNorton Magistrate Ms Christina Nyandoro is expected to deliver a ruling on Ishmaels application for referral to the Constitutional Court on March 7, 2024.\n\nIf the application is granted, the matter will be escalated to the highest court to determine whether his constitutional rights have indeed been infringed upon.\n\nIf denied, the trial will proceed under the existing court procedures.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/03/Madzibaba-Ishmael.jpg",
            "description": "Prosper Dembedza Herald Correspondent Apostolic sect leader Madzibaba Ishmael’s case stalled today after he filed an application seeking the referral of his matter to the Constitutional Court. Madzibaba Ishmael, who is facing multiple charges, argued that the court’s refusal to allow his witnesses to testify before he takes the stand violates his constitutional rights. Ishmael […]",
            "time": "21:06",
            "date": "20 Feb 2025"
        },
        {
            "title": "Minister Nyoni opens EMA office in Muzarabani",
            "url": "https://www.herald.co.zw/minister-nyoni-opens-ema-office-in-muzarabani/",
            "content": "Fungai Lupande\n\nMashonaland Central Bureau\n\nEnvironment, Climate, and Wildlife Minister, Dr Sithembiso Nyoni has officially opened the Environmental Management Agency (EMA)s office in Muzarabani.\n\nThis new office is the sixth to be established since 2019 as part of plans to construct offices in every district across the country.\n\nMinister Nyoni said the new office will provide convenience to miners, farmers, and the Muzarabani community by facilitating access to information and records for the sustainable management of natural resources.\n\nShe highlighted that the office is equipped with solar energy to lower its carbon footprint and has essential amenities such as water and internet connectivity.\n\nThe construction of this office, which began towards the end of 2023, has created employment opportunities for local residents, she said.\n\nIt offers a conducive and comfortable work environment for the staff, ensuring high-quality service for the community.\n\nMashonaland Central Provincial Affairs and Devolution Minister Christopher Magomo congratulated the Ministry of Environment, Climate, and Wildlife on the opening of the Muzarabani office.\n\nHe said the province is rich in indigenous forests, wildlife, minerals, and various natural resources, which contribute to the national GDP.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/48fe959e-5a32-4713-9f2d-bef6746643c2-680x380.jpeg",
            "description": "Fungai Lupande Mashonaland Central Bureau Environment, Climate, and Wildlife Minister, Dr Sithembiso Nyoni has officially opened the Environmental Management Agency (EMA)’s office in Muzarabani. This new office is the sixth to be established since 2019 as part of plans to construct offices in every district across the country. Minister Nyoni said the new office will […]",
            "time": "21:06",
            "date": "20 Feb 2025"
        },
        {
            "title": "Food and Nutrition Council warns public against fraudulent WhatsApp message",
            "url": "https://www.herald.co.zw/food-and-nutrition-council-warns-public-against-fraudulent-whatsapp-message/",
            "content": "Mutsawashe Mashandure\n\nHerald Correspondent\n\nThe Food and Nutrition Council has advised members of the public not to respond to a message purporting that it is launching a food aid programme and requesting for personal information from prospective recipients.\n\nThe council said the message is being circulated under the name Vanessa.\n\nWe advise the public to avoid sharing any personal information in response to such messages, the council said in a statement.\n\nIf you have received this message or any similar communications, do not respond to it. Protect your personal information and be cautious.\n\nFor verified information about the councils programmes and services, the public is advised to contact the organisation through its official channels.\n\nThe Food and Nutrition Council said it is committed to transparency and the protection of public welfare.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Screenshot-2025-02-20-at-17.03.46-604x380.png",
            "description": "Mutsawashe Mashandure Herald Correspondent The Food and Nutrition Council has advised members of the public not to respond to a message purporting that it is launching a food aid programme and requesting for personal information from prospective recipients. The council said the message is being circulated under the name Vanessa. “We advise the public to […]",
            "time": "21:06",
            "date": "20 Feb 2025"
        },
        {
            "title": "NDS2 to focus on value addition and industrialisation: President Mnangagwa",
            "url": "https://www.herald.co.zw/nds2-to-focus-on-value-addition-and-industrialisation-president-mnangagwa/",
            "content": "Nqobile Bhebhe\n\nPresident Mnangagwa has announced that the upcoming National Development Strategy 2 (NDS2) will focus on value addition and industrialisation to increase the manufacturing sectors value from the current US$4 billion to over US$10 billion.\n\nSpeaking at the inaugural Competitiveness Summit in Bulawayo, President Mnangagwa highlighted the transition National Development Strategy 1 (NDS1), which concludes in 2025, to NDS2.\n\nAs you are aware, the first edition of the National Development Strategy is coming to an end in 2025.\n\nEfforts are underway to develop the successor programme, the National Development Strategy 2. The NDS2 will prioritise value addition and industrialisation, but leverage on the manufacturing sector.\n\nThe aim is to increase the sectors value from the current US$4 billion to over US$10 billion through a strategic focus on value chains in the different sectors, said President Mnangagwa.\n\nHe commended the National Competitiveness Commission for organizing the summit, emphasising its role as a key institution in fostering a competitive economic environment in Zimbabwe.\n\nThe summit is running under the theme Building Sustainability Towards Enhanced Productivity and Competitiveness in Zimbabwe.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/President-Mnangagwa-unveils-NDS2-plan.jpg",
            "description": "Nqobile Bhebhe President Mnangagwa has announced that the upcoming National Development Strategy 2 (NDS2) will focus on value addition and industrialisation to increase the manufacturing sector’s value from the current US$4 billion to over US$10 billion. Speaking at the inaugural Competitiveness Summit in Bulawayo, President Mnangagwa highlighted the transition National Development Strategy 1 (NDS1), which […]",
            "time": "21:06",
            "date": "20 Feb 2025"
        },
        {
            "title": "President Mnangagwa in Bulawayo",
            "url": "https://www.herald.co.zw/president-officiates-at-ncc-summit/",
            "content": "KEYNOTE ADDRESS BYPRESIDENTMNANGAGWAATTHE INAUGURAL ANNUALCOMPETITIVENESS SUMMITBULAWAYO\n\n20 FEBRUARY 2025\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/President-at-summit.jpg",
            "description": "KEYNOTE ADDRESS  BY PRESIDENT MNANGAGWA AT THE INAUGURAL ANNUAL COMPETITIVENESS SUMMIT BULAWAYO 20 FEBRUARY 2025",
            "time": "21:06",
            "date": "20 Feb 2025"
        }
    ]
}