{
    "news": [
        {
            "title": "Spices and herbs exports reach US$4m",
            "url": "https://www.herald.co.zw/spices-and-herbs-exports-reach-us4m/",
            "content": "Edgar Vhera\n\nAgriculture Specialist Writer\n\nEXPORT earnings from the spice and herbs segment of the horticulture sector hit US$4 million between January and September this year incited by a high demand for African products by European markets.\n\nStatistics from the Zimbabwe National Statistics Agency (ZimStats) show that the country has earned US$4 097 181 from the export of 1 965 368 kg of spices and herbs.\n\nDried, crushed or ground pepper, dried fruits of the genus capsicum or pimenta, crushed or ground fruits of genus capsicum or pimenta and chillies are among the products under the spices and herbs section.\n\nThe lockdown induced by the Covid-19 virus in 2019 resulted in many consumers being health conscious with the spices and herbs section endearing to a lot of consumers, who prefer nutrient rich products for healthy eating. This has resulted in the countrys spices and herbs export earnings rising a whopping 120 percent from US$ 2 345 948 in 2021 to US$5 171 898 in 2023.\n\nSource: ZimStats\n\nA local global good agronomic practice (Global GAP) certified and Sedex Members Ethical Trade Audit (SMETA) registered company, Dombera Farm, is supporting smallholder farmers to access international markets.\n\nDombera Farm managing director, Mrs Claire Bailey said her organisation provided farmers with top quality plant genetics to produce African Bird Eye Chilli and training on sustainable farming techniques that protect their natural resources and boost their income.\n\nAs one of the five lead firms in Zimbabwe selected to participate in the UK Trade Partnerships Programme (UKTP), Dombera Farm acts as a centralised hub to grade and package products, provides transport and ultimately creates market linkages. We currently have 70 smallholder farmers on seven hectares of land, said Mrs Bailey.\n\nThe growing appetite for spicy foods has resulted in Europe becoming the second biggest importer of dried chillies in the world and developing countries are the major producers. High quality and sustainably produced chillies fetch high prices on the market.\n\nZimbabwe produces chillies with no artificial colours or flavours under high adherence to environmental and international standards. The countrys unique selling point is the slow grown, mountain chillies of superior colour and taste, sustainably produced by smallholder farmers under high environmental standards.\n\nRecently, the centre for the promotion of imports from developing countries (CBI) said the global supply of spices was changing and disrupting the European supply chain.\n\nShipping issues (Red Sea obstruction) are causing delays and extra supply costs, consumption growing faster than production in key producing origins (Indonesia, India, China) and crop failure (floods and droughts) as a result of climate change are causing this disruption.\n\nMany African countries have good climatic conditions for growing spices and are nearer than the traditional sources like India or Indonesia, the analysis showed.\n\nIt revealed that European imports from Africa had been on an upward trajectory from 2020 to 2023 with capsicum, ginger, seeds of anise, cloves and coriander seeds being the most traded spices.\n\nThe top five African exporting countries to Europe are Zambia, Egypt, Madagascar, Nigeria and Morocco.\n\nThe main success factors for African spices to capture the EU market are compliance with EU quality regulations, embracing sustainability, investing in market development and adoption to customer needs.\n\nMain hazards in spices are residues of agro-chemicals exceeding EU maximum residue levels (MRL), microbiological hazards, salmonella, mycotoxins, authenticity and food-approved packaging and correct labelling.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/zimstate-680x380.jpeg",
            "description": "  Edgar Vhera Agriculture Specialist Writer EXPORT earnings from the spice and herbs segment of the horticulture sector hit US$4 million between January and September this year incited by a high demand for African products by European markets. Statistics from the Zimbabwe National Statistics Agency (ZimStats) show that the country has earned US$4 097 181 […]",
            "time": "08:36",
            "date": "18 Dec 2024"
        },
        {
            "title": "Positive start for pilot cotton seed trading on ZMX",
            "url": "https://www.herald.co.zw/positive-start-for-pilot-cotton-seed-trading-on-zmx/",
            "content": "Edgar Vhera\n\nAgriculture Specialist Writer\n\nBuyers purchased 401 tonnes of cotton at an average price of US$223 per tonne following the convergence of cotton seed bids and offers at the Zimbabwe Mercantile Exchange (ZMX)s pilot trading of the commodity this season.\n\nThis follows the Governments recent decision to add cotton and its by-products to the basket of commodities to be traded under the ZMX warehouse receipt system (WRS) to aid in financial inclusion and price discovery following the gazetting of Statutory Instrument (SI) 173 of 2024, Warehouse Receipt Act (Chapter 18:25), substitution of schedule notice 2024.\n\nZMX chief executive officer, Mr Collen Tapfumaneyi said the pilot cotton seed trading followed the successful registration of suppliers and cotton merchants as potential buyers of cotton seed on the ZMX platform.\n\nFive depots were inspected and successfully registered by the registrar of warehouses and these were certified by ZMX, marking a major milestone for the project.\n\nAfter warehouse certification, warehouse receipts for the cotton seed were issued after the weighing and grading of the available cotton seed, he said.\n\nStatistics from ZMX show that no trade was recorded on the first day due to a price deadlock.\n\nThe second and third auctions had an average closing price of US$220 per tonne with the final pilot auction closing at an average price of US$223 per tonne.\n\nA total of 401 tonnes of cotton seed was traded during these auctions, according to the figures.\n\nMr Tapfumaneyi said the ZMX auction platform effectively showcased the price discovery process, featuring the active involvement of both large and small merchants.\n\nParticipants provided positive feedback, demonstrating to ZMX that the industry is now prepared for full engagement with the platform after the next harvest, he said.\n\nAgriculture expert and Stockfeed Manufacturers Association of Zimbabwe (SMAZ) executive administrator, Dr Reneth Mano said the introduction of the ZMX spot market auction system for cotton seed was a good move, which had been long overdue.\n\nThe arrival of ZMX auction for cotton seed heralds a new era for cotton farmers, as it presents to farmers and Government new ways for organised cotton farmers associations to market their crop and unlock value, especially where the Cotton Company of Zimbabwe (Cottco) and other private cotton ginneries offer toll ginning services to cotton farmers.\n\nAn appropriately structured ZMX auction system can offer cotton farmers the opportunity to interface directly with final buyers of the three tradable cotton products (bales of seed cotton straight from the field, bales of ginned cotton lint and tonnes of ginned cotton seeds) and get paid for their cotton products directly through ZMX auction system without burdening Treasury, Dr Mano said.\n\nToll ginning of cotton bales at ginneries for a fee will allow organised cotton farmers to process their seed cotton into lint and cotton seed, both of which are internationally valuable and highly tradable products.\n\nWhen ZMX spot market auction floors are open to both domestic and global buyers, cotton farmers will secure globally competitive export prices for cotton seed of US$223 per tonne and for cotton lint US$1 656 per tonne free on board (FOB).\n\nWhen fully operational, the ZMX auction system has the potential to increase the net incomes of organised cotton farmers by 55 percent through selling ginned products directly to domestic and global off-takers, he explained.\n\nDr Mano believes the making of ZMX the central domestic spot auction market for all cotton products was the global best practice and recipe for stimulating sustained market-driven growth in Zimbabwes cotton production.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/old1-680x380.png",
            "description": "Edgar Vhera Agriculture Specialist Writer Buyers purchased 401 tonnes of cotton at an average price of US$223 per tonne following the convergence of cotton seed bids and offers at the Zimbabwe Mercantile Exchange (ZMX)’s pilot trading of the commodity this season. This follows the Government’s recent decision to add cotton and its by-products to the […]",
            "time": "08:36",
            "date": "18 Dec 2024"
        },
        {
            "title": "‘2024 Cabinet calendar a success’ . . . We implemented impactful policies: President",
            "url": "https://www.herald.co.zw/2024-cabinet-calendar-a-success-we-implemented-impactful-policies-president/",
            "content": "Zvamaida Murwira-Senior Reporter\n\nGovernment has made headway in advancing a people-centred national development agenda through initiating policies and projects that have great impact on the collective aspirations of all Zimbabweans, President Mnangagwa has said.\n\nThe President made the remarks at State House yesterday while addressing the last Cabinet meeting for this year.\n\nToday marks the last Cabinet Meeting for the 2024 Cabinet Calendar. A synopsis of the business transacted during the year reveals that, as Government, we have made notable headway in our people-centred national development agenda. In this respect, during the course of the year, we crafted, reviewed and implemented impactful policies, programmes as well as projects in our quest to fulfil the collective aspirations of our citizens. In a nutshell, the 2024 Cabinet Calendar was a success, with its robust and frank deliberations, said the President.\n\nThese discussions were facilitated by the greatly improved quality of memoranda submitted to Cabinet. Guided by the principle of collective responsibility, it was pleasing that as ministers, you rose above your respective sectoral interests, in favour of objectivity and the common national good, with coordination being more seamless. Congratulations.\n\nPresident Mnangagwa chronicled several achievements registered during the year in different sectors that include, energy, agriculture and health.\n\nHe said adequate grain continued to be distributed to citizens under the food deficit mitigation programme following the declaration of a State of Disaster for the 2023-2024 Summer Season, due to the El Nino-induced drought.\n\nThe timely delivery of food aid as well as agriculture inputs to our people at the grassroots level must be prioritised while complaints that transport costs are sometimes passed on to our people, must be honestly addressed. I, therefore, challenge the relevant Ministries, Departments and Agencies to apply themselves and devise strategies that will increase transport and logistical efficiency in getting aid and support to our people, he said.\n\nOn health, President Mnangagwa commended stakeholders in the sector for implementing multi-pronged intervention measures which saw the country combat the cholera outbreak during the first half of the year.\n\nHe said mechanisms were in place to deploy the recently approved Multi-Hazard Contingency Plan to curtail the effects of floods and other national disaster emergencies.\n\nI call upon you to provide leadership and assist your communities to mitigate damage and harm to property and life in the wake of the ensuing rainfall season. On the economic front, the revision of economic growth projections, on the back of the El Nino-induced droughts negative impact on agricultural output, was inevitable. However, we remain resolute and optimistic that the fiscal and monetary reforms introduced during the year will increasingly underpin currency stability and usher economic rebound, he said.\n\nTurning to the energy sector, President Mnangagwa said while there was a shortage of power owing to low generation at Kariba Hydropower Station, the improved use and exploitation of renewable energy sources in the country, particularly solar by companies and households, continued to reduce national grid power demand.\n\nThe initiatives by ZESA through new models of Independent PowerProducers are welcome moves to crowd in the private sector in power generation, specifically for their respective energy needs. More campaigns should be mounted to encourage our people, in both rural and urban areas to adopt renewable energy for domestic use,\n\nOn housing, President Mnangagwa said the Government will continue to channel resources towards housing delivery, as well as the upgrading and rehabilitation of both residential and institutional accommodation nationwide.\n\nThe strides made by local authorities during the course of the year are commendable. These include the conclusion of Master Plans by most local authorities. There are also glimpses of mindset change within that sector. Regrettably, cases of corruption emanating from the sector remain worrisome. The bold decision by Harare City Council to transfer waste disposal and management to private entities should be supported and replicated in other local authorities. Quality service delivery to our citizens remains the core objective, said President Mnangagwa.\n\nThe decentralisation and devolution agenda, said President Mnangagwa, has led to an improved standard of life and living environments for people with enhanced basic social services infrastructure.\n\nHe said the Government will continue prioritising the digital economy and empowerment of youths, women and small to medium enterprises.\n\nPresident Mnangagwa also called for innovative financing models to accelerate the reconstruction of the Mbare Traders Market following a fire incident that gutted the place recently.\n\nThe digital technology revolution is the cornerstone of modernisation, industrialisation and efficient service delivery to drive sustainable economic growth, he said.\n\nHowever, the digitalisation of Government information and services was occurring at a slow pace, something he said was worrisome.\n\nPresident Mnangagwa implored Ministers to ensure that Government continues to provide service to the public during the Cabinet break.\n\nAs Cabinet takes a well-deserved break, let us take note that we are not shutting down Government business and the subsequent delivery of service. Mechanisms must be put in place to balance the demands of a family and associated festivities with serving the people of our great motherland, Zimbabwe. The service delivery demands of the people of Zimbabwe must be responded to timely. After all, we are a Government by the people and for the people, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/President-Mnangagwa-cabinet.jpg",
            "description": "Zvamaida Murwira-Senior Reporter Government has made headway in advancing a people-centred national development agenda through initiating policies and projects that have great impact on the collective aspirations of all Zimbabweans, President Mnangagwa has said. The President made the remarks at State House yesterday while addressing the last Cabinet meeting for this year. “Today marks the […]",
            "time": "08:36",
            "date": "18 Dec 2024"
        },
        {
            "title": "President cracks whip on errant ministers",
            "url": "https://www.herald.co.zw/president-cracks-whip-on-errant-ministers/",
            "content": "Zvamaida Murwira-Senior Reporter\n\nPresident Mnangagwa yesterday slammed some ministers for failing to attend Cabinet meetings and committees, saying they should toe the line or risk appropriate consequences.\n\nHe said it was critical for Cabinet ministers to realise that Cabinet meetings take precedence over all other businesses they might have.\n\nThe President said this yesterday while addressing the last Cabinet meeting for the year.\n\nHe said while most ministers rose above their respective sectoral interests in favour of achieving the common national good, there was a worrisome tendency by some ministers and senior Government officials who were not attending meetings.\n\nLet me however, hasten to emphasise that Cabinet processes are anchored on the timely submission of vital documents and regular attendance by Ministers and officials. These include both ad-hoc as well as standing Cabinet Committees. The worrisome tendency by Ministers and senior officials to absent themselves from meetings is untenable, said President Mnangagwa.\n\nIn some cases, junior officials are delegated to attend and merely warm bench the meetings. This culture is tantamount to dereliction of duty. Permanent Secretaries should ensure that in their absence, only directors and above should attend working party meetings.\n\nHe directed the Chief Secretary in the Office of the President and Cabinet, Dr Martin Rushwaya to monitor Ministers attendance of the meetings.\n\nIn the 2025 calendar year, the Chief Secretary is directed to strictly monitor individual attendance and ensure that errant Ministers and officials toe the line or risk dire consequences. Ministers should remain mindful that Cabinet business takes precedence over all other business, said President Mnangagwa.\n\nHe said Deputy Ministers should be adequately briefed to help them represent the Government when they attend meetings.\n\nIn cases where Deputy Ministers are assigned, they should be adequately capacitated to enable active participation in the requisite deliberations.\n\nTo this end, I direct that in the 2025 programme cycle and going forward, Deputy Ministers must now sign performance contractors. It is incumbent upon Ministers to ensure that their deputies are comprehensively briefed on Government business and given the latitude for effective involvement, he said.\n\nA few years ago, President Mnangagwa introduced performance contracts for Cabinet Ministers, Permanent Secretaries and heads of parastatals and State entities as a way of encouraging hard work and results oriented workmanship.\n\nHe has also been conferring awards to top-performing Ministers, Permanent Secretaries, and heads of Government departments as the Second Republic continues to foster a culture of excellence, work ethic and servant leadership in its quest to attain Vision 2030.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Ministers-at-Cabinet-meeting.jpg",
            "description": "Zvamaida Murwira-Senior Reporter President Mnangagwa yesterday slammed some ministers for failing to attend Cabinet meetings and committees, saying they should toe the line or risk appropriate consequences. He said it was critical for Cabinet ministers to realise that Cabinet meetings take precedence over all other businesses they might have. The President said this yesterday while […]",
            "time": "08:36",
            "date": "18 Dec 2024"
        },
        {
            "title": "One million rural homes to get solar power",
            "url": "https://www.herald.co.zw/one-million-rural-homes-to-get-solar-power/",
            "content": "Rumbidzayi Zinyuke-Senior Reporter\n\nA solar power initiative is poised to transform the lives of over one million rural households across eight provinces by providing reliable and sustainable energy.\n\nThe implementation plan for the Presidential Rural Solarisation Project received Cabinet approval yesterday, with roll-out expected to commence next year.\n\nDuring a post-Cabinet media briefing, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere said the project sought to provide solar power to at least 200 000 households annually over the next five years.\n\nCabinet approved the Presidential Solarisation Project which is a livelihoods initiative aimed at providing sustainable renewable solar energy to household beneficiaries in the eight rural provinces of the country. The project targets approximately 200 000 beneficiaries a year and will run for a period of five years starting from 2025, he said.\n\nThis initiative is expected to enhance energy access, improve living conditions, and promote sustainable development in rural communities.\n\nThe project is part of the broader Rural Development 8.0 Strategy, with a goal to uplift rural livelihoods, enhance agricultural productivity, and boost food security.\n\nDr Muswere said the Rural Infrastructural Development Agency (RIDA) will oversee the implementation of the project through an Inter- Ministerial Steering Committee architecture comprising experts from local universities.\n\nThe project will be financed by the Government and other stakeholders and will provide affordable but advanced solar technologies (batteries, inverters, solar panels and cables) to power gadgets such as light bulbs, radios, televisions, phone chargers, laptops, small refrigerators, submersible pumps and Wi-Fi, he said.\n\nHe said local youths and women will be trained to participate in the installation programmes implemented in the districts and villages across the eight rural provinces of the country.\n\nZimbabwes traditional power generation infrastructure is currently facing challenges in meeting the national electricity demand.\n\nWhile the refurbishment and expansion of the Kariba and Hwange power plants are underway, Government is also pushing increased uptake of renewable energy to close the gap.\n\nThe key step toward improving renewable energy comes at a time when the Zimbabwe and many other countries in the Southern African region have been hit by successive droughts, reducing the amount of electricity generated through hydro power.\n\nThrough the National Renewable Energy Policy, Zimbabwe aims to achieve 1100MW of renewable energy capacity by 2025.\n\nThe Presidential Solarisation Project is one such key intervention which is expected to boost domestic productivity and create employment opportunities in rural communities in line with Vision 2030.\n\nIt also complements other projects already underway including the Gwanda Solar Project and the US$250 million floating solar plant to be built in the Kariba Dam.\n\nZimbabwes renewable energy transition aligns perfectly with global sustainable development goals, particularly SDG 7 which speaks to affordable and clean energy and SDG 13 on Climate Action.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Dr-Muswere-Post-Cabinet-briefing.jpg",
            "description": "Rumbidzayi Zinyuke-Senior Reporter A solar power initiative is poised to transform the lives of over one million rural households across eight provinces by providing reliable and sustainable energy. The implementation plan for the Presidential Rural Solarisation Project received Cabinet approval yesterday, with roll-out expected to commence next year. During a post-Cabinet media briefing, Information, Publicity […]",
            "time": "08:36",
            "date": "18 Dec 2024"
        },
        {
            "title": "Use ICTs to boost production: President",
            "url": "https://www.herald.co.zw/use-icts-to-boost-production-president/",
            "content": "Wallace Ruzvidzo-Herald Reporter\n\nYoung people should take advantage of disruptive technologies as these will increase production and productivity across all sectors of the economy, President Mnangagwa has said.\n\nDisruptive technologies are innovations that significantly change the way businesses, industries and consumers operate.\n\nIn a speech read on his behalf by Defence Minister Oppah Muchinguri-Kashiri at the Third Jobs for Young People and Women, Nyika Inovakwa Nevene Vayo, yesterday, President Mnangagwa said young people and women needed to be equipped with requisite skills to harness new technologies.\n\nAfrica was projected to be home to 42 percent of the worlds youth population by 2030, a demographic shift that the President said would reshape global market dynamics by 2050, positioning Africa as home to the worlds youngest workforce and a major marketplace for consumer goods and technology.\n\nIn this regard, our young people and women must be equipped with skills to make use of disruptive technologies brought about by technological advancements taking place day-by-day, globally. If our people can use disruptive technology to their advantage, our productivity as a nation will increase and so will our competitiveness.\n\nPresident Mnangagwa said the Second Republic was leaving no stone unturned in empowering young people and women through education and skills development so that the people could continue to compete and seize opportunities availed to them locally, regionally and globally.\n\nUnder our heritage-based Education 5.0 policy, my Government is fostering a system that empowers our learners to produce goods and services through the use of science, technology and innovation.\n\nSkills development should translate into more made in Zimbabwe goods on shop shelves as well as an increase in exports to regional and international markets. President Mnangagwa reiterated the mantra, Nyika inovakwa, inotongwa, inonamatirwa nevene vayo/ Ilizwe lakhiwa, libuswe, likhulekelwe ngabanikazi balo.\n\nI challenge line ministries, departments and agencies, including the Ministry of Skills Audit and Development, the Vision 2030 Movement, development partners and other stakeholders to continue and intensify efforts in identifying skills shortages, mismatches and gaps in all sectors of the economy.\n\nThis skills gap presents both a challenge and an opportunity. For individuals, it entails taking proactive steps to upskill and reskill, making themselves indispensable in a competitive job market. For employers, it demands investing in the continuous skills development of their workforce to ensure they have the talent they need to succeed.\n\nWe should, thus, start witnessing the twining of our learning institutions with industry to ensure that industry and entrepreneurship ready graduates are produced by our institutions of education and training, said President Mnangagwa.\n\nGovernment entities, businesses and educational institutions should collaborate and form partnerships to develop inclusive policies. This would help young people to enhance and scout for work-based learning opportunities as well as advocate increased access to internships, apprenticeships, and practical training for youth and women, said the President.\n\nThe conference ran under the theme, Aligning education with industry: Bridging the skills gap for the attainment of Vision 2030s goal of an upper middle income economy status.\n\nPresident Mnangagwa said the theme was in line with his Governments policy on youth and women empowerment through skills development and innovation, enabling them to thrive in a competitive job market and contribute to the sustainable socio-economic development of the country.\n\nThe theme also dovetailed with the African Union theme of the Year 2024, Educate and Skill Africa for the 21st Century.\n\nAdded the President: It further advances Sustainable Development Goals 8 and 1, which focus on promoting decent work and fostering economic growth, ending poverty as well as achieving gender equity.\n\nPresident Mnangagwa commended the Vision 2030 Movement for spearheading initiatives that champion the development of leadership and skills among the youth and women.\n\nThe world of work, under the Fourth Industrial Revolution, is undergoing seismic shifts. Automation and artificial intelligence are transforming industries, rendering some jobs obsolete, while creating entirely new types of modern career fields.\n\nAs such, employers are increasingly looking for youth who are flexible, adaptable, proactive, creative and collaborative. These profound global changes in the use of technology and the nature of work, make development of the right skills a necessity, instead of an option.\n\nThis prepares the youth for the labour market through constantly learning and adapting, as well as acquiring new skills that align with the evolving needs of the job market, he said.\n\nThe Second Republic was committed to enhancing research and development initiatives to ensure that new goods and services were delivered, and production costs were reduced.\n\nGoing into the future, the Second Republic planned to continue investing in policies and programmes which capacitated young people with the requisite skills for success in the ever-evolving global labour marketplace through future-ready skills and addressing how skilling could be scaled up.\n\nPresident Mnangagwa said it was essential that the nation prioritised collaborations and partnerships through working together to create a cohesive and effective skills development ecosystem.\n\nLet me reiterate that it is our collective duty to contribute towards the socio-economic development of our nation. Real growth will be achieved if we all participate in activities that promote social cohesion and economic growth, thereby improving the standards of living for all in line with our mantra of Leaving no one and no place behind, he said.\n\nSkills Audit and Development Minister, Professor Paul Mavima, said the development of skills was central to the achievement of Vision 2030.\n\nWe were formed following the wisdom of His Excellency the President who realised that the development of skills and competencies is central to the achievement of national aspirations.\n\nIn this particular case to the achievement of Vision 2030. Anywhere in the world, people are embracing the understanding that as we do general education it is actually the skills and competencies that educational architecture builds that lead to transformation, economic development, social development of a nation, he said.\n\nVision 2030 Movement chairperson Mr Paul Mavima Junior said the youth were indeed a vital cog in the continued development of the country.\n\nWe share a common goal of the establishment of an egalitarian society within our motherland Zimbabwe.\n\nWe share a common goal of seeing that the leadership of Zimbabwe succeeds, because we owe it to the generation that came before us, we owe it to the generation that is going to come after us, to say that in our time as young people, what exactly did we do? In our time as young people, what did we offer ourselves to Zimbabwe to do?\n\nI believe it is now our duty as a generation that is economically active now, to say that we are going to emancipate Zimbabwe, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Minister-Muchinguri-Kashiri.jpg",
            "description": "Wallace Ruzvidzo-Herald Reporter Young people should take advantage of disruptive technologies as these will increase production and productivity across all sectors of the economy, President Mnangagwa has said. Disruptive technologies are innovations that significantly change the way businesses, industries and consumers operate. In a speech read on his behalf by Defence Minister Oppah Muchinguri-Kashiri at […]",
            "time": "08:36",
            "date": "18 Dec 2024"
        },
        {
            "title": "Mbudzi interchange renamed Trabablas Interchange",
            "url": "https://www.herald.co.zw/mbudzi-interchange-renamed-trabablas-interchange/",
            "content": "Blessings Chidakwa-Herald Reporter\n\nMbudzi Interchange has now been renamed Trabablas Interchange, after President Mnangagwas liberation war name as a way of recognising and appreciating his sterling development work, Cabinet announced yesterday.\n\nPreviously, the Mbudzi Roundabout was notorious for traffic congestion, especially during peak hours, as motorists struggled to navigate past the traffic circle.\n\nIn response, President Mnangagwa initiated plans for its swift upgrade, which is set to be completed soon.\n\nDuring the post-Cabinet briefing, Information, Publicity, and Broadcasting Services Minister Dr Jenfan Muswere stated that the name change, proposed by Minister of Justice, Legal, and Parliamentary Affairs Ziyambi Ziyambi as the Acting Chairperson of the Cabinet Committee on Place Names, was approved by Cabinet.\n\nCabinet wishes to advise that upon completion, the Mbudzi Interchange will be named Trabablas Interchange in recognition of the visionary leadership of His Excellency the President Cde Dr Emmerson Dambudzo Mnangagwa, he said.\n\nMinister Muswere said Cabinet also received and approved the renaming of Headquarters 1 Infantry Brigade, Headquarters Bulawayo District and Zimbabwe School of Infantry Army Barracks, which was presented by Minister Ziyambi.\n\nFollowing the promulgation of a Defence Cantonment Notice of 2017 and the subsequent renaming of Headquarters 1 Infantry Brigade, Headquarters Bulawayo District and the Zimbabwe School of Infantry, Cabinet has now directed that the Army Barracks should retain their original names.\n\nAccordingly, Headquarters1 now retains the name Khumalo Barracks; Headquarters Bulawayo District retains the name Imbizo Barracks; and the Zimbabwe School of Infantry be renamed Lookout Masuku Barracks, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Minister-Muswere-and-Dr-Rushwaya.jpg",
            "description": "Blessings Chidakwa-Herald Reporter Mbudzi Interchange has now been renamed Trabablas Interchange, after President Mnangagwa’s liberation war name as a way of recognising and appreciating his sterling development work, Cabinet announced yesterday. Previously, the Mbudzi Roundabout was notorious for traffic congestion, especially during peak hours, as motorists struggled to navigate past the traffic circle. In response, […]",
            "time": "08:36",
            "date": "18 Dec 2024"
        },
        {
            "title": "Zesa restores power after blackout",
            "url": "https://www.herald.co.zw/zesa-restores-power-after-blackout/",
            "content": "Ivan Zhakata-Herald Correspondent\n\nZESA Holdings has restored power to most parts of the country following a nationwide power outage early yesterday afternoon when a system disturbance on the national grid caused by an imbalance in power on international connectors, affected not only Zimbabwe but parts of the region.\n\nThe blackout, which struck at 12.55pm when most suburban areas were already on load shedding, saw businesses in city centres and main industrial areas, which normally have more secure supplies, resorting to generators and solar to ensure business continued seamlessly.\n\nIn Harare, there was traffic congestion as functioning traffic lights were hit.\n\nBut in a statement last night, Zesa Holdings stakeholders relations said: We have restored power to most parts of the country, except for areas already scheduled for load-shedding.\n\nThe blackout came as Hwange Power Stations new Unit 8 undergoes its scheduled annual Class C maintenance, which started last month.\n\nThe unit accounts for almost a third of present effective generating capacity with Kariba South severely limited and the refurbishment of the older six units of Hwange thermal in the very early stages.\n\nDespite this, ZESA has pledged to maintain adequate power supplies during the festive season.\n\nAdded the statement:\n\nWe sincerely apologise to our valued stakeholders for the disruptions. Our teams are working tirelessly to ensure power stability, especially during this critical holiday period.\n\nZimbabwe is heavily investing in energy generation since to boost generation. Kariba South, which would normally be able to average 600MW to 700MW and operate peak output of over 1000MW is limited to 125MW because there is effectively no stored water at Lake Kariba and the two stations are just using what is coming in each day down the Zambezi.\n\nZimbabwe is importing some power using international connectors, making it susceptible to power challenges emanating from the region.\n\nYesterday, Zimbabwe was generating 649,5MW with Hwange at 475MW, Kariba at 124,5MW and independent power producers at 50MW.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Zesa-Holdings.jpg",
            "description": "Ivan Zhakata-Herald Correspondent ZESA Holdings has restored power to most parts of the country following a nationwide power outage early yesterday afternoon when a system disturbance on the national grid caused by an imbalance in power on international connectors, affected not only Zimbabwe but parts of the region. The blackout, which struck at 12.55pm when […]",
            "time": "08:36",
            "date": "18 Dec 2024"
        },
        {
            "title": "Politburo meets tomorrow",
            "url": "https://www.herald.co.zw/politburo-meets-tomorrow-16/",
            "content": "Herald Reporter\n\nZANU PF will tomorrow hold its final Politburo meeting for this year, the partys Secretary for Information and Publicity Cde Christopher Mutsvangwa has said.\n\nActing Secretary-General of Zanu PF Advocate Jacob Mudenda is advising all members of the Politburo that the meeting is on Thursday 19 December at 2pm at Zanu PF Headquarters, said Cde Mutsvangwa.\n\nAll members are expected to be seated by 1.45pm.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/ZANU-Pf-presser.jpg",
            "description": "Herald Reporter ZANU PF will tomorrow hold its final Politburo meeting for this year, the party’s Secretary for Information and Publicity Cde Christopher Mutsvangwa has said. Acting Secretary-General of Zanu PF Advocate Jacob Mudenda is advising all members of the Politburo that the meeting is on Thursday 19 December at 2pm at Zanu PF Headquarters, […]",
            "time": "08:36",
            "date": "18 Dec 2024"
        },
        {
            "title": "Chido brings varied rains, Zim escapes worst",
            "url": "https://www.herald.co.zw/chido-brings-varied-rains-zim-escapes-worst/",
            "content": "Herald Reporter\n\nTropical Depression Chido brought extra rain across Zimbabwe yesterday in combination with a mid-level cloud band from Botswana, with some areas receiving heavy downpours of over 60mm while others saw less than 15mm.\n\nAlthough the storm caused minimal disruption locally, Mozambique bore the brunt of what was still then a cyclone hitting mainland Africa with at least 34 deaths and over 23 600 homes destroyed.\n\nIn an update yesterday, the Meteorological Services Department of Zimbabwe said: Widespread thunderstorms occurred across the country with notable rainfall amounts recorded in Ruwa (64 mm), Marondera (49 mm), Shamva (38 mm), Lupane (34 mm), Zvishavane (26 mm), and Bulawayo Airport (15 mm), while the rest of the areas received less than 15 mm.\n\nYesterday morning, cloudy and mild conditions were experienced nationwide, with rain and thundershowers reported in some places. By the afternoon, cloudy conditions persisted, accompanied by scattered thunderstorms across the country.\n\nThis activity, according to the latest weather update, was driven by moisture from Chido, a former tropical cyclone now downgraded to a depression, moving westward across the country, in combination with a mid-level cloud band extending from Botswana.\n\nHowever, this morning, mild and cloudy weather is anticipated across the country, with Matabeleland North and South and Bulawayo Metropolitan, plus Midlands, expected to experience morning rain.\n\nIn the afternoon, the Matabeleland provinces and Bulawayo Metropolitan could expect cloudy and warm conditions with scattered thunderstorms, while the rest of the country would be partly cloudy and hot, with isolated thunderstorms.\n\nWhile the rest of the country was forecast to be partly cloudy with mild temperatures throughout, the Met Department expected cloudy conditions with rain showers over all of Matabeleland and Bulawayo Metropolitan tonight.\n\nYesterday, as a cyclone, Chido caused devastation in northern Mozambique before sinking from cyclone to tropical storm to tropical depression.\n\nThe National Institute of Risk and Disaster Management in Mozambique reported yesterday that Chido had damaged or destroyed 170 fishing boats, nearly 23 600 homes, and more than 300 people.\n\nOverall, more than 175 000 people in Mozambique were affected by the storm, it said.\n\n28 people were killed when Chido made landfall in Cabo Delgado province on Sunday. Six more people were killed in Nampula province and Niassa, which are further inland.\n\nAs of yesterday, rescue crews were still working through the heavily damaged areas.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Rains.jpg",
            "description": "Herald Reporter Tropical Depression Chido brought extra rain across Zimbabwe yesterday in combination with a mid-level cloud band from Botswana, with some areas receiving heavy downpours of over 60mm while others saw less than 15mm. Although the storm caused minimal disruption locally, Mozambique bore the brunt of what was still then a cyclone hitting mainland […]",
            "time": "08:36",
            "date": "18 Dec 2024"
        }
    ]
}