{
    "news": [
        {
            "title": "Eminent citizens to get Presidential honour",
            "url": "https://www.herald.co.zw/eminent-citizens-to-get-presidential-honour/",
            "content": "Blessings Chidakwa, Herald Reporter\n\nPRESIDENT Mnangagwa will this year honour outstanding citizens and organisations as part of the Second Republics thrust of bestowing honour where it is deserved, with nominations now open.\n\nThe awards and orders are informed by a desire by the Government to honour inspirational role models, personalities and organisations who render invaluable service to the people and place Zimbabwe on the global map.\n\nPresident Mnangagwa last year conferred the Royal Order of Munhumutapa and the Order of the Star of Zimbabwe along with valour medals of the Gold Cross of Zimbabwe, Silver Cross of Zimbabwe and the Commendation Medal to seven individuals excelling in various spheres of influence.\n\nThe seven are former Chief Secretary to the President and Cabinet Dr Misheck Sibanda, who was conferred with the Order of the Star of Zimbabwe (Platinum) while Messrs Sirizani Butau and Jubilee Utsiwegota were awarded the Gold Cross of Zimbabwe, the top award for bravery.\n\nOthers are Messrs Peace Magaya and Luckmore Magaya, who got the Silver Cross of Zimbabwe, Mr Devnanda Popatial who was awarded the Royal Order of Munhumatapa and musical outfit Black Umfolosi who received the Order of the Star of Zimbabwe in Bronze.\n\nIn a statement yesterday, Chief Secretary to the President and Cabinet Dr Martin Rushwaya called for nominees for conferment with honours and awards.\n\nGovernment intends to award eligible and deserving Zimbabwean citizens across all our range of honours and awards.\n\nThe individuals should be luminaries who meet the eligibility criteria for the award under which they are nominated, he said.\n\nAmong the honours and awards, there is the Order of the Great Zimbabwe to be conferred on Zimbabwes gallant sons and daughters for their supreme sacrifice in connection with the liberation struggle, survival and development of Zimbabwe.\n\nThe Royal Order of Munhumutapa will be conferred in honour of brothers and sisters from other states for their exceptional sacrifice and commitment towards the liberation and well-being of Zimbabwe as a nation.\n\nThe Order of the Star of Zimbabwe symbolises the yearnings and aspirations which propel Zimbabweans in their quest to achieve the highest possible goals in the spheres of human endeavour and is thus a fitting honour and award for superlative achievements.\n\nThe National Historical Legacy Award will be conferred on Zimbabweans who have selflessly and relentlessly dedicated themselves to the preservation of Zimbabwes peace, order, sovereignty, integrity and unity, thereby fostering the countrys socio-economic development.\n\nThe bravery awards are headed by the Gold Cross of Zimbabwe awarded to members of the uniformed forces and civilians for conspicuous bravery in circumstances of extreme peril.\n\nIt is the highest award and as such will head the order of precedence followed by the Silver Cross of Zimbabwe, which is awarded to members of the uniformed forces and civilians for conspicuous bravery in circumstances of great peril.\n\nThe Bronze Cross of Zimbabwe is awarded to members of the uniformed forces and civilians for acts of bravery in hazardous circumstances.\n\nThe Medal for Meritorious Service is conferred on members of the uniformed forces and civilians for meritorious service to Zimbabwe or humanity at large.\n\nThe Commendation Medal is conferred on any person for a commendable act of bravery, commendable service or continuous devotion to duty which deserves recognition.\n\nThere are also commendation awards.\n\nThe Robert Gabriel Mugabe Commendation Award for Service in Human Capital Development is conferred for outstanding, transformative service in human capital development that has opened up and achieved growth in new economic sectors while ensuring inclusivity.\n\nThe Joshua Mqabuko Nyongolo Nkomo Commendation Award for Community Development, Peace Building and Fostering Unity is conferred for outstanding and consistent transformative service in the improvement of livelihoods at community level engendering peace making and fostering unity.\n\nThe Herbert Wiltshire Pfumaindini Chitepo Commendation Award for Justice and Human Rights is conferred for distinguished and consistent pursuit of justice and human rights for the greater good of humanity.\n\nThe Jairos Jiri Humanitarian Award is conferred on persons who have worked and dedicated their lives to the betterment of humanity through rendering humanitarian service. It recognises the spirit of humanism exhibited by the recipient, while honouring the virtues of concern for the disadvantaged and vulnerable members of society.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/President-Mnangagwa-7.jpg",
            "description": "Blessings Chidakwa, Herald Reporter PRESIDENT Mnangagwa will this year honour outstanding citizens and organisations as part of the Second Republic’s thrust of bestowing honour where it is deserved, with nominations now open. The awards and orders are informed by a desire by the Government to honour inspirational role models, personalities and organisations who render invaluable […]",
            "time": "06:32",
            "date": "25 Jan 2025"
        },
        {
            "title": "Constitutional Amendment to allow Trump third term introduced",
            "url": "https://www.herald.co.zw/constitutional-amendment-to-allow-trump-third-term-introduced/",
            "content": "A REPUBLICAN House member has introduced a resolution to amend the United States Constitution to allow President Donald Trump, and any other future President, to be elected to a third term in the White House.\n\nPresident Trump has proven himself to be the only figure in modern history capable of reversing our nations decay and restoring America to greatness, and he must be given the time necessary to accomplish that goal, said Representative Andy Ogles of Tennessee on Thursday, who proposed extending the current maximum of two elected terms.\n\nIt is imperative that we provide President Trump with every resource necessary to correct the disastrous course set by the Biden administration, Ogles said in a statement.\n\nHe is dedicated to restoring the republic and saving our country, and we, as legislators and as states, must do everything in our power to support him, said Ogles, a hard-line conservative who is serving his second term in the House.\n\nI am proposing an amendment to the Constitution to revise the limitations imposed by the 22nd Amendment on presidential terms, he added.\n\nOgles move came three days after Trump was sworn in for a second, non-consecutive term  becoming only the second US president to accomplish that feat.\n\nAnd the resolution comes two months after Representative Dan Goldman, a New York Democrat, introduced a House resolution that reaffirms that the 22nd Amendment applies to two terms in the aggregate as President of the United States, and that the amendment applies to the 78-year-old Trump.\n\nA White House spokesperson did not immediately reply to a request for comment on Ogles resolution.\n\nFor a resolution to amend the Constitution to be sent to the Archivist of the United States, it must receive a two-thirds majority vote in both the House of Representatives and the Senate. If that is done, three-fourths of the states  38  must ratify the amendment for it to become part of the Constitution.\n\nThe 22nd Amendment of the Constitution states in part, No person shall be elected to the office of the President more than twice.\n\nOgles resolution seeks to revise this to read, No person shall be elected to the office of the President more than three times.\n\nThe original amendment also states, No person who has held the office of President, or acted as President, for more than two years of a term to which some other person was elected President shall be elected to the office of the President more than once.\n\nIn his statement Thursday, Ogles said the resolution he was introducing would allow President Trump to serve three terms, ensuring that we can sustain the bold leadership our nation so desperately needs.\n\nProposed in 1947 and ratified in 1951, the 22nd Amendment was authored to prevent a repeat of President Franklin Roosevelts unprecedented election to four terms in office.\n\nTo this day, Roosevelt is the only president ever to have been elected to more than two terms. He died in 1945, less than 90 days after his fourth inauguration.\n\nRepublicans currently hold an extremely narrow, three-seat majority in the House, and have a majority by the same number of states in the Senate. Few, if any Democrats, are likely to vote for Ogles resolution with Trump in office.\n\nOver the course of his political career, Trump has repeatedly hinted at his willingness to serve more than two terms in office.\n\nI suspect I wont be running again, unless you say, Hes so good weve got to figure something else out, Trump reportedly mused to House Republicans during a private meeting in November, shortly after his electoral victory over Democratic former Vice President Kamala Harris.\n\nSpeaking to members of the National Rifle Association in May, Trump said, ?I dont know, are we going to be considered three-term or two-term? Are we three-term or two-term if we win??\n\nTrumps openness to a third term does not come as a surprise to some people who know him.\n\nThe former Fox News journalist Geraldo Rivera, who was friendly with Trump for decades in New York, predicted in December that Trump and his allies would soon turn their attention to the 22nd Amendment.\n\nFor future reference: President Trump & Co. will soon start chattering about revoking/amending the 22nd Amendment, which limits presidents to two four year terms, Rivera wrote on X.\n\nAmending the Constitution is not the only way that Trump could stay in power after his current term ends.\n\nThough the 22nd Amendment prohibits Trump from being elected president again, it does not prohibit him from serving as president beyond Jan. 20, 2029, wrote Philip Klinkner, a professor of government at Hamilton College, in a recent article in The Conversation.\n\nThe reason for this is that the 22nd Amendment only prohibits someone from being elected more than twice, Klinkner wrote.\n\nIt says nothing about someone becoming president in some other way than being elected to the office.\n\nKlinkner wrote that one hypothetical scenario would be for Trump to run for vice president in 2028, and have Vice President JD Vance run at the top of the ticket, for president.\n\nIf elected, Vance could then resign, making Trump president again, Klinkner wrote. But Vance would not even have to resign in order for a Vice President Trump to exercise the power of the presidency.\n\nThe 25th Amendment to the Constitution states that if a president declares that he is unable to discharge the powers and duties of the office  such powers and duties shall be discharged by the Vice President as Acting President.\n\nAnother scenario Klinkner imagined is for Trump to encourage a family member to run for, and win, the White House. Once elected, they would serve as little more than a figurehead president, while Trump made the key decisions.  CNBC\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/06/1006-1-1-DON.jpg",
            "description": "A REPUBLICAN House member has introduced a resolution to amend the United States Constitution to allow President Donald Trump, and any other future President, to be elected to a third term in the White House. President Trump “has proven himself to be the only figure in modern history capable of reversing our nation’s decay and […]",
            "time": "06:32",
            "date": "25 Jan 2025"
        },
        {
            "title": "Police go digital, roadblocks to stay",
            "url": "https://www.herald.co.zw/police-go-digital-roadblocks-to-stay/",
            "content": "Blessings Chidakwa and Remember Deketeke\n\nTHE Zimbabwe Republic Police (ZRP) has gone digital and is creating an automated fingerprint identification system for smart policing that will make it easier to track criminals.\n\nFurther, police roadblocks will remain in place as they are part of the forces Constitutional mandate while an ongoing operation to eradicate illegal pirate taxis that have been causing havoc and endangering the lives of motorists and pedestrians will be intensified.\n\nThe Automated Fingerprint Identification System (AFIS) for smart policing, set to be launched soon, is being jointly developed by ZRP and the Zimbabwe Centre for High-Performance Computing (ZCHPC).\n\nSpeaking at a demonstration of the new system at ZCHPC offices in Harare yesterday, Permanent Secretary for Higher and Tertiary Education, Science and Technology Development Professor Fanuel Tagwira said the initiative would be a game-changer.\n\nProf Tagwira said the new system was inspired by National Development Strategy 1 (NDS1) where ZCHPC contributes towards the realisation of an innovation-led and knowledge-driven economy.\n\nThese efforts align with the Governments vision of fostering home-grown solutions to national challenges. The ZRP AFIS system showcases how technology can enhance law enforcement by improving crime detection, prevention, and overall efficiency.\n\nThis progress highlights Zimbabwes growing capacity to develop cutting-edge solutions that meet global standards. May I commend the Commissioner-General of Police for embracing this technology, he said.\n\nProf Tagwira said technological innovation was being leveraged to enhance national security and public service delivery.\n\nThis initiative reflects the power of collaboration in leveraging technology to enhance national security and public service delivery. As the President, Dr ED Mnangagwa, always says, the future of Zimbabwe must be anchored on innovation, science and technology, he said.\n\nPermanent Secretary in the Ministry of Higher and Tertiary Education, Innovation, Science and Technolgy Development Professor Fanuel Tagwira (left) unpacks the smart traffic tracking system whle flanked by the Zimbabwe Republic Police (ZRP) Comissioner General Stephen Mutamba (right) and the University of Zimbabwe Vice Chancellor (second from right) at the Zimbabwe Centre for High Performance Computing at the University of Zimbabwe-Picture:Joshua Muswere\n\nPolice Commissioner-General Steven Mutamba said the new system would bring about a modern way of handling criminal cases timeously and accurately.\n\nWe have been doing this manually, and you can imagine looking at the fingerprint lines manually, producing a magnifying glass. It takes time. In this day and age, we dont expect criminals to be waiting for us.\n\nWe have got to measure them through systems like the one that we have been shown. So, I would like to applaud the team for the steady work, and I would like to urge you to go further and develop more of these systems, he said.\n\nComm-Gen Mutamba said the new system was used in well-developed countries.\n\nThat is something that we have been longing for. When it comes to investigations, its not an easy thing to do, especially when you would like to identify persons that have committed crimes.\n\nYou will perhaps know, when someone has broken into premises, one of the critical pieces of evidence that is required is something that can show that Mr So-and-So or Ms So-and-So broke into someones property, he said.\n\nComm-Gen Mutamba said when police have a system that can pick up fingerprints at scenes of crime, then they were home and dry.\n\nWe can also do our investigations as quickly as people expect us to do, he said.\n\nPermanent Secretary in the Ministry of Higher and Tertiary Education, Innovation, Science and Technolgy Development Professor Fanuel Tagwira (left) is joined by the Zimbabwe Republic Police (ZRP) Comissioner General Stephen Mutamba (second from left) and the University of Zimbabwe Vice Chancellor Paul Mapfumo (right) as they are taken on a tour of facilities found at the Zimbabwe Centre for High Performance Computing at the University of Zimbabwe-Picture:Joshua Muswere\n\nNational police spokesperson Commissioner Paul Nyathi said roadblocks had always been part of policing.\n\nRoadblocks are there for smuggled goods, whether into or out of the country. You can also have roadblocks to account for moving criminals, including those who commit robbery cases.\n\nThen we can also have roadblocks for traffic management. Currently, we have an operation targeting mushikashika and lawlessness on the roads; that is why we have some roadblocks, he said.\n\nComm Nyathi said roadblocks were part of the ZRPs Constitutional mandate.\n\nThat is why we are appealing to all motorists to lead by example whether one is driving a family car, company car or a public service vehicle, he said.\n\nComm Nyathi also urged drivers to always adhere to road regulations.\n\nYou will not be killed for passing through a police checkpoint. If you have committed an offence, wait for the due process of the law to be followed.\n\nThere is no need to be militant, arrogant or confrontational, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Z1.jpg",
            "description": "Blessings Chidakwa and Remember Deketeke THE Zimbabwe Republic Police (ZRP) has gone digital and is creating an automated fingerprint identification system for smart policing that will make it easier to track criminals. Further, police roadblocks will remain in place as they are part of the force’s Constitutional mandate while an ongoing operation to eradicate illegal […]",
            "time": "06:32",
            "date": "25 Jan 2025"
        },
        {
            "title": "Hero Mupamhanga on final journey",
            "url": "https://www.herald.co.zw/hero-mupamhanga-on-final-journey/",
            "content": "Mukudzei Chingwere and Fungai lupande\n\nACTING President Dr Constantino Chiwenga will preside over the burial of national hero Cde Justin Mupamhanga at the National Heroes Acre in Harare on Monday.\n\nThe Acting President will stand in for President Mnangagwa who is on his annual leave, and is set to be accompanied by his wife Colonel Miniyothabo Chiwenga at the burial.\n\nCde Mupamhanga, a former Deputy Chief Secretary to the President and Cabinet, passed away on Wednesday at a Harare hospital, leaving behind a legacy of forthright public service and dedication to duty.\n\nIn a statement, the Ministry of Home Affairs and Cultural Heritage gave an update on his final journey, which saw his body being airlifted yesterday to Rukariro Farm in Matepatepa, Mashonaland Central Province, where it was set to lie in state before being moved to Farm 108 in Chesa, Mt Darwin.\n\nThe Ministry of Home Affairs and Cultural Heritage is advising the nation that the late National Hero and former Deputy Chief Secretary to the President and Cabinet, Cde Justin Mupamhanga, who died on 22 January 2025, will be laid to rest on Monday 27 January 2025 at the National Heroes Acre, reads part of the statement.\n\nThe Acting President, General (Rtd) Dr Constantino Chiwenga will preside over this burial. Tomorrow Saturday 25 January, 2025, from 1300hrs, the body of the late National Hero will be airlifted back to Harare where it will lie in state at Charles Gumbo Barracks. On Sunday, 26 January from 0900hrs, a church service in his honour will be conducted at Mabelreign Revelation-Methodist Church.\n\nThe body will pass through Inner City Methodist Church where he used to attend. The body of the late national hero will lie in state at 104 Drew Rd, Grange, Chisipite ahead of burial on Monday.\n\nThe body of the late national hero Cde Justin Mupamhanga was taken to his Rukariro Farm in Matepatepa and later to his rural home in the Chesa area, Mt Darwin where it will lie in state\n\nGovernment said on the burial date, gates will open at 6am at the national shrine and mourners are expected to be seated by 7am\n\nThe Government has invited the public to come and give a befitting farewell to the son of the soil and dedicated public servant.\n\nWhen his body arrived at Rukariro Farm in Matepatepa yesterday, it was warmly received by neighbours, family, and friends.\n\nCde Mupamhanga was described as a successful and passionate farmer who was willing to share his knowledge and practices with his colleagues.\n\nNeighbour, Mrs Loice Dhliwayo said Cde Mupamhanga was inspirational.\n\nHe inspired us as we witnessed how he was growing his business. We started believing that farming is a viable business. This is a depressing moment for us as his neighbours, she said.\n\nWhen he was with the Ministry of Energy, he convinced a lot of farmers in Matepatepa to join the Jatrofa project.\n\nAnother neighbour, Mr Gidfrey Chindito, said he started knowing Cde Mupamhanga in the Chesa area in Mt Darwin.\n\nAfter the liberation struggle, we worked together in Government. I learnt a lot, including discipline and respect. We became neighbour farmers and he taught me that discipline is also needed in farming, he said.\n\nThe national hero had a diversified farm doing dairy farming, poultry, piggery, fisheries and horticulture.\n\nAgritex supervisor Mr Misheck Muparagwa for Ward 3, 4 and 19 described Cde Mupamhanga as a prominent farmer.\n\nHe said Cde Mupamhanga left a legacy and transformed many farms into centres of excellence.\n\nThe body of the late national hero Cde Justin Mupamhanga was taken to his Rukariro Farm in Matepatepa and later to his rural home in the Chesa area, Mt Darwin where it will lie in state\n\nThe chief mourner in the province, Minister of State for Provincial Affairs and Devolution Christopher Magomo, said the province had lost a dedicated farmer who also championed developmental projects in Mashonaland Central.\n\nWe have lost a father figure in the province who was loyal until his death. We honour and cherish his life and we thank President Mnangagwa for honouring him, he said.\n\nHome Affairs and Cultural Heritage Minister Kazembe Kazembe said war veterans, including the late Cde Mupamhanga, created a better life for all Zimbabweans.\n\nHe was a mentor and advisor who worked tirelessly worked for the country.\n\nHis body was later transported to his rural home in the Chesa area of Mt Darwin, where it will lie in state.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/M1-2.jpg",
            "description": "Mukudzei Chingwere and Fungai lupande ACTING President Dr Constantino Chiwenga will preside over the burial of national hero Cde Justin Mupamhanga at the National Heroes Acre in Harare on Monday. The Acting President will stand in for President Mnangagwa who is on his annual leave, and is set to be accompanied by his wife Colonel […]",
            "time": "06:32",
            "date": "25 Jan 2025"
        },
        {
            "title": "First Lady counsels viral video pregnant girl (14)",
            "url": "https://www.herald.co.zw/first-lady-counsels-viral-video-pregnant-girl-14/",
            "content": "Tendai Rupapa, Senior Reporter\n\nIn a tear-jerking incident, pregnant with lessons for young girls, First Lady Dr Auxillia Mnangagwa yesterday held a heart-to-heart counselling session for a pregnant 14-year-old Chinhoyi girl who went viral on social media hurling insults at her mother who sought to take her back home.\n\nLured with rice and potatoes in addition to the promise of a better life, the young girl was impregnated by a married gold panner, Munyaradzi Musarurwa, who has now skipped court and is being sought by the police, leaving the minor in the lurch.\n\nMusarurwa appeared in court on 10 January where he pleaded guilty to having sexual intercourse with a young person. He was remanded out of custody for sentencing on January 14. He defaulted and is now on the run.\n\nBefore his departure, Munyaradzi had exposed the teenager to a polygamous union in which he made the three of them share a room with his wife.\n\nThe video clip in which the girl was verbally assaulting her mother and resisting her efforts to take her home, prompted Amai Mnangagwa to look for the minor to hear her side of the story and offer her the necessary counselling.\n\nAbove all, the First Lady made the young girl apologise to her mother and all mothers in Zimbabwe and make the correct choice of going back to school after giving birth.\n\nThe session comes at a time when Dr Mnangagwa has been holding educative Gota/Nhanga/Ixhiba sessions urging learners to shun romantic relationships and focus on their education for a brighter future.\n\nWhat you did is not good mwanangu in our eyes as mothers. At law, it is illegal that at 13 years you be involved in sexual activities. You started bedding men at 13 because you told me that you first slept with another man called Millard who was also arrested for the same offence.\n\nYou later left him for Munyaradzi and those are loose morals. When I asked how you performed in Grade Seven, you said you had 35 units. That is not a good performance. Do you know that this does not bode well for you? the First Lady said as she fought back tears during her counselling session with the minor.\n\nThe pregnancy is now advanced, the child needs upkeep and you can only return to school after giving birth. How many months will it take to give birth, look after the child, and go back to school? How old will you be? As mothers, we were pained as you spiritedly embarrassed your mother pamberi pevanhu. It prompted me to search for you and talk to you semwana. I then understood after you told methat the drink which you consumed which Munyaradzi gave you that day might have been laced with alcohol and it made you do so because that violence and the calmness you are exhibiting today are miles apart. You are now appreciating that you erred. But now you are pregnant, but at 14 this is difficult. You cannot deliver because you are young. Your body is not firm enough for childbirth. This means you shall be operated on or you shall have tears which we call fistula. You must register at the clinic. If you do not register now, you will have complications. Hona manje wave wega nemimba yako, Munyaradzi akatiza. Above all, you must apologise to your mother and all mothers countrywide. The way your mother gave birth to you is the same way that we all bore our children ndosaka tese takarwadziwa sana amai. I called you here out of pain that we could not keep quiet as you exhibited wayward behaviour. Ask for forgiveness from your mother, and advise other girls as a learning curve because 13-year-olds must not bed men. You shared the house with another woman and Munyaradzi at that tender age. Is that normal?\n\nThe girl responded: It was tough and there was no future.\n\nFirst Lady Dr Auxillia Mnangagwa fights back tears as the 14-year-old girl who recently went viral on social media insulting her mother, apologises and pleads with her wailing mother to forgive and accept her back home after they were reunited at Zimbabwe House yesterday\n\nAnd the First Lady asked her again: So what are you planning to do.\n\nShe said: I am thinking of going back to school.\n\nWhat of the pregnancy? You must first deliver. What will you do as you will be going to school? the First Lady continued.\n\nThe girl responded saying: I will be going to school with my baby ndichimbobuda muclass ndichimuyamwisa.\n\nThe First Lady then said: Now ask for forgiveness from your mother so that she accepts you back and will look after your baby when you go back to school.\n\nIt was a touching moment when she knelt before her mother asking for forgiveness with tears running down her cheeks.\n\nMhamha, I ask for forgiveness for all the things that I wronged you, did, and lied to you. You are my mother and I saw that a mother is important in everyones life. Now that I am pregnant, I ask you to welcome me back home. Amai makakosha, I have no one else to look up to kunze kwenyu imimi.\n\nNdirimwana ndakatadza zvikuru, handichade zvevarume futi kusvika ndapedza kudzidza. I promise to be a good girl. Musandirasewo mhamha, please forgive me, the girl said.\n\nThe girls mother also started crying as she embraced her daughter, a sign that she had forgiven her.\n\nMother and daughter in emotional hug after they were reunited by First Lady Dr Auxillia Mnangagwa at Zimbabwe House yesterday\n\nShe was also touched by the First Ladys intervention to reunite her with her daughter.\n\nMwanangu, I am glad that you have left all the bad things that you were doing. I want you to go back to school and learn the way other children do. I expect you to have a bright future and have something tangible that you will do in life. I will keep helping you but. You must have something in life and this comes from learning.\n\nThis is what I wished for you, this is what I still wish for you. I thank you, Amai, our First Lady for inviting us here and talking to us. I thank you for the love you have shown us that has made it possible for me to unite with my daughter. I was no longer staying with her as she was taken to a safe house. She hurled insults at me but saamai, I have forgiven her, the mother said.\n\nDr Mnangagwa also had words of encouragement for the girl and her mother.\n\nNow as a mother, you have a responsibility on your shoulders to look after the child. You have to see to it that you take her to the hospital to get registered for prenatal care so that she delivers properly. I shall assist you because as it stands the man responsible for this ran away and he is someone who was married, making them live in one room the three of them.\n\nThere is no positivity here and usually, a man will revert to his real wife and leave this girl, the way he ran away as we speak. If you want to find where Munyaradzi went, he is actually with his wife. This comes as I always say young children in this nation have become a menace. Vakumhanyira zvevakomana nguva isati yakwana. Men then abuse and run away. Like in this case, she was impregnated and dumped. This is why we emphasise that at school girls must look after themselves well. Munyaradzi is not crying at all, but this girl is the one in tears and has dropped out of school. Schoolchildren must remain in school because of the way we are living and where we are going, no man will accept a woman who did not go to school.\n\nNowadays men want someone who is helpful and has something to bring income. Young children must take heed. On my toll-free line 575, I am getting a lot of calls where people are crying about children who elope with their lovers between 13 and 14 years of age. Now listen vanangu, that should never be done. You heard the experience that mumwe wenyu has shared. During our time, we never grew up knowing that a 13-year-old child gets into bed with men.\n\nPregnancy has come and she is now asking for forgiveness. We do not want instances where children fall pregnant and ride on the strength of asking for forgiveness. A girl child must treasure her body as I usually say. Treasure yourself because the one who bears the brunt of it all is you the girl child. All girls of Zimbabwe, you heard your colleague speaking. She has been affected because she is pregnant at 14 and that is why I am saying ask for forgiveness from your mother and do not do the same again. We do not want to hear that you would have aborted. Give birth to your child and I will make a follow-up to find out how things would have fared. Do not sleep with men. You have pained us and embarrassed us as mothers. If you decide to live with your mother, please stay put. I think your mother has forgiven you because I heard her say so. I called you here because I was pained.\n\nAll mothers countrywide were pained and do not do this again, she said.\n\nWe were pained by what we saw on social media. We were not pleased by that state of affairs. You did what you could amai and we saw you pulling her so that she could come back home. You did your best and it affected us all that this woman has suffered as the child shouted that you do not buy me goods and do not look after me which she admitted today that she was lying. Your daughter said in her own words here that she was lying, the First Lady said.\n\nThe rescued girl shared her tale and warned other young girls against falling into the same trap as hers.\n\nI warn other young girls out there against bedding men at a tender age. This can only be done when you come of age because as of now it is not acceptable. Munyaradzi is a gold panner and does not value education. No man will want a wife who is not learned. Munyaradzi would make me sleep in the same room with his wife, she said amid sobs.\n\nI started dating a boy called Millard at 13. He is the one who first had sexual intercourse with me and when we did so, my mother took him to the police where he was arrested and brought before a court of law. He was ordered to perform community service and because my mother did not want me to be married at a tender age, she stopped our affair. When this happened, I then started dating Munyaradzi Musarurwa who was 31 as I was 13. I eloped to him and we first went to his relatives in Zvimba who advised me to go to his sisters place in Norton since his wife occasionally visited them. I spent a week in Norton before he started renting a place for me. He later took me to his house. In no time, my mother went to court to report the matter and started asking me to go back home, but I flatly refused. Within a week, I received a call that Munyaradzi had been arrested. I started running away as my mother ran after me. This then made the issue public. I fell for Munyaradzi because he would prepare rice for me and potatoes. I am now pregnant and he is nowhere to be found. I am stuck but I ask for forgiveness from my mother whom I wronged and to all mothers out there. Today I have been invited by the First Lady who advised me to ask for forgiveness since I embarrassed my mother and lied to her. I advise others to wait for the time to be ripe before engaging in romantic affairs. On that clip which went viral, Munyaradzi had offered me a drink laced with a substance that made me resist and overpower my mother and I ask for forgiveness, she said.\n\nThe First Lady gifted her mother with an assortment of foodstuffs and the girl was given maternity dresses as she could not fit properly the dress she was wearing because of pregnancy.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/FL1-2.jpg",
            "description": "Tendai Rupapa, Senior Reporter In a tear-jerking incident, pregnant with lessons for young girls, First Lady Dr Auxillia Mnangagwa yesterday held a heart-to-heart counselling session for a pregnant 14-year-old Chinhoyi girl who went viral on social media hurling insults at her mother who sought to take her back home. Lured with rice and potatoes in […]",
            "time": "06:32",
            "date": "25 Jan 2025"
        },
        {
            "title": "Govt targets 1 000 Presidential scholarship beneficiaries",
            "url": "https://www.herald.co.zw/govt-targets-1-000-presidential-scholarship-beneficiaries/",
            "content": "Talent Chimutambgi and Obey Musiwa\n\nAT LEAST 1 000 students are set to benefit from the Presidential Scholarship Programme this year.\n\nThe programme which is part of President Mnangagwas initiative, has seen a number of students who are less privileged benefiting countrywide.\n\nThe initiative is expected to propel the country towards vision 2030 targeting a prosperous upper-middle income economy through efficient human capital development and an industrialised country.\n\nOfficially opening the Study in India Education Fair 2025- Zimbabwe exhibition organised Ties Global Services Private Limited, executive director Presidential Scholarship Programme Mr Raymore Machingura said the initiative was targeting at least 1000 students who will benefit as part of efforts of bolstering industrialisation in order to attain a prosperous upper-middle economy.\n\nThe event which was aimed at educating advanced level students on selection of subjects which will suit careers of their passion when proceeding to university level, saw pupils from various schools converging in Harare yesterday.\n\nMore than 10 institutions from India were represented for the career guidance.\n\nMr Machingura highlighted that the Government was targeting STEM based programmes, insisting this was at the core of President Mnangagwas message of ensuring production in the country.\n\nWe are targeting 900 to 1000 students this year in the area of medical and engineering. Another area that is critical to the future development of Zimbabwe is STEM (Science, Technology, Engineering, and Mathematics) education, said Mr Machingura.\n\nA country without production cannot go anywhere, this is the reason why President Mnangagwa emphasises on production in most of his messages, he said.\n\nMeanwhile, Indian Ambassador, Mr Bramha Kumar paid a courtesy call to Minister of Defence, Oppah Muchinguri Kashiri at her Defence House offices yesterday.\n\nZimbabwe and India have committed to defence and security cooperation, in a move aimed at boosting security between the two nations.\n\nThe two discussed various defence areas include training exchange programmes that will see security forces from the two nations interacting in various fields of mutual cooperation such as exchange of military intelligence, joint military exercises, military sports, social and cultural activities and exchange and transfer of military technology and skills.\n\nMinister Muchinguri-Kashiri said the meeting was a milestone achievement in the history of bilateral relations between the two nations, which started during the fight against colonialism decades ago.\n\nOur meeting today (yesterday) demonstrates the seriousness we attach to the historical relations between our two countries, which were nurtured long ago, she said.\n\nMinister Muchinguri-Kashiri said she has been invited to India next month to sign a Memorandum of Understanding between the two nations.\n\nAmb Kumar concurred saying relationship between the two nations continue to grow from strength to strength.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/OM-1.jpg",
            "description": "Talent Chimutambgi and Obey Musiwa AT LEAST 1 000 students are set to benefit from the Presidential Scholarship Programme this year. The programme which is part of President Mnangagwa’s initiative, has seen a number of students who are less privileged benefiting countrywide. The initiative is expected to propel the country towards vision 2030 targeting a […]",
            "time": "06:32",
            "date": "25 Jan 2025"
        },
        {
            "title": "EDITORIAL COMMENT – ZIFA polls: Football must emerge stronger",
            "url": "https://www.herald.co.zw/editorial-comment-zifa-polls-football-must-emerge-stronger/",
            "content": "TODAY should mark another milestone in the governance and development of Zimbabwes football.\n\nThis is because the Zimbabwe Football Association (ZIFA) Congress, the domestic games top-policy meeting, will converge in Harare for an elective assembly where a new president will be voted into office on a four-year mandate.\n\nSince July 11, 2023 when world football controlling body FIFA announced that they were lifting Zimbabwes 18-month suspension from the international game, ZIFA have been like a company under judicial management.\n\nIn lifting Zimbabwes suspension, FIFA tasked Lincoln Mutasa with chairing a Normalisation Committee\n\nA Normalisation Committee is known to be a group of people appointed by FIFA to run a football associations day-to-day operations.\n\nThe committees responsibilities include restructuring the associations administration, reviewing its statutes, and ensuring elections are held.\n\nThus, Mutasa and his committee have been hard at work, starting with the restructuring of the secretariat, appointments of national teams coaches and overseeing a Congress-driven amendment of the ZIFA statutes.\n\nToday, Mutasa is expected to complete his last big task at ZIFA in terms of the mandate he received from FIFA by standing as the Electoral Committee and presiding over the elections to choose six board members, two vice-presidents and a president.\n\nAs reported elsewhere in this publication, it is an epochal election, one whose aftermath should result in the transformation of ZIFA into the kind of football association which this country yearns for.\n\nAn association that exhibits the tenets of corporate governance and priorities development from the grassroots to the elite level.\n\nWe believe that everyone else has so far done his and her part and the onus is now on the Congress delegates popularly known as the Councillors to deliver the right leadership for ZIFA today.\n\nPresidents and board members have come and gone, often taking the blame for ZIFAs problems with councillors somehow, getting away with murder.\n\nToday the 78 councillors, who are expected to cast their ballots owe it not just to the candidates who have been canvassing for votes but to the entire nation, to the government, COSAFA, CAF and FIFA to ensure ZIFA will not relapse, post this election.\n\nFootball and only football must be the biggest winner from todays milestone event.\n\nWhile they may have a tainted past, of selling their souls and voting with their stomachs, the election today provides the ZIFA Congress with a perfect platform to re-package themselves.\n\nZimbabweans are expecting an election that will unite ZIFA more than one that will in the end plunge local football into more problems and invite FIFA and government intervention again.\n\nWe believe the men and women who have been entrusted by their respective ZIFA affiliate members to vote, have some principles, are ethical and professional enough to ensure that the only victor is football.\n\nYes, the six candidates lining up for the post of president  Marshall Gore, Martin Kweza, Philemon Machana, Nqobile Magwizi, Twine Phiri and Makwinji Soma-Phiri  are all capable of running ZIFA.\n\nBut only one of them will secure the mandate of the Congress and that winner must be supported throughout his four-year term.\n\nThe idea of some losers immediately ganging up against the winner to make football ungovernable is the kind of attitude that can only serve to drag the game into the abyss.\n\nFootball development is not an overnight event, but a process that needs careful planning, the right strategies and backed by smart partnerships with private and public institutions.\n\nThat ZIFA is a broken institution needing massive restructuring is evident for all to see.\n\nFortunately, FIFA through the Normalisation Committee have laid a strong platform for the incoming executive from which they can start.\n\nThe countrys flagship sporting team  the Warriors are in a healthy state  having not only qualified for the Africa Cup of Nations but enjoying the kind of tranquillity that is conducive for the production of a winning team.\n\nThanks to FIFA, German expatriate coach Michael Nees is on an initial two-year deal in which the world body is taking care of his welfare.\n\nThis means that if by chance the incoming executive were to do the unthinkable and immediately change the coach, it is FIFA who will pay off Nees.\n\nDespite playing all their qualifiers away from home, the Warriors have been able to travel on time and be well remunerated with their bonuses also being timeously paid.\n\nSo, it is incumbent on the councillors to make all such considerations in choosing a leadership that will ensure ZIFA continue on the new slate that they have been enjoying, even when Mutasa and his committee of Rosemary Mugadza and Nyasha Sanyamandwe have long packed their bags and gone.\n\nIf successive executive committees at ZIFA failed to foster a sense of unity and purpose within the association, the 78 delegates have an opportunity to right some of those wrongs.\n\nGiven that previous administrations of ZIFA also failed to align the activities of the association to its core business, it incumbent upon the councillors to shun corruption and ensure after today the domestic football mother body will have men and women who drive development and produce outcomes that are not contrary to its purpose.\n\nMay the best men and men make into the ZIFA First XI.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Mutasa.jpg",
            "description": "TODAY should mark another milestone in the governance and development of Zimbabwe’s football. This is because the Zimbabwe Football Association (ZIFA) Congress, the domestic game’s top-policy meeting, will converge in Harare for an elective assembly where a new president will be voted into office on a four-year mandate. Since July 11, 2023 when world football […]",
            "time": "06:32",
            "date": "25 Jan 2025"
        },
        {
            "title": "Hexco results out",
            "url": "https://www.herald.co.zw/hexco-results-out-25/",
            "content": "Trust Freddy, Herald Correspondent\n\nRESULTS of the October/November 2024 National Foundation Certificate (NFC) to Higher National Diploma (HND) examinations conducted by the Higher Education Examinations Council (HEXCO) are now available.\n\nHEXCO centres have been advised to begin collecting results from respective regions starting Wednesday, January 29, 2025.\n\nIn a statement yesterday, Permanent Secretary for Higher and Tertiary Education, Innovation, Science and Technology Development, Professor Fanuel Tagwira, said there was a significant improvement in the pass rate, with 67 percent of students achieving success.\n\nProf Tagwira thanked all stakeholders involved in the examination process, especially for the significant pass rate.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Hexco.jpg",
            "description": "Trust Freddy, Herald Correspondent RESULTS of the October/November 2024 National Foundation Certificate (NFC) to Higher National Diploma (HND) examinations conducted by the Higher Education Examinations Council (HEXCO) are now available. HEXCO centres have been advised to begin collecting results from respective regions starting Wednesday, January 29, 2025. In a statement yesterday, Permanent Secretary for Higher […]",
            "time": "06:32",
            "date": "25 Jan 2025"
        },
        {
            "title": "An ode to radio teacher, eloquent newsreader Esau",
            "url": "https://www.herald.co.zw/an-ode-to-radio-teacher-eloquent-newsreader-esau/",
            "content": "John Masuku, Correspondent\n\nWhen Jane Esau began presenting some primary school radio lessons in the late 1960s, many listeners always visualised a mixed race English-speaking young lady who had mastered fluency and the correct pronunciation of indigenous names.\n\nEsau died at her Marlborough home in Harare on January 17, and was buried on Tuesday at Glen Forest Memorial Park.\n\nShe was 91.\n\nA talented broadcaster blessed with a charming voice, I first met her as a learner at Shingirai Primary School in Mbare when she was still a young teacher in the 1960s. However, over a decade later, she had forgotten me when both of us were employed by ZBC with her as an announcer and newsreader on Radio One, the former English Service, while I worked as a sub editor, radio and television reporter in the News Department, recalled seasoned journalist and author John Gambanga.\n\nSwitzerland-based retired senior International Red Cross nurse Lorraine Mangwiro and her former Shingirai classmates recall how they enjoyed listening to their own class teacher during radio lessons.\n\nEsau, whose family background was Malawian, was born and raised in Penhalonga, Manicaland.\n\nBack in 1982, she narrated to me her life history during an interview for Look and Listen radio and television magazine.\n\nWhen I was about seven years old, the then Penhalonga Postmaster was looking for a black girl to be part of his family, not as a domestic worker. My parents responded to this offer and I spent the next few years playing with the Postmasters daughter and being cared for by her parents. I owe all my fluent spoken English to that family.\n\nEsau said the gesture brought relief, especially on clothes and school fees.\n\nGOING DOWN MEMORY LANE . . . John Masuku discusses with Jane Esau on her birthday over a cup of tea\n\nAfter completing her secondary education at Hartzell High School near Mutare, young Jane decided to go for two-year teacher training at Morgenster Mission in Masvingo.\n\nGiving a testimony at Esaus funeral, Mrs Analisa Nhende(nee Makoni) a member of the St Pauls Anglican Church Marlborough parish where Esau worshipped, revealed some age-old gender inequalities which still beg for final eradication until this day.\n\nI am here representing my 93-year-old Gweru-based father Mr Sinfree Japhinos Makoni, who was Gogo Janes classmate at Morgenster Mission Teachers Training College.\n\nTheir group comprised of 12 students with her being the only woman. Armed with fluency in spoken English and chiManyika, she was a self-assured no toss-around person. In fact, daddy said Gogo was the one who always confidently led the whole group whenever required to sing in public she explained.\n\nCompleting her teacher training course in 1955, Esau taught at various schools in Manicaland, including St Davids Bonda High School and St Matthias Tsonzo.\n\nShe also taught in Marondera before going to Shingirai in Harare National now Mbare where her former classmate Makoni was the headmaster.\n\nIn 1968, Esau was engaged on a part time basis by the Audio Visual Services (AVS) in Mount Pleasant under the Ministry of Primary and Secondary Education to present radio lessons which were aired on RBC African Service at the Harare Studios and listened to in schools all over the country.\n\nI first met her in April 1974, the month I joined RBC African Service as a broadcaster.\n\nShe was in the company of AVS boss John Parry, a former BBC director, when they came to drop radio lessons tapes at Harare Studios.\n\nEsau had left the classroom the same year to join AVS permanently to continue only as a full time radio teacher.\n\nWhile at AVS, later working under David Gardiner, Esau did part time commercial programmes like the unforgettable In The Kitchen With Jane and The Sweet Life.\n\nIn September 1981, Jane Esau joined ZBC Radio One (Spot FM, now Classic 263) and worked under managers like James Robinson, Tony Gaynor, Patrick Nyamhunga before I was appointed to head the station 1991.\n\nIn my eulogy at the requiem mass, I said that besides news reading and on-air continuity presentations, Esau understood Radio Ones sophisticated variety of genres, including classical music making one think that she was born and raised somewhere in Austria.\n\nWhile at ZBC, she once toured Germany to meet and exchange notes with like-minded European broadcasters.\n\nFormer workmates of Esau who also spoke included her all weather friend, advertising executive Praxedes Dzangare who she met in the 1970s during part-time commercial programming at a private Salisbury production house, Advertising Promotions Limited (APL).\n\nTsitsi Dangarembizi applauded Auntie Jane for her kind, patient mentorship approach.\n\nOver many years, Jane Esaus fellow broadcasters included Brighton Matewere, Noreen Welch, Carolyn Thonycroft, Radar Naidu, Obert and Lily Mandimutsira, Colin Harvey, Jill Darke, Jack Day, Craig Hamilton, Joan Freeman, Penny Lumley, Sophie Chamboko, Comfort Mbofana, Tsitsi Vera, Audrey Mpunzwana, Farai Mungazi, Kelvin Sifelani, Isabella Matambanadzo, Bill Francklin, Phatutshedzo Hwacha (Moyo), Christine Ndlovu and Terry Yates-Round among many others.\n\nFrom different international bases, some of Janes former workmates were full of praise for her.\n\nJane had such a youthful spirit and was such fun, said Sophie Chamboko from South Africa\n\nFrom Australia, fellow newsreader and presenter Jill Baker, who also owned Jill Baker Associates Advertising Agency, emotionally recalled their happy time  together.\n\nWe spent many years working together at APL, RBC/ZBC. Apart from being such a fine broadcaster, she had warmth and a loving spirit about her that was infectious.\n\nThe velvety voice never diminished. I am one of her beneficiaries of radio lessons which improved African education in the countryside during the colonial days, remarked former radio and television news reporter Fortunate Hove Cooper from the USA.\n\nNotable among the mourners were Mutasa brothers Lincoln, Chairman of the ZIFA Normalisation Committee and Shingi proprietor of Joina City Shopping Complex.\n\nEsau was once married in their family and her children bear the Mutasa surname.\n\nI last visited Jane Esau on June 15, 2022.\n\nShe could not hide her excitement as we traced our long, exciting broadcasting journey, cutting across many colonial and post-Independence generations.\n\nJohn Masuku is the former ZBC head of Radio One and Controller Radio Services.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Esau.jpg",
            "description": "John Masuku, Correspondent When Jane Esau began presenting some primary school radio lessons in the late 1960s, many listeners always visualised a mixed race English-speaking young lady who had mastered fluency and the correct pronunciation of indigenous names. Esau died at her Marlborough home in Harare on January 17, and was buried on Tuesday at […]",
            "time": "06:32",
            "date": "25 Jan 2025"
        },
        {
            "title": "3 artisanal miners jailed for killing colleague",
            "url": "https://www.herald.co.zw/3-artisanal-miners-jailed-for-killing-colleague/",
            "content": "Patrick Chitumba, Midlands Bureau\n\nTHREE artisanal miners from Zhombe in the Midlands Province were on Wednesday sentenced to two years in prison each by the High Court for killing a fellow miner with a knobkerrie during a dispute over gold ore.\n\nRonny Fuzane (19), his brother Prosper (18), and Maxwell Sibanda (19) were convicted of culpable homicide by Justice Naison Chivhayo.\n\nJustice Chivhayo was sitting on circuit at the Bulawayo High Court in Gweru.\n\nCulpable homicide means the accused were to blame for the death through taking action that a reasonable person would realise could lead to serious injury or death, but had no intention to kill.\n\nThe three miners, all from Village 14 under Chief Ntabeni, Zhombe, had initially been charged with murder following the death of Herbert Nyoni (30), also of Village 14.\n\nHowever, they pleaded guilty to a lesser charge of culpable homicide and convicted of their plea.\n\nThey were each sentenced to three years in prison, with one year conditionally suspended for five years, leaving them to serve an effective two years.\n\nIn sentencing, Justice Chivhayo considered their ages and the compensation they paid to Nyonis family.\n\nThe court has considered the youthfulness of the accused persons and that they have been convicted of culpable homicide.\n\nThe court has also considered that the accused paid compensation to the family of the deceased, he said.\n\nProsecutor Ms Linah Mamombe told the court that on September 17 , 2022, around 1pm, Fuzane brothers Ronny and Prosper were at Sibandas home when Nyoni and his friend, Knowledge Chipatiso, arrived, accusing them of stealing gold ore.\n\nNyoni was armed with a knobkerrie and an axe, while Chipatiso carried a knife.\n\nAt the time, Sibanda was bathing, while the Fuzane brothers were in the backyard.\n\nNyoni and Chipatiso went to the bathroom to confront Sibanda.\n\nAfter a brief conversation, Nyoni struck Sibanda on the forehead with a knobkerrie and fled.\n\nSibanda and the Fuzane brothers pursued Nyoni and Chipatiso.\n\nThe brothers armed themselves with half-bricks during the chase.\n\nRonny struck Nyoni with a brick, causing him to fall.\n\nSibanda then returned, disarmed Nyoni, and struck him on the side of the head with a knobkerrie, rendering him unconscious.\n\nThe incident was reported to the police, leading to the trios arrest.\n\nIn their defence, the accused said they acted in self-defence as Nyoni had been the aggressor.\n\nThey acknowledged, however, that their actions led to his death, leading to their sentence.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/12/court-hammer.jpg",
            "description": "Patrick Chitumba, Midlands Bureau THREE artisanal miners from Zhombe in the Midlands Province were on Wednesday sentenced to two years in prison each by the High Court for killing a fellow miner with a knobkerrie during a dispute over gold ore. Ronny Fuzane (19), his brother Prosper (18), and Maxwell Sibanda (19) were convicted of […]",
            "time": "06:32",
            "date": "25 Jan 2025"
        }
    ]
}