{
    "news": [
        {
            "title": "Russia backs Zim UN Security Council bid",
            "url": "https://www.herald.co.zw/russia-backs-zim-un-security-council-bid/",
            "content": "Wallace Ruzvidzo, Herald Reporter\n\nZIMBABWEs bid for a non-permanent seat on the United Nations Security Council (UNSC) has received a major boost after Russia announced its support for the country.\n\nRussian Ambassador to Zimbabwe Mr Nikolai Krasilnikov yesterday paid a courtesy call on President Mnangagwa at State House in Harare, to convey a message from his counterpart President Vladmir Putin as well as Russias support for Zimbabwes bid.\n\nZimbabwe will be bidding for a non-permanent seat on the UNSC for the period 2027 and 2028, a move that has been endorsed by various countries, including Cuba and India.\n\nSADC has also backed the country, along with other regional bodies.\n\nIn an interview after their closed door meeting, Amb Krasilnikov said Russia was not only supporting Zimbabwes bid, but looking forward to working with Zimbabwe on the UNSC to usher in a more democratic multipolar world.\n\nWe look forward to having Zimbabwe as a United Nations Security Council non-permanent member very soon and we are confident that together we can intensify our efforts of establishing a new, more just and democratic multipolar world, he said.\n\nThe UN Security Council has five permanent members, namely China, France, Russia, the United Kingdom, and the United States of America.\n\nThe non-permanent members serve on a rotational basis.\n\nRussian Ambassador to Zimbabwe Mr Nikolai Krasilnikov speaks to the media after paying a courtesy call on President Mnangagwa in Harare yesterday\n\nTo pass a resolution, at least nine of the 15 members must vote in favour. However, any of the five permanent members can veto a resolution, and it is in this context that Amb Krasilnikov said there is a need for like-minded progressive nations on the powerful UN body.\n\nYou know that together we promote very important resolutions in the United Nations, like for example the UN resolution against glorification of Nazism, neo-Nazism and other forms of racism.\n\nThis issue is very important for Russia and like-minded countries, including Zimbabwe, especially this year when we celebrate and commemorate together the 80th anniversary of the victory in the Great Patriotic War that facilitated the end of the Second World War, the establishment of the United Nations and the triumph of the liberation movements across the globe, including in Africa, he said.\n\nZimbabwe last served on the UNSC between 1991 and 1992 and before that from 1983 to 1984.\n\nThe Russian envoy said the existing cordial relations between President Mnangagwa and President Putin continued to be the backbone of Harare and Moscows increasing bilateral co-operation and partnership on the global stage.\n\nThe political dialogue between our principals reflects the very deep, very intense and at the same time very cordial relations between President Mnangagwa and President Putin and also between our two brotherly nations.\n\nIt also gives impetus to the whole mechanism of our bilateral co-operation. We enhance our partnership along various directions, including the very close, deep co-ordination in the international arena, he said.\n\nThe Russian ambassador said both countries were satisfied with the existing sound political relations which continued to be mutually beneficial.\n\nWe are happy with the quality and the essence of our political dialogue, our mutual comprehension of the current situation in the world and we are absolutely confident that together we can move forward not only in terms of co-ordinating our political agendas but also in terms of developing tangible co-operation to produce certain results for the benefit of our brother nations, he said.\n\nAmbassador Krasilnikov said Russia was also appreciative of Zimbabwes efforts in fostering peace in the region.\n\nWe highly appreciate and recognise the very significant role Zimbabwe plays in SADC as the chair of SADCthat was demonstrated by the recent (SADC) Extraordinary Summit held in Harare on a very crucial topic of a peaceful settlement in the eastern DRC, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/HE.jpg",
            "description": "Wallace Ruzvidzo, Herald Reporter ZIMBABWE’s bid for a non-permanent seat on the United Nations Security Council (UNSC) has received a major boost after Russia announced its support for the country. Russian Ambassador to Zimbabwe Mr Nikolai Krasilnikov yesterday paid a courtesy call on President Mnangagwa at State House in Harare, to convey a message from […]",
            "time": "06:31",
            "date": "04 Feb 2025"
        },
        {
            "title": "Mash West recommends  Geza’s expulsion from Zanu PF",
            "url": "https://www.herald.co.zw/mash-west-recommends-gezas-expulsion-from-zanu-pf/",
            "content": "Conrad Mupesa, Mashonaland West Bureau\n\nZANU PF Mashonaland West province has unanimously recommended the expulsion of renegade war veteran and Zanu PF Central Committee member, Cde Blessed Geza, from the party.\n\nAt the same time, the War Veterans League has also denounced Cde Geza, slamming him for attacking President Mnangagwa.\n\nIn Mashonaland West, the recommendation to expel Cde Geza was made at a meeting held at the North Court in Zvimba East Constituency yesterday that attracted thousands of supporters from grassroots to senior party levels.\n\nDuring the meeting, calls to expel Cde Geza for undermining and threatening President Mnangagwa were loud and unanimous.\n\nZanu PF Politburo member and Justice, Legal and Parliamentary Affairs Minister, Cde Ziyambi Ziyambi, who addressed the crowd, said the decision to expel Cde Geza stems from the utterances he made abusing the name of the party.\n\nIndividuals are allowed to democratically air their grievances but using the name of the party and ones position to attack our leadership is uncalled for. The attack on President Mnangagwa by Cde Geza shows that he is not well versed with the partys constitution which calls for members to respect their leaders.\n\nWe cannot fold our hands and let Cde Geza go haywire. If he wanted to denounce the President, he should have waited for the partys Congress slated for 2027, where any member is allowed to challenge the sitting First Secretary and President as we elect a new leader and presidential candidate, he said.\n\nOur partys constitution, and specifically Article 3, requires us to be honest and loyal to Zanu PF and its leaders who were elected by the masses.\n\nCde Geza, who was also castigated for boycotting Provincial Co-ordinating Committee (PCC), Provincial Executive Committee (PEC) and Central Committee meetings, was accused of dragging people of Mashonaland West into his unfounded claims against the President.\n\nNobody in Mashonaland West is supporting his shenanigans, as a province, we solidly stand firm behind the resolution to extend the Presidents second term by two years so that he realises his Vision 2030. We have since resolved to recommend the expulsion of Cde Geza, and the National Chairman, Cde Oppah Muchinguri, is seized with our decision. It now lies with the National Disciplinary Committee, Cde Ziyambi said.\n\nThe party, he noted, was also going to deal with rogue elements that attack the Presidium.\n\nProvincial chairman, Cde Mary Mliswa-Chikoka, said the utterances by Cde Geza were treasonous, hence the decision by the province to expel him.\n\nCde Geza has been out of line for a long time and if he wants to attack our President, he should leave Zanu PF and oppose him freely. Cde Geza isnt the voice of Zanu PF in Mashonaland West.\n\nWe are solidly behind President Mnangagwa, and as Mashonaland West, we have recommended that Cde Geza be expelled, she said.\n\nZanu PF central committee member and Minister of State for Provincial Affairs and Devolution Cde Marian Chombo, who is also a member of the National Disciplinary Committee, urged Cde Geza to publicly retract his utterances and apologise before the committee takes action against him.\n\nCde Geza should publicly retract his statements and apologise to the Mashonaland West public before we take any action against him, she said.\n\nProvincial Youth Chairperson Cde Tapiwa Masenda and Womens League Chairlady Cde Constance Shamu said the two leagues were solidly behind President Mnangagwa and condemned Cde Gezas stance.\n\nWe will not fold our hands and let Geza attack our President. As the vanguard of the party, we are warning Cde Geza against his utterances, the youth chairperson said.\n\nCentral committee members from Sanyati political administration district Cdes Thomson Sanangurai, Absolom Zvidzai and Ephraim Chengeta castigated Cde Gezas rants and recommended his expulsion from the party.\n\nIn an interview in Harare yesterday, the partys Secretary for War Veterans, Ex-Political Prisoners, Detainees, and Restrictees, Cde Douglas Mahiya, said the decision to extend President Mnangagwas term of office beyond 2028 reflects the will of the majority and seeks to ensure the President completes his vision of transforming Zimbabwe into an Upper Middle-Income Society by 2030.\n\nThere is no war veteran, or any authority claiming ownership of participating in the liberation struggle who can tell the party what to do, for as long as you are a group of people and you are not the majority.\n\nAnd we also have this principle of the revolution, which says the minority is subordinate to the majority. So that principle tells you that there is no group of people who will decide what the party in Zimbabwe will do, but the party decides collectively, responded Cde Mahiya to a question on what the League will do regarding Cde Geza.\n\nThe ruling party has started implementing resolutions from the 2024 Annual National Peoples Conference with the Second Republic having received plaudits for availing title deeds to land owners.\n\nThe decision has also been made to start implementing the process for term extension for President Mnangagwa.\n\nMeanwhile, the Zanu PF Masvingo provincial executive has suspended Gutu East Member of Parliament Cde Benjamin Ganyiwa and Chiredzi North National Assembly member Cde Roy Bhila for allegedly bringing the name of the party into disrepute and fanning division among party members.\n\nCde Bhila serves as the partys provincial Secretary for Finance while Cde Ganyiwa is the partys provincial Secretary for Business Development.\n\nCde Ganyiwa is facing four charges, including holding a secret meeting at his homestead without informing district and provincial party structures, which the party considered as an act of disloyalty.\n\nAdditionally, Cde Ganyiwa allegedly promoted factionalism by inviting members from other constituencies to the meeting.\n\nThe partys provincial chairman, Cde Robson Mavhenyengwa, said the two were issued with prohibition orders and are not allowed to carry out any party business unless their alleged cases are cleared at the National Disciplinary Committee.\n\nCde Mavhenyengwa said no individual is above the partys rules and regulations.\n\nNo one is bigger than the party, the disciplinary process will be followed through, regardless of ones position within the party, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Ziyambi.jpg",
            "description": "Conrad Mupesa, Mashonaland West Bureau ZANU PF Mashonaland West province has unanimously recommended the expulsion of renegade war veteran and Zanu PF Central Committee member, Cde Blessed Geza, from the party. At the same time, the War Veterans League has also denounced Cde Geza, slamming him for attacking President Mnangagwa. In Mashonaland West, the recommendation […]",
            "time": "06:31",
            "date": "04 Feb 2025"
        },
        {
            "title": "Road maintenance units resuscitated",
            "url": "https://www.herald.co.zw/road-maintenance-units-resuscitated/",
            "content": "Freeman Razemba, Senior Reporter\n\nTHE Government has secured new equipment, including tractors, to resuscitate road maintenance units across the country.\n\nThis effort seeks to ensure consistent monitoring and maintenance of roads reconstruction under the Emergency Road Rehabilitation Programme Phase 2 (ERRP2), reflecting the Second Republics commitment to infrastructure development.\n\nIn addition to reviving road maintenance units, plans are underway to establish asphalt plants nationwide to complement these efforts.\n\nThe road maintenance units, which fall under the Ministry of Transport and Infrastructural Development, consist of 180 units.\n\nRecently, the Zimbabwe National Roads Administration (ZINARA) secured two million litres of fuel to assist road authorities with their projects, a measure aimed at alleviating challenges in procuring fuel.\n\nYesterday, Transport and Infrastructural Development Minister Felix Mhona, accompanied by Deputy Minister Joshua Sacco, Permanent Secretary Engineer Joy Makumbe, and other officials, launched the resuscitation initiative in Harare.\n\nThe minister first commissioned tractors purchased from HASST Zimbabwe, before announcing the operational responsibilities of the road maintenance units.\n\nAs a ministry, we have started this project to ensure that while we rehabilitate our roads, we also maintain them, said Minister Mhona. It was a directive from Cabinet to resuscitate all our Road Maintenance Units.\n\nThe programme will ensure that all 10 provinces receive tractors and equipment for road maintenance. These units will provide essential first-line services to significantly reduce road deterioration and maintain quality roads.\n\nMinister Mhona said they have also procured road marking machines to improve visibility, especially at night.\n\nHe called for continued collaboration among parastatals like ZINARA and the Traffic Safety Council of Zimbabwe.\n\nRegarding the establishment of asphalt plants, Minister Mhona said the goal is to produce essential materials domestically rather than relying on imports.\n\nThe initiative seeks to ensure that each province has an asphalt plant, with Bulawayo and Harare already receiving procurement and delivery.\n\nThe chairperson of the Portfolio Committee on Transport and Infrastructural Development, Cde Tawanda Karikoga, said he was confident that the newly acquired tractors will enhance road maintenance efforts, leading to improved road safety and accessibility.\n\nThe Managing Director of HASST Zimbabwe, Mr Walter Chigwada, commended the Governments recognition of local companies, adding that they will in turn source materials locally to support the countrys economy.\n\nThe resuscitation of road maintenance units is seen as a crucial step in strengthening the countrys infrastructure, which is vital for achieving the vision of becoming an upper-middle-income society by 2030.\n\nRoad construction is recognised as a key economic enabler, and these initiatives aim to support sustainable development across the nation.\n\nTransport and Infrastructural Development Minister Felix Mhona, on taste drive during a commission of road mantanance tractors for the department of roads at the Department of Roads Mantanance Camp in Harare yesterday.- Picture: Charles Muchakagara\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Mhona.jpg",
            "description": "Freeman Razemba, Senior Reporter THE Government has secured new equipment, including tractors, to resuscitate road maintenance units across the country. This effort seeks to ensure consistent monitoring and maintenance of roads reconstruction under the Emergency Road Rehabilitation Programme Phase 2 (ERRP2), reflecting the Second Republic’s commitment to infrastructure development. In addition to reviving road maintenance […]",
            "time": "06:31",
            "date": "04 Feb 2025"
        },
        {
            "title": "90 schools, 380 blocks constructed in 2024",
            "url": "https://www.herald.co.zw/90-schools-380-blocks-constructed-in-2024/",
            "content": "Conrad Mupesa, Mashonaland West Bureau\n\nThe Government, in partnership with private stakeholders, constructed 90 new schools and over 380 classroom blocks across the country in 2024.\n\nThe initiative aims to reduce the distance learners travel to access education and introduce climate-resilient infrastructure to withstand harsh weather conditions.\n\nPrimary and Secondary Education Minister Torerayi Moyo made the revelation during a visit to Matarutse Primary School in Mhondoro-Mubaira Constituency.\n\nHe said construction of schools aligns with the National Development Strategy 1 and President Mnangagwas Vision 2030, which prioritises accessible and quality education for all.\n\nMinister Moyo highlighted the dire state of many schools, particularly in rural areas, where aging infrastructure has been further damaged by extreme weather conditions.\n\nIn Mhondoro-Mubaira, for instance, parents have raised concerns about the safety of their children due to dilapidated classrooms.\n\nTo address this, Government plans to construct two new schools in the constituency and introduce a climate-resilient classroom model designed to withstand the effects of climate change.\n\nWe intend to increase the number of schools, especially in communities where learners travel over 5 kilometres to access education, said Minister Moyo.\n\nHe commended President Mnangagwa for prioritising funding for construction of schools and renovations, noting that additional resources from the 2025 Budget will be allocated to refurbish schools in poor condition.\n\nMhondoro-Mubaira legislator Cde Chamu Chiwanza said there is need for urgency to address infrastructure gaps, adding that inadequate facilities have negatively impacted learners performance.\n\nIn a show of support for President Mnangagwas call for citizen participation in nation-building, Cde Chiwanza donated building materials for the construction of classroom blocks at Matarutse and other schools in his constituency.\n\nParents welcomed the Governments intervention, expressing relief at the prospect of safer learning spaces for their children.\n\nOur children need proper classrooms, especially during the rainy season. The current situation is dire, and we are grateful for the planned construction of new schools, said one parent.\n\nThe Governments efforts extend beyond Mhondoro-Mubaira, with plans to construct an additional 50 schools in 2025 through donor funding.\n\nThis expansion is expected to further reduce classroom congestion and improve access to education in underserved areas.\n\nThe construction of 90 schools and hundreds of classroom blocks in 2024 marks a significant step in addressing Zimbabwes educational infrastructure challenges.\n\nBy prioritising climate-resilient designs and community involvement, the Government is working to create safer, more conducive learning environments for students across the country.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/02/Cde-Torerayi-Moyo.jpg",
            "description": "Conrad Mupesa, Mashonaland West Bureau The Government, in partnership with private stakeholders, constructed 90 new schools and over 380 classroom blocks across the country in 2024. The initiative aims to reduce the distance learners travel to access education and introduce climate-resilient infrastructure to withstand harsh weather conditions. Primary and Secondary Education Minister Torerayi Moyo made […]",
            "time": "06:31",
            "date": "04 Feb 2025"
        },
        {
            "title": "South Africa’s land stance riles Trump",
            "url": "https://www.herald.co.zw/south-africas-land-stance-riles-trump/",
            "content": "Nqobile Tshili, Bulawayo Bureau\n\nDESPITE numerous challenges, chief among them illegal Western sanctions, Zimbabwe stands out as a notable example of successful land reclamation in Africa, as South Africas land reform policies face scrutiny from the United States.\n\nSouth Africas recently signed land expropriation without compensation law has attracted attention and criticism from the United States which has emphasised the importance of maintaining a balance between land redistribution and the protection of property rights to ensure investor confidence and economic growth.\n\nAnalysts and political leaders have condemned US President Donald Trumps attempts to pressure the South African government, describing his stance as unwarranted interference in African governance.\n\nPosting on his X account, President Trump, who recently assumed office for his second term, accused South Africa of confiscating land and discriminating against certain groups, labelling the new law a massive human rights violation.\n\nHe further threatened to cut all future funding to South Africa until a full investigation into the matter was conducted.\n\nIn response, South African President Cyril Ramaphosa dismissed the allegations, saying his countrys land expropriation policies adhere strictly to legal frameworks and constitutional provisions.\n\nSouth Africa is a constitutional democracy that is deeply-rooted in the rule of law, justice and equality. The South African government has not confiscated any land. The recently adopted Expropriation Act is not a confiscation instrument, but a constitutionally-mandated legal process that ensures public access to land in an equitable and just manner as guided by the constitution, he said in a statement.\n\nSouth Africa, like the United States of America and other countries, has always had expropriation laws that balance the need for public usage of land and the protection of rights of property owners.\n\nHe further clarified that, aside from the Presidents Emergency Plan for AIDS Relief (Pepfar), which contributes 17 percent of South Africas HIV/Aids programme, the country does not receive any funding from the US.\n\nPresident Ramaphosa said he would engage the Trump administration to find common ground on land reform and broader bilateral relations.\n\nWe are certain that out of those engagements, we will share a better and common understanding over these matters. The US remains a key strategic political and trade partner for South Africa. With the exception of Pepfar Aid, which constitutes 17 percent of South Africas HIV/Aids programme, there is no other funding that is received by South Africa from the United States, he said.\n\nLocal analysts have criticised President Trumps stance, arguing that his approach mirrors the punitive actions taken against Zimbabwe at the turn of the millennium.\n\nFollowing Zimbabwes land reform programme, the US and its Western allies imposed economic sanctions under the pretext of human rights violations, despite the initiative being aimed at addressing colonial land imbalances.\n\nZanu PF Secretary General Dr Obert Mpofu said the land issue remains one of Africas most critical political and economic challenges. He urged South Africa to remain resolute in implementing land redistribution.\n\nIf you try to be diplomatic about land redistribution, you will achieve nothing. The process is often met with resistance, sanctions, and vilification. However, for the benefit of the majority, ultimately, it must be done, he said.\n\nDr Mpofu said Zimbabwes land reform programme was a success, noting that it has empowered the black majority and considerably improved national food security.\n\nNegotiating land redistribution with Western powers has never yielded results. Africa must take decisive action on this matter, he added.\n\nNational University of Science and Technology (Nust) lecturer and political analyst Mr Methuseli Moyo said President Trumps approach reflects a broader effort to undermine African sovereignty.\n\nThe tragedy is that Trump leads a global superpower that sees itself as the worlds prefect. Donald Trump seeks to dehumanise black people to the extent that he thinks they are not fit to have access to anything, especially land, even their God-given land, he said.\n\nMr Moyo also criticised the irony of the US positioning itself as a human rights advocate, while opposing African-led efforts to rectify historical injustices.\n\nAre black South Africans not human beings? The hypocrisy is staggering. Thankfully, President Ramaphosa has firmly stood his ground, he added.\n\nMr Moyo said more African countries need to take a leaf from Zimbabwe in the manner in which the Government handled the land question.\n\nZimbabwe did very well to pioneer a forceful land reclamation process which stands as a reference point and inspiration to the dispossessed masses in South Africa and elsewhere. They must bite the bullet and take back their land, he said.\n\nMr Moyo said African countries must never be apologetic about controlling their resources.\n\nPolitical governance expert Mr Teddy Ncube echoed similar sentiments, stating that land reform in South Africa, like in Zimbabwe, is about correcting historical injustices rather than pursuing radical agendas.\n\nPolitics is not solely about economic transactions. It is also about people, history, and justice. His (President Trumps) perspective on South Africas land reform overlooks the deep historical injustices that necessitated this conversation in the first place, he said.\n\nMr Ncube emphasised that the current reform efforts seek to promote fairness and inclusivity while rectifying past wrongs.\n\nThe issue of land reform in South Africa is not about confiscation or radical agendas; it is about addressing the longstanding disparities created by colonialism and apartheid, he said.\n\nMr Ncube said for generations land was grabbed from Africans leading to poverty and exclusion while also perpetuating inequities.\n\nThe current efforts are aimed at rectifying these imbalances in a way that promotes fairness and inclusivity. Trumps approach of reducing complex issues to simple economic calculations can be problematic when applied to international relations, he said.\n\nMr Ncube said the South African land issue is a domestic matter that should be handled internally, arguing that external interference from the US is unwarranted.\n\nHe said President Trump must respect South Africas sovereignty and allow its people to shape their own future.\n\nIt is essential that South Africans are given the space to resolve this matter themselves, free from external interference. President Trump should recognise this and allow South Africa to determine its own future based on its own principles and aspirations.\n\nAs the debate over land expropriation intensifies, Zimbabwes experience remains a key reference point for African nations seeking to address land ownership disparities. South Africas approach, though different in execution, is part of the broader continental effort to ensure equitable land distribution and economic empowerment for historically marginalised communities.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/01/President-Cyril-Rampahosa.jpg",
            "description": "Nqobile Tshili, Bulawayo Bureau DESPITE numerous challenges, chief among them illegal Western sanctions, Zimbabwe stands out as a notable example of successful land reclamation in Africa, as South Africa’s land reform policies face scrutiny from the United States. South Africa’s recently signed land expropriation without compensation law has attracted attention and criticism from the United […]",
            "time": "06:31",
            "date": "04 Feb 2025"
        },
        {
            "title": "Council buys 13 luxury vehicles for directors",
            "url": "https://www.herald.co.zw/council-buys-13-luxury-vehicles-for-directors/",
            "content": "Trust Freddy, Herald Correspondent\n\nHARARE City Councils procurement manager was yesterday grilled over the purchase of 12 high-end Toyota Fortuner GD6 vehicles for all directors plus a 13th luxurious Toyota Prado VX200 for the town clerk, amid concerns that council is prioritising executive comforts over essential services.\n\nThis comes amid revelations that the top brass mutually agreed to keep a low profile by not driving their luxury Toyota Fortuner GD6 vehicles to work, instead using smaller vehicles or discreetly parking their high-end cars at a distance from Town House to avoid drawing attention to their luxury perks.\n\nThe startling revelations came out yesterday when the citys procurement management unit supply chain manager, Mr Never Murerwa, appeared before the commission into Harare City Council chaired by retired judge Justice Maphios Cheda.\n\nHe admitted before the commission that council was wasting ratepayers money by buying expensive vehicles at the expense of service delivery.\n\nWe received information that there are 12 new Toyota GD6 which were given to officials. And they are even shy to drive them. They park them in parkades and they walk to Town House, Ms Joyce Shumba, one of the witnesses told the commission.\n\nAnd then after work, they walk to the parkade. Why cant they drive their official vehicles? Because they know that they were not supposed to have vehicles prioritised for official issue.\n\nWhen questioned about the purchase of luxury vehicles for top directors, Mr Murerwa deflected responsibility, stating that he had no authority to refuse the acquisition, and instead shifted the blame to the human resources department.\n\nHe was also grilled over the procurement of a Toyota Prado VX 200 series for the town clerk  a vehicle normally assigned to Cabinet ministers.\n\nI reported to you that your office ratified the procurement of a Ministerial vehicle for a town clerk who is, according to grading in Government systems, at the level of a chief director who cannot have such a type of vehicle for their grade, Ms Shumba said.\n\nWhen asked whether the council was now equating the town clerk to a Minister, Mr Murerwa again shifted the blame to the human resources department.\n\nSeveral high-ranking officials from the Harare City Council have testified before the commission, lifting the lid on a complex web of corruption within the council and officials feeding from the trough.\n\nThe officials who have appeared before the commission include suspended town clerk Eng Hosiah Chisango, principal housing officer Edgar Dzehonye, acting finance director Godfrey Kusangaya, acting valuations and estates manager Peter Dube, business committee chair Clr Lovemore Makuwerere, audit chair Clr Blessing Duma, city housing director Addmore Nhekairo, acting chamber secretary Warren Chiwawa, environmental management committee chair Clr Cecilia Chimbiri, acting head of revenue collection Alfred Guni, and Mr Nelson Chamisa.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/09/Justice-Maphios-Cheda.jpg",
            "description": "Trust Freddy, Herald Correspondent HARARE City Council’s procurement manager was yesterday grilled over the purchase of 12 high-end Toyota Fortuner GD6 vehicles for all directors plus a 13th luxurious Toyota Prado VX200 for the town clerk, amid concerns that council is prioritising executive comforts over essential services. This comes amid revelations that the top brass […]",
            "time": "06:31",
            "date": "04 Feb 2025"
        },
        {
            "title": "EDITORIAL COMMENT: Let’s preserve, protect our wetlands",
            "url": "https://www.herald.co.zw/editorial-comment-lets-preserve-protect-our-wetlands/",
            "content": "PRESERVING and protecting wetlands requires more than just vague assent, while draining and destruction continues: we need to recognise their high value, as wetlands, and then protect them as they preserve us.\n\nAs President Mnangagwa stressed yesterday in his statement to mark World Wetlands Day, we need to be active in protection and restoration of wetlands to make sure all the benefits they bring not only are present for our own times, but for future generations.\n\nThis year Zimbabwe has the honour of hosting the 15th Conference of Parties who have signed up to the Treaty on the Conservation of Wetlands, signed in 1971 in Ramsar, Iran.\n\nAnd it would be useful if we could show that we have been following the Presidential lead in doing something constructive, rather than trying to destroy what we have.\n\nHarare City Council has been among the most destructive over the last quarter century, allowing developers and favourites to continue encroaching on wetlands, destroying the extremely limited public open space in the city and making sure that we will be inhabiting a dry concrete desert in a few years time.\n\nWetlands have been sold off, sometimes for a song in these days of probable corruption, often to people with strong connections to the Harare City Council. Most of the major streams and rivers in the city are fast becoming just a drainage ditch between blocks of buildings, and even then the pressure is on keeping the drainage ditch clear so the water flows even more quickly out of the city.\n\nWe have been seeing falling water tables in the city for decades, but now it is falling far faster and even deep boreholes are running dry along with those, on the edge of former wetlands, that everyone thought would be able to pump water forever.\n\nOne of the prime functions of wetlands in Zimbabwes urban areas is to recharge the aquifers. Rainfall needs to seep through the soil to do this, and when almost all rain falls on streets, roofs, parking areas and other slabs of concrete it will simply be runoff and in a few hours be flowing out of the city.\n\nWhen it can stick around, sitting in a wetland, what we used to call vleis and even swamps, a lot is able to soak into the ground and is cleaned up before soaking in or before the sluggish stream eventually moves the surplus out of the city into our supply dams, that can really use inflows of clean water.\n\nA second major function is to provide the recreational land we need. It would be wrong or at least not best value for money, we agree, to allocate prime building land to public open spaces and parks. But as wetlands need major drainage works before they can be built on, and in any case often comprise thick organic clay soils that are dubious for building without expensive additional engineering, it seems obvious to put the wetlands to dual use, as wetlands, but also as open space and the future parks.\n\nIn some suburbs, we already see residents faced with a growing number of cluster housing developments and other densification and commercial building seeing the need to preserve what is still there, often the wetlands.\n\nSo that is why at the beginning of the rainy season there were people planting trees on the edges of their local wetland, so they would have the beginnings of a decent park in their area in a couple of decades.\n\nThe dual use has been around for some time. There are several schools built in the 1960s and 1970s, when land was getting scarcer, that have their buildings on the good building land near the edge of a wetland and their sports fields on the wetter land further down a slope. Most of the public golf courses after the first one, which was built on almost limitless land on the edge of the city, are laid out on wetlands because this was where suitable land was available, and such a policy also made sure there were natural water hazards.\n\nThe one major private golf course developed in recent years is also on a wetland in Borrowdale and amidst the surrounding cluster housing preserves water sources and a decent stream and provides a swathe of green through the concrete. Some complain that there is no money to protect wetlands and open space today. But a lot of wetland can be protected by simply not being used, and in later years, as Zimbabwe becomes a richer country, it is then still there and can be upgraded, as a wetland.\n\nOver time fences can be erected, trees planted and generally the sort of parks a decent city really needs are gradually made up.\n\nAll great cities have parks and open space that allow them to breathe. In many European cities these are the old royal hunting parks, that developers were kept out of until there was a general feeling that they needed to be transferred to the people. In other cases, useless land was preserved and became a focal point.\n\nEven in the early days of colonial Harare, the then parks officer managed to grab the wet area around three springs near the city centre, plant a few hundred trees and create Harare Gardens, which admittedly needs quite a lot of work to restore its glory, but is still there to be restored as money becomes available. Councils have nibbled at it over the years, and that needs to stop.\n\nIn rural areas, wetlands are sometimes under threat from those wanting to drain and plant a few crops before they dry up.\n\nAgain they need to be preserved forever.\n\nOf course, we think hay can be mowed and other non-destructive uses, but they are needed to ensure that the streams keep flowing and that all those boreholes now being drilled will still be pumping water in 100 years and longer.\n\nIt does not rain for much beyond four months of the year these days, and that water needs to be around for the rest of the year and the bad years. Wetlands store a lot on the surface and underground, and even keep the rain that falls in January around long enough to be useful rather than just seeing it flow rapidly into a giant river.\n\nThe point is, in Zimbabwe, preserving wetlands is not just some sort of do-gooder activity, but is an active way of fighting the effects of climate change in town and country, provide the green lungs our towns and cities need, provide the emergency grazing that farmers require in the bad times, and generally pay for themselves many times over.\n\nAnd they do not cost much to preserve, just being allowed to stay there in effect.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/wetland.jpg",
            "description": "PRESERVING and protecting wetlands requires more than just vague assent, while draining and destruction continues: we need to recognise their high value, as wetlands, and then protect them as they preserve us. As President Mnangagwa stressed yesterday in his statement to mark World Wetlands Day, we need to be active in protection and restoration of […]",
            "time": "06:31",
            "date": "04 Feb 2025"
        },
        {
            "title": "Govt to improve conditions for higher education staff",
            "url": "https://www.herald.co.zw/govt-to-improve-conditions-for-higher-education-staff/",
            "content": "Mukudzei Chingwere, Herald Reporter\n\nTHE Government is working diligently to improve the conditions of service for staff in universities and colleges, a Cabinet Minister has said.\n\nSpeaking during an engagement with heads of tertiary institutions in the country in Harare yesterday, the Minister of Higher and Tertiary Education Innovation Science and Technology Development, Ambassador Fredrick Shava, said this initiative is part of a broader strategy to strengthen the role of higher education in the countrys modernisation and industrialisation agenda.\n\nMinister Shava expressed gratitude for the contributions made under the previous administration, particularly by former Minister Professor Amon Murwira, in advancing Heritage-based Education 5.0.\n\nHe said education is not merely an academic exercise but a transformative force that can propel Zimbabwe towards a knowledge-based and innovation-driven society.\n\nAlmost every university that we have under our ministry is experiencing a lot of movement of skills, people resigning and moving to other places or taking jobs elsewhere and the complaint that they have is the salary level and other conditions of service, said Minister Shava.\n\nSo, we are trying to address both so that we are comparable to the regional salary levels, His Excellency the President has already authorised us to move towards regional parity, we still have to discuss and negotiate with the Ministry of Finance to see how best we can get to those levels.\n\nThose levels do not just mean money, its money, its conditions of service, its accommodation, so this is what we are trying to explore to see if we can retain people because we are satisfying some of their basic needs.\n\nHe said educational institutions must foster a culture of entrepreneurship, collaboration and accountability.\n\nMinister Shava called for the formation of diverse commercialisation teams equipped with marketing and business development specialists who can navigate the commercialisation pipeline effectively.\n\nPresident Mnangagwa, he said, has declared 2025 a year of commercialisation following the rollout out of several innovations in tertiary institutions.\n\nInstitutions of higher and tertiary learning and agencies must, therefore, take a strategic approach to commercialisation.\n\nMinister Shava said this is important for transforming innovations into economic gains, enabling businesses to secure a competitive advantage.\n\nThe need to commercialise and transform goods and services into a market reality is a must, if we are to attain Vision 2030 and be able to fulfil the human needs of our people.\n\nRemember, our people need food, water, shelter, clothing, connection, security, etc. Our education system must therefore be relevant to fulfil these human needs and develop the nation forward, he said.\n\nThis year, we want to see more goods and products on the market. By doing so, Higher and Tertiary Education Institutions will contribute towards economic growth and societal advancement whilst fostering a culture of entrepreneurship and collaboration.\n\nMinister Shava reaffirmed Governments commitment to establishing innovation hubs and agro-industrial parks across higher education institutions but expressed concern over the slow pace at which innovative products are reaching the market, saying there is a need for a strategic approach to commercialisation.\n\nThe Government of Zimbabwe, through our ministry, set up innovation hubs and industrial parks across institutions of higher and tertiary learning and factories for agencies, he said.\n\nTo date, we pride ourselves on state-of-the-art innovation hubs, agro-industrial parks, and industrial factories/plants.\n\nHowever, we are very concerned with the rate at which products and services are making it to the market.\n\nIdeation and prototyping are one part of the innovation ecosystem and industrialisation and commercialisation are another part.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Shava.jpg",
            "description": "Mukudzei Chingwere, Herald Reporter THE Government is working diligently to improve the conditions of service for staff in universities and colleges, a Cabinet Minister has said. Speaking during an engagement with heads of tertiary institutions in the country in Harare yesterday, the Minister of Higher and Tertiary Education Innovation Science and Technology Development, Ambassador Fredrick […]",
            "time": "06:31",
            "date": "04 Feb 2025"
        },
        {
            "title": "Border handles 645 000 travellers during holiday",
            "url": "https://www.herald.co.zw/border-handles-645-000-travellers-during-holiday/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nA total of 645 590 travellers used the Beitbridge Border Post during the just ended 2024 festive season, South Africas Border Management Authority (BMA) said yesterday.\n\nIn a statement, the BMA said overall the number of travellers who used South Africas borders had increased at all its borders in 2024 compared to the previous year.\n\nIt said the OR Tambo International Airport and Beitbridge had experienced a huge volume of traffic.\n\nBeitbridge is the busiest inland port in the region where an average of 15 000 cross daily during off peak and the number increases threefold at peak periods.\n\nThe border is a key facility for movement of travellers from Botswana, Mozambique, DRC, Zambia, Angola, Tanzania, Malawi and Zimbabwe.\n\nStarting on immigration matters, the BMA facilitated the legitimate movement of about 5 084 251 travellers across our 71 ports of entry in this festive period, said the BMA.\n\nThis number represents an increase of 51 680 travellers compared to the 2023/2024 festive period. However, this number is still less than the pre-Covid19 number of about 6 million travellers.\n\nIn this festive period, OR Tambo International Airport facilitated the majority of travellers at 1 065 636, followed by Beitbridge port of entry to Zimbabwe at 645 590 travellers, and then followed by Lebombo port of entry to Mozambique at 571 131.\n\nThe BMA said during the same period they processed over 395 189 private vehicles, 12 974 mini-bus taxis, and 6 071 buses through their movement control system.\n\nThe majority of travellers used the OR Tambo International Airport, Beitbridge, Lebombo, Kopfontein, Oshoek, Cape Town International Airport, Maseru Bridge, Ficksburg, Cape Town Habour and Durban Habour.\n\nAccording to the BMA these top 10 ports facilitated the majority of all travellers for the entire festive period which totals about 3 964 122 and the remaining 33 percent were facilitated by the remainder of the 61 other ports of entry across the country.\n\nOut of the total number of 58 938 processed trucks, 47 891 were processed for exports whilst 11 047 were processed for imports, said the BMA.\n\nIn addition, of those trucks processed for export, 74 percent of them were processed and cleared within 30 minutes while 66 percent of those processed for imports were also cleared within 30 minutes.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/07/wdwd.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau A total of 645 590 travellers used the Beitbridge Border Post during the just ended 2024 festive season, South Africa’s Border Management Authority (BMA) said yesterday. In a statement, the BMA said overall the number of travellers who used South Africa’s borders had increased at all its borders in 2024 compared […]",
            "time": "06:31",
            "date": "04 Feb 2025"
        },
        {
            "title": "Mat North Youth League endorses poll deferment",
            "url": "https://www.herald.co.zw/mat-north-youth-league-endorses-poll-deferment/",
            "content": "Leonard Ncube, Victoria Falls Reporter\n\nTHE ZANU PF Youth League in Matabeleland North has said it is fully behind the deferment of elections to 2030, saying this will help President Mnangagwa to continue with his pro-youth development policies.\n\nThere have been calls by Zimbabweans to defer the 2028 harmonised elections and allow President Mnangagwas administration to remain in office until 2030 to enable Government to complete the transformative development projects.\n\nAt its 21st Peoples Conference in Bulawayo, Zanu PF resolved to postpone the next harmonised elections from 2028 to 2030 to allow development projects initiated by President Mnangagwa and the Second Republic to come to fruition.\n\nIn a statement, the partys Youth League in Matabeleland North reaffirmed its unwavering commitment to the 21st National Peoples Conference Resolution Number 1 that President Mnangagwa remains in office until 2030.\n\nThis resolution not only encapsulates our enduring values, but also reflects our shared aspirations for social and economic development, which stand as the bedrock of our collective mission as Zanu PF, read the statement signed by Cde Pauline Mpande, the Youth League provincial secretary for information and publicity.\n\nThe youth said they recognise President Mnangagwas good leadership whose exploits have significantly advanced the partys cause, resilience and positioned it as a formidable force in fostering positive change in Zimbabwe and beyond.\n\nUnder his stewardship, we have witnessed remarkable milestones, including the advent and implementation of unprecedented capital projects that continue to transform the economy, thus significantly improving the lives of many Zimbabweans, read the statement.\n\nThese accomplishments serve as a testament to the effectiveness of our collective resolve and the profound impact we can achieve when united in purpose. We acknowledge the seriousness of our reaffirmation at this critical juncture, emphasising our role in upholding the partys mission to serve, uplift, and empower communities.\n\nThe Youth League said as the vanguard of the party, its statutes and resolutions commit to an undying support for economic development and pledged to play an active role in helping the President achieve Vision 2030.\n\nThey commended President Mnangagwa for his exemplary leadership and the positive impact he has had in stabilising and growing the national economy.\n\nWe understand that our actions today shape the legacy we leave for future generations and it is our constitutional duty to align with the party resolutions and principles reached at the 21st National Peoples Conference.\n\nAs we move forward, we pledge to actively engage in initiatives that reflect our commitment to Resolution Number 1 that our President remains President, Head of State and the party until 2030, read the statement.\n\nWe implore the members of the youth league to remain resolute and unshaken, ensuring total support for the extension of the Presidential term of office. We stand firm in our belief that through abidance and dedication to this resolution, we can leverage our unity, the prevailing stability, achievements and propel our diverse communities towards Vision 2030.\n\nZanu PF Matabeleland North Youth League provincial chairperson Cde Lundy Sinzeka said all youth members support the resolution.\n\nAt the youth level, we are all agreeable to this resolution. As Matabeleland North, for the first time, we have benefited as a province. Youth have plots and fishing rigs among other benefits, he said.\n\nWe have witnessed infrastructural developments notably the building of schools and clinics and we hope if elections are deferred to 2030 we will benefit more under President Mnangagwa.\n\nThe Zanu PF Youth League national secretary for security and Central Committee member Cde Thubelihle Duke Ncube said youth countrywide are in agreement with the resolution.\n\nHe said the youth are not just making the call for an extension of the Presidential term for the sake of it, but are considering the developmental drive that President Mnangagwa has embarked on from the day he assumed office.\n\nCde Ncube said President Mnangagwa had managed to drive the country despite the illegal sanctions imposed by Western countries.\n\nThe President mastered the art of surviving in these difficulties the country is facing as a result of sanctions and kept us going as a country.\n\nZimbabwe has turned into a construction zone with different infrastructure projects shaping up from different corners of the country. The economy itself is responding positively to policies of the Second Republic, he said.\n\nZanu PF Youth League secretary for legal affairs Cde Meluleki Khumalo said the league leadership has a critical role to explain the benefits of the party resolution to other youths and Zimbabweans in general.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/03/voting2-680x380.jpg",
            "description": "Leonard Ncube, Victoria Falls Reporter THE ZANU PF Youth League in Matabeleland North has said it is fully behind the deferment of elections to 2030, saying this will help President Mnangagwa to continue with his pro-youth development policies. There have been calls by Zimbabweans to defer the 2028 harmonised elections and allow President Mnangagwa’s administration […]",
            "time": "06:31",
            "date": "04 Feb 2025"
        }
    ]
}