{
    "news": [
        {
            "title": "Presidents Mnangagwa, Ruto to set terms of reference for DRC mediation panel",
            "url": "https://www.herald.co.zw/presidents-mnangagwa-ruto-to-set-terms-of-reference-for-drc-mediation-panel/",
            "content": "Debra Matabvu\n\nConsultations to set a date for a high-level briefing between SADC Chairperson President Mnangagwa and his East African Community counterpart, Kenyan President William Ruto to outline the terms of reference for a panel of eminent African leaders tasked with finding a lasting solution to the conflict in the eastern Democratic Republic of Congo (DRC) have commenced.\n\nThis follows Mondays virtual joint summit of SADC and EAC Heads of State and Government, which appointed five former African presidents to mediate the crisis.\n\nRegional leaders appointed former Presidents Olusegun Obasanjo (Nigeria), Uhuru Kenyatta (Kenya), Kgalema Motlanthe (South Africa), Catherine Samba Panza (Central African Republic) and Sahle-Work Zewde (Ethiopia) to spearhead efforts to end the conflict in DRC.\n\nPresident Mnangagwa and President Ruto were directed to convene the briefing within seven days to outline the panels mandate and tasks.\n\nIn an interview, Foreign Affairs and International Trade Minister Professor Amon Murwira said: We do not have a date yet.\n\nHowever, we have started consultations on when to have the briefing that is set to be held in the next seven days.\n\nThe briefing will outline the panels mandate and tasks among other issues they should be ceased with.\n\nHe said the panel of statesmen is expected to facilitate dialogue between warring parties, including the Congolese government and the M23 rebels, to promote peaceful negotiations and address underlying grievances.\n\nThey are also expected to advocate for international support and assistance for the DRC, including humanitarian aid, funding for development initiatives, and resources for rebuilding affected communities.\n\nRecently, the United Nations Security Council applauded efforts by the two regional blocs to resolve the DRC crisis and strongly condemned the ongoing offensive by M23 rebels in the eastern DRC.\n\nThe Security Council demanded that the M23 immediately cease hostilities, withdraw from all areas that it controls, and fully reverse the establishment of illegitimate parallel administrations in the DRC territory.\n\nThe UN body called on the Rwanda Defence Forces to stop supporting the armed group and immediately withdraw from Congolese territory without preconditions.\n\nIt reiterated the urgent appeal for all parties to conclude an immediate and unconditional ceasefire, as called for by leaders from EAC and SADC.\n\nM23, which refers to March 23, 2009 is the latest group of ethnic Tutsi-led insurgents to take up arms against Congolese forces.\n\nIt launched the current rebellion in 2022.\n\nAccording to reports at least 7 000 people have died in the fighting since January this year with over 600 000 people having been displaced by the fighting since November 2024.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/DRC-Peace-Process-Leaders-2-680x380.jpg",
            "description": "Debra Matabvu Consultations to set a date for a high-level briefing between SADC Chairperson President Mnangagwa and his East African Community counterpart, Kenyan President William Ruto to outline the terms of reference for a panel of eminent African leaders tasked with finding a lasting solution to the conflict in the eastern Democratic Republic of Congo […]",
            "time": "18:09",
            "date": "26 Mar 2025"
        },
        {
            "title": "Prioritise people’s needs: President Mnangagwa",
            "url": "https://www.herald.co.zw/prioritise-peoples-needs-president-mnangagwa/",
            "content": "Joseph Madzimure and Zvamaida Murwira\n\nZanu PF leaders must prioritise the needs of citizens and provide honest, responsive governance in line with the partys revolutionary values, President Mnangagwa has said.\n\nAddressing the 382nd Ordinary Session of the Politburo this afternoon, President Mnangagwa, who is also the First Secretary of the party, urged party structures to be responsive to peoples needs and align themselves with the countrys development agenda.\n\nI challenge all party members to walk alongside our people and always seek to respond to their needs, he said.\n\nPresident Mnangagwa underscored the need for Zanu PF leadership to drive national development in line with Vision 2030, which seeks to transform Zimbabwe into an upper middle-income economy.\n\nIn seamless coordination, structures of our party, right from the cell level, district and province up to the Central Committee and Politburo, must provide honest leadership and guidance on matters that affect the livelihoods of our people.\n\nPresident Mnangagwa underscored the need for Zanu PF leadership to drive national development in line with Vision 2030, which seeks to transform Zimbabwe into an upper middle-income economy.\n\nAs a colossal revolutionary party, Zanu PF has a job to do and a vision to deliver for the good of the people of our great motherland, Zimbabwe, he said.\n\nI applaud fellow citizens from across the country for their clarity, national consciousness and patriotism.\n\nThis has seen us squashing efforts by malcontents and rogue delusional elements bent on disturbing our peace, unity and harmony.\n\nThe President urged party officials to demonstrate exceptional leadership and remain unwavering in their commitment to guiding both the party and Government in fulfilling the countrys developmental aspirations.\n\nI challenge all party members to walk alongside our people and always seek to respond to their needs, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/President-Mnangagwa1-680x380.jpg",
            "description": "Joseph Madzimure and Zvamaida Murwira Zanu PF leaders must prioritise the needs of citizens and provide honest, responsive governance in line with the party’s revolutionary values, President Mnangagwa has said. Addressing the 382nd Ordinary Session of the Politburo this afternoon, President Mnangagwa, who is also the First Secretary of the party, urged party structures to […]",
            "time": "18:09",
            "date": "26 Mar 2025"
        },
        {
            "title": "PPPs key to tackling housing deficit: Deputy Minister Kabikira",
            "url": "https://www.herald.co.zw/ppps-key-to-tackling-housing-deficit-deputy-minister-kabikira/",
            "content": "Emmanuel Kafe\n\nThe Government has reaffirmed its commitment to working with the private sector to address Zimbabwes housing deficit and ensure access to decent shelter for all, in line with the Second Republics vision of achieving upper-middle-income status by 2030, a senior Government official has said.\n\nSpeaking at the launch of the Retreat Infrastructure Servicing Project in Waterfalls, Harare today, Local Government and Public Works Deputy Minister Benjamin Kabikira highlighted the importance of public-private partnerships in housing development.\n\nHe said the project, led by Operation Nehemiah  a United Family International Church-led housing development initiative  is a major step towards increasing access to serviced land and modern housing.\n\nWhen you see the private sector coming on board to do such massive developmental projects, you know the country is moving forward in a manner that is pleasing, said Deputy Minister Kabikira.\n\nI am delighted indeed and I applaud the United Family International Church for establishing the Nehemiah Housing Project and more importantly, for complying with the Governments policy to provide serviced land and construct smart houses.\n\nThis is clearly the kind of partnership the Government wants from its partners, the church and other entities included.\n\nOperation Nehemiah Chairperson, Mr Rufaro Nyadembera, praised the Governments supportive policies, which promote affordable housing development.\n\nWe started this project in 2016 and its set to benefit over 800 people who were all very anxious on when they will start to build, but finally the ground has been broken and we are ready to build after servicing, he said.\n\nI should commend the Government for partnering with the private sector in making sure housing delivery is a reality for a lot of people.\n\nZimbabwe has made significant progress in housing development under National Development Strategy 1 (NDS1), with various housing projects being implemented across the country.\n\nThe Government, through the National Housing and Social Amenities Ministry, local authorities and private sector players, has facilitated the construction of thousands of units, particularly in Harare, Bulawayo, Mutare and other urban areas.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Local-Government-and-Public-Works-Deputy-Minister-Benjamin-Kabikira1-680x380.jpg",
            "description": "Emmanuel Kafe The Government has reaffirmed its commitment to working with the private sector to address Zimbabwe’s housing deficit and ensure access to decent shelter for all, in line with the Second Republic’s vision of achieving upper-middle-income status by 2030, a senior Government official has said. Speaking at the launch of the Retreat Infrastructure Servicing […]",
            "time": "18:09",
            "date": "26 Mar 2025"
        },
        {
            "title": "President Mnangagwa emphasises commitment to informal sector, calls for organised operations",
            "url": "https://www.herald.co.zw/president-mnangagwa-emphasises-commitment-to-informal-sector-calls-for-organised-operations/",
            "content": "Wallace Ruzvidzo-Herald Reporter\n\nPresident Mnangagwa has said the Second Republic remains committed to responding to the needs of all sectors and communities, pursuant to leaving no one and no place behind.\n\nIn his address at an engagement with vendors at State House today, the President said the informal sector plays a crucial role in the countrys economy, providing livelihoods for millions of citizens.\n\nHowever, he said there are some worrisome trends affecting the sector, adding that these should not be left unchecked.\n\n. . . if left unchecked, they will have dire ripple effects to our country and overshadow the important role of this critical sector.\n\nPresident Mnangagwa said all sectors and communities have the responsibility to build, modernise and industrialise the country, not only for the present generation, but for future generations.\n\nThis duty lies with all of us as a united and patriotic people with one shared vision for Zimbabwe, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/President-engages-vendors-680x380.jpg",
            "description": "Wallace Ruzvidzo-Herald Reporter President Mnangagwa has said the Second Republic remains committed to responding to the needs of all sectors and communities, pursuant to leaving no one and no place behind. In his address at an engagement with vendors at State House today, the President said the informal sector plays a crucial role in the […]",
            "time": "18:09",
            "date": "26 Mar 2025"
        },
        {
            "title": "Government rejects US$1 pupil levy for Independence Day celebrations",
            "url": "https://www.herald.co.zw/government-rejects-us1-pupil-levy-for-independence-day-celebrations/",
            "content": "Columbus Mabika\n\nThe Government has dismissed a directive for school children in Gweru District to contribute up to US$1 each towards the 2025 Independence Day celebrations, stating that there is already adequate funding for the national event.\n\nIn a statement, the Ministry of Primary and Secondary Education said the levy had not been unauthorised.\n\nThe Ministry has already secured adequate funding through the national budget for all Independence Day commemorations, including planned activities in Gokwe, reads the statement.\n\nThere is no requirement for schools, learners, parents, or community members to contribute financially to these events.\n\nThe Ministry said the letter issued by the Gweru District Schools Inspector, requesting such contributions, is unwarranted.\n\nAuthorities have since initiated an immediate inquiry into the matter, and the official responsible for the directive will be asked to explain their actions, which violate established protocols.\n\nAll school heads, teachers, and stakeholders are instructed to disregard the directive.\n\nNo payments should be solicited or collected for this purpose.\n\nAny individual or institution that is put under pressure to contribute is urged to report the matter directly to the Ministry.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Ministry-press-statement-680x380.jpg",
            "description": "Columbus Mabika The Government has dismissed a directive for school children in Gweru District to contribute up to US$1 each towards the 2025 Independence Day celebrations, stating that there is already adequate funding for the national event. In a statement, the Ministry of Primary and Secondary Education said the levy had not been unauthorised. “The […]",
            "time": "18:09",
            "date": "26 Mar 2025"
        },
        {
            "title": "Alaska-Kenzamba-Nembudziya Road gets facelift ahead of Independence celebrations",
            "url": "https://www.herald.co.zw/alaska-kenzamba-nembudziya-road-gets-facelift-ahead-of-independence-celebrations/",
            "content": "Conrad Mupesa-Mashonaland West Bureau\n\nWork has begun on the Alaska-Kenzamba-Nembudziya Road after the contractor, Frogmerge Construction, moved onsite to start rehabilitation of the road ahead of the 45th Independence Day celebrations set for Nembudziya, Gokwe North.\n\nThe national event, to be led by President Mnangagwa, is expected to attract over 100 000 people.\n\nTo improve access to the venue, Frogmerge Construction is rehabilitating a 40-kilometre stretch of road from Makonde to Gokwe-Nembudziya Constituency.\n\nThe project involves re-gravelling, grading and surface compaction.\n\nMr Webster Magaya, the companys Safety, Health, Environment and Quality (SHEQ) officer, who is also assisting in supervising the project, said the task will be completed ahead of the celebrations.\n\nMakonde legislator, Cde Simbarashe Ziyambi, said the roads rehabilitation will benefit the community by improving transport links and accessibility.\n\nThe project has also created employment opportunities for local youths who have been engaged by the contractor.\n\nOnce completed, the rehabilitated road will significantly shorten travel distances between Harare, Mashonaland Central and the western parts of Mashonaland West Province, making it easier for people to reach Nembudziya.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Gokwe-roads.-newjpg-680x380.jpg",
            "description": "Conrad Mupesa-Mashonaland West Bureau Work has begun on the Alaska-Kenzamba-Nembudziya Road after the contractor, Frogmerge Construction, moved onsite to start rehabilitation of the road ahead of the 45th Independence Day celebrations set for Nembudziya, Gokwe North. The national event, to be led by President Mnangagwa, is expected to attract over 100 000 people. To improve […]",
            "time": "18:09",
            "date": "26 Mar 2025"
        },
        {
            "title": "City Parking rolls out AI-powered parking enforcement",
            "url": "https://www.herald.co.zw/city-parking-rolls-out-ai-powered-parking-enforcement/",
            "content": "Blessings Chidakwa\n\nCity Parking has introduced an Automatic Number Plate Recognition (ANPR) system to enhance parking enforcement and eliminate disputes between parking marshals and motorists over clamping.\n\nThis high-tech solution is set to transform how parking violations are detected and managed.\n\nEquipped with vehicle-mounted cameras, the ANPR system scans, reads and records licence plates in real-time.\n\nThe captured data is instantly transmitted to a central control room, where enforcement officers can monitor violations and issue fines more efficiently.\n\nSpeaking during a media engagement event today, City Parking managing director Mr Simon Muzviyo said the new system aims to reduce conflicts between parking marshals and motorists.\n\nThis technology allows us to keep our streets clearer and ensure fair parking for all, he said.\n\nIt reduces human error, speeds up enforcement and ultimately improves traffic flow.\n\nUnlike traditional manual patrols that are time-consuming and prone to oversight, ANPR vehicles can cover large areas quickly, identifying illegally parked cars, expired permits and unauthorised vehicles within seconds.\n\nThe systems real-time functionality ensures that violations do not go unnoticed and repeat offenders are flagged immediately.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Mr-Simon-Muzviyo-new--680x380.jpg",
            "description": "Blessings Chidakwa City Parking has introduced an Automatic Number Plate Recognition (ANPR) system to enhance parking enforcement and eliminate disputes between parking marshals and motorists over clamping. This high-tech solution is set to transform how parking violations are detected and managed. Equipped with vehicle-mounted cameras, the ANPR system scans, reads and records licence plates in […]",
            "time": "18:09",
            "date": "26 Mar 2025"
        },
        {
            "title": "Politburo meeting on today",
            "url": "https://www.herald.co.zw/politburo-meeting-on-today-4/",
            "content": "Joseph Madzimure-Zimpapers Politics Hub\n\nAll is set for the Zanu PF Politburo meeting set for 10am.\n\nPresident Mnangagwa will chair the meeting as the First Secretary of the party.\n\nThe meeting is expected to discuss a number of issues, among them the state of the economy, the crop situation, the state of the party and disciplinary issues.\n\nDuring the last Politburo meeting, party members were urged to be disciplined.\n\nThe previous meeting also saw some rogue party members who were abusing social media to insult party leadership being expelled.\n\nOthers were suspended, depending on the gravity of their cases.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/10/Untitled-10-1.jpg",
            "description": "Joseph Madzimure-Zimpapers Politics Hub All is set for the Zanu PF Politburo meeting set for 10am. President Mnangagwa will chair the meeting as the First Secretary of the party. The meeting is expected to discuss a number of issues, among them the state of the economy, the crop situation, the state of the party and […]",
            "time": "18:09",
            "date": "26 Mar 2025"
        },
        {
            "title": "Africa ready to lead: President. . . revels over Kirsty’s emphatic victory",
            "url": "https://www.herald.co.zw/africa-ready-to-lead-president-revels-over-kirstys-emphatic-victory/",
            "content": "Wallace Ruzvidzo\n\nHerald Reporter\n\nTHE election of former Minister of Sport, Recreation, Arts and Culture, Kirsty Coventry, to the helm of the International Olympic Committee (IOC), is testament that Africa is ready to lead at the highest level, President Mnangagwa has said.\n\nIn his address at a banquet he hosted for IOC president-elect Coventry at State House in Harare last night, the President said her victory was not only for Zimbabwe, but African people as a whole.\n\nCoventry becomes the 10th president of the IOC and the first woman, as well as the first person from outside Europe and the United States, to lead the worlds most powerful sporting body.\n\nThe victory of Honourable Coventry is, thus, not only a source of inspiration and pride for Zimbabwe, but for the SADC region and Africa as a whole.\n\nWith five world records to her name, breaking records is in her nature; she has done it again.\n\nIn the true spirit of Africa tinoti: Makorokoto, Amhlophe and Hongera (as they say in Swahili), President Mnangagwa said.\n\nHe also paid tribute to Coventrys family for mentoring her to become a national treasure.\n\nAllow me to also pay tribute and gratitude to Mr Rob and Mrs Lyn Coventry, parents of our golden girl as well as to her husband Mr Tyrone Seward.\n\nWe thank you for the mentorship, guidance and support as well as all the sacrifices you made along the way, for Honourable Coventry to realise her career success. Congratulations.\n\nYou are not only our national treasure, but a treasure to all young athletes across Africa and the developing world, President Mnangagwa said.\n\nHe challenged parents and guardians to nurture the younger generations to become champions.\n\nI challenge parents and guardians to nurture, support and encourage our talented young boys and girls as they compete in various sporting disciplines\n\nThe success milestone by Minister Kirsty Coventry signifies the enduring warrior spirit and unflinching resilience embedded in us, as a proud Zimbabwean and African people, said the President.\n\nHe added that during Ms Coventrys tenure as Sports Minister, Zimbabwe had become more competitive in various sporting disciplines.\n\nSince her tenure, the Zimbabwe Senior Netball team, the Gems, qualified for the Netball World Cup on two occasions, the National Soccer Team, the Warriors qualified for AFCON, and the mens Rugby Team scooped the African Championship, among others.\n\nThe Zimbabwe Chevrons and the Lady Chevrons alike, have become more competitive following the improved administration of Cricket.\n\nWe now host both Test and One Day International Games on a more frequent basis, the highlight of which was the ICC T20 World Cup Qualifiers in 2023.\n\nThe leadership of Honourable Coventry has, therefore, been instrumental to Zimbabwe successfully hosting various regional and international sporting events, further elevating our countrys reputation as a favourable global sporting destination, said President Mnangagwa.\n\nHe said as a strong advocate of inclusion, good governance and professionalism in sports administration, Ms Coventry had constantly advocated for sports administrators in the country to occupy decision-making posts regionally, continentally and internationally.\n\nIn line with my Governments national development mantra of leaving no one and no place behind, the Honourable Minister and incoming president we are celebrating today, oversaw the construction of multi-purpose facilities in disadvantaged areas across the country.\n\nThese include Chambuta in Chiredzi; Rafamoyo in Gutu; Mabhikwa in Lupane and Karigamombe in Zvimba, among others, the President said.\n\nThese projects and other strategies spearheaded by my dear Minister have encouraged inclusivity in sports, and ensured that young boys and girls across the country access opportunities to develop and nurture their God-given talents.\n\nIn his remarks to introduce the President, Vice President Dr Constantino Chiwenga described the IOC president-elect as a record-breaker whom the country was proud of.\n\nThis is a moment of immense pride for our country, he said.\n\nOn her part, former Minister Coventry chronicled how she had a dream to represent Zimbabwe at the Olympics while watching the 1992 Barcelona Olympics at home.\n\nShe went on to represent Zimbabwe and win the countrys first gold medal at the Athens Olympics in 2004.\n\nThe IOC president-elect expressed gratitude to President Mnangagwa for giving her an opportunity to serve as the countrys Sports Minister.\n\nI am extremely grateful for that opportunity, she said.\n\nMs Coventry said although she consequently had to step down as Sports Minister, she will always support the Second Republic as and when needed.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Untitled-12-1.jpg",
            "description": "THE election of former Minister of Sport, Recreation, Arts and Culture, Kirsty Coventry, to the helm of the International Olympic Committee (IOC), is testament that Africa is ready to lead at the highest level, President Mnangagwa has said.",
            "time": "18:09",
            "date": "26 Mar 2025"
        },
        {
            "title": "Lt-Gen Sanyatwe retired, replaces Coventry as Sports Minister",
            "url": "https://www.herald.co.zw/lt-gen-sanyatwe-retired-replaces-coventry-as-sports-minister/",
            "content": "Mukudzei Chingwere\n\nHerald Reporter\n\nPRESIDENT Mnangagwa has retired Zimbabwe National Army (ZNA) Commander, Lieutenant-General Anselem Sanyatwe and appointed him Sport, Recreation, Arts and Culture Minister with immediate effect.\n\nHe replaces Dr Kirsty Coventry, the newly-elected president of the International Olympic Committee (IOC), who will now assume the most powerful position in the world of sports.\n\nHer tenure begins on June 23 and she will be based at the IOC headquarters in Lausanne, Switzerland.\n\nLt-Gen Sanyatwe is a distinguished military Commander, having played a huge role in Zimbabwes war of liberation and military operations after Independence.\n\nHis impressive career in the military saw him rise through the ranks to become the ZNA Commander.\n\nLt-Gen Sanyatwe also has diplomatic experience from his previous tenure as Ambassador of Zimbabwe to Tanzania.\n\nIn a statement last night, Chief Secretary to the President and Cabinet, Dr Martin Rushwaya, announced the new appointment.\n\nActing in terms of section 108 (1) (a) of the Constitution of Zimbabwe, His Excellency President Dr E.D Mnangagwa has relieved Honourable Kirsty Coventry from her position as Minister of Sport, Recreation, Arts and Culture following her well-deserved election as the president of the International Olympic Committee, said Dr Rushwaya.\n\nIn terms of section 216 (2) (Command of Defence Forces) as read with section 340 (1) (f) of the Constitution of Zimbabwe and section 115 (Commander in Chief Prerogative) of the Defence Act [Chapter 11:02], the President, in His capacity as such and as Commander in Chief of the Defence Forces, has relieved and retired Lieutenant General Anselem Nhamo Sanyatwe, from the Zimbabwe Defence Forces and as Commander of the Zimbabwe National Army with immediate effect.\n\nAnd: In terms of section 104 (3) of the Constitution, appoints Lieutenant General (Rtd) Anselem Nhamo Sanyatwe as Minister of Sport, Recreation, Arts and Culture with immediate effect.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2018/09/Martin-Rushwaya-680x380.jpg",
            "description": "PRESIDENT Mnangagwa has retired Zimbabwe National Army (ZNA) Commander, Lieutenant-General Anselem Sanyatwe and appointed him Sport, Recreation, Arts and Culture Minister with immediate effect.",
            "time": "18:09",
            "date": "26 Mar 2025"
        }
    ]
}