{
    "news": [
        {
            "title": "Zim abolishes death penalty",
            "url": "https://www.herald.co.zw/zim-abolishes-death-penalty/",
            "content": "Herald Reporter\n\nPRESIDENT Mnangagwa has signed the Death Penalty Abolition Bill into law, a development that effectively marks the end of capital punishment in the countrys legal statutes.\n\nThe Bill, which sailed through Parliament last month, is set to save more than 65 convicts facing the gallows, as the Government takes bold steps to remove capital punishment from the statutes.\n\nChief Secretary to the President and Cabinet, Dr Martin Rushwaya, made the announcement in an Extraordinary Government Gazette published yesterday.\n\nThe following laws, which were assented to by His Excellency the President, are published in terms of section 131(6)(a) of the Constitution of ZimbabweDeath Penalty Abolition Act [Chapter 9:26] (No. 4 of 2024), reads the notice.\n\nGovernments decision to expunge the death penalty will see the country moving with international trends and best practices as capital punishment has since been regarded as inhumane.\n\nThe Bill was initially introduced by Dzivaresekwa Member of Parliament, Mr Edwin Mushoriwa, before the Government took over given its importance.\n\nFollowing the gazetting of the Act, a person convicted of murder in aggravating circumstances shall be liable to a jail term of between 20 years and life imprisonment.\n\nIn abolishing the death penalty, Clause Two of the Act reads as follows: No court shall impose sentence of death upon a person for any offence, whenever committed, but instead shall impose whatever other competent sentence is appropriate in the circumstances of thecase.\n\nThe Supreme Court shall not confirm a sentence of death imposed upon an appellant, whenever that sentence may have been imposed, but instead shall substitute whatever other competent sentence is appropriate in the circumstances of the case, no sentence of death, whenever imposed, shall be carried out.\n\nDuring debate on the Bill in Parliament, Justice, Legal and Parliamentary Affairs Minister Ziyambi Ziyambi said experience had shown that capital punishment has not helped in reducing the offence of murder.\n\nHe said while in principle, people favoured the death penalty for extreme crimes, in practice, they were hesitant to see it carried through as shown by the fact that there were more than 60 prisoners on death row, with some of them having waited for several years to be executed.\n\nMinister Ziyambi said it was interesting to note that while many might advocate for the death penalty, there was hardly a person in the country who wanted the hangmans job, despite the high reward that goes with it.\n\nIt inflicts psychological torment, not only on the person to be executed, but even on the people involved somehow with the execution, said Minister Ziyambi in the National Assembly last year.\n\nHe said during debate on the Bill in Cabinet, President Mnangagwa gave a heart rending narration of his experience in prison when he was jailed for his political involvement during the liberation struggle.\n\nHis Excellency, our President, Dr Mnangagwa said that upon execution of comrades who were on death row, they were given a wheelbarrow with their comrades and told to bury them.\n\nThey were then ordered to plant lawn on top of the graves, and irrigate it so that it could grow.\n\nImagine the psychological trauma that they went through and this is the reason why we are saying, why do we need as a nation such an inhumane treatment to others, Minister Ziyambi said.\n\nHe said capital punishment did not deter crime, neither did it address its root cause.\n\nOther laws that were assented to by the President and published in yesterdays Gazette include the Appropriation (2025) Act, Finance (No. 2) Act, which seeks to give legal effect to various fiscal measures announced by Finance, Economic Development and Investment Promotion Minister, Professor Mthuli Ncube in his 2025 NationalBudget.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Death-penalty--680x380.jpg",
            "description": "Herald Reporter PRESIDENT Mnangagwa has signed the Death Penalty Abolition Bill into law, a development that effectively marks the end of capital punishment in the country’s legal statutes. The Bill, which sailed through Parliament last month, is set to save more than 65 convicts facing the gallows, as the Government takes bold steps to remove […]",
            "time": "18:29",
            "date": "01 Jan 2025"
        },
        {
            "title": "Unflinching energy to spur Zim to greater heights",
            "url": "https://www.herald.co.zw/unflinching-energy-to-spur-zim-to-greater-heights/",
            "content": "Blessings Chidakwa-Herald Reporter\n\nALL Zimbabweans should focus their energy towards driving the national vision, goals and aspirations in the New Year that begins today, President Mnangagwa has said.\n\nThe President has always remained committed to creating an enabling environment for all hard-working Zimbabweans to continue excelling in their different fields.\n\nIn his address at the National Thanksgiving and Dedication Service in Bulawayo on December 29, President Mnangagwa said every Zimbabwean should play a part in building the nation.\n\nIn the year ahead (this year), unflinching focus on our national vision, goals and aspirations, coupled with hard honest work; production and productivity; should see us live up to the instruction given to us in Genesis Chapter 1 verse 28, he said.\n\nIt is our responsibility and duty to be fruitful and to subdue the earth. We remain anchored on our national philosophy, Nyika inovakwa, inotongwa, inonamatirwa nevene vayo/ Ilizwe, lakhiwa, libuswe likhulekelwe ngabanikazi balo.\n\nPresident Mnangagwa said through the theme of this years National Thanksgiving and Dedication Service, the Church in Zimbabwe is rallying the nation to progressive, Godly and Biblical patriotism.\n\nIndeed, the land, Zimbabwe which the Lord has given us, is an exceedingly good land. We are thankful to the Almighty God.\n\nFurther, development initiatives and programmes for the upliftment and prosperity of our people, have become the solid foundation upon which we are building our country brick by brick and stone upon stone, he said.\n\nThe President said the people of Zimbabwe are their own liberators and using their indigenous resources, skills and talents, they will uplift the nation while others are welcome to assist them.\n\nIn the agriculture sector, as a Government and a people, we are not folding our arms and surrendering to the vagaries of climate change. Numerous dams are being built and boreholes sunk to mitigate the impact of climate change.\n\nIn relation to the current uneven rainfall patterns, Let us ask for rain from the Lord, for it is the Almighty God who makes storm clouds and gives showers of rain to everyone (Zachariah Chapter 10 verse 1), he said.\n\nPresident Mnangagwa said the nation also thanks the Almighty God for the rapid modernisation and expansion of the infrastructure and increased inflows of economic investments, diaspora remittances, which are having transformational impacts on economic growth.\n\nIn his address to the last Cabinet meeting of 2024, President Mnangagwa said Zimbabwe had achieved many milestones in various areas such as infrastructure development, stabilising the local currency and developing the mining, agricultural and manufacturing sectors.\n\nIt is expected that more achievements would be recorded this year as the country moves towards attaining Vision 2030 of an empowered upper middle income society.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/President-Mnangagwa-7-680x380.jpg",
            "description": "Blessings Chidakwa-Herald Reporter ALL Zimbabweans should focus their energy towards driving the national vision, goals and aspirations in the New Year that begins today, President Mnangagwa has said. The President has always remained committed to creating an enabling environment for all hard-working Zimbabweans to continue excelling in their different fields. In his address at the […]",
            "time": "18:29",
            "date": "01 Jan 2025"
        },
        {
            "title": "Govt clarifies retirement age extension",
            "url": "https://www.herald.co.zw/govt-clarifies-retirement-age-extension/",
            "content": "Blessings Chidakwa-Herald Reporter\n\nTHE extension of the retirement age for uniformed forces and civil servants seeks to leverage their skills and vast experience, Justice, Legal and Parliamentary Affairs Minister Ziyambi Ziyambi has said.\n\nIn an interview in Harare yesterday, Minister Ziyambi said the move also takes into account the rising life expectancy in the country, with middle-aged adults now on average reaching their 80s.\n\nEffective immediately, the retirement age for members of the uniformed forces and the three civilian public services has been raised by five years.\n\nThis change aligns Zimbabwe with international trends, as seen in countries like China and France, which have also adjusted their retirement ages.\n\nWithout such adjustments, either pensions would have to be reduced or the working population would have to support far more older people as technology and medical advances mean that people live longer and in any case, most jobs do not require backbreaking physical work.\n\nMinister Ziyambi said Cabinets decision stemmed from an evaluation of the current life expectancy, which now averages 80 years.\n\nHe underscored the importance of the use of experienced personnel for enhanced efficiency.\n\nWhy waste productivity and experience? Instead, we must tap into that. We must harness experience to ensure efficiency. We started with the judges to say those capable must serve on the bench so as to harness experience on justice delivery, Minister Ziyambi said.\n\nThe retirement age for judges was adjusted to 70, with an option to serve until 75 for those who are mentally and physically fit.\n\nConcerns regarding reduced opportunities for younger workers were addressed by Minister Ziyambi, who indicated that the job market would eventually adjust to the changes as, in the end, the older workers would eventually retire.\n\nAccording to Statutory Instrument 198 of 2024, the retirement age for civil servants has been raised from 65 to 70. Regular soldiers can now retire at 55, up from 50, with options to extend their service to 60 and even 65.\n\nCommissioned officers in the Zimbabwe Defence Forces can now retire at 65, with the possibility to serve until 70.\n\nThis trend is not unique to Zimbabwe.\n\nChina has initiated a gradual increase in retirement ages for many job categories, and France has raised its state pension age from 62 to 64 in recent reforms.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2020/08/1908-1-1-PAGE-2-ZIYAMBI.jpg",
            "description": "Blessings Chidakwa-Herald Reporter THE extension of the retirement age for uniformed forces and civil servants seeks to leverage their skills and vast experience, Justice, Legal and Parliamentary Affairs Minister Ziyambi Ziyambi has said. In an interview in Harare yesterday, Minister Ziyambi said the move also takes into account the rising life expectancy in the country, […]",
            "time": "18:29",
            "date": "01 Jan 2025"
        },
        {
            "title": "First Lady mourns Gogo Ncube",
            "url": "https://www.herald.co.zw/first-lady-mourns-gogo-ncube/",
            "content": "Robin Muchetu in KWEKWE\n\nFIRST Lady Dr Auxillia Mnangagwa has paid tribute to the late Gogo Edith Ncube, mother to Midlands Minister of State for Provincial Affairs and Devolution, Owen Ncube, saying she moulded her political career and always gave wise counsel.\n\nGogo Ncube (77) died on Christmas Day after a long illness. She was diabetic and hypertensive.\n\nThe First Lady visited the late Gogo Ncubes residence in Kwekwe to pay her condolences to the Ncube family, detailing the fond memories she had with her that inspired her to join politics.\n\nWe are here to celebrate a life well lived and to thank Gogo personally for all the teachings she imparted to me. She was a disciplinarian to us when we erred.\n\nI started my political career here in Kwekwe, in 1981 and I met Gogo here, she was very energetic over party issues. It was still Zanu then. Gogo Ncube made sure that I got enough support to win the elections as I was their candidate here. These are our elders who do not give up on what they set out to do even if there are new things around them, they remain steadfast. She was among the active Party members who never deserted the party, said Dr Mnangagwa.\n\nShe said Gogo Ncube attended party meetings and events diligently and she always relied on her.\n\nFirst Lady Dr Auxillia Mnangagwa addresses mourners at the funeral of Gogo Edith Ncube who is the mother to Minister of State for Midlands Provincial Affairs and Devolution Cde Owen Ncube in Kwekwe yesterday. Listening during her address is the Zanu PF Midlands chair lady Cde Tsitsi Zhou and Minister of Tourism Cde Barbra Rwodzi.\n\nShe always spoke about discipline to me and others, she taught us how to live in harmony. She taught us all we needed to learn and I listened to her wise counsel. It gave me so much strength that they spoke so well about the party that I was inspired to join politics and continue with them. This was just after Independence. She moulded us as young women and men to be who we are. So I am here to thank Gogo for this, said Dr Mnangagwa.\n\nThe First Lady said many who were hand-held by Gogo Ncube in their political careers must continue with her good legacy and impart her wisdom to others.\n\nFurthermore, she said due to the nature of politics, there were sometimes serious disagreements but she stood firm and ensured peace prevailed attending all meetings they had at the Kwekwe Party Office.\n\nToday Gogo is gone, the President also sent me here to come and console you, he called for continued unity and peace now that she is no more and said we must hold on to her teachings. Even if some of you are now aged, I encourage you to maintain good relations with others living in peace and harmony. Gogo never said harsh words that would hurt you but she spoke softly while correcting us, she added.\n\nThe First Lady said Gogo Ncube had been struggling with diabetes but fought a good fight till she breathed her last in hospital.\n\nShe said the province must continue to rally behind Minister Ncube during this difficult time.\n\nShe also commended the Minister for his hard work.\n\nFirst Lady Dr Auxillia Mnangagwa joins mourners in song and dance at the funeral of Gogo Edith Ncube, who is the mother to Minister of State for Midlands Provincial Affairs and Devolution Cde Owen Ncube, in Kwekwe yesterday. Pictures: Eliah Saushoma.\n\nWe have seen all the hard work the family has put in for Gogo who was now advanced in age. I am glad she now had varoora and also her daughters who did a great job. Cde Ncube also did a lot of work to ensure she got treatment, she added.\n\nAmai Mnangagwa said the life of the late Gogo Ncube was exemplary as it guided many people like her to find space in the political space via her tremendous support and guidance through the years.\n\nHer work remains engraved in our hearts, its her face that we will not see anymore only. Mbuya must rest in peace. We need to unite and work together, we are one people, let us not spread hate. I want to thank her for all the lessons, what she taught me, I will remember and I will treasure everything she added.\n\nZanu PF Midlands provincial Chairman Cde Edson Chiherenge said they had lost a reliable leader who provided wise advice as an elder in the party.\n\nGogo worked for 25 years as our district Chairperson in Kwekwe, and as a party, we have lost a great leader. People like her have been in the party for many years and have a rich history of knowing the importance of being a member of Zanu PF.\n\nThe gap that she has left is huge because she was an advisor and to replace her will be a challenge. She was a mentor to many who she taught to respect the party and its structures. She also taught us conflict resolution and unity, he said.\n\nThe Midlands Provincial Chairlady Cde Tsitsi Zhou expressed grief over the demise of Gogo Ncube saying they had a good working relationship.\n\nShe added that Gogo worked for the party and played an advisory role to many.\n\nA nephew to the Ncube family, Mr Timothy Phiri, said the late Gogo Ncube was a unifier both in the party and home.\n\nGogo Ncube leaves behind three children and over 15 grandchildren.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/First-Lady-and-Minister-Ncube-680x380.jpg",
            "description": "Robin Muchetu in KWEKWE FIRST Lady Dr Auxillia Mnangagwa has paid tribute to the late Gogo Edith Ncube, mother to Midlands Minister of State for Provincial Affairs and Devolution, Owen Ncube, saying she moulded her political career and always gave wise counsel. Gogo Ncube (77) died on Christmas Day after a long illness. She was […]",
            "time": "18:29",
            "date": "01 Jan 2025"
        },
        {
            "title": "Sadc calls for immediate peace in Mozambique",
            "url": "https://www.herald.co.zw/sadc-calls-for-immediate-peace-in-mozambique/",
            "content": "Ivan Zhakata-Herald Correspondent\n\nTHE Southern African Development Community (SADC) has called for calm in Mozambique, where post-election unrest has led to loss of lives and significant economic disruptions.\n\nTanzania President and Chairperson of the SADC Organ on Politics, Defence and Security Cooperation, Dr Samia Suluhu Hassan, urged all parties to exercise restraint and prioritise the well-being of the Mozambican people.\n\nWe are deeply concerned by the continued loss of lives, injuries, destruction of private property, and public infrastructure, she said.\n\nPresident Hassan described the ongoing unrest as a serious threat to Mozambiques stability, cross-border trade and the free movement of people.\n\nThe unrest, which erupted following the announcement of election results, has escalated since December 23 after the Constitutional Council of Election Results upheld Frelimos crushing victory, which saw President-elect Cde Daniel Chapo winning 65,17 percent of the vote, with opposition leader Mr Venancio Mondlane, who is calling for most of the disturbances, getting 24,19 percent.\n\nPresident Hassan said the regional bloc was ready to support Mozambique in resolving the crisis.\n\nSADC calls upon all parties to exercise restraint and refrain from actions that escalate violence and unrest, she said.\n\nWe reaffirm our readiness to assist, through appropriate mechanisms, in facilitating a peaceful resolution to the existing challenges.\n\nWe appeal for an immediate cessation of all hostilities, while reiterating the importance of prioritising the well-being and livelihoods of the Mozambican people.\n\nThe violence has claimed over 60 lives so far, and throttled the economy as some businesses have closed in fear of looting and attacks against employees.\n\nSADC Chairman, President Mnangagwa, released a statement on Christmas Day calling on all parties with an interest in the October 9, 2024 elections to respect the court ruling.\n\nPresident Mnangagwa also challenged foreign powers to respect the sovereign will of Mozambicans.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Dr-Samia-Suluhu-Hassan-680x380.jpg",
            "description": "Ivan Zhakata-Herald Correspondent THE Southern African Development Community (SADC) has called for calm in Mozambique, where post-election unrest has led to loss of lives and significant economic disruptions. Tanzania President and Chairperson of the SADC Organ on Politics, Defence and Security Cooperation, Dr Samia Suluhu Hassan, urged all parties to exercise restraint and prioritise the […]",
            "time": "18:29",
            "date": "01 Jan 2025"
        },
        {
            "title": "New Year’s message to women from the First Lady",
            "url": "https://www.herald.co.zw/new-years-message-to-women-from-the-first-lady/",
            "content": "I greet you all womenfolk as we enter the year 2025.\n\nAs the year ends, I would like to appreciate and recognise the important roles that women play as mothers.\n\nAs mothers, we have a God-given role to administer and look after our families. Our husbands, children, extended family and all those in our care require that we be strong and resolute to foster positivity, uprightness and respect.\n\nWe are mothers first before anything else and motherhood is defined by love, care, guidance and teaching to nurture sons and daughters of Zimbabwe.\n\nDrug and substance abuse is rearing an ugly head in communities, robbing children of their future.\n\nIt has often led to sickness, injuries and death, while in some circumstances it has triggered crime.\n\nAs a mother, a woman, and the First Lady of our nation, Madzimai ndinoti ngatirambei tichisimbisa vana kuti vafambe mugwara rakanaka and continue the fight to keep our children and all those in our care away from drugs.\n\nOur children need to occupy their rightful places as children and focus on their schoolwork for a brighter future.\n\nLets follow the dictates of the Bible when raising our children, bearing in mind what the book of Proverbs says in chapter 22 verse 6. Train up a child in the way he should go: And when he is old, he will not depart from it.\n\nThose of our children who drop out of school due to pregnancy must be given a second chance and return to school. Government has done its part and made sure all hope is not lost and ours sanaAmai is to encourage the children to do good. Taking children for prayers and teaching them to honour God is proper.\n\nWe say not to crude, coarse and unpolished language. We need good morals and respect from our children.\n\nRegular family talks and openness are a requisite in todays world.\n\nAs women, we are pillars of the community and the soul of the family, and we are divinely equipped to influence children in the fear of the Lord, thereby making a wholesome and substantial contribution to human society.\n\nSemadzimai, we share the same dreams for our children, the same hopes for a prosperous future and the same love for our beautiful nation.\n\nIt is essential, as mothers, that we promote good communication with our spouses to curb discord which largely manifests through domestic violence.\n\nAs such, we must always candidly speak against social ills such as Gender-Based Violence.\n\nI also implore you to lead exemplary and dignified lives, shunning promiscuity but respecting the marriage institution. Always remember to be submissive to your husbands as unto the Lord like what the Bible says in Ephesians 5: 22.\n\nWhen it comes to friendships, lets be associated with women of valour.\n\nMadzimai, let us continue to work hard using our hands. Lets showcase that we are in our space. Be economically empowered and remember the path to success is often paved with challenges, but it is through hard work, perseverance, and commitment to learning that you will rise above any obstacle.\n\nLet us all be united as women, bearing in mind that each one of us brings unique perspectives. Let us listen to one another, learn from each other, and build bridges that will make us all successful.\n\nLets not forget to carry the spirit of spreading love to the needy and the vulnerable in our communities.\n\nLet us sow the seed of love, unity, caring for one another, and assisting the elderly.\n\nThroughout last year, it was also a profound joy and a deeply enriching spiritual journey working alongside women from various churches and sectors in several programmes.\n\nLet us continue supporting one another, nurturing bonds that transform our homes, communities, and the nation at large.\n\nFrom my heart to yours Happy New Year, and may our families remain the guiding light of Zimbabwes future.\n\nI wish you a productive, prosperous and blessed 2025.\n\nGod bless you all!\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/First-Lady-Auxillia-Mnangagwa-680x380.jpg",
            "description": "I greet you all womenfolk as we enter the year 2025. As the year ends, I would like to appreciate and recognise the important roles that women play as mothers. As mothers, we have a God-given role to administer and look after our families. Our husbands, children, extended family and all those in our care […]",
            "time": "18:29",
            "date": "01 Jan 2025"
        },
        {
            "title": "Harare Mayor promises to improve city",
            "url": "https://www.herald.co.zw/harare-mayor-promises-to-improve-city/",
            "content": "Herald Reporter\n\nHARARE Mayor, Councillor Jacob Mafume, has committed to building on last years achievements, even as the city fell short of its ambitious vision of turning the capital into a world-class city by this year.\n\nThis follows widespread criticism regarding Harares failure to provide essential services such as water, transport, waste management, and energy. The target set in 2014 is now out of reach, with residents expressing frustration over the citys lack of progress.\n\nMany have noted a decline in service delivery, rather than the anticipated improvements.\n\nDespite these challenges, Clr Mafume remains optimistic about Harares future.\n\nWe are a resilient and resourceful nation. We are looking towards 2025 to consolidate and deepen the progress that we have made this year, he said.\n\nClr Mafume reaffirmed his belief in Harares status as the leading city in Zimbabwe. Harare is the go-to city for most people in Zimbabwe. We must make it not only a destination of choice, but also a place where people can achieve their dreams, live in peace, and work in hope.\n\nThe city is presently facing significant revenue leakages, with reports indicating that only US$100 was collected from tuckshops between January and April last year.\n\nIn contrast, the city managed to collect ZiG185 741 819 from tuckshop fees between April and September 2024, following a resolution requiring compliant tuckshops in residential areas to pay fees.\n\nClr Mafume described the revenue discrepancy as unacceptable and pledged to hold the responsible department accountable for the lapses.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/09/Mayor-Jacob-Mafume.jpg",
            "description": "Herald Reporter HARARE Mayor, Councillor Jacob Mafume, has committed to building on last year’s achievements, even as the city fell short of its ambitious vision of turning the capital into a world-class city by this year. This follows widespread criticism regarding Harare’s failure to provide essential services such as water, transport, waste management, and energy. […]",
            "time": "18:29",
            "date": "01 Jan 2025"
        },
        {
            "title": "Festivities, fireworks as Zim celebrates New Year",
            "url": "https://www.herald.co.zw/festivities-fireworks-as-zim-celebrates-new-year/",
            "content": "Herald Reporters\n\nZIMBABWEANS spent the better part of yesterday picking up some food, drinks, fire crackers and preparing to attend cross-over services at churches while others went to entertainment joints.\n\nIn Harare, the capital city, thousands took to the streets and public venues for a night filled with entertainment, music, and delicious food as they waited for the New Year, 2025, which arrived at midnight.\n\nAt many places around town, the atmosphere was electric, with vibrant displays of Zimbabwean culture captivating both locals and visitors.\n\nPeople gathered at popular spots, where live music resonated through the air, and fireworks lit up the night sky in a dazzling array of colours.\n\nMany Zimbabweans also chose to celebrate in more intimate settings, attending church services or honouring traditional customs by gathering with family and friends.\n\nA street vendor, Mrs Sipho Khumalo, said: We have been busy selling snacks and drinks, and it is nice to see people enjoying themselves.\n\nIt is a reminder that even in hard times, we can come together and celebrate.\n\nFormer Harare South legislator, Cde Mr Shadreck Mashayamombe, commended Government for its efforts in stabilising the economy.\n\nWe expect the Government to enhance our infrastructure, especially roads, water supply, and sewer systems, he said.\n\nMr Edmore Gwengwe, chairman of the Harare Youth Transporters Association, thanked the Governments recent initiatives, such as the introduction of conventional buses from Belarus, to alleviate transport challenges for commuters.\n\nRespected lawyer, Advocate Obert Gutu, shared his expectations for the coming year.\n\nGrowing the formal sector is essential for expanding our tax base, he said.\n\nAdv Gutu also called for improvements in public health services and agricultural productivity, advocating for better access to affordable healthcare and enhanced food security for vulnerable populations.\n\nMs Linda Masarira, leader of the opposition Labour, Economists and African Democrats (LEAD), urged Africans to reflect on the continents journey and the challenges that lie ahead.\n\nMay this New Year bring us closer to the liberation and prosperity that our ancestors dreamed of, she said, highlighting the importance of unity and collective progress.\n\nMeanwhile, the police reminded citizens to celebrate responsibly, maintaining safety for all. National police spokesperson, Commissioner Paul Nyathi, announced that police visibility would be heightened in public areas to ensure order during the festivities.\n\nHe urged individuals and institutions using fireworks to adhere to local laws and notify authorities to ensure public safety.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/A-woman-sells-fire-crackers-680x380.jpg",
            "description": "Herald Reporters ZIMBABWEANS spent the better part of yesterday picking up some food, drinks, fire crackers and preparing to attend cross-over services at churches while others went to entertainment joints. In Harare, the capital city, thousands took to the streets and public venues for a night filled with entertainment, music, and delicious food as they […]",
            "time": "18:29",
            "date": "01 Jan 2025"
        },
        {
            "title": "Sound water resources management contributes to bumper wheat harvest",
            "url": "https://www.herald.co.zw/sound-water-resources-management-contributes-to-bumper-wheat-harvest/",
            "content": "Precious Manomano-Herald Reporter\n\nThis year Zimbabwe achieved an unprecedented milestone in agricultural production, recording a remarkable wheat harvest of over 555 824 tonnes through the effective management of water resources by the Zimbabwe National Water Authority (ZINWA), which implemented strategic irrigation practices across the country.\n\nFollowing a devastating El Nio-induced drought, ZINWA utilised its extensive network of dams and water stocks from previous seasons to ensure that farmers had adequate water supply, thus supporting the Governments Wheat-Based Food Security initiative.\n\nZINWAs head of corporate communications and marketing Mrs Marjorie Munyonga highlighted the proactive measures taken to ensure that the season becomes successful.\n\nThe Authority instituted a thorough water audit in the dams to ascertain the adequacy of the resource, ensuring a successful season and the achievement of the 120 000-hectare target for wheat, she said.\n\nFollowing this audit, ZINWA engaged with farmers unions, financiers, and farmers to emphasise the importance of obtaining water abstraction agreements and adhering to them.\n\nAfter planting and throughout the whole season, the Authority would regularly monitor water abstractions, including using Geographic Information Systems (GIS) to detect and promptly respond to any acts of illegal water usage, Mrs Munyonga added.\n\nZINWA water bailiffs were under strict instruction not to release any water to individuals without water abstraction agreements.\n\nThis approach ensured that all released water was channelled towards legitimate wheat farmers.\n\nTo further support wheat production, ZINWA introduced seasonal billing for all wheat farmers, allowing them to access and utilise water during the cropping season and pay only after receiving payments from their financiers or off-takers of their produce through stop order facilities.\n\nAdditionally, a reduced tariff of US$10,76 per megalitre for A2 wheat farmers provided further relief, enabling uninterrupted farming activities.\n\nThe Government has implemented several measures to ensure the attainment of a wheat target of 600 000 tonnes, surpassing the 360 000 tonnes needed for national annual consumption.\n\nZESA has also prioritised energy supply to wheat farmers, even during load shedding, encouraging banks and contractors to treat electricity as an essential input.\n\nWith adequate seed and fertilisers provided for 120 000 hectares of wheat, and farmers linked to combine harvesters and grain dryers at marketing depots, the outlook for wheat production in Zimbabwe remains promising.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/11/Untitled-87-1.jpg",
            "description": "Precious Manomano-Herald Reporter This year Zimbabwe achieved an unprecedented milestone in agricultural production, recording a remarkable wheat harvest of over 555 824 tonnes through the effective management of water resources by the Zimbabwe National Water Authority (ZINWA), which implemented strategic irrigation practices across the country. Following a devastating El Niño-induced drought, ZINWA utilised its extensive […]",
            "time": "18:29",
            "date": "01 Jan 2025"
        },
        {
            "title": "Editorial Comment: Building the new Zim continues in the new year",
            "url": "https://www.herald.co.zw/editorial-comment-building-the-new-zim-continues-in-the-new-year/",
            "content": "Today marks the start of a new year, and almost certainly a better year than 2024 which saw Zimbabwe continue to grow and progress, albeit at a much slower rate than has become the Second Republic norm because of the El Nino drought and falling mineral prices.\n\nHowever, it must still be noted that the economy did grow 2 percent in 2024, thanks to the continuous rise in tourism, the growth in mineral volumes and the added value of more local processing counterbalancing the fall in prices, and steady growth in industry.\n\nThis is one reason why the new year must automatically be better. If we could still grow and progress in a bad year then we will grow faster in the succeeding year, regardless of climate and the global economy because we have absorbed the downside and so have the lower base to expand from, and will grow a lot faster given a reasonable agricultural season.\n\nAfter a long dry December better rains are now falling and in any case the Government has accelerated the refurbishment of older irrigation schemes and opened up new ones so that there is a lot more irrigated land this year with the eventual aim that within a very few years we will be able to grow all our food under irrigation in an emergency.\n\nThe Second Republic is continuing with the steady progress we have seen since 2018, as President Mnangagwa stresses that we build our better Zimbabwe a brick at a time.\n\nThe road network continues to expand, as thanks to the Zinara clean up, with that authority now clearing all audit hurdles, there are licence fee funds for all road authorities and the toll revenues for upgrading the national highways. This is why there can be this steady and significant progress for all roads, from the major highways down to the remote gravel rural roads.\n\nOn the social services side, the Government has ensured no one went hungry as a result of dramatically reduced harvests in the worst drought for many years, and will continue its assistance programmes for several more months until the new harvest will hopefully make most farming families once again self-sufficient and refill the silos with local grain, rather than imported grain, for the millers and other industrialists.\n\nStill in the social service side, the continuous progress in upgrading the public health and education systems progresses, with 2024 seeing expansion of the health network, more inroads into driving back old diseases like malaria, and new facilities for more advanced medicine and surgery.\n\nFor State schools, another 8 000 teachers are to be hired this year. Some of these will be replacing older teachers who are retiring, although the increase in retirement ages also means that most of the new teachers will be expanding the largest single group in State employment and allowing schools to have smaller classes. The continuous building of new classroom blocks, largely through sensible use of devolution funds by local authorities, means that this is possible.\n\nAgain the national budget keeps the provisions for devolution funds, as well as raising medical spending to 13 percent of the budget, and what we are now seeing is a continuous upgrade process of many services as the better local authorities, generally speaking the rural district councils rather than the semi-failed urban authorities, bring new schools, classrooms and clinics into service at regular intervals.\n\nOne reason for this sometimes spectacular growth in rural services is the willingness of local communities to be heavily involved and willing to contribute local materials and labour, and their election of local ward councillors who perform their jobs properly and link the local efforts with the council and its devolution funds. The councils like backing strong local efforts as this ensures the local community take ownership of the new works, and through their contributions allow the council to stretch the devolution dollars.\n\nUrban authorities do not build these community relations, and in fact seem to ignore attempts of residents to form effective associations and play their part, but some public-private deals, such as the new huge market being built in Mbare, Harare, after a major fire show possible ways forward. But this year does need a determined effort to get urban authorities to mirror their rural district counterparts and get service delivery moving.\n\nThe Government is also this year moving with determination to move the informal sector into the formal economy, and for it to pay its fair share of taxes so progress can be accelerated.\n\nThis move stops regarding the informal sector as some temporary edifice erected to cope with bad times but rather sees it as a permanent incubator of small businesses that need to be regularised and able to grow and receive the support they deserve as well as building that network of small family businesses that tend to dominate many advanced economies providing decent incomes to millions of households.\n\nThis is the same economic philosophy driving rural development, that the way to progress is to ensure all farmers, including the smallholders, do not just subsist by growing their own food but can become businesses, earning money by growing and selling the right crops and processing some of these crops in their farms or within their communities for sale.\n\nThis requires in addition to the direct State programmes, that borehole programme, with new boreholes being continuously sunk, and now the new solar programme that will see rural families and communities getting modest solar installations that provide the essential energy needs that make life a lot more comfortable.\n\nAgain these programmes, like the expansion of irrigation and the extension of the road network, are not instant but expand, to take the Presidents concept, a borehole and a solar panel at a time. But as long as the drilling rigs keep moving there will be more boreholes and so long as the new solar scheme keeps adding communities and households, there will be progress.\n\nThis is why the programmes are designed to stretch over five years, but every few days another brick is added to building the new Zimbabwe, and that mounts up. We have been seeing the progress every year of the Second Republic, and this year promises to see that progress accelerating.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/President-Mnangagwa-4.jpg",
            "description": "Today marks the start of a new year, and almost certainly a better year than 2024 which saw Zimbabwe continue to grow and progress, albeit at a much slower rate than has become the Second Republic norm because of the El Nino drought and falling mineral prices. However, it must still be noted that the […]",
            "time": "18:29",
            "date": "01 Jan 2025"
        }
    ]
}