{
    "news": [
        {
            "title": "DRC peace bid: President to lead Sadc delegation",
            "url": "https://www.herald.co.zw/drc-peace-bid-president-to-lead-sadc-delegation/",
            "content": "Fungi Kwaramba\n\nNews Editor\n\nPRESIDENT Mnangagwa will lead a delegation of the Southern African Development Community to Tanzania later this week for an Extraordinary joint meeting with the East African Community (EAC) bloc in an effort to thrash out a peaceful resolution to the Democratic Republic of Congo (DRC) conflict.\n\nThis follows a decision made by the Extraordinary SADC Summit in Harare last week for a joint summit with the EAC, chaired by Kenyan President William Ruto.\n\nDRC, a member of both SADC and the EAC, accuses Rwanda, which is a member of the latter grouping, of backing M23 and other rebel groups, that have left death and destruction in eastern DRC.\n\nThe Extraordinary joint summit has been spawned by growing hostilities in eastern DRC that have killed thousands, with millions fleeing their homes.\n\nDeputy Chief Secretary in the Office of the President and Cabinet (Presidential Communications), Mr George Charamba, who is also the Presidential Spokesperson, said the President will lead a Double Troika, plus the Troops Contributing countries to the joint summit, that he will co-chair with President Ruto.\n\nThe President has a very important foreign affairs fixture in the form of the situation in DRC. There is a joint summit of SADC and the East African Community that will be held in Tanzania later this week, which has taken an extraordinary decision to invite all parties in the DRC conflict to a meeting. The President is an important interlocutor in the crisis considering that he has built a strong relationship with both the DRC President Felix Tshisekedi and President Paul Kagame, said Mr Charamba.\n\nThe SADC Double Troika comprises the SADC chairman, outgoing chairman and incoming and the Chairperson of the Organ on Politics, Defence and Security Cooperation.\n\nTanzanian President Samia Suluhu Hassan is the current chairperson of the SADC Organ on Politics, Defence and Security Cooperation.\n\nThe SADC Mission in the DRC (SAMIDRC), that was deployed on 15 December 2023 to support the Government of the DRC to restore peace and security in eastern DRC, comprises forces from the Republics of Malawi, South Africa and the United Republic of Tanzania.\n\nIn the aftermath of summits that were held separately by SADC andthe EAC, the United Nations Security Councils strident criticism of the rebel groups in eastern DRC and their sponsoring countries, a wide conflagration in the Greater Lakes region has seemingly been averted after the M23 and other rebel groups declared a ceasefire, ostensibly on humanitarian grounds.\n\nThe coalition of rebels, which recently intensified clashes in eastern Congo, claimed control over Goma, the capital of North Kivu province.\n\nClashes between government forces and rebel groups have left an estimated 900 civilians dead, displacing tens of thousands more.\n\nThe recent fighting in eastern DRC, which has been dogged by conflict for more than 30 years since the 1994 Rwandan genocide, has also claimed 16 soldiers from the South African National Defence Force (SANDF) and Malawi, who form part of the SADC Mission in the DRC (SAMIDRC).\n\nAs rebel forces gained the upper hand on the battlefield, capturing much of Goma, the largest city in eastern Congo, South Africa responded with a stern diplomatic warning. The South African government stated that any further attacks on its troops would be regarded as a declaration of war.\n\nIn a swift rebuttal, Rwandas President Kagame accused South Africa of acting as part of a belligerent force. He claimed that South African troops were engaged in offensive combat operations to support the Congolese government in its fight against its own citizens.\n\nResultantly, tensions were high before last weeks SADC Summit in Harare, which mandated its Organ Troika on Politics, Defence and Security Co-operation to engage all state and non-state parties to the conflict on a ceasefire process to protect lives and facilitate a smooth flow of humanitarian support to people and communities affected by the armed conflict.\n\nThe Summit also urged Political and Diplomatic leaders who are parties to the conflict to engage in a co-ordinated effort of dialogue, including supporting the Luanda Process, MONUSCO and others, to restore peace and security in eastern DRC.\n\nSADC leaders also reaffirmed their commitment to the DRCs sovereignty, territorial integrity, and long-term stability, pledging ongoing support for its development and security.\n\nLast week, the African Unions Peace and Security Council (PSC) at its 1256th Emergency Ministerial meeting on the Recent Developments in the Eastern Democratic Republic of Congo (DRC), condemned the DRC conflict and called for adherence to the Luanda Process.\n\nUnder the Luanda Process, Angolan President Joo Manuel Gonalves Loureno has tried to broker peace between DRC President Tshisekedi and his Rwandan counterpart Kagame. Such talks have, however, remained elusive, amid escalatory rhetoric and trading of accusations between the two leaders.\n\nThus, the summit, that will be held in Tanzania, offers a platform for both President Tshisekedi and President Kagame to meet directly with mediation from SADC and the EAC.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/3r23r-680x380.jpg",
            "description": "Fungi Kwaramba News Editor PRESIDENT Mnangagwa will lead a delegation of the Southern African Development Community to Tanzania later this week for an Extraordinary joint meeting with the East African Community (EAC) bloc in an effort to thrash out a peaceful resolution to the Democratic Republic of Congo (DRC) conflict. This follows a decision made […]",
            "time": "09:46",
            "date": "05 Feb 2025"
        },
        {
            "title": "President back from leave, to focus on economic growth",
            "url": "https://www.herald.co.zw/president-back-from-leave-to-focus-on-economic-growth/",
            "content": "Wallace Ruzvidzo\n\nHerald Reporter\n\nPRESIDENT Mnangagwa has officially returned from his month-long leave, and his packed schedule will prioritise Zimbabwes economic growth and stability, Deputy Chief Secretary (Presidential Communications) in the Office of the President and Cabinet, Mr George Charamba, has said.\n\nMr Charamba told The Herald yesterday that the President was officially back from his annual vacation, adding that major decisions will be made regarding the economy.\n\nPresident Mnangagwa last week took time off his annual break to chair a session on developments in the countrys economy designed to map the way forward.\n\nThe President is now officially back from his leave and as you may know there (have been) certain economic developments in the past few weeks, remember he had to break his leave last week to chair a meeting that focused on the economic developments in the country, so his major focus will be on the economy. Some major decisions will be made regarding the economy, he said.\n\nLast weeks meeting that was attended by Vice President Constantino Chiwenga, Vice President Kembo Mohadi, Finance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube and State Security Minister Lovemore Matuke, deliberated on measures Government has taken on the economy and developments in specific economic sectors, including the retail sub-sector.\n\nThe meeting culminated in the announcement of a raft of new measures to compel regulatory compliance within the retail and wholesale sectors, aiming to rein in the countrys increasingly informal economy.\n\nOn a regional level, the President, who is the current Southern African Development Community (SADC) Chair, will continue to lead the regional body in intensifying regional peace and security efforts.\n\nThe President last week chaired the Extraordinary SADC Summit held in Harare to discuss the security situation in the eastern Democratic Republic of Congo (DRC).\n\nBoth SADC Chair President Mnangagwa and East African Community (EAC) Chair Kenyan President William Ruto have since agreed for the convening of a joint summit between the two regional blocs.\n\nDuring his break, the President demonstrated that he was a hands-on leader as he performed his duties as and when needed.\n\nIn addition to chairing the economic meeting and the Extraordinary SADC Summit, the President saw off beneficiaries of an Algerian scholarship programme, welcomed ruling party and opposition legislators as they toured the First Familys Pricabe Farm in Kwekwe, a monumental tour that saw the unification of both Zanu PF and CCC MPs, and commemorated former Vice President John Landa Nkomos death, among other Presidential duties.\n\nIn the last Cabinet meeting of 2024, the President said going into the new year, the Second Republic would continue delivering for the general citizenry this year.\n\nThe service delivery demands of the people of Zimbabwe must be responded to timely. After all, we are a Government by the people and for the people, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/etheh-680x380.jpg",
            "description": "Wallace Ruzvidzo Herald Reporter PRESIDENT Mnangagwa has officially returned from his month-long leave, and his packed schedule will prioritise Zimbabwe’s economic growth and stability, Deputy Chief Secretary (Presidential Communications) in the Office of the President and Cabinet, Mr George Charamba, has said. Mr Charamba told The Herald yesterday that the President was officially back from […]",
            "time": "09:46",
            "date": "05 Feb 2025"
        },
        {
            "title": "USAID conduit for regime change: Trump",
            "url": "https://www.herald.co.zw/usaid-conduit-for-regime-change-trump/",
            "content": "Zvamaida Murwira and Joseph Madzimure\n\nUnited States President Donald Trumps administration has conceded that the US Agency for International Development (USAID) has been used as a conduit for regime change activities in several countries around the world, a development that vindicates Zimbabwes widely held view of the organisation.\n\nThe Republican administration, which took office on January 20, has since moved swiftly to close USAIDs Washington DC offices and operations, arguing that it has been used to fuel coups, protests, fund opposition parties and political activists, in what observers have noted as a Damascene moment for the Trump administration.\n\nUS billionaire Mr Elon Musk, who was appointed by President Trump to lead the Department of Government Efficiency (DOGE), branded USAID a criminal organisation after security officials reportedly denied members of his cost-cutting task force access to crucial files.\n\nHe said USAID should die amid reports that two top security officials at the aid agency were put on leave for refusing his representatives access to classified materials.\n\nIn a January 20 executive order announcing a 90-day pause in most of US foreign aid, President Trump said the US foreign aid industry and bureaucracy are not aligned with American interests and in many cases antithetical to American values.\n\nThey serve to destabilise world peace by promoting ideas in foreign countries that are directly inverse to harmonious and stable relations internal to and among countries, it said.\n\nUS Secretary of State Marco Rubio said he is now the acting director of the US Agency for International Development, following the Trump administrations sudden pause on federal foreign spending and layoffs at the 63-year-old agency.\n\nThe observations by the US administration dovetails with a widely held view by the Zimbabwean Government that USAID has since the turn of the millennium been used as an agent of regime change in Harare through creation of shadowy civil society organisations.\n\nThere have been several civic society organisations that occasionally surface as the country approaches national elections or ahead of an international conference such as the United Nations General Assembly to discredit the Government under the guise of human rights watch.\n\nThe Government has over the years consistently raised red flags over USAID activities as the international agency claims that it has provided more than US$3 billion in aid to Zimbabwe since independence in support of democratic institutions and actors in order to have free and fair elections.\n\nIn 2018, the United States admitted that the quasi-political civil society organisations it had been funding to push democratic activities in Zimbabwe squandered funds meant for the project.\n\nThe US said it had since suspended funding them and reported the matter to USAID Office of the Inspector General (OIG).\n\nThe OIG is an arm responsible for investigating the abuse of USAID programmes.\n\nOrganisations which were fingered by the US then for alleged abuse of funds include the Zimbabwe Human Rights Association (ZimRights), Election Resource Centre (ERC) and Counselling Services Unit (CSU) and all three deal with political and governance issues.\n\nThis was revealed by the then US Embassy acting public relations officer Mr John Taylor who admitted that there was misuse of funds.\n\nIt has also emerged that nefarious activities by USAID were well documented across the globe.\n\nThere are reports that USAID built a fake Cuban Twitter platform called ZunZuneo, designed to lure young users and slowly feed them anti-government content to spark protests and was funded in secret through shell companies.\n\nThe plan collapsed when exposed in 2014.\n\nUSAID was accused of funding regime change in Venezuela after it poured millions into opposition groups trying to overthrow the leaders of that country, President Hugo Chvez and Nicols Maduro.\n\nIt trained activists, bankrolled anti-government media, and was linked to the failed 2002 coup against President Chvez.\n\nIn 2014, USAID and the National Endowment for Democracy poured money into opposition groups and media in Ukraine.\n\nOther countries where it was accused of meddling in political affairs include Bolivia, Haiti and Afghanistan.\n\nFounded in 1961, the agency manages billions of dollars in federal humanitarian assistance around the world.\n\nBut its work was thrown into upheaval in the last week, as the Trump administration halted nearly all its programmes and took down its website.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/President-Trump-680x380.jpg",
            "description": "Zvamaida Murwira and Joseph Madzimure United States President Donald Trump’s administration has conceded that the US Agency for International Development (USAID) has been used as a conduit for regime change activities in several countries around the world, a development that vindicates Zimbabwe’s widely held view of the organisation. The Republican administration, which took office on […]",
            "time": "09:46",
            "date": "05 Feb 2025"
        },
        {
            "title": "First Lady unveils first-of-its-kind cultural quiz programme. . . Thousands of learners, teachers, parents attend launch",
            "url": "https://www.herald.co.zw/first-lady-unveils-first-of-its-kind-cultural-quiz-programme-thousands-of-learners-teachers-parents-attend-launch/",
            "content": "Tendai Rupapa\n\nSenior Reporter\n\nTRAILBLAZING First Lady Dr Auxillia Mnangagwa, who is also the Patron of Culture and Heritage in the Ministry of Primary and Secondary Education, yesterday launched a first-of-its-kind and educative Zviperengo Cultural Quiz Programme for learners, providing a platform where local languages will be showcased on a national level thereby, protecting and preserving the countrys culture and heritage.\n\nThey were asked questions from proverbs to idioms, spellings, figures of speech, and riddles as well as translating English words to Shona.\n\nThe children will also compete in a culinary showcase where they will prepare foods unique to their ethnicities.\n\nThe historic launch of the programme, held at the Heritage Village in Harare, targeting Grades 5 to 7, which will be taken to all the countrys 10 provinces, comes at a time when most people had abandoned their mother languages and viewed them as inferior due to the effects of Westernisation.\n\nSome parents and guardians mistakenly thought that having children speaking mostly in English was a sign of affluence, yet doing so alienated children from their heritage, cultural norms and values.\n\nPart of the schoolchildren who attended the launch of Zviperengo cultural quiz programme by First Lady Dr Auxillia Mnangagwa follow proceedings in Harare yesterday\n\nThe educative and well-subscribed programme included learners from affluent to high-density suburbs as the First Lady is not leaving anyone and any place behind.\n\nIt emerged at the launch of the programme that some parents and children did not know various traditional instruments, utensils, and figures of speech, reinforcing the importance of the First Ladys programme.\n\nAmai Mnangagwa, who has children at heart, has been on a nationwide campaign where she has been instilling good values and morals in todays youth.\n\nIn her address, Dr Mnangagwa said Zimbabwe was home to many languages, each carrying its own unique history, stories and wisdom.\n\nThe languages, she said, included Shona, Nambiya, Ndebele, Tonga, Venda, Shangani, and Xhosa just to mention but a few.\n\nThese languages are the lifeblood of our culture. They are the threads that weave together, the fabric of our identity. I am pleased to announce that these competitions will be held in the depths prevalent in the regions of Zimbabwe depending on when the programme would be hosted. As I said, we shall go to all the 10 provinces and Harare you have been the first.\n\nOur children are also going to compete in a culinary showcase where they will prepare foods unique to their ethnicities. We shall cook and to those who have never cooked at home, you will prepare meals. This is a first-of-its-kind programme where our local languages are going to be showcased and examined on a national level. It is our duty as cultural custodians to ensure that these languages and the rich heritage they represent are not lost to time. We must pass them down to our children so that they may carry them forward with pride and honour, she said.\n\nProgrammes like Zviperengo, said Dr Mnangagwa, could help ignite a passion for learning and preserving the countrys cultural heritage in learners hearts.\n\nIn Zimbabwe we believe in the spirit of ubuntu. I am because we are this philosophy teaches us that our humanity is interconnected and that we thrive as a community when we support and uplift one another. The Zviperengo cultural quiz Programme embodies the spirit of ubuntu. It brings us together, fostering a sense of unity and belonging and reminding us that we are all part of a greater whole. As you participate in this programme, I encourage you to embrace the opportunity to learn about your heritage, celebrate the diversity of our nation, and take pride in your identity. Remember that you are the future of Zimbabwe and it is through your efforts that our culture will continue to flourish, she said.\n\nSchoolchildren follow proceedings during an interactive Zviperengo cultural quiz programme launched by First Lady Dr Auxillia Mnangagwa in Harare yesterday\n\nThe First Lady enjoined people to work together to preserve languages, honour traditions, and build a brighter future for the country.\n\nThank you and may the spirit of ubuntu guide us all. I thank my children that today you have come to a new teacher. You have come with your teachers, but today I am your teacher. I love you, my children, you are the pride of our nation, you are the pride of our dignity, you are the pride whom we shall bequeath to the knowledge that we have. You are the pride that will carry our nation forward. Therefore, never look down upon yourselves.\n\nYou are important to my child. There is a lot that we expect from you. Through learning and being taught and through your character, the way you behave, not being involved in drugs, listening to parents, knowing who you are. You are a boy and what do you want to do? you are a girl and what would you want to be? You were not born to be a girl for the boys, you boys were not born to be a boy for the girls, she said.\n\nDr Mnangagwa said she sought to come up with a model boy and girl who would be the envy of the nation and the world at large.\n\nToday we want to mould you so that wherever you go, you will not forget this day. Wherever you go, we shall not be present as your parents and teachers so preserve the teachings you shall receive today. These are the teachings that will look after you even when you go to school outside the country. Going to learn abroad is a result of excelling, you do not just go. Firstly, you must study hard. If you are lucky to go abroad, you must know that you come from Zimbabwe and you must behave as a Zimbabwean. Nowadays my children, westernisation is there, all of us, I think you heard me speaking here, English is for seeking jobs wherever you would have gone. We are, however, leaving our language and latching on to English. But English did not tell us how we live. Even at home we had taken it too far, she said.\n\nThe mother of the nation said it was critical to support children in their quest to deepen their understanding of mother languages.\n\nParents and teachers here present, we hear at some schools you do not encourage the use of the mother tongue. Even if you go to a school headed by those who are good in English, you must learn and pass while at the same time you will be speaking your mother tongue like Shona and Ndebele. With all the dialects that we have in our nation. We want you to preserve our languages, she said.\n\nDr Mnangagwa gave a brief on how she started the programme.\n\nPatron of culture and heritage First Lady Dr Auxillia Mnangagwa shows and teaches schoolchildren about the various traditional utensils and their use such as winnowing basket, mortar and pestle among others in Harare yesterday.  Pictures: John Manzongo\n\nIn my Gota/Nhanga/ Ixhiba programmes I am meeting children showing that indeed they do not understand our culture like what you are supposed to do when you meet an elderly person. In my travels, I am noticing that you view the use of English as the uppermost thing and you then use English at the expense of your mother tongue. As an example, if a child goes to the village where the grandmother resides, the child will be using English yet the grandmother wont be understanding the language. If the children get into the kitchen hut, they will be sobbing because of smoke showing that you are a child who does not frequently visit the village. This has prompted me to bring you all together and hold competitions in Shona with a view to bringing back the use of our mother tongue and encouraging the use of all languages. Despite this, we have started with Shona because this is the most spoken language here in Harare province. This dovetails with the aim of the Ministry of Primary and Secondary Education to mould children in line with the fortress of wisdom they refer to as the Heritage-based curriculum. The Ministry of Education aims that when children get into school, they must know where they came from, and understand the environment so that it sustains them as they make things from it. Do you know that our nation has a lot of wealth in the form of trees, rivers, animals, and minerals which you can use to make things that sustain you? Therefore, the Ministry of Education expects you to learn skills that will help you. This programme must mould you into a dignified person. These competitions are in three phases. The first phase is spellings where you are expected to spell words and be able to use them in sentences. The second phase encompasses zvirunga mutauro. You will be expected to share proverbs that are similar or different and explain their meanings. The last phase is nyaudzosingwi where you must explain these nyaudzosingwi and use them to complete sentences and use them in words. We shall also have idioms and similarities.\n\nThe First Lady asked what one says when they reach someones homestead and one of the learners said: Tisvikewo.\n\nAnother girl said Gogogoi.\n\nA boy left the crowd in stitches when he said: Unoti pachipamwe.\n\nAmai corrected him.\n\nWhat does pachipamwe mean, the First Lady asked and a Grade 5 girl said it means maswera sei?\n\nA Grade 6 boy said pachipamwe is used to someone you would have seen before, prompting the First Lady to clap hands for him.\n\nShe sought to know what a room for girls is called and the children all shouted Nhanga.\n\nWhat about the one for boys? she asked and they all shouted Gota.\n\nDr Mnangagwa sought to know the place where ash is discarded.\n\nA learner correctly said Durunhuru which was correct.\n\nWhat about mukadzi akafirwa nemurume? and the answer was shirikadzi.\n\nOn traditional utensils, Dr Mnangagwa asked about the three utensils used for cooking sadza and the learners said musika, mugoti, and poto.\n\nThe First Lady said the answer was partly correct but the word poto from pot was not Shona and the correct utensil was tsambakodzi.\n\nThe mother of the nation asked the learners to name tools that\n\nTo Page 4\n\nFirst Lady unveils first-of-its-kind cultural quiz programme\n\nFrom Page 2\n\nare used in cutting firewood and they all said an axe.\n\nBut my children, as Environment ambassador I do not want to see an axe close to trees, why is this so? the children said because such acts destroy the forests, depriving citizens of fruits and oxygen.\n\nShe also sought to know how nhopi is prepared.\n\nA Grade 5 learner said with potatoes, while another pointed at butternuts and another contributor pointed at pumpkins.\n\nA young girl left people in stitches when she said matemba were the young ones of fish.\n\nShe was, however, corrected by a fellow learner who said the young one of a fish was known as rereza in Shona.\n\nThe young one of a chameleon is called Mandishaya, they learnt.\n\nDr Mnangagwa expressed gratitude for the childrens competency.\n\nMy children you are doing well, but how do you then fail to apply this in your tests? What is the young one of a mouse, she asked.\n\nIn response, the children said Chiduwa.\n\nA learner said it was called a baby rat but the First Lady weighed in saying the young one of a mouse is called Manditeya.\n\nShe also sought to know the young one of a zebra and the girl correctly said Njenjeta, though she failed to spell it.\n\nAmai went on to ask spellings like nzvenzvana and hozhwa.\n\nThe First Lady asked the children more questions like Akubaira zani anenge akuita sei . . . akuyambira. Kufira mafufu segonzo kuita sei?\n\nThe learners said it means walking aimlessly, dying for useless things while the other said committing time to no avail.\n\nDr Mnangagwa also asked what the phrase Kumirira nemeso matsvuku means and the children said it means anger, but she said it means waiting in great anticipation.\n\nDr Mnangagwa had traditional foods and fruits and asked the children what these were and how they were prepared and or eaten.\n\nThere was food such as madora, dried vegetables, sorghum meal, traditional rice, round nuts, groundnuts, matemba, and multi-grain meal.\n\nShe also showcased a grinding stone, basket, winnowing basket, and different types of clay pots, wooden plates, drinking gourds, and reed mats.\n\nA young girl drew laughter when the First Lady showed a dengu and asked why it was and one girl said it was a basket.\n\nWhen an edge tool used in carpentry, mbezo, was lifted, some learners mistakenly referred to it as a hoe, while others said it was an axe.\n\nAmai corrected them.\n\nShe also brought traditional musical instruments like rattles, mbira and marimba.\n\nThe First Lady turned to parents and asked them cultural quiz whereupon some failed showing that even some parents lack knowledge of traditional goods.\n\nBack to students, the First Lady asked where a dog lived and some said in the danga while someone said in the house. These answers were, however, wrong.\n\nA teacher corrected the learners and said inogara mugudzururu.\n\nAnother teacher said a kennel in Shona is called Usamo.\n\nAmai then opened the floor for students to ask each other questions.\n\nThey asked from proverbs to idioms, figures of speech, and riddles as well as translating English words to Shona.\n\nDeputy Minister of Primary and Secondary Education Hon Angeline Gata thanked the First Lady for sharpening the childrens brains.\n\nThe programme that you unveiled today showed a gap that exists. You have opened the childrens brains. It also requires the effort of parents back home to strengthen what children have learnt here. You have moulded our children today Amai. This programme encourages children to have good manners and they shall excel in their studies because you have given them a deep lesson. Your vision carries the nation forward. This programme promotes our heritage like who we are. As the Ministry of Primary and Secondary Education, we thank you Amai, she said.\n\nTourism and Hospitality Industry Minister Barbara Rwodzi praised the First Lady for her educative and quality programmes.\n\nThe First Lady is the one who unveiled the Gota/Nhanga/Ixhiba Programme so that we return to our culture. Even some of us grown people were lost, but the First Lady taught us how to dress, and the food which nourishes us. boys and girls you are being taught so that you may be dignified people in the future. Amai is also the Tourism patron and for gastronomy tourism to be talked about in Africa, its all because of her. She is now the champion of gastronomy tourism in Africa. We want to thank Amai for launching this new programme and including competitions in culinary as part of the programme, she said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/wf3f-680x380.jpg",
            "description": "Tendai Rupapa Senior Reporter TRAILBLAZING First Lady Dr Auxillia Mnangagwa, who is also the Patron of Culture and Heritage in the Ministry of Primary and Secondary Education, yesterday launched a first-of-its-kind and educative Zviperengo Cultural Quiz Programme for learners, providing a platform where local languages will be showcased on a national level thereby, protecting and […]",
            "time": "09:46",
            "date": "05 Feb 2025"
        },
        {
            "title": "Local authorities responsible for road rehab",
            "url": "https://www.herald.co.zw/local-authorities-responsible-for-road-rehab/",
            "content": "Freeman Razemba\n\nSenior Reporter\n\nWHILE most roads fall under the Ministry of Transport and Infrastructural Development, local authorities, such as Harare, are responsible for rehabilitating their own roads, a Cabinet Minister has said.\n\nAfter councils failed to rehabilitate roads, Government last year announced plans to rehabilitate and construct roads in major cities and towns that have been neglected by opposition-run local authorities for the past two decades.\n\nDespite receiving funds from the Zimbabwe National Road Authority (ZINARA) and revenue from ratepayers, many local authorities have failed to deliver essential services, prompting Government to step in.\n\nAt least 40 major roads in and around Harare have been identified for rehabilitation, overseen by the Ministry of Transport and Infrastructural Development.\n\nIn an interview, the Minister of Transport and Infrastructural Development, Felix Mhona said city authorities are responsible not only for road rehabilitation, but also for ensuring proper street lighting and functional traffic signals at intersections.\n\nThe Ministry of Transport has the Department of Roads, and its one of the road authorities, along with RIDA (Rural Infrastructure Development Agency) and local authorities, he said. All city roads fall under the purview of local authorities.\n\nMinister Mhona acknowledged the neglect by local authorities in fulfilling their mandates.\n\nHe said the ministrys role is to ensure all communities receive the necessary infrastructure improvements, echoing President Mnangagwas vision for comprehensive road maintenance.\n\nWe are coming to actually plug that hole, to make sure that there is no one and no place that is left behind, Minister Mhona said.\n\nHe has tasked provincial road administrators to identify roads serviced by public transport to ensure they remain trafficable.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/10/FELIX-MHONA.jpg",
            "description": "Freeman Razemba Senior Reporter WHILE most roads fall under the Ministry of Transport and Infrastructural Development, local authorities, such as Harare, are responsible for rehabilitating their own roads, a Cabinet Minister has said. After councils failed to rehabilitate roads, Government last year announced plans to rehabilitate and construct roads in major cities and towns that […]",
            "time": "09:46",
            "date": "05 Feb 2025"
        },
        {
            "title": "History made as JZM base gets first female commander",
            "url": "https://www.herald.co.zw/history-made-as-jzm-base-gets-first-female-commander/",
            "content": "Conrad Mupesa\n\nMashonaland West Bureau\n\nAIR Commodore Ellen Chiweshe was yesterday appointed the first-ever female commander for Jason Ziyapapa Moyo Air Force Base near Chegutu.\n\nThe historic take over of the reins by Air Commodore Chiweshe signifies President Mnangagwas commitment to empowering women and placing them in influential positions.\n\nShe became the second commander of an Air Force of Zimbabwe air base since Independence after the then Group Captain Mildred Dengura was appointed to head Manyame Air Force Base from 2015 to 2016, and was later promoted to Air Commodore upon retirement.\n\nAir Commodore Chiweshe takes over from Air Commodore Nicholas Nyathi, who was the 12th Commander of the base.\n\nChief witnessing officer, Commander Air Force of Zimbabwe Air Marshal John Jacob Nzvede, who officiated at the handover-takeover ceremony at the base located a few kilometres south of Chegutu town, said the move was aimed at propelling women officers to influential positions and dovetails with Governments policies of incorporating and recognising women.\n\nThis momentous occasion, that we celebrate today, is not by any means accidental. Instead, it is a result of the Air Force of Zimbabwes support for gender-mainstreaming consistency with Government of Zimbabwe policies.\n\nThe process began with implementing equal opportunities policies at recruitment and in the workplaces. The results have been evident in Air Force of Zimbabwe promotion and appointments as we have witnessed today where women such as Air Commodore Chiweshe have risen to decision-making positions, he said.\n\nThe Air Marshal rallied the entire community at Jason Ziyapapa Moyo Air Force Base to help the incoming base commander.\n\nMilitary tasks by their very nature can only be effectively achieved through teamwork. There is a commander at every control level in the military and attainment of the tasks assigned to the base requires that we all play our part to support the base commander.\n\nAir Marshal Nzvede also took time to warn officers against alcohol abuse and irresponsible gambling, two vices that have the potential to compromise security and discipline.\n\nOutgoing Commander Air Commodore Nyathi thanked the air base community for the harmony and experience acquired during his two-year tenure, applauding his wife for standing by him.\n\nAir Commodore Chiweshe applauded Air Marshal Nzvede for the recognition, adding that the decision raises hope for fellow female officers.\n\nI will work to the best of my abilities to ensure that the recognition is not put to waste. In taking over the base, I am aware of the calls for teamwork to attain all military tasks, she said.\n\nHer appointment has inspired fellow officers who applauded the Air Force leadership for the elevating a woman to the influential and powerful position.\n\nWarrant Class 1 Officer Memory Chivhinge, the bases veterinary officer, said Air Commodore Chiweshes appointment was an inspiration to women.\n\nWarrant Class 1 Officer Esma Madzima was also equally overjoyed by the appointment.\n\nWe feel honoured by the appointment of Air Commodore Chiweshe as the Commander of this base. This shows that ladies are capable of taking influential positions due to merit rather than gender stereotyping. As women, we are honoured and feel respected, she said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/fqwdfq-680x380.jpg",
            "description": "Conrad Mupesa Mashonaland West Bureau AIR Commodore Ellen Chiweshe was yesterday appointed the first-ever female commander for Jason Ziyapapa Moyo Air Force Base near Chegutu. The historic take over of the reins by Air Commodore Chiweshe signifies President Mnangagwa’s commitment to empowering women and placing them in influential positions. She became the second commander of […]",
            "time": "09:46",
            "date": "05 Feb 2025"
        },
        {
            "title": "Zimplats invests US$850m in capital projects",
            "url": "https://www.herald.co.zw/zimplats-invests-us850m-in-capital-projects/",
            "content": "Oliver Kazunga\n\nSenior Business Reporter\n\nZimbabwes largest platinum producer, Zimplats, has invested US$850 million so far under its US$1,157 billion capital expenditure programme, with some of the projects nearing completion.\n\nZimplats, in its quarterly update for the period ending December 31, 2024, said the projects include the US$386 million Mupani Mine development (replacing the depleted Rukodzi and Ngwarati mines) and a US$544 million expansion and sulfur dioxide (SO2) abatement plant project.\n\nA total of US$32 million has been spent on the Base Metal Refinery refurbishment project, against a total budget of US$190 million.\n\nThe development of Mupani Mine is progressing well and remains on schedule, with full production of 3,6 million tonnes per annum planned for the first half of the financial year 2029.\n\nCumulatively, US$339 million was spent as at December 31, 2024, against a total project budget of US$386 million, said Zimplats.\n\nThe 35-megawatt (MW) solar plant project, commissioned in August last year, was completed on budget at US$37 million and is now operating at its designed generation capacity.\n\nDuring the quarter, Zimplats scaled back exploration activities due to depressed international metal prices, focusing instead on analysing existing data and updating its geological and mineral resource models.\n\nThe company also reported that mined volumes during the quarter ending December 2024 were negatively impacted by limited availability of trackless mobile machinery (TMM) and intermittent power outages.\n\nVolumes declined by 7 percent year-on-year and were 8 percent lower than the previous quarter, the company said.\n\nThe cessation of primary operations at Ngwarati Mine in June 2024 was successfully offset by increased production from pillar reclamation at Rukodzi Mine and output from the newly operational Mupani Mine.\n\nA 1 percent year-on-year improvement in the 6E head grade (six platinum group metals that are typically mined and processed together) was achieved, driven by increased tonnage from higher-grade zones at the Rukodzi and Mupani mines.\n\nMilled volumes decreased by 6 percent year-on-year and were 8 percent lower than the preceding quarter because of lower ore supply and constrained operating capacity at the concentrator plants due to mill reline shutdowns, said Zimplats.\n\nCommissioning of the expanded smelter resulted in improved smelting capacity and an increase in concentrator mass pull.\n\nResultantly, concentrator recoveries improved by 1 percent year-on-year and by 4 percent from the preceding quarter.\n\nIn total, 6E concentrate volumes of 158 803 ounces were 5 percent weaker year-on-year and 4 percent lower than the preceding quarter.\n\nTotal operating cash costs increased by 3 percent year-on-year and quarter-on-quarter, due to higher power costs following the commissioning of the expanded smelter, as well as timing differences on the replacement of major engineering components completed in the period under review.\n\nTransfers to closing stocks from operating costs for the period amounted to US$18,5 million, largely due to the accumulation of concentrate and furnace stocks ahead of commissioning and the optimisation of the increased installed smelting and converting capacity at the metallurgical complex.\n\nConsequently, cash costs of metal produced decreased by 10 percent year-on-year and were 4 percent lower quarter-on-quarter.\n\nOperating cash costs of US$935 per ounce, were 13 percent and 11 percent higher year-on-year and quarter-on-quarter, respectively, due to the impact of lower production volumes in the period.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Zimplats-has-invested-US850-million-in-capital-projects-680x380.jpg",
            "description": "Oliver Kazunga Senior Business Reporter Zimbabwe’s largest platinum producer, Zimplats, has invested US$850 million so far under its US$1,157 billion capital expenditure programme, with some of the projects nearing completion. Zimplats, in its quarterly update for the period ending December 31, 2024, said the projects include the US$386 million Mupani Mine development (replacing the depleted […]",
            "time": "09:46",
            "date": "05 Feb 2025"
        },
        {
            "title": "DRC/Rwanda Luanda peace process unpacked",
            "url": "https://www.herald.co.zw/drc-rwanda-luanda-peace-process-unpacked/",
            "content": "Ranga Mataire\n\nGroup Political Editor\n\nBESIDES agreeing to have a joint SADC/EAC (East African Community) Heads of State and Government Summit on the way forward in bringing peace to the Democratic Republic of Congo (DRC), the recent SADC Extraordinary Summit held in Harare also called for the revival of the Luanda Process.\n\nBut what is the Luanda Process, which SADC reiterated its support in bringing diplomatic efforts to secure a peaceful resolution to the conflict in the Eastern DRC?\n\nThe Luanda Peace Process led to the Luanda Peace Deal on September 6 2002.\n\nAt that time, the deal was between the DRC and Uganda and was mediated by the then President of Angola, Jose Eduardo dos Santos. The peace deal was meant to bring ceasefire and normalisation of relations between Uganda and the DRC governments. It was signed in Luanda between then DRC President Joseph Kabila and Ugandan President Yoweri Museveni.\n\nThe Luanda Peace Deal became the standard or model for peace accords in Africa and is viewed favourably by outside entities, such as the United Nations and the European Union.\n\nBackground\n\nThe Luanda Peace Deal was meant to bring ceasefire and normalise relations between Uganda and DRC. Uganda accused DRC of hosting ADF, a rebel unity that had been attacking western Uganda from the 1990s into 2000s.\n\nDRC on the other had accused Uganda of using the pretext of fighting ADF by plundering its valuable natural resources.\n\nThe genesis of instability in the Congo and broadly in the Great Lakes region, dates back to colonial times when DRC was under the control of Belgium, Rwanda under Germans/Belgium, Uganda under Britain.\n\nThe colonial powers parcelled the territories without regard to existing African social and political settings.\n\nFamilies and whole tribes were separated and when independence came, the new African rulers decided to stick with the colonial boundaries.\n\nIn mapping out the Luanda Peace Deal, President Eduardo dos Santos was conscious of the fact that Uganda and DRC were brotherly countries whose relationship predates colonial conquest.\n\nThus Article 1 of the Agreement on Withdrawal of Ugandan troops specifically states that: The Government of Uganda commit itself to the continued withdrawal of its forces from the DRC in accordance with the Implementation Plan.\n\nThe Luanda Peace deal was hailed by regional and international experts as a ground-breaking deal that attempted to bring peace and security between two contending parties.\n\nFast forward to 2022, almost three decades after the 1994 Rwandan genocide and after what former United States Secretary of State Madeleine Albright described the Congo as being at the heart of Africas first world war, the Great Lakes region seem to have come full circle with the same neighbourly protagonists- Rwanda, Uganda and the DRC once again entangled in an attrition conflict.\n\nOnce again, SADC the regional bloc had to intervene in line with its Defence Mutual Pact which outlines a commitment to collective self-defence and regional peace and security.\n\nIt states that any armed attack against one member is considered a threat to regional peace.\n\nThis is the rationale behind the deployment of SADCs Mission in DRC (SAMIDRC), which was deployed on December 15, 2023.\n\nThe decision to deploy the force was made in May 2023 at the Extraordinary Summit of Heads of State and Government in Windhoek, Namibia.\n\nRevival of the Luanda Road Map\n\nThe Luanda Peace Process was established as part of the 2022 Luanda Roadmap aimed at calming tensions between Rwanda and the DRC.\n\nOn November 23, 2022, a mini summit of heads of States and Governments on peace and Security in Eastern DRC was held in Luanda, Angola to address the conflict and insecurity in the eastern region of the DRC.\n\nIt was attended by the EAC chairperson- Burundian President Evariste Ndayishumiye, DRC President Felix Tshisekedi, Rwandan Minister of Foreign Affairs and Affairs of Rwanda, Vincent Biruta who was representing President Paul Kagame and former Kenyan President Uhuru Kenyatta who is the facilitator appointed by the EAC for the implementation of the Nairobi process as well as a representative of the African Union and the International Conference on the Great Lakes Region (ICGLR).\n\nEscalation of fighting from October 2023 between M23 and the Armed Forces of the DRC (FARDC) temporarily stalled the peace process.\n\nThis time the DRC claimed that the Rwanda Defence Force (RDF) was fighting alongside the M23 rebels while Rwanda accused the DRC of harbouring and supporting the Democratic Forces for the Liberation of Rwanda (FDLR)- A Hutu rebel movement whose composition include former Rwandan Army forces who fled to eastern Congo following the genocide.\n\nThe peace process was revived in early 2024 under the Angolan President Joao Lourencos mediation, and on July 30 2024, a permanent ceasefire was agreed between the two countries.\n\nThe Rubavu Agreement\n\nThe ceasefire was followed by meetings between the Rwandan and DRC foreign ministers that looked at the core triggers of the recurrent conflict.\n\nAnother productive meeting between the two countries intelligence service heads was held in Rubavu, Rwanda, on August 29 and 30, 2024 whose agreement revolved around: neutralising the FDLR, withdrawal of Rwanda forces from the DRC territory, and possibly involving Rwandas forces in the military operation against the FDLR.\n\nAn ad hoc mechanism composed of three Rwandan, three Congolese and 18 Angolan military officers led by Angolan Lieutenant-General Joao Nassone was set up.\n\nDisagreements remain on how to implement the Rubavu agreement, as the DRC insists that the nuetralisation of the FDLR accompanies the withdrawal of Rwandan Forces.\n\nDespite the recent escalation of violence instigated by M23, both the EAC and the SADC still believe the Luanda Peace Deal is the best foot forward in bringing lasting peace to the DRC. Angolan President Lourenco is highly regarded by both Rwanda and DRC.\n\nIt is not surprising that the EAC chose him to mediate given the fact that he is the African Union Champion of Peace and Reconciliation in Africa and is designated to maintain dialogue between the DRC and Rwanda.\n\nBoth SADC and EAC are keen on reviving the Luanda Peace Process, which in November last year managed to facilitate the signing of a peace deal between DRC and Rwanda.\n\nThe Angola-brokered peace deal brought fragile truce that stabilised the situation until the recent incursions of the M23 which took over Goma in a development that has led to deaths of both civilians and military personal and displaced thousands of people.\n\nWay forward\n\nThe way forward in bringing lasting peace in the DRC lie in the communiqu released by the recent SADC Extraordinary Summit of Heads of State and Government held in Harare on January 31, 2024.\n\nThe summit reiterated its support to the diplomatic efforts to secure peaceful resolution to the conflict in the eastern DRC through the Luanda Process, led by President Joao Lourenco of Angola and the African Champion for Peace and Reconciliation in Africa and the Nairobi Process, led by former Kenyan President Uhuru Kenyatta.\n\nThe summit also called for the immediate dispatch of Defence Ministers, chiefs of defence and troop contributing countries to DRC to ensure that the SAMIDRC troops are safe and ensure immediate repatriation of the deceased troops and those injured.\n\nMore fundamental was the call to have a joint SADC and EAC summit and the mandate for the SADC Organ Troika on Politics, Defence and Security Cooperation, to engage all state and non-state parties to the conflict on a ceasefire process to protect lives and facilitate a smooth flow of humanitarian support to people and communities affected by the armed conflict.\n\nIt is now left to the secretariats of both SADC and EAC to work out the logistics in terms of dates and venue for the joint summit of the two regional blocs.\n\nGiven the urgency of the matter, it will not be long before such a meeting is convened.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/regr-680x380.jpg",
            "description": "Ranga Mataire Group Political Editor BESIDES agreeing to have a joint SADC/EAC (East African Community) Heads of State and Government Summit on the way forward in bringing peace to the Democratic Republic of Congo (DRC), the recent SADC Extraordinary Summit held in Harare also called for the revival of the Luanda Process. But what is […]",
            "time": "09:46",
            "date": "05 Feb 2025"
        },
        {
            "title": "ED Law School opens in August",
            "url": "https://www.herald.co.zw/ed-law-school-opens-in-august/",
            "content": "Patrick Chitumba\n\nMidlands Bureau\n\nTHE Midlands State University (MSU)s Emmerson Dambudzo Mnangagwa Law School in Kwekwe is expected to be open for business in August this year with construction progressing well.\n\nWith all necessary materials on site and over 300 workers engaged, MSU is confident of meeting the deadline and completing the project successfully.\n\nEngineers from Masvingo Polytechnic College are also on site to work on roofing the sections that have reached roofing level.\n\nThe MSU Law School will also house other Faculties, including Agriculture and Architecture and is expected to recruit more than 1 000 students upon completion.\n\nThe law school, a brainchild of President Mnangagwas visionary leadership, is poised to become a beacon of academic excellence, attracting brilliant legal minds from across the nation and beyond.\n\nThe project will not only bolster Zimbabwes legal landscape, but also serve as a shining tribute to the Presidents unwavering dedication to education and national development.\n\nThe state-of-the-art Law School is expected to be one of the finest schools in Africa.\n\nPro Vice Chancellor for Infrastructure and Campus Development at MSU Dr Gift Manyatera said they were grateful to Kwekwe City Council for donating the piece of land for the sole purpose of the construction of the law school.\n\nBesides the Faculty of Law, he said the campus will also house Faculties of Agriculture and Natural Resources as well as that of the Built Environment.\n\nThe self-contained double story campus will have lecture rooms, moot courts, library, hostels, kitchen, hospital and staff quarters, among other key infrastructure.\n\nIt is being constructed on a 220ha farm we got from Kwekwe City Council so that we set up the campus, which is a Faculty of Law, said Dr Manyatera.\n\nConstruction works commenced in 2023.\n\nIt will be one of the leading law schools in Africa. Remember the MSU Law School has been number one in Africa. The school is also being constructed in recognition of the contribution of President Mnangagwa in the development of the legal system in the country, he said.\n\nDr Manyatera said the modern infrastructure will have everything one could expect in a law school. MSU already has campuses in Gweru, Zvishavane, and Harare with the Faculty of Law set for Kwekwe.\n\nWe expect to move staff and students by August. This was a forest but its being developed. Structures have emerged from a former forest and we are at 65 percent completion of the main building, which has four expansions or sections, he said.\n\nExpansion 1 is ready for roofing. Actually, we have Masvingo Polytechnic engineers working on roofing the first expansion. Then Treasury has also been releasing funds and we are happy with the trajectory that is being taken, he said.\n\nDr Manyatera said there were 300 workers on site who are working tirelessly to make sure the project meets the deadline for opening.\n\nWe want to move the Masters programme here. We will also offer short courses in the next two to three years, he said.\n\nKwekwe City Council mayor Councillor Albert Zinhanga said when the law school becomes operational, the local authority is going to benefit in terms of increased revenue from rates, water and sewer charges.\n\nHe said the campus will also attract other businesses much to the benefit of the local authority.\n\nAs Kwekwe we are very happy that this development will boost our GDP, said Clr Zinhanga.\n\nThe university has adopted a multi-campus philosophy that has seen it being in Gweru, Zvishavane, Harare and Bulawayo hence operationalising Heritage-based Education 5.0 model.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2018/06/MSU.jpg",
            "description": "Patrick Chitumba Midlands Bureau THE Midlands State University (MSU)’s Emmerson Dambudzo Mnangagwa Law School in Kwekwe is expected to be open for business in August this year with construction progressing well. With all necessary materials on site and over 300 workers engaged, MSU is confident of meeting the deadline and completing the project successfully. Engineers […]",
            "time": "09:46",
            "date": "05 Feb 2025"
        },
        {
            "title": "AMA spearheads growth of climate smart agriculture",
            "url": "https://www.herald.co.zw/ama-spearheads-growth-of-climate-smart-agriculture/",
            "content": "Agriculture Specialist Writer\n\nAS efforts to climate-proof agriculture intensify, the Agricultural Marketing Authority (AMA) is championing the expansion of strategic crop contracting for the current summer season with 22 registered so far, up from last years 19.\n\nThe efforts by AMA come on the backdrop of heightened prospects of a good agricultural season anchored on the predictions of a La Nina-characterised term.\n\nAMA chief executive officer, Mr Clever Isaya said his organisation had been instrumental in fostering strong collaborations between farmers and contractors, ensuring smooth implementation of structured production programmes.\n\nThis expansion in contracting shows the confidence contractors have in Zimbabwes agricultural sector and it is a testament to our efforts in facilitating partnerships that drive productivity and profitability for our farmers, said the AMA boss.\n\nHe said a key highlight of this years contracting programme was the significant expansion of sorghum production, reflecting the Governments commitment to promoting traditional grain production.\n\nA total of 31 376 hectares of sorghum have been contracted for this season, nearly tripling last years 11 846.\n\nThis remarkable increase underscores the success of national policies aimed at strengthening food security in the face of climate change he added.\n\nThe Government selected cotton alongside sunflower as the key policy crops, which can be engines for transformation of rural communities.\n\nTo advance this Government position, Mr Isaya said sunflower production had also recorded a notable surge, with 17 892 hectares contracted this year compared to 15 075 hectares in the previous season.\n\nThe growing interest in oilseed crops aligns with Government efforts to reduce Zimbabwes reliance on imported edible oils while providing farmers with viable income-generating opportunities, he added.\n\nBy coordinating key players in the agricultural value chain, the authority has helped secure input support, technical assistance and guaranteed markets for farmers participating in the programme.\n\nThe 16 percent increase in contracting figures signal a positive outlook for Zimbabwes agriculture sector, with expectations of improved yields and enhanced livelihoods for farmers.\n\nWith AMA continuing to strengthen market linkages and mobilise more contractors, the sector is poised for sustained growth, benefiting both producers and the broader economy, he added.\n\nMr Isaya said AMA remained committed to facilitating partnerships that empower farmers and contribute to national development goals.\n\nWith results of the recently conducted crop and livestock assessment still to be shared, all eyes are now on the performance of these strategic crops, as Zimbabwe moves towards a more resilient and market-driven agricultural landscape.\n\nSpeaking at the second edition of the World Cotton Day celebrations in 2023, Lands, Agriculture, Fisheries, Water and Rural Development Minister, Dr Anxious Masuka said Government had earmarked cotton and sunflower as key policy crops with the power to transform rural communities for agricultural growth leading to rural industrialisation and development for attainment of Vision 2030 objective.\n\nThe President has selected cotton alongside sunflower as the key policy crops. Cotton and sunflower are smallholder crops and can be engines for transformation of communities. Government is currently a facilitator and actor in the cotton value chain, but when the sector is fully established it ceases the actor role and focusses on facilitation, he said then.\n\nThe Government is spearheading the adoption of resilient and economically viable crops through targeted policies and incentives, with farmers in agro-ecological regions 4 and 5 mandated to produce traditional grains, oil seeds and livestock feed.\n\nThese initiatives are crucial in mitigating the effects of erratic weather patterns while ensuring national food, nutrition and oilseed security for the country.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/04/Agricultural-Marketing-Authority.jpg",
            "description": "  Agriculture Specialist Writer AS efforts to climate-proof agriculture intensify, the Agricultural Marketing Authority (AMA) is championing the expansion of strategic crop contracting for the current summer season with 22 registered so far, up from last year’s 19. The efforts by AMA come on the backdrop of heightened prospects of a good agricultural season anchored […]",
            "time": "09:46",
            "date": "05 Feb 2025"
        }
    ]
}