{
    "news": [
        {
            "title": "President rallies Africa on health . . . Calls for local resources to fight disease outbreaks",
            "url": "https://www.herald.co.zw/president-rallies-africa-on-health/",
            "content": "Garikai Fadzi in ADDIS ABABA, Ethiopia\n\nTHE African continent should direct more local resources towards fighting outbreaks of diseases such as cholera, mpox and marburg, President Mnangagwa has said.\n\nAddressing the High-Level Meeting on Domestic Health Financing here yesterday, the President highlighted that on its part, Zimbabwe was working on ensuring at least 13 percent of its annual Budget is directed towards the health sector in line with the Abuja Declaration.\n\nThe High-Level Meeting on Domestic Health Financing encourages domestic investment in the sector appropriately so that each country can pursue its path to achieving and sustaining universal health coverage.\n\nI am pleased my Governments allocation towards health has increased significantly, from 9,8 percent of the national budget in 2024 to 13,01 percent in 2025, as we move towards the 15 percent Abuja target, he said.\n\nThe President unpacked some of the innovative ways Zimbabwe has adopted in raising revenue for the health sector.\n\nHe said Zimbabwe has successfully introduced innovation tax regimes towards the health sector, including the Health Levy, which is a mobile airtime tax, and the sugar tax for beverages, to combat the increasing burden of non-communicable diseases.\n\nMost recently, we have introduced a fast-food tax to further support our health initiatives and act as a negative incentive for the consumption of fast foods, said President Mnangagwa.\n\nRwanda President Paul Kagame is the African Union Domestic Health Financing champion.\n\nThe meeting came at a time when most African countries say their health sectors are at risk of challenges following anExecutive Order signed by United States President Donald Trump, withdrawing from the World Health Organisation (WHO) and immediately stopping foreign assistance for 90 days.\n\nHealth budgets on the continent were cushioned by aid, especially from US agencies, and its suspension is expected to bring challenges to many countries, hence the call for nations to focus on domestic resource mobilisation.\n\nOn its part, Zimbabwe has indicated that it will use taxes on alcohol, cigarettes, fast food, and sugary beverages, commonly known as sin taxes, to cover health sector needs.\n\nHealth and Child Care Deputy Minister, Sleiman Kwidini, recently told legislators in Parliament that the situation of health funding following the suspension of donations from the US was undercontrol.\n\nEarlier in the day, President Mnangagwas hectic schedule had seen him receiving Sheik Shakhboot Al Nahyan, Minister of State of the United Arab Emirates.\n\nPresident Mnangagwa meetsSheik Shakhboot Al Nahyan of the United Arab Emirates, Minister of State in the United Arab Emirates and a member of the Royal family in Addis Ababa, Ethiopia yesterday.\n\nThe Emirati visited President Mnangagwa at his hotel.\n\nUAE is presently Zimbabwes second largest trading partner behind South Africa.\n\nSpeaking after the meeting, Foreign Affairs and International Trade Minister, Professor Amon Murwira, described relations between Zimbabwe and the UAE as solid, ever since the two countries opened embassies in each others capitals in 2018 and 2019.\n\nOur number one trading partner is South Africa and now our number two trading partner is UAE, he said.\n\nZimbabwe exports precious minerals and agricultural products while importing manufactured goods and essential commodities from the UAE.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/13er31r-680x380.jpg",
            "description": "Garikai Fadzi in ADDIS ABABA, Ethiopia THE African continent should direct more local resources towards fighting outbreaks of diseases such as cholera, mpox and marburg, President Mnangagwa has said. Addressing the High-Level Meeting on Domestic Health Financing here yesterday, the President highlighted that on its part, Zimbabwe was working on ensuring at least 13 percent […]",
            "time": "06:08",
            "date": "15 Feb 2025"
        },
        {
            "title": "Huge send off for B/bridge horror crash victims",
            "url": "https://www.herald.co.zw/huge-send-off-for-b-bridge-horror-crash-victims/",
            "content": "Thupeyo Muleya-Beitbridge Bureau\n\nThree Government ministers yesterday joined mourners at a mass send-off for the 25 people who tragically died in a head-on collision involving a bus and a haulage truck on the Beitbridge-Masvingo Highway on Thursday.\n\nLocal Government and Public Works Minister Daniel Garwe, Transport and Infrastructural Development Minister Felix Mhona, and Matabeleland South Provincial Affairs and Devolution Minister Dr Evelyn Ndlovu, were in Beitbridge to assess the situation and console the families of victims who perished in the tragedy.\n\nThe ministers also visited the accident site and survivors who are receiving treatment at Beitbridge District Hospital.\n\nA combined memorial service was held at Doves Funeral Services parlour, where scores of relatives and residents gathered.A sombreatmosphere enveloped the parlour as the community mourned the victims.\n\nMinister Garwe, who also oversees civil protection matters, said the Government was deeply saddened by the crash and pledged support for the bereaved families.\n\nWe express our condolences and we will do everything necessary to assist the bereaved families so that they may bury their departed relatives, he said.\n\nWe are here with a message from President Mnangagwa about his deepest sorrow over the loss of lives by fellow Zimbabweans, he said.\n\nIn his condolence message on Thursday, President Mnangagwa declared the accident a national disaster and accorded the 25 passengers State-assisted burials.\n\nMinister Garwe said families had been assisted with coffins, burial documentation, food, and transportation of the deceased from Beitbridge to various burial sites.\n\nHe said it was saddening that most families had lost breadwinners and young people.\n\nThe eldest among the deceased was around 56 years old and many were below 30. This is quite sad for us as a nation, he said.\n\nOn his part, Minister Mhona said he had directed all enforcement departments under his ministry to conduct a full investigation into the accident and take appropriate action.\n\nWe are investigating the circumstances surrounding this tragedy, and necessary measures will be taken to prevent such incidents in the future. We are grieving and we want to thank our great leader President, Cde Dr Emmerson Dambudzo Mnangagwa, who is also grieved and has stated in his statement that as authorities we must take action.\n\nSo, together with other enforcers, we dont take this lightly and we cant continue to tolerate lawlessness on our roads. I have tasked the Road Motor Transportation Department to take charge and make sure that we get to the bottom of this accident and we will not focus on this incident alone.\n\nMinister Mhona added that through various Government agencies, the Ministry of Transport would continue to educate motorists and road users on the importance of adhering to road rules and regulations.\n\nHe also commended the Beitbridge community for their assistance they rendered at the accident scene, ferrying victims to the hospital and offering support to survivors and medical staff at Beitbridge District Hospital.\n\nOn her part, Dr Ndlovu said Matabeleland South was in deep mourning.\n\nShe wished the injured a speedy recovery and assured them that her office would visit those receiving treatment at Gwanda and United Bulawayo Hospitals.\n\nPresident Mnangagwa expressed his condolences and announced that the deceased would receive State-assisted burials.\n\nZimbabwe Passengers Transport Organisation (ZPTO) chairman, Dr Samson Nhanhanga, offered condolences and called on public transport operators to address speeding.\n\nHe also donated US$11 000 to the Government to assist with burials.\n\nSpeed has become our worst enemy. We continue urging our drivers to adhere to good road driving ethics, he said.\n\nThe Insurance Council of Zimbabwe said it would cover medical and funeral expenses for all passengers, while the Traffic Safety Council has provided hampers to those hospitalised.\n\nThe local business community, including the Mayor of Beitbridge, Councillor Peter Pirato Mafuta, donated fuel, ambulances and other consumables.\n\nBeitbridge district medical officerDr Lenos Samhere, said they have 29 patients at the hospital.\n\nWe have 15 in the female ward and 14 in the male ward. Those who were in critical condition were transferred to Gwanda Provincial Hospital and United Bulawayo Hospitals, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Ministers-Mhona-and-Garwe-680x380.jpg",
            "description": "Thupeyo Muleya-Beitbridge Bureau Three Government ministers yesterday joined mourners at a mass send-off for the 25 people who tragically died in a head-on collision involving a bus and a haulage truck on the Beitbridge-Masvingo Highway on Thursday. Local Government and Public Works Minister Daniel Garwe, Transport and Infrastructural Development Minister Felix Mhona, and Matabeleland South […]",
            "time": "06:08",
            "date": "15 Feb 2025"
        },
        {
            "title": "Learners barred from teachers’ quarters",
            "url": "https://www.herald.co.zw/learners-barred-from-teachers-quarters/",
            "content": "Zvamaida Murwira-Senior Reporter\n\nLearners have been barred from visiting teachers quarters for no reasonable cause, while no learner will be barred from attending school over non-payment of fees or levies, lack of a birth certificate, pregnancy and lack quality of results.\n\nThese are part of the several regulations gazetted by Primary and Secondary Education Minister, Dr Torerayi Moyo yesterday, as the Heritage-Based Education curriculum takes root.\n\nMinister Moyo invoked the Education Act through Statutory Instrument 13 of 2025 to give effect to regulations meant to instil discipline both on students and teachers.\n\nThe regulations, to be cited as the Education (General) Regulations, 2025, are meant to stop societal vices such as drug abuse, sexual abuse, and bullying, among others. Section 12 ofthe regulations provides that when a girl child gets pregnant, the school must provide psycho-social support.\n\nWhere a girl who is a pupil at a school becomes pregnant, the school head  (a) shall inform the parents of the girl as soon as possible if they are not already aware of the pregnancy, (b) shall facilitate psycho-social supportive services to the girl and parent, (c) if the girl and her parents so wish, the girl shall be permitted to remain at school for as long as possible before the delivery of her child, and to return thereafter as soon as her health and the health of her child permit it, reads the regulations.\n\nSection 14 of the regulations does not allow students to visit teachers quarters.\n\n14 (1) No pupils must be allowed at the school staff quarters. (2) Every school shall develop guidelines for the pupils to access staff offices and base rooms to ensure safety of the pupils. (3) Subsection (1) shall not apply where the pupil is a child or relative of the teacher or member of staff whose living-quarters he or she enters and resides in, reads the regulations.\n\nSection 18 empowers a school head to suspend a pupil whom he or she reasonably suspects of serious misconduct for up to 14 days to allow investigations.\n\nNo pupil may be suspended from school without first being granted a reasonable opportunity, with the support of his or her parents, to make representations with respect to the proposed suspension, the regulations read.\n\nSection 20 prevents pupils from being excluded from school for non-payment of any form of school fees or levies.\n\nHowever, it imposes an obligation on parents and guardians to pay school fees and levies before schools open for a new term.\n\nThe regulations seek to provide equal opportunity to education and it stipulates that no pupil should be denied an opportunity to learn because of the quality of his or her results.\n\nBasic education is compulsory and, if the parents of the pupil cannot afford the tuition fees and levies at a Government school, the State shall assist, within the limits of the resources available to it, in providing that education.\n\nAdmission of children into Government schools; No school head shall exclude a child of school-going age from enrolment at a Government school solely on the ground that the child does not have a birth certificate. No child of school-going age shall be denied admission into basic education in Government schools based on the quality of results he or she possesses, reads the regulations.\n\nA fine not exceeding level six or imprisonment of up to six months shall apply to those found guilty of violating the above.\n\nThe regulations also empower the school head to expel a pupil if he or she is satisfied, after a fair hearing that the pupil is guilty of serious misconduct and in expelling the pupil, he should notify the parents furnishing them with reasons for his or her decision.\n\nBut the expulsion should be effected after consultation with the District Schools Inspector (DSI) and responsible authority of the school, if it is a non-Government school.\n\nA parent of an expelled pupil has 14 days of appealing in writing to the Permanent Secretary or any other person designated by the Permanent Secretary through the DSI and a decision should be made within a month.\n\nThe learner concerned might be allowed to attend lessons unless school authorities feel on reasonable grounds, that such attendance might lead to indiscipline or injury to any person or damage to property.\n\nThe school head is obliged to notify his superior about his decision to expel a pupil including the Permanent Secretary of Primary and Secondary Education and the reasons for doing so.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/12/torerayi-moyo-512x380.jpg",
            "description": "Zvamaida Murwira-Senior Reporter Learners have been barred from visiting teachers’ quarters for no reasonable cause, while no learner will be barred from attending school over non-payment of fees or levies, lack of a birth certificate, pregnancy and lack quality of results. These are part of the several regulations gazetted by Primary and Secondary Education Minister, […]",
            "time": "06:08",
            "date": "15 Feb 2025"
        },
        {
            "title": "First Lady’s medical outreach works wonders in Masvingo . . . thousands including men, present for health checks",
            "url": "https://www.herald.co.zw/first-ladys-medical-outreach-works-wonders-in-masvingo-thousands-including-men-present-for-health-checks/",
            "content": "Tendai Rupapa in MASVINGO\n\nCASES of people enduring excruciating pain and letting it dissipate on its own or even dying without seeking medical help are common across communities, especially among men.\n\nStudies and testimonies by medical experts indicate that men shun health checks and present for treatment usually when it is late.\n\nSome men use their spouses health as a yardstick for their own and largely conclude that once their wives are certified healthy, they too will be safe.\n\nIt is for this reason that First Lady Dr Auxillia Mnangagwa is taking her fully equipped mobile hospital and mobile clinic for medical outreaches in the provinces to ensure no place and no one is left behind in her mission to save lives and ensure everyone knows their health status.\n\nHer mission has produced great results as evidenced by what she encountered in Masvingo during her medical outreach programme, which was supported by the Ministry of Health and Child Care.\n\nAmai Mnangagwa has been urging people to get checked for ailments, especially men whom she said needed to be screened for prostate cancer.\n\nA case in point is Sekuru Silas Dzirasha from Chivi, who was losing weight spectacularly and often spent his time sleeping, complaining of feeling weak and having a headache.\n\nSo serious had this become that he was now struggling to put food on the table for his family since he had stopped going to work.\n\nAs someone who had just finished constructing a three-bedroomed house, he never sought treatment and firmly believed he had been bewitched by close relatives who did not want to see him succeed.\n\nFortunately, when health ambassador First Lady Dr Auxillia Mnangagwa took her medical outreach to Masvingo this week, he was found to be diabetic and immediately placed on treatment.\n\nSekuru Dzirashas tale is similar to that of Gogo Revai Zizhou.\n\nShe was suffering in silence until health experts at the First Ladys medical outreach discovered she was hypertensive and prescribed the drugs that have seen her regain her strength.\n\nWhen feeling unwell, one has to visit the hospital and not harbour bad thoughts about certain people. Sickness, if not treated, can make you hate others for nothing.\n\nI now always pray to God for forgiveness because I was always blaming people for crimes they didnt commit, said Gogo Zizhou.\n\nA young man who preferred to be identified only as Brighton, said he had received solid counselling through the First Ladys medical outreach and was now looking at life with renewed vigour after quitting drug and substance abuse.\n\nI just do not know how best I can thank the First Lady for her great love for the people of Zimbabwe. I was taking drugs after being introduced to them by bad friends.\n\nI had become an animal and lost respect for my parents and siblings. But after the First Ladys address and the help I got from experts at the outreach, I am now a new creation. I really thank her for her love, he said.\n\nMs Lilian Moyo also had her reasons for thanking the First Lady.\n\nPeople queue for free medical checks and treatment during a medical outreach organised by Angel of Hope Foundation in Masvingo yesterday.\n\nI was struggling with pain in my breasts which resulted in me spending most of my time sleeping and crying. I was told by experts at the First Ladys medical outreach that I could be in the earliest stages of breast cancer and they have recommended further tests while I was given medication to relieve the pain.\n\nI come from a humble family and my parents cannot afford the costs of examinations. The medical outreach came as a blessing in disguise for me and I can only thank the First Lady for her love. She is a well-meaning mother of the nation who deserves everyones prayers. I encourage other people out there to come forward and seek help during this outreach so they can be examined and told what is afflicting them, she said.\n\nMrs Sunungurai Chikozhere (67) from Chivi North saluted the First Lady for rolling out the medical outreach.\n\nWe were gratified by what the First Lady did to assist the people of Masvingo province which shows her deep organisational skills. Yesterday, I was screened for cervical cancer and other non-communicable diseases (NCDs). I am back again today as we are being checked for eyesight free of charge. Amai also gave us food hampers and inputs, she said.\n\nMr Remigio Marandure (69) was happy for the services unlocked by the First Lady.\n\nWe came here yesterday and were screened for prostate cancer. Our mother did well for us and today I am here again to be screened for eyesight challenges, thanks to our mothers benevolence, he said.\n\nIn a speech read on his behalf by Provincial Epidemiology Disease Control Officer (PEDCO) Dr Tapera Saravoye, Masvingo provincial medical director, Dr Amadeous Shamhu, said Masvingo province was excited to be hosting the medical outreach which came to life because of the visionary leadership of the First Lady.\n\nIndeed, we are more than grateful that Amai has seen it fit for the community of Masvingo to benefit from this cancer screening and wellness programme.\n\nThe programme is for everyone as we aim to screen for cervical cancer, breast cancer, and prostate cancer in men. We are also doing eye screening, HIV testing, and hypertension checks. Family planning and outpatient consultations are also being done, he said.\n\nCervical cancer, he said, is a preventable disease, adding that globally, cervical cancer is the fourth leading cause of death among women.\n\nIt is estimated that one woman dies from the disease every two minutes. Sub-Saharan Africa has the highest rates of cervical cancer in the world, making it the leading cancer-related cause of death in the region.\n\nIn 2018, Zimbabwe had an estimated 3 156 new cases of cervical cancer and 2 151 cervical cancer deaths, a very big cause for concern for a disease which is preventable. To eliminate cervical cancer as a public health problem by 2030, it is recommended that 90 percent of all women of reproductive age with precancerous lesions should be treated using an effective method but that only depends upon their early identification through screening.\n\nTo ensure that no one is left behind, VIAC (Visual Inspection with Acetic Acid and Cervicography) screening outreach activities and treatment camps are being conducted thanks to the First Ladys initiatives.\n\nWe are therefore immensely grateful for the synergies we are receiving from our partners, especially the NAC (National Aids Council) for their profound support in that regard, he said.\n\nDr Shamhu said the elimination of cervical cancer as a public health problem by 2030 was a possibility.\n\nBut to achieve this, he said, they want to encourage every eligible woman first to get screened and those found to have VIAC-positive results to be treated.\n\nThe treatment modalities that the Ministry of Health and Child Care is using are effective and are also recommended by the World Health Organisation. As the Ministry of Health and Child Care, and as Masvingo province, in particular, we do not want to leave any woman behind, and we will continue working hard to ensure equitable access to cancer screening and other preventive services. I want to reiterate the old time-honoured saying that prevention is better than cure and therefore encourage every woman to make every effort within her means to prevent cervical cancer.\n\nBreast cancer caused 670 000 deaths globally in 2022. Breast cancer was the most common cancer in women in 157 countries out of 185 in 2022. Breast cancer occurs in every country in the world. Approximately 0,5 percent to 1 percent of breast cancers occur in men. Yet this, like all other cancers, is very preventable through regular breast self-examination, examination by experienced health professionals, and a screening test called mammography. Early screening accords an individual early identification of both pre-cancer and cancer of the breast followed by early treatment which prevents further complications and/or death, he said.\n\nDr Shamhu added that prostate cancer has also become a major concern among men not only in Masvingo but the world over.\n\nAn elderly woman having her eyes examined during a medical outreach organised by First Lady Dr Auxillia Mnangagwa in Masvingo yesterday.\n\nProstate cancer (PCa) is the second most common cancer in men worldwide. In 2020, there were an estimated 1,4 million PCa diagnoses and 375 000 deaths due to prostate cancer for those men who sought medical care. There is a high likelihood that this is an estimate as men rarely want to seek health care until its too late.\n\nI would therefore like to take this moment to encourage all men to prevent premature deaths due to prostate cancer by going for regular screening and treatment when the need arises, he said.\n\nNAC programmes officer for Masvingo, Mr Munyengetero Masunga described the First Ladys medical outreach as a blessing.\n\nWe are blessed to have Amai assisting in the response. We used to have high levels of stigma and discrimination but with increased awareness raised by the outreach of our First Lady, Dr Mnangagwa, we have seen that people are now free to come and access the services ranging from testing for HIV to accessing treatment for those who would have tested HIV positive.\n\nWe also have cervical cancer affecting most women who are HIV positive, but now because we have the mobile outreach that is coming to enhance efforts on the ground, we have seen several people openly accessing the services.\n\nYesterday, we had six teams testing for cervical cancer in the outreach. We also are happy that we have added the critical service that is quite costly for people to access in Harare, the breast cancer screening and its coming with the mobile outreach has made life easier for the majority of people who cannot raise resources to access the service. We also have our prevention thrust where we even have family planning services looking at condom distribution.\n\nThey are here offering services. With HIV several conditions have crept in where we have non-communicable diseases so we also have a team that is screening for sugar, and eyes. For our cervical cancer and wellness day we had a full house of those services and we appreciate our mother, the First Lady. We hope that these outreach programmes will take us somewhere targeting our vision of ending Aids by 2030, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/First-Lady-outreach-1-680x380.jpg",
            "description": "Tendai Rupapa in MASVINGO CASES of people enduring excruciating pain and letting it dissipate on its own or even dying without seeking medical help are common across communities, especially among men. Studies and testimonies by medical experts indicate that men shun health checks and present for treatment usually when it is late. Some men use […]",
            "time": "06:08",
            "date": "15 Feb 2025"
        },
        {
            "title": "Appointment of Additional Deputy Ministers",
            "url": "https://www.herald.co.zw/appointment-of-additional-deputy-ministers/",
            "content": "Under His Excellency the Presidents wise stewardship of the Second Republic, the National Development Strategy 1 is in its final lap, and the development of the successor National Development Strategy 2 has commenced in earnest.\n\nA review of mandates has revealed the need to carry out institutional adjustments to allow for greater clarity and agility in the implementation of policies to drive inclusive growth and transformation.\n\nIn light of the above, additional posts of Deputy Minister have been created as follows:\n\n1. The Ministry of Local Government and Public Works now has a Deputy Minister responsible for Public Works and Maintenance of Government Buildings, who is already in office. The Member of Parliament for Nketa Constituency, Honourable Albert Tawanda Mavunga comes in as Deputy Minister responsible for Local Authorities and Traditional Leadership.\n\n2. The Ministry of Mines and Mining Development now has a Deputy Minister responsible for Mineral Resources Extraction and Marketing, who is already in office. The Member of Parliament for Mutoko North Constituency, Honourable Caleb Makwiranzou, comes in as the Deputy Minister responsible for Oil and Gas Research including other Strategic Minerals Exploration.\n\n*Explainer issued by the Chief Secretary to the President and Cabinet, Dr Martin Rushwaya.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/09/martinrushwaya-451x380.jpg",
            "description": "Under His Excellency the President’s wise stewardship of the Second Republic, the National Development Strategy 1 is in its final lap, and the development of the successor National Development Strategy 2 has commenced in earnest. A review of mandates has revealed the need to carry out institutional adjustments to allow for greater clarity and agility […]",
            "time": "06:08",
            "date": "15 Feb 2025"
        },
        {
            "title": "Decentralisation of National Youth Day celebrations hailed",
            "url": "https://www.herald.co.zw/decentralisation-of-national-youth-day-celebrations-hailed/",
            "content": "Trust Freddy-Herald Correspondent\n\nYouths have hailed the decentralisation of the National Youth Day celebrations, praising the move as a bold step that will bring the event closer to the people and provide more opportunities for participation, engagement, and empowerment.\n\nThis years commemorations are set for Barbourfields Stadium in Bulawayo on February 21, with over 20 000 young people expected to attend.\n\nThe day coincides with the late former President Robert Mugabes birthday, presenting a platform for young people to interact with President Mnangagwa and showcase their talents.\n\nThe theme for this years event is: Empower youth: Secure the future.\n\nWhile the national event will take place in Bulawayo, youths in all provinces will follow proceedings in real-time from designated vocational training centres and institutions of higher learning.\n\nIn an interview, Mr Justice Mfiri, secretary of the Zimbabwe Institute of African Integration, a youth empowerment lobby group, said: The National Youth Day is a prime opportunity to showcase the best of ourselves as youths.\n\nBulawayo, the City of Kings and Queens, is a cultural hub for the nation.\n\nWe anticipate that the day will bring us an opportunity to network with youths from across the region, as such occasions are graced by youths from neighbouring countries standing in solidarity with the youth of Zimbabwe.\n\nBy hosting this event in Bulawayo, we can showcase our diverse cultures, celebrate our heritage, and promote the cultural and creative sector of the region through exhibitions and sales.\n\nDevolution worked in the best interests of the youth by facilitating platforms for interaction that uplift the nations development agenda, he said.\n\nInternational affairs expert Mr Clive Chiridza highlighted that exhibitions during the celebrations would provide a crucial platform for young people to showcase innovation and address socio-economic challenges.\n\nParticipating in these events offers opportunities for skills development, potential business ventures, and mentorship, he said. Additionally, showcasing creative projects can boost confidence and inspire other youths to engage in entrepreneurial initiatives, ultimately contributing to the nations economic growth, he said.\n\nDirector of programming and public relations for the Zimbabwe Youth Council Mr Tanzikwa Guranungo said preparations for the National Youth Day were underway.\n\nEverything is under control; we are happy about the decentralisation of the National Youth Day celebrations. We expect over 20 000 youths to attend, said Mr Guranungo.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/President-Mnangagwa-2.jpg",
            "description": "Trust Freddy-Herald Correspondent Youths have hailed the decentralisation of the National Youth Day celebrations, praising the move as a bold step that will bring the event closer to the people and provide more opportunities for participation, engagement, and empowerment. This year’s commemorations are set for Barbourfields Stadium in Bulawayo on February 21, with over 20 […]",
            "time": "06:08",
            "date": "15 Feb 2025"
        },
        {
            "title": "Reckless kombi driver jailed 3 years",
            "url": "https://www.herald.co.zw/reckless-kombi-driver-jailed-3-years/",
            "content": "Yeukai Karengezeka-Court Correspondent\n\nA kombi driver whose reckless driving caused a tragic accident that claimed six lives has been sentenced to three years in prison.\n\nElisha Mandemo (34) was convicted on six counts of culpable homicide, as well as additional charges related to operating a public service vehicle without mandatory insurance and necessary certifications.\n\nState prosecutor Ms Charlotte Chikoore proved that on July 10, 2024, at around 1:30pm, along the Harare-Mutare Road at the 20km peg, Mandemo was negligently driving a Toyota Hiace (registration number AGJ 1704).\n\nHe was travelling at an excessive speed and lost control of the vehicle, which veered off the road.\n\nThe vehicle overturned multiple times before landing on its wheels in the outer lane of the oncoming carriageway. The accident resulted in the deaths of six passengers and injuries to 12 others.\n\nMandemo was also found to have been operating the vehicle without fault insurance coverage, a critical requirement for public service vehicles.\n\nFurthermore, he lacked the necessary documentation to qualify as a public service driver, including proof of continuous driving experience for five years.\n\nA valid defensive driving certificate and medical certificate.\n\nPresiding magistrate Ms Appolonia Marutya sentenced Mandemo to four years in prison for culpable homicide.\n\nHowever, one year was suspended on the condition of good behaviour, leaving him with an effective three-year prison term.\n\nFor driving without fault insurance, Mandemo was fined US$30.\n\nHe was also fined US$15 for each of the other violations.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/02/Jailed.jpg",
            "description": "Yeukai Karengezeka-Court Correspondent A kombi driver whose reckless driving caused a tragic accident that claimed six lives has been sentenced to three years in prison. Elisha Mandemo (34) was convicted on six counts of culpable homicide, as well as additional charges related to operating a public service vehicle without mandatory insurance and necessary certifications. State […]",
            "time": "06:08",
            "date": "15 Feb 2025"
        },
        {
            "title": "I put everything in God’s hands: B/bridge crash survivor",
            "url": "https://www.herald.co.zw/i-put-everything-in-gods-hands-b-bridge-crash-survivor/",
            "content": "Thupeyo Muleya-Beitbridge Bureau\n\nOn Thursday yet another major bus accident killed 25 people when an Urban Connect intercity bus and an Auro Transport commercial truck collided head-on 21km north of Beitbridge Town.\n\nThe accident occurred just before the Lutumba tollgate along the Beitbridge-Masvingo Road, where 17 people died on the spot, with anothereight dying upon admission to hospital. Another 40 passengers sustained injuries with 10 of them regarded as critically injured.\n\nThe incident occurred at around 7am after the south-bound bus, reportedly while overtaking another vehicle, collided with the northbound truck carrying 34 tonnes of magnesium and heading to Chirundu.\n\nThe bus had 65 people while the truck had three people including the driver.\n\nAccording to the Beitbridge District Medical Officer, Dr Lenos Samhere, a total of 17 passengers died on the spot while eight others who had sustained head injuries died upon admission at the Beitbridge District Hospital.\n\nHe said 10 of the injured were in critical condition and were taken to Gwanda and United Bulawayo hospitals.\n\nWe have transferred 10 who were critical to Gwanda provincial hospital, said Dr Samhere.\n\nThe injured were rescued by motorists passing through the accident scene, the police and other stakeholders working together with the local Civil Protection Committee.\n\nSurvivors said they had been sleeping only to wake up on the tarmac and at the hospital.\n\nI was awoken by the large bang and I saw a lot of bodies lying on the road, said Tinashe Chingono from Chitungwiza.I was thrown out of the bus through the front side during the impact and became very scared and in a few moments. I passed out for a few minutes and then saw a lot of bodies on the tarmac covered in blood.\n\nAfter a few minutes we were rushed to the hospital where medical staff attended to me and the other injured passengers. The service here is excellent.\n\nMs Tambudzai Mugasa said she was frightened as she noticed the bus was about to collide with the truck.\n\nI just stared at death haplessly and put everything to God when I noticed that the bus was about to collide with the truck, she said. I couldnt believe my eyes. The next thing I found myself outside the bus next to several bodies.\n\nA customs clearing agent from Beitbridge, Mr Washington Musemwa, who was injured on the neck, said he watched helplessly as the bus headed for the collision with the truck.\n\nMr Musemwa said after the collision he woke up after almost 30 minutes and saw bodies around.\n\nI saw some rescue workers retrieving from the wreckage those who were still crying for help. The first thing I did was to look for my bag. After locating it, I walked to one of the vehicles that was carrying the injured passengers on my own and was later taken to this hospital, he said.\n\nWhen I noticed the bus was about to collide with the truck, I jumped out through the window and sustained some injuries on the left side of my face, said Mr Tapiwa Mambaya. I landed on the ground with my right hand and lay there for a few minutes before some Good Samaritans took me to an ambulance.\n\nMinister of State for Matabeleland South Provincial Affairs and Devolution, Dr Evelyn Ndlovu, Transport and Infrastructure Development Minister Felix Mhona and Local Government and Public Works Minister Daniel Garwe visit the accident scene in Beitbridge yesterday.  Picture: Thupeyo Muleya.\n\nThe first thing after getting composure was to check if I still had my wallet and phone. My head was covered in blood and I then called my brother to inform him about the accident, said Mr Mambaya.\n\nA passenger who preferred anonymity said she became terrified when she saw some bodies on the tarmac and upon seeing the rescuers pulling out some passengers from the bus.\n\nOne of the first people to attend the scene, Mr Thomas Nhundu of Great Hope Funeral Parlour who was also driving towards Beitbridge said he and together with community members living close to the highway retrieved some of the injured from the bus.\n\nThe bus had just overtaken us and when we arrived there were bodies all over the tarmac, said Mr Nhundu.\n\nAnother witness, Mr Leonard Wanderson, a resident of Tshapfutshe said he rushed to the scene after hearing a loud bang near the toll gate.\n\nI had seen the bus passing through our business centre when suddenly I heard a loud bang and I rushed here. We then together with other community members started rescuing those who were injured and covering the bodies with blankets and some clothes which had been thrown all over the scene, he said.\n\nMr Wanderson, said most of the passengers sitting in the front seats were thrown on the tarmac during the collision.\n\nIn a statement, Urban Connect bus company expressed their condolences to the grieving families and the nation pledging compassionate assistance of US$500 to each grieving family.\n\nAs Urban Connect, we want to express our heartfelt condolences to families and relatives of our fellow Zimbabweans who passed on in the bus accident on Thursday February 13, 2025 near the Lutumba Tollgate along the Masvingo Beitbridge Highway. We wish a speedy recovery to those injured, said the company.\n\nWe will offer compassionate assistance to relatives of the departed and we have started rendering assistance to the injured. In addition, we pledge to cooperate with authorities in investigations into this accident.\n\nMatabeleland South Minister of State for Provincial Affairs and Devolution Dr Evelyn Ndlovu, Minister of Transport and Infrastructure Development Cde Felix Mhona, and Local Government and Public Works Minister Cde Daniel Garwe yesterday visited the accident scene, the survivors in hospital and attended a memorial service held for the departed souls at Doves Funeral Parlour.\n\nZimbabwe Passengers Transport Organisation chairman, Dr Samson Nhanhanga passed his condolences to the grieving families and called on public transport operators to address the issues of speeding by drivers.\n\nHe also delivered US$11 000 to the Government to assist with the burials.\n\nSpeed has become our worst enemy. We continue urging our drivers to adhere to good road driving ethics, he said.\n\nThe Insurance Council of Zimbabwe said it will cover medical and funeral expenses of all the passengers, while the Traffic Safety Council of Zimbabwe has given an assortment of hampers to those hospitalised.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Beitbridge-bus-crash-survivors-.-.-.-680x380.jpg",
            "description": "Thupeyo Muleya-Beitbridge Bureau On Thursday yet another major bus accident killed 25 people when an Urban Connect intercity bus and an Auro Transport commercial truck collided head-on 21km north of Beitbridge Town. The accident occurred just before the Lutumba tollgate along the Beitbridge-Masvingo Road, where 17 people died on the spot, with another  eight dying […]",
            "time": "06:08",
            "date": "15 Feb 2025"
        },
        {
            "title": "Johane Masowe’s remains to be exhumed",
            "url": "https://www.herald.co.zw/johane-masowes-remains-to-be-exhumed/",
            "content": "Fidelis Munyoro-Chief Court Reporter\n\nIn a landmark ruling, the High Court has delivered a declaratory order affirming the inalienable rights of Peter Jack Masedzas children to exhume and rebury their fathers remains, 50 years after his death.\n\nMasedza is known by the legion of apostolic sect members as Johane Masowe.\n\nThis decision heralds a significant legal and spiritual victory for Magaga and Reuben Masedza, granting them the authoritywithin the parameters of established legal frameworksto honour their fathers legacy and memory in accordance with their familial and cultural obligations.\n\nThe case stemmed from a protracted and bitter dispute with a faction of the Gospel of God Church, which had resolutely barred the Masedza brothers from accessing their fathers gravesite at Gandanzara Shrine in Makoni, a sacred burial place near Rusape.\n\nBaba Johane, a revered religious figure and spiritual guide to millions, passed away in Zambia on September 14, 1973, at the age of 59. His remains were later repatriated to what was then Rhodesia (now Zimbabwe) and interred at the shrine.\n\nEfforts by the High Court in 2017 to mediate the feud by granting both sides equal access to the burial site proved futile, as hostilities persisted unabated. The Masedza brothers application asked the court to determine two critical questions: whether they had the legal right to exhume their fathers remains and whether the court could order such an exhumation.\n\nJustice Tawanda Chitapi, in his judgment, upheld the brothers right to exhume their fathers remains, subject to compliance with statutory procedures, but declined to grant the consequential relief of directly ordering the exhumation.\n\nThe applicants have a right to exhume the remains of the late Johane Masowe Shoniwa Masedza, which are buried at Gandanzara Shrine, Rusape, subject to their following due process, ruled Justice Chitapi.\n\nThe judge further clarified that the declaratory relief granted did not, in and of itself, authorise immediate exhumation but instead required adherence to the procedural dictates outlined in the Cemeteries Act.\n\nJustice Chitapi emphasised that the applicants cultural and familial assertions were well-founded, noting their insistence that it was both a traditional and moral obligation for children to bury their parents, maintain access to their graves, erect tombstones, and preserve such burial sites as enduring family heritage.\n\nThe brothers legal counsel, Advocate Lewis Uriri, instructed by Mr Nickiel Mushangwe, argued that the denial of access to their fathers burial site had caused grave prejudice, severing their connection with their late fathers remains.\n\nAdvocate Uriri submitted that Baba Johane, a devout worshiper of God, would not have wished his grave to become a symbol of worship, a shrine for idolatry, or a source of benefit for leaders of the Gospel of God Church.\n\nOpposing the application, the Churchs Deputy President, Erica Office, represented by Advocate Silvester Hashiti, argued that the deceased had expressed wishes to be buried at the Gandanzara Shrine and dismissed the application as frivolous, citing the passage of over 20 years since his death.\n\nThe judge observed that the parties had been embroiled in related litigation over the years, which explained the delay in bringing the current application.\n\nMr Mushangwe hailed the ruling as epochal, describing it as a momentous decision with far-reaching implications beyond the mere administration of justice.\n\nThis ruling brings joy, relief, and a clear pathway to resolve the pernicious problem of children fighting for the right to honour their parents in death. It also carries spiritual significance, as it involves one of Africas religious luminaries, he said.\n\nWhile the courts order is declaratory and does not directly mandate the exhumation, it provides the siblings with the legal clarity and authority needed to proceed within the confines of statutory requirements.\n\nJustice Chitapis judgment underscores the importance of balancing cultural imperatives, legal procedure, and the sanctity of burial sites, while reaffirming the judiciarys role as the ultimate arbiter in matters of justice.\n\nThis ruling not only restores the dignity of the Masedza family but also serves as a poignant reminder of the enduring bond between family, tradition, and the law.\n\nIt lifts the shadow of conflict that had long loomed over Baba Johanes final resting place, enabling his children to honour his memory in peace and unity.\n\nSince 1932, when Shonhiwa Masedza, later known as Johane Masowe, received his divine call to the prophetic ministry, the Gospel of God Church has been synonymous with worship in open spaces, a practice that became its enduring hallmark.\n\nMagaga now 77 years old, stood on the precipice of triumph after enduring a grueling 52-year legal and emotional battle to access his fathers burial site.\n\nHis voice, heavy with both exhaustion and relief, trembled as he reflected on the journey. This journey was unbearably tortuous, but we are happy that finally, justice has prevailed while we are still alive, he said.\n\nFor Magaga and other family members, this victory is not merely a legal milestone, but a deeply personal and spiritual reclamation of their heritage.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Johane-Masowe.jpg",
            "description": "Fidelis Munyoro-Chief Court Reporter In a landmark ruling, the High Court has delivered a declaratory order affirming the inalienable rights of Peter Jack Masedza’s children to exhume and rebury their father’s remains, 50 years after his death. Masedza is known by the legion of apostolic sect members as Johane Masowe. This decision heralds a significant […]",
            "time": "06:08",
            "date": "15 Feb 2025"
        },
        {
            "title": "Editorial Comment: Sables need support to fulfil World Cup Dream",
            "url": "https://www.herald.co.zw/editorial-comment-sables-need-support-to-fulfil-world-cup-dream/",
            "content": "In five months time, Zimbabwes senior mens rugby team  the Sables  will plunge into action for a massive competition whose endgame could be a huge change in fortunes for the domestic game.\n\nZimbabwe will be among eight teams that will converge in Kampala, Uganda, from July 20 to 28 for the 2025 edition of the Rugby Africa Cup.\n\nThe Sables are the defending champions, having surprised many, including themselves, last year when they claimed the silverware.\n\nThey will thus begin the tournament as the top seeds and will headline their draw bracket which also includes Morocco, Kenya and the hosts Uganda.\n\nZimbabwes nemesis Namibia, Senegal, Algeria and Cote dIvoire are in the opposing bracket.\n\nThe Sables kick off the Africa Cup campaign with a match against Morocco, with the winner facing victors of the match between hosts Uganda and Kenya.\n\nUnlike last year when Zimbabwe coach Piet Benade led his Sables to just African glory by winning the cup, there is an even bigger incentive and reward that comes with winning this years Africa Cup.\n\nThis is because the competition is a culmination of the long road to the 2027 Rugby World Cup qualification which started last year.\n\nAccording the programme laid out by the continental body  Rugby Africa  the upcoming competition, set to be held in Uganda, serves as a two-year qualification tournament for the 2027 Mens Rugby World Cup, organised by World Rugby and scheduled for Australia.\n\nZimbabwe have not been to the World Cup jamboree since 1991 when playing at the showcase was by invitation.\n\nGenerations of Sables have since come and gone but have failed to cross the line.\n\nOn the occasions that the Sables have come close they found Namibia standing in the way.\n\nThere are high hopes that 2025 could yet again be the Sables year.\n\nThis is on the back of their 2024 Africa Cup during which they posted a rare win over Namibia and eliminated them in the semi-final.\n\nWe, however, believe that for the Sables to repeat that feat, this year, they need the whole nations support.\n\nThe Zimbabwe Rugby Union (ZRU) may be the rugby mother body but we believe that the competition in Uganda in July has assumed a bigger national status for the countrys sport.\n\nThe World Cup is the ultimate competition in any discipline.\n\nQualification for such tournaments also reaps financial and huge career rewards for the players.\n\nZimbabwe has many of its nationals dotted around the world and, refreshingly, a very good number of them have put their hands up for availability for selection.\n\nIt means the ZRU will need financial resources to fly in the players from their different bases for trainingcamps.\n\nCoach Benade has reportedly drawn a programme in the build-up to Uganda in July and both private and public sectors should play their roles to make this national cause a success.\n\nOur Sables have the pedigree and it calls on the nation to help them off the field to achieve the goal.\n\nIt would boost Zimbabwes pride to have the countrys flag being among those that will be paraded in Australia in 2027.\n\nBenade can only take his squad to the High Performance Centres and to play some high profile warm up matches when adequate resources are availed and on time.\n\nSome of the corporate sponsors in this country are notorious for only coming on board when a sporting team has made it to a major competition, but we believe the biggest support is needed during that long and arduous journey to qualification.\n\nIndividuals with a capacity to assist should not shy away and join the band of arm chair critics without playing their part.\n\nThe ZRU have done well to retain a Sables Trust, a commercial vehicle through which resources are mobilised.\n\nThat Trust needs to be assisted so that Benade and his players do not have to worry about off field challenges related to welfare, travel and accommodation among others.\n\nWe believe that players, like all athletes should be prioritised in terms of incentives, remuneration and other requirements that can help make Zimbabwes quest for 2027 World Cup qualification a huge success.\n\nInvestment in the Sables 2027 World Cup bid, is investing in the future of the game.\n\nThis is because a host of the positive spin-offs will filter down to the grassroots, the schools, academies and clubs.\n\nZimbabwe is yearning for a vibrant national league which is key for the sustenance and visibility of rugby in the country.\n\nThe Sables showed what they can do in last years Africa Cup.\n\nThey have the capacity to repeat that and inspire the Junior Sables who are also chasing glory in their respective age group via the Barthes Trophy and their task is not insurmountable.\n\nWhat the Sables need is a whole nations support and they could reward Zimbabwe with a place at the World Cup.\n\nIt can be done!\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/09/grt.jpg",
            "description": "In five months’ time, Zimbabwe’s senior men’s rugby team — the Sables — will plunge into action for a massive competition whose endgame could be a huge change in fortunes for the domestic game. Zimbabwe will be among eight teams that will converge in Kampala, Uganda, from July 20 to 28 for the 2025 edition […]",
            "time": "06:08",
            "date": "15 Feb 2025"
        }
    ]
}