{
    "news": [
        {
            "title": "2025 legal year officially opened",
            "url": "https://www.herald.co.zw/2025-legal-year-officially-opened/",
            "content": "Online Reporters\n\nChief Justice Luke Malaba has officially opened the 2025 legal year at the Bulawayo High Court.\n\nThe landmark event, traditionally held at the Constitutional Court in Harare, signifies a significant shift in the judiciarys approach, aligning with the Governments devolution agenda.\n\nReplica ceremonies were held concurrently in Harare, Mutare, Masvingo, and Chinhoyi.\n\nDeputy Chief Justice Mrs Elizabeth Gwaunza presided over the event in Harare, while Mrs Marie-Anne Gowora, a judge of the Constitutional Court, oversaw the ceremony in Masvingo.\n\nIn Mutare, Justice Ben Hlatshwayo, also a judge of the Constitutional Court, headlined proceedings, while the Deputy Judge President, Justice Garainesu Mawadze, presided over proceedings at Chinhoyi High Court.\n\nThis years theme, Building Public Confidence in the Judiciary Through Stakeholder Participation, highlights the judiciarys commitment to fostering greater trust, inclusivity, transparency, and accountability within the justice system.\n\nDuring his address at the main event in Bulawayo, Chief Justice Malaba said the courts cannot deliver justice without collaboration with other stakeholders.\n\nThe judiciary will work with other stakeholders to ensure that justice is served, he said.\n\nHe acknowledged the role of the media and non-governmental organisations in informing the public on the importance of justice delivery.\n\nChief Justice Malaba said the Judiciary Service Commission should put in place policies and measures to ensure that the courts are independent in making their decisions and accountable for the decisions.\n\nIn her address in Harare, Deputy Chief Justice Gwaunza said this years theme serves as a clarion call to strengthen collaboration and engagement between the judiciary and the public.\n\nThis years theme reminds us of the power of collective effort in delivering justice, said Justice Gwaunza.\n\nBy working together with all stakeholders, we can strengthen public trust in the judiciary and ensure that it continues to serve with transparency and fairness.\n\nShe also reflected on the achievements of the Judicial Service Commission (JSC) in 2024, while candidly acknowledging the challenges encountered along the way.\n\nThe ceremony also provided an opportunity to strategise on how the judiciary can continue to improve its services in the face of evolving societal needs.\n\nThe prestigious events were graced by a broad spectrum of stakeholders, including Government officials, leading lawyers, judges, magistrates, and other key players in the justice sector.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/bfe79ab8-a6c2-4494-bf09-7db3add18fba-680x380.jpeg",
            "description": "Online Reporters Chief Justice Luke Malaba has officially opened the 2025 legal year at the Bulawayo High Court. The landmark event, traditionally held at the Constitutional Court in Harare, signifies a significant shift in the judiciary’s approach, aligning with the Government’s devolution agenda. Replica ceremonies were held concurrently in Harare, Mutare, Masvingo, and Chinhoyi. Deputy […]",
            "time": "18:37",
            "date": "13 Jan 2025"
        },
        {
            "title": "Shurugwi man jailed for kidnapping, indecently assaulting minor",
            "url": "https://www.herald.co.zw/shurugwi-man-jailed-for-kidnapping-indecently-assaulting-minor/",
            "content": "Tapiwa Chikuhwa\n\nHerald Reporter\n\nA 21-year-old Shurugwi man has been sentenced to four years in prison for kidnapping and indecently assaulting a minor.\n\nThe man appeared before the Shurungwi Magistrates Court.\n\nThe court heard that on December 24 last year, the three-year-old victim and other children were playing when the accused person came and took her away.\n\nThe man detained the minor for about 30 minutes. The complainants father heard that the accused had taken his daughter and made a follow-up.\n\nThe victims father found his daughter standing naked, wearing the accuseds necklace. The accused escaped, leaving his cell phone behind.\n\nThe matter was reported to the police, leading to the accused persons arrest.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/courthammer-680x380.jpg",
            "description": "Tapiwa Chikuhwa Herald Reporter A 21-year-old Shurugwi man has been sentenced to four years in prison for kidnapping and indecently assaulting a minor. The man appeared before the Shurungwi Magistrates’ Court. The court heard that on December 24 last year, the three-year-old victim and other children were playing when the accused person came and took […]",
            "time": "18:37",
            "date": "13 Jan 2025"
        },
        {
            "title": "Suspected thief murdered in Budiriro",
            "url": "https://www.herald.co.zw/suspected-thief-murdered-in-budiriro/",
            "content": "Crime Reporter\n\nA suspected thief was fatally assaulted by a group of people in Budiriro last Thursday after he allegedly broke into a house where a 19-year-old woman was sleeping.\n\nThe incident occurred around 3 am.\n\nNational police spokesperson Commissioner Paul Nyathi confirmed the incident.\n\nPolice in Harare are investigating a case of murder which occurred along Gunguwo Street, Budiriro, Harare on January 10 at around 3 am. The victim died and he was identified as Honest, he said.\n\nThe victim was apprehended by a mob on allegations of unlawful entry into a house in Budiriro 5B where he allegedly grabbed the complainant who was sleeping in her bedroom.\n\nThe mob indiscriminately assaulted the victim using wooden logs and left him for dead. He succumbed to the injuries.\n\nThe body of the victim was taken to Sally Mugabe Hospital mortuary for post-mortem. Anyone with information that might assist with investigations should contact the nearest police station, said Commissioner Nyathi.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/07/1705-1-1-PAUL-THEMBA-NYATHI-1.jpg",
            "description": "Crime Reporter A suspected thief was fatally assaulted by a group of people in Budiriro last Thursday after he allegedly broke into a house where a 19-year-old woman was sleeping. The incident occurred around 3 am. National police spokesperson Commissioner Paul Nyathi confirmed the incident. “Police in Harare are investigating a case of murder which […]",
            "time": "18:37",
            "date": "13 Jan 2025"
        },
        {
            "title": "Financial institution loses US$3 500 to robbers",
            "url": "https://www.herald.co.zw/financial-institution-loses-us3-500-to-robbers/",
            "content": "Crime Reporter\n\nThree armed robbers raided a financial institution in Beatrice and got away with US$3 500 on Saturday.\n\nThe three were travelling in a silver Toyota Sienta and were armed with pistols.\n\nNo arrests have been made and the police are investigating the case.\n\nNational police spokesperson Commissioner Paul Nyathi confirmed the incident in a statement.\n\nThe ZRP is investigating a case of robbery which occurred at Beatrice Township on January 11 at around 9 am, he said.\n\nThree unidentified male suspects who were armed with pistols and wearing face masks pounced at a local financial institution and demanded keys to the tellers booth.\n\nThe suspects gained entry into the booth and stole US$3 500 and three cellphones. The suspects locked the teller in the booth and drove off in a silver Toyota Sienta with no number plates.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/08/Untitled-169.jpg",
            "description": "Crime Reporter Three armed robbers raided a financial institution in Beatrice and got away with US$3 500 on Saturday. The three were travelling in a silver Toyota Sienta and were armed with pistols. No arrests have been made and the police are investigating the case. National police spokesperson Commissioner Paul Nyathi confirmed the incident in […]",
            "time": "18:37",
            "date": "13 Jan 2025"
        },
        {
            "title": "Palestinian Ambassador calls Israel’s fund seizure ‘a war crime’",
            "url": "https://www.herald.co.zw/palestinian-ambassador-calls-israels-fund-seizure-a-war-crime/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nAmbassador of the State of Palestine to Zimbabwe Dr Tamer Almassri has condemned Israels continued withholding of over US$544 million in Palestinian tax and customs revenue.\n\nIn a statement, Ambassador Almassri labelled the act as financial piracy and a blatant violation of international law, and urged the global community to intervene.\n\nThis is not just an economic issue, it is a direct assault on the human rights of the Palestinian people, he said.\n\nBy withholding these funds, Israel is imposing collective punishment on an already vulnerable population, violating fundamental principles of international law and human dignity.\n\nThe seized revenues, which are collected by Israel on behalf of the Palestinian Authority (PA) under the Paris Protocol, constitute a significant portion of the authoritys budget.\n\nThe funds are essential for maintaining critical services, including healthcare, education, and social welfare programmes.\n\nThis systematic theft cripples our ability to provide for our people, he said.\n\nIt deepens economic hardship, fuels the humanitarian crisis, and perpetuates a cycle of poverty and deprivation. This is collective punishment at its worst, said Ambassador Almassri.\n\nThe ambassador also highlighted the broader implications of Israels actions, particularly in the wake of the recent military escalation in Gaza.\n\nThe world must see this for what it is, it is a war crime. Israels disregard for international law not only undermines Palestinian sovereignty but also sets a dangerous precedent for the rule of law globally, he said.\n\nThe State of Palestine has called on the international community to take decisive action.\n\nWe urge nations to demand the immediate and unconditional return of these funds, Ambassador Almassri said.\n\nAccountability must be enforced. The time for silence has passed.\n\nPalestine has also pledged to continue pursuing all available legal and diplomatic avenues to recover the seized funds and address what it describes as systematic violations of Palestinian rights.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/06/b1551032-c00b-4828-aa7d-9b702338e385-680x380.jpeg",
            "description": "Ivan Zhakata Herald Correspondent Ambassador of the State of Palestine to Zimbabwe Dr Tamer Almassri has condemned Israel’s continued withholding of over US$544 million in Palestinian tax and customs revenue. In a statement, Ambassador Almassri labelled the act as “financial piracy” and a “blatant violation of international law,” and urged the global community to intervene. […]",
            "time": "18:37",
            "date": "13 Jan 2025"
        },
        {
            "title": "Buhera man beheads son",
            "url": "https://www.herald.co.zw/buhera-man-beheads-son/",
            "content": "Crime Reporter\n\nA Buhera man has been arrested on allegations of beheading his 11-year-old son with an axe.\n\nThe man, Tawanda Magoso, had just returned from a shrine where he had gone for prayers when the incident occurred.\n\nNational police spokesperson Commissioner Paul Nyathi said, Police arrested Tawanda Magoso aged 32 in connection with a case of murder which occurred at his house in Daakoni Village, Buhera, on January 10, in which his son, Taonga Magoso aged 11 died.\n\nThe suspect allegedly returned home from a shrine where he had gone for prayers and took an axe from his bedroom. He used the axe to strike the victim indiscriminately all over the body.\n\nThe victims head separated from its torso. The boy sustained multiple injuries on the back. The suspect was later apprehended with the help of community members.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/08/arrested-handcuffed.jpeg",
            "description": "Crime Reporter A Buhera man has been arrested on allegations of beheading his 11-year-old son with an axe. The man, Tawanda Magoso, had just returned from a shrine where he had gone for prayers when the incident occurred. National police spokesperson Commissioner Paul Nyathi said, “Police arrested Tawanda Magoso aged 32 in connection with a […]",
            "time": "18:37",
            "date": "13 Jan 2025"
        },
        {
            "title": "Harare prepares for legal processes as calls for the extension of President Mnangagwa’s term of office grow louder",
            "url": "https://www.herald.co.zw/harare-prepares-for-legal-processes-as-calls-for-the-extension-of-president-mnangagwas-term-of-office-grow-louder/",
            "content": "Joseph Madzimure\n\nSenior Reporter\n\nZanu PF Harare Province is preparing its structures to be ready for any legal process that may require input from the people in line with the extension of the Presidents term of office beyond 2028.\n\nThe province is pushing for its structures to be conversant with the resolution adopted at the 21st Zanu PF National Peoples Conference that President Mnangagwas term of office be extended beyond 2028.\n\nThe provincial leadership has since launched an outreach programme to engage various party organs, including the provinces commissariat department, to push the agenda.\n\nThe province has already engaged political commissars in Zone 5, Epworth, Chitungwiza Zone 1, and Glenview Zone 2 to drum up support for the extension of the Presidents term of office beyond 2028.\n\nThis will enable the President to realise Vision 2030 since his leadership is central to Zimbabwes accelerated development.\n\nSpeaking at a provincial meeting held at Glenview Community Hall in Harare on Sunday, Zanu PF Harare provincial chairman Cde Godwills Masimirembwa said political commissars should inform the people in their zones about President Mnangagwas deliverables.\n\nHe said the meeting was meant to grow the partys base and to popularise the call for the extension of the Presidents term of office so that members are ready if there are any legal processes that require their input.\n\nThe message to our political commissars in Harare Province is to be ready to go out to popularise the call made at the National Peoples Conference for President Mnangagwas term of office to be extended beyond 2028, he said.\n\nTo popularise it they must all be familiar with President Mnangagwas good works. They must popularise Vision 2030.\n\nAny amendment, be it constitutional or any legal instrument to be brought to the people, Harare Province must be ready. The time to popularise the call is now. That is the assignment we have given to the Commissariat department.\n\nHe also highlighted the vital role played by the Commissariat department in recruitment, membership retention and dissemination of the partys ideology.\n\nWe want to make sure that our Commissariat department is strong at every level  from provincial to branch and cell levels, with the ultimate goal being to double our membership in Harare, he said.\n\nZanu PFs Council of Elders member Cde Idah Mashonganyika urged members to remain loyal to the party and its leadership.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2018/12/1412-1-1-PAGE-4.jpg",
            "description": "Joseph Madzimure Senior Reporter Zanu PF Harare Province is preparing its structures to be ready for any legal process that may require input from the people in line with the extension of the President’s term of office beyond 2028. The province is pushing for its structures to be conversant with the resolution adopted at the […]",
            "time": "18:37",
            "date": "13 Jan 2025"
        },
        {
            "title": "Gweru police bust cattle rustlers",
            "url": "https://www.herald.co.zw/gweru-police-bust-cattle-rustlers/",
            "content": "Midlands Bureau\n\nPolice in Gweru on Friday intercepted a Honda Fit that was carrying the carcass of a cow at Claybank roundabout along the Gweru-Shurugwi Road.\n\nThe incident occurred at around 12:30 am.\n\nMidlands Provincial Police spokesperson Inspector Emmanuel Mahoko confirmed the development.\n\nFour people, including the driver, abandoned their vehicle and fled on foot after a brief police chase, he said.\n\nInspector Mahoko said when the police searched the vehicle, they discovered the carcass of a brown cow that was wrapped in a black plastic, a bicycle and tools that had been used to slaughter the beast.\n\nInvestigations have led to the identification of the driver as 30-year-old Taison Chakanyuka of Mtapa, Gweru. The vehicle was being used as a taxi, he said.\n\nInspector Mahoko said the police are appealing for information that may assist in the arrest of Chakanyuka and his three accomplices who are all still at large.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/08/mahoko-1.jpg",
            "description": "Midlands Bureau Police in Gweru on Friday intercepted a Honda Fit that was carrying the carcass of a cow at Claybank roundabout along the Gweru-Shurugwi Road. The incident occurred at around 12:30 am. Midlands Provincial Police spokesperson Inspector Emmanuel Mahoko confirmed the development. “Four people, including the driver, abandoned their vehicle and fled on foot […]",
            "time": "18:37",
            "date": "13 Jan 2025"
        },
        {
            "title": "Man killed for stealing pot of sadza, chicken",
            "url": "https://www.herald.co.zw/man-killed-for-stealing-pot-of-sadza-chicken/",
            "content": "Crime Reporter\n\nA 42-year-old Masvingo man was fatally assaulted over the weekend after he was accused of stealing a pot of sadza and chicken.\n\nPolice have since arrested one of the suspects in connection with the case.\n\nThe police are also appealing for information that may lead to the arrest of Takunda Gwitira who is being sought in connection with the case.\n\nNational police spokesperson Commissioner Paul Nyathi said, The ZRP confirms the arrest of Makneme Chikutuva (41) in connection with a murder case which occurred at Village Midzi, Masvingo, on January 11, in which Maxwell Manjonjo (42) died.\n\nThe suspect allegedly assaulted Manjonjo with leather straps from an ox yoke all over the body after accusing him of stealing a pot containing sadza and chicken.\n\nOn seeing that Manjonjo was now struggling to breathe, Chikutuva carried him to Musingarahwi Business Centre and dumped him.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/08/Arrested.jpg",
            "description": "Crime Reporter A 42-year-old Masvingo man was fatally assaulted over the weekend after he was accused of stealing a pot of sadza and chicken. Police have since arrested one of the suspects in connection with the case. The police are also appealing for information that may lead to the arrest of Takunda Gwitira who is […]",
            "time": "18:37",
            "date": "13 Jan 2025"
        },
        {
            "title": "Back to school frenzy",
            "url": "https://www.herald.co.zw/back-to-school-frenzy/",
            "content": "Online Reporters\n\nParents were this morning captured as they dropped their children at Robert Mugabe Square in Harare for their trips back to their respective schools for the First Term.\n\nMeanwhile, the Large City Hall Car Park in Bulawayo is also abuzz with activity as buses pick up pupils to ferry them to boarding schools in Matabeleland North and Matabeleland South Provinces.\n\nSchools open tomorrow.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/989891ab-f09f-4b2d-a65b-4dcf2d518b23-680x380.jpeg",
            "description": "Online Reporters   Parents were this morning captured as they dropped their children at Robert Mugabe Square in Harare for their trips back to their respective schools for the First Term. Meanwhile, the Large City Hall Car Park in Bulawayo is also abuzz with activity as buses pick up pupils to ferry them to boarding […]",
            "time": "18:37",
            "date": "13 Jan 2025"
        }
    ]
}