{
    "news": [
        {
            "title": "Scores die as bus and truck collide head-on",
            "url": "https://www.herald.co.zw/scores-die-as-bus-and-truck-collide-head-on/",
            "content": "Thupeyo Muleya\n\nBeitbridge Bureau\n\nScores of people died this (Thursday) morning when an Urban Connect bus they were travelling in collided head-on with a commercial truck at the Lutumba tollgate along the Beitbridge-Masvingo highway.\n\nWitnesses said the accident occurred just before 7am when the driver of the bus made an overtaking error.\n\nThe local civil protection committee, the police and the army are still on the ground retrieving the bodies from the wreckage.\n\nThe injured have been taken to the district hospital.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/89b11f6a-223c-4951-8ee3-52f546ce2345-680x380.jpeg",
            "description": "Thupeyo Muleya Beitbridge Bureau Scores of people died this (Thursday) morning when an Urban Connect bus they were travelling in collided head-on with a commercial truck at the Lutumba tollgate along the Beitbridge-Masvingo highway. Witnesses said the accident occurred just before 7am when the driver of the bus made an overtaking error. The local civil […]",
            "time": "09:46",
            "date": "13 Feb 2025"
        },
        {
            "title": "Indian Women Association in Zimbabwe extends helping hand",
            "url": "https://www.herald.co.zw/indian-women-association-in-zimbabwe-extends-helping-hand/",
            "content": "Obey Musiwa\n\nHerald Reporter\n\nThe Indian Womens Association in Zimbabwe has donated an assortment of goods to six non-profit organisations at an event held at India House.\n\nThe six organisations are St Giles Rehabilitation Centre, Danai Childrens Home, Bumhudzo Old Peoples Home, Sanitary Aid Zimbabwe Trust, Owen Renias Orphans Support and World Impact School.\n\nAll the beneficiaries expressed immense gratitude to the association for the provisions, which will go a long way.\n\nSpeaking during the event, which was also the associations first open session of the year, the associations president Shraddha PrajapatiIndia reaffirmed its commitment to supporting the underprivileged in the country, with a focus on children, women, and the elderly.\n\nThe Indian Womens Association is made up of mothers, and therefore it is natural for them to reach out to children, women, and elderly people, she said.\n\nSo far, IWA has supported more than 69 houses through grocery items, solar geysers, blankets and many other essential items.\n\nThe associations secretary, Mrs Nalini Devchand said other organisations have also played their part in alleviating the plight of the less privileged in Zimbabwe.\n\nThe Indian Women Association continues to work towards lending a helping hand whenever we are needed. In this month of love, we are spreading love and smiles, she said.\n\nOne of the beneficiaries, Sanitary Aid Trust executive director Mrs Theresa Nyava-Machadu applauded IWAs gesture.\n\nMrs Nyava-Machadu said the donation will help address period poverty, especially in rural communities.\n\nWe are seeing progress. Conversations around menstrual health can now be had without any discrimination, with men being a part of them too, she said.\n\nThis donation is such a blessing to our girls and we remain grateful for the assistance.\n\nIWA is a charity group made up of 60 Indian ladies under the aegis of the Embassy of India in Harare.\n\nIt has been involved in charity events since 1995.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/india-680x380.jpg",
            "description": "Obey Musiwa Herald Reporter The Indian Women’s Association in Zimbabwe has donated an assortment of goods to six non-profit organisations at an event held at India House. The six organisations are St Giles Rehabilitation Centre, Danai Children’s Home, Bumhudzo Old People’s Home, Sanitary Aid Zimbabwe Trust, Owen Renias Orphans Support and World Impact School. All […]",
            "time": "09:46",
            "date": "13 Feb 2025"
        },
        {
            "title": "Crooner Nevanji itches for recognition",
            "url": "https://www.herald.co.zw/crooner-nevanji-itches-for-recognition/",
            "content": "Joshua Muswere\n\nThe need to be recognised regionally and internationally ignited the career of Mugove Nevanji, a talented singer, songwriter and contemporary dancer better known as Shellah.\n\nThe artiste has begun to reap the rewards of his patience, strategic planning and dedication despite facing numerous hurdles along the way.\n\nIn 2018, Shellah announced his arrival on the music scene with his four-track Extended Play (EP) titled Im Shellah Black.\n\nHowever, the 30-year-old has encountered financial constraints that have made pursuing his dream a challenge.\n\nAfter releasing the Nerudo album, I had to shelve my music career as I had exhausted my funds, he explained.\n\nI earned nothing from my first EP because I failed to market the project, which led me to take a five-year hiatus from music.\n\nDuring the Covid-19 pandemic, Shellah decided to pursue a Degree in Electrical Engineering to create a stable source of income while still following his passion.\n\nHis music blends Afro-beat, jiti, and sungura, thereby enriching the already diverse music landscape in Zimbabwe.\n\nGrowing up in a religious family as a member of the United Methodist Church fostered Shellahs singing ability as he was part of the churchs praise and worship team.\n\nIn 2015, I began honing my songwriting skills and started recording in 2016. This is when I met my first producers, Nyasha Timbe and Mr Noxa, Shellah recalled.\n\nTo date, Shellah has released two projects, each with different outcomes, but he maintains a positive outlook.\n\nA third project is expected before the end of the first quarter of this year.\n\nHis single Urigamba has remained on Power FM Zimbabwes Top 40 charts for two consecutive weeks.\n\nHaving mastered the art of resilience, Shellah serves as an inspiration and motivation for emerging and aspiring artists.\n\nMy main aim is to spread positive messages to everyone, promote love, and eradicate hate, he said.\n\nMy advice to upcoming artists is to exercise patience and embrace hard work.\n\nBorn and raised in Kambuzuma, Harare, the Afro-fusion musician attended Wadzanai Primary School and Kambuzuma 1 High School.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Screenshot-2025-02-13-at-08.51.08-680x380.png",
            "description": "Joshua Muswere The need to be recognised regionally and internationally ignited the career of Mugove Nevanji, a talented singer, songwriter and contemporary dancer better known as Shellah. The artiste has begun to reap the rewards of his patience, strategic planning and dedication despite facing numerous hurdles along the way. In 2018, Shellah announced his arrival […]",
            "time": "09:46",
            "date": "13 Feb 2025"
        },
        {
            "title": "Reduction of harvest losses on cards",
            "url": "https://www.herald.co.zw/reduction-of-harvest-losses-on-cards/",
            "content": "Walter Nyamukondiwa\n\nMashonaland West Bureau Chief\n\nGovernment and various stakeholders have started developing a plan on how to reduce harvesting and post-harvest losses which account for about 30 percent of farmers losses.\n\nThe losses normally result from operators failure to properly calibrate and use combine harvesters, resulting in some of the crop falling to the ground.\n\nA team of engineers from Government and the private sector, as well as suppliers of combine harvesters from the countrys 10 provinces are in Chinhoyi to develop at least 11 modules for farmers to help reduce losses along the production value-chain.\n\nChief Director Agricultural Engineering, Mechanisation and Farm Infrastructure Development Engineer Edwin Zimunya said studies have shown that nearly half of losses occur during harvesting.\n\nScientific studies have shown that 30 percent of losses in Zimbabwe take place during harvesting and we have to plug that leakage.\n\nWe are collaborating to come up with a Standardised Operations and Optimisation Model for Zimbabwe, which will be underpinned by the Standards Association of Zimbabwe (SAZ) and implemented by the Institute of Engineering, said Engineer Zimunya.\n\nYields determine the revenue that a farmer gets, he said. Any loss is going to affect the farmers bottom line.\n\nEngineer Zimunga said Government is also promoting the usage of appropriate technologies among small-holder farmers under a $6 million Pfumvudza facility.\n\nThe initiative is being undertaken under the Agricultural Mechanisation Alliance\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/dem-680x380.jpg",
            "description": "Walter Nyamukondiwa Mashonaland West Bureau Chief Government and various stakeholders have started developing a plan on how to reduce harvesting and post-harvest losses which account for about 30 percent of farmers’ losses. The losses normally result from operator’s failure to properly calibrate and use combine harvesters, resulting in some of the crop falling to the […]",
            "time": "09:46",
            "date": "13 Feb 2025"
        },
        {
            "title": "Laptop thief jailed for 6 months",
            "url": "https://www.herald.co.zw/laptop-thief-jailed-for-6-months/",
            "content": "Anesu January\n\nHerald Correspondent\n\nA Nyanga man has been sentenced to six months in prison after breaking into Nyanga District Hospital and stealing a laptop.\n\nRegis Svondo (49) appeared before the Nyanga Magistrates Court facing unlawful entry and theft charges.\n\nThe court heard that on February 3, the man entered Room 13 at Nyanga District Hospital and stole an HP laptop valued at $650 and fled.\n\nWhen the owner of the laptop Ernest Tsakatsa returned home, he discovered that his laptop was missing.\n\nTsakatsa filed a report of the missing laptop to the Zimbabwe Republic Police Nyanga.\n\nOn February 4, the police received a tip-off that Svondo was selling the stolen laptop.\n\nHe was arrested and Tsakatsa positively identified his laptop using its serial number.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/09/Jailed.jpg",
            "description": "Anesu January Herald Correspondent A Nyanga man has been sentenced to six months in prison after breaking into Nyanga District Hospital and stealing a laptop. Regis Svondo (49) appeared before the Nyanga Magistrates’ Court facing unlawful entry and theft charges. The court heard that on February 3, the man entered Room 13 at Nyanga District […]",
            "time": "09:46",
            "date": "13 Feb 2025"
        },
        {
            "title": "640 hours of unpaid labour for attempted murder",
            "url": "https://www.herald.co.zw/640-hours-of-unpaid-labour-for-attempted-murder/",
            "content": "Thupeyo Muleya\n\nBeitbridge Bureau\n\nA 46-year-old woman from Tshithaudze, Beitbridge, has been sentenced to 640 hours of community service for stabbing a neighbour and inflicting near fatal injuries.\n\nJennifer Moyo was enraged when she saw her neighbour Lissed Shumba fighting with her daughter.\n\nShe took a knife and stabbed Shumbas head twice and once on the back.\n\nMoyo was convicted on one count of attempted murder when she appeared before Beitbridge regional magistrate Ms Charity Maphosa on Tuesday.\n\nShe was sentenced to five years in prison.\n\nHowever, three years were conditionally set aside for five years while the remaining two years were suspended on condition that she performs 640 hours of community service at Dulivhadzimu Clinic.\n\nThe State, led by Miss Tsitsi Mutukwa, said on January 14 at around 8 pm, Shumba had a misunderstanding with Moyos daughter and this resulted in a fist fight.\n\nUpon seeing the two fighting, Moyo intervened.\n\nShe took a kitchen knife and stabbed Shumba.\n\nThe fight was stopped by a mob and the matter was reported to the police.\n\nShumba was taken to Beitbridge District Hospital for treatment.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/07/faq-whats-the-difference-between-aggravated-assault-and-attempted-murder-680x380.jpg",
            "description": "Thupeyo Muleya Beitbridge Bureau A 46-year-old woman from Tshithaudze, Beitbridge, has been sentenced to 640 hours of community service for stabbing a neighbour and inflicting near fatal injuries. Jennifer Moyo was enraged when she saw her neighbour Lissed Shumba fighting with her daughter. She took a knife and stabbed Shumba’s head twice and once on […]",
            "time": "09:46",
            "date": "13 Feb 2025"
        },
        {
            "title": "Police to impound unregistered vehicles",
            "url": "https://www.herald.co.zw/police-to-impound-unregistered-vehicles-3/",
            "content": "Crime Reporter\n\nThe Zimbabwe Republic Police has warned motorists driving vehicles with no registration number plates that they risk having them impounded.\n\nGovernment vehicles are also not excluded from this.\n\nIn a statement, national police spokesperson Commissioner Paul Nyathi said, The Zimbabwe Republic Police warns the public against driving vehicles with no registration plates.\n\nIn terms of the Vehicle Registration and Licensing Act, no vehicle, whether private or company owned, should be driven on the countrys roads with no number plates.\n\nThe Zimbabwe Republic Police will thus impound any vehicle found on the roads with no plates.\n\nGovernment vehicles are not excluded from the number plates requirement.\n\nHe also said motorists are implored to comply with regulations and fit proper and stipulated headlights on their vehicles.\n\nIn this regard, any vehicle driven on the roads while fitted with ballad or bar lights in clear contravention of the countrys laws and road safety requirements will be impounded and the owner or driver prosecuted, he said.\n\nThe Zimbabwe Republic Police urges motorists to observe road rules and regulations to safeguard lives on the roads, said Commissioner Nyathi.\n\nMeanwhile, the Commissioner-General of Police Stephen Mutamba has directed the police to arrest kombi drivers whose touts hang on the back of moving vehicles.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/05/police.jpg",
            "description": "Crime Reporter The Zimbabwe Republic Police has warned motorists driving vehicles with no registration number plates that they risk having them impounded. Government vehicles are also not excluded from this. In a statement, national police spokesperson Commissioner Paul Nyathi said, “The Zimbabwe Republic Police warns the public against driving vehicles with no registration plates.” In […]",
            "time": "09:46",
            "date": "13 Feb 2025"
        },
        {
            "title": "Businessman approaches court over death threats",
            "url": "https://www.herald.co.zw/businessman-approaches-court-over-death-threats/",
            "content": "Prosper Dembedza\n\nHerald Correspondent\n\nA Harare businessman is living in fear after a Dzivarasekwa bouncer threatened to kill him and kidnap his children, the court has heard.\n\nMalcom Sikitara (42) appeared in court facing charges of threatening to kill Musa Muteteli (35).\n\nHe was remanded out of custody to February 27 for routine remand when he appeared before Harare magistrate, Ms Ethel Chichera.\n\nIt is the States case that on February 8, 2025, Sikitara went to Mutetelis workplace in Belvedere, Harare, and threatened to kill the complainant and kidnap his children.\n\nThe court heard that Sikitara continued with the threats.\n\nMuteteli is now living in fear for his life and that of his family.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/courthammer-680x380.jpg",
            "description": "  Prosper Dembedza Herald Correspondent A Harare businessman is living in fear after a Dzivarasekwa bouncer threatened to kill him and kidnap his children, the court has heard. Malcom Sikitara (42) appeared in court facing charges of threatening to kill Musa Muteteli (35). He was remanded out of custody to February 27 for routine remand […]",
            "time": "09:46",
            "date": "13 Feb 2025"
        },
        {
            "title": "Madziwa FM back on air, seeks assistance to build new structures",
            "url": "https://www.herald.co.zw/madziwa-fm-back-on-air-seeks-assistance-to-build-new-structures/",
            "content": "Fungai Lupande\n\nMashonaland Central Bureau\n\nMadziwa FM is back on air following a brief hiatus that was caused by a devastating storm that damaged its studios.\n\nThe stations vice chairperson Mr Jack Soko said they have only managed to patch the roof of the studio to enable them to start broadcasting again.\n\nUnfortunately, the storm also damaged the antenna, which reduced the stations area of coverage.\n\nWe began broadcasting last week so that our listeners can catch up on news and current affairs, he said.\n\nHowever, the building we are using has been condemned, and we are looking forward to constructing new facilities.\n\nMr Soko also mentioned that the Chaminuka Rural District Council has allocated them a stand for this purpose, and he appealed for assistance to help build new studios and to furnish them.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/madziwa-fm-680x380.jpg",
            "description": "Fungai Lupande Mashonaland Central Bureau Madziwa FM is back on air following a brief hiatus that was caused by a devastating storm that damaged its studios. The station’s vice chairperson Mr Jack Soko said they have only managed to patch the roof of the studio to enable them to start broadcasting again. Unfortunately, the storm […]",
            "time": "09:46",
            "date": "13 Feb 2025"
        },
        {
            "title": "Restrictive fees, permits must go: President",
            "url": "https://www.herald.co.zw/restrictive-fees-permits-must-go-president/",
            "content": "Farirai Machivenyika and Wallace Ruzvidzo\n\nAll ministries should ensure that business does not suffer from prohibitive regulations as well as punitive administrative licences and fees, President Mnangagwa has said.\n\nIn his address at the First Meeting of the 2025 Cabinet Year on Tuesday, the President said instead of being restrictive, fees, licences, permits and regulations should promote economic development.\n\nTo enhance the overall performance of our economy, the Ease of Doing Business Agenda continues to be an important aspect of our programming.\n\nIn that regard, concerted efforts must be made to revisit all the areas that hinder the start or growth of all investments, whether local or foreign.\n\nI commend the entrepreneurial spirit among our people. By nature, Zimbabweans are hardworking, he said.\n\nTowards that end, Parliaments Portfolio Committee on Industry and Commerce yesterday convened to discuss the challenges faced by manufacturers and retailers in the formal sectors.\n\nConfederation of Zimbabwe Industries (CZI) chief economist, Dr Cornelius Dube, said there was need for legislation requiring Government ministries, departments and agencies to procure a specific percentage of their goods and services from local suppliers to boost the economy.\n\nGovernment should come up with legislation or a statutory instrument that compels it to buy a prescribed threshold for its goods and services from local suppliers, he said.\n\nDr Dube argued that this measure would enhance competitiveness and boost demand for local products.\n\nConfederation of Zimbabwe Retailers (CZR) president Mr Denford Mutashu highlighted the unfair competition posed by informal traders.\n\nThere are a lot of regulations and cost centres that we are facing as formal traders that those in the informal sectors are not paying. This makes our prices uncompetitive.\n\nThe closure of formal businesses could negatively impact other sectors, such as banking and finance, due to a decline in deposits, he said.\n\nIn her presentation, chief executive officer of the Consumer Council of Zimbabwe (CCZ) Ms Rosemary Mpofu-Chikarakara stressed the importance of addressing exchange rate discrepancies, foreign exchange shortages, and market distortions that encourage arbitrage.\n\nThe CCZ also wants smuggling stopped.\n\nIssues of porous border posts also need to be seriously dealt with and punitive (and) deterrent measures such as jail terms need to be introduced in order to curb these challenges.\n\nGovernment and the affected businesses can partner and aggressively invest and deploy advanced monitoring technologies, including drones, CCTV, and automated scanning systems, at all major border posts.\n\nAll imported products should abide by the rules, with no exemptions of who is importing. As long as there are other importers who are exempted from paying duty, loopholes will always be created and these products will then find their way both in the formal and informal market, creating an unfair playing field with the businesses that pay duties, the CCZ said.\n\nPortfolio Committee chairperson Cde Clemence Chiduwa acknowledged the concerns raised at the meeting.\n\nWe have taken note of the presentations and we will compile a report that we will table in the House for debate, he said.\n\nThe Committee aims to find viable solutions to support the local industry and create a fair competitive environment.\n\nThe Government and the Reserve Bank have taken taken steps to formalise the informal sector as part of broader measures outlined in the 2025 Monetary Policy Statement announced last Thursday, aimed at enhancing Government tax revenues and stabilising the economy.\n\nA week earlier, Finance, Economic Development and Investment Promotion Professor Mthuli Ncube announced measures to rein the burgeoning informal sector that was threatening the survival of formal businesses.\n\nThe RBZ Monetary Policy emphasises the need for both the informal and formal sectors to align, creating a more cohesive economic environment.\n\nRBZ Governor Dr John Mushayavanhu is advocating for the integration of informal businesses into a system that includes dual currencies, bank accounts, and electronic payments, which is essential for achieving the Governments economic goals.\n\nUnder the new regulations, items on a list of commonly smuggled goods will be presumed smuggled unless merchants can provide valid customs clearance.\n\nThis initiative places pressure on businesses to ensure compliance and legitimacy in their operations.\n\nGovernment will implement a presumptive retail-level VAT that manufacturers must collect when selling to small or informal businesses lacking tax clearance certificates.\n\nThis measure restricts wholesalers from engaging with unlicensed entities, further pushing informal businesses towards formalisation.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/11/Untitled-83-2.jpg",
            "description": "Farirai Machivenyika and Wallace Ruzvidzo All ministries should ensure that business does not suffer from prohibitive regulations as well as punitive administrative licences and fees, President Mnangagwa has said. In his address at the First Meeting of the 2025 Cabinet Year on Tuesday, the President said instead of being restrictive, fees, licences, permits and regulations […]",
            "time": "09:46",
            "date": "13 Feb 2025"
        }
    ]
}