{
    "news": [
        {
            "title": "Woman seeks support to fight endometriosis",
            "url": "https://www.herald.co.zw/woman-seeks-support-to-fight-endometriosis/",
            "content": "Herald Reporter\n\nA Norton-based woman, Claire Blam Lunga (32), is seeking the support of well-wishers in her fight against endometriosis.\n\nEndometriosis is a condition in which the lining of the uterus grows outside of the uterus.\n\nIt then inflames and causes severe pain.\n\nI am unable to take care of my two children because of the extreme pain I am constantly experiencing, said Lunga.\n\nThe doctors I have seen here in Zimbabwe have done the best they can for me and are unable to help me further. Thus, my doctor, who is managing my pain, said l should go to India or China for further treatment.\n\nl need to raise US$15 000 for treatment, food, accommodation and air tickets for me and my mother who will take care of me while there.\n\nPlease help me to get the chance to work for my children. I am a telecommunications engineer by profession. Help me to be the warrior that I am. Thank you, she said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/c2518ed7-3cef-4d80-9bbd-4f900fda3174-680x380.jpg",
            "description": "A Norton-based woman, Claire Blam Lunga (32), is seeking the support of well-wishers in her fight against endometriosis.",
            "time": "20:37",
            "date": "24 Mar 2025"
        },
        {
            "title": "Group empowers 160 women",
            "url": "https://www.herald.co.zw/group-empowers-160-women/",
            "content": "Herald Reporter\n\nA local women empowerment lobby group of survivors of gender-based violence has empowered over 160 women by providing resources for mental wellness, career development, and educational opportunities.\n\nThe Selfless Sisters Trust, with more than 200 members, primarily consists of survivors of GBV, rape, and those who have attempted suicide.\n\nThey aim to empower others by sharing their experiences and demonstrating how to overcome similar challenges.\n\nOn Sunday, the organisation hosted an event in Harare where it awarded start-up funding to five young women and offered counselling services to approximately 20 others.\n\nFounding president of Selfless Sisters Trust Ms Irene Sami, who is based in the United States, shared her motivations.\n\nI never want to see any woman go through the same hardships that I endured. The horror I experienced during my childhood compelled me to form this organisation, as I was aware that many others were in need and required assistance.\n\nAt just 15, Ms Sami took on the responsibility of caring for her siblings after losing her grandmother. By age 19, she moved to Harare to find work, facing numerous challenges along the way, including an unplanned pregnancy.\n\nI struggled until I was able to educate myself, and eventually, I made my way to the United States, where I now work in a restaurant, she said.\n\nBefore her move, Ms Sami had established a car wash and a restaurant operated by survivors of GBV, which led to the founding of the Selfless Sisters Trust in 2021.\n\nMs Rudo Hariseni, a community leader within the Trust, emphasised the importance of emotional support.\n\nWhat motivates me is the need to create awareness and provide emotional support for women. Many women are going through trauma, depression, and other challenges that they cannot share with anyone, she said.\n\nA survivor, who chose to remain anonymous, recounted her traumatic experience.\n\nAt 19, I was drugged and raped by my boyfriend. I spent six months in the hospital, where doctors worked to remove the drugs from my system. I attempted suicide twice, but I survived.\n\nNow, my dream is to ensure no one else suffers the same trauma, she said.\n\nThe event not only provided funding to aspiring entrepreneurs, but also fostered a supportive community. The Selfless Sisters Trust continues to offer counselling and job placement assistance, impacting many womens lives and demonstrating that healing is possible through shared experiences and support.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/download-7-1-680x380.jpg",
            "description": "A local women empowerment lobby group of survivors of gender-based violence has empowered over 160 women by providing resources for mental wellness, career development, and educational opportunities.",
            "time": "20:37",
            "date": "24 Mar 2025"
        },
        {
            "title": "Joint SADC-EAC Summit opens",
            "url": "https://www.herald.co.zw/joint-sadc-eac-summit-opens/",
            "content": "Zvamaida Murwira\n\nSenior Reporter\n\nA SADC-East African Community virtual joint summit aimed at resolving the conflict in eastern Democratic Republic of Congo is running this evening.\n\nThe summit is being co-chaired by SADC chairperson, President Mnangagwa and his EAC counterpart, Kenyan President William Ruto.\n\nThe joint summit has gone into closed door deliberations after the co-chairs delivered their opening remarks, giving an overview of the summit.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/a3982002-2819-40fa-8bd4-cd04d17c60fb-680x380.jpg",
            "description": "A SADC-East African Community virtual joint summit aimed at resolving the conflict in eastern Democratic Republic of Congo is running this evening.",
            "time": "20:37",
            "date": "24 Mar 2025"
        },
        {
            "title": "Industry Minister calls for regional cooperation",
            "url": "https://www.herald.co.zw/industry-minister-calls-for-regional-cooperation/",
            "content": "Online Reporter\n\nINDUSTRY and Commerce Minister Nqobizitha Mangaliso Ndlovu has challenged Sadc Member States to harmonise standards and technical regulations to reduce trade barriers in the region.\n\nMinister Ndlovu said this in a speech read on his behalf by Chief Director Dr Douglas Runyowa at the opening of the 40th Annual Sadc Technical Barriers to Trade (TBT) Cooperation Structures meeting in Victoria Falls today.\n\nThe week-long meeting will end on Friday and is being convened under the auspices of the TBT Annex to the Sadc protocol on Trade.\n\nIt represents a pivotal moment in the regions collective journey towards regional industrialisation and economic integration.\n\nThe meeting is being held under the theme Promoting regional harmonisation of standards for industrialisation and economic growth.\n\nMinister Ndlovu said the meeting is a platform to shape the future of regional trade landscape.\n\nAs a region, we have made significant milestones, including the harmonisation of 124 standard texts across diverse sectors. There is also the standardisation of regulations for 21 horticultural fruits and 19 horticultural plants.\n\nThis week we will dedicate ourselves to addressing these challenges, focusing on strategic capacity building in metrology, conformity assessment and accreditation to ensure every Member State possesses the requisite tools and resources to fully participate and reap the benefits of our regional frameworks.\n\nWe must be committed to finding and harmonising diverse standards ensuring our products meet both regional and international benchmarks, he said.\n\nHe said member states strategic frameworks must be aligned with the Sadc Industrialisation Strategy and Roadmap 2015-2063.\n\nHe said these efforts are firmly rooted in the regional indicative strategic Development Plan 2020-2030 and the Sadc Vision 2050 guiding our regional integration programmes and actions.\n\nMinister Ndlovu called for collaboration, innovation and unwavering commitment to build a competitive, industrialised regional economy that stands as a beacon of progress and prosperity on the global stage.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/download-6-680x380.jpg",
            "description": "INDUSTRY and Commerce Minister Nqobizitha Mangaliso Ndlovu has challenged Sadc Member States to harmonise standards and technical regulations to reduce trade barriers in the region.",
            "time": "20:37",
            "date": "24 Mar 2025"
        },
        {
            "title": "Zimbabwe commemorates World TB Day",
            "url": "https://www.herald.co.zw/zimbabwe-commemorates-world-tb-day-2/",
            "content": "Victor Maphosa\n\nMashonaland East Bureau\n\nZimbabwe has joined other nations in commemorating World TB Day, with calls for collaboration in the fight against tuberculosis.\n\nThe commemorations were held at Mahusekwa District Hospital in Mashonaland East Province under the theme Yes! We can end TB. Commit, Invest , Deliver.\n\nThousands gathered for the commemorations, with various partners pledging continued support in the fight to end TB.\n\nIn his remarks read on his behalf by Provincial Medical Director Dr Paul Matsvimbo, Minister of Health and Child Care Dr Douglas Mombeshora implored everyone to play a part in the fight.\n\nEnding TB in Zimbabwe requires unified effort from all of us. Today l call on every individual, institution, community and organisation to play their part in this fight.\n\nTo our programme officers and policy makers, we need your continued commitment to prioritise TB in national health agendas. We should mobilise domestic resources to fill funding gaps.\n\nTo our doctors, nurses and environmental health practitioners, your dedication as frontliners in this battle is invaluable.\n\nWe need to find every case of TB. Let us continue to innovate to find TB cases and treat them with dignity and compassion, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/09/Douglas-Mombeshora.jpg",
            "description": "Zimbabwe has joined other nations in commemorating World TB Day, with calls for collaboration in the fight against tuberculosis.",
            "time": "20:37",
            "date": "24 Mar 2025"
        },
        {
            "title": "Three ivory dealers run into police trap",
            "url": "https://www.herald.co.zw/three-ivory-dealers-run-into-police-trap/",
            "content": "Thupeyo Muleya\n\nBeitbridge Bureau\n\nThree Beitbridge based ivory dealers were on Friday arrested by the police while looking for buyers for two elephant tusks.\n\nNokhukanya Gumede (34), Phakamani Maphosa (32) and Josephe Muleya (30) were arrested after being lured by police detectives to a service station where the sale was supposed to be concluded.\n\nUpon their arrest, they were found with 4.1kgs of raw ivory worth US$1472.54.\n\nThe trio were not asked to plead when they appeared before Ms Vavariro Gabi on Saturday.\n\nThey were remanded in custody to 4 April.\n\nProsecuting, Mr Tawanda Chigavazira said on March 21, the police got a tip off that the three were selling ivory.\n\nThe detectives set up a trap and posed as potential buyers after contacting the accused persons.\n\nThey agreed to conclude the deal at a local service station.\n\nGumede and Maphosa arrived with one of the elephant tusks.\n\nThe two were arrested upon arrival and Muleya was also arrested when he arrived with the other tusk.\n\nThe raw ivory was confisticated.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2013/11/Ivory-629x380.jpg",
            "description": "Three Beitbridge based ivory dealers were on Friday arrested by the police while looking for buyers for two elephant tusks.",
            "time": "20:37",
            "date": "24 Mar 2025"
        },
        {
            "title": "Car cleaner steals US$10k from client’s vehicle",
            "url": "https://www.herald.co.zw/car-cleaner-steals-us10k-from-clients-vehicle/",
            "content": "Prosper Dembedza\n\nHerald Correspondent\n\nA Harare car cleaner has appeared in court on allegations of stealing US$10 000 from a clients car in Mabelreign.\n\nAlbert Chimukuyu appeared before magistrate Isheunesu Matova yesterday.\n\nHe was remanded in custody.\n\nAccording to the State, on Saturday at around noon, the unnamed complainant went to a car wash at Mabelreign Shopping Centre.\n\nThe complainant left a bag containing US$10 000 and a 9mm Makarov pistol with a magazine of 09 live rounds in his cars glove compartment.\n\nThe accused person washed the car and later stole the bag containing the firearm and cash.\n\nHe then handed over the car keys to the complainant and fled the scene, the State said.\n\nThe court heard that the complainant discovered the offence and filed a police report.\n\nOn 23 March, detectives from CID Homicide Harare heard that the accused person was hiding at a lodge in Glaudina, Harare.\n\nActing on the information, detectives proceeded to the lodge. The accused person was subsequently arrested.\n\nA search was conducted and it led to the recovery of US$1850 and the pistol with a magazine of 09 live rounds, the State said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/court-hammer.jpg",
            "description": "A Harare car cleaner has appeared in court on allegations of stealing US$10 000 from a client's car in Mabelreign.",
            "time": "20:37",
            "date": "24 Mar 2025"
        },
        {
            "title": "Zim gears for digital economy",
            "url": "https://www.herald.co.zw/zim-gears-for-digital-economy/",
            "content": "Blessings Chidakwa and Remember Deketeke\n\nThe countrys digital landscape has taken a major step forward with the official opening of the IMC Communications Digital Experience Centre in Avondale, Harare.\n\nInformation Communication Technology (ICT), Postal and Courier Services Minister Tatenda Mavetera said IMC is set to revolutionize how Zimbabweans interact with mobile and satellite connectivity.\n\nSpeaking at the official opening, Minister Mavetera said the state-of-the-art facility is a crucial milestone in the countrys push for digital transformation, aligning with the countrys Vision 2030, which aims to attain an upper-middle-income economy through technological advancements.\n\nThis centre is a celebration of how mobile connectivity shapes our future, she said.\n\nIt is directly contributing to the Governments goal of establishing Zimbabwes digitally empowered economy.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/09/Minister-Mavetera.jpg",
            "description": "The country's digital landscape has taken a major step forward with the official opening of the IMC Communications Digital Experience Centre in Avondale, Harare.",
            "time": "20:37",
            "date": "24 Mar 2025"
        },
        {
            "title": "Court dismisses Madzibaba Ishmael’s application for Constitutional Court referral",
            "url": "https://www.herald.co.zw/court-dismisses-madzibaba-ishmaels-application-for-constitutional-court-referral/",
            "content": "Prosper Dembedza-Court Correspondent\n\nApostolic sect leader Madzibaba Ishmaels application for his case to be referred to the Constitutional Court has been dismissed by Norton Magistrate Ms Christina Nyandoro.\n\nThe magistrate ruled that the application was frivolous and vexatious, and therefore did not warrant referral.\n\nIn his application, Madzibaba Ishmael argued that it was unconstitutional for the court to deny him the opportunity to have his witnesses testify before he presents his defence.\n\nHe said his witnesses should be allowed to speak on his behalf while he exercises his right to remain silent.\n\nHowever, the prosecution, led by Mr Tafara Chirambira and Ms Sheila Mupindu, opposed the application.\n\nThey argued that the request was just a delaying tactic with no legal basis.\n\nThe State said an accused person must either testify or choose to remain silent, adding that there is no provision allowing witnesses to testify before the accused makes a decision.\n\nFurthermore, they said if Ishmael intends to exercise his right to silence, he should simply declare it, rather than basing it on what might be said by the witness.\n\nMs Nyandoro ruled that Ishmael had not raised any valid constitutional concerns.\n\nThe trial was postponed to April 2 as the defence lawyer was attending a funeral.\n\nMadzibaba Ishmael, also known as Chokurongerwa, is facing three charges  ill-treatment of children, conducting a burial without a burial order, and failing to register the birth and death of a person.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/01/istockphoto-626502360-170667a.jpeg",
            "description": "Prosper Dembedza-Court Correspondent Apostolic sect leader Madzibaba Ishmael’s application for his case to be referred to the Constitutional Court has been dismissed by Norton Magistrate Ms Christina Nyandoro. The magistrate ruled that the application was frivolous and vexatious, and therefore did not warrant referral. In his application, Madzibaba Ishmael argued that it was unconstitutional for […]",
            "time": "20:37",
            "date": "24 Mar 2025"
        },
        {
            "title": "Government commends Katanga Drop-In Centre for addressing drug abuse",
            "url": "https://www.herald.co.zw/government-commends-katanga-drop-in-centre-for-addressing-drug-abuse/",
            "content": "Precious Manomano-Herald Reporter\n\nGovernment has praised the Katanga Drop-In Centre for its critical role in tackling drug and substance abuse.\n\nEstablished by the Fight Against Substance Abuse and Addictions (FASSA) and the Inspired Angels Network, the centre is strategically located in Katanga, a high-density suburb that is notorious for elevated cases of drug abuse.\n\nDuring a stakeholders meeting at the centre last Friday, Mashonaland West Minister of State for Provincial Affairs and Devolution Marian Chombo, through a representative, reaffirmed the Governments commitment to supporting the initiative.\n\nShe emphasised the importance of collaboration with local authorities, community leaders, and stakeholders to address the root causes of substance abuse.\n\nI commend the centres efforts in providing a comprehensive range of services, Minister Chombo said.\n\nThese include assessment and referral services to connect individuals with appropriate treatment programmes, free counselling for vulnerable populations, peer support, and a safe space for individuals to access services without fear of stigma.\n\nThese services are essential in addressing drug and substance abuse in our communities.\n\nFASSA director, Dr Abigail Magwenzi described the centre as a safe haven for individuals battling addiction.\n\nWe catch them before they become psychotic, Dr Magwenzi explained. This centre acts as a referral point to mental health institutions.\n\nWe have engaged over 300 caregivers to ensure a smooth workflow. We have transformed many lives, and the community has become our key stakeholders after witnessing the recovery of drug users.\n\nSince the programmes inception two years ago, over 300 individuals have been successfully rehabilitated at the centre.\n\nFarai, known as Captain Tumbwa, began using substances at the age of 16.\n\nAlcohol was my stimulant. I didnt realize the damage I was doing to myself, he said. I left a good job because of drugs, but now I have completely transformed into a better person.\n\nSeveral individuals also testified about their relatives transformations, noting their newfound engagement in community projects and church activities.\n\nThe Katanga Drop-In Centre continues to be a beacon of hope, minimising drug abuse and fostering recovery within the community.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Minister-Chombo-680x380.jpg",
            "description": "Precious Manomano-Herald Reporter Government has praised the Katanga Drop-In Centre for its critical role in tackling drug and substance abuse. Established by the Fight Against Substance Abuse and Addictions (FASSA) and the Inspired Angels Network, the centre is strategically located in Katanga, a high-density suburb that is notorious for elevated cases of drug abuse. During […]",
            "time": "20:37",
            "date": "24 Mar 2025"
        }
    ]
}