{
    "news": [
        {
            "title": "Women applauded for preserving the environment",
            "url": "https://www.herald.co.zw/women-applauded-for-preserving-the-environment/",
            "content": "Fungai Lupande\n\nMashonaland Central Bureau\n\nMashonaland Central Provincial Affairs and Devolution Minister Christopher Magomo has commended women for preserving the environment.\n\nMinister Magomo was speaking during a national clean-up campaign at the Mushumbi Business Centre in Mbire this morning.\n\nHe said an increasing number of women are actively engaging in the preservation of Africas natural resources.\n\nWomen manage natural resources daily in their role as farmers, he said. They grow subsistence crops and often possess unique knowledge of local crop species.\n\nHe said that improving womens rights to access natural resources is not just a necessity but an obligation and an urgent imperative for maintaining the development trajectory of Africa and Zimbabwe.\n\nMinister Magomo noted that the significant contributions of women to economic growth and food security should not be overlooked.\n\nHe, however, pointed out that one major barrier to maximising these contributions is womens lack of secure tenure over natural resources, particularly land and water.\n\nThe clean-up campaign coincided with the commemoration of the Africa Environment Day, celebrated annually on March 3.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Untitled-29-680x380.jpg",
            "description": "Mashonaland Central Provincial Affairs and Devolution Minister Christopher Magomo has commended women for preserving the environment.",
            "time": "18:41",
            "date": "07 Mar 2025"
        },
        {
            "title": "Zìmbabwe to benefit from Agilitee Africa deal",
            "url": "https://www.herald.co.zw/zimbabwe-to-benefit-from-agilitee-africa-deal/",
            "content": "Farirai Machivenyika\n\nSenior Reporter\n\nZimbabwe is among the countries that are set to benefit from a deal entered into by Agilitee, Africas first electric vehicles manufacturer, and Chinas Guangzhou Thunder International Investment Company for the supply of scooters suitable for home deliveries.\n\nAgilitee has operations in the country through Agilitee Zimbabwe.\n\nThe deal was signed this week when an Agilitee delegation, led by founder and chief executive officer, Dr Mandla Lamba, visited China.\n\nUnder the deal, Guangzhou Thunder will deliver 40 000 scooters to Agilitees South Africa. These will be distributed to other African countries, including Zimbabwe.\n\nCountries that will benefit are Zimbabwe, Nigeria, Kenya, Malawi, Ghana and Lesotho, Dr Lamba said in a statement.\n\nThis programme will provide a source of income for those who do deliveries, he added.\n\nThe Chinese company and Agilitee also signed a deal to form Explore Group Africa, which will be headquartered in South Africa.\n\nThis will see Guangzhou Thunder building a plant in South Africa for the manufacturing and assembly of its scooters that will be supplied to the African market.\n\nUnder the deal, Agilitee will own a minority interest of 35 percent while Guangzhou Thunder will hold 65 percent ownership.\n\nDespite facing some challenges, Agilitee has grown in leaps and bounds as a leading Pan African manufacturer.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/f6927e9b-63d0-44df-9780-02397e6c30b2-680x380.jpeg",
            "description": "Zimbabwe is among the countries that are set to benefit from a deal entered into by Agilitee, Africa's first electric vehicles manufacturer, and China's Guangzhou Thunder International Investment Company for the supply of scooters suitable for home deliveries.",
            "time": "18:41",
            "date": "07 Mar 2025"
        },
        {
            "title": "Prioritise women’s rights, empowerment and equality: Minister Mutsvangwa",
            "url": "https://www.herald.co.zw/prioritise-womens-rights-empowerment-and-equality-minister-mutsvangwa/",
            "content": "Solomon Bhumu\n\nManicaland Bureau\n\nWomen Affairs, Community, Small and Medium Enterprises Development Minister, Senator Monica Mutsvangwa, has called for the prioritisation of rights, equality, and empowerment of women and girls.\n\nWe are celebrating the social, economic, cultural, and political achievements of women and girls around the world, Minister Mutsvangwa said in her keynote address at the International Womens Day national commemorations held at Munyarari\n\nPrimary School in Zimunya, Mutare, this afternoon.\n\nThis years theme is All women and girls: Rights. Equality. Empowerment.\n\nThe theme serves as a powerful reminder of the ongoing struggle for gender equality and the importance of inclusive and collective action.\n\nMinister Mutsvangwa said women and girls continue to face significant barriers to achieving their full potential.\n\nFrom discriminatory laws and policies to societal norms and stereotypes, women and girls are often marginalised, excluded, and silenced, said Minister Mutsvangwa.\n\nShe said despite all this, the Government has made incredible progress towards achieving gender equality.\n\nOur Constitution guarantees equal rights for women and men, and we have implemented various policies and programmes to promote gender equality, she said.\n\nShe said the Women Affairs Ministry is providing training to women on climate change mitigation, which is key in building resilience.\n\nThe Women Affairs, Community, Small and Medium Enterprises Development Ministry, in collaboration with development partners and financial institutions, have also established microfinance facilities to provide affordable loans to women, enabling them to carry out income generating activities.\n\nShe said moving forward, the rights, equality, and empowerment of all women and girls must be prioritised\n\nWe owe it to ourselves to create a future free from discrimination.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/8869dba6-9a8d-4847-ac24-1b9deb81333a-680x380.jpeg",
            "description": "Women Affairs, Community, Small and Medium Enterprises Development Minister, Senator Monica Mutsvangwa, has called for the prioritisation of rights, equality, and empowerment of women and girls.",
            "time": "18:41",
            "date": "07 Mar 2025"
        },
        {
            "title": "Yadah face Chicken Inn with only 12 players",
            "url": "https://www.herald.co.zw/yadah-face-chicken-inn-with-only-12-players/",
            "content": "Sports Reporter\n\nAll is not well at Yadah Stars who are reeling under the effects of a FIFA player transfer ban over their failure to pay their former Brazilian trio.\n\nThe team is playing its match day two against Chicken Inn with only one substitute. Last week they had two substitutes but left-back Anotidaishe Gwatidzo was red-carded and is suspended.\n\nThey lost that game 1-0 against Manica Diamonds.\n\nIt is understood that the team has paid part of the US$82 000 they were asked to pay by FIFA but for now they have to carry their cross.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2017/01/Magaya.jpg",
            "description": "Sports Reporter All is not well at Yadah Stars who are reeling under the effects of a FIFA player transfer ban over their failure to pay their former Brazilian trio. The team is playing its match day two against Chicken Inn with only one substitute. Last week they had two substitutes but left-back Anotidaishe Gwatidzo […]",
            "time": "18:41",
            "date": "07 Mar 2025"
        },
        {
            "title": "Zimbabwe upholds human rights",
            "url": "https://www.herald.co.zw/zimbabwe-upholds-human-rights/",
            "content": "Nyasha Motsi\n\nHerald Reporter\n\nThe Zimbabwe Human Rights Commission (ZHRC) chairperson, Commissioner Jessie Majome, has expressed satisfaction with the Governments commitment to upholding the International Covenant on Civil and Political Rights (ICCPR).\n\nSpeaking during a press conference in Harare on Thursday, Commissioner Majome acknowledged the Governments efforts to fulfill its obligations under the ICCPR, which is a significant milestone in promoting and protecting human rights in Zimbabwe.\n\nThese include the ratification of some key human rights instruments such as the Convention on the Rights of Persons with Disabilities (CRPD), accession to the International Convention on the Protection of the Rights of all Migrant Workers (ICRMW) and their family members, Commissioner Majome said.\n\nThe ZHRC further notes the enactment of progressive legislation such as the Criminal Laws Amendment (Protection of Children and Young Persons) which sets the age of consent for minors at 18 years, effectively closing the legal gap on the protection of children between ages 16 and 18 from sexual abuse and child marriages.\n\nShe said the Commission also welcomes the abolishment of the Death Penalty Act, as it seeks to preserve the sanctity of life.\n\nIn this regard, Zimbabwe did better than countries that are party to the ICCPR Second Optional Protocol on the death penalty, Commissioner Majome said.\n\nShe commended the passing of the Prisons and Correctional Service Act saying it aligns with the Constitution of Zimbabwe and other regional and international instruments on the humane treatment of prisoners.\n\nWhile celebrating the progress made in promoting human rights, Commissioner Majome urged the Government to fulfill some of its obligations under several outstanding treaties, including the United Nations Convention Against Torture (UNCAT), which aims to prevent torture and other cruel, inhumane, or degrading treatment or punishment.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/05/Zimbabwe-Human-Rights-Commission-ZHRC.jpg",
            "description": "The Zimbabwe Human Rights Commission (ZHRC) chairperson, Commissioner Jessie Majome, has expressed satisfaction with the Government’s commitment to upholding the International Covenant on Civil and Political Rights (ICCPR).",
            "time": "18:41",
            "date": "07 Mar 2025"
        },
        {
            "title": "Zimpapers donates US$27 000 for cancer awareness",
            "url": "https://www.herald.co.zw/zimpapers-donates-us27-000-for-cancer-awareness/",
            "content": "Online Reporter\n\nZimpapers has handed over a US$27,000 donation to Island Hospice and Healthcare in support of cancer awareness and patient care.\n\nSpeaking on behalf of Zimpapers acting chief executive officer, Mr William Chikoto, chief technology officer Mr Gorden Mwerenga acknowledged the vital role played by sponsors in raising cancer awareness.\n\nEveryones participation over the years has made the Cancer Power Walk a memorable event, he said.\n\nAmbassador Getrude Takawira, board chair of Island Hospice and Healthcare applauded Zimpapers for supporting cancer patients.\n\nPatients with physical, spiritual and emotional needs get support through sponsorship, doctors, and social workers, she said.\n\nWe are grateful for this great gesture. As Island Hospice and Healthcare, we will always be grateful to those helping us in combating cancer. This helps us keep our long-lasting partnership.\n\nMr Roy Nyakunuwa, a representative from FBC Holdings, reaffirmed the banks commitment to supporting the fight against cancer through the Zimpapers Cancer Power Walk.\n\nAs a Platinum sponsor of the 2024 event, FBC Holdings pledged continued support for such initiatives, highlighting their role in promoting a healthy lifestyle.\n\nMeanwhile, Ms Penelope Mutumba, a participant in the Cancer Power Walk, shared her appreciation for the events impact.\n\nShe commended Zimpapers for spearheading the initiative, which raises funds to assist cancer patients.\n\nMs Mutumba also credited the walk for contributing to her improved health, adding that she will always be grateful for the programme.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/10/Cancer-Power-Walk.jpg",
            "description": "Zimpapers has handed over a US$27,000 donation to Island Hospice and Healthcare in support of cancer awareness and patient care.",
            "time": "18:41",
            "date": "07 Mar 2025"
        },
        {
            "title": "Harare residents urged to help combat illegal dumping of garbage",
            "url": "https://www.herald.co.zw/harare-residents-urged-to-help-combat-illegal-dumping-of-garbage/",
            "content": "Anesu January\n\nHerald Correspondent\n\nThe City of Harare has urged residents to deposit garbage at designated points following reports of illegal dumping in residential areas.\n\nIn a public notice, the City of Harare said they have noted a trend of private garbage collectors dumping waste in residential areas.\n\nThe council has requested residents to report illegal dumping and provide information on the culprits.\n\nPlease help us apprehend them and give us information on the culprits so that they are arrested, reads the statement.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Harare-City.jpg",
            "description": "The City of Harare has urged residents to deposit garbage at designated points following reports of illegal dumping in residential areas.",
            "time": "18:41",
            "date": "07 Mar 2025"
        },
        {
            "title": "Commissions unite for national clean-up initiative",
            "url": "https://www.herald.co.zw/commissions-unite-for-national-clean-up-initiative/",
            "content": "Trust Freddy\n\nHerald Correspondent\n\nEight years after the Presidents declaration, the National Environment Clean-up Day initiative is still going strong, with the Zimbabwe Anti-Corruption Commission (ZACC), the Zimbabwe Media Commission (ZMC), the Zimbabwe Gender\n\nCommission, and the Zimbabwe Human Rights Commission participating in a clean-up campaign today.\n\nOn December 5, 2018, the President declared the first Friday of every month as a national clean-up day.\n\nSpeaking on the sidelines of the campaign, ZACC chairperson Mr Michael Reza said: Cleanliness is next to godliness. Therefore, we must maintain cleanliness in our surroundings. We must ensure that our workplaces and public areas are clean and well-maintained.\n\nZMC chairperson Professor Ruby Magosvongwe said: This is just an extension of the recognition of the Presidents call. I hope that each one of us has already cleaned up their offices, their work environment, and is also abstaining from contaminating the beauty within them, because what is happening outside may not necessarily be reflective of whats going on inside.\n\nThe team began the clean-up at a fuel station located on Sam Nujoma Street in Harare and proceeded to Herbert Chitepo Avenue, where they cleaned the area surrounding Harare Gardens and the ZACC offices.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/8db06acc-aa6f-4049-8dce-273cba064804-680x380.jpeg",
            "description": "Eight years after the President's declaration, the National Environment Clean-up Day initiative is still going strong, with the Zimbabwe Anti-Corruption Commission (ZACC), the Zimbabwe Media Commission (ZMC), the Zimbabwe Gender",
            "time": "18:41",
            "date": "07 Mar 2025"
        },
        {
            "title": "Mash West Minister tours Norton’s flooded areas",
            "url": "https://www.herald.co.zw/mash-west-minister-tours-nortons-flooded-areas/",
            "content": "Diana Nherera\n\nFollowing the flash floods that hit parts of Norton recently, Mashonaland West Provincial Affairs and Devolution Minister Marian Chombo toured Ward 13 today.\n\nNorton Town Council acting public relations officer, Mr Leeroy Kaponda said Minister Chombo noted that both the council and Government need to come in promptly to assist.\n\nMinister Chombo said the affected houses are now inhabitable, adding that the council should engage the Civil Protection Authority for assistance. The community services should also come in, said Mr Kaponda.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/4069d4eb-4127-4563-9082-f992fa4cfc87-680x380.jpeg",
            "description": "Following the flash floods that hit parts of Norton recently, Mashonaland West Provincial Affairs and Devolution Minister Marian Chombo toured Ward 13 today.",
            "time": "18:41",
            "date": "07 Mar 2025"
        },
        {
            "title": "Police investigate fatal shooting of Detective in Bulawayo",
            "url": "https://www.herald.co.zw/police-investigate-fatal-shooting-of-detective-in-bulawayo/",
            "content": "Online Reporter\n\nTHE Zimbabwe Republic Police (ZRP) has launched an investigation into the tragic death of Detective Constable Cassandra Hove of CID Homicide Bulawayo, who was fatally shot on Thursday while pursuing armed robbery suspects.\n\nNational police spokesperson, Commissioner Paul Nyathi said the shooting occurred in the Harbek area of Pumula South, Bulawayo.\n\nThe Zimbabwe Republic Police confirms that investigations are being conducted in connection with the tragic and unfortunate death of Detective Constable Cassandra Hove of CID Homicide Bulawayo on the 6th of March, 2025, while pursuing armed robbery suspects, he said.\n\nThe Commissioner-General of Police Stephen Mutamba expresses condolences to the Hove family and assures the public that comprehensive investigations are underway with a view of establishing what transpired.\n\nMeanwhile, the police reiterated their commitment to fighting violent crime.\n\nThe Zimbabwe Republic Police reiterates that there is no going back in the fight against armed robberies and other violent crimes in the country, said Commissioner Nyathi.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/06/zrp-329.jpg",
            "description": "THE Zimbabwe Republic Police (ZRP) has launched an investigation into the tragic death of Detective Constable Cassandra Hove of CID Homicide Bulawayo, who was fatally shot on Thursday while pursuing armed robbery suspects.",
            "time": "18:41",
            "date": "07 Mar 2025"
        }
    ]
}