{
    "news": [
        {
            "title": "Live Coverage : President Mnangagwa in Botswana to meet SADC secretariat",
            "url": "https://www.herald.co.zw/live-coverage-president-mnangagwa-in-botswana-to-meet-sadc-secretariat/",
            "content": "10.30 President Mnangagwa has arrived in Botswana for his maiden visit to the SADC Secretariat Headquarters as Chairman of the regional bloc.\n\nHe was welcomed by Botswana Minister of Foreign Affairs Phenyo Butale, Botswana Ambassador to Zimbabwe Ms Sarah Molosiwa and Zimbabwean Ambassador to Botswana Henry Mukonoweshuro.\n\n10.33 During his tenure, the President will push the realisation of the SADC Regional Indicative Strategic Development Plan (RISDP 2020-2030) and SADC Vision 2050.\n\nThe two strategic plans seek to further deepen Southern Africas regional integration and foster development.\n\nThey are premised on three interrelated pillars; Industrial Development and Market Integration; Infrastructure Development in support of Regional Integration; and Social and Human Capital Development.\n\n10.37 The President was also welcomed by a military guard of honour under a cloudy sky. He is now proceeding for a briefing at a local hotel before the commencement of his itinerary which will see him meeting the SADC Secretariate management and staff. As Chair, the President will also be handed over the recently acquired SADC Secretariat Headquarters building before presiding over a ground-breaking ceremony of the SADC Regional Logistics Depot.\n\n10.53 During their tenure, SADC Chairpersons traditionally visit the Secretariat to engage with management and address staff, as well as get an appreciation of day to day operations.Accompanying President Mnangagwa during his itinerary will be Botswanas President Duma Gideon Boko, as the host leader.\n\n10.56 What SADC Chairpersons do on maiden SADC Secretariat visit\n\n Welcomed at SADC House by Executive Secretary Mr Elias Magosi, supported by the SADC Secretariat Management and the SADC Ambassadors and High Commissioners accredited to the Republic of Botswana and SADC\n\n ushered by the SADC Executive Secretary to sign the guest book\n\n ushered to the Julius Nyerere SADC Library to appreciate the SADC History Collection\n\n Photo Session in the SADC Secretariat reception area with SADC Ambassadors based in the Republic of Botswana\n\n SADC Chair Unveils the Visiting Placard\n\n Photo Session in front of the SADC Secretariat building\n\n SADC Chair and Chairperson of the Council of Ministers meet with regional blocs Management team\n\n Briefing on the mandate, functions and structure of the SADC Secretariat\n\n Briefing on Priorities of SADC, and Overall Status of Regional Integration in SADC\n\n SADC Chair gives reaction and guidance\n\n meeting with all SADC Secretariat Staff\n\n11.33 President Mnangagwa has begun the tour\n\n12.15 The SADC Chair is now in a meeting with the Secretariat management.\n\nIn the meeting, Mr Magosi will give introductory remarks and thereafter, a video on the SADC Vision and RISDP 2020-2030 priority areas will be played.\n\nDeputy Executive Secretary Dr Judith Kateera will then give a briefing on the mandate, functions and structure of the SADC Secretariat.\n\nAt the end of the meeting the President will give a reaction and proffer guidance on the way forward\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/img-ed-1-680x380.jpeg",
            "description": "10.30 – President Mnangagwa has arrived in Botswana for his maiden visit to the SADC Secretariat Headquarters as Chairman of the regional bloc. He was welcomed by Botswana Minister of Foreign Affairs Phenyo Butale, Botswana Ambassador to Zimbabwe Ms Sarah Molosiwa and Zimbabwean Ambassador to Botswana Henry Mukonoweshuro. 10.33 – During his tenure, the President will push […]",
            "time": "2024-12-13 13:06:04"
        },
        {
            "title": "12 Harare bottle stores fined US$300 each for operating beyond 8pm",
            "url": "https://www.herald.co.zw/12-harare-bottle-stores-fined-us300-each-for-operating-beyond-8pm/",
            "content": "Trust Freddy\n\nHerald Correspondent\n\nHarare City Council last night fined 12 bottle store operators in the central business district a total of US$3,600 for violating operating hours.\n\nEach of the 12 liquor stores was fined US$300 after municipal officers caught them operating beyond the stipulated 8pm closing time.\n\nThe surprise operation came in response to widespread complaints from residents who have grown tired of bottle stores in the CBD flouting their licenses and operating until midnight.\n\nHarare City spokesperson Mr Stanley Gama said the operation will continue until order is restored.\n\nDue to concerns raised by residents, the City of Harare launched a blitz yesterday evening, resulting in 12 bottle stores being fined US$300 each for operating beyond 8pm.\n\nWe will not tolerate lawlessness, bottle store owners must respect both the countrys laws and the citys by-laws.\n\nMr Gama also said the council will revoke licenses for all errant bottle stores.\n\nThey are slowly turning the city centre into a jungle, and we will not allow that to happen. If they do not comply with the laws, we will revoke their licenses.\n\nSome of them are under investigation regarding how they got their trading licenses. We have listened to residents complaints about the proliferation of bottle stores in the CBD. Some of them are operating illegally, and we will put a stop to this, said Mr Gama.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/HRE-BOTTLE-STORE-680x380.png",
            "description": "Trust Freddy Herald Correspondent Harare City Council last night fined 12 bottle store operators in the central business district a total of US$3,600 for violating operating hours. Each of the 12 liquor stores was fined US$300 after municipal officers caught them operating beyond the stipulated 8pm closing time. The surprise operation came in response to […]",
            "time": "2024-12-13 13:06:04"
        },
        {
            "title": "New CAES secretary appointed to drive strategic initiatives",
            "url": "https://www.herald.co.zw/new-caes-secretary-appointed-to-drive-strategic-initiatives/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nCitizens Against Economic Sanctions (CAES) Zimbabwe has appointed Mr Gift Konjane as its new national secretary of strategy and implementation.The move aims to bolster the organisations efforts to alleviate the impact of economic sanctions on Zimbabwe.\n\nMr Konjane, a seasoned political figure, brings a wealth of experience and leadership skills to this critical role.\n\nHis appointment is effective immediately.\n\nWe are thrilled to welcome Mr Konjane to our team, said Mr Martin Zharare, executive director of CAES Zimbabwe.\n\nHis expertise and dedication will be instrumental in driving our organizations strategic goals and ensuring effective implementation of our initiatives.\n\nIn his new position, Mr Konjane will be responsible for overseeing key areas, including strategic planning, policy implementation and stakeholder engagement.\n\nMr Konjanes appointment signifies our commitment to building a better Zimbabwe through thoughtful strategy and collaboration, Mr Zharare said.\n\nHis leadership will be crucial as we navigate the complex challenges facing our nation.\n\nCAES Zimbabwe remains dedicated to advocating for the lifting of economic sanctions and promoting sustainable development in Zimbabwe.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/logo.jpg",
            "description": "Ivan Zhakata Herald Correspondent Citizens Against Economic Sanctions (CAES) Zimbabwe has appointed Mr Gift Konjane as its new national secretary of strategy and implementation. The move aims to bolster the organisation’s efforts to alleviate the impact of economic sanctions on Zimbabwe. Mr Konjane, a seasoned political figure, brings a wealth of experience and leadership skills […]",
            "time": "2024-12-13 13:06:04"
        },
        {
            "title": "Passengers Association of Zimbabwe calls for urgent action as stationary trucks pose deadly threat",
            "url": "https://www.herald.co.zw/passengers-association-of-zimbabwe-calls-for-urgent-action-as-stationary-trucks-pose-deadly-threat/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nThe alarming rise in road accidents caused by stationary trucks has sparked concern from the Passengers Association of Zimbabwe (PAZ), which is calling for urgent measures to address the growing danger to road users.\n\nPAZ national coordinator Mr Tafadzwa Goliati said the situation is dire.\n\nThe number of accidents involving stationary trucks is deeply troubling, he said. These vehicles often lack proper warning signs, leaving drivers with little time to react. It is a tragedy that is entirely preventable.\n\nData from the Zimbabwe Republic Police reveals that between January and September 2023, the country recorded 38 482 road accidentsan average of 141 per day. These incidents claimed 1 545 lives and injured 7 294 people.\n\nThe numbers speak for itself, Mr Goliati said. Every accident is not just a statistic, its a family torn apart. We need to act decisively to stop this carnage.\n\nPAZ has proposed a series of measures aimed at reducing accidents caused by broken-down vehicles, including vehicle maintenance, driver training, and public awareness campaigns.\n\nTruck owners and drivers have been urged to prioritise the safety of other road users.\n\nIt is their responsibility to ensure their vehicles do not endanger lives, said Mr Goliati. Broken-down vehicles left on the road without adequate warnings are death traps.\n\nHe noted that addressing the crisis requires collaboration between the Government, road authorities, and the public.\n\nWe cannot afford to wait while lives are lost. If everyone plays their part, we can make our roads safer for all.\n\nAs Zimbabwes vehicle population continues to grow  reaching 1.47 million registered vehicles by December 2022  experts warn that without urgent action, the risk of road accidents will only escalate.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Tafadzwa-Goliati.gif",
            "description": "Ivan Zhakata Herald Correspondent The alarming rise in road accidents caused by stationary trucks has sparked concern from the Passengers Association of Zimbabwe (PAZ), which is calling for urgent measures to address the growing danger to road users. PAZ national coordinator Mr Tafadzwa Goliati said the situation is dire. “The number of accidents involving stationary […]",
            "time": "2024-12-13 13:06:04"
        },
        {
            "title": "President Mnangagwa in Botswana to meet SADC secretariat",
            "url": "https://www.herald.co.zw/president-mnangagwa-in-botswana-to-meet-sadc-secretariat/",
            "content": "Wallace Ruzvidzo\n\nPresident Mnangagwa has arrived in Botswana for his maiden visit to the SADC Secretariat headquarters as chairman of the regional bloc.\n\nHe was welcomed by Botswana Minister of Foreign Affairs Phenyo Butale, Botswana Ambassador to Zimbabwe Ms Sarah Molosiwa and Zimbabwean Ambassador to Botswana Henry Mukonoweshuro.\n\nThe President was also welcomed by a military guard of honour.\n\nSADC chairperson, President Mnangagwa arrives in Botswana , this morning for the SADC secretariat Headquarters visit.  Picture by: Presidential photographer Tawanda Mudimu\n\nHe is now proceeding for a briefing at a local hotel before the commencement of his itinerary which will see him meeting the SADC secretariat management and staff.\n\nAs chair, the President will also be handed over the recently acquired SADC Secretariat Headquarters building before presiding over a ground-breaking ceremony of the SADC Regional Logistics Depot.\n\nDuring his tenure, the President will push the realisation of the SADC Regional Indicative Strategic Development Plan (RISDP 2020-2030) and SADC Vision 2050.\n\nThe two strategic plans seek to further deepen Southern Africas regional integration and foster development.\n\nThey are premised on three interrelated pillars  industrial development and market integration; infrastructure development in support of regional integration; and social and human capital development.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/cc34b3bc-1de6-4510-8e3c-58d17e5f4745-680x380.jpeg",
            "description": "Wallace Ruzvidzo President Mnangagwa has arrived in Botswana for his maiden visit to the SADC Secretariat headquarters as chairman of the regional bloc. He was welcomed by Botswana Minister of Foreign Affairs Phenyo Butale, Botswana Ambassador to Zimbabwe Ms Sarah Molosiwa and Zimbabwean Ambassador to Botswana Henry Mukonoweshuro. The President was also welcomed by a […]",
            "time": "2024-12-13 13:06:04"
        },
        {
            "title": "Acting President Chiwenga attends hero Mphoko’s send-off ceremony",
            "url": "https://www.herald.co.zw/acting-president-chiwenga-attends-hero-mphokos-send-off-ceremony/",
            "content": "Online Reporter\n\nActing President Dr Constantino Chiwenga, service chiefs and senior Government officials are gathered at the Charles Gumbo Barracks for a send-off ceremony of the national hero former Vice President Phekezela Mphoko.\n\nCde Mphoko died in India last week at the age of 84.\n\nHe was declared a national hero in recognition of his contributions before and after independence.\n\nCde Mphokos body arrived in Harare yesterday accompanied by his wife Laurinda, children and other family members.\n\nIn an interview yesterday evening, chief director in the Ministry of Home Affairs and Cultural Heritage Mr Mike Masaka said the body of the national hero will be flown to Bulawayo today (Friday).\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/live.jpg-vp.jpg",
            "description": "Online Reporter Acting President Dr Constantino Chiwenga, service chiefs and senior Government officials are gathered at the Charles Gumbo Barracks for a send-off ceremony of the national hero former Vice President Phekezela Mphoko. Cde Mphoko died in India last week at the age of 84. He was declared a national hero in recognition of his […]",
            "time": "2024-12-13 13:06:04"
        },
        {
            "title": "Chirimanzu man rapes 11-year-old niece",
            "url": "https://www.herald.co.zw/chirimanzu-man-rapes-11-year-old-niece/",
            "content": "Midlands Bureau\n\nA 21-year-old man from Chirumhanzu has been sentenced to 15 years in prison for raping his 11-year-old niece.\n\nThe complainant is in Grade Four.\n\nTalkmore Nago appeared before Gweru regional magistrate Mr Christopher Maturure yesterday.\n\nHe was facing one count of rape.\n\nNago was convicted on his own plea of guilty and received a 15-year prison sentence.\n\nIn passing the sentence, Mr Maturure said Nago took advantage of his close relationship with the minor (name withheld to protect her identity) and raped her.\n\nHe said Nago deserved a long custodial sentence to send a message to potential offenders that the court does not tolerate such crimes.\n\nProsecutor Mr Sibangani Dube said on an unknown date in April last year, the complainant was alone and sweeping inside the hut after her grandmother had gone to a funeral.\n\nMr Dube said Nago entered the hut and grabbed the complainant from behind.\n\nThe accused person removed the complainants pants. She began screaming and attempted to flee, but Nago overpowered her and gagged her mouth with his hand, Mr Dube said.\n\nThe accused person then pushed the complainant to the floor and raped her once.\n\nShe later disclosed the incident to her teacher following an awareness campaign on child sexual abuse, which led to the case being reported to the police and Nagos subsequent arrest.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/08/Court.jpg",
            "description": "Midlands Bureau A 21-year-old man from Chirumhanzu has been sentenced to 15 years in prison for raping his 11-year-old niece. The complainant is in Grade Four. Talkmore Nago appeared before Gweru regional magistrate Mr Christopher Maturure yesterday. He was facing one count of rape. Nago was convicted on his own plea of guilty and received […]",
            "time": "2024-12-13 13:06:04"
        },
        {
            "title": "‘Road infrastructure anchors integration’",
            "url": "https://www.herald.co.zw/road-infrastructure-anchors-integration/",
            "content": "Zvamaida Murwira in SHURUGWI\n\nZIMBABWE will continue to develop and upgrade road infrastructure as it is a key enabler for economic development and growth, not only for the country, but for the region and beyond, President Mnangagwa has said.\n\nHe made the remarks while addressing thousands of people gathered at Mkandapi Business Centre in Shurugwi District after commissioning a resurfaced 43-kilometre stretch of the Shurugwi-Mhandamabwe Highway.\n\nThe project is part of the Second Republics elaborate plans to stimulate economic growth anchored on infrastructural development.\n\nThe Government particularly wants to improve the countrys road network to enhance connectivity as envisaged in the National Development Strategy 1 (NDS1).\n\nAddressing a bumper crowd after unveiling a plaque at the nearby Chachacha Business Centre, the President said the project was part of the Governments development trajectory towards the attainment of Vision 2030.\n\nThe President addresses villagers at Mkandapi Business Centre after he commissioned the Shurugwi-Mhandamabwe Road project in Shurugwi, Midlands yesterday.Picture: Believe Nyakudjara.\n\nHe said Vision 2030 entailed the implementation of a harmonised regional strategy for road infrastructure development.\n\nThis project is part of Governments broader plan by the Second Republic aimed at attaining Vision 2030, which we should celebrate. The implementation of a harmonised regional strategy for road infrastructure in our region is not only for Zimbabwe, but for the region. We collaborate in many respects so that when our neighbours visit us, they should cherish what we are doing, said President Mnangagwa.\n\nHe commended the Ministry of Transport and Infrastructural Development led by Minister Felix Mhona for spearheading several road projects in the country.\n\nTodays event is impactful as we transform and upgrade our transport infrastructure which is a key enabler of our economic growth and development. I grew up in this area and in the 1940s and 1950s, we would travel long distances from here to Shurugwi and Gweru to sell sweet potatoes and other products with my mother. We would take the whole day travelling, but now because of modernisation, it is taking a few hours. This has all changed, President Mnangagwa said.\n\nHe urged ministries to continue pushing projects that have a national impact and also bear economic benefits.\n\nWe need to provide an efficient transport network which is essential for enabling people to exchange visits and access markets and also to promote regional and international integration. Zimbabwe cannot grow in isolation. The development of Zimbabwe is inter-related with the development of other countries in the region. Anychallenges that might affect one country in the region hurt other countries in the region, said President Mnangagwa.\n\nFor our country to develop we require robust infrastructure, planning and development, we need to develop the necessary domestic linkages. You must have a zeal to develop your own country. What determines the development of a country is its infrastructure, road network, schools and clinics that are adjacent to communities. You do not need to travel long distances to access social services such as education and health.\n\nHe commended Road Truckers Construction, the company that resurfaced Shurugwi Mhandamabwe Highway, for a job well done.\n\nPresident Mnangagwa and Vice President Constantino Chiwenga chat at the official opening of the Iron and Steel Indaba in Kwekwe yesterday.\n\nTurning to the countrys natural resources, President Mnangagwa said minerals must benefit the communities from which they are being extracted.\n\nWe also do not allow indiscriminate mining without due regard to the environment and land degradation, he said.\n\nOn agriculture, President Mnangagwa said farmers should continue preparing for the summer cropping season and assured villagers that the Government will continue providing seed inputs.\n\nHe also urged motorists not to drink and drive ahead of the festive season, calling on law enforcement agencies to apply the law firmly to ensure an accident-free holiday.\n\nTransport and Infrastructural Development Minister Felix Mhona commended President Mnangagwa for his leadership which he said had seen his Ministry registering several milestones in infrastructure development.\n\nYour wise leadership has registered wonders despite illegal sanctions that would have ordinarily affected the projects, he said.\n\nChief Secretary to the President and Cabinet Dr Martin Rushwaya (with neck-tie) and Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere (left)arrive for the official opening of the Iron and Steel Indaba in Kwekwe. yesterday\n\nMinister of State for Provincial Affairs and Devolution responsible for Midlands Province, Cde Owen Ncube, said the province has been a hub of development owing to the leadership of President Mnangagwa.\n\nThe Shurugwi-Mhandamabwe road is viewed as a catalyst for enhancing transport movement along the Southern corridor and has gone through a substantial transformation to improve border-to-border connectivity.\n\nIt primarily connects Beitbridge with other borders including Chirundu and Nyamapanda.\n\nThe event was attended by Cabinet Ministers, legislators, traditional leaders and senior Government officials.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/President-in-Chivi.jpg",
            "description": "Zvamaida Murwira in SHURUGWI ZIMBABWE will continue to develop and upgrade road infrastructure as it is a key enabler for economic development and growth, not only for the country, but for the region and beyond, President Mnangagwa has said. He made the remarks while addressing thousands of people gathered at Mkandapi Business Centre in Shurugwi […]",
            "time": "2024-12-13 13:06:04"
        },
        {
            "title": "Iron, steel sector key to economic revitalisation: President",
            "url": "https://www.herald.co.zw/iron-steel-sector-key-to-economic-revitalisation-president/",
            "content": "Patrick Chitumba and Freedom Mupanedemo\n\nPRESIDENT Mnangagwa has underscored the importance of the iron and steel industry in Zimbabwes economic revitalisation, highlighting its vast potential to transform, not only the countrys economy, but that of the entire SADC region.\n\nThe President said the industrys current state was worrisome, with Zimbabwe spending in excess of US$1 billion on importation of iron and steel.\n\nHe was speaking at a gathering to officially open the Iron and Steel Indaba which is underway at a hotel in Kwekwe.\n\nIn attendance were Vice President Constantino Chiwenga, Industry and Commerce Minister Mangaliso Ndlovu and other senior Government officials.\n\nIn attendance were Vice President Constantino Chiwenga, Industry and Commerce Minister Mangaliso Ndlovu and other senior Government officials.\n\nIt is my singular honour and privilege to officiate at this Iron and Steel Indaba here in Midlands Province, being hosted under the theme, Leveraging the Resurgence of Zimbabwes Iron and Steel Industry. As you are aware, the Engineering, Iron and Steel industry has always been a cornerstone of Zimbabwes industrial landscape. In the past this was through the operations of Ziscosteel, then the largest steelworks in Zimbabwe, he said.\n\nPresident Mnangagwa said the sector holds immense multiplier effects in promoting value addition and beneficiation by leveraging the countrys expansive mineral resources, such as iron ore and chrome, among others.\n\nIn light of this, the resurgence of this sector is of urgent necessity. This Indaba is, therefore, taking place at an opportune time. It is in line with our vision to ultimately establish a robust and sustainable iron and steel industry that meets domestic demand, while also positioning Zimbabwe as a regional manufacturing hub, he said.\n\nThe President added that the recent operationalisation of the Dinson Iron and Steel Company in Manhize, Mvuma, has significantly increased the prospects of the sector.\n\nThe investment by Tsingshan Group, which is the largest steel giant in Sub-Saharan Africa, and the 6th leader in the world, is a show of confidence, by one of the global industry leaders, in our iron and steel sub-sector, he said.\n\nThe iron and steel value chains, the President added, are among key sectors identified to accelerate the transformation and growth of the manufacturing sector.\n\nThrough the requisite policy mix, our manufacturing has been on the rebound. Capacity utilisation increased from an average of 36.4 percent in 2019 to 53.2 percent in 2023, while capital investments in the sector amounted to US$747 million over the past three years. Shelf occupancy of locally produced goods rose from about 64 percent to 80 percent in 2019 and 2023, respectively, he said.\n\nFurthermore, President Mnangagwa said, the manufacturing sectors contribution to overall national employment remains on a positive growth trajectory from 7.5 percent in 2019 to 9.7 percent in 2023.\n\nHe said the vast natural resources and a youthful population should be continuously harnessed for sustainable industrial transformation in the country.\n\nIt is a misnomer that we continue to lose millions every year on the importation of iron and steel and other related products. This is despite the numerous investments within our manufacturing sector. It is against this background that the Second Republic resolved to facilitate a vibrant, dynamic and competitive industrial base, driven by smart and strategic value-chain linkages. We are fostering structural transformation of our economy by putting in place deliberate and systematic measures to graduate from being resource-driven to a knowledge-based economy. This will be achieved through incremental step-by-step, brick-upon-brick, and stone-upon-stone processes, President Mnangagwa said.\n\nThe Iron and Steel indaba is thus expected to speed up the realisation of targets in the critical mining sector and the economy as a whole, towards Vision 2030.\n\nHe said the Indaba is taking place after the Government, through Treasury, recently presented an elaborate 2025 National Budget, which is both citizen and pro-business-centric.\n\nFrom a regional perspective, Zimbabwe, as the current chair of SADC, has the opportunity to drive both the national and regional industrialisation agenda.\n\nFurther, the present round of the Industrial Revolution is moving at a heightenedpace, characterised by increased digitalisation, artificial intelligence and innovation. These are in-turn transitioning traditional modes of production as well as broadening the range of products required by the markets, said President Mnangagwa.\n\nI, thus, challenge stakeholders in this sector to take leadership and implement forward-looking business models which impact beyond our borders and the continent. Zimbabwe and the SADC region are part of the global village and should not be left behind.\n\nHe said the domestication of the value chains and value addition must be expedited, adding that the sector is integral for the resuscitation and modernisation of the national railway network, as well as foundry and fabrication of industrial equipment for the transport and energy sectors, among others.\n\nIn the agriculture sector, President Mnangagwa said iron and steel products are essential to counter the dire consequences of climate change through expanding the countrys irrigation infrastructure to build resilience, while also securing farm land through appropriate boundary fences.\n\nSimilarly, our construction sector, other infrastructure such as dams, modern roads and bridges, among other upstream, downstream and main-stream products, all depend on the viability of this sector. Great is the task before you, hence the need to have unity of purpose and collaboration. This Indaba should merely be the first step. The sector cannot afford to work in silos but must be complementary in approach, leveraging on the various technical resources and skills that reside within different entities in the industry, he said.\n\nPresident Mnangagwa said to scale up efforts in this regard, it is critically important that the strategies to resuscitate and grow the sector are holistic, well-co-ordinated and focused on the overall national good.\n\nThe President, who later in the day commissioned the Shurugwi-Mhandamahwe road, said other national development projects such as the Gwayi-Shangani Dam in Matabeleland North, and Tugwi Mukosi Dam among others, are important for the realisation of national targets.\n\nHe said energy projects like the new 720 MW power plant under construction in the Hwange area, will aid the drive for a robust and growing iron and steel sector anchored on broader value chains.\n\nA skilled workforce equipped with modern technical expertise is an integral component for sustaining innovation, productivity and growth of the iron and steel industry. Hence, investments in human capital development are essential, as well as partnerships between industry players and academia, said President Mnangagwa.\n\nHe said the Indaba is taking place after the Government, through Treasury, recently presented an elaborate 2025 National Budget, which is both citizen and pro-business-centric.\n\nIt is my sincere hope that as businesses, you will capitalise on the wide spectrum of both fiscal and non-fiscal incentives availed for sustainable economic development. As we engage and deliberate throughout this Indaba, it is critically important that we collectively find lasting solutions to resuscitate and grow the iron and steel sector. The generality of our population counts on our unity of purpose to deliver a prosperous economy, sector by sector, President Mnangagwa said.\n\nAddressing the same gathering, VP Chiwenga said the entry of Dinson Iron and Steel into Zimbabwe was a game-changer which will see the country becoming one of the major producers of iron and steel products.\n\nHe said it was through President Mnangagwas engagement and re-engagement drive that Dinson invested in the country.\n\nIt is through your engagement and re-engagement efforts, Your Excellency, that Dinson Iron and Steel Company in Manhize, Mvuma set up a billion-dollar plant which will result in the country becoming a major player in the iron and steel industry in Africa, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/4-680x380.jpeg",
            "description": "Patrick Chitumba and Freedom Mupanedemo PRESIDENT Mnangagwa has underscored the importance of the iron and steel industry in Zimbabwe’s economic revitalisation, highlighting its vast potential to transform, not only the country’s economy, but that of the entire SADC region. The President said the industry’s current state was worrisome, with Zimbabwe spending in excess of US$1 […]",
            "time": "2024-12-13 13:06:04"
        },
        {
            "title": "Exposed: Secret perks for council bigwigs",
            "url": "https://www.herald.co.zw/exposed-secret-perks-for-council-bigwigs/",
            "content": "Trust Freddy-Herald Correspondent\n\nTop officials at Harare City Council have been accused of a scandalous cover-up of their huge salaries and benefits at a time when service delivery is woefully lacking.\n\nThe allegations were made by Ms Princess Mahari, managing director, and Mr Mike Jasi, technical operations officer of Groupview Technologies  a local partner of South African developer Quill Associates when they testified before the Harare City Council Commission of Inquiry.\n\nQuill Associates used to supply the Enterprise Resource Planning (ERP) system, including billing for the council.\n\nThe revelations painted a picture of gross irregularities, maladministration and negligence within the citys financial operations.\n\nMs Mahari told the commission that senior council officials were unwilling to integrate their own payrolls into the ERP.\n\nThis has created fertile ground for fraud, as certain salary payments can be easily manipulated. We found ourselves in constant conflict with city officials who refused to adhere tobasic accounting principles.\n\nMs Mahari disclosed that the officials also obstructed the integration of financial records from major subsidiaries, including City Park, Rufaro Marketing, and Harare Quarry.\n\nPrior to the discontinuation of the ERP, we submitted crucial reports highlighting deficiencies in the system. Yet, the city officials turned a blind eye, leaving us powerless to address the gaping holes in their financial controls, she said.\n\nMs Mahari said the exclusion of executive payrolls, coupled with poor financial practices, had fostered an environment ripe for fraud.\n\nThe two Groupview Technologies officials expressed concern that councils transactions could be slipping through the cracks, unrecorded and unaccounted for.\n\nThey pointed out that the lack of bank reconciliation left room for fraudulent activities.\n\nMr Jasi pointed out the dire consequences of the citys refusal to fully utilise the ERP system, claiming it created a loophole for corruption.\n\nRevenue generation is the lifeblood of the councils operations. Yet, management has consistently delayed critical integrationsputting finances at risk and leaving us vulnerable to fraud!\n\nMr Jasi revealed that the citys repeated audit disclaimers had tarnished its reputation, casting doubt over its financial integrity.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2018/03/Town-House.jpg",
            "description": "Trust Freddy-Herald Correspondent Top officials at Harare City Council have been accused of a scandalous cover-up of their huge salaries and benefits at a time when service delivery is woefully lacking. The allegations were made by Ms Princess Mahari, managing director, and Mr Mike Jasi, technical operations officer of Groupview Technologies — a local partner […]",
            "time": "2024-12-13 13:06:04"
        }
    ]
}