{
    "news": [
        {
            "title": "Minister Garwe commissions Zvimba RDC equipment, motorbikes",
            "url": "https://www.herald.co.zw/minister-garwe-commissions-zvimba-rdc-equipment-motorbikes/",
            "content": "Conrad Mupesa\n\nMashonaland West Bureau\n\nLocal Government and Public Works Minister Daniel Garwe has commissioned Zvimba Rural District Councils equipment, vehicles and motorbikes that were purchased using devolution and internally generated funds.\n\nSpeaking today at the official commissioning of the equipment, including a grader, a firetender truck, a borehole drilling rig, services vehicles and motorbikes at the councils headquarters in Murombedzi, Minister Daniel Garwe said the council should play a part in the implementation of National Development Strategy 1(NDS-1).\n\nThe minister also toured newly constructed state-of-the-art offices that the council built from devolution funds.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/WhatsApp-Image-2024-12-19-at-15.48.16-1-680x380.jpeg",
            "description": "Conrad Mupesa Mashonaland West Bureau Local Government and Public Works Minister Daniel Garwe has commissioned Zvimba Rural District Council’s equipment, vehicles and motorbikes that were purchased using devolution and internally generated funds. Speaking today at the official commissioning of the equipment, including a grader, a firetender truck, a borehole drilling rig, services vehicles and motorbikes […]",
            "time": "21:06",
            "date": "19 Dec 2024"
        },
        {
            "title": "‘Munhumutapa’ remanded in custody",
            "url": "https://www.herald.co.zw/munhumutapa-remanded-in-custody/",
            "content": "Yeukai Karengezeka\n\nCourt Correspondent\n\nA Harare man claiming to be Chief Munhumutapa yesterday appeared in court facing charges of undermining the authority of the President.\n\nTimothy Chiminya of Stoneridge, Waterfalls, claims that he has the authority to appoint and dethrone traditional chiefs in Zimbabwe.\n\nChiminya was brought before Harare Magistrate Mr Isheanesu Matova.\n\nHe was remanded in custody to January 7.\n\nThe charges against Chiminya were filed by the Ministry of Local Government and Public Works, represented by Mr Felix Alexander Chikovo, who is Chief Director in the Department of Traditional Leadership Support Services.\n\nProsecutor Mr Takudzwa Jambawu told the court that Chiminya says he was appointed as King Munhumutapa by a spirit medium.\n\nAccording to Chiminya, this gave him the authority to install and dethrone chiefs.\n\nThe court heard that in February 2024, Chiminya visited Chief Sekes homestead and met Mr Stanley Chimanike, the legally appointed Chief Seke.\n\nChiminya reportedly informed Mr Chimanike that he had been dethroned and had been replaced by Masimba Rubatika, whom Chiminya claimed he had have appointed as the new chief.\n\nOn June 11, 2024, Mr Chimanike informed the Ministry of Local Government and Public Works, which oversees the administration of the Traditional Leaders Act, of Chiminyas actions.\n\nFurther allegations are that between June 11 and October 31, Chiminya went on to appoint three more chiefs in Chirumhanzu and Zaka.\n\nThese included Julius Chimbi as Chief Chigegwe, Hama Piki (Chirumhanzu), and Chief Nyakunhuwa (Zaka).\n\nThe court was told that all of Chiminyas appointments were in direct violation of the Constitution of Zimbabwe and the Traditional Leaders Act, which grants the President the sole authority to appoint chiefs.\n\nChiminyas actions reportedly caused confusion and disrupted the recognised structures of traditional leadership, creating parallel structures that undermined the legitimate authority established by the President.\n\nThe National Chiefs Council has since faced questions regarding the installation and service of chiefs due to Chiminyas purported appointments and dismissals.\n\nThe prosecution argued that Chiminyas actions ridiculed the Office of the President by attempting to usurp his executive powers.\n\nAmong the accusations is that Chiminya purported to fire chiefs who were lawfully appointed by the President, further disrupting traditional governance in Zimbabwe.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/courthammer-680x380.jpg",
            "description": "Yeukai Karengezeka Court Correspondent A Harare man claiming to be Chief Munhumutapa yesterday appeared in court facing charges of undermining the authority of the President. Timothy Chiminya of Stoneridge, Waterfalls, claims that he has the authority to appoint and dethrone traditional chiefs in Zimbabwe. Chiminya was brought before Harare Magistrate Mr Isheanesu Matova. He was […]",
            "time": "21:06",
            "date": "19 Dec 2024"
        },
        {
            "title": "Zvimba Rural District Council CEO reinstated",
            "url": "https://www.herald.co.zw/zvimba-rural-district-council-ceo-reinstated/",
            "content": "Conrad Mupesa\n\nMashonaland West Bureau\n\nThe chief executive officer of Zvimba Rural District Council (RDC) Enias Chidakwa who was last week suspended after appearing in court on allegations of using council fuel, drivers, vehicles and equipment to carry gravel and river sand to his house construction site has been reinstated.\n\nSpeaking at the commissioning of Zvimba RDC equipment and motorbikes this afternoon, Local Government and Public Works Minister Daniel Garwe said Mr Chidakwa had been reinstated.\n\nWe want you to work together and stop spreading flimsy charges against each other. If any of you has erred, correct each other before exposing yourselves to the public as sometimes we err unknowingly, he said.\n\nMr Chidakwa was facing criminal abuse of duty when he recently appeared before Harare magistrate Mrs Marehwanazvo Gofa.\n\nHe was released on US$200 bail.\n\nAs part as his bail conditions, Mr Chidakwa was ordered to report every Friday at the Zimbabwe Anti-Corruption Commission offices.\n\nHe was also ordered not to interfere with State witnesses and to continue residing at his given address.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/WhatsApp-Image-2024-12-19-at-15.48.16-680x380.jpeg",
            "description": "Conrad Mupesa Mashonaland West Bureau The chief executive officer of Zvimba Rural District Council (RDC) Enias Chidakwa who was last week suspended after appearing in court on allegations of using council fuel, drivers, vehicles and equipment to carry gravel and river sand to his house construction site has been reinstated. Speaking at the commissioning of […]",
            "time": "21:06",
            "date": "19 Dec 2024"
        },
        {
            "title": "Two dead, one injured in head on collision",
            "url": "https://www.herald.co.zw/two-dead-one-injured-in-head-on-collision/",
            "content": "Thupeyo Muleya\n\nBeitbridge Bureau\n\nTwo people were killed on Thursday morning when a Toyota Fortuner they were travelling in collided head on with a South Africa bound cross-border bus near Makhado Business Centre some 80 km west of Beitbridge town.\n\nThe incident occurred along the Beitbridge-Bulawayo Road when the driver of the bus hit a stray donkey and swerved into the lane of oncoming traffic, resulting in a collision with a car that was heading towards Gwanda.\n\nTwo people who were in the vehicle died on the spot while the driver of the bus escaped with some injuries.\n\nAlthough the police are yet to release full details of the incident, the District Medical Officer, Dr Lenos Samhere said they had received two bodies from the accident scene.\n\nWe received two bodies and the driver of the bus is admitted at the hospital, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Screenshot-21-680x380.png",
            "description": "Thupeyo Muleya Beitbridge Bureau Two people were killed on Thursday morning when a Toyota Fortuner they were travelling in collided head on with a South Africa bound cross-border bus near Makhado Business Centre some 80 km west of Beitbridge town. The incident occurred along the Beitbridge-Bulawayo Road when the driver of the bus hit a […]",
            "time": "21:06",
            "date": "19 Dec 2024"
        },
        {
            "title": "Minister Muswere commends Zimpapers for embarking on digital drive",
            "url": "https://www.herald.co.zw/minister-muswere-commends-zimpapers-for-embarking-on-digital-drive/",
            "content": "In his speech at the launch of the Zimpapers digital transformation drive in Harare this afternoon, the guest of honour Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere said the project underpins the role of the media as the country marches towards the attainment of Vision 2030.\n\nThe Minister said Zimpapers core business was previously centred on distributing media through the print media but thanked the Zimpapers board and management for embarking on the digital transformation drive that will see the company distributing its content via digital platforms.\n\nIt is high time that the media follows what the audience wants and I want to commend Zimpapers for embarking on the digital drive.\n\nDr Muswere explained that newspaper circulation is going down and therefore it is important for the media to embark on digital transformation.\n\nHe also called for a cultural shift on the part of the content creators in line with the digital audiences expectations.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Screenshot-20-680x380.png",
            "description": "In his speech at the launch of the Zimpapers digital transformation drive in Harare this afternoon, the guest of honour Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere said the project underpins the role of the media as the country marches towards the attainment of Vision 2030. The Minister said Zimpapers’ core business was […]",
            "time": "21:06",
            "date": "19 Dec 2024"
        },
        {
            "title": "Zim Cyber City unveils Africa’s first dancing musical fountain",
            "url": "https://www.herald.co.zw/zim-cyber-city-unveils-africas-first-dancing-musical-fountain/",
            "content": "Blessings Chidakwa\n\nHerald Reporter\n\nZim Cyber City is set to redefine entertainment and nightlife in Africa with the unveiling of its state-of-the-art dancing musical fountain, the first of its kind on the continent.\n\nSpanning an impressive 100 meters in length, this architectural marvel will captivate visitors with a mesmerising blend of water, light, and music.\n\nUAE billionaire and Zim Cyber City developer, Mr Shaji Ul Mulk said the fountain will feature 24 themed songs, synchronized with stunning lighting effects, creating a breathtaking spectacle that promises to dazzle audiences.\n\nMr Mulk said the development reflects the nations growing appeal as an investment-friendly destination and its dedication to building world-class infrastructure, which is in line with the Presidents mantra Zimbabwe is Open for Business.\n\nThe fountain area will also host premium restaurants and lounges, providing much-needed leisure for residents and visitors.\n\nThe dancing fountain marks a key highlight of the first phase of Zim Cyber City, which includes 50 luxury villas within a modern gated community, he said.\n\nMr Mulk said the development will feature uninterrupted power supply, top-notch security.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/WhatsApp-Image-2024-12-19-at-12.17.25-680x380.jpeg",
            "description": "Blessings Chidakwa Herald Reporter Zim Cyber City is set to redefine entertainment and nightlife in Africa with the unveiling of its state-of-the-art dancing musical fountain, the first of its kind on the continent. Spanning an impressive 100 meters in length, this architectural marvel will captivate visitors with a mesmerising blend of water, light, and music. […]",
            "time": "21:06",
            "date": "19 Dec 2024"
        },
        {
            "title": "Zimpapers launches digital drive",
            "url": "https://www.herald.co.zw/zimpapers-launches-digital-drive-2/",
            "content": "Online Reporter13.05 Zimpapers is launching its new innovations that include the Typocrafters Bookshop and Coffee Shop, as well as the organisations digital transformation drive at Herald House in Harare.\n\nThe Minister of Information, Publicity and Broadcasting Services Dr Jenfan Muswere is the guest of honour.In her welcome remarks, Zimpapers board chair Mrs Doreen Sibanda said the launch of the new projects is very important as they symbolise Zimpapers future direction in innovation and content creation.\n\n13.31  Zimpapers digital structure unveiled\n\nZimpapers deputy general manager responsible for digital, Mr Elias Mambo presented the structure of the new digital newsroom at the launch of the media organisations digital transformation drive in Harare this afternoon.\n\nMr Mambo said the new structure will enable the convergence of all news-gathering processes, which will enable the media giant to digitalise all its services.\n\n13.33 Typocrafters Bookshop promotes reading culture\n\nThe general manager of Zimpapers Typocrafters Mr Mutsauri gave a presentation on the structure of the book store.\n\nHe said that the book seller started as an exercise book manufacturer in Bulawayo but is now transforming into offering diverse services such as the bookstore and coffee shop.\n\nThe book store aims to promote the book industry, offer a launch pad for new books, and distribute the books.\n\nIt will also have a radio studio that will be used for podcasts and hiring out to those who might want to use it.\n\nMr Mutsauri also revealed that Typocrafters will be opening more book shops across the country in 2025.\n\nHe said the coffee shop, which will be under the same roof with the book store, will offer a refreshing place to relax and meet for short meetings.\n\n13.41 Minister Muswere commends Zimpapers for embarking on digital drive\n\nIn his speech at the launch of the Zimpapers digital transformation drive in Harare this afternoon, the guest of honour Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere said the project underpins the role of the media as the country marches towards the attainment of Vision 2030.\n\nThe Minister said Zimpapers core business was previously centred on distributing media through the print media but thanked the Zimpapers board and management for embarking on the digital transformation drive that will see the company distributing its content via digital platforms.\n\nIt is high time that the media follows what the audience wants and I want to commend Zimpapers for embarking on the digital drive.\n\nDr Muswere explained that newspaper circulation is going down and therefore it is important for the media to embark on digital transformation.\n\nHe also called for a cultural shift on the part of the content creators in line with the digital audiences expectations.\n\n13.53 Dr Machengete calls for provision of AI-enabled infrastructure\n\nIn his vote of thanks, Zimpapers board deputy chairperson Dr Gift Machengete thanked Minister Muswere for the direction he is giving in the industrys digital drive.\n\nHe said Zimpapers is already using Artificial Intelligence applications but requested the Minister to help in the provision of AI-enabled infrastructure for the total transformation of the media.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/d9f9eebb-764d-4702-a151-944a0968ffb0-680x380.jpeg",
            "description": "Online Reporter 13.05 – Zimpapers is launching its new innovations that include the Typocrafters Bookshop and Coffee Shop, as well as the organisation’s digital transformation drive at Herald House in Harare. The Minister of Information, Publicity and Broadcasting Services Dr Jenfan Muswere is the guest of honour. In her welcome remarks, Zimpapers board chair Mrs […]",
            "time": "21:06",
            "date": "19 Dec 2024"
        },
        {
            "title": "Zimpapers digital structure unveiled",
            "url": "https://www.herald.co.zw/zimpapers-digital-structure-unveiled/",
            "content": "Online Reporter\n\nZimpapers deputy general manager responsible for digital, Mr Elias Mambo presented the structure of the new digital newsroom at the launch of the media organisations digital transformation drive in Harare this afternoon.\n\nMr Mambo said the new structure will enable the convergence of all news-gathering processes, which will enable the media giant to digitalise all its services.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Screenshot-17-680x380.png",
            "description": "Online Reporter Zimpapers’ deputy general manager responsible for digital, Mr Elias Mambo presented the structure of the new digital newsroom at the launch of the media organisation’s digital transformation drive in Harare this afternoon. Mr Mambo said the new structure will enable the convergence of all news-gathering processes, which will enable the media giant to […]",
            "time": "21:06",
            "date": "19 Dec 2024"
        },
        {
            "title": "Zimpapers launches digital drive",
            "url": "https://www.herald.co.zw/zimpapers-launches-digital-drive/",
            "content": "Online Reporter\n\nZimpapers is launching its new innovations that include the Typocrafters Bookshop and Coffee Shop, as well as the organisations digital transformation drive at Herald House in Harare.\n\nThe Minister of Information, Publicity and Broadcasting Services Dr Jenfan Muswere is the guest of honour.\n\nIn her welcome remarks, Zimpapers board chair Mrs Doreen Sibanda said the launch of the new projects is very important as they symbolise Zimpapers future direction in innovation and content creation.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Dr-Muswere-Post-Cabinet-briefing.jpg",
            "description": "Online Reporter Zimpapers is launching its new innovations that include the Typocrafters Bookshop and Coffee Shop, as well as the organisation’s digital transformation drive at Herald House in Harare. The Minister of Information, Publicity and Broadcasting Services Dr Jenfan Muswere is the guest of honour. In her welcome remarks, Zimpapers board chair Mrs Doreen Sibanda […]",
            "time": "21:06",
            "date": "19 Dec 2024"
        },
        {
            "title": "Governance gurus rewarded",
            "url": "https://www.herald.co.zw/governance-gurus-rewarded/",
            "content": "Herald Reporter\n\nTHE Institute of Corporate Governance Zimbabwe (ICGZ) has hounored various corporate governance personnel at its prestigious Corporate Governance Awards held in Harare recently.\n\nThe awards reflect the importance of good corporate governance and environmental, social, and governance (ESG) reporting and practices for listed companies, large unlisted companies, and private and public sector entities.\n\nThe initiative motivate companies to achieve high standards of corporate governance and ESG, integrating oversight and implementation into their values, strategy, and yearly operations.\n\nOn the Governance Leader of the Year category, winners included Varaidzo Zifudzi who is the Chief Legal Officer and Company Secretary at Mutapa Investment Fund; Tichaona Mabeza, company secretary at FBC Bank Limited; and Tinashe Masiiwa, group general counsel at ZB Holdings.\n\nThe award recognised company secretaries who have mastered complex legal and regulatory environments, making a demonstrable difference.\n\nZifudzi appreciated the award, saying she was truly humbled to be recognised alongside a dignified group of leaders.\n\nThis award is a motivation to continue strengthening our governance practices and to serve with even greater diligence and integrity, she said.\n\nThe award reflects our unwavering dedication to ethical decision-making and sustainable practices. Good governance is the foundation upon which successful organisations are built, and I am privileged to be a part of this important work.\n\nZifudzi has held senior positions in both the public and private sectors, including deputy chairperson of the Competition and Tariff Commission.\n\nShe currently sits on several boards, including Kuvimba Mining House and the National Prosecuting Authority.\n\nOther awards given to various people included Company Secretary of the Year,General Counsel of the Year,Head Compliance of the Year,Head Legal of the Year, Head of Internal Audit, Excellence in Financial Oversight, Sustainability and Excellence Award, and Rising Star.\n\nCorporate awards included Best ESG Impact, Best Innovation in Governance, Best Use of Technology, Best Financial Governance, GRC Employer of the Year, Best Governance in Public Sector, Governance Team of the Year, and Board Diversity.\n\nICGZ saidthe awards continue to enjoy strong support from a wide range of stakeholders, including financial market investor groups, professional associations, firms, and the business community.Since their inception, the awards have played an important role in establishing benchmarks and encouraging improvements in standards of corporate governance among listed companies, the adjudication report reads in part.\n\nThey raise awareness of the need for companies to be transparent and accountable to their shareholders and other stakeholders and inform the wider community about corporate governance and sustainability.\n\nThe awards focused primarily on voluntary practices and disclosures beyond minimum legal and regulatory requirements, as reflected in annual reports and ESG reports\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Screenshot-16-680x380.png",
            "description": "Herald Reporter THE Institute of Corporate Governance Zimbabwe (ICGZ) has hounored various corporate governance personnel at its prestigious Corporate Governance Awards held in Harare recently. The awards reflect the importance of good corporate governance and environmental, social, and governance (ESG) reporting and practices for listed companies, large unlisted companies, and private and public sector entities. […]",
            "time": "21:06",
            "date": "19 Dec 2024"
        }
    ]
}