{
    "news": [
        {
            "title": "Sadc tackles DRC impasse",
            "url": "https://www.herald.co.zw/sadc-tackles-drc-impasse/",
            "content": "Rumbidzayi Zinyuke\n\nSenior Reporter\n\nSADC Heads of State and Government are set to meet in Harare today for an Extraordinary Summit to deliberate on the escalating security situation in the eastern part of the Democratic Republic of Congo (DRC).\n\nSADC Executive Secretary Mr Elias Magosi yesterday met President Mnangagwa at State House to brief him on the agenda of todays summit.\n\nAddressing journalists after the meeting, Mr Magosi expressed concern over the conflict in the DRC.\n\nWere paying a courtesy call on His Excellency as the chairperson of SADC.\n\nHe will be chairing the Extraordinary SADC meeting tomorrow (today) to discuss matters of Eastern DRC, which is a worrying situation. So, I was just briefing him on preparations for the meeting tomorrow and the agenda that will be covered, he said.\n\nAt this point, I can say its concerning (the conflict) because we have lost lives, certainly, and we feel that our troops should be protected. The Excellences will discuss the details and provide guidance at the end of the summit.\n\nThe Sadc Mission in the Democratic Republic of Congo (SAMIDRC) was deployed on December 15, 2023 to support the Government of the DRC to restore peace and security in eastern DRC, which has witnessed an increase in conflicts and instability caused by the resurgence of armed groups.\n\nThe summit comes after the Extraordinary Summit of the Sadc Organ Troika plus the DRC and Troop Contributing Countries (TCCs) to the SADC Mission in the DRC (SAMIDRC), which was held on January 28, chaired by Her Excellency Dr Samia Suluhu Hassan, the President of the United Republic of Tanzania and Chairperson of the Sadc Organ on Politics Defence and Security Cooperation.\n\nIt will be preceded by meetings of the Sadc Standing Committee of Senior Officials and the Sadc Council of Ministers.\n\nThe death toll from the combat between peacekeeping soldiers and M23 rebels in eastern Congo had reached 17 as of Tuesday.\n\nThis included 13 South African National Defence Force (SANDF) soldiers and others from Malawi and Uruguay deployed as part of the SADC regional force or under the UN mission in Congo (MONUSCO).\n\nM23 has rapidly advanced towards Goma, a city of over one million people, in the past few weeks.\n\nTo date, more than 400 000 people have been displaced in North and South Kivu, near the Rwandan border.\n\nThe East African Community (EAC) on Wednesday held an Extraordinary Summit to discuss the situation in the DRC following which the EAC Chairperson, President William Ruto of Kenya, said he would consult with the SADC Chairperson (President Mnangagwa) on the urgency of a joint summit.\n\nMr Magoso however, said no formal communication had been made by the EAC for the joint summit to be considered.\n\nUntil a formal communication comes our way, then we will consider that, and I believe, our leaders will make a determination on whether its something that can take root or not. At this point we dont have anything that is formal from the EAC, he said.\n\nThe summit will be preceded by the Extraordinary SADC Organ Troika Summit, which will be chaired by H.E Dr Hussein Ali Mwinyi, President of Zanzibar and chairman of the Revolutionary Council representing Her Excellency Dr Hassan.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/FEQWF-680x380.jpg",
            "description": "Rumbidzayi Zinyuke Senior Reporter SADC Heads of State and Government are set to meet in Harare today for an Extraordinary Summit to deliberate on the escalating security situation in the eastern part of the Democratic Republic of Congo (DRC). SADC Executive Secretary Mr Elias Magosi yesterday met President Mnangagwa at State House to brief him […]",
            "time": "08:26",
            "date": "31 Jan 2025"
        },
        {
            "title": "Economy gets boost from provincial projects",
            "url": "https://www.herald.co.zw/economy-gets-boost-from-provincial-projects/",
            "content": "Patrick Chitumba\n\nMidlands Bureau\n\nTHE Midlands Province is experiencing profound transformation, fuelled by innovative initiatives in mineral value addition and beneficiation, as well as flagship projects in line with human capital development championed by President Mnangagwa.\n\nThese strategic efforts are revitalising, not only the local economy, but that of the country at large, enhancing the quality of peoples lives in line with Vision 2030.\n\nThe province is witnessing a surge in socio-economic development, with focus on promoting broad-based support for programmes aimed at driving transformation.\n\nThis was revealed by Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere in Kwekwe yesterday.\n\nThe minister was in the mining town for a media tour of life-changing projects in the Midlands Province that came to light following the advent of the Second Republic led by President Mnangagwa in 2017.\n\nDr Muswere, who was accompanied by the Minister of State for Midlands Provincial Affairs and Devolution, Owen Ncube, toured the Amaveni Drug Rehabilitation Centre in Amaveni suburb.\n\nThe institution highlights the Governments focus on addressing social issues, such as drug rehabilitation.\n\nThe centre plays a vital role in supporting individuals struggling with addiction.\n\nThe minister toured Grain Marketing Board (GMB) silos to check on progress in the construction of seven new storage facilities which are crucial for the countrys food security.\n\nDr Muswere also visited the US$10 million Zhong Jin InternationalHotel which is a notable landmark in Kwekwe.\n\nHe said his visit is focusing on the hotels potential for promoting tourism and economic growth in the region.\n\nThe tour of projects in Kwekwe is in the form of a cycle. The first cycle is at the Midlands State University Emmerson Dambudzo Mnangagwa Law School which shows the cycle of human capital development in line with Vision 2030. The construction and resourcing of the Law School in Kwekwe District is part of the decentralisation and devolution of human capital development, Dr Muswere said.\n\nHe said smelters have been built in the province to accelerate the value-addition process of iron produced by companies like Dinson Manhize Steel Plant in Mvuma.\n\nThis is part of an ecosystem, an ecosystem that had been destroyed by the illegal sanctions imposed by imperialists and which are still in place. The Western capitals had totally targeted the engine of our economy because Zimbabwe took a strategic decision to redistribute land in order to correct the land imbalances brought about by the former colonisers. Because of that, a lot of pieces of legislation were put in place and some still exist. Extending targeted sanctions on the Head of State is a direct attack on the people of Zimbabwe,  Dr Muswere said.\n\nHe said the coming in of the Second Republic brought tangible gains as evidenced by investors flocking into the country.\n\nAll the value chains are undergoing great transformation under the leadership of President Mnangagwa.\n\nDr Muswere said the tour of Amaveni Drug Rehabilitation Centre is part of the health strategy to curb the abuse of drugs by youths.\n\nPart of the tour included a number of hotels and industrial sites that have been put in place under the New Dispensation. The New Dispensation did not only raise the standards in terms of the Gross Domestic Product but brought a sustainable acceleration in terms of economic empowerment. Economic empowerment also includes the land tenure which has now been securitised to grow our wealth,  he said.\n\nDr Muswere said the GMB silos under construction will fulfill the food security and nutrition agenda that is being spearheaded by the Second Republic.\n\nAll this great work is towards an upper middle-income society by 2030. The current revolution is about human capital growth,  he said.\n\nDr Muswere said the multimillion-dollar Zhong Jin International Hotel is part of the success stories of the engagement and re-engagement strategy undertaken by the New Dispensation to attract Foreign Direct Investment.\n\nThe Tourism Recovery Plan and Recovery Strategy towards a US$5 billion tourism economy, he said, will come to fruition through such facilities that are flourishing across the country.\n\nThere has also been a surge in the number of tourists visiting the country. The flora and fauna we enjoy have ensured that the tourism industry becomes a success. The most significant programme we have is hosted by the First Lady Amai Mnangagwa focusing on gastronomy,  Dr Muswere said.\n\nMinister Ncube said the exquisite US$10 million Zhong Jin International hotel in Redcliff showcases the Second Republics impactful and transformational engagement and re-engagement initiatives under the able and visionary leadership of President Mnangagwa.\n\nSince the inception of the New Dispensation on 24 November 2017, Zimbabwe has realised unprecedented economic recovery and growth confirmed by international finance institutions like the World Bank. This is evidenced through massive modern roads, airports, border posts, electricity infrastructure and private sector-led investments in mining, manufacturing, construction and tourism that underpin the Midlands provincial GDP growth,  he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/WE-680x380.jpg",
            "description": "Patrick Chitumba Midlands Bureau THE Midlands Province is experiencing profound transformation, fuelled by innovative initiatives in mineral value addition and beneficiation, as well as flagship projects in line with human capital development championed by President Mnangagwa. These strategic efforts are revitalising, not only the local economy, but that of the country at large, enhancing the […]",
            "time": "08:26",
            "date": "31 Jan 2025"
        },
        {
            "title": "Mahomva, Basera vie for AU top posts",
            "url": "https://www.herald.co.zw/mahomva-basera-vie-for-au-top-posts/",
            "content": "Trust Freddy\n\nHerald Correspondent\n\nZIMBABWE is pinning its hopes on two candidates, Dr Agnes Mahomva and Dr John Basera, who will represent the country in the upcoming African Union Commission elections.\n\nThe elections, scheduled to take place next month, will see the two candidates competing for key portfolios in the African Union Commission.\n\nDr Mahomva will battle it out with Ambassador Amma Twum-Amoah of Ghana for the portfolio of Commissioner for Health, Humanitarian Affairs, and Social Development.\n\nOn the other hand, Dr Basera, who is the current Secretary for Local Government and Public Works, will compete with candidates from Burundi, Republic of Congo, and Eswatini for the portfolio of Commissioner for Agriculture, Rural Development, Blue Economy, and Sustainable Environment.\n\nInitially, Zimbabwe had nominated four candidates for consideration, but only Dr Mahomva and Dr Basera made it to the final shortlist.\n\nDr Basera\n\nAmbassador Rofina Chikava and Dr George Manyaya, who were also nominated, did not participate in the assessment process, which included competency-based interviews, simulation group exercises, and psychometric assessments. The African Union Commission elections will see six commissioner posts up for grabs, with candidates from various African countries competing for the top spots.\n\nIn the portfolio of Infrastructure and Energy, SADC will have one candidate from South Africa, Ms Lerato Mataboke, who will battle it out with Cameroons National Ambassador Marie Ngakonowho.\n\nDr Molapo Qhobelqla of South Africa is the only pre-qualified candidate for the portfolio of Commissioner of Education, Science, Technology, and Innovation.\n\nThe race for the portfolio of Political Affairs will be between Ambassador Bankole Adeoye of Nigeria and Ambassador Jean Jacques Demafouth of the Central African Republic.\n\nAccording to the African Union communiqu, 11 candidates scored 70 percent and above in the assessment process, while one candidate scored below 70percent.\n\nThe panel agreed on the final ranked shortlist of pre-qualified candidates, from which AUC commissioners will be elected to the executive council in 2025.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/12/Dr-Agnes-Mahomva.jpg",
            "description": "Trust Freddy Herald Correspondent ZIMBABWE is pinning its hopes on two candidates, Dr Agnes Mahomva and Dr John Basera, who will represent the country in the upcoming African Union Commission elections. The elections, scheduled to take place next month, will see the two candidates competing for key portfolios in the African Union Commission. Dr Mahomva […]",
            "time": "08:26",
            "date": "31 Jan 2025"
        },
        {
            "title": "Heavy rains expected in Harare, Mashonaland",
            "url": "https://www.herald.co.zw/heavy-rains-expected-in-harare-mashonaland/",
            "content": "Precious Manomano\n\nHerald Reporter\n\nHARARE and all Mashonaland provinces should brace for heavy rains today.\n\nThis follows a warning from the Meteorological Services Department, which predicted mostly cloudy conditions accompanied by scattered thunderstorms across most parts of the country.\n\nThe forecast indicates significant rainfall in severalareas.\n\nYesterday, the Inter-Tropical Convergence Zone (ITCZ) brought heavy rainfall to the northern parts of Mashonaland, with some of the highest totals recorded at 30mm in Centenary and Mvurwi, while Guruve received 26mm.\n\nBesides the clouds over these northern areas this morning (yesterday), there were brief cloudy periods in the southern parts of provinces such as Masvingo, Manicaland, and Matabeleland South, said the MSD.\n\nIt said a cloud band from the West is slowly approaching the country, which may lead to further rainfall in most parts of the country today.\n\nThe department urged the public to exercise caution and avoid crossing any flooded rivers.\n\nAdditionally, citizens were encouraged to practice water harvesting where possible to mitigate the effects of the heavy rains.\n\nTomorrow, all Mashonaland provinces, as well as Matabeleland North and South, will likely experience mostly cloudy, humid, and hot weather with scattered thunderstorms.\n\nIn contrast, Bulawayo and the Harare Metropolitan area, along with Midlands, Masvingo, and Manicaland provinces, are expected to be mostly sunny and hot during the day, with mild temperatures overnight and the possibility of brief cloudy periods and occasional showers.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/wgwef-680x380.jpg",
            "description": "Precious Manomano Herald Reporter HARARE and all Mashonaland provinces should brace for heavy rains today. This follows a warning from the Meteorological Services Department, which predicted mostly cloudy conditions accompanied by scattered thunderstorms across most parts of the country. The forecast indicates significant rainfall in several  areas. Yesterday, the Inter-Tropical Convergence Zone (ITCZ) brought heavy […]",
            "time": "08:26",
            "date": "31 Jan 2025"
        },
        {
            "title": "Zvikomborero Sibanda dies",
            "url": "https://www.herald.co.zw/zvikomborero-sibanda-dies/",
            "content": "Bulawayo Bureau\n\nFORMER Chronicle journalist and ZBCTV Breakfast News anchor, Zvikomborero Sibanda, has died.\n\nShe was 46.\n\nAccording to her brother Mr Stephen Sibanda, she died in Bulawayo yesterday morning after a prolonged battle with fibroid-related complications.\n\nShe was born on April 5, 1978 in Bulawayo and began her career in journalism with the Chronicle before moving to ZBC.\n\nSibanda is survived by her husband.\n\nMr Sibanda said his sister was the fifth of seven siblings and praised her for being a unifying force in their family and recalled her liveliness as a child, stating that she played many important roles in their lives.\n\nGrowing up, she was always a lively child who ensured the family remained united, he said.\n\nSibanda attended Nkulumane Primary School in Bulawayo and studied at Usher Girls High and Hermann Gmeiner High Schools for her secondary education.\n\nThereafter she pursued a diploma in Mass Communication at Harare Polytechnic.\n\nAfter leaving ZBC, Sibanda worked at the National Oil Company of Zimbabwe before moving to South Africa where she got married.\n\nHer brother said she returned to Zimbabwe in November last year as she battled health issues caused by fibroids.\n\nAt one time she had to undergo surgery in her battle with fibroids.\n\nMourners are gathered at Block 75/2300 Mpopoma, Bulawayo, and details about her burial arrangements are yet to be announced.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/f-680x380.jpg",
            "description": "Bulawayo Bureau FORMER Chronicle journalist and ZBCTV Breakfast News anchor, Zvikomborero Sibanda, has died. She was 46. According to her brother Mr Stephen Sibanda, she died in Bulawayo yesterday morning after a prolonged battle with fibroid-related complications. She was born on April 5, 1978 in Bulawayo and began her career in journalism with the Chronicle […]",
            "time": "08:26",
            "date": "31 Jan 2025"
        },
        {
            "title": "First Lady launches Afrikana Family Humanism Programme in Harare. . . counsels need for good communication among couples",
            "url": "https://www.herald.co.zw/first-lady-launches-afrikana-family-humanism-programme-in-harare-counsels-need-for-good-communication-among-couples/",
            "content": "Tendai Rupapa\n\nSenior Reporter\n\nGOOD communication skills, faithfulness and respect are key in building strong marriages in which children are brought up morally upright well, First Lady Dr Auxillia Mnangagwa has said.\n\nShe made these remarks before thousands of people who attended the launch of her educative Afrikana Family Humanism Programme in Harare yesterday.\n\nHarare province was the ninth launch of the popular programme, in the country, with only one province remaining, as the First Lady takes a leading role in mending broken homes ensuring both men and women live in harmony while raising their children in a dignified manner.\n\nAfrikana family humanism looks at the personality of people, Ubuntu/Hunhu and how families live.\n\nZimbabwe, an African country, has its norms and values, which the First Lady is urging people to abide by.\n\nThe programme is addressing a significant gap in marriages and its implementation has had a positive impact, which is bringing families together.\n\nWomen jubilantly follow proceedings during a combined interactive session with First Lady Dr Auxillia Mnangagwa at the launch of Afrikana family humanism programme in Harare yesterday\n\nIn her quest to find tangible solutions to issues affecting families, Amai Mnangagwa separated men from women for initial discussions before addressing the combined group later.\n\nSome married women openly admitted during the lively programme that they had resorted to cheating after getting a raw deal from their spouses who often left them wallowing in poverty and loneliness to find comfort in the arms of other women.\n\nAddressing the women, the mother of the nation said counselled against any form of cheating.\n\nMadzimai, I have come to discuss with you all issues concerning vanamai kunyanya varimudzimba. Everywhere I have gone with this programme, all women are saying they are fed up and are giving up on marriage but will not leave their husbands homes. They are saying we play the same tune, kutamba irikurira and if caught, we start from there. They said Amai, yes you taught us to pray for our homes but we are now tired nezvirikuita vana baba. The women said the time had come to turn the tables as the bird had grabbed the catapult and it was now time for men to pray for their homes. Asi ndinoti revenge cheating haina kunaka. Here in Harare, I have come to hear from you as to whether the case is the same and whether the hunter here had become the hunted? she said.\n\nThe women shouted;  Yes Amai, ndizvo chaizvo kuno kuHarare titori pamberi and we want to reduce these men to size.\n\nThis is what I have come to discuss so that we counsel one another and teach one another as women. This is what prompted me to start this programme called Afrikana Family Humanism. Men are on their own discussing their own issues and we shall meet collectively later. My desire is for us to build our families. Are you there to stress your spouses or to build homes? We want to come up with something concrete and constructive. Lets feel free to vent out issues on our hearts and seek a way forward. As a solution is found for every problem shared.\n\nAmai Mnangagwa brought along speakers who took turns to address certain issues.\n\nMen jubilantly follow proceedings during a combined interactive session with First Lady Dr Auxillia Mnangagwa during the launch of Afrikana family humanism programme in Harare yesterday\n\nReverend Nelly Gwatidzo from AFM paid tribute to the First Lady for her educative programme.\n\nAmai, we are thankful for your constructive programme. These men cause us too much pain, they are real animals. They have lots of girlfriends whose numbers they save in their phones as either Plumber or Electrician and the like. They actually gossip about their wives with their lovers. They pounce on every woman hazvina basa kuti murume iyeye is a doctor, a lawyer or even a pastor. They are like predators on the prowl.\n\nBut as women, lets talk, were these men born predatory or we made them so? Are we bathing at our homes or do we wake up without even brushing our teeth and spend the day like that until the husband returns from work? Where did you cast the smartness of your youth? Show men that you are still marketable such that he is afraid to lose you. We say no to women who spend the day with a pulling sock in the head and go about gossiping at the expense of cooking for the family.\n\nThe other challenge is that women fancy themselves police officers in the home without training. Men are having dockets opened against them every day by their wives and the bedroom now resembles a courtroom such that even a case that occurred two years ago is pulled off the files in the bedroom. Men do not like this. Fights are part and parcel of marriage but lets correct one another peacefully and lovingly, she said.\n\nRev Gwatidzo attributed most domestic violence cases to the issue of conjugal rights.\n\nOverseer Abigail Masunda from ZAOGA implored women to use their hands and assist men in raising the family by lessening the burden on the husband.\n\nIf a man is strained financially, this leads to domestic violence. The Bible counsels that women were created as helpers, therefore are we fulfilling this role in choosing things that bode well for our families? she said.\n\nShe also spoke about the effects of laziness and lack of hygiene.\n\nChief Chikwaka (Mr Witness Bungu) leads a discussion with men during the launch of Afrikana family humanism programme by First Lady Dr Auxillia Mnangagwa in Harare yesterday\n\nGood communication, Overseer Masunda said, was essential.\n\nSimilar sentiments were echoed by Reverend Mary Chiwara of Methodist Church who described the First Ladys intervention as timely.\n\nAmai, you have done well to bring this programme which returns women to the role they were created for. As women we hold the lives of our families therefore, we must stand firm in our rightful positions. We should have self-confidence. As a woman be firm and do not leave your families because of side chicks. Where will you be going when you vowed to stick by one another? Fix your challenges and seek a common ground. Set an example of how you want your husband to be respected, especially by your children. Do not speak ill about your husband with the children as they will turn against him, she said.\n\nThe wife to Chief Seke, Mrs Naume Chimanikire praised the First Lady for her quest to mend broken homes and foster unity.\n\nShe said as chiefs wives they also learnt a lot from Amai enabling their families to live in love and harmony.\n\nMrs Chimanikire however bemoaned that traditional courts were inundated with marriage collapses, a case in point being that of a 68-year-old woman who dragged her 80-year-old husband to court for pushing her out in favour of a 20-year-old new wife.\n\nAt that age divorcing, what will the children say? Men are stressing women in the homes, she said as she also accused women of infidelity after many were hurled to court by their husbands for taking lovers home.\n\nThe First Lady implored women to vent their feelings.\n\nToday is our day, lets feel free to discuss. But are we keeping ourselves safe like doors to banks which when closed are not opened by all and sundry because they will be safeguarding the treasure inside? Now the floor is open, our grandmothers tell us how you aged in the homes and\n\nTo Page 7\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/ewf2ef-680x380.jpg",
            "description": "Tendai Rupapa Senior Reporter GOOD communication skills, faithfulness and respect are key in building strong marriages in which children are brought up morally upright well, First Lady Dr Auxillia Mnangagwa has said. She made these remarks before thousands of people who attended the launch of her educative Afrikana Family Humanism Programme in Harare yesterday. Harare […]",
            "time": "08:26",
            "date": "31 Jan 2025"
        },
        {
            "title": "Traditional grains hectarage doubles",
            "url": "https://www.herald.co.zw/traditional-grains-hectarage-doubles/",
            "content": "Precious Manomano\n\nHerald Reporter\n\nIn a transformative agricultural season, farmers have embraced traditional grains with renewed vigour, planting an impressive 596 103 hectares compared to just 246 088 hectares last season.\n\nThis remarkable shift reflects a broader cultural awakening rooted in heritage, nutrition and the urgent need for food security.\n\nSorghum saw a staggering increase from 176 933 hectares farmers planted last year to the 407 889 hectares put under the crop this season while pearl millet jumped from 57 359 hectares to 167 113 hectares.\n\nRapoko also experienced huge growth, with farmers planting 21 101 hectares compared to 11 796 hectares the previous year.\n\nThe surge in growing traditional grains represents a profound change in the agricultural landscape of Zimbabwe.\n\nThe Ministry of Lands, Agriculture, Fisheries, Water, and Rural Development has documented this encouraging trend, noting that the increase in growing of traditional crops is a direct response to the challenges faced by smallholder farmers.\n\nMany of these farmers, who once relied solely on high-value crops under contract farming, are now returning to their roots.\n\nZimbabwe Indigenous Women Farmers Association Trust president Mrs Depinah Nkomo said people are going back to their tradition adding that they are now embracing traditional grains.\n\nPeoples diets are changing, and they now consume healthy foods, which are mostly the food our forefathers used to eat, she said.\n\nThe hectarage put under traditional grains this season is a beacon of hope not only for the farmers but also for the communities they nourish.\n\nWith many traditional crops on the verge of extinction, the resurgence is critical for preserving Zimbabwes heritage.\n\nThe Pfumvudza/Intwasa programme, a Government initiative aimed at supporting smallholder farmers, has played a vital role in financing the production of traditional crops. Alongside private sector involvement, the programme has empowered farmers to diversify their planting strategies, leading to improved food security and resilience against climate change.\n\nTraditional crops perform better than maize even under drought, Mrs Nkomo said. We now have access to markets, and the prices are good.\n\nZimbabwe Commercial Farmers Union, president Dr Shadreck Makombe emphasised the high demand for small grains on the market.\n\nMore people are now health conscious and even restaurants are now serving traditional food. Long back, demand for traditional food was low as it was perceived to be for the poor. Now the affluent are the ones who demand traditional food, he said.\n\nThe increased awareness of the health benefits of consuming sadza or porridge made from traditional grains has turned the tide.\n\nWe deliver to the GMB (Grain Marketing Board), and the prices are good, Mrs Nkomo added, underscoring the tangible benefits of this shift.\n\nWith the season promising abundant rainfall and favourable growing conditions, the prospects for a fruitful harvest look brighter than ever.\n\nFarmers are optimistic, their spirits buoyed by the knowledge that they are contributing not only to their families well-being but also to the cultural heritage of their nation.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/faef-680x380.jpg",
            "description": "Precious Manomano Herald Reporter In a transformative agricultural season, farmers have embraced traditional grains with renewed vigour, planting an impressive 596 103 hectares compared to just 246 088 hectares last season. This remarkable shift reflects a broader cultural awakening rooted in heritage, nutrition and the urgent need for food security. Sorghum saw a staggering increase […]",
            "time": "08:26",
            "date": "31 Jan 2025"
        },
        {
            "title": "Probe into investment scam intensify",
            "url": "https://www.herald.co.zw/probe-into-investment-scam-intensify/",
            "content": "Crime Reporter\n\nZIMBABWEAN authorities, in collaboration with law enforcement agencies, are intensifying investigations into a case where the late former Ambassador to Belgium, Hurudza Gift Punungwe, and his wife, Mrs Runako Beauty Punungwe, were swindled of nearly US$1.3 million in an elaborate investment scam dating back to the year 2000.\n\nThe scheme, orchestrated by Richard Kaye, a British national, involved companies he operated at the time, namely Thomas Barclay Group (TBG) and Lloyd Morgan Company (LMC), which were based in Belgium and France.\n\nDespite years of efforts, Kaye remains elusive, with the Ministry of Foreign Affairs and International Trade, the National Prosecuting Authority (NPA), and the Zimbabwe Republic Police (ZRP) now enlisting the assistance of Interpol to track him down. He is suspected to be hiding in the United Kingdom.\n\nIt is alleged that Kaye, presenting himself as a broker, persuaded Ambassador Punungwe to invest US$214,233 in LMC. He reportedly acted in connivance with five accomplices, identified as Professor David McKay, Hendrik Vriesen, Erik Bjertnes Jr, Michiel Eyken-Slyuters, and Penny Willis Jones (also known as Penelope Slan Kaye).After the Ambassadors passing, Kaye issued new share certificates in Mrs Punungwes name. When Mrs Punungwe attempted to redeem her investment in 2009, the funds were never returned.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/09/Investigation-.jpg",
            "description": "Crime Reporter ZIMBABWEAN authorities, in collaboration with law enforcement agencies, are intensifying investigations into a case where the late former Ambassador to Belgium, Hurudza Gift Punungwe, and his wife, Mrs Runako Beauty Punungwe, were swindled of nearly US$1.3 million in an elaborate investment scam dating back to the year 2000. The scheme, orchestrated by Richard […]",
            "time": "08:26",
            "date": "31 Jan 2025"
        },
        {
            "title": "Ode to  the man behind new education curriculum",
            "url": "https://www.herald.co.zw/ode-to-the-man-behind-new-education-curriculum/",
            "content": "Isdore Guvamombe\n\nReflections\n\nIn recent years, the education curriculum in Zimbabwe has changed a lot. Parents and learners alike have braved changes too difficult to ignore.\n\nToday, this villager, the son of a peasant, reflects on the Zimbabwe School Examination Council (Zimsec) director of Curriculum Development, Dr Arthur Makanda.\n\nDr Makanda is veteran of Zimbabwes liberation struggle in which he had to drop out of school to join the war on the side of Zimbabwe African National Liberation Army, the military wing of Zanu now Zanu PF, came back home at independence and resumed education until he got a doctorate.\n\nBack from war, he also joined the Zimbabwe Republic Police and rose through the ranks to become Assistant Commissioner. During that period, he never stopped going to school.\n\nAs if that is not enough, Dr Makanda is a traditionalist, believing in indigenous religion and is one of the powerhouses behind which the Rozvi Bvumavaranda clan rallies.\n\nAnd, as is that is not enough, too, Dr Makanda is the chairperson of the Fallen Heroes Trust, a position that has seen him spearhead exhumations and subsequent decent reburial of thousands of freedom fighters, who died during the war.\n\nThat, alone shows determination and commitment to patriotism, black emancipation, national discipline, education tailor-made to answer the national question, traditional religion; making him a very befitting worker as the director for developing the future of the country.\n\nIn 1999 during the build-up to the Constitutional Referendum of 2000, I was deployed to Masvingo as The Herald Bureau Chief. I was young, firebrand and had had a trailblazing journalistic career in which I had amassed a lot of awards.\n\nThe then Herald News Editor Ray Mungoshi  one of the best wordsmiths I have ever worked with all my life- liked my style of writing and thought I followed his pen-steps, for lack of diction. I took it as an encomium!\n\nMungoshi had been Masvingo Bureau Chief himself for a long time and had left a strong footprint, so he wanted me to continue with his legacy. Of course, the shoes were too big for me and I had a bigger task. I soon I realised, I would never be him.\n\nSuffice it to say, Masvingo, was a very new territory with strange factional politics then. Soon they learn I was from Guruve, Mashonaland Central, so I was not really part of the politics of Masvingo, which made it easy for me.\n\nThey called me Gorekore after my Korekore tribe, and I did not find it offensive. Soon, each faction tried to claim me, without success. I had a strong briefing from Mungoshi and adhered to it.\n\nTo escape the factional fights, I looked for stories from the police and soon I endeared myself with its provincial spokesperson, Inspector Authur Makanda.\n\nHe was a tall bespectacled man, who walked with a lot of care. He looked very simple but I found, he had a very cunning and complex character. He had too much depth.\n\nBut there was something awkward on the way he looked at me and the way he was very careful and I was fighting hard to break him down as a news sources.\n\nThat proved very difficult. I found him a rare breed of a policeman in every aspect, incorruptible, calm, calculative, intelligent, soft and secretive, but he never refused to comment on an issue. It was his comment that killed your story or gave you good journalistic copy.\n\nI guess he was trying to break me down as a journalist and person, too. Soon we found common interest in traditional religious beliefs, the liberation struggle, literature and anti-white supremacist views.\n\nThen we interpreted the referendum campaign the same way and discovered the white population in Zimbabwe was against a section of the draft Constitution and sponsored a No Vote, because it spoke to compulsory land appropriation, without compensation.\n\nWe predicted a No Vote win, which was a dangerous precedence and an affront to the long overdue land reform.\n\nApparently, I wanted the land reform myself, because for years I had rested this field and another for my farming projects.\n\nMonths before the voting, Makanda had visited a traditional healer in Zvishumbe, a spitting distance on the outskirts of Masvingo town to the east. The war veterans had wanted to host their Heroes holiday celebrations at the Great Zimbabwe Monuments and they wanted permission from the guardian spirit.\n\nThe spirit had strongly warned him of the rise of two storms (metaphoric storms) that would shake the country.\n\nThe medium of Mbuya Zarira took snuff from a pouch, placed it is its left hand and mixed it with her sputum, smeared the resultant phlegm on Insp Makandas chest and thudded him up thrice, supposedly to calm his chicken heart and make him strong.\n\nYou are too much afraid but you will now be fine. You will weather the first storm and lead a counter storm yourself, he was told, in shriek but firm voice.\n\nSince that day Makanda developed the heart of a lion.\n\nSoon he started organising the aftermath of the referendum before it was even held, using his position as a war veterans provincial secretary general and leveraging it with his post as polices public relations officer. He sat in both meetings.\n\nWhile many people concentrated on the campaign of the referendum, which he knew the Government was losing, he was far ahead and already working on plan B for the aftermath. I feared for him. But he was no longer himself.\n\nWhen the result came, Insp Makanda, as I later called him, was at the Elections Command Centre and as the final result was being read out he gave me the results as they came. Our prediction was correct. The No Vote had won.\n\nHe engineered the invasion of Yothum Farm, but there was supposed to be another reason, which had nothing to do with the referendum results and yet, the plebiscite was the trigger.\n\nAgainst the grain, Insp Makanda mobilised war veterans to occupy Yothum Farm, owned by Dick Reign, a former Rhodesian Infantry soldier.\n\nInsp gave them money from his own pocket for upkeep. Yothum Farm had a slaughter house from where hundreds of black people were killed during the war of liberation.That was enough justification for occupation.\n\nIn the group of 10 war veterans were Kidy Muzenda, Tendai Matambu, Eston Mupondi and Kennedy Saharu, among others. Soon they occupied the farm and it sent shivers down the white farmerss spines. I vividly remember Kidy Muzenda, using two triangular dry poles, to scale an electric fence on a perimeter wall to enter the premises. Skillful!\n\nInsp Makanda had given them an instruction never to spill any blood and true, until the end of the land invasions, no white farmer was killed in Masvingo.\n\nHe gave them a cellphone, a Nokia 5110, for communication.\n\nThat time, the war veterans leadership in Masvingo was divided, with their chairman Munyaradzi Mhike vehemently against the land invasions.\n\nIn panic, the white farmers requested to meet the police leadership and Insp Makanda sat in various meetings with them and police public relations officer.\n\nLittle did they know he was the man behind the invasions. Effectively, he became a referee and a player in the same game. He used inside information to spearhead more invasions in Masvingo, while using his job to calm down and play the white farmers.\n\nIn one incident, the white farmers obtained a court order to evict the war veterans from Yothum Farm, and the invaders were listed by their names. That night, Insp Makanda, visited the farm and hastily arranged a swap of the listed war veterans with those at the next farm.\n\nAt day break, Insp Makanda led the white farmers and journalists with the eviction order and when the names were called out, none of the listed war veterans was at the farm. So, it could not be saved. It meant the white farmers had to start a new court application, listing the ones now at the farm. That was Arthur Makanda at his best.\n\nAfter several meetings chaired by Insp Makanda, the white commercial farmers led by Clive Stockhill, discovered Makanda was the real deal behind all the invasions and petitioned then Police Commissioner General Augustine Chihuri.\n\nInsp Makanda led a delegation to then Vice President Simon Muzendas rural home in Zvavahera, Gutu, to explain the route taken by the war veterans.\n\nWhile there, Josaya Hungwe (then Masvingo Provincial Governor) was summoned by VP Muzenda for a briefing and thereafter Insp Makanda arranged more invasions and the whole of Masvingo was taken.\n\nThereafter the land reform became a rollercoaster.\n\nMakanda was transferred to Beitbridge on promotion, then Bikita District and Chitungwiza. I was also recalled to Harare where I hooked up with him while he was now at Chitungwiza in 2003.\n\nIn 2004 Makanda, then an Assistant Commissioner, became former President Mugabes aide de Camp until 2014. During that time Makanda, a book worm, had studied English and Communications and is now Dr Makanda.\n\nHe is now the director of Curriculum Development at the Zimbabwe Schools Examination Council (Zimsec).\n\nThe full input of it is that Dr Makanda brings a grounded character to the education curriculum, using his experience as a freedom fighter, a communicator, a top policeman, a traditionalist and a patriot to ensure that Zimbabwes education systems produces graduates that respond to national needs.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/efef-680x380.jpg",
            "description": "Isdore Guvamombe Reflections In recent years, the education curriculum in Zimbabwe has changed a lot. Parents and learners alike have braved changes too difficult to ignore. Today, this villager, the son of a peasant, reflects on the Zimbabwe School Examination Council (Zimsec) director of Curriculum Development, Dr Arthur Makanda. Dr Makanda is veteran of Zimbabwe’s […]",
            "time": "08:26",
            "date": "31 Jan 2025"
        },
        {
            "title": "Job fraud lands Zim man in SA court",
            "url": "https://www.herald.co.zw/job-fraud-lands-zim-man-in-sa-court/",
            "content": "Fidelis Munyoro\n\nChief Court Reporter\n\nA 33-YEAR-OLD Zimbabwean national, Kudakwashe Mpofu, has been arrested in South Africa on allegations of using fraudulent documents to secure a lucrative government post, amassing over R3 million in salaries before being exposed.\n\nMpofu is accused of presenting a counterfeit South African permanent residence permit to gain employment at the North West Development Corporationin March 2023.\n\nHis rapid ascent within the organisation led to his appointment as chief financial officer, a role he held until his recent arrest. Investigators allege that Mpofu began his tenure at NWDC as an asset manager before being elevated to acting CFO and later confirmed in the permanent CFO position, where he earned significant financial benefits.\n\nAuthorities took Mpofu into custody on Tuesday January 28, 2025 in Mahikeng following a probe by the Hawks Serious Corruption Investigation unit.\n\nThe investigation uncovered discrepancies in his employment records, ultimately exposing the use of fraudulent credentials. He appeared before the Mmabatho Magistrates Court on Wednesday, where he was formally charged with fraud.\n\nA bail hearing has been scheduled for February 3. If convicted, Mpofu could face severe penalties, including imprisonment, financial restitution, and potential deportation.\n\nAccording to Hawks Spokesperson Brigadier Silas Munzhedzi, Mpofu received over R3 million in salaries while employed under false pretences, describing the investigative process as meticulous.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/10/Court.jpg",
            "description": "Fidelis Munyoro Chief Court Reporter A 33-YEAR-OLD Zimbabwean national, Kudakwashe Mpofu, has been arrested in South Africa on allegations of using fraudulent documents to secure a lucrative government post, amassing over R3 million in salaries before being exposed. Mpofu is accused of presenting a counterfeit South African permanent residence permit to gain employment at the […]",
            "time": "08:26",
            "date": "31 Jan 2025"
        }
    ]
}