{
    "news": [
        {
            "title": "Lithium investor sets sights on Zim . . . Seeks to establish inaugural refinery, battery plant",
            "url": "https://www.herald.co.zw/lithium-investor-sets-sights-on-zim-seeks-to-establish-inaugural-refinery-battery-plant/",
            "content": "Wallace Ruzvidzo-Herald Reporter\n\nVARDHAAN Lithium, which is set to establish Indias inaugural lithium refinery and battery manufacturing unit, has expressed interest in harnessing Zimbabwes rich mineral resources, with plans for beneficiation and value addition.\n\nA high-powered delegation, including the India-headquartered companys chairman, Mr Sunil Joshi and managing director Mr Vedansh Joshi, yesterday paid a courtesy call on President Mnangagwa at State House in Harare, where they informed him of their appetite to invest in the countrys mining sector.\n\nAlready, Vardhaan and a Zimbabwean company, Microlight Mineral Resources, have joined a Special Purpose Vehicle (SPV) known as Avani Microlight, which will see the two companies exploring the countrys mineral resources in Bikita, Masvingo Province.\n\nOnce fully operational, a lithium battery assembly plant and an electric vehicle manufacturing plant will be established in Bikita.\n\nIn an interview after their closed-door meeting with the President, Microlight Mineral Resources vice chairman and director for corporate affairs Mr Martin Matoi laid out the two companies plans.\n\nHe said a place for the commencement of their SPV operations had since been secured.\n\nThe two companies (Vardhaan and Microlight) have joined an SPV known as Alvin Microlight to do exploration, mining, value addition and beneficiation in the Bikita area ofMasvingo.\n\nThe whole objective is that at least they are going to invest in mineral exploration and beneficiation(with) the passage of time, the ultimate goal is to establish a battery assembly plant in Bikita and an electric vehicle manufacturing plant in the same area.\n\nSo at least an area has been secured, say, in the Bikita area where these operations are going to be carried out, he said.\n\nMr Matoi said there were also plans for a skills and technology transfer programme which will benefit Zimbabwes youth demographic and ultimately the economy.\n\nThey (Vardhaan) have a project for the technological transfer, which is one aspect that we want . . . we have an exchange programme for the Zimbabwean youth and the middle-aged adults to interchange on technological transfer in India.\n\nSo we will be having people going to India for training and then coming back to work in Zimbabwe. The whole idea is to transform the economic sector and, the entire GDP of the country, he said.\n\nVardhaan Lithium, said Mr Matoi, was firmly behind Zimbabwes goal of attaining upper-middle-income economic status by 2030.\n\nSo the vision which we are sharing with them, they support the vision of His Excellency, the President of Zimbabwe, Dr ED Mnangagwa of creating an upper-middle-income economy by 2030.\n\nWe actually want to (tap into their expertise) as much as we canthey are coming to us as technical and financial partners, he said.\n\nOver the years, Indian investments in Zimbabwe have surged to a remarkable US$600 million, reflecting the growing depth of the bilateral relations between the two nations.\n\nThis massive investment jump, mostly in the private sector, has provided direct employment to approximately 5 000 Zimbabweans with indirect job creation for an additional 10 000 people.\n\nThe increasing presence of Indian companies in Zimbabwe combined with new expansion projects is poised to further fuel the economic collaboration between the two countries, with several projects already underway including one recently officiated by President Mnangagwa.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/President-with-Lithium-investors-680x380.jpg",
            "description": "Wallace Ruzvidzo-Herald Reporter VARDHAAN Lithium, which is set to establish India’s inaugural lithium refinery and battery manufacturing unit, has expressed interest in harnessing Zimbabwe’s rich mineral resources, with plans for beneficiation and value addition. A high-powered delegation, including the India-headquartered company’s chairman, Mr Sunil Joshi and managing director Mr Vedansh Joshi, yesterday paid a courtesy […]",
            "time": "06:33",
            "date": "07 Mar 2025"
        },
        {
            "title": "Zanu PF Politburo expels Central Committee member Geza",
            "url": "https://www.herald.co.zw/zanu-pf-politburo-expels-central-committee-member-geza/",
            "content": "Joseph Madzimure-Senior Reporter\n\nTHE Zanu PF Politburo has expelled Central Committee member Blessed Geza from the party with immediate effect, the ruling partys Secretary for Legal Affairs, Cde Patrick Chinamasa, has said.\n\nGeza, from Mashonaland West Province, faced expulsion for attempting to undermine the party and committing acts deemed treasonous against the State.\n\nAddressing a Press conference at Zanu PF Headquarters in Harare yesterday, Cde Chinamasa said Gezas disloyalty warranted immediate action to maintain discipline and unity within Zanu PF.\n\nThe decision to expel Geza was reached at the partys 381st Ordinary Session of the Politburo in the capital on Wednesday.\n\nIn addition to Cde Geza, the Politburo also endorsed the expulsion of Cde Gifford Gomwe from Mashonaland West for creating a WhatsApp group that undermined the party.\n\nOther notable expulsions included Cde Kudakwashe Gopo from Masvingo Province, accused of disrupting District Coordinating Committee meetings and forming a similar WhatsApp group.\n\nGutu East National Assembly member, Cde Benjamin Ganyiwa, was expelled for attempting to unconstitutionally remove six district chairpersons, fanning factionalism, and holding unauthorised meetings where the President was criticised.\n\nAs a result, he will be recalled from Parliament, triggering a by-election for his position.\n\nCde Roy Bila, Member of Parliament for Chiredzi North, was exonerated of all charges against him, while Cde Calisto Bangu will face the National Disciplinary Committee to address accusations of undermining the party.\n\nIn Harare, former Provincial Political Commissar Cde Kudakwashe Damson faced multiple charges, leading to a three-year suspension.\n\nZanu DCC 2 chairman Cde Godwin Gomwe was expelled for factionalism and indiscipline.\n\nAnother Harare provincial party member, Cde Edson Ringwa, was also expelled from the party for illegally parcelling out stands in Chitungwiza among other charges.\n\nAnother member, Cde Victor Manungo has been expelled after being charged with spreading falsehoods and sowing disunity.\n\nCde Chinamasa said Cde Manungo had demonstrated disloyalty through social media, leading the Politburo toexpel him.\n\nCde Blessing Kambumu was charged with secretly creating a fake social media account and insubordination. He will remain a card-carrying member but will not hold any position for the next three years.\n\nCde Spencer Mutero was also expelled from the party for administering a social media group which was antagonistic to the partys agenda and ethos.\n\nHe personally attacked the President and First Secretary of the party on social media in violation of Section 549.\n\nDeliberately disseminating false information to create disharmony within the party. The province recommended for his suspension for three years, but the Politburo found that this was a serious offence which required expulsion, said Cde Chinamasa.\n\nHe noted that the actions taken reflect the partys commitment to discipline.\n\nIt is crucial that we uphold discipline within the party, said Cde Chinamasa.\n\nFormer Harare provincial Womens League chairperson Cde Ratidzo Mukarati, who is on suspension for fanning factionalism, was demoted to a lesser influential position within the league.\n\nOther members will also be notified of their fate in their respective provinces and districts with party members expected to exercise high levels of discipline in line with the partys ethos and values.\n\nZanu PF National Political Commissar Cde Munyaradzi Machacha announced plans to develop a Social Media policy to regulate party conduct online.\n\nHe stressed that any deviation from party values or disciplinary standards will result in expulsion, reinforcing a firm stance against indiscipline.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Cde-Chinamasa-680x380.jpg",
            "description": "Joseph Madzimure-Senior Reporter THE Zanu PF Politburo has expelled Central Committee member Blessed Geza from the party with immediate effect, the ruling party’s Secretary for Legal Affairs, Cde Patrick Chinamasa, has said. Geza, from Mashonaland West Province, faced expulsion for attempting to undermine the party and committing acts deemed treasonous against the State. Addressing a […]",
            "time": "06:33",
            "date": "07 Mar 2025"
        },
        {
            "title": "Zim economy to grow 5pc: Global research firm",
            "url": "https://www.herald.co.zw/zim-economy-to-grow-5pc-global-research-firm/",
            "content": "Michael Tome-Business Reporter\n\nGLOBAL economic research firm BMI has projected Zimbabwes economy to grow by 4,9 percent this year, driven by the strong recovery of agriculture, increased investments in mining and accelerated public infrastructure development.\n\nThe projection by the British multinational and unit of UK-headquartered Fitch Solutions, usually very critical of Zimbabwes prospects, signals the huge potential for growth in Zimbabwe this year, even though most multilateral institutions see higher growth, perhaps as high as 6,2 percent.\n\nMultilateral lenders such as the African Development Bank, the International Monetary Fund and the World Bank have already projected that Zimbabwe would register the same growth this year, between 5 percent and 6,2 percent.\n\nBMIs head of global operational risk research, Ms Chiedza Madzima, gave the companys forecast on Wednesday at the Confederation of Zimbabwe Industries (CZI) Business and Economic Outlook Symposium for 2025.\n\nFinance and Economic Development Minister Professor Mthuli Ncube forecast the economy to expand by 6 percent this year, partly driven by agriculture after the El Nino-induced drought weighed down growth last year.\n\nZimbabwe was projected to have registered slower growth of 2 percent last year from 5,3 percent the prior year. Even though agriculture saw a decline in output, rising output and value in other sectors including mining, tourism and manufacturing compensated resulting in positive growth.\n\nGrowth is expected to pick up pace, one of the fastest in Africa, driven by the success of the 2024-25 summer cropping season following the good rains received across the country.\n\nMs Madzima said Zimbabwes economy would also benefit from expected strong gold output, amid rising prices on the international markets, propelled by the projected 12,8 percent expansion in agricultural output.\n\nGrowing investments across the economy, as indicated by the Zimbabwe Investment and Development Agency, would also drive accelerated growth, she said.\n\nThe Chamber of Mines of Zimbabwe is on record as saying that planned investments in the mining sector were expected to surpass US$600 million, primarily driven by new lithium projects.\n\nMs Madzima said Zimbabwes lithium output was expected to grow by 75 percent this year, while platinum group metals production was seen up by 7 percent.\n\nPotential long-term projects like the Zim Cyber City and the Mapinga Mines to Energy Industrial Park into which foreign investors are expected to put US$13 billion, are also expected to drive faster economic growth thisyear.\n\nMs Madzima noted that the countrys net financial accounts had been on a positive trajectory over the past three years, driven by growing foreign investment coming from the United Arab Emirates (UAE), China and South Africa.\n\nImproving weather conditions will facilitate a recovery in agriculture, which means recovery in household incomes and electricity supply in the coming quarters, but our growth projection is 4,9 percent, which is below the governments projection of six percent.\n\nInvestment will strengthen in 2025 as we have seen strong growth in the issuance of licenses by ZIDA, and the Government capex is recovering in line with the budget projections.\n\nLithium output is expected to grow by 75 percent this year, PGMs net is going to be up by seven percent, gold by four percent. Of course, on the agric side, the Government expects agricultural production to peak by around 12,8 percent.\n\nSo all this signals quite a positive trajectory for Zimbabwes current account and its net export position, Ms Madzima said.\n\nDespite positive projections, she noted potential impediments to Zimbabwes economy, saying the countrys currency challenges could hinder growth if unchecked.\n\nAuthorities have already rolled out several policy measures to stabilise the economy, including adopting tight monetary and fiscal positions, which are already paying dividends amid growing exchange rate stability and falling inflation.\n\nMs Madzima also said that although Zimbabwe saw a slight increase in foreign currency reserves in 2024, its external position remained susceptible to unforeseen challenges from global economic volatility.\n\nForeign currency challenges will continue to be an issue within the country, still tight financial conditions, very high interest rates will keep private consumption growth rather muted, and there is a stronger need for fiscal consolidation. Of course, this will limit a sharp uptick in Government spending, she said.\n\nWorld Bank senior country economist for Zimbabwe, Mr Victor Steenbergen, weighed in saying sustaining steady and consistent economic growth was crucial for Zimbabwe to achieve its ambitious goal of transitioning into an upper-middle-income economy by 2030.\n\nHe also emphasised that the private sector played a vital role in Zimbabwes economy, as it was the primary driver of employment and contribution to GDP.\n\nAchieving consistent and sustainable economic growth is a key to Zimbabwes goal to become an upper-middle economy. The role of the private sector is critical in this as it is the largest employer, the largest contributor to GDP, and the largest source of tax revenue.\n\nDespite multiple challenges over the past several decades, Zimbabwes private sector demonstrates strong resilience and has significant potential in the short term, Mr Steenbergen said.\n\nThe annual gathering brought together industry leaders, business executives, economic and market analysts, and policymakers to assess the countrys economic situation and the dynamics shaping the business environment in 2025 and beyond.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Chiedza-Madzima-680x380.jpg",
            "description": "Michael Tome-Business Reporter GLOBAL economic research firm BMI has projected Zimbabwe’s economy to grow by 4,9 percent this year, driven by the strong recovery of agriculture, increased investments in mining and accelerated public infrastructure development. The projection by the British multinational and unit of UK-headquartered Fitch Solutions, usually very critical of Zimbabwe’s prospects, signals the […]",
            "time": "06:33",
            "date": "07 Mar 2025"
        },
        {
            "title": "Zim, China partnership shines in healthcare sector",
            "url": "https://www.herald.co.zw/zim-china-partnership-shines-in-healthcare-sector/",
            "content": "Rumbidzayi Zinyuke-Senior Health Reporter\n\nZIMBABWE and China yesterday celebrated the 40th anniversary of the China Medical Teams mission in the country, marking a longstanding partnership that has significantly strengthened the nations healthcare system.\n\nSince 1985, China has dispatched 21 medical teams, comprising more than 200 experts and 90 short-term assistance personnel. Altogether they have treated more than 93 000 patients, particularly in remote and underserved areas.\n\nThe commemorations, held at the Chinese Embassy in Harare, underscored the enduring partnership that has profoundly impacted Zimbabwes healthcare landscape. The event also recognised the efforts of the outgoing 21st medical team, which has been in the country since March last year.\n\nSpeaking during the celebrations, Health and Child Care Deputy Minister Sleiman Kwidini commended the Chinese Medical Teams efforts which have made significant impact on the health sector over the past years.\n\nFor the past 40 years, these teams have been at the forefront of delivering quality healthcare to our people, often in the most remote and underserved areas. The 21st China Medical Team has already treated over 14 000 patients, trained more than 1 000 local healthcare workers, and established critical healthcare facilities such as the Telemedicine Centre, First-Aid Training Centre, and Clinical Skills Training Centre at Parirenyatwa Hospital.\n\nThese efforts have not only saved lives but have significantly enhanced the capacity of our healthcare system, leaving a legacy that will benefit future generations, he said.\n\nDeputy Minister Kwidini said the impact of the China Medical Teams extended beyond numbers with the success of programmes like the Bright Journey, which recently completed its most recent mission to Zimbabwe, restoring sight to more than 600 patients.\n\nChina has also supported the development of essential health infrastructure including the construction of Chinhoyi Provincial Hospital, the Mahusekwa China-Zimbabwe Friendship Hospital, and the National Pharmaceutical (NatPharm) Warehouse in Harare.\n\nThe partnership between Zimbabwe and China in the healthcare sector serves as a shining example of what nations can achieve when they collaborate with mutual respect and friendship. As we celebrate this significant milestone, it is important to recognise the role of international cooperation in addressing global challenges. Todays world is marked by profound changes and uncertainties, from health crises to economic disparities. It is more important than ever for nations to come together, as Zimbabwe and China have done, to build a united and prosperous global community, he said.\n\nDeputy Minister Kwidini said Chinas global development initiative aligned closely with the governments vision of leaving no one and no place behind.\n\nHe welcomed the incoming 22nd China Medical Team to the country and expressed hope that the team would also make a positive impact as it begins work.\n\nChinese Embassy Charg dAffaires, Mr Cheng Yan, commended the Chinese medical teams commitment, as well as the support and collaboration of the Government and the people of Zimbabwe.\n\nHe said the 21st Medical teams efforts embodied the spirit of Chinas vision for a global community of health for all, and demonstrated that their mission was not just about treating illness but building bridges of friendship between the two countries peoples.\n\nMr Yan also encouraged the incoming team to work with local experts for continuity of services.\n\nI want to encourage you, please remember, you are not only coming for treating patients, but also for more exchanges of skills and expertise with your Zimbabwean colleagues; you are not only coming as medical professionals, but also as envoys of China-Zimbabwe friendship. I look forward to your greater contribution to the Zimbabwean people and our bilateral relations on the solid foundation cemented by your predecessors, he added.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Zim-China-680x380.jpg",
            "description": "Rumbidzayi Zinyuke-Senior Health Reporter ZIMBABWE and China yesterday celebrated the 40th anniversary of the China Medical Team’s mission in the country, marking a longstanding partnership that has significantly strengthened the nation’s healthcare system. Since 1985, China has dispatched 21 medical teams, comprising more than 200 experts and 90 short-term assistance personnel. Altogether they have treated […]",
            "time": "06:33",
            "date": "07 Mar 2025"
        },
        {
            "title": "First Lady’s love envelopes Mbare Skills Development Centre",
            "url": "https://www.herald.co.zw/first-ladys-love-envelopes-mbare-skills-development-centre/",
            "content": "Tendai Rupapa-Senior Reporter\n\nEMPOWERMENT advocate First Lady Dr Auxillia Mnangagwa yesterday took to the fields to harvest a variety of crops including maize, which she grew with children at her Mbare Skills Development Centre, which houses children who were living and working on the streets, allowing them to attend school and equipping them with vocational training skills.\n\nDr Mnangagwa, who has a passion for children and other vulnerable groups, emphasised the need for hard work as she interacted with the children, warning them against social vices and highlighting their effects.\n\nThe children, who are in pre-school, primary and secondary classes at the centre, took their lessons in the presence of the First Lady who was keenly checking on their performance.\n\nAlso involved in performing arts, the children showcased their talents through playing instruments like drums, rattles, and the thumb piano while others sang and danced as the instruments were being played.\n\nThe mother of the nations interaction with the children has played a significant role in providing mentorship, developing essential life skills, enhancing teamwork, and making the children grow into self-reliant people.\n\nShe taught them various household chores, including laundry, washing dishes, cleaning, and cooking.\n\nYesterday, the children had an opportunity to put what they learnt into practice when they prepared their meals with the help of mothers from the community while Amai Mnangagwa looked on.\n\nFormer street children prepare green mealies for cooking while First Lady Dr Auxillia Mnangagwa observes. The maize crop was planted by the children as part of their life skills training initiative by Dr Mnangagwa at her skills development centre in Mbare.\n\nThere are many success stories at the centre, including that of a girl whose talent was nurtured by the First Lady and is now playing professional womens soccer at Black Mambas Football Club.\n\nDr Mnangagwa sought to know some of the social vices that the children know and how the children reprimand one another in the event of mischief.\n\nHow do you caution someone who will be misbehaving? she asked. In response, a boy said: We sit him down and tell him that you are ruining your life. Better follow the good morals we are being taught by our mother, the First Lady.\n\nDr Mnangagwa weighed in, expressing her love for the children.\n\nI love you my children that is why I took you from the streets, so that you grow up morally upright. As a mother, I want to work with disciplined children who do not take drugs or engage in naughtiness, she said.\n\nThe learners also expressed gratitude to the mother of the nation for her benevolence.\n\nWe love you Mhamha for sending us to school, a child at the centre said.\n\nAnother one praised the First Lady for restoring their dignity.\n\nMhamha, previously we would be ridiculed wherever we went and were accused for all thefts even when we were not present, pese pataipfura vanhu vaibata homwe nemhino vachiti tiri kunhuwa but Mhamha you embraced us, you are not selective and showed us motherly love.\n\nYou bathed us, clothed us and sheltered us. You also gave us a chance to go to school as education is key.\n\nFirst Lady Dr Auxillia Mnangagwa interacts with a girl after she finished eating during lunch prepared by former street children after training at the skills development centre in Mbare. The girl had earlier told Amai Mnangagwa that she is a child and should be forgiven if she fails to finish her food.\n\nHis colleague also thanked the First Lady for initiating projects for them.\n\nAmai, we are happy for the projects you initiated here for us. We are now selling our produce like tomatoes, vegetables, and chickens. We are also involved in recycling and making money.\n\nToday we are glad you came to harvest with us the maize that you helped us grow. You have also come to spend the day with us, he said.\n\nAmai Mnangagwa expressed love to the children and in return they shed tears of joy as they told her how much they appreciated her for her love and kindness.\n\nAfter interacting with the children, she then started harvesting the maize with the children before proceeding to the kitchen where the children and community mothers were cooking.\n\nThey prepared chicken, beef, sugar beans, dried vegetables, cabbages, rice, sadza and green mealies. Most of the food cooked is from the centre.\n\nThe chickens are reared at the centre where the vegetables are also grown and dried.\n\nThe female soccer player, Mercy Gada, had words of advice to her peers.\n\nShe said she grew up in the streets and later learnt of the First Ladys Skills Development Centre.\n\nI seized the opportunity and came along to live at the centre. The First Lady spoke to us, asking us what we are capable of doing in our lives, like sports, catering, and sewing.\n\nI am among the girls who had a vision to play womens soccer. The First Lady encouraged me to play soccer to nurture my talent. She facilitated that I joined Black Mambas Queens where I am playing football.\n\nI thank the First Lady very much for what she did for me in my life and I am seeing that my life is changing, unlike in the past. I, therefore, encourage others not to suppress their talents because they can make it in life.\n\nI encourage people to leave drugs. If I were into drugs, I would not be where I am today and I would not be playing soccer, she said.\n\nMr Joseph Rukara, who is taking the children through dressmaking lessons at the centre, praised the First Lady.\n\nFirst Lady Dr Auxillia Mnangagwa interacts with a boy after he finished eating during lunch prepared by former street children after training at the skills development centre in Mbare.\n\nI thank the First Lady for the work that she is undertaking in this community. Mbare can be viewed as Sodom and Gomorrah, but it is changing because of the mother of the nation. Some children from around the community are also coming seeking to learn and doing vocational skills.\n\nWe have over 40 children who are here learning to sew and I thank the First Lady for her great love, wishing that the Lord grants her more years on earth, he said.\n\nEqually delighted were the children. One of the beneficiaries who identified himself as Admire said he was at a loss for words.\n\nOne of the former street children enjoys a meal where he finished three plates during lunch at the skills development centre in Mbare yesterday.\n\nI just do not know how best I can thank the First Lady for what she is doing to most of us children who were living and working on the streets. She took us from the abyss and is showing us the correct path to follow. I never thought I would acquire decent education like other children of my age, but this has come to pass because of the First Lady. I glorify God for giving us such a loving mother, he said.\n\nAnother beneficiary said she was glad to have learnt to use her hands to earn a living.\n\nFormer street girls sweep the floors showing the skills they were taught by First Lady Dr Auxillia Mnangagwa at her skills development centre in Mbare yesterday.\n\nI thank the First Lady heartily for bringing us here and equipping us with life skills. I am delighted I can now raise chickens and grow vegetables all because of the First Ladys love.\n\nI had been left without an option but to venture into prostitution owing to the challenges we encountered on the streets. This, however, is now a thing of the past because the First Lady took me and washed me of those ill-thoughts. She taught me to be morally upright and use my own hands to earn a decent living, she said with happiness.\n\nFirst Lady Dr Auxillia Mnangagwa observes as an ECD teacher conducts lessons at her skills development centre in Mbare yesterday.\n\nProstitution, drug abuse, and petty crimes used to be part of the childrens lives until Amai Mnangagwa, who has a passion for the total empowerment of children, gave them a new lease of life.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/First-Lady1-680x380.jpg",
            "description": "Tendai Rupapa-Senior Reporter EMPOWERMENT advocate First Lady Dr Auxillia Mnangagwa yesterday took to the fields to harvest a variety of crops including maize, which she grew with children at her Mbare Skills Development Centre, which houses children who were living and working on the streets, allowing them to attend school and equipping them with vocational […]",
            "time": "06:33",
            "date": "07 Mar 2025"
        },
        {
            "title": "‘Broadcasters must cover local, African sport’",
            "url": "https://www.herald.co.zw/broadcasters-must-cover-local-african-sport/",
            "content": "Farirai Machivenyika-Senior Reporter\n\nTHE Broadcasting Services Amendment Bill sparked significant debate in the National Assembly before its passage in the House on Tuesday, particularly regarding its provision requiring motorists to acquire a ZBC radio licence before obtaining their vehicle licence and insurance.\n\nThe proposed legislation also mandates that broadcasters cover local and African sporting events, with the specific coverage threshold to be determined through regulations.\n\nOriginally, Clause 21 of the Bill required that sporting channels dedicate 50 percent of their content to local and African programming.\n\nBut this requirement was amended by Information, Publicity and Broadcasting Services Minister, Dr Jenfan Muswere, following input from legislators.\n\nDzivarasekwa representative Mr Edwin Mushoriwa argued that establishing minimum content thresholds in the law could be cumbersome, as any adjustments would necessitate parliamentary amendments.\n\nHe proposed that the determination of the number of channels or percentage of content be left to the Ministers discretion through regulations.\n\nSo, my thinking is, can we remove this one and then we add to say that the number of channels or the percentage of content shall be determined by the Honourable Minister through regulations from time to time?\n\nHaving a piece of legislation to just do that may create a problem. Maybe, at a time, you will then realise that no, you need 80 percent or 70 percent  naturally without the need of you coming back to this august House to amend, that is my proposal, said Mr Mushoriwa.\n\nDr Muswere supported the suggestion, indicating a willingness to revise the clause to allow for more flexible regulatory powers concerning local and African content.\n\nZanu PF Chief Whip Cde Pupurai Togarepi suggested that the clause should read: That the Minister may, by regulation, prescribe the percentum of local and African content for sport channels.\n\nDr Muswere also defended a provision that requires subscription-based broadcasters to carry three ZBC channels.\n\nHe responded to concerns that this might deter investment, affirming that it aligns with international standards.\n\nIt is a standard procedure internationally that if you are a subscription-based licence operator, you must carry three national broadcaster channels. In Zimbabwe, we have one and we are trying to come up with two more.\n\nWe want this law to help us to ensure that all those that we may license carry two more. We want to add ZBC 2 and 3. This is based on heritage broadcast. We want our content to spread internationally and cater for the 16 languages. There is nothing new as this is international practice, said Dr Muswere.\n\nAs the Bill progresses, these discussions highlight the balance between regulatory oversight and the need for flexibility in content requirements to adapt to the changing broadcasting landscape.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Minister-Muswere-680x380.jpg",
            "description": "Farirai Machivenyika-Senior Reporter THE Broadcasting Services Amendment Bill sparked significant debate in the National Assembly before its passage in the House on Tuesday, particularly regarding its provision requiring motorists to acquire a ZBC radio licence before obtaining their vehicle licence and insurance. The proposed legislation also mandates that broadcasters cover local and African sporting events, […]",
            "time": "06:33",
            "date": "07 Mar 2025"
        },
        {
            "title": "Zim, Russia sign joint declaration to counter  effects of sanctions",
            "url": "https://www.herald.co.zw/zim-russia-sign-joint-declaration-to-counter-effects-of-sanctions/",
            "content": "Africa Moyo-Deputy News Editor\n\nZimbabwe and Russia yesterday signed a joint declaration to counter, mitigate, and address the adverse impacts of unilateral coercive measures imposed by Western countries.\n\nHarare was represented by Foreign Affairs and International Trade Minister, Professor Amon Murwira, while Moscow was represented by Foreign Minister Sergey Lavrov at the signing ceremony in the Russian capital.\n\nZimbabwe was slapped with sanctions for its Land Reform Programme initiated in 2000, whereas Russia has been under sanctions over its special military operation in Ukraine since February 2022.\n\nThe two officials also discussed various bilateral issues, highlighting the strong political relations between their nations.\n\nProf Murwira said Zimbabwe and the Russian Federation have excellent political relations, and they are working on the economic front to translate the excellent political relations into excellent economic cooperation, which leads to the development of people.\n\nHe added that they discussed scientific and technical cooperation, noting that many Zimbabweans are training in Russia in these fields.\n\nProf Murwira also highlighted the mutual recognition of qualifications between their education systems, emphasising the progress made in economic activities.\n\nHe remarked on the importance of regional linkages, stating, My colleague has talked about the linkages between our provinces and regions of Russia, which is extremely important for us to realise a people-to-people integration.\n\nHe reiterated Zimbabwes goal to become an upper-middle-income economy by 2030, underscoring the need for progressive partnerships for peaceful development.\n\nMinister Lavrov affirmed his talks with Prof Murwira were productive.\n\nToday we reaffirmed the significance of traditionally friendly relations between Russia and Zimbabwe, underpinned by the principles of mutual respect and equal rights.\n\nHe commended President Mnangagwas policy to deepen their partnership based on previous agreements made with President Vladimir Putin, including in June last year.\n\nMinister Lavrov noted the importance of strengthening cooperation in trade and the economy.\n\nWe agreed to make additional steps to apply our common interests in new spheres, in mining, in prospecting, in energy, including nuclear energy, in agriculture, in outer space, in information and communication technologies, he said.\n\nHe also highlighted educational initiatives, adding that every year, Russia provides 120 scholarships toZimbabweans to study at Russian universities.\n\nWe are ready to increase this quota if Zimbabwe is willing to do so, he said.\n\nMinister Lavrov also said the Centre for Open Education of Zimbabwe in collaboration with St. Petersburg State University, has over 500 people currently studying Russian online.\n\nHe also said the two friendly nations are keen to have their regions cooperate.\n\nIn particular, Zimbabwe has good relations with Tatarstan and the Moscow region. An agreement on cooperation between the government of the Sverdlov region and the government of the Midlands Province is in place, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Minister-Murwira-and-Minister-Lavrov2-680x380.jpg",
            "description": "Africa Moyo-Deputy News Editor Zimbabwe and Russia yesterday signed a joint declaration to counter, mitigate, and address the adverse impacts of unilateral coercive measures imposed by Western countries. Harare was represented by Foreign Affairs and International Trade Minister, Professor Amon Murwira, while Moscow was represented by Foreign Minister Sergey Lavrov at the signing ceremony in […]",
            "time": "06:33",
            "date": "07 Mar 2025"
        },
        {
            "title": "Govt steps forward to safeguard citizens’ digital privacy",
            "url": "https://www.herald.co.zw/govt-steps-forward-to-safeguard-citizens-digital-privacy/",
            "content": "Obey Musiwa-Herald Reporter\n\nFOLLOWING concerns raised by Zimbabweans regarding the collection of personal data by both Government authorities and multinational technology corporations, the Cyber and Data Protection Act has emerged as a potential solution, with stakeholders advocating enhanced data governance frameworks to protect citizens digital privacy and anonymity.\n\nDuring a sensitisation and awareness workshop on cyber and data protection held in Harare yesterday, Permanent Secretary for Information Communication Technology, Postal and Courier Services, Dr Beaullar Chirume, said Parliament enacted the Cyber and Data Protection Act to safeguard sensitive personal and institutional data from cyber threats and breaches.\n\nEvery day, Government entities process vast amounts of sensitive personal and institutional data that must be safeguarded against breaches, misuse, and cyber threats. The trust that citizens place in our systems depends on how well you protect their information.\n\nDr Chirume warned that this trust could be undermined by the increasing prevalence of cybercrime, data breaches, and privacy violations, which threaten national security and public confidence in digital services.\n\nThe Cyber and Data Protection Act, promoted by the Postal and Telecommunications Regulatory Authority of Zimbabwe (POTRAZ), aimed to regulate how companies collect, store, and process personal information while addressing cybersecurity and cybercrime issues within the country.\n\nAs Government accelerates digital transformation under the National Development Strategy 1, Dr Chirume highlighted the importance of enforcing data protection measures to ensure the success of e-government, e-commerce, and digital financial services.\n\nDirector of the Data Protection Unit at POTRAZ Mrs Tsitsi Mariwo said protecting individuals personal information was essential for upholding human dignity and fostering trust in digital services.\n\nIt is a right of a person to be free from intrusion or publicity of information or matters of a personal nature, she said.\n\nCitizens trust was earned when their data was securely handled and not leaked unnecessarily, causing them harm.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Dr-Beaullar-Chirume-680x380.jpg",
            "description": "Obey Musiwa-Herald Reporter FOLLOWING concerns raised by Zimbabweans regarding the collection of personal data by both Government authorities and multinational technology corporations, the Cyber and Data Protection Act has emerged as a potential solution, with stakeholders advocating enhanced data governance frameworks to protect citizens’ digital privacy and anonymity. During a sensitisation and awareness workshop on […]",
            "time": "06:33",
            "date": "07 Mar 2025"
        },
        {
            "title": "Geo Pomona a thoroughly impressive establishment, says CBZ Holdings boss",
            "url": "https://www.herald.co.zw/geo-pomona-a-thoroughly-impressive-establishment-says-cbz-holdings-boss/",
            "content": "Wallace Ruzvidzo-Herald Reporter\n\nThe Geo Pomona Waste Management facility is a thoroughly impressive establishment, hence the need to build on its success to ensure that the rest of the country and region benefit from the establishment of such facilities, CBZ Holdings group chief executive Mr Lawrence Nyazema has said.\n\nCBZ Holdings executives were yesterday led on a familiarisation tour of the waste management facility by Geo Pomona chief executive and executive chairman Dr Dilesh Nguwaya.\n\nIn an interview after the tour, Mr Nyazema said they had been in partnership with the waste management firm from the beginning and were looking to scale up the scope of their collaboration.\n\nAs CBZ, our theme is we are partners for success. We have been in partnership with Geo Pomona from day one, he said.\n\nThere is still more to be done, a big need for modern equipment to come in, and one of the reasons I was impressed is everything is so modern.\n\nI was asking earlier on to say when the city was dumping here, what was the game planit looks like there was no game plan, and for the first time in our lives, we now have a game plan to say this is how we are going to manage waste.\n\nMr Nyazema said the establishment of such a facility was one of Zimbabwes success stories, adding that the general citizenry needed to be made fully aware of its existence and operation.\n\nSo the transformation from a dump site to a waste management facility is a key success that we have recorded as Zimbabweans over the past few years.\n\nAnd I think we should build on that success to ensure that not only Harare benefits, but the rest of the country and indeed the rest of the SADC region before we look at other regions in Africa. I have been thoroughly impressed.\n\nThis is a first on the continent, and its something that we can easily export to other parts of the continent, and indeed other parts of the global village.\n\nI was saying earlier on that I have been having a look at this site from afarit is very impressive, and what I was saying to Doc (Dr Nguwaya) is that the average Zimbabwean is yet to hear the full story.\n\nWe have seen snippets of it, and thanks to our media, but I think we need the end-to-end story to be told to our people, he said.\n\nDr Nguwaya said the waste management firm is working tirelessly to mop-up waste at illegal dumpsites.\n\nHe said the waste management firm had been collecting considerable amounts of waste from the illegal sites since early last month.\n\nSo far we have done well in terms of waste collection (at illegal dumpsites). If you check our statistics, when we started on 10 February, our statistics have been going up.We are collecting 1 500 tonnes to 2 000 tonnes per day, which is a significant figure, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Geo-Pomona-680x380.jpg",
            "description": "Wallace Ruzvidzo-Herald Reporter The Geo Pomona Waste Management facility is a “thoroughly impressive” establishment, hence the need to build on its success to ensure that the rest of the country and region benefit from the establishment of such facilities, CBZ Holdings group chief executive Mr Lawrence Nyazema has said. CBZ Holdings’ executives were yesterday led […]",
            "time": "06:33",
            "date": "07 Mar 2025"
        },
        {
            "title": "EDITORIAL COMMENT : Harare water system now on the rise",
            "url": "https://www.herald.co.zw/editorial-comment-harare-water-system-now-on-the-rise/",
            "content": "This week will be marked by those who keep records as the low point in the Harare Metropolitan water supply and the turning point as from now on things can only get better, slowly at first but increasingly more rapidly as the whole mess is sorted out and put on a viable financial and engineering footing.\n\nIt is crucial that the finances are sorted out, so that everyone receiving water from the treatment plants in the province pays for what they actually receive rather than some arbitrary minimum that might never arrive or some estimate that makes zero sense. On the other side, those who simply do not pay bills or who have plumbed in a by-pass around their meter need to join the ranks of those who pay.\n\nThe engineering mess is partly the result of the financial mess, with not enough money spent on maintaining the infrastructure of treatment and distribution of water, lack of funds at times to buy treatment chemicals, and even lack of patches and spare parts to fix faults and leaks. The general disorganisation and corruption at upper levels of the Harare City Council have added to the general malaise, with the often competent technical staff given zero backing and zero resources.\n\nThis has now changed. A new entity has taken over the treatment, distribution and billing of the water, presumably across the whole metropolitan province since this is fed by Harare City Council. Or at least it has taken over de facto even if Harare City Council thinks it still owns and controls everything.\n\nWhy Mayor Jacob Mafume thought that publicly maintaining council ownership was reassuring is difficult to understand, considering the record of his council over the past quarter century as one of the best water systems in Africa, doubled in size in the 1980s after independence, was eroded and almost destroyed and now delivers far less water than the old colonial and far smaller city managed before independence.\n\nThe new system is a joint venture by Government, Harare City and Chinese companies. If it has not already been made a formal entity this should be done, to make it clear who carries the effective control and responsibility.\n\nThe main water works, the Morton Jaffray works near Lake Chivero dam wall, were this week handed over, so that the process of making sure what is still working can continue working while the larger part of the works, now non-operational, is brought back into commission.\n\nMeanwhile, the finances can be sorted. A shipment of 650 000 prepaid meters is on the high seas and due for delivery within weeks.\n\nThis is more than enough to give every household and every business in the metropolitan province its own prepaid meter. Depending on what sort of plumbing staff is lined up, it will take time to connect such a meter for every user, but the sooner we start the better.\n\nWe assume that the meters are sufficiently modern that payment will be easy. What almost everyone wants is the same sort of payment system that Zesa uses, that people can grab their phone at 2am on Sunday morning and buy some water using mobile money or, at least for larger users, online banking.\n\nHarare City Councils bright idea when it was testing prepaid meters some years ago was for people to carry their smart card, assuming they had not lost it, to one of the two city centre offices and stand in a long queue during business hours to have it recharged. That alone made the system wrong.\n\nSecondly, as people are connected to a prepaid meter their rates account must be immediately changed so that the water charges do not appear. This has been possibly the biggest bone of contention for years, that people are expected to pay for water they do not get, or only get as occasionally.\n\nThe lack of a proper financial system at Harare City Council will probably make this harder, but some method must be in place to make sure it is implemented in tandem with the prepaid meter installations.\n\nThirdly, the opportunity should be taken to make sure all flats in a block, and all businesses in a joint premises, have their own individual meters, just as Zesa gives everyone their own individual electricity meter. Shared meters are a disaster and become an even bigger one with prepaid meters.\n\nThese meters should be giving the water entity a decent cash flow, which they will need as they take a very deep breath and rebuild the treatment plants and start the lengthy process of repairing and replacing all sections of the distribution network, the piping, the pumps and the reservoirs. But each extra cubic metre they can treat and deliver without losses increases their cash flow, and so makes more money available.\n\nThe pricing of the water will cause some debate. There is no water regulator, and for a near monopoly there should be one, or at least some independent authority that can look at the financial needs and see what price would be fair for a very efficient provider. Consumers should not be asked to pay for inefficiency and waste.\n\nWe would assume that as leaks are sorted out, or pipe sections replaced if they are totally rotten, and because of the prepaid meters everyone paying for what they get, then the present rates will probably be close to what is needed and any adjustments can be explained and justified.\n\nGuaranteed water supplies 24/7 will make consumers more willing to think about a properly presented charge schedule, especially if the water accounts are properly and regularly audited.\n\nWe doubt that Harare City Council has been spending even the water levies it includes on its rates account on water for some time, considering the other more urgent demands such as fancy cars and foreign holidays for senior staff.\n\nWhoever sets the water rates could take another leaf out of the ZESA book and have a lower rate for the first essential number of units and then increase charges later on.\n\nThat is justified by letting everyone have a small ration of water using the old inherited capital investment.\n\nThere used to be such a system in past, and so it not anything brand new.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/07/water.jpg",
            "description": "This week will be marked by those who keep records as the low point in the Harare Metropolitan water supply and the turning point as from now on things can only get better, slowly at first but increasingly more rapidly as the whole mess is sorted out and put on a viable financial and engineering footing.",
            "time": "06:33",
            "date": "07 Mar 2025"
        }
    ]
}