{
    "news": [
        {
            "title": "President sets empowerment record in agric . . . Hands over tractors, combine harvesters to youths . . . To pay 50pc of equipment costs from own pocket",
            "url": "https://www.herald.co.zw/president-sets-empowerment-record-in-agric-hands-over-tractors-combine-harvesters-to-youths-to-pay-50pc-of-equipment-costs-from-own-pocket/",
            "content": "Theseus Shambare-Herald Reporter\n\nPresident Mnangagwa has handed over 72 tractors and 10 combine harvesters sourced from Belarus with a combined value of US$7,4 million to youths to boost their participation in agriculture.\n\nHe also announced a complementary initiative worth US$10 million to set up irrigation systems for Youth Business Units, as he delivers on his promise to facilitate young peoples participation in the economy.\n\nAt the handover ceremony, which took place at the Agricultural Mechanisation Facility in Hatcliffe, Harare, yesterday, President Mnangagwa pledged to pay 50 percent of the total cost for the cutting-edge equipment from his own pocket.\n\nThe latest initiative is a follow up to the Presidential Youth Empowerment Revolving Fund which was launched by the President at the Harare International Conference Centre.\n\nThe Government is buying tractors from Belarus to resell to farmers under flexible financing terms through Empower Bank.\n\nThe programme also comes with a three-year repayment period, no collateral and an interest rate of 7,5 percent per annum.\n\nFor the Youth Mechanisation Facility, the President is paying US$3,7 million from his own pocket and youths will pay the balance.\n\nFarmers accessing the facility will receive heavy-duty tractors, including the 81, 107, 130 and 155 horsepower models.\n\nOverall, this year, the country will take delivery of 800 units of advanced farm equipment from Belarus, including over 700 tractors.\n\nOfficiating at the event yesterday, Lands, Agriculture, Fisheries, Water and Rural Development Minister Dr Anxious Masuka said the equipment is intended to be distributed among youth business clusters as part of the Governments broader strategy to modernise agriculture and create employment opportunities for young people.\n\nI appreciate and know the role of mechanisation as an enabler of agricultural modernisation, and accelerating agricultural transformation.\n\nIt is in this regard that today we gather here to formally hand over 72 tractors and two of 10 combine harvesters availed by the President, His Excellency Dr ED Mnangagwa, to accelerate the transformation of the agricultural space, said Dr Masuka.\n\nHe outlined the potential impact of the equipment.\n\nLands, Agriculture, Fisheries, Water and Rural Development Minister Dr Anxious Masuka (second from left), Youth Empowerment, Development and Vocational Training Minister Tino Machakaire (second from right), African National Congress Youth League president Collen Malatji (left) and Chief Director in the Ministry of Agriculture Engineer Samuel Edwin Zimhunga (right) walk past the tractors during their handover to youths in Harare yesterday.  Picture: Memory Mangombe.\n\nWith 72 tractors, you can till on average, we say, one horsepower per one hectare . . . so, 72 tractors are able to do 7 700 hectares.\n\nSo, it is an additional area that we want tilled for agriculture starting this winter and more importantly going into summer, Dr Masuka said.\n\nHe further projected that the initiative could yield substantial returns.\n\nAnd once this area has been tilled, my expectation is that being youth, your average yield will be nowhere near or less than five tonnes per hectare and with two crops a year, it means that these tractors will enable 77 000 metric tonnes of grain to be delivered to the Grain Marketing Board and other marketers. My expectation therefore is that the value addition as a result of this intervention will be US$26 million, Dr Masuka said.\n\nThe minister stressed the importance of accountability and proper utilisation of the equipment.\n\nThese tractors ought to be used for the specified purpose. The President said these are not charitable gifts. These go into defined youth business clusters through the right channels of a business. Long gone are the days where Government used to distribute tractors and there was no accountability.\n\nThe US$10 million irrigation support, he said, is channelled through the Agricultural Finance Corporation (AFC), and seeks to complement the recent distribution of farm equipmentand boost youth participation in agriculture.\n\nYesterday (Tuesday) evening, we had a discussion with the President regarding the US$10 million for irrigation support for youths to complement these efforts and that money is now going to be available through AFC and we will be making an announcement shortly.\n\nWe also hope that Empower Bank will be able to participate so that in addition to getting the tractors, they are now also able to get accelerated irrigation development assistance, said Dr Masuka.\n\nThe irrigation funds, he said, are intended to provide young farmers with the necessary resources to implement efficient and sustainable farming practices, particularly in light of climate change and fluctuating rainfall patterns.\n\nYouth Empowerment Development and Vocational Training Minister Tino Machakaire expressed gratitude for the Presidents initiative and emphasised that the equipment should be used specifically for agriculture.\n\nThis equipment must benefit the youths and the nation at large through agriculture production as we strive to achieve food security, said Minister Machakaire.\n\nReceiving the equipment, provincial youths representatives thanked the President for fulfilling his pledge.\n\nAfrican National Congress party of South Africa Youth League president, Cde Thlologelo Collen Malatji, witnessed the handover ceremony.\n\nHe described the initiative as a milestone in capacitating young people.\n\nWe expect other leaders to take a leaf from President Mnangagwas generosity in investing in future leaders. An empowered youth will be able to protect and safeguard the countrys interests without being compromised by national detractors, he said.\n\nZanu PF National Youth League Secretary General Cde Tendai Chiwetu said youths are grateful to President Mnangagwa for the empowerment initiative.\n\nWe have never seen this type of empowerment before. As the Youth League, we look forward to the sustainability of the project. I would also want to thank the leadership of Minister Machakaire for ensuring no one and no place is left behind as the President always says, he said.\n\nHarare Province Zanu-PF Youth Chairman Cde Emmanuel Mahachi said the empowerment initiative is responsive to the calls made by young people for empowerment.\n\nYouths make up over 60 percent of the national population and it will not be ideal to ignore such an important demographic on issues to do with food security and economic empowerment, he said.\n\nMatabeleland South Zanu-PF provincial youth chairman Cde Moses Langa said the equipment will go a long way in ensuring the province boosts livestock production.\n\nWe require tractors in our livestock production and these modern tractors are a key input. Indeed, we will utilise them for the betterment of the sector, he said.\n\nZanu-PF Mashonaland West provincial secretary for legal affairs Cde Decide Mananzva said the province will ensure that only youths in agriculture will benefit.\n\nAs we have promised the President before, for accountability purposes, we will ensure that only those who are active in agriculture benefit. This is not mining equipment but agriculture, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/President-Mnangagwa-1-680x380.jpg",
            "description": "Theseus Shambare-Herald Reporter President Mnangagwa has handed over 72 tractors and 10 combine harvesters sourced from Belarus with a combined value of US$7,4 million to youths to boost their participation in agriculture. He also announced a complementary initiative worth US$10 million to set up irrigation systems for Youth Business Units, as he delivers on his […]",
            "time": "08:43",
            "date": "03 Apr 2025"
        },
        {
            "title": "Mystery over council’s vanished US$4,5m loan deepens",
            "url": "https://www.herald.co.zw/mystery-over-councils-vanished-us45m-loan-deepens/",
            "content": "Trust Freddy-Check Point Desk\n\nThere was no agreement in place for Harare City Councils US$4 500 000 loan advanced to Harare Quarry Private Limited, its purported subsidiary.\n\nCouncil was also not listed as a shareholder, with evidence showing that two of its former employees were registered as shareholders, The Herald has learnt.\n\nThis comes amid revelations that Harare Quarry has been operating in secrecy, failing to declare its revenue, profits or dividends to council since 2018, with salaries amounting to US$56 000 suspected to have been given to ghost workers for 11 months.\n\nOther millions of dollars could not be accounted for as there were no payment vouchers and other relevant documentation.\n\nA special audit report conducted by Parker Randall Chartered Accounts for the period between December 1 2017 to June 30, 2019, revealed that when Harare Quarry received the US$4,5 million loan, its shareholders were then Chamber Secretary Mrs Josephine Ncube and former director of Works Mr Philip Mabingo Pfukwa as reflected by statutory documents lodged with the Registrar of Companies on August 10, 2016.\n\nThe firm was engaged on June 12, 2021 to conduct its forensic audit, but its findings had never been made public by the council. The special audit report showed that Harare City Council was never listed as a shareholder of Harare Quarry.\n\nLegal experts are warning that council risks losing its companies, amid indications that the subsidiaries, including Harare Quarry and Rufaro Marketing, are registered in the names of individuals, some of whom have since left the local authority.\n\nMrs Ncube and Mr Pfukwa took one share each out of the authorised shares amounting to 20 000 as appearing on a memorandum of association dated August 10, 2016.\n\nHaving individuals registered as shareholders of Harare Quarry, a company purported to be a subsidiary of Harare City Council, exposes both Harare City Council and Harare Quarry to potential litigation as the ownership can be disputed based on the Company registration documents lodged with Registrar of Companies,noted the audit findings.\n\nIt also emerged that there were no monthly payroll summaries prepared for the period 1 December 2017 to 31 October 2018.\n\nThis allegedly exposed Harare Quarry to potential financial losses arising from payment of ghost employees and salaries that were above the stipulated amounts on contracts of employment.\n\nThere were no payment vouchers for all the payments amounting to US$4 566 407.61 made during the period under audit. Absence of payment vouchers implies either payments made during the period under audit were not authorised or management that was in office during the period under audit deliberately removed payment vouchers from office thereby concealing audit trail.\n\nThe audit further revealed that salaries paid during the period 1 December 2017 to 31 October 2018 amounted to US$56 437.79.\n\nThe report noted that the absence of a signed agreement was a sign of a poor corporate governance practice as loans between separately registered parties (regardless of being related parties) must be based on a signed loan agreement which states terms and conditions that include interest rate, repayment terms and repayment period.\n\nIn separate interviews, residents blasted Harare City Council for not following due process, saying this explains why it is taking time for culprits to be arrested.\n\nIts difficult to investigate such a case and probably, that is why no one has been arrested for the past three years, an accountant who requested anonymity said.\n\nThe absence of a loan agreement can lead to lengthy and costly litigation, as the parties involved may need to rely on other evidence, such as witness testimony, emails, and bank statements, to establish the terms of the loan and the obligations of the parties involved.\n\nThe director of the Combined Harare Residents Association (CHRA), Mr Rueben Akili, described the scandal as just a tip of the iceberg of looting of council resources.\n\nThis exposure is an indicator of the status of the bleeding of council resources at the moment. It is worrying that these activities have been allowed to happen over many years, in full view of the councillors.\n\nUnfortunately, the same people who are supposed to fight for reclaiming such institutions are also looking for opportunities to loot. It is difficult at the moment because people who claim to fight for sanity are also interested in grabbing those companies, said Mr Akili.\n\nDespite a 2021 recommendation to update statutory documents lodged with the Registrar of Companies to include Harare City as a shareholder, the city has yet to implement the changes.\n\nThe Herald checked with the Registrar of Companies last week and found that only Mrs Ncube and Mr Pfukwa are listed as shareholders, nearly four years after the recommendation.\n\nAlthough the statutory documents lodged with the Registrar of Companies cite the two sole shareholders, each holding one share out of the authorised 20,000 shares, Mr Pfukwa distanced himself although there was no proof of such.\n\nNo, I am not a shareholder. I gave up my shares about a year ago, he told The HeraId.\n\nHe acknowledged being tasked with spearheading the revival of Harare Quarry in July 2017, but clarified that he resigned by the end of 2017 and, therefore, never had the opportunity to utilise the US$4.5 million allocated for the project.\n\nEfforts to obtain a comment from Mrs Ncube were unsuccessful, as her phone went unanswered.\n\nWhen contacted for comment, Harare Mayor Jacob Mafume said Harare Quarry had been returned to Harare City Council, emphasising that it had never been transferred to any individual.\n\nHe also described the statutory documents lodged with the Registrar of Companies as a mere piece of paper, adding that it does not transfer ownership of Harare Quarry away from Harare City Council.\n\nHarare Quarry is still under Harare City Council; the two were just nominal shareholders, and it was never transferred to anyone.\n\nIn fact, Harare Quarry Private Limited, in which the two individuals had shares, has become defunct. We still own the quarry, as it was merely a company that had no actual quarry and belonged to Harare City.\n\nIts similar to City Parks parking bays, which have always belonged to the council and will remain under Harare City Councils ownership, even if the company is dissolved.\n\nDespite a recommendation from the audit that a loan agreement was necessary, Mayor Mafume claimed there was no need for it, saying since Harare Quarry is a subsidiary of Harare City Council, drafting a loan agreement would be equivalent to signing one with ourselves.\n\nAccording to the Harare Quarry Managements comments in the audit, they tried to obtain loan agreement documents from the City Council but were unsuccessful.\n\nAs a result, US$4.5 million remained unutilised from November 2017 to May 2018.\n\nThe management also acknowledged that the issue of shareholdings was raised at the annual general meeting on 16 November 2020 and the process of rectifying the anomaly was underway.\n\nHowever, a cross-check done by The Herald revealed that, nearly five years later, the anomaly remains unrectified.\n\nMayor Mafume also told the Checkpoint desk that he had finally reported the case to the police.\n\nWe reported the case just after the commission hearings and the CCD (Criminal Complaints Division) is now investigating the case, he said.\n\nNational Police spokesperson Commissioner Paul Nyathi could neither confirm nor deny the report, saying he wanted to verify the information with other departments before making any further comments.\n\nSome legal experts have warned that registering Harare City subsidiaries in the names of individuals, without evidence showing that they are merely nominal shareholders, may pose legal risks.\n\nMayor Mafume acknowledged that the two individuals are still listed as shareholders, but clarified that the council is working to remove them since a resolution to that effect was passed.\n\nEfforts to obtain a comment from City of Harares Acting Chamber Secretary, Advocate Warren Chiwawa, were unsuccessful.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/09/Mayor-Jacob-Mafume.jpg",
            "description": "Trust Freddy-Check Point Desk There was no agreement in place for Harare City Council’s US$4 500 000 loan advanced to Harare Quarry Private Limited, its purported subsidiary. Council was also not listed as a shareholder, with evidence showing that two of its former employees were registered as shareholders, The Herald has learnt. This comes amid […]",
            "time": "08:43",
            "date": "03 Apr 2025"
        },
        {
            "title": "Zim reaches education, justice sector milestones",
            "url": "https://www.herald.co.zw/zim-reaches-education-justice-sector-milestones/",
            "content": "Wallace Ruzvidzo-Herald Reporter\n\nIn the first 50 days of the first 100-day cycle of the year, the Government has seen through the completion of Mutawatawa New Magistrate Court, the registration of 57 schools across the country while the Gwanda New Court Complex is nearing completion.\n\nUnder President Mnangagwas leadership, the Second Republic has made significant strides in delivering on its promises to the people of Zimbabwe, with various initiatives and services having been rolled out across the country, towards improving the lives of the general citizenry.\n\nThis development push is part of the Governments broader vision to achieve an empowered and prosperous upper-middle-income society by 2030.\n\nIn line with the Governments thrust of decentralising services in the justice delivery system, several developments including the construction of Magistrates Courts and rehabilitation programmes for inmates have been rolled out.\n\nIn Tuesdays Cabinet meeting,Justice, Legal and Parliamentary Affairs Minister Ziyambi Ziyambi highlighted achievements under his purview as at day 50 of the first 100 day cycle of the year.\n\nConstruction of the super structure to ring beam and ring beam concreting of the Kwekwe New Magistrate Court in Midlands Province, and construction of the super structure to ring beam and ring beam concreting of Cowdray Park New Magistrate Court in Bulawayo are progressing, said Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere in a post-Cabinet media briefing.\n\nThe rehabilitation and reintegration of inmates through agriculture is another area that is progressing well under the Justice Ministrys purview, with successful production projects at Anju, Mazowe, Mutimurefu and Hurungwe Prison Farms.\n\nRehabilitation and reintegration of inmates through capacitating the Building Brigade was also successfully undertaken through construction works at the prisons farms.\n\nRehabilitation and reintegration of inmates through the MacDonald Bricks Inmates Employment Programme was also successful, with five ex-inmates having secured permanent employment at MacDonald Bricks, said Dr Muswere.\n\nUnder the Human Capital Development pillar of the National Development Strategy 1 (NDS1), the Second Republic has seen through the construction and registration of schools countrywide, pursuant to Governments thrust of an educated society.\n\nConstruction of a classroomblock at E.D. Mnangagwa Secondary School in Mutoko District, Mashonaland East Province is 80 percent complete.\n\nConstruction of the new, Gideons Secondary in Gutu, Masvingo Province is at 82 percent of completion; while construction of a block at a new school, Tamuka B Satellite in Bindura, Mashonaland Central Province has been completed.\n\nConstruction of a 10 classroom double-storey block including a computer laboratory at Harare High School in Mbare, HarareMetropolitan Province has been completed, while construction of a double-storey block and computer laboratory at Gangarahwe Primary School in Hurungwe, Mashonaland East is ongoing, said Dr Muswere.\n\nConstruction of a 2-storey classroom block at Karoi Junior School in Hurungwe District, Mashonaland West Province is nearing completion.\n\nConstruction works to upgrade the Runyararo Adventist in Masvingo, Sinoia Primary in Makonde District, Mashonaland West Province, Hozvi Primary, ECD Centre in Bikita, Coban Global Primary in Gweru, Mambodzvuku Secondary in Murehwa, Seke 2 High in Chitungwiza, Rusitu High in Chimanimani and St Pauls High in Gokwe are at an advanced stage.\n\nThe building of sustainable and affordable boarding facilities is also nearing completion at Progress College in Gweru, Gumbonzvanda in Hwedza, Tafira High in Murombedzi, Howard Secondary in Mazowe, Kadhanya Secondary and Donsa Secondary in Kwekwe, and St Marys in Hwedza.\n\nOn the Youth, Sport and Culture pillar of the NDS1, the construction of a Multipurpose Court at Karigamombe in Zvimba District, Mashonaland West Province, that will accommodate 3 sport codes, is almost complete.\n\nWork is also in progress to install bucket seats as part of the refurbishment of the National Sports Stadium in Harare, with those at the VIP area and bays 19, 20 and 21 having been installed.\n\nThis is progress that has been registered and at the same time I want to assure you that before year end, we believe that the National Sports Stadium will have been completed in terms of renovationsand we will be in a position to be able to have our games in Zimbabwe, said Dr Muswere.\n\nAhead of this year Independence Day, construction of Nembudziya Stadium in Gokwe South is also progressing well.\n\nThis years Independence commemorations will be held in Gokwe-Nembudziya, in line with Governments decentralisation of national events.\n\nApart from that, the Gym Facility in Warren Park, Harare Metropolitan Province has reached 80 percent of completion, with commissioning of the facility expected this month.\n\nTranslation of a summary version of the Intangible Cultural Heritage Capacity Building into five languages, namely: Venda, Sotho, Tonga, Ndau and Sign Language has been completed, and the project awaits printing and production of booklets. Works on the establishment of the Victoria Falls Gallery and at the National Arts Council of Zimbabwe Digital Registration Platform are ongoing, said Dr Muswere.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Minister-Muswere-680x380.jpg",
            "description": "Wallace Ruzvidzo-Herald Reporter In the first 50 days of the first 100-day cycle of the year, the Government has seen through the completion of Mutawatawa New Magistrate Court, the registration of 57 schools across the country while the Gwanda New Court Complex is nearing completion. Under President Mnangagwa’s leadership, the Second Republic has made significant […]",
            "time": "08:43",
            "date": "03 Apr 2025"
        },
        {
            "title": "Zanu PF intensifies campaign in Glen View",
            "url": "https://www.herald.co.zw/zanu-pf-intensifies-campaign-in-glen-view/",
            "content": "Talent Chimutambgi Zimpapers Political Hub\n\nZanu PF has intensified its campaign to win the Glen View South seat, with all structures ready to drum up support for the partys candidate ahead of by-elections set for April 12.\n\nTeams have been deployed to the constituency to hold road shows and door-to-door campaigns as the revolutionary party targets a resounding victory.\n\nSpeaking at a Community Engagement Meeting in Glen View yesterday, Local Government and Public Works Minister Daniel Garwe, who was the guest speaker, said service delivery was at the core of developmental programmes being spearheaded by President Mnangagwa.\n\nThe Second Republic, Minister Garwe said, would deliver better standards of living for the citizens of Zimbabwe.\n\nHe said the Government was facilitating title deeds for all residents who have been living in council houses for quite sometime, adding that they should stop paying rent with immediate effect.\n\nService delivery is at the centre of the Presidents heart, especially access to clean water and refuse collection. Currently Geo Pomona is collecting waste across Harare to ensure that we have a clean city, said Minister Garwe.\n\nAll Government stakeholders are on board to facilitate title deeds for all residents who have been staying in council houses for a long time. The rentals you have been paying are now enough to own those properties.\n\nMinister Garwe said President Mnangagwa had people at heart as exhibited by all developmental programmes he was implementing including the Emergence Road Rehabilitation Programme and Presidential Borehole Scheme.\n\nThe developmental programmes being spearheaded by President Mnangagwa give us an advantage and show that our leader is pragmatic and has people at heart. As we speak road rehabilitation has been rolled out under ERR and the borehole scheme is progressing countrywide, he said.\n\nThe Minister warned the municipal police against harassing vendors and housing cooperatives, adding that plans were afoot to build a proper market in Glen View as well as the construction of a furniture wholesale market at Area 8.\n\nHe took a swipe at former Zanu PF Central Committee member Blessed Runesu Geza over his unbecoming behaviour and disrespect for President Mnangagwa.\n\nMinister Garwe said people should respect the President and those working in cahoots with Geza should desist from fomenting divisions within the party.\n\nSpeaking at the same occasion, Special Advisor on Investments to the President Dr Paul Tungwarara revealed that President Mnangagwa has disbursed US$200 000 under the Presidential Revolving Fund for entrepreneurs to access loans to boost their businesses.\n\nDr Tungwarara said the loans were open to everyone.\n\nThe President has released USD 200 000 for the people of Glen View to get loans for those starters and also those already in entrepreneurship. The loans are accessible to every resident of Glen View, said Dr Tungwarara.\n\nMeanwhile, National Political Commissar Cde Munyaradzi Machacha officiated at a handover ceremony of solar boreholes and solar systems for electricity in Glen View.\n\nCde Machacha said the project was part of the Presidential Borehole Scheme being spearheaded by President Mnangagwa. He said the initiative will augment water supplies in the area and ease water shortages which are be-devilling the Glen View area.\n\nThis is what is at the core of President Mnangagwas heart, to ensure all residents have access to clean water and electricity as the country gravitates towards Vision 2030 of attaining a prosperous upper middle income economy, said Cde Machacha.\n\nZanu PF aspiring candidate Cde Tsitsi Tranquillity Tawomhera said she was poised for victory adding that the massive developmental projects being championed by the Second Republic led by President Mnangagwa had endeared the revolutionary party to the masses, positioning it way ahead of the opposition in terms of the election campaign.\n\nWe are not going to rule by force. We are going to rule by winning the hearts of the people through our actions. Look at what Zanu PF under the New Dispensation is doing, said Cde Tawomhera.\n\nThe Zanu PF candidate will contest against four other aspirants, including Tungamirai Madzokere who is standing as an independent candidate, Tonderai Chakaredza, another independent candidate,\n\nGeorge Makwangwaidze, also an independent candidate and Perpetua Mukanda representing the NCA party.\n\nI am confident that we will win the by-election. The electorate realised their mistake in the 2023 harmonised elections, said Cde Tawomhera.\n\nShe said Glen View will no longer experience a scourge of diseases associated with water woes.\n\nI would like to thank President Mnangagwa, on behalf of my fellow residents, for considering Glen View and ensuring access to clean and safe water.\n\nThis will save us from diseases such as cholera and typhoid, said Cde Tawomhera.Mrs Noreen Pedro, a resident, expressed gratitude to President Mnangagwa for the gesture and pledged to vote for Zanu PF during the upcoming by elections.\n\nI pledge my full support to the President. I want to say to him, fear not we are behind you. We thank you for giving us reliable electricity. We will no longer experience power cuts, said MrsPedro.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Local-Government-and-Public-Works-Minister-Daniel-Garwe-right-introduces-ZANU-PF’s-candidate-for-Glen-View-South-Constituency-Cde-Tsitsi-Tawomhera-680x380.jpg",
            "description": "Talent Chimutambgi –Zimpapers Political Hub Zanu PF has intensified its campaign to win the Glen View South seat, with all structures ready to drum up support for the party’s candidate ahead of by-elections set for April 12. Teams have been deployed to the constituency to hold road shows and door-to-door campaigns as the revolutionary party […]",
            "time": "08:43",
            "date": "03 Apr 2025"
        },
        {
            "title": "1,5 million tourists arrive in first quarter —  Rwodzi",
            "url": "https://www.herald.co.zw/15-million-tourists-arrive-in-first-quarter-rwodzi/",
            "content": "George Maponga-Masvingo Bureau\n\nZimbabwes tourism sector continues to be one of the main anchors of the march towards Vision 2030 after the country recorded around 1,5 million arrivals in the first quarter of this year, with 70 percent being returning residents from the diaspora, highlighting the strong relationship with those living outside the country.\n\nMinister of Tourism and Hospitality Industry Babra Rwodzi speaking yesterday at Masvingo Polytechnic during the First Lady Dr Auxillia Mnangagwas provincial Traditional Cookout Competitions said Zimbabwes tourism industry was a significant driver of the countrys economy contributing more than 12 percent of the national gross domestic product.\n\nInternational arrivals have increased to more than 1 million during the first quarter of this year, highlighting the significant growth of the tourism industry,she said.\n\nMinister Rwodzi said the First Lady deserved plaudits for Zimbabwes rebound as a tourist destination of choice.\n\nWe want to thank our First Lady for this cookout initiative and for being a patron who is giving us good direction that is even recognised by UN Tourism which even was forced to give us endorsement as a destination of choice, she said.\n\nThe cookout on-test that is now an annual event is a brainchild of Amai Dr Mnangagwa which seeks to grow gastronomy tourism.\n\nMinister Rwodzi said that since the inception of the United Nations Regional Forum on Gastronomy for Africa held last year in Victoria Falls, there has been a significant improvement in the tourism sector.\n\nAs of July last year up to this day, we have witnessed a number of tourists that are coming from the International markets because the UN Tourism has endorsed us.\n\nWe want our traditional foods to be marketed world-wide and very soon even our own our Air Zimbabwe will be introducing traditional meals daily, she said.\n\nShe also highlighted that the First Ladys traditional cookout competition had this year made new strides in promoting inclusivity by allowing people with disabilities to take part.\n\nAmai has this year introduced a new approach by bringing together people living with disabilities and men who can cook for their families. The idea promotes unity and inclusivity. This move also aligns with President Mnangagwas vision of living no one and no place behind, said Minister Rwodzi.\n\nParticipants were challenged by Minister Rwodzi to start offering catering services at such places as hospitals, funerals and weddings, upon receiving their certificates.\n\nThe Minister of State for Masvingo Provincial Affairs and Devolution Ezra Chadzamira said the presence of a talented cohort of competitors from several spheres at this years provincial competition dovetailed with President Mnangagwas mantra of leaving no one and no place behind.\n\nMinister Chadzamira said the competition created a platform to learn from Masvingos diverse culinary traditions.\n\nHe paid homage to First Lady Amai Dr Mnangagwa for conceiving the competition which was fuelling rapid growth of Zimbabwes gastronomy industry creating jobs and boosting household incomes in line with Vision 2030.\n\nMinister Chadzamira said the cookout competitions had rekindled interest in traditional grains that promoted healthy lives in line with the countrys rich traditions and culture.\n\nIntroduced by First Lady Dr Mnangagwa in 2019, the cookout competitions have promoted the countrys rich culinary heritage.\n\nSince inception of the competitions, the Ministry of Tourism and Hospitality Industry has led in their implementation in collaboration with provincial authorities and other government ministries.\n\nThe national finals are scheduled for May 25. Mr Courage Chirambadare from Masvingo district emerged the winner in the people with disabilities category while Masvingo Polytechnics Dorcas Chikondere scooped the first prize under the students category .\n\nMr Julius Musangeya from Clevers Hotel scooped the first position under the professional chefs category.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Ministers-Rwodzi-and-Chadzamira-680x380.jpg",
            "description": "George Maponga-Masvingo Bureau Zimbabwe’s tourism sector continues to be one of the main anchors of the march towards Vision 2030 after the country recorded around 1,5 million arrivals in the first quarter of this year, with 70 percent being returning residents from the diaspora, highlighting the strong relationship with those living outside the country. Minister […]",
            "time": "08:43",
            "date": "03 Apr 2025"
        },
        {
            "title": "Zimra’s TaRMS boosts tax registrations by 116pc since launch",
            "url": "https://www.herald.co.zw/zimras-tarms-boosts-tax-registrations-by-116pc-since-launch/",
            "content": "Thupeyo Muleya-Beitbridge Bureau\n\nTHE Zimbabwe Revenue Authority (Zimra)s digital transformation is sweeping across the countrys tax landscape, with new registrations on the recently introduced Tax and Revenue Management System (TaRMS) surging by 116 percent since 2023.\n\nTaRMS was introduced in December 2023, replacing the e-service system which was plagued by technical woes.\n\nZimra Commissioner-General, Ms Regina Chinamasa, said on Monday that the TaRMS had not only achieved a remarkable 100 percent uptime, but had enhanced taxpayer engagement, fundamentally changing how businesses and individuals interact with revenue collectors.\n\nZimra remains committed to leveraging technology to enhance service delivery, and TaRMS is at the forefront of this transformation, she said.\n\nIn the past year and a half, TaRMS recorded a 116 percent increase in taxpayer registrations, demonstrating its widespread adoption and effectiveness.\n\nMs Chinamasa said the systems impact extends far beyond mere registration figures.\n\nTaRMS has ushered in a new era of convenience and efficiency. All tax returns are now submitted online, eliminating the need for cumbersome manual processes.\n\nFor those without internet access, Zimras nationwide kiosks ensure no one is left behind, she said.\n\nTaRMS, which went live in October 2023, is expected to benefit taxpayers, enhance compliance and trade facilitation by the tax authority.\n\nIt came as a response to several challenges taxpayers faced, including difficulties in filing returns, lack of data integrity and cumbersome processes for tax payments and refunds.\n\nDesigned to foster voluntary compliance, and make tax management straightforward, the system encompasses functions such as taxpayer registration, tax return processing, tax payments and debt management.\n\nTaRMS also seeks to address challenges faced by taxpayers and ZIMRA officials, guaranteeing a more streamlined and user-friendly experience.\n\nMs Chinamasa said the revenue collector continued to work on bringing a new wave of convenient taxpayer experience.\n\nShe said TaRMS had streamlined registration through integrated validation, minimising errors and duplication.Real-time data updates maintain the integrity of taxpayer information, ensuring accuracy and transparency.\n\nThe systems self-service platforms empower taxpayers to manage accounts, update details, and view ledgers 24/7, significantly reducing the need for physical visits, said the Zimra commissioner general.\n\nA key innovation is the automated processing of ITF263 (Tax Clearance Certificates), eliminating delays.\n\nFurthermore, the system has successfully registered 637 tax agents, enhancing professional engagement within the tax ecosystem.\n\nThe integrated payment systems ensure secure and accurate allocation of payments, fostering trust and transparency. TaRMS is not just a transactional tool; its a robust digital infrastructure supporting national revenue management and taxpayer engagement.\n\nMs Chinamasa added that TaRMS was built on a foundation of strong cybersecurity, safeguarding sensitive taxpayer data.The systems 100 percent uptime demonstrates its reliability and the rigorous testing it has undergone.She said it has the ability to handle peak return submissions, coupled with its 24/7 accessibility and real-time account management.\n\nTaRMS is more than just a software upgrade; its a paradigm shift, signalling Zimras dedication to modernising tax administration and fostering a more efficient and transparent tax environment for all Zimbabweans, Ms Chinamasa added.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/03/Acting-commissioner-general-Regina-Chinamasa.jpg",
            "description": "Thupeyo Muleya-Beitbridge Bureau THE Zimbabwe Revenue Authority (Zimra)’s digital transformation is sweeping across the country’s tax landscape, with new registrations on the recently introduced Tax and Revenue Management System (TaRMS) surging by 116 percent since 2023. TaRMS was introduced in December 2023, replacing the e-service system which was plagued by technical woes. Zimra Commissioner-General, Ms […]",
            "time": "08:43",
            "date": "03 Apr 2025"
        },
        {
            "title": "Zimbabwe to accede to aviation safety protocol",
            "url": "https://www.herald.co.zw/zimbabwe-to-accede-to-aviation-safety-protocol/",
            "content": "Mukudzei Chingwere-Herald Reporter\n\nCABINET has approved the accession to the protocol incorporating Article 3BIS into the convention on International Civil Aviation, commonly known as the Chicago Convention, aimed at enhancing aviation safety.\n\nThe announcement was made by Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere during a post Cabinet media briefing on Tuesday.\n\nThe protocol aims to ensure that civil aviation aircraft in flight are protected from the use of weapons during interceptions, prioritising the safety of passengers and crew.\n\nDr Muswere said the adoption of the protocol aligns Zimbabwe with international standards and demonstrates the Governments commitment to aviation safety.\n\nUnder the legislative programme, Cabinet considered and approved the accession to the protocol incorporating article 3BIS into the convention on the International Civil Aviation (Chicago Convention), he said.\n\nDr Muswere said the objective of the Protocol Incorporating Article 3BIS into the Convention on the International Civil Aviation (Chicago Convention) is to ensure the non-use of weapons against civil aviation aircraft in flight, so that in case of interception, the lives of persons on board and the safety of aircraft must not be endangered.\n\nThe benefits of acceding to the Protocol include enhancement of aviation safety and security through protection of lives, ensuring smooth aircraft operations, guaranteed prevention of unlawful interference, and maintenance of public trust in the sector and airspace.\n\nBy acceding to the Protocol, Zimbabwes legal framework will conform to the obligations of the Chicago Convention which most progressive nations of the World are party to.\n\nThe decision to join the protocol is expected to bolster public trust in Zimbabwes airspace and contribute to a safer travel environment for both domestic and international flights.\n\nIt also positions Zimbabwe alongside progressive countries that have already embraced these essential safety measures.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Dr-Muswere-new-680x380.jpg",
            "description": "Mukudzei Chingwere-Herald Reporter CABINET has approved the accession to the protocol incorporating Article 3BIS into the convention on International Civil Aviation, commonly known as the Chicago Convention, aimed at enhancing aviation safety. The announcement was made by Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere during a post Cabinet media briefing on Tuesday. The […]",
            "time": "08:43",
            "date": "03 Apr 2025"
        },
        {
            "title": "Japan-funded schools offer hope to Nyaminyami learners",
            "url": "https://www.herald.co.zw/japan-funded-schools-offer-hope-to-nyaminyami-learners/",
            "content": "Conrad Mupesa-Mashonaland West Bureau\n\nLEARNING has taken a transformative turn for learners in the Nyaminyami rural area of Kariba, thanks to the construction of modern classrooms and administrative buildings at three local schools.\n\nThis groundbreaking initiative, valued at over US$1 million and launched on Wednesday, was led by the Adventist Development and Relief Agency (ADRA)the humanitarian arm of the Seventh Day Adventist Churchwith generous support from the Embassy of Japan in Zimbabwe.\n\nJust a year ago, life in these makeshift classrooms was fraught with danger.\n\nTake the story of Patronage Lunga, a Grade Seven pupil at Malembeja Primary School, for instance.\n\nIn an alarming encounter with a puff adder, he barely escaped a venomous bite while attending classes in a thatched structure.\n\nThe scene turned chaotic as startled learners bolted from the classroom, leaving the teacher to confront the snake.\n\nWe were in class when the snake came close, and fear took over, Patronage recounted.\n\nWe often faced dangers like scorpions, and lessons were interrupted by rain that poured into our classrooms.\n\nThe conditions were dire.\n\nHeavy rains frequently disrupted lessons, while the poorly thatched roofs exposed learners to the elements, increasing the risk of illness.\n\nNyaminyami falls under ecological region five, which suffers from insufficient rainfall, severely limiting the quality of grass available for thatching.\n\nConsequently, parents struggled to provide adequate shelter for these classrooms.\n\nMany pupils missed classes during the rainy season because we couldnt stay dry, Patronage added wistfully.\n\nMrs Sorei Gumbo, a dedicated teacher at Sahwira Makwande Primary School, expressed gratitude for the much-needed classroom blocks.\n\nBefore this construction, we were stuck in a perpetual struggle to create lasting structures. The low rainfall meant less income from school fees, and the challenges seemed insurmountable.\n\nThe new classrooms present a renewed chance for academic success, especially for the Grade Seven pupils who will now be taking their national examinations closer to home.\n\nIn the past, these learners trekked nearly seven kilometres to registered schools, struggling with long journeys and carrying their own chairsa situation that hindered their performance.\n\nOur pupils faced significant hurdles just to write their exams, explained Mr Shepherd Nhimura, a senior teacher at Malembeja Primary.\n\nThe long distance heavily impacted their success rates.\n\nMavis Makuwerere, a hopeful learner whose siblings once grappled with similar challenges, expressed her determination to excel.\n\nMy sisters and brother didnt do well because of the long distances they had to travel.\n\nBut now that I can take my exams here, Im ready to give it my all! she said.\n\nChief Msampakaruma, representing Chief Negande and Chief Nebiri, highlighted the importance of this development.\n\nThis initiative was long overdue. Were grateful to the Government for allowing ADRA to operate in Kariba. With partners like them, we are moving closer to realising the Vision 2030 set forth by President Mnangagwa.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/04/Zim-Japan.jpg",
            "description": "Conrad Mupesa-Mashonaland West Bureau LEARNING has taken a transformative turn for learners in the Nyaminyami rural area of Kariba, thanks to the construction of modern classrooms and administrative buildings at three local schools. This groundbreaking initiative, valued at over US$1 million and launched on Wednesday, was led by the Adventist Development and Relief Agency (ADRA)—the […]",
            "time": "08:43",
            "date": "03 Apr 2025"
        },
        {
            "title": "New e-passport centres set to enhance service delivery",
            "url": "https://www.herald.co.zw/new-e-passport-centres-set-to-enhance-service-delivery/",
            "content": "Debra Matabvu-Senior Reporter\n\nTHE Mutare e-passport enrolment centre has been completed and is poised to open to the public shortly.\n\nThis development comes as the Government plans to establish two additional centres in Masvingo and Beitbridge in the near future.\n\nAdditionally, an international e-passport centre in Zambia is also in progress, with work expected to commence before mid-year.\n\nRegistrar-General Henry Machiri confirmed that while the Mutare centre was initially scheduled for completion in the first quarter of the year, delays due to resource constraints had affected the timeline.\n\nThe structure is now complete, and what is now outstanding are issues such as electricity connection. It is set to be opened any time from now, he said.\n\nFocus has shifted to the upcoming centres in Masvingo and Beitbridge, with plans to begin work as soon as resources are available.\n\nThe Mutare office is now complete. It was supposed to be completed during the first quarter of this year. However, because of lack of resources, timelines were pushed back.\n\nThe structure is now complete and what is now outstanding are issues such as electricity connection. It is set to be opened any time from now. Focus has also shifted to Masvingo and Beitbridge and once resources are availed, work will also begin in these areas.\n\nIn terms of international centres, we are working one at a time. Work is underway for the one in Zambia and by May this year we would have made considerable progress, said Mr Machiri.\n\nFurthermore, London and New York have been identified as locations for e-passport offices aimed at serving Zimbabweans in the diaspora.\n\nLast year, the Government successfully opened an e-passport centre at the Zimbabwean consulate in Johannesburg, South Africa.\n\nThese initiatives are part of the Governments efforts to decentralise passport services and enhance convenience for Zimbabweans worldwide.\n\nIn its 2025 national budget, the Government allocated resources for renovations of major chanceries, including those in London.\n\nAdditional funds have been earmarked for renovating embassies in Nigeria and Germany.\n\nThe Minister for Finance, Economic Development and Investment Promotion, Professor Mthuli Ncube, said ongoing construction works at various institutional buildings, including embassies, will prioritise boosting morale and improving service delivery.\n\nTo date, at least 14 passport offices have been established nationwide, with over 100 000 e-passports issued since their introduction in January 2022.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/E-passports-graphic-680x380.jpg",
            "description": "Debra Matabvu-Senior Reporter THE Mutare e-passport enrolment centre has been completed and is poised to open to the public shortly. This development comes as the Government plans to establish two additional centres in Masvingo and Beitbridge in the near future. Additionally, an international e-passport centre in Zambia is also in progress, with work expected to […]",
            "time": "08:43",
            "date": "03 Apr 2025"
        },
        {
            "title": "Editorial Comment: Breathalysers will bring down accidents, deaths",
            "url": "https://www.herald.co.zw/editorial-comment-breathalysers-will-bring-down-accidents-deaths/",
            "content": "THE major causes of road traffic accidents and deaths are speeding and driving while under the influence of alcohol or other mind-impairing drugs.\n\nDrugs and alcohol abuse are among the major contributors to almost 95 percent of accidents where driver error is the cause.\n\nZimbabwean road traffic laws are good and follow best international practice when it comes to laying out the legal parameters for safe driving. The penalties, which include suspensions or loss of licences as well as fines and in extreme cases jail sentences, also act as a major deterrent.\n\nThe problem has been enforcement.\n\nThe police have roadblocks on major highways to check vehicles that look as though they are unroadworthy or overloaded. The traffic section called out to most accidents is rather good at untangling the multitude of stories over what happened, working out what did in fact happen, and then assigning the blame.\n\nWhat has been missing is the ability to check for speeding and check for blood alcohol levels, two areas where checks should be routine, especially when the police suspect a driver is going too fast or has been drinking before driving. Now this equipment deficiency is being addressed with modern technology allowing accurate checks at fairly low cost.\n\nBreathalysers are new to Zimbabwe, although common in many countries, and Transport and Infrastructural Development Minister Felix Mhona has now publicly warned that these are being procured, initially for use at roadblocks.\n\nWe hope that the first units will be available for the upcoming Easter weekend, when a lot of people in a holiday mood tend to have a few drinks before driving around. The need to have all drivers on major highways, with their high speeds, in full control of their own bodies is obvious. If drivers know that they might be pulled over for a breathalyser test, they will probably be more careful about how much they drink before setting off.\n\nWe have seen reports where even some bus drivers were suspected of drinking while driving but the police until now have been unable to test or prove such allegations. Speed traps have the problem that if drivers know there is a trap camera at a road block, they slow down; but they cannot remove the alcohol from their blood as they approach a roadblock, so if tested will be caught.\n\nWe would also suggest that the traffic police units investigating accidents are also equipped from the first batch of breathalysers and routinely test all drivers involved in an accident, regardless whether the driver is the innocent or guilty party since in the early stages it is often difficult to work out who contributed most to an accident.\n\nAs time goes on and police become ever better equipped, then patrols can have this handy equipment and if they see someone swerving all over the road or driving in suspicious ways they can stop and test.\n\nThere will be probably some legal tests in the courts over breathalysers with some wanting to argue about their accuracy.\n\nModern equipment is remarkably accurate but if the courts are dubious then follow-up blood tests can be routine. In any case, Zimbabwean standards on alcohol blood levels are sufficiently strict that the police could easily give drivers that are say 10 percent over the limit the benefit of the doubt and still keep those whose driving is more seriously impaired off the road.\n\nSuch a policy would be even more effective if the borderline drivers were kept at the roadblock for a few hours so their alcohol levels decreased to well within the legal limits.\n\nZimbabwean law lays down a sensibly strict penalty for a driver who exceeds the limit of 70mg of alcohol per 100ml of blood. The fine is modest, but the driver loses their licence for a year, that is for a first offender. There is no mechanism for suspending licences in Zimbabwe so magistrates, when such cases emerge, simply cancel the licence and forbid the driver from taking tests to obtain a new one for a year.\n\nThis is somewhat better than a pure suspension since it also requires retesting for both the road knowledge in the provisional test and driving ability in the road test, and that might be useful.\n\nOne peculiarity about someone breaking traffic laws is that people actually boast about breaking the law. You frequently hear drivers proclaiming how fast they did a trip, with the times meaning they went frequently over the speed limit, or even boasting that they drive better after half a dozen beers. The same people would never think of stealing even ZiG1, or committing most other crimes.\n\nThose who feel that obeying road rules is not really contributing to safety should consider the statistics. In 2023, 2 099 people were killed and 9 955 were injured in 51 924 road accidents while last year the figures were similar with 2 015 people killed and 10 074 injured in 52 288 road traffic accidents.\n\nOne country where enforcement of road rules is very strict is Britain. In that country there is probably a 50-50 chance of being caught if youre over the alcohol limit, with the same mandatory 12 month driving ban. Speeding drivers are often caught with many police officers carrying speed cameras as part of their normal equipment.\n\nWith a little over four times the population of Zimbabwe, and probably about 30 times as many cars, Britain managed to record just 1 624 fatalities in the 12 months to the end of June 2023, and 1 607 in the next 12 months to the middle of last year. The number of accidents and injuries were higher than Zimbabwe, but nothing like as in proportion to population let alone the number of vehicles. So fanatical enforcement does pay big dividends.\n\nThe major effort underway to upgrade our highways and catch up on years of missed maintenance has the danger that accidents will be more serious as drivers will be able to drive faster and take more risks when they are impatient. This is another reason to build up our enforcement so that we can have decent roads without the downside.\n\nWe also need to make sure all drivers keep up to date on road law and the Highway Code.\n\nMost drivers study that excellent publication once in their lives, when swotting for their provisional licence, yet each new edition has excellent and updated advice and includes all the new road signs and other changes.\n\nCertainly those involved in even a minor accident should have to resit a provisional exam, so they will at least read the latest Highway Code, and as time goes on resitting the provisional test could become routine every 10 or so years to ensure that all drivers keep up to date. Such retesting would be a cheap way to make sure drivers were more aware.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Mhona.jpg",
            "description": "THE major causes of road traffic accidents and deaths are speeding and driving while under the influence of alcohol or other mind-impairing drugs. Drugs and alcohol abuse are among the major contributors to almost 95 percent of accidents where driver error is the cause. Zimbabwean road traffic laws are good and follow best international practice […]",
            "time": "08:43",
            "date": "03 Apr 2025"
        }
    ]
}