{
    "news": [
        {
            "title": "Tugwi-Mukosi Dam now spilling",
            "url": "https://www.herald.co.zw/tugwi-mukosi-dam-now-spilling/",
            "content": "George Maponga in Masvingo\n\nTugwi-Mukosi Dam, the countrys largest inland water body has spilled.\n\nThe dam, domiciled in southern Chivi at the confluence of Tugwi and Mukosi Rivers spilled following heavy rains that have been pounding the Runde catchment in Masvingo.\n\nTugwi-Mukosi has a capacity of 1,8 billion cubic metres and supplies irrigation water to the Lowveld cane plantations.\n\nThe news of the dams spilling has become sweet music in the ears of farmers. Zimbabwe Sugar Development Association (ZSDA) chairperson Mr Elisha Tamirepi says spilling of the reservoir is a boon for Lowveld farmers.\n\nWe are happy as farmers in the Lowveld because the spilling of Tugwi-Mukosi dam means we have irrigation water for two or three years, he said.\n\nThe rains have brought relief because it is not only Tugwi-Mukosi Dam that has spilled but other water bodies that irrigate the Lowveld have also impounded significant inflows.\n\nThe countrys largest interior dam last spilled in 2022. Tugwi-Mukosis spilling comes as another dam in Masvingo, Lake Mutirikwi, also started spilling two weeks ago after heavy rains across the province.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/01/2401HR0682PAGE-4-B-TUGWI.jpg",
            "description": "George Maponga in Masvingo Tugwi-Mukosi Dam, the country’s largest inland water body has spilled. The dam, domiciled in southern Chivi at the confluence of Tugwi and Mukosi Rivers spilled following heavy rains that have been pounding the Runde catchment in Masvingo. Tugwi-Mukosi has a capacity of 1,8 billion cubic metres and supplies irrigation water to […]",
            "time": "18:30",
            "date": "21 Feb 2025"
        },
        {
            "title": "Zimbabwe’s prosperity lies in youths: President Mnangagwa",
            "url": "https://www.herald.co.zw/zimbabwes-prosperity-lies-in-youths-president-mnangagwa/",
            "content": "Zvamaida Murwira in Bulawayo\n\nThe prosperity of the country and Africa as a whole lies in the youths and it is critical to remain united to realise both national and continental goals, President Mnangagwa has said.\n\nHe was delivering a keynote address during the National Youth Day celebrations where more than 20 000 youths drawn across the country attended in Bulawayo.\n\nThe prosperity and future of our region and Africa is in your hands. We, the older generation played our part to bring about independence, freedom and peace, said President Mnangagwa.\n\nThe ball is now in your court. You must deliver. In unity, the youth of Africa can do more for the realisation of the Africa we want and deserve.\n\nThe Head of State and Government later launched the Digital Skills Training Programme meant to empower about 3,5 million youths with digital skills.\n\nThe digitalisation programme dovetails with the Second Republics modernisation, innovation and industrialisation agenda which forms part of the Heritage Based Learning and Education 5.0.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/e3c16ad6-0fde-48f8-800d-b7a7012ed12a-680x380.jpeg",
            "description": "Zvamaida Murwira in Bulawayo The prosperity of the country and Africa as a whole lies in the youths and it is critical to remain united to realise both national and continental goals, President Mnangagwa has said. He was delivering a keynote address during the National Youth Day celebrations where more than 20 000 youths drawn […]",
            "time": "18:30",
            "date": "21 Feb 2025"
        },
        {
            "title": "Govt approves Harare’s 2025 Budget",
            "url": "https://www.herald.co.zw/govt-approves-harares-2025-budget/",
            "content": "Diana Nherera\n\nThe Ministry of Local Government and Public Works has approved the 2025 budget for the City of Harare.\n\nIn a statement, City of Harare acting town clerk, Engineer Phakamile Mabhena Moyo said new tariffs in the 2025 budget are now applicable.\n\nNew tariffs in the 2025 budget are now applicable, he said.\n\nThe City of Harare in November last year proposed a US$ 548 million budget for 2025.\n\nDuring the 2025 budget proposal presentation, Finance and Development committee chair, Councillor Costa Mande said the 2025 budget was guided by the call to action by President Emmerson Dambudzo Mnangagwa.\n\nThe City of Harare has been actively integrating the call to action into its budget, particularly in response to the directives outlined in the blueprint, he said.\n\nThis integration aims to improve service delivery and align the national vision of becoming an upper-middle-income economy by 2030.\n\nKey interventions under the call to action include Enterprise Resource Planning system adoption to improve financial management and reduce revenue leakage, prioritisation of service delivery and infrastructure development.\n\nThe budget allocates funds for the rehabilitation of roads, water and sanitation systems and other critical infrastructure and social services which entails increased funding towards social services, he said.\n\nCllr Mande said the budget prioritises waste management solutions to address the citys waste challenges.\n\nHe said the budget is a responsive and adaptive blueprint that has taken into account the diverse concerns and inputs raised by stakeholders through an extensive consultative process that cuts across all sectors operationally and demographically.\n\nCllr Mande said the budget performance from January to September 2024 was mainly affected by the late budget approval due to a number of issues that are being addressed progressively.\n\nThe 2024 budget was approved in July 2024.\n\nThroughout the first and second quarter, activity was mainly concentrated in priority expenditure in line with the need to conform to provisions of the law given the budget status, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/05/city-of-harare-548x380.jpg",
            "description": "Diana Nherera The Ministry of Local Government and Public Works has approved the 2025 budget for the City of Harare. In a statement, City of Harare acting town clerk, Engineer Phakamile Mabhena Moyo said new tariffs in the 2025 budget are now applicable. “New tariffs in the 2025 budget are now applicable,” he said. The […]",
            "time": "18:30",
            "date": "21 Feb 2025"
        },
        {
            "title": "Woman stabs husband over dollar",
            "url": "https://www.herald.co.zw/woman-stabs-husband-over-dollar/",
            "content": "Arron Nyamayaro\n\nA 29-year-old woman from Sally Mugabe Heights was arrested on Wednesday after she stabbed her husband for buying a gas cooker top that cost a dollar more than the one she had suggested\n\nPrisca Takaza stabbed her husband Liberty Karikoga, 39, twice in the right chest and shoulder with a kitchen knife during the argument over the top.\n\nLiberty had bought the top for US$5 when Prisca wanted him to buy one for US$4 from another shop.\n\nHarare provincial deputy police spokesperson Assistant Inspector Faith Mapisa confirmed the case, stating that Prisca has been arrested and is facing attempted murder charges.\n\nLiberty is currently fighting for his life at Parirenyatwa Hospital.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/12/Arrested.jpg",
            "description": "Arron Nyamayaro A 29-year-old woman from Sally Mugabe Heights was arrested on Wednesday after she stabbed her husband for buying a gas cooker top that cost a dollar more than the one she had suggested Prisca Takaza stabbed her husband Liberty Karikoga, 39, twice in the right chest and shoulder with a kitchen knife during […]",
            "time": "18:30",
            "date": "21 Feb 2025"
        },
        {
            "title": "ZRP hunts for journalist Blessed Mhlanga",
            "url": "https://www.herald.co.zw/zrp-hunts-for-journalist-blessed-mhlanga/",
            "content": "Herald Correspondent\n\nThe Zimbabwe Republic Police (ZRP) has issued a public appeal for information on the whereabouts of journalist Blessed Mhlanga.\n\nMhlanga is wanted for questioning in connection with alleged violations of Section 164 of the Criminal Law (Codification and Reform) Act, Chapter 9:23.\n\nNational police spokesperson Commissioner Paul Nyathi confirmed the development in a statement and urged the public to assist law enforcement authorities in locating Mhlanga.\n\nWe are seeking information on the location of journalist Blessed Mhlanga to facilitate an interview regarding allegations under Section 164 of the Criminal Law (Codification and Reform) Act, Commissioner Nyathi said.\n\nAnyone with relevant information should report to the nearest police station or contact our National Complaints Desk.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/11/zrp.jpg",
            "description": "Herald Correspondent The Zimbabwe Republic Police (ZRP) has issued a public appeal for information on the whereabouts of journalist Blessed Mhlanga. Mhlanga is wanted for questioning in connection with alleged violations of Section 164 of the Criminal Law (Codification and Reform) Act, Chapter 9:23. National police spokesperson Commissioner Paul Nyathi confirmed the development in a […]",
            "time": "18:30",
            "date": "21 Feb 2025"
        },
        {
            "title": "Youth empowerment at the forefront as ZESN celebrates National Youth Day",
            "url": "https://www.herald.co.zw/youth-empowerment-at-the-forefront-as-zesn-celebrates-national-youth-day/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nAs Zimbabwe marks National Youth Day, the Zimbabwe Electoral Support Network (ZESN) has called for greater youth inclusion in governance and decision-making processes.\n\nUnder the theme Empower Youth, Secure the Future, this years celebrations highlight the critical role of young people in shaping the countrys political and socio-economic landscape.\n\nZESN, a key advocacy organisation for democratic participation said there was need to prioritise youth engagement at all levels.\n\nThe youth represent not only the future but also the present; they are leaders and innovators who can shape a better tomorrow, ZESN said in a statement.\n\nThe organisation said it was important to recognise young people as active contributors to policy-making and societal development.\n\nA major talking point in this years celebrations is the introduction of the Youth Quota System, a policy ensuring a minimum percentage of leadership roles and Government positions are reserved for young people.\n\nZESN hailed the initiative as essential for fostering diversity and fresh ideas within institutions, while also dismantling barriers that traditionally prevent young voices from participating in critical legislative and administrative processes.\n\nAdditionally, the National Youth Policy mandates a minimum 21 percent youth representation in governance structures, a move that ZESN believes will significantly enhance the youths role in shaping policies that directly impact their lives.\n\nThe organisation urged the Government to continue going beyond policy frameworks and take deliberate steps to equip young people with the necessary tools, experiences and confidence to influence change.\n\nYouth participation in governance transcends mere representation; it is about empowering them to lead initiatives and contribute actively to societal progress, reads the statement.\n\nThe organisation also said young people bring energy, innovative ideas and a commitment to addressing pressing issues such as climate change, social justice and economic instability.\n\nAs National Youth Day is observed across the country, ZESN called on all stakeholders to reaffirm their commitment to fostering an environment where the youth are empowered to lead and participate meaningfully in governance.\n\nIt is time to break down barriers, challenge stereotypes, and invest in the potential of Zimbabwean youth so that every young person feels valued.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Untitled-1-1-680x380.jpg",
            "description": "Ivan Zhakata Herald Correspondent As Zimbabwe marks National Youth Day, the Zimbabwe Electoral Support Network (ZESN) has called for greater youth inclusion in governance and decision-making processes. Under the theme “Empower Youth, Secure the Future,” this year’s celebrations highlight the critical role of young people in shaping the country’s political and socio-economic landscape. ZESN, a […]",
            "time": "18:30",
            "date": "21 Feb 2025"
        },
        {
            "title": "President presides over 2025 Youth Day Celebrations",
            "url": "https://www.herald.co.zw/president-presides-over-2025-youth-day-celebrations/",
            "content": "\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Untitled-1.png",
            "description": "",
            "time": "18:30",
            "date": "21 Feb 2025"
        },
        {
            "title": "RBZ dismisses false claims on POSB sale",
            "url": "https://www.herald.co.zw/rbz-dismisses-false-claims-on-posb-sale/",
            "content": "Ivan ZhakataHerald Correspondent\n\nThe Reserve Bank of Zimbabwe (RBZ) has dismissed as false social media claims that the Peoples Own Savings Bank (POSB) has been sold to foreign investors.\n\nIn a statement, RBZ governor Dr John Mushayavanhu refuted the allegations and said no such transaction has been processed or approved by the central bank.\n\nThese claims are completely false, Dr Mushayavanhu said.\n\nThe Reserve Bank has not received any application from any investor for the purchase of POSB, nor has it received any correspondence from the Zimbabwean government, including His Excellency, the President, regarding such a sale.\n\nHe said any sale of a banking institution in Zimbabwe required formal approval from the Registrar of Banks, Exchange Control and other regulatory authorities.\n\nIf there had been any directive for the sale, it would have had to be addressed to the Reserve Bank as the approving authority, Dr Mushayavanhu said.\n\nWe categorically confirm that no such directive has been received, nor has any application been processed from the named investors.\n\nThe RBZ has urged the public, particularly POSB depositors, to disregard the false claims.\n\nThese false claims should be dismissed with the contempt they deserve, the governor said.\n\nPOSB, a government-owned savings bank, plays a crucial role in providing financial services to Zimbabweans, particularly those in rural and underserved areas. The speculation surrounding its alleged sale had caused concern among depositors, prompting the central bank to set the record straight.\n\nAuthorities have cautioned the public against spreading unverified information that could cause unnecessary panic in the financial sector.\n\nWhile the Government has, in the past, expressed intentions to partially privatize some state-owned enterprises as part of economic reforms, there has been no official indication that POSB is on the immediate list for privatization.\n\nPOSB depositors can rest assured that the bank remains under state ownership, with the central bank reaffirming that no sale has taken place or is in the process.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/rhrhr-680x380.jpg",
            "description": "Ivan Zhakata Herald Correspondent The Reserve Bank of Zimbabwe (RBZ) has dismissed as false social media claims that the People’s Own Savings Bank (POSB) has been sold to foreign investors. In a statement, RBZ governor Dr John Mushayavanhu refuted the allegations and said no such transaction has been processed or approved by the central bank. […]",
            "time": "18:30",
            "date": "21 Feb 2025"
        },
        {
            "title": "‘NDS2 boon for manufacturing’ . . . Sector to rise from US$4bn to US$10bn: President",
            "url": "https://www.herald.co.zw/nds2-boon-for-manufacturing-sector-to-rise-from-us4bn-to-us10bn-president/",
            "content": "Zvamaida Murwira in BULAWAYO\n\nPresident Mnangagwa says National Development Strategy 2 (NDS2), the successor to NDS1, will prioritise value addition and industrialisation, particularly in the manufacturing sector, which is poised to rise from the current US$4 billion to over US$10 billion through a strategic focus on value chains in different sectors.\n\nThe Head of State and Government said this in Bulawayo yesterday while officially launching the inaugural annual Competitiveness Summit, organised by the National Competitiveness Commission.\n\nHeld under the theme, Building sustainability towards enhanced productivity and competitiveness in Zimbabwe, the summit seeks to foster dialogue among stakeholders to improve national competitiveness.\n\nAs you are aware, the first edition of the National Development Strategy 1 is coming to an end in 2025, said the President.\n\nDelegates sing the national anthem at the inaugural Annual Competitiveness Summit of the National Competitiveness Commission at the ZITF Grounds in Bulawayo yesterday.\n\nEfforts are underway to develop the successor programme, the National Development Strategy 2 (NDS2).\n\nThis is set to be anchored on fiscal discipline, macro-economic stability as well as robust trade and investment, as critical drivers for improving productivity and competitiveness.\n\nPresident Mnangagwa said NDS2 will prioritise value addition and industrialisation, particularly in the manufacturing sector.\n\nThe aim is to increase the sectors value from the current US$4 billion to over US$10 billion, through a strategic focus on value chains in the different sectors, he said.\n\nPresident Mnangagwa said the Government was aware of challenges affecting businesses and measures would be put in place to address them.\n\nOn its part, the Second Republic is alive to issues affecting businesses and is scaling up measures that create a supportive business operating environment, which encourages innovation and investment.\n\nMy Governments thrust is premised on the need to promote value addition and beneficiation of raw materials and minerals, that support the creation of vibrant industrial value chains, which are critical in the transformation of our economy, said President Mnangagwa.\n\nGovernment, he added, was ready to support the National Competitiveness Commission so that it focuses on competitive strategy, which is key in guiding national policy formulation.\n\nIt is pleasing to note that the Ministry of Industry and Commerce, through the National Competitiveness Commission will focus on developing a National Competitiveness Strategy this year which will be instrumental in guiding national policy formulation.\n\nMy Government stands ready to lend you as much support as possible to successfully acquit yourselves on this very noble endeavour, said President Mnangagwa.\n\nThe inaugural competitive summit, he said, had come at an opportune moment for the Government.\n\nDelegates follow proceedings at the inaugural Annual Competitiveness Summit of the National Competitiveness Commission at the ZITF Grounds in Bulawayo yesterday.\n\nHe then took the opportunity to urge the commission to leverage the invaluable networks it has.\n\nPresident Mnangagwa said the Zimbabwe Industrial Reconstruction and Growth Plan has been developed as the transitional plan to address the challenges bedevilling both the industrial and commercial sectors.\n\nSpecific sectors and value chains such as the soya bean and dairy value chains have been identified as having the national comparative advantage and maximum potential to contribute towards manufacturing value-added growth, he said.\n\nValue addition and beneficiation are poised to enhance the competitiveness of the countrys manufacturing sector at a time when the African Continental Free Trade Area agreement is now operational, said President Mnangagwa.\n\nI urge stakeholders to tap into the new market opportunities presented by these emerging conditions of trade. Hence the need to ensure that our countrys goods and services are competitive, cannot be overemphasised. All sectors, therefore, have a duty and responsibility to embrace the competitiveness agenda and take it to another level.\n\nDelegates follow proceedings at the inaugural Annual Competitiveness Summit of the National Competitiveness Commission at the ZITF Grounds in Bulawayo yesterday\n\nOn its part, my Government remains committed to working with all stakeholders, including the private sector, development partners and academia, in addressing impedimentsaffecting the countrys global competitiveness, said President Mnangagwa.\n\nEarlier, Vice President Dr Constantino Chiwenga said the theme of the summit aligned well with President Mnangagwas steadfastness to achieve inclusive and equitable economic growth as outlined in the NDS1.\n\nVP Chiwenga\n\nThis trajectory will continue to inform and guide us into NDS2. It is gratifying that President Mnangagwa has consistently championed the improvement of Zimbabwes global competitiveness.\n\nUnder his leadership, the country has embarked on a transformative journey focusing on boosting productivity, enhancing the ease of doing business and fostering an ecosystem that attracts both domestic and foreign investment, said VP Chiwenga.\n\nIndustry and Commerce Minister, Mangaliso Ndlovu, said one of the objectives of the summit is to improve the ease of doing business and end bureaucracy.\n\nIt is the key driver of the countrys economic growth, said Minister Ndlovu.\n\nHe added that competitiveness is the cornerstone of any countrys development.\n\nIt is the key driver of the countrys economic growth, said Minister Ndlovu.\n\nThe summit was meant to provide a dialogue platform for all stakeholders to reflect strategies to enhance competitiveness in the country and come up with resolutions for presentation to Government.\n\nIt drew participants from Government ministries, agencies, business leaders and academicsamong others.\n\nSpeakers from different countries addressed the summit where they presented on best practices on how to achieve competitiveness.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/President-Mnangagwa-in-Byo-copy-680x380.jpg",
            "description": "Zvamaida Murwira in BULAWAYO President Mnangagwa says National Development Strategy 2 (NDS2), the successor to NDS1, will prioritise value addition and industrialisation, particularly in the manufacturing sector, which is poised to rise from the current US$4 billion to over US$10 billion through a strategic focus on value chains in different sectors. The Head of State […]",
            "time": "18:30",
            "date": "21 Feb 2025"
        },
        {
            "title": "Edgars plant charms Head of State",
            "url": "https://www.herald.co.zw/edgars-plant-charms-head-of-state/",
            "content": "Zvamaida Murwira in BULAWAYO\n\nBulawayo has the potential to become the hub of the countrys manufacturing sector, given the potential it has shown so far, President Mnangagwa said yesterday.\n\nHe said this after touring Edgars Stores Carousel Clothing manufacturing plant, which is expected to increase production in terms of economic output and employment creation.\n\nThe Presidents visit preceded the launch of the National Competition Commissions inaugural Summit that he later officiated at the Zimbabwe International Trade Fair Exhibition Centre.\n\nThe Edgars manufacturing plant produces a range of clothes for its retail divisions dotted around the country and other outlets, a development set to increase its market share.\n\nEdgars invested in new sewing equipment among other machines to boost its competitiveness.\n\nIn an interview after the tour, President Mnangagwa said he was happy with the production work at the company, particularly considering that the bulk of their workforce was made up of women.\n\nI am very impressed. I have never been here before. It is my first visit to this place, so I am impressed that we have such facilities in our country, so vast and providing employment, especially towomen.\n\nIt shows that when you say Bulawayo is a hub of manufacturing, I realised that it is true, said President Mnangagwa.\n\nThe newly-installed equipment include sewing machines, garment printing press, sand dusting and reaping machines, and pocket inserting machines, amongst otheraccessories.\n\nThe companys manufacturing division has increased the number of workers from 35 in 2022 to about 700 this year.\n\nThe Edgars Group runs Edgars Stores, Jet, Carousel and Club-Plus and the business units have registered steady growth over the years.\n\nPresident Mnangagwa was accompanied by Vice President Dr Constantino Chiwenga, Industry and Commerce Minister Mangaliso Ndlovu, Chief Secretary to the President and Cabinet Dr Martin Rushwaya and other senior Government officials.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/President-tours-Edgars-680x380.jpg",
            "description": "Zvamaida Murwira in BULAWAYO Bulawayo has the potential to become the hub of the country’s manufacturing sector, given the potential it has shown so far, President Mnangagwa said yesterday. He said this after touring Edgars Stores’ Carousel Clothing manufacturing plant, which is expected to increase production in terms of economic output and employment creation. The […]",
            "time": "18:30",
            "date": "21 Feb 2025"
        }
    ]
}