{
    "news": [
        {
            "title": "President reads Riot Act. . .Warns senior party members abusing social media",
            "url": "https://www.herald.co.zw/president-reads-riot-act-warns-senior-party-members-abusing-social-media/",
            "content": "Joseph Madzimure, Senior Reporter\n\nPRESIDENT Mnangagwa yesterday read the Riot Act on senior party members who are abusing social media platforms to create divisions, discord and confusion among members.\n\nThis comes as some senior ruling party members have been communicating opinionated views on social media.\n\nAddressing the 380th Session of the Politburo yesterday, the President emphasised the importance of unity and order within the party rank and file.\n\nAt this stage of our political development and with the maturity of our revolutionary party, it is disheartening to note the unbecoming levels of mud-slinging and other counter-revolutionary tendencies, including the broadcasting of party issues on social media platforms.\n\nThese acts continue to cause discord and confusion among the membership base. No one must put our party into disrepute. This is unacceptable. Such behaviour cannot be tolerated and must stop. Vari kuzviita cherai chikomba, emphasised President Mnangagwa.\n\nEvery member, the President said, must adhere to provisions of the party constitution, founding principles, and procedural integrity, including wide consultation and formal ratification of issues that affect the party.\n\nPrudence must be exercised in the execution of our duties and rights as members, through the use of appropriate principal organs and structures of the party. Zanu PF musangano unegwara, uye nematare.\n\nLet us do more to unite the party and entrench a positive culture of common purpose, harmony and love, as we advance our party Vision and Mission as articulated in Articles 6 and 7 of our party constitution, he said.\n\nOn top of that, a social media policy is being crafted which will guide party members.\n\nThe President urged the party leadership to look forward to 2025 with optimism and confidence that the colossal party will sustain the development momentum realised so far.\n\nIn doing so, our primary concern at every leadership level should be to continue building a positive image of the party and expanding the membership base in our structures. The party must remain visible in the villages, and urban areas, always guiding misinformed cadres in our communities, and raising their political awareness. Mu ZANU PF, iwe neni tine basa, he said.\n\nPresident Mnangagwa said despite the effects of the heinous illegal sanctions the country has witnessed numerous success milestones during the year.\n\nDespite the weighty and retarding effects of the heinous illegal sanctions on our country, we scored numerous success milestones during the year towards the modernisation, industrialisation and growth of our economy.\n\nOur national development philosophy, Nyika inovakwa, inotongwa, inonamatigwa nevene vayo/ ilizwe lakhiwa, libuswe, likhulekelwe ngabanikazi balo, is now embedded nationally, in the mind-sets of our people.\n\nAs such, through this rallying call as well as hard work, focus and determination, our country is realising growth across all sectors of the economy and also a higher quality of life for our people, said President Mnangagwa.\n\nIn the past few weeks alone, President Mnangagwa has officiated at various ceremonies for notable development projects and programmes being championed by the ruling party.\n\nThese included the commissioning of the Shurugwi- Mhandamabwe Road, the Varun Beverages Phase 6 and 7 expansion project, and the launch of the construction of a US$1 billion Titan New Energy Plant, among others.\n\nAs we continue to make efforts to position Zimbabwe as an infrastructure powerhouse, the central role of the iron and steel sector cannot be overemphasised. To this end, the convening of the Zimbabwe Iron and Steel Indaba was a welcome initiative. It stands as a reminder to the party, Government and other stakeholders in the sector to quickly adapt and innovate as we revitalise this important industry of our nation, he said.\n\nFocus, he stated, must be towards guaranteeing that the natural endowments of the country benefit Zimbabweans and help accelerate the modernisation and industrialisation of the economy.\n\nHe commended party members for being instrumental in the success of programmes and activities that were held during the course of the year.\n\nYour individual and collective efforts were instrumental in the success of party programmes and activities held during the course of the year. The spirit of servant leadership and determination to wholeheartedly serve the party and people of our motherland, Zimbabwe, should remain our guiding beacon into the new year. Congratulations on a job well done, he said.\n\nHe also commended the party and Herbert Chitepo School of Ideology for facilitating training and capacity building for the members of the Youth League through the ongoing partnership with the Julius Nyerere School of Leadership.\n\nSuch leadership training programmes along with those conducted with various stakeholders within the country nurture our people to value and promote the ideals of patriotism and Pan-Africanism for the ongoing national development revolution.\n\nThe Chitepo School of Ideology, as a strategic Party and national institution, is directed to remain guided by the founding objectives, spirit and letter, that saw its establishment, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/HE1-5.jpg",
            "description": "Joseph Madzimure, Senior Reporter PRESIDENT Mnangagwa yesterday read the Riot Act on senior party members who are abusing social media platforms to create divisions, discord and confusion among members. This comes as some senior ruling party members have been communicating opinionated views on social media. Addressing the 380th Session of the Politburo yesterday, the President […]",
            "time": "06:29",
            "date": "20 Dec 2024"
        },
        {
            "title": "President launches land tenure programme",
            "url": "https://www.herald.co.zw/president-launches-land-tenure-programme/",
            "content": "Zvamaida Murwira, Senior Reporter\n\nPresident Mnangagwa will today launch the new Land Tenure Implementation Programme in Kwekwe to bolster the land ownership model, unlock huge amounts of finance, spur economic growth and enhance productivity.\n\nThis follows an adjustment to the countrys land tenure system announced by President Mnangagwa in October to improve land tenure security.\n\nUnder the new era, all land held by beneficiaries of the Land Reform Programme under 99-year leases, offer letters and permits, will be held under a bankable, registrable and transferable document.\n\nAddressing the 380th Ordinary Session of the ZANU PF Politburo at the revolutionary partys headquarters, President Mnangagwa, who is also First Secretary of the ruling party, said he will be launching the new programme at Pricabe Farm in Kwekwe.\n\nTomorrow (today) I will be launching the new land tenure implementation programme as we consolidate the gains of land reform. The programme is envisaged to bolster the land ownership model, and enhance access to financing, as well as to encourage production and productivity, said President Mnangagwa.\n\nHe implored communities to remain vigilant as the country seeks to capitalise on weather patterns for improved agricultural output.\n\nIn the agriculture sector, I once again urge communities, village-by-village, ward-by-ward to remain vigilant as we maximise the weather patterns for a successful agriculture season, said the President.\n\nTo ensure the smooth facilitation of the process, the Government issued an indefinite moratorium on the issuance of any new 99-year leases, offer letters and permits for agricultural land.\n\nIn announcing the new policy in October this year, President Mnangagwa said in implementing the new system, priority will be given to veterans of the liberation struggle, youths and women.\n\nIn addition, security of tenure to all agricultural land regularised under this programme will, at all times, only be transferable among indigenous Zimbabweans and land targeted for the new tenure system will exclude communal land that is under the jurisdiction of traditional chiefs.\n\nHe said the noticeable new paradigm amongst Zimbabwean farmers, especially the majority of beneficiaries of the land reform, was to regard and conduct farming as a business, a source of both livelihoods and means to increase personal economic value.\n\nChronicling the background of the programme, President Mnangagwa said the Government, has since 2008, put in place various programmes to assist farmers to be productive on the land through programmes such as the Basic Commodity Supply Side Intervention (Baccossi), Inputs and Mechanisation Equipment, Maguta, and the Special Grains Import Substitution Programme among others.\n\nIn the Second Republic, the country has witnessed and benefited from the Governments deliberate and complementary policy of incorporating accelerated infrastructure development which includes road construction and rehabilitation incorporating the much-needed rural roads, dam construction; irrigation; and housing development, he said.\n\nSome of the challenges, he said, that were faced by farmers in the past include difficulty in accessing affordable finance and varying levels of accountability from the farmers.\n\nThe President has since constituted a Cabinet Oversight Committee chaired by Defence Minister Oppah Muchinguri-Kashiri to lead the reform process.\n\nA technical committee  the Land Tenure Implementation Committee (LTIC)  to coordinate and steer the implementation of this process will also be constituted.\n\nThese Committees will work diligently to develop improved security of tenure for land beneficiaries while ensuring that the value of agricultural and urban State land is fully unlocked to guarantee inclusive and nationwide economic development.\n\nGovernment will put in place all the necessary institutional and logistical mechanisms to ensure the smooth coordination and implementation of these new policies and objectives.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/HE2-6.jpg",
            "description": "Zvamaida Murwira, Senior Reporter President Mnangagwa will today launch the new Land Tenure Implementation Programme in Kwekwe to bolster the land ownership model, unlock huge amounts of finance, spur economic growth and enhance productivity. This follows an adjustment to the country’s land tenure system announced by President Mnangagwa in October to improve land tenure security. […]",
            "time": "06:29",
            "date": "20 Dec 2024"
        },
        {
            "title": "Govt exceeds housing delivery target",
            "url": "https://www.herald.co.zw/govt-exceeds-housing-delivery-target/",
            "content": "Blessings Chidakwa, Herald Reporter\n\nThe Second Republic has successfully delivered 700 000 housing units under National Development Strategy 1 (NDS1), exceeding its initial target of 220 000 and is now approaching a new goal of one million units.\n\nUnder the leadership of President Mnangagwa, the Government has prioritised the provision of affordable, modern and safe houses, recognising housing as a basic and fundamental need.\n\nThe revised target was announced during a media session aimed at enhancing interactions between journalists and Cabinet ministers, facilitated by Information, Publicity, and Broadcasting Services Minister Dr Jenfan Muswere.\n\nAmong the attendees was National Housing and Social Amenities Minister Zhemu Soda, who expressed confidence in surpassing the revised target of one million housing units.\n\nMinister Soda stated that since inception of the Second Republic, guided by the Presidents vision, the Government aimed to construct a substantial number of houses within the National Development Strategy period, which runs from 2021 to 2025.\n\nThe initial target, as I indicated, was 220 000 housing units. When we took stock in April last year, we realised that we had completed 272 000 houses, and the Cabinet is ready to review the target to 1 million housing units. As we speak, we have already achieved more than 700 000 housing units, which accounts for over 70 percent of our targets. This positions us well to achieve our goals by 2025, he said.\n\nMinister Soda emphasised that housing delivery is not solely the responsibility of the Ministry of National Housing; it involves collaboration with various stakeholders, including pension funds, insurance schemes, individuals, and civil society. He noted ongoing partnerships with banks such as BancABC, CBZ, and CABS, highlighting the importance of private sector participation in realising the vision for 2030, which is expected to be led by the private sector.\n\nSo we are crowding in the private sector by creating a conducive investment environment where they can find opportunities to participate in the housing delivery sector, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Muswere-1.jpg",
            "description": "Blessings Chidakwa, Herald Reporter The Second Republic has successfully delivered 700 000 housing units under National Development Strategy 1 (NDS1), exceeding its initial target of 220 000 and is now approaching a new goal of one million units. Under the leadership of President Mnangagwa, the Government has prioritised the provision of affordable, modern and safe […]",
            "time": "06:29",
            "date": "20 Dec 2024"
        },
        {
            "title": "3 commissions sworn in",
            "url": "https://www.herald.co.zw/3-commissions-sworn-in/",
            "content": "Wallace Ruzvidzo, Herald Reporter\n\nPresident Mnangagwa yesterday swore-in commissioners into the Zimbabwe Prisons and Correctional Services Commission (ZPCSC), the Zimbabwe Human Rights Commission (ZHRC) and the Zimbabwe Independent Complaints Commission (ZICC).\n\nMr Simon Madzimure, Mr Albert Mandinika, Ms Rosemary Kanonge, Mr Sternly Kondongwe, Ms Chipo Mandela and Mr Utoile Silaigwana were sworn into the ZPCS Commission.\n\nMr Martin Muduva was sworn into the ZHRC, while Mr Kudakwashe Muchena was sworn into ZICC.\n\nIn an interview after the swearing-in ceremony at State House yesterday, Mr Silaigwana said the ZPCS Commission would diligently discharge its duties as enshrined in the Constitution.\n\nSince we have now been sworn-in by His Excellency the President of Zimbabwe, Dr ED Mnangagwa, in terms of the Constitution of Zimbabwe, especially for the commissioners in the Zimbabwe Prisons and Correctional Services, our priorities are well laid out in the constitution in terms of our functions. We are dedicated to duty, said Mr Salaigwana.\n\nMr Silaigwana said, going forward, the commission would work towards enhancing the efficiency and proficiency of the ZPCS.\n\nThere are issues to do with maybe regulations, where necessary, they must be put in place and also to make sure that the ZPCS enjoys good relations with the civilian population as they interact with them for correctional services as per their mandate, he said.\n\nOn his part, Mr Muchena said he would serve ZICC as a specialist psychologist because mental health issues have become ever so pertinent.\n\nAs you are aware, according to the act of the Zimbabwe Independent Complaints Commission we are supposed to have a psychologist on the panel, so I am there to represent the entire psychology fraternity in Zimbabwe.\n\nFor a very long time, mental health issues have never been a part of the discourse in terms of commissions, but this is the first commission that we see a specialist psychologist being on the panel so that they represent issues that have to do with mental health, he said.\n\nMr Muduva said human rights were fundamental in promoting democracy hence he would discharge his duties diligently.\n\nRemember, these are commissions that have been appointed through the establishment of the Paris Principles.\n\nThe Paris Principles led to the United Nations Commission also adopting the same and it cascades down to national levels where as commissions we are adopting the same. So it is very pertinent for us as a nation to adopt the same to show that we are aligning with global practices and we are a democratic nation, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/HE3-3.jpg",
            "description": "Wallace Ruzvidzo, Herald Reporter President Mnangagwa yesterday swore-in commissioners into the Zimbabwe Prisons and Correctional Services Commission (ZPCSC), the Zimbabwe Human Rights Commission (ZHRC) and the Zimbabwe Independent Complaints Commission (ZICC). Mr Simon Madzimure, Mr Albert Mandinika, Ms Rosemary Kanonge, Mr Sternly Kondongwe, Ms Chipo Mandela and Mr Utoile Silaigwana were sworn into the ZPCS […]",
            "time": "06:29",
            "date": "20 Dec 2024"
        },
        {
            "title": "Zambian envoy consults Sadc Chair",
            "url": "https://www.herald.co.zw/zambian-envoy-consults-sadc-chair/",
            "content": "Wallace Ruzvidzo, Herald Reporter\n\nZambian President Hakainde Hichilema yesterday sent his special envoy, former Vice President Enoch Kavindele to consult President Mnangagwa, who is also SADC Chairperson, on various issues affecting the region.\n\nZambia is fielding a candidate, Dr Samuel Munzele Maimbo, for the Africa Development Bank (AfDB) presidents post and Zimbabwe has already pledged to support his candidature.\n\nIn an interview alongside President Mnangagwa after their closed-door meeting at State House yesterday, Mr Kavindele said they had come to consult the SADC Chair as Harare and Lusaka enjoyed cordial relations.\n\nThe other reason cited by the former VP was President Mnangagwas dedication to leading the regional bloc, hence the consultations.\n\nAs you may be aware, President Mnangagwa is the Chairman of SADC and we (Zambia) were Chairman of the SADC Troika before he came in. So, from time to time, its important that we come to consult the Chair of SADC on many issues.\n\nZambia and Zimbabwe are so gifted that we have a dedicated man in Zimbabwe who knows where we have come from as a region, so I just came here with my team for consultations, he said.\n\nThe former Vice President said their candidate had been endorsed by SADC member states and they had also briefed President Mnangagwa.\n\nThe last time I was here (in July) we were seeking his (President Mnangagwa) support for a Zambian, who wants to be president of the African Development Bank, and indeed the President assisted us and that man has since been endorsed by SADC and we have taken him around, we use the fact that the man was endorsed in Harare. So, it is important that we brief His Excellency (President Mnangagwa), he said.\n\nZambias AfDB candidate, Dr Maimbo, is the current World Bank Group vice president responsible for budget, performance review and strategic planning.\n\nHe is responsible for aligning the World Banks budget with its strategic priorities, financial sustainability objectives, efficiency targets and business needs.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/HE4-2.jpg",
            "description": "Wallace Ruzvidzo, Herald Reporter Zambian President Hakainde Hichilema yesterday sent his special envoy, former Vice President Enoch Kavindele to consult President Mnangagwa, who is also SADC Chairperson, on various issues affecting the region. Zambia is fielding a candidate, Dr Samuel Munzele Maimbo, for the Africa Development Bank (AfDB) president’s post and Zimbabwe has already pledged […]",
            "time": "06:29",
            "date": "20 Dec 2024"
        },
        {
            "title": "3 general officers promoted",
            "url": "https://www.herald.co.zw/3-general-officers-promoted/",
            "content": "Columbus Mabika, Herald Reporter\n\nCommander-in-Chief of the Zimbabwe Defence Forces, President Mnangagwa, yesterday promoted three Zimbabwe National Army Brigadier-Generals to the rank of Major-General and one Air Force of Zimbabwe Air Commodore to the rank of Air Vice Marshal.\n\nThe President made the promotions in terms of the Defence Act (Chapter 11:02) Section 20, as read with Statutory Instrument 257 of 2020, Section 19c, Sub-section 2c, which reads: His Excellency the President of the Republic of Zimbabwe and Commander-in-Chief of the Zimbabwe Defence Forces may on the advice of the Minister of Defence, acting on the recommendations of the Commander Zimbabwe Defence Forces, reward any member for distinguished service or gallant conduct on active service by promoting an officer to a higher rank.\n\nThe three general officers are Josphat Kudumba, Augustine Chipwere, Simo Maseko and Air Commodore Selebale Masera.\n\nThe promotions are with effect from 20 November.\n\nBrig-Gen Chipwere was promoted in absentia as he is serving a mission outside the country.\n\nConferring new badges of rank on the promoted officers, Commander Defence Forces, General Philip Valerio Sibanda said the promotions were a testimony of hard work and loyalty to national duty.\n\nThe promotion we are witnessing today is a true testimony of selfless service you have shown to this country which dates back as far as the war of liberation struggle leading to these many years of service in the Zimbabwe Defence Forces, he said.\n\nGen Sibanda reminded the four that the promotion came with more responsibility, calling on them to remain exemplary in their new job designations.\n\nThe new ranks come with more and extra responsibility to the defence of our country, continue to do your best as you have previously done, he said.\n\nSpeaking on behalf of his colleagues, Major General Maseko said they will continue to be loyal to the Constitution and command establishment.\n\nHe thanked President Mnangagwa for the confidence he showed by elevating them to higher ranks.\n\nWe undertake to be always loyal to the Constitution and command establishment of the ZDF and at the same time, we always undertake to serve the people of Zimbabwe.\n\nMay I also take this rare opportunity, Commander Sir, to heartily thank you together with your command element for tirelessly mentoring us throughout our military career spanning over 44 years inclusive of the liberation struggle. It is through your efforts that we have got to where we are today through your tireless and consistent guidance, said Major General Maseko.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/08/Untitled-25.jpg",
            "description": "Columbus Mabika, Herald Reporter Commander-in-Chief of the Zimbabwe Defence Forces, President Mnangagwa, yesterday promoted three Zimbabwe National Army Brigadier-Generals to the rank of Major-General and one Air Force of Zimbabwe Air Commodore to the rank of Air Vice Marshal. The President made the promotions in terms of the Defence Act (Chapter 11:02) Section 20, as […]",
            "time": "06:29",
            "date": "20 Dec 2024"
        },
        {
            "title": "EDITORIAL COMMENT: We must all drive safely so we’re safe together",
            "url": "https://www.herald.co.zw/editorial-comment-we-must-all-drive-safely-so-were-safe-together/",
            "content": "With Christmas Day less than a week away, teams from State agencies have been deployed to enforce traffic and vehicle regulations and generally trying to create an accident-free festive season.\n\nSo, officers on the roads, from the Vehicle Inspection Department (VID), who check that vehicles are roadworthy, from Road Motor Transportation, who check that buses and trucks are registered and follow their specific extra rules, the Traffic Safety Council of Zimbabwe, who battle to get everyone do best practices, and the police, who do the actual enforcement of all traffic law and regulation.\n\nOne innovation this year is the deployment of senior officers to monitor the teams and actual operations.\n\nThis is an important extra deployment and should help ensure that the enforcement of safety rules, the general system of warnings where these are appropriate, and the action taken against the more serious infringements are both fair and reasonable.\n\nWhile police have been tightening up their procedures since the advent of the Second Republic and taking action when there are complaints, there is still the problem of private negotiations between law breakers and police and other officers when they think no one is watching.\n\nThis can take the form of a return to the days of extortion, although that is less likely, but more importantly can see a blind eye, being turned to more serious offences where there is no accident to make everyone conform.\n\nThese patrolling senior police can make sure that the teams are doing their duty properly and fairly, that complaints or disputes with drivers can be sorted out quickly and that generally the system can be made to work properly to do what it is intended to do, ensure that everyone uses the roads safely, can be assured that others are also driving safely and that they can move with the assurance that they will arrive at their destination.\n\nEnforcement can be moderately flexible.\n\nFor example travelling a little over the speed limit on a clear day and dry road without much traffic might just need a warning, while travelling even at the speed limit in some conditions could be regarded as reckless driving.\n\nEven for minor infringements that could be dealt with by a warning, we would hope that these warnings will still be recorded, just a line in an exercise book of car number, driver name and address and licence number and nature of warning.\n\nSince most people stretch the law for these minor offences, having to spend a few minutes parked, while the junior constable on the team, the person the rest are almost bound to see as the natural recorder, is writing down these details will at least show that breaking rules does not mean a speedier journey.\n\nThere are additional problems this festive season beyond the greater likelihood of wetter roads. We have just passed the full moon, so as we move towards Christmas more and more of every night will be totally dark.\n\nBetween Christmas and New Year those half-moons will move towards the little slivers soon after sunset or soon before sunrise, that are totally useless for seeing anything.\n\nSo for much of this years festive season we will have far longer periods of intense darkness at night, another excellent reason for not driving at night except in serious emergencies. The less one can see the more dangerous a journey.\n\nUnfortunately, the police still do not have the adequate resources to check up on the two major causes of road accidents, people driving too fast and people driving after having had a few alcoholic drinks.\n\nIn time, breathalysers and speed traps will be ubiquitous at road blocks and police patrols, but until then we need to push hard the culture changes required, that drinking and driving, and speeding, are the two most dangerous activities anyone can do on the road.\n\nOther drivers also need to realise that these people are on the streets with them, and will be causing accidents, and they should be able to take action not to be involved in those inevitable crashes.\n\nStanding up to ones rights is not always the most sensible option when dealing with a drunk weaving at speed coming from the opposite direction.\n\nHaving a far safer Christmas requires everyone to conform, all drivers. The authorities and the enforcement and encouragement teams deployed on the roads can help, but most people drive very correctly when driving near a roadblock or past a police car.\n\nWhile there are cases of someone smashing into a line of cars at a roadblock, most of these accidents take place out of sight of the police, and hence the need to get everyone to understand that we need to all cooperate.\n\nThe rules of the road, and the best practices as outlined in the Highway Code, work extremely well when everyone follows them all the time.\n\nDrivers need to understand we are all safe together or are all in extreme danger together, and that we all need to choose the safe option to be safe. One rule breaker, and we are all unsafe.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Mhona.jpg",
            "description": "With Christmas Day less than a week away, teams from State agencies have been deployed to enforce traffic and vehicle regulations and generally trying to create an accident-free festive season. So, officers on the roads, from the Vehicle Inspection Department (VID), who check that vehicles are roadworthy, from Road Motor Transportation, who check that buses […]",
            "time": "06:29",
            "date": "20 Dec 2024"
        },
        {
            "title": "7 million voters for Malawi’s 2025 elections",
            "url": "https://www.herald.co.zw/7-million-voters-for-malawis-2025-elections/",
            "content": "LILONGWE.  Preliminary cumulative figures of Malawians who have registered in the three respective voter registration exercises ahead of the September 2025 general elections show that more than 7 million people have registered.\n\nThe number is slightly above the 6,8 million voters registered for the 2019 elections, according to data released by the Malawi Electoral Commission (MEC) .\n\nA total of 10,957,490 people were expected to register as projected by the countrys statistical office.\n\nHowever, at the close of the third and last phase of the registration exercises on Decemeber 11, a total of 7,162,217 voters had registered.\n\nThe registered voters represent 65 percent of the expected figure.\n\nThe MEC, however, noted that the figures for the three phases of the voter registration exercises are preliminary and that there might be slight changes upon cleaning of the data.\n\nAccording to MEC Chief Elections Officer Andrew Mpesi, the commission will make public the final figures once any impurities such as duplicate registration are cleared.\n\nThe MEC conducted the voter registration exercises in three phases from November, dividing the countrys district councils into groupings of 14 councils apiece for Phases I and II, and eight councils for Phase III.\n\nAccording to the National Statistical Office of Malawi, the countrys current population is estimated at 21,7 million, with the youth accounting for over 50 percent.\n\nMalawi will conduct tripartite elections on September 16, 2025, to elect the president, members of parliament, and local government representatives.\n\nThe south-eastern African country has at least 20 registered political parties, with three of them, the ruling Malawi Congress Party (MCP), the main opposition Democratic Progressive Party (DPP), and the United Transformation Movement (UTM)being the key contenders, although there is a likelihood of political alliances with other smaller parties.  Xinhua.com\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Malawi.jpg",
            "description": "LILONGWE. – Preliminary cumulative figures of Malawians who have registered in the three respective voter registration exercises ahead of the September 2025 general elections show that more than 7 million people have registered. The number is slightly above the 6,8 million voters registered for the 2019 elections, according to data released by the Malawi Electoral […]",
            "time": "06:29",
            "date": "20 Dec 2024"
        },
        {
            "title": "Weakened Cyclone Chido brings relief to event organisers, artists",
            "url": "https://www.herald.co.zw/weakened-cyclone-chido-brings-relief-to-event-organisers-artists/",
            "content": "Trust Khosa\n\nTROPICAL Cyclone Chido weakened to a depression, and its downgrade brought joy to event planners and artists as they proceed with scheduled shows.\n\nFears that the anticipated wet spell would dampen the festive season and leave promoters and artists counting losses have subsided.\n\nThe cyclone, which made a landfall on Monday, triggered moderate rainfall in some parts of Zimbabwe.\n\nAccording to the Meteorological Services Department (MSD), the cyclones intensity diminished significantly as it moved inland. The wind speed and rainfall intensity have also weakened, providing relief to event planners, party-goers, and entertainers eager to capitalise on the lucrative festive season.\n\nOutdoor venues are especially vulnerable during inclement weather, and without proper precautions, they risk disappointing attendees.\n\nMany experienced promoters, who have opted for indoor venues to mitigate these risks, expressed their relief while still taking necessary precautions.\n\nProminent music promoters Partson Chipaz Chimbodza and Benjamin Nyandoro of Jive Zimbabwe have reaffirmed their commitment to moving forward with their events.\n\nThey are set to host the Zimbabwe Cup Clash at City Sports Centre in Harare on Unity Day, followed by another event at the Chitungwiza Aquatic Complex, headlined by Alick Macheso.\n\nIn a recent interview, Chimbodza confirmed that both shows will proceed as planned.\n\nTropical cyclones and rains are part of Gods plan that we cannot oppose. As experienced event planners, we have chosen enclosed venues to ensure fans safety.\n\nWe are also monitoring the weather conditions, especially the weakening Cyclone Chido, which was initially set to cause damage.\n\nWe chose City Sports Centre and Chitungwiza Aquatic Complex, both indoor venues, and we encourage attendees to arrive early to avoid any inconvenience in case of rain, Chipaz stated.\n\nHe emphasised the importance of staying informed about weather conditions:\n\nWe constantly monitor forecasts to avoid being caught off guard.\n\nAdditionally, we are praying for favourable weather and the safety of our fans. We have taken every measure possible to ensure their well-being.\n\nIn Chitungwiza, Chipaz will host Alick Macheso at the Aquatic Complex, with support from Holy Ten, Killer T, and others. At City Sports Centre, the new king or queen of clashes will be crowned at the 2024 Zimbabwe Cup Clash, where a car is up for grabs.\n\nSimilar sentiments were echoed by popular events planner Chau Nedi, who operates Jongwe Corner in Harare and Chinhoyi respectively.\n\nKnown as Boss Chau, the promoter has a packed schedule from December 22 to January 1.\n\nWe always set up tents and provide additional shelter at our venues to protect our fans from adverse weather.\n\nIn winter, we offer braziers, and we are committed to taking extra precautions during the rainy season.\n\nOn Unity Day, he will host Cello Culture at Jongwe Corner Harare, supported by the Transit Crew.\n\nOn Christmas Day, Master H will perform at his Chinhoyi branch, with Godfatha Templeman and Tanaman also on the lineup.\n\nThe New Years eve show will feature Freeman and Killer T at Jongwe Corner Chinhoyi, followed by Jah Prayzah on New Years Day at Jongwe Corner Harare.\n\nWith this busy schedule, my team is working hard to ensure the safety of our fans. I always prioritise their well-being, as they have supported me throughout my career. We want to celebrate together in a safe environment, he stated.\n\nDee Nosh from DTL Entertainment also shared his thoughts, as he hosts the Kadoma Shut Down Gig on December 31, featuring Tocky Vibes, Bling 4, Madedido, Killer T, and Enzo Ishall.\n\nIf it rains, we will still hold the show. However, we will set up enough tents to ensure our fans safety.\n\nWe dont take our fans for granted, as they are the reason we have come this far. We welcome reports that the tropical cyclone wont have the same impact, he said.\n\nSome venue owners in Harare remain unconcerned about the weather.\n\nOne such venue, Theatre in the Park at Harare Gardens, will host performances by Mokoomba and Gwevedzi on Boxing Day, ensuring a secure and enjoyable experience for attendees.\n\nThe Harare International Conference Centre (HICC), a popular venue for gospel events, will also be in the spotlight when it hosts the ANOT 2024 Concert on January 1, 2025, featuring performances by Janet Manyowa, Takesure Zamar, Bridget Ndanga, Pastor Bonnie, Dr Tumi, Everton Mlalazi, Lebo Sekgobela, Patience Masiyambiri, Pastor Bonnie Deuschle, Ellard, and Sharon Cherayi.\n\nMacheso, who will be performing from today until New Years Day, is also prepared.\n\nWe always collaborate with venue owners to ensure they dont incur losses.\n\nWe advise them to stay informed about the weather forecast, and we hope for their cooperation.\n\nOn our part, we will provide tents and security to keep our fans safe, said Machesos publicist, Tichaona Makahamadze.\n\nPeter Moyo, who has a series of shows lined up from today until January 1, 2025, added:\n\nWe were informed about this adverse weather pattern, and we are prepared for any situation. Ultimately, we leave everything in Gods hands, as He is our protector. We invite fans to join us in ushering in the festive season.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/08/Alick-Macheso-1.jpg",
            "description": "Trust Khosa TROPICAL Cyclone Chido weakened to a depression, and its downgrade brought joy to event planners and artists as they proceed with scheduled shows. Fears that the anticipated wet spell would dampen the festive season and leave promoters and artists counting losses have subsided. The cyclone, which made a landfall on Monday, triggered moderate […]",
            "time": "06:29",
            "date": "20 Dec 2024"
        },
        {
            "title": "Zimpapers embarks on digital transformation journey",
            "url": "https://www.herald.co.zw/zimpapers-embarks-on-digital-transformation-journey/",
            "content": "Remember Deketeke, Herald Reporter\n\nZimbabwe Newspapers (1980) Limited, the largest media group in Zimbabwe, yesterday officially launched its ambitious digital transformation initiative aimed at modernising operations and enhancing reader engagement.\n\nSpeaking at the launch, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere emphasised the significance of digital transformation in achieving Vision 2030.\n\nWe are here to witness a groundbreaking digital initiative, marking the beginning of Zimpapers journey toward total transformation as an institution, said Dr Muswere.\n\nZimpapers is undergoing a comprehensive digital transformation, with the Board, Management, and staff fully committed to this process. This initiative aims to ensure a total transformation of Zimpapers as an institution.\n\nThe transformation, he said, was essential as the company strived towards becoming an upper-middle-income society.\n\nDr Muswere outlined key aspects of the transformative journey, including cultural, behavioural, digital and business transformation.\n\nFor digital transformation to take place, the cultural transformation is to take the lead. The behavioural transformation is to take the lead as well, he said.\n\nThese four aspects in terms of the transformation of Zimpapers will ensure that the institution continues to grow.\n\nHe said Zimpapers must adapt to the Fourth Industrial Revolution.\n\nThe readership now focuses on traffic, content, and packaging. The old print media business model is declining, even though some segments still prefer physical copies, he said.\n\nThe board, management, and staff must strategically shift towards the complete digitalisation of Zimpapers. With approximately 8 million registered telecom subscribers and declining newspaper circulation, it is clear that we need to embrace the digital path.\n\nHowever, in this Fourth Industrial Revolution, innovation is crucial, as necessity drives invention.\n\nDr Muswere added effective collaboration among the board, management, and staff is essential for the success of the digital transformation journey.\n\nTo drive Zimpapers as an institution, Dr Muswere emphasised the need to adapt to market trends by packaging content digitally.\n\nDrawing lessons from the successful Kenyan model, Zimpapers Group CEO Mr Pikirayi Deketeke said it can guide the entity towards full digital implementation.\n\nThis initiative responds to the rapidly changing media landscape, where digital consumption is increasingly the norm.\n\nDr Muswere, along with his Deputy, Dr Omphile Marupi, and Permanent Secretary Mr Nick Mangwana, toured the groups new bookstore and coffee shop.\n\nThe minister also participated in interviews with ZTN Prime and Capitalk, discussing the importance of embracing digital transformation for media entities.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Zimpapers.jpg",
            "description": "Remember Deketeke, Herald Reporter Zimbabwe Newspapers (1980) Limited, the largest media group in Zimbabwe, yesterday officially launched its ambitious digital transformation initiative aimed at modernising operations and enhancing reader engagement. Speaking at the launch, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere emphasised the significance of digital transformation in achieving Vision 2030. “We are […]",
            "time": "06:29",
            "date": "20 Dec 2024"
        }
    ]
}