{
    "news": [
        {
            "title": "Chinhoyi break-in causes storm in chambers….council meeting disrupted",
            "url": "https://www.herald.co.zw/chinhoyi-break-in-causes-storm-in-chambers-council-meeting-disrupted/",
            "content": "Walter Nyamukondiwa\n\nMashonaland West Bureau Chief\n\nThere was drama at the Chinhoyi Municipality council chambers today as councillors exchanged words, leading to the disruption of a full council meeting.\n\nThis was after a break-in and theft of an estimated $18 000 from the director of finances office.\n\nCouncillor Vorster Mashevedzanwa (Ward 11) requested an update on the break-in that occurred early this morning and Mayor Owen Charuza, who was chairing the meeting, brushed it aside saying the matter was still under investigation.\n\nAs councillors, we deserve to know what happened and asking for an update is in order, he said.\n\nHowever, the Mayor insisted that the matter could not be discussed as details were still sketchy.\n\nThis ignited a fierce debate that saw the Mayor dismissing Coucillor Mashevedzanwa from the council chambers.\n\nThe order was met with resistance and efforts by the security to eject the councillor from the chamber were in vain.\n\nThis prompted other councillors, staff and residents to leave the gallery, leaving the two arguing in the chambers.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/5y5ty5t-680x380.jpg",
            "description": "Walter Nyamukondiwa Mashonaland West Bureau Chief There was drama at the Chinhoyi Municipality council chambers today as councillors exchanged words, leading to the disruption of a full council meeting. This was after a break-in and theft of an estimated $18 000 from the director of finance’s office. Councillor Vorster Mashevedzanwa (Ward 11) requested an update […]",
            "time": "21:28",
            "date": "10 Mar 2025"
        },
        {
            "title": "Government speaks on the status of the Bulawayo-Victoria Falls Highway",
            "url": "https://www.herald.co.zw/government-speaks-on-the-status-of-the-bulawayo-victoria-falls-highway/",
            "content": "Freeman Razemba\n\nSenior Reporter\n\nThe Government has noted with concern reports circulating on social media showing three people posing in a pothole on a road claimed to be part of the Bulawayo-Victoria Falls Highway.\n\nAccording Government, the image in the post does not correspond with any section along the highway.\n\nIn a statement, the Ministry of Transport and Infrastructural Development said some of the sections that require urgent attention are being attended to and some of the teams that are doing the works are already in some parts of the area.\n\nIt has come to our attention that a social media post is circulating, showing three people posing in a pothole on a road claimed to be part of the Bulawayo-Victoria Falls Highway, read the statement.\n\nWhile we acknowledge that certain sections of the highway are in dire need of rehabilitation, the images in the post do not correspond to any section of the Bulawayo-Victoria Falls Highway.\n\nThe sections requiring urgent attention are currently being addressed through a collaborative effort between the Department of Roads and Bitumen World. Work is already underway, with teams camped in Hwange, Halfway, and Insuza to ensure the road is rehabilitated efficiently.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Transport-and-Infrastructural-Development-Minister-Felix-Mhona.jpg",
            "description": "The Government has noted with concern reports circulating on social media showing three people posing in a pothole on a road claimed to be part of the Bulawayo-Victoria Falls Highway.",
            "time": "21:28",
            "date": "10 Mar 2025"
        },
        {
            "title": "Chipinge dam collapse, death toll rises to four",
            "url": "https://www.herald.co.zw/chipinge-dam-collapse-death-toll-rises-to-four/",
            "content": "Ray Bande and Luthando Mapepa\n\nA dam breach at a Chipinge farm on Sunday resulted in the release of a large quantity of water downstream, killing four people, including minors.\n\nThree other people are still missing while a number livestock has died.\n\nSeveral irrigation pump houses were also destroyed.\n\nA dam breach is the collapse or movement of part of a dam or its foundation, such that the dam cannot retain water. It results in the release of large quantities of water, posing risks to people, livestock or property downstream.\n\nThe Minister of State for Manicaland Provincial Affairs and Devolution, Advocate Misheck Mugadza visited the area today to assess the damage caused and console the bereaved families.\n\nI am on the ground and I can confirm that four people have died. Three are still missing. The search continues, and we hope that we will be able to find the missing persons in time, said Advocate Mugadza.\n\nCivil Protection Unit chairman for Manicaland, Mr John Misi said some of the deceased are minors who were in the company of their mother who was doing laundry downstream, while the other was a man on a fishing expedition.\n\nThe dam breach occurred at Bandama Farm, formerly known as Cantebury Farm. Although we are waiting for finer details, we are told that there was a female adult who was washing clothes downstream in the company of her two children. One of them  a four-year-old  was swept away and the body was latter retrieved, he said.\n\nThe other child who was with her mother, a 15-year-old, was swept away and was marooned on a piece of land, but was later rescued.\n\nThe other person who died was a 30-year-old man who was on a fishing expedition, said Mr Misi.\n\nIn a separate interview, Chipinge District Development Coordinator, Mr William Mashava, said a search is currently underway for the bodies of missing people, adding that some macadamia farmers were left counting their losses after their pump houses were destroyed.\n\nSeveral pump houses in Wards Seven and 10 which were installed closed to the river were destroyed by the floods, said Mr Mashava.\n\nWard 10 Councillor Piason Sithole said the community, with the help of various stakeholders, is on the ground searching for a missing body.\n\nHe said some villagers lost their livestock.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/3837b781-08e9-4b3c-880b-025bf733bb68-680x380.jpg",
            "description": "A dam breach at a Chipinge farm on Sunday resulted in the release of a large quantity of water downstream, killing four people, including minors.",
            "time": "21:28",
            "date": "10 Mar 2025"
        },
        {
            "title": "Four arrested for smuggling drugs in coffin",
            "url": "https://www.herald.co.zw/four-arrested-for-smuggling-drugs-in-coffin/",
            "content": "George Maponga in Masvingo\n\nPolice have arrested four cross-border transporters for smuggling drugs worth US$25 000 through the Beitbridge Border Post using a coffin.\n\nCharles Bhebhe (30) of Lobengula West, Bulawayo; James Sibanda (23) of Dulivadzimu, Beitbridge; Nevson Nhamo (39) of Woodlands, Gweru and Sifelani Nkiwane(42) of Mazetese, Mwenezi, allegedly used a fake burial order and an empty coffin to smuggle the drugs using a South African-registered white omnibus with a trailer.\n\nDetectives stopped the suspects at the 110km peg along the Masvingo-Beitbridge highway on March 6 at around 4pm.\n\nThe vehicle and trailer had Clairmont Funeral Parlour stickers. The suspects allegedly produced a fake burial order but the police proceeded to search the coffin.\n\nPolice recovered 2250100mls bottles of Broncleer, 2400100ml bottles of Bernylin syrup, 480100 bottles of Astrapain cough syrup and 100100 bottles of Salterpyn cough syrup.\n\nThe suspects were arrested after they failed to produce a licence to import the drugs.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/b6e1a236-7c17-4a27-a4dc-18ca859962f0-680x380.jpeg",
            "description": "Police have arrested four cross-border transporters for smuggling drugs worth US$25 000 through the Beitbridge Border Post using a coffin.",
            "time": "21:28",
            "date": "10 Mar 2025"
        },
        {
            "title": "Drug abuse fueling mental disorders, Minister Chombo",
            "url": "https://www.herald.co.zw/drug-abuse-fueling-mental-disorders-minister-chombo/",
            "content": "Walter Nyamukondiwa\n\nMashonaland West Bureau Chief\n\nThe Government has called for greater collaboration between its departments, agencies and various organisations promoting the rights and welfare of persons with disabilities to deal with the scourge of drug and substance abuse.\n\nAddressing the belated commemorations for International Day for Persons Living with Disabilities in Kadoma, Mashonaland West Provincial Affairs and Devolution Minister Marian Chombo said there is a rise in substance abuse-related disabilities.\n\nI implore youths in particular to stay away from drugs. The President is always saying the country is built by its own people but it is impossible to do that when people are intoxicated, she said.\n\nSeveral drugs and substances have led some people to suffer from mental illnesses, which are a form of disability. We should not take or sell drugs.\n\nShe said stakeholders should work hard to fulfil provisions of the Disability Policy to promote the rights and welfare of people with disabilities.\n\nPublic Service, Labour and Social Welfare Deputy Minister Mercy Dinha commended efforts to break barriers to the full participation of persons with disabilities in socio-economic activities.\n\nShe said to promote further inclusion, the Government plans to create disability specialists at district level.\n\nParliamentary Caucus on disabilities member, Cde Beatrice Nyamupinga said: We are seized with the task of ensuring some duty waivers for persons with disabilities.\n\nWe will also inspect institutions for persons with disabilities so that they get better standards.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Minister-Chombo-680x380.jpg",
            "description": "The Government has called for greater collaboration between its departments, agencies and various organisations promoting the rights and welfare of persons with disabilities to deal with the scourge of drug and substance abuse.",
            "time": "21:28",
            "date": "10 Mar 2025"
        },
        {
            "title": "Chitungwiza councillors celebrate International Women’s Day with maternity ward donations",
            "url": "https://www.herald.co.zw/chitungwiza-councillors-celebrate-international-womens-day-with-maternity-ward-donations/",
            "content": "Mutsawashe Mashandure\n\nHerald Correspondent\n\nFemale councillors in Chitungwiza marked International Womens Day by visiting local maternity wards and distributing essential items to new mothers as an appreciation of the role that women play in society.\n\nThe councillors donated protective clothing, baby clothes, crutches, syringes, and sanitary pads to 13 mothers across four facilities  five at Seke South Clinic, four at Seke North Clinic, three at St. Marys Clinic, and one at Zengeza Clinic.\n\nThe gesture was part of global celebrations for International Womens Day , which is observed annually on March 8.\n\nThis years theme was All Women and Girls: Rights. Equality. Empowerment.\n\nCouncillor Ms Betty Jasoni emphasised the importance of recognising womens contribution to society.\n\nWomen play a vital role in society. They bring new life into the world, nurture and raise children who become tomorrows leaders, she said.\n\nWe continue to advocate for equal access, representation, and respect for women in society.\n\nMs Jasoni said the donation was a way of celebrating the social, cultural, economic and political achievements of women worldwide.\n\nOne of the beneficiaries, Mrs Nkazana Chigodora, thanked the councillors for their kind gesture.\n\nI am grateful for these gifts. Now my baby will have many clothes, she said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Womens-day.jpg",
            "description": "Female councillors in Chitungwiza marked International Women's Day by visiting local maternity wards and distributing essential items to new mothers as an appreciation of the role that women play in society.",
            "time": "21:28",
            "date": "10 Mar 2025"
        },
        {
            "title": "Zimra shuts down Bulawayo’s Unity Village Flea Market",
            "url": "https://www.herald.co.zw/zimra-shuts-down-bulawayos-unity-village-flea-market/",
            "content": "Bulawayo Bureau\n\nTHE Zimbabwe Revenue Authority (Zimra) has locked up Unity Village Flea Market in Bulawayo as part of a nationwide blitz targeting smuggled goods and counterfeit products.\n\nThe flea market, which houses dozens of traders, is one of the busiest in the city centre, offering a variety of products ranging from clothing and footwear to mobile phones, accessories, and kitchenware.\n\nThis move comes as Zimra intensifies its crackdown across the country, targeting smuggling syndicates and tax evasion practices to boost Government revenue for national development.\n\nWhen the Zimpapers Business Hub visited the market this afternoon, crowds of people were milling around, unsure of where to go after their shops had been closed.\n\nIn an interview, the head of security at Unity Village, Mr Gilter Manasidze, confirmed that shops selling clothing, kitchenware, phones, and phone accessories had been closed. However, he said Zimra had stated that those offering phone repair and other services were not being targeted.\n\nThey are targeting those who are not paying duty, especially those who deal with clothing, mobile phones, and accessories. However, those who repair phones do not seem to be affected, said Mr Manasidze.\n\nThey have instructed us to compile all the stock and submit it to them so they can calculate how much duty is owed.\n\nAffected traders, who were gathered outside the closed market, expressed their frustration, stating that the shutdown was a significant blow to their livelihoods. Many now face an uncertain wait for Zimra officials to resolve the issue.\n\nI dont know what to do; I will just wait for Zimra officials to see what they say next. I am hoping for an immediate resolution to this unexpected shutdown, said one trader, who chose to remain anonymous.\n\nOthers voiced concerns about losing customers and struggling to provide for their families due to the uncertainty of when they would be able to resume business.\n\nMeanwhile, retail outlets adjacent to the Central Police Station, among others, have also been closed in recent weeks as part of the same operation.  Chronicle\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Unity-Village-flea-market-was-closed-by-Zimra-in-Bulawayo-yesterday-680x380.jpg",
            "description": "THE Zimbabwe Revenue Authority (Zimra) has locked up Unity Village Flea Market in Bulawayo as part of a nationwide blitz targeting smuggled goods and counterfeit products.",
            "time": "21:28",
            "date": "10 Mar 2025"
        },
        {
            "title": "Blessed Mhlanga’s High Court bail hearing deferred",
            "url": "https://www.herald.co.zw/blessed-mhlangas-high-court-bail-hearing-deferred/",
            "content": "Fidelis Munyoro\n\nAlpha Media Holdings (AMH) senior reporter, Blessed Mhlanga, appeared before the High Court for a bail hearing in relation to charges of transmitting messages to incite public violence.\n\nThe hearing was deferred to Wednesday to allow the State to file its response to his appeal. The prosecution requested additional time to prepare its submissions.\n\nJustice Gibson Mandaza, with the agreement of both the State and the defence, adjourned the proceedings to Wednesday.\n\nThe State has indicated its intention to transfer the matter to a specialised anti-corruption court, citing that the original case was previously heard in a Regional Court with anti-corruption jurisdiction at the Magistrates Court.\n\nHowever, the request was turned down.\n\nMhlangas lawyer, Mr Chris Mhike, opposed the transfer of the case to a specialised anti-corruption court, arguing that the alleged offence bore no connection to corruption or graft.\n\nHe further submitted that if proceedings were to be postponed, they should resume on Wednesday, March 12.\n\nThe allegations against Mhlanga stem from the events of January 27 when he allegedly used a computer to record and upload a video of Blessed Runesu Geza on YouTube, HSTV, and zimlive.co.zw for public viewing.\n\nThe video allegedly intended to incite public violence.\n\nAnother video, uploaded on February 11, also allegedly intended to incite public violence.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/04/Blessed-Mhlanga.jpg",
            "description": "Alpha Media Holdings (AMH) senior reporter, Blessed Mhlanga, appeared before the High Court for a bail hearing in relation to charges of transmitting messages to incite public violence.",
            "time": "21:28",
            "date": "10 Mar 2025"
        },
        {
            "title": "Church hailed for promoting peace",
            "url": "https://www.herald.co.zw/church-hailed-for-promoting-peace/",
            "content": "Daniel Chigunwe\n\nHerald Correspondent\n\nZanu PF legislator for Mazowe Central, Cde Maxmore Njanji, has applauded the church for praying for peace and prosperity in the country.\n\nSpeaking during the installation of Johanne Masowe Yechishanu Nyenyedzi Nomwes leader Madzibaba Dickson Chingoma, the legislator commended the church for playing a huge role in addressing social challenges.\n\nMadzibaba Dickson Chingoma (in maroon garment) speaking at the shrine.\n\nPresident Mnangagwa is on record saying nyika inovakwa nekunamatirwa nevene vayo. We thank the church for its efforts in praying for the peace in this country. Peace is crucial for our prosperity, said Cde Njanji.\n\nJohanne Masowe Yechishanu Nyenyedzi Nomwe national leaders at Chiocha shrine in Chiweshe.\n\nThe Second Republic has created a conducive environment for all churches. Through the churchs intercessory prayers, we received better rains this year and the country is food secure.\n\nWe are prepared to support the church so that it plays its part in national building. The drug abuse issue calls for more intercessory prayers, he said.\n\nAs a church, we feel honoured when political leadership pays attention to the guidance of the spirit and the church. It is important for the State to remain united with the church so that we all work towards the prosperity of our Zimbabwe, said Madzibaba Chingoma.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Mazowe-Central-MP-Dr-Maxmore-Njanji-chats-with-Madzibaba-Dickson-Chingoma-in-Chiweshe-on-Sunday-680x380.jpg",
            "description": "Zanu PF legislator for Mazowe Central, Cde Maxmore Njanji, has applauded the church for praying for peace and prosperity in the country.",
            "time": "21:28",
            "date": "10 Mar 2025"
        },
        {
            "title": "Social media influencers to market local products",
            "url": "https://www.herald.co.zw/social-media-influencers-to-market-local-products/",
            "content": "Mutsawashe Mashandure\n\nHerald Correspondent\n\nBuy Zimbabwe and the Content Creators Association of Zimbabwe (COCAZ) have signed a Memorandum of Understanding (MOU) to leverage on social media influence to drive sales and increase the visibility of locally manufactured goods.\n\nThe partnership, which was formalised today, will utilise over 400 influencers with a combined reach of more than five million followers to market local products and create sustainable employment opportunities for young creatives.\n\nThe initiative includes joint marketing campaigns, capacity-building workshops, and a commission-based revenue-sharing model.\n\nThe MOU will remain in place for five years.\n\nSpeaking at the signing ceremony, Buy Zimbabwe chairman and chief executive Mr Munyaradzi Hwengwere emphasised the transformative potential of the collaboration.\n\nToday, we signed an MOU with content creators to utilise their influence in marketing local products, he said.\n\nThis initiative ensures that we keep our money within Zimbabwe while creating sustainable employment for our members.\n\nSpeaking at the same event, COCAZ chief executive officer Mr Wellington Bakaimani said they are working with emerging and established content creators, as well as identifying aspiring ones across the country.\n\nWe want to give an opportunity to all talented young people, he said. We do not want to leave anyone behind.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Buy-Zimbabwe-680x380.jpg",
            "description": "Buy Zimbabwe and the Content Creators Association of Zimbabwe (COCAZ) have signed a Memorandum of Understanding (MOU) to leverage on social media influence to drive sales and increase the visibility of locally manufactured goods.",
            "time": "21:28",
            "date": "10 Mar 2025"
        }
    ]
}