{
    "news": [
        {
            "title": "SADC leaders discuss lasting peace in Eastern DRC",
            "url": "https://www.herald.co.zw/sadc-leaders-discuss-lasting-peace-in-eastern-drc/",
            "content": "Ivan Zhakata\n\nSADC leaders are gathered in Harare for an Extraordinary Summit to address the escalating security and humanitarian crisis in Eastern DRC.\n\nHosted at New Parliament, the Summit reaffirmed the regional blocs commitment to restoring peace and stability in the conflict-ridden region.\n\nIn his opening remarks, SADC chairperson, President Mnangagwa commended Member States and the SADC Secretariat for their unwavering support in ensuring collective security.\n\nHe acknowledged the extension of the SADC Mission in the DRC (SAMIDRC) and said there is need for continued backing of the troops on the ground.\n\nThe people of Eastern DRC have suffered for far too long, President Mnangagwa said.\n\nSADC chairperson, President Mnangagwa commended Member States and the SADC Secretariat for their unwavering support in ensuring collective security.\n\nWhile we mourn our losses, our resolve to ensure peace and stability remains unshaken. The importance of dialogue and peacebuilding must be boldly pursued.\n\nThe Summit also highlighted the dire humanitarian situation, with millions of internally displaced persons facing severe hardships.\n\nPresident Mnangagwa called on international cooperating partners to increase support for relief efforts and said more must be done to alleviate the suffering.\n\nOur political will must be strengthened. We must engage in frank and fact-based deliberations to ensure lasting peace.\n\nThe Extraordinary Summit follows a recent Troika meeting in Dar es Salaam, led by Tanzanian President Samia Suluhu Hassan, which laid the groundwork for a united regional response.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/SADC-Heads-of-State-680x380.jpg",
            "description": "Ivan Zhakata SADC leaders are gathered in Harare for an Extraordinary Summit to address the escalating security and humanitarian crisis in Eastern DRC. Hosted at New Parliament, the Summit reaffirmed the regional bloc’s commitment to restoring peace and stability in the conflict-ridden region. In his opening remarks, SADC chairperson, President Mnangagwa commended Member States and […]",
            "time": "21:06",
            "date": "31 Jan 2025"
        },
        {
            "title": "Zimbabwe hosts SADC Extraordinary Summit",
            "url": "https://www.herald.co.zw/zimbabwe-hosts-sadc-extraordinary-summit/",
            "content": "All is set for the SADC Extraordinary Summit that will be held at the New Parliament Building in Mt Hampden today.\n\nRegional Heads of State and Government are expected to arrive at the Robert Mugabe International Airport in Harare this morning ahead of the Summit.\n\nSADC Chair President Mnangagwa will preside over the Summit that will deliberate on the security situation in the Eastern part of the Democratic Republic of Congo (DRC).\n\nOur crew is at the Robert Mugabe International Airport and the New Parliament Building to give you live updates as the day progresses.\n\nSADC Executive Secretary Mr Elias Magosi already in the country for Summit\n\nSADC Chairperson President Mnangagwa met the blocs Executive Secretary Mr Elias Magosi yesterday ahead of the Extraordinary Summit for Heads of State and Government to be held in Harare today.\n\nMr Magosi was briefing President Mnangagwa on the preparations for todays meeting and the agenda that will be covered.\n\nWe paid a courtesy call on His Excellency as the Chairperson of SADC. He will be chairing the Extraordinary Summit on Friday (today) to discuss Eastern DRC matters. That is a worrying situation, Mr Magosi said.\n\nSecurity situation in DRC\n\nSome 400 000 people have been displaced in North and South Kivu since the beginning of this year alone, according to the UN refugee agency, UNHCR.\n\nHighlighting the humanitarian crisis that continues to unfold, UNHCR spokesperson Matt Saltmarsh reported that bombs have fallen on camps for people uprooted by the violence in South and North Kivu.\n\nThese attacks include one on 20 January, when explosions at Kitalaga site in South Kivu killed two children.\n\nOn 21 January, five makeshift shelters were destroyed in Nzuolo, near Goma, while on Wednesday, Bushagara site  also near Goma  was heavily impacted, causing panic and new waves of forced displacement, Mr Saltmarsh told journalists in Geneva.\n\nHe noted that heavy bombardments from clashes involving the M23 rebels forced families to flee various displacement sites on the periphery of Goma and try to seek safety within Goma.\n\nHow the M23 emerged\n\nOperating in the North Kivu province, the group takes its name from the March 23 Agreement of 2009 when the DRC government, under President Joseph Kabila  son of Laurent-Desire Kabila  signed a ceasefire treaty with the Tutsi-\n\nmajority National Congress for the Defence of the People (CNDP), one of the numerous groups of fighters active since the Second Congo War.\n\nIn the agreement, the CNDP was meant to become a political party and its fighters were to integrate into the Congolese military, FARDC.\n\nHowever, on April 4, 2012, 300 CNDP soldiers revolted, complaining of poor treatment in the army.\n\nThey formed the M23, claiming to be fighting for Tutsis rights in the DRC.\n\nIn late 2012, M23 launched an offensive, seizing Goma and several other towns. A special UN force along with FARDC pushed the rebels back into the eastern hills on the border with Rwanda in 2013.\n\nM23 resurfaced in 2022 with violent attacks and has seized at least four towns in North Kivu.\n\nThe group briefly withdrew from occupied towns in January 2023 as part of the Nairobi Peace Process, but the ceasefire fell apart in October.\n\nFighting between M23 rebels and FARDC erupted again at the beginning of last year.\n\nEast African Community calls for unconditional ceasefire\n\nAn emergency East African Community Summit held in Nairobi, Kenya, called for immediate unconditional ceasefire and facilitation of humanitarian access to the affected population in DRC.\n\nThe summit, called by President William Ruto, was held on Wednesday night virtually.\n\nRwandas President Paul Kagame, President Yoweri Museveni of Uganda, President Samia Suluhu of Tanzania, President Sheikh Mohamud of Somalia, President Evariste Ndayishimiye of Burundi and South Sudans President Salva Kiir attended the meeting.\n\nThe meeting also urged the DRC government, led by President Felix Tshisekedi, to directly engage all stakeholders in the conflict, including M23 and other armed groups, to end the rebel assault.\n\nDRCs President Felix Tshisekedi\n\nScenes at the Robert Gabriel Mugabe International Airport ahead of the arrival of SADC Heads of State and Government\n\n10:33-Tanzanias President, who is also the chairperson of Sadc Organ Troika on Politics, Defence and Security Cooperation Dr Samia Suluhu Hassan has arrived at Robert Mugabe International Airport.\n\nTanzania President Samia Suluhu Hassan arrives\n\nShe is welcomed by Attorney General, Mrs Virginia Mabhiza\n\nMadagascars President Andry Rajoelina has also arrived at the Robert Mugabe International Airport joining other Heads of State and Government for the Extraordinary SADC Summit.\n\nHe is being received by National Housing and Social Amenities Minister Zhemu Soda.\n\nMOZAMBIQUEs President Daniel Chapo has also jetted into the country for the Extra Ordinary Summit.\n\nHe is welcomed by Minister of Defence Oppah Muchinguri-Kashiri and Zimbabwes Ambassador to Mozambique Victor Matemadanda.\n\nNeighbouring country, Botswanas President Duma Boko has also arrived in the country for the Extra Ordinary Summit.\n\nPresident Boko has been received by Tourism and Hospitality Industry Minister Barbara Rwodzi.\n\nAs the clock ticks towards the commencement of the Southern African Development Community (SADC) Extraordinary Summit this afternoon, the atmosphere at the new Parliament is charged with anticipation and optimism.People have gathered eager to catch a glimpse of the arriving Heads of State and Government who will convene to deliberate on pressing regional issues.\n\nSOUTH AFRICAN President Cyril Ramaphosa has arrived in Harare where he is joining other regional leaders for the SADC Extraordinary Summit of Heads of State and Government.\n\nPresident Ramaphosa was welcomed by Finance, Economic Development and Investment Promotion Minister Mthuli Ncube.\n\nMozambiques President Daniel Chapo has arrived at the new Parliament for the Extra Ordinary Summit.He is accompanied Minister of Defence Oppah Muchinguri-Kashiri and Zimbabwes Ambassador to Mozambique Victor Matemadanda.\n\nBotswanas President Duma Boko has also arrived at the new Parliament for the Extraordinary Summit.He was accompanied by Tourism and Hospitality Industry Minister Barbara Rwodzi.\n\nPresident of Lesotho Sam Matekane has arrived at the new Parliament for the SADC extraordinary summit.\n\nHe was accompanied by the the Minister of Home Affairs and Cultural Heritage Kazembe Kazembe and they were welcomed by the Minister of Foreign Affairs and International Trade Professor Amon Murwira.\n\nTanzanias President and SADC Organ Troika on Politics, Defence and Security Cooperation chairperson Dr Samia Suluhu Hassan has arrived at the new Parliament for the SADC extraordinary summit.\n\nShe was accompanied by Attorney General Attorney General Virginia Mabhiza and they were welcomed by the Minister of Foreign Affairs and International Trade Professor Amon Murwira\n\nMadagascars President Andry Rajoelina has arrived at the new Parliament joining other SADC Heads of State. He was accompanied by National Housing and Social Amenities Minister Zhemu Soda and were welcomed by the Minister of Foreign Affairs and International Trade\n\nSADC Leaders Arrive for Extraordinary SummitA sense of urgency and anticipation fills the air as SADC Heads of State arrive at the new Parliament for the extraordinary summit.\n\nSirens wail as sleek motorcades glide through tight security. Flags of member states ripple in the breeze, lining the grand entrance.\n\nDignitaries step onto the red carpet, greeted with firm handshakes and flashes of cameras. The Parliaments modern faade gleams under the afternoon sun, a symbol of regional unity. Inside, hushed conversations and determined expressions set the tone.\n\nThe singing of the Zimbabwe National Anthem is underway\n\nNow people are singing the SADC national anthem\n\nIntroduction of the SADC Heads of State and other representatives currently underway\n\nAmong them HE Ramaphosa (SA), HE Duma Boko (Botswana), HE Daniel Chapo (Mozambique), PM Matekani (Eswatini), HE Rajoelina Madagascar. HE Tshisekedi (DRC) will participate virtually\n\nElias Magosi Executive secretary of the Southern African Development Community is now delivering his welcome remarks\n\nHe says the meeting has been convened to discuss the deteriorating situation in Eastern DRC\n\nElias Magosi applauded President Mnangagwa for convening the meeting at a short notice\n\nHe says the presence of Heads of State at the meeting shows their concern for peace in the region\n\nHe is now giving his introductory remarks\n\nSADC executive secretary calls for global cooperation to address DRC security crisis\n\nSADC Executive Secretary Elias Magosi has stressed the need for increased international collaboration to tackle the worsening security situation in the Democratic Republic of Congo (DRC). Speaking at the SADC extraordinary summit in\n\nHarare, Magosi said there were challenges facing the DRC, particularly in the eastern regions.\n\nHe called for stronger partnerships to restore peace.\n\nSecurity cannot be achieved in isolation. The DRC, our region and the international community must come together to confront these challenges, Magosi said.\n\nHe said it was necessary to dismantle the economic power of armed groups destabilising the region.\n\nMagosi said the December 2023 summit as a crucial moment for advancing peace efforts.\n\nWe will continue to engage our partners to support the Government of the DRC in its fight for stability, he said.\n\nSADC Chair, His Excellency President Emmerson Dambudzo Mnangagwa officially opens the Extraordinary Summit\n\nOn behalf of SADC and people of Zimbabwe, the SADC Chair conveyed his condolences to the families who lost their loved ones in eastern DRC\n\nThe gathering rises to observe a moment of silence at the instigation of the President.\n\nWe meet today to seek lasting solutions to the situation in the Eastern DRC, he said.\n\nMember states will continue to do all they can to restore peace and order in the DRC, he said.\n\nLet us not overlook the humanitarian crises as it should not be ignored, said the SADC Chair.\n\nSADCs resolve to ensure collective peace will not be shaken\n\nOur region stands ready to intensify efforts, he said, adding that the peace and security of the region is a collective responsibility\n\nHe concludes his speech. Closed session begins.\n\nSADC leaders commit to lasting peace in Eastern DRC\n\nIvan Zhakata\n\nSADC leaders are gathered in Harare for an Extraordinary Summit to address the escalating security and humanitarian crisis in Eastern DRC.\n\nHosted at New Parliament, the summit reaffirmed the regional blocs commitment to restoring peace and stability in the conflict-ridden region.\n\nIn his opening remarks, SADC chairperson, President Mnangagwa commended Member States and the SADC Secretariat for their unwavering support in ensuring collective security.\n\nHe acknowledged the extension of the SADC Mission in the DRC (SAMIDRC) and said there was a need for continued backing of the troops on the ground.\n\nThe people of Eastern DRC have suffered for far too long, President Mnangagwa said.\n\nWhile we mourn our losses, our resolve to ensure peace and stability remains unshaken. The importance of dialogue and peacebuilding must be boldly pursued.\n\nThe summit also highlighted the dire humanitarian situation, with millions of internally displaced persons facing severe hardships.\n\nPresident Mnangagwa called on International Cooperating Partners to increase support for relief efforts and said more must be done to alleviate the suffering.\n\nOur political will must be strengthened. We must engage in frank and fact-based deliberations to ensure lasting peace.\n\nThe Extraordinary Summit follows a recent Troika meeting in Dar es Salaam, led by Tanzanian President Samia Hassan, which laid the groundwork for a united regional response.\n\nHosted at New Parliament, the Summit reaffirmed the regional blocs commitment to restoring peace and stability in the conflict-ridden region.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/cc0b62f4-e6ea-44ea-910f-abc27e73113c-680x380.jpeg",
            "description": "All is set for the SADC Extraordinary Summit that will be held at the New Parliament Building in Mt Hampden today. Regional Heads of State and Government are expected to arrive at the Robert Mugabe International Airport in Harare this morning ahead of the Summit. SADC Chair President Mnangagwa will preside over the Summit that […]",
            "time": "21:06",
            "date": "31 Jan 2025"
        },
        {
            "title": "Dynamos Football Club founding member Marriot acquitted of fraud.",
            "url": "https://www.herald.co.zw/dynamos-football-club-founding-member-marriot-acquitted-of-fraud/",
            "content": "Prosper Dembedza\n\nHerald Correspondent\n\nHarare magistrate Ms Yeukai Dzuda has acquitted Dynamos Football Club founding member Bernard Marriott Lusengo on allegations of corruptly acquiring 51 percent shareholding in the club and allocating other shares to undeserving people who are not the clubs original members.\n\nIn her ruling, the magistrate said the complainants do not fall in the category of former players as per the clubs 1963 Constitution.\n\nThe magistrate said none of the complainants played for Dynamos during its formation in 1963.\n\nThe State did not tender evidence to prove a charge of fraud against the accused person, therefore he is found not guilty and acquitted, ruled the magistrate.\n\nIn his defence, Lusengo said the complainants in the matter were not entitled to any shares in the club.\n\nHe also told the court that he is the only surviving member of the clubs founders.\n\nLusengo added that the 1963 constitution was repealed at a general assembly meeting and from that day, the club is being run by articles of association.\n\nIt was the States case that Lusengo declared himself the clubs chairman, and is said to have acted against a High Court order which awarded each founding member one percent share.\n\nThe then High Court judge, Justice Luke Malaba gave the order after the ownership wrangle spilled into court in 2005.\n\nLusengo was charged with fraud after being arrested by the Zimbabwe Anti-Corruption Commission.\n\nLeslie Gwindi was the complainant in the matter.\n\nLusengo was being represented by Herbert Mutasa.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/07/dynamos-11.jpg",
            "description": "Prosper Dembedza Herald Correspondent Harare magistrate Ms Yeukai Dzuda has acquitted Dynamos Football Club founding member Bernard Marriott Lusengo on allegations of corruptly acquiring 51 percent shareholding in the club and allocating other shares to undeserving people who are not the club’s original members. In her ruling, the magistrate said the complainants do not fall […]",
            "time": "21:06",
            "date": "31 Jan 2025"
        },
        {
            "title": "Regional leaders continue trickling in for SADC Extraordinary Summit",
            "url": "https://www.herald.co.zw/regional-leaders-continue-trickling-in-for-sadc-extraordinary-summit/",
            "content": "Online Reporter\n\nMozambiques President Daniel Chapo has arrived in Zimbabwe for the SADC Extraordinary Summit on DRC.\n\nPresident Chapo was welcomed at Robert Mugabe International Airport by Zimbabwes Defence Minister Oppah Muchinguri-Kashiri and Zimbabwes Ambassador to Mozambique, Cde Victor Matemadanda.\n\nBotswanas President Duma Boko has also touched down and was received by Tourism and Hospitality Industry Minister Barbara Rwodzi.\n\nTanzanias President and chairperson of the SADC Organ Troika on Politics, Defence, and Security Cooperation, Dr Samia Suluhu Hassan, and Madagascars President Andry Rajoelina arrived earlier today.\n\nThe Summit brings together regional leaders to deliberate on pressing security and political matters within the SADC bloc, particularly concerning stability in the Democratic Republic of the Congo (DRC).\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/6c37ff09-8406-4210-a297-38b2d2b7529e-680x380.jpeg",
            "description": "Mozambique’s President Daniel Chapo has arrived in Zimbabwe for the SADC Extraordinary Summit on DRC.",
            "time": "21:06",
            "date": "31 Jan 2025"
        },
        {
            "title": "Vapostori Council applauds President Mnangagwa’s leadership, economic reforms",
            "url": "https://www.herald.co.zw/vapostori-council-applauds-president-mnangagwas-leadership-economic-reforms/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nThe National Judicial Council of Vapostori (NJCV) has praised President Emmerson Mnangagwa and the Government for a strong start to 2025, saying there has been economic progress, stability and national unity.\n\nIn a statement released by its pastoral representatives across Zimbabwes 10 provinces, the NJCV expressed gratitude for the Governments commitment to economic growth through the National Development Strategy 1 (NDS-1) and Vision 2030.\n\nThe council commended President Mnangagwa for laying a strong foundation in public infrastructure development, economic development, and regional integration.\n\nThe National Judicial Council of Vapostori is grateful for the visionary leadership demonstrated by President Mnangagwa in setting the economic foundation for public infrastructure, economic growth, and regional stability, reads the statement.\n\nThe religious body praised the growing unity among Zimbabweans, crediting it to the adoption of the national philosophy nyika inovakwa, inotongwa, inonamatirwa nevene vayo.\n\nAccording to the NJCV, the philosophy has fostered national cooperation and strengthened faith in Government-led initiatives.\n\nThe council urged all religious communities to continue praying for macroeconomic stability, infrastructure development, and fiscal discipline as the country marches towards attaining Vision 2030.\n\nThe NJCV also raised concerns over recent incidents where individuals publicly disrespected President Mnangagwa, and urged citizens to express their grievances through peaceful and respectful engagement.\n\nZimbabwe is guided by faith, patriotism, peace, and harmony. We pray and urge those with grievances to approach the President respectfully and peacefully, the NJCV said.\n\nAs Zimbabwe continues into the year, the NJCV reaffirmed its support for the Governments policies and called for continued unity.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Untitled-67-680x380.jpg",
            "description": "The National Judicial Council of Vapostori (NJCV) has praised President Emmerson Mnangagwa and the Government for a strong start to 2025, saying there has been economic progress, stability and national unity.",
            "time": "21:06",
            "date": "31 Jan 2025"
        },
        {
            "title": "Housing target within reach as contractors embrace hi-tech methods",
            "url": "https://www.herald.co.zw/housing-target-within-reach-as-contractors-embrace-hi-tech-methods/",
            "content": "Mukudzei Chingwere\n\nHerald Reporter\n\nZimbabwe is on track to achieve its ambitious goal of constructing one million housing units before the end of 2025, thanks to significant advancements in construction technology and a renewed commitment from both the Government and the private sector.\n\nZimbabwe Builders Contractors Association (ZBCA) president Dr Tinashe Manzungu said the introduction of hi-tech construction methods has revolutionised the building process, allowing contractors to meet the growing demand for housing more efficiently.\n\nThis year, we are not just meeting targets, we are exceeding them, thanks to modern techniques, said Dr Manzungu.\n\nThe better and modern equipment has drastically reduced construction time and costs, enabling us to deliver quality housing units at an unprecedented pace.\n\nIn addition to technological advancements, the collaboration between the Government and private sector has been pivotal.\n\nFor instance, the construction of student accommodation units in Bulawayo, Chinhoyi, and Zvishavane is expected to significantly enhance living standards for students.\n\nThe contractors enthusiasm is palpable, with many expressing a sense of urgency to capitalise on the current momentum.\n\nThe market is ripe for innovation and we are ready to embrace it, said Manah Buildings construction director, Mr Arthar Mafuya, the ZBCA 2024 contractor of the year.\n\nWith the skills we have developed and the technologies at our disposal, we can tackle the housing backlog head-on.\n\nNonaly Trading director Mr Nobioth Magwizi said Government has created an environment that is conducive for businesses to thrive.\n\nThe collaborative efforts between the public and private sectors have been pivotal in transforming our housing landscape, said Mr Magwizi.\n\nThrough Government projects, we have gained invaluable experience and resources, enabling us to contribute significantly to this cause.\n\nAs we celebrate this achievement, we recognise it as a testament to what can be accomplished when we unite in purpose.\n\nWe remain committed to building sustainable and affordable housing solutions for all Zimbabweans and we look forward to continuing this journey together, said Mr Magwizi.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/olk-680x380.jpg",
            "description": "Mukudzei Chingwere Herald Reporter Zimbabwe is on track to achieve its ambitious goal of constructing one million housing units before the end of 2025, thanks to significant advancements in construction technology and a renewed commitment from both the Government and the private sector. Zimbabwe Builders Contractors Association (ZBCA) president Dr Tinashe Manzungu said the introduction […]",
            "time": "21:06",
            "date": "31 Jan 2025"
        },
        {
            "title": "Madagascar’s President Andry Rajoelina arrives",
            "url": "https://www.herald.co.zw/madagascars-president-andry-rajoelina-arrives/",
            "content": "Online Reporter\n\nMADAGASCARs President Andry Rajoelina has arrived at the Robert Mugabe International Airport to join other Heads of State and Government for the SADC Extraordinary Summit set for today.\n\nPresident Rajoelina was welcomed by National Housing and Social Amenities Minister Zhemu Soda.\n\nThe Summit is expected to bring together regional leaders to discuss pressing security and political issues affecting the region, particularly the situation in the Democratic Republic of the Congo (DRC).\n\nThe participation of President Rajoelina highlights Madagascars commitment to regional cooperation and peace-building efforts.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/bcdc0723-67ee-42b3-8deb-86e39820059b-1-680x380.jpeg",
            "description": "Online Reporter MADAGASCAR’s President Andry Rajoelina has arrived at the Robert Mugabe International Airport to join other Heads of State and Government for the SADC Extraordinary Summit set for today. President Rajoelina was welcomed by National Housing and Social Amenities Minister Zhemu Soda. The Summit is expected to bring together regional leaders to discuss pressing […]",
            "time": "21:06",
            "date": "31 Jan 2025"
        },
        {
            "title": "Public Service Commission constructs mega shopping mall in Marondera",
            "url": "https://www.herald.co.zw/public-service-commission-constructs-mega-shopping-mall-in-marondera/",
            "content": "Victor Maphosa\n\nMashonaland East Burea\n\nMashonaland East Secretary for Provincial Affairs and Devolution Mr Tavabarira Kutamahufa toured a shopping mall that is under construction in Marondera on Thursday.\n\nThe Public Service Commission Pension Fund is financing the construction of the shopping complex which has three modern structures and is being built in two phases.\n\nThe first phase has been completed, with the structure now being leased to a local company.\n\nMr Kutamahufa was accompanied by officials from eight rural district councils from across Mashonaland East Province.\n\nIn an interview with The Herald on the sidelines of the tour, Mr Kutamahufa said officials from the local authorities were invited to get insight into the concept so that they may replicate it in their respective areas.\n\nHe invited more people to invest in the province, saying Mashonaland East has plenty of opportunities.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/09ea9c7b-7f17-4d41-b115-47fed22f8b94-680x380.jpeg",
            "description": "Mashonaland East Secretary for Provincial Affairs and Devolution Mr Tavabarira Kutamahufa toured a shopping mall that is under construction in Marondera on Thursday.",
            "time": "21:06",
            "date": "31 Jan 2025"
        },
        {
            "title": "Former cop arrested over land deal",
            "url": "https://www.herald.co.zw/former-cop-arrested-over-land-deal/",
            "content": "Herald Reporter\n\nA former police officer has been arrested after he sold a non-existent Budiriro stand to a home seeker for US$9 000.\n\nIn a statement, the Zimbabwe Anti-Corruption Commission (ZACC) said it arrested a former police officer, Absolom Mudzamiri, for allegedly defrauding a Harare woman in a fraudulent residential stand sale.\n\nZACC said the circumstances are that the complainant, whose husband works in Botswana, responded to a Facebook advertisement in December 2023 for the sale of a residential stand in Budiriro CABS.\n\nMudzamiri, posing as the owner of the stand, facilitated a sale agreement drafted by his lawyer, Milton Serima.\n\nThe complainant allegedly paid a total of US$9 000 for the stand.\n\nIn July 2024, the complainant and her husband visited the stand, found unauthorised construction, and confronted Mudzamiri over the issue.\n\nMudzamiri promised to reimburse the couple but failed.\n\nThe matter was reported to ZACC and investigations revealed that the piece of land is actually Harare City Councils property.\n\nMudzamiri is expected to appear at the Harare Magistrates Court today (Friday).\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/08/Arrested.jpg",
            "description": "Herald Reporter A former police officer has been arrested after he sold a non-existent Budiriro stand to a home seeker for US$9 000. In a statement, the Zimbabwe Anti-Corruption Commission (ZACC) said it arrested a former police officer, Absolom Mudzamiri, for allegedly defrauding a Harare woman in a fraudulent residential stand sale. ZACC said the […]",
            "time": "21:06",
            "date": "31 Jan 2025"
        },
        {
            "title": "Midlands High Court clears 60 cases in first week of January",
            "url": "https://www.herald.co.zw/midlands-high-court-clears-60-cases-in-first-week-of-january/",
            "content": "Crime Reporter\n\nThe Midlands High Court Circuit has cleared its backlog by completing 60 cases during the first week of January 2025.\n\nThis special circuit court was established in response to a backlog of over 500 cases dating back to as far as 2019.\n\nThe National Prosecuting Authority confirmed the development in a statement.\n\nThe Midlands High Court Circuit has made significant progress in clearing its backlog of cases, completing 60 cases in its first week ending January 24, 2025, it reads the statement.\n\nThe same court completed 50 cases in the same period in the first circuit last year. Of these, 24 offenders were found guilty of murder and received sentences ranging from 18 years to life.\n\nAnother 24 had their charges reduced to culpable homicide, while 12 were acquitted due to lack of evidence or insanity. One case was withdrawn due to the death of State witnesses.\n\nThe first phase, which took place in September 2024, was highly successful, completing just under 140 cases with an impressive clearance rate of 90 percent.\n\nAccording to NPA, this initiative seeks to expedite the resolution of cases, with particular attention to the disproportionately high number of murder cases frequently involving artisanal miners and the use of lethal weapons, including knives and machetes.\n\n",
            "image_url": null,
            "description": "Crime Reporter The Midlands High Court Circuit has cleared its backlog by completing 60 cases during the first week of January 2025. This special circuit court was established in response to a backlog of over 500 cases dating back to as far as 2019. The National Prosecuting Authority confirmed the development in a statement. “The […]",
            "time": "21:06",
            "date": "31 Jan 2025"
        }
    ]
}