{
    "news": [
        {
            "title": "Four nabbed over Meru Service Station robbery",
            "url": "https://www.herald.co.zw/four-nabbed-over-meru-service-station-robbery/",
            "content": "Arron Nyamayaro\n\nFour men were today arrested in connection with the recent armed robbery involving US$129 111 collected from three Meru Service Stations in Harare.\n\nThe four are Willard Zvinorukwa (48), Ernest Manzunzu (45), Ashwin Mukondwa (30) and Bornface Masora (31).\n\nIn a statement, national police spokesperson, Commissioner Paul Nyathi said detectives from CID Homicide Harare received information that one of the suspects was in Chitungwiza.\n\nZvinorukwa attempted to flee, prompting the detectives to fire warning shots, Commissioner Nyathi said.\n\nHowever, he continued to flee until the detectives shot him once on the right leg, leading to the arrest of the other three. He implicated eight other suspects who are still at large.\n\nPolice investigations revealed that the suspects shared the loot and received varying amounts ranging from US$4 000 to US$10 000, which they used to purchase goods and lend money to others.\n\nRecovered items include US$16 240, a wardrobe, a kitchen unit, a television set, kitchen utensils, and a cellphone.\n\nCommissioner Nyathi said Masora has an outstanding warrant of arrest for an armed robbery case in Kadoma.\n\nMenbers of the public were commended for supplying credible information that led to the arrest of the criminals.\n\nThe police reiterated that there is no going back in the fight against armed robbery cases in the country.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/07/1705-1-1-PAUL-THEMBA-NYATHI-1-3.jpg",
            "description": "Arron Nyamayaro Four men were today arrested in connection with the recent armed robbery involving US$129 111 collected from three Meru Service Stations in Harare. The four are Willard Zvinorukwa (48), Ernest Manzunzu (45), Ashwin Mukondwa (30) and Bornface Masora (31). In a statement, national police spokesperson, Commissioner Paul Nyathi said detectives from CID Homicide […]",
            "time": "21:26",
            "date": "07 Mar 2025"
        },
        {
            "title": "Supreme Court dismisses Chimombe’s bail appeal",
            "url": "https://www.herald.co.zw/supreme-court-dismisses-chimombes-bail-appeal/",
            "content": "Jerry Chifamba\n\nThe Supreme Court has dismissed Mike Chimombes bail appeal, upholding the High Courts decision to deny him bail.\n\nA statement issued by the National Prosecuting Authority today indicated that the superior court found that the State had established compelling reasons for Chimombes continued detention, including the likelihood of absconding, the seriousness of the charges and the risk of interfering with witnesses.\n\nThe businessman has been at the centre of a high-profile fraud case involving allegations of misusing funds related to the Presidential Goats Pass-on Scheme.\n\nHe was arrested in 2024 along with his co-accused, Moses Mpofu.\n\nChimombe was initially denied bail by the Magistrates Court in July 2024, with the court citing concerns that he was likely to abscond and interfere with witnesses.\n\nHe appealed this decision at the High Court, but the appeal was overtaken by events when he and his co-accused were indicted for trial.\n\nIn January this year, Chimombe filed another bail application at the High Court, which was also denied.\n\nThe court reiterated the magistrates findings, emphasising the seriousness of the charges and the risk of witness interference.\n\nChimombe then took his case to the Supreme Court.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/08/Mike-Chimombe.jpg",
            "description": "Jerry Chifamba The Supreme Court has dismissed Mike Chimombe’s bail appeal, upholding the High Court’s decision to deny him bail. A statement issued by the National Prosecuting Authority today indicated that the superior court found that the State had established compelling reasons for Chimombe’s continued detention, including the likelihood of absconding, the seriousness of the […]",
            "time": "21:26",
            "date": "07 Mar 2025"
        },
        {
            "title": "Man up for stock theft",
            "url": "https://www.herald.co.zw/man-up-for-stock-theft/",
            "content": "Crime Reporter\n\nA 32-year-old man has been arrested in Nyabira on allegations of stealing six goats at a farm in the area.\n\nIn a statement, national police spokesperson Commissioner Paul Nyathi confirmed the mans arrest.\n\nOn March 4, police in Nyabira arrested Michael Gombe (32) in connection with a stock theft case that occurred at Dryham Farm on the same day, he said.\n\nThe suspect, together with his accomplice who is still at large, allegedly stole six goats from the complainants pen.\n\nThey then slaughtered the goats, packed the meat into plastic bags, and fled the scene. The suspect was later apprehended while looking for transport to Harare along the Harare-Chirundu highway.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/4f42r-680x380.jpg",
            "description": "Crime Reporter A 32-year-old man has been arrested in Nyabira on allegations of stealing six goats at a farm in the area. In a statement, national police spokesperson Commissioner Paul Nyathi confirmed the man’s arrest. “On March 4, police in Nyabira arrested Michael Gombe (32) in connection with a stock theft case that occurred at […]",
            "time": "21:26",
            "date": "07 Mar 2025"
        },
        {
            "title": "Zimbabwe woos energy investors at Powering Africa Summit",
            "url": "https://www.herald.co.zw/zimbabwe-woos-energy-investors-at-powering-africa-summit/",
            "content": "Herald Correspondent\n\nA high-powered Zimbabwe delegation is attending the Powering Africa Summit 2025 (PAS25) in Washington DC in the United States of America, seeking to attract energy investors to boost the countrys energy sector.\n\nRunning under the theme The Future of the US & Africa Energy Partnership, the summit seeks to find long-term energy solutions to address the continents economic growth and industrialisation agenda.\n\nEnergy and Power Development Minister July Moyo and Finance, Economic Development and Investment Promotion Minister, Professor Mthuli Ncube are part of the countrys delegation.\n\nOur plea to the US is for them to release their private sector so that they can invest in Zimbabwe. We have created an enabling environment, Minister Moyo said.\n\nHe also urged investors to capitalise on the presence of natural gas in Zimbabwe.\n\nInvestment in gas is what we are looking forward to.\n\nHe also outlined Zimbabwes other energy investment opportunities, including wind, solar, the proposed Batoka Gorge Hydroelectric Power Station, and thermal power projects.\n\nIn his speech, Professor Ncube highlighted some incentives that the Government has unveiled for investors in the countrys energy sector.\n\nThese include economic tariffs, currency convertibility and Government guarantees on power purchase agreements.\n\nWe give some projects national project status and prescribed assets status, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/04/Untitled-sdvsvsv.jpg",
            "description": "Herald Correspondent A high-powered Zimbabwe delegation is attending the Powering Africa Summit 2025 (PAS25) in Washington DC in the United States of America, seeking to attract energy investors to boost the country’s energy sector. Running under the theme “The Future of the US & Africa Energy Partnership”, the summit seeks to find long-term energy solutions […]",
            "time": "21:26",
            "date": "07 Mar 2025"
        },
        {
            "title": "Zanu PF unveils primary election candidates",
            "url": "https://www.herald.co.zw/zanu-pf-unveils-primary-election-candidates/",
            "content": "Joseph Madzimure\n\nZimpapers Politics Hub\n\nZanu PF has introduced candidates that will participate in the partys primary elections for Glenview South on Sunday ahead of the by-elections set for April 12 2025.\n\nGlenview South Constituency fell vacant following the death of Glandmore Hakata.\n\nAmong the Zanu PF candidates participating in the primary elections are Cdes Tsitsi Taomera, Jabulani Mbetu, Bwanyu Muchakachi and Tawanda Utete.\n\nZanu PF shadow MP for Glen South, Cde Ophard Muchuwe is no longer eligible to contest. According to the partys rules and regulations, if a candidate fails to win elections for two terms, he or she should not seek re-election.\n\nZanu PF Politburo member, Cde Paul Mangwana was the guest of honour as the candidates were unveiled.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Untitled-30-680x380.jpg",
            "description": "Joseph Madzimure Zimpapers Politics Hub Zanu PF has introduced candidates that will participate in the party’s primary elections for Glenview South on Sunday ahead of the by-elections set for April 12 2025. Glenview South Constituency fell vacant following the death of Glandmore Hakata. Among the Zanu PF candidates participating in the primary elections are Cdes […]",
            "time": "21:26",
            "date": "07 Mar 2025"
        },
        {
            "title": "Women applauded for preserving the environment",
            "url": "https://www.herald.co.zw/women-applauded-for-preserving-the-environment/",
            "content": "Fungai Lupande\n\nMashonaland Central Bureau\n\nMashonaland Central Provincial Affairs and Devolution Minister Christopher Magomo has commended women for preserving the environment.\n\nMinister Magomo was speaking during a national clean-up campaign at the Mushumbi Business Centre in Mbire this morning.\n\nHe said an increasing number of women are actively engaging in the preservation of Africas natural resources.\n\nWomen manage natural resources daily in their role as farmers, he said. They grow subsistence crops and often possess unique knowledge of local crop species.\n\nHe said that improving womens rights to access natural resources is not just a necessity but an obligation and an urgent imperative for maintaining the development trajectory of Africa and Zimbabwe.\n\nMinister Magomo noted that the significant contributions of women to economic growth and food security should not be overlooked.\n\nHe, however, pointed out that one major barrier to maximising these contributions is womens lack of secure tenure over natural resources, particularly land and water.\n\nThe clean-up campaign coincided with the commemoration of the Africa Environment Day, celebrated annually on March 3.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Untitled-29-680x380.jpg",
            "description": "Mashonaland Central Provincial Affairs and Devolution Minister Christopher Magomo has commended women for preserving the environment.",
            "time": "21:26",
            "date": "07 Mar 2025"
        },
        {
            "title": "Zìmbabwe to benefit from Agilitee Africa deal",
            "url": "https://www.herald.co.zw/zimbabwe-to-benefit-from-agilitee-africa-deal/",
            "content": "Farirai Machivenyika\n\nSenior Reporter\n\nZimbabwe is among the countries that are set to benefit from a deal entered into by Agilitee, Africas first electric vehicles manufacturer, and Chinas Guangzhou Thunder International Investment Company for the supply of scooters suitable for home deliveries.\n\nAgilitee has operations in the country through Agilitee Zimbabwe.\n\nThe deal was signed this week when an Agilitee delegation, led by founder and chief executive officer, Dr Mandla Lamba, visited China.\n\nUnder the deal, Guangzhou Thunder will deliver 40 000 scooters to Agilitees South Africa. These will be distributed to other African countries, including Zimbabwe.\n\nCountries that will benefit are Zimbabwe, Nigeria, Kenya, Malawi, Ghana and Lesotho, Dr Lamba said in a statement.\n\nThis programme will provide a source of income for those who do deliveries, he added.\n\nThe Chinese company and Agilitee also signed a deal to form Explore Group Africa, which will be headquartered in South Africa.\n\nThis will see Guangzhou Thunder building a plant in South Africa for the manufacturing and assembly of its scooters that will be supplied to the African market.\n\nUnder the deal, Agilitee will own a minority interest of 35 percent while Guangzhou Thunder will hold 65 percent ownership.\n\nDespite facing some challenges, Agilitee has grown in leaps and bounds as a leading Pan African manufacturer.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/f6927e9b-63d0-44df-9780-02397e6c30b2-680x380.jpeg",
            "description": "Zimbabwe is among the countries that are set to benefit from a deal entered into by Agilitee, Africa's first electric vehicles manufacturer, and China's Guangzhou Thunder International Investment Company for the supply of scooters suitable for home deliveries.",
            "time": "21:26",
            "date": "07 Mar 2025"
        },
        {
            "title": "Prioritise women’s rights, empowerment and equality: Minister Mutsvangwa",
            "url": "https://www.herald.co.zw/prioritise-womens-rights-empowerment-and-equality-minister-mutsvangwa/",
            "content": "Solomon Bhumu\n\nManicaland Bureau\n\nWomen Affairs, Community, Small and Medium Enterprises Development Minister, Senator Monica Mutsvangwa, has called for the prioritisation of rights, equality, and empowerment of women and girls.\n\nWe are celebrating the social, economic, cultural, and political achievements of women and girls around the world, Minister Mutsvangwa said in her keynote address at the International Womens Day national commemorations held at Munyarari\n\nPrimary School in Zimunya, Mutare, this afternoon.\n\nThis years theme is All women and girls: Rights. Equality. Empowerment.\n\nThe theme serves as a powerful reminder of the ongoing struggle for gender equality and the importance of inclusive and collective action.\n\nMinister Mutsvangwa said women and girls continue to face significant barriers to achieving their full potential.\n\nFrom discriminatory laws and policies to societal norms and stereotypes, women and girls are often marginalised, excluded, and silenced, said Minister Mutsvangwa.\n\nShe said despite all this, the Government has made incredible progress towards achieving gender equality.\n\nOur Constitution guarantees equal rights for women and men, and we have implemented various policies and programmes to promote gender equality, she said.\n\nShe said the Women Affairs Ministry is providing training to women on climate change mitigation, which is key in building resilience.\n\nThe Women Affairs, Community, Small and Medium Enterprises Development Ministry, in collaboration with development partners and financial institutions, have also established microfinance facilities to provide affordable loans to women, enabling them to carry out income generating activities.\n\nShe said moving forward, the rights, equality, and empowerment of all women and girls must be prioritised\n\nWe owe it to ourselves to create a future free from discrimination.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/8869dba6-9a8d-4847-ac24-1b9deb81333a-680x380.jpeg",
            "description": "Women Affairs, Community, Small and Medium Enterprises Development Minister, Senator Monica Mutsvangwa, has called for the prioritisation of rights, equality, and empowerment of women and girls.",
            "time": "21:26",
            "date": "07 Mar 2025"
        },
        {
            "title": "Yadah face Chicken Inn with only 12 players",
            "url": "https://www.herald.co.zw/yadah-face-chicken-inn-with-only-12-players/",
            "content": "Sports Reporter\n\nAll is not well at Yadah Stars who are reeling under the effects of a FIFA player transfer ban over their failure to pay their former Brazilian trio.\n\nThe team is playing its match day two against Chicken Inn with only one substitute. Last week they had two substitutes but left-back Anotidaishe Gwatidzo was red-carded and is suspended.\n\nThey lost that game 1-0 against Manica Diamonds.\n\nIt is understood that the team has paid part of the US$82 000 they were asked to pay by FIFA but for now they have to carry their cross.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2017/01/Magaya.jpg",
            "description": "Sports Reporter All is not well at Yadah Stars who are reeling under the effects of a FIFA player transfer ban over their failure to pay their former Brazilian trio. The team is playing its match day two against Chicken Inn with only one substitute. Last week they had two substitutes but left-back Anotidaishe Gwatidzo […]",
            "time": "21:26",
            "date": "07 Mar 2025"
        },
        {
            "title": "Zimbabwe upholds human rights",
            "url": "https://www.herald.co.zw/zimbabwe-upholds-human-rights/",
            "content": "Nyasha Motsi\n\nHerald Reporter\n\nThe Zimbabwe Human Rights Commission (ZHRC) chairperson, Commissioner Jessie Majome, has expressed satisfaction with the Governments commitment to upholding the International Covenant on Civil and Political Rights (ICCPR).\n\nSpeaking during a press conference in Harare on Thursday, Commissioner Majome acknowledged the Governments efforts to fulfill its obligations under the ICCPR, which is a significant milestone in promoting and protecting human rights in Zimbabwe.\n\nThese include the ratification of some key human rights instruments such as the Convention on the Rights of Persons with Disabilities (CRPD), accession to the International Convention on the Protection of the Rights of all Migrant Workers (ICRMW) and their family members, Commissioner Majome said.\n\nThe ZHRC further notes the enactment of progressive legislation such as the Criminal Laws Amendment (Protection of Children and Young Persons) which sets the age of consent for minors at 18 years, effectively closing the legal gap on the protection of children between ages 16 and 18 from sexual abuse and child marriages.\n\nShe said the Commission also welcomes the abolishment of the Death Penalty Act, as it seeks to preserve the sanctity of life.\n\nIn this regard, Zimbabwe did better than countries that are party to the ICCPR Second Optional Protocol on the death penalty, Commissioner Majome said.\n\nShe commended the passing of the Prisons and Correctional Service Act saying it aligns with the Constitution of Zimbabwe and other regional and international instruments on the humane treatment of prisoners.\n\nWhile celebrating the progress made in promoting human rights, Commissioner Majome urged the Government to fulfill some of its obligations under several outstanding treaties, including the United Nations Convention Against Torture (UNCAT), which aims to prevent torture and other cruel, inhumane, or degrading treatment or punishment.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/05/Zimbabwe-Human-Rights-Commission-ZHRC.jpg",
            "description": "The Zimbabwe Human Rights Commission (ZHRC) chairperson, Commissioner Jessie Majome, has expressed satisfaction with the Government’s commitment to upholding the International Covenant on Civil and Political Rights (ICCPR).",
            "time": "21:26",
            "date": "07 Mar 2025"
        }
    ]
}