{
    "news": [
        {
            "title": "Senate passes Broadcasting Services Amendment Bill",
            "url": "https://www.herald.co.zw/senate-passes-broadcasting-services-amendment-bill/",
            "content": "Farirai MachivenyikaSenior ReporterSenate has passed the Broadcasting Services Amendment Bill, with the prospective law now awaiting transmission to President Mnangagwa for his assent.The Bill was passed without amendments.\n\nResponding to issues raised by Senators during the Committee stage of the Bill, Information, Publicity and Broadcasting Services Minister, Dr Jenfan Muswere said the Bill is meant to revamp the broadcasting sector, including improving revenue generation for the national broadcaster, ZBC.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Muswere1.jpg",
            "description": "Farirai Machivenyika Senior Reporter Senate has passed the Broadcasting Services Amendment Bill, with the prospective law now awaiting transmission to President Mnangagwa for his assent.The Bill was passed without amendments. Responding to issues raised by Senators during the Committee stage of the Bill, Information, Publicity and Broadcasting Services Minister, Dr Jenfan Muswere said the Bill […]",
            "time": "20:43",
            "date": "01 Apr 2025"
        },
        {
            "title": "Zanu PF thanks citizens for upholding peace",
            "url": "https://www.herald.co.zw/zanu-pf-thanks-citizens-for-upholding-peace-2/",
            "content": "Joseph Madzimure\n\nZimpapers Politics Hub\n\nZanu PF has applauded Zimbabweans for choosing to continue with the agenda of the revolutionary and progressive leadership of President Mnangagwa who is delivering the hopes and aspirations of the people.\n\nThis follows the widespread snubbing of a call for violent protests by fugitive former Zanu PF Central Committee member, Blessed Geza, on Monday.\n\nSpeaking at a press conference this afternoon, Zanu PF spokesperson Ambassador Christopher Mutsvangwa said Zimbabweans showed high levels of discipline yesterday.\n\nPeople want confidence in a leader before they follow him. Geza expected people to follow him; maybe those behind him gave him the courage. You cannot just wake up thinking you can change a Government just like that, he said.\n\nPresident Mnangagwa has addressed the majority of challenges in Zimbabwe, (for example) the marginalisation of the war veterans is being addressed.\n\nHe added: Someone (Geza) was wearing a military uniform at the age of over 70, trying to be a saviour. Zimbabweans are not interested in the farce that happened yesterday. The revolution is very much alive.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Untitled-4-680x380.jpg",
            "description": "Joseph Madzimure Zimpapers Politics Hub Zanu PF has applauded Zimbabweans for choosing to continue with the agenda of the revolutionary and progressive leadership of President Mnangagwa who is delivering the hopes and aspirations of the people. This follows the widespread snubbing of a call for violent protests by fugitive former Zanu PF Central Committee member, […]",
            "time": "20:43",
            "date": "01 Apr 2025"
        },
        {
            "title": "Zanu PF thanks citizens for upholding peace",
            "url": "https://www.herald.co.zw/zanu-pf-thanks-citizens-for-upholding-peace/",
            "content": "Joseph MadzimureZimpapers Politics HubZanu PF has applauded Zimbabweans for choosing to continue with the agenda of the revolutionary and progressive leadership of President Mnangagwa who is delivering the hopes and aspirations of the people.This follows the widespread snubbing of a call for violent protests by fugitive former Zanu PF Central Committee member, Blessed Geza, on Monday.Speaking at a press conference this afternoon, Zanu PF spokesperson Ambassador Christopher Mutsvangwa said Zimbabweans showed high levels of discipline yesterday.\n\nPeople want confidence in a leader before they follow him. Geza expected people to follow him; maybe those behind him gave him the courage. You cannot just wake up thinking you can change a Government just like that, he said.\n\nPresident Mnangagwa has addressed the majority of challenges in Zimbabwe, (for example) the marginalisation of the war veterans is being addressed.\n\nHe added: Someone (Geza) was wearing a military uniform at the age of over 70, trying to be a saviour. Zimbabweans are not interested in the farce that happened yesterday. The revolution is very much alive.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Cde-Chris-Mutsvangwa.jpg",
            "description": "Zanu PF has applauded Zimbabweans for choosing to continue with the agenda of the revolutionary and progressive leadership of President Mnangagwa who is delivering the hopes and aspirations of the people.",
            "time": "20:43",
            "date": "01 Apr 2025"
        },
        {
            "title": "Zimasco gets corporate rescue reprieve",
            "url": "https://www.herald.co.zw/zimasco-gets-corporate-rescue-reprieve/",
            "content": "Court Reporter\n\nThe High Court has issued a provisional order restraining Harare lawyer Mr Wilson Manase from presenting himself as the corporate rescue practitioner for Zimasco (Pvt) Ltd.\n\nJustice Faith Mushure delivered the ruling.\n\nMr Manase based his assertion on a court order issued against Sinosteel Zimasco (Pvt) Ltd  a separate entity that Zimasco insisted is unrelated to its operations.\n\nA key player in the mining industry, Zimasco contends that it is not in financial distress.\n\nThe company further argued that Avim Investments, the entity linked to Shephard Tundiya and responsible for securing the court order against Sinosteel Zimasco, is not a creditor.\n\nZimasco maintained that the documents used by Avim Investments to obtain the order are irrelevant to its operations or financial status.\n\nThe interdict was granted pending a return day, on which Zimasco will seek a declaration confirming that it is not Sinosteel Zimasco.\n\nAlternatively, the company will request rescission of the court order, arguing that it was not properly served and that a sustainable defense exists on the merits.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Zimasco-479x380.jpg",
            "description": "The High Court has issued a provisional order restraining Harare lawyer Mr Wilson Manase from presenting himself as the corporate rescue practitioner for Zimasco (Pvt) Ltd.",
            "time": "20:43",
            "date": "01 Apr 2025"
        },
        {
            "title": "Chivhayo lobola robbery: Another suspect in court",
            "url": "https://www.herald.co.zw/chivhayo-lobola-robbery-another-suspect-in-court/",
            "content": "Prosper Dembedza\n\nHerald Dembedza\n\nAnother suspect has appeared in court for robbing businessman Wicknell Chivhayos in-laws of US$85 558 and property valued at US$3 900 at their farm in Marondera.\n\nBigboy Nampungo (27) was not asked to plead to armed robbery charges when he appeared before a Harare magistrate.\n\nThe complainant is Gerald Gara Muteke (36), a farmer residing at Alfa and Omega Farm. This brings the number of suspects that have appeared in court in connection with the case to nine.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/01/84181_generic-wpvi-robbery-IMG.jpeg",
            "description": "Another suspect has appeared in court for robbing businessman Wicknell Chivhayo's in-laws of US$85 558 and property valued at US$3 900 at their farm in Marondera.",
            "time": "20:43",
            "date": "01 Apr 2025"
        },
        {
            "title": "Sponsored: Yutong launches the D14 bus, strengthens transport sector",
            "url": "https://www.herald.co.zw/yutongsponsored-yutong-launches-the-d14-bus-strengthens-transport-sector/",
            "content": "Harmony Agere\n\nYutong Zimbabwe today unveiled its D14 front-engine coach at the Harare International Conference Centre.\n\nThe launch marks a significant milestone in Zimbabwes transport sector as the vehicle is designed to enhance efficiency, comfort and reliability for both operators and passengers.\n\nThe D14 boasts a modern exterior featuring LED headlights with a lifespan of 50 000 hours, consuming only 30W of power.\n\nThis design not only reduces heat output but also ensures safer night-time driving.\n\nInside, the coach offers an upgraded dashboard, additional storage and a fully air-suspended drivers seat, providing enhanced support for long-haul journeys.\n\nWith an extended body capable of accommodating up to 77 passengers without compromising comfort, the D14 aims to boost operational efficiency and revenue potential for transport operators.\n\nThe luggage compartment has been expanded by 40 percent, compared to previous models. It now offers 15.5 cubic meters of storage space to meet the growing demand for passenger luggage capacity.\n\nUnder the hood, the D14 is powered by an engine delivering up to 410 horsepower, ensuring exceptional performance across diverse terrains and long distances.\n\nThe integration of the Bluecore intelligent fuel-saving system enhances efficiency, reducing fuel consumption by 8 percent to 10 percent.\n\nBuilt to withstand Zimbabwes challenging road terrain, the coach features advanced anti-corrosion technology suitable for high temperatures and dusty environments.\n\nIts high-strength, 700 MPa steel frame is three times stronger than standard steel, providing maximum passenger protection in the event of roll-overs.\n\nYutong has a well-established presence in Africa, with nearly 22 000 buses sold across the continent over the past two decades.\n\nThe introduction of the D14 in Zimbabwe underscores Yutongs commitment to delivering reliable, high-performance transportation solutions tailored to the evolving needs of the African passenger transport sector.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Yutong-D14-676x380.png",
            "description": "Yutong Zimbabwe today unveiled its D14 front-engine coach at the Harare International Conference Centre.",
            "time": "20:43",
            "date": "01 Apr 2025"
        },
        {
            "title": "SADC marks 45 years of regional cooperation, integration",
            "url": "https://www.herald.co.zw/sadc-marks-45-years-of-regional-cooperation-integration/",
            "content": "Online Reporter\n\nThe Southern African Development Community (SADC) is celebrating its 45th anniversary today, reaffirming its commitment to regional cooperation, integration and development.\n\nIn a statement marking the occasion, the SADC Secretariat reflected on the regional blocs journey since its establishment on April 1, 1980, when the Lusaka Declaration was signed, creating the Southern African Development Coordinating Conference (SADCC).\n\nThe body was later transformed into SADC on August 17, 1992, following the signing of the SADC Treaty and Declaration in Windhoek, Namibia.\n\nAs we commemorate 45 years of SADC, we reaffirm our commitment to deepening regional cooperation, integration and development for the people of Southern Africa, said the SADC Secretariat.\n\nOur efforts continue to be guided by the SADC Vision 2050  a vision for a peaceful, inclusive, competitive and industrialised region, where all citizens enjoy sustainable economic well-being, justice and freedom.\n\nThe regional bloc, headquartered in Gaborone, Botswana, consists of 16 Member States, working together to foster economic growth, trade, peace and stability across Southern Africa.\n\nPresident Mnangagwa assumed the SADC chairmanship in August 2024 and has said economic integration, industrialisation and regional stability are key priorities during his tenure.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/SADCC.jpg",
            "description": "The Southern African Development Community (SADC) is celebrating its 45th anniversary today, reaffirming its commitment to regional cooperation, integration and development.",
            "time": "20:43",
            "date": "01 Apr 2025"
        },
        {
            "title": "‘HIV remains a public health priority’",
            "url": "https://www.herald.co.zw/hiv-remains-a-public-health-priority/",
            "content": "Africa Moyo in CHINHOYI\n\nZimbabwe has recorded significant milestones in the fight against HIV, but more efforts are required to end the HIV/AIDS epidemic as a public health threat by 2030, National AIDS Council (NAC) acting chief executive officer Mr Raymond Yekeye has said.\n\nExperts define a public health threat as a situation that poses a significant risk to the health and well-being of a population, potentially leading to widespread illness, injury, or death.\n\nExamples include disease outbreaks and natural disasters, climate change, and social determinants of health like poverty, inequality, and lack of access to healthcare.\n\nIn his opening remarks at an Editors Workshop that opened here today, Mr Yekeye said despite significant progress made in reducing new infections and expanding treatment, HIV remains a public health priority that continues to demand concerted efforts to tackle it.\n\nWe cannot afford complacency. Your voices (media) can help keep HIV high on the national agenda, advocate for resource mobilisation, and hold stakeholders accountable.\n\nYour presence here underscores the vital role played by editors in shaping public understanding, influencing behaviour, and ultimately contributing to our national response to HIV and AIDS, he said.\n\nMr Yekeye said the workshop for editors has been organised to strengthen collaboration in the national HIV response through accurate, responsible, and impactful media reporting.\n\nAs gatekeepers of information, your commitment to accurate, responsible, and impactful reporting is indispensable.\n\nThis workshop has been designed to provide you with the latest information on the HIV and AIDS landscape in Zimbabwe, including the impact of the recent funding cuts by the United States government.\n\nIn addition to the usual updates, we have included topical issues such as microbial resistance, use of artificial intelligence in cervical cancer screening, advanced HIV diseases, and HIV funding, among others, for your benefit, he said.\n\nThe two-day workshop comes a few days after journalists toured Mashonaland East Province as part of NACs ongoing efforts to strengthen collaboration with the media, which is critical in promoting awareness.\n\nThe global community aims to end the HIV/AIDS epidemic as a public health threat by 2030, as outlined in the Sustainable Development Goals.\n\nThis requires strong political leadership, data-driven approaches, and addressing inequalities, alongside ensuring sufficient and sustainable funding.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/83bb56cb-e07e-4cb1-a2da-97b72c2a6e8a-680x380.jpeg",
            "description": "Zimbabwe has recorded significant milestones in the fight against HIV, but more efforts are required to end the HIV/AIDS epidemic as a public health threat by 2030, National AIDS Council (NAC) acting chief executive officer Mr Raymond Yekeye has said.",
            "time": "20:43",
            "date": "01 Apr 2025"
        },
        {
            "title": "Four killed in Gutu accident",
            "url": "https://www.herald.co.zw/four-killed-in-gutu-accident/",
            "content": "Online Reporter\n\nFour people died while four others were injured on Sunday when a Toyota Noah with seven passengers on board veered off the road and overturned along the Chatsworth-Kurai Road in Gutu.\n\nThe accident occurred around 3 pm.\n\nThe bodies of the victims were taken to Gutu Mission Hospital mortuary for post-mortem while the injured were admitted at the same hospital, the police said in a statement.\n\nSundays tragedy followed a deadly Friday in which 15 people lost their lives in four separate accidents that occurred in Norton, Chegutu and Mutare.\n\nIn the deadliest incident on Friday, seven people died while 12 others were injured when a Nissan Caravan kombi carrying 20 passengers veered off the road and overturned along the Harare-Bulawayo Road.\n\nThree victims, including an infant, died on the spot, while three others succumbed to injuries at Norton Hospital.\n\nAnother fatal collision occurred on the same highway when a Chevrolet Trailblazer that was attempting to overtake a Toyota Hilux was involved in an accident, killing three and injuring two.\n\nIn Chegutu, two people died and nine were injured after a Toyota Toyoace truck veered off the road, ejecting passengers from its loading box.\n\nIn Mutare, three fatalities were recorded when a Volvo haulage truck overturned near the Wise Owl turn-off along the Harare-Mutare highway.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/04/accident.jpg",
            "description": "Four people died while four others were injured on Sunday when a Toyota Noah with seven passengers on board veered off the road and overturned along the Chatsworth-Kurai Road in Gutu.",
            "time": "20:43",
            "date": "01 Apr 2025"
        },
        {
            "title": "Police hunt for woman linked to newborn baby’s murder in Harare",
            "url": "https://www.herald.co.zw/police-hunt-for-woman-linked-to-newborn-babys-murder-in-harare/",
            "content": "Online Reporter\n\nThe police have launched a manhunt for a Harare woman, Ireen Pamela Govati, who is wanted in connection with the murder of her newborn baby in Hopley.\n\nThe incident occurred on December 8 last year at a house in Hopley Zone 6 when Govati allegedly gave birth to a baby boy and placed him in a 20-litre plastic bucket under her bed.\n\nThe baby was discovered by Govatis 12-year-old daughter and niece after they heard the child crying.\n\nAccording to the police, Govati then took the newborn to her tenant, Rejoice Mapfumo, who allegedly grabbed the baby by the legs and flung him twice onto the ground, killing him instantly.\n\nThe two women then buried the body in a shallow grave.\n\nThe two children reported the crime to the police on the same day, leading to Mapfumos arrest.\n\nHowever, Govati remains at large.\n\nPolice have urged the public to assist with any information on Govatis whereabouts through the National Complaints Desk on (0242) 703631, WhatsApp 0712800197, or the nearest police station.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/05/police.jpg",
            "description": "The police have launched a manhunt for a Harare woman, Ireen Pamela Govati, who is wanted in connection with the murder of her newborn baby in Hopley.",
            "time": "20:43",
            "date": "01 Apr 2025"
        }
    ]
}