{
    "news": [
        {
            "title": "Masterstroke! . . . Govt unpacks title deeds’ benefits to landowners",
            "url": "https://www.herald.co.zw/masterstroke-govt-unpacks-title-deeds-benefits-to-landowners/",
            "content": "Zvamaida Murwira-Senior Reporter\n\nPRESIDENT Mnangagwas historic unveiling of title deeds to landowners at the launch of the Land Tenure Implementation Programme last month will create new land markets, allow farm subdivisions to cater for family inheritance and provide an exit strategy for those who choose to opt out of farming, a Cabinet Minister has said.\n\nIn an interview, Lands, Agriculture, Fisheries, Water and Rural Resettlement Minister, Dr Anxious Masuka, said only individuals or spouses were entitled to title deeds.\n\nCompanies and family trusts do not qualify as the Government moves to curb multiple farm ownership.\n\nFirst of all, His Excellency the President of the Republic of Zimbabwe Dr E.D Mnangagwa has taken a revolutionary step to improve the security of tenure in compliance with the Constitution. Second, the new title will allow landowners the option to secure financing for their agricultural activities. The title will potentially allow capital markets to improve their participation in agricultural value chains, said Minister Masuka.\n\nThirdly, the title will allow for official farm subdivisions to cater for family inheritance. Fourth, the title will create a new land market, creating opportunities for land transfers to qualifying Zimbabweans. Fifth, the title provides an exit strategy for farmers who opt out of farming and they will recover their investment. These options are not fully addressed by the current leases and permits regime.\n\nOn how farmers will buy the land and how the value will be determined, Minister Masuka said the costs will be determined by ecological regions.\n\nFarmers will have very generous terms and options to purchase the land. The value attached to the land is primarily according to the agro-ecological region where land in Regions One and Two with higher rainfall costs more per hectare compared to land in areas with lower rainfall potential such as Region Five. For instance, a hectare in Region One could be worth US$500 or ZiG equivalent while a hectare in Natural Region 5 could cost US$100,00 or ZiG equivalent, he said.\n\nFurthermore, and secondarily, specific land values will be determined by land use classification, proximity to towns, presence of rivers or dams and land improvements, among others. Traditional methods of farm valuation and sales have been thoroughly examined and the present system adopted is heavily discounted to allow every farmer an opportunity to opt to purchase the land.\n\nMinister Masuka said all Zimbabwean citizens holding an offer letter, permit or lease for agricultural purposes qualified for title deeds.\n\nA very thorough screening process has been operationalised to weed outnon-genuine permits and leases, he said.\n\nMinister Masuka described the process of issuing title deeds as an automatic one where there would be verification using a database of land owners.\n\nThis is an automatic process where everyone with a permit or lease or offer letter now qualifies to get a title deed. The database of land holders will be used with sufficient verification to issue title deeds.\n\nSurveyed land with 99-year leases will be prioritised. Agreement of sale forms are signed by the applicant and the Minister responsible for Lands. Thereafter, the application is submitted to the Deeds Registry for registration through Government Conveyancers, he said.\n\nMinister Masuka said Government had made arrangements with financial institutions who will provide funding for the purchase of land.\n\nThe Government of Zimbabwe has made arrangements with financial institutions to offer mortgages for purchase of agricultural land. Once agreed, land owners will receive Title Deeds which will be issued against full payment or mortgage with the selected banks. The banks shall be making separate announcements, he said.\n\nLast month, President Mnangagwa delivered the historic first batch of title deeds to beneficiaries under the Land Tenure Implementation Programme as the Second Republic bolsters land ownership that will put an end to the issue of tenure and security.\n\nThe tenure system will revolutionalise the Land Reform Programme embarked upon by the Government from the year 2000, and ensure bankability and transferability of title.\n\nThe President launched the programme at Pricabe Farm in Kwekwe, a property owned by the First Family.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/President-Mnangagwa-title-deeds-680x380.jpg",
            "description": "Zvamaida Murwira-Senior Reporter PRESIDENT Mnangagwa’s historic unveiling of title deeds to landowners at the launch of the Land Tenure Implementation Programme last month will create new land markets, allow farm subdivisions to cater for family inheritance and provide an exit strategy for those who choose to opt out of farming, a Cabinet Minister has said. […]",
            "time": "08:34",
            "date": "24 Jan 2025"
        },
        {
            "title": "‘Mupamhanga worked hard for national development’",
            "url": "https://www.herald.co.zw/mupamhanga-worked-hard-for-national-development/",
            "content": "Mukudzei Chingwere-Herald Reporter\n\nFORMER Deputy Chief Secretary in the Office of the President and Cabinet, Cde Justin Mupamhanga, was a straightforward man who never moved away from the ethos of the liberation struggle and worked hard for national development, Acting President Dr Constantino Chiwenga has said.\n\nSpeaking at the Mupamhanga family home in Harare yesterday where he had visited to console them, Acting President Chiwenga said President Mnangagwa was saddened by the death of Cde Mupamhanga, whose Chimurenga name was Cde Top 10.\n\nThe President is saddened by the death of Cde Top 10, that was the name we used to call Cde Mupamhanga, he said.\n\nWhen we notified the President of the sad loss, the decision to honour Cde Top 10 with hero status was unanimous, reflecting the immense contribution he made to our country.\n\nWe faced numerous problems along the way, which dates back to the days of our liberation struggle, but Top 10 never deviated from the ideals of the liberation struggle, and he worked very hard for Zimbabwe pre and post-independence.\n\nActing President Chiwenga was accompanied by Vice President Kembo Mohadi, Zanu PF National Chairman and Defence Minister Oppah Muchinguri-Kashiri, Home Affairs and Cultural Heritage Minister Kazembe Kazembe, who is also the ruling partys Mashonaland Central provincial chairman, and Minister of State for Harare Metropolitan Affairs and Devolution Charles Tawengwa, among other senior Government officials.\n\nCde Mupamhanga died on Wednesday in Harare and was declared a national hero. He is expected to be buried on Monday at the National Heroes Acre.\n\nActing President Chiwengadescribed Cde Mupamhanga as a man of integrity who never strayed from the principles that guided our fight for independence.\n\nHe is one person who exerted himself fully in work; he put his full weight and full strength in all the work he did and was best with his family, his party and his country.\n\nHe was one of the pioneering university students who joined the liberation struggle, he said.\n\nActing President Chiwenga urged the family to celebrate the life of Cde Mupamhanga and take pride from the legacy he left due to his principled and forthright work ethic.\n\nOn his part, Vice President Mohadi was full of praise for Cde Mupamhangas contribution, describing him as a strong and hardworking man.\n\nWe have come here to mourn with you following the death of our colleague, said VP Mohadi.\n\nWe had a very good working relationship with Cde Mupamhanga and he worked very hard for the development of this country.\n\nHe has left a very huge void which will be difficult to fill, but we only get solace from the good work he did for his country.\n\nMinister Muchinguri-Kashiri said the presence of senior Government and party officials at the funeral wake of Cde Mupamhanga was testament to the good work he did for the country.\n\nCde Mupamhanga worked very hard for Zimbabwe, before and after independence, our presence here is a reflection of the good work he did for his country, said Minister Muchinguri-Kashiri.\n\nFamily representative and son to the national hero Mr Simba Mupamhanga thanked the Government and the ruling Zanu PF party for honouring his father.\n\nWe are very grateful for the honour bestowed on our father; the highest honour in the land. We do not take lightly this recognition and for that we want to say thank you.\n\nOne thing that our father used to say was that his colleagues will remember the journey they travelled together, and one thing that I can testify is that his comrades never let him down, they always supported him and even after his death they have honoured him, said Mr Mupamhanga.\n\nHis death came on a day when the country buried three national heroes  the late Cde Chakezha Chenhamo Chen Chimutengwende, Major-General (Retired) Solomon Siziba and Ambassador John Shumba Mvundura.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Acting-President-Chiwenga-at-Mupamhanga-residence-680x380.jpg",
            "description": "Mukudzei Chingwere-Herald Reporter FORMER Deputy Chief Secretary in the Office of the President and Cabinet, Cde Justin Mupamhanga, was a straightforward man who never moved away from the ethos of the liberation struggle and worked hard for national development, Acting President Dr Constantino Chiwenga has said. Speaking at the Mupamhanga family home in Harare yesterday […]",
            "time": "08:34",
            "date": "24 Jan 2025"
        },
        {
            "title": "Govt to rescue Knowstics Academy learners",
            "url": "https://www.herald.co.zw/govt-to-rescue-knowstics-academy-learners/",
            "content": "Trust Freddy-Herald Correspondent\n\nGovernment is making efforts to resolve a standoff between Knowstics Academy and the British Council Zimbabwe, which has left over 40 students in limbo after their Cambridge Ordinary Level results were withheld over non-remittance of US$41 272 in examination fees by the schools former management.\n\nWith Lower Sixth classes set to start lessons on Monday next week, there are concerns that learners who sat for their O-Level Cambridge examinations last year may be disadvantaged since they have not obtained their results.\n\nIn an interview, Primary and Secondary Education Minister Dr Torerayi Moyo said they had moved in to try and bail out the learners.\n\nAt the moment, I am in contact with the judicial manager because the school was placed under judicial management after they filed for insolvency, he said.\n\nI have dispatched my officials to the school to talk to the judicial manager and also to talk to directors of the school.\n\nWe also needed to engage the British Council and they came to my office two days ago and they were saying that they can release the results only if the directors of the school have paid. However, that disadvantages our students.\n\nMinister Moyo promised to provide more information today regarding the way forward.\n\nThe Knowstics Academy O-Level candidates had reportedly registered for an average of 10 subjects, with each science subject costing US$136 and other subjects being charged US$122 each.\n\nThe results scandal comes barely a month after Knowstics Academy was placed under corporate rescue in a bid to revamp its operations and restore its reputation.\n\nWhile the school is expecting the results to be released before Monday, the British Council of Zimbabwe, on the otherhand, has vowed not to release the results until the school has paid the balance of US$22 000, citing a breach of contract.\n\nRegional head of communications, Sub Saharan Africa for the British Council, yesterday said they acknowledge the frustration and concerns of students and parents of Knowstics Academy regarding the delayed release of the Cambridge O-Level examination results.\n\nKnowstics Academy is in breach of contract with the British Council and there is a total of US$22 000 in outstanding examination fees, which have not been paid by the schools management to the British Council.\n\nDespite several assurances from the corporate rescuer overseeing the schools operations, full payment remains outstanding and no assurance of dates for payment has been received.\n\nWe continue to engage with the schools corporate rescuer and are urging payment of the US$22 000 in fees owing, she said.\n\nIn an interview yesterday, the schools corporate rescue practitioner, Mr Bhudhama Chikamhi, said they are still trying to negotiate for the release of the results.\n\nYes, it is true that several candidates cant access their O-Level Cambridge results because the previous management appears to have embezzled exam fees amounting to over US$41 000, and the British Council is saying it will only release the results when they have been fully paid.\n\nIt is really unfortunate that around 40 students are still stranded, yet they are supposed to be preparing for the beginning of Lower Sixth classes next Monday, and their results are yet to be released, he said.\n\nThe previous directors of the school were furious when contacted for comment yesterday, with Mrs Edith Mukuwapasi saying The Herald would only get a comment from her after pulling down its story on the website that was published earlier this week.\n\nYou printed the material before verifying with me, so what do you want to find out? The best thing you can do is to take that thing down from the front page.\n\nWho gave you my number? Your duty was to verify first. I have nothing to talk to you about right now, said Mrs Mukuwapasi.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/02/Minister-Torerai-Moyo.jpg",
            "description": "Trust Freddy-Herald Correspondent Government is making efforts to resolve a standoff between Knowstics Academy and the British Council Zimbabwe, which has left over 40 students in limbo after their Cambridge Ordinary Level results were withheld over non-remittance of US$41 272 in examination fees by the school’s former management. With Lower Sixth classes set to start […]",
            "time": "08:34",
            "date": "24 Jan 2025"
        },
        {
            "title": "Zim, Australia to upgrade ties",
            "url": "https://www.herald.co.zw/zim-australia-to-upgrade-ties/",
            "content": "Wallace Ruzvidzo-Herald Reporter\n\nZIMBABWE is looking to enhance economic cooperation with Australia, prioritising the revival of direct flights between the two countries, Foreign Affairs and International Trade Minister, Professor Amon Murwira, said yesterday.\n\nQantas, Australias flagship airline, previously operated in Zimbabwe until it ceased flights in March 1998.\n\nSpeaking at the Australia National Day celebrations in Harare, Prof Murwira expressed his hope for the airlines return.\n\nWe are looking forward to more cooperation, including improving our transport networks and systems.\n\nI am aware that Qantas used to come to Zimbabwe (and) I would like to see it back in Zimbabwe, so reviving the airline business between Zimbabwe and Australia must be our business.\n\nProf Murwira also highlighted the importance of agricultural collaboration, especially in light of climate change challenges.\n\nWe applaud the Australian Centre for International Agricultural Research and International Crops Research Institute for the semi-arid projects for collaborating in agriculture with the aim of enhancing climate resilience on Zimbabwean farms by improving access to small-scale mechanisation, he said.\n\nProf Murwira also acknowledged the support from the Australian Embassy, which has facilitated funding for many projects and scholarships for Zimbabweans to study in Australia. On her part, Australian Ambassador to Zimbabwe Ms Minoli Tehani Perera noted the significance of mutual understanding in the relationship between the two countries.\n\nWhile Zimbabwe and Australia have not always agreed, our relationship has always been underpinned by the initial sense of mateship and working together.\n\nMateship with the people of Zimbabwe means having the hard conversations with a focus always on constructive engagement, she said.\n\nAmb Perera spoke about the need for combined efforts to tackle climate change.\n\nWe face a climate changing faster than our combined efforts to stop it. Australia is the driest inhabited continent in the world.\n\nClimate change is presenting new and growing challenges. It is stressing our traditional ways of operating.\n\nIt brings real risk to our economic prosperity and forces us to be more innovative; it is a challenge we share with Zimbabwe, but beyond the challenges, we can also share in the solution, she said.\n\nAmb Perera also commended Zimbabwe for abolishing the death penalty, saying the development is a truly historic achievement and its evidence that meaningful progress can be made for the good of all.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Minister-Murwira-680x380.jpg",
            "description": "Wallace Ruzvidzo-Herald Reporter ZIMBABWE is looking to enhance economic cooperation with Australia, prioritising the revival of direct flights between the two countries, Foreign Affairs and International Trade Minister, Professor Amon Murwira, said yesterday. Qantas, Australia’s flagship airline, previously operated in Zimbabwe until it ceased flights in March 1998. Speaking at the Australia National Day celebrations […]",
            "time": "08:34",
            "date": "24 Jan 2025"
        },
        {
            "title": "President not responsible for 2030 call: Ziyambi",
            "url": "https://www.herald.co.zw/president-not-responsible-for-2030-call-ziyambi/",
            "content": "Zvamaida Murwira-Senior Reporter\n\nTHE call for Constitutional amendments for President Mnangagwa to extend his term beyond 2028 has nothing to do with him and has not been done at his instigation, but was conceived by the revolutionary party and formed part of its Annual National Peoples Conference resolutions.\n\nAddressing Zanu PF Mashonaland West Province Provincial Coordinating Committee members last weekend, Politburo member, Cde Ziyambi Ziyambi, said current efforts to amend the Constitution to extend President Mnangagwas term were solely a decision of the revolutionary partys general membership.\n\nHe said at no time did President Mnangagwa canvass for the extension of his term and any suggestion to that effect was preposterous given that the position of the First Secretary was known that he was a constitutionalist.\n\nCde Ziyambi said Zanu PF was pushing for an extension of the Presidents term in line with a resolution that it took at its conference in Bulawayo in October last year.\n\nOur plan with resolutions is that they come from the people starting from inter-district, and they go to the province where they are debated. Our provincial chairman takes them to the national level and they are consolidated at the conference. Once consolidated at the conference level, they become Zanu PF resolutions. That point ought to be clear, said Cde Ziyambi.\n\nAt no time did President Mnangagwa say he wants this or that, about the issue of 2030. It is us as the people and general membership of Zanu PF who expressed our desire about what we want him to do.\n\nNow if you hear someone saying anything about our President that he has done this or he intends to do that, tell them that it is not him, but it is us as the people and as Zanu PF. He is not in the equation or this discourse.\n\nCde Ziyambi said his discussions with President Mnangagwa, whenever they meet, did not include issues around extension of his term.\n\nEven if I am to meet with him, I will tell him that we are seized with our issues as the general membership of the party which has nothing to do with you, I do not even want to hear about your views about it, I do not even talk to him about it because it is our issue.\n\nWe are now in the process of fulfilling our issue and desire as Zimbabweans, we now need to be united because its us who have expressed thisdesire.\n\nOnce we start the programme and it goes through Parliament to amend the Constitution to fulfil our objective, once it comes back to the people during the Referendum, starting today lets mobilise people telling them that Zimbabweans want President Mnangagwa to remain in office until 2030. This is our desire as Zanu PF.\n\nZanu PF party structures have been calling for Constitutional amendments following a resolution at the partys Conference in Bulawayo that was unanimously adopted.\n\nThe rank and file of the party felt that President Mnangagwa had pushed several signature projects that had transformed lives so much that they felt he deserved to have a term extension for him to complete his work and vision.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Minister-Ziyambi-Ziyambi-680x380.jpg",
            "description": "Zvamaida Murwira-Senior Reporter THE call for Constitutional amendments for President Mnangagwa to extend his term beyond 2028 has nothing to do with him and has not been done at his instigation, but was conceived by the revolutionary party and formed part of its Annual National People’s Conference resolutions. Addressing Zanu PF Mashonaland West Province Provincial […]",
            "time": "08:34",
            "date": "24 Jan 2025"
        },
        {
            "title": "Flash flooding disrupts 22 Mat North schools",
            "url": "https://www.herald.co.zw/flash-flooding-disrupts-22-mat-north-schools/",
            "content": "Nqobile Tshili-Bulawayo Bureau\n\nLEARNERS at several schools in Matabeleland North missed lessons last week, while some are yet to attend class two weeks into the first term due to flash flooding, which has affected 22 primary and secondary schools as incessant rains continue to pound the country.\n\nHeavy rains have intensified since the start of the year, raising hopes for an improved farming season as the country emerges from an El-Nino-induced drought.\n\nThe downpours have resulted in 23 deaths through drowning while over 800 households have been affected countrywide, according to the Civil Protection Unit.\n\nThe education sector has also been affected with Matabeleland North Provincial Education Director, Mr Jabulani Mpofu, saying only schools in Nkayi and Binga districts have not recorded any rain-related disruption so far.\n\nAt Sabelo Primary School in Bubi, the river was flooded affecting mostly the teachers who were coming from Bulawayo.\n\nIn Hwange District, Nekabandama and Kuribalila Primary Schools were affected. In Lupane, it is Daluka Primary School, the area is swampy so pupils coming from St Lukes are affected, said Mr Mpofu.\n\nWe have a serious problem in Tsholotsho, the district has poor drainage. So Tshabanda primary and secondary schools were affected. Dikili, Dogwe, Nhlangano, Mbalibali, Bubude, and Nshaba primary schools were also affected by the floods.\n\nHe said in Umguza District, Sawmills, Igusi, Zimdabule, Umguza, Bhuda, Zikhululeni, Ndazini, Dundubala, Sikhanyiso, and Lukukwe primary schools have had their opening affected due to rains.\n\nMr Mpofu said the ministry still discourages members of the public and learners from crossing flooded rivers with the Government pledging to compensate for lost time.\n\nWe still discourage pupils and teachers from crossing flooded rivers. We discourage even motorists from crossing flooded rivers, he said.\n\nSchools should find a way of compensating these learners. Some of them are giving assignments using cellphones. Some of the areas are not badly affected.\n\nA Bulawayo Bureau yesterday visited Tshabanda Village in Tsholotsho where school authorities and communities narrated how flash floods had disrupted learning.\n\nAs the news crew approached the village it observed that due to the lack of a proper drainage system, there was water on the sides of the road and also some ditches of water with boys even swimming in them.\n\nSome of the ponds cover over 100 metres.\n\nMr Mthabisi Sibanda, a deputy head at Tshabanda High School, said the school failed to receive learners last week on Thursday as rains pounded the area.\n\nWe were seriously affected by the rains last week. We experienced floods all over the school. The water was flowing from the north passing through the school as there is no proper drainage in this area, said Mr Sibanda.\n\nAs a result, we were forced to turn away the learners because the school was not accessible. Also, other learners from Dugwi, Denge Jibhi, and Chefunye were not able to come toschool.\n\nEven our boarders were not able to go to their classes as there was water all over the school.\n\nMr Sibanda said even teachers were marooned in their homes with community members expressing shock at the amount of rain that was received.\n\nWhen it comes to the flooding, we only know of what happens in the Sipepa area but we never thought it would be experienced here.\n\nEven our school bus got stuck in the mud on Tuesday opening day, he said.\n\nWe were anticipating having to conduct two trips during the opening of the school but our bus got stuck in the mud and we are still consulting with the community members to assist us with a tractor to pull it out.\n\nMr Sibanda said the school has already extended learning hours to compensate for the lost time stating that the safety of learners remains a priority.\n\nMrs Simangaliphi Moyo, a senior teacher at Tshabanda Primary School said school authorities are in constant communication with parents in case rains start pounding when they are in school.\n\nShe said when it rains a quarter of the pupils cannot report for school as they cross flooded rivers.\n\nWe have contacts for the parents and when we receive downpours during the learning hours, we inform them to come and collect the learners. Some of them wait for the learners in those streams to ensure that the children make it safe at home, she said.\n\nOne of the villagers, Mr Henry Ndebele, showed the news crew a video they captured when the rains had pounded the area. The water reached knee level and was flowing over the road to some of the houses.\n\nWe have not received this amount of rain in a long time. The last time we experienced such heavy downpours I was still a boy. As you can see there is water all over the place, he said.\n\nThe water was covering my knees.\n\nWe have to divert the water so that it does not flow into our house. But in other homes, the water was flowing into their houses. Some houses built using poles and dagga collapsed, said Mr Ndebele.\n\nHe said it was unusual to see children being turned away from school due to flooding at the local schools.\n\nFor the children, they could not go to school for two days. We were marooned, our children were not able to leave our homes and others failed to even gain entrance into the school and they were told to return home, he said.\n\nDirector of communication and advocacy in the Ministry of Primary and Secondary Education, Mr Taungana Ndoro, said the ministry has taken an inclusive approach to ensure childrens education is not disrupted.\n\nTo ensure that learners catch up, we are implementing several strategies, including extended school hours where feasible, additional classes on weekends, and provision of online resources for remote learning, hesaid.\n\nWe are also coordinating with local authorities and community organisations to provide support to affected families and ensure that students can return to school safely.\n\nWhile the ministry has identified the most affected schools, it is reported that due to flooded rivers, there are learners who are still to report for school in other areas.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Flood-680x380.jpg",
            "description": "Nqobile Tshili-Bulawayo Bureau LEARNERS at several schools in Matabeleland North missed lessons last week, while some are yet to attend class two weeks into the first term due to flash flooding, which has affected 22 primary and secondary schools as incessant rains continue to pound the country. Heavy rains have intensified since the start of […]",
            "time": "08:34",
            "date": "24 Jan 2025"
        },
        {
            "title": "Dam levels average 70pc",
            "url": "https://www.herald.co.zw/dam-levels-average-70pc/",
            "content": "Nyasha Motsi-Herald Correspondent\n\nThe countrys major dams have risen to 70 percent following recent rains experienced in most parts of the country.\n\nZimbabwe National Water Authority (ZINWA) stakeholder relations officer, Mr Tsungirirai Shoriwa said as of January 22, 2025, the national dam level average stands at 70,9 percent, up from 69,3 percent on January 20.\n\nHe added that several dams, including Exchange, Zhovhe and Ngwenya, are now full, while others have recorded significant gains.\n\nMr Shoriwa also said the recent rise in dam levels enhances the countrys water security.\n\nMultiple dams have reached full capacity, and others have shown notable increases, with expectations of further improvements as the rainy season continues, he said.\n\nZINWA is urging all individuals and organisations to draw water from dams for non-primary purposes, such as summer crop irrigation, to ensure compliance with their water abstraction agreements and relevant laws.\n\nCompliance with the law helps to promote responsible water use and management, particularly during periods of water scarcity.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Dam-levels-680x380.jpg",
            "description": "Nyasha Motsi-Herald Correspondent The country’s major dams have risen to 70 percent following recent rains experienced in most parts of the country. Zimbabwe National Water Authority (ZINWA) stakeholder relations officer, Mr Tsungirirai Shoriwa said as of January 22, 2025, the national dam level average stands at 70,9 percent, up from 69,3 percent on January 20. […]",
            "time": "08:34",
            "date": "24 Jan 2025"
        },
        {
            "title": "Man  killed in front of son",
            "url": "https://www.herald.co.zw/man-killed-in-front-of-son/",
            "content": "Crime Reporter\n\nPOLICE are investigating the tragic kidnapping and murder of a 50-year-old man from Bulawayo, Albert Tshuma, who was strangled in front of his son after offering a lift to an unknown assailant.\n\nThe incident occurred on January 21 along Randum Road in the Upper Rangemore area.\n\nTshuma was driving a Honda CRV when he picked up a male suspect, who brandished a pistol and ordered him to follow an unregistered BMW in front of them.\n\nMatters came to a head when their vehicle ran out of fuel.\n\nIt is said the assailant then strangled Tshuma with a seat belt before fleeing in the BMW.\n\nNational police spokesperson, Commissioner Paul Nyathi, confirmed the case.\n\nThe ZRP is investigating a case of murder which occurred along Randun road, Upper Rangemore, Bulawayo on January 21, 2025 in which Albert Tshuma aged 50 died.\n\nThe victim and his son, who were travelling in a Honda CRV, offered a lift to an unknown male suspect before he produced a firearm and instructed them to follow an unregistered BMW which was in front of them.\n\nThe suspect strangled the victim with a seat belt after the vehicle had run out fuel and he drove off in a BMW vehicle.\n\nSubsequently, the victim passed away and his body was conveyed to Bulawayo Hospital for post-mortem.\n\nAnyone with information to report at any nearest police station, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/10/Murder-investigation-.jpeg",
            "description": "Crime Reporter POLICE are investigating the tragic kidnapping and murder of a 50-year-old man from Bulawayo, Albert Tshuma, who was strangled in front of his son after offering a lift to an unknown assailant. The incident occurred on January 21 along Randum Road in the Upper Rangemore area. Tshuma was driving a Honda CRV when […]",
            "time": "08:34",
            "date": "24 Jan 2025"
        },
        {
            "title": "Ministry charts ICT growth strategies",
            "url": "https://www.herald.co.zw/ministry-charts-ict-growth-strategies-2/",
            "content": "Joshua Muswere-Herald Correspondent\n\nTHE Ministry of Information Communication Technology, Postal and Courier Services yesterday held its annual interface meeting with stakeholders in Harare, to address systematic challenges affecting the telecommunications sector and come up with policies critical to enable economic growth, innovation and transformation.\n\nStakeholders falling under the ministry were given an opportunity to express their grievances and suggest solutions on how the country can achieve its set objectives in the ICT sector such as the National ICT Policy (2022-27), National Vision 2030, the Smart Zimbabwe 2030 Masterplan and Africa Agenda 2063.\n\nThe role of the ministry in the realisation and fulfillment of Zimbabwes developmental trajectory and aspirations is critical given the integrated and cross-cutting nature of digital technologies and the role of a digital economy in driving economic growth, employment and sustainable development.\n\nThe adoption of technology by traditional sectors of the economy such as postal and courier services, banking, health and logistics among others emphasises the role of digital transformation in driving inclusivity and accessibility, empowering various communities, and enhancing economic opportunities across diverse regions.\n\nAs the deliberations came to a conclusion, Information Communication Technology Postal and Courier Services Minister Tatenda Mavetera delved into the strategies the ministry is set to implement to address the gaps mentioned by different stakeholders.\n\nThis year weve got a target of 150 000 people that we need to train in terms of digital skills, cyber-security and other disruptive technologies.\n\nWe are also going to be having a programme this year which we are calling the Digital Ambassadorship Programme. This DAP is going to be launched in the first quarter, to enhance our digital literacy as a country.\n\nThe interface meeting presented a platform for open discussions where telecomms players openly, and collectively addressed issues and shared insights to develop solutions, benefiting all parties involved.\n\nA key presentation was that of the Telco Broadband managing director, Ms Dumisani Nomagugu Nkala, who emphasised the need for agile policy development, transparent policy implementation and policy consistencies.\n\nShe said there is a need to meet the growing global trends to keep up and adjust to technical advancement through the establishment of the industry think thanks to ensure that policy becomes more forward-thinking and accepted by the masses.\n\nThis is without neglecting the importance of policy consistency, which guarantees a regulatory environment that fosters industry growth and inclusive economic growth, Ms Nkala said.\n\nAmong the issues discussed include eGovernment and Smart Solutions, Policy and Regulation, The Zimbabwe ICT Sector Strategic Trajectory for 2025 and The Digital Economy.\n\nAs the country moves towards its digital economy realisation by the year 2030, with continued focus and strategic partnerships, Zimbabwe can unlock unprecedented opportunities for all its citizens.\n\nThe consistent growth of the sector will play a pivotal role in shaping the nations economic landscape, fostering innovation, creating jobs and driving sustainable development.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Minister-Mavetera-and-Potraz-members-680x380.jpg",
            "description": "Joshua Muswere-Herald Correspondent THE Ministry of Information Communication Technology, Postal and Courier Services yesterday held its annual interface meeting with stakeholders in Harare, to address systematic challenges affecting the telecommunications sector and come up with policies critical to enable economic growth, innovation and transformation. Stakeholders falling under the ministry were given an opportunity to express […]",
            "time": "08:34",
            "date": "24 Jan 2025"
        },
        {
            "title": "Editorial Comment: HIV/Aids treatment must continue outside US funding",
            "url": "https://www.herald.co.zw/editorial-comment-hiv-aids-treatment-must-continue-outside-us-funding/",
            "content": "THE twin decisions by United States President Donald Trump, after his inauguration for a new term on Monday, to leave the World Health Organisation and freeze all American aid programmes for 90 days to see if they are efficient and comply with his foreign policy objectives, will largely affect Zimbabwes highly successful programme to combat HIV and Aids.\n\nIt is vital that the programme continues, as it remains essential that HIV treatment is never rationed by availability or ability to pay.\n\nDepending on how you count the assistance, as there are dual use programmes, it looks like more than US$200 million of the US$360 million of US aid allocated last year helps fund the programmes that have done so much to push back HIV and Aids in Zimbabwe, but will need to be continued for many years to maintain that gain, largely through ensuring all infected people receive life-long anti-retroviral treatment.\n\nMuch of the US support, routed through the Global Fund and through other agencies, is allocated under the US Presidential Emergency Plan for Aids Relief, Pepfar, set up by President George W. Bush in 2003. Pepfar has been one of the most effective medical assistance programmes in a range of hard-hit countries.\n\nIt has been decisive in the push back in large swathes of Africa against HIV infection and converting HIV to a treatable chronic illness that requires daily medication, but with that medication for life, people can live normal lives.\n\nZimbabwe has achieved the advanced 95-95-95 goals, that is at least 95 percent of the estimated population infected with HIV have been tested and known their status, at least 95 percent of those are being treated with anti-retrovirals, and 95 percent of those being treated have seen their viral load suppressed.\n\nIn fact we are doing somewhat better, especially with the percentage of those who know their status being treated, it being now almost automatic to go from positive test to immediate treatment.\n\nMuch of the remaining US aid budget spent in Zimbabwe last year went to special emergencies, basically a contribution to the special programmes to cope with the severe drought, which is not a regular item. Then there are several smaller health programmes and other assistance for women and youth.\n\nThe final batch are political support programmes, funding activities that are seen by the US as supporting democracy, basically grants to certain favoured NGOs opposed to the Government.\n\nIn none of the other medical and social assistance programmes where the US is a partner, it is as central as it is in the Aids programmes, largely providing very useful support that could probably be made up from other sources, including internal resources.\n\nCommenting on the freeze and possible revocation of all US assistance programmes, Finance, Economic Development and Investment Promotion Minister Mthuli Ncube on Wednesday dwelt almost entirely on the Pepfar funding and the possibility that Zimbabwe would have to fund large sums via the budget to maintain the critical HIV and Aids programmes.\n\nThe largest ring-fenced internal source is the Aids levy, a three percent charge on the assessed income tax of individuals, companies and trusts. This has to be read with the fact that customs and excise duties and VAT, more important tax contributors, are not levied.\n\nBut the levy was a decisive contribution to the pot of money needed to combat HIV and showcased the Governments determination to do something effective with national resources.\n\nThat along with other commitments was decisive in persuading development partners, including the United States, that it was worthwhile to back the Zimbabwean programmes since the national thrust was also centred on efficiency and a successful programme to eliminate corruption from the medical field.\n\nSince the question of the efficiency of the US Pepfar programme can largely be assumed these days, in Zimbabwe and in other countries since the local US embassy has to investigate and report on this sort of thing, the criteria that will see whether it continues, and if so in which countries, will largely revolve around the political test, whether it conforms to the foreign policy of President Trump.\n\nThis will be a finding by the relevant agency heads and their political bosses, mainly the Secretary of State for most foreign assistance and that is largely an internal American matter.\n\nShould Pepfar and other US health programmes be cancelled or cut back, Prof Ncube noted that Zimbabwe would have to step up its own contributions.\n\nThe two most critical parts of the Aids programme are ensuring that anyone who wishes to be tested, or needs to be tested as part of other medical arrangements, can be tested at an affordable price and then that everyone who needs to be on antiretroviral treatment (ART) can get on this promptly so their viral load can be suppressed.\n\nIt is important that testing and ART are never rationed, directly through shortages or indirectly through cost to the patient. So whatever happens the Government would have to find replacement funds.\n\nThat said, we probably have an opportunity, regardless of whether the US maintains Pepfar or not, to accelerate the administrative processes that are scheduled to see HIV being treated within a few years as a normal chronic illness, such as diabetes, hypertension and some of the psychiatric illnesses which require life-time treatment but also preventative measures.\n\nThis should allow a cutback in administrative costs and some of the special logistics and other programmes that had to be put in place, as well as a cut back in the education programmes as these are absorbed into the general health education work. Everyone by now knows how HIV is spread and how it can be prevented and how people can protect themselves.\n\nThere is also the argument that ART need not be a choice of paying the full cost or getting the treatment for free depending on economic status. We could provide partial support of some patients who have a modest income and full support for those who could afford nothing.\n\nThe growing density of the clinic network, the upgrade in medical staffing and other improvements in health infrastructure seem to allow HIV and Aids work to be fully absorbed into the general health system, as they already are to a large degree. This would allow funds earmarked for HIV treatment to be fully assigned to testing and ART supplies, and an end to the special Aids industry that does absorb critical funding.\n\nOther programmes already in place, such as the growing enforcement of the ban on child marriages whether registered or not, and the growing practical protection for teenagers from sexual exploitation, also work to help push back HIV infection, so once again extra special work is not needed and can form part of expanding ordinary programmes.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/11/prof1-680x380.jpg",
            "description": "THE twin decisions by United States President Donald Trump, after his inauguration for a new term on Monday, to leave the World Health Organisation and freeze all American aid programmes for 90 days to see if they are efficient and comply with his foreign policy objectives, will largely affect Zimbabwe’s highly successful programme to combat […]",
            "time": "08:34",
            "date": "24 Jan 2025"
        }
    ]
}