{
    "news": [
        {
            "title": "Two cops steal US$10k from motorist",
            "url": "https://www.herald.co.zw/two-cops-steal-us10k-from-motorist/",
            "content": "Prosper Dembedza\n\nHerald Correspondent\n\nTwo police officers who put up an unsanctioned roadblock along Samora Machel Avenue in Harare and stole US$10 000 from a Chinese national appeared in court on Friday.\n\nJefter Nkomazanah (36) and Crynot Fablano (40) appeared before Harare magistrate, Mrs Marehwanazvo.\n\nThey were facing charges of criminal abuse of duty and were remanded in custody to February 25 for bail application.\n\nNkomazanah is stationed at Kanyemba Police Station while Fablano is stationed at Dzivarasekwa Police Station.\n\nInvestigations established that Fablano is currently on suspension.\n\nThe court heard that on February 14, the complainant was driving along Samora Machel Avenue.\n\nNkomazanah, who was in police uniform, approached the complainant who then locked his vehicle.\n\nIt is the States case that Nkomazanah unlocked the vehicle through a partially open window and got in.\n\nHe started accusing the complainant of using his cell phone while driving and instructed him to drive to Harare Central Police Station.\n\nThe complainant complied but was instructed to park his vehicle near Karigamombe Centre.\n\nThe court heard that Nkomazanah called Fablano. He came and joined them in the car.\n\nNkomazanah introduced Fablano to the complainant as his superior.\n\nNkomazanah started threatening the complainant while Fablano was searching for valuables in the complainants satchel. He took US$10 000.\n\nThe complainant unwillingly gave Nkomazanah US$25 but Fablano had already vanished with the US$10 000.\n\nThe complainant later realised that the accused persons had stolen his money.\n\nHe reported the matter to the police and was referred to the Police Anti-Corruption Unit.\n\nOn February 18, police detectives on surveillance saw the accused persons who were clad in police uniform waylaying motorists along Samora Machel.\n\nThe detectives approached the accused persons and they tried to flee.\n\nHowever, they were arrested after a chase.\n\nThe complainant suffered a loss of US$10 025 and nothing has been recovered.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/courthammer-680x380.jpg",
            "description": "Prosper Dembedza Herald Correspondent Two police officers who put up an unsanctioned roadblock along Samora Machel Avenue in Harare and stole US$10 000 from a Chinese national appeared in court on Friday. Jefter Nkomazanah (36) and Crynot Fablano (40) appeared before Harare magistrate, Mrs Marehwanazvo. They were facing charges of criminal abuse of duty and […]",
            "time": "18:27",
            "date": "23 Feb 2025"
        },
        {
            "title": "ZHRC seeks to strengthen administrative justice",
            "url": "https://www.herald.co.zw/zhrc-seeks-to-strengthen-administrative-justice/",
            "content": "Obey Musiwa\n\nHerald Reporter\n\nThe Zimbabwe Human Rights Commission (ZHRC) has visited established institutions in the region to get insights into effective investigation and dispute resolution mechanisms.\n\nThe Commission, through the support of the Raoul Wallenberg Institute with funding from the European Union visited the Office of the Public Protector of South Africa, the Kenyan Commission on Administrative Justice and the Inspectorate of Government of Uganda.\n\nIn an interview, ZHRC Commissioner Martin Muduva said the learning visits provided comparative frameworks to refine their complaint-handling processes.\n\nDrawing lessons from different models in the region is crucial.\n\nThe Inspectorate of Government of Uganda shared key initiatives that included the use of Alternative Dispute Resolution (ADR) mechanisms, spot checks on public institutions, physical inspections of government projects, boardroom sessions for institutional reform and an electronic case management system for efficient case tracking, he said.\n\nThe IGU also has litigation and enforcement mechanisms that ensure compliance with its decisions. These approaches illustrate diverse methods of strengthening administrative justice.\n\nWe have gained first-hand exposure to best practices, which could inform discussions on improving service delivery.\n\nThe Zimbabwean public stands to benefit from enhanced accountability mechanisms. Government and public institutions may also experience improved oversight and service delivery practices as a result of knowledge gained during the visit.\n\nImmediate considerations may include efficiency improvements in ADR and case-handling procedures, with timelines dependent on institutional deliberations, resource availability and legal frameworks.\n\nObservations from all three benchmarking visits highlight different enforcement mechanisms, including the IGUs binding rulings and prosecution authority, which contribute to strengthening administrative justice.\n\nHowever, any considerations for changes will need further deliberations within the Commission, which are underway, he said.\n\nMeanwhile, speaking during a meeting held in Bulawayo recently, ZHRC chairperson, Ms Jessie Majome said there is need to track the implementation of the recommendations of the National Inquiry on Access to Documentation.\n\nAdministrative justice was not receiving adequate attention yet it is so important. This resulted in the Commission establishing a department that deals with maladministration issues, she said.\n\nThe Commission has also escalated administrative justice awareness campaigns in its operations.\n\nThe inquiry brought to the fore the challenges faced by various groups in acquiring identity documents, including border lying communities, indigenous minorities, persons with disabilities, older persons and vulnerable children.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/05/Zimbabwe-Human-Rights-Commission-ZHRC.jpg",
            "description": "Obey Musiwa Herald Reporter The Zimbabwe Human Rights Commission (ZHRC) has visited established institutions in the region to get insights into effective investigation and dispute resolution mechanisms. The Commission, through the support of the Raoul Wallenberg Institute with funding from the European Union visited the Office of the Public Protector of South Africa, the Kenyan […]",
            "time": "18:27",
            "date": "23 Feb 2025"
        },
        {
            "title": "Call for awareness on technology-facilitated GBV",
            "url": "https://www.herald.co.zw/call-for-awareness-on-technology-facilitated-gbv/",
            "content": "Diana Nherera\n\nThe Gender and Media Connect has called for campaigns to raise awareness on technology-facilitated gender based violence.\n\nSpeaking at a workshop held in Harare on Thursday, the organisations programmes officer, Ms Sharon Sithole said capacity-building should target police and judicial officials.\n\nThere is also need to build capacities of service providers and to lobby for laws to align with what is happening in the technology world, she said.\n\nWe have come up with a mechanism that allows for rapid response to incidents as they happen and these responses should focus on finding the perpetrator, getting them to pay for what they have done and making sure we give support to the people who have been violated.\n\nMs Sithole also said there is need to push for software companies to create reporting mechanisms on technology-facilitated GBV.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Untitled-27-680x380.jpg",
            "description": "Diana Nherera The Gender and Media Connect has called for campaigns to raise awareness on technology-facilitated gender based violence. Speaking at a workshop held in Harare on Thursday, the organisation’s programmes officer, Ms Sharon Sithole said capacity-building should target police and judicial officials. “There is also need to build capacities of service providers and to […]",
            "time": "18:27",
            "date": "23 Feb 2025"
        },
        {
            "title": "Empowerment of women key to nation building: Minister Mavetera",
            "url": "https://www.herald.co.zw/empowerment-of-women-key-to-nation-building-minister-mavetera/",
            "content": "Nyasha Motsi\n\nHerald Reporter\n\nWomen empowerment lobby groups have called for the emancipation of widowed and divorced women through income-generating projects that help them get relief from their challenges.\n\nIn separate interviews, the lobby groups called for the emancipation of all single mothers saying it aligns with the countrys vision of inclusive development and ensuring that no individual or community is left behind.\n\nInformation Communication Technology, Postal and Courier Services Minister and the founder of Young Women for Economic Development Dr Tatenda Mavetera said it is essential to push for the empowerment of marginalised women so that they can be economically emancipated\n\nIf you empower a woman, you empower a nation, Minister Mavetera said.\n\nMinister Mavetera expressed her appreciation for organisations and individuals working to improve the lives of women in the country.\n\nWe are happy when they come on board and also equip women because its very difficult for women to take care of children on their own, sending them to school providing food and other basic things, she said.\n\nWe really appreciate these organisations. We are saying to them, please continue doing what you are doing.\n\nSingle Mothers Association of Zimbabwe founder Mr Tobias Munonoki said they decided to help single mothers who were failing to take care of their children.\n\nI was moved by their struggles, so l was compelled to take action and make a positive impact on their lives, he said.\n\nIt is better to give than to receive and I have realised that if I can help uplift someone, then I have to do it, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/11/Untitled-148-680x380.jpg",
            "description": "Nyasha Motsi Herald Reporter Women empowerment lobby groups have called for the emancipation of widowed and divorced women through income-generating projects that help them get relief from their challenges. In separate interviews, the lobby groups called for the emancipation of all single mothers saying it aligns with the country’s vision of inclusive development and ensuring […]",
            "time": "18:27",
            "date": "23 Feb 2025"
        },
        {
            "title": "Mine collapse traps 5 in Muzvezve",
            "url": "https://www.herald.co.zw/mine-collapse-traps-5-in-muzvezve/",
            "content": "Conrad Mupesa Mashonaland West Bureau\n\nEFFORTS are underway to rescue two of five artisanal miners who were trapped at Shasha Mine in Muzvezve under Mhondoro-Ngezi last Tuesday.\n\nThe other three victims bodies were retrieved on Friday.\n\nMines and Mining Development Deputy Minister, Dr Polite Kambamura who confirmed the latest development this morning, said efforts were underway to rescue or retrieve the remaining trapped miners\n\nHe said that some large scale mining companies were assisting.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/05/Mine-Colapse-copy.jpg",
            "description": "Conrad Mupesa Mashonaland West Bureau EFFORTS are underway to rescue two of five artisanal miners who were trapped at Shasha Mine in Muzvezve under Mhondoro-Ngezi last Tuesday. The other three victims’ bodies were retrieved on Friday. Mines and Mining Development Deputy Minister, Dr Polite Kambamura who confirmed the latest development this morning, said efforts were […]",
            "time": "18:27",
            "date": "23 Feb 2025"
        },
        {
            "title": "Goods train derails in Kadoma",
            "url": "https://www.herald.co.zw/goods-train-derails-in-kadoma/",
            "content": "Conrad Mupesa Mashonaland West Bureau\n\nA National Railways of Zimbabwe (NRZ) goods trains derailed at Jangano near the gold citys Central Business District this morning.\n\nEye witnesses said the train plunged into a water logged area.\n\nNo injuries or deaths have been reported.\n\nNRZ spokesperson, Mr Andrew Kunambura was unreacheable.\n\nMore details to follow.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Untitled-26-1-680x380.jpg",
            "description": "Conrad Mupesa Mashonaland West Bureau A National Railways of Zimbabwe (NRZ) goods trains derailed at Jangano near the gold city’s Central Business District this morning. Eye witnesses said the train plunged into a water logged area. No injuries or deaths have been reported. NRZ spokesperson, Mr Andrew Kunambura was unreacheable. More details to follow.",
            "time": "18:27",
            "date": "23 Feb 2025"
        },
        {
            "title": "Dynamos, Simba Bhora clash in Castle Challenge Cup",
            "url": "https://www.herald.co.zw/dynamos-simba-bhora-clash-in-castle-challenge-cup/",
            "content": "\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Dembare.png",
            "description": "",
            "time": "18:27",
            "date": "23 Feb 2025"
        },
        {
            "title": "We’re committed to youth empowerment: President . . . ‘Continue displaying principles of servant leadership, discipline’",
            "url": "https://www.herald.co.zw/were-committed-to-youth-empowerment-president-continue-displaying-principles-of-servant-leadership-discipline/",
            "content": "Zvamaida Murwira in BULAWAYO\n\nGovernment has made several appointments of young people in leadership and decision-making positions such as Government Ministries and Departments as a demonstration to its commitment to youth empowerment and galvanised them to participate in the countrys socio-economic development, President Mnangagwa has said.\n\nThe Head of State and Government made the remarks while delivering his keynote address at National Youth Day celebrations attended by more than 20 000 youths drawn from across the country in Bulawayoyesterday.\n\nThe Second Republic has demonstrated its unwavering commitment to empowering young people through the deliberate and bold placement of youth in key leadership and decision making positions.\n\nThis includes Government Ministries, Departments and Agencies, in Parliament as well as other strategic institutions, such as boards of parastatals and advisory councils among others said the President.\n\nPresident Mnangagwa, Vice President Dr Constantino Chiwenga and his wife Colonel Miniyothabo Baloyi-Chiwenga, Defence Minister Oppah Muchinguri-Kashiri (left), Youth Empowerment, Development and Vocational Training Minister Tino Machakaire (right) and other officials watch as children showcase their martial arts skills during a tour of exhibition stands at National Youth Day celebrations at ZITF Grounds in Bulawayo yesterday.Picture: Believe Nyakudjara.\n\nIn view of these achievements, I challenge the people deployed in various leadership positions to continue displaying principles of servant leadership and discipline, while at the same time galvanise the youth to fully participate in the socio economic and cultural affairs of the country.As the vanguard of our country, you must take the initiative and develop synergies as well as partnerships while building a common united front to advance the aims and objectives of our peoples revolution and development thrust.This years commemorations were held under the theme Empower Youth, Secure the Future and were attended by sister political parties from some neighbouring countries that include Frelimo of Mozambique, Chamachamapinduzi of Tanzania and the African NationalCongress from South Africa.I extend a special welcome to you, our young people aswell as delegates from other countries. Your presence here is a testament of the unity and solidarity that definesus, the SADC region and indeed the continent of Africa, said the President.I urge you, our young people, to guard jealously this long-standing tradition of unity, solidarity and peaceful co-existence.The President said the prosperity of the country and Africa as a whole lies on young people.We, the older generation, played our part to bring about independence, freedom and peace. The ball is now in your court. You must deliver. In unity, the youth of Africa can do more for the realisation of the Africa we want and deserve, he said.Outlining the background of the National Youth Day, President Mnangagwa said it was set aside and dedicated to recognising the potential of young people because of the belief in the countrys youth in achieving national goals.The huge turnout, peaceful, jovial, and electric atmosphere characterising this gathering is a reflection of our collective unity and defining national character as an independent and sovereign people. In our diversity from Plumtree to Mutare, Beitbridge to Chirundu, we are one, he said.President Mnangagwa commended the youths for their consciousness in preserving the countrys history.Delegates follow proceedings at the celebrations.I urge you to continue working hard for our great motherland, Zimbabwe, with unflinching patriotism and loyalty. Resist and reject machinations of those who would want to divide you, and divide our nation.He said holding of this years commemorations in Bulawayo, was in line with his Governments decision to decentralise national events.The Second Republic is walking the talk; we are leaving no one and no place behind, he said.President Mnangagwa challenged youth to remain emboldened by the virtues of courage, selfless sacrifice and bravery which defined the youth of yester-year.They took up arms against the oppressive colonial regime and brought us independence, sovereignty, territorial integrity, freedom and democracy, he said.President Mnangagwa urged the youths to remain vigilant and patriotic at all times.Youths follow proceedings at the colourful event.Picture: Believe Nyakudjara.Defend the integrity and dignity of our country, leadership, as well as its people. Stand firm, inculcate a culture of volunteerism and service among all the young people in our beloved motherland, Zimbabwe, he said.The President later launched the Zimbabwe Digital Skills Development Programme that will be implemented in collaboration with a development partner, the United Arab Emirates.Allow me to express our profound gratitude to the Government of the United Arab Emirates for supporting our national development thrust.The initiative will train 1.5 million young people across the country as software engineers, developers andprogrammers. This will enhance digital literacy and skills among Zimbabwean citizens and empower a new generation of professionals who can contribute to technological innovation, he saidMembers of the National Youth Service at a parade.Under the programme, young people will gain skills across three domains: Programming Fundamentals; Data Science Fundamentals; and Android Developer Fundamentals.This will enhance the employability of our young people, while empowering the youth andfostering economic growth. Furthermore, the programme encourages innovation and creativity as well as entrepreneurship through the development of local tech solutions and start-ups, he said.The event was attended by Vice President Costantino Chiwenga, Cabinet Ministers, Zanu PF Politburo Members and legislators among others.\n\nIn view of these achievements, I challenge the people deployed in various leadership positions to continue displaying principles of servant leadership and discipline, while at the same time galvanise the youth to fully participate in the socio economic and cultural affairs of the country.\n\nAs the vanguard of our country, you must take the initiative and develop synergies as well as partnerships while building a common united front to advance the aims and objectives of our peoples revolution and development thrust.\n\nThis years commemorations were held under the theme Empower Youth, Secure the Future and were attended by sister political parties from some neighbouring countries that include Frelimo of Mozambique, Chamachamapinduzi of Tanzania and the African NationalCongress from South Africa.\n\nI extend a special welcome to you, our young people aswell as delegates from other countries. Your presence here is a testament of the unity and solidarity that definesus, the SADC region and indeed the continent of Africa, said the President.\n\nI urge you, our young people, to guard jealously this long-standing tradition of unity, solidarity and peaceful co-existence.\n\nThe President said the prosperity of the country and Africa as a whole lies on young people.\n\nWe, the older generation, played our part to bring about independence, freedom and peace. The ball is now in your court. You must deliver. In unity, the youth of Africa can do more for the realisation of the Africa we want and deserve, he said.\n\nOutlining the background of the National Youth Day, President Mnangagwa said it was set aside and dedicated to recognising the potential of young people because of the belief in the countrys youth in achieving national goals.\n\nThe huge turnout, peaceful, jovial, and electric atmosphere characterising this gathering is a reflection of our collective unity and defining national character as an independent and sovereign people. In our diversity from Plumtree to Mutare, Beitbridge to Chirundu, we are one, he said.\n\nPresident Mnangagwa commended the youths for their consciousness in preserving the countrys history.\n\nDelegates follow proceedings at the celebrations.\n\nI urge you to continue working hard for our great motherland, Zimbabwe, with unflinching patriotism and loyalty. Resist and reject machinations of those who would want to divide you, and divide our nation.\n\nHe said holding of this years commemorations in Bulawayo, was in line with his Governments decision to decentralise national events.\n\nThe Second Republic is walking the talk; we are leaving no one and no place behind, he said.\n\nPresident Mnangagwa challenged youth to remain emboldened by the virtues of courage, selfless sacrifice and bravery which defined the youth of yester-year.\n\nThey took up arms against the oppressive colonial regime and brought us independence, sovereignty, territorial integrity, freedom and democracy, he said.\n\nPresident Mnangagwa urged the youths to remain vigilant and patriotic at all times.\n\nYouths follow proceedings at the colourful event.Picture: Believe Nyakudjara.\n\nDefend the integrity and dignity of our country, leadership, as well as its people. Stand firm, inculcate a culture of volunteerism and service among all the young people in our beloved motherland, Zimbabwe, he said.\n\nThe President later launched the Zimbabwe Digital Skills Development Programme that will be implemented in collaboration with a development partner, the United Arab Emirates.\n\nAllow me to express our profound gratitude to the Government of the United Arab Emirates for supporting our national development thrust.\n\nThe initiative will train 1.5 million young people across the country as software engineers, developers andprogrammers. This will enhance digital literacy and skills among Zimbabwean citizens and empower a new generation of professionals who can contribute to technological innovation, he said\n\nMembers of the National Youth Service at a parade.\n\nUnder the programme, young people will gain skills across three domains: Programming Fundamentals; Data Science Fundamentals; and Android Developer Fundamentals.\n\nThis will enhance the employability of our young people, while empowering the youth andfostering economic growth. Furthermore, the programme encourages innovation and creativity as well as entrepreneurship through the development of local tech solutions and start-ups, he said.\n\nThe event was attended by Vice President Costantino Chiwenga, Cabinet Ministers, Zanu PF Politburo Members and legislators among others.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/President-Mnangagwa-8-680x380.jpg",
            "description": "Zvamaida Murwira in BULAWAYO Government has made several appointments of young people in leadership and decision-making positions such as Government Ministries and Departments as a demonstration to its commitment to youth empowerment and galvanised them to participate in the country’s socio-economic development, President Mnangagwa has said. The Head of State and Government made the remarks […]",
            "time": "18:27",
            "date": "23 Feb 2025"
        },
        {
            "title": "Youth day: A masterstroke of learning, celebration",
            "url": "https://www.herald.co.zw/youth-day-a-masterstroke-of-learning-celebration/",
            "content": "Raymond Jaravaza-Bulawayo Bureau\n\nTHE Zimbabwe International Exhibition Centre (ZIEC) became a hotbed of innovation yesterday as thousands of schoolchildren from across the region were captivated by a dazzling display of ingenuity.\n\nA tangible sense of excitement filled the air as students explored exhibits ranging from remarkably durable and attractive paving bricks made from discarded tyres to a truly ground-breaking machine that converts used plastic into fuel.\n\nThe displays werent just static exhibits; they sparked curiosity and conversation, prompting students to engage with the innovators and learn about the processes behind these remarkable inventions.\n\nThe sheer ingenuity on display highlighted the potential of young minds and the power of technology to address real-world problems, leaving a lasting impression on the aspiring scientists and engineers in attendance.\n\nThe combination of National Youth Day celebrations and these engaging exhibitions proved a masterstroke.\n\nThe event allowed young people to celebrate the National Youth Day holiday while learning and sharing ideas about two of their key interests: technology and innovation. Thousands of young people celebrated National Youth Day in style,packing three halls at the ZIEC. President Mnangagwa was the guest of honour.\n\nFor young Prince and his Form Four classmates from Milton High School, seeing and touching paving bricks made from discarded tyres was a first. The expressions on their faces showed they recognised the ingenuity of the innovation.\n\nIsheanesu Mukome, a Biochemistry graduate from the University of Zimbabwe (UZ), said that the paving brick innovation was born from a desire to protect the environment by repurposing non-biodegradable materials. Discarded tyres, a significant environmental hazard, can be transformed into durable and attractive paving blocks.\n\nOld tyres can be harmful to the environment if not disposed of in an environmentally friendly way, and we have found a way of turning them into paving bricks. One old tyre is shredded into very small pieces, and the wires are removed before we compact the material into paving bricks that are both durable and beautiful, said Mukome.\n\nHer stand proved popular with schoolchildren, fascinated by the idea of transforming old tyres into building materials traditionally made from sand and cement.\n\nNearby, Benson Manjengwa, another UZ graduate, was kept busy answering questions from schoolchildren eager to understand his innovation  a machine that turns plastic into fuel. Like a patient teacher, Manjengwa explained the process of converting this other notorious environmental pollutant into usable energy. The innovation, a Pyrolysis Plant, cost the team of innovators US$600 to build.\n\nPrincess Moyo of Lobengula High School was thrilled by the innovations she and her friends saw.\n\nThis years National Youth Day celebrations were different from previous ones because we learned a lot about how other young people are making all kinds of products and inventions that will make a difference in peoples lives. President Mnangagwa said the future is in our hands and that we should use science and technology to build our country, so Im happy that we got a chance to see how innovation and technology are good for Zimbabwe, said Princess.\n\nThe exhibitions provided a perfect opportunity for universities and colleges to showcase their offerings to students who will soon be choosing their tertiary education paths.\n\nThe world is now in the technological revolution, and this years National Youth Day celebrations gave us the perfect opportunity to show young learners what our university has to offer. The learners want to know what separates us from other universities and colleges so that they can make informed decisions when they finish high school, said a lecturer from a local university.\n\nIn Hall 3, the Mpopoma High School choir entertained exhibitors, schoolchildren, and guests with an impromptu singing session.\n\nIn Hall 4, where the main proceedings took place, the Head of State and Government addressed thousands of young people from across the countrys ten provinces. The hall erupted in applause when President Mnangagwa announced the countrys digital skills training programme, which aims to empower 1, 5 million young people nationwide.\n\nPresident Mnangagwa said the initiative will enhance digital literacy and skills among Zimbabwean citizens and empower a new generation of professionals who can contribute to technological innovation.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/ED-in-Byo1-680x380.jpg",
            "description": "Raymond Jaravaza-Bulawayo Bureau THE Zimbabwe International Exhibition Centre (ZIEC) became a hotbed of innovation yesterday as thousands of schoolchildren from across the region were captivated by a dazzling display of ingenuity. A tangible sense of excitement filled the air as students explored exhibits ranging from remarkably durable and attractive paving bricks made from discarded tyres […]",
            "time": "18:27",
            "date": "23 Feb 2025"
        },
        {
            "title": "Govt mulls direct fuel imports",
            "url": "https://www.herald.co.zw/govt-mulls-direct-fuel-imports/",
            "content": "Martin Kadzere-Senior Business Reporter\n\nGovernment intends to directly procure fuel for its own use and key economic sectors to lower costs and boost competitiveness, Energy and Power Development Minister July Moyo has said.\n\nSpeaking at the National Competitiveness Commission (NCC) inaugural competitiveness summit in Bulawayo on Wednesday, Minister Moyo said the move would ensure stable supply and affordability.\n\nHe raised concerns about the competitiveness of the fuel procurement system.\n\nZimbabwes fuel cost build-up comprises several components that determine the final pump price.\n\nThese include the international raw fuel cost (FOB), transportation costs, exchange rate between the US dollar and local currency, taxes and levies, blending costs and distributor margins.\n\nThe Zimbabwe Energy Regulatory Authority (ZERA) considers all these factors when setting retail prices. Price fluctuations are primarily driven by global oil prices and exchange rate volatility.\n\nMinister Moyo acknowledged that while Zimbabwe cannot control external factors affecting fuel prices, the Government will focus on internal factors.\n\nThese include import duties and transportation costs.\n\nThe minister said the price of fuel at the port of discharge when compared to regional countries was significantly higher.\n\nFuel costs are a major expense, and their relatively high prices compared to regional countries disadvantage local products. This makes domestically produced goods more expensive, impacting their competitiveness both at home and abroad.\n\nWhile acknowledging the role of the existing fuel importers, Minister Moyo said the Governments goal was to provide predictable and competitively priced fuel to economic enablers to operate more efficiently.\n\nWe analyse and say, are we as competitive as Zimbabwe among those who we trade with? he said.When we look at ourselves here in the region, I think we are very expensive.\n\nSo, the Government is looking at all this, and as I said, we applaud those who are delivering fuel into our country.\n\nBut as Government, we have made some strides nowboth the Minister of Finance (Professor Mthuli Ncube) and I have been directed to make sure that we buy fuel for Government use and for other enablers of the economy, because Government is there to enable the economy to do well.\n\nWe have been directed to make sure that on the Government side and in any way, we should buy our fuel competitively because we used to do that so that we dont buy spot purchases on the international market, as the other 10 (traders) are doing.\n\nThe other 10, we think they are doing very well, but as Government . . . to compete, we should discuss with them, Minister Moyo added.\n\nThe Minister pointed to successful models in regional countries like Mozambique, Zambia, and Tanzania, where fuel traders collaborate with their governments to achieve competitive pricing.\n\nHe explained that while these countries have found effective ways to work with existing traders, Zimbabwes current strategy involved direct Government procurement to drive down fuel costs.\n\nMozambique has fuel traders, Zambia has fuel traders, Tanzania has fuel traders, but working with the Government, they have found a way of buying competitively, said Minister Moyo.\n\nBut for now, we want the Government (to) directly buy competitively, so that we can reduce the cost of fuel in the country, which impacts on your competitiveness.\n\nThe Zimbabwe Energy Regulatory Authority (ZERA) has set the February maximum fuel prices at US$1,58 or ZiG 41,58 per litre for diesel, and US$1,53 or ZiG 40,50 per litre for blended petrol (E15).\n\nIn February, Zambias Energy Regulation Board (ERB) set the price of petrol at US$1,24 per litre and diesel at US$1,16 perlitre.\n\nMinister Moyo applauded existing fuel traders for maintaining a stable fuel supply despite challenges and assured the public that current fuel reserves, including supplies at ports and in pipelines, are sufficient.\n\nHowever, he reiterated that the Governments focus was now on improving the competitiveness of fuel procurement to lower costs.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/July-Moyo-680x380.jpg",
            "description": "Martin Kadzere-Senior Business Reporter Government intends to directly procure fuel for its own use and key economic sectors to lower costs and boost competitiveness, Energy and Power Development Minister July Moyo has said. Speaking at the National Competitiveness Commission (NCC) inaugural competitiveness summit in Bulawayo on Wednesday, Minister Moyo said the move would ensure stable […]",
            "time": "18:27",
            "date": "23 Feb 2025"
        }
    ]
}