{
    "news": [
        {
            "title": "Zimbabwe Parliamentary delegation in Uzbekistan for 150th IPU Assembly",
            "url": "https://www.herald.co.zw/zimbabwe-parliamentary-delegation-in-uzbekistan-for-150th-ipu-assembly/",
            "content": "Zvamaida Murwira\n\nSpeaker of the National Assembly Advocate Jacob Mudenda and President of the Senate Mabel Chinomona have arrived in Tashkent, Uzbekistan, ahead of the 150th Inter-Parliamentary Union (IPU) Assembly and related meetings, which will run from April 4 to 9.\n\nThe IPU Assembly brings together representatives from 181 national parliaments around the world to deliberate on pressing global issues through parliamentary dialogue and cooperation.\n\nThe two presiding officers are leading a Zimbabwean delegation comprising Members of Parliament who represent the country in the IPU.\n\nThe delegation includes Senator Chief Mtshane Khumalo, Tsitsi Muzenda and Sengezo Tshabangu, as well as legislators Lusyomo Nyelele, Maureen Kademaunga and Tawanda Karikoga, among others.\n\nThis years assembly is being held under the theme Parliamentary Action for Social Development and Justice.\n\nThe agenda includes discussions on eradicating poverty, promoting decent work, fostering social inclusion and increasing the participation of marginalised groups in governance and decision-making processes.\n\nThe assembly is also expected to adopt key resolutions, including one on advancing the Two-State solution in the Israel-Palestine conflict and another on mitigating the impact of armed conflicts on sustainable development.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Speaker-of-Parliament-Advocate-Jacob-Mudenda-680x380.jpg",
            "description": "Speaker of the National Assembly Advocate Jacob Mudenda and President of the Senate Mabel Chinomona have arrived in Tashkent, Uzbekistan, ahead of the 150th Inter-Parliamentary Union (IPU) Assembly and related meetings, which will run from April 4 to 9.",
            "time": "21:46",
            "date": "04 Apr 2025"
        },
        {
            "title": "SA-based hitmen jailed combined 50 years",
            "url": "https://www.herald.co.zw/sa-based-hitmen-jailed-combined-50-years/",
            "content": "Yeukai Karengezeka\n\nCourt Correspondent\n\nFive South African-based hitmen have been sentenced to a combined 50 years in jail for their involvement in a kidnapping and assault plot targeting local businessman Mr Oliver Tendai Chipindu.\n\nMoses Monde, Malvin Manzinde, Malvin Tatenda Nyamuranga, Norbert Muponda, and Joshua Mapuranga were convicted of assault and conspiracy to commit kidnapping.\n\nPresiding magistrate Mr Stanford Mambanje initially sentenced each of the culprits to 12 years in prison before suspending two years from each sentence on condition of good behavior.\n\nThey will each serve 10 years in jail.\n\nThe case arose from a liquefied petroleum gas (LPG) tankers botched deal that saw Mr Chipindu being defrauded of US$800 000 by one Obrian Mapurisa.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/06/Man-jailed.jpeg",
            "description": "Yeukai Karengezeka Court Correspondent Five South African-based hitmen have been sentenced to a combined 50 years in jail for their involvement in a kidnapping and assault plot targeting local businessman Mr Oliver Tendai Chipindu. Moses Monde, Malvin Manzinde, Malvin Tatenda Nyamuranga, Norbert Muponda, and Joshua Mapuranga were convicted of assault and conspiracy to commit kidnapping. […]",
            "time": "21:46",
            "date": "04 Apr 2025"
        },
        {
            "title": "Education Minister calls for innovation and collaboration in African education",
            "url": "https://www.herald.co.zw/education-minister-calls-for-innovation-and-collaboration-in-african-education/",
            "content": "Mashudu Netsianda\n\nPrimary and Secondary Education Minister Torerai Moyo has called on African countries to prioritise research, innovation and collaboration to ensure quality and inclusive education for all.\n\nSpeaking at the third Africa Education Summit that is being held in Victoria Falls, Minister Moyo commended the Second Republic for ensuring that education is a key driver of socio-economic transformation.\n\nWe applaud the Second Republic under the astute leadership of President Mnangagwa for promoting education that leaves no one and no place behind, he said.\n\nMinister Moyo also urged the people of Zimbabwe to embrace technology.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/WhatsApp-Image-2025-04-04-at-15.11.06.jpeg",
            "description": "Primary and Secondary Education Minister Torerai Moyo has called on African countries to prioritise research, innovation and collaboration to ensure quality and inclusive education for all.",
            "time": "21:46",
            "date": "04 Apr 2025"
        },
        {
            "title": "Africa’s rise depends on strong education pillars: President Mnangagwa",
            "url": "https://www.herald.co.zw/africas-rise-depends-on-strong-education-pillars-president-mnangagwa/",
            "content": "Mashudu Netsianda\n\nPresident Mnangagwa has challenged stakeholders attending the ongoing 3rd Africa Education Summit in Victoria Falls to proffer solutions and actionable policies that can propel the continent into a rising star.\n\nHe said since Africa is rising, education should be one of the strongest pillars of that rise.\n\nLet us build a robust education system that ensures that we take pride in our identity as Africans. We must work to align the education sector. Our schools and higher learning institutions must be incubators of innovation so that our students produce goods and services that meet the demands of our communities, said President Mnangagwa.\n\nHe implored private players, including those in the diaspora, to complement the Government by investing in clean energy.\n\nWe need an education system that enables our learners to create jobs and solve societal challenges. The need to enhance collaboration cannot be emphasised.\n\nMy Government has increased support for teaching and learning material and these are having a positive impact on learning processes and ensuring a knowledge-driven economy, said President Mnangagwa.\n\nHe said the digital divide remains a challenge on the continent, adding that there is an urgent need to address the issue.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/WhatsApp-Image-2025-04-04-at-15.06.45-680x380.jpeg",
            "description": "President Mnangagwa has challenged stakeholders attending the ongoing 3rd Africa Education Summit in Victoria Falls to proffer solutions and actionable policies that can propel the continent into a rising star.",
            "time": "21:46",
            "date": "04 Apr 2025"
        },
        {
            "title": "Uzumba Maramba-Pfungwe Magistrates Court commissioned",
            "url": "https://www.herald.co.zw/uzumba-maramba-pfungwe-magistrates-court-commissioned/",
            "content": "Victor Maphosa\n\nMashonaland East Bureau\n\nThe Judicial Service Commission (JSC) has officially commissioned the Mutawatawa Magistrates Court in Uzumba Maramba-Pfungwe (UMP) District today, thereby marking a major step in efforts to enhance access to justice across the country.\n\nThis is the first Magistrates Court to be established in UMP and comes as a huge relief for court officials and residents who previously had to travel to Murehwa for legal proceedings.\n\nSpeaking at the commissioning ceremony, JSC Secretary Mr Walter Chikwana said the new court demonstrates the Commissions continued commitment to decentralising judicial services and strengthening the rule of law.\n\nThe ceremony is a testament to the Judicial Service Commissions unwavering commitment and dedication to advancing access to justice, decentralising judicial services and fostering constitutionalism, he said.\n\nThe official opening of Mutawatawa Magistrates Court is yet another milestone in the fulfilment of JSCs vision to build a Zimbabwe in which world-class justice prevails.\n\nMr Chikwana said the Commission is now turning its attention to setting up additional courts in Mashonaland East Province.\n\nPlans are already at an advanced stage for the establishment of Magistrates Courts at Hwedza Centre and Mahusekwa Business Centre.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/12/JSC.jpg",
            "description": "The Judicial Service Commission (JSC) has officially commissioned the Mutawatawa Magistrates Court in Uzumba Maramba-Pfungwe (UMP) District today, thereby marking a major step in efforts to enhance access to justice across the country.",
            "time": "21:46",
            "date": "04 Apr 2025"
        },
        {
            "title": "Farmers earn US$133,3 m from sale of 38,8m kg of tobacco",
            "url": "https://www.herald.co.zw/farmers-earn-us1333-m-from-sale-of-388m-kg-of-tobacco/",
            "content": "Elita Chikwati\n\nAgric News Editor\n\nFarmers have earned US$133,3 million from the sale of 38,8 million kilogrammes of flue-cured tobacco, with the contract floors recording the highest delivery volumes.\n\nSince the opening of the 2025 tobacco marketing season, farmers have sold 36,4 million kilogrammes worth US$126 million through contract sales, while 2,3 million kilogrammes valued at US$7,3 million went under the hammer at the auction floors.\n\nStatistics from the Tobacco Industry and Marketing Board (TIMB) indicate that by day 21 of the marketing season, farmers had delivered lower volumes of the golden leaf when compared to the same period last year.\n\nAccording to TIMB, during the same period last year, farmers had sold 52,7 million kilogrammes of flue-cured tobacco valued at US$186,1 million.\n\nThe statistics also show that contracted growers have dominated the industry, with few farmers still self-financing.\n\nThe average price on day 21 was US$3,44 per kg, compared to US$ 3,53 last year.\n\nContract floors have continued to register higher prices, with the highest price of US$6,30 per kg offered so far coming from contract sales.\n\nThe highest price on the auction floors has remained at US$4,99 per kg.\n\nThe lowest price of US$0.10 per kg has been recorded.\n\nThe increase in tobacco production has been attributed to viable prices, an organised market and the availability of funding through contractors and the Government.\n\nTobacco has earned a strategic position in the economy due to its contribution to the Gross Domestic Product and foreign currency earnings.\n\nZimbabwe has become the major flue-cured tobacco producer in Africa and is ranked fifth among the top producers of the golden leaf in the world.\n\nThe growth of the sector is largely due to many communal farmers joining the lucrative farming sector following the land reform programme.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/10/Tobacco-1.jpg",
            "description": "Farmers have earned US$133,3 million from the sale of 38,8 million kilogrammes of flue-cured tobacco, with the contract floors recording the highest delivery volumes.",
            "time": "21:46",
            "date": "04 Apr 2025"
        },
        {
            "title": "China announces 34 percent retaliatory tariffs on US imports",
            "url": "https://www.herald.co.zw/china-announces-34-percent-retaliatory-tariffs-on-us-imports/",
            "content": "China has announced it will impose additional tariffs of 34 percent on US imports in retaliation to duties unveiled by President Donald Trump recently, thereby moving the world closer to a full-blown trade war.\n\nThe Ministry of Commerce said on Friday that the tariff, which matches Trumps latest increase in duties on Beijing, will be imposed on all imported goods from the US from April 10, a day after the USs reciprocal levies come into effect.\n\nGlobal stock markets extended their losses on Friday after the announcement, with futures tracking the S&P 500 down 2 percent and the Europe-wide Stoxx 600 4,4 percent lower.\n\nTotal levies on Chinese exports to the US are set to rise to more than 60 percent after Trumps announcement of tariffs of 34 percent that come on top of existing duties.\n\nBeijing denounced the new US duties as a typical unilateral bullying move that does not comply with the rules of international trade and seriously damages the legitimate rights and interests of China.\n\nThe trade war comes at a sensitive moment for Chinas leader, Xi Jinping, who has leaned on exports to steer the worlds second-largest economy through a property sector slump and deflation.\n\nBeijing was among the biggest targets of the reciprocal tariffs Trump unveiled on Wednesday.\n\nThe new duties came on top of a levy of 20 percent previously imposed on the country by the US president.\n\nThe total US charges on Chinas goods will now exceed the 60 percent Trump threatened during the election campaign, which Beijing previously considered a worst-case scenario.\n\nTrumps move to impose steep tariffs on US trading partners around the world has convulsed markets.\n\nOn Thursday, about $2,5 trillion in market value was erased from Wall Street stocks and all of the dollars post-election gains were wiped out.\n\nChina on Friday also announced export bans on seven types of rare earths and added US tech companies, including drone makers Skydio and Brinc Drones, to its unreliable entity list, which bans Chinese suppliers from selling components to them.  ft.com\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/china-680x380.jpg",
            "description": "China has announced it will impose additional tariffs of 34 percent on US imports in retaliation to duties unveiled by President Donald Trump recently, thereby moving the world closer to a full-blown trade war. The Ministry of Commerce said on Friday that the tariff, which matches Trump’s latest increase in duties on Beijing, will be […]",
            "time": "21:46",
            "date": "04 Apr 2025"
        },
        {
            "title": "Mberengwa deputy head on the run after sodomy allegations",
            "url": "https://www.herald.co.zw/mberengwa-deputy-head-on-the-run-after-sodomy-allegations/",
            "content": "Midlands Bureau\n\nA deputy headmaster at Masase High School in Mberengwa is on the run after allegedly sodomising more than 35 boys at the institution.\n\nAnywhere Gumbo reportedly fled from the Evangelical Lutheran Church of Zimbabwe (ELCZ)-run school on Friday after police arrived to conduct investigations.\n\nMidlands provincial police spokesperson, Inspector Emmanuel Mahoko, said Gumbo is still at large.\n\nSources say Gumbo would lure pupils to his office to sexually abuse them.\n\nthe police and officials from the Ministry of Education have been on the ground after they received an anonymous letter from one of the teachers over the issue, said a source.\n\nThe school head has a very tight policy which requires pupils to talk to him if they want to report anything and this has seen the majority of the pupils being sodomised in silence, said a parent whose child is among the victims.\n\nSome parents and teachers accuse headmaster Mr Albion Masukume of trying to suppress the scandal.\n\nMr Masukume confirmed the probe in a letter to parents but denied involvement.\n\nI write with sorrow to inform you that allegations of child abuse by one of our staff members were reported.\n\nCurrently, thorough investigations by the Ministry of Primary and Secondary Education and the police are underway, he said in the letter.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Untitled-27-680x380.jpg",
            "description": "A deputy headmaster at Masase High School in Mberengwa is on the run after allegedly sodomising more than 35 boys at the institution.",
            "time": "21:46",
            "date": "04 Apr 2025"
        },
        {
            "title": "VP Mohadi donates solarised boreholes to Beitbridge school",
            "url": "https://www.herald.co.zw/vp-mohadi-donates-solarised-boreholes-to-beitbridge-school/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nVice President Kembo Mohadi has donated a solarised borehole system and computers to his former school, Beitbridge Mission Primary School.\n\nThe school is also the only facility in the district that has boarding facilities for disabled pupils.\n\nMatabeleland South Minister of State for Provincial Affairs and Devolution Dr Evelyn Ndlovu commissioned the borehole system that was sourced and equipped by TelOne services.\n\nDiscovery Ambulances has also trained 70 pupils on first aid services to complement the initiatives being made by the Vice President to boost child-friendly schools in the area.\n\nSpeaking during the commissioning, Minister Ndlovu said the setting up of the solarised borehole system was a fulfilment of a pledge made to the school by the VP last year.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Kembo-Mohadi.jpg",
            "description": "Vice President Kembo Mohadi has donated a solarised borehole system and computers to his former school, Beitbridge Mission Primary School.",
            "time": "21:46",
            "date": "04 Apr 2025"
        },
        {
            "title": "Presidential Fisheries Programme boosts nutrition, education in Zaka",
            "url": "https://www.herald.co.zw/presidential-fisheries-programme-boosts-nutrition-education-in-zaka/",
            "content": "Felistas Tavarera\n\nThe Presidential Community Fisheries Programme has made significant strides in facilitating development in Zaka following the successful harvesting of 2 000 mature fingerlings provided under the initiative.\n\nThis has helped boost both food security and a sustainable income stream for the local community.\n\nLaunched as part of a broader Government initiative to expand aquaculture across the country, the project has transformed lives in Chinorumba, where proceeds from fish sales are being channelled into the development of Chinorumba High School.\n\nSpeaking during a tour of the school yesterday, Lands, Agriculture, Fisheries, Water and Rural Development Deputy Minister Davis Marapira said the programme is not only enhancing livelihoods but also improving educational infrastructure.\n\nWe are thrilled to see the Presidential Community Fisheries project taking shape in our community, he said.\n\nThis initiative not only provides a sustainable source of income for our people but also contributes to the development of local schools.\n\nThe proceeds from the fish sales will be used to develop Chinorumba High School, a testament to the Presidents commitment to education and rural development.\n\nThe success of this project is a clear indication of the Presidents vision for a prosperous and food-secure Zimbabwe.\n\nWe are proud to be part of this journey and look forward to seeing the positive impact it will have on our communities.\n\nHe said they have observed a substantial upgrade in the health of community members, particularly those with chronic illnesses.\n\nFrom a nutritional standpoint, the fish has been a game-changer, and were encouraging others to follow suit, said Minister Marapira.\n\nThe impact of this project on our communitys health cannot be overstated.\n\nThose who are chronically ill are now able to subsidise their meals with nutritious fish, and we are seeing remarkable improvements in their overall well-being.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2017/04/1204-1-1-DAVIS-MARAPIRA.jpg",
            "description": "The Presidential Community Fisheries Programme has made significant strides in facilitating development in Zaka following the successful harvesting of 2 000 mature fingerlings provided under the initiative.",
            "time": "21:46",
            "date": "04 Apr 2025"
        }
    ]
}