{
    "news": [
        {
            "title": "ZIM U19 Take 4-0 Lead",
            "url": "https://www.herald.co.zw/zim-u19-take-4-0-lead/",
            "content": "Zimpapers Sports Hub\n\nTHE Zimbabwe cricket Under-19s have shown they are ready to compete against some of the best teams ahead of the 2026 ICC Under-19 Cricket World Cup.\n\nThis is after their six-wicket win over Ireland Under-19 at Takashinga Cricket Club gave them a 4-0 lead in the five-match series.\n\nLeeroy Chiwaula was named Player of the Match for his 77 from 99 balls.\n\nMichael Blignauts 60 from 58 balls (not out) was also equally impressive.\n\nZimbabwe had restricted Ireland to 241 for 6 in their 50 overs.\n\nThat the hosts made a successful chase and achieved it with 25 balls remaining, could be indication this is a group that could just make a big impression.\n\nGoing into the series, coach Elton Chigumbura had highlighted the importance of creating good combinations.\n\nIreland on the other hand said the series gives them a feel of the World Cup.\n\nThe 16th edition of 2026 ICC Under-19 Mens Cricket World Cup will be held in Zimbabwe and Namibia early next year.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Untitled-2-5.jpg",
            "description": "THE Zimbabwe cricket Under-19s have shown they are ready to compete against some of the best teams ahead of the 2026 ICC Under-19 Cricket World Cup.",
            "time": "20:40",
            "date": "10 Apr 2025"
        },
        {
            "title": "Jeph and Leo (Private) Limited, director convicted of defrauding Geo Pomona",
            "url": "https://www.herald.co.zw/jeph-and-leo-private-limited-director-convicted-of-defrauding-geo-pomona/",
            "content": "Prosper Dembedza\n\nHerald Correspondent\n\nJeph and Leo (Private) Limited and its director Jephrate Muzira have been convicted of defrauding Geo Pomona Waste Management of US$37 265 63 after failing to supply 1 500 cubic metres of pebble stones worth US$62 531 25.\n\nMuzira (60) and his company were convicted by Harare magistrate Ms Rufaro Panavanhu after a full trial.\n\nThe matter was deferred to tomorrow for sentence. The court heard that sometime during the month of March 2024, Geo Pomona advertised a tender for the procurement of pebble stones.\n\nMuzira responded to the advertisement and was awarded the tender to supply 1500 cubic metres of pebble stones worth US$62 531 25 by April 25 2024.\n\nOn March 21 2024, Geo Pomona paid US$31 265 to the companys ZB Bank account number 4125485342405 as an initial deposit for the materials.\n\nDuring the same month, Muzira supplied 114 cubic metres of pebble stones and was left with an outstanding balance of 1 386 cubic metres valued at US$37 265 63.\n\nOn April 23 2024, Muzira requested an additional US$10 000 from Geo Pomona to facilitate the delivery of the outstanding pebble stones by April 27 2024.\n\nGeo Pomona deposited the US$10 000 into Muziras ZB Bank or number 4125485342405.\n\nOn April 27 2024, the complainant made a follow-up but Muzira kept on making empty promises and failed to deliver the pebble stones.\n\nOn May 30 2024, Geo Pomona reported the matter to the police, leading Muziras arrest.\n\nAs a result of Muziras actions, Geo Pomona suffered an actual prejudice of US$37 265 63 and nothing was recovered.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/court-hammer.jpg",
            "description": "Jeph and Leo (Private) Limited and its director Jephrate Muzira have been convicted of defrauding Geo Pomona Waste Management of US$37 265 63 after failing to supply 1 500 cubic metres of pebble stones worth US$62 531 25.",
            "time": "20:40",
            "date": "10 Apr 2025"
        },
        {
            "title": "City of Harare close to determining reasonable fees for new Mbare market",
            "url": "https://www.herald.co.zw/city-of-harare-close-to-determining-reasonable-fees-for-new-mbare-market/",
            "content": "Diana Nherera\n\nThe City of Harare says it is almost reaching an agreement over the fees to be charged traders at the new Mbare temporary market.\n\nSMEs committee chairperson Councillor Denford Ngadziore told The Herald Online that council needs at least US$25 a month while Masimba Construction will get US$30.\n\nThe total will be around US$65, which is far better than the US$580 a month, said Cllr Ngadziore.\n\nVendors had expressed concern over the US$580 a month that had been introduced at the new Mbare temporary market.\n\nThis figure adds up to US$1,4 million per month collectively. The City of Harare currently charges US$25 a month for trading in Mbare markets.\n\n.US$580 per month is higher than the rent for a shop of a similar size in Joina City, a prime CBD location. These charges are not only unjustified, they are completely unreasonable and unacceptable, especially given that the informal traders are still recovering from the devastating fire that was declared a disaster.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2020/03/0803-1-1-DENFORD-NGADZIORE.jpg",
            "description": "The City of Harare says it is almost reaching an agreement over the fees to be charged traders at the new Mbare temporary market.",
            "time": "20:40",
            "date": "10 Apr 2025"
        },
        {
            "title": "Medical aid societies rake US$600 million- ZiMA",
            "url": "https://www.herald.co.zw/medical-aid-societies-rake-us600-million-zima/",
            "content": "George Maponga in Masvingo\n\nThe Zimbabwe Medical Association (ZiMA) wants medical aid societies in the country to be regulated amid reports that in 2024, they collected an estimated US$600 million in monthly premiums for medical insurance.\n\nThe Government has initiated steps to put medical aid societies under the purview of the Insurance and Pensions Commission (IPEC).\n\nThe move will lead to oversight of the multi-million-dollar sector that has largely remained unregulated, a situation ZiMA laments.\n\nZiMA president Dr Kudzai Masinire said it is imperative to regulate medical aid societies and stem recurrent reports of maladministration and other malfeasances like fraud that have rocked the health insurance industry in the past.\n\nDr Masire praised the Government for proactively moving to protect members of medical aid societies.\n\nThe right to healthcare for all citizens and permanent residents is guaranteed in Section 76 of the Constitution of Zimbabwe, he said.\n\nThe efforts by the Government of Zimbabwe to deliver health services to the population are complemented by the private sector.\n\nDr Masinire said ZiMA is relieved that the Government has finally reacted to the organisations persistent calls for regulation of the medical aid societies industry.\n\nFor the greater part of the past two decades, The Zimbabwe Medical Association has walked on many avenues and lobbied at many fora in an endeavour to get the medical aid societies better regulated for the betterment of the fraternity and the health outcomes of the nation, he said.\n\nThe health funders are running a multimillion-dollar industry annually with very little if any oversight role on their operations.\n\nIn 2024, it is estimated that private funders received more than US$600 million through monthly premiums paid by about 10 percent of the population of Zimbabwe, said Dr Masinire.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Untitled-3-1.jpg",
            "description": "The Zimbabwe Medical Association (ZiMA) wants medical aid societies in the country to be regulated amid reports that in 2024, they collected an estimated US$600 million in monthly premiums for medical insurance.",
            "time": "20:40",
            "date": "10 Apr 2025"
        },
        {
            "title": "President hands over title deed to PPC Zimbabwe",
            "url": "https://www.herald.co.zw/president-hands-over-title-deed-to-ppc-zimbabwe/",
            "content": "Rumbidzayi ZinyukeSenior ReporterPresident Mnangagwa today officially handed over the title deed for Subdivision E of Arlington Estate to PPC Zimbabwe.\n\nThe property, initially owned by Portland Holdings (Private) Limited, now operating as PPC Zimbabwe, had been acquired by the Government as part of the Airport expansion programme.\n\nHowever, following a formal request by the company for its return citing extensive investment and planned developments on the site, the Government has now reinstated ownership.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/IMG-20250410-WA0117-680x380.jpg",
            "description": "President Mnangagwa today officially handed over the title deed for Subdivision E of Arlington Estate to PPC Zimbabwe.",
            "time": "20:40",
            "date": "10 Apr 2025"
        },
        {
            "title": "25-year marriage falls apart over unpaid bride price",
            "url": "https://www.herald.co.zw/25-year-marriage-falls-apart-over-unpaid-bride-price/",
            "content": "Violet Chenyika\n\nA Harare woman has taken her husband of 25 years to court alleging that he insults and sexually harasses her.\n\nMs Happiness Moyo made the allegations against Mr Tedious Mudzana at the Harare Civil Court on Thursday.\n\nShe accused Mr Mudzana of insulting and sexually harassing her yet he did not pay the bride price to her family.\n\nWe have been staying together as husband and wife for 25 years, and we have five children. He never paid any money to my family as bride price in all those years.\n\nHe verbally and sexually harasses me in public. He insulted me after I paid his medical bills, saying that it makes up for the money he paid for my mothers burial, she said.\n\nIn his defence, Mr Mudzana did not deny the allegations but argued that his wife has been refusing him conjugal rights for six months.\n\nI have no issues with the order, but she has been refusing me conjugal rights for over six months now. She also refused my proposal to marry another wife.\n\nPresiding magistrate Ms Meenal Narotam ordered Mr Mudzana not to insult and sexually harass Ms Moyo.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/civil-court-680x380.jpg",
            "description": "A Harare woman has taken her husband of 25 years to court alleging that he insults and sexually harasses her.",
            "time": "20:40",
            "date": "10 Apr 2025"
        },
        {
            "title": "Construction of Dhizha Clinic in Dema nears completion",
            "url": "https://www.herald.co.zw/construction-of-dhizha-clinic-in-dema-nears-completion/",
            "content": "Victor Maphosa\n\nMashonaland East Bureau\n\nDhizha Clinic, which is being built in Ward 6 of Manyame District, is now 75 percent complete, with the local authority expecting to finishn construction works this year.\n\nThe council is using devolution funds to build the clinic, the second clinic in the ward.\n\nCurrently, people are walking more than 10 km to the nearest Zhakata Clinic in Seke for services.\n\nThe new clinic is expected to bring relief to residents by reducing the distance they are walking to the nearest health centre.\n\nMashonaland East Provincial Affairs and Devolution Minister Advocate Itayi Ndudzo visited the construction site to assess progress and commended the local authority for channeling funds towards improving service delivery as well as the community for providing labour.\n\nThis project, which is ongoing, was initiated by residents who were enduring long distances to the next clinic, he said.\n\nGovernment came through Manyame Rural District Council and availed devolution funds which have accelerated development in this ward.\n\nIt is pleasing to note that the community is assisting. The Member of Parliament for this constituency also contributed with Constituency Development Funds (CDF) to ensure the project is a success. What we want to see here is the completion of this clinic so that people can benefit.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Untitled-2-680x380.jpg",
            "description": "Dhizha Clinic, which is being built in Ward 6 of Manyame District, is now 75 percent complete, with the local authority expecting to finishn construction works this year.",
            "time": "20:40",
            "date": "10 Apr 2025"
        },
        {
            "title": "Relay teams off to Botswana",
            "url": "https://www.herald.co.zw/relay-teams-off-to-botswana/",
            "content": "Zimpapers Sports Hub\n\nZIMBABWE athletes who are bidding to qualify for the World Relays set for China next month left Harare on Thursday for Gaborone.\n\nThey will on Saturday take part in an athletics competition in which they are bidding to qualify for the prestigious World Relays.\n\nThe athletics teams for both 4100 and 4x400m Relays will be bidding to clock times that are in the World Athletics top 32.\n\nThe mens 4x400m team was 28th last week but hanging on precariously as other national teams raced to make the grade across the globe.\n\nPhakamile Lisimati, the National Athletics Association of Zimbabwe director of coaching, confirmed that the athletes are on their way.\n\nThey are now in Bulawayo traveling by bus, said Lisimati.The teams4x100m MEN:1. Ngoni Makusha2. Daniel Magogo3. Delroy Reppoh4. Takudzwa Manhanga5. Elvis Mukuchura\n\n4x100M GIRLS1. Hayley Chingono2. Nyasha Doka3. Rutendo Vushe4. Gladys Mukome5. Rutendo Sixpence6. Samukheliso Ndebele\n\n4x400m1. Geren Muwishi2. Dennis Hove3. Leeford Zuze4. Aldrin Mafa\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/2e8f970e-3a35-4106-8775-17a1e9f1eb58-680x380.jpeg",
            "description": "ZIMBABWE athletes who are bidding to qualify for the World Relays set for China next month left Harare on Thursday for Gaborone.",
            "time": "20:40",
            "date": "10 Apr 2025"
        },
        {
            "title": "Road rehabs start in Harare suburbs",
            "url": "https://www.herald.co.zw/road-rehabs-start-in-harare-suburbs/",
            "content": "Richard Muponde\n\nZimpapers Politics Hub\n\nTHE Government has started the construction and rehabilitation of roads in Harares suburbs, with work underway in Glen View where new surfaces are being laid out.\n\nThis is part of the Governments pledge to rehabilitate and construct roads in major cities and towns to address years of neglect by local authorities.\n\nCity roads fall under the purview of local authorities, but for the past 20 years, the predominantly opposition-led councils have neglected them.\n\nIn the latest intervention, the Government is working with the Zimbabwe National Road Administration (Zinara).\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/03/ZINARA.jpg",
            "description": "THE Government has started the construction and rehabilitation of roads in Harare’s suburbs, with work underway in Glen View where new surfaces are being laid out.",
            "time": "20:40",
            "date": "10 Apr 2025"
        },
        {
            "title": "Zim, UAE launches Zim Digital Skills",
            "url": "https://www.herald.co.zw/zim-uae-launches-zim-digital-skills/",
            "content": "Freeman Razemba\n\nSenior Reporter\n\nZIMBABWE and the United Arab Emirates have launched the countrys Digital Skills Programme in Harare.\n\nThe initiative was born out of a fruitful partnership between the two governments under the Government Experience Exchange Programme.\n\nThe event was attended by Minister of Information Communication Technology, Postal and Courier Services Dr Tatenda Mavetera and Deputy Minister of Cabinet Affairs and Government Experience Exchange Programme in the United Arab Emirates, Abdullar Lutah, among other senior government officials.\n\nSpeaking during the event, Minister Mavetera said: Today marks a significant milestone in our journey towards a digitally empowered Zimbabwe.\n\nIt is my honour to stand before you at the launch of the Zimbabwe Digital Skills Programme, an initiative born out of a fruitful partnership with the United Arab Emirates Government under the Government Experience Exchange Programme.\n\nAs we embark on this transformative journey, we are guided by the goals and aspirations of our National Development Strategy and the visionary framework of Vision 2030, as articulated by our President, His Excellency, Dr Emmerson Dambudzo Mnangagwa.\n\nThis programme is not just an educational initiative; it is a crucial step towards realising our collective dream of a prosperous, inclusive, and technologically advanced nation.\n\nThe Zimbabwe Digital Skills Programme, she said, aims to train 1.5 million coders in essential skills such as Data Science Fundamentals, Programming fundamentals, Android Kotlin Developer Fundamentals, and AI fundamentals.\n\nThis ambitious target reflects our commitment to empowering our youth with the tools they need to thrive in an increasingly digital world, she said.\n\nThis training programme will add impetus to the Digital Skills Ambassadors Programme that was launched at State House by our President, His Excellency, Dr. Emmerson Mnangagwa on February 19 2025. The best time to build a generation of digitally astute citizens has passed and the next best time is today. In todays global economy, digital skills are the new currency.\n\nShe said these were vital for innovation, entrepreneurship, and economic growth.\n\nBy equipping our young people with these skills, we are not only enhancing their employability but also fostering a culture of creativity and problem-solving that will drive our nation forward, Minister Mavetera said.\n\nI would like to extend my deepest gratitude to the United Arab Emirates Government for their unwavering support and collaboration. Your commitment to sharing knowledge and expertise is invaluable as we navigate this digital transformation together.\n\nThis partnership exemplifies the spirit of cooperation and mutual growth that we aspire to achieve.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/ff700ff4-1a48-46d5-9ae9-ff1aeb8c2ff9-680x380.jpeg",
            "description": "ZIMBABWE and the United Arab Emirates have launched the country's Digital Skills Programme in Harare.",
            "time": "20:40",
            "date": "10 Apr 2025"
        }
    ]
}