{
    "news": [
        {
            "title": "President’s initiative enhances food security",
            "url": "https://www.herald.co.zw/presidents-initiative-enhances-food-security/",
            "content": "Blessing Chidakwa-Herald Reporter\n\nBUSINESS units under the Presidential Rural Development Programme established in every village and some schools across the country are yielding positive benefits for communities, enhancing food security, and improving livelihoods.\n\nThis initiative, spearheaded by President Mnangagwa, promotes a collaborative approach across various Government departments to maximise benefits for farmers.\n\nEach business unit is designed to be self-sufficient and includes a solar-powered borehole, provided under the Presidential Borehole Drilling Scheme, two 10 000-litre water tanks, four community water taps, one-hectare fenced-drip horticultural garden (size may vary based on borehole yield), and two fish ponds (100 cubic meters or 100 square metres).\n\nAdditionally, the units may include feeding and water troughs for livestock, tailored to the specific needs of the area.\n\nThe goal is to establish 35 000 units nationwide.\n\nIn districts like Buhera, villagers are already selling produce from these business units, reaping substantial rewards.\n\nProfessor Obert Jiri, the Permanent Secretary for Lands, Agriculture, Fisheries, Water, and Rural Development, said the units are more than just gardens but comprehensive businesses aimed at supporting community livelihoods.\n\nWe anticipate that the entire villagewill rally behind the village business unit to ensure its operational success. The benefits include access to water for both livelihoods and production, and the production of vegetables ensures nutritional security for every household, he said.\n\nThe average village requires about 33 metric tonnes of grain per year. If a business unit is well-managed, it can produce approximately seven tonnes of grain in one cycle, covering nearly a fifth of the villages grain needs. With two production cycles, this can meet about a third of the requirement.\n\nSpecial Advisor to the President Dr Paul Tungwarara interacts with villagers at Davhe Village Business Unit in Buhera during a field day.\n\nThe income generated from the sale of grains, vegetables, and fish can enhance community welfare. Households can afford to send their children to school and purchase essential goods, leading to direct positive impacts on community well-being.\n\nFor schools, the funds generated will support learners by supplementing fees and feeding programmes. Pupils will also gain valuable agronomic skills, learning to view agriculture as a viable business from a young age.\n\nAggregation of these village business units allows for economies of scale, enhancing marketing opportunities beyond the village to local business centres, provincial capitals, and even for export, Prof Jiri said.\n\nDuring the El Nio-induced drought, business units were adapted to serve as drought mitigation centres, providing crucial support to affected communities.\n\nApart from villages, a total of 9,600 schools will receive business units, along with 43 vocational training centres under the Ministry of Youth Empowerment, Development and Vocational Training.\n\nThe Agricultural Rural Development Authority (ARDA) will appoint trained managers to oversee daily operations, including labour management, agronomic activities, and water supply oversight.\n\nThese managers will also report any operational issues, while ARDAs business advisors will provide ongoing agronomic support, ensuring the sustainability and success of the business units.\n\nThrough this initiative, Government seeks to foster food security, enhance livelihoods, and promote sustainable agricultural practices across the nation.\n\nIn Buhera, the Davhe Village Business Unit yielded an impressive 10 tonnes of maize despite the drought.\n\nWith consistent water supplies, Davhe Business Unit adopted crop rotation techniques, cultivating maize, vegetables, tomatoes, and cabbages.\n\nThis years maize harvest marked a major milestone for the unit, as all 10 tonnes were purchased at a lucrative price of US$4,000 by Prevail Group International (PGI).\n\nThe organisation has not only facilitated access to water but has also created sustainable market linkages for small-scale farmers.\n\nSpecial Advisor to the President also PGI chairperson Dr Paul Tungwarara, whose company is Governments implementing partner, said the Scheme spearheaded by President Mnangagwa, has transformed the agricultural narrative for Buhera.\n\nDespite being in a drought-prone region, local communities are now producing surplus yields, improving food security, and transforming lives, he said.\n\nMs Maria Nyamunda, a beneficiary and mother of three, shared how the Business Unit has been a game-changer for her family.\n\nBefore this noble initiative, we relied on inconsistent rains, and our crops often failed. Under this scheme, I can now grow food throughout the year.I sold my share of the maize harvest and will use the money to send my children to school and buy groceries, said Ms Nyamunda.\n\nAnother beneficiary, Mr Tatenda Mhiripiri said: This initiative has empowered women like me to be financially independent.\n\nI no longer worry about feeding my family, and I even managed to start a small poultry project with the proceeds from our Business Unit earnings.\n\nIn Mt Darwin, the Business Units are already bearing fruit with some beneficiaries earning a monthly income of up to US$80 and up to US$3 000 in dividends.\n\nMr Staford Kabaira of Zunde D Village Business Unit said the project will go a long way in addressing the scourge of hunger in the area, adding that they can provide food and send their children to school.\n\nOur business is thriving, we can sell our produce and send our children to school. Markets are guaranteed and so far\n\nMrs Sheila Gwaze said the business helped to stabilise marriages in the community adding that divorce cases are likely to decrease since the majority of women are now empowered.\n\nThis empowerment is critical. We do not fully depend on husbands hence cases of domestic violence are minimal. Poverty is the major issue which drives violence in marriages. We thank our President for such initiatives which help to improve peoples livelihoods, she said.\n\nCamperdon Village Business Unit chairman Mr Gift Machipisa said they are earning a reasonable amount of money every month through the Business Unit.\n\nWe are earning a living through various farming activities which are taking place here. We are utilising the borehole well. We have extension workers who also provide us with guidance in the growing of our crops. If funding is increased, we are sure we can penetrate international markets, he said.\n\nAgricultural Marketing Authority chief executive officer, Mr Clever Isaya, recently revealed that it is critical for communities to utilise the Business Units.\n\nWe are happy with progress so far at the Business Units. They are selling produce which is in demand on the market.\n\nUnder the Presidential Rural Development Programme, a total of 35,000 village business units and 9,600 school business units will be established by end of this year. These village business units will help spur rural industrialisation and address gaps in food security, income generation, and employment creation.\n\nIn Manicaland province, 2 822 villages are expected to benefit. Elsewhere, 4 244 villages in Mashonaland East, 3 335 villages in Mashonaland West, 8 692 villages in Masvingo,3 205 villages in Matabeleland North, 2 418 villages in Matabeleland South and 6 342 villages in Midlands are also benefitting from the programme.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/President-and-VP-Mohadi-680x380.jpg",
            "description": "Blessing Chidakwa-Herald Reporter BUSINESS units under the Presidential Rural Development Programme established in every village and some schools across the country are yielding positive benefits for communities, enhancing food security, and improving livelihoods. This initiative, spearheaded by President Mnangagwa, promotes a collaborative approach across various Government departments to maximise benefits for farmers. Each business unit […]",
            "time": "09:28",
            "date": "08 Jan 2025"
        },
        {
            "title": "Don’t store large amounts of cash, schools warned",
            "url": "https://www.herald.co.zw/dont-store-large-amounts-of-cash-schools-warned/",
            "content": "Freeman Razemba-Crime Reporter\n\nPOLICE have warned school authorities against storing large amounts of cash on their premises ahead of the opening of schools next week.\n\nArmed robberies involving guns, machetes, and iron bars have been on the rise, particularly as schools reopen and parents pay fees.\n\nMost schools, instead of banking, keep the fees in their safes, attracting robbers.\n\nIn an interview, national police spokesperson Commissioner Paul Nyathi emphasised the need for schools to enhance security measures and deposit cash in financial institutions.\n\nWe urge school authorities to step up security measures at schools and employ guards from reputable security service providers who can constantly monitor and review deployments. Above all, school authorities should install CCTV at points of entry and administration offices, he said.\n\nLast year, there was a notable increase in robbery incidents across the country, with several schools experiencing armed break-ins.\n\nIn May last year alone, at least seven schools were robbed within a two-week period.\n\nSome of these incidents were suspected to be inside jobs, as robbery suspects specifically sought cash and valuables after the beginning of the second term.\n\nThe acceptance of cash payments for school fees instead of electronic transfers has made institutions more vulnerable to criminal activity.\n\nCriminals have primarily targeted cash, along with other valuable items such as laptops and tablets.\n\nCommissioner Nyathi also recommended that schools implement systems allowing parents to deposit fees directly into banks, reducing the need to keep large sums of cash on-site.\n\nPolice have raised concerns that some robberies may have resulted from information leaks.\n\nThey warned the public that individuals providing inside information to robbery syndicates will face arrest.\n\nIn Bulawayo, police are investigating a case involving unlawful entry and theft at a school, where unknown suspects stole US$17,280 from a cash box.\n\nIn Masvingo, a lone armed robber posing as a prospective parent for a Form 1 pupil stole over US$22,800 at gunpoint, along with two cellphones and two laptops.\n\nTwo other private schools in Ruwa and Gweru lost more than US$17,500 and various goods to a group of 11 armed robbers in separate incidents.\n\nNotable incidents from last year include, a robbery at Lomagundi College in Chinhoyi where 10 robbers attacked a security guard and the deputy head, stealing cash, a pistol, laptops, cellphones, and a Mazda Tribute vehicle.\n\nThe robbers blew open a safe containing the cash.\n\nWith the rising threat of armed robberies, school authorities are urged to take proactive measures to secure their premises and minimise cash holdings.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/01/National-Police-spokesperson-Assistant-Commissioner-Paul-Nyathi.jpg",
            "description": "Freeman Razemba-Crime Reporter POLICE have warned school authorities against storing large amounts of cash on their premises ahead of the opening of schools next week. Armed robberies involving guns, machetes, and iron bars have been on the rise, particularly as schools reopen and parents pay fees. Most schools, instead of banking, keep the fees in […]",
            "time": "09:28",
            "date": "08 Jan 2025"
        },
        {
            "title": "Graves over main water trunk: Govt puts foot down",
            "url": "https://www.herald.co.zw/graves-over-main-water-trunk-govt-puts-foot-down/",
            "content": "Wallace Ruzvidzo-Herald Reporter\n\nGOVERNMENT has reversed the recent decision by Harare City Council to allow a cemetery to be established on top of the main trunk of Prince Edward Water Treatment Plant along Seke Road.\n\nResidents and stakeholders raised concern about risks posed by decomposing human remains that can result in the contamination of treated water should there be a line rupture or a burst pipe within the cemetery area.\n\nThe Ministry of Health and Child Care had since instituted investigations into the public health implications of councils decision, which Local Government and Public Works Minister Dr Daniel Garwe said had now been stopped.\n\nSpeaking at a Ministers Meet the Media platform organised by Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere in Harare on Monday, Dr Garwe dismissed councils decision as corruption-driven adding that no due diligence had been done.\n\nInitially, some councillors from Harare City Council had been sold the land through corrupt means as stands, but the Government reversed the decision, prompting crooked council officials to change plans and seek to establish a cemetery.\n\nThe Government consequently had to intervene and rectify the anomaly.\n\nHarare City Council, through corrupt means, some Councillors working in cahoots with some officials were sold pieces of this land first as stands then we stopped it.\n\nThen they now wanted to build a cemetery there, which we also stopped, it is not going to continue, said Minister Garwe.\n\nThe shocking decision by Harare City Council had raised fears of water contamination, reminiscent of the recent Lake Chivero pollution incident that claimed wildlife and fish.\n\nThe cemetery was to be established too close to the stream feeding into the raw water source, raising chances of contamination of Seke Dams ground and surface water.\n\nCorpses and coffins discharge chemicals and impurities that could have been carried by rainwater seeping into graves or buried bodies, which may have eventually gotten into direct contact with groundwater into the raw water source, posing a serious health hazard.\n\nDespite corrupt activities by some officials in local authorities, Minister Garwe said relations between Central Government and local authorities had greatly improved.\n\nRelations with Rural District Councils (RDCs), he said, had always been productive.\n\nWe have got two sets of local authorities; the urban local authorities and the rural district councils. 60 rural district councils and 32 local authorities.\n\nThe relationship between Central Government and RDCs is very cordial, it has always been cordial.\n\nThe relationship between Local Government and urban local authorities used to be terrible. In fact, there was no relationship but now, the relationship has improved, it is now cordial, he said.\n\nMinister Garwe said Government and local authorities were now working hand in glove, as they should.\n\nWe can call them for meetings and they will come and attend. Sometimes, they phone us for advice, and I will give you an example, I am sure you read about Victoria Falls where the mayor had fired the Town Clerk and we then wrote back telling him to rescind the decision because it was irregular.\n\nWe then had meetings with them just before Christmas and we then discussed our concerns that it was not in line with the Urban Councils Act, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Ministers-Muswere-and-Garwe-680x380.jpg",
            "description": "Wallace Ruzvidzo-Herald Reporter GOVERNMENT has reversed the recent decision by Harare City Council to allow a cemetery to be established on top of the main trunk of Prince Edward Water Treatment Plant along Seke Road. Residents and stakeholders raised concern about risks posed by decomposing human remains that can result in the contamination of treated […]",
            "time": "09:28",
            "date": "08 Jan 2025"
        },
        {
            "title": "Zim, Ghana seek to consolidate trade ties",
            "url": "https://www.herald.co.zw/zim-ghana-seek-to-consolidate-trade-ties/",
            "content": "Wallace Ruzvidzo-Herald Reporter\n\nZimbabwe and Ghana share cordial relations which are set to be bolstered through the inaugural Joint Permanent Commission of Cooperation set for this year, Defence Minister Cde Oppah Muchinguri-Kashiri has said.\n\nSpeaking on the occasion of Ghanaian President John Mahamas inauguration where she was representing President Mnangagwa yesterday, Minister Muchinguri-Kashiri said Ghana remained an important country, not only to Zimbabwe, but the African continent at large.\n\nGhana was the first African country to attain independence in 1957.\n\nPresident Mahama becomes Ghanas 14th President and is being sworn in for the third time. Under the astute leadership of His Excellency the President Dr ED Mnangagwa Zimbabwe seeks to deepen and elevate our relations with Ghana, as guided by Engagement and Re-engagement policy.\n\nWe have witnessed High Level exchanges, the most recent being the President, His Excellency Dr Emmerson Dambudzo Mnangagwas attendance at the 30th Annual Meetings of the African Export-Import Bank in June 2023. It was on the sidelines of this meeting that Zimbabwe and Ghana signed the first General Cooperation Agreement.\n\nTo solidify our relations preparations are at advanced level for the Inaugural Joint Permanent Commission of Cooperation meetings, to be convened at mutually agreed venue and dates in 2025, she said.\n\nZimbabwe and Ghana have already exchanged draft MoUs in defence, mining, health, agriculture, tourism, education, sport, industry, energy, women affairs, SMEs and trade. Minister Muchinguri-Kashiri also alluded that President Mnangagwa had been invited to participate at the forthcoming Africa Prosperity Dialogues to be held in Accra at the end of the month, signalling the continued upscaling of relations.\n\nAdditionally, the development of Zimbabwes Dry Port in Walvis Bay, Namibia provides a strategic gateway to link Zimbabwe and Ghana and the Economic Community of West African States (ECOWAS) region at large.\n\nMore so the Headquarters for African Continental Free Trade Area being located in Accra, Ghana is an important partner to Zimbabwe as we grow our economy under Vision 2030 by His Excellency the President Dr ED Mnangagwa.\n\nGhana and Zimbabwe have revitalised their yesteryear cooperation in the educational sector, as reflected by the resuscitation of exchange programmes between the University of Zimbabwe (UZ) and the University of Ghana (UG) and, the scholarships being provided to Zimbabwean students pursuing studies in Science, Technology, Engineering and Mathematics (STEM)-related disciplines by Ashesi University of Ghana in recent years.\n\nIn 2017, SeedCo opened a regional office in Ghana after establishing a joint venture with Limagrain of Ghana, as part of its effort to introduce yellow and white maize seed varieties for the Ghanian and broadly, the West African market in general, she said.\n\nMinister Muchinguri-Kashiri went on to chronicle Harare and Accras rich history.\n\nIt was through the support of Ghanas first President Cde Kwame Nkrumah that liberation movements in the region were inspired to pursue and fight for their independence.\n\nGhana facilitated training programmes for our people and one such beneficiary is the late President Robert Mugabe who attended the Ghanas Ideological School in Winneba.\n\nIt is the country that trained our first crop of guerrilla fighters who include the late William Ndangana and Cde Khumalo who is still surviving.\n\nGhana opened its mission in Zimbabwe in 1981 and we opened our Mission in Accra in 2001, she said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Minister-Oppah-Muchinguri-Kashiri-680x380.jpg",
            "description": "Wallace Ruzvidzo-Herald Reporter Zimbabwe and Ghana share cordial relations which are set to be bolstered through the inaugural Joint Permanent Commission of Cooperation set for this year, Defence Minister Cde Oppah Muchinguri-Kashiri has said. Speaking on the occasion of Ghanaian President John Mahama’s inauguration where she was representing President Mnangagwa yesterday, Minister Muchinguri-Kashiri said Ghana […]",
            "time": "09:28",
            "date": "08 Jan 2025"
        },
        {
            "title": "‘Museum provides media opportunity to appreciate history’",
            "url": "https://www.herald.co.zw/museum-provides-media-opportunity-to-appreciate-history/",
            "content": "Farirai Machivenyika-Senior Reporter\n\nThe Museum of African Liberation provides an opportunity for media practitioners to appreciate the sacrifices made in fighting colonial rule, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere said yesterday.\n\nHe made the remarks during a tour of the museum by journalists drawn from various media houses.\n\nI believe this is an opportunity for you to be able to relate to our heritage, to be able to relate to the artifice, to be able to relate to our history, because the majority of our history is from a Western perspective.\n\nBut this museum is a centre, a centre of our heritage where countries across the continent have an opportunity to contribute through artefacts, through history, through many other historical developments that took place, he said.\n\nThe minister added that the museum has information on Africas history, beginning from the early days of the fight against colonial rule.\n\nSo, I believe this is an opportunity for you to be able to share such experiences in this part of your heritage, which heritage includes all the classes, 600 years of slavery, more than 100 years of colonisation, and how African people were able to work together to liberate ourselves from the yokes of colonialism, Dr Muswere said.\n\nHe also said the tour offered journalists an opportunity to relate to the countrys land reform programme and that the whole idea around the war of liberation was about economic empowerment.\n\nIt was about economic emancipation, it was about democracy, it was about freedom, which freedom you now enjoy in the Second Republic, he said.\n\nAmbassador Kwame Muzawazi said construction of the museum was progressing well and hailed the support it has received from various African countries and others from outside the Continent.\n\nConstruction is progressing well and we are grateful for the support we have received from various countries on the continent and beyond, Ambassador Muzawazi said.\n\nHe added that the museum had the potential to be a major tourist attraction when complete.\n\nThe museum is being constructed on 103 hectares of land near Harares Warren Park suburb and will also have a shopping mall, an African Village and a game park among otherattractions.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Minister-Muswere-and-Ambassador-Kwame-Muzavazi--680x380.jpg",
            "description": "Farirai Machivenyika-Senior Reporter The Museum of African Liberation provides an opportunity for media practitioners to appreciate the sacrifices made in fighting colonial rule, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere said yesterday. He made the remarks during a tour of the museum by journalists drawn from various media houses. “I believe this is […]",
            "time": "09:28",
            "date": "08 Jan 2025"
        },
        {
            "title": "Zim urged to capitalise on youth, booming tech sector",
            "url": "https://www.herald.co.zw/zim-urged-to-capitalise-on-youth-booming-tech-sector/",
            "content": "Ivan Zhakata-Herald Correspondent\n\nZIMBABWE is poised to accelerate its digital transformation, leveraging cutting-edge technologies to drive economic growth and improve lives.\n\nIn an interview after meeting Minister of Information Communication Technology, Postal and Courier Services, Dr Tatenda Mavetera, the director of the Telecommunication Development Bureau at the International Telecommunication Union (ITU), Dr Cosmas Zavazava, said Zimbabwe has the potential to become a digital powerhouse in Africa.\n\nThe country possesses a vibrant youth population, a growing ICT sector, and a strong commitment to innovation, he said.\n\nBy embracing technologies like artificial intelligence, 5G and the Internet of Things, Zimbabwe can unlock unprecedented opportunities in areas such as education, healthcare, agriculture and e-commerce.\n\nMinister Mavetera said expanding broadband connectivity was crucial for achieving the countrys digital development goals.\n\nWe are committed to creating an enabling environment for the ICT sector to thrive, through policies that promote investment, innovation, and competition. We are also prioritising the development of digital skills within our workforce, ensuring that Zimbabweans are equipped to participate fully in the digital economy, she said.\n\nDr Zavazava commended Zimbabwes efforts in promoting digital literacy and inclusivity.\n\nHe highlighted the importance of leveraging digital technologies to address critical national challenges, such as poverty reduction, food security and climate change.\n\nBy harnessing the power of ICTs, Zimbabwe can improve service delivery, enhance agricultural productivity, and build more resilient communities, he said.\n\nThe ITU, a specialised agency of the United Nations, plays a vital role in supporting countries in their digital transformation journeys.\n\nDr Zavazava reaffirmed the ITUs commitment to providing technical assistance, capacity building and knowledge sharing to Zimbabwe.\n\nHe said international cooperation and knowledge exchange was key in accelerating digital development.\n\nZimbabwe is embarking on an ambitious digital transformation agenda and the country is investing heavily in infrastructure development, including the expansion of broadband networks and the deployment of 5G technology.\n\nIt is also fostering a vibrant ecosystem of startups and innovators, providing them with the support and resources they need to thrive.\n\nBy embracing the opportunities presented by the digital revolution, Zimbabwe aims to build a more inclusive, prosperous and sustainable future for all its citizens.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Dr-Zavazava-680x380.jpg",
            "description": "Ivan Zhakata-Herald Correspondent ZIMBABWE is poised to accelerate its digital transformation, leveraging cutting-edge technologies to drive economic growth and improve lives. In an interview after meeting Minister of Information Communication Technology, Postal and Courier Services, Dr Tatenda Mavetera, the director of the Telecommunication Development Bureau at the International Telecommunication Union (ITU), Dr Cosmas Zavazava, said […]",
            "time": "09:28",
            "date": "08 Jan 2025"
        },
        {
            "title": "Govt steps in to contain cholera outbreak in Glendale",
            "url": "https://www.herald.co.zw/govt-steps-in-to-contain-cholera-outbreak-in-glendale/",
            "content": "Fungai Lupande-Mashonaland Central Bureau\n\nALL shallow wells in the Glendale Highway suburb, the primary source of drinking water for residents, have tested positive for high levels of Escherichia coli (E. coli), a bacterium linked to cholera, and Government has stepped in to contain the situation.\n\nThe outbreak has resulted in 104 confirmed cases, including one reported death.\n\nAmong the confirmed cases, 93 individuals have been treated and discharged, while eight patients are receiving care at Tsungubvi Clinic.\n\nThe community heavily relies on the Zimbabwe National Water Authority (Zinwa) for water, but often faces prolonged periods without running tap water.\n\nDeputy Minister of Health and Child Care, Sleiman Kwidini, along with Permanent Secretary Dr Aspect Maunganidze and other health officials, visited Tsungubvi Clinic and the affected communities to assess the situation.\n\nDr Clemence Tshuma, the provincial medical director, said residents prefer using water from their shallow wells due to its affordability compared to the costs of prepaid water meters.\n\nHowever, he noted, burst sewer pipes are leaking and contaminating these wells.\n\nSewer and water pipes run parallel underground, which leads to contamination during leakages. Ultimately, people are being supplied with contaminated water, Dr Tshuma said.\n\nHe further highlighted that the lack of running water has forced residents into open defecation, and also leads to blockages as waste solidifies in the pipes.\n\nTesting of all wells has confirmed the presence of faecal matter. As an immediate measure, the community has been advised to boil drinking water and use Aquatabs, water purification tablets.\n\nDr Tshuma reported that over 5 000 people have been vaccinated since the outbreak began, with vaccination efforts ongoing.\n\nHe identified vendors as significant spreaders of the disease and called for law enforcement assistance in regulating their activities.\n\nA cholera treatment centre has been established at Tsungubvi Clinic, and oral rehydration therapy is available at the Mazowe Flowers farm compound.\n\nDeputy Minister Kwidini urged the public to avoid drinking untreated water and emphasised the importance of boiling it or using purification tablets.\n\nWe aim to contain this outbreak to prevent it from spreading to other parts of the province and the country. We believe that two weeks is sufficient to control the disease, he said.\n\nDep Min Kwidini thanked stakeholders, including the National Aids Council, for providing two boreholes and two reservoir tanks to assist the affected farm compound.\n\nHe assured the community that medication for treating the outbreak, as well as water guards and Aquatabs, are available.\n\nMazowe South MP Advocate Nobert Mazungunye commended the Deputy Ministers team for their solidarity with Glendale residents, aligning their efforts with President Mnangagwas commitment to leaving no one behind during this crisis.\n\nHe urged vendors to prioritise health over profits, appealing for a two-week period of compliance while the Ministry of Health and Child Care works to contain the disease.\n\nGogo Ericta Nyika from Glendale shared her familys harrowing experience with cholera, explaining how severe diarrhoea caused her to blackout on the way to Tsungubvi Clinic.\n\nWe have a well and we believed the water was safe. The well is protected with stones, and during the heavy rains, we continued drinking from it, she recounted.\n\nAlderman John Mudzonga, the Council chairperson for Mazowe Rural District Council, announced plans to revamp the sewer system, with machinery and manpower allocated to complete repairs.\n\nHowever, he emphasised that the primary issue remains the consistent supply of running water.\n\nZinwa officials were unavailable for comment during thetour.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Cholera-in-Glendale-680x380.jpg",
            "description": "Fungai Lupande-Mashonaland Central Bureau ALL shallow wells in the Glendale Highway suburb, the primary source of drinking water for residents, have tested positive for high levels of Escherichia coli (E. coli), a bacterium linked to cholera, and Government has stepped in to contain the situation. The outbreak has resulted in 104 confirmed cases, including one […]",
            "time": "09:28",
            "date": "08 Jan 2025"
        },
        {
            "title": "Mutare seeks to tap into  Geo Pomona expertise",
            "url": "https://www.herald.co.zw/mutare-seeks-to-tap-into-geo-pomona-expertise/",
            "content": "Wallace Ruzvidzoand Remember Deketeke\n\nMutare City Council is seeking to tap intoGeo Pomona Waste Managements expertise to improve its own system.\n\nIn an interview after touring the Geo Pomona Waste Management facility in Harare yesterday, Mutare Mayor Councillor Simon Chabuka said they were looking to collaborate with the Harare-based firm.\n\nHis city, he said, would definitely learn from Geo Pomona especially on the management of dumpsites.\n\nOur dumpsite is aging and lacks adequate equipment for effective waste management.\n\nResidents living near the site in Greenside and Palmerston are struggling with persistent foul odours, as well as an influx of mosquitoes and flies originating from the dumpsite, he said.\n\nAnd we do not have the capacity to create such infrastructure that we have seen at this site.\n\nWe still lack mechanisms to effectively separate water from waste and contain the water to prevent contamination of the nearby river, which forms the border between Zimbabwe and Mozambique.\n\nThis tour is meant to see how best we can tap into Geo Pomona expertise.\n\nMutare town clerk Mr Blessing Chafesuka said following procedures outlined by central Government, a structured partnership could be developed to ensure that residents receive the essential services they need.\n\nBy aligning efforts with Government guidelines, the partnership can facilitate the implementation of best practices that enhance service delivery and improve the overall quality of life for residents, he said.\n\nSuch a partnership would not only focus on waste management but also address related issues such as public health and environmental sustainability.\n\nGeo Pomona chief executive officer and executive chairman Dr Dilesh Nguwaya said there was need to teach local authorities across the country best practices for waste management.\n\nOne of Geo Pomonas goals was to collaborate with local authorities to ensure enhanced service delivery.\n\nMutare City Council is not the first local authority to have visited us, City of Bulawayo also once came here and got an appreciation of what we are doing, he said.\n\nWe are very much open to working with local authorities across the country.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Dr-Nguwaya-680x380.jpg",
            "description": "Wallace Ruzvidzo and Remember Deketeke Mutare City Council is seeking to tap into  Geo Pomona Waste Management’s expertise to improve its own system. In an interview after touring the Geo Pomona Waste Management facility in Harare yesterday, Mutare Mayor Councillor Simon Chabuka said they were looking to collaborate with the Harare-based firm. His city, he said, […]",
            "time": "09:28",
            "date": "08 Jan 2025"
        },
        {
            "title": "Smuggling: Six nabbed as authorities seize boat, vehicles at Limpopo River",
            "url": "https://www.herald.co.zw/smuggling-six-nabbed-as-authorities-seize-boat-vehicles-at-limpopo-river/",
            "content": "Thupeyo Muleya-Beitbridge Bureau\n\nSouth African police have seized two vehicles and an inflatable boat being used to ferry smuggled goods between across the Limpopo River in the Masisi area.\n\nIn a statement, Limpopo Police spokesperson Lieutenant Colonel Stephen Thakeng said six people had been arrested for facilitating smuggling on Monday during an operation against cross-border crimes.\n\nThe operation was conducted through a roadblock, stops, and searches and cross-border road patrols at Masisi policing area, he said.\n\nWe have confiscated two vehicles, and one boat and arrested four suspects for contravention of the Immigration Act, while two were arrested for aiding and abetting next to the Limpopo River in the bushes at Masisi policing precinct. The arrests were effected during a Cross-Border operation on Monday.\n\nThe Provincial Commissioner, Lieutenant General Thembi Hadebe, has welcomed the arrest and praised the collaboration between police and Cross Border, Business Forum and Farmers Union members that resulted in the confiscation of the vehicles, thus fighting cross border crime.\n\nThe suspects are expected to appear at their local magistrates court soon.\n\nThe arrests come as Zimbabwes National Anti-smuggling Task Force is also intensifying its crackdown on syndicates operating along the countrys border with South Africa.\n\nThe Government is losing thousands of dollars in potential import and export revenue to smuggling syndicates operating from the two countries.\n\nThe mega joint operation has seen a number of goods worth millions in import duty being seized between Beitbridge and Harare.\n\nThe Ministry of Industry and Commerce is spearheading the task force, in collaboration with the Zimbabwe Revenue Authority (Zimra), the Zimbabwe Republic Police, the Reserve Bank of Zimbabwe, the Consumer Protection Commission and other law-enforcement agencies.\n\nThe crackdown is aimed at stopping the influx of illicit goods in local markets.\n\nAccording to security officials, smugglers are avoiding the border post and frryin the goods across the Limpopo River.\n\nThey then load the goods in intercity buses or cargo trucks in Beitbridge for transport to destinations within Zimbabwe.\n\nAlong the border, the Government is making use of hi-tech security systems including drone surveillance systems to increase its capacity to curb smuggling through the port of entry and its flanks.\n\nSince the launch of the drone systems, and fast cargo scanners in January last year, Zimra has daily made more than three major interceptions of goods being smuggled in or out of the country.\n\nUnder the new order, authorities have increased surveillance in all hotspot areas and minimised the loss of revenue that is critical in funding Government commitments as well as hitting drug trafficking and illegal imports of dangerous goods.\n\nNational police spokesperson Commissioner Paul Nyathi said the task team is not relenting in their quest to enforce the law.\n\nWe are carrying out a joint anti-smuggling operation with other stakeholders including the Zimbabwe Revenue Authority, said Comm Nyathi.\n\nImporters or exporters are encouraged to do so within the confines of the countrys customs laws. Where duty must be paid it must be done and we dont condone smuggling.\n\nOur joint efforts are paying dividends. We have intercepted a number of goods that have been smuggled into our country because this cannot go on forever.\n\nHe said the operation is targeting buses, private cars and commercial trucks being used to carry smuggled goods.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/08/Arrested.jpg",
            "description": "Thupeyo Muleya-Beitbridge Bureau South African police have seized two vehicles and an inflatable boat being used to ferry smuggled goods between across the Limpopo River in the Masisi area. In a statement, Limpopo Police spokesperson Lieutenant Colonel Stephen Thakeng said six people had been arrested for facilitating smuggling on Monday during an operation against cross-border […]",
            "time": "09:28",
            "date": "08 Jan 2025"
        },
        {
            "title": "Editorial Comment: Govt intervention on private cemetery laudable",
            "url": "https://www.herald.co.zw/editorial-comment-govt-intervention-on-private-cemetery-laudable/",
            "content": "THE illegal attempt by some Harare City Council officials to create a private cemetery over the main water trunk pipeline at Prince Edward water works near Seke Dam has, quite correctly, been blocked by the Government on several grounds.\n\nWhile other cemeteries are found near rivers and streams, there is negligible health danger, since the sealed graves are never disturbed. However, in this area, all it needs is a pipeline burst, and there is potential contamination of treated water plus waste water washing body parts into the dam.\n\nIn any case, any repairs to the pipeline would require digging up graves as a matter of routine, a highly undesirable outcome at any time and dangerous with decomposing bodies. All this is in addition to the effects on the families of the dead buried there, and the high risk of molesting the graves.\n\nBut the sheer effrontery of the officials in creating a private cemetery highlights the growing problem of finding land for burials within the municipal area, a problem that will continue to grow.\n\nAlmost all remaining public open space is now in the form of wetlands and school sites, and while these are fine for recreation and parks, they obviously cannot be used for graves.\n\nNew cemeteries outside the municipal area will require the use of State land, and that would in turn mean moving farmers, something that can be done once appropriate compensation is paid and new land found when a mining company needs to open a new mine or the Government needs to build a new dam. But it is more problematic to move farmers to make way for graves.\n\nIn any case, even if ever more land was continually made available for cemeteries, we would still face the problem of more and more farmland, which we need for growing our food, being set aside permanently for graves.\n\nZimbabwe does not have much spare land, and most efforts in the agriculture sector are centred on making sure that all farmland is properly and fully used.\n\nOther countries have faced this problem and have found solutions that range from redeveloping cemeteries when bodies have been buried for a century, to stacking coffins up in high-rise cemeteries, to cremation.\n\nWe see cremation, with the addition of proper mini-graves and gravestones for the ashes, as the best solution and requiring the least modification of custom and family preferences.\n\nWe start from the position that the modern permanent and marked grave is actually a fairly recent, although highly desired, concept.\n\nVery few Zimbabweans can point to the rural graves of their ancestors of more than a century ago although most can now identify more recent graves and often are able to lay flowers or something similar on tombstones.\n\nBut permanent graves, even on family farms, cannot chew up space forever and at some stage there will be problems.\n\nIn other countries laws have had to be passed that renounce permanent graves for most people. Britain, for example, has changed the freehold of the many new cemeteries established in Victorian times to 99-year-leases.\n\nThose new cemeteries were to replace the recycled churchyards, where graves would be dug from one end to the other, and then redug many decades later starting from the original end. Nothing permanent and now the replacement cemeteries are not regarded as permanent.\n\nSome mainly Catholic countries, such as Italy, that faced the Catholic ban on cremation until this was changed in the 1960s, created thick wall cemeteries, that have niches for coffins ascending many metres high, so you can get up to a dozen coffins stacked one above the other with a row of bricks between each.\n\nChina has also largely switched to cremation, there simply being no room for new conventional cemeteries especially in the crowded coastal provinces and along the great rivers, and traditional Chinese culture places importance on graves and respect for the dead and has found cremation does answer the concerns.\n\nCremation converts a body into a small bag or box or urn of ashes and ensures that there is no health risk to the living. Over much of Europe cremation was banned until the very late 19th century, but the cultures quickly overcame the change and cremation is now the norm.\n\nThere are some families and individuals who want ashes of those cremated scattered, or dumped in the ocean or a lake or a river, but many prefer a final resting place.\n\nAnd we cannot imagine that any Zimbabwean would want their ashes scattered, but that many would in time accept a small permanent grave with a proper gravestone.\n\nA couple of such cemeteries were created in Harare. The cloisters of the Anglican Cathedral in the city centre hold the graves of several hundred people, their ashes buried under the paving stones.\n\nThose paving stones, about a quarter metre on a side, are all replaced by a small carved flat gravestone with the name, dates and sometime a line of verse, carved over them.\n\nThese are permanent graves. Because ashes are totally inert, there was never a health hazard.\n\nThe Warren Hills cemetery has a wall of remembrance with niches for ashes or urns, each covered by a small stone tombstone carrying the name, dates and verse or message of the person interred there.\n\nThere has been little expansion in recent years, because of perceived cultural reluctance, but we would imagine that many families, if the concept was carefully explained and accompanied by the option of a permanent marked grave, would accept the change.\n\nThis would also allow some churches and private concerns to open cemeteries far closer to where families live. When you can place 16 graves on a single square metre you can bury several thousand people on a single hectare, and still leave room for paths, trees and gardens. A wall around such a mini cemetery could also have niches for more urns of ashes, each behind a marked gravestone.\n\nIt would also be possible to have family plots. An area now occupied by a single grave in a conventional cemetery would hold the ashes in individual marked graves, or niches in walls of some sort of mausoleum, of many generations of a large family and still leave room for a memorial monument or tree.\n\nCremation thus seems to be the best solution to allow families to bury their loved ones properly, each in their own permanent and marked grave, without having to spread our cemeteries across ever more square kilometres of farmland or, far worse, reach the stage when we have to dig up old cemeteries to make room for the newer dead.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2015/03/GRAVES.jpg",
            "description": "THE illegal attempt by some Harare City Council officials to create a private cemetery over the main water trunk pipeline at Prince Edward water works near Seke Dam has, quite correctly, been blocked by the Government on several grounds. While other cemeteries are found near rivers and streams, there is negligible health danger, since the […]",
            "time": "09:28",
            "date": "08 Jan 2025"
        }
    ]
}