{
    "news": [
        {
            "title": "Farmers condemn planned protests, warn of disruptions to tobacco marketing",
            "url": "https://www.herald.co.zw/farmers-condemn-planned-protests-warn-of-disruptions-to-tobacco-marketing/",
            "content": "The Zimbabwe National Farmers Union (ZNFU) has condemned the planned civil unrest being touted by some unruly elements, warning that it will disrupt the tobacco-marketing season that is currently underway.\n\nThe golden leaf is one of Zimbabwes major foreign currency earners.\n\nZNFU president, Mrs Monica Chinamasa said the planned demonstrations pose a serious threat to the smooth transportation and sale of tobacco.\n\nWe are totally against demonstrations, she said. These interrupt our operations as tobacco farmers.\n\nRight now our transporters are reluctant to ferry our produce to the auction floors due to the threat of demonstrations.\n\nMrs Chinamasa urged Zimbabweans to maintain peace, highlighting that civil unrest could destabilise the countrys economy.\n\nZimbabwe is known for peace, and we really need it, she added. We are expecting that the tobacco produced this season will contribute immensely to building the nation.\n\nThis can only be done if we resolve our issues, if there are any at all, amicably.\n\nZimbabwes tobacco industry is a key driver of the economy, generating significant foreign currency.\n\nDisruptions to its marketing could have far-reaching consequences for farmers and the nation at large.\n\nMrs Chinamasa joins a growing list of voices from other key economic sectors that have condemned the planned protests, warning of their potential impact on economic stability and livelihoods.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/04/Mrs-Monica-Chinamasa.jpg",
            "description": "The Zimbabwe National Farmers Union (ZNFU) has condemned the planned civil unrest being touted by some unruly elements, warning that it will disrupt the tobacco-marketing season that is currently underway. The golden leaf is one of Zimbabwe’s major foreign currency earners. ZNFU president, Mrs Monica Chinamasa said the planned demonstrations pose a serious threat to […]",
            "time": "18:09",
            "date": "28 Mar 2025"
        },
        {
            "title": "Zimbabwe’s economy thrives on stability, not protests: Retailers",
            "url": "https://www.herald.co.zw/zimbabwes-economy-thrives-on-stability-not-protests-retailers/",
            "content": "Online Reporter\n\nThe Confederation of Zimbabwe Retailers (CZR) has warned against calls for civil unrest in the country, raising concerns about the potential economic disruptions to commerce.\n\nIn a statement, the CZR president, Dr Denford Mutashu highlighted that past demonstrations have often led to violence, destruction of property, and economic instability.\n\nDr Mutashu said businesses and ordinary citizens typically suffer as a result of civil unrest.\n\nZimbabwe has experienced some protests in the past, and history shows that they have rarely led to constructive solutions. Instead, they caused significant damage to businesses and livelihoods, he said.\n\nThe reality is that protests have often harmed businesses and the economy more than they have addressed the concerns they were meant to highlight.\n\nThose who do not participate in protests, especially businesses and workers, often bear the brunt of the disruptions, while the economic damage lingers long after the demonstrations have ended.\n\nCZR believes that dialogue remains the most effective way to address national concerns.\n\nZimbabwes economy thrives on stability, investor confidence, and a supportive business environment, all of which are undermined by unrest.\n\nHe reiterated CZRs commitment to economic stability, investor confidence, and a thriving business sector.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/05/hgbn.jpg",
            "description": "Online Reporter The Confederation of Zimbabwe Retailers (CZR) has warned against calls for civil unrest in the country, raising concerns about the potential economic disruptions to commerce. In a statement, the CZR president, Dr Denford Mutashu highlighted that past demonstrations have often led to violence, destruction of property, and economic instability. Dr Mutashu said businesses […]",
            "time": "18:09",
            "date": "28 Mar 2025"
        },
        {
            "title": "120 Glen View youths receive ICT certificates",
            "url": "https://www.herald.co.zw/120-glen-view-youths-receive-ict-certificates/",
            "content": "Talent Chimutambgi\n\nA total of 120 youths in Glen View have received certificates after undergoing Information Communication Technology training as part of the Governments drive to empower them.\n\nPresident Mnangagwa is spearheading programmes that seek to empower youths under the mantra leaving no one and no place behind.\n\nSpeaking at the event, Minister of State for Harare Metropolitan Provincial Affairs and Devolution, Senator Charles Tawengwa said embracing ICT is crucial.\n\nWhat we are witnessing today is a fulfilment of our President, Dr Mnangagwas aspirations. He has set goals for us to attain a prosperous upper-middle-income economy by 2030. Embracing digital technology will help us achieve that, said Senator Tawengwa.\n\nYouth Empowerment, Development and Vocational Training Minister Tino Machakaire, Zanu PF candidate for Glen View South Constituency, Cde Tsitsi Tawomera and other party members attended the event.\n\nInformation Communication Technology, Postal and Courier Services Minister Tatenda Mavetera has pledged to take the programme across the country for the benefit of young people.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Perm-Sec.jpg",
            "description": "Talent Chimutambgi A total of 120 youths in Glen View have received certificates after undergoing Information Communication Technology training as part of the Government’s drive to empower them. President Mnangagwa is spearheading programmes that seek to empower youths under the mantra ‘leaving no one and no place behind’. Speaking at the event, Minister of State […]",
            "time": "18:09",
            "date": "28 Mar 2025"
        },
        {
            "title": "Breaking: Police hunt arsonists behind Harare, Goromonzi vehicle fires",
            "url": "https://www.herald.co.zw/breaking-police-hunt-arsonists-behind-harare-goromonzi-vehicle-fires/",
            "content": "Online Reporter\n\nPolice have launched an investigation into a series of vehicle burnings that occurred at business premises in Avondale, Highlands, Newlands and Goromonzi early morning on Friday.\n\nIn a statement, national police spokesperson, Commissioner Paul Nyathi said the incidents took place today between midnight and 4am.\n\nHe said the vehicles were set on fire using petrol while in motion.\n\nThe Zimbabwe Republic Police has received reports of petrol-instigated burning of moving vehicles at business premises in Avondale, Highlands, Newlands and Goromonzi on 28 March between midnight and 4 am.\n\nThis was done by suspects who were driving the vehicles. They quickly jumped onto accompanying vehicles and drove away, said Commissioner Nyathi.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/07/1705-1-1-PAUL-THEMBA-NYATHI-1-3.jpg",
            "description": "Online Reporter Police have launched an investigation into a series of vehicle burnings that occurred at business premises in Avondale, Highlands, Newlands and Goromonzi early morning on Friday. In a statement, national police spokesperson, Commissioner Paul Nyathi said the incidents took place today between midnight and 4am. He said the vehicles were set on fire […]",
            "time": "18:09",
            "date": "28 Mar 2025"
        },
        {
            "title": "Zanu PF Youth League at Glen View South campaign rally",
            "url": "https://www.herald.co.zw/zanu-pf-youth-league-at-glen-view-south-campaign-rally/",
            "content": "Joseph Madzimure\n\nZimpapers Politics Hub\n\nZanu PF Youth League national executive members are in Glen View South for a campaign rally at Chemanza Grounds in preparation for the April 12 by-elections.\n\nCde Tsitsi Tawomhera will be representing the party in the by-elections.\n\nShe said she is confident of grabbing the seat from the opposition.\n\nI promised the party leadership that I will win the seat. I am confident that l will win because there is no opposition to talk of in this area.\n\nConsidering the amount of work being done by President Mnangagwa, the people believe that Zanu PF is the only party that can deliver for the people.\n\nPresident Mnangagwa has said there is need to reclaim the seat from the opposition.\n\nSecretary for Youth Affairs, Cde Tino Machakaire, is the guest of honour, and will give a keynote address to thousands of Zanu PF supporters in attendance.\n\nZanu PF Politburo member Cde Charles Tavengwa, Harare provincial youth chairman Cde Emmanuel Mahachi and Harare provincial political commissar Cde Voyage Dambuza, among others, are also at the rally.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/ZANU-PF-leaders-in-Glen-View-680x380.jpg",
            "description": "Joseph Madzimure Zimpapers Politics Hub Zanu PF Youth League national executive members are in Glen View South for a campaign rally at Chemanza Grounds in preparation for the April 12 by-elections. Cde Tsitsi Tawomhera will be representing the party in the by-elections. She said she is confident of grabbing the seat from the opposition. “I […]",
            "time": "18:09",
            "date": "28 Mar 2025"
        },
        {
            "title": "Agriculture remains backbone of the economy: Minister Ndlovu",
            "url": "https://www.herald.co.zw/agriculture-remains-backbone-of-the-economy-minister-ndlovu/",
            "content": "Online Reporter\n\nAgriculture remains the backbone of Zimbabwes economy, contributing 60 percent of raw materials to the manufacturing sector, with seed companies playing a central role in the development of the agricultural value chain, a Cabinet Minister has said.\n\nSpeaking at the launch of Seed Cos 85th anniversary commemorations in Harare, Industry and Commerce Minister Mangaliso Ndlovu, who was represented by Industry Permanent Secretary, Dr Thomas Ushe Utete, praised the contribution of seed companies to the sector.\n\nHe said participation of seed companies in the value chain ensures a reliable supply of inputs, which boosts food production, reduces import dependency and stabilises market prices.\n\nThe manufacturing sector receives 60 percent of its raw materials from agriculture, and we are encouraged that Seed Co is involved in the value chain by providing inputs for our industries as they are key raw materials sources, said Minister Ndlovu.\n\nMinister Ndlovu said the Government is implementing National Development Strategy 1 (NDS1), which is focused on enhancing value chains and driving structural transformation in the economy.\n\nThe objective is to boost the manufacturing sector through value addition and beneficiation of agricultural and mineral resources, he said.\n\nUnder NDS1, ten key manufacturing value chains have been prioritised, six of which are agro-based  cotton, dairy, fertilizer, leather, soya, and sugar.\n\nThe remaining four focus on plastic waste, pharmaceuticals; buses, trucks and engineering, iron and steel.\n\nSeed Co Group chief executive officer Mr Morgan Nzwere said the company is committed to shaping the future of agriculture by expanding into new markets and enhancing digital solutions for farmers.\n\nWhile we reflect on 85 years of success, we know the journey is far from over, he said.\n\nWith the support of our incredible farmers, partners and stakeholders, we will continue to expand, innovate and keep growing  growth never stops at Seed Co.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/07/Untitled-91-1.jpg",
            "description": "Online Reporter Agriculture remains the backbone of Zimbabwe’s economy, contributing 60 percent of raw materials to the manufacturing sector, with seed companies playing a central role in the development of the agricultural value chain, a Cabinet Minister has said. Speaking at the launch of Seed Co’s 85th anniversary commemorations in Harare, Industry and Commerce Minister […]",
            "time": "18:09",
            "date": "28 Mar 2025"
        },
        {
            "title": "Kabondo to defend his gold at Mr Pace marathon",
            "url": "https://www.herald.co.zw/kabondo-to-defend-his-gold-at-mr-pace-marathon/",
            "content": "Curtworth Masango\n\nMr Pace Post Insurance marathon gold medallist Wayne Kabondo is looking forward to winning the race that is set for May 10.\n\nKabondo noted the challenges of securing sponsorship and thanked partners that have come on board.\n\nThe race, which is sponsored by Zimpost and its partners Nicoz Diamond, Global Risk Underwriting Managers (Gruma) and Zinara, is now running into the fourth edition.\n\nSpeaking at a joint presser in the capital, Kabondo said: Athletes need money and this sponsorship is helping us.\n\nThis event is now providing a bigger platform for athletes to showcase their talent. I am looking forward to defending my championship and improving my time.\n\nDavid Nyabadza, Nicoz Diamond CEO, reaffirmed his companys commitment to supporting local athletes.\n\nHe highlighted the importance of investing in community development and providing opportunities for young people.\n\nWe believe that the marathon is an excellent platform for talented young people to showcase their skills and give back to the community, Nyabadza said.\n\nHe expressed satisfaction over the growth of the event, which has attracted participants from Zimbabwe and beyond.\n\nWe are happy with the growth we have experienced so far. We believe this event will attract even better athletes.\n\nNyabadza revealed that Nicoz Diamond aims to increase its investment in athletes development so that they can compete in global events and lift the Zimbabwean flag high.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Wayne-Kabondo.jpg",
            "description": "Curtworth Masango Mr Pace Post Insurance marathon gold medallist Wayne Kabondo is looking forward to winning the race that is set for May 10. Kabondo noted the challenges of securing sponsorship and thanked partners that have come on board. The race, which is sponsored by Zimpost and its partners Nicoz Diamond, Global Risk Underwriting Managers […]",
            "time": "18:09",
            "date": "28 Mar 2025"
        },
        {
            "title": "Diego Maradona died in agony: Coroner testifies",
            "url": "https://www.herald.co.zw/diego-maradona-died-in-agony-coroner-testifies/",
            "content": "One of two forensic experts who performed Diego Maradonas autopsy has told a court in Buenos Aires that the Argentinian football legend was in agony for at least 12 hours before he died.\n\nThe results of the autopsy were made public for the first time yesterday amid the trial of seven doctors and nurses who treated him at his Buenos Aires home before his death in 2020.\n\nThe trial started on Tuesday.\n\nThe heart was completely covered in fat and blood clots, which indicate agony, Carlos Cassinelli, director of forensic medicine at the Scientific Police Superintendency, told the court.\n\nThe autopsy concluded that Maradona died from acute pulmonary oedema secondary to congestive heart failure.\n\nHe was not a patient who should have been treated at home, Cassinelli added.\n\nThe defendants in the case are accused of homicide with possible intent  pursuing a course of action despite knowing it can lead to their patients death.\n\nThey risk prison terms of between eight and 25 years.\n\nThis is a patient who had been collecting water over the days; thats not acute. This was foreseeable, he said. Any doctor examining a patient would find this.\n\nAccording to the prosecution, the accused professionals  a neurosurgeon, a psychiatrist, a psychologist, doctors, and nurses  who were caring for Maradona during his convalescence, failed to provide adequate medical care, which allegedly led to his death.\n\nDuring the investigation, several witnesses testified that they noticed Maradonas face and abdomen were excessively swollen.\n\nThe footballing legend died at the age of 60 in a private residential complex north of Buenos Aires. He had undergone brain surgery a few weeks earlier.\n\nInvestigators say serious mistakes were made in the home care of the 1986 World Cup winner, whose health was severely compromised.\n\nNearly 120 witnesses are expected to testify in the long-delayed trial anticipated to run until July. Source: Al Jazeera\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Diego-Maradona-680x380.jpg",
            "description": "One of two forensic experts who performed Diego Maradona’s autopsy has told a court in Buenos Aires that the Argentinian football legend was in agony for at least 12 hours before he died. The results of the autopsy were made public for the first time yesterday amid the trial of seven doctors and nurses who […]",
            "time": "18:09",
            "date": "28 Mar 2025"
        },
        {
            "title": "Earthquake strikes Myanmar, Thailand",
            "url": "https://www.herald.co.zw/earthquake-strikes-myanmar-thailand/",
            "content": "An earthquake of magnitude 7,7 has struck Myanmar, causing hundreds of people to pour out of swaying buildings in Bangkok, the capital of neighbouring Thailand, which is 1 400km away.\n\nAccording to the United States Geological Survey (USGS), the quake on Friday was shallow, at a depth of just 10km with the epicentre near the central city of Mandalay, about 50km east of the city of Monywa.\n\nAt least 103 people have been reported dead, with over 300 injured.\n\nIn Mandalay, multiple buildings collapsed, including parts of Mandalay University, which caught fire.\n\nA mosque collapse in the city resulted in 10 fatalities.\n\nIn the capital, Naypyidaw, the air traffic control tower at the international airport collapsed, killing five people.\n\nStartled residents in densely populated central Bangkok poured out of high-rise condos and hotels.\n\nThe greater Bangkok area is home to more than 17 million people, many of whom live in high-rise apartments.\n\nThe quake was forceful enough to send water sloshing out of pools, some high up in high-rises, as the tremor shook.\n\nI heard it and I was sleeping in the house. I ran as far as I could in my pyjamas out of the building, Duangjai, a resident of popular tourist city Chiang Mai, northern Thailand, told AFP.  wires\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Earthquake-680x380.jpg",
            "description": "An earthquake of magnitude 7,7 has struck Myanmar, causing hundreds of people to pour out of swaying buildings in Bangkok, the capital of neighbouring Thailand, which is 1 400km away. According to the United States Geological Survey (USGS), the quake on Friday was shallow, at a depth of just 10km with the epicentre near the […]",
            "time": "18:09",
            "date": "28 Mar 2025"
        },
        {
            "title": "Bulawayo police officer gunned down",
            "url": "https://www.herald.co.zw/bulawayo-police-officer-gunned-down/",
            "content": "Peter Matika\n\nA Bulawayo police officer was shot and killed while attending to a crime scene on Thursday night in Tshabalala suburb.\n\nThe police officer has since been identified as Sergeant Abel Masava.\n\nReports indicate that Sgt Masava was attending a crime scene with another officer, accompanied by two complainants, when he confronted a group of five men who were passing by.\n\nSources suggest that he inquired about their presence in the area, and one of the suspects pulled out a firearm and shot him in the head.\n\nSgt Masava was rushed to a local hospital but succumbed to his injury shortly after arrival.\n\nPolice are yet to release an official statement regarding the incident.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Sergeant-Abel-Masava.jpg",
            "description": "Peter Matika A Bulawayo police officer was shot and killed while attending to a crime scene on Thursday night in Tshabalala suburb. The police officer has since been identified as Sergeant Abel Masava. Reports indicate that Sgt Masava was attending a crime scene with another officer, accompanied by two complainants, when he confronted a group […]",
            "time": "18:09",
            "date": "28 Mar 2025"
        }
    ]
}