{
    "news": [
        {
            "title": "Zim to introduce parole",
            "url": "https://www.herald.co.zw/zim-to-introduce-parole/",
            "content": "Nqobile Bhebhe, Bulawayo Bureau\n\nThe Government is undertaking a comprehensive review of existing policies and regulations to facilitate the effective implementation of the parole system and establish community correctional centres.\n\nThe Ministry of Justice, Legal and Parliamentary Affairs, in partnership with the Zimbabwe Prisons and Correctional Service (ZPCS), are working to implement the system that is outlined in the new Prisons and Correctional Service Act.\n\nPresident Mnangagwa recently reassured the ZPCS of continued Government support to enable the organisation to fulfil its constitutional mandate while officiating at a pass-out parade of correctional officers at Ntabazinduna Training School.\n\nThe parole system initiative underscores Zimbabwes commitment to transforming its prison system from one of punishment to one focused on rehabilitation and reintegration.\n\nParole is the conditional release of prisoners before they complete their sentences. The new Act has provision for the establishment of the State Parole Board and sets conditions for early release from prison.\n\nThe system needs ways of measuring how each prisoner considered for parole would have met the required conditions.\n\nAn inmate can be released through a decision made by the President, the State Parole Board, the Commissioner General of Prisons, or the Minister responsible for Prisons and Correctional Services.\n\nThe State Parole Board is authorised to release inmates on day parole.\n\nSome of the considerations for granting parole include whether an inmate has displayed meritorious conduct, self-discipline, responsibility and was industrious while in prison.\n\nPersons to be released early must not present undue risk to society when on parole, and their release must contribute to the rehabilitation and reintegration of the inmates into society as law-abiding citizens.\n\nIn his address at the combined 154th and 155th recruit correctional officers courses pass-out parade held at ZPCS Ntabazinduna Training School recently, Justice Minister Ziyambi Ziyambi said that in liaison with ZPCS, the ministry is reviewing policies and regulations in line with the provisions of the new Act.\n\nThis will positively see the effective implementation of the parole system and establishment of community correctional centres, among other aspects. These programmes are crucial in advancing the reintegration process and also assisting in reducing overcrowding in correctional facilities, he said.\n\nMinister Ziyambi added that ZPCS is leaving nothing to chance to address challenges faced by inmates and ex-inmates in their passage to reintegration into society.\n\nHe said ZPCS has initiated a bid to facilitate the establishment of a foundation aimed at addressing these challenges.\n\nThrough stakeholder involvement, the foundation will provide support programmes and mobilise resources necessary for the successful implementation of reintegration initiatives. As a Ministry, we are fully behind this ingenuity and will ensure that the vision becomes a reality.\n\nHe noted that it was also vital to make concerted efforts and continue fostering regional collaboration among neighbouring correctional services to holistically enhance successful reintegration.\n\nI, therefore, urge all correctional services in Africa to fully use the African Correctional Services Association in order to propel exchange programmes for mutual benefit towards successful reintegration. It is our belief that African problems should be solved by African solutions.\n\nSpeaking at the same ceremony, ZPCS Commissioner-General Moses Chihobvu said the enactment of the new Act had empowered ZPCS to bolster its efforts in the rehabilitation and reintegration of inmates.\n\nBy focusing on rehabilitation over punishment, the new legislation aims to strengthen the furnishing of former inmates with the requisite skills and support for successful re-entry to society after serving their sentences, he said.\n\nReintegration is crucial not only for the personal growth of released inmates but also for enhancing public safety and reducing recidivism rates. When ex-offenders are provided with access to education, employment opportunities, and social services, they are more likely to become contributing members of society.\n\nHe noted that the holistic approach fosters a sense of belonging and encourages positive citizenship, ultimately strengthening the fabric of the nation.\n\nHe said through effective reintegration efforts, ZPCS sought to transform lives and promote a more inclusive and resilient society.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/President-Mnangagwa-3.jpg",
            "description": "Nqobile Bhebhe, Bulawayo Bureau The Government is undertaking a comprehensive review of existing policies and regulations to facilitate the effective implementation of the parole system and establish community correctional centres. The Ministry of Justice, Legal and Parliamentary Affairs, in partnership with the Zimbabwe Prisons and Correctional Service (ZPCS), are working to implement the system that […]",
            "time": "06:28",
            "date": "24 Dec 2024"
        },
        {
            "title": "Christmas fever grips Harare",
            "url": "https://www.herald.co.zw/christmas-fever-grips-harare/",
            "content": "Trust Freddy and Obey Musiwa\n\nHarare was busy yesterday, as shoppers flocked to shops for last-minute Christmas shopping, while hundreds of travellers headed to rural areas to reunite with loved ones.\n\nThe city centre was flooded with people rushing to buy last-minute Christmas goodies, clothes, and get stylish haircuts, with salons and beauty parlours also bustling with activity as everyone sought to look their best for the holiday.\n\nThere were long queues at banks with people trying to withdraw banknotes from ATMs to spend where cards or transfers were impossible to use or not accepted.\n\nMoney transfer agents such as Paisa, Mukuru, Homelink and Western Union were also overrun with long queues as people collected remittances from the diaspora.\n\nStreets in the central business district were heavily congested with vendors who had set up their wares on the pavements, making it difficult for pedestrians to walk.\n\nThe crowded conditions created an opportunity for pickpockets to strike, and the odd pedestrian could be heard screaming in distress after discovering that their cellphones or wallets had been stolen.\n\nMost businesspeople who spoke to The Herald reported that they were running low on stock, as large numbers of customers flooded their shops.\n\nMs Chenai Wimbo, who supplies womens hair products, expressed happiness with the high number of customers.\n\nDuring the first week of December, it was slightly quiet, but in the second week of December things became hectic.\n\nYou would think that people only woke up on Wednesday and then remembered that its now Christmas, they just started to come in numbers.\n\nA shop worker, who preferred to be called Tariro and works at the corner of Sir Seretse Khama Street and Augustinho Neto Avenue said she was exhausted.\n\nThis is not my shop, but my boss is making money, she said.\n\nSince last week, I havent cashed anything below US$1 000 daily, and I guess its because we are selling kids clothes, which parents prioritise for Christmas.\n\nMeanwhile, a normally 15-minute drive from Herald House to Mbare bus terminus turned into a gruelling hour-long ordeal as all roads leading to the terminus were clogged with vehicles jostling to drop off passengers bound for rural areas.\n\nThe roads were congested with cars, taxis, and buses, all trying to navigate through the chaos, as travellers scrambled to catch long-distance buses.\n\nAt the bus rank, there was pandemonium as touts jostled for customers.\n\nSome bus operators had increased fares, with Buhera routes now costing US$15, up from the usual US$10.\n\nMasvingo fares had also risen, from US$10 to US$15, while Ngundu fares had jumped to US$20, from US$15.\n\nAs Christmas Day approaches, fares are expected to continue rising as crews take advantage of the festive season, before returning to their normal fares thereafter.\n\nA Chiredzi-bound passenger, Ms Sarudzai Chaipa, said she had missed a bus that goes directly to Chiredzi.\n\nI am waiting for a bus that can take me directly to Chiredzi, but the ones that are available will take me via Ngundu. Just going to Ngundu costs US$20, and I might end up paying US$30, so I hope to find a direct one, she said.\n\nBut on other routes, bus operators mantained the same fares. If you look, Chinhoyi and Bulawayo routes are still the same , I hope they will not increase tomorrow (today), Mr Tinashe Gwekwe said.\n\nA bus driver plying the Harare-Karoi route, said: Usually during this festive season we increase fares because people will be carrying a lot of luggage and the heavy weight translates to huge fuel consumption.\n\nPushcart operators were also making money, as they were the most preferred option for carrying peoples goods, being capable of navigating the congested roads with ease.\n\nI am targeting US$100 a day, and I am praying that this congestion will persist, so that people will be dropped far from the bus stop, allowing us to charge them handsomely, a pushcart operator who identified himself as Tindo said.\n\nSimilarly, at the Simon Muzenda Street bus terminus, some operators had marginally increased their fares with pirate taxis the worst.\n\nTouts could be heard mocking passengers bound for Shamva, who were waiting for buses that cost US$3.\n\nYou are hesitant to board this kombi, were going to increase the fare to US$8 from US$5 at 6pm , a tout said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Mbare.jpg",
            "description": "Trust Freddy and Obey Musiwa Harare was busy yesterday, as shoppers flocked to shops for last-minute Christmas shopping, while hundreds of travellers headed to rural areas to reunite with loved ones. The city centre was flooded with people rushing to buy last-minute Christmas goodies, clothes, and get stylish haircuts, with salons and beauty parlours also […]",
            "time": "06:28",
            "date": "24 Dec 2024"
        },
        {
            "title": "Economic stability boost for industry",
            "url": "https://www.herald.co.zw/economic-stability-boost-for-industry/",
            "content": "Farirai Machivenyika and Ivan Zhakata\n\nCaptains of industry and other stakeholders must take advantage of the economic stability brought by the Second Republics policies to grow their operations and accelerate economic growth in the coming new year, Industry and Commerce Minister Mangaliso Ndlovu said in his Christmas message.\n\nHe said consumers should buy products made in Zimbabwe to boost the operations of local companies and consequently create more jobs.\n\nIn his statement, Minister Ndlovu saluted businesses, development partners, the private sector, ministry development agencies and consumers for their contributions to economic growth this year.\n\nThe new year presents an opportunity to address challenges in industrial growth while optimising on the strong macro-economic stability we have experienced in the last few months to drive industrial growth going forward, he said.\n\nI equally encourage your support for the inter-ministerial taskforce on business malpractice in combating counterfeiting and smuggling which enables us to give sanity to our business environment while enhancing consumer protection.\n\nAs you celebrate this festive season, please support local initiatives through the Buy Zimbabwe and local content strategy, Minister Ndlovu implored the nation.\n\nHis statement comes as Grain Millers Association of Zimbabwe national chairman Mr Tafadzwa Musarara yesterday said the milling industry had supplied all essential grain-based products to the market for the festive season and that there will be no shortages.\n\nMr Musarara said despite 2024 being a challenging year marked by drought and grain imports, the milling sector rose to the occasion and delivered products that exceeded demand by 38,9 percent. The stock levels meant that prices would be stable as they could only be pushed up by profiteering retailers when there were shortages.\n\nWith all maize in stock reserved for Government food schemes, millers had to import their entire supply except for what they had contracted with the farmers.\n\nSome of the products that have been supplied to the market were maize meal,rice, flour, salt and other essentials.\n\nThe surplus supply has stabilised prices, making these commodities accessible to all, in both formal and informal retail outlets, he said.\n\nMoving forward, we remain committed to supporting local agriculture through contract farming and exploring additional source markets to maintain affordability.\n\nMr Musarara thanked the Government for its private sector-led approach to achieving national food security.\n\nThe Governments policies align with international best practices and have enabled us to adapt effectively to these challenges, he said.\n\nThe Government has implemented a number of measures to stabilise the economy including strengthening the foreign exchange market that has seen the stability of the local currency, the ZiG, against the US dollar and other currencies, even on the parallel market.\n\nA crackdown against smuggling through the countrys borders has also been launched, amid startling revelations the country may be losing an estimated US$1 billion annually in revenue through smuggling.\n\nThrough partnerships with private investors, a number of electricity generating projects, especially in the coal sector, have been initiated and are expected to ease power shortages the country has been experiencing this year by the end of next year. This will enable Zesa to release more electricity to the manufacturing sector.\n\nMinister Ndlovu said they are focusing on strengthening collaboration with the private sector and invited all stakeholders to engage actively with the Ministry.\n\nThe Zimbabwe Industrial Reconstruction and Growth Plan 2024-2025 had been launched to promote industrial development as the country strives to be an upper-middle income society by 2030.\n\nThe plan seeks to address challenges hindering the growth of the manufacturing and commercial sectors, including issues such as competitiveness, the cost of doing business, promotion of links with small and medium enterprises, innovation and research.\n\nThe Ministry was allocated ZiG509 million for the implementation of the plan in the 2025 National Budget.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/07/Untitled-91-1.jpg",
            "description": "Farirai Machivenyika and Ivan Zhakata Captains of industry and other stakeholders must take advantage of the economic stability brought by the Second Republic’s policies to grow their operations and accelerate economic growth in the coming new year, Industry and Commerce Minister Mangaliso Ndlovu said in his Christmas message. He said consumers should buy products made […]",
            "time": "06:28",
            "date": "24 Dec 2024"
        },
        {
            "title": "Beitbridge Border staff beefed up",
            "url": "https://www.herald.co.zw/beitbridge-border-staff-beefed-up/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nBorder authorities from Zimbabwe and South Africa have deployed additional staff at Beitbridge Border Post, to ensure human and vehicular traffic moves seamlessly.\n\nA senior Zimbabwean customs official, who preferred to remain anonymous, confirmed that more workers have been assigned to assist at the bus and private vehicle terminals since December 10, especially for those needing help with electronic temporary import permits.\n\nRecent statistics from the Immigration Department indicate a significant influx of travellers.\n\nBetween December 16 and December 21, 85 846 people arrived in Zimbabwe, while 34 094 departed. Notably, 75 096 or 87 percent of these arrivals were returning residents.\n\nVehicle traffic has surged as well, with 3 087 light vehicles, 2 403 buses, and 3 525 trucks moving north from South Africa.\n\nAssistant regional immigration officer-in-charge of Beitbridge, Mrs Canisia Magaya reported that the border is processing an average of 13 976 entries and 6 362 departures daily.\n\nSufficient manpower has been deployed across all terminals to ensure compliance and enhance the safety of travellers.\n\nDespite the surge, statistics at this point reveal a very small decline in overall traffic this year compared to last year at this time.\n\nFrom December 11 to December 22, 159 044 entries were processed, down by around 1 percent from 160 632 last year.\n\nDepartures dropped far more sharply, with 69 992 this year versus 81 235 the previous year.\n\nTravellers have been warned against using third-party services for immigration clearance, as these are often fraudulent.\n\nThose travelling with children are reminded to carry valid passports and necessary supporting documents.\n\nPermanent Secretary for Tourism and Hospitality Industry Dr Takaruza Munyanyiwa is on-site to oversee operations and ensure a smooth traffic flow.\n\nWe are here on the ground and happy with the feedback we are getting from travellers coming through Beitbridge Border Post.\n\nWhat we have noted from most travellers is that there is a need to harmonise payment processes to cut the time they spend in queues paying levies and other compliance fees, said Dr Munyanyiwa.\n\nMany travellers expressed satisfaction with the improvements at the border.\n\nOne motorist, who chose to remain anonymous, said: I was served well this time around compared to the last three years. I am happy about the introduction of the eTIP system, which is a good step by the Government, embracing e-governance.\n\nAnother transporter, identified only as Ncube, remarked: The separation of traffic was a game changer that has helped reduce the turnaround time at the border.\n\nOverall, the enhancements at Beitbridge Border Post have contributed to a more organised and efficient travel experience during this peak season.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Beitbridge.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau Border authorities from Zimbabwe and South Africa have deployed additional staff at Beitbridge Border Post, to ensure human and vehicular traffic moves seamlessly. A senior Zimbabwean customs official, who preferred to remain anonymous, confirmed that more workers have been assigned to assist at the bus and private vehicle terminals since December […]",
            "time": "06:28",
            "date": "24 Dec 2024"
        },
        {
            "title": "Byo marks Unity Accord with plea for peace",
            "url": "https://www.herald.co.zw/byo-marks-unity-accord-with-plea-for-peace/",
            "content": "Nqobile Tshili, Bulawayo Bureau\n\nZIMBABWES Unity Accord commemorations should not be viewed solely through political lens, but should also address family dynamics amid rising concerns over discord among relatives, increasing divorce rates, and family members harming each other over minor issues, a top Government official has said.\n\nBulawayo Provincial Affairs and Devolution Minister Judith Ncube highlighted this yesterday as the province commemorated Unity Day with a thanksgiving church service.\n\nThe event, held at the Large City Hall, saw participation from Government officials, churches, residents, and members of the media.\n\nMinister Ncube acknowledged that the signing of the December 22, 1987 Unity Accord by the late President Robert Mugabe and the late Vice President Joshua Nkomo laid the foundation for the peaceful country we have today.\n\nShe noted that the Unity Accord ended years of conflict that threatened to tear the nation apart.\n\nThe Unity Accord is one of the major political milestones in Zimbabwe since independence. It extinguished the fires of conflict in our nation and established the foundation of peace and unity that we enjoy up to now. Some may not value the Unity Accord because they dont know what was happening. Even today in our homes, in our families, there are serious conflicts.\n\nSome are even forced to relocate as they dont want to interact with their siblings.\n\nWe need the church to unite families as some end up killing each other. We are aware of some children who kill their parents and siblings, blaming them for their misfortunes, said Minister Ncube.\n\nExpressing concern over the alarmingly high divorce rates in the country, Minister Ncube underlined the importance of prioritising national interests over personal gains when resolving family conflicts.\n\nMirroring the selfless dedication of the countrys founding fathers, Minister Ncube urged citizens to approach family disputes with a spirit of national unity and a commitment to preserving the sanctity of the family unit.\n\nWhatever contradictions and differences we face as a nation, we should always find resolutions through peaceful dialogue.\n\nNo nation can develop if there is conflict. As His Excellency, the President of Zimbabwe Dr Emmerson Mnangagwa always says, ilizwe lakhiwa ngabanikazi balo, likhulekelwe ngabanikazi balo. We thought it fitting that as we hold this Unity Day commemoration, we invite the clergy because the clergy needs to pray for the country. More than ever, we need to embrace the power of coming together, said Minister Ncube.\n\nAcknowledging the numerous challenges facing Bulawayo, including the ongoing water crisis, she emphasised that unity of purpose is crucial to overcoming these obstacles.\n\nWe need to pray for rain as the water situation is causing conflicts in the city. As a Government, we are closely working with the council through the Town Clerks office and the Mayor to address the water issue. Right now, feasibility studies are being conducted to establish whether we can draw water from an aquifer in Hope Fountain. All these efforts are aimed at addressing the citys water challenges, she said.\n\nBulawayo Deputy Mayor Edwin Ndlovu said the Unity Accord is an important day in the nations calendar as it reminds us of the countrys shared history, struggles, and enduring spirit.\n\nThis Unity Accord marked a watershed moment in our nations history. It was a time when we chose to prioritise our collective future over individual differences. It was also a time for healing, reconciliation, and a commitment to building a brighter future for all Zimbabweans.\n\nThe journey to this unity was not an easy one. It was fraught with challenges, sacrifices, and profound losses. Yet, the leaders of that time had the foresight to recognise that our strength lies not in division, but in togetherness. They understood that, despite our varying backgrounds, languages, and cultures, we share a common destiny. Today, we honour their vision and the legacy they left us, said Clr Ndlovu.\n\nHe said that for Bulawayo to thrive, a spirit of unity and a collective focus on the citys interests must guide the provinces development.\n\nRepresenting the Roman Catholic Church of Bulawayo, Archbishop Alex Thomas stated that Unity Day commemorations provide a valuable opportunity for the nation to reflect upon its past and collectively plan for a brighter future.\n\nThis is an important part of our country where we chose peace and national cohesion. This Unity Accord marks a significant step towards healing the divisions that once threatened to tear us apart, said Archbishop Thomas.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/06/Minister-Judith-Ncube.jpg",
            "description": "Nqobile Tshili, Bulawayo Bureau ZIMBABWE’S Unity Accord commemorations should not be viewed solely through political lens, but should also address family dynamics amid rising concerns over discord among relatives, increasing divorce rates, and family members harming each other over minor issues, a top Government official has said. Bulawayo Provincial Affairs and Devolution Minister Judith Ncube […]",
            "time": "06:28",
            "date": "24 Dec 2024"
        },
        {
            "title": "First Lady rallies communities to protect endangered species",
            "url": "https://www.herald.co.zw/first-lady-rallies-communities-to-protect-endangered-species/",
            "content": "Tendai Rupapa, Senior Reporter\n\nENVIRONMENT and wildlife patron First Lady Dr Auxillia Mnangagwa has reiterated the need for people to protect endangered species so that they are not at a high risk of becoming extinct.\n\nDr Mnangagwa said this when she received a female pangolin from Headman Clive Makusha Chimbi of Mvuma, for onward transmission to the Zimbabwe Parks and Wildlife Management Authority (ZimParks), in her capacity as the patron.\n\nAmai Mnangagwa, an avid environmentalist, recently launched the Pangolin Conservation Strategy and Action Plan in Manicaland.\n\nThe plan was developed to guide and coordinate actions for the effective conservation of this threatened and highly trafficked animal.\n\nThe First Lady said protecting endangered species was a complex issue that requires a multifaceted approach.\n\nDr Mnangagwa took time to raise awareness on anti-poaching in order to protect wildlife for posterity and for the preservation of the countrys rich cultural heritage.\n\nI received a call from Headman Chimbi from Chirumhanzu where I was a Member of Parliament. He informed me that he had come across a pangolin in his community which he wanted to hand over to me as the patron of wildlife.\n\nI then invited ZimParks representatives so that I could hand it over to them for safekeeping. He has brought the pangolin which is pregnant.\n\nIn our country, we value pangolins which are integral parts of cultures, traditions, and folklore. Therefore, they should be protected, she said.\n\nEnvironment and Wildlife patron First Lady Dr Auxillia Mnangagwa admires a pangolin she received from Chief Chimbi for onward transmission to ZimParks for safe keeping\n\nShe thanked Headman Chimbi and his community for protecting the pangolin.\n\nDai vari vamwe vakatouraya mhuka iyi kana kuidya, but they did not because they know its value and importance. I really want to thank you. Protecting and conserving our diverse wildlife populations is essential for maintaining healthy ecosystems and preserving our natural heritage.\n\nBy working together at all levels, nurturing our environment, protecting our wildlife and embracing sustainable practices, we can build a sustainable and resilient future for our planet and future generations.\n\nHatifanire kupedza nhoroondo yekuti vana vedu vachauya vazodzidza kubva mairi; pangolins should be protected for the benefit of future generations. I am happy that ZimParks officials noticed that the pangolin is pregnant, meaning there will be more of them, she said.\n\nForestry management and wildlife conservation, the First Lady said, were closely intertwined with sustainable development and the preservation of biodiversity.\n\nDr Mnangagwa handed over the animal to ZimParks and pledged her commitment to always check on it.\n\nAfter handing over the threatened and highly trafficked animal to the First Lady, Headman Chimbi commended the mother of the nation for her stance with regard to the protection of the environment and wildlife.\n\nHe said as communities, they were learning a lot from the First Ladys teachings.\n\nI am happy that Amai as the wildlife patron has accepted to receive this animal and hand it over to the relevant authorities. I came across this animal in my area of jurisdiction.\n\nKnowing that this animal is important and that it is a crime to keep it, kill, sell or consume it, I decided to give it to Amai so that she can give it to those who are trained to look after it.\n\nAs traditional leaders, we actually frown upon people who kill pangolins, imhosva hombe.\n\nWe are thankful to Amai for her awareness campaigns countrywide on environment and wildlife preservation, he said.\n\nThe female pangolin which Environment and Wildlife patron First Lady Dr Auxillia Mnangagwa received yesterday at Zimbabwe House from Headman Chimbi\n\nHead of Security and Investigations in the Ministry of Environment and Wildlife under ZimParks, Mr Philemon November, paid tribute to Amai Mnangagwa for her dedication and passion to preserve the countrys wildlife for future generations and for ensuring that the natural resources are given special attention.\n\nHe added that the step taken by Headman Chimbi was a significant milestone in the conservation efforts, and it shows that communities are alive to the issues pertaining to the protection of natural resources.\n\nOn behalf of the director-general, I would want to thank Amai, Dr Auxillia Mnangagwa, for a sterling job in making sure that the natural resources of Zimbabwe are given special attention and conservation takes its centre stage so that we minimise unwanted destruction of the ecosystem services through poaching and illegal wildlife trafficking.\n\nIn that regard, she has taken it upon herself through what I would term political will at the same time, where she has gone out there to conscientise all the communities of Zimbabwe to be knowledgeable on the fundamentals of protecting our natural heritage, which we have seen today culminating into Headman Chimbi vabva kuChivhu, coming all the way to Harare to hand over a specially protected animal in the form of a pangolin, he said.\n\nHe added that in Zimbabwe, there is the ground pangolin, which is what the headman brought to the First Lady.\n\nThis is a significant milestone in our conservation efforts. It then goes to show that the communities are very much aware and very much alive to the protection of our natural resources.\n\nPangolins are categorised as specially protected animals. They are in the same category with rhinos, our cheetahs, and our spotted hyenas.\n\nWe do have a scenario where these animals are given specialist attention in terms of protection because of their numbers and poaching that will have taken a centre-stage worldwide or in our natural range state.\n\nWhere we need to give them special protection unless if that is not taken into consideration they will go into extinction.\n\nSo under CITES, the Convention on International Trade in Endangered Species of Wild Flora and Fauna, animals are categorised, he said.\n\nMr November added that if anybody is arrested with a pangolin, for purposes of selling it or moving it without a permit, that person is arrested and charged under the relevant statutes.\n\nUpon conviction, one is sentenced to a minimum mandatory jail term of nine years because the idea is to make sure that we prevent would-be offenders from continuing to perpetuate their heinous crimes, which will lead us into a paper park without any animals thriving in the ecosystem services, he said.\n\nThe female pangolin which Environment and Wildlife patron First Lady Dr Auxillia Mnangagwa received yesterday from Headman Chimbi placed in a ZimParks cage and ready for safe keeping\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/FL1-2.jpg",
            "description": "Tendai Rupapa, Senior Reporter ENVIRONMENT and wildlife patron First Lady Dr Auxillia Mnangagwa has reiterated the need for people to protect endangered species so that they are not at a high risk of becoming extinct. Dr Mnangagwa said this when she received a female pangolin from Headman Clive Makusha Chimbi of Mvuma, for onward transmission […]",
            "time": "06:28",
            "date": "24 Dec 2024"
        },
        {
            "title": "EDITORIAL COMMENT: Parole system will transform offenders",
            "url": "https://www.herald.co.zw/editorial-comment-parole-system-will-transform-offenders/",
            "content": "Zimbabwe is moving ahead into the next stage of prison reform with the establishment of a parole system overseen by a State Parole Board, but needing the Zimbabwe Prisons and Correctional Service to be able to accurately measure just which individual prisoners have met the set parole criteria and to what extent.\n\nThe legal framework was approved by Parliament recently with a new Prisons and Correctional Services Act, and now the Ministry of Justice, Legal and Parliamentary Affairs and the Zimbabwe Prisons and Correctional Service are converting this outline to a detailed system, a process that is likely to need special training for some staff plus provision of certain facilities.\n\nProperly implemented, a parole system reduces pressure on a prison system, by allowing the better behaved prisoners who have been showing cooperation in their reform to be released early, although those who are reluctant to move towards reform will stay inside for their full term.\n\nThere will also be different parole standards for each type of crime, with violent criminals more likely having to wait longer for parole.\n\nPrisoners out on parole are supervised, while they can enjoy a fair amount of freedom and return to their families and a relatively normal world, and will be encouraged to be productive and be earning their living, they will still have to report regularly to a designated officer and keep the authorities posted about where they live and who with, and probably need permission to change their address.\n\nThe sentence for a paroled prisoner still stands right to end of the term set by the courts, and is not reduced.\n\nBut what parole means is that the prisoner can be released, on set conditions, from prison earlier although still under sentence.\n\nBut in all jurisdictions where parole has been set up, the minute a paroled prisoner breaks the conditions, or commits any sort of new crime, back they go behind bars for the rest of the sentence, plus any new sentence that a new crime might bring.\n\nUp to now extreme overcrowding in Zimbabwean prisons has been fixed with periodic blanket amnesties by the President using his prerogative of mercy.\n\nThis is in fact a Cabinet decision, almost always on the advice of the Minister of Justice, Legal and Parliamentary Affairs.\n\nThese blanket amnesties reduce all sentences in the listed categories of offences, regardless of how cooperative or uncooperative a prisoner has been, and how likely they are to commit new offences on release.\n\nThe weakness of this approach of one size fits all has been seen with the fact that a significant minority of the early released do return to crime quite quickly, although a majority appear to have learned their lessons and keep themselves clean.\n\nA parole system gets round these problems and many of the dangers by treating each prisoner as an individual, rather than as a member of a batch of convicted criminals.\n\nThe standards and the way of measuring how far a prisoner has met those standards must, obviously, be fairly applied and so be common for all. But once the measurements have been done the assessments are of individuals.\n\nIn most jurisdictions prison officers have to make many of the initial reports of how a prisoner is behaving and how far they are along the road of reform.\n\nThey can be helped by properly skilled others, but generally they are the ones on the spot who see the prisoners every day and so their judgment is usually sound, although they usually need extra training, especially when it comes to measuring the degree of meeting the parole standards.\n\nThe State Parole Board itself needs to be formed of independent people with the right sort of background and able to make sensible decisions that fit the facts presented to the board.\n\nThis is always a tricky process, since each prisoner is an individual, and often a board has to ask the victims, or families of the victims, of the crimes that led to jail terms what they think.\n\nThere will also need to be other measures to make up the system including parole officers or their equivalent, the people that a paroled prisoner must report to at set intervals and who keeps track of the paroled prisoner, raise the alarm if something is going wrong and generally overseeing the paroled persons reintegration into society.\n\nZimbabwe is moving further in having community correctional centres, a sort of half-way house between a prison and total freedom.\n\nThe State Parole Board will also be able to implement a parole in stages, allowing a prisoner to be released for example during the day, but returning to custody at night, although such a prisoner can obviously be kept in a very low-security environment since they are so unlikely to escape.\n\nZimbabwe has been moving ahead since independence on changing the whole system of prisons, placing far less stress on punishment, although that is obviously a factor, and placing more stress on reforming a criminal so they do not revert to crime on their release.\n\nWe have also been looking at alternatives to prison, at least for non-violent crime, so we have those prison sentences in many cases suspended so long as non-violent thieves and others perform community service and make restitution where property has been damaged or stolen; the double condition is normally required to avoid incarceration.\n\nAs we know from what judges and magistrates say when passing sentence, some criminals need to be locked up to protect the rest of us, generally when they have committed so terrible a violent crime or are a multiple repeat offender.\n\nThis is why in most countries where the death penalty has been abolished a judge, backed by an appeal court, can hand out a whole life sentence, where there is no possibility of parole. That is rare but the option is needed for exceptionally terrible killings.\n\nPrisoners who reoffend either on parole or after they have moved from prison or parole to normal freedom not only are hit by any suspended sentences for past crime, and the usually longer term for a repeat crime, but are less likely to impress a parole board that they should be released early.\n\nOften parole at this stage relies on the prisoner being too old to commit any sort of crime.\n\nSo parole is not a soft option. What it does do is reward prisoners making a determined effort to reform and committed to living a future crime-free life, and decongests prisons by releasing, on condition and under supervision, those who are highly unlikely to reoffend having learned their lesson.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/03/Minister-Ziyambi.jpg",
            "description": "Zimbabwe is moving ahead into the next stage of prison reform with the establishment of a parole system overseen by a State Parole Board, but needing the Zimbabwe Prisons and Correctional Service to be able to accurately measure just which individual prisoners have met the set parole criteria and to what extent. The legal framework […]",
            "time": "06:28",
            "date": "24 Dec 2024"
        },
        {
            "title": "How to have a Happy Healthy Christmas, New Year",
            "url": "https://www.herald.co.zw/how-to-have-a-happy-healthy-christmas-new-year/",
            "content": "Prof Francisca Mutapi, Correspondent\n\nAs for many people around the world, for Zimbabweans Christmas and New Year are times for family and friends to get together to catch up exchanging news, stories, gifts and sharing meals.\n\nAll age groups will be getting together with most people travelling to their rural homes, where festivities will ensue and many city folk will have the opportunity to tend their land and livestock, taking advantage of the recent rains and the availability of manpower. While this gathering of many people in the same place at the same time is a welcome tradition, it is also conducive to unwelcome guests, infectious diseases that are transmitted from person to person.\n\nIt is not uncommon to have bouts of diarrhoea, colds, flu and other diseases during such gatherings. Furthermore, for people in rural or resort areas with freshwater bodies such as rivers and lakes, it is critical to avoid exposure to water-borne pathogens such as cholera, giardia, cryptosporidium or bilharzia.\n\nWe know from studies in places such as Malawi and South Africa that when people mix, diseases spread. The COVID-19 pandemic also taught us that this is particularly the case when people travel from different areas where a disease may be more prevalent. The good news is that it is possible to reduce the risk of infection through simple relatively cheap infection prevention steps. These include following good sanitation and hand hygiene, good personal hygiene, use of clean water, cooking food carefully and avoiding sharing medication.\n\nFirst is good sanitation and hand hygiene. The use of toilets is a critical component of infection prevention. Zimbabwe is known globally for the development of the pit latrine which was developed for rural homesteads.\n\nUse of toilets protects people many diseases including cholera, dysentery and diarrhoea as it means faecal matter is safely disposed and susceptible people will not come into contact with these diseases. Related to this is hand hygiene, which means washing hands after using the toilet and before touching of eating food.\n\nHand washing can be done with water and soap. In the absence of soap, it has been suggested that people may use other materials like ash (the solid remains from cooking stoves and fires) with water.\n\nDuring the COVID-19 pandemic people also became accounted to using hand sanitisers dispensing alcohol that can be used without water.\n\nPersonal hygiene stops you from both catching and spreading diseases. In addition to hand hygiene, it includes cleaning your body every day, brushing teeth, covering your mouth and nose with a tissue (or your sleeve) when sneezing or coughing and washing your hands after handling pets and other animals and before eating or preparing food.\n\nThe water used for personal hygiene, drinking, cooking and other domestic chores needs to be safe.\n\nIn the absence of mains treated water it is important to treat water domestically through the normal practices of chlorination or boiling water. In rural areas it is preferable to avoid using river water for domestic chores and washing.\n\nThis is not always practical, but river water can be treated for bilharzia by heating on a fire until it is too hot to touch or by storing the water for at least 12 hours (longer in cooler weather).\n\nFood borne disease such as food poisoning and infections including those caused by parasitic worms such as tapeworms and trematodes are common in Africa.\n\nTo avoid these it is important to wash fruits, vegetables, and salad with safe water as well as to cook vegetables and meat to destroy harmful micro-organisms.\n\nUndercooked meat, for example pork, can carry parasitic infections that can cause serious illness including epilepsy.\n\nIf you are unfortunate to become unwell, it is important to avoid self-treatment for serious illness; you should seek medical care to avoid wrong diagnosis and wrong treatment. Furthermore, it is important to obtain medication from a registered pharmacy and not to share or use leftover or out-of-date drugs.\n\nFollowing this will ensure sick people receive medicine that works and not inappropriate medication or an incorrect dosage.\n\nAdhering to these steps will ensure that you have a happy and healthy Christmas and New Year break.\n\nFrancisca Mutapi is a Professor in Global Health Infection and Immunity. and co-Director of the Global Health Academy, University of Edinburgh.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/vege.jpg",
            "description": "Prof Francisca Mutapi, Correspondent As for many people around the world, for Zimbabweans Christmas and New Year are times for family and friends to get together to catch up exchanging news, stories, gifts and sharing meals. All age groups will be getting together with most people travelling to their rural homes, where festivities will ensue […]",
            "time": "06:28",
            "date": "24 Dec 2024"
        },
        {
            "title": "Boterekwa stretch: A haven for armed robbers",
            "url": "https://www.herald.co.zw/boterekwa-stretch-a-haven-for-armed-robbers/",
            "content": "Freedom Mupanedemo, Midlands Bureau\n\nTo many cross-border truckers, the Boterekwa Pass, a 6km winding mountain stretch into Shurugwi town, is notorious for treacherous bends that lead to accidents and vehicle failures.\n\nWhether ascending or descending, drivers must exercise extreme caution, ensuring their engines are in good condition.\n\nDay in and day out, heavy trucks struggle to negotiate the steep ascent, often crawling at a snails pace. Some fail to complete the bend, experiencing engine failures at various stages, while others lose their brakes, resulting in crashes. Fatal incidents, including haulage trucks jackknifing, are not uncommon. The area is filled with the sounds of banging and crushing metal.\n\nCertain spots along the pass have earned ominous names like Danger, Wafa wafa, and Red Zone. Its typical to encounter two or three broken-down haulage trucks during a journey through the Boterekwa Pass. The situation has worsened due to illegal mining activities that have damaged the road infrastructure.\n\nThis precarious environment has become a new haven for armed robbers, who exploit the vulnerabilities of stuck trucks and accidents to rob drivers or steal goods. They patrol the area at night, approaching stranded drivers and threatening them with knives and guns.\n\nMr Romeo Shangwa, the Shurugwi District Development Coordinator, noted the alarming rise in crime along the pass.\n\nWe have had some worrisome reports along the Boterekwa Pass of late, with armed robbers patrolling the area and robbing truck drivers who are in their broken-down trucks. They also ransack trucks and loot goods.\n\nShangwa recounted a particularly harrowing experience of a motorist whose truck became stuck on the pass.\n\nThe robbers were reportedly armed with guns and robbed their victim before forcing him to do some push-ups.\n\nOne victim, Mr Runesu Mbalekwa, described his terrifying encounter on the night of November 3. After his truck failed to ascend the pass, he was attacked.\n\nI was on my way to Chirundu from Johannesburg when I got stuck at Boterekwa. When I reported the fault back in South Africa, I remained at the scene. At midnight, I was awakened by a harsh knock on the drivers door, only to realise I was being robbed. They took all the cash I had and ransacked my truck, leaving me stranded.\n\nLocal villager Mr Aron Marufu added that gunshots are often heard at night, as robbers intimidate their victims by firing into the air.\n\nMy homestead is at the foot of Boterekwa mountain, and if accidents occur, we are the first to hear and witness them. Of late, we have been hearing gunshots, with robbers now patrolling the area before robbing motorists.\n\nIn response to the growing threat, Shurugwi police have initiated patrols along the Boterekwa Pass to deter robberies and enhance the safety of motorists. The local community hopes these efforts will restore a sense of security in the area, which has become increasingly perilous for truck drivers.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Boterekwa.jpg",
            "description": "Freedom Mupanedemo, Midlands Bureau To many cross-border truckers, the Boterekwa Pass, a 6km winding mountain stretch into Shurugwi town, is notorious for treacherous bends that lead to accidents and vehicle failures. Whether ascending or descending, drivers must exercise extreme caution, ensuring their engines are in good condition. Day in and day out, heavy trucks struggle […]",
            "time": "06:28",
            "date": "24 Dec 2024"
        },
        {
            "title": "Suspected robber appears in court for rape",
            "url": "https://www.herald.co.zw/suspected-robber-appears-in-court-for-rape/",
            "content": "Yeukai Karengezeka, Court Correspondent\n\nAndrew Tinokunda Munemo, a suspected robber from Harare, has appeared in court facing charges of robbery and rape.\n\nHe allegedly hired a sex worker, only to rob and assault her on their way to his residence. During a session before Harare regional magistrate Mr Taurai Manuwere, Munemo was advised to seek bail from the High Court.\n\nProsecutor Mr Lancelot Mutsokoti said the incident occurred on December 15 at around 10pm.\n\nMunemo met the 33-year-old complainant at Liz Bar in Harares Central Business District, where he solicited her services.\n\nAfter the lady agreed to his request, they boarded a kombi allegedly to his place of residence.\n\nInstead of taking her home, Munemo led her to a secluded area in Retreat Farm, Waterfalls, Harare.\n\nThere, he allegedly attacked the complainant by grabbing her neck from behind and threatening her with a knife.\n\nHe then demanded her valuables and ordered her to undress.\n\nOut of fear, the complainant complied, surrendering her Huawei cellphone, handbag, US$59 in cash, and clothing.\n\nMunemo then raped her without protection.\n\nAfter the assault, he took her belongings and fled the scene, leaving the complainant behind. The court proceedings are ongoing.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/12/court-hammer.jpg",
            "description": "Yeukai Karengezeka, Court Correspondent Andrew Tinokunda Munemo, a suspected robber from Harare, has appeared in court facing charges of robbery and rape. He allegedly hired a sex worker, only to rob and assault her on their way to his residence. During a session before Harare regional magistrate Mr Taurai Manuwere, Munemo was advised to seek […]",
            "time": "06:28",
            "date": "24 Dec 2024"
        }
    ]
}