{
    "news": [
        {
            "title": "NSSA acting CEO trial set for March 14",
            "url": "https://www.herald.co.zw/nssa-acting-ceo-trial-set-for-march-14/",
            "content": "Prosper Dembedza\n\nHerald Correspondent\n\nHarare regional magistrate Mr Taurai Manuwere has set March 14 as the trial date for National Social Security Authority (NSSA) acting chief executive officer, Charles Shava.\n\nShava is facing allegations of unprocedurally awarding the Authoritys four doctors some allowances that had been turned down by the board.\n\nIt is the States case that on October 18, 2022, the NSSA human resources committee held a meeting and Shava tabled a proposal to increase NSSA doctors remuneration through some allowances.\n\nThe NSSA medical doctors were supposed to be awarded 20 percent call allowances, 25 percent risk medical allowance, 50 percent non-practicing allowance, and 20 percent special skills retention allowance.\n\nThe court heard that on November 8, 2022, NSSA held a board meeting and the chairperson of the human resources committee tabled Shavas proposal.\n\nAccording to the State, the board approved the retention allowance but turned down the other three proposed allowances.\n\nOn December 20, 2022, Shava allegedly generated a memorandum addressed to the chairperson of the human resources committee and fraudulently added the allowances that had been turned down by the board.\n\nShava allegedly instructed the acting director of human resources to effect payment of the allowances for the four doctors.\n\nThe court heard that on February 14, 2023, Ms Tambudzai Jongwe, the acting director of human resources, wrote an email to Shava seeking further clarification on why he had instructed her to pay the allowances without the approval of the NSSA finance committee and the board.\n\nOn the same day, Shava allegedly responded to Ms Jongwe, instructing her to proceed with the payments with effect from January 1, 2023.\n\nIt is said he told Ms Jongwe that her concerns had been fully addressed by the full board.\n\nActing upon the misrepresentation, Ms Jongwe effected the payments of the four doctors allowances totalling $12 246 571,48.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/09/fdcsd.jpg",
            "description": "Prosper Dembedza Herald Correspondent Harare regional magistrate Mr Taurai Manuwere has set March 14 as the trial date for National Social Security Authority (NSSA) acting chief executive officer, Charles Shava. Shava is facing allegations of unprocedurally awarding the Authority’s four doctors some allowances that had been turned down by the board. It is the State’s […]",
            "time": "21:06",
            "date": "06 Mar 2025"
        },
        {
            "title": "ZimParks fights for Hwange’s black rhinos’ protection zone",
            "url": "https://www.herald.co.zw/zimparks-fights-for-hwanges-black-rhinos-protection-zone/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nThe Zimbabwe Parks and Wildlife Management Authority (ZimParks) has opposed a proposed mining project targeting the Sinamatella Black Rhino Intensive Protection Zone in Hwange National Park.\n\nZimParks has called on the Ministry of Mines and Mining Development to reject such applications.\n\nThe Authoritys spokesperson, Mr Tinashe Farawo said allowing mining in the ecologically sensitive area will pose a threat to the endangered black rhino population, disrupt wildlife habitats and undermine Zimbabwes reputation as a leader in sustainable conservation.\n\nThis area is home to a growing population of black rhinos, which are listed under CITES Appendix 1 as critically endangered, he said.\n\nAny mining activity will not only increase the risk of extinction but also set back all conservation efforts made over the years.\n\nHwange National Park, which boasts Africas second-largest elephant population, also faces risks from potential groundwater disruption, which could worsen existing water shortages.\n\nTourists visit Hwange to experience its rich wildlife. Pollution, noise, and habitat destruction caused by mining will ruin the visitor experience and harm Zimbabwes tourism industry, Mr Farawo said.\n\nWe will not stand by and allow wildlife habitats to be destroyed. Our duty is to protect these lands for the benefit of all Zimbabweans and future generations, he said.\n\nSinamatella is also home to the historic Bumbusi Monument, a culturally significant site for the local Nambia-speaking communities.\n\nTraditional leaders conduct annual rainmaking ceremonies there, and locals feel that mining activities could disrupt these sacred rituals.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/11/849A5282.jpg",
            "description": "Ivan Zhakata Herald Correspondent The Zimbabwe Parks and Wildlife Management Authority (ZimParks) has opposed a proposed mining project targeting the Sinamatella Black Rhino Intensive Protection Zone in Hwange National Park. ZimParks has called on the Ministry of Mines and Mining Development to reject such applications. The Authority’s spokesperson, Mr Tinashe Farawo said allowing mining in […]",
            "time": "21:06",
            "date": "06 Mar 2025"
        },
        {
            "title": "Lake Chivero: Fishing ban remains in place pending investigations into fish deaths",
            "url": "https://www.herald.co.zw/lake-chivero-fishing-ban-remains-in-place-pending-investigations-into-fish-deaths/",
            "content": "Sifelani Tsiko\n\nInnovations Editor\n\nZimbabwe Parks and Wildlife Management Authority (ZimParks) has said the ban on fishing activities at Lake Chivero will remain in place until investigations are complete.\n\nLast December, the Government banned fishing activities at Lake Chivero after four white rhinos, three zebras, several wildebeest, four fish eagles, livestock, and countless fish died after consuming the lakes contaminated water.\n\nEnvironmentalists blamed raw effluent and other industrial discharges from the capitals households and business entities.\n\nBecause of the good rains, the algae is clearing and there have been some improvements in the aquatic conditions for fish. However, the ban on fishing still stands, ZimParks spokesman, Mr Tinashe Farawo said.\n\nWe are waiting for the results of further tests that were done. There was a committee that was set up.\n\nHeavy pollution, overfishing and destructive fishing practices have caused irreversible damage to aquatic species and their habitats.\n\nApart from the ban on fishing and fish sales at Lake Chivero, there is ongoing research on biological remediation techniques, including the use of effective microorganisms, to rehabilitate contaminated areas within Lake Chivero.\n\nLake Chivero, formerly known as Lake McIlwaine, was built in 1952 to provide water for Harare.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/04/ZimParks.jpg",
            "description": "Sifelani Tsiko Innovations Editor Zimbabwe Parks and Wildlife Management Authority (ZimParks) has said the ban on fishing activities at Lake Chivero will remain in place until investigations are complete. Last December, the Government banned fishing activities at Lake Chivero after four white rhinos, three zebras, several wildebeest, four fish eagles, livestock, and countless fish died […]",
            "time": "21:06",
            "date": "06 Mar 2025"
        },
        {
            "title": "Zanu PF expels Blessed Geza",
            "url": "https://www.herald.co.zw/zanu-pf-expels-blessed-geza/",
            "content": "Online Reporter\n\nZanu PF has expelled Central Committee member and war veteran Blessed Geza with immediate effect, the partys secretary for legal affairs, Cde Patrick Chinamasa, has announced.\n\nCde Chinamasa said the decision was made following internal party processes.\n\nLast month, the ruling partys Mashonaland West Province unanimously recommended Gezas expulsion from the party, while the partys War Veterans League also denounced him for attacking the partys leadership.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Geza.jpg",
            "description": "Online Reporter Zanu PF has expelled Central Committee member and war veteran Blessed Geza with immediate effect, the party’s secretary for legal affairs, Cde Patrick Chinamasa, has announced. Cde Chinamasa said the decision was made following internal party processes. Last month, the ruling party’s Mashonaland West Province unanimously recommended Geza’s expulsion from the party, while […]",
            "time": "21:06",
            "date": "06 Mar 2025"
        },
        {
            "title": "Government allays cholera fears in Chiredzi",
            "url": "https://www.herald.co.zw/government-allays-cholera-fears-in-chiredzi/",
            "content": "George Maponga in Masvingo\n\nThe Government has refuted reports of a cholera outbreak in Chiredzi.\n\nFollowing the reports that have been circulating since early this week, the Ministry of Health and Child Care had to conduct tests on suspected patients.\n\nThe Provincial Health Services administrator in the Ministry of Health and Child Care, Mr Samson Nyoni, said the tests had come out negative.\n\nWe received reports of a suspected cholera outbreak in Chiredzi and our teams on the ground went there and did tests. The results came out negative, he said.\n\nMr Nyoni said his team has a district task force in place to respond swiftly to emergencies such as cholera outbreaks, as the disease can spread quickly if not managed properly\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/06/Cholera.jpg",
            "description": "George Maponga in Masvingo The Government has refuted reports of a cholera outbreak in Chiredzi. Following the reports that have been circulating since early this week, the Ministry of Health and Child Care had to conduct tests on suspected patients. The Provincial Health Services administrator in the Ministry of Health and Child Care, Mr Samson […]",
            "time": "21:06",
            "date": "06 Mar 2025"
        },
        {
            "title": "Harare Poly students off to China",
            "url": "https://www.herald.co.zw/harare-poly-students-off-to-china/",
            "content": "Online Reporter\n\nHigher and Tertiary Education, Innovation, Science and Technology Development Deputy Minister Simelizizwe Sibanda is today presiding over the send-off ceremony for 30 Harare Polytechnic College students who will be travelling to China under the Applied Talent Joint Teaching Programme.\n\nThe ceremony is being held at the Harare Polytechnic College.\n\nThis is the third group of Harare Polytechnic students who have received scholarships to study Mechatronics at Ningbo Polytechnic in China since 2023.\n\nIn attendance are representatives from the Chinese Embassy and the Ningbo Polytechnic in China, members of staff from the Engineering Department, Mechatronics students and their families.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/fef2f-680x380.jpg",
            "description": "Online Reporter Higher and Tertiary Education, Innovation, Science and Technology Development Deputy Minister Simelizizwe Sibanda is today presiding over the send-off ceremony for 30 Harare Polytechnic College students who will be travelling to China under the Applied Talent Joint Teaching Programme. The ceremony is being held at the Harare Polytechnic College. This is the third […]",
            "time": "21:06",
            "date": "06 Mar 2025"
        },
        {
            "title": "Ten men to be charged with raping 14-year-old girl",
            "url": "https://www.herald.co.zw/ten-men-to-be-charged-with-raping-14-year-old-girl/",
            "content": "Fungai Lupande\n\nMashonaland Central Bureau\n\nThe prosecution at Shamva Magistrate Court is pursuing a case of sexual exploitation after 10 men had sex with a 14-year-old girl.\n\nHowever, the State, represented by Mr Munyaradzi Nengomasha and Ms Kudakwashe Chirairo, made an application for the docket to be referred to the Prosecutor-Generals office for the charge to be changed to rape.\n\nMr Nengomasha said the complainant indicated that she had not consented to the sexual activities.\n\nThe complainant sat for Grade 7 exams last year.\n\nOne of the accused persons appeared before the Shamva magistrate, Ms Ruramai Chitumbura, on Wednesday. He pleaded not guilty.\n\nDefence counsel, Mr Munyaradzi Mataranyika of Kajokoto and Company Legal Practitioners, alleged that the complainant used to frequent the Liquid Lounge as a sex worker.\n\nMr Mataranyika told the court that the girls mother had made several reports to community-based childcare workers that her child had become uncontrollable and sometimes spent nights away from home.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/f23-680x380.jpg",
            "description": "Fungai Lupande Mashonaland Central Bureau The prosecution at Shamva Magistrate Court is pursuing a case of sexual exploitation after 10 men had sex with a 14-year-old girl. However, the State, represented by Mr Munyaradzi Nengomasha and Ms Kudakwashe Chirairo, made an application for the docket to be referred to the Prosecutor-General’s office for the charge […]",
            "time": "21:06",
            "date": "06 Mar 2025"
        },
        {
            "title": "Bulawayo man arrested with 1,9kg crystal meth",
            "url": "https://www.herald.co.zw/bulawayo-man-arrested-with-19kg-crystal-meth/",
            "content": "Crime Reporter\n\nA 39-year-old Bulawayo man has been arrested after he was found in possession of 1,9kg of crystal meth, commonly known as mutoriro.\n\nThe man, Tigor Tyron Seigfried, is currently assisting the police with investigations.\n\nIn a statement, national police spokesperson, Commissioner Paul Nyathi confirmed the arrest.\n\nThe ZRP confirms the arrest of Tigors Tyron Seigfried, aged 39, in connection with unlawful possession of 1 900 grammes of crystal meth. The drugs were found in the suspects house along Chemford, Matsheumhlophe, Bulawayo, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/gdhsgs-680x380.jpg",
            "description": "Crime Reporter A 39-year-old Bulawayo man has been arrested after he was found in possession of 1,9kg of crystal meth, commonly known as mutoriro. The man, Tigor Tyron Seigfried, is currently assisting the police with investigations. In a statement, national police spokesperson, Commissioner Paul Nyathi confirmed the arrest. “The ZRP confirms the arrest of Tigors […]",
            "time": "21:06",
            "date": "06 Mar 2025"
        },
        {
            "title": "Kariba, Cahora Bassa hydro output primed for boost after heavy rains",
            "url": "https://www.herald.co.zw/kariba-cahora-bassa-hydro-output-primed-for-boost-after-heavy-rains/",
            "content": "Sifelani Tsiko\n\nInnovations Editor\n\nSteady inflow improvements into two of the SADC regions major reservoirs for hydroelectricity generation along the Zambezi River have brightened prospects for power generation until the last quarter of this year.\n\nZimbabwes largest hydroelectric plant, Kariba Dam and Mozambiques Cahora Bassa Dam have both accumulated significant inflows during the current season after experiencing reduced inflows following a drought in the previous season.\n\nAs a result of the drought, most southern African countries endured their worst rolling power cuts in years affecting the livelihoods of millions of people along the Zambezi River and other critical economic sectors.\n\nIn a recent media report, Cahora Bassa Hydroelectric Plant (HCB) board chairman, Toms Matola, said the reservoir in neighbouring Mozambique has an estimated storage level of 24,18 percent following significant inflows from upstream.\n\nLittle by little, we are emerging from the critical situation in which we find ourselves and which forced us to make major adjustments to our operational plan for the production of electrical energy from July of last year, with an impact on the reduction of exported electrical current, he was quoted saying at an event to mark the 50th anniversary of HCB.\n\nFortunately, with the rainfall that fell in February, we were able to recover and our hydro-meteorological forecasts show that more rain is coming and storage will naturally increase.\n\nImproved inflows in the Cahora Bassa reservoir, he said, could help improve electricity supply for the domestic and regional markets.\n\nEven if the levels remain as they are, there is no cause for alarm, because we have enough water to produce electricity without restrictions domestically, Matola said.\n\nNaturally, production would be lower and we would have less external revenue, but we would always have electricity for Mozambicans.\n\nApart from its domestic power needs, Cahora Bassa supplies electricity to South Africa and Zimbabwe.\n\nPlans are also afoot for Mozambique to supply Malawi as a power transmission line between Tete and Malawi is under construction.\n\nWater levels at Lake Kariba continue to rise gradually due to better rains, something which has raised hopes for improved hydro-power generation later in the year, latest statistics from the Zambezi River Authority (ZRA) show.\n\nKariba South Hydropower Station has since increased power generation to ease electricity shortages following the shutdown of two generators at the Hwange Thermal Power Station.\n\nFrom March 4 this week, Kariba has been generating a maximum of 485 MW, a significant increase from the 185 MW it had been producing over the past several months due to low water levels at Lake Kariba.\n\nKariba Dam is designed to operate between 475.50m and 488.50m and currently, the lakes water level is significantly lower than it was at the same time in 2024.\n\nAt present, the lake has 9,60 percent Usable Live Storage as at February 3, 2025, compared to 15,36 percent on the same date in 2024, the Zambezi River Authority (ZRA).\n\nThe dam which is jointly run by Zambia and Zimbabwe has a combined generating capacity of approximately 2,100MW while HCB has an installed capacity of 2,075MW.\n\nClimate change and a severe El Nino-induced drought experienced last year, have significantly hampered power production on the two major hydro stations along the Zambezi River.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2014/10/KARIBA-DAM.jpg",
            "description": "Sifelani Tsiko Innovations Editor Steady inflow improvements into two of the SADC region’s major reservoirs for hydroelectricity generation along the Zambezi River have brightened prospects for power generation until the last quarter of this year. Zimbabwe’s largest hydroelectric plant, Kariba Dam and Mozambique’s Cahora Bassa Dam have both accumulated significant inflows during the current season […]",
            "time": "21:06",
            "date": "06 Mar 2025"
        },
        {
            "title": "Borehole drilling scheme taken to Binga",
            "url": "https://www.herald.co.zw/borehole-drilling-scheme-taken-to-binga/",
            "content": "Raymond Jaravaza\n\nThe Secretary for War Veterans in the Zanu PF Politburo, Cde Douglas Mahiya, is set to be the guest of honour at the launch of a borehole and housing scheme under the Presidential War Veterans Fund in Binga this morning.\n\nThe initiative aims to improve access to clean water and housing for war veterans and their families. The event will take place at Ndaliyoka Shopping Centre in Ward 18, Tinde, and will be attended by several key dignitaries, including Matabeleland North Provincial Affairs and Devolution Minister Richard Moyo;\n\nPresidential Advisor, Dr Paul Tangwarara; and Minister of Veterans of the Struggle, Senator Monica Mavhunga.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/erger-680x380.jpg",
            "description": "Raymond Jaravaza The Secretary for War Veterans in the Zanu PF Politburo, Cde Douglas Mahiya, is set to be the guest of honour at the launch of a borehole and housing scheme under the Presidential War Veterans Fund in Binga this morning. The initiative aims to improve access to clean water and housing for war […]",
            "time": "21:06",
            "date": "06 Mar 2025"
        }
    ]
}