{
    "news": [
        {
            "title": "Zim graduate scoops Rhodes scholarship",
            "url": "https://www.herald.co.zw/zim-graduate-scoops-rhodes-scholarship/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nAn outstanding graduate in Pharmaceutical Chemistry from the University of Zimbabwe, Victoria Mudyanembwa, has been awarded the 2025 Rhodes Scholarship, earning her a fully funded opportunity to pursue postgraduate studies at the University of Oxford.\n\nMudyanembwa (24) joins an elite cohort of over 100 Rhodes scholars worldwide, selected for their exceptional academic achievements, leadership potential, and commitment to making a global impact.\n\nIt is an extraordinary honour, and I am deeply humbled to be part of such a prestigious community, Mudyanembwa said.\n\nI owe this to my family, friends, mentors, and supervisors, whose unwavering support has been instrumental in my journey.\n\nThe Rhodes Scholarship, established in 1903, is renowned for its competitive and meticulous selection process.\n\nThis year, only one scholarship was awarded to a Zimbabwean. Mudyanembwas academic prowess, combined with her dedication to utilising indigenous traditional medicine to make healthcare safer and more accessible, captured the committees attention.\n\nMr Dalumuzi Mhlanga, Zimbabwes Rhodes Trust National Secretary said Mudyanembwas achievement reflects the incredible talent Zimbabwe continues to produce.\n\nWe hope this inspires other young Zimbabweans to consistently excel across all the pillars of the scholarships criteria.\n\nMudyanembwas aspirations go beyond her studies.\n\nAt Oxford, she plans to pursue doctoral research focusing on leveraging emerging technologies to explore complex biology and medicine, with a special interest in enhancing the accessibility and safety of traditional medicine.\n\nI am excited to contribute to the global community, learn from brilliant minds, and make a positive impact on the world, she said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Screenshot-1-3-680x380.png",
            "description": "Ivan Zhakata Herald Correspondent An outstanding graduate in Pharmaceutical Chemistry from the University of Zimbabwe, Victoria Mudyanembwa, has been awarded the 2025 Rhodes Scholarship, earning her a fully funded opportunity to pursue postgraduate studies at the University of Oxford. Mudyanembwa (24) joins an elite cohort of over 100 Rhodes scholars worldwide, selected for their exceptional […]",
            "time": "21:26",
            "date": "27 Dec 2024"
        },
        {
            "title": "Types of Accidents You Need to Be Prepared For",
            "url": "https://www.herald.co.zw/types-of-accidents-you-need-to-be-prepared-for/",
            "content": "Life is unpredictable, and accidents often serve as harsh reminders of just how quickly things can change. While nobody wants to think about such situations, being prepared can make an enormous difference. Here in this article, I will discuss seven common types of accidents, and how you can protect yourself and your loved ones.\n\nDriving is a daily activity for many, but even the most seasoned driver isnt immune to the risks on the road. A split second of distractionwhether from texting, fatigue, or another drivers errorcan lead to disaster. Minor scrapes, as well as life-altering collisions, and car accidents, remain one of the leading causes of injuries worldwide.\n\nTo prepare, always keep your vehicle in top shape. Regularly check your brakes, tires, and lights. Practice defensive driving by maintaining a safe distance, signaling your turns, and being mindful of your speed. Be particularly cautious during bad weather or in areas with heavy traffic. Most importantly, never drive under the influence of alcohol or drugs.\n\nWhen it comes to sheer size and weight, commercial trucks dominate the roads. Sharing the highway with these massive vehicles requires heightened caution. The consequences of a collision involving a truck are often severe due to their size, and the aftermath can be life-altering.\n\nLarge trucks have significant blind spots, longer stopping distances, and limited maneuverability, making them prone to accidents if other drivers are careless. Always avoid lingering in a trucks blind spots, and give them ample room when theyre turning or merging.\n\nIn the unfortunate event of an accident, seeking professional legal advice is crucial. As noted by the Chopin Law Firm, Truck accidents often lead to devastating injuries due to the sheer size and weight of these vehicles. Acommercial truck accident lawyercan guide you through the complexities of legal and insurance claims. Knowing how to navigate this process can be a lifeline when things go wrong.\n\nCities with activity can be a breeding ground for accidents involving bicycles and pedestrians. Cyclists, in particular, are vulnerable due to their limited protection and reliance on other road users to follow traffic laws. Similarly, pedestrians face risks from distracted drivers, speeding vehicles, or unsafe crossings.\n\nIf youre a cyclist, invest in safety gear such as helmets, gloves, and reflective clothing. Always use bike lanes where available and stay vigilant for turning vehicles. Pedestrians should stick to designated sidewalks and crosswalks, avoiding distractions like looking at their phones while crossing streets.\n\nFor drivers, the responsibility lies in paying attention to the surroundings. Always check your blind spots, especially in densely populated areas. Reducing speed in pedestrian-heavy zones and being courteous to others on the road can prevent tragic outcomes. Thus, the shared responsibility among all parties can drastically lower the likelihood of such accidents.\n\nAccidents at work can happen in any setting, like at a corporate office or a high-risk construction site. Slippery floors, faulty equipment, and poor safety protocols can all lead to serious injuries. While employers are legally obligated to maintain safe working conditions, employees must also take proactive steps to protect themselves.\n\nTo minimize risks, always adhere to workplace safety guidelines. If you work in a physically demanding job, ensure youre trained to handle tools and machinery properly. In office environments, report hazards like loose wires or wet floors promptly. Basic safety practices, such as wearing protective gear or lifting heavy objects correctly, can go a long way.\n\nBeing prepared for workplace accidents also means knowing your rights. Familiarize yourself with workplace safety regulations and ensure your employer complies with them. Should an accident occur, documenting the incident thoroughly and seeking appropriate medical attention are critical steps to take.\n\nYour home should be your sanctuary, but its also one of the most common places for accidents to occur. Falls are particularly prevalent, especially among children and the elderly. Fires, electrical mishaps, and accidental poisoning from household chemicals are other frequent hazards.\n\nTo make your home safer, conduct regular inspections. Check for loose carpeting, unstable furniture, and exposed wires. Install handrails in staircases and ensure that rooms are well-lit to avoid tripping hazards. Smoke detectors and fire extinguishers should be present in every household, and everyone should know how to use them.\n\nFor families with young children, childproofing the home is essential. Keep cleaning supplies, medicines, and sharp objects out of reach. By taking these preventive measures, you can significantly reduce the risk of accidents and create a safer environment for everyone.\n\nSports and outdoor activities bring joy and excitement but also carry an inherent risk of injury. A sprained ankle during a casual game or a more serious injury in a competitive sport, the potential for accidents is always there.\n\nPreparation is key. Warm up before engaging in physical activity, and always use the right equipment. For example, wearing helmets, pads, or proper footwear can shield you from harm. Listen to your body and dont push yourself beyond your limits. Rest and recovery are just as important as training, and ignoring pain can lead to more severe injuries.\n\nIf youre a parent, encourage your children to practice safety while playing sports. Teach them the importance of teamwork and following rules to minimize unnecessary risks.\n\nNatural disasters are among the most devastating accidents, as they often strike without warning and leave widespread destruction in their wake. Earthquakes, hurricanes, floods, and wildfires can displace communities and claim lives in mere moments. While these events cant be prevented, preparation can make a significant difference in their aftermath.\n\nStart by creating an emergency kit. This should include essentials such as water, non-perishable food, flashlights, batteries, and a first-aid kit. Know the specific risks in your region and have an evacuation plan in place. Staying informed through weather alerts and local authorities can give you precious time to act.\n\nIn the face of such forces, the human spirit shines brightest through preparation. By equipping yourself with the tools and knowledge to face these challenges, you can safeguard not just your life but also your peace of mind.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/old-new.jpg",
            "description": "Life is unpredictable, and accidents often serve as harsh reminders of just how quickly things can change. While nobody wants to think about such situations, being prepared can make an enormous difference. Here in this article, I will discuss seven common types of accidents, and how you can protect yourself and your loved ones. Car […]",
            "time": "21:26",
            "date": "27 Dec 2024"
        },
        {
            "title": "Harare CBD property owners threaten legal action over Council neglect",
            "url": "https://www.herald.co.zw/harare-cbd-property-owners-threaten-legal-action-over-council-neglect/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nOwners of buildings in Harares Central Business District (CBD) have accused Mayor Jacob Mafume and the opposition-led city council of failing to address long-standing issues that are crippling businesses.\n\nThe disgruntled property owners, including prominent firms such as Mohammed Mussa, Bhika Brothers, Tselentis, and Dell Investments, have issued a petition and a strongly-worded letter to Mayor Mafume.\n\nThey are demanding action on excessive rates and taxes, inaccurate water bills, poor service delivery, traffic congestion, crime, and plummeting property values, among other concerns.\n\nThe group has given the mayor a 14-day ultimatum to address their grievances or risk legal action.\n\nIn the letter, the property owners said they have been raising the issues for more than six months without any tangible results.\n\nDespite holding two meetings with Mayor Mafume and council representatives, they claim that promises to review excessive rates and adjust credits retroactively have not been fulfilled.\n\nYou will recall we have had two meetings with you, and at both meetings, a representative from the City of Harare was present, read part of the petition.\n\nAt the meetings, it was agreed that the rates and taxes, in many cases, were excessive and that the matter would be addressed and corrected.\n\nConcerns were also raised about the impact of recent property valuations. Property owners argued that the values were inflated despite the evident degradation of the CBD, which has led to businesses relocating and leaving many buildings vacant.\n\nThe asset value of most of the properties has decreased substantially, and the resale/market value has dropped accordingly. Rental income is minimal, and the viability of properties is marginal. Accordingly, the City of Harare should not be increasing their valuations to maximise income.\n\nWith many businesses nearing their financial year-end, the property owners fear that overcharging by the council will negatively impact their accounts.\n\nMany businesses are nearing the end of their financial year, and the overcharging by the City of Harare will adversely affect the year-end accounts, read the petition.\n\nThe group has demanded an immediate resolution of the issues and warned that failure to act will leave them no choice but to seek legal recourse.\n\nEfforts to obtain a comment from Mayor Mafume were unsuccessful as the mayor read the questions sent via WhatsApp but did not respond to them, and did not also answer his phone.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/12/mafume-new-449x380.jpg",
            "description": "Ivan Zhakata Herald Correspondent Owners of buildings in Harare’s Central Business District (CBD) have accused Mayor Jacob Mafume and the opposition-led city council of failing to address long-standing issues that are crippling businesses. The disgruntled property owners, including prominent firms such as Mohammed Mussa, Bhika Brothers, Tselentis, and Dell Investments, have issued a petition and […]",
            "time": "21:26",
            "date": "27 Dec 2024"
        },
        {
            "title": "Lower Gweru man fatally stabbed in revenge attack",
            "url": "https://www.herald.co.zw/lower-gweru-man-fatally-stabbed-in-revenge-attack/",
            "content": "Midlands Bureau\n\nA 39-year-old man Nqobizitha Mazibuko from Lower Gweru died after he was fatally stabbed during a revenge attack on Christmas Eve.\n\nMidlands Provincial Police spokesperson Inspector Emmanuel Mahoko said the incident happened around 11 pm along a dust road leading from Madigane Business Centre in Madigane Village under Chief Sogwala.\n\nMazibukos assailants, identified as Thabani Mpofu, Nqabutho Bhebhe, and Nkosilathi, confronted him about a past assault, seeking revenge. Despite Mazibukos attempt to flee, the suspects chased after him and fatally stabbed him, he said.\n\nInsp Mahoko said an eyewitness tried to intervene but was unsuccessful.\n\nThe suspects fled the scene, leaving Mazibuko lying on the road. Mazibukos body was discovered around 5 am on Christmas Day, he said.\n\nInsp Mahoko said police from Maboleni attended the scene and are currently investigating the case.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/07/Inspector-Emmanuel-Mahoko.jpg",
            "description": "Midlands Bureau A 39-year-old man Nqobizitha Mazibuko from Lower Gweru died after he was fatally stabbed during a revenge attack on Christmas Eve. Midlands Provincial Police spokesperson Inspector Emmanuel Mahoko said the incident happened around 11 pm along a dust road leading from Madigane Business Centre in Madigane Village under Chief Sogwala. “Mazibuko’s assailants, identified […]",
            "time": "21:26",
            "date": "27 Dec 2024"
        },
        {
            "title": "Government wins battle against Cholera in Kariba",
            "url": "https://www.herald.co.zw/government-wins-battle-against-cholera-in-kariba/",
            "content": "Conrad Mupesa Mashonaland West Bureau\n\nThe Government through the Ministry of Health and Child Care and various stakeholders has managed to contain the cholera pandemic in Kariba district.\n\nThe district reported its first case in early November this year and recorded one death. To date, the district has recorded a total of 126 cases.\n\nMashonaland West medical director, Dr Celestino Dhege said a whole-societal approach had led to the positive outcome of the fight against the disease.\n\nThe recovery rate for those who tested positive is at 99 percent. No suspected case has been identified in the past five days after the last positive case.\n\nThe cholera outbreak started in Kariba at Gatche-Gatche area where a female aged 35 years old, was first treated as an outpatient and discharged, but later died at home after six hours.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/05/DHEGE-680x380.jpg",
            "description": "Conrad Mupesa Mashonaland West Bureau The Government through the Ministry of Health and Child Care and various stakeholders has managed to contain the cholera pandemic in Kariba district. The district reported its first case in early November this year and recorded one death. To date, the district has recorded a total of 126 cases. Mashonaland […]",
            "time": "21:26",
            "date": "27 Dec 2024"
        },
        {
            "title": "Customer relationship management graduates urged to prioritise ethical behavior",
            "url": "https://www.herald.co.zw/customer-relationship-management-graduates-urged-to-prioritise-ethical-behavior/",
            "content": "Tanyaradzwa Tanyanyiwa\n\nThe Chartered Institute of Customer Relationship Management celebrated its 11th graduation ceremony in Harare on December 17\n\nThe ceremony marked a significant milestone for the 25 graduands who have completed their studies in customer relationship management as they are now equipped to make a positive impact in their respective fields.\n\nIn his keynote address, the institutes executive director Dr Emmanuel Katsvamutima stressed the need for graduands to adapt to the ever-changing world.\n\nHe encouraged graduands to stay true to their values and principles while prioritising ethical behaviour in customer relationship management furnishing intelligence to drive innovation in healthcare\n\nLet us embrace challenges and opportunities while recognising that leadership is not just about achieving success but also about making a positive impact, he said.\n\nAs times are moving we need to be agile delivering services that meet evolving customer needs.\n\nLet us harness the power of artificial intelligence to revolutionise healthcare and improve patient outcomes.\n\n",
            "image_url": null,
            "description": "Tanyaradzwa Tanyanyiwa The Chartered Institute of Customer Relationship Management celebrated its 11th graduation ceremony in Harare on December 17 The ceremony marked a significant milestone for the 25 graduands who have completed their studies in customer relationship management as they are now equipped to make a positive impact in their respective fields. In his keynote […]",
            "time": "21:26",
            "date": "27 Dec 2024"
        },
        {
            "title": "Kunzvi Dam 56 percent complete",
            "url": "https://www.herald.co.zw/kunzvi-dam-56-percent-complete/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nThe construction of Kunzvi Dam in Mashonaland East is progressing well and has recorded remarkable progress in 2024, with the project now at 56 percent.\n\nKunzvi Dam, which is on the Nyagui River, which forms the boundary of Murehwa and Goromonzi Districts, is one of the dams targeted for completion in 2025.\n\nThe dam is expected to provide water for the irrigation of at least 500 hectares of land for surrounding communities in addition to providing water for domestic purposes for the expanding Juru Growth Point, Cross and Musami Business Centres as well as Majuru Business Centre in Goromonzi.\n\nIt is also envisaged to help ease water challenges in Harare by providing water for the capitals eastern suburbs.\n\nZimbabwe National Water Authority (ZINWA) head of corporate communications and marketing Mrs Marjorie Munyonga said work on the construction of the water treatment plant and the pipeline that is set to provide water to Harare is also in progress and at different levels of completion.\n\nMrs Munyonga said also underway and as part of the composite project was the design of a ministry hydroelectric plant that will provide power to local communities.\n\nCurrent works on site include placement of core material on both the left and right banks as well as the riverbed sedation where a total of 839 750 cubic metres of core material have been placed, she said.\n\nFill placement is also in progress on the left bank and on the riverbed section with a total of 507 920 cubic meters of fill. material having been placed to date.\n\nA total of 3 210 cubic metres of sand has also been placed on the left bank where a cumulative 14 225 cubic metres of riprap has also been placed.\n\nWork is also underway on the outlet tunnel where fixing of the 11 tonnes of 200 milimetre diameter steel is in progress together with the curing of the D tunnel walls.\n\nOther activities include the stripping of formwork on the intake tower and excavation of the borrow areas.\n\nMrs Munyonga said a total of 27 330 cubic metres of river sand was also stockpiled on site.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/featured_image-featured_image_thumb.jpg",
            "description": "Ivan Zhakata Herald Correspondent The construction of Kunzvi Dam in Mashonaland East is progressing well and has recorded remarkable progress in 2024, with the project now at 56 percent. Kunzvi Dam, which is on the Nyagui River, which forms the boundary of Murehwa and Goromonzi Districts, is one of the dams targeted for completion in […]",
            "time": "21:26",
            "date": "27 Dec 2024"
        },
        {
            "title": "Zanu PF Youth League urges Africa to unite against foreign exploitation",
            "url": "https://www.herald.co.zw/zanu-pf-youth-league-urges-africa-to-unite-against-foreign-exploitation/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nIn a passionate call for African unity, the Zanu PF Youth League has urged the continents leaders and citizens to reject foreign powers divisive agendas.\n\nSpeaking on the growing impact of external influence on African conflicts, Zanu PF Youth League deputy secretary for Commissariat, Cde Taurai Kandishaya said there was an urgent need for collective responsibility to safeguard the continents future.\n\nAfricans must awaken to the reality that conflicts within our continent are often ignited and fueled by foreign interests seeking to exploit our resources while leaving us divided, weakened and impoverished, he said.\n\nCde Kandishaya said Africas immense potential continued to be squandered due to strife and disunity, which are frequently orchestrated by external forces.\n\nHe pointed out how these forces benefit from the continents wealth while leaving behind destruction and economic stagnation.\n\nIt is time for us, as Africans, to reclaim our narrative, protect our sovereignty, and focus on building a continent rooted in peace, prosperity, and progress, Cde Kandishaya said.\n\nThe Zanu PF Youth League leader also backed the recent call by the SADC Chairman President Mnangagwa for Africa to unite and turn the continent into a hub of industrial and economic excellence.\n\nCde Kandishaya said industrialisation should be prioritised as a tool for development and self-reliance.\n\nWe must reject the destructive agendas imposed on us and embrace our collective responsibility to be each others keepers, brothers and sisters united by a shared destiny, he said.\n\nThe time is now for Africa to risenot through division but through unity, determination, and a collective commitment to our shared future.\n\nCde Kandishaya also encouraged African nations to invest in infrastructure, education, and good governance, highlighting the need for regional cooperation to address conflicts and foster economic integration.\n\nHis remarks come as Africa faces critical challenges, including resource-based conflicts, external debt dependency, and economic underdevelopment.\n\nCde Kandishayas call to action was seen as a rallying cry for a renewed commitment to Pan-Africanism and the continents industrial and economic transformation.\n\nAs the continent looks to the future, leaders across Africa are challenged to heed voices like Cde Kandishayas and work collectively to reject external manipulation and embrace a vision of unity, peace, and progress.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/07/ZANU-PF-1.jpeg",
            "description": "Ivan Zhakata Herald Correspondent In a passionate call for African unity, the Zanu PF Youth League has urged the continent’s leaders and citizens to reject foreign powers’ divisive agendas. Speaking on the growing impact of external influence on African conflicts, Zanu PF Youth League deputy secretary for Commissariat, Cde Taurai Kandishaya said there was an […]",
            "time": "21:26",
            "date": "27 Dec 2024"
        },
        {
            "title": "‘Respect Moza’s sovereignty’",
            "url": "https://www.herald.co.zw/respect-mozas-sovereignty/",
            "content": "Fungi Kwaramba-News Editor\n\nThe international community should respect the sovereign will of the people of Mozambique and support all processes towards peace, law and order, Sadc Chairman President Mnangagwa has said.\n\nThis follows the Mozambican Constitutional Councils Monday ruling that upheld results of the October elections, reaffirming the governing Frelimo partys decades-long hold on power.\n\nIn a ruling on Monday, judges of the Constitutional Council named Cde Daniel Chapo as the next president, confirming that the Frelimo candidate won 65 percent of the vote while his main challenger, Venancio Mondlane, got a 24 percent share of the vote.\n\nSADC urges the international community to respect the sovereign will of the people and the Republic of Mozambique, exhorting all concerned to constructively support all processes towards peace, law and order which the country and people sorely need and deserve, the President said.\n\nThis year the SADC region, and Africa at large, have witnessed elections in several countries with the plebiscites largely peaceful save for a few exceptions.\n\nThe President said this is a loud testimony that democracy continues to find deeper roots and to flourish in our SADC Region.\n\nIn his statement, President Mnangagwa said the Constitutional Councils Monday ruling exhausted all lawful processes for determining election results, both under Mozambican laws and SADC Election Guidelines and expectations, and thus all parties need to abide by the countrys apex courts ruling.\n\nThe Southern Africa Development Community, SADC, notes and acknowledges the ruling and confirmation on Monday, 23rd December 2024, by the Constitutional Council of Election Results held in the Republic Mozambique on 9th October this year.\n\nThe ruling by that countrys top electoral court, which upheld FRELIMO Partys victory, completes and thus exhausts all lawful processes on determining election results, in line with that countrys national laws, and in keeping with SADCs Election Guidelines and expectations. SADC thus expects all parties to the electoral process, both individually and collectively, to abide by the decision of the Council which should provide a constitutional way forward for the country, and facilitate the way to greater peace, normalcy and stability in the interest of all Mozambicans.\n\nFurther, the President said, the rule of law is sacrosanct and SADC, as the regional mother body, stands ready to assist the people of Mozambique in deepening and consolidating democracy.\n\nSADC stands ready to assist the incoming Government, and People of Mozambique, in consolidating their electoral democracy on the basis of the aforesaid Court decision which should be held sacrosanct by all. Indeed, this is what the rule of law is all about, the President said.\n\nIn the October elections, Cde Chapo won by a massive landslide; his party, Frelimo, also improved its parliamentary majority in the 250-seatlegislature.\n\nHowever, the opposition led by Mr Mondlane has refused to accept defeat, leading to sporadic protests in the gas-rich southern African country, concentrated mainly in the urban centres.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/President-Mnangagwa-SADC-Chair.jpg",
            "description": "Fungi Kwaramba-News Editor The international community should respect the sovereign will of the people of Mozambique and support all processes towards peace, law and order, Sadc Chairman President Mnangagwa has said. This follows the Mozambican Constitutional Council’s Monday ruling that upheld results of the October elections, reaffirming the governing Frelimo party’s decades-long hold on power. […]",
            "time": "21:26",
            "date": "27 Dec 2024"
        },
        {
            "title": "I use Xmas to reflect on strengths, weaknesses: President",
            "url": "https://www.herald.co.zw/i-use-xmas-to-reflect-on-strengths-weaknesses-president/",
            "content": "Zvamaida Murwira-Senior Reporter\n\nPresident Mnangagwa says he spends Christmas Day reflecting on weaknesses and strengths and how to improve Government programmes and policies given that there will be fewer engagements and phone calls on the day.\n\nThe Head of State and Government said a day like Christmas was also an opportunity to review the efficacy of his Cabinet team with a view to establishing if every team member was pulling or needed replacement.\n\nHe said this in an interview with a ZBC news crew which visited the First Family at its official residence in Harare to establish how they spend their Christmas day.\n\nWhen the ZBC news team arrived, the President was busy with official duties in his office at the residence while the First Lady, Dr Auxillia Mnangagwa, was doing her household chores, preparing food in anticipation of a visit from their grandchildren.\n\nIn an interview held under a relaxed environment as they strolled around the residences garden and yard, President Mnangagwa said on Christmas Day, he interacts with his grandchildren for some time before leaving them with their grandmother and then retreats to his home office to brainstorm on the years Government performance.\n\nChristmas is a day to rest. I was at my office at my official residence, reflecting on who will remain, who will go, who is working hard, and what new things I can initiate. So Christmas Day is a day to brainstorm, plan, it is the day for that because all other people will be busy at their homes, there will be less disturbances, there will be fewer phone calls, said President Mnangagwa as he strolled around the driveway of his yard.\n\nAsked if he rests during the Christmas period, he said: Yes, at home I play with grandchildren. They came last night, and they will come again later in the afternoon, I play and interact with them briefly and I revert to my work in my office which is here. I have a lot of work to do. Today there are fewer phone calls.\n\nHe said he could not switch off his mobile phone to concentrate on his work because he had to run a country through teamwork.\n\nThe country does not stop working, it (Christmas Day) is the time to reflect without disturbances, we are headed for New Year. We must introduce new programmes, new policies. We must introspect about the past, our weaknesses, our strengths . . .to say this was my team, is it the team that has delivered our vision or does it require interrogation? he said.\n\nAsked if he would continue with his team going into the new year, the President said he would make a statement to the nation about his vision and programmes at the commencement of the New Year.\n\nI cannot release it now. I will make my statement after the 1st of January, because just now, everyone is happy, they are celebrating Christmas day and for you to call to tell them that you are no longer part of my team, it would not augur well, but that is the time I reflect how we have worked as a team, what weaknesses have I identified, what is necessary to execute Government programmes, he said.\n\nRecounting how Christmas was celebrated during his boyhood days, President Mnangagwa said it was a joyous event as they would collectively eat food prepared by his mother.\n\nIn the 1940s and 50s at Christmas, our mothers would cook food in huge pots, prepare bread delivered to us in winnowing baskets, for you(present generation) these things are now just normal, he said.\n\nHe said when he rests, mostly on Sundays, he goes to his farm in Kwekwe to assess the crops and livestock, among other tasks.\n\nFirst Lady, Dr Mnangagwa said on Christmas day she takes it upon herself to prepare food for her grandchildren.\n\nI had a message sent to me by my grandchildren, saying they are coming today and they want me to cook for them. They said they wanted some chips. I have prepared cabbages, butternut and so forth, I have prepared food which I want them to eat. I feel very happy because it is not often that we see them because of our busy schedule, she said.\n\nShe said her upbringing is what makes her work hard despite her status as the Mother of the Nation.\n\nAsked what Cde Mnangagwas favourite food is, the First Lady said the President, while she likes meat, preferred kapenta and milk.\n\nFrom the time I knew him, yes inasmuch as he wants to see meat in the relish, but what he likes most is kapenta and milk. I actually have them now. Even if we visit, we have no problems about what he eats, its kapenta and milk, she said.\n\nOn Wednesday, Zimbabwe joined the Christian world to celebrate Christmas Day meant to mark the birth of Jesus Christ.\n\nSome went to the rural areas, others went to holiday resorts while others were at home with their families to celebrate the day.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/President-Mnangagwa-5.jpg",
            "description": "Zvamaida Murwira-Senior Reporter President Mnangagwa says he spends Christmas Day reflecting on weaknesses and strengths and how to improve Government programmes and policies given that there will be fewer engagements and phone calls on the day. The Head of State and Government said a day like Christmas was also an opportunity to review the efficacy […]",
            "time": "21:26",
            "date": "27 Dec 2024"
        }
    ]
}