{
    "news": [
        {
            "title": "Worship singer eager to meet Fungisai",
            "url": "https://www.herald.co.zw/worship-singer-eager-to-meet-fungisai/",
            "content": "Trust Khosa\n\nPraise and worship singer Anesu Makurumidze is eager to meet her role model, Fungisai Zvakavapano, and exchange insights with her.\n\nThe 31-year-old has been in the music scene for nearly a decade but has not yet had the opportunity to connect with Fungisai.\n\nWith two albums to her name Chinja Magiya, released in 2014, and Hukuru (2021) Anesu believes she would benefit immensely if she is mentored by veterans of Fungisais calibre.\n\nI might be popular in my circles, but we all need guidance from experienced artists like Fungisai Zvakavapano, she shared.\n\nI genuinely admire Fungisai for paving the way for us. Meeting her and exchanging notes would be a tremendous opportunity.\n\nI am eager to learn from her, and I hope she reads this article and reaches out to me.\n\nAnesu, who serves as a praise and worship singer at Kingdom Light Global Church, believes she has the potential to perform for larger audiences.\n\nI have primarily performed in the church because music promoters tend to favour big names, she said.\n\nThere are many talented artists, but sadly, promoters often do not cast their nets wide enough. I will continue to work hard to reach a level where promoters will seek me out. With Gods grace, nothing is impossible.\n\nWhile she acknowledges Pastor Muleya for providing her with exposure, Anesu insists that her motivation is not monetary.\n\nTo me, gospel music is a calling I received from the Almighty. I would be lying if I said I am singing for money, she said.\n\nIf financial rewards come, that would be a bonus, but for now, I want to build my name and be recognised among elite praise and worship singers in Zimbabwe and beyond.\n\nIn her quest for a breakthrough, her management team has lined up several collaborations.\n\nMy manager, Pastor George, is currently negotiating with Frets Donzvo for a gospel song. It would be a dream come true if we could reach out to Fungisais team. We are hopeful that this will happen, she added.\n\nLike many other artists, Anesu is also learning to play various instruments. The only instrument I can play without difficulty is the tambourine, and I am learning to play the acoustic guitar. However, my true strength lies in singing gospel songs.\n\nBorn into a family of three girls as the youngest, Anesu attended Dunuza Primary School in Triangle and completed her secondary education at Terrygoss High School in the Lowveld.\n\nShe studied Accounting at Masvingo Polytechnic. Anesu is married to Darlington Makurumidze.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/11/FUNGISAI.jpg",
            "description": "Trust Khosa Praise and worship singer Anesu Makurumidze is eager to meet her role model, Fungisai Zvakavapano, and exchange insights with her. The 31-year-old has been in the music scene for nearly a decade but has not yet had the opportunity to connect with Fungisai. With two albums to her name— “Chinja Magiya”, released in […]",
            "time": "20:40",
            "date": "10 Jan 2025"
        },
        {
            "title": "Man jailed 5 years for attempting to kill crime committee member",
            "url": "https://www.herald.co.zw/man-jailed-5-years-for-attempting-to-kill-crime-committee-member/",
            "content": "Thupeyo Muleya\n\nBeitbridge Bureau\n\nA 26-year-old-man from Ndambe area in Beitbridge has been slapped with a five year jail term for attempting to kill a member of the local crime fighting committee.\n\nRecomend Ndou was arrested for stabbing Mbonisi Ndou using a sharp object last year.\n\nHe denied the charge of attempted murder when the trial opened before Beitbridge regional magistrate Ms Charity Maphosa on Friday.\n\nHowever, he was convicted on the strength of the States evidence.\n\nNdou was initially sentenced to five years in jail by Ms Maphosa who then conditionally suspended two and half years. He will serve an effective two and a half years.\n\nAppearing for the State, Mr Willbrought Muleya said on December 26 last year, the complainant who is a member of the local youth committee fighting crime left Ndambe Business Centre at around 4.30 am.\n\nAlong the way, the complainant met Ndou who had a sharp object and a whip.\n\nNdou told the complainant that he wanted to kill him for his role in the youth committee.\n\nHe then stabbed the complainant in the head resulting in a scuffle and he stabbed him again behind the ear.\n\nThe complainant tried to run away but Ndou chased after him assaulting the victim with a whip.\n\nAs a result the complainant sustainef two deep wounds on the head.\n\nThe matter was later reported to the police who arrested Ndou.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/09/Jailed.jpg",
            "description": "Thupeyo Muleya Beitbridge Bureau A 26-year-old-man from Ndambe area in Beitbridge has been slapped with a five year jail term for attempting to kill a member of the local crime fighting committee. Recomend Ndou was arrested for stabbing Mbonisi Ndou using a sharp object last year. He denied the charge of attempted murder when the […]",
            "time": "20:40",
            "date": "10 Jan 2025"
        },
        {
            "title": "Zimsec A Level results out",
            "url": "https://www.herald.co.zw/zimsec-a-level-results-out-3/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nTHE Zimbabwe School Examinations Council (Zimsec) has released the 2024 November results for the Advanced Level.\n\nAddressing journalists on Friday, Zimsec board chairperson Professor Paul Mapfumo said the results will be accessible at the Zimsec portal starting at 4 pm and would be available for the next five days.\n\nThe Zimbabwe School Examinations Council board and management would like to advise the nation of the release of the 2024 November Advanced Level examination results, he said.\n\nWith effect from today, 10 January 2025, 4 pm, Advanced Level examination candidates results will be accessible to all candidates and authorised personnel online through the ZIMSEC portal accessed through the ZIMSEC website www.zimsec.co.zw.\n\nPlease take note that this portal will be open for 5 days only. Heads of examination centres will be able to collect the results for their respective schools/centres from our regional offices on Monday, January 13, 2025.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/img-6090332f37401-324x160.jpg",
            "description": "Ivan Zhakata Herald Correspondent THE Zimbabwe School Examinations Council (Zimsec) has released the 2024 November results for the Advanced Level. Addressing journalists on Friday, Zimsec board chairperson Professor Paul Mapfumo said the results will be accessible at the Zimsec portal starting at 4 pm and would be available for the next five days. “The Zimbabwe […]",
            "time": "20:40",
            "date": "10 Jan 2025"
        },
        {
            "title": "Four ZIMRA officials arrested for corruption",
            "url": "https://www.herald.co.zw/four-zimra-officials-arrested-for-corruption/",
            "content": "Crime Reporter\n\nThe Zimbabwe Anti-Corruption Commission (ZACC) officers have arrested four Zimbabwe Revenue Authority (ZIMRA) officials in Harare on allegations of demanding payment from a transport operator to facilitate the release of a bus impounded during an ongoing operation to curb smuggling.\n\nThe four, Jonathan Maguta, Obert Mitwira, Simon Homera and Laul Gwatirinda, who were employed as revenue officers are facing extortion charges or alternatively, criminal abuse of duty as public officers.\n\nCircumstances are that a bus from Best Express Logistics was impounded during an ongoing operation to curb smuggling and the company was ordered to pay excess duty of ZWG55 000.\n\nAfter paying the required excess duty, the suspects allegedly demanded US$6 000 from Beatrice Maramwidze, a director at Best Express Logistics as payment to facilitate the release of the bus from BAK Storage in Harare.\n\nMaramwidze reported the matter to ZACC and an investigation was launched resulting in the arrest of the accused persons after accepting US$1 500 bribe, while in a ZIMRA branded vehicle.\n\nUpon searching the ZIMRA vehicle, an additional US$3 951, suspected to be part of money extorted through bribes, was recovered.\n\nThe accused persons are detained at Avondale Police Station and are expected to appear at Harare Magistrate Court on Saturday.\n\nZACC is appealing to members of the public and business community to report any acts of corruption on WhatsApp number +263719529483.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/02/Zimra-21.jpg",
            "description": "Crime Reporter The Zimbabwe Anti-Corruption Commission (ZACC) officers have arrested four Zimbabwe Revenue Authority (ZIMRA) officials in Harare on allegations of demanding payment from a transport operator to facilitate the release of a bus impounded during an ongoing operation to curb smuggling. The four, Jonathan Maguta, Obert Mitwira, Simon Homera and Laul Gwatirinda, who were […]",
            "time": "20:40",
            "date": "10 Jan 2025"
        },
        {
            "title": "Senior Herald reporter appointed into NAC’s new board",
            "url": "https://www.herald.co.zw/senior-herald-reporter-appointed-into-nacs-new-board/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nTHE Heralds senior health reporter Rumbidzai Zinyuke has been appointed into the new 14- member National Aids Council (NAC) board that was announced by the Minister of Health and Child Care Dr Douglas Mombeshora on Friday.\n\nThe board is led by Mrs Nester Mukwehwa, who is deputised by Advocate Tapson Dzvetero.\n\nOther board members include Dr Matthew Mare, Mrs Tendayi Westerhof, Dr Gilbert Chahwanda, Ms Mabel Buzuzi, Mr Isheanesu Nkomo, Mr Jaison Muradzikwa, Mrs Beatrice Dupwa, Mr Ralphel Tsivama, Dr Ntombizanele Vella, Dr Wenceslas Nyamayaro and Dr Bernard Madzima.\n\nAddressing the new board, Minister Mombeshora said the board should ensure that NAC fulfils its mandate as enshrined in the National AIDS Council of Zimbabwe Act Chapter 15:14 as well as its other obligations as encapsulated in several other enactments.\n\nI charge you to ensure that NAC exists to coordinate, oversee and spearhead the national response to HIV and AIDS, As the board, you are the custodians of this mandate, he said.\n\nYour decisions and actions will determine the councils ability to deliver impactful programs and achieve HIV and AIDS national targets and global requirements.\n\nThe council further plays an extended role of dealing with other emerging public health risks and challenges which the Board must be alive to such as NCDs, drugs and substance use as well as other pandemics.\n\nMrs Mukwehwa said together with her board they will lead to strengthening partnerships, improving services, delivering and ensuring that they are reaching to those who need support the most.\n\nI am excited to work with the talented team and be led by Dr Madzima and with all stakeholders to achieve our national goals, she said.\n\nI would like to thank the outgoing chair and the outgoing board members for their leadership and dedication to this cause.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/379cc704-6a80-4180-bda6-811142ed086d-680x380.jpeg",
            "description": "Ivan Zhakata Herald Correspondent THE Herald’s senior health reporter Rumbidzai Zinyuke has been appointed into the new 14- member National Aids Council (NAC) board that was announced by the Minister of Health and Child Care Dr Douglas Mombeshora on Friday. The board is led by Mrs Nester Mukwehwa, who is deputised by Advocate Tapson Dzvetero. […]",
            "time": "20:40",
            "date": "10 Jan 2025"
        },
        {
            "title": "OK Zimbabwe dispels insolvency rumors, reassures stakeholders",
            "url": "https://www.herald.co.zw/ok-zimbabwe-dispels-insolvency-rumors-reassures-stakeholders/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nOK Zimbabwe Limited has reassured stakeholders that the company remains operational and committed to serving its customers.\n\nThis follows widespread speculation on social media regarding its financial viability. In a statement, Mrs Margaret Munyuru, the group company secretary, said they would like to assure all stakeholders, including customers, shareholders, employees, and partners, that their stores were open for trading.\n\nMrs Munyuru acknowledged that the company experienced intermittent product supply challenges during the festive period but said that OK Zimbabwe is continuing to contribute to the countrys economic growth.\n\nShe attributed the challenges to a volatile operating environment affecting much of the formal retail sector and said efforts were being made to resolve the situation.\n\nWe are actively engaged with our suppliers, and key stakeholders, including industry associations and regulators, to restore supplies to normal levels whilst working on solutions that stabilize the trading environment, she said.\n\nThe company expressed gratitude to its suppliers, bankers, and other stakeholders for their support during these trying times.\n\nIt reiterated its commitment to transparency and open communication, assuring stakeholders that any official updates would be shared responsibly through proper channels.\n\nOK Zimbabwe also reaffirmed its corporate mission to bring smiles to all its stakeholders.\n\nOur pledge is to continue to make happiness tangible by planting smiles on our employees, customers, suppliers, shareholders and the communities we operate in, Mrs Munyuru said.\n\nDespite recent challenges, the company remains optimistic about its future and is confident in its ability to navigate the current economic landscape.\n\nShe encouraged stakeholders to dismiss speculative reports and trust in the companys resilience and dedication to excellence.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Screenshot-19-680x380.png",
            "description": "Ivan Zhakata Herald Correspondent OK Zimbabwe Limited has reassured stakeholders that the company remains operational and committed to serving its customers. This follows widespread speculation on social media regarding its financial viability. In a statement, Mrs Margaret Munyuru, the group company secretary, said they would like to assure all stakeholders, including customers, shareholders, employees, and […]",
            "time": "20:40",
            "date": "10 Jan 2025"
        },
        {
            "title": "Fly Zim flag high: President . . . Sends off scholarship beneficiaries to Algeria",
            "url": "https://www.herald.co.zw/fly-zim-flag-high-president-sends-off-scholarship-beneficiaries-to-algeria/",
            "content": "Wallace Ruzvidzo-Herald Reporter\n\nPRESIDENT Mnangagwa has implored students on Government-to-Government scholarship programmes outside the country to fly the Zimbabwean flag high as they are not just going to study, but represent the country as its ambassadors.\n\nYesterday, the President saw off five beneficiaries of an Algerian scholarship programme extended to him by his counterpart, President Abdelmadjid Tebboune.\n\nThe beneficiaries are Natasha Deni, Bukhosi Maphosa, Albert Jakarasi, Melogina Mano and Tinovimbanashe Kamutero.\n\nThey will be studying in various fields, including Science, Technology, Engineering and Medicine, areas which the President said were crucial in Zimbabwes development matrix.\n\nIn his remarks at State House in Harare, the President charged the students to make the country proud in their endeavours.\n\nYou are now ambassadors of our motherland, Zimbabwe, as you go for this programme in Science, Technology, Engineering and Medicine.\n\nThese are very critical fields for developing countries like Zimbabwe, so you must consider yourselves very lucky to have been selected. When you are there, you individually and collectively become ambassadors of our country. So, never think that you are an individual, wherever you are, you are actually representing us, he said.\n\nZimbabweans are known the world over for their hard work and tenacity, something President Mnangagwa said the students should showcase.\n\nMukanyadzisa muri ikoko, hamuna kunyadzisa vabereki venyu chete, matonyadzisa nesuwo ende kana madaro tinozonetsekana mangwana kuti titume here vamwe (If you act in an unbecoming manner during your stay in Algeria, know that you have not only let your parents down, but the nation at large and it will be difficult for us to send more students).\n\nSaka garai muchiziva kuti wakamirira nyika, hauna kuzvimirira pachako (You should always know that you are representing the country, you are not representing yourself).\n\nYou must go ahead and show the values of hard work. You must show that you are coming from a hard-working country. You must commit yourself to why you are there, he said.\n\nYou must go there with determination and courage and a sense of pride. Wherever Zimbabwean students go, they perform very well, we have that record across the world.\n\nPresident Mnangagwa said the scholarships were a testament to the cordial relations between Harare and Algiers.\n\nZimbabwe and Algeria have a longstanding relationship that continues to deepen. We have consolidated our relations and this is why we have this offer because our relationship is strengthening and is becoming more and more comprehensive.\n\nI wish to congratulate you students on your study assignment in Algeria.\n\nWe have a very long standing relationship with Algeria and the students that have gone before you behaved very well and upheld the good relations between us (Zimbabwe and Algeria), he said.\n\nI hope you will not be the group that will spoil that relationshipif that happens, our prisons are not full.\n\nPresident Mnangagwa shared a lighter moment with the students.\n\nPresident Mnangagwa poses for a group photograph with Foreign Affairs and International Trade Minister Professor Amon Murwira (fourth from left), Algerian Ambassador to Zimbabwe Mohamed Seoudi (fifth from right), his deputy Mohamed Mehdi (fourth from right), students leaving for Algeria on scholarship and their parents at State House in Harare yesterday.Picture: Kudakwashe Hunda.\n\nJust think of it as you are representing ED, its a tall order so you must always keep that in mind. As you represent us in foreign lands, you should know you are not representing yourself. You are representing us.\n\nAnd before you sleep, you should pray and say, I am representing ED so I must do my best, said the President light-heartedly.\n\n . . . when you come back here, its either I will give you a red carpet and congratulate you or you spend a few days behind bars for misrepresenting us.\n\nHe also encouraged the students to cherish the scholarship opportunity as it was not something to take for granted.\n\nSo as you go ahead, you must embrace every opportunity you find so that you can bring such experience back home for the benefit of developing our country. You are only very few.\n\nThe students in this country of your age, with your qualifications, are so many, but you have been found fit to take up this challenge.\n\nYou have been given guidance byyour parents that you will not be representing your families but Zimbabwe, the President said.\n\nAs beneficiaries of the cordial relations between Zimbabwe and Algeria, President Mnangagwa encouraged the students to hoist the countrys flag high as this would see more scholarship opportunities being availed.\n\nYou see, these scholarships are a testament to the relationship between Zimbabwe and Algeria.\n\nIf you carry yourself in high esteem during your time there we will certainly get more scholarships because of our good mannerisms. If you do not represent us well then they will just reduce the number, he said.\n\nPresident Mnangagwa also had some words for the students parents and guardians who were present during the send-off.\n\nTo the parents, do not expect financial benefits while the children are in Algeria, these children are going to school so you are the ones who should actually send them money, he said.\n\nAlgerian Ambassador to Zimbabwe Mohamed Seoudi said Zimbabwe was more than a friend to Algeria hence the continuous extension of scholarships.\n\nOur relations (with Zimbabwe) are going on excellently and what is better than the building of human resources? That is why Algeria is giving Zimbabwe more than 100 scholarships each year including these ones extended to the President from his brother (Algerian President).\n\nLike the President says, nyika inovakwa nevene vayo. Algeria is very committed to countries on the African continent like Zimbabwe who are more than friends to us, he said.\n\nOne of the beneficiaries, Natasha Deni, said she was elated to have been accorded the scholarship.\n\nI am 20 and I was overjoyed, excited and most of all grateful to God for awarding me this opportunity and also to the President for this scholarship opportunity, she said.\n\nAnother student, Melogina Mano, said she was grateful for the opportunity.\n\nI am very happy because this is not an opportunity accorded to many, she said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/President-Mnangagwa-Algeria-students1-680x380.jpg",
            "description": "Wallace Ruzvidzo-Herald Reporter PRESIDENT Mnangagwa has implored students on Government-to-Government scholarship programmes outside the country to fly the Zimbabwean flag high as they are not just going to study, but represent the country as its ambassadors. Yesterday, the President saw off five beneficiaries of an Algerian scholarship programme extended to him by his counterpart, President […]",
            "time": "20:40",
            "date": "10 Jan 2025"
        },
        {
            "title": "Second Republic completes 8 000 projects",
            "url": "https://www.herald.co.zw/second-republic-completes-8-000-projects/",
            "content": "Farirai Machivenyika-Senior Reporter\n\nGOVERNMENT has completed over 8 000 projects countrywide since the coming in of the Second Republic under President Mnangagwa in 2017, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere said yesterday.\n\nSpeaking during a media tour of some of the projects in Manicaland Province, Dr Muswere said so much had been achieved in a short space of time.\n\nHe was accompanied by Manicaland Provincial Affairs and Devolution Minister Advocate Misheck Mugadza.\n\nProjects toured include the far-reaching new National Pharmaceutical Company warehouse, the solar project at Victoria Chitepo Provincial Hospital, Mega Market, the new Registry Office, the site where two silos are being constructed, Tikwiri Irrigation scheme and Romsley irrigation.\n\nMegamarket is one of the Presidents projects which commenced three years ago.\n\nPresident Mnangagwa is expected to commission the project this year.\n\nInformation and publicity and broadcast services Minister Jenfan Muswere (center) Manicaland Minister of State for Provincial Affairs and Devolution Misheck Mugadza (second from right), Natpham branch Manager Cathias Mundandishe (second from right) and other delegates are taken on a tour of Natpham warehouse in Mutare yesterday.Pictures: Joseph Manditswara.\n\nA total of 8 000 projects have been successfully completed from 2017, when His Excellency the President assumed office. You will all agree with me that so much has been achieved in a short space of time. We have had, for the year 2024, 346 projects that were completed, he said.\n\nDr Muswere said the thematic committee on National Development was also in the process of identifying some of the projects that were completed last year.\n\nSome of the projects also include, during the period when we had Cyclone Idai, when initiatives were put in place in order to reconstruct the infrastructure, especially the roads and the bridges, and the bulk of that work was done by the Government of Zimbabwe under the leadership of President Mnangagwa, he said.\n\nDr Muswere said some of the projects being implemented were a sign of the Governments commitment to devolution.\n\nWe are also travelling to the Passport Office, which also speaks to the devolution and decentralisation of services in our country. We know that decentralisation and devolution are part of the revolution that the Second Republic has put in motion and ensured that it becomes a success story, he said.\n\nDr Muswere said through decentralisation, Manicaland had hosted Independence Day celebrations in Murambinda, Buhera.\n\nAdv Mugadza said the opening of the Natpharm warehouse had addressed logistical challenges in the storage of medicines.\n\nWe are now able to safely store drugs and ensure their availability at our hospitals and clinics. We are also now in a position to store drugs coming through Beira, he said.\n\nManicaland Provincial Registrar Ms Joyce Munamati said their new offices would be completed in the first quarter of this year.\n\nThe construction of the building is expected to be complete by the end of the first quarter. The construction of the new offices is being donein line with the devolution policy and President Mnangagwas mantra of leaving no one and no place behind, she said.\n\nCurrently, the Registry is operating from wooden cabins, with some Mutare residents travelling toMarondera or Chipinge to obtain identity documents.\n\nAllied Timbers chief operations officer, Mr Ian Zimunya, said their operations had benefitted from equipment procured from Belarus.\n\nWe are now operating at between 80 and 85 percent through equipment procured from Belarus, he said.\n\nAt GMB, Engineer Willard Chirunga said they expect to complete the first silo before the end of the year.\n\nWe hope to complete the foundation works by April and install the prefabricated materials by October, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Minister-Muswere-and-Manicaland-minister-of-State-Advocate-Mugadza-680x380.jpg",
            "description": "Farirai Machivenyika-Senior Reporter GOVERNMENT has completed over 8 000 projects countrywide since the coming in of the Second Republic under President Mnangagwa in 2017, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere said yesterday. Speaking during a media tour of some of the projects in Manicaland Province, Dr Muswere said so much had been […]",
            "time": "20:40",
            "date": "10 Jan 2025"
        },
        {
            "title": "New water treatment plant, smart meters for Harare",
            "url": "https://www.herald.co.zw/new-water-treatment-plant-smart-meters-for-harare/",
            "content": "Remember Deketeke-Herald Reporter\n\nTHE Ministry of Local Government and Public Works, Harare City Council and private players have signed a potentially game-changing agreement that will see the capital city getting a new water treatment plant and smart meters to improve water supply to residents.\n\nThe deal involves the Local Government Ministry, the City of Harare, Hangzhou Laison Technology Company, and Helcraw Electrical.\n\nAt the signing ceremony in the capital yesterday, Local Government and Public Works Minister Daniel Garwe said the Government was committed to enhancing the water supply chain countrywide.\n\nWater has become a critical issue, generating significant media interest. We are now taking action. Yesterday, we met with our investors to refine our tripartite partnership.\n\nMinister Garwe indicated that the Ministry and the City of Harare are taking decisive steps, as directed by President Mnangagwa, to deliver world-class services to residents by 2030.\n\nHe reassured the public that while technology may raise concerns about increased rates, it could actually lower delivery costs, aiming for globally effective solutions that ensure affordability.\n\nWhile technology often raises concerns about increased rates, we want to reassure the public that it can actually lower delivery costs. Our goal is to implement globally effective technology that ensures affordable, world-class services for everyone, said Minister Garwe.\n\nHarare Mayor Councillor Jacob Mafume highlighted the necessity of collaboration for the development of the capital city.\n\nA capital city cannot be built by the city alone; it requires the support of central Government and the private sector.\n\nHe drew parallels with successful cities like Kigali in Rwanda and New Cairo in Egypt, underscoring the importance of synergies in meeting citizens needs and emphasising that water and sewage services transcend political affiliations.\n\nCities we admire, like Kigali and New Cairo, were built through collaboration between municipalities and central Governments. We see no contradiction in working together to align with citizens needs.\n\nMr Clark Dai, deputy managing director of Hangzhou Laison Technology, expressed enthusiasm for the project, saying their smart water management system will serve as a benchmark not only for Harare but for Southern Africa.\n\nWe have developed a reliable, practical, and advanced system aimed at improving efficiency and addressing the challenges of non-buried water, he said.\n\nMr Brendon Jere, chief executive officer of Helcraw Electrical, said the water plant, distribution, and billing system are part of a comprehensive plan to ensure water reaches all residents of Harare sustainably and intelligently.\n\nThis initiative signifies a collaborative effort to tackle critical water supply challenges in Harare, with the new water treatment plant expected to set a standard for similar projects across Southern Africa.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Minister-garwe-and-Mayor-Mafume-680x380.jpg",
            "description": "Remember Deketeke-Herald Reporter THE Ministry of Local Government and Public Works, Harare City Council and private players have signed a potentially game-changing agreement that will see the capital city getting a new water treatment plant and smart meters to improve water supply to residents. The deal involves the Local Government Ministry, the City of Harare, […]",
            "time": "20:40",
            "date": "10 Jan 2025"
        },
        {
            "title": "Growing calls for President to extend term",
            "url": "https://www.herald.co.zw/growing-calls-for-president-to-extend-term/",
            "content": "Joseph Madzimure-Senior Reporter\n\nTHERE is a growing call from Zanu PF structures, with more provinces joining the chorus in pleading with President Mnangagwa to continue his term of office beyond 2028 to realise Vision 2030.\n\nAppealing to President Mnangagwa to stay beyond 2028 is not a crime, but what the people are yearning for in appreciation of his work ethic, they said.\n\nThe structures are saying President Mnangagwa deserves to continue in office in light of the remarkable progress the country has achieved under his watch.\n\nThis week, Zanu PF Manicaland and Matabeleland South provinces joined other provinces such as Masvingo, Harare, Midlands and Mashonaland East in appealing to President Mnangagwa to remain in office beyond 2028.\n\nZanu PF Manicaland and Matabeleland South provinces are conducting inter-district meetings to give feedback on the 21st Zanu PF Annual Peoples Conference resolutions and appraise party structures up to ground level, the expectations of the leadership.\n\nOne of the resolutions which came out of the conference was the endorsement by all provinces of the extension of President Mnangagwas term beyond 2028.\n\nManicaland provincial chairman Cde Tawanda Mukodza said the purpose of the inter-district meetings was to give feedback on conference resolutions.\n\nWe were also unfolding the year plans, but the major factor is that inter-districts are a constitutional requirement and we have to do them, he said.\n\nCde Mukodza highlighted the importance of resolution Number One which stated that the party wants President Mnangagwa to continue with the good works as leader of the party and nation up to and after the year 2030.\n\nIts now our duty as a province to cascade these important resolutions to the grassroots, he said.\n\nMatabeleland South held their inter-district meeting in Insiza District on Wednesday which was attended by the party leadership from all top five wings; the main, women, war veterans and the youth wings at Mthwakazi Hall in Filabusi.\n\nIn an interview, Zanu PF Matabeleland South chairman Cde Mangaliso Ndlovu, who is also the Minister of Industry and Commerce, said they are conducting inter-district meetings across the province.\n\nWe started with Insiza District yesterday. We are now convening inter-district meetings in other districts. The move is meant to give feedback on the outcome of the 21st Zanu PF Annual Peoples Conference which was held in Bulawayo in October last year, he said.\n\nCde Ndlovu said one of the major resolutions is that the term of office of President Mnangagwa be extended beyond 2028.\n\nAll the provinces adopted that resolution and all the 10 provinces anonymously agreed on that. It is now up to party members and the generality of Zimbabweans to see that the resolution is implemented, he said.\n\nMeanwhile, the countrys main opposition party, CCC, is also in agreement with a resolution by the ruling Zanu PF party to postpone the next harmonised elections from 2028 to 2030 to allow developmental projects initiated by President Mnangagwa and the Second Republic to come to fruition.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/President-Mnangagwa-cabinet.jpg",
            "description": "Joseph Madzimure-Senior Reporter THERE is a growing call from Zanu PF structures, with more provinces joining the chorus in pleading with President Mnangagwa to continue his term of office beyond 2028 to realise Vision 2030. Appealing to President Mnangagwa to stay beyond 2028 is not a crime, but what the people are yearning for in […]",
            "time": "20:40",
            "date": "10 Jan 2025"
        }
    ]
}