{
    "news": [
        {
            "title": "President returns from AU Summit",
            "url": "https://www.herald.co.zw/president-returns-from-au-summit-2/",
            "content": "Garikai Fadzi\n\nSADC chairperson, President Emmerson Mnangagwa is back home from Addis Ababa, Ethiopia where he joined other African leaders at the 38th Ordinary Session of the African Union.\n\nThis years summit was running under the theme, Justice for Africans and People of African Descent through Reparations.\n\nOn the sidelines of the summit,the President also formally introduced SADC and COMESA candidate for the African Development Bank (AfDB) presidency, Dr Samuel Maimbo, a Zambian national.\n\nHe also had a number of bilateral engagements with other African heads of states.\n\nThe President was welcomed back home by Vice Presidents Constantino Chiwenga, Kembo Mohadi, service chiefs and senior Government officials.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/162dd24b-a8a1-41b2-85ce-817e6cecfec2-680x380.jpeg",
            "description": "Garikai Fadzi SADC chairperson, President Emmerson Mnangagwa is back home from Addis Ababa, Ethiopia where he joined other African leaders at the 38th Ordinary Session of the African Union. This year’s summit was running under the theme, “Justice for Africans and People of African Descent through Reparations”. On the sidelines of the summit,the President also […]",
            "time": "18:33",
            "date": "16 Feb 2025"
        },
        {
            "title": "President in Ethiopia for the 38th Ordinary Session of the African Union Summit",
            "url": "https://www.herald.co.zw/president-in-ethiopia-for-the-38th-ordinary-session-of-the-african-union-summit/",
            "content": "\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/1500x500-618x380.png",
            "description": "",
            "time": "18:33",
            "date": "16 Feb 2025"
        },
        {
            "title": "President Mnangagwa meets Chapo",
            "url": "https://www.herald.co.zw/president-mnangagwa-meets-chapo/",
            "content": "Garikai Fadzi in Addis Ababa, Ethiopia\n\nSADC chairperson, President Emmerson Mnangagwa today met his Mozambique counterpart, Daniel Chapo at his hotel.\n\nThe two attended the opening ceremony of the 38th Ordinary Session of the Assembly of Heads of State and Government in Addis Ababa, Ethiopia on Saturday.\n\nAfter the meeting, President Mnangagwa presented SADCs candidate for the AfDB presidency.\n\nZambian national Dr Samuel Maimbo is battling against five others for the post.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2020/03/0803-1-1-PRESIDENT-EMMERSON-MNANGAGWA.jpg",
            "description": "Garikai Fadzi in Addis Ababa, Ethiopia SADC chairperson, President Emmerson Mnangagwa today met his Mozambique counterpart, Daniel Chapo at his hotel. The two attended the opening ceremony of the 38th Ordinary Session of the Assembly of Heads of State and Government in Addis Ababa, Ethiopia on Saturday. After the meeting, President Mnangagwa presented SADC’s candidate […]",
            "time": "18:33",
            "date": "16 Feb 2025"
        },
        {
            "title": "Police name victims of Beitbridge-Masvingo road accident",
            "url": "https://www.herald.co.zw/police-name-victims-of-beitbridge-masvingo-road-accident/",
            "content": "Online Reporter\n\nPOLICE have released names of 21 victims who perished in a fatal accident involving an Urban Connect bus and an Auro Transport Haulage truck near Lutumba Tollgate, along the Beitbridge-Masvingo Road, on February 13.\n\nThe accident claimed 24 lives on the spot, while another victim died later in hospital, bringing the total death toll to 25.\n\nPolice also confirmed that 29 injured passengers are receiving treatment at Beitbridge District Hospital, while two others remain admitted at Gwanda Provincial Hospital.\n\nThirteen critically injured passengers were transferred to United Bulawayo Group of Hospitals for further medical care.\n\nIn a statement, police spokesperson Commissioner Paul Nyathi identified 21 of the 25 deceased victims, who have already been confirmed by their next of kin.\n\nThe victims are:\n\nPolice have appealed to the public to help identify the remaining four victims.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/89b11f6a-223c-4951-8ee3-52f546ce2345-680x380.jpeg",
            "description": "Online Reporter POLICE have released names of 21 victims who perished in a fatal accident involving an Urban Connect bus and an Auro Transport Haulage truck near Lutumba Tollgate, along the Beitbridge-Masvingo Road, on February 13. The accident claimed 24 lives on the spot, while another victim died later in hospital, bringing the total death […]",
            "time": "18:33",
            "date": "16 Feb 2025"
        },
        {
            "title": "Three killed in Kwekwe mine accident",
            "url": "https://www.herald.co.zw/three-killed-in-kwekwe-mine-accident/",
            "content": "Online Reporter\n\nTHREE people tragically died after plunging into a disused mine shaft at Yellowsnake 37 Mine in Kwekwe on Thursday, police have confirmed.\n\nIn a statement, police said the victims had entered the mine using a cage lift, but as they were exiting the shaft, the hook fastening the rope to the cage snapped.\n\nThe cage plummeted down the shaft, overturned and crushed the miners.\n\nAuthorities transported the bodies to Kwekwe General Hospital for post-mortem.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/09/Untitled-44.jpg",
            "description": "Online Reporter THREE people tragically died after plunging into a disused mine shaft at Yellowsnake 37 Mine in Kwekwe on Thursday, police have confirmed. In a statement, police said the victims had entered the mine using a cage lift, but as they were exiting the shaft, the hook fastening the rope to the cage snapped. […]",
            "time": "18:33",
            "date": "16 Feb 2025"
        },
        {
            "title": "Heavy rains leave trail of destruction in Mhondoro-Mubaira",
            "url": "https://www.herald.co.zw/new-heavy-rains-leave-trail-of-destruction-in-mhondoro-mubaira/",
            "content": "Conrad Mupesa Mashonaland West Bureau\n\nIncessant rains that pounded parts of the country in recent days have left a trail of destruction in Mhondoro-Mubaira constituency, Chegutu district, destroying over 13 houses and multiple maize fields.\n\nThe heavy downpour, which hit the area on Friday, was accompanied by strong winds that flattened crops and damaged property, particularly in Ward 1.\n\nLocal legislator Chamu Chiwanza said authorities were mobilising resources to assist affected families.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Rains.jpg",
            "description": "Conrad Mupesa Mashonaland West Bureau Incessant rains that pounded parts of the country in recent days have left a trail of destruction in Mhondoro-Mubaira constituency, Chegutu district, destroying over 13 houses and multiple maize fields. The heavy downpour, which hit the area on Friday, was accompanied by strong winds that flattened crops and damaged property, […]",
            "time": "18:33",
            "date": "16 Feb 2025"
        },
        {
            "title": "War Veterans Fund Programme rolls out in Manicaland",
            "url": "https://www.herald.co.zw/war-veterans-fund-programme-rolls-out-in-manicaland/",
            "content": "Online Reporter\n\nAll is set for the launch of the Presidential War Veterans Fund and borehole drilling scheme today at Dewedzo High School, Makoni West in Rusape, Manicaland Province, marking a significant milestone in the Second Republics efforts to empower the countrys war veterans.\n\nThe programme, spearheaded by Dr Paul Tungwarara, Special Presidential Investment Advisor to the United Arab Emirates, aims to provide interest-free loans to war veterans, enabling them to start businesses and improve their livelihoods.\n\nA total of US$150 000 has been allocated to Manicaland Province as part of the US$1.5 million set aside for war veterans nationwide. The allocation is subject to review over time.\n\nAs part of the programme, a solar powered borehole and a new house built for one of the war veterans will be officially launched, marking the beginning of the Presidential War Veterans borehole drilling scheme.\n\nThe launch event, scheduled for today, will be attended by high-profile dignitaries, including Makoni West Member of Parliament and Information Minister Dr Jenfan Muswere, Minister of State for Manicaland Province Advocate Misheck Mugadza, Minister of Veterans of the Liberation Struggle Affairs Monica Mavhunga, and Secretary for War Veterans Douglas Mahiya.\n\nThis programme has already been launched in Harare, Masvingo, Mashonaland Provinces, and Midlands, and is expected to be replicated in all other provinces.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/IMG-20250215-WA0027-680x380.jpg",
            "description": "Online Reporter All is set for the launch of the Presidential War Veterans Fund and borehole drilling scheme today at Dewedzo High School, Makoni West in Rusape, Manicaland Province, marking a significant milestone in the Second Republic’s efforts to empower the country’s war veterans. The programme, spearheaded by Dr Paul Tungwarara, Special Presidential Investment Advisor […]",
            "time": "18:33",
            "date": "16 Feb 2025"
        },
        {
            "title": "UPDATE: Three killed in Beatrice road accident",
            "url": "https://www.herald.co.zw/update-three-killed-in-beatrice-road-accident/",
            "content": "Online Reporter\n\nThree people died on the spot on Saturday afternoon following a head-on collision between a Mandaza bus and a Glen View 2 High School bus at the 40-kilometre peg along the Masvingo-Harare Road, police have confirmed.\n\nIn a statement posted on X, the police said authorities are still assessing the number of injured passengers.\n\nThe ZRP confirms a fatal road accident which occurred this afternoon at the 40 kilometre peg along Masvingo-Harare Road in Beatrice, reads the statement.\n\nThree people died on the spot when a Mandaza bus was involved in a head on collision with a school bus.\n\nThe number of the injured people is yet to be established.\n\nPolice are currently at the scene.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/IMG-20250215-WA0012.jpg",
            "description": "Online Reporter Three people died on the spot on Saturday afternoon following a head-on collision between a Mandaza bus and a Glen View 2 High School bus at the 40-kilometre peg along the Masvingo-Harare Road, police have confirmed. In a statement posted on X, the police said authorities are still assessing the number of injured […]",
            "time": "18:33",
            "date": "16 Feb 2025"
        },
        {
            "title": "Glen View 2 High School bus involved in accident on Harare-Masvingo highway",
            "url": "https://www.herald.co.zw/glen-view-2-high-school-bus-involved-in-accident-on-harare-masvingo-highway/",
            "content": "Online Reporter\n\nA Glen View 2 High School bus collided with a Mandaza Bus along the Harare-Masvingo Highway, about 10km after Beatrice, police have confirmed.\n\nAuthorities said investigations were underway, and more details would be released later this afternoon.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/IMG-20250215-WA0012.jpg",
            "description": "Online Reporter A Glen View 2 High School bus collided with a Mandaza Bus along the Harare-Masvingo Highway, about 10km after Beatrice, police have confirmed. Authorities said investigations were underway, and more details would be released later this afternoon.",
            "time": "18:33",
            "date": "16 Feb 2025"
        },
        {
            "title": "President Mnangagwa to attend AU Assembly today",
            "url": "https://www.herald.co.zw/president-mnangagwa-to-attend-au-assembly-today/",
            "content": "Garikai Fadzi in ADDIS ABABA, Ethiopia\n\nPRESIDENT MNANGAGWA, who is also the chairperson of SADC, will attend the official opening of the 38th Ordinary Session of the African Union (AU) Assembly of Heads of State and Government here this morning.\n\nHe will also attend a high-level breakfast briefing on South Africas G20 Presidency, hosted by President Cyril Ramaphosa of South Africa at the AU headquarters.\n\nSouth Africas G20 Presidency takes place when the world is facing a series of overlapping and mutually reinforcing crises, including climate change, underdevelopment, inequality, poverty, hunger, unemployment, technological changes and geopolitical instability.\n\nPresident Mnangagwa also has a meeting lined up with his Mozambican counterpart, President Daniel Chapo.\n\nThe two could not meet yesterday due to a packed schedule.\n\nFurther, President Mnangagwa and Hakainde Hichilema of Zambia will formally introduce the SADC and COMESA endorsed candidate for the African Development Bank (AfDB), Dr Samuel Maimbo.\n\nMore than five candidates from African countries are contesting for the AfDB presidency.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/GjsrlmAXUAAeEN_-680x380.jpg",
            "description": "Garikai Fadzi in ADDIS ABABA, Ethiopia PRESIDENT MNANGAGWA, who is also the chairperson of SADC, will attend the official opening of the 38th Ordinary Session of the African Union (AU) Assembly of Heads of State and Government here this morning. He will also attend a high-level breakfast briefing on South Africa’s G20 Presidency, hosted by […]",
            "time": "18:33",
            "date": "16 Feb 2025"
        }
    ]
}