{
    "news": [
        {
            "title": "Govt initiatives guarantee food security",
            "url": "https://www.herald.co.zw/govt-initiatives-guarantee-food-security/",
            "content": "Blessings Chidakwa, Herald Reporter\n\nTHE countrys food security will always be guaranteed starting at household level with the Government committed to supporting farmers through initiatives such as Pfumvudza/Intwasa, President Mnangagwa has said.\n\nDespite the dry spell which was experienced recently, the Government has been rolling out Pfumvudza/Intwasa, a climate-proof agricultural practice that empowers farmers, maximises agricultural potential, and enhances productivity.\n\nIn a recent interview with ZBC Television at State House in Harare, President Mnangagwa urged the nation to take issues of food security seriously, starting at household level.\n\nWhen we speak about food security at household level, we are talking about our own families countrywide taking responsibility to achieve food security at the household level.\n\nOnce that is achieved, then the country is food secure because primarily it is important that each household secures its own household needs, but our people are generally hard-working families, he said.\n\nRELATED STORIES\n\nPresident Mnangagwa said the only constraint is when the country lacks enough rain.\n\nOnce you have rain, you are sure that as a Government you can look at other aspects of feeding our people, not the countryside, he said.\n\nLeading from the front, President Mnangagwa, who is a farmer of repute himself, said he was working tirelessly to improve productivity at his Pricabe Farm in Kwekwe, taking a leaf from others.\n\nI have my young brother, Patrick, who is running the farm. I always tell him if you see someone outside the country who is producing better, you (Patrick) must go and find out how they are doing it.\n\nYou must compare yourself with the best in the country and the region. Sometimes I send him to South Africa. In whatever you do, you must match yourself with the best in your field, he said.\n\nThis year at least six million plots have been prepared under the Pfumvudza/Intwasa Presidential Agriculture Climate Proofing Input Support Scheme, with over 40 000 tonnes of basal fertiliser distributed as the Government cushions farmers from acquiring inputs.\n\nInstallation of Presidential boreholes and setting up of school and village business units countrywide has been a communal path breaker, saving lives while improving livelihoods.\n\nThe initiative has brought relief, clean and potable water to the doorsteps of communities that were previously forced to venture into crocodile-infested rivers and dams hunting for water.\n\nIn the face of climate change and the El-Nino induced drought, villagers now have access to potable water within their vicinity and village business units assisting in guaranteeing food security.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/President-Mnangagwa-6.jpg",
            "description": "Blessings Chidakwa, Herald Reporter THE country’s food security will always be guaranteed starting at household level with the Government committed to supporting farmers through initiatives such as Pfumvudza/Intwasa, President Mnangagwa has said. Despite the dry spell which was experienced recently, the Government has been rolling out Pfumvudza/Intwasa, a climate-proof agricultural practice that empowers farmers, maximises […]",
            "time": "06:38",
            "date": "31 Dec 2024"
        },
        {
            "title": "President starts leave today",
            "url": "https://www.herald.co.zw/president-starts-leave-today/",
            "content": "Blessings Chidakwa, Herald Reporter\n\nPRESIDENT Mnangagwa begins his month-long annual leave today, which he will spend in the country.\n\nIn his absence, Vice Presidents Kembo Mohadi and Dr Constantino Chiwenga will be acting in his capacity on rotational basis.\n\nVP Mohadi will start from today up to January 19, after which VP Chiwenga takes over until the Presidents return in early February.\n\nIn a statement yesterday, Acting Chief Secretary to the President and Cabinet, Mr George Charamba, confirmed the development, adding that the President will remain in the country during his vacation, ensuring his availability for responsibilities that require his personal attention.\n\nHis Excellency the President, Dr ED Mnangagwa, starts his month-long annual vacation tomorrow, 31st December, 2024, he said.\n\nHe plans to spend his vacation in the country, and will be available for commitments requiring his personal attention, both as State President and as Chairman of the Southern African Development Community (SADC).\n\nWhile he is on leave, the two Vice Presidents, Hon KCD Mohadi, and Hon Dr CGDN Chiwenga, will stand in for him in that order. Vice President Mohadi will act from 31st December, 2024 to 19th January, 2025. Thereafter, Vice President Chiwenga will act until His Excellency the President resumes duty in early February.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2017/10/GEORGE-CHARAMBA-640x380.jpg",
            "description": "Blessings Chidakwa, Herald Reporter PRESIDENT Mnangagwa begins his month-long annual leave today, which he will spend in the country. In his absence, Vice Presidents Kembo Mohadi and Dr Constantino Chiwenga will be acting in his capacity on rotational basis. VP Mohadi will start from today up to January 19, after which VP Chiwenga takes over […]",
            "time": "06:38",
            "date": "31 Dec 2024"
        },
        {
            "title": "8 000 teachers to be recruited in 2025",
            "url": "https://www.herald.co.zw/8-000-teachers-to-be-recruited-in-2025/",
            "content": "Blessings Chidakwa, Herald Reporter\n\nTHE Government will recruit more than 8 000 teachers next year in a move aimed at reducing the teacher-pupil ratio and enhancing the quality of education offered in the country, a Cabinet Minister has said.\n\nIn an interview, the Minister of Primary and Secondary Education, Dr Torerai Moyo, thanked President Mnangagwa for providing funding to recruit more teachers.\n\nIn 2024 we recruited more than 5 000 teachers. That has tremendously reduced the high teacher-pupil ratio.\n\nWith more support in 2025, we expect to recruit more than 8 000 so that we can reduce the teacher-pupil ratio to around 1:30 or 35, he said.\n\nMinister Moyo said teachers in remote areas that usually travel long distances to work are set to benefit from hardship allowances, with the Government implementing a cocktail of measures to bridge the gap between rural teachers and their urban counterparts.\n\nUnder the Second Republic, Government is also upgrading rural schools to improve the quality of education offered.\n\nMinister Moyo said as they continue to bridge urban-rural divide, 150 rural schools have been solar powered, with more earmarked for the coming year.\n\nThe Government also plans to build 2 800 schools to further reduce the distance learners walk to school.\n\nMinister Moyo said plans were afoot to provide teachers from remote areas with hardship allowances.\n\nThere is a hardship allowance because we know some of the schools are located quite a distance from the living quarters.\n\nWhere teachers might be walking a kilometre or more, we tend to provide a hardship allowance, he said.\n\nMinister Moyo said the Government is also upgrading rural schools to improve the quality of education.\n\nWe used to have quite a number of disparities in terms of access to education, opportunities to access digital tools and some schools did not even have electricity, but the Government has solarised some of the schools supported by UNICEF.\n\nWe receive support from the fiscus where we are allocated funds towards teaching learning materials. About 150 schools were solarised this year, he said.\n\nMinister Moyo said they have also decentralised the recruitment of teachers where even the most competent can be deployed to rural areas.\n\nHe said normally teachers prefer to work in schools close to their homes and in such instances, some might even choose to work from their homes.\n\nZimbabwe is ahead of its African peers in the provision of quality education with the Second Republic under President Mnangagwa committing a huge chunk of its budget towards the sector.\n\nCurrently, Government is building new schools to ensure every child, regardless of location or financial background, acquires basic education.\n\nFor perspective, while on average a child in Africa has to walk more than 15km to access the nearest school, in Zimbabwe the average distance is 5km.\n\nWhile on the continent it is estimated that 9 out of 10 children under the age of nine find it hard to read or write, in Zimbabwe only one out of 10 children under 9 years can neither read nor write.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/02/cde-Torerai-Moyo.jpg",
            "description": "Blessings Chidakwa, Herald Reporter THE Government will recruit more than 8 000 teachers next year in a move aimed at reducing the teacher-pupil ratio and enhancing the quality of education offered in the country, a Cabinet Minister has said. In an interview, the Minister of Primary and Secondary Education, Dr Torerai Moyo, thanked President Mnangagwa […]",
            "time": "06:38",
            "date": "31 Dec 2024"
        },
        {
            "title": "President, a leader rooted in Biblical wisdom",
            "url": "https://www.herald.co.zw/president-a-leader-rooted-in-biblical-wisdom/",
            "content": "Bulawayo Bureau\n\nPRESIDENT Mnangagwas address to the annual National Thanksgiving and Dedication Service at the Zimbabwe International Exhibition Centre in Bulawayo on Sunday revealed a leader deeply-rooted in Biblical scripture, intertwining his faith with his vision for the countrys development trajectory.\n\nHis speech, delivered with the confidence of a seasoned preacher, was a reflective demonstration of his understanding of the Bible and its relevance to modern governance.\n\nThroughout his address, the President cited multiple biblical verses, weaving them seamlessly into his message of unity, patriotism and resilience.\n\nFrom Jeremiah 3:15 to Deuteronomy 28:1-6, his use of scripture underlined his commitment to leading the country with divine guidance.\n\nQuoting Jeremiah 3:15, I will give you shepherds according to my heart, who will feed you with knowledge and understanding, the President likened the role of leaders, including himself, to that of spiritual shepherds.\n\nHe commended the Church for its steadfast commitment to spreading the uncorrupted word of God, describing it as a beacon of hope and wisdom for the nation.\n\nThe Church in Zimbabwe is rallying us all to progressive, Godly, and Biblical patriotism, President Mnangagwa said, stressing the importance of aligning national goals with divine principles.\n\nThe Presidents speech was steeped in the biblical call for love and unity. Referencing John 15:12-13, he reminded congregants of Jesus commandment to love one another, saying love should remain ingrained within the Church and the nation.\n\nAs the Church in Zimbabwe, let us remain inspired by the wise counsel of the Lord Jesus Christ in John Chapter 15 verses 12 and 13 which says, My command is this: Love each other as I have loved you. Greater love has no one than this: to lay down ones life for ones friends, he said.\n\nPresident Mnangagwas exhortation to the youth was equally grounded in scripture. Urging them to embrace their heritage and resist external detractors, he invoked Psalm 137:5-6.\n\nBorrowing from the exhortations in Psalm Chapter 137 verses 5 and 6, I also urge us, individually and collectively, to patriotically proclaim that, If I forget Zimbabwe, let my right hand forget her skill. If I do not remember nor prefer Zimbabwe above my own joy, let my tongue cling to the roof of my mouth, said President Mnangagwa.\n\nThe youth of our country are particularly challenged to resist the machinations by detractors to have them hate or look down upon their own motherland, Zimbabwe. Never be blind to the vast potential of our land.\n\nOpen your eyes and hearts to truly love and be committed to the land of your birth. You, the youth, are the future of this great country.\n\nPresident Mnangagwas Vision 2030, which aims to transform Zimbabwe into an upper-middle-income economy, is firmly anchored in biblical teachings. He cited Genesis 1:28, which calls for humanity to be fruitful and subdue the earth, as a guiding principle for the nations focus on production and productivity.\n\nThe President also invoked Deuteronomy 28:1-6, assuring citizens that obedience to Gods commandments would bring blessings to the nations cities, countryside, children, and economy.\n\nIndividually and collectively, we must hold firm each others hands, as we develop our country. Deuteronomy Chapter 28 verses 1 to 6 assures us of the abundant blessings that come about as a result of obedience and walking in the fear of the Lord.\n\nIf Zimbabwe fully obeys the Lord our God; and carefully follows His commands that He has given us, the Lord our God will set us far above other nations, he said.\n\nThe Presidents inspirational speech highlighted tangible actions aligned with biblical values, including efforts to mitigate climate change through dam construction and borehole drilling, and the rapid modernisation of infrastructure.\n\nPresident Mnangagwa credited these achievements to divine blessings, urging citizens to raise their arms in thanksgiving.\n\nWe will be blessed in our cities and blessed in the countryside. Our children will be blessed; and the crops of our land; and our livestock; our herds and our flocks will also be blessed. Zimbabwe will be blessed when we go in, and blessed when we go out, he said, concluding with a prayerful commitment to unity and dedicating the nation to God.\n\nIf we obey the word of the Lord, the Almighty God will grant that the enemies who rise up against us, will be defeated before us.\n\nThey will come to us in one direction, and flee from us in several, and the Lord will send a blessing on everything our nation sets out to do.\n\nPresident Mnangagwas ability to draw on scripture to inspire and guide his audience reflects a leader who sees governance as a divine mandate. His message resonated with many, portraying him as a statesman whose faith informs his vision for Zimbabwe.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/HE-1.jpg",
            "description": "Bulawayo Bureau PRESIDENT Mnangagwa’s address to the annual National Thanksgiving and Dedication Service at the Zimbabwe International Exhibition Centre in Bulawayo on Sunday revealed a leader deeply-rooted in Biblical scripture, intertwining his faith with his vision for the country’s development trajectory. His speech, delivered with the confidence of a seasoned preacher, was a reflective demonstration […]",
            "time": "06:38",
            "date": "31 Dec 2024"
        },
        {
            "title": "Zimbabweans urged to reject detractors’ narratives",
            "url": "https://www.herald.co.zw/zimbabweans-urged-to-reject-detractors-narratives/",
            "content": "Nqobile Bhebhe\n\nZIMBABWEANS have been urged to steadfastly reject misleading narratives from detractors seeking to downplay the significant progress achieved under the Second Republic.\n\nThe nation is experiencing remarkable growth in agriculture, mining, tourism, infrastructure development, media and health sectors, among others.\n\nSince his inauguration in 2017, President Mnangagwa has championed economic growth through initiatives such as Zimbabwe is Open for Business, aimed at attracting foreign direct investment (FDI) and steering the country towards achieving upper-middle-income status by 2030.\n\nDespite challenges such as climate change-induced droughts and Western-imposed sanctions, the Second Republic has made notable strides. However, some elements continue to claim that the country is regressing.\n\nAddressing thousands of congregants, including President Mnangagwa and Cabinet ministers, at the 8th National Thanksgiving and Dedication Service in Bulawayo on Sunday, Faith of the Nation Campaign founder and chairperson, Reverend Andrew Wutawunashe, said there is a need to recognise Zimbabwes undeniable growth trajectory.\n\nYour Excellency, it is of critical importance that we the people of Zimbabwe, who through a divinely assisted revolution were granted by the Lord this our own promised land, do not derail the tremendous progress which we have made in all fields as a nation since liberation which was our own God-given national exodus, and in particular since the ushering in of the Second Republic only a short seven years ago, he said.\n\nWe must resolutely reject the deceptive, destructive, and malignant voices of those who maliciously deny the exciting potential of our country and the evident progress we have made under the Second Republic as we pursue the laudable goals of Vision 2030.\n\nRev Wutawunashe urged citizens to unite in building Zimbabwe into the most competitive African country of the 21st century.\n\nLet us also with a clear-headed and visionary understanding that the Lord has made us owners and stewards of a land with great future potential, join hearts, heads and hands in unity and apply ourselves to the task of building Zimbabwe into the most competitive African country of the 21st century, to the benefit and upliftment of our people, he said.\n\nThe Minister of Information, Publicity, and Broadcasting Services, Dr Jenfan Muswere, highlighted key achievements of the Second Republic in 2024, during an interview with ZBC recently.\n\nAmong these were infrastructure projects, economic empowerment initiatives, and advancements in tourism, broadcasting, and land reform.\n\nDr Muswere provided a detailed overview of the Second Republics achievements in various key sectors.\n\nThe focus for the year 2024 is that we have registered under the 100-day cycle projects, another 346 projects which have got a lot of positive life-changing impact in terms of poverty alleviation and also in terms of macro-economic growth, he said.\n\nAnd also what is of key importance is the 2024/2025 agricultural season which has grown by more than 300 percent, which also reflects the Governments commitment in terms of ensuring that we achieve food security. Yes, we have been affected here and there by the drought which is environmentally induced.\n\nZion Christian Church leader, Bishop Nehemiah Mutendi, acknowledged that while challenges persist, patience and perseverance would see the nation overcome them.\n\nChallenges are inevitable. Let us remain steadfast in our pursuit of a better future for Zimbabwe, knowing that with patience and perseverance, our nation will overcome all obstacles, he said.\n\nIn his address, President Mnangagwa said as the nation looks to the future, it is emboldened by the goodness of the Almighty God that helped to liberate the country from colonial bondage and ultimately helped Zimbabweans repossess their land that was in the hands of white colonialists.\n\nToday, we stand proud and tall as a truly free and independent people, enjoying the freedom of worship and advancing Godly values as well as a people-centred national development agenda, he said.\n\nThe President added that developmental programmes will continue to be implemented under the Second Republic.\n\nPresident of the Chiefs Council, Senator Chief Mtshane Khumalo, echoed the Presidents call for grassroots involvement in national development.\n\nOur President has been moving around the country preaching the nyika inovakwa nevene vayo mantra and people have taken this message and are building the nation from the grassroots. We need to be at the forefront of the development of our nation from our areas and as Chiefs we are going to work towards the development of our nation, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/12/Apostle-Andrew-Wutawunashe.jpg",
            "description": "Nqobile Bhebhe ZIMBABWEANS have been urged to steadfastly reject misleading narratives from detractors seeking to downplay the significant progress achieved under the Second Republic. The nation is experiencing remarkable growth in agriculture, mining, tourism, infrastructure development, media and health sectors, among others. Since his inauguration in 2017, President Mnangagwa has championed economic growth through initiatives […]",
            "time": "06:38",
            "date": "31 Dec 2024"
        },
        {
            "title": "Authorities intensify crackdown on smuggling",
            "url": "https://www.herald.co.zw/authorities-intensify-crackdown-on-smuggling/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nZimbabwe is ramping up efforts to combat smuggling along the border with South Africa, where significant revenue losses to syndicates have been reported.\n\nThe national anti-smuggling task force is at the forefront of this initiative, with goods worth millions of dollars in import duties seized in recent operations between Beitbridge and Harare.\n\nThe crackdown is being led by the Ministry of Industry and Commerce, alongside the Zimbabwe Revenue Authority (Zimra), the Zimbabwe Republic Police, the Reserve Bank of Zimbabwe (RBZ), and the Consumer Protection Commission.\n\nThe goal is to halt the influx of illicit goods into local markets.\n\nRecent efforts have resulted in the interception of numerous intercity buses loaded with suspected smuggled goods.\n\nAccording to security officials, smugglers are avoiding the border and using the border flanks. They then load the goods into intercity buses or cargo trucks in Beitbridge before transporting them to various destinations in Zimbabwe.\n\nTo enhance surveillance, authorities are deploying high-tech security systems, including drone surveillance.\n\nSince the introduction of these systems and fast cargo scanners in January, Zimra has been able to intercept more people planning to smuggle imported goods.\n\nThe crackdown has intensified in known smuggling hotspots, with additional drones and scanners set to be deployed to other entry points like Forbes and Chirundu.\n\nNational police spokesperson, Commissioner Paul Nyathi, last night said: We are carrying out a joint anti-smuggling operation with other stakeholders including Zimra.\n\nImporters or exporters are encouraged to do so within the confines of the countrys customs laws. Where duty must be paid, it must be done and we dont condone smuggling.\n\nOur joint efforts are paying dividends. We have intercepted a number of goods that have been smuggled into our country and this cannot go on forever.\n\nHe said the operation is targeting buses, private cars and commercial trucks which are being used as conduits for smuggled goods.\n\nComm Nyathi emphasised that none will be spared during the operation, including visitors who wilfully break the law.\n\nFinance, Economic Development and Investment Promotion Minister, Professor Mthuli Ncube noted that the operation is crucial for safeguarding local industries.\n\nThis is a critical issue, and we want to deal with the smuggling which is negatively impacting local businesses, and the Government is losing revenue, he said.\n\nSpeaking during a visit by the Public Accounts Committee at Beitbridge recently, Zimras Commissioner for Customs and Excise, Mr Batsirai Chadzingwa, said all the 16 State warehouses at the border were overflowing with detained goods.\n\nHe explained that most goods are detained for falling under restricted categories, including meat and lithium.\n\nGoods can be held for 60 to 90 days under the Customs and Excise Act.\n\nVarious disposal methods, including rummage sales and destruction, are used to clear warehouses.\n\nIn case of the appropriation of goods, the beneficiaries include Government departments, hospitals and social welfare organisations, Chadzingwa added.\n\nThis intensified crackdown aims to protect local businesses and ensure compliance with Zimbabwes customs laws, sending a strong message against smuggling activities.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/smuggling.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau Zimbabwe is ramping up efforts to combat smuggling along the border with South Africa, where significant revenue losses to syndicates have been reported. The national anti-smuggling task force is at the forefront of this initiative, with goods worth millions of dollars in import duties seized in recent operations between Beitbridge and […]",
            "time": "06:38",
            "date": "31 Dec 2024"
        },
        {
            "title": "EDITORIAL COMMENT: Tourism growth to create more jobs, boost economy",
            "url": "https://www.herald.co.zw/editorial-comment-tourism-growth-to-create-more-jobs-boost-economy/",
            "content": "TOURISM has been growing fast and now contributes 12 percent of National Gross Domestic Product, that is one dollar in eight to our national wealth.\n\nIt is set to grow even more fairly quickly as it leverages on Zimbabwes natural resources and climate.\n\nGrowing tourism requires, like all economic activity, investment, but it is an industry where the investment per dollar of return is lower than most, and more importantly in a Zimbabwean context there are lot of openings for family and smaller businesses as well as major hotels and specialist chains.\n\nThe other major gain from tourism is that it is a labour intensive industry.\n\nA lot of services that tourists require have to be provided by humans, rather than machines. A large slice of the new jobs are at the lower end of the pay scales, but there is also work that requires high levels of skills and this is why there must be continued emphasis on training.\n\nAlready there have been efforts, including degree courses, along with the practical training in what amount to apprenticeships.\n\nWhen it comes to very practical skills in areas where one is largely dealing with people, while some theoretical background can be essential, it is even more essential that those in training can be with and understudying those who are already accomplished and successful.\n\nThis is important when we look at the limits to mass tourism to Zimbabwe, that is being at the end of a continent and needing long flights to get here.\n\nThat can be overcome as it is being overcome with the multi-country package tours, and we must not neglect this market, but we must also work out ways of making sure every visitor spends more time in the country.\n\nThe emphasis placed by Tourism and Hospitality Industry Minister Barbara Rwodzi on the contribution to national wealth, rather than just arrivals, is correct, as with all economic sectors it is the value that is important.\n\nOne well-off visitor spending a week in Zimbabwe will add considerably more value, and create more employment and spend more money, than a group of more ordinary people flying in for a day.\n\nThe industry is going far beyond just attracting people to the country to see the Victoria Falls and the wildlife, with a major effort now concentrating on conferences, meetings and exhibitions, where those attending will spend several days in the country on business and many can be persuaded to extend their stay after the official part of their trip and have a bit of a holiday.\n\nThis sort of institutional business tourism provides a solid base for those in the hospitality industry.\n\nZimbabwe is building its reputation in this area, by providing good and efficient services at reasonable prices in areas where there are also other attractions for those attending when they pack in for the day, and which they may want to enjoy once the conference is over.\n\nAnother area where Zimbabwe is now acquiring a good name is the luxury end of the market, especially for specialist wild area and wildlife tourism.\n\nRecently, we even had a group of billionaires, rather than just one or two, seeking one of these special holidays of what must be a high level of luxury and service in the wilds of Africa, and all this in total safety.\n\nBoth the conference tourism and the luxury tourism require a large group of highly-skilled people who can cater for every need of these sort of visitors, who are used to the best.\n\nThis will increasingly require extra language skills, as will the middle-class mass market, if we are to help people feel at home when they are here.\n\nWhile many of those in international organisations attending a conference or who are used to the really top end of business finance will be fluent in the main international language, English, many will appreciate a serious effort to understand their own language and culture.\n\nThis becomes more important as we look at growing that package tour market as many Asians from countries that have been through their rapid cycle of economic growth are now looking at extending their horizons.\n\nWhile these groups often have their own tour guide and courier who flies in with them, there are obviously openings for Zimbabweans able to offer the same service and able to do so at high levels of competence.\n\nThis is an example of where smaller businesses with a good reputation and the right people can flourish as they put together something that goes a bit further than what a tour group might be used to and so get better value.\n\nWe also need to keep building our regional identity, already seen very strongly in the ever closer ties between tour operators in Zimbabwe, Botswana and Zambia in what has now been formalised as the Kavango-Zambezi Trans Frontier Conservation Area, but which was already operating as a single tourism destination before the signatures.\n\nWe could almost certainly upgrade the ties with Mozambican and Namibian operations to ensure that we can add sea coasts to the vast range of interior attractions.\n\nTourism is a highly competitive industry. Zimbabwe had a bad press at one time, but that seems to now be in the past as more and more people come.\n\nBut we have to make sure that these visitors have a good time, receive value for money, and enjoy their visit. Marketing is needed, but in the end the most effective marketing is by word of mouth, people recommending Zimbabwe to their friends and even posting good reviews on their social media sites.\n\nAnd that means relentless adherence to high standards, since one bad experience can dampen enthusiasm of others. But so long as we do adhere to these standards, we will see this industry grow, create ever more wealth and many more jobs.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/06/Barbara-Rwodzi.jpg",
            "description": "TOURISM has been growing fast and now contributes 12 percent of National Gross Domestic Product, that is one dollar in eight to our national wealth. It is set to grow even more fairly quickly as it leverages on Zimbabwe’s natural resources and climate. Growing tourism requires, like all economic activity, investment, but it is an […]",
            "time": "06:38",
            "date": "31 Dec 2024"
        },
        {
            "title": "Commission calls for gender monitoring mechanisms",
            "url": "https://www.herald.co.zw/commission-calls-for-gender-monitoring-mechanisms/",
            "content": "Farirai Machivenyika, Senior Reporter\n\nThe Zimbabwe Gender Commission (ZGC) has called on Government and other stakeholders to strengthen monitoring mechanisms to ensure institutional compliance with existing legal provisions that promote gender equality, ZGC chairperson, Mrs Margaret Mukahanana-Sangarwe has said.\n\nShe said this in the executive summary of the 2023 ZGC annual report tabled in parliament recently.\n\nBased on its findings and experiences in 2023, the ZGC put forward several recommendations to stakeholders.\n\nThese include urgent action to enact laws and policies promoting gender equality, strengthen monitoring mechanisms to ensure compliance, allocate adequate resources to support gender equality initiatives, invest in capacity building for stakeholders, and foster collaboration and partnerships, she said.\n\nIn the report, she said ZGC, in partnership with various organisations, had developed a Womens Charter ahead of the 2023 harmonised elections calling for an increased participation of women in politics and leadership positions to meet the 50/50 Constitutional provision on equal representation of women and men in politics.\n\nSome of the issues in the Charter included alignment of the Electoral Act to give powers to the Zimbabwe Electoral Commission to disqualify political parties that do not adhere to 50/50 as they submit party lists, replacement of first past the post electoral system with proportional representation, alignment of political party Constitutions to the 50/50 Constitutional provisions, enactment of a Gender Equality Act to guarantee the full actualisation of gender equality Constitutional provisions, she said.\n\nThe ZGC also called on political parties to be gender sensitive and inclusive in the selection of candidates while the Political Parties Financing Act needed to be amended to ensure that political parties are obliged to distribute resources to women candidates of all ages and abilities on an equal basis and in equal measure with men.\n\nTurning to sexual harassment at the workplace, the ZGC bemoaned the low levels of awareness of the practice by staffers especially among women who are the victims in most cases.\n\nThroughout the sessions, the staff expressed the need for the country to ratify and domesticate ILO Convention 190 and enact the sexual harassment law at national level.\n\nDevelopment of workplace sexual harassment policies with clear reporting procedures and penalties was also recommended, the report reads.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/04/Margaret-Mukahanana-Sangarwe.jpg",
            "description": "Farirai Machivenyika, Senior Reporter The Zimbabwe Gender Commission (ZGC) has called on Government and other stakeholders to strengthen monitoring mechanisms to ensure institutional compliance with existing legal provisions that promote gender equality, ZGC chairperson, Mrs Margaret Mukahanana-Sangarwe has said. She said this in the executive summary of the 2023 ZGC annual report tabled in parliament […]",
            "time": "06:38",
            "date": "31 Dec 2024"
        },
        {
            "title": "Romanticising oppression: Hidden dangers of Rhodesian nostalgia",
            "url": "https://www.herald.co.zw/romanticising-oppression-hidden-dangers-of-rhodesian-nostalgia/",
            "content": "Taurai Kandishaya, Herald Correspondent\n\nIn recent online discussions, a troubling trend has emerged: some individuals have begun to romanticise Rhodesia as a golden age of prosperity.\n\nAs a committed member of ZANU PF, it is critical to address this issue, not only to correct historical inaccuracies, but also to protect the legacy of our nations journey towards liberation and independence.\n\nThis article will provide a factual analysis of why Rhodesia should never be romanticised, challenging the distorted narrative that suggests Rhodesia was a period of prosperity.\n\nThe claim that Rhodesia was on a positive developmental trajectory is not only misleading, but also dangerous. A closer examination of Rhodesias economic and social systems reveals that, had it persisted, the prospects for black Zimbabweans would have been devastating, if not fatal.\n\nThis idealisation of Rhodesia is not merely a nostalgic reflection of the past, it poses a significant threat to our collective future.\n\nThe glorification of Rhodesia, particularly by some black Zimbabweans, reflects a disturbing disconnection from the painful and brutal realities of the colonial experience.\n\nIt ignores the fact that the colonial regime exploited, impoverished, and dehumanised our people to such an extent that they were forced to take up arms, endure a brutal war, and leave their homes to fight from the bush.\n\nIt is inconceivable that, had there been any genuine prospects for development, democracy, and human rights, our people would have chosen the arduous path of war.\n\nThe absence of any semblance of prosperity or justice during this period underscores why romanticising Rhodesia is not just inaccurate but a betrayal of the sacrifices made for liberation.\n\nAddressing these historical facts is especially important for the youth, who may be new to politics and are being targeted by our erstwhile enemies.\n\nThese enemies, operating through the opposition, aim to reverse the gains of the liberation struggle. To counter this misinformation, it is essential to recount the truths of our past, present, and future so that the youth can understand the reality of what Zimbabwe represents and what is at stake.\n\nThis issue must also be understood within the broader context of growing global far-right movements, which seek to reverse the progress made by liberation movements worldwide.\n\nThere is a resurgence of Cold War-era perspectives, particularly in the Western world, which have been re-purposed to guide foreign policy.\n\nThis has manifested in attacks on ruling governments, often under the guise of facilitating development, but in reality, serving to impose systems more aligned with neoliberal and imperialist interests.\n\nThe global trend of undermining liberation movements is not coincidental. Movements like ZANU PF, with a proud history of fighting imperialism, are targeted because they challenge these interests.\n\nWhat we are witnessing today, with the glorification of Rhodesia, is part of a broader effort to undermine liberation movements.\n\nThe nostalgia for Rhodesia aligns with efforts to delegitimise the sacrifices and successes of the liberation struggle.\n\nIt is deeply concerning to see former colonisers advocate for a return to colonialism under the pretext of development. This rhetoric, eerily reminiscent of the civilising mission narrative used to justify colonialism in the past, should alarm anyone concerned about the future of humanity.\n\nOne of the most pervasive and dangerous myths perpetuated by this nostalgia is the idea that Rhodesia was a period of economic prosperity. Proponents of this view claim that Rhodesia was on a growth trajectory, conveniently ignoring the systemic exclusion, exploitation, and denial of rights that defined the colonial period.\n\nThe so-called prosperity was reserved for a small minority, built upon the oppression of the black majority.\n\nAny economic growth during the Rhodesian era was exclusive and unequal, benefiting only a select few. This myth not only distorts reality, but also disrespects the sacrifices of our liberation heroes.\n\nComparing Rhodesias economic management to post-independence Zimbabwe requires an understanding of the vastly different realities.\n\nWhile Rhodesia may have seen some isolated instances of economic growth, these were designed to serve colonial interests, not the well-being of the majority.\n\nInfrastructure projects like Lake Kariba, hospitals, and railways were not built to benefit the black majority. Instead, they facilitated resource extraction and served white commercial interests. The lack of investment in black communities, such as the absence of electricity and roads in rural areas, demonstrates that Rhodesian development was rooted in exploitation, not progress.\n\nBy contrast, post-independence Zimbabwe has made significant efforts to address these historical inequities. Initiatives like land reform, command agriculture, road construction, and investments in education and youth development represent a commitment to correcting past injustices and building a more equitable society.\n\nThese efforts highlight the governments dedication to rebuilding the nation and ensuring a fair distribution of resources.\n\nIn summary, the romanticisation of Rhodesia is a dangerous distortion of history and a threat to the progress we have achieved. It dismisses the harsh realities of the past, undermines the sacrifices of our liberation heroes, and jeopardizes the future we are building.\n\nAs Zimbabweans, we must reject this nostalgic view and continue educating future generations about the true cost of our freedom.\n\nTo do otherwise risks erasing the hard-won achievements of our liberation struggle and jeopardising the dignity, equality, and justice we strive to uphold.\n\nCde Taurai Kandishaya is the Deputy National Political Commissar ZANU PF Youth League\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Beitbridge-1.jpg",
            "description": "Taurai Kandishaya, Herald Correspondent In recent online discussions, a troubling trend has emerged: some individuals have begun to romanticise Rhodesia as a “golden age” of prosperity. As a committed member of ZANU PF, it is critical to address this issue, not only to correct historical inaccuracies, but also to protect the legacy of our nation’s […]",
            "time": "06:38",
            "date": "31 Dec 2024"
        },
        {
            "title": "Trade deficit narrows 66 percent to US$44m",
            "url": "https://www.herald.co.zw/trade-deficit-narrows-66-percent-to-us44m/",
            "content": "Oliver Kazunga\n\nSenior Business Reporter\n\nZimbabwes trade deficit decreased by 66 percent to US$46,9 million in November this year on account of improved export performance of gold and tobacco.\n\nA trade deficit shows the difference between the value of a countrys exports and imports and a fall in the deficit is normally considered a positive development, as that means the country can conserve precious foreign currency for key obligations.\n\nIn its latest report, the Zimbabwe National Statistics Agency (ZimStat) said, Zimbabwes goods trade deficit for November 2024 was US$46,9 million, a 66 percent decrease from the October 2024 deficit of US$137,8 million.\n\nIn November, Zimbabwes exports amounted to US$905,2 million, representing a 29,7 percent increase from the October 2024 value of US$698,1 million.\n\nAmong the top 10 products exported in November were semi-manufactured gold, tobacco, partly or wholly stemmed/stripped, and nickel mattes, accounting for 39,7 percent, 30,5 percent, and 11 percent respectively of the total value of exports during the month under review.\n\nZimbabwes major export destinations during the month under review were the United Arab Emirates, accounting for 40,5 percent of the total value of exports, China and South Africa (19,9 percent each).\n\nThe three countries accounted for around 80 percent of the total export value.\n\nDuring the month under review, Zimstat indicated imports totalled US$952,1 million, reflecting a 13,9 percent increase from the October value of US$835,9 million.\n\nMineral fuels, mineral oils and products, machinery and mechanical appliances, cereals, and vehicles were among the top 10 imported products in November.\n\nThe products constituted 22,1 percent, 11,9 percent, 9,1 percent and 7,6 percent of the total import value of US$952,1 million respectively, said Zimstat.\n\nIn 2023, the countrys total value of exported goods grew by close to 10 percent to US$7,2 billion from US$6,59 billion realised over the same period in 2022.\n\nUnderpinned by the National Development Strategy 1 (NDS1), ZimTrade  the country trade promotion and development agency seeks to improve total exports by at least 10 percent yearly to US$14 billion by 2030, where the Government targets an upper middle-income society status.\n\nNDS1 is a five-year economic development policy that ends in 2025 after which a similar blue-print, NDS2, from 2026 would take the country to the desired vision.\n\nSince its launch, the Government has made significant strides towards implementation of the NDS1 targets.\n\nAccording to the mid-term concept note released last year, most of the projections have been met across all the 14 thematic priority areas including economic growth and stability, environmental protection, social protection, health, food and nutrition security, digital economy, and human capital development.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/02/zimstat.jpg",
            "description": "Oliver Kazunga Senior Business Reporter Zimbabwe’s trade deficit decreased by 66 percent to US$46,9 million in November this year on account of improved export performance of gold and tobacco. A trade deficit shows the difference between the value of a country’s exports and imports —  and a fall in the deficit is normally considered a […]",
            "time": "06:38",
            "date": "31 Dec 2024"
        }
    ]
}