{
    "news": [
        {
            "title": "Quartet disqualified in ZIFA polls",
            "url": "https://www.herald.co.zw/quartet-disqualified-in-zifa-polls/",
            "content": "Eddie Chikamhi\n\nZimpapers Sports Hub\n\nFOUR hopefuls including Temba Mliswa, Farai Jere, Walter Magaya and former Zimbabwe captain Benjani Mwaruwari have failed to make the final shortlist for the upcoming election of the ZIFA presidency.\n\nThe quartet was dropped after failing to meet the eligibility criteria. This leaves six candidates in contention for the associations hot seat, and these are Martin Kweza, Makwinji Soma-Phiri, Twine Phiri, Philemon Machana, Marshall Gore and Nqobile Magwizi.\n\nZIFA Normalisation Committee also announced 10 successful candidates to stand for the vice-presidency and 36 for ordinary board members. The positions to be contested for on January 25 include the president, two vice presidents and six ordinary board members.\n\nA statement from ZIFA said, The ZIFA Normalisation Committee acting as the ZIFA Electoral Committee in accordance with Article 85(9) is pleased to announce the names of all the candidates who have met the eligibility criteria stipulated in the ZIFA Statutes, 2024. The list of successful candidates is as follows:\n\nPresidential Candidates:\n\nMarshall GorePhilemon MachanaNqobile MagwiziMartin KwezaTwine PhiriMakwinje Phiri\n\nVice President Candidates:\n\nMavis GumboPatience MutumwaWinnet MurotaJoyce R KapotaLoveness MukuraKennedy NdebeleOmega SibandaPeter DubeFrancis NyamutsambaSimbarashe J Takavada\n\nOrdinary Members:\n\nGilbert SaikaSharif Mussa UmerjeeThomas MarambanyikaNicholas MunyongaTavengwa HaraXolisani GweselaBhekhimpilo NyoniVincent ChawonzaSween MushongaLewis MuzharaMorden NgwenyaJerrymike GumboAlice ZeureAlois BunjiraMorgen DubeSabelo MaposaEdward MutukwaTizirayi LuphahlaSibekikwe NdlovuTafadzwa BenzaCecilia GambeKudzai KadzombeSunday ChidzambwaWalter MusanhuDesmond AliSimbarashe NdoroMakwinji PhiriFrancis NyamutsambaDavison MuchenaBrighton UshendibabaEdmore ChiveroTerence T MalungaHarlington ShereniCuthbert C ChitimaNorman MatemeraBeaullar Msarah\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/05/Temba-Mliswa-680x380.jpg",
            "description": "Eddie Chikamhi Zimpapers Sports Hub FOUR hopefuls including Temba Mliswa, Farai Jere, Walter Magaya and former Zimbabwe captain Benjani Mwaruwari have failed to make the final shortlist for the upcoming election of the ZIFA presidency. The quartet was dropped after failing to meet the eligibility criteria. This leaves six candidates in contention for the association’s […]",
            "time": "21:46",
            "date": "23 Dec 2024"
        },
        {
            "title": "Early Christmas treat for people with albinism in Chitungwiza",
            "url": "https://www.herald.co.zw/early-christmas-treat-for-people-with-albinism-in-chitungwiza/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nThe Albino Charity Organisation of Zimbabwe (ALCOZ) has received an early Christmas gift in the form of a donation of groceries and personal care items from Premier Corporate Gifts, bringing joy to many.\n\nThe donation, handed over during a small ceremony in Chitungwiza, included cooking oil, maize meal, rice, flour, spaghetti, bathing and washing soap, sugar, cups, hats, t-shirts and sunscreen among other necessities.\n\nSpeaking at the event, Mrs Loveness Mainato, the executive director of ALCOZ, expressed heartfelt gratitude for the support.\n\nShe said the donations would significantly impact the lives of those living with albinism, many of whom face daily challenges due to stigma and limited resources.\n\nThis gesture is more than just material support; it is a sign of care and recognition for the struggles faced by the albinism community, Mrs Mainato said.\n\nThe groceries and personal items will go a long way in making this festive season brighter for many families. We are deeply grateful to Premier Corporate Gifts for thinking of us.\n\nPremier Corporate Gifts managing director, Mrs Betty Mpala, highlighted the companys commitment to giving back to the community, particularly to marginalised groups.\n\nAs a company, we believe in spreading love and hope, especially during the festive season, she said\n\n We recognise the unique challenges faced by the albinism community and wanted to provide practical support to make their Christmas special. We are honored to partner with ALCOZ in this endeavor.\n\nMrs Mainato called on other organisations and individuals to follow Premier Corporate Gifts example and support initiatives that uplift vulnerable communities.\n\nThis donation is a testament to the power of partnership and the positive change that comes when organisations prioritise social responsibility. Together, we can build a more inclusive and supportive society, she said.\n\nThe event ended with smiles and a spirit of togetherness as the beneficiaries received their early Christmas packages, setting a tone of hope and gratitude for the festive season.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/IMG-20241223-WA0035-680x380.jpg",
            "description": "Ivan Zhakata  Herald Correspondent  The Albino Charity Organisation of Zimbabwe (ALCOZ) has received an early Christmas gift in the form of a donation of groceries and personal care items from Premier Corporate Gifts, bringing joy to many. The donation, handed over during a small ceremony in Chitungwiza, included cooking oil, maize meal, rice, flour, spaghetti, […]",
            "time": "21:46",
            "date": "23 Dec 2024"
        },
        {
            "title": "Two poachers die in shootout with Zimparks rangers",
            "url": "https://www.herald.co.zw/two-poachers-die-in-shootout-with-zimparks-rangers/",
            "content": "Walter Nyamukondiwa\n\nMashonaland West Bureau Chief\n\nZimparks rangers have shot and killed two suspected poachers in the Musingwizi area of Makuti in Hurungwe district.\n\nThe two poachers came in contact with Zimparks rangers leading to exchange of gun fire, resulting in their death.\n\nPolice confirmed the death of the two poachers through their social media X platform.\n\nThe ZRP confirms the death of two poachers during a shootout with Zimparks rangers in Musingwizo Area, Makuti on 21/12/24. More details to be released in due course, said the police.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/04/ZimParks.jpg",
            "description": "Walter Nyamukondiwa Mashonaland West Bureau Chief Zimparks rangers have shot and killed two suspected poachers in the Musingwizi area of Makuti in Hurungwe district. The two poachers came in contact with Zimparks rangers leading to exchange of gun fire, resulting in their death. Police confirmed the death of the two poachers through their social media […]",
            "time": "21:46",
            "date": "23 Dec 2024"
        },
        {
            "title": "Shoppers, travellers flood Harare as Christmas preps reach Climax",
            "url": "https://www.herald.co.zw/shoppers-travellers-flood-harare-as-christmas-preps-reach-climax/",
            "content": "Trust Freddy\n\nHerald Correspondent\n\nHarares streets are packed as shoppers are flocking to the citys markets and malls in search of last-minute Christmas goodies, while bus terminuses are congested with travellers seeking to catch buses to different parts of the country for the holidays.\n\nRetailers across the city are experiencing a significant surge in sales, with both formal and informal traders benefiting from the last-minute shopping rush.\n\nTravellers wait for transport to different rural areas at Mbare bus terminus today\n\nGroceries, clothing, and gift items are flying off the shelves, while bars and entertainment venues are also cashing in on the festive spirit.\n\nIn the CBD, there is high volumes of both vehicle and human traffic, especially in the downtown area, where tuckshops and boutiques are selling goods at cheap prices.\n\nMeanwhile, beauty parlours are also bustling with activity, as women are getting their hair and makeup done in preparation for the festive season.\n\nSimilarly, barber shops are recording brisk business, as men and some women opt for stylish haircuts to look their best for Christmas celebrations.\n\nAll roads leading to Mbare bus terminus are heavily congested, and the bus terminus itself is packed with thousands of travellers, mostly bound for rural areas.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/8428a76b-f70c-4bb4-8356-ef6fefbaaf36-680x380.jpeg",
            "description": "Trust Freddy Herald Correspondent Harare’s streets are packed as shoppers are flocking to the city’s markets and malls in search of last-minute Christmas goodies, while bus terminuses are congested with travellers seeking to catch buses to different parts of the country for the holidays. Retailers across the city are experiencing a significant surge in sales, […]",
            "time": "21:46",
            "date": "23 Dec 2024"
        },
        {
            "title": "Grain millers assure food security amid surge in festive season demand",
            "url": "https://www.herald.co.zw/grain-millers-assure-food-security-amid-surge-in-festive-season-demand/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nAs the festive season unfolds, the grain millers are providing an ample supply of essential grain-based products to Zimbabwean households.The Grain Millers Association of Zimbabwe (GMAZ) has confirmed that despite a challenging year marked by drought and grain imports, the sector has risen to the occasion, exceeding demand by an impressive 38,9 percent.\n\nGMAZ national chairman Dr Tafadzwa Musarara attributed the success to strategic planning and unwavering commitment.\n\nIn a statement Dr Musarara said they were proud to report that the local market was adequately stocked with maize meal, rice, flour, salt and other essentials.\n\nThe surplus supply has stabilised prices, making these commodities accessible to all, in both formal and informal retail outlets, he said.\n\nThe year 2024 posed significant challenges for the agricultural sector, with prolonged drought conditions forcing the industry to rely on imported grain.\n\nDr Musarara said despite the adverse weather they have ensured consistent supply.\n\nMoving forward, we remain committed to supporting local agriculture through contract farming and exploring additional source markets to maintain affordability.\n\nGMAZ also expressed gratitude to the Government for its private-led approach to achieving national food security.\n\nThe Governments policies align with international best practices and have enabled us to adapt effectively to these challenges, Dr Musarara said.\n\nWith festive cheer heightened by the availability of affordable and abundant food supplies, GMAZs efforts have been lauded as a testament to the industrys dedication to national well-being.As Zimbabweans celebrate this season, the assurance of food security provides not just relief but a beacon of hope for a prosperous 2025.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2016/09/0609-1-1-MAIZE.jpg",
            "description": "Ivan Zhakata Herald Correspondent As the festive season unfolds, the grain millers are providing an ample supply of essential grain-based products to Zimbabwean households. The Grain Millers Association of Zimbabwe (GMAZ) has confirmed that despite a challenging year marked by drought and grain imports, the sector has risen to the occasion, exceeding demand by an […]",
            "time": "21:46",
            "date": "23 Dec 2024"
        },
        {
            "title": "Kariba, Karoi hit by earth tremors",
            "url": "https://www.herald.co.zw/kariba-karoi-hit-by-earth-tremors/",
            "content": "Conrad Mupesa Mashonaland West Bureau\n\nTHE resort town of Kariba was hit by an earthquake measuring 4.9 on the Richter Scale at 5.39 am on Monday morning\n\nThis was confirmed by Kariba residents throughout various social media groups.\n\nEarthquaketrack.com confirmed picking the earth tremors adding that shakes were also felt in the tobacco farming town of Karoi, located nearly 200 kilometres west of Zimbabwes capital Harare.\n\nA Karoi resident Mr Keson Enos Kumponda said, l experienced it and woke up my family to witness it happening.\n\nOn Friday last week, Kariba was also hit by a 4.6 earthquake.\n\nThe Bulawayo Seismology Centre classified it as a minor event.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/07/shutterstock-1044748162.jpg",
            "description": "Conrad Mupesa Mashonaland West Bureau THE resort town of Kariba was hit by an earthquake measuring 4.9 on the Richter Scale at 5.39 am on Monday morning This was confirmed by Kariba residents throughout various social media groups. Earthquaketrack.com confirmed picking the earth tremors adding that shakes were also felt in the tobacco farming town […]",
            "time": "21:46",
            "date": "23 Dec 2024"
        },
        {
            "title": "Zimbabwe Music Rights Association (ZIMURA) member up for forgery",
            "url": "https://www.herald.co.zw/zimbabwe-music-rights-association-zimura-member-up-for-forgery/",
            "content": "Prosper Dembedza\n\nHerald Correspondent\n\nA 52-year-old member of the Zimbabwe Music Rights Association (ZIMURA) recently appeared in court on allegations of deposing a forged document at the High Court.\n\nPolisile Ncube was facing forgery and an alternative charge of fraud when she appeared before a Harare magistrate.\n\nThe complainant is Phillip Chipfumbu.\n\nChipfumbu and Ncube are all members of Zimbabwe Music Rights Association (ZIMURA)\n\nCircumstances are that on July 14, 2023, the complainant filed a case against Zimbabwe Music Rights Association at the High Court, under High Court case number HCHC482/23.\n\nThe application was for a forensic audit at the Zimbabwe Music Rights Association.\n\nIn that case, the first accused was cited as the second respondent and the second accused was cited as the representative of Zimbabwe Music Rights Association.\n\nIt is the States case that on July 20, 2023, the complainant went to the High Court and discovered that Ncube had deposed a forged document in the form of CR6 for Zimbabwe Music Rights Association dated April 12, 2023, which was not registered under the Department of Deeds, Companies and Intellectual Property.\n\nThe CR6 for the Zimbabwe Music Rights Association dated April 12, 2023, was eventually registered under the Department of Deeds, Companies and Intellectual Property on January 15, 2024 way after the complainant has already filed a police report.A report was made leading to Ncubes arrest.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/06/ZIMURA-Logo-1.png",
            "description": "Prosper Dembedza Herald Correspondent A 52-year-old member of the Zimbabwe Music Rights Association (ZIMURA) recently appeared in court on allegations of deposing a forged document at the High Court. Polisile Ncube was facing forgery and an alternative charge of fraud when she appeared before a Harare magistrate. The complainant is Phillip Chipfumbu. Chipfumbu and Ncube […]",
            "time": "21:46",
            "date": "23 Dec 2024"
        },
        {
            "title": "Unity transforms Zim across sectors: President",
            "url": "https://www.herald.co.zw/unity-transforms-zim-across-sectors-president/",
            "content": "Wallace Ruzvidzo, Herald Reporter\n\nZIMBABWE is recording evident transformation across all sectors of the economy through unity and a common purpose, President Mnangagwa has said.\n\nIn his Unity Day message, the President said Zimbabwe was unapologetically marching forward, adding that unity, peace and love continue to be the guiding principles of the countrys non-stop development under the Second Republic.\n\nThrough oneness and common purpose, we are recording evident transformation in every facet of the economy village by village, ward by ward and sector by sector, said President Mnangagwa.\n\nThe policies and programmes of the Second Republic are galvanising us all towards increased production and productivity, and propelling us to the realisation of Vision 2030.\n\nBrick by brick, stone upon stone and step by step, we are unapologetically marching forward.\n\nZimbabwe, said President Mnangagwa, has stood firm and united in the face of adversity.\n\nNumerous attacks and ill-will from the countrys erstwhile detractors have all come to nought due to the peoples oneness.\n\nThe attacks have been seen even during the peoples fight for the sovereign reclamation of their land.\n\nAdded the President: Presently, our nation is moving forward with fervent hope and determination to build a more prosperous future for all Zimbabweans, leaving no one and no place behind.\n\nWe remain inspired to continue demonstrating unparalleled national strength, resilience and unflinching patriotism to our country.\n\nThe numerous attacks and ill-will we have endured from detractors over the years, were aimed at sowing seeds of division and disunity. However, the people of this great nation have remained vigilant and resolute.\n\nPresident Mnangagwa said it was heartening to note that self-hate, violence, tribalism and regionalism had been rejected in the countrys national psyche and culture.\n\nThis years commemorations mark 37 years since the signing of the Unity Accord.\n\nThe President said Zimbabweans embraced and embedded unity, peace, self-belief and confidence in their identity, as the sons and daughters of this sacred soil.\n\nThis national consciousness is now imprinted in our individual and collective mind-set, embodied by our national development philosophy, Nyika inovakwa, inotongwa, inonamatirwa nevene vayo/ Ilizwe lakhiwa, libuswe, likhulekelwe ngabanikazi balo.\n\nAs the people of Zimbabwe, we are entrenching our identity as an independent, sovereign, free, united and truly liberated African people, he said.\n\nZimbabwe remains a composite and solid unitary State despite its diverse norms, customs, languages and culture, said the President.\n\nHe said from Zambezi to Limpopo, from Plumtree to Mutare, and across the most remote villages in the country, people sing with pride one national anthem and fly one national flag.\n\nWe are diverse but one. To this end, this past week saw my administration concretise the constitutionally enshrined obligation to give rights to every Zimbabwean citizen to hold and occupy agricultural land.\n\nHence, the bold decision to empower the beneficiaries of the Land Reform Programme through the issuance of Deeds of Transfer that will unlock the value of our land.\n\nThrough this historic act, these new tenure documents will be issued to the over 23 500 A2 and over 360 000 A1 farmers.\n\nThe celebration of this years Unity Day is, therefore, equally a jubilant occasion affirming that the land is now irreversibly with its people, and the people with their land, said President Mnangagwa.\n\nUnity, patriotism, peace, love and respect, he said, remain indispensable values in the countrys development matrix.\n\nTherefore, the President called on all citizens to commemorate the national Unity Day with sober reflections and recommit to the rich national heritage embodied in the historic accord of 1987.\n\nNever, never, never again, should anything ever divide us. United we must stand, strong and solid as the walls of Great Zimbabwe, from which we derive our nations name.\n\nHand in hand, in unity, from village to the provincial level; sector by sector and industry by industry, Vision 2030 shall surely become a reality, said President Mnangagwa.\n\nHe also wished the nation merry festivities, but implored everyone to exercise caution.\n\nAs we celebrate this important national holiday, let us do so responsibly and safely, especially for the travelling and commuting public.\n\nOn my own behalf, that of Government and indeed my family, I wish all fellow citizens, at home and abroad, a merry Christmas and a prosperous 2025.\n\nMay the new year ahead bring hope and greater prosperity for our motherland, Zimbabwe, President Mnangagwa said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/President-Mnangagwa-2.jpg",
            "description": "Wallace Ruzvidzo, Herald Reporter ZIMBABWE is recording evident transformation across all sectors of the economy through unity and a common purpose, President Mnangagwa has said. In his Unity Day message, the President said Zimbabwe was unapologetically marching forward, adding that unity, peace and love continue to be the guiding principles of the country’s non-stop development […]",
            "time": "21:46",
            "date": "23 Dec 2024"
        },
        {
            "title": "‘More roadblocks, stop and searches during holiday’",
            "url": "https://www.herald.co.zw/more-roadblocks-stop-and-searches-during-holiday/",
            "content": "Herald Reporters\n\nPolice officers have been heavily deployed on all major roads, residential areas, central business districts and places where people converge to make merry to ensure peace and order, Police Commissioner-General Godwin Matanga has said.\n\nHe said there will be heightened roadblocks, traffic blitzes, stop and searches, motorised and cycle patrols to curb crime and road traffic accidents.\n\nThe Zimbabwe Republic Police takes note that the public is now geared for the 2024-2025 festive season by engaging in various socio-economic activities, Comm-Gen Matanga said.\n\nThe volume of traffic on the roads will certainly increase. Road traffic accidents and violations of road rules and regulations will obviously take centre stage.\n\nIn this regard, the Zimbabwe Republic Police has made adequate deployments to ensure that peace prevails throughout the period.\n\nHe urged all stakeholders, who include transporters, to prioritise the safety and security of the public.\n\nAs road safety campaigns are being conducted, the Zimbabwe Republic Police shall impound all defective and unroadworthy vehicles.\n\nIn the same measure, the commuting public are discouraged from boarding non-public service vehicles for their own safety and other travellers. May I caution drivers to avoid overloading of vehicles and speeding on the roads, Comm-Gen Matanga said.\n\nRoad safety campaigns will include components of education to prevent accidents, promote compliance with road rules and regulations and strict enforcement of the countrys laws to ensure no pirate taxis or mushika-shika vehicles are allowed to pass through police check points.\n\nHowever, as of yesterday, kombis were still plying major highways, in defiance of regulations that prohibit them from travelling for 60km outside the CBD.\n\nA number of road accidents have already been recorded in the last week, with over 10 people dying and many others injured in three separate road accidents.\n\nYesterday morning, two people died while two others were injured when three buses  Rimbi, Blue Circle and Tombs  were involved in a freak accident just before Bubi along the Harare-Masvingo-Beitbridge highway.\n\nA Rimbi Bus reportedly rammed onto the trailer of a stationary Tombs bus after its driver had lost control and hit a stationary Mbokodo bus, which then overturned, leaving two passengers seriously injured.\n\nThe pile up allegedly started after a Tombs bus developed a mechanical fault and pulled off the road after hitting a donkey around 4am.\n\nThe Mbokodo bus then stopped to rescue stranded passengers who were in the Tombs bus, and then came a Rimbi bus, which hit the Tombs bus trailer, forcing it to overturn.\n\nMasvingo provincial police spokesperson Inspector Kudakwashe Dhewa said bodies of the deceased were taken to Beitbridge District Hospital mortuary while the injured were taken to Beitbridge District Hospital.\n\nIt is not clear where all the three buses were going.\n\nMeanwhile, Comm-Gen Matanga said as the rainy season has started, the motoring public should exercise caution as some roads may be slippery.\n\nHe also challenged motorists and individuals not attempt to cross flooded rivers and bridges to curb drowning incidents.\n\nMay I also caution public service vehicle operators, both local and cross border, to minimise night travelling as most of the fatal road traffic accidents are being recorded at night due to vision and observation challenges, said Comm-Gen Matanga.\n\nHe also encouraged individuals and institutions involved in the importation and exportation businesses to lead by example and officially declare all goods at the countrys ports of entry and exit.\n\nThe law will take its course without fear or favour on transporters who are involved in smuggling activities and those using undesignated points along our border lines to commit crime, Comm-Gen Matanga said.\n\nPolice have taken note of reports of liquor outlets in some central business districts and residential areas, which are not observing the provisions of the Liquor Act, by operating outside their stipulated opening and closing times, said the police chief.\n\nSome of the beer outlets are also allowing minors to access alcohol.\n\nMay I buttress that arrests will be effected and the law will certainly take its course. In the same vein, may I take this opportunity to strongly warn parents and guardians who allow minors under the guise of merry making to partake in beer drinking orgies.\n\nAs the public embarks on various activities during this festive period, families, business persons and institutions should avoid carrying or keeping large sums of money at home or offices to curb robbery and other related violent criminal acts, Comm-Gen Matanga said.\n\nHe said police will also take action on those engaging in drug and substance abuse, adding that as the public celebrates the cross-over into the New Year, individuals, institutions and businesspersons must adhere to the provisions of the law on the use of fireworks, fire crackers and other gadgets that may disturb the safety and security of the people.\n\nAs required under the countrys laws, the use of fireworks should be notified to the local authorities and police well on time, Comm-Gen Matanga said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/12/2412-1-1-COMMISSIONER-GENERAL-GODWIN-MATANGA-2019.jpg",
            "description": "Herald Reporters Police officers have been heavily deployed on all major roads, residential areas, central business districts and places where people converge to make merry to ensure peace and order, Police Commissioner-General Godwin Matanga has said. He said there will be heightened roadblocks, traffic blitzes, stop and searches, motorised and cycle patrols to curb crime […]",
            "time": "21:46",
            "date": "23 Dec 2024"
        },
        {
            "title": "Govt signs nine irrigation deals",
            "url": "https://www.herald.co.zw/govt-signs-nine-irrigation-deals/",
            "content": "Edgar Vhera, Agriculture Specialist Writer\n\nNINE irrigation investments have been signed off by the Government with private companies as the Second Republic up-scales its resolve to ensure food security and agricultural raw materials for industry and export from unpredictable weather patterns that cause production and supply disruptions.\n\nIrrigation farming is now seen as critical to ensure continuous and constant output instead of relying solely on rainfall.\n\nLands, Agriculture, Fisheries, Water and Rural Development Permanent Secretary Professor Obert Jiri presided over the signing of irrigation investment agreements with nine companies in Harare last week.\n\nThe deals will transform Zimbabwe into a weather-independent food hub.\n\nProf Jiri reiterated the importance of transforming the country into a food-secure nation, regardless of weather conditions, through irrigation investments.\n\nHe acknowledged the role of investors as crucial partners in this initiative, emphasising that the Governments role was to facilitate progress to ensure more and more farmers had access to irrigation.\n\nThe next steps involve practical implementation, focusing on land and dam development for irrigation systems, with the Department of Irrigation and Zimbabwe National Water Authority (ZINWA) being key.\n\nToday we start wetting the paper, but the eventual goal is to wet the fields. If we do that, we would have succeeded in climate-proofing our agriculture, said Prof Jiri.\n\nWriting on his X post, Prof Jiri said: Transforming Zimbabwe into a weather-independent food hub remains a core priority of the Ministry. On Monday, nine irrigation investment deals were finalised, marking a significant step towards achieving this critical goal.\n\nThis comes in the wake of the official opening of the National Irrigation Investment Conference by President Mnangagwa earlier this year, where after noting that the El Nino-drought has not spared Zimbabwe, he called for more targeted interventions to ensure that the country and Africa at large become food secure once again.\n\nIt is now urgent and imperative for us to think outside the box to de-risk our nation from the vagaries of climate change. Similarly, stakeholders and communities alike should accelerate the implementation and adoption of mechanisms to climate-proof our agriculture sector, beginning at the household level, he said.\n\nThe country secured over US$227 million in two investment deals for irrigation projects at the Zimbabwe Irrigation Investment Conference.\n\nAnother US$1.5 billion in funding was secured to develop major dams such as Musami Dam and the completion of the Gwayi-Shangani pipeline, among several other key infrastructure projects.\n\nThe concept is not so much centred on infrastructure but rather on what the water captured within that infrastructure is intended to do, President Mnangagwa stressed as he has led the country to adopt a new ethos and philosophy: a dam as an economy to accelerate economic development.\n\nThe dam as an economy philosophy has expanded the project scope to include dam construction, irrigation development, hydroelectricity generation, potable water and fisheries development as fundamental project tenets to accelerate rural development for the attainment of Vision 2030, aiming to elevate and improve livelihoods while leaving no one and no place behind.\n\nThe ambitious dam projects are expected to expand the countrys irrigated land from the current 217 000 hectares to 496 000 hectares in the present phase, guaranteeing national food security and resilience against climate change.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/04/Professor-Obert-Jiri.jpg",
            "description": "Edgar Vhera, Agriculture Specialist Writer NINE irrigation investments have been signed off by the Government with private companies as the Second Republic up-scales its resolve to ensure food security and agricultural raw materials for industry and export from unpredictable weather patterns that cause production and supply disruptions. Irrigation farming is now seen as critical to […]",
            "time": "21:46",
            "date": "23 Dec 2024"
        }
    ]
}