{
    "news": [
        {
            "title": "Shun divisive tendencies: President",
            "url": "https://www.herald.co.zw/shun-divisive-tendencies-president/",
            "content": "Wallace Ruzvidzo\n\nHerald Reporter\n\nZIMBABWEANS should at all times shun divisive tendencies to safeguard the countrys stable unitary democracy that was painstakingly crafted by the likes of former Vice President John Landa Nkomo, President Mnangagwa has said.\n\nIn a statement to mark the anniversary of the death of the late former Vice President, who passed away 11 years ago on January 17, 2013, the President described Cde Nkomo as a diligent nation-builder and dedicated champion of peace.\n\nAs such, President Mnangagwa said it was imperative that the general citizenry cherishes the peace and tranquillity that has become the cornerstone of the countrys current developmental trajectory.\n\nOn this day, 17th January, 2025, the Second Republic joins the Nkomo Family in commemorating the 12th anniversary of the passing on of the former Vice President of the Republic of Zimbabwe, Dr John Landa Nkomo.\n\nAn ardent revolutionary, diligent nation-builder and a dedicated champion of peace, Dr John Landa Nkomos footprints traversed the nascent trade union and nationalist landscape from 1958 to Independence and the immediate post-Inclusive Government era, he said.\n\nPresident Mnangagwa said in carrying on with Cde Nkomos legacy of pioneering lasting projects, the Second Republic was walking its talk by leaving no one and no place behind in delivering on national policies, programmes and projects.\n\nCde John Landa Nkomo was a passionate educator, an eloquent and forthright politician who pioneered lasting developmental projects in his rural Tsholotsho District and beyond.\n\nOn its part, the Second Republic is walking the talk by leaving no one and no place behind in delivering on national policies, programmes, and projects, he said.\n\nPresident Mnangagwa said the former Vice President discharged his duties diligently and honourably.\n\nCde Nkomo served in several portfolios  as Deputy Minister of Industry and Energy (1981); Minister of State in the Prime Ministers Office (1982-84); Minister of Labour, Manpower Planning and Social Welfare (1982-1984); Minister of Local Government and National Housing (1997); Minister of Home Affairs (2000); Minister of State in the Presidents Office responsible for Special Affairs (2002); and Speaker of Parliament (2005-2008).\n\nHe served as Minister of State in the Presidents Office responsible for National Healing, Reconciliation and Integration.\n\nIn 2009, he was appointed NationalChairman of the ruling ZANU-PF Party, the same year that he became the Vice President of Zimbabwe, a position he held until the time of his death in 2013.\n\nOn the international scene, Dr Nkomo was elected to the Presidency ofthe International Labour Conference in 1993, and chaired the Governing Body of the International Labour Organisation in 1994 positions in which he discharged his roles honourably, said President Mnangagwa.\n\nCde Nkomo, said the President, was a distinguished patriot whose dedication to unity and peace was unquestionable.\n\nThe late former Vice President exuded unparalleled patriotism and dedication to the values of unity and peace as expressed in his popular mantra.Peace begins with me. Peace begins with you. Peace begins with all of us.\n\nAs we remember Cde John Landa Nkomo, we should forever cherish the peace and tranquillity that has become the cornerstone of our developmental trajectory.\n\nI therefore beseech my fellow citizens and indeed future generations to always shun divisive tendencies in order to safeguard our stable unitary democracy that was painstakingly crafted by the likes of the dear departed Dr John Landa Nkomo, and his revolutionary peers, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/wgwg.jpg",
            "description": "Wallace Ruzvidzo Herald Reporter ZIMBABWEANS should at all times shun divisive tendencies to safeguard the country’s stable unitary democracy that was painstakingly crafted by the likes of former Vice President John Landa Nkomo, President Mnangagwa has said. In a statement to mark the anniversary of the death of the late former Vice President, who passed […]",
            "time": "06:34",
            "date": "17 Jan 2025"
        },
        {
            "title": "Localisation of value chains pays off",
            "url": "https://www.herald.co.zw/localisation-of-value-chains-pays-off/",
            "content": "Fungai Lupande\n\nMashonaland Central Bureau\n\nBINDURA University of Science Education (BUSE) is poised to revolutionise eye care in the country after securing modern equipment for the manufacture of eye lenses at its optometry and audiology centre.\n\nThis development will enable BUSE to supply affordable eye lenses to other facilities across the country in the shortest possible time at affordable prices.\n\nInformation, Publicity and Broadcasting Services Minister Dr Jenfan Muswere yesterday visited high-impact projects in Mashonaland Central Province and expressed his admiration for the domestication of value chains in eye lenses, fertiliser, and water purification chemicals.\n\nDuring the Mashonaland Central provincial media tour, Dr Muswere said President Mnangagwas philosophy is that, Nyika inovakwa nevene vayo (a country is developed by its people) and that has been demonstrated by universities like BUSE.\n\nThe implementation of the Heritage-Based 5.0 Curriculum, he said, has led to the establishment of innovation hubs aimed at empowering learners as was articulated by President Mnangagwa.\n\nIn line with Vision 2030 and National Development Strategy 1, human capital development is a priority to propel and accelerate achievements across all sectors of the economy, Dr Muswere said.\n\nThe ministers tour included a visit to Ran Mines, which has seen an increase in its gold output.\n\nBefore 2017, the mining sector contributed around US$3 billion to the economy. Under the leadership of President Mnangagwa, we now have a mining sector worth over US$15 billion, significantly contributing to the Gross Domestic Product (GDP), Dr Muswere said.\n\nWe toured a water purification chemical company, Chilmund Chemicals and this is part of the localisation of all value chains within Zimbabwe.\n\nThe Government is shifting the balance of trade from negative to positive by producing most goods and services locally through the implementation of the local content strategy.\n\nHe added that a fertiliser manufacturing company, FSG, has contributed to increased agriculture productivity and cut costs in agricultural production by 50 percent.\n\nThe minister said the establishment of local manufacturing plants reduces the countrys import bill and contributes positively to job creation.\n\nThe more a country exports, the more it generates foreign currency and domesticates its value chains. If we import more, we are exporting jobs, he said.\n\nUnder President Mnangagwas leadership, we have witnessed a growth strategy that has improved our current accounts and helped stabilise inflation. There is less volatility in the currency because we are producing the goods ourselves. Domesticating value chains, especially in fertiliser production, ensures we can plan and meet deadlines.Dr Muswere stressed the importance of adopting new technology in production, especially in agriculture.\n\nTiming and control of inputs are crucial for food and nutrition security. Although we have been affected by environmentally-induced drought, we are recovering.\n\nThe tour will extend to farms owned bywomen and youth excelling in agriculture, which supports the security of tenure and economically empowers citizens participating in agriculture.\n\nThe Minister of State for Provincial Affairs and Devolution for Mashonaland Central, Christopher Magomo, said the province is undergoing economic transformation as the President works to ensure that everyone achieves an upper-middle-income economy by 2030.\n\nHe noted several developments in the province, including tapping into natural resources to produce food and beauty products.\n\nThe optometry programme will see lenses being cut to size in the shortest time possible. This is a milestone for Heritage-based Education 5.0, Minister Magomo said.\n\nHe pointed out that Mashonaland Central produces 50 percent of basal fertiliser at FSG, expressing pride in these achievements.\n\nMr Daniel Chihombori, an assistant to the Vice Chancellor at BUSE, said the optometry programme encompasses both academic and professional services.\n\nHe said they will soon begin manufacturing eye lenses as the necessary machinery has been procured, and they are awaiting experts from Germany to install the equipment.\n\nMr Chihombori expressed gratitude to the Government for its support in infrastructure development at the university.\n\nThis is the first optometry school in Zimbabwe. People from as far as Bulawayo seek services here because we can produce spectacles within a day or two.\n\nAll these achievements are possible because of the strong support from the Government. We extend our gratitude to President Mnangagwa for this support.\n\nThe optometrist at the facility, Mr Evans Aboagye, added that they also check for eye diseases like glaucoma and conduct comprehensive eye examinations for all patients.\n\nThe new machinery will enable us to reduce the importation of eye lenses that were previously inaccessible in Zimbabwe. We can supply all facilities in Zimbabwe with affordable eye lenses, he said.\n\nOur students will learn about all processes involved here, meaning that BUSE will become a top-notch optometry school in Africa.\n\nAt FSG, Acting Plant Manager Mr Tinotenda Kankuni said they currently have 40 000 tonnes of raw materials and hold a market share of between 50 and 60 percent.\n\nThey have a capacity of 1,500 tonnes per day and also operate a granulation plant that processes 200 tonnes per day.\n\nThe company has completed 70 percent of their Presidential inputs scheme commitments.\n\nAbout 80 percent of the raw materials are locally sourced. We are well prepared to supply fertiliser to the market. With the current rains, we are moving into the distribution of top-dressing fertiliser, he said.\n\nAt Ran Gold Mines, the geology manager, Mr Rayn Rosenfields, said they have two resources, Ran and Kimberly.\n\nHe noted that the minability of the Kimberly resources is better compared to Ran, which is located on the side of a hill.\n\nThe life of the Kimberly mine is 12 months, and we can process 23 000 tonnes of gold ore per month. Before the end of next year, we have plans to increase this to 40 000 tonnes, translating to a million tonnes per year, he said.\n\nRan Mine officials expressed their gratitude to the Government, ministries, and departments for their support, which has allowed them to grow tremendously within three years.\n\nThe mine has transformed from processing 5 000 tonnes of gold ore per month in 2023 to the current 23 000 tonnes, with a target of 40 000 tonnes for next year.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/fbwerg.jpg",
            "description": "Fungai Lupande Mashonaland Central Bureau BINDURA University of Science Education (BUSE) is poised to revolutionise eye care in the country after securing modern equipment for the manufacture of eye lenses at its optometry and audiology centre. This development will enable BUSE to supply affordable eye lenses to other facilities across the country in the shortest […]",
            "time": "06:34",
            "date": "17 Jan 2025"
        },
        {
            "title": "Former Information Minister Chen Chimutengwende dies",
            "url": "https://www.herald.co.zw/former-information-minister-chen-chimutengwende-dies/",
            "content": "Herald Reporter\n\nFORMERInformation,Posts and Telecommunications MinisterCde Chenhamo Chen Chakezha Chimutengwende has died.\n\nHe was 81.\n\nCde Chimutengwende died yesterday at around 5pm.\n\nHis son, Mr Tawanda Chimutengwende, confirmed the death last night. He said his father had chronic kidney disease.\n\nBurial arrangements will be announced in due course.\n\nBorn on August 28 1943, Cde Chimutengwende first became a Zanu PF Member of Parliament in 1985 in Mazowe, and would be a legislator for over 25 years.\n\nHe also served for 14 years as a Cabinet minister.\n\nCde Chimutengwende served as Senator and Deputy President of the Senate, Member of the Pan-African Parliament (PAP) and Head of the Zimbabwe delegation to the PAP.\n\nHe earned a Masters degree in Social Science and a PhD from the University of Bradford in the UK.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/f23f.jpg",
            "description": "Herald Reporter FORMER  Information, Posts and Telecommunications Minister Cde Chenhamo “Chen” Chakezha Chimutengwende has died. He was 81. Cde Chimutengwende died yesterday at around 5pm. His son, Mr Tawanda Chimutengwende, confirmed the death last night. He said his father had chronic kidney disease. Burial arrangements will be announced in due course. Born on August 28 […]",
            "time": "06:34",
            "date": "17 Jan 2025"
        },
        {
            "title": "Rains bring good harvest prospects",
            "url": "https://www.herald.co.zw/rains-bring-good-harvest-prospects/",
            "content": "Herald Reporters\n\nRecent rains and proactive efforts to replenish the strategic grain reserve have bolstered confidence that the nations food security will be guaranteed until the next harvest.\n\nThis positive outlook is crucial for crop growth and can significantly enhance yields, reflecting a commitment to managing food supplies effectively and mitigating potential shortages.\n\nA robust reserve is vital for stabilising food prices and ensuring a swift response to any unforeseen disruptions in production.\n\nAltogether, the combination of favourable weather and strategic planning lays a strong foundation for food stability in the coming months.\n\nDuring a visit to Kudenga Farm in Marondera District, Lands, Agriculture, Fisheries, Water and Rural Development Minister Dr Anxious Masuka said the country had more than enough supplies, with over 198 000 tonnes of wheat, maize, and traditional grains stored at Grain Marketing Board depots.\n\nHe praised farm owner Mr Kudakwashe Kudenga, a young and innovative farmer, for his impressive work on the farm.\n\nThis initiative will help improve the countrys food security, said Dr Masuka.\n\nThe farms diverse operations include 1 000 beef cattle, 120 hectares of tobacco, 100 hectares of maize, pigs, goats and six fish ponds.\n\nMinister Masuka highlighted that the Ministry was conducting provincial tours to assess crop conditions and to ensure that the President Mnangagwas goal of food security was met.\n\nWith farmers like Kudenga in Marondera, we are on track to achieve this goal. Given the forecast of good rains, we anticipate that the country will be able to sustain itself more consistently, moving away from the episodic weather-related challenges of the past. This diversified farm is truly remarkable, he said.\n\nHe also noted the success of the farms fishery and livestock operations, which use modern breeding techniques, resulting in an annual off-take of 250 steers from a herd of 1 000 head of cattle.\n\nWe have seen enterprising tobacco curing facilities that are powered by renewable energy; this is the way to go, he added.\n\nExplaining the distribution of resources, Minister Masuka said that 70 percent of the strategic grain reserve is concentrated in Mashonaland West and Mashonaland Central, with additional supplies in Mashonaland East.\n\nWe have enough to feed the 6,45 million rural Zimbabweans at 7,5kg per person per month until March, and we can also feed the 4,5 million learners from early childhood development to grade seven until the first term concludes, he assured.\n\nMr Kudenga expressed gratitude for the Governments support in enhancing their farming operations.\n\nWorking with the Government has helped us to improve our farming, and we are looking forward to some rainfall to enhance that view. Once the rainfall comes, we hope to surpass the mark of 12 tonnes of maize a hectare. We collaborate with all our stakeholders, from seed companies to the Governments irrigation departments, he said.\n\nWith such commitment and collaboration, the Government remains optimistic about the nations food security, ensuring that Zimbabwe is well-equipped to meet its agricultural needs.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/ergerg.jpg",
            "description": "Herald Reporters Recent rains and proactive efforts to replenish the strategic grain reserve have bolstered confidence that the nation’s food security will be guaranteed until the next harvest. This positive outlook is crucial for crop growth and can significantly enhance yields, reflecting a commitment to managing food supplies effectively and mitigating potential shortages. A robust […]",
            "time": "06:34",
            "date": "17 Jan 2025"
        },
        {
            "title": "SA embarks on largest review of steel duties",
            "url": "https://www.herald.co.zw/sa-embarks-on-largest-review-of-steel-duties/",
            "content": "South Africa is embarking on the largest ever review of steel tariffs just as ArcelorMittal SA (Amsa) announced the closure of its long steel business, including its Newcastle and Vereeniging plants as well as its rail and structures operation.\n\nThis comes just months after Amsa received a 52,81 percent anti-dumping duty on structural steel. If thats not enough to keep its plants running, then the problems clearly run much deeper than competition from imports.\n\nThe anti-dumping duty comes on top of a 10 percent duty on imported long-rolled steel, which is the maximum allowable under SAs commitments to the World Trade Organisation.\n\nSAs steel industry is a sea of competing interests  some calling for further protection, others lobbying for more open markets.\n\nLast week, Gerhard Papenfus, CEO of the National Employers Association of South Africa (Neasa), called for the scrapping of import duties on all long steel products with immediate effect now that the company will no longer be involved in long steel production. The only purpose in keeping tariffs on long steel products is to generate revenue for the state.\n\nOthers have blamed Amsas woes on an oversupply of finished products in the domestic market, which has pushed long-steel products below international prices.\n\nAs the government and the industry grapple with an oversupplied steel sector and weak local demand, they must not prioritise saving the older, heavily polluting and poorly structured Amsa above all else, but rather look at saving as much of the whole steel market as possible, wrote Cape Gate chair Oren Kaplan in Business Day.\n\nAmsa should not be saved at the expense of the rest of the long steel industry. Moneyweb.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/06/istockphoto-931069162-612x612-612x380.jpeg",
            "description": "South Africa is embarking on the largest ever review of steel tariffs just as ArcelorMittal SA (Amsa) announced the closure of its long steel business, including its Newcastle and Vereeniging plants as well as its rail and structures operation. This comes just months after Amsa received a 52,81 percent anti-dumping duty on structural steel. If […]",
            "time": "06:34",
            "date": "17 Jan 2025"
        },
        {
            "title": "Cuban leader hails Zim for support",
            "url": "https://www.herald.co.zw/cuban-leader-hails-zim-for-support/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nCUBAN President Miguel Daz-Canel Bermdez has lauded Zimbabwe and President Mnangagwa for their steadfast support for Cubas successful campaign to be removed from the United States list of State sponsors of terrorism.\n\nThe removal is seen as a crucial step in Cubas ongoing battle against economic sanctions imposed by the US.\n\nUS President Joe Biden on Tuesday removed Cuba from a list of countries that sponsor terrorism.\n\nHe also lifted some financial sanctions on Havana.\n\nSpeaking in a meeting with Zimbabwes Special Envoy, Ambassador Simbarashe Mumbengegwi, at the Palace of the Revolution in Havana, Cuba, on Wednesday, President Daz-Canel spoke about the shared struggles of Zimbabwe and Cuba, reaffirming his commitment to strengthening bi-lateral relations.\n\nAt the meeting, Ambassador Mumbengegwi delivered a special message from President Mnangagwa and received historical artefacts from Cuba intended for Zimbabwes Museum of African Liberation.\n\nThis is a victory for the Cuban people, but we also share it with friends like you, who have supported us internationally, said President Daz-Canel.\n\nHe spoke passionately about the shared struggles of both nations against unjust American sanctions and commended Zimbabwes solidarity on the global stage.\n\nThe Cuban leader reaffirmed his commitment to strengthening the historic ties between the two nations, advocating for expanded cooperation and deeper collaboration.\n\nHe also presented a gift for President Mnangagwa as a token of friendship.\n\nAmbassador Mumbengegwi expressed gratitude for Cubas unwavering support during Zimbabwes liberation struggle.\n\nCuba was the smallest country from a geographical perspective, yet it contributed the most to our liberation struggle, he said.\n\nAmbassador Mumbengegwi highlighted the significance of the artefacts donated by Cuba, which include military tanks from the historic Battle ofCuito Cuanavale in Angola, a personnel carrier, military regalia, historical documents, books, and films.\n\nThese items will be displayed at the Museum of African Liberation in Harare, a project led by the Institute of African Knowledge (INSTAK) with full Government backing.\n\nThis priceless donation will receive a befitting ceremony once it arrives in Zimbabwe, Ambassador Mumbengegwi said.\n\nThe Museum of African Liberation serves as a tribute to the continents fight against colonialism and apartheid.\n\nNotably, Cuba is one of three non-African countries, alongside China and Russia, to have its flag raised at the museum, recognising its substantial contributions to African liberation movements.\n\nCubas support for Zimbabwe extends beyond historical struggles, encompassing significant contributions to the development of Zimbabwes human capital and health sector in the post-independence era.\n\nThe meeting included senior Cuban officials such as head of the Department of International Relations of the Communist Party Emilio Lozada Garca, and Deputy Foreign Minister Elio Rodrguez Perdomo.\n\nAmbassador Mumbengegwis delegation had senior Zimbabwean officials including Deputy Chief Secretary Zvinechimwe Churu, Brigadier-General Million Ndlovu, and INSTAK chief executive officer Ambassador Kwame Muzawazi.\n\nThe meeting reaffirmed the lasting solidarity between Cuba and Zimbabwe, grounded in shared history and a commitment to mutual development.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/02/diaz-canel-en-onu-reunion-de-alto-nivel-desarme-01-580x435.jpg",
            "description": "Ivan Zhakata Herald Correspondent CUBAN President Miguel Díaz-Canel Bermúdez has lauded Zimbabwe and President Mnangagwa for their steadfast support for Cuba’s successful campaign to be removed from the United States list of State sponsors of terrorism. The removal is seen as a crucial step in Cuba’s ongoing battle against economic sanctions imposed by the US. […]",
            "time": "06:34",
            "date": "17 Jan 2025"
        },
        {
            "title": "Chimombe, Mpofu freedom bid flops",
            "url": "https://www.herald.co.zw/chimombe-mpofu-freedom-bid-flops/",
            "content": "Fidelis Munyoro\n\nChief Court Reporter\n\nBusiness partners Mike Chimombe and Moses Mpofu, accused of siphoning millions of dollars from the Presidential Goat Pass-On Scheme, suffered yet another legal blow yesterday as their bail application was dismissed.\n\nThe ruling, delivered by Justice Pisirayi Kwenda, ensures that the duo remain in custody until their trial resumes on February 10.\n\nThe courts decision underlines the seriousness of the charges, the strength of the evidence, and the risks associated with granting bail.\n\nAllegations against the two are not mere administrative lapses or technical missteps, but involve the alleged fraudulent misappropriation of substantial public funds.\n\nJustice Kwenda, in his ruling, emphasised the gravity of the case, which revolves around accusations of dishonesty with money meant to improve the lives of ordinary citizens.\n\nThe Presidential Goat Pass-On Scheme, a programme designed to improve livelihoods, has instead been tainted by allegations of corruption on a grand scale.\n\nChimombe and Mpofu, however, vehemently deny their involvement, contending that they played no part in the submission of bids or in the diversion of the money in question.\n\nNevertheless, the court found that the testimony of State witnesses, who claim direct dealings with the accused, creates a solid case that cannot be ignored.\n\nThe judge further noted that the States evidence remains intact, with witnesses ready to testify about their interactions with Chimombe and Mpofu.\n\nThe court has given the case priority, with trials initially commencing in October, but delayed due to procedural issues. Barring any unforeseen complications, the duos trial is expected to last a week.\n\nJustice Kwenda pointed out that the accused should, as respected businessmen, be eager to clear their names over the cloud of suspicion hanging over them.\n\nCombined with the serious implications of a potential 20-year sentence, Justice Kwenda reasoned that the incentive to interfere or flee is magnified. The court explained that the presumptive penalty for fraud involving public funds, particularly where the prejudice is significant, begins at 20 years imprisonment.\n\nThis starting point, the judge stressed, is dictated by sentencing guidelines that apply to cases involving aggravating circumstances.\n\nSuch a severe penalty, he argued, could easily spur the accused to abscond from the trial, irrespective of any surety offered.\n\nThe accused had attempted to assure the court of their intention to stand trial by offering title deeds to a property and surrendering their passports.\n\nHowever, the court dismissed these measures as inadequate, pointing out that the risks of interference and non-attendance of the trial far outweigh the value of such sureties.\n\nThe sureties cannot address the gravity of the charges or the risks involved, Justice Kwenda remarked, ultimately finding that the seriousness of the alleged crimes rendered the accused unsuitable for bail.\n\nAdding to their woes, Chimombe and Mpofu face another charge involving the loss of public funds for which no recoveries were made.\n\nThis separate case, ready for trial, carries a similarly severe presumptive penalty, further compounding the risk of flight. Moreover, indictment papers for yet another pending fraud case involving the two have already been prepared, and the trial is scheduled for this term.\n\nThe accused now find themselves entangled in a web of criminal proceedings, with the court noting that the multiplicity of cases against them creates an even stronger incentive to abscond.\n\nJustice Kwenda also addressed the defences concerns about delays, clarifying that the trial experienced only minimal interruptions and has been given priority over other cases.\n\nThe court has ensured that proceedings will not be unnecessarily protracted, with a conclusion likely in February.\n\nAs such, the judge found no reason to release the accused on bail when the end of the trial is within sight.\n\nIn dismissing the application, Justice Kwenda delivered a stern reminder of the courts duty to protect the integrity of the judicial process.\n\nAllegations in this case, rooted in the misuse of public resources, strike at the heart of public trust.\n\nThe accused, while entitled to the presumption of innocence, must remain in custody to ensure that justice is not only, done but seen to be done.\n\nThe severity of the charges, the strength of the States case, and the risks of interference and flight all converged to form an unassailable argument for continued detention.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/09/fdcsd.jpg",
            "description": "Fidelis Munyoro Chief Court Reporter Business partners Mike Chimombe and Moses Mpofu, accused of siphoning millions of dollars from the Presidential Goat Pass-On Scheme, suffered yet another legal blow yesterday as their bail application was dismissed. The ruling, delivered by Justice Pisirayi Kwenda, ensures that the duo remain in custody until their trial resumes on […]",
            "time": "06:34",
            "date": "17 Jan 2025"
        },
        {
            "title": "O-Level results out today",
            "url": "https://www.herald.co.zw/o-level-results-out-today-2/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nZIMBABWE School Examinations Council (Zimsec) Ordinary Level examination results will be released today.\n\nBoard chairperson Professor Paul Mapfumo is expected to announce the results at 2.30pm at Zimsec headquarters in Harare.\n\nThe results come out barely a week after the release of the 2024 November Advanced Level examination results which had a national pass rate of 94,58 percent, nearly identical to the 2023 performance.\n\nAccording to Zimsec, a total of 33 585 candidates sat for the exams in 2024, slightly fewer than the 34 437 who wrote in 2023, showing a 2,47 percent decrease in candidature. Of these, 33 246 candidates wrote two or more subjects. Out of this group, 31 443 achieved a Grade E or better leading to a pass rate of 94,58 percent which mirrors last years results.\n\nGender differences were notable in the results. Female candidates saw a remarkable improvement, recording a pass rate of 95,94 percent for those who sat for two or more subjects.\n\nThis was a marked increase from the 92,32 percent pass rate in 2023, representing a significant 3.62 percent rise.\n\nIn comparison, male candidates posted a pass rate of 93,13 percent which was slightly lower than the previous years rate of 93,95 percent.\n\nHowever, the overall performance of male candidates remained stable.\n\nSpecial needs candidates also made significant progress this year and out of the 40 special needs candidates who sat for the exams, 38 passed with a Grade E or better, resulting in a pass rate of 95 percent.\n\nThis marked a substantial improvement from 2023, when only 29 out of 34 candidates passed yielding a pass rate of 84,62 percent.\n\nThe 2024 examination season saw a total of 29 041 school candidates, a slight decrease from 29 910 in 2023.\n\nOf the 28 900 who wrote two or more subjects, 27 509 achieved a Grade E or better, leading to a pass rate of 95,18 percent.\n\nThis closely mirrored the previous years performance, which had a pass rate of 95,19 percent.\n\nPrivate candidates, who numbered 4 544 in 2024, saw a slight increase in the number of candidates writing two or more subjects compared to the previous year.\n\nA total of 4 346 private candidates sat for two or more subjects, with 3 934 passing, resulting in a pass rate of 90,52 percent. In 2023, the pass rate for private candidates stood at 90,57 percent.\n\nThe 2024 A Level results reflected not only the continued strength of Zimbabwes education system, but also the resilience and dedication of its students, teachers and education stakeholders.\n\nGrade 7 results came out in November last year with a higher 49,01 percent pass rate, significantly up from 45,57 percent in 2023, due to better teaching and with girls on 53,68 percent on average doing better than boys on 43,99 percent.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/04/Zimsec.jpg",
            "description": "Ivan Zhakata Herald Correspondent ZIMBABWE School Examinations Council (Zimsec) Ordinary Level examination results will be released today. Board chairperson Professor Paul Mapfumo is expected to announce the results at 2.30pm at Zimsec headquarters in Harare. The results come out barely a week after the release of the 2024 November Advanced Level examination results which had […]",
            "time": "06:34",
            "date": "17 Jan 2025"
        },
        {
            "title": "New inflation reading likely keeps the Fed on pause for now",
            "url": "https://www.herald.co.zw/new-inflation-reading-likely-keeps-the-fed-on-pause-for-now/",
            "content": "Fresh inflation data released Wednesday is likely to keep the Federal Reserve on pause during its next policy meeting this month, even though a new reading did show some signs of easing.\n\nOn a core basis, which eliminates the more volatile costs of food and gas, the December Consumer Price Index (CPI) climbed 0,2 percent over the prior month, a deceleration from Novembers 0,3 percent monthly gain.\n\nOn an annual basis, prices rose 3,2 percent.\n\nIt was the first drop on a core basis after three months of being stuck at 3,3 percent.\n\nThis latest inflation reading confirms a Fed rate cut skip at the January FOMC meeting, said EY chief economist Gregory Daco.\n\nThe new print wont change expectations for a pause later this month, but it should curb some of the talk about the Fed potentially raising rates, said Ellen Zentner, chief economic strategist for Morgan Stanley Wealth Management.\n\nThe Fed next meets on January 28-29, and investors are nearly unanimous in their view that the central bank will leave rates unchanged after reducing them by a full percentage point in late 2024.\n\nWe are making progress on inflation, its just very slow, former Federal Reserve economist Claudia Sahm told Yahoo Finance Wednesday.\n\nCuts are not coming later this month, but that doesnt mean they arent coming later this year.\n\nNew York Fed president John Williams said after the CPI release that while I expect that disinflation will progress, it will take time, and the process may well be choppy.\n\nThe economic outlook, he added, remains highly uncertain, especially around potential fiscal, trade, immigration, and regulatory policies  a reference to possible changes that could happen as part of the incoming Trump administration.\n\nLots of Fed officials in recent weeks have been urging caution on future rate cuts.\n\nIn fact, the Feds December meeting minutes showed officials believed inflation could take longer than anticipated to reach their 2 percent goal, citing stickier-than-expected inflation data since past fall and the risks posed by new policies of Trump 2.0.\n\nThey noted the likelihood that elevated inflation could be more persistent had increased, according to the minutes, even though they still expected the Fed to bring inflation down to its 2 percent goal over the next few years.\n\nSeveral members of the Fed even said at that meeting that the disinflationary process may have stalled temporarily or noted the risk that it could.\n\nThe elevated inflation concerns help explain why Fed officials in December reduced their estimate of 2025 rate cuts to two from a previous estimate of four.\n\nInflation could show new signs of progress in year-over-year comparisons later in 2025s first quarter since in 2024 inflation spiked back up before declining again.\n\nFed governor Michelle Bowman may be the most worried of the Fed officials, saying last week that she could have backed a pause in interest rates last month but supported a cut as the last step in the central banks policy recalibration.\n\nKansas City Fed president Jeff Schmid, a voting FOMC member this year, said, I believe we are near the point where the economy needs neither restriction nor support, and that policy should be neutral.\n\nSchmid said he is in favour of adjusting rates gradually, noting that the strength of the economy allows the Fed to be patient.\n\nBoston Fed president Susan Collins, another voting member this year, also called for a gradual approach.\n\nWith policy already closer to a more neutral stance, I view the current nature of uncertainty as calling for a gradual and patient approach to policy making, Collins said. But DWS Group head of fixed income George Catrambone said the new numbers released Wednesday provided a sigh of relief for the Fed.\n\nBut there is still a lot of uncertainty ahead, as new policies from the Trump administration may affect the outlook.\n\nAs to when the Fed may first cut rates in 2025, if we dont see it by Jackson Hole, its not coming, Catrambone added, referring to an annual Fed event that takes place in late August.  Yahoo Finance.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2020/01/federal-reserve-480.jpg",
            "description": "Fresh inflation data released Wednesday is likely to keep the Federal Reserve on pause during its next policy meeting this month, even though a new reading did show some signs of easing. On a ‘‘core’’ basis, which eliminates the more volatile costs of food and gas, the December Consumer Price Index (CPI) climbed 0,2 percent […]",
            "time": "06:34",
            "date": "17 Jan 2025"
        },
        {
            "title": "Geo Pomona waste sorting plant ready soon",
            "url": "https://www.herald.co.zw/geo-pomona-waste-sorting-plant-ready-soon/",
            "content": "Wallace Ruzvidzo and Remember Deketeke\n\nThe Geo Pomona Waste Management waste sorting plant will be completed by the end of next month, company chief executive officer and executive chairman Dr Dilesh Nguwaya has said.\n\nA sorting plant is a facility where mixed waste materials are processed to separate and categorise different types ofx recyclables and non-recyclables.\n\nMixed waste will arrive at the sorting plant, where recyclable materials like plastics, bottles, and metals are removed and sold to recycling companies.\n\nNon-recyclable combustible waste will be sent to the waste-to-energy plant for incineration, generating electricity.\n\nSpeaking during a tour of Geo Pomona Waste Management by the City of Mutare executives yesterday, Dr Nguwaya said the installation of the sorting plant is being done by Turkish engineers. Their expertise ensures that the project is progressing smoothly and efficiently, said Dr Nguwaya.\n\nWe anticipate that the installation will be completed by the end of February, marking a significant milestone in our waste management efforts.\n\nIn respect of waste-to-energy, Dr Nguwaya said there is need to replicate such processes in all cities and towns around the country.\n\nWe aim to have all cities in Zimbabwe adopt a waste management process similar to the sorting plants implemented in Harare aimed at enhancing efficiency in waste handling and promoting recycling, he said.\n\nActing director of health services for Mutare City Council Ms Unice Muyambuki appreciated the advanced waste treatment plant.\n\nIn Mutare, we are pleased to report progress in developing our landfill, having successfully drilled boreholes in 2024 to monitor groundwater quality. Our next step is to establish a leachate treatment plant. We have gained valuable insights and observed advanced technologies that streamline the process of constructing leachate treatment ponds.\n\nWe are accustomed to old methods of using containers for water flow and planting specific weeds to process heavy metals. However, I was amazed today by the new technology that effectively cleans the water permanently, said Ms Muyambuki.\n\nMeanwhile, Dr Nguwaya said his engineers are in Lesotho conducting a feasibility study in preparation for the signing of a Memorandum of Understanding with Lesotho.\n\nThey will be returning to Zimbabwe soon, and we will sign the MOU with the government of Lesotho. We are prepared to begin work in Maseru to provide them with effective waste management solutions similar to those we have implemented in Zimbabwe, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/3ee.jpg",
            "description": "Wallace Ruzvidzo and Remember Deketeke The Geo Pomona Waste Management waste sorting plant will be completed by the end of next month, company chief executive officer and executive chairman Dr Dilesh Nguwaya has said. A sorting plant is a facility where mixed waste materials are processed to separate and categorise different types ofx recyclables and […]",
            "time": "06:34",
            "date": "17 Jan 2025"
        }
    ]
}