{
    "news": [
        {
            "title": "Sadc to take action on DRC",
            "url": "https://www.herald.co.zw/sadc-to-take-action-on-drc/",
            "content": "Fungi Kwaramba, News Editor\n\nSADC will take full responsibility for the situation in the Democratic Republic of Congo (DRC) and take decisive action to deal with the deteriorating security issues in the Eastern parts of the vast and resource rich country, the blocs chairman President Mnangagwa has said.\n\nIn a statement last night, President Mnangagwa expressed grave concern over the security situation in Eastern DRC, where rebels have reportedly seized the city of Goma, leaving a bloody trail and displacing hundreds.\n\nThe Chairman of Sadc, His Excellency President Emmerson Dambudzo Mnangagwa expresses grave concern on the deteriorating security and humanitarian situation in the Eastern DRC occasioned by the offensive operations of the M23 rebels. The Chairman condemns, unreservedly, the cowardly attacks on the UN and Sadc peacekeepers that have resulted in some of them paying the ultimate sacrifice for the cause of peace in the Eastern DRC, read the statement issued by the Sadc Secretariat.\n\nThe death toll from fighting between peacekeeping soldiers and M23 rebels in eastern Congo has reached 13.\n\nThe number includes nine South African National Defence Force (SANDF) soldiers and others from Malawi and Uruguay deployed as part of the Southern African Development Community (SADC) regional force or under the UN mission in Congo (MONUSCO).\n\nThe Chairman of SADC presents his condolences to the families of the deceased peacekeepers and wishes those injured a quick recovery. The Chairman of SADC points out that SADC will assume its full responsibility and take action to deal with the deteriorating security and humanitarian situation in Eastern DRC. Those responsible for the situation should be held accountable, read the statement.\n\nSince 2021, M23 rebels have gained control over significant areas of the mineral-rich eastern DRC.\n\nThis escalation has resulted in a severe humanitarian crisis, with hundreds of thousands of individuals fleeing their homes. According to the United Nations, hundreds have also been killed.\n\nIn recent weeks, M23 has made rapid advances towards Goma, a city with a population exceeding one million.\n\nIntense fighting in the region has further exacerbated the situation, leading to heightened fears among residents.\n\nAs of early 2025, over 400 000 people had been displaced in the provinces of North and South Kivu, which are located near the border with Rwanda.\n\nThe UNs refugee agency has reported a growing humanitarian need as families are forced to flee their homes in search of safety and shelter.\n\nIn an earlier statement, the Sadc Secretariat noted that the M23 aggression was in violation of the peace agreement that was struck by Angolan leader, President Joase Manuel Goncalves Lourenco, between the DRC Government and the rebels.\n\nThe actions of the M23 armed group contravenes the Nairobi Peace Process and is a clear violation of the agreed ceasefire brokered through the Luanda Process led by His Excellency Joo Manuel Gonalves Loureno, President of the Republic of Angola in his capacity as the African Union Champion for Peace and Reconciliation in Africa. We, therefore, call on all parties in the conflict to adhere to their obligations in the ceasefire, calling for immediate cessation of hostilities and atrocities perpetrated by M23 as well as unconditional withdrawal from all occupied positions, reads the statement.\n\nSadc further encourages all parties to the conflict in Eastern DRC to comply with the terms and conditions of the existing peace agreements and engage through dialogue for everlasting peace, security and stability in the DRC and the Region.\n\nThe regional bloc reaffirmed its unwavering commitment to continue supporting the DRC in its pursuit of safeguarding its independence, sovereignty, and territorial integrity, as well as sustainable peace, security and development.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/President-Mnangagwa-8.jpg",
            "description": "Fungi Kwaramba, News Editor SADC will take full responsibility for the situation in the Democratic Republic of Congo (DRC) and take decisive action to deal with the deteriorating security issues in the Eastern parts of the vast and resource rich country, the bloc’s chairman President Mnangagwa has said. In a statement last night, President Mnangagwa […]",
            "time": "08:39",
            "date": "28 Jan 2025"
        },
        {
            "title": "Nation called to remain united, focused",
            "url": "https://www.herald.co.zw/nation-called-to-remain-united-focused/",
            "content": "Zvamaida Murwira, Senior Reporter\n\nGOVERNMENT is aware of challenges faced by citizens such as unreliable public transport, an unregulated informal market, health and infrastructure issues and is currently addressing them, Acting President Constantino Chiwenga has said.\n\nAddressing mourners during the burial of National Hero and career civil servant, Cde Justin Mupamhanga, also known as Cde Top Ten, at the National Heroes Acre in Harare yesterday, Acting President Chiwenga said there was need to remain united and focused.\n\nHe also slammed corrupt tendencies in society, saying national resources ought to be shared equally and not for them to be a preserve of a few individuals.\n\nThe Acting President stressed that fair distribution of the nations wealth was consistent with the ethos and spirit of the liberation struggle that saw men and women waging a protracted fight against settler regime that resulted in the countrys independence.\n\nThe Government is fully aware of the issues that are affecting the citizenry such as unreliable public transport, unregulated informal market, health and infrastructure challenges which are already being addressed. Irrespective of all these, we must remain united and focused. Let us remain vigilant and ready to defend our country, its resources and ideals, including its values and sum-culture. We must not be a generation which betrays or fails our revolution and its ideals purchased through such painful sacrifice, he said.\n\nActing President Chiwenga said to realise an upper middle-income economy as envisaged by President Mnangagwa, there was need to marshal collective energy towards one goal.\n\nWe must produce more, we must beneficiate all our resources, we must industrialise our economy towards value addition and beneficiation. Above all, we must turn our rural areas into centres of industrial activity, based on each communitys resource endowment. Rural industrialisation is one key lesson we learn from successful countries and growing economies. We must lift our people out of degrading and dehumanising poverty, indeed change the trajectory of flow of goods and services back to the countryside where we all began, he said.\n\nVice President Kembo Mohadi (left) in conversation with Defence Minister Oppah Muchinguri-Kashiri and Harare Provincial Affairs and Devolution Minister Charles Tavengwa (right) during the burial of Cde Mupamhanga yesterday\n\nActing President Chiwenga called upon Zimbabweans to uphold the tenets of the liberation struggle that entailed utilisation of available resources for the greater and common good for everyone.\n\nDuring the liberation struggle, he said, everyone remained focused, echoing the wartime mantra that called for unity and a collective vision for the nations future.\n\nIn mind comes the song, tose tichanoguta kumusha muZimbabwe yakasununguka. It was a call which helped us endure hardships, indeed which gave us a glimpse of a brave new world we were all carving through shared sacrifices. We fought for a total Zimbabwe, fought for all its wealth: the minerals, the flora, the fauna, its cultures, its heritage, its identities, its beliefs! Indeed, we fought for its rise as a soaring great nation. The wartime call urged us not to be greedy and selfish, not to be corrupt and egocentric or to be narrow-minded and tribalist. We all swore to a shared future in which everyone had a place on the table, a place in the sun for a culture of equal opportunity where every Zimbabwean served in equal measure. Zvehubvanzu-bvanzu kudya kwemhumhi takazviramba, Acting President Chiwenga said.\n\nWhen our President says leaving no one and no place behind, he is reminding us of this wartime covenant, a covenant we must all live by, across generations starting and including our very own. Zimbabwe belongs to all of us. We must share its God-given bounty, share its bounty equally, so no one, not even the weak, the widowed or the orphaned, are displaced or elbowed out by the strong in a mad rat-race to grab unmerited privileges. Corruption has to end.\n\nHe said there was need to share resources equitably and work towards the development of the country as was envisaged by Cde Mupamhanga.\n\nI am highlighting all these so that you understand, Dear Fellow Zimbabweans, that the mantras by which this nation is governed, come from very far; they define us as a people. They capture our deeply-held values, our morals, our aspirations and burdens we carry forward bestowed on us by our fallen heroes. Inhaka yemusiyidzanwa, a timeless heritage which each generation must safeguard jealously, and bequeath to the next one coming after it, said Acting President Chiwenga.\n\nOur Vision 2030 is for all of us, kwete dzamunoti mbinga! Kuhondo taidziti zvigananda: those who grow big tummies through ill-gotten wealth and questionable morals! A nation is as developed as its weakest man and woman; indeed, as its remotest part.\n\nFrom left: Ministers Dr Anxious Masuka, Ziyambi Ziyambi, and Dr Jenfan Muswere, Deputy Speaker of Parliament Tsitsi Gezi, Chief Negomo and other dignitaries observe proceedings at the burial of Cde Mupamhanga in Harare yesterday\n\nHe said the Mupamhanga family should find solace in knowing that the entire nation stands with them.\n\nThe Acting President said it was sad that the burial of Cde Mupamhanga comes barely after the nation mourned three national heroes at the national shrine.\n\nThe three are Cdes Chenhamo Chen Chakezha Chimutengwende, Major General (Retired) Solomon Siziba and Ambassador John Shumba Mvundura.\n\nBorn in Goneso Village, under Chief Ruzane in the Hwedza District of Mashonaland East Province on March 1, 1953, Cde Mupamhangas father, Patson Mupamhanga, later migrated to Mt Darwin area in search of good farming land which he secured in the so-called African Purchase Area of Chesa.\n\nHe was a renowned farmer, which is what earned him that piece of land in another district of the then Rhodesia.\n\nHe went to Nyakasikana Primary School and later to St Augustine Anglican Secondary School in Manicaland, where he excelled academically.\n\nDriven by the injustices of the colonial regime, he joined a wave of determined youth who protested against oppression, leading to his ultimate expulsion from school and relocation to Harare, where he completed his education.\n\nMotivated by a profound sense of national duty, Cde Mupamhanga abandoned his studies at the University of Rhodesia in 1975 to join the liberation struggle, becoming part of The 8, a group of educated and courageous individuals who sacrificed their futures for the countrys independence.\n\nThese included Cde Chris Mutsvangwa, Justice George Mutandwa Chiweshe, the late Ambassador John Mayowe, the late Cde Willard Duri, Dr Masimba Mwazha, lawyer Cde Sobuza Gula Ndebele and the late Cde Neville Dembetembe who fell in battle during the Struggle.\n\nCde Mupamhangas extraordinary talents made him part of the training Team at the Wampua Political College at Chimoio Camp.\n\nHis mastery in Portuguese language often saw him serving as a translator for pivotal meetings involving the late President Cde Robert Gabriel Mugabe and Mozambiques late President Cde Samora Moises Machel.\n\nPost-Independence in 1980, the ruling party authorised him to remain in Mozambique to complete his degree in Economics at Eduardo Mondlane University and returned in 1983 to serve in various strategic roles, significantly shaping the countrys economic landscape.\n\nOn his return, Cde Mupamhanga joined the Presidents Department under the Economics Division. He was then posted to the United Kingdom Mission from 1994 as a Minister Counsellor.\n\nHe took advantage of the posting and enrolled for a Masters in Business Administration at Middlesex University. His dissertation looked at strategies to improve Foreign Direct Investment to Zimbabwe. Later, he was recalled to Head Office where he was tasked to transform the Economics Division into a full-fledged Branch.\n\nThe late former President Mugabe would later appoint Cde Mupamhanga to the sensitive post of Secretary for Energy and Power Development in December 2002 and tasked to address critical challenges like the then prevailing fuel shortages and restructure vital energy and power institutions such as the Zimbabwe Electricity Supply Authority (ZESA) and the introduction of the Zimbabwe Energy Regulatory Authority (ZERA).\n\nIn times of the El Nino induced droughts that have from time to time devastated the Southern African Region, Cde Mupamhanga was part of a Taskforce that included the late Minister of Agriculture as then Airforce Commander, Air Chief Marshall Perrance Shiri, late Lieutenant General Amoth Chinombe, then Chief of Staff in the Defence Forces, and Ngonidzashe Masoka, the then Secretary for Agriculture.\n\nThe Taskforce was charged with the responsibility of importing grain to avert hunger in the country. Acting President Chiwenga said the taskforces comprised hard-headed trouble-shooters.\n\nIn 2012, Cde Mupamhanga was appointed Deputy Chief Secretary Responsible for Monitoring and Evaluation in the Office of the President and Cabinet.\n\nUpon his retirement around 2019, he took up influential roles in Kuvimba Mining House and was also adviser to the late Minister of Agriculture (Air Chief Marshal (Ret) Shiri.\n\nActing President Chiwenga was accompanied by wife, Colonel Miniyothabo Baloyi-Chiwenga.\n\nOther dignitaries that attended the event include Vice President Kembo Mohadi, Defence Minister, Oppah Muchinguri-Kashiri, Deputy Chief Justice Elizabeth Gwaunza, Cabinet Ministers, Zanu PF Politburo members, Service Chiefs, diplomats accredited to Zimbabwe and senior Government officials.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/VP1.jpg",
            "description": "Zvamaida Murwira, Senior Reporter GOVERNMENT is aware of challenges faced by citizens such as unreliable public transport, an unregulated informal market, health and infrastructure issues and is currently addressing them, Acting President Constantino Chiwenga has said. Addressing mourners during the burial of National Hero and career civil servant, Cde Justin Mupamhanga, also known as “Cde […]",
            "time": "08:39",
            "date": "28 Jan 2025"
        },
        {
            "title": "Govt tightens screws on smuggling rings",
            "url": "https://www.herald.co.zw/govt-tightens-screws-on-smuggling-rings/",
            "content": "Wallace Ruzvidzo, Herald Reporter\n\nGOVERNMENT has identified 19 goods that will be presumed smuggled unless importers produce genuine documentation proving duty payment, as the Second Republic intensifies its crackdown on illicit trade.\n\nThe goods are alcoholic beverages, non-alcoholic beverages, cement, clothing, footwear, dairy products, diapers, electrical appliances, cables and accessories, ploughs and parts thereof, processed meat, rice, pasta, sugar, tyres, motor spares, washing powder and detergents, biscuits, sweets, laundry and baths soaps.\n\nThe Minister of Finance, Economic Development and Investment Promotion, Professor Mthuli Ncube, announced the new regulations in Statutory Instrument 7 of 2025 yesterday.\n\nThe regulations take effect today, and are an addition to the multi-agency task force being led by the Ministry of Industry and Commerce, as Government tightens the noose on the flow of illegal imports.\n\nIt is hereby notified that the Minister of Finance, Economic Development and Investment Promotion has, in terms of section 235, as read with section 8 of section 223A of the Customs and Excise Act [Chapter 23.02], made the following regulations:  (1) These regulations may be cited as the Customs and Excise (Designated Deemed Smuggled Goods) Regulations, 2025. (2) These regulations shall be deemed to take effect from the 28th November, 2024.\n\n2. Subject to section 3, the Minister of Finance, Economic Development and Investment Promotion hereby designates the goods of a commercial nature listed in the Schedule below for the purpose of section 223A of the Act, reads the Statutory Instrument.\n\nProf Ncube said all those found in contravention of the regulations will be liable to payment of the duty and applicable penalties.\n\nEvery manufacturer, wholesaler, retailer or individual who is found in possession of the designated goods, and fails to furnish to the Commissioner or any officer or person authorised by the Commissioner, authentic documentary evidence that duty has been properly accounted for in terms of this Act, shall be deemed to have smuggled the goods and liable to payment of the duty thereof, including applicable penalties.\n\nProf Ncube said no customer will be required to produce documentation of duty on goods purchased from a local manufacturer, wholesaler or retailer.\n\nFor the avoidance of doubt, no customer shall be required to produce proof of payment of duty on imported goods purchased from a local manufacturer, wholesaler or retailer.\n\nIt shall be the responsibility of the person who would have imported the goods or the manufacturer (in the case of such imported goods used as inputs into production), wholesaler or retailer of such imported goods to provide satisfactory documentary evidence to the extent that the goods have been properly imported, reads the Customs and Excise (Designated Deemed Smuggled Goods) Regulations, 2025.\n\nSince December last year, the Zimbabwe Revenue Authority (Zimra) has impounded goods valued at approximately US$2,4 million in a multi-agency operation targeting importers and cross-border transporters involved in smuggling and unethical business practices.\n\nThe operation has resulted in the seizure of dozens of vehicles, including cross-border buses and haulage trucks, and confiscation of illicit goods such as foodstuffs and second-hand clothes.\n\nAccording to Zimra, the operation, which involves inspections of vehicular traffic, particularly commercial and passenger transport vehicles on cross-border trade routes, is targeting transporters and non-compliant importers.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/03/Minister-Mthuli-Ncube.jpg",
            "description": "Wallace Ruzvidzo, Herald Reporter GOVERNMENT has identified 19 goods that will be presumed smuggled unless importers produce genuine documentation proving duty payment, as the Second Republic intensifies its crackdown on illicit trade. The goods are alcoholic beverages, non-alcoholic beverages, cement, clothing, footwear, dairy products, diapers, electrical appliances, cables and accessories, ploughs and parts thereof, processed […]",
            "time": "08:39",
            "date": "28 Jan 2025"
        },
        {
            "title": "First Lady warns against sexual immorality",
            "url": "https://www.herald.co.zw/first-lady-warns-against-sexual-immorality/",
            "content": "Tendai Rupapa, Senior Reporter\n\nCases of juvenile delinquency and sexual immorality are on the increase among youths countrywide as evidenced by numerous such cases which First Lady Dr Auxillia Mnangagwa is personally handling to ensure children remain morally upright and committed to their studies.\n\nAmong the cases, is one of teenagers, a 15-year-old girl and a 16-year-old boy  who rushed to her for assistance after the girl fell pregnant and they had nowhere to go.\n\nBoth parties are from broken families and the boys father is also polygamous.\n\nThis is the girls second pregnancy after she terminated the initial one at the age of 14 with the assistance of her grandmother who was given pills by a relative working in the health sector.\n\nOn a sad note, the girl was previously raped by her uncle, who was 19-years-old then while in Grade Three.\n\nShe later met her husband in Rusape when she was 14 and doing Form Two and became intimate.\n\nShe fell pregnant and later terminated.\n\nShe, however, continued sleeping with her boyfriend behind her grandmothers back and fell pregnant again.\n\nThe teenager was then chased away from home.\n\nThe boy, the First Lady heard, took her pregnant girlfriend to her fathers house in Harare and the two were also chased away.\n\nThey started living in the streets of Harare.\n\nBoth the boy and the girl later sought refuge at the First Ladys Skills Development Centre in Mbare which is housing former street kids and drug addicts where they are attending school and acquiring vocational skills.\n\nChildren at the centre are supervised by social workers.\n\nOn arrival at the centre, the pair had not disclosed that they were a couple and that the girl was already expecting.\n\nKnowing that the mother of the nation is against early pregnancies and is always urging learners to value education and shun romantic relationships, the pair decided to come out in the open and reveal the truth.\n\nThey asked the social workers to take them to the First Lady for counselling and to ask for forgiveness.\n\nSo touching was the story shared by the minors who said they wanted to advise other young people about challenges associated with entering love relationships, before the time was ripe.\n\nOne day, after school, I proceeded to Vengere Township. I then met my boyfriend (name supplied) and we had sexual intercourse. He had since dropped out of school. To be frank, I did not know him nor his background. He just lured me. I was 14 and he was 15. We continued meeting after school and sleeping together, the girl said.\n\nYou told me that you once aborted, who facilitated that? the First Lady asked.\n\nIn response, the girl said: I had a first pregnancy with the same boy at 14. My grandmother advised me to terminate it because I was young. She then gave me some pills which she bought from her relative who works at a hospital in Mutare. My grandmother (name supplied) is a janitor at council in Rusape. When my parents divorced, that is when I moved to stay with grandmother. I went to stay with her together with my brother who is now in Form One.\n\nShe continued; There is a day I did not get home on time whereupon my grandmother ordered me to return wherever I had been. When I told the guy what had happened, he decided that we go to Chitungwiza where his father lived with his two wives.\n\nHowever, the boys father said he could not accommodate us saying his son had challenged his decision to have more than one wife. It was around 9pm and we walked until we slept in an unoccupied shade. The following day, we continued spending our nights sleeping on the streets. That is when my partner later suggested that we come to Mbare where you are housing other former street children, the girl said in a tide of emotion.\n\nI can see that now you are pregnant, the First Lady said.\n\nYes, I am pregnant for the second time from the same boy. I am sorry, Mhamha, for not disclosing earlier. I was afraid because we know your stance on early pregnancies, the young girl said.\n\nThe First Lady also held a discussion with the boy, who gave his side of the story in a way that demonstrated the high levels of immorality among youths attributed to lack of parental guidance.\n\nYou said when you went to Chitungwiza you were quizzed as to why your father had two wives resulting in him chasing you? the First Lady asked as the boy responded in the affirmative.\n\nI am 16 years old. When I left this girl in Rusape, she was pregnant and I went to my father and found him with two women. I quizzed him why he did so and he chased me away, making me live in the street. I then decided to go back to Rusape to see my girlfriend who said she had terminated the pregnancy. Izvi zvakandirwadza zvikuru nekuti mwana wangu ndaimuda, he said.\n\nHe said when her girlfriend fell pregnant for the second time, he then decided to take her home, but it was not to be, so they went to Mbare.\n\nAsked by the First Lady on what should be done to the grandmother and the woman who helped her to terminate the pregnancy, the boy said; I want the grandmother to be arrested because I wanted my baby and my wife that is why I went back for them. I have no other girlfriend and I am willing to work and look after her and the child, he said.\n\nThe teenagers spoke about their regular fights, a sign that they got married before they were ready.\n\nI am a footballer and I had swollen legs and she pushed me, whereupon I beat her up.\n\nWhy are you always fighting? the First Lady asked.\n\nIf I just tell him that he hasnt bathed, he turns violent, the girl replied.\n\nDr Mnangagwa then gave the teens some words of advice.\n\nYesterday, I had another case and today I have come across a similar story of teenagers who met out there and impregnated one another for the first time when the girl was 14 and the boy 15. The first pregnancy was terminated by the girls grandmother whom we actually look up to look after the children. But the grandmother terminated the 14-year-old childs pregnancy.\n\nThe children met again and the girl is now two-months pregnant at 15. I have come to know them after they came to stay at the centre where we are rehabilitating children who were living and working on the streets by sending them to school to attain vocational skills.\n\nThey came when the girl was already pregnant. What pained me most is their ages. They are young and the girl failed to state that she is two months pregnant. I want to ask the grandmother why she terminated the first pregnancy, she could have died in the process and now that there is a second one, will she do the same?\n\nWhen I asked about their backgrounds, I learnt that these children came from backgrounds they lacked parental guidance. The girls parents went to South Africa and divorced. The girl was left with her grandmother who then facilitated the abortion. She told her not to tell anyone as she feared arrest. But if we behave that way as parents, I do not see value in this to families and the nation. We expect these children to be in school, but elders are coming in to cause more trouble.\n\nMy word to such parents, because this grandmother is a parent, is that what she did was wrong. We will see how we handle the matter through my 575 call centre which works with other stakeholders like the police. My office works with other arms who will come in and assess this case.\n\nAs I speak, the grandmother does not know where this girl is, neither does she know that she is pregnant again from the same boy. I asked their future plans and whether they look forward to spending 50 years together and the boy said he needs a job to look after the girl and the child.\n\nThese are the challenges that we are encountering. There is a school at the centre where children are learning while also vachidzidziswa mabasa emaoko. I am happy that these two are not into drugs. They once lived on the streets and were influenced by others to partake but they refused.\n\nTo other learners, look why I hammer on the need for them to focus on education. Now this girl is pregnant and she will take time to deliver and when she does, she cant go to school with the baby who will be crying in class, disrupting other learners. In exams if you excuse yourself to feed the baby, its a done deal. All this is affecting the girl and the boy is least affected, the First Lady said.\n\nThe mother of the nation implored parents to put their heads together and assist children.\n\nParents, let us help one another. Do not help destroy what is being built. The burden then goes to other women out there when you are the ones at home that are destroying. If we do that, we would not have taught the child. She will know that once I fall pregnant, grandmother is there and she will help me terminate it. One day this child will die and you silence the child. These children came and confided in me. It is tough for me and it shows the naughtiness in children which stems from the families. I have made the children stay at the skills centre and not get away lest she aborts again and gets into trouble, she said.\n\nThe young couple warned their peers against sexual immorality.\n\nAll boys in Zimbabwe, please do not sleep with girls before the time is ripe because she will end up pregnant. At present, I am being looked after by the First Lady who is sending me to school as I learn tailoring.\n\nDo not rush for things that are above your ages. I have a 15-year-old girl who is pregnant and I am 16. We came here like that and the First Lady welcomed us. We made a big mistake, the boy said.\n\nThe girl shared similar sentiments, advising other girls against early sexual relations.\n\nMy words of advice to girls is that do not rush to date boys before time is ripe as you may fall pregnant and trouble your parents. I fell pregnant at 14 years of age and this is the second one after I terminated the initial pregnancy.\n\nI am two months pregnant; I ruined my life. I was shy to speak out but my boyfriend told the First Lady everything, she said.\n\nThey both thanked the mother of the nation for her love and kindness and promised to continue with their studies at the Mbare centre.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/FL.jpg",
            "description": "Tendai Rupapa, Senior Reporter Cases of juvenile delinquency and sexual immorality are on the increase among youths countrywide as evidenced by numerous such cases which First Lady Dr Auxillia Mnangagwa is personally handling to ensure children remain morally upright and committed to their studies. Among the cases, is one of teenagers, a 15-year-old girl and […]",
            "time": "08:39",
            "date": "28 Jan 2025"
        },
        {
            "title": "Zimbabwe poised to reap rewards from minerals value addition",
            "url": "https://www.herald.co.zw/zimbabwe-poised-to-reap-rewards-from-minerals-value-addition/",
            "content": "Wallace Ruzvidzo, Herald Reporter\n\nZimbabwe is poised to play a pivotal role in the global shift towards a green economy, leveraging its rich deposits of critical minerals such as lithium and graphite needed to drive the transition.\n\nFinance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube stressed this crucial economic resource after attending the World Economic Forum Annual Meeting 2025, held in Davos, Switzerland, last week.\n\nThe annual meeting brought together global leaders to address key global and regional challenges including responding to geopolitical shocks, stimulating growth to improve living standards, and stewarding a just and inclusive energy transition.\n\nPresident Mnangagwa is on record stating that mineral-rich countries like Zimbabwe must not remain poor, but should take advantage of the enormous opportunities afforded by the shift to a green economy, to diversify and champion economic growth.\n\nProf Ncube said Zimbabwe was looking to play a critical role in the global transition, with policies already in place to ensure beneficiation as enunciated by President Mnangagwa.\n\nThe World Economic Forum annual meeting for 2025 has come to an end. We have had a very productive week under the theme Collaboration in An Intelligent World.\n\nInvestors are thinking of new opportunities, especially in the future energy and minerals sectors and we as Zimbabwe need to position ourselves appropriately in terms of our lithium, graphite and whatever else we have to manufacture batteries to drive a green transition or electric vehicles, for example.\n\nSo, our policies around beneficiation are on the right path as a way to harness as many opportunities as possible, he said.\n\nThe Finance Minister said many issues were discussed at the four-day event, with the agenda focusing on five key areas: reimagining growth, industries in the intelligent age, investing in people, safeguarding the planet and rebuilding trust.\n\nWe also discussed issues around how to protect ourselves against climate shocks in terms of sovereign insurance, how to harness the air quality as an asset for example even just a mere conversion of fumes from a coal power station. Sulphur dioxide is produced and this can be converted to sulphuric acid, which we currently import, for example.\n\nSo suddenly you turn something harmful, that goes into the atmosphere, into a product you need, he said.\n\nPresident Mnangagwa continues to assert that Zimbabwe is moving from being a mere supplier of raw materials to a critical player in the renewable energy technology value chain.\n\nA situation where mineral-rich countries remain in perpetual poverty and mere suppliers of raw materials and net importers of the value-added, expensive technologies and goods, is no longer acceptable.\n\nAs one of those countries, Zimbabwe is blessed with abundant reserves of critical minerals such as lithium, platinum group of minerals, graphite and copper. There is also a broad array of rare earth minerals which are vital for renewable energy technologies and energy storage.\n\nMy country recognises, therefore, the enormous possibilities and responsibilities this entails, said the President during a high-level meeting on resourcing the energy transition with justice and equity in Baku, Azerbaijan, last November.\n\nThe World Economic Forum engages political, business, academic, civil society and other leaders of society to shape global, regional and industry agendas.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/08/Minister-Mthuli-Ncube.jpg",
            "description": "Wallace Ruzvidzo, Herald Reporter Zimbabwe is poised to play a pivotal role in the global shift towards a green economy, leveraging its rich deposits of critical minerals such as lithium and graphite needed to drive the transition. Finance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube stressed this crucial economic resource after attending the […]",
            "time": "08:39",
            "date": "28 Jan 2025"
        },
        {
            "title": "It’s democratic to amend Constitution: Garwe",
            "url": "https://www.herald.co.zw/its-democratic-to-amend-constitution-garwe/",
            "content": "Victor Maphosa, Mashonaland East Bureau\n\nAMENDING the Constitution to allow President Mnangagwa to remain in office beyond 2028 is both constitutional and democratic, Zanu PF Mashonaland East provincial chairman, Cde Daniel Garwe, has said.\n\nHe made these comments while addressing thousands of party supporters at the Murehwa inter-district meeting over the weekend, marking the first such gathering in the province this year.\n\nCde Garwe said resolutions made during the party conference held in Bulawayo last year are binding, adding that various districts in Mashonaland East had collectively decided that President Mnangagwa should extend his term until 2030 to oversee the attainment of Vision 2030.\n\nHe noted that the resolution for President Mnangagwa to continue at the helm was adopted without opposition during the conference.\n\nThe people want their President to stay in office. It is not the President pushing for this; it is us, the people, who have witnessed the massive developmental projects across Zimbabwe, he said, calling for constitutional amendments to facilitate this extension.\n\nIn response to critics who claim that this move is undemocratic, Cde Garwe said: It is democratic and constitutional to amend the Constitution.\n\nHe called on those who misunderstand Vision 2030 to gain clarity, asserting that the voice of the people is paramount.\n\nCde Garwe assured supporters that Vision 2030 is unstoppable and urged detractors to reconsider their plans.\n\nHe also addressed concerns about disrespectful comments made on social media by some party supporters, warning that such behaviour could lead to expulsion from the party.\n\nCde Garwe encouraged Zanu PF members to respect leadership and pray for wisdom for the President and other leaders.\n\nThe majority of Zimbabweans support Vision 2030, and this vision will prevail, he said.\n\nCde Garwe urged attendees to spread the message that President Mnangagwa would still be in office by 2030, encouraging education over conflict in discussions with those opposed to the resolution.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Garwe.jpg",
            "description": "Victor Maphosa, Mashonaland East Bureau AMENDING the Constitution to allow President Mnangagwa to remain in office beyond 2028 is both constitutional and democratic, Zanu PF Mashonaland East provincial chairman, Cde Daniel Garwe, has said. He made these comments while addressing thousands of party supporters at the Murehwa inter-district meeting over the weekend, marking the first […]",
            "time": "08:39",
            "date": "28 Jan 2025"
        },
        {
            "title": "EDITORIAL COMMENT: Let’s support small-scale gold miners to produce more",
            "url": "https://www.herald.co.zw/editorial-comment-lets-support-small-scale-gold-miners-to-produce-more/",
            "content": "SMALL-scale and artisanal gold miners last year produced and delivered around 24 tonnes of gold, almost two thirds of the total production.\n\nA lot of the increase in deliveries to Fidelity Refiners comes from small producers now using the official market, rather than being tempted to sell on the black market or smuggle their gold.\n\nFidelity itself has made sure that there are more selling points where gold can be assayed, weighed and paid for promptly, so the legal and official market is accessible and efficient.\n\nAt the same time, the general tightening up in the Second Republic and the growing pressure against dishonest dealings encourages turning to the more readily acceptable legal markets.\n\nWhile small scale miners have to pay royalties, there are special rates for the small producers who pay a lot less than the five percent charged for the major miners. The first 500g or less a month is charged a one percent royalty and then these miners pay two percent for the next kilogramme.\n\nMost are just seeing the one percent deduction when they sell their small amounts of gold, and again this tends to make sure that they bring it in to Fidelity.\n\nThis turn to the legal and official markets should help the full formalisation of the artisanal and small scale sectors. Some of these producers already have the mining licences and other official paperwork they need, but there are still large numbers who just dig wherever they can, or pay rent to an established mine owner.\n\nModern databases and surveys using satellite imagery should mean that licences can be issued very cheaply for very small areas, allowing the artisanal miners to be registered and have their claims recorded.\n\nIt should be possible to assign blocks of small claims and licences, which would make inspections and the like even easier.\n\nGiving such very small producers security would help ensure there are no disputes and make them far more amenable to following basic and sensible rules over safety and the like.\n\nAt the same time, it would prevent those mavericks who dig up the ballast in railway tracks or tunnel under roads and schools. All mining operations would be legalised and regularised.\n\nOne major problem still remaining is that the majority of mine accidents and deaths are in the small scale and artisanal sector. We continually read of another small group of such miners trapped in a collapsing shaft, or trapped in a flooded tunnel or crushed by falling rock.\n\nLarge scale mines go to some lengths to ensure and enforce good safety standards, and while no one can prevent the odd minor injury when someone drops a hammer on their toes, major accidents are very rare in large mines.\n\nThe mining companies are continually looking for ways of creating and enforcing high standards and most have a dedicated senior manager making sure the production staff do not skip any of the laid down rules.\n\nWe see appeals from Government experts in the Ministry of Mines and Mining Development for artisanal miners and small scale miners not to take risks.\n\nThis would include the sort of risks that can occur when people enter older mine workings that have not been kept in good repair, or when storm water drains have been blocked or silted up allowing floods to flow down shafts after a major storm.\n\nThe recording of all claims, including the very small claims of artisanal miners and the renting out of mine workings on some substantial mines, would help improve safety by at least telling Government safety inspectors where people were working.\n\nSome of the artisanal miners are nervous of inspection, fearing that it is just one ploy to stop them earning a living. But if they are registered and formalised, the safety inspectors could do the really valuable job of showing the workers where the dangers are in their workings and, most importantly, what they need to do to reduce the risk of injury or death.\n\nSome solutions will be very simple, just not obvious or not already done because the miners are willing to accept the risks. But they still need to be enforced.\n\nOther dangers will be harder to see although solutions might not be costly. For example, old mine workings once properly drained might now be open to flooding after a few years of overgrown and silted-up drains, and the solution could well just be a couple of days digging so flood waters go to a river or stream, not down a shaft.\n\nA lot of Zimbabweans earn a reasonable full-time or part-time living from gold mining. The countrys gold deposits are usually small and scattered, and while gold is still common even after centuries of this small-scale extraction, most of it is only economically recoverable by an artisanal miner.\n\nThis is simply a geological fact and these scattered small deposits drove Portuguese and British imperialists to despair, while allowing local people working for themselves to earn a living.\n\nThere was no second giant Rand across Zimbabwe, but we are a consistent producer and still in the top 20 producers, just needing to make sure our small scale miners are allowed to produce.\n\nBut we want them to produce legally, as well as sell their gold legally, have the security of registered claims, even if these are special small claims, be environmentally aware and be open to inspection for safety advice and enforcement.\n\nWe think that with modern technologies we can have all this without any serious problems.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2018/10/gold-nugget.jpg",
            "description": "SMALL-scale and artisanal gold miners last year produced and delivered around 24 tonnes of gold, almost two thirds of the total production. A lot of the increase in deliveries to Fidelity Refiners comes from small producers now using the official market, rather than being tempted to sell on the black market or smuggle their gold. […]",
            "time": "08:39",
            "date": "28 Jan 2025"
        },
        {
            "title": "WARRIORS TO MEET BAFANA BAFANA AGAIN",
            "url": "https://www.herald.co.zw/warriors-to-meet-bafana-bafana-again/",
            "content": "Eddie Chikamhi, Zimpapers Sports Hub\n\nPERENNIAL rivals Zimbabwe and South Africa will once again face off on the big stage, with the two sides being drawn into the same 2025 Africa Cup of Nations group.\n\nIn a draw conducted in Rabat in the host country, Morocco, last night, the Warriors were thrust into a fair Group that also has another COSAFA rival, Angola, and North African giants Egypt. Record Nations Cup winners Egypt headlined the group and were the last one to be picked, as they were in Pot 1 during the draw staged at the iconic Mohammed V National Theatre in Rabat last night.\n\nZimbabwe and South Africa, who are also in the same group for the 2026 FIFA World Cup, are set to renew their rivalry at the continental football jamboree, where 24 nations will compete for Africas biggest foot-ball prize.\n\nThe tournament will take place in Morocco from December 21, 2025, to January 18, 2026.\n\nThe Warriors, who are now under German coach Michael Nees, are set to return to the grand stage after missing the previous edition held in Cote dIvoire due to a FIFA suspension.\n\nFor last nights draw, the 24 teams were placed into six groups of four. The top two teams in each group, along with the four best third-placed teams, will advance to the knock-out stage. Zimbabwe will make a sixth appearance at this event and will be looking to progress from the group stage for the first time.\n\nDue to their low ranking, the Warriors were put in Pot Four, which represented the level four teams. They could count themselves fortunate to have avoided hosts Morocco, who will face Mali, Zambia, and Comoros.\n\nMorocco, the first African nation to reach the semi-finals of the FIFA World Cup, will be among the countries to watch.\n\nThe congregation also celebrated the growth of the game on the continent. Eight teams participated when the AFCON tournament was last held in Morocco in 1988, and this year, there will be 24. The draw was conducted by CAF Director of Tournaments and Events Samson Adamu. African football legends Mustapha Hadji, Serge Aurier, Aliou Cisse, and Joseph Yobo assisted with the draw. Comoros were the first team to be picked and will play host Morocco in the opening match on January 21. Warriors coach Nees, who was part of the audience at the draw last night, was not immediately available to comment on the draw. His counterpart Hossan Hassan of Egypt told the gathering that the Pharaohs will be out to extend their record, powered by some of the world-class players such as Mahomad Salah and Manchester Citys new boy Omar Marmoush. I would like to wish all the best of luck to all the teams that want to win the big competition, said Hassan.\n\nAs the Egyptian team, we are proud because we have won seven times. Mohamed Salah, I am lucky as a coach to have him. We have a player among the best in the world. Egypt all the time has great talent like Omar Marmoush. I am very glad, as a coach, to have such talented players.\n\nSalah and Marmoush will be the positive elements for the Egypt team, said Hassan. Egypt are the record holder with seven titles, followed by Cameroon (five), and Cte dIvoire and Nigeria (three each). Before the draw, CAF, the Fdration Royale Marocaine de Football, and the Local Organizing Committee yesterday officially unveiled the host cities and stadiums for the highly anticipated tournament. Morocco, a nation renowned for its rich footballing culture and state-of-the-art infrastructure, will host the tournament across six vibrant cities: Rabat, Casablanca, Agadir, Marrakech, Fes, and Tangier.\n\nNine world-class stadiums have been selected, each equipped to provide an unforgettable experience for players and fans alike. Among the stand-out venues is the Grand Stade de Tanger, the largest with a capacity of 75 600, and Rabats Complexe Sportif Prince Moulay Abdellah, accommodating 69,500 spectators. Other venues, such as the Grand Stade de Marrakech and the Complexe Sportif Mohammed V in Casablanca, promise to deliver electrifying atmospheres throughout the competition.\n\nThis announcement reinforces Moroccos commitment to hosting a world-class tournament, blending its passion for football with impeccable organization.\n\nFans across the continent and beyond can expect a celebration of African football, culture, and unity.\n\nAFCON 2025 draw:\n\nGroup A:Morocco, Mali, Zambia, Comoros\n\nGroup B:Egypt, South Africa, Angola, Zimbabwe\n\nGroup C:Nigeria, Tunisia, Uganda, Tanzania\n\nGroup D:Senegal, DR Congo, Benin, Botswana\n\nGroup E:Algeria, Burkina Faso, Equatorial Guinea, Sudan\n\nGroup F:Cte dIvoire, Cameroon, Gabon, Mozambique\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Warriors.jpg",
            "description": "Eddie Chikamhi, Zimpapers Sports Hub PERENNIAL rivals Zimbabwe and South Africa will once again face off on the big stage, with the two sides being drawn into the same 2025 Africa Cup of Nations group. In a draw conducted in Rabat in the host country, Morocco, last night, the Warriors were thrust into a fair […]",
            "time": "08:39",
            "date": "28 Jan 2025"
        },
        {
            "title": "Local funding to plug WHO shortfall",
            "url": "https://www.herald.co.zw/local-funding-to-plug-who-shortfall/",
            "content": "Health Reporter\n\nFollowing the withdrawal by the United States from the World Health Organisation, the Zimbabwean Government has been encouraged to prioritise local resource mobilisation to finance its healthcare system.\n\nThe signing of an executive order to leave the global health body by US President Donald Trump last week is set to disrupt global health funding, with its potential ripple effects expected to be felt on developing countries like Zimbabwe, which rely heavily on international assistance to sustain public health programmes.\n\nCommunity Working Group on Health (CWGH) executive director, Mr Itai Rusike said the withdrawal of the US had considerable impact on the organisations operations at all levels and could result in reduced support for Zimbabwe.\n\nThis should also serve as a reminder to our Government to quickly move towards self-sustenance even as the country needs help. There should be a sound technical capacitation within the health delivery sector and in the sectors that hold key determinants of health especially as the country desires to attain the upper middle income economy benchmark and the SDGs, he said.\n\nFollowing the endorsement of the national health financing dialogue and establishment of the National Health Insurance, its time to hasten the transition, actions and implementation towards self-sustenance in health using the Primary Health Care for Universal Health Coverage (PHC4UHC) strategy. This doesnt mean we do not need the WHO, we just want to take charge of our health while the neighbours come to assist.\n\nHealth and Child Care Secretary Dr Aspect Maunganidze in December said domestic resource mobilisation for health was a key aspect to the Ministrys strategic plan going forward.\n\nIn November, we had our National Health Financing Dialogue, which is very key in trying to map out what we call local resource mobilisation. We are aware that donor community support all over the world is going down, so Zimbabwe has to find innovative ways of financing itself and making sure that we move with strides in this area. And on a whole Government approach, we obviously, through the Treasury, have pushed for more budget allocation to the Ministry of Health. And this has resulted in a jump from 9,86 percent to 13,01 percent, he said.\n\nThe Treasury has also introduced the sugar tax which is expected to be channelled towards the procurement of cancer machines.\n\nThe Ministry of Health, through the National Aids Council, is also administering the National AIDS Trust Fund which has been funding the national HIV response over the years.\n\nThere are also plans to integrate other comorbidities such as diabetes, hypertension, and cancer to the HIV response.\n\nSo, these are local health financing interventions that we are looking at and we are also moving with the issue of the National Health Insurance, which we expect to unlock more value for the whole nation. This is a local intervention to mobilise more resources through the existing taxes, we dont have to introduce new taxes, but we need to ring fence in those taxes that are already available so that will enhance our health service delivery, he said.\n\nSpeaking during an online briefing from the World Economic Forum in Davos, Switzerland, last week, Finance and Economic Development Minister Professor Mthuli Ncube alluded to the importance of domestic health financing.\n\nAny country with an HIV/AIDS challenge will be impacted. We need to scale up our funding for health. The earmarked taxes should be directed towards health as we build our capacity to fill the gap should any funding recede, he said.\n\nThe WHO has played a critical role in its member countries and the withdrawal of funding by the US could significantly reduce the impact the health body makes.\n\nIn a statement, WHO called on the US to reconsider its decision.\n\nWe hope the United States will reconsider and we look forward to engaging in constructive dialogue to maintain the partnership between the USA and WHO, for the benefit of the health and well-being of millions of people around the globe.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/05/Rusike-Itai-1024x1024.jpg",
            "description": "Health Reporter Following the withdrawal by the United States from the World Health Organisation, the Zimbabwean Government has been encouraged to prioritise local resource mobilisation to finance its healthcare system. The signing of an executive order to leave the global health body by US President Donald Trump last week is set to disrupt global health […]",
            "time": "08:39",
            "date": "28 Jan 2025"
        },
        {
            "title": "Govt tackles abuse of Presidential inputs",
            "url": "https://www.herald.co.zw/govt-tackles-abuse-of-presidential-inputs/",
            "content": "Patience Maturure, Herald Reporter\n\nGOVERNMENT has urged officials administering the Presidential Input Programme (PIP) to plug potential leakages and ensure inputs reach their intended recipients for improved agricultural production and productivity.\n\nThis warning comes on the backdrop of a recent case in which seed, fertiliser and chemicals that were meant for Ward 7 in Tsholotsho District, Matabeleland North Province, reportedly went missing.\n\nThe vehicle went missing with 400x 50kg bags of Urea fertiliser, 30x10kg sunflower seed and 100 x200ml bottles of Imidacloprid chemicals.\n\nThree suspects have since been arrested in connection with the matter and investigations are in progress.\n\nLands, Agriculture, Fisheries, Water and Rural Development permanent secretary, Professor Obert Jiri recently revealed that the Government had instructed the Criminal Investigation Department (CID) and Zimbabwe Republic Police (ZRP) to take action against the culprits who fled with a truck coming from Tsholotsho carrying fertilisers and seed.\n\nWe say no to abuse of agricultural inputs and we will never condone any attempt, activity or anything that has to do with the abuse of Presidential inputs, he said.\n\nHe explained that the Ministry and other Government officials had since adopted strategies to ensure that inputs are delivered and utilised by the right beneficiaries.\n\nWe want to improve all systems through surveillance and have also introduced the e-input distribution system and use of e-signatures plus facial recognition to end abuse of inputs, Prof Jiri added.\n\nIssues of abuse of inputs in the PIP were rampant in the cotton sector, which saw Government coming up new modalities for the distribution of the climate-proofed Presidential cotton inputs before the start of the 2024/25 season.\n\nUnder the strategy, all inputs will be delivered to common input distribution points (CIDPs) for their eventual movement to farmers by the Grain Marketing Board (GMB).\n\nThe Cotton Company of Zimbabwe (Cottco) and Agritex officers will identify and select productive farmers for submission to inputs distribution committees.\n\nThe list will be categorised into the following six classes  farmers who delivered seed cotton to Cottco, farmers growing cotton seed with Cottco, farmers who are doing cotton demonstrations, institutions venturing into cotton production, youth and women clubs venturing into cotton production and village heads, headmen and chiefs doing cotton production.\n\nGMB and Cottco will ensure all farmers sign contracts before they receive the first tranche of inputs before roping in Agritex and Agricultural and Marketing Authority to capture lists of farmers issued with inputs.\n\nAgritex and Cottco will then follow up on contracted farmers checking for crop establishment and general monitoring.\n\nApart from cotton, the Government adopted an improved standard operating procedure with role clarity and oversight. This includes the blacklisting of corrupt officials and banning of ward committees found implicit in the abuse of inputs.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/professor-obert-jiri-old.jpg",
            "description": "Patience Maturure, Herald Reporter GOVERNMENT has urged officials administering the Presidential Input Programme (PIP) to plug potential leakages and ensure inputs reach their intended recipients for improved agricultural production and productivity. This warning comes on the backdrop of a recent case in which seed, fertiliser and chemicals that were meant for Ward 7 in Tsholotsho […]",
            "time": "08:39",
            "date": "28 Jan 2025"
        }
    ]
}