{
    "news": [
        {
            "title": "70 from diverse technical backgrounds off to Centurion University",
            "url": "https://www.herald.co.zw/70-from-diverse-technical-backgrounds-off-to-centurion-university/",
            "content": "Mutsawashe Mashandure\n\nHerald Correspondent\n\nAt least 70 students are set to leave the country on Monday for India for studies at Centurion University under the Presidential Scholarship Programme.\n\nThe Office of the President and Cabinet is collaborating with the Indian Embassy in an initiative aimed at advancing Zimbabwes economic development by 2030.\n\nThe students will pursue courses in car manufacturing and garment making, marking a crucial step toward enhancing the countrys technical skill set.\n\nThe scholarship programme, which is being coordinated by the Presidential and National Scholarship Department is aimed at equipping the next generation with essential skills to transform local industries.\n\nAddressing the students during a send-off ceremony held on Friday the Deputy Chief Secretary in the Office of the President and Cabinet Reverend Paul Bayethe Damasane highlighted the need to tweak the education system 5.0.\n\nWe want to say let there be a change as well, a change which brings better skills, he said. Our major challenge is not so much that we are not literate but it is that there is a need to go beyond just literacy to the attainment of a skill set that is more productive.\n\nIndian Ambassador Mr Dina Nath Barnwal stated that the initiative fosters unity between nations by facilitating the exchange of ideas.\n\nHe said that participants will gain valuable skills and use them to contribute to the development of both Zimbabwe and India.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/kkk-680x380.jpeg",
            "description": "At least 70 students are set to leave the country on Monday for India for studies at Centurion University under the Presidential Scholarship Programme.",
            "time": "21:06",
            "date": "17 Jan 2025"
        },
        {
            "title": "Investors snap up shares in WestProp’s apartment hotel",
            "url": "https://www.herald.co.zw/investors-snap-up-shares-in-westprops-apartment-hotel/",
            "content": "Business Reporter\n\nInvestors have acquired 58 percent of the fractional shares in WestProp Holdings innovative apartment hotel, Millennium Heights, in Borrowdale West, Harare, chief executive, Mr Ken Sharpe has said.\n\nThe innovative model was launched in November last year, with investors participating with a minimum investment of US$5 000.\n\nThe model allows multiple investors to co-own an apartment, which will then be leased out to clients as short-term serviced accommodation.\n\nIn Zimbabwe, we have traditionally been accustomed to owning property outright. This approach (outright ownership) often requires significant upfront capital and can be a costly endeavour, especially for first-time investors, Mr Sharpe said.\n\nThat is where fractional ownership comes in. By pooling resources with like-minded investors, you can own a share of a luxury apartment hotel like Block 5 without breaking the bank.\n\nMr Sharpe said WestPop was actively engaged in an educational campaign to inform customers about the benefits of fractional share ownership in the apartment hotel.\n\nHe said the market was showing increasing interest in the concept, with a significant number of customers already purchasing shares in the branded apartment hotel.\n\nInvestors are particularly drawn to the flexibility of fractional ownership, which reduces risk and makes the investment more accessible\n\nAfter the first year of operation as an aparthotel, investors can expect returns of at least 8 percent, he said.\n\nHowever, as the property values increase and the hotels occupancy rates grow, so too will be the return on investment.\n\nMr Sharpe encouraged potential investors to seize the opportunity to secure their future and that of their families.\n\nHe said the investment presents a unique pathway towards long-term financial security. With guaranteed returns, he described it as a game-changer within Zimbabwes property market.\n\nThe innovative model, the first of its kind in the country, allows investors to enjoy the benefits of property ownership while simultaneously generating income, effectively enabling them to have their cake and eat it too.\n\nDo not miss out on this opportunity to invest in Zimbabwes future and secure a share of the profits, he said.\n\nWestProp is finalising a partnership with an international hotel brand currently absent from the Zimbabwean market.\n\nThe brand possesses significant expertise in the marketing and management of serviced apartments, often referred to as short-term rentals.\n\nMillennium Heights will offer a range of amenities for residents, including concierge services and exclusive recreational facilities. They include a swimming pool, a childrens play area, a gym, among others.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/millenium.jpg",
            "description": "Business Reporter Investors have acquired 58 percent of the fractional shares in WestProp Holdings’ innovative apartment hotel, Millennium Heights, in Borrowdale West, Harare, chief executive, Mr Ken Sharpe has said. The innovative model was launched in November last year, with investors participating with a minimum investment of US$5 000. The model allows multiple investors to […]",
            "time": "21:06",
            "date": "17 Jan 2025"
        },
        {
            "title": "Magaya, ZIFA judgement next Thursday",
            "url": "https://www.herald.co.zw/magaya-zifa-judgement-next-thursday/",
            "content": "Eddie Chikamhi\n\nZimpapers Sports Hub\n\nHIGH Court Judge Justice Tawanda Chitapi will deliver his verdict in the case in which Yadah owner Walter Magaya is challenging his disqualification from running for the office of ZIFA presidency, next week on Thursday.\n\nThe judge heard submissions from both sides this afternoon and advised that he would need some time to consider the submissions before coming up with a determination next Thursday, just two days before the scheduled date of the associations watershed elections.\n\nMagaya was barred from contesting because he did not comply with the requirement after he failed to submit an O Level certificate or equivalent.\n\nInstead, he submitted three diplomas, which his lawyers argued were well above the minimum requirements. Magaya was represented in the case by Advocate Thabani Mpofu.\n\nThe defendants, ZIFA were represented by renowned lawyer Lovemore Madhuku who argued the applicant erred by not producing the required certificate or something equivalent to an attainment given after going through high school.\n\nMadhuku also challenged the grounds of the appeal, which he dismissed as defective.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/de5d39e6-e9cd-4965-81be-7cb0a3134c9e-680x380.jpeg",
            "description": "Eddie Chikamhi Zimpapers Sports Hub HIGH Court Judge Justice Tawanda Chitapi will deliver his verdict in the case in which Yadah owner Walter Magaya is challenging his disqualification from running for the office of ZIFA presidency, next week on Thursday. The judge heard submissions from both sides this afternoon and advised that he would need […]",
            "time": "21:06",
            "date": "17 Jan 2025"
        },
        {
            "title": "Katonha twins visit Malawi Arron Nyamayaro in Lilongwe, Malawi",
            "url": "https://www.herald.co.zw/katonha-twins-visit-malawi-arron-nyamayaro-in-lilongwe-malawi/",
            "content": "Twins Association of Zimbabwe (TAZI) founders Farai Lawyer Katonha and Tendai Mayor Katonha on Friday paid a courtesy call on the Deputy Ambassador Lovemore Matemera at the Zimbabwean Embassy in Lilongwe, Malawi.\n\nThe twins were accompanied by the associations presidents Wellington and Washington Mbiwa as well as Malawi Twins founder, Flora Kamupesi Shumba.\n\nDeputy Ambassador Matemera hailed the Katonha twins for their regional impact.\n\nWe commend your leadership for engaging authorities and the impact you are showing within the region, he said.\n\nContinue to address issues to do with mothers of the twins and multiple births since they are the burden bearers of the challenges being met.\n\nWe urge church leaders and business community to complement Government efforts in its program that helps children from vulnerable communities under Basic Education Assistance Module (BEAM), said Dep Ambassador.\n\nThe Katonha twins are in Malawi as regional twins and multiple birth leaders with a mission to address issues to do with challenges facing mothers of twins and multiple birth.\n\nChief among the challenges include a rise in the dropping out of twins and multiple births from school, the right to access medication as well as empowerment.\n\nThirty sets of Malawian twins including Peter and Paul Mazimalima, Peter and Paul Nalikungwe are in its structures.\n\nThe Katonha twins tendered a paper on the vision of the regional organisation to Malawian government before meeting the sets of twins.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/mm.jpg",
            "description": "Twins Association of Zimbabwe (TAZI) founders Farai Lawyer Katonha and Tendai Mayor Katonha on Friday paid a courtesy call on the Deputy Ambassador Lovemore Matemera at the Zimbabwean Embassy in Lilongwe, Malawi.",
            "time": "21:06",
            "date": "17 Jan 2025"
        },
        {
            "title": "Zimsec ‘O’ Level results out",
            "url": "https://www.herald.co.zw/zimsec-o-level-results-out-2/",
            "content": "Ivan Zhakata and Tapiwa Chikuhwa\n\nTHE Zimbabwe School Examinations Council (Zimsec) has this Friday released the 2024 November results for Ordinary Level examinations.\n\nAddressing journalists, Zimsec board chairperson Professor Paul Mapfumo said the results will be accessible on the Zimsec portal from 4pm today and will be available for the next five days.\n\nThe Zimbabwe School Examinations Council board and management would like to advise the nation of the release of the 2024 November Ordinary Level examination results, he said.\n\nWith effect from today, 17 January 2025, 4 pm, Ordinary Level examination candidates results will be accessible to all candidates and authorised personnel online through the ZIMSEC portal accessed through the ZIMSEC websitewww.zimsec.co.zw.\n\nPlease take note that this portal will be open for five days only. Heads of examination centres will be able to collect the results for their respective school or centres from our regional offices on Monday, 20 January 2025.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/04/Zimsec.jpg",
            "description": "THE Zimbabwe School Examinations Council (Zimsec) has this Friday released the 2024 November results for Ordinary Level examinations.",
            "time": "21:06",
            "date": "17 Jan 2025"
        },
        {
            "title": "Dynamos Football Club’s founding member’s freedom bid fails",
            "url": "https://www.herald.co.zw/dynamos-football-clubs-founding-members-freedom-bid-fails/",
            "content": "Prosper Dembedza\n\nHerald Correspondent\n\nDYNAMOS Football Club founding member Bernard Marriot Lusengos bid for freedom hit a snag after his application for discharge at the close of the States case was dismissed by Harare magistrate Ms Yeukai Dzuda.\n\nLusengo is facing allegations of corruptly acquiring 51 percent shareholding in the club and allocating other shares to undeserving people who are not the clubs original members.\n\nIn her ruling, the magistrate said Lusengo had a case to answer and ordered that he should be put to his defence.\n\nInvestigations established that Lusengo allegedly declared himself the clubs chairman, and is said to have acted against a High Court order which awarded each founding member one percent share.\n\nThe then High Court judge Justice Luke Malaba gave the order after the ownership wrangle spilled into court in 2005.\n\nMarriot is charged with fraud.\n\nLeslie Gwindi is the complainant in the matter.\n\nMarriot was arrested by the Zimbabwe Anti-Corruption Commission.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/07/dynamos-11.jpg",
            "description": "Prosper Dembedza Herald Correspondent DYNAMOS Football Club founding member Bernard Marriot Lusengo’s bid for freedom hit a snag after his application for discharge at the close of the State’s case was dismissed by Harare magistrate Ms Yeukai Dzuda. Lusengo is facing allegations of corruptly acquiring 51 percent shareholding in the club and allocating other shares […]",
            "time": "21:06",
            "date": "17 Jan 2025"
        },
        {
            "title": "Construction of NAC Marondera offices progressing well",
            "url": "https://www.herald.co.zw/construction-of-nac-marondera-offices-progressing-well/",
            "content": "Victor Maphosa\n\nMashonaland East Bureau\n\nConstruction of the National Aids Council (NAC) Mashonaland East Provincial offices in Marondera is progressing well, with the whole structure expected to be completed this year.\n\nThe project will gobble about US$4 million.\n\nSecretary for Provincial Affairs and Devolution for Mashonaland East Mr Tavabarira Kutamahufa toured the construction site on Thursday to have an appreciation of the progress being made.\n\nHe was accompanied by Government officials from the province.\n\nI am satisfied with the progress here. The contractor is working around the clock to meet the target so that the intended service can be availed, he said.\n\nThe building will have four floors.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/up.jpg",
            "description": "Victor Maphosa Mashonaland East Bureau Construction of the National Aids Council (NAC) Mashonaland East Provincial offices in Marondera is progressing well, with the whole structure expected to be completed this year. The project will gobble about US$4 million. Secretary for Provincial Affairs and Devolution for Mashonaland East Mr Tavabarira Kutamahufa toured the construction site on […]",
            "time": "21:06",
            "date": "17 Jan 2025"
        },
        {
            "title": "President Mnangagwa pays tribute to late Vice President John Landa Nkomo",
            "url": "https://www.herald.co.zw/president-mnangagwa-pays-tribute-to-late-vice-president-john-landa-nkomo/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nPresident Emmerson Mnangagwa has called on Zimbabweans to uphold the enduring values of unity and peace championed by the late Vice President Dr John Landa Nkomo.\n\nIn a statement commemorating the 12th anniversary of the late Vice Presidents death, President Mnangagwa said Dr Nkomo was a revolutionary leader, a devoted nation-builder and a tireless advocate for peace whose legacy continues to shape Zimbabwes socio-political landscape.\n\nDr John Landa Nkomo was a man of unparalleled patriotism whose mantra Peace begins with me. Peace begins with you. Peace begins with all of us resonates deeply with our aspirations for a united and peaceful Zimbabwe, he said.\n\nThe late Vice President, who passed on January 17, 2013, was hailed for his illustrious career in public service spanning from the pre-independence nationalist movement to holding key ministerial portfolios after independence.\n\nHis roles included Deputy Minister of Industry and Energy, Speaker of Parliament and Vice President, among others.\n\nPresident Mnangagwa said Dr Nkomo worked in promoting national healing, reconciliation and integration, laying a firm foundation for the countrys stability.\n\nHe urged Zimbabweans to carry forward the legacy of peace and to reject divisive tendencies.\n\nAs we remember Cde John Landa Nkomo, we should forever cherish the peace and tranquillity that has become the cornerstone of our developmental trajectory, he said.\n\nLet us remain united to safeguard the stable democracy crafted by the likes of Dr Nkomo and his revolutionary peers.\n\nDr Nkomos influence extended beyond Zimbabwes borders, with the President recalling his tenure as president of the International Labour Conference in 1993 and chair of the governing body of the International Labour Organisation in 1994.\n\nPresident Mnangagwa reiterated Governments commitment to inclusive development, a principle closely aligned with Dr Nkomos vision for a united and progressive Zimbabwe.\n\nOn its part, the Second Republic is walking the talk by leaving no one and no place behind in delivering on national policies, programmes, and projects, he said.\n\nAs the nation honours Dr Nkomos legacy, his famous words remain a call to action for Zimbabweans to foster peace and unity for generations to come.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/President-Mnangagwa-4.jpg",
            "description": "Ivan Zhakata Herald Correspondent President Emmerson Mnangagwa has called on Zimbabweans to uphold the enduring values of unity and peace championed by the late Vice President Dr John Landa Nkomo. In a statement commemorating the 12th anniversary of the late Vice President’s death, President Mnangagwa said Dr Nkomo was a revolutionary leader, a devoted nation-builder […]",
            "time": "21:06",
            "date": "17 Jan 2025"
        },
        {
            "title": "Court withdraws charges against Dorowa Minerals boss in US$77 000 fraud case",
            "url": "https://www.herald.co.zw/court-withdraws-charges-against-dorowa-minerals-boss-in-us77-000-fraud-case/",
            "content": "Yeukai Karengezeka\n\nCourt Correspondent\n\nThe Harare Magistrates Court has dropped charges against Dorowa Minerals managing director, James Chigwende, who was accused of defrauding a local company of US$77 000.\n\nChigwende had been jointly charged with his parent company, Chemplex Corporation Limited, for allegedly forging a contract related to the provision of services.\n\nHe was facing forgery charges and appeared before Magistrate Mr Isheunesu Matova.\n\nHis defense lawyer, Mr Moffat Makuvatsine, made an application to have the charges against Chigwende withdrawn as he was not supposed to have been charged in his personal capacity.\n\nThe defense argued that any legal liability should rest with the company, Chemplex Corporation Limited, rather than Chigwende.\n\nThe prosecution conceded to the application, and the charges against Chigwende were withdrawn before he entered a plea.\n\nThe State has now shifted its focus to Chemplex Corporation Limited, which is being represented by its legal manager, Mr Kudakwashe Jenami.\n\nProsecutor Mr Rufaro Chonzi informed the court that the State had obtained the relevant docket and was finalising minor amendments.\n\nThe company has been remanded to February 3, pending the provision of a trial date.\n\nThe case stems from a contractual dispute between Chemplexs subsidiary, Dorowa Minerals, and Coursim Investments, a company owned by Courage Katiyo, the complainant.\n\nOn February 20, Katiyo signed a 90-day fix-and-supply contract with Dorowa Minerals. The contract, facilitated through Chemplex Corporation, involved the erection of a greenhouse shade at Dorowa Minerals Murambinda site.\n\nA payment of US$77 264.19 was supposed to be paid to Coursim Investments. The contract was signed by Katiyo and the acting general manager of Dorowa Minerals at Chemplexs headquarters in Harare.\n\nHowever, witnesses for Dorowa Minerals, stationed at the mine, were unavailable at the time.\n\nThe witnesses, Viznet Ruzvezve and Evans Bonde, signed the contract on February 22 and returned the signed document via email.\n\nKatiyo later received a scanned copy of the signed contract and acknowledged its receipt.\n\nThe business relationship allegedly went sour when contractual breaches emerged, prompting Katiyo to terminate the agreement and send a termination notice to Chemplex via email.\n\nAfter termination, Katiyo demanded payment for the services rendered. Chigwende allegedly disputed the payment claim and presented a contract document that had allegedly been unlawfully altered.\n\nThe State alleged that Chigwende had forged the document by replacing the witnesses signatures and falsely dating them back to February 20.\n\nThis forgery was reportedly used by Chigwende to manipulate the terms of the contract and justify non-payment of the claimed amount.\n\nKatiyo discovered the discrepancies in the contract and accused Chigwende of using the forged document to withhold payment.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/courthammer-680x380.jpg",
            "description": "Yeukai Karengezeka Court Correspondent The Harare Magistrates Court has dropped charges against Dorowa Minerals managing director, James Chigwende, who was accused of defrauding a local company of US$77 000. Chigwende had been jointly charged with his parent company, Chemplex Corporation Limited, for allegedly forging a contract related to the provision of services. He was facing […]",
            "time": "21:06",
            "date": "17 Jan 2025"
        },
        {
            "title": "CVR warns public about fake driver’s licence agents",
            "url": "https://www.herald.co.zw/cvr-warns-public-about-fake-drivers-licence-agents/",
            "content": "Freeman Razemba\n\nSenior Reporter\n\nGovernment has warned the public to be wary of fraudsters who are posing as licence agents distributors.\n\nThe scammers send fake text messages and demand payment from prospective individuals in exchange for fake drivers licences.\n\nThey direct people to the Vehicle Inspectorate Department (VID) offices in Eastlea, Harare, where they ask for a certain fee before they disappear.\n\nThe Civil Vehicle Registry (CVR) department confirmed the issue in a statement.\n\nIt has come to the attention of the Central Vehicle Registry (CVR) that a fraudster with the following Econet numbers  0779 171 199 and 0783 123 505  is sending text messages to prospective drivers advising them that their drivers licences are ready for collection.\n\nHe interchanges the following names  Mr Moyo, Mr Sibanda, Mr Nkomo or Mr Dube from VID Eastlea, said CVR in a statement.\n\nOnce the victims arrive in Harare, he directs them to deposit US$50 into either OneMoney, whose details are 0715 107 676 or 0715 107 468 and Ecocash 0786 721 613.\n\nOnce the money is deposited, he then blocks the victim. The public has been urged to be vigilant and report such incidents to the nearest police station.\n\nSecondly, do not deposit any money into an account provided by a stranger. Report to the nearest police station if you are texted by any of the above listed numbers to help the Zimbabwe Republic Police to apprehend the fraudsters, reads the statement.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/08/depositphotos_85772112-stock-photo-stamp-fake.jpeg",
            "description": "Freeman Razemba Senior Reporter Government has warned the public to be wary of fraudsters who are posing as licence agents’ distributors. The scammers send fake text messages and demand payment from prospective individuals in exchange for fake driver’s licences. They direct people to the Vehicle Inspectorate Department (VID) offices in Eastlea, Harare, where they ask […]",
            "time": "21:06",
            "date": "17 Jan 2025"
        }
    ]
}