{
    "news": [
        {
            "title": "Professor Murwira meets Japanese, Australian Ambassadors",
            "url": "https://www.herald.co.zw/professor-murwira-meets-japanese-australian-ambassadors/",
            "content": "Farirai Machivenyika\n\nSenior Reporter\n\nJapan Ambassador to Zimbabwe, Shinichi Yamanaka has met Foreign Affairs and International Trade Minister, Professor Amon Murwira, to discuss ways of strengthening economic ties between the two countries ahead of the Osaka Kansai Expo 2025 and the 9th edition of the Tokyo International Conference on Africas Development.\n\nThe Osaka Expo will run from April 13 to October 13, while the 9th Tokyo International Conference on African Development will be held in August.\n\nWe had quite a fruitful and forward-looking discussion. This year we have two important events for Zimbabwe and Japan, Ambassador Shinichi said.\n\nWe discussed ways of expanding and strengthening the business relationship between our two countries.\n\nThe 9th edition of TICAD will bring together African leaders and their Japanese counterparts to discuss how Japan can aid Africas development.\n\nAmbassador Shinichi said the launch of ZimSat-1 was one of the success stories of Zimbabwe and Japans cooperation.\n\nAustralias ambassador to Zimbabwe Minoli Perera meets Foreign Affairs and International Trade Minister, Professor Amon Murwira.\n\nMeanwhile, the Australian Ambassador to Zimbabwe, Minoli Perera also paid a courtesy call on Professor Murwira and congratulated Zimbabwe on the election of former Sports Minister Kirsty Coventry as president of the International Olympic Committee.\n\nIn todays meeting, we covered several things. I congratulated Zimbabwe on Kirsty Coventrys IOC presidency, she said.\n\nThey also discussed the Australia Awards scholarship programme.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/7db905c3-7bce-400a-a3f6-7430217b9f7e-680x380.jpg",
            "description": "Japan Ambassador to Zimbabwe, Shinichi Yamanaka has met Foreign Affairs and International Trade Minister, Professor Amon Murwira, to discuss ways of strengthening economic ties between the two countries ahead of the Osaka Kansai Expo 2025 and the 9th edition of the Tokyo International Conference on Africa's Development.",
            "time": "21:07",
            "date": "31 Mar 2025"
        },
        {
            "title": "Insiza North MP, music promoter Farai Taruvinga dies",
            "url": "https://www.herald.co.zw/insiza-north-mp-music-promoter-farai-taruvinga-dies/",
            "content": "Langalakhe Mabena\n\nZimpapers Arts and Entertainment Hub\n\nPolitician, businessman and music promoter Farai Taruvinga, who was popular for his upscale Scooter Joint leisure spot in Filabusi, has died.\n\nTaruvinga, who was also the Insiza North Member of Parliament, died today in Bulawayo at the age of 53.\n\nHe had been battling illness for some time.\n\nHis death was confirmed by Matabeleland South Zanu PF Provincial chairman Mangaliso Ndlovu.\n\nI can confirm that we have lost the Member of the National Assembly for Insiza North. He had been unwell for some time, said Ndlovu.\n\nThrough Scooter Joint, Taruvinga played a vital role in promoting both established and up-and-coming artistes.\n\nHis venue hosted top acts such as Big Zulu, Jah Prayzah, Jay Cee, Kay Kid Umfanomsuthu, Zhezhingtons, and Utsheketsha Ogezayo, among others.\n\nHis death is a significant loss to Zimbabwes arts industry, as he was a passionate advocate for local talent and a key figure in bringing entertainment to Filabusi.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/84a4e39c-50dc-4974-91df-e32b185f806d-680x380.jpg",
            "description": "Politician, businessman and music promoter Farai Taruvinga, who was popular for his upscale Scooter Joint leisure spot in Filabusi, has died.",
            "time": "21:07",
            "date": "31 Mar 2025"
        },
        {
            "title": "Zanu PF Harare Province recommends co-option of businessman Tagwireyi into Central Committee",
            "url": "https://www.herald.co.zw/zanu-pf-harare-province-recommends-co-option-of-businessman-tagwireyi-into-central-committee/",
            "content": "Joseph Madzimure\n\nZimpapers Politics Hub\n\nZanu PF Harare Province has resolved to recommend the co-option of businessman, Cde Kudakwashe Tagwirei, into the ruling partys Central Committee.\n\nSpeaking at the Zanu PF Harare Provincial Coordinating Committee (PCC) meeting held at the partys provincial headquarters this afternoon, the ruling partys provincial chairperson Cde Godwills Masimirembwa said: Members of the Central Committee in Harare have proposed that Cde Tagwirei be recommended for co-option into the Central Committee of Zanu PF.\n\nCde Tagwirei is a party member in the Harare Metropolitan Province.\n\nHe is a business strategist; a visionary business leader.\n\nCde Masimirembwa said Cde Tagwirei is an asset to Harare Province.\n\nSo the proposal was put forward and the PCC unanimously agreed to recommend him for co-option into the Central Committee of Zanu PF.\n\nWe are going to submit this recommendation to the partys Secretary-General, Dr Obert Mpofu, said Cde Masimirembwa.\n\nZanu PF Harare Youth chairperson Cde Emmanuel Mahachi commended the decision, saying Cde Tagwirei has been instrumental in mobilising resources for the party.\n\nWe are happy that Cde Tagwirei will give advice and direction to help in the growth of the party. He is always available in times of need for the party. We really support the co-option of Cde Tagwirei.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/ef2f2f-680x380.jpg",
            "description": "Joseph Madzimure Zimpapers Politics Hub  Zanu PF Harare Province has resolved to recommend the co-option of businessman, Cde Kudakwashe Tagwirei, into the ruling party’s Central Committee. Speaking at the Zanu PF Harare Provincial Coordinating Committee (PCC) meeting held at the party’s provincial headquarters this afternoon, the ruling party’s provincial chairperson Cde Godwills Masimirembwa said: “Members […]",
            "time": "21:07",
            "date": "31 Mar 2025"
        },
        {
            "title": "South Africa-bound Malawi bus involved in an accident near Karoi…three dead, several injured",
            "url": "https://www.herald.co.zw/south-africa-bound-malawi-bus-involved-in-an-accident-near-karoi-three-feared-dead-several-injured/",
            "content": "Conrad MupesaMashonaland West BureauAt least three Malawian nationals died while 15 others were injured yesterday evening when the bus they were traveling in rammed into a haulage truck and rolled into a drain at Kingsview, about 30 kilometres east of Karoi.The Achisi Bus was travelling from Malawi to South Africa using the Zambia via Zimbabwe route.National police spokesperson Commissioner Paul Nyathi confirmed the accident.\n\nThe ZRP confirms a fatal road traffic accident that occurred at the 165-kilometre peg along the Harare-Chirundu Road on March 30 at around 4.50 pm, he said.\n\nThree foreign nationals were killed while 15 others were injured when a bus that was coming from Malawi with 119 passengers on board veered off the road before overturning and landing on its left side.\n\nThe driver had allegedly tried to avoid a collision with a recovery truck which was towing another truck that had been involved in a road accident, he said.The deceased were taken to Karoi General Hospital mortuary, while the injured were taken to the same institution for treatment.\n\nThose in critical condition were transported to Chinhoyi Provincial and Sally Mugabe Hospitals.The other passengers who did not sustain any injuries are currently being sheltered at Chikangwe Hall in the farming town.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/04/accident-7.jpg",
            "description": "Mashonaland West Bureau\nAt least three Malawian nationals are feared dead while 15 others were injured yesterday evening when the bus they were traveling in rammed into a haulage truck and rolled into a drain at Kingsview, about 30 kilometres east of Karoi.",
            "time": "21:07",
            "date": "31 Mar 2025"
        },
        {
            "title": "National Arts Council of Zimbabwe directs Zimura to suspend US$150 tariff",
            "url": "https://www.herald.co.zw/national-arts-council-of-zimbabwe-directs-zimura-to-suspend-us150-tariff/",
            "content": "Mbulelo Mpofu\n\nZimpapers Arts and Entertainment Hub\n\nThe National Arts Council of Zimbabwe (NACZ) has stepped in to halt the Zimbabwe Music Rights Association (Zimura)s controversial US$150 licensing fee for live bands, ordering its immediate suspension.\n\nIn February this year, Zimura directed a local restaurant to ensure that all performing bands obtain a valid license, costing US$150 per event, which is a sharp increase from the previous US$50 annual fee.\n\nThis directive divided opinions within the music sector, prompting NACZ to facilitate a dialogue in Harare two weeks ago.\n\nThe meeting brought together key stakeholders, including representatives from NACZ, Zimura, academics, associations, unions, composers, cover band leaders, and intellectual property beneficiaries.\n\nDiscussions focused on establishing a fair and sustainable tariff structure for cover bands operating in Zimbabwe.\n\nFollowing the meeting, NACZs communication and marketing manager, Aggabu Nyabinde, expressed satisfaction with the progress and stated that Zimura had shown a willingness to reconsider the fee structure.\n\nHowever, in an unexpected turn of events, Zimura issued a public notice on Friday, reaffirming its stance.\n\nThe statement reminded cover bands and event organisers that performing copyrighted music without a valid license is a violation of the Copyright and Neighbouring Rights Act (Chapter 26:05).\n\nEffective immediately, all performers and organisers must obtain the necessary licenses before staging any event featuring protected musical works, Zimura stated.\n\nThey also warned that they will be conducting nationwide monitoring in collaboration with law enforcement agencies, with legal action set to be taken against those found violating copyright regulations.\n\nThrough a statement issued yesterday, NACZ executive director Napoleon Nyanhi instructed Zimura to regularise its registration with NACZ as an arts association.\n\nFurthermore, NACZ said all directives for payment of the $150 tariff are suspended immediately pending the conclusion of the registration, dialogue, and negotiation processes.\n\nNACZ said Zimuras move was drastic, noting that the sharp fee increase had caused widespread panic among venue owners and musicians, leading to lost bookings and cancellations of performances.\n\nWhile Zimura argues that cover bands profit from copyrighted works without compensating the original rights holders  including widows and orphaned children of legendary musicians  NACZ maintains that a balance must be struck between copyright enforcement and grassroots arts development.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2020/01/Aggabu-Nyabinde.jpg",
            "description": "The National Arts Council of Zimbabwe (NACZ) has stepped in to halt the Zimbabwe Music Rights Association (Zimura)’s controversial US$150 licensing fee for live bands, ordering its immediate suspension.",
            "time": "21:07",
            "date": "31 Mar 2025"
        },
        {
            "title": "Zimbabweans reject demonstrations call",
            "url": "https://www.herald.co.zw/zimbabweans-reject-demonstrations-call/",
            "content": "Herald ReporterAfter social media induced anxieties over possible demonstrations, businesses are now opening up in the capital and other cities, with both human and vehicular traffic peaking.Across the country, Zimbabweans have roundly ignored calls for picketing that were being fanned by social media activists, with police spokesperson Commissioner Paul Nyathi saying it is peaceful across the country.\n\nThe ZRP assures the public that the situation in the country is peaceful. As police officers conduct patrols, the public should feel free to embark on their day-to-day activities.\n\nHe said people are conducting their businesses without any hurdles, adding that the police will remain firmly on the ground to ensure peace prevails.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/12/zimbabwe-flag.jpg",
            "description": "After social media induced anxieties over possible demonstrations, businesses are now opening up in the capital and other cities, with both human and vehicular traffic peaking.",
            "time": "21:07",
            "date": "31 Mar 2025"
        },
        {
            "title": "Police warn those circulating old videos",
            "url": "https://www.herald.co.zw/police-warn-those-circulating-old-videos/",
            "content": "Crime ReporterThe police have warned some online media outlets against circulating old videos alleging that they are capturing ongoing demonstrations in some cities, especially Bulawayo.The police said these old videos are meant to cause alarm and despondency.In a statement, national police spokesperson, Commissioner Paul Nyathi said, The ZRP warns the Zim/Global Eye WhatsApp Channel against circulating old videos of alleged demonstrations in Bulawayo. Bulawayo is calm and peaceful today.\n\nThe public should ignore the video posted by the WhatsApp Channel as it is false. The facts on the ground in Bulawayo speak for themselves.\n\nMeanwhile, police have dismissed a fake press statement issued by criminals claiming that the police had authorised todays said demonstrations.\n\nThe fake statement should be dismissed with the contempt it deserves. For the record, no press statement was issued by the police to that effect, Commissioner Nyathi said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/07/1705-1-1-PAUL-THEMBA-NYATHI-1-3.jpg",
            "description": "The police have warned some online media outlets against circulating old videos alleging that they are capturing ongoing demonstrations in some cities, especially Bulawayo.",
            "time": "21:07",
            "date": "31 Mar 2025"
        },
        {
            "title": "Zimbabwe remains peaceful",
            "url": "https://www.herald.co.zw/zimbabwe-remains-peaceful/",
            "content": "Online Reporter\n\nZimbabwe remains calm despite calls for protests today, with the police assuring citizens that there is no unrest in the country.\n\nIn a statement on X, the Zimbabwe Republic Police (ZRP) said officers are conducting patrols to maintain order, urging the public to go about their daily activities without fear.\n\nThe ZRP assures the public that the situation in the country is peaceful. As police officers conduct patrols, the public should feel free to embark on their day-to-day activities, the statement reads.\n\nThere has beem no reports of disturbances across the country.Authorities have warned against any unauthorised demonstrations, citing the need to maintain public order.\n\nMore updates to follow.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/IMG-20250331-WA0038-680x380.jpg",
            "description": "Zimbabwe remains calm despite calls for protests today, with the police assuring citizens that there is no unrest in the country.",
            "time": "21:07",
            "date": "31 Mar 2025"
        },
        {
            "title": "Security forces on high alert . . . Concern over foreign hand in illegal protests",
            "url": "https://www.herald.co.zw/security-forces-on-high-alert-concern-over-foreign-hand-in-illegal-protests/",
            "content": "Herald Reporters\n\nSECURITY forces stand ready to handle any disturbances and the Government remains resolutely committed to national stability, the Minister of State for National Security, Lovemore Matuke, has said.\n\nAddressing citizens in Gutu South yesterday, Minister Matuke warned against any actions threatening public order and potential disruptions by agitators, emphasising that protecting citizens safety remained the Governments top priority, with all necessary measures implemented to ensure communities remained secure and daily activities continue uninterrupted.\n\nAt the same time, the Zimbabwe Republic Police confirmed comprehensive nationwide deployments to maintain public safety.\n\nI want to assure every citizen that your security is our top priority. Comprehensive measures are in place to safeguard our society. Our security forces are well-prepared to handle any potential disruptions while ensuring that people going about their daily business are respected and protected, said Minister Matuke.\n\nMinister Matuke\n\nWhile acknowledging citizens right to lawful protest, the minister firmly opposed any actions endangering public safety.\n\nIn the spirit of promoting calm and resilience, I encourage all citizens to continue with their daily business as usual. There is no need for undue anxiety or panic, he said.\n\nWe must collectively focus on our national priorities that enhance welfare and progress, rather than be distracted by rogue elements.\n\nThe minister warned that security forces would respond decisively to any threats posed by malcontents.\n\nOur security apparatus is equipped to handle the situation, and anyone attempting to incite violence or chaos will be dealt with swiftly and decisively. We call upon every citizen to show restraint.\n\nMinister Matuke stressed national unity as essential for Zimbabwes stability:\n\nLet us work together to uphold the values of peace, stability, and democratic engagement. We stand ready to protect our citizens and our sovereignty, ensuring that our nation remains a place of safety and prosperity for all.\n\nMinister Matuke revealed concerns about foreign influence behind potential unrest.\n\nWe are concerned about a concerted effort to undermine our stability and foster discord within our society. I urge all citizens to remain vigilant against such foreign-funded threats.\n\nOn Saturday, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere said Zimbabweans should go about their business as usual as law enforcement agents will be vigilant and on high alert to guarantee security and ensure peace across the country.\n\nDr Muswere\n\nAddressing the media, Dr Muswere urged Zimbabweans to ignore calls for protests that are being made by cyber terrorists and fanned through social media, saying the countrys security sector is well-equipped to deal with any mischief.\n\nAs official Government spokesman, I would like to assure the nation that peace and stability will continue to prevail in our country in terms of the Constitution, including on the 31st March 2025, and all Zimbabweans should disregard misinformation and disinformation being peddled on social media platforms by cyber terrorists, said Dr Muswere.\n\nWe also like to assure the people that law-enforcement agencies have more than enough capacity to deal with any illegal activities that might take place in our country. As a Government, we have taken note of artificial intelligence-generated videos and messages from comedian-cum-terrorists who seek to misinform and dis-inform the public. Those who want to create despondency, alarm and anarchy will be dealt with in terms of the law. No one has the right to overthrow a constitutionally elected Government. So labour, business, learners, students and the generality of all Zimbabweans should continue to do their business as usual as the security sector has more than enough capacity to deal with any illegal activities in our country.\n\nThe call for protests, Dr Musweresaid, was misplaced as it sought to create a false narrative of a non-existent political crisis.\n\nWe urge Zimbabweans not to participate in these illegal activities which are aimed at creating a false narrative of a political crisis in the country. These actions are criminal and undermine the constitutional rights of freedom of assembly, he said.\n\nLast Thursday, the Minister of Home Affairs and Cultural Heritage, Kazembe Kazembe, said security services were on high alert to ensure the safety and security of the public and everyone, including visitors to the country, should feel secure and continue engaging in their socio-economic activities.\n\nYesterday, police spokesperson Commissioner Paul Nyathi also assured the nation that it will be business as usual across the country today.\n\nThe police have made adequate deployments throughout the country. Those using public transport or private vehicles should not fear. Businesses and schools should operate normally.\n\nComm yathi issued a stern warning against social media misuse.\n\nWe are aware of individuals spreading threats online, discouraging work attendance or public transport use. Once identified, they will face the full force of the law.\n\nNationwide, normalcy prevailed yesterday with businesses operating, churches holding services, and social activities continuing undisturbed.\n\nHarares commercial centres remained busy while transport services operated smoothly.\n\nPassengers Association Coordinator Tafadzwa Goliati said: Harare is operating normally, with no major disruptions. Commuters should proceed with their daily routines.\n\nReligious services across the capital proceeded without concern, with congregants focused on worship rather than protest fears.\n\nDuring sermons yesterday church leaders delivered sermons that focused on the importance of respecting Government authority as a means to promote peace and national development.\n\nTheir messages drew heavily from Romans chapter 13 in the New Testament, which addresses the relationship between Christians and governing authorities.\n\nThe Apostle Paul, who authored Romans, underscores the significance of submission to civil authorities, stating that they are established by God.\n\nThe leaders highlighted that resisting such authority equates to resisting Gods ordinance.\n\nOne church leader remarked, We shared Apostle Pauls message in the Book of Romans 13, which highlights that rulers are meant to be a source of good, rewarding those who do right and punishing wrongdoers. Paul describes the government as a servant of God for maintaining order.\n\nThe sermons encouraged congregants to pray for peace and unity, emphasizing the need for personal and national development. The leaders acknowledged the presence of individuals with negative attitudes, likening them to Tobiah from the Book of Nehemiah, who criticized the rebuilding efforts in Jerusalem.\n\nAmong the people, we have those with evil thoughts who do not emulate the good work being done by President Mnangagwa, one church leader noted.\n\nThe church leaders reiterated that Christians should not only obey civil laws but also fulfil their moral obligations, such as paying taxes and showing respect to those in authority.\n\nThey also referenced the concluding verses of Romans 13, which call for love among individuals, stating that love fulfils the law. This reinforces the idea that genuine Christian living is guided by love for others.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/High-alert-680x380.jpg",
            "description": "Herald Reporters SECURITY forces stand ready to handle any disturbances and the Government remains resolutely committed to national stability, the Minister of State for National Security, Lovemore Matuke, has said. Addressing citizens in Gutu South yesterday, Minister Matuke warned against any actions threatening public order and potential disruptions by agitators, emphasising that protecting citizens’ safety […]",
            "time": "21:07",
            "date": "31 Mar 2025"
        },
        {
            "title": "Parly calls for urgent fix to Zimra’s e-service platform",
            "url": "https://www.herald.co.zw/parly-calls-for-urgent-fix-to-zimras-e-service-platform/",
            "content": "Farirai Machivenyika-Senior Reporter\n\nTHE e-service platform being used by the Zimbabwe Revenue Authority (Zimra) must be expeditiously improved to enable taxpayers to submit returns timeously and ensure there are no losses in the revenue collection process, Parliaments Public Accounts Committee has said.\n\nIn a report tabled in Parliament last week, the Public Accounts Committee (PAC) called upon Zimra to ensure that the Tax Revenue Management System (TaRMS) is fully functional by year-end and also come up with comprehensive contingency plans to address any potential systems failure that may affect revenue collection.\n\nThe PAC report was presented to Parliament last week following the Auditor-Generals 2021 and 2022 reports which noted unreliable performance of the tax collectors e-service platform since 2016.\n\nThe audit observed that the Authoritys e-service platform had not been performing as expected, since 2016. It experienced congestion during peak periods of returns submission and in 2021 the system was not able to process all the 364 011 returns and its downtime was 0,45 percent and 0,95 percent, which was far above the tolerable downtime rate of 0,02 percent.\n\nThe committee also said Zimras Commissioner-General, Ms Regina Chinamasa, had confirmed that in 2021, the e-service system was non-functional, prompting the Authority to put in place mechanisms to ensure that taxpayers were able to submit their returns to facilitate revenue collection.\n\nInitially, the Authority had used the e-mail facility where people submitted their returns through their e-mails.\n\nLater in 2022, they developed an in-house solution (e-taxes) to mitigate the challenge the taxpayers were facing. The long-term solution was the implementation of the TaRMS which was deployed in 2023 with a four-life deployment period ending December 2024, further reads the report.\n\nThe PAC added that the e-service platforms poor performance and frequent downtime had hindered taxpayers ability to submit returns, potentially affecting revenue collection.\n\nIt said Zimras reliance on e-mail submissions as a temporary solution was not a secure or efficient method for handling sensitive tax information.\n\nThe development of an in-house solution (e-taxes) and the implementation of the TaRMS were positive steps, but the delay in deploying TaRMS until late 2023 was a matter of concern.\n\nZimra must ensure the TaRMS is fully functional and user-friendly by the end of the deployment period, that is December 2025, to prevent further disruptions.\n\nZimra must develop a comprehensive contingency plan to address potential system failures and minimise downtime by 31 December 2025, PAC said in thereport.\n\nIt also recommended that Zimra conduct a thorough review of the e-mail submission process to ensure the security and integrity of taxpayer data, by December 31.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Ms-Regina-Chinamasa-680x380.jpg",
            "description": "Farirai Machivenyika-Senior Reporter THE e-service platform being used by the Zimbabwe Revenue Authority (Zimra) must be expeditiously improved to enable taxpayers to submit returns timeously and ensure there are no losses in the revenue collection process, Parliament’s Public Accounts Committee has said. In a report tabled in Parliament last week, the Public Accounts Committee (PAC) […]",
            "time": "21:07",
            "date": "31 Mar 2025"
        }
    ]
}