{
    "news": [
        {
            "title": "President delivers on 2024 promises",
            "url": "https://www.herald.co.zw/president-delivers-on-2024-promises/",
            "content": "Wallace Ruzvidzo, Herald Reporter\n\nThroughout 2024, President Mnangagwa implemented people-oriented programmes and policies aimed at reducing inflation, improving national infrastructure, and ensuring food security following the El Nio-induced drought last farming season.\n\nAt the years outset, he stated, 2024 is promising to be a year of further growth and development, and the Second Republic has indeed made remarkable strides.\n\nIn his remarks at the last Cabinet meeting of the year on Tuesday, the President noted that the anticipated successes had materialised.\n\nHe emphasised, As Government, we have made notable headway in our people-centred national development agenda.\n\nThroughout the year, impactful policies, programmes, and projects were crafted and implemented to meet the aspirations of citizens.\n\nA significant milestone was the introduction of the Zimbabwe Gold (ZiG) currency in April, marking a pivotal shift towards a mono-currency system as the country gradually moves away from reliance on the US dollar.\n\nThe ZiG has shown promise in stabilising the economy, prices, and restoring confidence in the local currency.\n\nEfforts to undermine the ZiG by economic saboteurs were effectively countered by the Reserve Bank of Zimbabwe (RBZ), allowing the local currency to play its crucial role in stabilising the exchange rate.\n\nAnother highlight for the Second Republic was President Mnangagwas smooth takeover of the SADC Chairmanship at the 44th SADC Summit of Heads of State.\n\nZimbabwe achieved a record attendance, with only three Heads of State absent, showcasing confidence in Harares leadership within the regional bloc.\n\nIn addressing the El Nio-induced drought, the Government ensured that vulnerable households received necessary support.\n\nPresident Mnangagwa assured the nation, No one will die of hunger, and indeed, no Zimbabwean faced starvation.\n\nBoth rural and urban households received timely food aid, with rural communities receiving mealie-meal and urban households benefiting from cash transfers.\n\nGoing forward, President Mnangagwa said adequate grain continued to be distributed to beneficiaries under the food deficit mitigation programme following the declaration of a State of Disaster for the 2023/2024 Summer Season after the El Nino-induced drought.\n\nThe timely delivery of food aid as well as agriculture inputs to our people at the grassroots level must be prioritised while complaints that transport costs are sometimes passed on to our people, must be honestly addressed. I, therefore, challenge the relevant Ministries, Department and Agencies to apply themselves and devise strategies that will increase transport and logistical efficiency in getting aid and support to our people, he said.\n\nInfrastructure development continued to advance, with various roads constructed, rehabilitated, and opened to traffic.\n\nNotable projects included the resurfacing of the Shurugwi-Mhandamabwe Highway and the rehabilitation of the Masvingo-Glen Norah Loop Road. Upcoming rehabilitation projects include major highways such as Beitbridge-Bulawayo-Victoria Falls, Bulawayo-Nkayi and Harare-Chirundu.\n\nOn dam construction, progress has been made on several projects, including Semwa Dam and Gwayi-Shangani Dam, which are expected to alleviate water shortages for Harare and Bulawayo.\n\nThe Government also commissioned new facilities in health, education, and business sectors, including an Optometry and Auditory School at Bindura University of Science Education, as well as an upgraded VVIP Pavilion at Robert Gabriel Mugabe International Airport.\n\nIn health, Zimbabwe successfully contained the Mpox virus and managed to keep cholera outbreaks under control.\n\nPresident Mnangagwa commended stakeholders in the sector for implementing multi-pronged intervention measures which saw the country combat the cholera outbreak during the first half of the year.\n\nHe said mechanisms were in place to deploy the recently approved Multi-Hazard Contingency Plan to curtail the effects of floods and other national disaster emergencies.\n\nI call upon you to provide leadership and assist your communities to mitigate damage and harm to property and life in the wake of the ensuing rainfall season. On the economic front, the revision of economic growth projections, on the back of the El Nino-induced droughts negative impact on agricultural output, was inevitable. However, we remain resolute and optimistic that the fiscal and monetary reforms introduced during the year will increasingly underpin currency stability and usher economic rebound, he said.\n\nTurning to the energy sector, President Mnangagwa said while there was shortage of power owing to low generation at Kariba Hydropower Station, the improved use and exploitation of renewable energy sources in the country, particularly solar energy by companies and households, continued to reduce national grid power demand.\n\nThe initiatives by ZESA through new models of Independent Power Producers are welcome moves to crowd-in the private sector in power generation, specifically for their respective energy needs. More campaigns should be mounted to encourage our people, in both rural and urban areas to adopt renewable energy for domestic use.\n\nThe Second Republics re-engagement efforts yielded positive results, with President Mnangagwa attending the Forum on China-Africa Cooperation (FOCAC) and positioning Zimbabwe to benefit from Chinas US$50 billion development pledge for Africa.\n\nOn the investment front, Zimbabwe attracted US$1.8 billion in investments during the second quarter and US$1.2 billion in the third quarter.\n\nNotably, the Zimbabwe Investment and Development Agency (ZIDA) secured a US$6.94 billion mining investment deal from Ajako United (Pvt) Ltd, reflecting growing investor confidence in Zimbabwe as a secure investment destination.\n\nThese achievements underscore the Second Republics commitment to national development and the enhancement of citizens lives throughout 2024.\n\nOn housing, President Mnangagwa said the Government will continue to channel resources towards housing delivery, as well as the upgrading and rehabilitation of both residential and institutional accommodation nationwide.\n\nThe strides made by local authorities during the course of the year are commendable. These include the conclusion of Master Plans by most local authorities. There are also glimpses of mindset change within that sector. Regrettably, cases of corruption emanating from the sector remain worrisome. The bold decision by Harare City Council to transfer waste disposal and management to private entities should be supported and replicated in other local authorities. Quality service delivery to our citizens remains the core objective, said President Mnangagwa.\n\nThe decentralisation and devolution agenda, said President Mnangagwa, has led to an improved standard of life and living environments for people with enhanced basic social services infrastructure.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/HE1-4.jpg",
            "description": "Wallace Ruzvidzo, Herald Reporter Throughout 2024, President Mnangagwa implemented people-oriented programmes and policies aimed at reducing inflation, improving national infrastructure, and ensuring food security following the El Niño-induced drought last farming season. At the year’s outset, he stated, “2024 is promising to be a year of further growth and development,” and the Second Republic has […]",
            "time": "06:40",
            "date": "19 Dec 2024"
        },
        {
            "title": "Council pumps raw sewage into Lake Chivero",
            "url": "https://www.herald.co.zw/council-pumps-raw-sewage-into-lake-chivero/",
            "content": "Blessings Chidakwa,Herald Reporter\n\nHarare City Council has been discharging raw sewage into the Mukuvisi River, which flows into Lake Chivero, the citys main water source, for the past two weeks, The Herald can reveal.\n\nThis has created serious health and environmental hazards, resulting in Zimparks banning all fishing activities at Lake Chivero, where thousands of fish have died, alongside animals including four rhinos and three zebras.\n\nThe pollution, primarily from raw sewage, has caused a surge in cyanobacteria, posing health risks to both humans and wildlife.\n\nThe Herald team traced the sewage discharge back to the Crowborough Sewerage Works, one of Harares five treatment plants, which has a capacity of 54 million litres per day.\n\nObservations revealed that council was directly pumping sewage into Mukuvisi River.\n\nAlong the sewer line, multiple burst pipes were found leaking sewage into the river and surrounding fields, where farmers depend on the flow.\n\nDespite having replacement pipes available, council is yet to install them.\n\nThe area is poorly secured, making it easy for our crew to access without encountering security personnel.\n\nHarare City council pump raw sewage water into Mukuvisi river in Crowborough. The which feeds into Lake Chivero were wild animal and fish are dying because of cyno -bacteria.-Picture: Joseph Manditswara\n\nResidents, speaking anonymously, expressed their frustration.\n\nThe calamity at Lake Chivero stems from here. Bursting pipes from Kuwadzana should supply Crowborough for treatment, but instead, the council has allowed sewage to flow directly into the Mukuvisi River, one resident said.\n\nAnother resident noted that while attempts were made to block the sewage flow, the situation remained critical.\n\nThe sewage is still pouring into the river. We need urgent intervention. This is the same water we drink.\n\nExperts have said the rise in cyanobacteria due to pollution  primarily from raw sewage  poses health risks to both humans and animals alike.\n\nThe situation at Lake Chivero is indeed concerning and raises several important ecological and environmental questions. Cyanobacteria, or blue-green algae, can produce toxins that are harmful to various wildlife, including large mammals like rhinos and other species. If Zimparks attributes the deaths to cyanobacterial poisoning, it is plausible that this could affect both aquatic and terrestrial animals,said an environmental expert.\n\nHe stressed that the toxins in Lake Chivero can enter the food chain; for example, animals might consume contaminated water or prey on fish that have been affected.\n\nWhile cyanobacteria poisoning is a significant concern, its important to consider other possible factors, like pollution, the mention of raw sewage entering the lake suggests that pollution could be contributing to the overall health of the ecosystem, impacting both water quality and the health of wildlife.\n\nHe added that diseases could affect wildlife populations, especially if they are already stressed by environmental factors, adding that changes in the ecosystem, whether from human activity or climate change, could weaken animal populations, making them more susceptible to illness.\n\nThe expert said eutrophication, a condition that is often caused by nutrient runoff (like sewage), can lead to oxygen depletion, resulting in fish deaths.\n\nEnvironment, Climate and Wildlife Minister Sithembiso Nyoni yesterday led a Government team to Lake Chivero and said measures are being put in place to protect the public.\n\nOur people are at risk not because of any external organisation, there are some people who are fishing in this lake, there are some people that are combining dead fish with live fish and then those fish are being sold to our people who may not die immediately but they may now start developing cancers. I came here because our animals, livestock are dying, there are people whose cattle, goats are dying, so that is an economy that is being shaken. We are responsible for the cleanliness, of the atmosphere and of the water, said Minister Nyoni.\n\nFollowing the deaths of fish Zimparks announced a fishing ban at Lake Chivero, stating, We have suspended all fishing activities with immediate effect. We are conducting investigations with other Government departments to assess the safety of the fish for human consumption.\n\nAt yesterdays full council meeting, Harare Mayor Jacob Mafume said the trouble ridden council has been failing to reach its sewage treatment capacity.\n\nWe need resources for water treatment and expertise to effectively address this issue, he said, adding that the technical team is collaborating with experts from National Parks to investigate pollution levels.\n\nMr Reuben Akili, director of the Combined Harare Residents Association (CHRA), condemned the pollution of Lake Chivero.\n\nThe pollution levels have reached alarming heights, threatening human health and wildlife, he said, warning that reported fatalities among animals and fish are just early indicators of a broader ecological crisis.\n\nEnvironmental advocates, including the Harare Wetlands Trust (HWT), issued a 48-hour ultimatum to the City of Harare and other relevant authorities to tackle the severe contamination of Lake Chivero. HWT emphasised the need to uphol constitutional rights of citizens to a safe and healthy environment, urging immediate cessation of sewage discharges.\n\nThe body also warned of potential legal action if the demands are not met.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/SEWAGE.jpg",
            "description": "Blessings Chidakwa, Herald Reporter Harare City Council has been discharging raw sewage into the Mukuvisi River, which flows into Lake Chivero, the city’s main water source, for the past two weeks, The Herald can reveal. This has created serious health and environmental hazards, resulting in Zimparks banning all fishing activities at Lake Chivero, where thousands of […]",
            "time": "06:40",
            "date": "19 Dec 2024"
        },
        {
            "title": "Police, agencies deploy for festive season",
            "url": "https://www.herald.co.zw/police-agencies-deploy-for-festive-season/",
            "content": "Freeman Razemba, Senior Reporter\n\nAs the festive season approaches, law enforcement agencies are gearing up for a significant deployment on the countrys major roads to ensure compliance with traffic regulations.\n\nSenior police officers, alongside the Ministry of Transport and Infrastructural Development, will take decisive action against motorists who flout traffic rules.\n\nAt yesterdays launch of the 2024 festive season road safety awareness campaign, it was announced that officers from the Vehicle Inspection Department, Road Motor Transportation, and the Traffic Safety Council of Zimbabwe, will be supported by the Zimbabwe Republic Police.\n\nThis initiative seeks to curb reckless driving and enhance road safety during a period known for increased travel.\n\nThe Police General Headquarters will also deploy senior officers to monitor ground operations across the country.\n\nThese officers will ensure that any issues arising from roadblock management are addressed promptly.\n\nTransport Minister Felix Mhona said they will deal decisively with any situations they believe have not been properly handled by the officers manning roadblocks.\n\nThis underscores the Governments commitment to ensuring road safety during the festive period.\n\nThe theme for this years campaign; Normal speed meets every need, emphasises the critical importance of adhering to safe driving speeds and fostering responsible driving attitudes.\n\nMinister Mhona said there was need for motorists and public transporters to drive to arrive alive during the festive season, which is synonymous with excessive excitement, as people celebrate the gift of life and reunions with relatives and friends.\n\nHe warned that heightened road traffic densities and competition for space on highways can expose travellers to significant risks of road accidents, particularly during the peak of the rainy season.\n\nReflecting on road traffic statistics from previous festive seasons, Minister Mhona noted a positive trend.\n\nIt gives hope to note that we achieved a reduction in the total number of road traffic accidents from 2 689 in the 2022 festive season to 2 228 in the 2023 festive season, he said.\n\nHowever, he warned that road crashes lead to injuries and fatalities, which burden families and the health sector, creating a strain on the economy.\n\nResearch indicates that Africa is the least motorised continent, possessing only two percent of the global vehicle population while contributing to 16 percent of global road traffic fatalities.\n\nTo combat this alarming trend, the Government has been collaborating with neighbouring countries to raise cross-border road safety awareness, including the recent Cross Alive Campaign launched with South Africa.\n\nMinister Mhona urged drivers to maintain vigilance and adhere to traffic regulations, listing key behaviours to avoid, namely speeding, overloading, neglecting road signs, multi-tasking (use of cellphones) while driving, and travelling with defective vehicles.\n\nThe police were under strict instruction to arrest and refer for prosecution motorists who violate laid down regulations, he said.\n\nHome Affairs and Cultural Heritage Minister Kazembe Kazembe said law enforcement is important to ensure all vehicles on the road are roadworthy.\n\nHe expressed concern regarding the high accident rates and the need for accountability among police officers manning roadblocks.\n\nI have discussed this issue with the Commissioner-General of Police and senior police officers and clearly expressed that from now onwards, such incidents must be thoroughly investigated, he said.\n\nTraffic Safety Council of Zimbabwes board chairperson, Mr Kura Sibanda, said the poor behaviour displayed on roads has had a direct and indirect impact on road safety.\n\nHe highlighted the opportunity to save lives by addressing key risk factors, such as speeding and inadequate vehicle maintenance.\n\nMaramba-Pfungwe legislator Cde Tichaona Karimazondo, who is a member of the Parliamentary Portfolio Committee on Transport and Infrastructural Development, urged drivers to exercise caution and obey traffic rules.\n\nTogether, we can implement better road infrastructure, promote stricter law enforcement, and ensure that road safety education becomes an integral part of our curricula, he said.\n\nAs the festive season approaches, it is crucial for all stakeholders including Government institutions, law enforcement agencies, non-governmental organisations and the private sector, to collaborate in promoting road safety.\n\nChairman of the Zimbabwe Public Transport Organisation Dr Sam Nhanhanga, called on everyone to join us in this campaign.\n\nGovernment and law enforcement agencies are taking significant measures to promote road safety and reduce traffic-related incidents.\n\nBy fostering a culture of compliance and responsible driving, the aim is to protect lives and minimise the burden of road accidents on families and the economy.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Mhona.jpg",
            "description": "Freeman Razemba, Senior Reporter As the festive season approaches, law enforcement agencies are gearing up for a significant deployment on the country’s major roads to ensure compliance with traffic regulations. Senior police officers, alongside the Ministry of Transport and Infrastructural Development, will take decisive action against motorists who flout traffic rules. At yesterday’s launch of […]",
            "time": "06:40",
            "date": "19 Dec 2024"
        },
        {
            "title": "Govt launches door-to-door crackdown on smugglers",
            "url": "https://www.herald.co.zw/govt-launches-door-to-door-crackdown-on-smugglers/",
            "content": "Remember Deketeke, Herald Reporter\n\nGovernment has initiated a door-to-door crackdown to confiscate smuggled goods that are flooding the country, especially during the festive season.\n\nThose found in possession of smuggled items will face imprisonment without the option for bail.\n\nThis operation comes in response to huge losses of up to US$1 billion due to smuggling activities along the borders that the country is incurring annually.\n\nThe crackdown coincides with the peak season for smuggling as many Zimbabweans return home for the Christmas and New Year holidays, often bringing goods from South Africa and other neighbouring countries.\n\nAddressing journalists yesterday, Engineer Tafadzwa Muguti, the Permanent Secretary for Presidential Affairs in the Office of the President, announced that a taskforce has been deployed to all major border posts and key roads to prevent the entry of smuggled goods.\n\nThis December, we will have inter-governmental agencies stationed at our major border posts to ensure zero tolerance for smugglers. The task force will conduct door-to-door inspections of all goods in wholesale and retail shops, he said.\n\nThe operation will also target wholesalers, supermarkets, and tech shops, with smuggled products including a variety of food items, clothing, drugs, beverages, fertilisers, cement, vehicles, electrical gadgets, and solar panels.\n\nEng Muguti said the Governments goal was to ensure that the local industry was protected against cheap, often counterfeit products that pose a health risk to consumers.\n\nI want to issue a stern warning to Diasporans returning for the holidays. We often see rising prices and increased black market trading as they come back. Many choose not to declare their groceries and attempt to smuggle in illicit alcohol and other items, be aware that there will be no fines for violations at roadblocks; rather, those caught will be arrested on the spot. You risk spending Christmas behind bars if you engage in these activities, he said.\n\nLast month Government formed a taskforce led by the Ministry of Industry and Commerce that will lead in the crackdown on smuggling.\n\nThe taskforce includes various Government agencies such as the Zimbabwe Revenue Authority (Zimra), the Zimbabwe Republic Police, the Reserve Bank of Zimbabwe (RBZ), and the Consumer Protection Commission.\n\nEng Muguti warned Government officials against engaging in corrupt practices, stating that surveillance systems have been implemented across roadblocks and within the transport sector.\n\nSince January, authorities have arrested 15,181 individuals for smuggling. The crackdown also targets businesses that use parallel market exchange rates and sell counterfeit, underweight, or unlabelled products.\n\nTo enforce compliance, 24-hour roadblocks have been established along highways leading into major cities, with multi-agency teams inspecting vehicles suspected to be carrying smuggled goods.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Tafadzwa-Muguti.jpg",
            "description": "Remember Deketeke, Herald Reporter Government has initiated a door-to-door crackdown to confiscate smuggled goods that are flooding the country, especially during the festive season. Those found in possession of smuggled items will face imprisonment without the option for bail. This operation comes in response to huge losses of up to US$1 billion due to smuggling […]",
            "time": "06:40",
            "date": "19 Dec 2024"
        },
        {
            "title": "Policy intervention on energy bears fruit: Mthuli",
            "url": "https://www.herald.co.zw/policy-intervention-on-energy-bears-fruit-mthuli/",
            "content": "Zvamaida Murwira, Senior Reporter\n\nCompetitive tariffs, guarantees on power purchases and availability of foreign currency as promised by the Government to independent power producers have started bearing fruit, with investors expressing interest in generating energy for the national grid, legislators have heard.\n\nLegislators speaking at the marathon debate on the 2025 national Budget that ended early yesterday, spoke strongly on the need to end energy challenges and wanted Finance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube to provide resources to the Ministry of Energy and Power Development towards that end.\n\nIn his response, Prof Ncube told the National Assembly that the Energy Ministrys mandate was largely a regulatory role and to provide an enabling environment for private sector power stations.\n\nThe Ministry has, working with Treasury, put in place policies to encourage independent power producers to invest in the power sector.\n\nMost of the independent power producers are investing in the solar sector and they requested three things to be able to invest in this sector.\n\nFirst, is an economic tariff and Government has increased the tariff, as you know to about $0,16c per kilowatt hour which is way above the level of profitability of $0,10c per kilowatt hour. There is easily an additional $0,06c that they could play with in building margin and profitability, said Prof Ncube.\n\nSecondly, they requested a Government guarantee on the power purchase agreement such that if ZESA or ZETDC to be specific is unable to pay for the power, Treasury or Government should step in to pay for that power from the IPP provider.\n\nFinally, they also requested that there be a foreign currency access arrangement so that they can access foreign currency in order to service their loans abroad if they have borrowed money from abroad to invest locally or to invest in the equity when they want to pay dividends. That is called the Government Implementation Agreement and that agreement is in place and it is functioning well. We continue to fine-tune it.\n\nSince the tariffs were adjusted there had been several enquiries from investors who had expressed interest in energy.\n\nIn terms of the quality of the transmission infrastructure, that again is under ZESA. If I can add something that maybe legislators would like to know, I have seen that since we increased the tariff for ZESA to 16 cents, we are seeing a lot of interest from private investors who want to partner with ZESA, including for transmission.\n\nThey have actually signed an MOU with a foreign investor to invest in the transmission infrastructure and the additional generation capacity infrastructure, said Prof Ncube.\n\nHe said there were some coal power stations which were coming up from private investments.\n\nMining companies as well are generating their own power through coal power stations as well as solar facilities, if you look at PPC which is an industrial company. Look at Zimplats and Manhize, the iron and steel company is also looking at producing its own power, he said.\n\nProf Ncube said one thing that had been weighing down Zesa is the rate at which some customers were defaulting in paying for electricity they were buying.\n\nWhile almost all residential and small businesses have been on prepaid meters for some time, large industrial and mining companies with their more complex tariffs that largely see them paying for power rather than energy have still been paying in arrears.\n\nThey also have a programme for improving the quality of the collection of user charges for electricity. In fact, I have been informed that in the next couple of months, their net metering programme will be fully in place and also the pre-payment programme for electricity will be fully in place because when you look at their accounts you find that there are a lot of defaulters in terms of payment for electricity.\n\nJust by dealing with the issue of defaulters, we will be able to raise enough revenue to make further investments in the sector, he said.\n\nDuring the debate on Budget votes for each Ministry, Prof Ncube made some adjustments to what he had initially appropriated for some Ministries following representations from legislators.\n\nFor example, he proposed an additional ZiG250 million to the Ministry of Primary and Secondary Education to help it to consolidate its rural projects such as feeding schemes among others.\n\nThere was also an additional ZiG120 million to the Ministry of Higher and Tertiary Education, Innovation, Science and Technology Development meant to improve the conditions of service for lecturers.\n\nHe also proposed an additional ZiG100 million for the Ministry of Justice, Legal and Parliamentary Affairs and ZiG50 million for the Ministry of Information, Publicity and Broadcasting Services.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/03/Minister-Mthuli-Ncube.jpg",
            "description": "Zvamaida Murwira, Senior Reporter Competitive tariffs, guarantees on power purchases and availability of foreign currency as promised by the Government to independent power producers have started bearing fruit, with investors expressing interest in generating energy for the national grid, legislators have heard. Legislators speaking at the marathon debate on the 2025 national Budget that ended […]",
            "time": "06:40",
            "date": "19 Dec 2024"
        },
        {
            "title": "Harare land scam unmasked",
            "url": "https://www.herald.co.zw/harare-land-scam-unmasked/",
            "content": "Blessings Chidakwa, Herald Reporter\n\nIn what could be the tip of an iceberg, Harare residents are losing properties and stands to an elaborate scheme involving corrupt council officials, with the latest case in Mabvuku where four residents lost their land.\n\nIn a well-coordinated scheme on stand 46 Marembo Street, Mabvuku, beneficiaries of four stands leased since 1992 have been evicted to pave way for the corrupt allocation of two residential stands.\n\nDespite the beneficiaries including Mr Mofolo Makasa and Mrs Maggie Mazonde having valid lease agreements and being paid up on council bills, they are being threatened to vacate their premises.\n\nWhen Mr Makasa tried to pay his current bill at Mabvuku offices, he was told the account was closed, but at the Augustinho Neto Avenue offices in the city centre, the transaction sailed through under receipt number 14641678. A visit to the site on Tuesday showed that some individuals occupying the land have unlawfully begun building structures or at least digging foundations, destroying the hedge and gate surrounding the property.\n\nOne of the houses under construction at foundation level had encroached on two stands destroying existing council boundary pegs.\n\nHarare City Council Region 5 manager Mrs Faith Raradza and Mabvuku district officer Addmore Guzha, who were handling the matter, confirmed the anomaly, although they said corrective measures were being taken.\n\nLocal Mabvuku Ward 21 councillor Alexio Nyakudya was not picking up his phone.\n\nIn a letter addressed to the office of Harare Mayor, Jacob Mafume on November 8 this year Mr Makasa said he was being treated unfairly as there was no eviction notice.\n\nHe also blamed council officials of dining with the devil as there is a land baron only identified as Jacob Jackson who is always milling around the area boasting strong council links.\n\nAs you may be aware, I have held the lease for this land since 1992, and I have consistently paid my rates and fees to the City of Harare.\n\nMy account is up to date (i.e. 910167100), and I have not received any formal notice or communication from the council regarding the sale or transfer of the land. In fact, I am still an active ratepayer, and there has been no official documentation presented to me notifying me of any sale or transfer of the property, he said.\n\nMr Makasa said he made numerous attempts to resolve this issue, both in person and through his legal representatives but to no avail.\n\nI have engaged with the local councillor, Mr A Nyakudya, but regrettably, no action has been taken, and the individuals illegally occupying my property continue with their construction activities undisturbed.\n\nI am deeply concerned, not only about the unlawful occupation of my land but also about the damage that is being caused to my property, which I have maintained and paid for over the years, he said.\n\nMr Makasa said despite his efforts, nothing substantial has been done to address the situation as the intruders are now causing a significant disturbance to his peaceful enjoyment of the land, and their activities are undermining his legal rights as a property holder.\n\nThis is a matter that requires urgent intervention from your office. I respectfully request that you take immediate action to assist in the removal of these illegal occupants and halt their construction activities.\n\nAs the rightful leaseholder and a long- standing ratepayer, I am entitled to the full protection of the law in the enjoyment of my property. The actions of these individuals are not only illegal but are causing me undue hardship and distress, he said. Another affected resident, Mrs Mazonde said she has suffered emotional stress and financial loss due to the goings-on.\n\nI am in pain. Just because I am financially hamstrung should l deserve this? We appeal to the relevant authorities to assist us.\n\nI bore all my children while staying here and from nowhere, l am being kicked out. We were paying our bills to the council religiously, but to our surprise, we are being treated like something else, she said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2020/09/Jacob-Mafume-1.jpg",
            "description": "Blessings Chidakwa, Herald Reporter In what could be the tip of an iceberg, Harare residents are losing properties and stands to an elaborate scheme involving corrupt council officials, with the latest case in Mabvuku where four residents lost their land. In a well-coordinated scheme on stand 46 Marembo Street, Mabvuku, beneficiaries of four stands leased […]",
            "time": "06:40",
            "date": "19 Dec 2024"
        },
        {
            "title": "EDITORIAL COMMENT: Presidential rural solar programme heralds major tech jump",
            "url": "https://www.herald.co.zw/editorial-comment-presidential-rural-solar-programme-heralds-major-tech-jump/",
            "content": "A highly imaginative and innovative programme to provide a small solar installation for more than one million rural homesteads over the next five years will dramatically upgrade the quality of life of the rural majority of Zimbabweans and compresses decades of development into half a decade.\n\nThe installations comprise solar panels, an inverter, battery and cabling and will be large enough to ensure the household can run lights, radios, a television, phone chargers, a laptop, small refrigerator, submersible pump and a wifi modem.\n\nThis is the essential electrical core of any modern household, but other sources of energy will be needed for the high demand heating, water heating and cooking, and operation of power tools.\n\nBut it does mean that 200 000 rural households a year move up the ladder to the same level of quality of life enjoyed by modest urban households, and in these days of heavy load-shedding perhaps a higher quality of life.\n\nThe rural electrification programme introduced in 1983, and expanded and formalised during the 1980s and 1990s along with a levy on all electricity sales to provide financing, was built around extending the national distribution grid of what is now the Zimbabwe Electricity Distribution and Transmission Company to every rural centre and from there to every rural homestead, a sort of giant extension of what had been done with the few thousand white commercial farmers since the Second World War.\n\nThis required, in the end, having the substations and overhead wires going everywhere, a very expensive process which is why the levy was introduced to pay for the hundreds of thousands of kilometres of wiring. There has been progress, and sometimes significant progress as business centres were wired in, but we were far from having basic power at every home.\n\nMore recently, the Rural Electrification Fund has been installing what it calls mini-grids for a single village, with solar panels, inverter, batteries and cabling to each home and small business to provide the basic requirements.\n\nThe Presidential Rural Solarisation Project approved by Cabinet this week may well be a dramatic extension of this programme, or might well see individual installations at each homestead.\n\nA lot will no doubt depend on location and how far apart houses are, as cabling costs can be large.\n\nWe stress that this project is a dramatic improvement in the quality of life, rather than the standard of living which tends to concentrate on purely economic measures.\n\nAs modern technologies, such as solar panels, smart phones, satellite internet connections and the like are exploited, Africans can jump many decades of development in one bound without having to repeat all the intermediate steps used in say much of Europe and North America.\n\nThe cost per person and per household of these dramatic jumps is quite small, even when measured against the modest gross national products per capita of most African countries, but the effect is dramatic. So a small upgrade in standard of living correctly applied produces a huge upgrade in quality of life.\n\nWe believe that there can be improvements, if only optional improvements, to the now approved scheme.\n\nThis would probably require loan funds that suitable households could access to extend the basic solar facility, add in a water tank and add a solar water heater.\n\nLoans would have to be repaid but many rural families are now moving into the world of regular incomes, at least annual incomes.\n\nFor example, tobacco farmers across that tobacco belt, and the growing number of small-scale farmers growing oil seeds and cotton, plus the upgrades of cattle farming and horticulture, mean that an imaginative loan scheme, with annual repayments when the cash crops are sold rather than the monthly repayments of those with salaries, would be viable.\n\nThere are limits to what the Government can finance, and making sure that everyone has the minimum is the right start, but some of the private sector and more commercial partners could also look at what families could add on to this minimum and be open to far more imaginative financing arrangements than what they think is a good idea for the urban types on monthly salaries.\n\nThe extension of this household basic scheme could also be applied in urban areas.\n\nIn the upper income suburbs solar installations while far from ubiquitous are at least common, driven to a large extent by the Zesa load shedding of recent years.\n\nSome households have gone full-scale with solar panels for the light load, plus solar water heaters for one set of the heavy loads, and then cooking on gas so Zesa becomes just a back up.\n\nAgain more households would join this movement if reasonably cheap financing was available and Zesa should encourage the move, as with a lot of consumers who are able to cope without much Zesa would mean that less in the way of new power stations would be needed, although major industrial and commercial consumers will always require national grid power.\n\nIn the end, most households will want both their own solar power and water heating, but would also want a Zesa connection for cooking and other heavy load applications, so it is not choosing one but rather having both.\n\nThis means that the continuing expansion of the grid into new urban housing areas and into at least the rural business centres and growth points, where local industries will be based, must continue since a welder, for example, needs more than a couple of solar panels.\n\nBut at the same time we can do in five years what a normal conventional expansion of the grid to every home might take decades to accomplish, so the Presidential Rural Solarisation Project, along with the Presidential Village Borehole Scheme, are the needed shortcuts to ensure that every Zimbabwean home has that basic quality of life, electric lights and a water tap, expected in an upper middle income society by the 2030  deadline.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/solar.jpg",
            "description": "A highly imaginative and innovative programme to provide a small solar installation for more than one million rural homesteads over the next five years will dramatically upgrade the quality of life of the rural majority of Zimbabweans and compresses decades of development into half a decade. The installations comprise solar panels, an inverter, battery and […]",
            "time": "06:40",
            "date": "19 Dec 2024"
        },
        {
            "title": "‘Expanding tax base may allow tax relief’",
            "url": "https://www.herald.co.zw/expanding-tax-base-may-allow-tax-relief/",
            "content": "Tapiwanashe Mangwiro\n\nSenior Business Reporter\n\nEfforts by the Treasury to widen the tax base, through extending the tax bracket to taxable areas such as churches and the informal sector, could significantly expand the sources of fiscal revenue and allow for the reduction of certain taxes in deserving areas, economic experts say.\n\nThis would result in a win-win scenario for both taxpayers and the Government.Notably, this comes after Finance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube, proposed several tax measures in his 2025 national budget, to bring the emerging economy and certain business activities of religious entities into the tax loop.\n\nIn order to provide an opportunity for the Emerging Sector to contribute to the Fiscus, I propose to enhance the provisions of 206the aforementioned legislation and prescribe for the mandatory registration for Corporate and Personal Income Tax for the following operators: fabric merchandisers, clothing merchandisers/boutiques, spare parts dealers, car dealers, grocery and kitchenware merchandisers, hardware operators and lodges. \n\nFurthermore, I propose that the above-mentioned operators be mandated to regularise registration of their operations with the Zimbabwe Revenue Authority, transact through point-of-sales and maintain records of all transactions, by January 1, 2025, Minister Ncube said.\n\nThe policy intervention makes a lot of sense given how the economy has reconfigured since the turn of the millennium, from being dominated by registered large-scale businesses to a small enterprise, often informal, based marketplace.\n\nExpanding the fiscal tax base, including by incorporating previously taxed sectors, is thus widely seen as a major solution to the long-standing issue of levying overstretched compliant businesses while leaving evaders to go scot-free, yet enjoy or require similarly tax-funded public services as everyone else.\n\nThe untaxed entities enjoyed an unfair advantage over their registered counterparts in that they can offer customers grossly discounted prices, creating serious viability challenges for the compliant businesses.\n\nTaxation is about equity and fairness, says Dingaani Ncube, a chartered accountant with over two decades of experience.\n\nPresently, the tax burden disproportionately falls on compliant individuals and businesses, particularly large corporations.\n\nIf we expand the tax net to include underrepresented groups like SMEs and religious organisations, we could reduce tax rates across the board.\n\nMr D Ncube estimates that broadening the tax base could allow tax rates to be moderated by at least 500 basis points, potentially lowering corporate tax rates from 25 percent to 20 percent.\n\nWhile the percentage may seem small, the cumulative impact on businesses and the economy could be significant.\n\nThe issue of most SMEs not paying taxes has been a contentious one.\n\nWhile SMEs are often lauded as the backbone of many economies globally, contributing significantly to employment and gross domestic product (GDP), many operate informally and avoid paying taxes.\n\nEconomist Mr Takudzwa Maredza, highlighted the scale of the problem.\n\nThe perception that SMEs are highly profitable is often misleading. Many operate on thin margins, but that does not exempt them from contributing to national development.\n\nBy not paying taxes, they are effectively shifting the burden onto compliant taxpayers, Mr Maredza explains.\n\nAccording to the Zimbabwe Revenue Authority (ZIMRA), SMEs constitute about 60 percent of the countrys economic activities but contribute less than 5 percent to tax revenues.\n\nMr Maredza commended ongoing Government efforts to formalise SMEs and introduce simplified tax regimes tailored to their scale saying this could help address the unfair playing field.\n\nGovernments in other countries have successfully implemented turnover-based taxes or presumptive taxes for SMEs. This ensures they contribute something without being overburdened, he said.\n\nAnother under-taxed sector is religious organisations, many of which generate substantial income through donations, events, and investments. While their charitable activities are often exempt from taxation, some argue that their commercial ventures should not be.\n\nMr Namatai Maeresera, an economic analyst, emphasised the need for a balanced approach.\n\nTaxing churches is a sensitive issue, but we need to distinguish between their charitable work and income-generating activities.\n\nIf a church owns a farm or a shopping mall, why should that income be tax-free when a private individual doing the same is taxed?\n\nHe believes that taxing commercial activities of religious organisations could bring in significant revenue without compromising their core mission.\n\nBroadening the tax base could also have broader economic benefits. With more revenue, the Government would have greater capacity to invest in infrastructure, health, and education, as well as increase public sector salaries to stimulate demand.\n\nTax revenue is the lifeblood of any economy, Mr Maredza pointed out. When the Government has more resources, it can invest in projects that create jobs and improve living standards.\n\nThis, in turn, boosts consumer spending, creating a virtuous cycle of growth.\n\nHowever, the economic experts cautioned that reforms must be implemented carefully to avoid stifling growth in nascent sectors. The goal is not to punish SMEs or churches but to create a fair and inclusive tax system, Mr D Ncube stressed.\n\nAs policymakers weigh their options, the message from the experts is clear; broadening the tax base could lead to lower rates, fairer contributions, and a stronger economy.\n\nFor compliant taxpayers, the prospect of relief from over-taxation would be a very welcome development.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/top-bus.jpg",
            "description": "Tapiwanashe Mangwiro Senior Business Reporter Efforts by the Treasury to widen the tax base, through extending the tax bracket to taxable areas such as churches and the informal sector, could significantly expand the sources of fiscal revenue and allow for the reduction of certain taxes in deserving areas, economic experts say. This would result in […]",
            "time": "06:40",
            "date": "19 Dec 2024"
        },
        {
            "title": "SCOTTLAND BREAK NEW GROUND",
            "url": "https://www.herald.co.zw/scottland-break-new-ground/",
            "content": "Tadious Manyepo, Zimpapers Sports Hub\n\nTHE iconic Mabvuku Number One Grounds complex is literally dead.\n\nIt has been dead for a long time now and has virtually been lying in state awaiting burial into some distant memory.\n\nUrban farmers have been making a killing on it, and all sorts of nasty things have been happening right there  murders, rape, prostitution, gambling, everything.\n\nPart of the run-down expansive facility has been turned into a dumpsite, and those living in its surrounds have had to spare a significant chunk of their budget on mosquito repellents.\n\nIt is no longer the Number One Grounds of old, which boasted two perfectly manicured football pitches, a lush green rugby field, two tennis courts, a cricket field, an A-lister basketball court, and a fully equipped gym.\n\nThe sorry remnants of that uptown recreational venue must be a dusty, rugged, and bare football pitch, which only the keenest of budding footballers spend a bit of time practicing on while some division two clubs, like Morelove, perhaps without any better choice, train and host their opponents.\n\nIt is here where legendary sports-persons like the late Joe Kode Mugabe, the late Usman Misi, the Mugeyi brothers William and Wilfred, as well as top female boxer Monalisa Sibanda, among hundreds of others, developed into the beasts they eventually became.\n\nThe facility, though, is set to get a major facelift with newly-promoted Premiership side Scottland chairman Tonderai Sakupwanya expressing their keenness to come up with an ideal sporting complex that will give budding and established athletes and spectators the ultimate platform to showcase and enjoy themselves.\n\nHe said this during the ground-breaking ceremony of the facilitys construction in the sprawling eastern suburb yesterday.\n\nWork immediately started after the brief ceremony that attracted thousands of people.\n\nThe flamboyant team secured the facility right in the heart of the oldest townships in the country on a 30-year-old lease from the Harare City Council.\n\nThey intend to establish a CAF-standard 15 000-seater stadium along with other sporting amenities, including swimming pools, rugby fields, tennis and basketball courts, among other things.\n\nOriginally, the venue was the go-to arena with a hive of different activities taking place across.\n\nAnd Sakupwanya says his club wants to turn everything around after the official handover of the facility and subsequent commencement of construction yesterday.\n\nWe are going to do it in phases, doing things in parts. But immediately, we are going to start by constructing the clubhouse.\n\nIts not only a stadium; it will be a sporting complex with a swimming pool, tennis, basketball courts, and everything else.\n\nWe are simply reviving it to its former glory. We will also have a food court; its a big project, said Sakupwanya.\n\nLook, this is a massive project, and we are excited to be spearheading it. We are bringing football to Mabvuku, and we have everything planned in place.\n\nThe engineers are right on the ground, and work is starting right away. I cant give any time-lines, but we will move with a lot of speed.\n\nOur dream has always been to bring football to Mabvuku, and the first step was to come up with the team in the Premiership. We have the first step done, and we are moving into the next.\n\nScottland have collaborated with other partners, including Ecobank, in the construction of the facility.\n\nEcobank senior executive Mike Dengwane told the media that his organisation was excited to work with Scottland.\n\nWe have already opened bank accounts for all the football players in Scottland. We are also going to put in some guarantees when they do transfers, moving from one club to the other; we are going to do that facilitation.\n\nScottland bus is powered by Ecobank, and we are looking forward to injecting more sponsorship for Scottland. The players have also been empowered to access loans, said Dengwane.\n\nWe are here to help Scottland come up with a state-of-the-art stadium in Mabvuku, which is actually their home. We are here to support that initiative. Our relationship with Scottland is not a fly-by-night thing; we are looking forward to working with them for a long time to come.\n\nWe will soon be going beyond to include other sporting disciplines as well. We are planning to take Zimbabwe to the next World Cup.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/SCOTT.jpg",
            "description": "Tadious Manyepo, Zimpapers Sports Hub THE iconic Mabvuku Number One Grounds complex is literally dead.” It has been dead for a long time now and has virtually been lying in state awaiting burial into some distant memory. Urban farmers have been making a killing on it, and all sorts of nasty things have been happening […]",
            "time": "06:40",
            "date": "19 Dec 2024"
        },
        {
            "title": "Zim moves to eliminate mercury in gold mining",
            "url": "https://www.herald.co.zw/zim-moves-to-eliminate-mercury-in-gold-mining/",
            "content": "Oliver Kazunga\n\nSenior Business Reporter\n\nZIMBABWE, in collaboration with its international partners, has launched a US$23,7 million five-year project to reduce the use of mercury in artisanal and small-scale gold mining across the country.\n\nMercury, which is used to extract gold from ore, is a toxic chemical that damages the lungs, skin and eyes while the substance can travel far from where it is released, polluting the air, water, and soil.\n\nThe substance also bio-accumulates the food chain.\n\nAuthorities and other stakeholders have raised concerns in recent years over the use of mercury in the artisanal and small-scale gold mining industry, which contributes over two-thirds of Zimbabwes total gold output.\n\nGold is the countrys largest single export, according to official figures from Fidelity Gold Refinery, the countrys exclusive buyer of the yellow metal produced locally, reaching 32 tonnes in the first 11 months of this year.\n\nFrom January to November 2024, the artisanal and small-scale mining sector delivered 20,3 tonnes while primary producers or the large-scale miners produced 11,7 tonnes.\n\nIn a statement, planetGOLD Zimbabwe, one of the project partners said the initiative, which is financially supported by the Global Environment Facility (GEF) and executed in partnership with the United Nations Environment Programme (UNEP), was part of a global programme implemented in 25 countries.\n\nThe Government is also working with IMPACT, a NGO, in executing the project.\n\nZimbabwes Government is taking action to support a more responsible artisanal gold mining sector, launching a U$23,7 million project to reduce mercury across mine sites in the country.\n\nIn Zimbabwe, over 300 000 people work in artisanal gold mining, with the sector contributing to more than 40 percent of the countrys mineral exports.\n\nAcross the country, 96 percent of artisanal gold mine sites use mercury, with miners often forgoing protective equipment and risking exposure to toxic fumes.\n\nZimbabwes artisanal gold mining activities result in more than 24 tonnes of mercury being released annually, it said.\n\nThe project will work together with local communities to reduce the use of mercury in artisanal and small-scale gold mining  the worlds largest source of anthropogenic emissions of mercury pollution  while improving the health and lives of local mining communities.\n\nThe planetGOLD Zimbabwe project plans to support 7 500 men and women at 11 districts in Zimbabwe, reducing mercury use by 4 85 tonnes.\n\nIn addition to mercury reduction, the project aims to support formalisation of the artisanal gold mining sector and increasing miners access to finance.\n\nThis will lead to the adoption of mercury-free technologies and promote more responsible and traceable gold supply chains, said planetGOLD Zimbabwe.\n\nThe project, which was officially launched last month in Harare with an inception workshop, brought together stakeholders to discuss how planetGOLD Zimbabwe will support a more responsible artisanal gold sector.\n\nAccording to planetGOLD Zimbabwe, Acting permanent secretary in the Ministry of Environment, Climate, and Wildlife Mr Edward Samuriwo recently outlined the projects significance in addressing the challenges of mercury use in Zimbabwes gold mining sector.\n\nHe reaffirmed Zimbabwes commitment to the Minamata Convention on Mercury and emphasised the pivotal role the planetGOLD project will play in supporting the countrys efforts to eliminate mercury use in artisanal gold mining through the implementation of Zimbabwes national action plan.\n\nZimbabwe ratified the Minamata Convention on Mercury in 2021.\n\nIn its national action plan, the country committed to strong co-operation among all stakeholders including Government agencies and supply chain actors to improve the health and safety of communities involved in artisanal gold mining.\n\nIMPACT deputy executive director Mr Yann Lebrat said: Through the launch of the planetGOLD project, Zimbabwe moves towards more responsible artisanal gold mining.\n\nWe look forward to working with all stakeholders to create a sustainable change in the sector. The mining industry, anchored by gold, is one of the major cornerstones of Zimbabwes economy.\n\nAccording to the Zimbabwe Investment and Development Agency, the mining sector accounts for 70 percent to Foreign Direct Investment  80 to exports  19 percent to Governments revenue  3 percent to direct formal employment  and 13,5 percent to national income.\n\nThe sector is endowed with vast mineral deposits that also includes platinum; diamond; lithium; chrome; coal; and semi-precious stones such as antimony, amazonite, and agate where the small-scale miners are actively involved.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/11/Mercury.jpg",
            "description": "Oliver Kazunga Senior Business Reporter ZIMBABWE, in collaboration with its international partners, has launched a US$23,7 million five-year project to reduce the use of mercury in artisanal and small-scale gold mining across the country. Mercury, which is used to extract gold from ore, is a toxic chemical that damages the lungs, skin and eyes while […]",
            "time": "06:40",
            "date": "19 Dec 2024"
        }
    ]
}