{
    "news": [
        {
            "title": "Econet services back online",
            "url": "https://www.herald.co.zw/econet-services-back-online/",
            "content": "Online Reporter\n\nEconet Wireless Zimbabwe says it has resolved network challenges that affected some its services.\n\nWe experienced some issues on the platforms that enable our subscribers to make calls, use data or carry out EcoCash transactions, resulting in some of our customers being unable to use the services for about an hour and half, starting around 2pm to 3:30pm today (February 5, 2025), it said in a statement.\n\nWe are pleased to advise that the challenges have since been successfully resolved, and all services have been fully restored.\n\nWe sincerely apologise for the inconvenience this may have caused our valued customers.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2018/07/econet.jpg",
            "description": "Online Reporter Econet Wireless Zimbabwe says it has resolved network challenges that affected some its services. “We experienced some issues on the platforms that enable our subscribers to make calls, use data or carry out EcoCash transactions, resulting in some of our customers being unable to use the services for about an hour and half, […]",
            "time": "21:26",
            "date": "05 Feb 2025"
        },
        {
            "title": "RTG commits US$500 000 towards refurbishing New Ambassador Hotel",
            "url": "https://www.herald.co.zw/rtg-commits-us500-000-towards-refurbishing-new-ambassador-hotel/",
            "content": "Oliver Kazunga\n\nSenior Business Reporter\n\nHospitality group, Rainbow Tourism Group (RTG) has invested US$500 000 towards the refurbishment of the New Ambassador Hotel in Harare.\n\nThe extensive renovation programme, which began on January 6 this year, includes a complete transformation of guest rooms and bathrooms. This is aimed at enhancing comfort and elevating the overall guest experience.\n\nThe hotel is set to reopen next Monday.\n\nSpeaking during a media tour this morning, RTG corporate affairs and quality manager, Ms Pride Khumbula highlighted that all 72 rooms are undergoing a complete transformation.\n\nThe refurbishment includes reconfiguring and reconstruction of the room layout to maximise space. The bathrooms have been overhauled with the installation of brand new modern fixtures which include bathroom vanities, walk-in showers, and modern toilets.\n\nThe walls and floors have been stripped and re-tiled to achieve a sleek, modern finish, she said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/download-7.jpeg",
            "description": "Oliver Kazunga Senior Business Reporter Hospitality group, Rainbow Tourism Group (RTG) has invested US$500 000 towards the refurbishment of the New Ambassador Hotel in Harare. The extensive renovation programme, which began on January 6 this year, includes a complete transformation of guest rooms and bathrooms. This is aimed at enhancing comfort and elevating the overall […]",
            "time": "21:26",
            "date": "05 Feb 2025"
        },
        {
            "title": "Live Coverage: Commission exposes more rot at Harare City Council",
            "url": "https://www.herald.co.zw/live-coverage-commission-exposes-more-rot-at-harare-city-council/",
            "content": "14.37 The City of Harare has been plagued by corruption, mismanagement, and lack of accountability, according to testimonies made over the last few months before the Commission of Inquiry into the citys governance.\n\nPresident Mnangagwa swore in the five-member Commission in May 2024.\n\nThe Justice Maphios Cheda-led Commission also includes local governance experts Steven Chakaipa, Norbert Phiri, Lucia Gladys Matibenga and Khonzani Ncube.\n\nThe Permanent Secretary for Local Government and Public Works, Dr John Bhasera, is its secretary.\n\nSeveral top officials, including the councils Mayor Jacob Mafume; assistant executive to the town clerk, Matthew Marara; acting finance director Godfrey Kusangaya and acting human capital director, Bosman Matengarufu, among others, have appeared before the Commission.\n\nWith each appearance of a top official, skeletons have been tumbling out of closets.\n\nOne thing is certain, the Commission means business and they will stop at nothing in exposing the rot at the local authority.\n\nAs we cover this intriguing story that looks at how public funds are being abused brazenly, the ride is definitely going to have so many astounding twists and turns.\n\nJust put on your seatbelt and enjoy the ride!\n\n14.37 Harare Mayors house turns out to be vehicle auction site\n\nDrama unfolded in Greendale, Harare today (February 5), as the Commission temporarily adjourned Mayor Mafumes testimony to conduct an onsite inspection at a property he had claimed to be his house.\n\nThe Commissions findings revealed that the property, located on Coronation Road at number 1110 in Greendale, is not a residential area as claimed, but a vehicle auction site.\n\nWhen Mayor Mafume attempted to explain the discrepancy, Judge Cheda instructed him to provide his explanation at a later time.\n\nThe Commission insisted on an inspection in loco after discovering that Mayor Mafume had lied under oath.\n\nMayor Mafume claimed it was a mistake, saying his house was just two blocks away from the initial address.\n\nHowever, the Commission refused to accept this and proceeded with the inspection.\n\n14.45 Eyebrows raised as Harare City buys US$1m Ruwa house\n\nThe Harare City Medical Aid Society has come under fire for purchasing a 12-roomed house in Ruwa for a staggering US$1 million.\n\nThis transaction is drawing scrutiny amid ongoing investigations by the Harare Commission of Inquiry, which aims to expose pervasive corruption within the city council.\n\nThe inquiry has revealed a pattern of mismanagement and financial irregularities in the local authority, where public funds are often misappropriated for personal gains.\n\nRecent reports indicated that the Medical Aid Society acquired properties without obtaining title deeds, which has led to complications in tracing these assets.\n\nThis alarming situation came to light yesterday (February 4) during an inquiry session where Mayor Mafume addressed allegations of corruption and mismanagement within the council.\n\nThe Mayors involvement in the Medical Aid Societys dealings has raised eyebrows, especially since he is largely seen as a ceremonial figure in the council.\n\nBut when questioned about his presence at the Medical Aid Society meetings, Mayor Mafume said his oversight is essential given the magnitude of the alleged theft.\n\nI attended that Medical Aid Society meeting because US$1 million had been stolen. How can it be ordinary? he said.\n\nThe house, which was reportedly owned by Dr Munyaradzi Kereke, is intended to be converted into a clinic.\n\nHowever, the Mayor criticised the decision to spend such an exorbitant sum while city employees struggle to access medical treatment due to financial mismanagement, revealing a disconnect between the councils financial priorities and the welfare of its workers.Mayor Mafume said he is often called to address issues regarding delayed salaries.\n\nMoney is being paid twice, he said, indicating a troubling pattern of financial irregularities that raise concerns about the accountability of council officials.\n\n14.54 Council has no control over its firms: Mayor\n\nHarare City Council risks losing its companies amid indications that the subsidiaries, including Harare Quarry and Rufaro Marketing, are registered in the names of individuals, some of whom have since left the local authority.\n\nFurther, council also offered free land to individuals through verbal agreements.\n\nCity Parking, which is wholly-owned by the local authority, had its papers changed sometime last year as it was in the names of previous directors during the era of former Harare Town Clerk Tendai Mahachi.\n\nThe rot, especially at Rufaro Marketing, resulted in council spending 13 years without collecting a cent from its 130 beerhalls.\n\nA report of the special committee on Rufaro Marketing, mandated to run the beerhalls, showed that current and former council employees were subletting the beerhalls in foreign currency, yet paying a paltry fee to council, if at all.\n\nSpeaking during a special council meeting last year, Mayor Jacob Mafume conceded that the city has no control over its assets.\n\nMayor Jacob Mafume\n\nCannibalism had set-in in council. Share certificates were put in names of certain individuals who were then fired or left council for one reason or the other and it was taking time to find signatories.\n\nWe have ordered that those papers be regularised.\n\nCity Parking papers have since been regularised and we are looking at the Quarry papers for their regularisation, he said.\n\nMayor Mafume said as for Rufaro Marketing, a former chief executive had basically run away with the organisation.\n\nWe have now put in a new board and we are asking that the situation be rectified.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/c4dd30a0-69c5-495e-bf5b-1350b9c59aee.jpeg",
            "description": "14.37 – The City of Harare has been plagued by corruption, mismanagement, and lack of accountability, according to testimonies made over the last few months before the Commission of Inquiry into the city’s governance. President Mnangagwa swore in the five-member Commission in May 2024. The Justice Maphios Cheda-led Commission also includes local governance experts Steven […]",
            "time": "21:26",
            "date": "05 Feb 2025"
        },
        {
            "title": "Harare Mayor’s ‘house’ turns out to be vehicle auction site",
            "url": "https://www.herald.co.zw/harare-mayors-house-turns-out-to-be-vehicle-auction-site/",
            "content": "Trust Freddy\n\nHerald Correspondent\n\nDrama has unfolded in Greendale, Harare, as the Justice Maphios Cheda-led Commission of Inquiry into Harares affairs temporarily adjourned Mayor Jacob Mafumes testimony to conduct an onsite inspection at a property he had claimed to be his house.\n\nThe Commissions findings revealed that the property, located on Coronation Road at number 1110 in Greendale, is not a residential area as claimed, but a vehicle auction site.\n\nWhen Mayor Mafume attempted to explain the discrepancy, Judge Cheda instructed him to provide his explanation at a later time.\n\nThe Commission insisted on an inspection in loco after discovering that Mayor Mafume had lied under oath.\n\nMayor Mafume claimed it was a mistake, saying his house was just two blocks away from the initial address.\n\nHowever, the Commission refused to accept this and proceeded with the inspection.\n\nMeanwhile, the convoy, comprising journalists and the entire Commission bench, is now heading back to the Disaster Management Centre, where the public hearings are being conducted.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Screenshot-72-680x380.png",
            "description": "Trust Freddy Herald Correspondent Drama has unfolded in Greendale, Harare, as the Justice Maphios Cheda-led Commission of Inquiry into Harare’s affairs temporarily adjourned Mayor Jacob Mafume’s testimony to conduct an onsite inspection at a property he had claimed to be his house. The Commission’s findings revealed that the property, located on Coronation Road at number […]",
            "time": "21:26",
            "date": "05 Feb 2025"
        },
        {
            "title": "Major repairs at Morton Jaffray affect water supply",
            "url": "https://www.herald.co.zw/major-repairs-at-morton-jaffray-affect-water-supply/",
            "content": "Diana Nherera\n\nSuburban Reporter\n\nThe City of Harare is carrying out major repairs at Morton Jaffray Water Works and this has resulted in a reduction in water supply.\n\nIn an interview, council spokesperson Mr Stanley Gama said water supply is expected to improve upon completion of the repairs.\n\nOur water supply situation is depressed because of major maintenance work that we are carrying out at Morton Jaffray Water Works, he said.\n\nThe situation should improve as soon as we finish the work.\n\nSome parts of Avondale and Strathaven have not had water for over two months, with other parts receiving water for a few hours at a time.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Harare-City.jpg",
            "description": "Diana Nherera Suburban Reporter The City of Harare is carrying out major repairs at Morton Jaffray Water Works and this has resulted in a reduction in water supply. In an interview, council spokesperson Mr Stanley Gama said water supply is expected to improve upon completion of the repairs. “Our water supply situation is depressed because […]",
            "time": "21:26",
            "date": "05 Feb 2025"
        },
        {
            "title": "Another mine shaft collapse in Makaha, miner buried alive",
            "url": "https://www.herald.co.zw/another-mine-shaft-collapse-in-makaha-miner-buried-alive/",
            "content": "Victor Maphosa\n\nMashonaland East Bureau\n\nOne artisanal miner died yesterday when a gold mine shaft he had entered to prospect for gold ore collapsed, killing him instantly.\n\nThe incident occurred near Mabhanga Business Centre in Makaha, Mudzi District.\n\nIt is alleged that the artisanal miner illegally entered the shaft alone while his accomplices waited outside.\n\nThe shaft then collapsed, burying him alive.\n\nIn a telephone interview, one of the miners, Mudyiwa Mashonganyika confirmed the incident.\n\nThe accident occurred yesterday around 1 pm. The deceased, who is believed to be from Chiredzi, entered the shaft before it collapsed and buried him alive.\n\nImmediately, efforts to rescue him were instituted, and his body was retrieved, said Mashonganyika.\n\nThis is the second disaster to occur in Makaha this year following another one that occurred on January 3 when three artisanal miners  all from Gokwe  were reportedly buried alive when a mine shaft collapsed due to heavy rains.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/06/death.jpg",
            "description": "Victor Maphosa Mashonaland East Bureau One artisanal miner died yesterday when a gold mine shaft he had entered to prospect for gold ore collapsed, killing him instantly. The incident occurred near Mabhanga Business Centre in Makaha, Mudzi District. It is alleged that the artisanal miner illegally entered the shaft alone while his accomplices waited outside. […]",
            "time": "21:26",
            "date": "05 Feb 2025"
        },
        {
            "title": "Minister Moyo dismisses BEAM funds diversion reports",
            "url": "https://www.herald.co.zw/minister-moyo-dismisses-beam-funds-diversion-reports/",
            "content": "Farirai Machivenyika\n\nSenior Reporter\n\nPrimary and Secondary Education Minister, Dr Torerai Moyo has dismissed online media reports that suggested that the Government diverted funds meant for the Basic Education Assistance Model (BEAM) last year to go towards the SADC Summit that was hosted by Zimbabwe last August.\n\nDr Moyo said the report by an online publication, Bulawayo 24, following his visit to schools in Mhondoro-Mubaira Constituency last week was false and misleading.\n\nThe purpose of the tour was to assess the extent of destruction on classroom blocks by storms. In my engagement with stakeholders who included parents, students and councillors, I never stated or implied that BEAM funds were used to fund the SADC Summit.\n\nFurthermore, there are no dropouts in all our schools. In fact, we have witnessed an increase in enrolment in both primary and secondary schools in the post Covid-19 period, Dr Moyo said.\n\nThe biased report was designed to unnecessarily blame the Government for no reason. In addition, the story was written to defame my character. Im consulting my lawyers to take legal action against the reporter in question.\n\nBEAM is a safety net extended to the most vulnerable and disadvantaged children by our President, Cde Mnangagwa, so that they can have access to education which is a fundamental right enshrined in the Constitution of Zimbabwe, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/cde-Torerai-Moyo.jpg",
            "description": "Farirai Machivenyika Senior Reporter Primary and Secondary Education Minister, Dr Torerai Moyo has dismissed online media reports that suggested that the Government diverted funds meant for the Basic Education Assistance Model (BEAM) last year to go towards the SADC Summit that was hosted by Zimbabwe last August. Dr Moyo said the report by an online […]",
            "time": "21:26",
            "date": "05 Feb 2025"
        },
        {
            "title": "Council to honour Emergency Help Group for life-saving efforts",
            "url": "https://www.herald.co.zw/council-to-honour-emergency-help-group-for-life-saving-efforts/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nThe City of Harare is set to honour the Emergency Help Group (EHG) for their tireless and heroic work during emergencies.\n\nThe recognition ceremony will be held tomorrow, with Mayor Jacob Mafume commending the group for their exceptional dedication to saving lives and providing assistance during accidents, fires, illnesses and robberies.\n\nCity of Harare spokesperson, Mr Stanley Gama said the council is grateful for the EHGs selfless efforts.\n\nThe Mayor feels it is imperative to recognise the gallant men and women of the Emergency Help Group, who continuously go above and beyond to assist the community in its most desperate moments, said Mr Gama.\n\nThese volunteers are available 24 hours a day, offering critical services such as mobilising ambulances, providing transport and even organising water bowsers during fires.\n\nWe are incredibly grateful for the invaluable assistance provided by the EHG. Their work with our fire brigade has only strengthened our response capabilities and ensured that lives and property are protected more effectively.\n\nThe Emergency Help Group is a prime example of how a united community can make a tremendous difference in times of crisis, Mr Gama said.\n\nCouncil also remains cautious of other opportunistic groups that may attempt to profit from emergencies.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/09/Mayor-Jacob-Mafume.jpg",
            "description": "Ivan Zhakata Herald Correspondent The City of Harare is set to honour the Emergency Help Group (EHG) for their tireless and heroic work during emergencies. The recognition ceremony will be held tomorrow, with Mayor Jacob Mafume commending the group for their exceptional dedication to saving lives and providing assistance during accidents, fires, illnesses and robberies. […]",
            "time": "21:26",
            "date": "05 Feb 2025"
        },
        {
            "title": "DRC peace bid: President to lead Sadc delegation",
            "url": "https://www.herald.co.zw/drc-peace-bid-president-to-lead-sadc-delegation/",
            "content": "Fungi Kwaramba\n\nNews Editor\n\nPRESIDENT Mnangagwa will lead a delegation of the Southern African Development Community to Tanzania later this week for an Extraordinary joint meeting with the East African Community (EAC) bloc in an effort to thrash out a peaceful resolution to the Democratic Republic of Congo (DRC) conflict.\n\nThis follows a decision made by the Extraordinary SADC Summit in Harare last week for a joint summit with the EAC, chaired by Kenyan President William Ruto.\n\nDRC, a member of both SADC and the EAC, accuses Rwanda, which is a member of the latter grouping, of backing M23 and other rebel groups, that have left death and destruction in eastern DRC.\n\nThe Extraordinary joint summit has been spawned by growing hostilities in eastern DRC that have killed thousands, with millions fleeing their homes.\n\nDeputy Chief Secretary in the Office of the President and Cabinet (Presidential Communications), Mr George Charamba, who is also the Presidential Spokesperson, said the President will lead a Double Troika, plus the Troops Contributing countries to the joint summit, that he will co-chair with President Ruto.\n\nThe President has a very important foreign affairs fixture in the form of the situation in DRC. There is a joint summit of SADC and the East African Community that will be held in Tanzania later this week, which has taken an extraordinary decision to invite all parties in the DRC conflict to a meeting. The President is an important interlocutor in the crisis considering that he has built a strong relationship with both the DRC President Felix Tshisekedi and President Paul Kagame, said Mr Charamba.\n\nThe SADC Double Troika comprises the SADC chairman, outgoing chairman and incoming and the Chairperson of the Organ on Politics, Defence and Security Cooperation.\n\nTanzanian President Samia Suluhu Hassan is the current chairperson of the SADC Organ on Politics, Defence and Security Cooperation.\n\nThe SADC Mission in the DRC (SAMIDRC), that was deployed on 15 December 2023 to support the Government of the DRC to restore peace and security in eastern DRC, comprises forces from the Republics of Malawi, South Africa and the United Republic of Tanzania.\n\nIn the aftermath of summits that were held separately by SADC andthe EAC, the United Nations Security Councils strident criticism of the rebel groups in eastern DRC and their sponsoring countries, a wide conflagration in the Greater Lakes region has seemingly been averted after the M23 and other rebel groups declared a ceasefire, ostensibly on humanitarian grounds.\n\nThe coalition of rebels, which recently intensified clashes in eastern Congo, claimed control over Goma, the capital of North Kivu province.\n\nClashes between government forces and rebel groups have left an estimated 900 civilians dead, displacing tens of thousands more.\n\nThe recent fighting in eastern DRC, which has been dogged by conflict for more than 30 years since the 1994 Rwandan genocide, has also claimed 16 soldiers from the South African National Defence Force (SANDF) and Malawi, who form part of the SADC Mission in the DRC (SAMIDRC).\n\nAs rebel forces gained the upper hand on the battlefield, capturing much of Goma, the largest city in eastern Congo, South Africa responded with a stern diplomatic warning. The South African government stated that any further attacks on its troops would be regarded as a declaration of war.\n\nIn a swift rebuttal, Rwandas President Kagame accused South Africa of acting as part of a belligerent force. He claimed that South African troops were engaged in offensive combat operations to support the Congolese government in its fight against its own citizens.\n\nResultantly, tensions were high before last weeks SADC Summit in Harare, which mandated its Organ Troika on Politics, Defence and Security Co-operation to engage all state and non-state parties to the conflict on a ceasefire process to protect lives and facilitate a smooth flow of humanitarian support to people and communities affected by the armed conflict.\n\nThe Summit also urged Political and Diplomatic leaders who are parties to the conflict to engage in a co-ordinated effort of dialogue, including supporting the Luanda Process, MONUSCO and others, to restore peace and security in eastern DRC.\n\nSADC leaders also reaffirmed their commitment to the DRCs sovereignty, territorial integrity, and long-term stability, pledging ongoing support for its development and security.\n\nLast week, the African Unions Peace and Security Council (PSC) at its 1256th Emergency Ministerial meeting on the Recent Developments in the Eastern Democratic Republic of Congo (DRC), condemned the DRC conflict and called for adherence to the Luanda Process.\n\nUnder the Luanda Process, Angolan President Joo Manuel Gonalves Loureno has tried to broker peace between DRC President Tshisekedi and his Rwandan counterpart Kagame. Such talks have, however, remained elusive, amid escalatory rhetoric and trading of accusations between the two leaders.\n\nThus, the summit, that will be held in Tanzania, offers a platform for both President Tshisekedi and President Kagame to meet directly with mediation from SADC and the EAC.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/3r23r-680x380.jpg",
            "description": "Fungi Kwaramba News Editor PRESIDENT Mnangagwa will lead a delegation of the Southern African Development Community to Tanzania later this week for an Extraordinary joint meeting with the East African Community (EAC) bloc in an effort to thrash out a peaceful resolution to the Democratic Republic of Congo (DRC) conflict. This follows a decision made […]",
            "time": "21:26",
            "date": "05 Feb 2025"
        },
        {
            "title": "President back from leave, to focus on economic growth",
            "url": "https://www.herald.co.zw/president-back-from-leave-to-focus-on-economic-growth/",
            "content": "Wallace Ruzvidzo\n\nHerald Reporter\n\nPRESIDENT Mnangagwa has officially returned from his month-long leave, and his packed schedule will prioritise Zimbabwes economic growth and stability, Deputy Chief Secretary (Presidential Communications) in the Office of the President and Cabinet, Mr George Charamba, has said.\n\nMr Charamba told The Herald yesterday that the President was officially back from his annual vacation, adding that major decisions will be made regarding the economy.\n\nPresident Mnangagwa last week took time off his annual break to chair a session on developments in the countrys economy designed to map the way forward.\n\nThe President is now officially back from his leave and as you may know there (have been) certain economic developments in the past few weeks, remember he had to break his leave last week to chair a meeting that focused on the economic developments in the country, so his major focus will be on the economy. Some major decisions will be made regarding the economy, he said.\n\nLast weeks meeting that was attended by Vice President Constantino Chiwenga, Vice President Kembo Mohadi, Finance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube and State Security Minister Lovemore Matuke, deliberated on measures Government has taken on the economy and developments in specific economic sectors, including the retail sub-sector.\n\nThe meeting culminated in the announcement of a raft of new measures to compel regulatory compliance within the retail and wholesale sectors, aiming to rein in the countrys increasingly informal economy.\n\nOn a regional level, the President, who is the current Southern African Development Community (SADC) Chair, will continue to lead the regional body in intensifying regional peace and security efforts.\n\nThe President last week chaired the Extraordinary SADC Summit held in Harare to discuss the security situation in the eastern Democratic Republic of Congo (DRC).\n\nBoth SADC Chair President Mnangagwa and East African Community (EAC) Chair Kenyan President William Ruto have since agreed for the convening of a joint summit between the two regional blocs.\n\nDuring his break, the President demonstrated that he was a hands-on leader as he performed his duties as and when needed.\n\nIn addition to chairing the economic meeting and the Extraordinary SADC Summit, the President saw off beneficiaries of an Algerian scholarship programme, welcomed ruling party and opposition legislators as they toured the First Familys Pricabe Farm in Kwekwe, a monumental tour that saw the unification of both Zanu PF and CCC MPs, and commemorated former Vice President John Landa Nkomos death, among other Presidential duties.\n\nIn the last Cabinet meeting of 2024, the President said going into the new year, the Second Republic would continue delivering for the general citizenry this year.\n\nThe service delivery demands of the people of Zimbabwe must be responded to timely. After all, we are a Government by the people and for the people, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/etheh-680x380.jpg",
            "description": "Wallace Ruzvidzo Herald Reporter PRESIDENT Mnangagwa has officially returned from his month-long leave, and his packed schedule will prioritise Zimbabwe’s economic growth and stability, Deputy Chief Secretary (Presidential Communications) in the Office of the President and Cabinet, Mr George Charamba, has said. Mr Charamba told The Herald yesterday that the President was officially back from […]",
            "time": "21:26",
            "date": "05 Feb 2025"
        }
    ]
}