{
    "news": [
        {
            "title": "Police recover stolen Boer goats",
            "url": "https://www.herald.co.zw/police-recover-stolen-boer-goats/",
            "content": "Victor Maphosa\n\nMashonaland East Bureau\n\nPolice in Mashonaland East have launched a manhunt for a suspect who stole nine boer goats from a farm in Beatrice on Sunday.\n\nAllegations are that the suspect gained entry into the farm by cutting the security fence before stealing nine boer goats and loading them in a Nissan AD van.\n\nHe was intercepted by the police who conducting night patrols along the Harare-Masvingo highway.\n\nThe suspect, who had parked his vehicle on the side of the road, fled into the bushes and disappeared into the darkness before the police could search his vehicle.\n\nIt is alleged that the owner of the goats, Mr Onias Sanangura (44) noticed some photos sent by the police on a WhatsApp group belonging to farmers and sent his employee to the police station where she positively identified the goats.\n\nPolice spokesperson for Mashonaland East province Inspector Simon Chazovachiyi confirmed the incident.\n\nThe police recovered the vehicle and the goats and took them to ZRP Beatrice, he said. At around 11 am, the farm owner Mr Sanangura noticed some photos sent by police on the farmers WhatsApp groups and sent his manager to Beatrice Police Station where she then positively identified the boer goats.\n\nWe appeal to farmers to brand or ear tag their livestock for easy of identification. We also urge them to join neighborhood watch committees that patrol their areas and safe guard their property.\n\nWe also urge them to quickly report such cases to the police.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/79c447e7-18ef-44f9-b273-cc594f9b1525-680x380.jpeg",
            "description": "Victor Maphosa Mashonaland East Bureau Police in Mashonaland East have launched a manhunt for a suspect who stole nine boer goats from a farm in Beatrice on Sunday.   Allegations are that the suspect gained entry into the farm by cutting the security fence before stealing nine boer goats and loading them in a Nissan […]",
            "time": "21:26",
            "date": "20 Jan 2025"
        },
        {
            "title": "Seedco donates to local charities",
            "url": "https://www.herald.co.zw/seedco-donates-to-local-charities/",
            "content": "Precious Manomano\n\nHerald Reporter\n\nSeedco has donated US$9 060 to support vulnerable communities. Of this amount US$4530 was allocated to the Mutemwa Leprosy Centre in Mutoko and another US$4 530 to the Ida Wekwako Old Peoples Home in Marondera.\n\n105-year-old Jessie Brown receives a dummy cheque for US$5 530 from Seed Co public relations officer Patience Phiri (kneeling) on behalf of Mutemwa Leprosy Catholic and Care Centre in Mutoko on Friday. Looking on are Seed Co head of Agronomy and Extension Services Dior Pote (standing right) ,Mutemwa Leprosy Catholic and Care Centre administrator Aquinamary Guri (standing second from right) and some of the beneficiaries (seating).-Picture: Joseph Manditswara\n\nThe funds were raised during the Seedco Golf 2024 event.\n\nMutemwa Leprosy Centres administrator Ms Acquinamary Guri expressed heartfelt gratitude for the donation, noting its impact on the centres operations and the well-being of its patients.\n\nWe were given money from last years proceeds. We are grateful, she said.\n\nThey give us seeds every year, and our average yield is five to six tonnes. Although we did not harvest last year, we managed to install our solar system and repair the borehole with the support from Seedco.\n\nWith this new donation, we aim to extend our solar system to cover the clinic, which will greatly assist our patients, especially in bathing.\n\nIda Wekwako Old Peoples Home administrator Mr Clement Matulanga echoed similar sentments.\n\nThe help we received is tremendous. No amount of words are enough to thank them, he said.\n\nThe solar borehole that we installed was funded by the money from Seedco. We have also benefited from various other projects because of their support.\n\nSeedcos public relations and communications officer Patience Phiri said that this initiative is part of a broader commitment to corporate social responsibility.\n\nWe have an active corporate social responsibility desk where we strive to assist communities, she said.\n\nDuring our annual Seedco Golf Day, we raised funds, and Seedco matches these funds to support these two homes. We believe in giving back to the community.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/08ecbff0-adef-42cd-8e1a-91e2bfac1876-1-680x380.jpeg",
            "description": "Seedco has donated US$9 060 to support vulnerable communities. Of this amount US$4530 was allocated to the Mutemwa Leprosy Centre in Mutoko and another US$4 530 to the Ida Wekwako Old People’s Home in Marondera.",
            "time": "21:26",
            "date": "20 Jan 2025"
        },
        {
            "title": "R14 million Zim cigarettes intercepted at SA border",
            "url": "https://www.herald.co.zw/r14-million-zim-cigarettes-intercepted-at-sa-border/",
            "content": "Thupeyo Muleya\n\nBeitbridge Bureau\n\nSouth African security authorities have arrested a 44-year-old migrant at Beitbridge border post with a consignment of Remington gold worth an estimated R14 million alleged to have been smuggled from Zimbabwe.\n\nThe smuggling of cigarettes has become a perennial headache for authorities for both countries who in most cases are collaborating to minimise the vice.\n\nIt is understood that South African customs laws are restrictive for Zimbabwean exporters to legally move the cigarettes from Zimbabwe to that country and hence the upsurge in the smuggling of various brands.\n\nIn most cases these are being smuggled through the Limpopo River while others take their chances at the border.\n\nIndications are that at least one third of cigarettes brands on the South African market are smuggled from Zimbabwe including Pacific, Remington gold, Mega, Dullahs, Branson and Servilles.\n\nIdeally a box of cigarettes is bought at US$120 from local producers and sold for between US$250 and US$300 to the syndicates who then smuggle them into South Africa where the sell for anything above R15 000.\n\nThose that illegally transport the commodity across borders are paid between R100 and R300 per box and in most cases this is done under the cover of darkness\n\nIn a statement on Monday, Limpopo police spokesperson, Brigadier Hlulani Mashaba said the contraband was intercepted on Saturday.\n\nThe nationality of the migrant will be revealed following his initial court appearance at Musina magistrates court on charges of smuggling.\n\nThe Provincial Commissioner of police in Limpopo Lieutenant General Thembi Hadebe has applauded police for their vigilance and alertness which resulted in the arrest of a 44 year-old foreign national for smuggling illicit cigarettes worth more than fourteen million Rands at Beitbridge Port of Entry on Saturday, he said.\n\nIt is reported that the suspect was driving a white truck with a tanker trailer when he was stopped by the police at the port of entry. The driver told police that it was empty but they suspected to be loaded and it was taken to the ramp zone at the commercial side and searched.\n\nDuring the search, police discovered that it was fully loaded with illicit cigarettes of Remington Gold brand and the suspect failed to provide satisfactory explanation regarding the origin of the cigarettes and he was immediately placed under arrest on the spot.\n\nBrig Mashaba said the police had since police confiscated 710 boxes of Remington Gold illicit cigarettes with an estimated street value of R14 449 363 and a truck tanker valued at R2 500 000.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/73912eb3-5555-4359-84ec-d55a306fff66-680x380.jpeg",
            "description": "South African security authorities have arrested a 44-year-old migrant at Beitbridge border post with a consignment of Remington gold worth an estimated R14 million alleged to have been smuggled from Zimbabwe.",
            "time": "21:26",
            "date": "20 Jan 2025"
        },
        {
            "title": "SA mine disaster: illegal mining kingpin escapes from custody",
            "url": "https://www.herald.co.zw/sa-mine-disaster-illegal-mining-kingpin-escapes-from-custody/",
            "content": "Thupeyo Muleya\n\nBeitbridge Bureau\n\nSouth African police are tracking a Lesotho national, James Neo Tshoaeli commonly known as Tiger who escaped from custody soon after being rescued from a Stilfontein Mine in North West where a total of 87 people of different nationalities died.\n\nTiger is alleged to be the kingpin of illegal mining activities in the area who is alleged to have denied food to other miners underground until they died of starvation.\n\nHundreds of people have been rescued from the mine among them alleged Zimbabweans.\n\nAlready the Zimbabwean Embassy is on the ground to verify the number of its nationals who were rescued and those who may have died with a view to offer consular services.\n\nZimbabwes Ambassador to South Africa, Mr David Hamadziripi said in a statement last week that they may have to identify some of the deceased through the Deoxyribonucleic Acid (DNA) testing of relatives.\n\nIn a statement South Africas national police spokesperson, Brigadier Athlenda Mathe said the acting provincial commander, Commissioner of North West, Major General Patrick Asaneng has ordered maximum resources to be mobilised in finding an alleged kingpin who resurfaced from shaft 11 in Stilfontein last week.\n\nMajor General Asaneng has also warned that heads will roll once they find those officials that aided the kingpin to escape from police custody after resurfacing from shaft 11 last week, she said\n\nExtensive investigations and tracing operations are underway to find those officials who aided his escape between shaft 11 and the Stilfontein police holding cells.\n\nAccording to records, Tiger was never booked into various other stations where some illegal miners are being kept. Tiger is also not admitted at a local hospital for further medical care. The alleged kingpin and ringleader is a Lesotho national and according to records his name is James Neo Tshoaeli but is commonly known as Tiger.\n\nBrig Mathe added that Tiger was being fingered in several statements as one of the ring leaders who controlled operations underground.\n\nHe is also being accused by some illegal miners who resurfaced underground as him being allegedly responsible for some deaths, assault and torture that is alleged to have taken place according to videos in police possession.\n\nTiger is also alleged to have hoarded and kept food away from other illegal miners.\n\nMajor General Asaneng has expressed disappointment in what he terms as an embarrassment to the Vala Umgodi operation that has been running from December 2023.\n\nHe has vowed to ensure that those responsible for this escape from custody are brought to book and that suspect is found. Tiger is a fugitive of justice and is considered dangerous.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/tiger-680x380.jpg",
            "description": "South African police are tracking a Lesotho national, James Neo Tshoaeli commonly known as Tiger who escaped from custody soon after being rescued from a Stilfontein Mine in North West where a total of 87 people of different nationalities died.",
            "time": "21:26",
            "date": "20 Jan 2025"
        },
        {
            "title": "Unifreight negotiating a game changer transaction",
            "url": "https://www.herald.co.zw/unifreight-negotiating-a-game-changer-transaction/",
            "content": "Nqobile Bhebhe\n\nUNIFREIGHT Africa Limited, a logistics company, is negotiating a transaction that could significantly affect its financial position and share price amid indicationsit is considering establishing a new fourth-party logistics strategic business unit (SBU) as a revenue stream to subcontract its excess volumes.\n\nThe company has long stressed the importance of its expansion plans as part of its strategy to increase capacity and strengthen its regional market presence.\n\nIn its abbreviated financial results for the half-year ending June 30, 2024, chairperson, Peter Annesley, said the focus will remain on expanding cross-border operations and driving revenue growth through increased capacity and improved service offerings.\n\nWe are also exploring new revenue streams and opportunities to diversify our customer base further. This includes a new 4PL SBU (strategic business unit) which will sub-contract excess volume to 3rd party transporters in the region, he said then.\n\nA fourth-party logistics SBU is a specialised division within a company that provides comprehensive supply chain management solutions by coordinating and managing logistical services for the companys clients.\n\nPartnerships with major clients such as Delta, Unilever and Nestl have been instrumental in sustaining Unifreights growth.\n\nIn a cautionary statement, Company Secretary, Michael Mnemo, said the firm is involved in negotiations regarding a transaction which, if successfully concluded, may have a material impact on the companys financial position and share price.\n\nShareholders are advised that the Transaction remains subject to, among other things, the completion of due diligence, ongoing negotiations and any required regulatory and shareholder approvals.\n\nThere is no certainty at this stage that the Transaction will proceed or that it will be concluded on the terms proposed, he said.\n\nOn its 2024 third quarter trading update, the firm said it is well-poised to achieve commendable end-of-year results, driven by continued growth in cross-border operations and increased contributions from the 4PL unit.\n\nIt said the fourth quarter will focus on maximising fleet utilisation to take full advantage of the year end LTL surge in volume.\n\nAdditionally, it saidit anticipate that the fully operational 4PL division will play a crucial role in its growth, with new client contracts in place expected to keep the SBU busy, well into the new year.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Screenshot-4-680x380.png",
            "description": "Nqobile Bhebhe UNIFREIGHT Africa Limited, a logistics company, is negotiating a transaction that could significantly affect its financial position and share price amid indications it is considering establishing a new fourth-party logistics strategic business unit (SBU) as a revenue stream to subcontract its excess volumes. The company has long stressed the importance of its expansion plans […]",
            "time": "21:26",
            "date": "20 Jan 2025"
        },
        {
            "title": "Zim finishes second at ITF/CAT Zonals",
            "url": "https://www.herald.co.zw/zim-finishes-second-at-itf-cat-zonals/",
            "content": "Zimpapers Sports Hub\n\nThe Zimbabwe junior tennis team finished second behind South Africa at the just-ended ITF/CAT 16-and-Under and 14-and-Under tournament in Windhoek, Namibia.\n\nThe week-long tournament kicked off with the individual event before going into the team event that ended over the weekend.\n\nZimbabwe was represented in both age groups and the boys and girls teams made the finals in their respective age groups.\n\nHowever, they went down to South Africa to settle for second place. The 14-and-Under boys lost 2-0 with Joel Badza losing 0-6, 0-6 to Nicholas Kruger while Divine Kaliofasi lost 2-6, 6-7 (1) to Tristan Summers.\n\nIt was the same script for the girls as Emily George suffered a 1-6, 0-6 defeat at the hands of Lily Haley.\n\nHer teammate Rutendo Tom went down 2-6, 3-6 to Leago Dube, for Zimbabwe to go down 0-2.\n\nIn the 16-and-Under boys, Tendekai Msabaeka lost 2-6, 0-6 to Ethan Pieber and Noah Samushonga was beaten 6-1, 7-5 by Hlumani Kekana to lose the tie 0-2 to South Africa.\n\nOn the girls side, Zimbabwe lost 2-1 with Chanelle Zhuwakini losing 2-6, 6-7(6) to Roxy Bredenkamp while Simphiwe Malunguza had a good day on the court and beat Jenna Theron 6-4, 6-3.\n\nHowever, her efforts were not good enough as Malunguza and Zhuwakini went on to lose the doubles match 4-6, 5-7 to South Africas pair Bredenkamp and Theron.\n\nOther countries that took part were hosts Namibia who came third, Botswana, Madagascar, Mauritius, Lesotho, Mozambique, Angola and Eswatini.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Untitled-1-2-680x380.jpg",
            "description": "Zimpapers Sports Hub The Zimbabwe junior tennis team finished second behind South Africa at the just-ended ITF/CAT 16-and-Under and 14-and-Under tournament in Windhoek, Namibia. The week-long tournament kicked off with the individual event before going into the team event that ended over the weekend. Zimbabwe was represented in both age groups and the boys’ and […]",
            "time": "21:26",
            "date": "20 Jan 2025"
        },
        {
            "title": "DeMbare appoints Mablanyo as substantive coach",
            "url": "https://www.herald.co.zw/dembare-appoints-mablanyo-as-substantive-coach/",
            "content": "Zimpapers Sports Hub\n\nGiants\n\nDynamos have appointed Lloyd Mablanyo Chigowe as the clubs substantive head coach ahead of the 2025 season.\n\nChigowe has been holding fort in an acting capacity since August last year when the club parted ways with Genesis Mangombe.\n\nAlthough DeMbare stuttered to an eighth-place finish under his watch, Chigowe appeared to have earned the benefit of the doubt from the management after leading the team in its defence of the Chibuku Super Cup, which will enable them to participate in the CAF Confederation Cup again this year.\n\nThe 60-year-old gaffer has since started preparing for the coming season.\n\nDynamos Football Club is pleased to announce that Lloyd MaBlanyo Chigowe has been appointed as the substantive head coach ahead of the 2025 season, reads a statement from DeMbare, issued on Monday morning.\n\nChigowe had been the interim head coach since his appointment on August 5, 2024. Since then, the 60-year-old coach was in charge of 20 games in all competitions as the Glamour Boys finished the season on a high.\n\nThe club is expected to announce additional appointments to beef up Chigowes backroom staff.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2013/10/dembare.jpg",
            "description": "Zimpapers Sports Hub Giants Dynamos have appointed Lloyd “Mablanyo” Chigowe as the club’s substantive head coach ahead of the 2025 season. Chigowe has been holding fort in an acting capacity since August last year when the club parted ways with Genesis Mangombe. Although DeMbare stuttered to an eighth-place finish under his watch, Chigowe appeared to […]",
            "time": "21:26",
            "date": "20 Jan 2025"
        },
        {
            "title": "Police seized with murder cases",
            "url": "https://www.herald.co.zw/police-seized-with-murder-cases/",
            "content": "Crime Reporter\n\nThe body of a 40-year-old man, Lackius Murimi, was found floating in a Goromonzi dam with his hands tied with a rope.\n\nThere were two deep cuts on his head and police have since launched investigations into the case.\n\nNational police spokesperson, Commissioner Paul Nyathi confirmed the incident.\n\nPolice in Goromonzi are investigating circumstances surrounding a case of murder in which the body of Lackius Murimi was found floating in Shapiro Dam at Leicester Farm in Goromonzi on January 16, he said.\n\nMeanwhile, police in Gwanda are investigating another murder case in which Admire Tshuma died on his way to the hospital after he was found on January 17 in Gobatema, Guyu, with a deep cut on his forehead.\n\nIn another case, police in Guyu are investigating a case of murder in which Gladys Ndlovu (36) was found dead on January 18 in a bushy area in Lothe Village with multiple injuries all over her body.\n\nPolice are appealing to anyone with information that might assist in investigating these cases to contact the nearest police station.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Assistant-Commissioner-Paul-Nyathi.jpg",
            "description": "Crime Reporter The body of a 40-year-old man, Lackius Murimi, was found floating in a Goromonzi dam with his hands tied with a rope. There were two deep cuts on his head and police have since launched investigations into the case. National police spokesperson, Commissioner Paul Nyathi confirmed the incident. “Police in Goromonzi are investigating […]",
            "time": "21:26",
            "date": "20 Jan 2025"
        },
        {
            "title": "Zimpapers makes key senior executive appointments",
            "url": "https://www.herald.co.zw/zimpapers-makes-key-senior-executive-appointments/",
            "content": "Online Reporter\n\nThe Zimpapers board has announced the departure of chief executive officer, Mr Pikirayi Deketeke, the chief finance officer, Mr Farai Matanhire, and the chief marketing officer, Mr Tapuwa Mandimutsira following the expiry of their contracts.The three executives are now on leave while serving their notices of employment termination.\n\nThe Group Editorial Executive Mr William Chikoto has been appointed the acting chief executive officer while the groups financial controller, Mrs Annah Kufakunesu has been appointed acting chief finance officer.\n\nBoard chairperson, Mrs Doreen Sibanda said: We are grateful for the dedication and commitment shown by Mr Deketeke, Mr Matanhire, and Mr Mandimutsira over the years.\n\nAs they move on to new endeavours, we extend our heartfelt appreciation and best wishes for their future success.\n\nAs we bid farewell to these executives, we are committed to ensuring a smooth transition and continued success under new leadership.\n\nShe said Mr Chikoto is well-positioned to steer Zimpapers through this transition period due to his extensive experience and deep understanding of our business.\n\nOn Mrs Kufakunesu, Mrs Sibanda said she has a wealth of financial expertise and a proven track record of driving financial performance.\n\nWe are confident that her leadership will continue to uphold the high standards of financial management and strategic growth, Mrs Sibanda said.\n\nZimpapers is forging ahead with its digital transformation strategy and expanding its market presence to ensure sustained growth and innovation. Our commitment to leveraging cutting-edge technologies and enhancing customer experiences remains unwavering.\n\nWe are excited about the future prospects and the opportunities that lie ahead. We assure our stakeholders that the company is in capable hands and is poised for continued success.\n\nMr Deketeke was appointed CEO in April 2015 and has led the company through numerous milestones, which include diversifying the Zimpapers business from being a purely newspaper publishing and printing company to the integrated media group that it is now.\n\nUnder his leadership, Zimpapers solidified its position as a market leader and expanded its footprint into broadcasting with top brands such as Star FM and Diamond FM.\n\nIt also ventured into television by setting up the Zimpapers Television Network.\n\nHe has been with Zimpapers for 37 years and previously served as Editor of the Herald, Editor-in-Chief and Chief Operating Officer.\n\nMr Chikoto has previously served as Editor of the Herald and also Editor of The Sunday Mail, two of the groups flagship papers.\n\nHe is presently leading the groups newsroom transformation project, a cornerstone of the digital transformation programme.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/WhatsApp-Image-2025-01-20-at-13.37.51-680x380.jpeg",
            "description": "Online Reporter The Zimpapers board has announced the departure of chief executive officer, Mr Pikirayi Deketeke, the chief finance officer, Mr Farai Matanhire, and the chief marketing officer, Mr Tapuwa Mandimutsira following the expiry of their contracts. The three executives are now on leave while serving their notices of employment termination. The Group Editorial Executive […]",
            "time": "21:26",
            "date": "20 Jan 2025"
        },
        {
            "title": "Security guard attacked, robbed while on duty",
            "url": "https://www.herald.co.zw/security-guard-attacked-robbed-while-on-duty/",
            "content": "Crime Reporter\n\nA security guard was attacked by two suspects who robbed him of US$20 and pepper spray while he was on duty at a shop in Harares city centre.\n\nPolice have since arrested one of the suspects after he was apprehended by the public.\n\nNational police spokesperson Commissioner Paul Nyathi said, On January 16, police in Harare arrested Adson Mafizha aged 28 in connection with a robbery that occurred at a shop along Fidel Castro Road.\n\nThe suspect and his accomplice, only identified as Kheda, pounced at the shop and attacked a security guard who was on duty before stealing US$20 and pepper spray. The suspect was apprehended by the public after the security guard shouted for help.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/08/Untitled-169.jpg",
            "description": "Crime Reporter A security guard was attacked by two suspects who robbed him of US$20 and pepper spray while he was on duty at a shop in Harare’s city centre. Police have since arrested one of the suspects after he was apprehended by the public. National police spokesperson Commissioner Paul Nyathi said, “On January 16, […]",
            "time": "21:26",
            "date": "20 Jan 2025"
        }
    ]
}