{
    "news": [
        {
            "title": "President maintains he will not extend his term",
            "url": "https://www.herald.co.zw/president-maintains-he-will-not-extend-his-term/",
            "content": "Online Reporter\n\nPresident Mnangagwa has maintained that he will not seek to have his term of office, which ends in 2028, extended to 2030.\n\nThe President was speaking at State House in Harare today at an interface session with editors drawn from the public and private media.\n\nHe said that despite the efforts of those pushing to extend his term, he would make way for the party Zanu PF and the country to choose his successor.\n\nPresident Mnangagwa said those calling for the extension of his term were exercising their democratic rights but as a constitutionalist, he will still abide by the Constitution and duly leave after serving his mandatory two terms.\n\nAsked to respond to growing calls for him to extend his term, the President said:\n\nIts not imaginable that there is anybody in the country who can push me. I feel very uncomfortable. I am very solid. I have always said I am a constitutionalist, I have my two terms when they come to an end, the country and the party will move on by electing my successor.\n\nThe editors asked the President to pronounce himself if he would not be persuaded to remain in office beyond 2028, and he responded:\n\nI will persuade the persuaders not to persuade me so that I remain constitutional.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Screenshot-87-680x380.png",
            "description": "Online Reporter President Mnangagwa has maintained that he will not seek to have his term of office, which ends in 2028, extended to 2030. The President was speaking at State House in Harare today at an interface session with editors drawn from the public and private media. He said that despite the efforts of those […]",
            "time": "20:38",
            "date": "17 Feb 2025"
        },
        {
            "title": "Warriors to host Benin in Durban",
            "url": "https://www.herald.co.zw/warriors-to-host-benin-in-durban/",
            "content": "Tadious Manyepo\n\nSports Reporter\n\nTHE Warriors will host Benin in the 2026 World Cup home qualifier at the Moses Mabida Stadium in Durban, South Africa.\n\nZimbabwe has been without an approved venue to stage international games for the past 14 months.\n\nRenovations at the National Sports Stadium are ongoing but the ground is yet to meet CAF standards.\n\nZIFA has settled for the iconic Moses Mabhida Stadium after they were told venues in Polokwane, Johannesburg, and Cape Town were unavailable for March.\n\nThe match is set for March 20 and Zimbabwe will also play Nigeria away seven days later. ZIFA confirmed the development in a statement.\n\nThe Zimbabwe Football Association (ZIFA) is delighted to announce that the ZimbabweSenior Mens National Team, the Warriors, will play their Matchday 5, Group C, FIFA World Cup Qualifier against Benin at the iconic Moses Mabhida Stadium in Durban,\n\nSouth Africa.\n\nOriginally, ZIFA had planned to host this fixture in Polokwane; however, after it was allocated to Bafana Bafana in January, alternative venues had to be considered, read the statement.\n\nJohannesburgs approved stadiums were unavailable due to rugby and other events, while Cape Town Stadium is undergoing pitch renovations. After an extensive search,\n\nMoses Mabhida Stadium emerged as the perfect venue  a world-class facility that has hosted top international matches and offers ideal conditions for our playing style.\n\nZIFA is excited to bring the Warriors closer to their passionate supporters in Durban and across the region. We urge all Zimbabwean football fans to turn out in full force, paint the stands in yellow and green, and rally behind the team as they continue their quest\n\nfor World Cup qualification.\n\nThe match will kick off at 6pm with the cheapest ticket going for R50.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Warriors.jpg",
            "description": "Tadious Manyepo Sports Reporter THE Warriors will host Benin in the 2026 World Cup home qualifier at the Moses Mabida Stadium in Durban, South Africa. Zimbabwe has been without an approved venue to stage international games for the past 14 months. Renovations at the National Sports Stadium are ongoing but the ground is yet to […]",
            "time": "20:38",
            "date": "17 Feb 2025"
        },
        {
            "title": "Senior Police Conference underway",
            "url": "https://www.herald.co.zw/senior-police-conference-underway/",
            "content": "Crime Reporter\n\nSenior police officers are currently attending the 2025 Senior Officers Conference in Harare.\n\nDuring this one-week conference, the senior officers are supposed to come up with strategies to enhance the effective delivery of the ZRPs constitutional mandate.\n\nHome Affairs and Cultural Heritage Minister Kazembe Kazembe addressed the officers today (Monday).\n\nPolice commanders need to be well-informed so that they are ready to face the shifting sands on the policing terrain. I reaffirm my faith in the Commissioner General of Police, Mr Stephen Mutambas leadership capabilities and professional prowess.\n\nI have been following his exploits with keen interest and have noted that since his ascendancy to the helm of the Zimbabwe Republic Police, he hit the ground running in pursuing the goals and aspirations espoused in the ZRP Strategic Plan Document, Horizon 2025.\n\nI am thus convinced that as the nation embarks on the last lap of the journey towards Vision 2030 beginning in 2026, the Commissioner General will continue captaining the ship well. I am hopeful that through his leadership, the organisation will come up with a comprehensive strategic plan for the next five years.\n\nCommissioner General Mutamba said the workshop marks the beginning of training workshops that will be conducted at least twice a year at all levels across the organisation.\n\nI cannot overstate the significance of training in shaping the direction of the organisation, he said.\n\nI hope the commanders will find the exercise beneficial to their daily duties. I urge them to take a keen interest in the programmes so that we pull in the same direction.\n\nLet us share ideas and develop them for the betterment of our organisation.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/11/zrp.jpg",
            "description": "Crime Reporter Senior police officers are currently attending the 2025 Senior Officers’ Conference in Harare. During this one-week conference, the senior officers are supposed to come up with strategies to enhance the effective delivery of the ZRP’s constitutional mandate. Home Affairs and Cultural Heritage Minister Kazembe Kazembe addressed the officers today (Monday). “Police commanders need […]",
            "time": "20:38",
            "date": "17 Feb 2025"
        },
        {
            "title": "Harare’s Finance Committee views council properties, idle equipment",
            "url": "https://www.herald.co.zw/harares-finance-committee-views-council-properties-idle-equipment/",
            "content": "Diana Nherera\n\nSuburban Reporter\n\nThe City of Harare Finance and Development Committee today viewed several council properties that the local authority intends to lease out.\n\nCouncil spokesperson Mr Stanley Gama said the committees viewed council properties in Kuwadzana, Warren Park and several other areas.\n\nThey will sit down and come up with a deal. They are planning to partner a private player, he said.\n\nMr Gama said the Finance Committee intends to establish a new clinic in Dzivarasekwa.\n\nHe said last week the committee also went to see the citys idle equipment which shall be disposed.\n\nThe City of Harare wants to dispose of old idle equipment such as compactors\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/10/Stanley-Gama.jpg",
            "description": "Diana Nherera Suburban Reporter The City of Harare Finance and Development Committee today viewed several council properties that the local authority intends to lease out. Council spokesperson Mr Stanley Gama said the committees viewed council properties in Kuwadzana, Warren Park and several other areas. “They will sit down and come up with a deal. They […]",
            "time": "20:38",
            "date": "17 Feb 2025"
        },
        {
            "title": "Musasa Project supports women with disabilities",
            "url": "https://www.herald.co.zw/musasa-project-supports-women-with-disabilities/",
            "content": "Fungai Lupande\n\nMashonaland Central Bureau\n\nMusasa Project, a non-governmental organisation dedicated to combating gender-based violence, is working towards enhancing support for women and girls with disabilities in Bindura, Mt Darwin, and Muzarabani.\n\nThis initiative aims to address the intersecting forms of gender-based violence faced by marginalised women and girls with disabilities by enhancing their access to GBV services and information.\n\nDuring an inception meeting in Bindura, Mrs Shylet Muserere, the monitoring and evaluation manager, stated that the organisation will create safe spaces for women.\n\nThey will also establish mobile one-stop centres for support.\n\nShe emphasised that women and girls with disabilities are particularly vulnerable to gender-based violence due to various factors, including social isolation, dependence on caregivers, and limited access to support networks.\n\nThey often face increased risks of physical, sexual, and emotional abuse, as well as neglect. All this stems from stigma, discrimination, and insufficient legal protection, she explained.\n\nTheir disabilities may make it more difficult for them to report abuse or seek assistance. Therefore, they need to have access to GBV services that are inclusive, accessible, and tailored to their specific needs.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/hlyiuk-680x380.jpg",
            "description": "Fungai Lupande Mashonaland Central Bureau Musasa Project, a non-governmental organisation dedicated to combating gender-based violence, is working towards enhancing support for women and girls with disabilities in Bindura, Mt Darwin, and Muzarabani. This initiative aims to address the intersecting forms of gender-based violence faced by marginalised women and girls with disabilities by enhancing their access […]",
            "time": "20:38",
            "date": "17 Feb 2025"
        },
        {
            "title": "So, you are wondering, why cardboard boxes on injured persons?",
            "url": "https://www.herald.co.zw/so-you-are-wondering-why-cardboard-boxes-on-injured-persons/",
            "content": "(Zimpapers) Fact Checking Desk\n\nMANY Zimbabweans rely on social media platforms such as WhatsApp, Facebook and X for their news, exposing themselves to misinformation and biased sources. A recent social media frenzy centred around the use of cardboard boxes as makeshift plaster in first aid management following a tragic accident that claimed the lives of 25 people when an Urban Connect bus collided with a truck near the Lutumba tollgate along the Masvingo-Beitbridge highway.\n\nMajor talking point:The use of cardboard boxes on injured patients has sparked debate, with some experts defending the practice.\n\nIs there anything wrong with using cardboard box makeshift plasters?\n\nAccording to a Harare-based surgeon, it is common to use cardboard box slabs to immobilise an injured limb or suspected fracture during patient transportation or while waiting for X-rays.\n\nNo there isnt! This approach is widely accepted for immediate coverage of limbs in emergencies.\n\nResponding to Farai Maguwu on X, Australia-based medical practitioner, Thabisa Sibanda, cautioned against invading privacy when sharing images of patients with makeshift slabs.\n\nFirst, I wish to express my displeasure at the apparent invasion of privacy viz a viz this photo. Secondly may I offer a word of caution. This lady may be waiting for surgery and the surgeon felt no need to remove the prehospital makeshift slab in place.\n\nWhats the advantage of this? Does it work?\n\nIn emergencies where victims may be far from healthcare facilities, cardboard boxes are crucial to prevent further injury and stabilise fractures during transport. Community healthcare workers and first aid responders can easily utilise cardboard boxes to immobilise limbs and provide temporary support until patients receive proper medical care.\n\nVerdict:Using cardboard boxes for emergency handling of accident victims is cost-effective, widely accepted, and practical in Zimbabwe. These makeshift plasters help prevent further injury and facilitate the initial treatment of fractures before patients receive proper medical attention. Ultimately, patients will require a real plaster cast to hold the fracture in place while it heals, but cardboard boxes play a vital role in the initial stabilisation process.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Screenshot-88-680x380.png",
            "description": "(Zimpapers) Fact Checking Desk MANY Zimbabweans rely on social media platforms such as WhatsApp, Facebook and X for their news, exposing themselves to misinformation and biased sources. A recent social media frenzy centred around the use of cardboard boxes as makeshift plaster in first aid management following a tragic accident that claimed the lives of […]",
            "time": "20:38",
            "date": "17 Feb 2025"
        },
        {
            "title": "Zhombe businessman loses US$8 000 to bogus VID officer",
            "url": "https://www.herald.co.zw/zhombe-businessman-loses-us8-000-to-bogus-vid-officer/",
            "content": "Midlands Bureau\n\nA Zhombe businessman lost US$8 000 to a bogus VID officer who claimed to be in charge of disposing vehicles forfeited to the State.\n\nMidlands provincial police spokesperson, Inspector Emmanuel Mahoko said the police are investigating a series of fraud cases involving the suspect who is only identified as Mageza.\n\nInspector Mahoko said cases involving Mageza go back to July 2024.\n\nIn one of the cases, Mageza duped Honest Mahleka, a businessman based at Joel Business Centre in Zhombe.\n\nThe suspect convinced Mahleka that he was disposing a Toyota Hiace and a Nissan AD Van at a cost of $8 500, he said.\n\nInspector Mahoko said the complainant was instructed to deposit the money into various EcoCash accounts.\n\nSoon after the transactions were made, the suspect was no longer reachable. We are appealing for information that may assist in the investigation, he said.\n\nInspector Mahoko urged members of the public to do thorough background checks before making any payments.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/07/Inspector-Emmanuel-Mahoko.jpg",
            "description": "Midlands Bureau A Zhombe businessman lost US$8 000 to a bogus VID officer who claimed to be in charge of disposing vehicles forfeited to the State. Midlands provincial police spokesperson, Inspector Emmanuel Mahoko said the police are investigating a series of fraud cases involving the suspect who is only identified as Mageza. Inspector Mahoko said […]",
            "time": "20:38",
            "date": "17 Feb 2025"
        },
        {
            "title": "Businesses meet Parliament Budget Committee",
            "url": "https://www.herald.co.zw/businesses-meet-parliament-budget-committee/",
            "content": "Farirai Machivenyika\n\nSenior Reporter\n\nThe Parliamentary Portfolio Committee on Budget, Finance, Economic Development, and Investment Promotion is meeting various business organisations today to gather their views on the Monetary Policy Statement that was recently released by RBZ Governor, Dr John Mushayavanhu.\n\nThe organisations largely welcomed the stance on maintaining a tight monetary policy that has brought stability to the market.\n\nThey also acknowledged the de-dollarisation process that is being implemented by monetary authorities but urged them to set out clear milestones that need to be achieved towards that goal.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/a3ff43f0-e8d4-461f-899c-f6fb24118200-680x380.jpeg",
            "description": "Farirai Machivenyika Senior Reporter The Parliamentary Portfolio Committee on Budget, Finance, Economic Development, and Investment Promotion is meeting various business organisations today to gather their views on the Monetary Policy Statement that was recently released by RBZ Governor, Dr John Mushayavanhu. The organisations largely welcomed the stance on maintaining a tight monetary policy that has […]",
            "time": "20:38",
            "date": "17 Feb 2025"
        },
        {
            "title": "Artisanal miner buried alive in Murewa",
            "url": "https://www.herald.co.zw/artisanal-miner-buried-alive-in-murewa/",
            "content": "Victor Maphosa\n\nMashonaland East Bureau\n\nAn artisanal miner died in Murewa on Sunday after the tunnel he was working in at Jasperlite Services Private Limited Mine collapsed.\n\nPolice are yet to release the deceaseds name.\n\nReports are that the now-deceased and his colleague had dug for about four metres when the wall of the shaft collapsed.\n\nThe miner got trapped and his colleague reportedly called for help. The trapped miner was rescued and rushed to Murewa Hospital.\n\nHowever, he was pronounced dead on admission.\n\nPolice spokesperson for Mashonaland East, Inspector Simon Chazovachiyi confirmed the incident and said investigations are in progress.\n\nMeanwhile, efforts to locate three artisanal miners who were buried alive when a shaft collapsed in Makaha, Mudzi, are yet to resume after they were suspended due to heavy rains.\n\nThe trio was trapped on January 3 after they had entered the tunnel to prospect for gold.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Screenshot-89-680x380.png",
            "description": "Victor Maphosa Mashonaland East Bureau An artisanal miner died in Murewa on Sunday after the tunnel he was working in at Jasperlite Services Private Limited Mine collapsed. Police are yet to release the deceased’s name. Reports are that the now-deceased and his colleague had dug for about four metres when the wall of the shaft […]",
            "time": "20:38",
            "date": "17 Feb 2025"
        },
        {
            "title": "Beitbridge horror crash victims get additional help",
            "url": "https://www.herald.co.zw/beitbridge-horror-crash-victims-get-additional-help/",
            "content": "Thupeyo Muleya\n\nBeitbridge Bureau\n\nMore organisations have come in to support the Governments efforts in supporting the victims of the road accident that killed 25 people near the Lutumba tollgate last Thursday.\n\nThe accident happened when a Beitbridge-bound bus and a commercial lorry that was heading to Chirundu collided head-on.\n\nThe Government said the deceased would get State-assisted funerals, and most of them were buried over the weekend.\n\nEleven of the deceased were Beitbridge residents.\n\nDiscovery Ambulance Services has offered to transfer all those that need special medical attention in Harare.\n\nSo far, Discovery has taken four of the 29 people who were admitted at Beitbridge District Hospital to Harare.\n\nAccording to the practitioner in charge at Discovery Ambulance Services, Mr Elliot Chivige, the company will pay the victims medical bills.\n\nWe have decided to complement what is already being done by the Government. As an organisation we are offering to transport all those in need of special medical attention in Harare where we will pay all the medical bills and provide the consumables needed, he said.\n\nBeitbridge Mayor, Councillor Peter Pirato Mafuta and other stakeholders mobilised material support, including private ambulances.\n\nWe are grateful for the support we are receiving. A dark cloud is hovering over our heads following the death of 11 of our residents in that road accident, said Councillor Mafuta.\n\nThe Zimbabwe Passengers Transport Organisation (ZPTO) chairman, Dr Samson Nhanhanga also delivered US$11 000 to the Government to assist with the burial of the deceased.\n\nThe Insurance Council of Zimbabwe said it will also cover medical and funeral expenses, while the Traffic Safety Council of Zimbabwe has given an assortment of hampers to those hospitalised.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Screenshot-88-680x380.png",
            "description": "Thupeyo Muleya Beitbridge Bureau More organisations have come in to support the Government’s efforts in supporting the victims of the road accident that killed 25 people near the Lutumba tollgate last Thursday. The accident happened when a Beitbridge-bound bus and a commercial lorry that was heading to Chirundu collided head-on. The Government said the deceased […]",
            "time": "20:38",
            "date": "17 Feb 2025"
        }
    ]
}