{
    "news": [
        {
            "title": "‘Exploit new tech to foster social cohesion’",
            "url": "https://www.herald.co.zw/exploit-new-tech-to-foster-social-cohesion/",
            "content": "Blessings Chidakwa, Herald Reporter\n\nA Presidential Internet Scheme will be rolled out countrywide, with President Mnangagwa yesterday saying new technologies should be exploited for the benefit of fostering social cohesion, unity, peace, love and harmony.\n\nThe Presidential Internet Scheme, that will reach even the most marginalised areas, will result in basic social services such as schools, clinics, community centres and farmers benefiting from a digital society, leading to increased productivity.\n\nPresident Mnangagwa, however, took a swipe at rogue elements with a propensity of fuelling divisions in society through abusing the Internet, saying they will be punished.\n\nSpeaking at the launch of the Digitruck and Digital Skills Ambassador Programme at State House, the President said these were transformative initiatives designed to leap-frog the nation into digital excellence and inclusivity where every community was empowered to thrive in the global digital economy.\n\nHe urged the nation to embrace the National Digital Ambassadors project and other related programmes which have the potential to unlock opportunities for inclusion, e-governance, education, entrepreneurship and broad-based empowerment.\n\nTo bolster this effort, the Presidential Internet Programme will be launched and deploy technology such as Low Earth Orbit (LEO) satellite services across marginalised communities.\n\nThe e-enabling infrastructure will complement existing services to bring high-speed internet closer to villages, schools, clinics, and community centres, while empowering farmers and entrepreneurs, among other users, he said.\n\nPresident Mnangagwa called upon traditional leaders, as custodians of the rich national heritage, to rally communities to leverage the National Digital Ambassadors Programme and Presidential Internet Scheme to safeguard, preserve and promote the countrys culture, values and norms.\n\nCommunities across the country are called upon to use ICTs and related applications responsibly.\n\nThese new technologies must help foster social cohesion, unity, peace, love, and harmony, ultimately leading to a productive as well as connected digital society, he said.\n\nThose with the tendency of fuelling divisions among communities will be punished. I am pleased that the National Digital Ambassadors Programme has received significant support from our partners at Huawei. The generous donation and handover of a state-of-the-art mobile vehicle, the Digi-Truck, is welcome and commendable.\n\nPresident Mnangagwa said the Digi-truck will play a pivotal role in enabling citizens to be digitally literate and access online services.\n\nThe vehicle will traverse our provinces, delivering ICT training to the most remote areas. Going into the future, our goal to deploy adequate Digi-Trucks in all provinces must be realised.\n\nThis will see the transformation of our national highways and rural road networks into pathways of knowledge and ensure that geography and distance never limit opportunity, he said.\n\nAdded the President: We expect this programme to help bridge the rural-urban digital divide, to propel the growth of the economy, prosperity and a brighter future for all.\n\nPresident Mnangagwa cut the ribborn as he commissions digitruck during the launch of ditital skills ambassador programme and and commissioning of digitruck in Harare yesterday. Picture Justin Mutenda\n\nTurning to the young Digital Ambassadors President Mnangagwa urged them to be patriotic and focused drivers of transformation as well as sustainable socio-economic development of Zimbabwe.\n\nOne hundred digital ambassadors will be deployed in each province to deliver strategic and inclusive digital literacy training across the country, especially in marginalised communities.\n\nThese tech savvy ambassadors will serve as accelerators for the uptake of digital literacy, fostering innovation, and supporting local businesses, schools, and households in harnessing technology for development, he said.\n\nPresident Mnangagwa said the National Digital Ambassadors Programme is being launched a few days before the commemoration of the National Youth Day in Bulawayo.\n\nIt is a flagship initiative designed to equip our vibrant youth and the general community with cutting-edge ICT skills and tools. Under this programme, many of our young Zimbabweans will be trained as resident ICT experts within their communities.\n\nIn keeping with the Devolution Agenda, the National Digital Ambassadors Programme will help ensure that digital skills are devolved to every corner of Zimbabwe, leaving no one and no place behind, he said.\n\nPresident Mnangagwa said the need for e-services in Government Ministries, Departments and Agencies has now become an urgent necessity.\n\nMy Government has embarked on programmes and projects to promote the delivery of quality digital services, with noticeable progress in sectors such as justice, vital civil registration and immigration.\n\nWhile more efforts are being made, I challenge all our people to have the requisite digital skills to interface with the e-Government services at various levels, he said.\n\nPresident Mnangagwa and Information Communication Technology, Postal and Courier Services Minister Dr Tatenda Mavetera tour the digital lab truck during the launch of digital skills ambassador programme and and commissioning of digitruck in Harare yesterday. Picture Justin Mutenda\n\nPresident Mnangagwa said the countrys National Vision 2030 and National Development Strategy 1 documents embed digitalisation and Information Communication Technology as enabling tools for the promotion of digital economy, development and overall growth.\n\nHe said to guarantee that these goals are met, his administration made deliberate decisions to front load ICT, science and technology skills access spreading beyond institutions of higher learning starting at the pre and primary school levels.\n\nEmbrace this and other opportunities being facilitated by my Administration to become masters of your destinies as architects and implementers of our national development programmes.\n\nTo all stakeholders across various sectors of the economy, let us remain united and resilient, innovate relentlessly, while upholding our pledge to leave no one and no place behind, he said.\n\nThe President expressed gratitude for the excellent relations and partnerships that exist with the Peoples Republic of China and the United Arab Emirates who have partnered Zimbabwe on the noble initiatives.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/HE1-7.jpg",
            "description": "Blessings Chidakwa, Herald Reporter A Presidential Internet Scheme will be rolled out countrywide, with President Mnangagwa yesterday saying new technologies should be exploited for the benefit of fostering social cohesion, unity, peace, love and harmony. The Presidential Internet Scheme, that will reach even the most marginalised areas, will result in basic social services such as […]",
            "time": "09:28",
            "date": "20 Feb 2025"
        },
        {
            "title": "President swears in ministers, commissioners",
            "url": "https://www.herald.co.zw/president-swears-in-ministers-commissioners/",
            "content": "Zvamaida Murwira, Senior Reporter\n\nPresident Mnangagwa yesterday swore in Mashonaland East Provincial Affairs and Devolution Minister Advocate Itayi Ndudzo, two deputy ministers, and commissioners to sit on constitutional bodies.\n\nThe officials immediately committed themselves to working hard to achieve national development goals and Vision 2030.\n\nThose sworn in were Local Government and Public Works Deputy Minister responsible for Local Authorities and Traditional Leadership, Albert Mavunga, and Engineer Caleb Makwiranzou, who is Deputy Minister of Mines and Mining Development responsible for Oil and Gas Research including Strategic Minerals Exploration.\n\nThe President also swore in Chief Magistrate, Mrs Vongai Guwuriro, as a member of the Judicial Service Commission.\n\nCommissioner Addelis Sibutha, who has joined the Zimbabwe Human Rights Commission and Commissioner Ozias Machaya Hove, who will sit in the Zimbabwe Lands Commission, also took their oaths of office before the President.\n\nIn an interview after taking his oath, Eng Makwiranzou said he had done a lot of research and worked with several universities and hoped that the experience he got would give impetus to the Ministry of Mines and the country at large.\n\nHe said Zimbabwe needed to keep abreast with the several technological changes taking place.\n\nWell, I may have vast knowledge of gas and oil but this is a new position for me. Whenever you mine gas, it varies from area to area; you can only know the overall view of how to mine gas when we start work.\n\nI have ideas that I will gladly discuss with my minister, mining is changing, technology is changing. For example, on some of the mining dumps like copper, miners are going back to the dump and mining because technology has changed, said Eng Makwiranzou, who is the Mutoko North legislator.\n\nI am ready to take up the challenge and I am actually honoured because this is a new area in Zimbabwe. Yes, we have started exploration as a country and there is positive indication that there is oil and gas in Zimbabwe.\n\nThere are several sites where gas has been discovered and currently we have a big company Invictus; so we will be working with them.\n\nPresident Mnangagwa flanked by Chief Secretary to the President and Cabinet Dr Martin Rushwaya (fourth from right) and Minister Ziyambi Ziyambi (fourth from left) pose for a photo from left with Commissioner Adelis Sibutha, Deputy Minister Albert Mavunga, Provincial Minister Itayi Ndudzo, Deputy Minister Caleb Makwiranzou, Chief Magistrate Vongai Guwuriro and Commissioner Ozias Hove after swearing in at State House in Harare yesterday.  Picture: Believe Nyakudjara\n\nEng Makwiranzou has served in many University Councils including those of the Bindura University of Science Education, Midlands State University and the National University of Science and Technology.\n\nHe once served as president of the Zimbabwe Institute of Engineers and president of Zimbabwe Association of Consulting Engineers among other positions.\n\nIn addition to his engineering qualifications, he also holds a Doctor of Philosophy in Business Management from the University of Liverpool.\n\nDeputy Minister Mavunga said while he will have to learn the ropes at the Ministry, he will provide leadership and team work.\n\nFirstly I want to thank His Excellency the President of Zimbabwe for giving me an opportunity to serve as deputy minister. I will serve to the best of my ability.\n\nOn what to expect just give me a few days to settle but I hope to work closely with my boss at the Ministry. My strength is I will bring leadership and teamwork to drive the Ministry towards Vision 2030, said Deputy Minister Mavunga, who is Nketa legislator in Bulawayo.\n\nMinister Ndudzo said he felt humbled to take up greater national responsibility to serve Mashonaland East Province and Zimbabwe.\n\nI have taken another office to serve the people of Zimbabwe as mandated by His Excellency the President of Zimbabwe. I now have a greater responsibility to serve the people of Mashonaland East and Zimbabwe as a whole. So for me, it is an opportunity to serve, said Minister Ndudzo, who is also Wedza North legislator and a lawyer.\n\nChief Magistrate Guwuriro said she will work hard to deepen the administration of justice in the country.\n\nAs commissioner, one of the functions is to promote and facilitate a good environment where the judiciary operates, an environment that enhances its judicial independence, accountability to the people of Zimbabwe from whom we derive judiciary authority. My role will be to ensure that I foster such an environment in a manner that builds public confidence, she said.\n\nComm Hove said his role would be to join hands with his counterparts to enhance land productivity and proper management.\n\nIt requires that we do proper land management, not that we are not doing it, but my going there will be part of the team to improve and boost those inherent efficiencies. The objective is to deal with all the issues, the issue of title deeds, productivity; it is important that we utilise land productively, said Comm Hove.\n\nComm Sibutha said she will work hard to raise awareness on human rights issues as envisaged by the Constitution.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/MS1.jpg",
            "description": "Zvamaida Murwira, Senior Reporter President Mnangagwa yesterday swore in Mashonaland East Provincial Affairs and Devolution Minister Advocate Itayi Ndudzo, two deputy ministers, and commissioners to sit on constitutional bodies. The officials immediately committed themselves to working hard to achieve national development goals and Vision 2030. Those sworn in were Local Government and Public Works Deputy […]",
            "time": "09:28",
            "date": "20 Feb 2025"
        },
        {
            "title": "Harare splashes US$1,4m on non-existent property",
            "url": "https://www.herald.co.zw/harare-splashes-us14m-on-non-existent-property/",
            "content": "Blessings Chidakwa, Herald Reporter\n\nHarare City Councils Medical Aid Society bought a US$1,4 million property which it never took possession of before it was subsequently sold under unclear circumstances, but the municipality never got its money back.\n\nAccording to a forensic audit of Harare Municipal Medical Aid Society (HMMAS) dated August 11, 2023, several anomalies were obtained including overpricing and double payment of another property in Ruwa amounting to US$1,2 million.\n\nThe audit revealed that the medical aid society bought properties without obtaining title deeds, which has led to complications in tracing them.\n\nFurther, for some months the former chief executive officer personally collected money for members subscriptions from the City of Harare, but it was observed that US$246 500 was not received by the cashier.\n\nAccording to the audit report, there was an agreement of sale entered into by Everleigh Services Private Limited represented by AfrAsia Bank and HMMAS for the purchase of land held under Title Deed 11020/99.\n\nIt says the total value was US$1,7 million of which a deposit of US$1,4 million was paid.\n\nThe transaction took place on February 13, 2015.\n\nInvestigations showed that the board was informed that the property was held as security by the High Court for HMMAS for funds locked in Kingdom Bank.\n\nWe observed that despite the full payment having been made, it never became HMMAS property but instead, it was sold to Cheetah Express Logistics Private Limited on 22 July 2018.\n\nHMMAS suffered an actual prejudice of US$1,4 million and US$300 000 respectively. There are no records to show that the above transaction was reversed, and money receipted back into HMMAS accounts, reads the forensic audit.\n\nAccording to the audit, it was further noted that after HMMAS bought the property, a total of US$300 000 would have been required as conveyancing fees and stamp duty.\n\nThe audit said in any event, the US$300 000 presented to the board was way above normal fees for the transaction given that Capital Gains Tax was 4 percent of purchase price (US$1, 7 million) was US$68 000. Conveyancing fees were round 3 percent and a negligible figure for stamp duty.\n\nHMMAS recently came under for buying a 12-roomed house in Ruwa for a staggering US$1,2 million.\n\nThe forensic audit shows that according to the agreement of sale signed by both parties, the value of the building was US$700 000 which was paid in full including US$100 000 conveyancing fees paid into the Trust Account of Muza and Nyapadi Legal Practitioners.\n\nThe audit observed that the $100 000 was way above the stipulated expected conveyancing fees, which is 4 percent of the purchase price and should have been US$28 000.\n\nEven if duty stamps were to be paid at prevailing rates, the total sum would not have come to the US$100 000 paid.\n\nThe audit found that pursuant to the purchase of Fortress Hospital, more than US$700 000 was paid over and above the initial US$700 000 that was already paid through Kingdom Bank.\n\nAfter that, and without supporting documents, a sum of US$650 000 was stated and paid as payment for equipment. Whereas we observed that Briward Enterprises values the equipment that was there at the material time to be US$100 000, HMMAS was prejudiced to the sum of US$550 000.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Harare-Municipal-Medical-Aid-Society.jpg",
            "description": "Blessings Chidakwa, Herald Reporter Harare City Council’s Medical Aid Society bought a US$1,4 million property which it never took possession of before it was subsequently sold under unclear circumstances, but the municipality never got its money back. According to a forensic audit of Harare Municipal Medical Aid Society (HMMAS) dated August 11, 2023, several anomalies […]",
            "time": "09:28",
            "date": "20 Feb 2025"
        },
        {
            "title": "VP consoles Muchinguri, Kashiri families",
            "url": "https://www.herald.co.zw/vp-consoles-muchinguri-kashiri-families/",
            "content": "Mukudzei Chingwere in Mutare\n\nVice President Dr Constantino Chiwenga yesterday consoled the Muchinguri and Kashiri families following the death of Sekuru Leonard Mwatambandini Kashiri, the father-in-law to Zanu PF national Chairman and Minister of Defence Cde Oppah Muchinguri-Kashiri.\n\nSekuru Kashiri died on February 14, at the age of 103 and was buried in Mutare yesterday, with the Vice President, representing President Mnangagwa at the burial.\n\nAlso present at the funeral were Deputy President of the Senate Lieutenant General (Retired) Mike Nyambuya, Provincial Ministers Misheck Mugadza (Manicaland) and Mariam Chombo (Mashonaland West) among other senior Government officials and Zanu PF Politburo members.\n\nIn his address, VP Chiwenga emphasised the importance of remembering Sekuru Kashiri not only for his long life but also for his positive contributions to society.\n\nThe Vice President highlighted the significant architectural contributions of Sekuru Kashiri at St Faith Mission. Coincidentally it is the same school the VPs father attended.\n\nHe highlighted how Sekuru Kashiris work helped shape the schools infrastructure and several infrastructural projects in Manicaland leaving an enduring legacy that continues to benefit the community today.\n\nVP Chiwenga also acknowledged Sekuru Kashiris impactful role at Elise Gladhill High School, further emphasising the deep connections between the late builders contributions and the educational experiences of generations of students.\n\nI am here, representing the President of the Republic of Zimbabwe, Cde Dr Emmerson Dambudzo Mnangagwa, who is attending to other pressing Government commitments, said VP Chiwenga.\n\nUpon hearing of our National Chairman and Minister of Defences loss, the Presidium agreed that I should stand with the family.\n\nHowever, I want to emphasise that we are not mourning here, we are celebrating his life. During his early life, the late Sekuru Kashiri worked at St Faith Mission as a building instructor, teaching bricklaying and concreting.\n\nHe built most of the buildings we see today at the Anglican institution with his students in the 1960s. Sekuru Kashiri later transferred to Elise Gladhill High School in Mutare in the 1970s and continued working as a building instructor.\n\nHe went on to build many more buildings at this High School until his retirement in the 1990s, said the Vice President.\n\nVice President Chiwenga addresses mourners during the church service of the late Sekuru Leonard Mutambandini Kakashi father in-law to Minister of Defence, Honorable Oppah Muchinguri-Kashiri at Anglican Parish in Sakubva ,Mutare. Picture by Tinai Nyadzayo\n\nVP Chiwenga said Sekuru Kashiri was a passionate soccer player and continued playing soccer well after his retirement, saying it was through his passion for the sport that he remained fit and energetic.\n\nAntony as the first born learnt the virtues of love and keeping his wife and family well from Sekuru Kashiri, that is why we always see our Chairman Oppah Muchinguri-Kashiri smiling.\n\nI now urge you Reverend Kashiri, as the first-born and family to continue with Sekuru Kashiris legacy by guiding and leading the family in prayer and in love.\n\nVP Chiwenga also said this farming season might be a promising one with bountiful harvests expected across the regions following the good rains. He said the country is witnessing a transformation in the agricultural landscape, which is essential for national development.\n\nReverend Kashiri expressed special gratitude to his wife, Cde Muchinguri-Kashiri, for her unwavering love and care for the family.\n\nHis sentiments were echoed by the Kashiri family.\n\nVice President Chiwenga addresses mourners during the church service of the late Sekuru Leonard Mutambandini Kakashi father in-law to Minister of Defence, Honorable Oppah Muchinguri-Kashiri at Anglican Parish in Sakubva ,Mutare. Picture by Tinai Nyadzayo\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/OM1.jpg",
            "description": "Mukudzei Chingwere in Mutare Vice President Dr Constantino Chiwenga yesterday consoled the Muchinguri and Kashiri families following the death of Sekuru Leonard ‘Mwatambandini’ Kashiri, the father-in-law to Zanu PF national Chairman and Minister of Defence Cde Oppah Muchinguri-Kashiri. Sekuru Kashiri died on February 14, at the age of 103 and was buried in Mutare yesterday, […]",
            "time": "09:28",
            "date": "20 Feb 2025"
        },
        {
            "title": "‘Trade deals power national prosperity’",
            "url": "https://www.herald.co.zw/trade-deals-power-national-prosperity/",
            "content": "Mukudzei Chingwere, Herald Reporter\n\nThe Minister of Foreign Affairs and International Trade Professor Amon Murwira, has highlighted the crucial role of trade in driving national prosperity following the meetings held by President Mnangagwa on the sidelines of the recent African Unions 38th Ordinary Session.\n\nProf Murwira said Zimbabwe was a signatory to the African Continental Free Trade Area (AfCFTA), a pivotal platform aimed at boosting intra-African trade.\n\nThe Minister was speaking at Tuesdays post-Cabinet media briefing.\n\nHe elaborated on the recent Africa Prosperity Dialogue in Ghana, which focused on improving trade facilitation infrastructure, including transport and digital systems, to enhance economic collaboration across the continent.\n\nA countrys prosperity comes from trade, therefore as per our national objectives of making our country, with people that are happy and have a fulfilling life we have to trade, said Prof Murwira.\n\nZimbabwe is a member of is signatory to the AfCTA which is a platform for Africa to increase trade amongst itself.\n\nSo, the Africa Prosperity Dialogue that was held in Ghana was basically a trade facilitation dialogue, and its main focus was on trade facilitation infrastructure that is from roads to digital infrastructure, to unified payment systems to promote intra African trade.\n\nProf Murwira said the Presidents meeting with President Chapo emphasised the importance of increasing trade between the two countries and highlighted the strong relationship between the two neighbours that have stood the test of time.\n\nWhat is important now is that we move into economic cooperation as one of our key ways of cementing our relationship, said Prof Murwira.\n\nSo, the issue was to do with trade. We expect that this impetus by our leaders to say we should increase trade should spur our local production systems between Zimbabwe and Mozambique. In the meeting with the State Minister from UAE, the main discussion there was to increase trade between Zimbabwe and UAE, and you would know from statistics that UAE is the second trading largest partner with Zimbabwe after South Africa at this moment.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/02/Professor-Amon-Murwira.jpg",
            "description": "Mukudzei Chingwere, Herald Reporter The Minister of Foreign Affairs and International Trade Professor Amon Murwira, has highlighted the crucial role of trade in driving national prosperity following the meetings held by President Mnangagwa on the sidelines of the recent African Union’s 38th Ordinary Session. Prof Murwira said Zimbabwe was a signatory to the African Continental […]",
            "time": "09:28",
            "date": "20 Feb 2025"
        },
        {
            "title": "Zim has enough ARVs  for 6 months: Minister",
            "url": "https://www.herald.co.zw/zim-has-enough-arvs-for-6-months-minister/",
            "content": "Farirai Machivenyika, Senior Reporter\n\nZimbabwe has enough stock of anti-retro viral drugs for the coming six months, with procurement of further supplies to last up to the end of the year already in progress, Health and Child Care Minister Dr Douglas Mombeshora has said.\n\nHe said this in the National Assembly yesterday during question time.\n\nThe questions from legislators arose following the global suspension of development and humanitarian aid by United States President Donald Trump.\n\nThe US channelled most of the assistance through the US Agency for International Development, whose work has been scaled down by the Executive Order issued by the US leader.\n\nYesterday, Dr Mombeshora said Government was working to ensure that gains by the country in combating HIV and Aids were preserved.\n\nWe are doing everything to ensure that we dont reverse the gains we have made in the fight against HIV and Aids, he said.\n\nAs a matter of policy, we already have supplies of the ARVs for the next six months and procurement processes to get drugs that will last until the end of the year are already under way.\n\nDr Mombeshora added that even if the US government were to reverse its policy position, that will not affect the contingency measures adopted by Government.\n\nWe will soon come to this august House seeking your support for additional funding to ensure that there are no disruptions in the supply of the drugs, he said.\n\nThe Minister said 31 percent of the ARVs in the country were procured through US funding while rest were bought by Government through the National Aids Council and other development partners.\n\nZimbabwe achieved the 95-95-95 targets in 2022, aimed at ensuring that 95 percent of HIV positive people are aware of their status, 95 percent are on treatment and 95 percent of those on treatment have a suppressed viral load.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/09/Douglas-Mombeshora.jpg",
            "description": "Farirai Machivenyika, Senior Reporter Zimbabwe has enough stock of anti-retro viral drugs for the coming six months, with procurement of further supplies to last up to the end of the year already in progress, Health and Child Care Minister Dr Douglas Mombeshora has said. He said this in the National Assembly yesterday during question time. […]",
            "time": "09:28",
            "date": "20 Feb 2025"
        },
        {
            "title": "EDITORIAL COMMENT: Time to fix  Harare disaster",
            "url": "https://www.herald.co.zw/time-to-fix-harare-disaster/",
            "content": "The Commission of Inquiry into the governance of the affairs of the Harare City Council since 2017 has now finished taking oral evidence, although people can still send in written affidavits, and will now be sifting the large quantity of evidence it has gathered, checking facts, drawing conclusions and making recommendations.\n\nIt has had its term extended again, so it has the three months that will be needed to first tie down and make sense of all the evidence and then go for the harder job of working out how to fix the mess.\n\nWhen President Mnangagwa set up the commission last year, with retired judge Justice Maphios Cheda chairing a group of legal and local government experts, he was using his powers under the Commission of Inquiry Act because he and the country, and the residents of Harare in particular, wanted to know what had gone wrong, why it had gone wrong and what needed to be done to put the city back on course.\n\nBesides the general instructions to the commission, the President was keen to know what the swathe of private companies totally owned by the city council were doing; these include City Parking with its vast daily flow of revenue, Rufaro Marketing which is now a property company having ceased running beerhalls and bars, and the quarrying company that used to supply the stone for repairing and making roads.\n\nThe President was also keen to find out why the second largest entity in Zimbabwe after the central Government, and far larger than any private sector company, was using a financial system designed for small and medium businesses rather than a state-of-the-art enterprise resource planning system, with the Auditor General reports pressing the council to resume such a system after noting that large sums could simply not be accounted for.\n\nAll local authorities have to comply with the same laws of accounting of revenue and procurement as the Government and other public bodies.\n\nWhile the public hearings have seen a large number of allegations, with those called being invited to reply to allegations made against them and with trained lawyers asking questions as specific evidence was sought, the commission now needs to sort out just what was going on and how the strands of evidence are linked.\n\nThe commission is probably helped by the fact that many of those called were anxious to blame almost everybody else for the mess in the administration and the council, while making it clear that they themselves had just been doing their job and in some cases had opposed what was happening.\n\nThis sort of finger pointing often produced floods of information that allowed the commission to call in other witnesses and to build up the sort of precise questions it wanted to ask people like the acting town clerk and the mayor.\n\nMayor Councillor Jacob Mafume was in fact the last witness summoned by the commission, and his questioning was probably the longest, as by that stage a lot of detail had emerged and the commission wanted confirmation of some facts and explanations of others.\n\nClr Mafume was also keen to note that a wide range of events had taken place before he became mayor and he had been unable to reverse them.\n\nWe assume the commission may well want to confirm certain allegations, such as the claim by Clr Mafume that top executives were receiving a combined US$500 000 a month with the town clerk on a salary of US$27 000, rising to US$30 000 a month on additional perks.\n\nThe oddity is that this sort of pay was probably justified on the need to attract and retain top talent to run the city and that if it was not paid then the top executives would go elsewhere.\n\nThere are many residents who might query why the council was so keen to retain executives who had done so little in the way of their duties.\n\nMayor Mafume also brought up the problem, as several of his predecessors coming from the same opposition ranks have done before, that hardly any councillors have a professional, business or accounting background, with the chairperson of the audit committee, for example, having zero accounting qualifications.\n\nWith the technical background of commissioners, under a highly experienced judge with years of experience in sifting through complex evidence to find the truth, we are confident that the commission will be able to eventually lay bare the details of the mess and the degree of the disaster in the City of Harare, and just that will make its report a best seller.\n\nThe next stage will be what has to be done to put Harare City Council and its administration back on its feet.\n\nPart of the problem is the degree of autonomy that all local authorities, but in particular those with municipal status, have.\n\nA former temporary solution of an appointed commission to run the affairs of a city no longer exists.\n\nBut solutions are needed, perhaps using the Local Government Board for a start to find and appoint a top layer of leadership in the administration, rather than have almost everyone on suspension or acting.\n\nCertainly the competence of some of those in top jobs can be strongly questioned and replacement thus legally easier.\n\nThe complication of a succession of councils where hardly anyone has the sort of background to oversee the running of a major city is a harder problem, since the solution relies on voters insisting that people have to be qualified as a councillor before seeking power.\n\nThe city has faced very serious financial and other problems before when either the council or its administration failed badly, although the dual failure we see now is very rare, fortunately.\n\nYet there are probably a lot of council employees who know what they are doing and given reasonable leadership and resources would be able to provide excellent service, so it is not a total disaster.\n\nThe need is to provide that leadership in administration and on council and then get the resources, which exist, put to the correct use rather than filling five-star troughs for those who see the city as a source of wealth.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/09/Justice-Maphios-Cheda.jpg",
            "description": "The Commission of Inquiry into the governance of the affairs of the Harare City Council since 2017 has now finished taking oral evidence, although people can still send in written affidavits, and will now be sifting the large quantity of evidence it has gathered, checking facts, drawing conclusions and making recommendations. It has had its […]",
            "time": "09:28",
            "date": "20 Feb 2025"
        },
        {
            "title": "Margolis advises aspiring  entreprenuers to be focused",
            "url": "https://www.herald.co.zw/margolis-advises-aspiring-entreprenuers-to-be-focused/",
            "content": "Business Reporter\n\nRENOWNED businessman, Mr Stephen Margolis, has encouraged aspiring entrepreneurs to remain resilient and focused when establishing business ventures, saying the process is never easy, regardless of location or economic climate.\n\nThe prominent real estate and mining magnet revealed this while addressing budding entrepreneurs at the latest edition of the serial Venon Chamba Business Seminars held over the weekend.\n\nHe stressed that having the right attitude was a fundamental requirement to succeed as an entrepreneur.\n\nMr Margolis said the right attitude constituted resilience, adaptability, willingness to learn from failures, as well as a passion for innovation and growth.\n\nHe added that innovativeness was another key attribute needed to navigate the turbulent economic environment in the country.\n\nHe acknowledged that starting a business was a challenging endeavour globally, and Zimbabwe was no exception.\n\nThe businessman gave the example of the United States (US) where the success rate of start-ups is relatively low, with approximately 80 percent of the ventures failing.\n\nThis means only about 20 percent of startups in the US make it past the initial stages, a success he attributed to a strong work ethic and positive mindset.\n\nAccording to Mr Margolis, entrepreneurs must develop a strong mindset to navigate the inevitable challenges that arise when launching a new business and this includes being prepared to face setbacks, rejections and failures while maintaining the determination and perseverance needed to push forward.\n\nSo, the environment of starting a business is not always perfect anywhere in the world, but it takes the right attitude and personality to be a successful entrepreneur because it is you who has to say, how do I make it in this environment?\n\nThe environment is made difficult or easy by you, personally, I have been across the world, be it Singapore, India or Dubai. I tell you it is the same story. It is just starting and consistency that matters, said Mr Margolis.\n\nMr Margolis also lectured the entrepreneurs on the importance of prudent financial management, cautioning entrepreneurs against reckless spending and instead the need for continuous budget monitoring and strategic reinvestment in their businesses.\n\nHe stressed that entrepreneurs must adopt a disciplined approach to managing their finances, prioritising investments that drive growth, increase efficiency and enhance competitiveness.\n\nThe seasoned businessman emphasised that a common pitfall among start-ups was the tendency to indulge in premature spending, often before their businesses have even generated significant profits.\n\nHe highlighted that this reckless financial behaviour normally leads to a swift downfall, and many start-ups have unfortunately learned thehard way.\n\nSomeone will say now that I have a business. I want my children to go to a big school with money from that new small business, you take that money and the business collapses, but if you put that money into business and reinvest your business will expand.\n\nConvener of the meeting Pastor Venon Chamba said the valuable lessons shared by seasoned business leaders like Mr Margolis played a vital role in empowering the next generation of entrepreneurs.\n\nThey help young business leaders develop the necessary skills and knowledge to drive business success and achieve financial growth.\n\nInsights from experienced business actors like Mr Margolis are essential in motivating the next generation of business leaders, helping them to cultivate business expertise and financial growth, said Pastor Chamba.\n\nThe Venon Chamba Business Seminars have been growing over time and have hosted several reputable individuals including Mr Kenneth Sharpe, Dr Nigel Chanakira, Dr Chamu Chiwanza, Supa Mandiwanzira, Dr Douglas Mamvura, Mr Mudiwa Hood and Advocate Arthur Marara.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/ggnrnbrt-680x380.jpg",
            "description": "Business Reporter RENOWNED businessman, Mr Stephen Margolis, has encouraged aspiring entrepreneurs to remain resilient and focused when establishing business ventures, saying the process is never easy, regardless of location or economic climate. The prominent real estate and mining magnet revealed this while addressing budding entrepreneurs at the latest edition of the serial Venon Chamba Business […]",
            "time": "09:28",
            "date": "20 Feb 2025"
        },
        {
            "title": "Igniting the flame of patriotism: Empowering youth for a brighter future",
            "url": "https://www.herald.co.zw/igniting-the-flame-of-patriotism-empowering-youth-for-a-brighter-future/",
            "content": "Innocent Mujeri, Correspondent\n\nAs Bulawayo prepares to mark the National Youth Day tomorrow, we find ourselves at a pivotal moment in our nations journey.\n\nThis day is more than a calendar eventit is a call to action, a celebration of our future leaders, and a reminder of the importance of nurturing patriotism among our youth. In an era of rapid change, where global influences and local challenges coexist, instilling a sense of national pride and purpose in young citizens is not just desirableit is essential.\n\nPatriotism is often seen as a sentimental attachment to ones country. However, when directed constructively, it becomes a powerful force that motivates responsible citizenship, community involvement, and national development.\n\nFor our youth, the cultivation of patriotism means more than mere reverence for symbols or the recitation of national anthems; it represents an understanding of the sacrifices made by previous generations and a commitment to contributing positively to the development of the society.\n\nYoung people are the torch-bearers of tomorrow. Their energy, creativity, and innovative spirit drive economic progress, social change, and cultural enrichment.\n\nWhen imbued with patriotism, youths are more likely to embrace their responsibilities, challenge injustices, and work collaboratively to solve the issues facing our country. The National Youth Day, therefore, is a timely reminder that the future of our nation rests in the hands of a generation that is both proud of its heritage and determined to build on it.\n\nProgrammes, such as the now revived National Youth Service (NYS), have been instrumental in shaping the outlook of young people across the nation. These initiatives provide platforms for skills development, community service, and leadership training. By engaging youth in productive activities, the Government is not only investing in their personal growth but also in the broader socio-economic development of the country.\n\nThrough the NYS and other youth-centric programmes, young people are given opportunities to learn valuable trades, engage in volunteer work, and participate in community development projects. These experiences help cultivate a sense of purpose and belonging, while also teaching the values of hard work, responsibility, and service. As a result, the youth are less likely to be swayed by negative influences or fall prey to destructive ideologies propagated through globalisation.\n\nOne of the pressing concerns in todays world is the potential for unattended or neglected youth to be hijacked and manipulated by hostile elements.\n\nIn the absence of proper guidance, young people can become vulnerable targets for those seeking to exploit their idealism or disillusionment. Whether through extremist ideologies or criminal networks, the manipulation of youth poses a serious threat not only to individual lives but to national security and social harmony.\n\nThe lack of constructive engagement leaves a vacuum that can be exploited. Youth who feel marginalised or ignored are more likely to be drawn into radical movements or criminal activities, ultimately undermining the fabric of society. By celebrating the National Youth Day and reinforcing programmes like the NYS, the Government sends a clear message: every young citizen is valued, and their potential contributions to the nation are recognised.\n\nThis commitment acts as a safeguard against the recruitment of youth by malevolent forces, ensuring that they remain focused on positive endeavours that benefit the country as a whole.\n\nThe institution of the National Youth Day is a commendable initiative that deserves widespread recognition and support. It reflects Governments understanding of the central role that youth play in national development and its commitment to fostering an environment where young people can thrive. By dedicating a day to honour and empower the youth, the Government acknowledges that the progress of any nation is inextricably linked to the well-being and active participation of its younger generations.\n\nThis years theme, Empower Youth, Secure the Future, encapsulates the spirit of the celebration. The theme emphasises the importance of providing young people with the tools, opportunities, and support they need to become proactive and engaged citizens. It serves as both an inspiration and a reminder that the future is not something that happens to usit is something that we actively create, one thoughtful decision and positive action at a time.\n\nEmpower Youth, Secure the Future, is a theme that resonates deeply with the challenges and opportunities of our times. It underscores the necessity of unity in the face of adversity and highlights the role of youth as the architects of a more inclusive, just, and prosperous society. In a world where divisionswhether political, social, or economicare becoming more pronounced, fostering a spirit of togetherness is crucial.\n\nThis theme encourages youth to see beyond narrow self-interests and to embrace a broader vision of national development. It calls for the recognition that every citizen, regardless of background, has a role to play in shaping the destiny of the nation. By engaging in dialogue, participating in community projects, and upholding the values of integrity and mutual respect, young people can build bridges that span differences and foster social cohesion.\n\nA society that invests in its youth is one that invests in its future. When young people are equipped with the necessary skills and values, they become powerful agents of change who can contribute to economic development, innovation, and social progress.\n\nConversely, neglecting the needs and aspirations of the youth can lead to a host of social problems, including increased crime rates, radicalisation, and a general sense of disillusionment with the state of affairs.\n\nThe consequences of leaving youth unattended are far-reaching. Disengaged youth are more likely to succumb to negative influences, such as drug and substance abuse. Disengaged youth also become isolated, and even engage in activities that jeopardise national security. Some criminal, banditry and terrorist activities in Africa have been largely attributed to youth idleness.\n\nBy providing structured opportunities for growth and engagement, programmes like the NYS and celebrations, such as the National Youth Day, play a critical role in mitigating these risks. They offer a pathway to empowerment, ensuring that the energy and enthusiasm of young people are channelled into productive endeavours that benefit the entire nation.\n\nAs we celebrate the National Youth Day tomorrow, it is imperative that we view this occasion not as a solitary event, but as a catalyst for sustained action. The commitment to empowering youth and instilling patriotism must extend beyond a single day of festivities. It requires continuous support from government bodies, civil society organisations, and the community at large.\n\nParents, educators, and community leaders all have a role to play in reinforcing the values of patriotism and responsibility. Schools and universities should integrate civic education into their curricula, while community centres can host workshops and forums that encourage active dialogue about national issues. By creating a comprehensive network of support, we can ensure that our youth are well-prepared to face the challenges of the future and contribute meaningfully to the nations progress.\n\nIn conclusion, the National Youth Day to be hosted by Bulawayo is a moment of celebration and reflectiona time to honour the promise of our youth and reaffirm our collective commitment to their development.\n\nThe importance of instilling patriotism, fostering unity, and providing opportunities for constructive engagement cannot be overstated. Through government-led initiatives like the National Youth Service and the inspiring theme Empower Youth, Secure the Future, we are taking definitive steps towards securing a prosperous and harmonious future.\n\nLet us applaud the Government for its visionary approach and join hands as a community to nurture the potential of every young citizen. In doing so, we are not only safeguarding our nation against the pitfalls of neglect but also lighting the way for a future defined by unity, progress, and hope.\n\nThe National Youth Day is not just a celebrationit is a promise to our youth that their dreams, efforts, and contributions will always be at the heart of our national identity.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/youths.jpg",
            "description": "Innocent Mujeri, Correspondent As Bulawayo prepares to mark the National Youth Day tomorrow, we find ourselves at a pivotal moment in our nation’s journey. This day is more than a calendar event—it is a call to action, a celebration of our future leaders, and a reminder of the importance of nurturing patriotism among our youth. […]",
            "time": "09:28",
            "date": "20 Feb 2025"
        },
        {
            "title": "CZR says urgent action needed to save retailers",
            "url": "https://www.herald.co.zw/czr-says-urgent-action-needed-to-save-retailers/",
            "content": "Business Reporter\n\nThe Confederation of Zimbabwe Retailers (CZR) has called for urgent interventions to address challenges weighing down the countrys retail sector, which it said stood at a critical crossroads.\n\nCZR said the retail sector was battling several economic pressures, threatening its survival.\n\nDespite the challenges, CZR said the retail sector remained a key part of Zimbabwes economy, ensuring food security, employment and revenue collection.\n\nHowever, Reserve Bank of Zimbabwe Governor Dr John Mushayavanhu said the challenges in the countrys retail sector were not confined or entirely related to a difficult environment, but issues in some of the formal traders management systems and questionable decision-making.\n\nWhile some of the retailers are battling viability challenges, others appear to be thriving, lending credence to some of the central bank governors assertions.\n\nDr Mushayavanhu said this as he announced, during the presentation of the 2025 Monetary Policy Statement, the extension of the targeted trade facility to the retail sector to assist with working capital.\n\nThe facility, previously set aside for productive sectors, can now also be used to buy foreign currency on the interbank market.\n\nThe central bank announced several interventions to anchor the prevailing economic stability, amid a tight monetary policy stance, complementing measures announced in the 2025 National Budget late last year.\n\nDelivering a presentation on the state of affairs in the sector to the Tripartite Negotiating Forum Economic Cluster, CZR president Dr Denford Mutashu, in a statement read on his behalf by the lobby groups acting CEO Mr Innocent Marimo,said exchange rate distortions, rising informality, multiple taxes and restrictive policies had created an environment where compliance had become more difficult at a time informal businesses are gaining ground.\n\nIf urgent interventions are not implemented, we risk a complete collapse of the formal retail sector, leading to mass job losses, declining tax revenues and further economic instability, he said.\n\nDr Mutashu said shop closures were growing at a disturbing rate, with major supermarket chains and wholesalers either scaling down operations or shutting down completely due to an unsustainable business environment.\n\nThe high cost of compliance, excessive taxation, volatile exchange rates and an influx of unregulated informal competitors have left the formal retail sector struggling to remain viable.\n\nThe selective enforcement of financial regulations, coupled with an inconsistent monetary policy framework, has further eroded confidence, leading to disruptions in supply chains and liquidity shortages.\n\nDespite these challenges, the retail sector remains a vital pillar of Zimbabwes economy, and immediate interventions are required to stabilise and restore confidence in the industry, he said.\n\nDr Mutashu said CZR fully agreed with President Mnangagwas pronouncements during the first Cabinet meeting of 2025.\n\nThe President emphasised that permits and fees charges by regulatory entities should not be burdensome or prohibitive, but should be designed to facilitate growth of business enterprises.\n\nHe said the Presidents recognition of this challenge was a commendable step towards creating a more business-friendly environment.\n\nThe CZR strongly supports this commitment and urges the Government to follow through with tangible policy reforms that streamline licencing requirements, reduce bureaucratic hurdles and promote a simplified regulatory framework.\n\nBy reducing red tape and eliminating unnecessary costs, Zimbabwe can enhance its ease of doing business ranking, attract investment, and ensure that formal retailers and wholesalers thrive in a competitive market, said Dr Mutashu.\n\nPresenting the key challenges affecting the retail sector and the implications of certain policies, Dr Mutashu said since the introduction of the Zimbabwe Gold (ZiG) currency on April 5, 2024, the retail and wholesale sector had been at the forefront of its acceptance.\n\nMr Mutashu said the sector had made significant strides in integrating ZiG into their pricing structures, ensuring its circulation and usability among consumers.\n\nHowever, he said the strict regulatory controls imposed by the Exchange Control Act and the Financial Intelligence Unit (FIU) significantly limited the sectors ability to price competitively.\n\nFear of being found in breach of the exchange control regulations forced businesses to adopt conservative pricing models.\n\nCZR strongly urges the Government to fully liberalise the exchange rate, allowing retailers and wholesalers to price their goods in a manner that reflects market realities.\n\nThe controlled exchange rate mechanism has not only created distortions but has also made it difficult for businesses to restock efficiently.\n\nWithout full exchange rate liberalisation, the retail and wholesale sector will continue to struggle with profitability and sustainability, ultimately leading to further closures of businesses and reduced tax revenue for the government, he said.\n\nDr Mutashu said the explosive growth of the informal economy has become both a challenge and an opportunity, and while it reflects the resilience and entrepreneurial spirit of Zimbabweans, its unregulated expansion has led to rampant smuggling, tax evasion, and unfair competition.\n\nInformal traders operate outside the tax and regulatory framework, selling goods at significantly lower prices than formal retailers who are burdened by high taxes, rental costs and compliance fees.\n\nThe current policies are inadvertently rewarding informality at the expense of compliance because rather than punishing formal businesses with excessive taxation and restrictions, the Government should incentivise formalisation through a simplified presumptivetax model that encourages small businesses to transition into the formal economy, he said.\n\nHe added that a structured tax system should be introduced to gradually integrate informal businesses into the tax base, ensuring a level playing field for all market players.\n\nDr Mutashu said the cost and ease of doing business remained significant concerns for the retail and wholesale sector, with excessive regulatory requirements and licensing fees placing a heavy financial and administrative burden on businesses.\n\nHe said currently, for a supermarket to be fully compliant with all operational requirements, it must obtain and maintain over 30 different licenses and permits from various regulatory authorities.\n\nDr Mutashu said these included health and safety permits, trading licenses, environmental certifications, fire safety clearances, and several sector-specific approvals.\n\nThe sheer volume of these requirements not only increases the cost of doing business but also discourages investment and expansion, particularly for SMEs that struggle to meet compliance costs, he said.\n\nDr Mutashu also said the current route to market (RTM) policies in Zimbabwe, which mandate that even regular walk-in customers provide VAT registration and tax clearance certificates to access wholesale prices, are inadvertently creating barriers to competitiveness.\n\nHe said these stringent requirements, while aimed at enhancing value chain integrity and ensuring tax compliance, have led to operational challenges for wholesalers.\n\nThe necessity for all purchasers to furnish such documentation restricts the customer base, potentially reducing sales volumes and profitability for businesses operating within the formal economy.\n\nMoreover, these policies may inadvertently encourage informal trading activities, as smaller retailers and individual customers might seek alternative sources that do not impose such stringent requirements, thereby undermining the formal sectors market share.\n\nDr Mutashu said it is imperative to consider policy adjustments that balance the need for tax compliance with the realities of the business environment.\n\nOne such adjustment could be the replacement of the existing 5 percent withholding tax with an annual presumptive tax. This shift would simplify the tax regime, making it more manageable for SMEs and informal traders to comply, thereby broadening the tax base, he said.\n\nAdditionally, Dr Mutashu said mandating that all businesses obtain Taxpayer Identification Numbers (TINs) as a prerequisite for securing shop, trading, and liquor licenses would enhance the Zimbabwe Revenue Authoritys (ZIMRA) ability to monitor and track potential taxpayers effectively.\n\nSuch measures would not only promote a more inclusive and competitive market but also ensure that tax compliance is achievable without stifling business operations, he said.\n\nDr Mutashu said CZR had consistently advocated better alignment between monetary and fiscal policies, particularly regarding taxation on transactions, and the high Intermediated Money Transfer Tax (IMTT) continues to discourage the use of digital payment systems, pushing many businesses and consumers towards cash-based transactions.\n\nHe said CZR strongly pleads for the reduction of IMTT to 1 percent on US dollar transactions and its complete removal on ZiG transactions.\n\nThe dual-taxation system, where businesses already face VAT and other statutory obligations, makes IMTT an additional burden that reduces competitiveness.\n\nHe noted that eliminating IMTT on ZiG transactions would significantly boost financial inclusion, encourage formal business operations, and promote the broader adoption of electronic payment systems as well as confidence in the local currency.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/rhrhr-680x380.jpg",
            "description": "Business Reporter The Confederation of Zimbabwe Retailers (CZR) has called for urgent interventions to address challenges weighing down the country’s retail sector, which it said stood at a critical crossroads. CZR said the retail sector was battling several economic pressures, threatening its survival. Despite the challenges, CZR said the retail sector remained a key part […]",
            "time": "09:28",
            "date": "20 Feb 2025"
        }
    ]
}