{
    "news": [
        {
            "title": "‘Cultural creative industries nurture social cohesion’",
            "url": "https://www.herald.co.zw/cultural-creative-industries-nurture-social-cohesion/",
            "content": "Mukudzei Chingwere, Herald Reporter\n\nThe flames of independence were kept ablaze by music before and during the protracted liberation struggle in high-density suburbs like Mbare, Highfield, Makokoba, Mpopoma, Mtapa and Sakubva, among others, President Mnangagwa has said.\n\nHe was speaking at the presentation of gifts to Mbare Chimurenga Choir Groups on Boxing Day at State House.\n\nThe occasion was held to honour the Mbare Chimurenga Choir Groups contributions to Zimbabwes cultural and national identity.\n\nPresident Mnangagwa said cultural creative industries did not only promote economic development through various art forms, but also nurtured social cohesion and cultural identity.\n\nAs you are aware, the cultural creative industries play a vital role in society by fostering economic growth through creative outputs such as music, art, design, fashion and film, among others, said the President.\n\nThey also contribute significantly to social cohesion, cultural identity, innovation and individual well-being by nurturing creativity, expression and engagement within communities.\n\nHonouring the Mbare Chimurenga Choir Groups is appreciation, through them, of the many musicians and artists who continue to use their artistic talents to defend the gains of our Independence and advance our national development identity, image and culture.\n\nIt was in residential areas such as Mbare, Highfield, Makokoba, Mpopoma, Mtapa and Sakubva, among others, where the flames for Independence were kept ablaze before and during our protracted war of liberation, said President Mnangagwa.\n\nPresident Mnangagwa presents hampers to members of Mbare Chimurenga Choir groups while Minister of State for Harare Provincial Affairs and Devolution Charles Tawengwa looks on at State House on Thursday\n\nHe said through song and dance, young people were mobilised to go for military training and subsequently to fight for the freedom of the country.\n\nIn the post-Independence era, said President Mnangagwa, it is groups and musicians such as Mbare Chimurenga Choir Groups who used their exceptional talent to promote cultural diversity and rally younger generations around the various national development programmes.\n\nHe congratulated Mbare Chimurenga Choir Groups for the consistency with which they have utilised their musical talent for the good of the country and the ruling ZANU PF party.\n\nYour music with its educating lyrics is a symbol of the hope and resilience that inspires countless individuals to remain patriotic and safeguard our beloved nation, said President Mnangagwa.\n\nThe performance you have delivered over the years inculcates the values of unity, resilience and love. Your revolutionary spirit is a beacon of light and hope. It is also a reminder of our collective history, our shared struggles, as well as a celebration of our resilience and determination to build a better Zimbabwe.\n\nI applaud you for your current efforts and music compilations which highlight our ongoing national development agenda, vision, policies and programmes.\n\nThrough your efforts along with others in the creative cultural industries, the nation must remain galvanised towards the attainment of our vision of a prosperous and empowered upper-middle-income economy, said President Mnangagwa.\n\nMembers of Mbare Chimurenga Choir groups sing and dance after receiving hampers and awards\n\nThe President handed gifts to the choir and encouraged them to carry the message of love, unity and the need to accelerate development in the country, continue to uplift one another and embrace the values being nurtured by the Second Republic.\n\nGoing forward, I urge you to continue infusing the new crop of musicians, particularly the youth, into your groups, said President Mnangagwa.\n\nIt is equally important that you broaden the reach of your music, riding on the diversity of ICT platforms.As I hand over these gifts, we acknowledge the tireless efforts of every one of you.Your dedication to ZANU PF programmes is commendable and your performances have been a source of joy and entertainment for many, said President Mnangagwa.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/HE1-6.jpg",
            "description": "Mukudzei Chingwere, Herald Reporter The flames of independence were kept ablaze by music before and during the protracted liberation struggle in high-density suburbs like Mbare, Highfield, Makokoba, Mpopoma, Mtapa and Sakubva, among others, President Mnangagwa has said. He was speaking at the presentation of gifts to Mbare Chimurenga Choir Groups on Boxing Day at State […]",
            "time": "18:38",
            "date": "28 Dec 2024"
        },
        {
            "title": "77 perish, 401 injured in road accidents",
            "url": "https://www.herald.co.zw/77-perish-401-injured-in-road-accidents/",
            "content": "Crime Reporter\n\nAt least 77 people were killed while 401 others were injured in 1 211 road traffic accidents recorded countrywide between December 15 and yesterday.\n\nDuring the same period last year, 71 people were killed while 393 others were injured in 1 454 road accidents recorded.\n\nIn a statement, national police spokesperson Commissioner Paul Nyathi said, The Zimbabwe Republic Police has established that, some accidents are caused by fatigue and negligent conduct on the part of drivers. Most road traffic accidents involved private vehicles where either drivers or passengers perished. The only major road traffic accident involving public service vehicles was recorded on 22nd December 2024 where three buses collided and two people died.\n\nHe said on December 22, 2024, 106 road traffic accidents were recorded where seven people were killed while 38 people were injured.\n\nOn Christmas Day, 104 road traffic accidents were recorded where 13 people were killed while 16 others were injured. On December 26, 2024, 87 road traffic accidents were recorded where 11 people were killed while 40 people were injured.\n\nAccidents involving pedestrians trying to cross the roads have also been recorded. Drivers are urged to be observant, especially when approaching built-up areas or places frequented by the public including residential areas, Comm Nyathi said.\n\nMeanwhile, the Zimbabwe Republic Police has reiterated that drivers should avoid speeding and overtaking in circumstances that are clearly not safe to do so.\n\nAbove all, motorists are implored not to overload vehicles when travelling on the countrys roads. The public is advised to report errant drivers on the roads at any nearest police station or call National Complaints Desk number 0242 703631 WhatsApp on 0712 800 197.\n\nThe Zimbabwe Republic Police will continue to enforce all road rules and regulations without fear or favour. On the other hand, motorists are irnplored to be responsible and effectively contribute towards road safety in the country, Comm Nyathi said.\n\nThis week, The Zimbabwe Republic Police assured that they had adequately deployed on all major roads, residential areas, central business districts and places where people converge to make merry to ensure peace and order prevails.\n\nThere are heightened roadblocks, traffic blitzes, stop and searches, motorised and cycle patrols to curb crime and road traffic accidents.\n\nComm Paul Nyathi said police will ensure that the public will celebrate the holidays in a peaceful manner.\n\nHe also urged all stakeholders, who include transporters, to prioritise the safety and security of the public.\n\nThe police warned motorcyclists who are riding or moving on the roads without helmets, with some carrying passengers, that arrests will be effected and the law will take its course without fear or favour.\n\nPolice were also taking action on those engaging in drug and substance abuse, adding that as the public celebrates the cross-over into the New Year, individuals, institutions and businesspersons must adhere to provisions of the law on the use of fireworks, fire crackers and other gadgets that may disturb the safety and security of the people.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/08/Paul-Nyathi.jpg",
            "description": "Crime Reporter At least 77 people were killed while 401 others were injured in 1 211 road traffic accidents recorded countrywide between December 15 and yesterday. During the same period last year, 71 people were killed while 393 others were injured in 1 454 road accidents recorded. In a statement, national police spokesperson Commissioner Paul […]",
            "time": "18:38",
            "date": "28 Dec 2024"
        },
        {
            "title": "French firms happy doing business in Zim",
            "url": "https://www.herald.co.zw/french-firms-happy-doing-business-in-zim/",
            "content": "Gibson Nyikadzino, Herald Correspondent\n\nFRANCE is happy about the improving business and trade ties with Zimbabwe and will continue nurturing them to allow more cooperation between the two countries, French Ambassador to Zimbabwe, Paul-Bertrand Barets, has said.\n\nAmbassador Barets said relations between the two countries can still be improved a lot and developed, adding that French companies operating in Zimbabwe were happy with the environment.\n\nTrade statistics between the two countries are at US$83 million, which the ambassador said was modest when you think of the importance of the French economy and the importance of the Zimbabwean economy in Southern Africa .\n\nSo, there is a real room for improvement. I must say that I am a little bit optimistic as trade increased by more than 30 percent in 2023.\n\nAnd it is rather lively in the fields of mechanical equipment, transport vehicles that we export very much to Zimbabwe, and also you are exporting a lot of things to France, and it is a rather balanced trade relationship, which is also something nice and interesting for both our countries.\n\nThe engagement between President Mnangagwa and 16 French firms whose representatives visited Zimbabwe, the ambassador said, helped identify areas of cooperation and investment in business.\n\nAmbassador Barets said President Mnangagwa urged the two countries to improve their relationship in terms of economic trade.\n\nAs an investment destination, he said areas with potential to invest include infrastructure, water, logistics, transport, energy, and the services sectors.\n\nAmbassador Barets said French companies were satisfied to be operating in Zimbabwe.\n\nThey (French companies) have learned to navigate and to manoeuvre around the difficulties that may arise from challenging macro-economic and financial environments. They are rather satisfied to be here. They are doing good business, and this is a good example for the investors who would like to come.\n\nWe have been addressing the traditional, classical questions that are being raised by investors when they consider investing in Zimbabwe, such as currency stability, the possibility and the security related to the repatriation of benefits.\n\nFrench companies operating in Zimbabwe and the rest of Africa were not out there to come and make money and leave.\n\nIt is really to train the staff and to transfer knowledge, Ambassador Barets said.\n\nThe engagement and re-engagement drive championed by the Second Republic has been crucial in attracting foreign investment under the Zimbabwe is open for business policy.\n\nPolitical relations between Zimbabwe and many countries, mainly in the West, have also improved significantly on the back of the friend to all and enemy to none policy.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/10/Paul-Bertrand-Barets.jpg",
            "description": "Gibson Nyikadzino, Herald Correspondent FRANCE is happy about the improving business and trade ties with Zimbabwe and will continue nurturing them to allow more cooperation between the two countries, French Ambassador to Zimbabwe, Paul-Bertrand Barets, has said. Ambassador Barets said relations between the two countries “can still be improved a lot and developed”, adding that […]",
            "time": "18:38",
            "date": "28 Dec 2024"
        },
        {
            "title": "Angel in the Skies: Bulawayo welcomes air ambulance",
            "url": "https://www.herald.co.zw/angel-in-the-skies-bulawayo-welcomes-air-ambulance/",
            "content": "Sikhumbuzo Moyo\n\nBULAWAYO welcomed the first of two dedicated air ambulances from Helidrive Zimbabwe company yesterday, marking a significant boost to emergency medical services in Matabeleland region.\n\nThe state-of-the-art helicopter, destined for the United Bulawayo Hospitals (UBH), touched down at Joshua Mqabuko Nkomo International Airport shortly before 11 AM yesterday.\n\nThe crew, comprising four members, including Russian co-pilots Aleksander Rusanov and Denis Salikhov, arrived alongside the aircraft\n\nThe City of Bulawayo is expected to receive the second helicopter soon.\n\nThe two air medical rescue services helicopters will service the entire Matabeleland region and are expected to offer swift medical attention to victims of road traffic accidents, among other serious medical emergencies.\n\nRELATED STORIES\n\nThey are part of the six helicopters that will be deployed in four stations  Harare Metropolitan, Manicaland, Victoria Falls, and Bulawayo Metropolitan.\n\nThe helicopter will be based here in Bulawayo. This is a Presidential project and we are working on his instructions, said Rusanov.\n\nPresident Mnangagwa and his Government are modernising the health sector as part of deliberate efforts to create a modern, prosperous, and highly industrialised country by 2030.\n\nIn June, the President was in Russia where he scouted for investors to help set up the air ambulances.\n\nThe investor, Russian Helidrive Air Ambulance, swiftly came to Zimbabwe and is assisting in the setting up of an efficient air ambulance service manned by highly skilled medical doctors, nurses, engineers, dispatchers, and pilots.\n\nThe Air Ambulance service boasts a fleet of over 100 medical helicopters, dedicated to saving lives across the entire Russian territory for the past nine years.\n\nThe recruitment and training of local personnel was done in Harare in handling air medical services with the company recruiting 40 local pilots, 50 doctors, 100 nurses, 100 dispatchers, and 10 engineers.\n\nAir ambulances are primarily used to transport patients from inadequate levels of care to higher levels of care, or to take them home if unable to travel via commercial flights.\n\nThese specialised aircraft are designed to navigate geographical barriers and provide the same level of medical care available in an intensive care unit.\n\nAir ambulances are also sometimes necessary if a patient needs long-distance or emergency transport and is unable to use a commercial flight due to their medical condition.\n\nThese airborne ICUs are equipped with cutting-edge medical technology and manned by highly trained medical personnel, ready to manage a wide spectrum of medical emergencies en route to care facilities.\n\nThis unique combination of speed, access, and comprehensive care capabilities positions air ambulances as a critical component of emergency medical services worldwide.\n\nZimbabwe has recently embarked on a transformative journey in its healthcare sector with the launch of air ambulance services.\n\nThis initiative, spearheaded by the Government and supported by international partnerships, marks a significant milestone in improving emergency medical response and healthcare accessibility across the nation.\n\nThe air ambulance service in Zimbabwe officially took off in August 2024, coinciding with the 44th Southern African Development Community (SADC) summit.\n\nThe helicopters are equipped with advanced medical facilities and staffed by trained medical personnel, ensuring rapid and efficient medical transport for critically ill patients.\n\nOne of the first successful missions of the air ambulance service involved transporting a cardiac arrest patient from Chegutu to Harare.\n\nThis mission, which took only 20 minutes, significantly reduced the travel time compared to the two-hour road journey, adhering to the Golden Hour principle in emergency care.\n\nThis rapid response capability is crucial in saving lives, particularly in remote and underserved areas.\n\nWelcoming the arrival of the second air ambulance, Winos Dube, chairperson of the Bulawayo Residents Association (BURA), hailed it as a significant step forward in improving healthcare access for the citys residents.\n\nHowever, Dube stressed the importance of ensuring equitable access to these critical services, emphasising that the benefits of this vital resource must extend beyond the privileged few.\n\nWe applaud the Government and our President for the kind gesture, we however hope that every person who needs emergency medical attention will access this. It must not be based on ones position in society but generally, we are excited as its presence will indeed save lives, said Dube\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/AA1-1.jpg",
            "description": "Sikhumbuzo Moyo BULAWAYO welcomed the first of two dedicated air ambulances from Helidrive Zimbabwe company yesterday, marking a significant boost to emergency medical services in Matabeleland region. The state-of-the-art helicopter, destined for the United Bulawayo Hospitals (UBH), touched down at Joshua Mqabuko Nkomo International Airport shortly before 11 AM yesterday. The crew, comprising four members, […]",
            "time": "18:38",
            "date": "28 Dec 2024"
        },
        {
            "title": "Sadc representatives to  attend Thanksgiving service",
            "url": "https://www.herald.co.zw/sadc-representatives-to-attend-thanksgiving-service/",
            "content": "Nqobile Bhebhe\n\nThis years National Thanksgiving and Dedication Service, now in its eighth year, will take on a regional dimension with the attendance of representatives from all SADC member states.\n\nPresident Mnangagwa, the current SADC Chairperson, is set to preside over this significant event, which will be held tomorrow at the Zimbabwe International Trade Fair arena in Bulawayo.\n\nThe annual National Thanksgiving and Dedication Service, a cornerstone event since 2017, underscores Zimbabwes profound appreciation for divine guidance in its journey of progress and development.\n\nThis year, the service is anticipated to draw a diverse congregation from several denominations, united in gratitude for the peace, prosperity, and advancements that have graced the nation.\n\nInitiated by President Mnangagwa following the establishment of the Second Republic, the service has become an annual tradition, fostering a powerful platform for spiritual communion between the nations leadership and its people.\n\nThe event, a collaborative effort between the Faith for the Nation Campaign and the Zimbabwe Indigenous Interdenominational Council of Churches (ZIICC), provides a crucial space for believers to intercede for continued blessings and prosperity of Zimbabwe, recognising the vital role of faith in national advancement.\n\nRELATED STORY\n\nSpeaking toSaturdayChronicle yesterday, Shuvai Wutawunashe, a prominent gospel musician and member of the Faith for Nation campaign committee, said that the occasion served to express heartfelt gratitude to God for the numerous milestones achieved throughout the past year.\n\nSunday 29 December is a big day for the nation as we come together for the eighth National Dedication Service. It happens annually and the nation looks forward to the event.\n\nThe nation will come together with one voice, one heart, one mind to give thanks to God for all the milestones, achievements, and successes that have taken place in the past year, she said.\n\nThis years theme is Our Nation, Our Opportunity, celebrating the progress and acknowledging the potential for our country Zimbabwe.\n\nWutawunashe underscored the unique significance of this years event, highlighting that it coincides with President Mnangagwas tenure as the Chairperson of SADC.\n\nPresident Mnangagwa assumed this position in August.\n\nThis years service has an advantage in that our President, the chairman of SADC, will have many people from almost every SADC country. Its a wonderful opportunity for President Mnangagwa to make statements and share hopes for SADC, where he will lead us and many SADC members will be in attendance.\n\nWe will be having key musicians from SADC to celebrate the day and its not just for Zimbabwe, we have faith for Zimbabwe but also we have faith for the nations of SADC. Its a day for SADC as well.\n\nWutawunashe said that President Mnangagwa will lead the nation in prayer, offering thanksgiving for the blessings bestowed upon hardworking Zimbabwean families. This occasion also presents a unique opportunity for the President to dedicate national projects and personal endeavours to the Almighty.\n\nWutawunashe further underscored the profound significance of this interaction, underlining the importance of fostering a strong relationship between national leaders and the churches. She believes that dedicating oneself to God is essential for the spiritual and moral well-being of any nation.\n\nThis is an event that brings our national leaders, community leaders, from business and every sector of the nation including traditional leaders will be well represented. Every last Sunday of the year, Zimbabwe gives thanks for everything God has given us. We say Ebenezer.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/11/Untitled-80-3.jpg",
            "description": "Nqobile Bhebhe This year’s National Thanksgiving and Dedication Service, now in its eighth year, will take on a regional dimension with the attendance of representatives from all SADC member states. President Mnangagwa, the current SADC Chairperson, is set to preside over this significant event, which will be held tomorrow at the Zimbabwe International Trade Fair […]",
            "time": "18:38",
            "date": "28 Dec 2024"
        },
        {
            "title": "Chimombe, Mpofu bail hearing brought forward",
            "url": "https://www.herald.co.zw/chimombe-mpofu-bail-hearing-brought-forward/",
            "content": "Fidelis Munyoro, Chief Court Reporter\n\nThe embattled pair of Mike Chimombe and Moses Mpofu at the centre of the Presidential Goat Pass-On Scheme scandal will have their bail hearing on January 3, next year.\n\nThey are seeking bail under altered circumstances, as their legal saga continues.\n\nOriginally scheduled for January 17 next year, the bail hearing was hastily brought forward after the defence team alerted Judge President Mary Dube to a critical legal requirement that bail applications must be heard within 48 hours of filing, with appeals needing resolution within 96 hours.\n\nThis revelation set off a flurry of activity, culminating in the hearing being rescheduled for yesterday.\n\nHowever, the prosecution, unprepared to argue the matter, requested a postponement to January 3 to allow time for a comprehensive response.\n\nBoth sides agreed to the delay, setting the stage for further courtroom drama.\n\nAt the heart of this high-stakes case are allegations of fraud.\n\nChimombe and Mpofu stand charged with defrauding the Presidential Goat Pass-On Scheme of a staggering US$7,7 million.\n\nEarlier this month, their legal manoeuvres to halt proceedings and refer the case to the Constitutional Court were met with sharp criticism.\n\nJustice Pisirayi Kwenda dismissed their application outright, branding it as frivolous and vexatious.\n\nThe duo had argued that their arrest, detention, and pre-trial processes violated constitutional rights, necessitating intervention by the highest court in the land.\n\nBut Justice Kwenda saw the attempt as little more than a calculated effort to delay the inevitable trial, finding no legal merit in their claims.\n\nThis dismissal marked yet another twist in a case riddled with procedural wrangling.\n\nThe trial, initially set to commence in early October, was derailed by the defences Constitutional Court referral application.\n\nWith that hurdle now removed, the trial is set to begin on February 10 next year  though the possibility of further delays looms large.\n\nUndeterred by the High Courts ruling, the defence team is reportedly preparing a fresh, direct application to the Constitutional Court.\n\nTheir aim is to revisit the alleged constitutional violations, in the hope that the court will convene a panel to review their claims.\n\nShould the panel find merit in their arguments, the full bench of the Constitutional Court would hear the case, potentially pausing the trial proceedings once again.\n\nCentral to their defence is the assertion that justice cannot proceed until these constitutional grievances are fully addressed.\n\nYet, thus far, their arguments have failed to gain traction in the courts.\n\nAs the clock ticks toward the new hearing dates, the two find themselves locked in a precarious battle, balancing on the edge of legal technicalities and the public scrutiny.\n\nWhether the two will succeed in their quest for bail, or in their bid to halt the trial altogether, remains to be seen.\n\nFor now, the courtroom remains the stage for a battle as gripping as it is consequential.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/08/Moses-and-Mike-Chimombe.jpg",
            "description": "Fidelis Munyoro, Chief Court Reporter The embattled pair of Mike Chimombe and Moses Mpofu at the centre of the Presidential Goat Pass-On Scheme scandal will have their bail hearing on January 3, next year. They are seeking bail under altered circumstances, as their legal saga continues. Originally scheduled for January 17 next year, the bail […]",
            "time": "18:38",
            "date": "28 Dec 2024"
        },
        {
            "title": "EDITORIAL COMMENT: Football must be the winner in ZIFA polls",
            "url": "https://www.herald.co.zw/editorial-comment-football-must-be-the-winner-in-zifa-polls/",
            "content": "ELECTIONS by their nature and at any level of society, are a delicate process often characterised by controversy, mudslinging, contestations and a lot of jockeying.\n\nElections are emotional, too.\n\nThe intensity of those characteristics also varies with the kind of interest, which the elections in question, would have generated and the players involved in those polls.\n\nIt is not surprising that the watershed Zimbabwe Football Association (ZIFA) elections, scheduled for January 25, 2025, are some polls that have already attracted huge interest from among the prospective candidates, the electorate and the games other stakeholders.\n\nZIFAs Normalisation Committee led by Lincoln Mutasa, which has been administering the association, has been tasked by world football body FIFA to also double as the Electoral Committee for the purposes of next months poll.\n\nThis is because the Normalisation Committee has been handling the transitional period that local football has been undergoing since FIFA decided to lift the nearly two-year suspension they had imposed on Zimbabwe.\n\nStrikingly in this election, the first at the association since December 2018 when Felton Kamambo was ushered into office, the association, acting on the advice of both FIFA and the Sports and Recreation Commission, there has been a lot of emphasis and strict adherence to the electoral code which is being supported by the ethics and integrity checks.\n\nIn fact, the Normalisation Committee started the electoral process, being held under an amended constitution, by asking all aspirants to secure nominations from bona fide ZIFA affiliate members.\n\nThe build up to the elections then heightened with Mutasa on December 23 announcing the list of those aspirants whose candidature had passed the ethics and integrity check.\n\nIt was an onerous task in which some potential election heavyweights, who included legislator Farai Jere, Prophetic Healing Deliverance Ministries (PHD) founder and leader Prophet Walter Magaya, former legislator Temba Mliswa and ex-Warriors captain Benjani Mwaruwari were among those that fell by the wayside.\n\nAnd true to the letter and spirit of an election some of those who were ejected from the race such as Mliswa and Benjani have indicated that they are going to contest their disqualification. Well, that is their constitutional right.\n\nIn fact, Mutasa and his Electoral Committee have been under immense pressure during the candidate selection process and will likely continue to endure more pressure in the days leading up to January 25.\n\nCommendably for Mutasa and his colleagues Nyasha Sanyamandwe and Rosemary Mugadza, they have done their utmost best to deliver a fair and credible pre-election selection process.\n\nWhere they have been unsure, they have sought the guidance of respected legal brains and former Harare City Mayor Muchadeyi Masunda.\n\nMasunda, himself, is no stranger to, sport chairs the ZIFA Ethics and Integrity Committee.\n\nHe has previously been a member of the Switzerland-based Court of Arbitration for Sport (CAS).\n\nSo, after the pre-selection of candidates has been concluded, we now await a period of spirited campaigns by men and women seeking to be president, the two vice-presidents and the six ordinary board member positions that are available.\n\nThose who make it onto the board will be joined by the chairpersons of the Premier Soccer League (PSL) and the Womens Soccer League (WSL).\n\nWe believe that in all that will happen in the ZIFA elections campaign season and voting process, which has already been characterised by political skullduggery, it is FOOTBALL and not individuals, who will emerge the winner.\n\nZimbabwes flagship sport has already been through a lot and forgettable phase in the last three years.\n\nThe Government through the SRC has invested a lot into helping FIFA to normalise the situation and ZIFA as an institution cannot afford to regress.\n\nThus, this watershed election must at the end of it all, pave way for a quick healing process by all opposing candidates.\n\nSoon after the game heals from the wounds associated with any election, must come the more important transformation of ZIFA, with a lot of work awaiting the new president and his team.\n\nA transformation that will see the association respecting the Memorandum of Undertsanding (MOU) that ZIFA entered into with FIFA and the government through the SRC.\n\nZIFA also needs to win back the confidence of the athletes in this case the players, coaches, fans, Government, corporate partners and crucially to continue to receive the kind of goodwill the Normalisation Committee has been enjoying from the Confederation of African Football (CAF) and FIFA.\n\nWith a successful poll and a stable, viable post-election election era, ZIFA could be a model association which even FIFA could be proud of having assisted. FIFA have in some instances failed to find the desired results after appointing a Normalisation Committee, with problems persisting.\n\nIn other countries such as Namibia, FIFA had to appoint yet another Normalisation Committee.\n\nBut we believe members of the ZIFA Congress will rise above petty politics and eventually put football interests ahead of any egoist feelings.\n\nThe national teams fine run in the 2025 Africa Cup of Nations qualification campaign, and the decent runs by the womens and junior sides, have shown what our players are capable of achieving where there is some stability.\n\nThis why we will once again emphasis that the biggest winner from the election mad season should in fact be football.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/07/Lincoln-Mutasa.jpg",
            "description": "ELECTIONS by their nature and at any level of society, are a delicate process often characterised by controversy, mudslinging, contestations and a lot of jockeying. Elections are emotional, too. The intensity of those characteristics also varies with the kind of interest, which the elections in question, would have generated and the players involved in those […]",
            "time": "18:38",
            "date": "28 Dec 2024"
        },
        {
            "title": "Africa’s foreign policy must focus on continental needs",
            "url": "https://www.herald.co.zw/africas-foreign-policy-must-focus-on-continental-needs/",
            "content": "Jakkie Cilliers, Correspondent\n\nRather than seeking common African positions, prioritising Africas development and peace can provide a foundation for meaningful global influence.\n\nThe international order is being challenged by tensions between the global north or West and the emerging global south powers, particularly the BRICS+ group. In a divided world, major and middle powers from both sides are courting Africa, as seen in the many summit meetings and billion-dollar investment pledges.\n\nBut do these partnerships strengthen Africas position on the world stage as the African Union (AU) claims?\n\nOver 12 different Africa summits are now held with external partners  most recently with China and Indonesia. The September China-Africa summit saw a pledge US$50 billion to Africa over the next three years.\n\nIt follows the United States (US) pledge of US$55 billion over three years to shared priorities and the African Unions (AU) Agenda 2063. Japan has committed US$30 billion, and Russia has proposed several collaborative and consultative arrangements.\n\nPerhaps most important is Africas relationship with the European Union (EU). The last EU-African Union Summit in Brussels in 2022 agreed on a joint vision for a renewed partnership and investments of 150 billion.\n\nThe AU says such partnerships aim to enhance Africas international standing and global leverage. By prioritising these relationships, particularly with emerging powers such as Indonesia, Africa seeks to maximise its impact in international affairs.\n\nThere is little evidence that having more external partnerships has increased Africas agency.\n\nAccording to the AU, the proliferation of partnerships is evidence of Africas growing prominence in the global arena and its strategic approach to achieving continental objectives through multilateral cooperation.\n\nIn theory, having more partners gives Africa additional options to negotiate and choose from, thereby increasing its bargaining power, decision-making autonomy and flexibility in international relations.\n\nBut there is little evidence that these efforts have lessened external interference in Africa.\n\nFor example, the wave of coups in the Sahel region has led to an alliance between coup governments. The alliance is backed by security guarantees from Russia to establish the Confederation of Sahel States, which threatens both the AU and the Economic Community of West African States.\n\nSome argue that Africa has a unique opportunity to help shape a future world order, owing to its demography, critical minerals and importance in diplomatic and geopolitical alliances.\n\nIt could advocate for more equitable representation within its various partnerships and in key international institutions such as the United Nations (UN) Security Council. The multiplicity of engagements thus enhances Africas agency in global affairs.\n\nIn pursuit of a global system fit for the future, the AU could deploy its common African positions  for example, the Ezulwini Consensus and Sirte Declaration. These outline Africas stance on UN reform, including of the UN Security Council  demanding permanent representation with veto rights, increased non-permanent seats, and AU-led selection of African representatives.\n\nSuch documents illustrate Africas commitment to multilateralism while aiming to address historical injustices and ensure inclusive representation and meaningful participation in global governance structures.\n\nAfrica must focus on strengthening its institutions, resolving internal conflicts and building economic resilience\n\nHowever, given Africas diversity and complexity, common African positions are few and far between. Crafting them is often costly and laborious, and once set, they bring a rigidity to reform. They may also divert attention from Africas internal pressing peace and development priorities.\n\nRather than striving for continent-wide positions and action, an introspective strategy prioritising Africas development and peace would more effectively enhance the continents geopolitical agency. This should be complemented by a more strategic engagement with key partners.\n\nThe continent must focus on strengthening its own institutions, resolving internal conflicts and building economic resilience before committing significant resources to broader international issues where its interests are not at stake.\n\nBy addressing internal challenges first, Africa can develop a stronger foundation from which to exercise meaningful influence in global affairs and protect its strategic interests.\n\nA more pragmatic and dynamic approach is needed, where the multitude of external engagements complements the pursuit of domestic African peace and development.\n\nAfrica should commit to foreign policy support only on matters where its interests are directly at stake. It should pursue common positions on issues that hinder the continents ability to achieve peace and development.\n\nAfrica should commit to foreign policy support only on matters where its interests are directly at stake.\n\nThe Pan-African agenda should prioritise preventing new conflicts and responding timeously to ongoing wars in Sudan, Ethiopia, the Democratic Republic of the Congo, Libya and others. Reform of the World Bank and International Monetary Fund, and putting the World Trade Organisation into operation, directly impact Africas development priorities, and need continental action.\n\nPursuing global tax reform, reducing sovereign borrowing costs, addressing debt relief, pursuing simplified access to private capital and climate financing, and establishing common standards for infrastructure development are also crucial. These targets are realistic and can better meet peoples needs.\n\nAs part of a strategic foreign policy aimed at the future, African states should agree on a standardised set of transparency and project execution guidelines that are uniformly applicable to foreign investors and countries operating in Africa. These criteria must encompass public consultations and sustainability benchmarks. The requirements should be clear, simple and publicly available  as all subsequent agreements should be.\n\nThe AU should lead the development of a binding legal protocol that spells out these requirements, followed by domestic enactment and implementation. Strict regulatory and enforcement mechanisms should accompany such a protocol, which should govern all foreign investment and sovereign loan agreements in Africa.\n\nInitiatives such as reforming African and international peace and security architectures and implementing the African Continental Free Trade Area and Agenda 2063 should be prioritised. With these clear priorities, Africa can forge specific beneficial partnerships while removing requirements that constrain African agency, ultimately contributing to a more inclusive and stable international order. ISS\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/07/3007-1-1-NEW-AFCFTA-LOGO.jpg",
            "description": "Jakkie Cilliers, Correspondent Rather than seeking common African positions, prioritising Africa’s development and peace can provide a foundation for meaningful global influence. The international order is being challenged by tensions between the global north or West and the emerging global south powers, particularly the BRICS+ group. In a divided world, major and middle powers from […]",
            "time": "18:38",
            "date": "28 Dec 2024"
        },
        {
            "title": "Chevrons break Test records",
            "url": "https://www.herald.co.zw/chevrons-break-test-records/",
            "content": "Brandon Moyo, Zimpapers Sports Hub\n\nLED by three centurions, Zimbabwe broke records on Day Two of the historic Boxing Day Test against Afghanistan at Queens Sports Club in Bulawayo.\n\nThe Chevrons began Day Two on 363/4 and ended their innings on a mammoth 586 runs from 135.2 overs.\n\nThe 586 runs scored over the five sessions of batting became their highest ever total in Test cricket, surpassing the previous best of 563/9 (declared) against the West Indies in Harare in 2001.\n\nFor the first time in Test history, Zimbabwe had three players score centuries in the same innings.\n\nSean Williams, captain Craig Ervine, and young Brian Bennett were the key contributors, leading Zimbabwe to their highest total in red-ball cricket.\n\nWilliams resumed day two on 145 runs, while Ervine was on 56.\n\nThe hometown hero, Williams, went on to score a career-best 154 runs from 174 balls.\n\nFollowing his departure, Bennett came in to bat at number seven.\n\nErvine reached his fourth Test century in the 109th over, taking 167 balls to bring up three figures.\n\nIt was his first century in four years, his last being 107 runs against Bangladesh in Mirpur in 2020.\n\nThe captain fell soon after his milestone, falling for 104 runs off 176 balls.Two balls later, Brandon Mavuta was bowled for a duck, leaving Zimbabwe on 465/7 in 110.3 overs.\n\nAt that point, Bennett was on 42 runs, closing in on his maiden Test half-century.\n\nHe was joined by debutant Newman Nyamhuri, who chipped in with 26 runs off 38 balls.\n\nBennett soon found himself running out of partners as tail-enders fell at the other end.\n\nWhen Muzarabani walked back to the pavilion, Bennett was on 78, and he managed to hold on, with another debutant, Trevor Gwandu, batting at number 11.\n\nZimbabwe passed their highest Test score in the 134th over, when they reached 566/9, with Bennett needing four more runs to bring up his century.\n\nHe achieved the milestone with a six, though the shot nearly resulted in his dismissal.\n\nThe fielder managed to catch Bennetts pull shot but stepped on the boundary rope while holding onto the ball.\n\nBennetts brilliant innings included five fours, four sixes, 39 singles, and 11 twos.\n\nAt 21, he became the second-youngest player to score a Test century for Zimbabwe, behind only Hamilton Masakadza, who achieved the feat at 17.\n\nBennett finished on an unbeaten 110 runs off 124 balls.\n\nAfghanistans debutant AM Ghazanfar was the pick of the bowlers, finishing with figures of 3/127 from 30.2 overs, while Naveed Zadran, Zahir Khan, and Zia-ur-Rehman took two wickets apiece.\n\nFollowing Zimbabwes innings, there was a slight rain delay, but play resumed promptly after an early tea.\n\nThe Chevrons made a brilliant start with the ball, as Gwandu picked up his maiden Test wicket, dismissing Sediqullah Atal for three runs off six balls leaving the visitors on 3/1 in 1.5 overs.\n\nAt stumps, Afghanistan were on 95/2 from 30 overs, trailing by 491 runs.\n\nMuzarabani had claimed the other wicket, dismissing Abdul Malik for 23 runs off 55 balls.\n\nBad light forced play to be called off with nine overs remaining in the day.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Chevrons-3.jpg",
            "description": "Brandon Moyo, Zimpapers Sports Hub LED by three centurions, Zimbabwe broke records on Day Two of the historic Boxing Day Test against Afghanistan at Queens Sports Club in Bulawayo. The Chevrons began Day Two on 363/4 and ended their innings on a mammoth 586 runs from 135.2 overs. The 586 runs scored over the five […]",
            "time": "18:38",
            "date": "28 Dec 2024"
        },
        {
            "title": "Hwange student awarded prestigious Rhodes scholarship",
            "url": "https://www.herald.co.zw/hwange-student-awarded-prestigious-rhodes-scholarship/",
            "content": "Nqobile Tshili, Bulawayo Bureau\n\nVICTORIA Mudyanembwa, a brilliant young student from the rural heartland of Lukosi in Hwange District, who just earned a first class honours degree from the University of Zimbabwe in Pharmaceutical Chemistry as the top student in her year, is now moving to Oxford University for a post-graduate degree on the prestigious Rhodes scholarship.\n\nMs Mudyanembwa, the inaugural president of the Pharmaceutical Chemistry Society of Zimbabwe, won the sole Rhodes Scholarship for Zimbabwe for next year. Zimbabwe and Zambia share three of these scholarships each year and alternate between one and two each. Ms Mudyanembwa will join a cohort of exceptional scholars from around the world.\n\nIn 2018, Ms Mudyanembwa earned the Joshua Mqabuko Nkomo Scholarship to attend the University of Zimbabwe after she left Marist Brothers Dete High School in Hwange so her high-level promise has been recognised for many years. She will be heading to the University of Oxford in September 2025 to join a cohort of more than 100 scholars from across the globe, undertaking postgraduate studies on a full scholarship with travel and liviing expenses included.\n\nIn a statement, the Rhodes Scholarship national secretary of Zimbabwe, Mr Dalumuzi Mhlanga, confirmed Ms Mudyanembwas selection, noting that she joins an elite group of Zimbabweans who have benefited from the same scholarship.\n\nMr Mhlanga highlighted that she overcame stiff competition to secure the only slot available for studies starting next year.\n\nWhen the committee meets every year to select Rhodes Scholars, we are always amazed by the abundance of bright, driven, and capable young people in Zimbabwe. This year the selection committee made the difficult decision to award the only scholarship to Victoria Mudyanembwa, which speaks to the very high bar that the scholarships criteria demand of both candidates and selectors in their consideration and evaluation.\n\nWe hope this encourages young Zimbabweans and candidates, in particular, to consistently excel across all the varied key pillars of the criteria, which cover academics, character, leadership, and service, much like Victoria has done, said Mr Mhlanga\n\nNotable past winners of the scholarship include former Deputy Prime Minister Professor Arthur Mutambara.\n\nMs Mudyanembwa expressed her gratitude for being selected for the prestigious scholarship.\n\nI am overwhelmed with gratitude to be named a Rhodes Scholar-elect. This is an extraordinary honour, and I am deeply humbled to be part of such a prestigious community.\n\nI am indebted to my family, friends, mentors, and supervisors, whose unwavering support has been instrumental in my journey. With this scholarship, I am excited to embark on a new chapter in my life. I am eager to contribute to the global community, to learn from brilliant minds, and to make a positive impact on the world, said Ms Mudyanembwa.\n\nIn furthering her studies, she aims to leverage new technologies to explore complex biology and medicine, with a particular focus on better understanding how indigenous traditional medicine can be made widely available, safely, and cost-effectively.\n\nMr Mhlanga announced that the next applications will open on 1 June 2025, encouraging brilliant Zimbabweans to apply.\n\nEach year, the selection committee looks forward to engaging with remarkable young Zimbabweans of all backgrounds across gender, race, and academic discipline, from both local and international universities. It is our young people who continue to fly the Zimbabwean flag high as they seek to drive progressive change in their fields of study and in the communities and spaces where they find themselves, said Mr Mhlanga.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Victoria-Mudyanembwa.jpg",
            "description": "Nqobile Tshili, Bulawayo Bureau VICTORIA Mudyanembwa, a brilliant young student from the rural heartland of Lukosi in Hwange District, who just earned a first class honours degree from the University of Zimbabwe in Pharmaceutical Chemistry as the top student in her year, is now moving to Oxford University for a post-graduate degree on the prestigious […]",
            "time": "18:38",
            "date": "28 Dec 2024"
        }
    ]
}