{
    "news": [
        {
            "title": "All set for Uhuru children’s party",
            "url": "https://www.herald.co.zw/all-set-for-uhuru-childrens-party/",
            "content": "Herald Reporters\n\nALL is set for the countrys 45th Independence Day celebrations at Nembudziya Growth Point in Gokwe, Local Government and Public Works Minister Daniel Garwe has said.\n\nThis comes as Midlands Provincial Affairs and Devolution Minister Owen Ncube donated 70 cattle for the festivities which will be held under the theme Zim@45: Devolve and Develop Together towards Vision 2030.\n\nSaid Minister Garwe: As we speak, the facilities are 100 percent complete. We have done some inspections and we are ready to go.\n\nPreparations for President Mnangagwa and First Lady Dr Auxillia Mnangagwa to host 3 050 child delegates at the Childrens Party scheduled for Nyamuroro High School tomorrow have also been completed, with children starting to arrive today.\n\nProvinces have already selected their child delegates to attend the annual Childrens Party which precedes the 45th main Independence celebrations to be held at Mutora Open Grounds at Nembudziya Growth Point in Gokwe.\n\nMinister Ncube yesterday said all modalities were in place for the two major events.\n\nWe are ready to host Independence celebrations. As for the Childrens Party, the children will start arriving tomorrow (today), he said.\n\nHe said those who fail to make it to Nembudziya, will celebrate the day in their respective wards in Gokwe Kana Constituency.\n\nAddressing villagers and Zanu PF members, the minister emphasised the significance of respecting veterans of the liberation struggle.\n\nHe reminded attendees that Zimbabwes freedom was achieved through sacrifices made by the countrys sons and daughters who fought against imperialism.\n\nI am here to donate 70 cattle to you so that you celebrate the 45th Independence Day eating and drinking as you are reminded of the great sacrifices done by the gallant sons and daughters of the country who participated in the war of liberation, he said.\n\nMinister Ncube encouraged war veterans to participate in the Independence celebrations in Nembudziya, presided over by President Mnangagwa.\n\nHe said hosting the celebrations had brought many development projects to Gokwe North District.\n\nSeveral development projects are underway in Gokwe North, including the construction of roads with major road upgrade projects nearing completion, such as the Gunguhwe Bridge, he said.\n\nMinister Ncube said computer laboratories, new classroom blocks, as well as renovation of existing ones have been completed at different schools such as Nyamuroro Primary School.\n\nA mortuary has been constructed at Nembudziya District Hospital, with renovations and the VIP ward complete.\n\nPresidential solar-powered boreholes have been drilled so that there is constant supply of clean and safe water for the people and their livestock. The celebrations have also led to employment opportunities for over 800 youths and women. So, I encourage you all to preach unity, peace and development, aligning with the Governments vision for a prosperous Zimbabwe in line with Vision 2030, he said.\n\nKey milestones ahead of the celebrations include the completion of the football pitch, terraces and the construction of ablution facilities, classrooms and changing rooms at the main arena at the Open Grounds.\n\nFootball pitch, lawn planting is 100 percent complete. Topsoiling and levelling of bumpy areas on the pitch is in progress. Outstanding works include ground marking and installations of dugouts and goal posts.\n\nAt Nyamuroro Vocational Training Centre a female hostel has been constructed as well as ablution and administration blocks.\n\nSeptic tanks have been serviced at Nembudziya High School.\n\nVillagers in Gokwe say they are thrilled to witness the first-ever Independence Day celebrations hosted in their province, describing it as a moment of pride and long-overdue recognition.\n\nWe used to only listen to these celebrations on radio, never imagining they could come to our doorstep. Now we feel recognised, we feel like part of the bigger Zimbabwe, said 67-year-oldMbuya Shumba from Nemangwe.\n\nA youth leader from a traditional dance troupe in Njelele, Tafadzwa Dube, said it was their chance to be part of history.\n\nWe have been rehearsing traditional dances and songs. This is not just a celebration, it is our opportunity to showcase who we are, he said.\n\nA primary school teacher at Gokwe Centre, who spoke on condition of anonymity, said there was a real buzz in the community.\n\nVendors are preparing their wares and people are cleaning up. It is not just a day but a spark of hope, said the teacher.\n\nMr Joram Mupfurutsa, a farmer in Chireya, said for years, we felt forgotten, like we didnt matter. Now the whole country will see what Gokwe is made of. We are proud to host this historic event.\n\nBusiness owners are equally upbeat, with Mrs Maidei Mhlanga, expecting brisk business.\n\nWe are stocking up on drinks, food and airtime because we know people will be out in numbers. It is our time to make money, she said.\n\nMr Trymore Mugogodera who operates a canteen was also expecting to cash on the two events.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/09/IMG-20230915-WA0082-1-680x380.jpg",
            "description": "Herald Reporters ALL is set for the country’s 45th Independence Day celebrations at Nembudziya Growth Point in Gokwe, Local Government and Public Works Minister Daniel Garwe has said. This comes as Midlands Provincial Affairs and Devolution Minister Owen Ncube donated 70 cattle for the festivities which will be held under the theme “Zim@45: Devolve and […]",
            "time": "06:35",
            "date": "16 Apr 2025"
        },
        {
            "title": "Two new ministers pledge hard work",
            "url": "https://www.herald.co.zw/two-new-ministers-pledge-hard-work/",
            "content": "Rumbidzayi Zinyuke-Senior Reporter\n\nTWO newly-appointed ministers were sworn in by President Mnangagwa yesterday and they immediately pledged to work hard to ensure the Presidents vision of an empowered upper-middle-income society that leaves no place and no one behind is attained.\n\nThe new ministers are Environment, Climate and Wildlife Minister Dr Evelyn Ndlovu and Minister of State for Matabeleland South Provincial Affairs and Devolution Albert Nguluvhe.\n\nThey were sworn in at State House in Harare yesterday.\n\nMinister Ndlovu has previously held the Primary and Secondary Education portfolio, and is the outgoing Minister of State for Matabeleland South Provincial Affairs and Devolution.\n\nShe replaces Dr Sithembiso Nyoni who was relieved of her duties recently.\n\nPresident Mnangagwa, Vice President Dr Constantino Chiwenga (third from left), Justice, Legal and Parliamentary Affairs Minister Ziyambi Ziyambi (far left) and Chief Secretary to the President and Cabinet Dr Martin Rushwaya (right) pose for a photograph with newly-appointed Minister of Environment, Climate and Wildlife Dr Evelyn Ndlovu (second from left) and incoming Matabeleland South Provincial Affairs and Devolution Minister Albert Nguluvhe (second from right) at State House in Harare yesterday.  Picture: Believe Nyakudjara.\n\nSpeaking after the swearing in ceremony, Minister Ndlovu said she was geared to implement existing policies under her portfolio as tasked by the President.\n\nI am excited to be coming back to Cabinet and I am ready to work in that ministry. I have to look at the policies that are there, so that I can then come up with new ideas.\n\nI also want to examine the international agreements that we have, because we have got three critical areas that we should look at.\n\nWe have sustainable development, which can only come if we address climate challenges that we are facing. So we will be looking at the climate change issues seriously, said Minister Ndlovu.\n\nShe promised to also look into the monitoring and evaluation of programmes that are running in various State entities that fall under her ministry.\n\nOn his part, Minister Nguluvhe, who replaced Minister Ndlovu as Matabeleland South Minister of State for Provincial Affairs and Devolution, pledged to bring development to the most marginalised areas in his province.\n\nI feel humbled by this appointment by the President. We are all aware of the Presidents Vision 2030 so what is important is that I have to follow that.\n\nHis vision talks of leaving nobody and no place behind. I have to go back and make sure that those devolution funds we are receiving work towards ensuring that no place and no one is going to be left behind, he said.\n\nMinister Nguluvhe, who is Beitbridge East legislator, has been driving massive infrastructure development in his constituency and is expected to lead more developmental projects in the whole province now.\n\nHe has previously praised the Second Republic for leading the massive infrastructural development of Matabeleland South Province since 2018.\n\nThe province now boasts many new clinics and schools while irrigation schemes such as Zhovhe are operating well, employing people and transforming their lives.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/President-and-Minister-Nguluvhe-680x380.jpg",
            "description": "Rumbidzayi Zinyuke-Senior Reporter TWO newly-appointed ministers were sworn in by President Mnangagwa yesterday and they immediately pledged to work hard to ensure the President’s vision of an empowered upper-middle-income society that leaves no place and no one behind is attained. The new ministers are Environment, Climate and Wildlife Minister Dr Evelyn Ndlovu and Minister of […]",
            "time": "06:35",
            "date": "16 Apr 2025"
        },
        {
            "title": "Expo 2025 Osaka: Zim to sign deals in Japan",
            "url": "https://www.herald.co.zw/expo-2025-osaka-zim-to-sign-deals-in-japan/",
            "content": "Hebert Zharare in Osaka, Japan\n\nA BUSINESS forum to discuss trade and bilateral relations between Zimbabwean Government officials, private sector players, Japanese officials and leading firms from the Asian giant has been scheduled for July 15.\n\nMega deals are expected to be signed at this event, according to Zimbabwes Ambassador to Japan, Stewart Nyakotyo.\n\nSponsored by the Zimbabwean private sector, the meeting will be held on the sidelines of Expo 2025 Osaka, Kansai, Japan.\n\nThis will be followed by a national day ceremony to be graced by President Mnangagwa.\n\nAmbassador Nyakotyo said President Mnangagwas visit to Japan will be an opportune time for him to engage with his Japanese counterparts to deepen the two countries bilateral relations.\n\nAfter the national day celebrations, which will also be attended by Japanese Government officials, President Mnangagwa will witness the signing ceremony of some deals during the Business-to-Business session before engaging in bilateral meetings, according to Ambassador Nyakotyo.\n\nThe meeting, to be spearheaded by the Expo 2025 Osaka Japan Commissioner-General Mr Allan Majuru and the Zimbabwe Investment and Development Agency (ZIDA), will be attended by key Government economic ministries and representatives of local private sector players seeking to connect with their Japanese counterparts.\n\nAs part of the Expo 2025 Osaka, each country has been allocated a national day and ours will be on July 16. However, the day before, on July 15, we have a business forum which Zimbabwe will host, where we are expecting many Japanese companies to come and participate alongside companies from Zimbabwe. The business meeting is being sponsored by local companies.\n\nSo, it will be an opportunity for our companies to meet potential investors from Japan and discuss areas of cooperation. But our major areas of interest will be, of course, industry. We would like industrialisation to be prioritised, whether its mining or tourism. The tourism sector is an entry point at the moment. We want to go beyond tourism and do more, he said.\n\nAmbassador Nyakotyo said President Mnangagwas visit to Japan will be an opportune time for him to engage with his Japanese counterparts to deepen the two countries bilateral relations.\n\nDuring President Mnangagwas visit to South Korea in June last year, Ambassador Nyakotyo, who is also the accredited envoy to South Korea, said discussions on potential cooperation in the area of critical minerals were held.\n\nSouth Korea undertook to work with African countries to ensure a reliable supply of critical minerals needed to spearhead industrialisation.\n\nPresident Mnangagwa, at the well-attended business conference also graced by other African Heads of State and Government during the inaugural South Korea-Africa Summit, articulated the continents vision of engaging in mutually beneficial relations with development partners, anchored on the need to add value to mineral resources before export for the benefit of the exporting countries.\n\nFollowing the inaugural South Korea-Africa Summit, the South Korean envoy to Zimbabwe, Ambassador Park Jae Kyung, said his office was inundated with calls from representatives of companies who wanted to understand more about the investment opportunities in Zimbabwe after listening to President Mnangagwas captivating address during the business conference in Seoul in June last year.\n\nSaid Ambassador Nyakotyo: South Korea and Japan have been cooperating to ensure a reliable supply of critical minerals, which are required for theirindustries, particularly the motor vehicle sector. The re-engagement and engagement policies that have been enunciated by His Excellency, Dr Mnangagwa, are meant to ensure that Zimbabwe has friends all over the world and that we are able to trade with them and also to get some investment from them.\n\nWe are saying we are not an enemy to anybody, and we are a friend to all. Therefore, being in Japan gives us the opportunity to engage with the world, because the people who are visiting our stand at the pavilion are from all over the world. We are expecting over 28 million people to attend, and as Zimbabwe, we are expecting about 3 000 to 4 000 people to visit the Zimbabwe pavilion daily.\n\nSponsored by the Zimbabwean private sector, the meeting will be held on the sidelines of Expo 2025 Osaka, Kansai, Japan.\n\nWe are happy because we have come to Japan with some expectations, and they are being met. We have interacted with so many potential investors, tourism operators, as well as citizens who would like to come to Zimbabwe, and this is encouraging, he said.\n\nThe Expo runs from April 13 to October 13, and Zimbabwes pavilion in the Commons B Hall, where most African and Caribbean countries are exhibiting, is the centre of attraction. The virtual reality and physical exhibition is attracting thousands of people daily.\n\nAbout Japan\n\nIn 2024, Japans Gross Domestic Product (GDP) was 609.4 trillion Yen (US$4.01 trillion), according to the Japanese Cabinet Office.\n\nThis marks the first time Japans GDP has exceeded 600 trillion Yen in a calendar year.\n\nReal GDP growth was 2.8 percent in 2024.\n\nJapans population, according to the Population Reference Bureau, stands at 125 million.\n\nOf the population, 61 million are male and 64 million are female.\n\nJapans major economic activities are concentrated in the services sector.\n\nThe service sector accounts for 70 percent of the economy.\n\nThe remainder covers industries such as manufacturing, particularly automobiles, consumer electronics and semiconductors, alongside a thriving tourism industry.\n\nIn 2024, Japanese exports to Zimbabwe stood at US$62 million.\n\nThe top five exported goods from Japan to Zimbabwe included transportation, consumer goods, capital goods, vehicles, parts and accessories.\n\nExports to Japan from Zimbabwe primarily consist of tobacco, crude minerals and cotton.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Osaka-Expo-2025-680x380.jpg",
            "description": "Hebert Zharare in Osaka, Japan A BUSINESS forum to discuss trade and bilateral relations between Zimbabwean Government officials, private sector players, Japanese officials and leading firms from the Asian giant has been scheduled for July 15. Mega deals are expected to be signed at this event, according to Zimbabwe’s Ambassador to Japan, Stewart Nyakotyo. Sponsored […]",
            "time": "06:35",
            "date": "16 Apr 2025"
        },
        {
            "title": "Govt approves Energy Compact to boost electricity access",
            "url": "https://www.herald.co.zw/govt-approves-energy-compact-to-boost-electricity-access/",
            "content": "Mukudzei Chingwere-Herald Reporter\n\nCABINET has approved the National Energy Compact for Zimbabwe in a move aimed at improving energy access, Information, Publicity, and Broadcasting Services Minister Dr Jenfan Muswere has said.\n\nThis initiative is part of the broader Dar-es-Salaam Declaration, which emerged from the Africa Heads of State Energy Summit held earlier this year.\n\nThe Energy Compact aligns with the ambitious Mission 300, which seeks to ensure that millions of African households gain access to electricity by 2030.\n\nZimbabwe is committed to electrifying 3,1 million households and achieving 70 percent access to clean cooking solutions within the same timeframe.\n\nCabinet considered and approved the Energy Compact for the Republic of Zimbabwe. The Compact is in terms of the Dar-es-Salaam Declaration on the Africa Heads of State Energy Summit held from 27 to 28 January 2025, said Dr Muswere.\n\nZimbabwe signed the declaration under the main objective of Mission 300, which aims to increase the number of African households accessing electricity by 2030. Members are required to develop and submit Energy Compacts for their respective countries, said Dr Muswere.\n\nThe Minister of Energy and Power Development, Cde July Moyo, presented the Compact, which outlines a strategic roadmap aimed at universal access to affordable, reliable, and sustainable electricity.\n\nThe plan addresses critical energy challenges faced by the nation, including outdated infrastructure, generation shortfalls, and limited access in rural areas.\n\nThe Zimbabwe National Energy Compact sets forth a strategic roadmap to achieve universal access to affordable, reliable, and sustainable electricity by 2030, said Dr Muswere.\n\nRooted in Vision 2030 and guided by the National Development Strategies, the Compact addresses critical energy challenges such as outdated infrastructure, generation shortfalls, and limited access in rural areas. The Compact seeks to enhance energy security and build resilience in the face of climate-related risks, said Dr Muswere.\n\nHe said the Compact is structured around five strategic pillars: expanding generation and infrastructure, strengthening regional integration, promoting distributed renewable energy and clean cooking, catalysing private sector-led investment, and ensuring the financial viability of utilities.\n\nDr Muswere said Zimbabwe seeks to electrify 3.1 million households and attain 70 percent clean cooking access by 2030.\n\nRegulatory reforms will support this effort by streamlining investment processing for Independent Power Producers, adopting mini-grid regulations, and unlocking private sector investment.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Cabinet-ministers-680x380.jpg",
            "description": "Mukudzei Chingwere-Herald Reporter CABINET has approved the National Energy Compact for Zimbabwe in a move aimed at improving energy access, Information, Publicity, and Broadcasting Services Minister Dr Jenfan Muswere has said. This initiative is part of the broader Dar-es-Salaam Declaration, which emerged from the Africa Heads of State Energy Summit held earlier this year. The […]",
            "time": "06:35",
            "date": "16 Apr 2025"
        },
        {
            "title": "US$3m Women’s Fund announced  ahead of Independence celebrations",
            "url": "https://www.herald.co.zw/us3m-womens-fund-announced-ahead-of-independence-celebrations/",
            "content": "Joseph Madzimure\n\nAS the nation prepares to commemorate its 45th Independence celebrations on Friday, President Mnangagwa is set to avail a US$3 million revolving Presidential Womens Fund, a landmark initiative aimed at empowering women across the country.\n\nThis fund is part of President Mnangagwas broader vision to drive economic development and support womens empowerment programmes.\n\nFurthermore, the initiative recognises women as the backbone of the nations progress and seeks to equip them with the tools to thrive in a rapidly evolving global economy.\n\nThe fund will focus on skills development and provide financial support for women-led projects in sectors such as mining, agriculture, tourism, and entrepreneurship.\n\nThese points were highlighted yesterday when Zanu PF Secretary for Women Affairs, Cde Mabel Chinomona, spoke after handing over an incubator to the Harare Province Womens League.\n\nShe said the foundation of Vision 2030 lies in the empowerment of women.\n\nWomen should actively engage in national development to help drive the nation towards its goals, Cde Chinomona said.\n\nIn terms of funding, we are going to receive more funding than others because we constitute the majority in Zimbabwe.\n\nAt the event, Cde Chinomona commissioned a newly installed solar-powered incubator, an innovative project set to benefit women and the broader community.\n\nThis aligns with President Mnangagwas vision for a prosperous Zimbabwe by 2030 and is part of the leagues nationwide development programme, which includes 10 solar-powered incubators for all provinces with a combined capacity of 36 000 eggs.\n\nDuring her address, Cde Chinomona also emphasised the importance of respecting unity within the party, again highlighting President Mnangagwas vision for 2030.\n\nShe encouraged women to work hard and utilise their skills to feed their families, echoing the Presidents mantra that no place will be left behind in development.\n\nThe solar-powered incubator will enable communities to hatch eggs for free, following the recent distribution of chicks.\n\nCde Chinomona noted that this initiative aligns with the partys commitment to uplifting communities.\n\nAs Zimbabwe works towards achieving Vision 2030, the party remains committed to uplifting communities and fostering a brighter future for all Zimbabweans, she said.\n\nCde Chinomona urged women to exercise high levels of discipline, cautioning that any efforts to undermine the Presidium will invite severe consequences.\n\nWe should be guided by the party constitution; anything outside that is tantamount to the abuse of the name of the party for your own personal gains. Women should be at the forefront in pushing for empowerment projects across the country.\n\nCde Chinomona urged women in leadership positions to recruit young women into strategic roles. She congratulated Cde Tsitsi Tawomhera for winning the Glen View South National Assembly seat in the by-election held on Saturday.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Cde-Mabel-Chinomona-680x380.jpg",
            "description": "Joseph Madzimure AS the nation prepares to commemorate its 45th Independence celebrations on Friday, President Mnangagwa is set to avail a US$3 million revolving Presidential Women’s Fund, a landmark initiative aimed at empowering women across the country. This fund is part of President Mnangagwa’s broader vision to drive economic development and support women’s empowerment programmes. […]",
            "time": "06:35",
            "date": "16 Apr 2025"
        },
        {
            "title": "Former Harare mayor, ex-town clerk arrested",
            "url": "https://www.herald.co.zw/former-harare-mayor-ex-town-clerk-arrested-2/",
            "content": "Herald Reporter\n\nFORMER Harare Mayor Bernard Manyenyeni and ex-acting town clerk Josephine Ncube have been arrested on charges of criminal abuse of duty.\n\nThe Zimbabwe Anti-Corruption Commission confirmed the arrest of the duo last night.\n\nAllegations are that Manyenyeni and Ncube unlawfully amended a land development agreement between the City of Harare and Shelter Zimbabwe, costing the city an estimated US$20 million in revenue.\n\nSometime in 2013, Harare City Council entered into an agreement authorising the development of 1 500 residential stands on 657 hectares in Tafara, Mabvuku, with Shelter Zimbabwe responsible for infrastructure.\n\nUnder the original terms, the Council was to allocate and sell the stands after servicing and reimburse Shelter Zimbabwe thereafter.\n\nHowever, in 2017, Ncube and Manyenyeni altered the agreement and authorised Shelter Zimbabwe to sell unserviced stands.\n\nShelter Zimbabwe sold the stands but failed to develop the land and remit the money to the local authority.\n\nThe two are expected to appear at Harare Magistrates Court today.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Bernard-Manyenyeni-680x380.jpg",
            "description": "Herald Reporter FORMER Harare Mayor Bernard Manyenyeni and ex-acting town clerk Josephine Ncube have been arrested on charges of criminal abuse of duty. The Zimbabwe Anti-Corruption Commission confirmed the arrest of the duo last night. Allegations are that Manyenyeni and Ncube unlawfully amended a land development agreement between the City of Harare and Shelter Zimbabwe, […]",
            "time": "06:35",
            "date": "16 Apr 2025"
        },
        {
            "title": "Govt extends duty-free import window for bus operators",
            "url": "https://www.herald.co.zw/govt-extends-duty-free-import-window-for-bus-operators/",
            "content": "Zvamaida Murwira-Senior Reporter\n\nGOVERNMENT has extended a one-year duty-free privilege for public service bus imports, which was initially supposed to end on February 14.\n\nThis development will now see the import window running until the end of this month. The privilege to import buses duty-free was meant to revolutionise the transport sector through the provision of a conventional, affordable, and reliable transport system for the commuting public.\n\nThe extension is contained in a Statutory Instrument published in an Extraordinary Government Gazette this week by Finance, Economic Development, and Investment Promotion Minister, Professor Mthuli Ncube.\n\nThe Customs and Excise (Suspension) Regulations, 2003, published in Statutory Instrument 257 of 2003, are amended in section 9HH by the deletion of the words 14th February, 2025 and the substitution of 30th April, 2025, reads the notice.\n\nInitially, the Government granted bus operators a one-year grace period that allowed them to import buses duty-free, resulting in the importation of over 1,500 buses. Introduced in 2022, the facility enabled approved transport operators to replenish their fleet.\n\nThe importation of buses saw a huge number of buses being brought in as bus operators jostled to replenish their fleet. It was a huge relief for many bus operators who commended the Government for facilitating the importation of buses, saying it will help them satisfy the requirements of their market.\n\nThe bus operators also commended the Governments decision to lift customs duty on Semi-Knocked Down (SKD) kits for buses and trucks, saying it will help empower the local industry.\n\nIn his 2025 budget, Prof Ncube said the Government was redirecting resources to boost local vehicle assembly, identified as a priority under the National Development Strategy 1 (NDS1).\n\nThe move aims to enhance local value chains, create jobs, and position the industry for growth.\n\nIt was also envisaged that the suspension of duty on buses would not only ease transport challenges but also reduce fares.On its own, in recent years, the Government, through the Zimbabwe United Passenger Company, has brought in hundreds of buses that have been distributed around the country to ensure that the public is not ripped off by uncouth and often rowdy unregistered transporters.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/12/Professor-Mthuli-Ncube.jpg",
            "description": "Zvamaida Murwira-Senior Reporter GOVERNMENT has extended a one-year duty-free privilege for public service bus imports, which was initially supposed to end on February 14. This development will now see the import window running until the end of this month. The privilege to import buses duty-free was meant to revolutionise the transport sector through the provision […]",
            "time": "06:35",
            "date": "16 Apr 2025"
        },
        {
            "title": "Hwange repowering awaits Cabinet nod",
            "url": "https://www.herald.co.zw/hwange-repowering-awaits-cabinet-nod/",
            "content": "Lincoln Towindo\n\nTHE repowering of Hwange Thermal Power Stations ageing Units 1 to 6 under a partnership between Zesa and Jindal Africa is now awaiting final Cabinet approval, amid growing optimism that Zimbabwe could soon stabilise its electricity supply.\n\nThe project, structured as a rehabilitate-operate-and-transfer (ROT) agreement, is expected to boost output from Hwanges old units from 340 megawatts (MW) to 800 MW.\n\nSpeaking in an interview, Mutapa Investment Fund chief executive officer Dr John Mangudya said significant progress had been made, with all technical and commercial documentation now complete and under review by the Public-Private Partnership (PPP) Committee, a Cabinet sub-committee chaired by the Minister of Finance, Economic Development, and Investment Promotion.\n\nOnce cleared by the committee, the deal will be submitted to full Cabinet for final approval.\n\nZESA is one of the 20-plus State-owned enterprises placed under the Mutapa Investment Funda sovereign wealth fund tasked with managing and unlocking value from strategic state assets.\n\nSignificant progress was made on the agreement between the Zimbabwe Electricity Supply Authority (Zesa) and Jindal Africa for the rehabilitation, operation, and transfer of Hwange Units 1 to 6, which is expected to increase the supply of electricity from 340 to 800 MW, said Dr Mangudya.\n\nWe are at a stage whereby the documents agreed upon between the two parties are being scrutinised before they go to Cabinet. The PPP committee is chaired by the Minister of Finance and the Zimbabwe Investment and Development Agency (ZIDA) is the secretariat.\n\nZesa is one of the 20-plus State-owned enterprises placed under the Mutapa Investment FundZimbabwes sovereign wealth fund tasked with managing and unlocking value from strategic state assets.\n\nThe upgrade of Hwange Units 1 to 6 is expected to complement the recently commissioned Units 7 and 8, which came online in 2023 and are contributing 600 MW to the national grid, forming a critical backbone of Zimbabwes energy security.\n\nWhile awaiting final Cabinet approval, Dr Mangudya said Zesa was already rehabilitating Unit 5the most reliable and prolific power generator among the old units at the stationusing the power utilitys internal resources.\n\nWhat we are also doing now is that before the PPP gets approved, we are not stopping, he said. We are already working on Unit 5, which is the one that produces the most electricity. Work is already being done now by Zesa using internal resources. This is so that we do not wait for the Jindal Africa deal.\n\nHe said the repowering of Hwange is part of broader strategies to ensure energy security through both public investment and private sector participation.\n\nThese include the rollout of prepaid meters, smart metering, and net metering, as well as efforts to accelerate Independent Power Producer (IPP) projects that have stalled for years. Dr Mangudya said the revision of electricity tariffs had created a viable environment for IPPs to finally take off. Zimbabwes current electricity tariff is now pegged at about US$0,1608 per kilowatt-hour, well above the 9 to 10 US cents most IPPs require to operate sustainably.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2018/09/John-Mangudya2.jpg",
            "description": "Lincoln Towindo THE repowering of Hwange Thermal Power Station’s ageing Units 1 to 6 under a partnership between Zesa and Jindal Africa is now awaiting final Cabinet approval, amid growing optimism that Zimbabwe could soon stabilise its electricity supply. The project, structured as a rehabilitate-operate-and-transfer (ROT) agreement, is expected to boost output from Hwange’s old […]",
            "time": "06:35",
            "date": "16 Apr 2025"
        },
        {
            "title": "Zanu PF confirms  Cde Mabika election",
            "url": "https://www.herald.co.zw/zanu-pf-confirms-cde-mabika-election/",
            "content": "Joseph Madzimure-Zimpapers Politics Hub\n\nZANU PF has endorsed the election of Cde Dorothy Mabika as the substantive chairperson of the Womens League in Manicaland Province. Cde Mabika was elected by the Zanu PF Manicaland Womens League executive on April 6.\n\nShe replaces Cde Happiness Nyakuedzwa, who was suspended last year by the party from holding any position for two years. Zanu PF Secretary for Women Affairs Cde Mabel Chinomona confirmed the development in a memo addressed to Manicaland provincial chairman Cde Tawanda Mukodza.\n\nThe memo was also copied to the partys Secretary-General Dr Obert Mpofu, National Political Commissar Cde Munyaradzi Machacha, Womens League Secretary for Administration Cde Monica Mutsvangwa, Cde Mabika, and Cde Mercy Sacco, who was also eyeing the post.\n\nWe would like to inform you that the Womens League received a report on the co-option of the Manicaland Provincial Womens League chairwoman conducted in April 2025. Cde Mabika emerged the winner. We are writing to confirm and endorse Cde Mabika as the substantive provincial chairwoman for Manicaland Province with immediate effect, reads the memo.\n\nCde Mabika, a seasoned cadre, has previously served as Zanu PF Manicaland deputy chairperson. On the day of her election, she expressed gratitude and humility. As she takes on her new role, Cde Mabika seeks to enhance the welfare of women in Manicaland through various empowerment projects, demonstrating her dedication to creating positive change and improving the lives of those around her.\n\nI was humbled by the election and being entrusted with such a powerful position, especially when I least expected it. I urge women in Manicaland to unite towards a common goal of strengthening Zanu PFs presence in the province.\n\nLet us focus on economic development, peaceful co-existence, and womens empowerment.\n\nWe must ensure women in Manicaland benefit from projects being initiated by President Mnangagwa and his Government. Empowering women empowers families, provinces, and nations. We need these projects to impact households, communities, and the nation. We must promote peace, development, and support women to become influential figures, she said.\n\nCde Mabika reaffirmed the Womens Leagues commitment to Resolution Number\n\nOne, adopted at last years conference in Bulawayo, which seeks to extend President Mnangagwas term of office until 2030, so he can continue implementing his developmental initiatives.\n\nShe emphasised that President Mnangagwas leadership was crucial for Zimbabwes economic growth and peace, and believes extending his term will ensure continuity and stability, enabling the country to build upon the progress made so far.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Cde-Dorothy-Mabika.jpg",
            "description": "Joseph Madzimure-Zimpapers Politics Hub ZANU PF has endorsed the election of Cde Dorothy Mabika as the substantive chairperson of the Women’s League in Manicaland Province. Cde Mabika was elected by the Zanu PF Manicaland Women’s League executive on April 6. She replaces Cde Happiness Nyakuedzwa, who was suspended last year by the party from holding […]",
            "time": "06:35",
            "date": "16 Apr 2025"
        },
        {
            "title": "Editorial Comment: Let’s drive safely on the roads this holiday",
            "url": "https://www.herald.co.zw/editorial-comment-lets-drive-safely-on-the-roads-this-holiday/",
            "content": "THIS coming weekend is the four-day holiday covering both Independence Day and the religious Easter period and many Zimbabweans will be on the move. Some will be travelling long distances, others just visiting friends, relatives, places of entertainment and resorts close to home.\n\nSome will be attending the national and provincial Independence celebrations and then moving on to their religious obligations before taking part in family and friendly parties. There will be a lot of extra traffic on the roads.\n\nSo personal and non-business traffic will be building up everywhere, and roads are likely to be crowded. On the roads will be more ordinary drivers rather than the professionals driving trucks, so there will be more risks taken and more mistakes made unless everyone thinks very seriously about their driving.\n\nLast year 27 people were killed in 286 accidents over the Easter holidays, two less than in the previous year, but that was hardly a major decline, just the sort of variation that can be expected when people do not really change the way they drive and keep making the same mistakes.\n\nEnforcement has been concentrated on fixed police checkpoints, which are fine for some purposes, but do not really address the problems of speeding, unsafe overtaking and other bad driving since almost all drivers are exceptionally well-behaved when they approach and pass a police check point. It is what they do between checkpoints that causes the accidents, the deaths and the injuries.\n\nThis year the Traffic Safety Council of Zimbabwe, Ministry of Transport and Infrastructural Development and the police are deploying more than 40 mobile teams across the country, who will be able to intervene when they see the bad driving and breaches of driving laws and regulations as they occur, and so be able to take action.\n\nThe deployment was announced by Transport and Infrastructural Development Minister Felix Mhona at the road safety and education campaign launched by the Traffic Safety Council of Zimbabwe, with support from Home Affairs and Cultural Heritage Minister Kazembe Kazembe and other senior Government officials.\n\nThis deployment needs to be widely publicised, and the mobile teams need to not just deal with the breaches of the law, but also make their presence seen on as many roads as possible. When drivers know that a police car can appear anywhere they tend to behave a lot better, and not just when they pass the static checkpoints and tollgates.\n\nThere can also be better collaboration between the mobile teams and the checkpoints. Often suspicious behaviour, or a dubious vehicle, can be seen by the mobile team, who might be busy with another driver. But a phone call to the next checkpoint with details of the vehicle being badly driven or which appears to be falling to bits can see that vehicle being stopped.\n\nA driver might think they have escaped notice, only to be waved over when they come to the checkpoint with full details of errant driving to explain away and checks to be taken.\n\nAmong those checks should be drinking checks. Beer bottles on the seats are a giveaway, but we would hope that the breathalysers on order have arrived and are being deployed as well. A lot of drivers moving between family celebrations and driving to and fro between bars and home will have taken on more drinks than they can cope with.\n\nWe also have the preventative work done under Minister Mhona in the last few years to bring order and higher levels of safety to the public vehicle sector, the kombis, buses and trucks. Highway vehicles now need to have speed limiters and tracking devices; regulations are in place to ensure that all new bus and kombi drivers must be over 30, and when public service licences need to be renewed the drivers again must be over 30. That might help by keeping impatient young cowboys off the road.\n\nThe Traffic Safety Council does a lot of sterling work trying to educate the public, but while good drivers listen, the bad drivers just carry on, so that is why we need to build up the preventative efforts of the Transport Ministry, enforcement by the police, joint checkpoints and mobile patrols.\n\nRegrettably, some drivers simply will not listen, at least until they are sitting in a wreck in the middle of the road or are sitting in handcuffs in the back of a police car. But having to learn the hard way often means that someone who is driving well and is not at fault is killed or injured by the uncaring driver.\n\nYet every accident is preventable. There are no certain accidents or accidents that just happen. Every accident has some human error, driver error in the vast majority, but also errors of vehicle owners not checking tyres and skimping on repairs and spare parts.\n\nSo those planning on driving around these holidays should make those basic checks before setting out, keep off the bottle before they drive and while driving, although partying at their destination if they do not have to drive home just afterwards is fine, and treat all other drivers with courtesy and respect.\n\nThis way we can have our fun; we can celebrate the 45th anniversary of Independence; we can fulfil our religious obligations. And we can do all of this without dying or being injured, or having our car towed away to a panel beater.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/fefbbdcb-e350-42c6-8ec2-009073d3a5d2-680x380.jpeg",
            "description": "THIS coming weekend is the four-day holiday covering both Independence Day and the religious Easter period and many Zimbabweans will be on the move. Some will be travelling long distances, others just visiting friends, relatives, places of entertainment and resorts close to home. Some will be attending the national and provincial Independence celebrations and then […]",
            "time": "06:35",
            "date": "16 Apr 2025"
        }
    ]
}