{
    "news": [
        {
            "url": "https://www.herald.co.zw/msd-issues-update-on-severe-tropical-storm-chido/",
            "content": "Precious Manomano\n\nHerald Reporter\n\nThe Meteorological Services Department, in conjunction with the Department of Civil Protection, has issued an advisory regarding Severe Tropical Storm Chido, currently over 3 000 kilometers away from Zimbabwe.\n\nIn a statement, the department said the storm is expected to remain at a safe distance from today, December 11, to Tuesday, December 17.\n\nThe third tropical system of the 2024/2025 cyclone season, Severe Tropical Storm Chido, has developed in the Indian Ocean and is travelling westwards at a speed of 13 km per hour towards Madagascar, where it is expected to arrive on December 13.\n\nIt has not yet reached the cyclone stage but is strengthening,said the department.\n\nOn December 17, the storm is anticipated to reach Mozambique if it maintains its current trajectory. The department also expects to receive rain over the weekend.\n\nMSD will continue to monitor the situation and provide regular updates.\n\nIn the meantime, the public is urged to stay hydrated due to the hot and sunny conditions currently being experienced.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/The-Meteorological-Services-Department.jpg",
            "description": "Precious Manomano Herald Reporter The Meteorological Services Department, in conjunction with the Department of Civil Protection, has issued an advisory regarding Severe Tropical Storm Chido, currently over 3 000 kilometers away from Zimbabwe. In a statement, the department said the storm is expected to remain at a safe distance from today, December 11, to Tuesday, […]"
        },
        {
            "url": "https://www.herald.co.zw/musekiwa-guides-zimbabwe-to-thrilling-win-over-afghanistan/",
            "content": "Eddie Chikamhi\n\nZimpapers Sports Hub\n\nTASHINGA Musekiwa was the unlikely saviour for hosts Zimbabwe who claimed a thrilling four-wicket win over Afghanistan in the first T20I at Harare Sports Club this Wednesday afternoon.\n\nThe Chevrons needed 11 runs in the last over and the 24-year-old got just enough with his bat to see the home team over the line after the match had come down to the last ball.\n\nMusekiwa scored 16 runs in a 13-ball cameo as Zimbabwe reached 145/6 in their 20 overs.\n\nOpening batsman Brian Bennett was named Man of the Match for his well worked out 49 runs earlier on, which helped Zimbabwe set the foundation in a difficult chase.\n\nAfghanistan had won the toss and elected to bat first, putting 144/6 in their allotted overs.\n\nZimbabwe lead the three-match series 1-0, with the next two matches scheduled for Friday and Saturday at the same venue.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Tashinga-Musekiwa.jpg",
            "description": "Eddie Chikamhi Zimpapers Sports Hub TASHINGA Musekiwa was the unlikely saviour for hosts Zimbabwe who claimed a thrilling four-wicket win over Afghanistan in the first T20I at Harare Sports Club this Wednesday afternoon. The Chevrons needed 11 runs in the last over and the 24-year-old got just enough with his bat to see the home […]"
        },
        {
            "url": "https://www.herald.co.zw/legumes-biofertiliser-launched/",
            "content": "Victor Maphosa\n\nMashonaland East Province\n\nRhizobia, a biofertiliser for leguminous plants was launched today at Grasslands Research Centre in Marondera.\n\nThe Minister of State for Mashonaland East Provincial Affairs and Devolution Dr Apolonia Munzverengwi officiated at the launch.\n\nOther Government officials and farmers from the province attended the event.\n\nRhizobia is an innovative and cost effective biofertiliser that enables leguminous plants to fix atmospheric nitrogen, thereby significantly enhancing their growth and productivity.\n\nThe biofertiliser is produced by the Legume Inoculant Factorywhich operates under the Soil Productivity Research Laboratory (SPRL) and the Ministry of Lands, Agriculture, Fisheries, Water, and Rural Development.\n\nIn an interview with The Herald on the sidelines of the launch, chief director for the department of Research and Specialist Services in the Ministry of Agriculture, Dr Dumisani Kutywayo said the biofertiliser gurantees increased production.\n\nWe encourage farmers to use Rhizobia in leguminous crops such as soya beans and sugar beans, among others.\n\nWe distribute Rhizobia through our channels such as extension agencies. Other agro dealers sell it on our behalf.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Marondera.jpg",
            "description": "Victor Maphosa Mashonaland East Province Rhizobia, a biofertiliser for leguminous plants was launched today at Grasslands Research Centre in Marondera. The Minister of State for Mashonaland East Provincial Affairs and Devolution Dr Apolonia Munzverengwi officiated at the launch. Other Government officials and farmers from the province attended the event. Rhizobia is an innovative and cost […]"
        }
    ]
}