{
    "news": [
        {
            "title": "Give youths full backing — President",
            "url": "https://www.herald.co.zw/give-youths-full-backing-president/",
            "content": "Zvamaida Murwira, Senior Reporter\n\nPresident Mnangagwa has directed Government ministries, departments and agencies to ensure that entrepreneurship initiatives spearheaded by youths are fully supported so they form part of mainstream businesses and economic development.\n\nThis is part of the Governments youth empowerment programme, which is the bedrock of the Second Republic.\n\nThe President said this last Friday in Bulawayo while delivering his keynote address at National Youth Day commemorations.\n\nThe celebrations were held under the theme, Empower Youths, Secure the Future.\n\nCommenting on the Zimbabwe Digital Skills Development Programme that he launched on the same day, the President said the programme will enhance digital literacy and skills among Zimbabweans and empower young people to contribute to the economy through entrepreneurship.\n\nI commend our youth for their entrepreneurial culture across various sectors of the economy.\n\nMinistries, departments and agencies are directed to develop programmes, which ensure that our youth enterprises graduate into large businesses, said the President.\n\nMeanwhile, I call upon the private sector, the youth, Empower Bank and other development partners to develop and promote business linkages.\n\nPresident Mnangagwa commended the consultative process for strengthening youth empowerment and skills development strategies.\n\nI challenge you to take up more initiatives to continually beautify the communities you live in. Meanwhile, the comprehensive and precise presentations from the youth, particularly on the support you require from Government and our ruling party, ZANU PF, will continue to receive appropriate consideration.\n\nTo this end, the Ministry of Youth Empowerment, Development and Vocational Training must speed up the finalisation of the National Youth Act, which is a critical legislative tool for administering youth empowerment and skills development programmes.\n\nThe implementation of robust and complementary strategies to support and empower the youth must be scaled up. A nation which empowers and invests in the youth, is guaranteed of a prosperous future, said the President.\n\nHe urged young people to emulate yesteryear youths for their patriotism, coupled with courage that saw them taking up arms to fight for the liberation of the country.\n\nWe also have a chance to chart and refine the journey we are taking for a brighter future, particularly the role of you, our young people.\n\nIn undertaking this critical task, remain emboldened by the virtues of courage, selfless sacrifice, and bravery which were defining among the youths of yesteryear.\n\nThey took up arms against the oppressive colonial regime and brought us independence, sovereignty, territorial integrity, freedom and democracy.\n\nThese historical milestones, including our rich liberation war heritage, are indispensable and must be safeguarded as well as passed down from one generation to the next, said President Mnangagwa.\n\nThousands of young people from across the country and representatives of youths from other countries such as Burundi, Mozambique and South Africa among other nations attended the National Youth Day celebrations held at the Zimbabwe International Trade Fair Exhibition Centre.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/President-Mnangagwa-9.jpg",
            "description": "Zvamaida Murwira, Senior Reporter President Mnangagwa has directed Government ministries, departments and agencies to ensure that entrepreneurship initiatives spearheaded by youths are fully supported so they form part of mainstream businesses and economic development. This is part of the Government’s youth empowerment programme, which is the bedrock of the Second Republic. The President said this […]",
            "time": "08:28",
            "date": "24 Feb 2025"
        },
        {
            "title": "Govt, millers efforts avoid hunger after severe drought",
            "url": "https://www.herald.co.zw/govt-millers-efforts-avoid-hunger-after-severe-drought/",
            "content": "Precious Manomano, Herald Reporter\n\nJoint efforts by the Government and private sector to ensure that Zimbabweans had enough food despite the crippling El Nino-induced drought last year, have been a major success with neither food shortages seen nor any market rigging.\n\nWhen it became obvious early last year that the maize harvest would be well below what was needed after the rains failed, the Government moved swiftly to ensure that there would be adequate supplies for its own major food relief programme and that there would be enough mealie-meal for all urban and commercial requirements.\n\nThe maize reserves held by the Grain Marketing Board (GMB)from previous good seasons, plus the modest commercial deliveries expected last year, were committed to the Government programmes.\n\nThe private sector, the millers, were told they would have to import all their requirements until this years harvest was being delivered to the GMB.\n\nSo, between April last year and February 2 this year, the private sector has imported 1 349 877 tonnes of grain, including 1 127 411 tonnes of maize, 220 092 tonnes of wheat and 374 tonnes of wheat flour, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere announced after last Tuesdays Cabinet meeting.\n\nAnd there are still adequate stocks of maize with the GMB, he said, to supply the ongoing Government programmes for rural families that will continue until the new harvest starts being reaped in April, a harvest that is expected to be good considering the good, if late, rains that Zimbabwe is now enjoying.\n\nThe major Government programme ensured that all rural families who were going to be short of food had regular rations of grain, and the urban vulnerable received modest payments that allowed them to buy mealie-meal.\n\nWhile the private sector was responsible for the imports, the Government did not ration licences and was actively monitoring the import volumes, stock levels at mills and market prices to prevent any potential arbitrage opportunities that could arise from sudden price fluctuations. These did not happen.\n\nThe goal was to maintain a steady supply of grain, preventing any shortages. While almost all mealie meal in Zimbabwe for some months has come from imported grain, there are no shortages in the shops and all brands are available for sale in the competitive market as the private millers did their share of the joint programme.\n\nMajor efforts were made before the present season to make sure all farmers had adequate inputs in light of the forecast reasonable rains so summer harvests could be boosted from 744 000 tonnes in the previous season to an ambitious target of 3,2 million tonnes this year.\n\nPreliminary data indicates that about 99 percent of the targeted maize area has been planted, raising hopes for a bountiful harvest.\n\nIn a recent interview, Lands, Agriculture, Fisheries, Water and Rural Development Permanent Secretary Professor Obert Jiri underscored the importance of collaboration between the Government and private sector in tackling food insecurity.\n\nImpactful partnerships are critical in boosting food security in our country. The involvement of private players has been instrumental in complementing Government efforts to avert hunger, he said.\n\nGrain Millers Association of Zimbabwe national chairperson, Mr Tafadzwa Musarara said that imports had to be done carefully to ensure that there was enough food. Banks have been careful in loans for imports to ensure that supplies were adequate without the risk of oversupply through imports.\n\nHarsh trading terms from source markets in South Africa made importing more complex.\n\nDespite the hurdles, Mr Musarara remains optimistic about the private sectors ability to support Government efforts in combating hunger.\n\nWe are ready to continue supporting the Government to end hunger among our citizens, he said.\n\nIn response to the ongoing food challenges, the Government has implemented several strategies aimed at mitigating hunger and improving food security.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Dr-Jenfan-Muswere.jpg",
            "description": "Precious Manomano, Herald Reporter Joint efforts by the Government and private sector to ensure that Zimbabweans had enough food despite the crippling El Nino-induced drought last year, have been a major success with neither food shortages seen nor any market rigging. When it became obvious early last year that the maize harvest would be well […]",
            "time": "08:28",
            "date": "24 Feb 2025"
        },
        {
            "title": "President to lead ground-breaking of US$3,6bn industrial park",
            "url": "https://www.herald.co.zw/president-to-lead-ground-breaking-of-us36bn-industrial-park/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nPresident Mnangagwa is expected in Beitbridge today for the ground-breaking ceremony of the Palm River Energy and Metallurgical Special Economic Zone (SEZ) where the Government, in collaboration with a Chinese mining company, is developing a US$3,6 billion energy industrial park.\n\nThe project, located 20km west of Beitbridge town, seeks to introduce the production of stainless steel.\n\nThe energy and steelworks initiative has already employed 400 locals in its first year, with the expectation that it will ultimately employ over 2 000 workers once it becomes fully operational.\n\nEstablishment of the industrial park as an integrated mining and energy hub follows discussions between chairman of Palm River Energy, Mr Xong Xi Dong and President Mnangagwa.\n\nThe project will cover 5 100 hectares within an SEZ and is expected to make substantial contributions to Zimbabwes mining and energy sectors.\n\nThe first phase of the project is being carried out through a joint venture between the Government, Xintai Resources and Tuli Coal.\n\nThe park comprises a coking plant that will have an annual capacity of producing one million tonnes of coke, a ferro-chrome smelting plant that will produce 100 000 tonnes of high-carbon ferro-chrome, and a 1 200MW coal-fired thermal power plant.\n\nAny surplus electricity will be transmitted to the national grid, while the ferro-chrome plant will facilitate the production of special and stainless steel and castings.\n\nCoal supply to the project will be obtained from Tuli Coal Mine and, in line with plans to export coal products to international markets, will yield significant foreign currency earnings.\n\nThe mining sectors role in Zimbabwes economy cannot be overemphasised, as it represents over 60 percent of the countrys export receipts and attracting more than 50 percent of foreign direct investment (FDI).\n\nIt also contributes 13 percent to national Gross Dommestic Product, creating more business opportunities downstream, and generating tax revenue for the Government.\n\nMines and Mining Development Ministry deputy director communications, advocacy and mining community sustainability, Mr Wilfred Munetsi said the stage had been set for the Head of State and Governments visit to Beitbridge.\n\nWe have covered a lot of ground in terms of planning and we are ready for the ground-breaking of the project by President Mnangagwa, he said.\n\nThe project covers an area of 5,163 hectares and is planned to be constructed in five phases, with a total construction period of 12 years.\n\nThe construction period of the first phase of the project is two years, with a total investment of US$237 million, mainly used for the construction of an annual output of 200 000 tonnes of ferrochrome and supporting coal mines, coking, infrastructure and other projects.\n\nIn order to meet the raw materials required for production in the park, resource guarantee bases have been established in Tuli and Wanji respectively.\n\nMr Munetsi said upon completion of the Palm River Energy and Metallurgical SEZ, the project will become the worlds lowest comprehensive cost and the most competitive energy and metallurgical special economic zone of the whole industry chain.\n\nAmong other things the project realises the recycling of energy, photovoltaic green power, coke oven, submerged heat furnace tail gas power generation, chromium iron water, liquid chromium slag, dust removal flue gas waste heat power generation, and the generated energy is reused for industrial projects in the park.\n\nMr Munetsi said besides creating thousands of jobs, the project will also provide technical training to Zimbabwean workers, improve their professional ability and realise the integration of teaching and practice of technology transfer and ability improvement.\n\nIn 2018, President Mnangagwa declared Beitbridge town a SEZ as part of the Second Republics drive to attract investment under the Zimbabwe is open for business mantra.\n\nGovernments adoption of the SEZ model aims to enhance FDI and improve local business viability, leading to increased employment and economic growth in targeted areas.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Palm-River.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau President Mnangagwa is expected in Beitbridge today for the ground-breaking ceremony of the Palm River Energy and Metallurgical Special Economic Zone (SEZ) where the Government, in collaboration with a Chinese mining company, is developing a US$3,6 billion energy industrial park. The project, located 20km west of Beitbridge town, seeks to introduce […]",
            "time": "08:28",
            "date": "24 Feb 2025"
        },
        {
            "title": "Competitiveness summit to solve critical economic issues",
            "url": "https://www.herald.co.zw/competitiveness-summit-to-solve-critical-economic-issues/",
            "content": "Business Reporter\n\nTHE National Competitiveness Commission Summit held in Bulawayo last week could not have come at any better time, given growing calls from the business community for authorities to look into constraints weighing down Zimbabwes businesses.\n\nPresident Mnangagwa headlined the event, demonstrating the Governments commitment and desire to continue improving business conditions to support business and economic growth.\n\nThe President had already shown that his administration was alive to the urgent need to address the multiplicity of issues hindering business operations across the economy, including regulations, fees and permits administered by statutory bodies.\n\nChallenges weighing on business include multiple taxes, exchange rate disparities, restrictive regulations, the growing informal sector and high costs of and limited power supply.\n\nAt the NCC Summit in Bulawayo, industry leaders said regulatory and compliance costs constituted about 18 percent of total overheads, making it difficult for businesses, especially micro, small and medium enterprises (MSMEs) to operate viably.\n\nFurthermore, these requirements discourage informal businesses from transitioning into the formal economy.\n\nThe Government is already working on various interventions to address challenges afflicting businesses, including initiatives under the Zimbabwe Industrial Reconstruction and Growth Plan (ZIRGP) 2024-2025, which seeks to improve the ease of doing business and competitiveness.\n\nThe strategy acknowledges that the industry faces high regulatory and utility costs, negatively impacting manufacturing.\n\nTo address the issues, the Ministry of Industry and Commerce, through the National Competitiveness Commission (NCC), is carrying out regulatory impact assessments to review regulations that hinder competitiveness.\n\nEconomic analysts who spoke to The Herald at the weekend said resolving the issues affecting business would greatly improve the countrys investment climate and attract both domestic and foreign direct investment (FDI).\n\nLower regulatory costs and improved infrastructure, they said, would significantly reduce business risks and encourage investors to commit long-term capital.\n\nAt the summit, President Mnangagwa reiterated his Governments efforts and commitment to improving Zimbabwes business environment through streamlining regulations, addressing infrastructure gaps and fostering innovation.\n\nIn his keynote address at the summit, President Mnangagwa, reaffirmed the Governments commitment to swiftly addressing business concerns.\n\nThe Second Republic is fully aware of the challenges facing businesses and is intensifying efforts to establish a conducive operating environment that fosters innovation and investment, he said.\n\nThis will strengthen the competitiveness of the countrys manufacturing sector, particularly now that the African Continental Free Trade Area Agreement is in effect.\n\nI encourage stakeholders to seize the new market opportunities arising from these evolving trade conditions. Therefore, ensuring the competitiveness of our countrys goods and services remains crucial.\n\nAll sectors must commit to the competitiveness agenda and elevate it to new heights.\n\nProposed interventions by the Government and its arms will include streamlining business regulations, reducing compliance costs, and eliminating bureaucratic inefficiencies.\n\nIf implemented effectively, it is expected that the reforms would enhance Zimbabwes ease of doing business rankings, making the country more attractive to both domestic and foreign investors.\n\nAddressing power supply gaps ranks among the biggest priorities economic analysts believe the Government and key stakeholders should address urgently. Economist Ms Gladys Shumbambiri-Mutsopotsi believes this could be a game-changer.\n\nStable and affordable electricity supply is fundamental for industrial expansion. Without it, productivity remains constrained, and economic growth is stunted, she said.\n\nIf power infrastructure is strengthened, industries could experience lower operational costs, leading to increased output and higher economic growth.\n\nThe Governments commitment to infrastructure development, particularly in transport, is expected to enhance logistical efficiency and reduce costs for businesses.\n\nEconomic analyst Namatai Maeresera said: Zimbabwes road and rail network has suffered years of under investment. Improving transport infrastructure will not only ease domestic trade, but also facilitate regional exports.\n\nEnhanced connectivity could also make the country a more competitive business hub in the Southern African Development Community (SADC) region.\n\nAdditionally, the focus on value addition and beneficiation of raw materials signals a strong desire to shift towards industrialisation.\n\nIndustrialist Dr Nxaba Ndiweni weighed in saying, Value addition in key sectors like mining and agriculture is crucial for sustainable development. It creates jobs, strengthens value chains, and boosts foreign exchange inflows.\n\nIf these measures are executed effectively, Dr Ndiweni said, Zimbabwe investment climate could improve, attracting more foreign direct investment (FDI), driving economic growth and export performance.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/National-Competitiveness-Commission.jpg",
            "description": "Business Reporter THE National Competitiveness Commission Summit held in Bulawayo last week could not have come at any better time, given growing calls from the business community for authorities to look into constraints weighing down Zimbabwe’s businesses. President Mnangagwa headlined the event, demonstrating the Government’s commitment and desire to continue improving business conditions to support […]",
            "time": "08:28",
            "date": "24 Feb 2025"
        },
        {
            "title": "First Lady’s Agric4she, school feeding programmes get boost",
            "url": "https://www.herald.co.zw/first-ladys-agric4she-school-feeding-programmes-get-boost/",
            "content": "Tendai Rupapa, Senior Reporter\n\nFIRST Lady Dr Auxillia Mnangagwas initiatives through her Angel of Hope Foundation and Agric4She programme, have charmed an Australia based organisation, GLOSTA, which has expressed willingness to support the programmes by empowering women through livestock breeding, embryo transfer, animal herd in cattle, both for meat and dairy.\n\nThe newly formed women empowerment project also has new breeds for goats and sheep which are crucial in a family.\n\nUnder the programme, beneficiaries will receive highly modified animal herds to enhance milk production.\n\nIt is not only about bringing external genetics, but also the organisation can work with what is already in the country and scientifically improve the genetics, the First Lady was told.\n\nThe programme will also see beneficiaries accessing offspring or dairy cows of good quality genes.\n\nThe technology also allows the propagation of more animals over a short period.\n\nSpecialising in improving livestock and agricultural performance, the organisations livestock sciences division focuses on five key innovation and commercialisation streams.\n\nThese include programmes dedicated to conservation and genetic preservation.\n\nAnimal genetic resources for food and agriculture encompass the variability of genes, traits and breeds of the different animal species that play a role in food and agriculture.\n\nAgric4SHE patron First Lady Dr Auxillia Mnangagwa flanked by Zimbabwean Ambassador to Australia and New Zealand Mr Joe Tapera Mhishi and Dr Andrew Mataruse during a meeting with the team from Glosta Mr James Scuderi, Mr Farai Wadyehwata and Mr Munya Mugari in Australia yesterday on embryo transfer technology meant to increase livestock productivity\n\nHighly modified cows and goats can produce more milk and have other desirable traits, such as disease resistance and fertility, hence, the partnership between GLOSTA and Angel of Hope Foundation will be a game changer in the field of women in agriculture and nutrition to kids in hospitals, and through the schools feeding programme.\n\nGLOSTA intend to work directly with the women of Zimbabwe through their Agric4She patron, Dr Mnangagwa.\n\nThey said when they visited Zimbabwe, they heard and learnt a lot about AoHFs empowerment projects, the Agric4She programme and how the mother of the nation was working tirelessly, coming up with initiatives to empower women and youths.\n\nThe GLOSTA team includes several of the worlds leading animal and livestock science experts, with extensive experience in research, academia and commercial realisation across the globe.\n\nThe Agric4She programme being spearheaded by Dr Mnangagwa encompasses Pfumvudza4She, Livestock4She, Fisheries4She, Horticulture4She, NEAPS4She, and Mechanisation4She, Banana4She, Poultry4She, Fisheries4She, benefiting thousands of women across the country.\n\nIn the meeting, Zimbabwean Ambassador to Australia and New Zealand Mr Joe Tapera Mhishi, introduced Amai Mnangagwa and her delegation to the GLOSTA team, giving insight into what the organisation does.\n\nWe thank you for meeting with and welcoming our women empowerment champion, the First Lady, Dr Auxillia Mnangagwa. Amai, this organisation has a passion for advanced livestock genetics.\n\nThey want to work directly with you in supporting your women in farming vision. They take livestock genetics a step higher, where they are focusing on artificial insemination. They want to take this to a higher level. They want to go beyond embryo flushing and go into invitro fertilisation, this has many advantages.\n\nFor me, its the rate at which one can propagate animal species, both cattle and goats. From one cow, you are able in a month to propagate as many cows using their technology and there are also other benefits in terms of the disease resistance of the animal species they are bringing to Zimbabwe, and the food convention ratios that come with the animal they are proposing to breed. They are also saying its not only about bringing external genetics but they can work with what you have in your country because the system they use helps you to select the genes and be able to identify how best to improve what you already have, which is another positive that comes with the invitro fertilisation project, he said. GLOSTA founding partner, Mr James Scuderi, highlighted to Amai Mnangagwa the benefits of the project.\n\nWe visited Africa last year, and Professor Verma was with us. His background is in stem cell biology and embryology. Given the interest we have in Africa, particularly Zimbabwe, the GLOSTA advanced herd system was put together as a proposal.\n\nIts a herd development programme. It can be applied equally as a technology transfer arrangement to cattle, goats, and sheep. It allows you to accelerate all the natural imitations of natural breeding. Its not genetically modified. There is no gene editing, theres no cloning, the team that weve got are probably some of the best around the world.\n\nThis brings the worlds best and most integrated technologies and bundles them into one particular package. We understand Zimbabwe is a unique country with a love for livestock production and farming. The people of Zimbabwe are wonderful and I hope we can engage actively and produce results, he said.\n\nAngel of Hope Foundation patron First Lady Dr Auxillia Mnangagwa, Ambassador Mhishi, Pastors Michael Dooley, Faitele Seia, Helen Seia and Ruth Pasi pose for a photograph after their meeting in Sydney, Australia, yesterday\n\nHe added that the organisation has experts who did studies in respect of herd growth.\n\nIt is very much related to starting volumes and because the embryos can be gender specific, so effectively we can choose male and female breed specification and also a little bit of climate specificity and theres some disease control elements in there as well, he said.\n\nDr Mnangagwa welcomed the development.\n\nI am happy with this programme. Women are doing wonders in agriculture. If I start it as the First Lady and Agric4She patron, women will benefit a lot. Women are hard workers and I promise you, this is going to be a success.\n\nWomen bring results and this will come into fruition. We want to also teach those in the rural areas, they should also benefit as we leave no place and no one behind. If you teach these women how to do it, they will yield results. I work with communities, especially women, including widows, youths and young couples, she said.\n\nDr Mnangagwa always emphasises the crucial role women play in ensuring food security and nutrition, advocating for their recognition and support in agriculture.\n\nShe added that this new project will also help her in her schools feeding programme as children require drinking milk therefore, eradicating diseases.\n\nUnder the Agric4She initiative, women receive essential inputs, chemicals, and machinery to enhance their agricultural activities, thanks to their patron.\n\nPastors Michael Dooley, Faitele Seia, Helen Seia and Ruth Pasi appreciated Angel of Hope Foundation patron Dr Auxillia Mnangagwas life-changing initiatives in Zimbabwe and pledged to partner Dr Auxillia Mnangagwa in mobilising resources to enhance her philanthropic initiatives during their meeting in Sydney, Australia yesterday\n\nAmai Mnangagwa also shared the vast work that she is doing back home, highlighting the work that she is doing through her Agric4She programme capturing the imagination of guests.\n\nShe said women bore the brunt of challenges in their homes, hence the focus on them in most of her programmes.\n\nMr Farai Wadyehwata, who is GLOSTA Regional representative, weighed in, expressing his organisations keeness to work with Dr Mnangagwa in empowering women in agriculture.\n\nPeople, mainly women, will benefit from this initiative, and Amai, we are happy to travel to Zimbabwe at your invitation anytime, and then we can set the ball rolling, he said.\n\nAnother regional representative, Mr Munyaradzi Mugari, said the initiative will benefit a lot of people in Zimbabwe since the majority are into agriculture.\n\nWe think that we can meet all these National Development Strategies by ensuring that communal farmers benefit from this programme. Over 70 percent of our people are in the agricultural sector and if we uplift these people, it means we have uplifted the majority of people in Zimbabwe given the percentage.\n\nThe GLOSTA team further discussed possible areas of collaboration with the mother of the nation through her foundation.\n\nThey promised to pay a reciprocal visit to Zimbabwe for exchange programmes.\n\nAngel of Hope Foundation patron First Lady Dr Auxillia Mnangagwa, Ambassador Mr Joe Tapera Mhishi Dr Andrew Mataruse and Mrs Kezina Sibanda follow proceedings during a meeting in Sydney Australia yesterday with Pastors Michael Dooley, Faitele Seia, Helen Seia and Ruth Pasi who have partnered Dr Auxillia Mnangagwa in her philanthropic initiatives she is undertaking in Zimbabwe\n\nDr Andrew Mataruse, who is part of the First Ladys delegation, said the embryo transfer technology was important.\n\nThere is a trypogen technology which allows us to have an animal that comes in with infection resistance or disease resistance, longevity in terms of the lifespan, increased fertility rates and higher immune yield.\n\nWe know that we have been always used to pure breeds, but with the trypogen pathway they are crossing three animals so the genes that are coming up are strong and genes with a better quality animal that is coming through.\n\nSo what is critical is that with the First Ladys Agri4She, the programme allows the mother and child that are in the underprivileged society to be able to access the offspring or dairy cows through this programme. The technology allows us to propagate more animals over a short period of time.\n\nSo, I will give you an example, that a heifer is expensive in Zimbabwe. With this technology, we can bring the cost of producing an animal, a dairy animal for instance, and within the scope of that figure, we can actually generate about six cows coming in from that pricey figure, he said.\n\nAs time evolves, we are going to be having a more ripple effect and more amplification factors. So, now with this programme, the First Lady will be able to reach out to underprivileged households.\n\nThere is true benefit in terms of nutritional support for milk, being a protein source, providing us with fat, vitamins, and therefore eradicating things like Kwashiorkor and marasmus in the context of children.\n\nWe also know that it is a very good source of calcium, very important for bone health and growth of children. So, we think that this programme would go a long way. And as we are fighting hunger and providing food security, we think that this genetic programme, three-way gene with embryo transfer, will be a game changer for food security in Zimbabwe.\n\nMeanwhile, Amai Mnangagwa also met pastors who expressed keenness to partner her Angel of Hope Foundation in assisting the vulnerable groups.\n\nThey paid glowing tribute to Amai Mnangagwa for her sterling work in the field of philanthropy.\n\nA documentary detailing Dr Mnangagwas breath-taking works and social interventions was beamed giving the world a glimpse into what she is doing for the people of Zimbabwe, mainly women and the girl child.\n\nThey paid glowing tribute to Amai Mnangagwa for her hard work.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/FL1-5.jpg",
            "description": "Tendai Rupapa, Senior Reporter FIRST Lady Dr Auxillia Mnangagwa’s initiatives through her Angel of Hope Foundation and Agric4She programme, have charmed an Australia based organisation, GLOSTA, which has expressed willingness to support the programmes by empowering women through livestock breeding, embryo transfer, animal herd in cattle, both for meat and dairy. The newly formed women […]",
            "time": "08:28",
            "date": "24 Feb 2025"
        },
        {
            "title": "Govt starts allocating urban stands to war vets",
            "url": "https://www.herald.co.zw/govt-starts-allocating-urban-stands-to-war-vets/",
            "content": "Patrick Chitumba, Midlands Bureau\n\nGovernment has started allocating urban stands to war veterans, a crucial element of its strategy to promote social justice and address historical imbalances.\n\nThe programme will be implemented across the countrys 10 provinces, allowing war veterans to establish homes and embark on entrepreneurial ventures.\n\nIn addition, the stands can be used as collateral for bank loans, offering veterans a pathway to financial empowerment.\n\nLast Friday, 63 veterans from the Midlands Province received their title deeds at a ceremony in Gweru presided over by the Minister of Veterans of the Liberation Struggle Affairs, Monica Mavhunga.\n\nAddressing the war veterans and Government officials, Minister Mavhunga said the urban land allocation marks a significant step towards improving their livelihoods.\n\nIt is with great honour and pride that I stand before you today to preside over this significant handover ceremony of 63 residential stands to our esteemed veterans of the liberation struggle here in the Midlands Province, she said.\n\nMinister Mavhunga said the event highlighted the Second Republics unwavering commitment to the welfare and empowerment of liberation war veterans, in line with the national Constitution of 2013 and the Veterans of the Liberation Struggle Act, which provide for resettlement benefits as a means of recognising and supporting veterans.\n\nAllow me to extend my sincere gratitude to President Mnangagwa for his visionary leadership in ensuring that veterans receive the recognition and support they so rightly deserve.\n\nThrough his guidance, the Second Republic established the Ministry of Veterans of the Liberation Struggle Affairs, dedicated to addressing the concerns and welfare of those who sacrificed for the freedom and independence of our great nation, she said.\n\nThe Ministry, Minister Mavhunga affirmed, is determined to uplift and empower veterans in all aspects of their lives, recognising that housing and land ownership are fundamental to economic empowerment.\n\nIt is in this spirit that we have gathered here today to witness the allocation of stands to you, veterans of the liberation struggle, many of whom have remained without proper housing for years.\n\nThis initiative directly targets marginalised comrades who do not have homes, ensuring that no veteran is left behind, she said.\n\nMinister Mavhunga highlighted that the initiative is a crucial component of a broader veterans empowerment agenda, aligned with Vision 2030 of transforming Zimbabwe into an empowered upper-middle-income economy by 2030.\n\nShe said the Government recognises that national development cannot be achieved without uplifting those who laid the foundation for independence.\n\nTherefore, empowering veterans contributes to socio-economic progress, as they are key stakeholders in nation-building, she said.\n\nTo achieve this, Minister Mavhunga said collaboration with other ministries will continue, ensuring veterans benefit from their 20 percent quota in all sectors of the economy, including mining, agriculture, and tourism, and receive the necessary support.\n\nThis includes linking veterans with investors to capitalise and operationalise projects. Other areas of support include enabling veterans access to mining facilities, farming inputs in an orderly manner within their districts with the assistance of their district field officers, as well as access to spaces for vending, she said.\n\nMinister Mavhunga expressed gratitude to the Ministry of Local Government for allocating vending stalls at the recently constructed Mbare Musika Market, noting that while 100 veterans are set to benefit initially, more will be considered as the initiative expands.\n\nThe Veterans Investment Corporation (VIC), the Ministrys investment company, reports to me as the responsible Minister assigned to oversee the administration of the Veterans of the Liberation Struggle (VLS) Fund.\n\nThe primary objective of VIC is to generate income for the VLS Fund, which will be disbursed for the empowerment of veterans to improve their livelihoods, she said.\n\nThe Government will continue implementing programmes focused on economic empowerment, education, and health services for veterans, fulfilling President Mnangagwas mandate to ensure that no one and no place is left behind.\n\nMinister Mavhunga said they were grateful to the Ministry of Local Government and Public Works for implementing the 20 percent quota directive from Cabinet in the allocation of land and housing to veterans.\n\nIn this context, we are here to witness the handover of 106 stands that have been allocated to veterans in various provinces.\n\nHowever, we have chosen to hold this handover ceremony here in Gweru because the bulk of the stands, 63, are in the Midlands Province, she said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Monica-Mavhunga.jpg",
            "description": "Patrick Chitumba, Midlands Bureau Government has started allocating urban stands to war veterans, a crucial element of its strategy to promote social justice and address historical imbalances. The programme will be implemented across the country’s 10 provinces, allowing war veterans to establish homes and embark on entrepreneurial ventures. In addition, the stands can be used […]",
            "time": "08:28",
            "date": "24 Feb 2025"
        },
        {
            "title": "EDITORIAL COMMENT: Crime must never be allowed to pay",
            "url": "https://www.herald.co.zw/editorial-comment-crime-must-never-be-allowed-to-pay/",
            "content": "Criminals who steal large sums of money or property, and this includes those who steal through fraud and corruption, can regard subsequent arrest and a jail term as a business risk that they can cope with when set against their criminal gains.\n\nThey will do the time so long as when they come out they can enjoy the wealth of laundered criminal gains.\n\nA lot of effort has been made in recent times to make sure they cannot. Almost 40 years ago an innovative High Court judge, backed enthusiastically on the automatic appeal by the Supreme Court, brought in the concept of mitigation in arrears, that is a criminal could have a decent chunk of their jail term suspended if they paid back the money they stole or gave equivalent value.\n\nThe argument was that if they had given up their criminal gains before the trial, that would have been considered seriously mitigating when it came to sentence. The judge thought this could be extended to having the same chance of mitigation after sentence, since victims often wanted their money back more than they wanted the criminal to spend ever so many years in jail, although some sort of punishment was needed.\n\nThis has often worked. Even those criminals who first grit their teeth in court and decide to do the time change their minds after a few months behind bars, and there have been a number of cases when those in jail have urgently sought an extension of the time they were granted to raise the funds to benefit from the suspension of some years of their term.\n\nAt the same time the law has long allowed a civil ruling at the conclusion of many criminal cases for identified stolen property to be returned. There has been a growing enthusiasm by the prosecuting authorities and the Zimbabwe Anti-Corruption Commission to go for a civil seizure of assets that have been probably acquired through dishonesty.\n\nThis takes care of both the cases where there was a conviction, and so the high standard of criminal proof is involved, and these days in cases where a conviction was impossible, since there was no proof beyond a reasonable doubt. But in a civil case there is only need for a balance of probabilities, so it is quite possible for a person to be acquitted of theft or corruption, but still lose the property they acquired with the proceeds of that probable theft or corruption.\n\nBut that still leaves the criminal who squandered the cash they stole, and so cannot return it, or has managed to hide the money or has even managed to launder it so that it cannot be traced. And they might well be ready to do the time because they cannot return it, having squandered it, or because they do not wish to cut into their own legal assets to find the equivalent.\n\nProsecutor-General Justice Loice Mutanda-Moyo has made it clear in her long drive to make sure that no crime will pay by seeking property orders both to strip criminals of their gains and as a serious deterrent against those who think they can get away with crime or at least cannot suffer more harshly than a few years behind bars.\n\nThe National Prosecuting Authority found an ideal test case to take to the High Court, a criminal who had been convicted of embezzling money from their employer and although offered a suspension of two years of the subsequent jail term if they paid it back had decided to serve the extra two years. But their former employer was still missing the stolen money.\n\nThe authority investigated, and found that the thief had a property with a market value about three times the value of what was stolen. But detailed investigations suggested that this property had been built up using legal funds and so there could not be the automatic civil order to make the thief disgorge their illegal gains.\n\nSo the authority went to the High Court seeking an order that they could seize and sell that property, extract the value of the stolen money, and then give the former owner the change.\n\nThe case was properly heard, with the thief having legal representation. But the judge was convinced by the National Prosecuting Authoritys argument that crime cannot be allowed to pay and that victims of crime are entitled to compensation.\n\nSo he granted the order wanted. We would guess that this, being a partial extension of existing law and so setting a precedent, is likely to go on appeal to the Supreme Court. But it is only a very modest extension of the existing law, since we and many others believe that a thief does have a debt to those he stole from.\n\nAnd doing the time does not repay that debt and the victim is still minus what was stolen.\n\nThe new ruling makes it clear that the punishment for the crime, the sentence granted after the criminal trial, can be separated from the need to compensate the victim in a subsequent civil action.\n\nWe would in fact go further and would like to see the courts becoming more assertive in the need to compensate victims of crime, and not just those who have had property or money stolen. In other cases, such as assault, it is possible to sue for damages in a civil court, with any criminal conviction making it clear that there is no argument about the assault, only about how much should be paid.\n\nHowever, the cost of a legal action is often high, since lawyers have to be hired and a difficult criminal can push the legal costs unaffordably high through delaying tactics and the like.\n\nSome of those who have sued for damages have discovered that they eventually win less than the cost of their lawyer, or that the criminal has inadequate assets to fulfil the court judgment.\n\nSomething more automatic for damages accompanying criminal cases would, we believe, be a useful extra deterrent so that victims of crime are not just a witness to the crime and helping to secure the conviction, but can be helped to recover from the crime.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/08/Justice-Matanda-Moyo.jpg",
            "description": "Criminals who steal large sums of money or property, and this includes those who steal through fraud and corruption, can regard subsequent arrest and a jail term as a “business risk” that they can cope with when set against their criminal gains. They will do the time so long as when they come out they […]",
            "time": "08:28",
            "date": "24 Feb 2025"
        },
        {
            "title": "MUNYONGA INSPIRES ZIM TO T20I VICTORY",
            "url": "https://www.herald.co.zw/munyonga-inspires-zim-to-t20i-victory/",
            "content": "Brandon Moyo, Zimpapers Sports Hub\n\nTONY MUNYONGA played a brilliant knock for Zimbabwe, steering the Chevrons to a thrilling three-wicket win in the second T20I cricket match against Ireland at Harare Sports Club yesterday.\n\nThe 26-year-old, making a return to the national set-up, ensured his opportunity counted with an unbeaten 43 runs that saw Zimbabwe chase down a challenging total.\n\nThe Chevrons had been written off early on in their chase.\n\nThe match ended in a tense finish, with Zimbabwe needing 13 runs off the last two overs.\n\nRichard Ngarava was crucial in the penultimate over, smacking the first ball for four runs and following up with another four off the third delivery.\n\nThree singles brought the Chevrons to within two runs of victory.\n\nWith Ngarava facing the first ball of the final over, he took a single, leaving Munyonga to seal the win with a brilliant cover drive for four runs.\n\nMunyongas innings came off just 30 balls, with a strike rate of 143.33, and his heroics handed Zimbabwe a 1-0 lead in the three-match series, putting them one step away from claiming the trophy.\n\nThe series opener on Saturday had been abandoned due to rain.\n\nIn yesterdays match, Zimbabwe won the toss and elected to field first. They restricted Ireland to 137/8 in their 20 overs before reaching 141/7 with four balls to spare. Ngarava gave Zimbabwe a brilliant start with the ball, dismissing Paul Stirling for just one run in the first over.\n\nA 53-run partnership between Lorcan Tucker and Harry Tector followed, but Zimbabwe broke the stand with Tectors dismissal for 28 runs off 20 balls, courtesy of Sikandar Raza. Tucker, who was caught for 46 runs off 40 balls, fell just short of his half-century.\n\nCurtis Campher was the only other Ireland batter to reach double figures, contributing 26 runs off 25 balls.\n\nTrevor Gwandu was the pick of the Zimbabwean bowlers, finishing with impressive figures of 3/24 from his four overs. Raza claimed two wickets for 22 runs, while Ngarava registered figures of 2/38.\n\nBlessing Muzarabani picked up the other wicket, finishing with 1/21 from his four-over spell.\n\nIn Zimbabwes run chase, they were off to a poor start, with Craig Young causing chaos in the top order. The Chevrons were reduced to 14/3 in just four overs, with Young claiming three wickets.\n\nHowever, Raza and Ryan Burl stabilised the innings with a 48-run fourth-wicket partnership before Burl was caught for 27 runs.\n\nRaza was dismissed shortly after for 22 runs.\n\nTashinga Musekiwa fell to Young, leaving Zimbabwe in dire straits at 11/7 after 17 overs. It was then that Munyonga and Ngarava fought back, adding a crucial 29 runs for the eighth wicket. Munyonga finished un-beaten on 43, with Ngarava supporting him with 12* off 7 balls, guiding Zimbabwe to victory.\n\nThe series decider is scheduled for tomorrow at the same venue.\n\nZimbabwe will need a win to seal the series, while Ireland will be hoping to bounce back and level the series 1-1.\n\nMeanwhile, on the domestic front, Ernest Masuku claimed two wickets for Tuskers late on day three of their Logan Cup match against Mega Market Mountaineers at Queens Sports Club, putting the Bulawayo side ahead going into the final day.\n\nTuskers had posted 422 runs in their second innings, having earlier bowled out Mountaineers for 308.\n\nAt stumps, Mountaineers were 67/2, still trailing by 47 runs.\n\nMasuku had taken the wickets of Joylord Gumbie (6) and Nick Welch (19). Alistair Frost (24) and Clive Chitumba (13) will resume for Mountaineers on day four, with play set to resume at 10am today.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/TONY-MUNYONGA.jpg",
            "description": "Brandon Moyo, Zimpapers Sports Hub TONY MUNYONGA played a brilliant knock for Zimbabwe, steering the Chevrons to a thrilling three-wicket win in the second T20I cricket match against Ireland at Harare Sports Club yesterday. The 26-year-old, making a return to the national set-up, ensured his opportunity counted with an unbeaten 43 runs that saw Zimbabwe […]",
            "time": "08:28",
            "date": "24 Feb 2025"
        },
        {
            "title": "NOIC wins appeal",
            "url": "https://www.herald.co.zw/noic-wins-appeal/",
            "content": "Fidelis Munyoro, Chief Court Reporter\n\nThe National Oil Infrastructure Company of Zimbabwe (NOIC) has emerged victorious in its appeal, successfully overturning a High Court decision that had ordered it to pay US$164 631 to AC Controls for refurbishing the Mabvuku ethanol plant.\n\nThe Supreme Court swept aside the arbitral award that had earlier been upheld by the lower court and dismissed NOICs attempt to settle the debt in Zimbabwean dollars at a rate of 1:1.\n\nFor NOIC, the battle began with an arbitral award that it vehemently opposed, arguing that the decision was a stark violation of the countrys public policy.\n\nThe oil company contended that the arbitrators findings were flawed, arbitrary, and contrary to the dictates of Statutory Instrument 33 of 2019 (SI 33/2019).\n\nAt the centre of the dispute was the interpretation of this statutory instrument, which established that debts incurred before February 22, 2019, denominated in US dollars, were to be converted into local currency at the rate of 1:1.\n\nThe arbitrator, however, had directed NOIC to pay AC Controls in United States dollars, a decision that the High Court upheld despite NOICs insistence that it contravened national law.\n\nNOICs arguments in the High Court found no favour.\n\nThe lower court dismissed the companys application to set aside the arbitral award and granted AC Controls counter-application to register the award as an enforceable court order.\n\nThe High Court, emphasising the sanctity of arbitration decisions, held that it would only interfere in rare instances where there was evidence of a grave and fundamental error.\n\nFrustrated but undeterred, NOIC escalated the matter to the Supreme Court, seeking salvation from what it viewed as a gross miscarriage of justice.\n\nThe Supreme Court, composed of Justices Nicholas Mathonsi, George Chiweshe, and Hlekani Mwayera, dissected the legal quagmire.\n\nJustice Mwayera, writing for the court, delivered a judgment that not only vindicated NOIC but also reinforced the supremacy of the law.\n\nShe underscored that the parties contract, though initially denominated in United States dollars, was subject to the provisions of SI 33/2019.\n\nBy disregarding this statutory instrument, the arbitrator and the High Court had strayed from the law, creating a precedent that could sow chaos and uncertainty in the countrys legal and economic systems.\n\nThe finding that the debt had to be settled in United States dollars in clear defiance of SI 33/2019 was contrary to public policy and had the effect of undermining the concept of justice in Zimbabwe, she declared.\n\nThe court concluded that the arbitrators decision was a misinterpretation of the law and amounted to a departure from the statutory framework governing monetary obligations.\n\nTo uphold such an award, the Supreme Court ruled, would be to condone a violation of public policy.\n\nThe judgment restored clarity and order. The Supreme Court set aside the High Courts ruling, quashed the arbitral award, and dismissed AC Controls application to register it as an enforceable court order.\n\nJustice Mwayera emphasised that adherence to SI 33/2019 was non-negotiable, as it was the legal anchor for resolving disputes over debts denominated in foreign currency during the countrys currency transition.\n\nNOICs legal counsel, Professor Lovemore Madhuku, had argued that the debt owed to AC Controls accrued prior to the effective date of SI 33/2019.\n\nProf Madhuku submitted that the arbitrators directive to pay in United States dollars not only contravened the statutory instrument but also violated public policy.\n\nHe further contended that the timing of the payment certificates issued by AC Controls was irrelevant to the date on which the debt became due.\n\nThe Supreme Courts decision validated his arguments, upholding the principle that public policy must guide the interpretation and enforcement of contractual obligations.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/12/court-hammer.jpg",
            "description": "Fidelis Munyoro, Chief Court Reporter The National Oil Infrastructure Company of Zimbabwe (NOIC) has emerged victorious in its appeal, successfully overturning a High Court decision that had ordered it to pay US$164 631 to AC Controls for refurbishing the Mabvuku ethanol plant. The Supreme Court swept aside the arbitral award that had earlier been upheld […]",
            "time": "08:28",
            "date": "24 Feb 2025"
        },
        {
            "title": "Village heads warned against selling State land",
            "url": "https://www.herald.co.zw/village-heads-warned-against-selling-state-land/",
            "content": "Trust Freddy, Herald Correspondent\n\nVillage heads or traditional leaders found selling or facilitating the sale of State land will be considered land barons and will face arrest, a Cabinet Minister has warned, urging anyone with concrete evidence to come forward.\n\nThe announcement follows revelations that village heads, particularly in peri-urban areas such as Domboshawa, Seke, Nyabira, Rusape, and Chesa Farm, have settled over 10 000 people through an illicit syndicate.\n\nThe syndicate reportedly involves ordinary villagers selling their land and sharing the profits with the village head, who admits home seekers into the village, forges documents, and facilitates their authentication up to the chief, who reportedly also receives a share of the spoils.\n\nStanding in for Local Government and Public Works Minister Daniel Garwe during a question and answer session in the National Assembly last week, Foreign Affairs and International Trade Minister, Professor Amon Murwira, said: If there are village heads selling land, we call them land barons.\n\nIt is illegal, with regard to law; they are supposed to be arrested. That is Government policy or that is the law. If there is anyone with concrete evidence like what the Honourable Member alluded to, these people must be arrested, that is Government policy.\n\nProf Murwira was responding to the chairperson of the Parliamentary Portfolio Committee on Local Government, Public Works and National Housing, Cde Albert Nyakuedzwa, who wanted to know Governments policy on village heads selling land in peri-urban areas, claiming that they had settled over 10 000 people.\n\nIn a supplementary question, another Member of Parliament alleged that some Government workers responsible for overseeing the issue of village heads parcelling out land were aware of the illegal settlements, but failed to prevent them.\n\nHowever, Prof Murwira said if Government workers were knowingly allowing such illegality to occur, it should be deemed corruption.\n\nThe issue that he is raising is that there are people that work for the Government and local authorities who may know what is happening and all that.\n\nThat is what we call corruption, and that is why we have laws that deal with corruption, which must prosecute those people who commit corruption. The question again is, is there such law? The law is there.\n\nFirstly, they are not supposed to sell land illegally. If they do that, they will be prosecuted. Secondly, people who see people selling land illegally and just keep quiet are also involved in corruption; they will also be arrested. Corruption is illegal; selling land is illegal, he said.\n\nNational Housing and Social Amenities Minister Zhemu Soda said traditional leaders have no authority to parcel out State land.\n\nThe Constitution says on availability of resources, Government is supposed to do that work. So, if the resources are limited, that is when you discover that there will be slow progress and all those people expected to get accommodation and stands may not get them timeously, he said.\n\nHe warned those illegally parcelling out land of long jail sentences.\n\nLand barons will not be asked to make any contribution except that they will be directed to go to prisons, said Minister Soda.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/02/Professor-Amon-Murwira.jpg",
            "description": "Trust Freddy, Herald Correspondent Village heads or traditional leaders found selling or facilitating the sale of State land will be considered land barons and will face arrest, a Cabinet Minister has warned, urging anyone with concrete evidence to come forward. The announcement follows revelations that village heads, particularly in peri-urban areas such as Domboshawa, Seke, […]",
            "time": "08:28",
            "date": "24 Feb 2025"
        }
    ]
}