{
    "news": [
        {
            "title": "Littlerock International School executive principal, bursar up for fraud",
            "url": "https://www.herald.co.zw/littlerock-international-school-executive-principal-bursar-up-for-fraud/",
            "content": "Prosper Dembedza-Herald Correspondent\n\nLittlerock International Schools executive principal Chamunorwa Gracious Dahwa and bursar Ms Tambudzai Majuru have appeared in court on allegations of defrauding their employer of US$289 997.\n\nMajuru and Dahwa were facing two counts of fraud when they appeared before Harare magistrate Mr Donald Ndirowei.\n\nThey both pleaded guilty prompting the magistrate to defer the matter to Thursday for sentencing.\n\nIt is the States case that Dahwa and Majuru connived to steal the schools funds. The court heard that Majuru was responsible for buying receipt books and receipting funds received from parents who had their children enrolled at the school while Dahwa was an executive principal responsible for the overall management of school affairs in Harare and Norton,\n\nMajuru ordered a receipt book bearing the Littlerock International School logo with serial numbers 201 to 400 from DH Solutions (Private) Limited, Harare but did not declare this to the school.\n\nThe court heard that on 308 occasions, Majuru received money on behalf of the school and receipted it on the schedule.\n\nInstead of remitting the funds to the school authority, she connived with Dahwa and they converted the funds to their own use.\n\nOn June 7, 2024, the complainant got a tip off about the theft and filed a police report. On June 8 2024, detectives went to Dahwas residence with Majuru where a search was conducted leading to the recovery of a receipt book serial numbers 201 to 400.\n\nThe receipt book was used to receipt school funds amounting to US$80 073 The book was seized on exhibit seizure confirmation receipt number 0110747 and Majuru signed for it. Majuru was subsequently arrested and she implicated accused Dahwa.\n\nFurther investigations carried out revealed that Majuru ordered receipt books from DH Solutions Private Limited, Harare for receipting of school funds as per her routine duties.\n\nDuring the same period, she ordered duplicate receipt books from the same company bearing the same serial numbers to commit the offence.\n\nThey receipted some of the money they received in the official receipt books and remitted the money to the school authority.\n\nMajuru and Dahwa receipted the funds they received on duplicate receipt books and converted the money to personal use.\n\nThe accused persons then destroyed the duplicate receipt books to conceal evidence. During the course of investigations, some parents of students submitted receipts to the school authority.\n\nIt was established that information on the said receipts was authored by Majuru but do not match official receipts and all the money included therein was never remitted to the school authority.\n\nOn July 9, 2024, the recovered receipt book serial numbers 201 to 400 and the exhibits seizure confirmation receipt number 0110747 were taken to the Questioned Document Examiner for forensics.\n\nThe forensic expert concluded that the receipt book in question was authored and signed by Majuru. She also signed on the exhibits seizure confirmation receipt number 0110747 as acknowledgment of the recovery of the receipt book.\n\nThe recovered receipt book serial numbers 201 to 400, copies of duplicate receipts, copies of official receipts with unremitted funds, exhibits seizure confirmation receipt number 0110747 and forensic report from the Questioned Document Examiner and an audit report may be produced in court as exhibits.\n\nThe total value of money misappropriated by the accused persons was US$289 997 and nothing was recovered.\n\nFrom the misappropriated funds, US$150 847 was confirmed and verified through available records while the remainder of US$139 150 was not accounted for since it was recorded in the duplicate receipt book that was destroyed.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/08/Fraud.jpg",
            "description": "Prosper Dembedza-Herald Correspondent Littlerock International School’s executive principal Chamunorwa Gracious Dahwa and bursar Ms Tambudzai Majuru have appeared in court on allegations of defrauding their employer of US$289 997. Majuru and Dahwa were facing two counts of fraud when they appeared before Harare magistrate Mr Donald Ndirowei. They both pleaded guilty prompting the magistrate to […]",
            "time": "20:38",
            "date": "03 Feb 2025"
        },
        {
            "title": "Mashonaland West to expel Cde Geza",
            "url": "https://www.herald.co.zw/mashonaland-west-to-expel-cde-geza/",
            "content": "Conrad Mupesa\n\nMashonaland West Bureau\n\nThousands of Zanu PF cadres have converged at the NorthCourt Stadium in Zvimba East Constituency to pass a resolution to expel renegade war veteran and Zanu PF Central Committee member, Cde Blessed Geza.\n\nCde Geza recently made headlines after calling for President Mnangagwas resignation.\n\nZanu PF senior officials, including war veterans, Politburo, Central Committee and provincial members are in attendance.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/99f66225-342c-4701-bbfd-98b87f4baf49-680x380.jpeg",
            "description": "Conrad Mupesa Mashonaland West Bureau Thousands of Zanu PF cadres have converged at the NorthCourt Stadium in Zvimba East Constituency to pass a resolution to expel renegade war veteran and Zanu PF Central Committee member, Cde Blessed Geza. Cde Geza recently made headlines after calling for President Mnangagwa’s resignation. Zanu PF senior officials, including war […]",
            "time": "20:38",
            "date": "03 Feb 2025"
        },
        {
            "title": "Man dies in hippo attack",
            "url": "https://www.herald.co.zw/man-dies-in-hippo-attack/",
            "content": "Walter Nyamukondiwa\n\nMashonaland West Bureau Chief\n\nA Kariba fisherman died after a hippo hit the dinghy boat he was travelling in and caused it to capsize.\n\nNgoni Chikwezvero (61) of Gatche Gatche fishing camp went fishing with Tafadzwa Billiat (45) and on approaching Tsetse Island, a hippo attacked the boat and it capsized.\n\nThe hippo attacked Chikwezvero and he drowned while Billiat managed to swim to safety.\n\nMashonaland West acting police spokesperson Assistant Inspector Effort Chapoto confirmed the incident\n\nThe dinghy boat was attacked by a hippopotamus and it capsized. The hippopotamus then attacked Ngoni Chikwezvero, causing him to drown, said Assistant Inspector Chapoto.\n\nBilliat managed to swim to the shore and made a report to the police on February 2 at around 3.40 pm.\n\nPolice managed to retrieve one of his limbs that was floating in the lake and Chikwezveros brother Freddy positively identified it as that of his brother.\n\nAssistant Inspector Chapoto urged fishers to use proper boats that are not susceptible to hippo attacks.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/11/zrp.jpg",
            "description": "Walter Nyamukondiwa Mashonaland West Bureau Chief A Kariba fisherman died after a hippo hit the dinghy boat he was travelling in and caused it to capsize. Ngoni Chikwezvero (61) of Gatche Gatche fishing camp went fishing with Tafadzwa Billiat (45) and on approaching Tsetse Island, a hippo attacked the boat and it capsized. The hippo […]",
            "time": "20:38",
            "date": "03 Feb 2025"
        },
        {
            "title": "Government resuscitates Road Maintenance Units",
            "url": "https://www.herald.co.zw/government-resuscitates-road-maintenance-units/",
            "content": "Freeman Razemba\n\nSenior Reporter\n\nThe Government has started resuscitating all Road Maintenance Units countrywide to ensure that all the roads that were rehabilitated under the Emergency Road Rehabilitation Programme Phase 2 (ERRP2) remain in good condition.\n\nThe 108 maintenance units fall under the Ministry of Transport and Infrastructural Development.\n\nTransport and Infrastructural Development Minister Felix Mhona launched the resuscitation of the units in Harare today (Monday).\n\nThis comes after the Zimbabwe National Roads Administration (Zinara) recently secured two million litres of fuel to support road authorities in their projects countrywide.\n\nZinara is also supporting the Department of Roads with the resuscitation of the units that will provide first-line road maintenance services across the country.\n\nMinister Mhona was accompanied by Deputy Minister Joshua Sacco, Permanent Secretary Engineer Joy Makumbe, chairperson of the Portfolio on Transport and Infrastructural Development Cde Tawanda Karikoga and other senior Government officials.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Screenshot-54-680x380.png",
            "description": "Freeman Razemba Senior Reporter The Government has started resuscitating all Road Maintenance Units countrywide to ensure that all the roads that were rehabilitated under the Emergency Road Rehabilitation Programme Phase 2 (ERRP2) remain in good condition. The 108 maintenance units fall under the Ministry of Transport and Infrastructural Development. Transport and Infrastructural Development Minister Felix […]",
            "time": "20:38",
            "date": "03 Feb 2025"
        },
        {
            "title": "Gweru police nab three cattle rustlers",
            "url": "https://www.herald.co.zw/gweru-police-nab-three-cattle-rustlers/",
            "content": "Midlands Bureau\n\nThree Zvishavane suspected cattle rustlers were arrested after selling meat to unsuspecting customers in Gweru.\n\nThe three are Enock Mpofu (32) of Eastlea Park, Zvishavane; Chrispen Matondo Zikhali (40) of Isaiah Park, Zvishavane and Tanaka Murereka (24) of Council Park, Zvishavane.\n\nMidlands Provincial police spokesperson Inspector Emmanuel Mahoko said Zihkali is an ex-convict who has done jail time for stock theft.\n\nChrispen Matondo Zikhali was in prison twice for stock theft in Zvishavane and Gweru, he said.\n\nInspector Mahoko said a Toyota Probox was hired from Zvishavane to Gweru by the rustlers on January 21.\n\nThe gang drove along the Gweru-Mvuma Road during the night.\n\nAlong the way in Lalapanzi, the driver was surprised to see his passengers chasing after and attempting to capture the cattle they saw near the road, he said.\n\nThey managed to capture and slaughter one beast near Hwahwa Medium Prison Complex. They transported the meat and delivered it to some houses in Mkoba, Gweru, he said.\n\nHowever, Gweru Rural police officers managed to arrest Mpofu in Mandava, Zvishavane. Zikhali and Murereka were arrested at Top Ten shops in Mkoba 5, Gweru.\n\nA fourth suspect, Bongani Ncube, is still on the run,  he said.\n\nInspector Mahoko said the police searched some houses in Mkoba and recovered about 50kgs of meat, the head of a cow, hide and tools used to slaughter it, including an axe, ropes and knives.\n\nThe owner of the stolen cow has been identified.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/stock-theft-680x380.jpg",
            "description": "Midlands Bureau Three Zvishavane suspected cattle rustlers were arrested after selling meat to unsuspecting customers in Gweru. The three are Enock Mpofu (32) of Eastlea Park, Zvishavane; Chrispen Matondo Zikhali (40) of Isaiah Park, Zvishavane and Tanaka Murereka (24) of Council Park, Zvishavane. Midlands Provincial police spokesperson Inspector Emmanuel Mahoko said Zihkali is an ex-convict […]",
            "time": "20:38",
            "date": "03 Feb 2025"
        },
        {
            "title": "Binga man fined for unlawful hunting",
            "url": "https://www.herald.co.zw/binga-man-fined-for-unlawful-hunting/",
            "content": "Anesu January\n\nHerald Correspondent\n\nA Binga man has been fined for illegally hunting in Chizarira National Park.\n\nEmmanuel Mupindu (48) was arraigned before the Binga Magistrates Court facing charges of unlawful hunting as defined in Section 24(1)(b) of the Parks and Wildlife Act Chapter 20:14.\n\nHe was ordered to pay a fine of US$200 and US$3 000 to Zimbabwe Parks and Wildlife Authority as compensation.\n\nCircumstances are that on January 29, Mupindu hunted three duikers with a spear and dogs in the national park without a permit.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/courthammer-680x380.jpg",
            "description": "Anesu January Herald Correspondent A Binga man has been fined for illegally hunting in Chizarira National Park. Emmanuel Mupindu (48) was arraigned before the Binga Magistrates’ Court facing charges of unlawful hunting as defined in Section 24(1)(b) of the Parks and Wildlife Act Chapter 20:14. He was ordered to pay a fine of US$200 and […]",
            "time": "20:38",
            "date": "03 Feb 2025"
        },
        {
            "title": "Israeli escalation in West Bank sparks calls for urgent international action",
            "url": "https://www.herald.co.zw/israeli-escalation-in-west-bank-sparks-calls-for-urgent-international-action/",
            "content": "Ivan ZhakataHerald CorrespondentAs Israeli military operations in the occupied West Bank enter their 14th consecutive day, the Palestinian Ambassador to Zimbabwe, Tamer Almassri has condemned the escalating violence, calling for urgent international intervention.The attacks, which have primarily targeted Palestinian refugee camps in Jenin, Al-Fara, Tulkarm, and the town of Tamoun, have resulted in at least 25 Palestinian deaths, with dozens more injured and detained.This is a blatant and systematic campaign of ethnic cleansing, Ambassador Almassri said.The Israeli occupation forces are demolishing homes, bombing refugee camps, and displacing thousands of innocent civilians. This is nothing short of a war crime, and the international community must act immediately.The humanitarian situation in the affected areas has deteriorated significantly, with reports of widespread destruction.According to Palestinian officials, more than 15 000 people have been forcibly displaced in Jenin alone, as Israeli airstrikes and military raids continue to devastate civilian infrastructure.Eyewitness accounts from Jenin describe scenes of chaos and destruction, with residents left homeless amid the rubble.Israeli forces have also besieged the Martyr Thabet Thabet Governmental Hospital and the Israa Specialized Hospital, severely hampering medical crews ability to assist the wounded.This is a clear violation of international humanitarian law, Ambassador Almassri said.Targeting medical facilities and obstructing ambulances is a crime under the Geneva Conventions. Israel must be held accountable for these atrocities.The Palestinian leadership has formally requested an emergency session of the United Nations Security Council to address the situation.However, previous attempts to hold Israel accountable have often faced diplomatic roadblocks, particularly from its key allies.Political analysts suggest that unless international pressure intensifies, the cycle of violence and forced displacement will continue unchecked.Rights organisations, including the United Nations and Amnesty International, have previously condemned Israels actions in the occupied territories, but enforcement mechanisms remain weak.The world cannot stand idly while Israel continues its systematic campaign against the Palestinian people, Ambassador Almassri said.We demand immediate action to stop these war crimes and ensure justice for our people.As tension rises in the region, protests have erupted in several cities worldwide, with demonstrators calling for an end to Israeli aggression and stronger global condemnation.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/06/b1551032-c00b-4828-aa7d-9b702338e385-680x380.jpeg",
            "description": "Ivan Zhakata Herald Correspondent As Israeli military operations in the occupied West Bank enter their 14th consecutive day, the Palestinian Ambassador to Zimbabwe, Tamer Almassri has condemned the escalating violence, calling for urgent international intervention. The attacks, which have primarily targeted Palestinian refugee camps in Jenin, Al-Far’a, Tulkarm, and the town of Tamoun, have resulted […]",
            "time": "20:38",
            "date": "03 Feb 2025"
        },
        {
            "title": "Munetsi linked with Wolves move",
            "url": "https://www.herald.co.zw/munetsi-linked-with-wolves-move/",
            "content": "Zimpapers Sports Hub\n\nEnglish Premiership side are reportedly chasing Zimbabwe national football team vice-captain Marshall Munetsi as their prime target on the transfer deadline day.\n\nReports in France and England are suggesting that the 28-year-old midfielder was close to making the move from French Ligue 1s Stade de Reims after negotiations between the two sides reached an advanced stage.\n\nAccording to Daily Telegraph journalist Mike McGrath, an agreement is said to be close to being signed.\n\nHowever, with the deadline day set to end in a few hours, the Molineux club will have to act swiftly in order to get the deal over the line.\n\nWolves are close to agreeing a deal with Reims for Munetsi. The 28-year-old Zimbabwe international has been a regular in Ligue 1 for five seasons and targeted to bolster Vitor Pereiras midfield, McGrath wrote on X.\n\nWolves are also home to another Zimbabwean international Tawanda Chirewa and striker Leon Chiwome who also carries the Zimbabwean heritage.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Screenshot-53-680x380.png",
            "description": "Zimpapers Sports Hub English Premiership side are reportedly chasing Zimbabwe national football team vice-captain Marshall Munetsi as their prime target on the transfer deadline day. Reports in France and England are suggesting that the 28-year-old midfielder was close to making the move from French Ligue 1’s Stade de Reims after negotiations between the two sides […]",
            "time": "20:38",
            "date": "03 Feb 2025"
        },
        {
            "title": "Boy (12) drowns while swimming",
            "url": "https://www.herald.co.zw/boy-12-drowns-while-swimming/",
            "content": "Conrad Mupesa\n\nMashonaland West Bureau\n\nA 12-year-old Chinhoyi boy drowned on Saturday while swimming in Hunyani River with a friend.\n\nActing provincial police spokesperson, Assistant Inspector Effort Chapoto confirmed the incident.\n\nThe boy, identified as Wallace Kavhukatema, was a student at Alpha College Primary School.\n\nAround 1230 hours on February 1, the boy and his 11-year-old friend went to swim in the river. Unfortunately, Wallace drowned, said Assistant Inspector Chapoto.\n\nWallaces friend rushed to inform Consider Chimulambi (23). Chimulambi rushed to the scene and retrieved the body.\n\nChemagamba Police attended the scene and conveyed the body to Chinhoyi Provincial Hospital mortuary for post-mortem.\n\nAssistant Inspector Chapoto said there is an increase in drowning cases around Mashonaland West Province.\n\nMore measures need to be taken to avoid such incidents. Parents are urged to monitor their children and ensure their safety.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/11/zrp.jpg",
            "description": "Conrad Mupesa Mashonaland West Bureau A 12-year-old Chinhoyi boy drowned on Saturday while swimming in Hunyani River with a friend. Acting provincial police spokesperson, Assistant Inspector Effort Chapoto confirmed the incident. The boy, identified as Wallace Kavhukatema, was a student at Alpha College Primary School. “Around 1230 hours on February 1, the boy and his […]",
            "time": "20:38",
            "date": "03 Feb 2025"
        },
        {
            "title": "Operation Chenesa extends to Glen View",
            "url": "https://www.herald.co.zw/operation-chenesa-extends-to-glen-view/",
            "content": "Talent Chimutambgi\n\nHerald Reporter\n\nGovernment has intensified efforts to address the waste management challenges bedevilling Harare.\n\nSpeaking during the launch of Operation Chenesa Phase Three in Glen View, Local Government and Public Works Minister Daniel Garwe said proper solid waste management is in line with the aspirations of an upper-middle income society.\n\nProper solid waste management is in line with President Mnangagwas clarion call for a clean and healthy environment, which is part of the attainment of Vision 2030, said Minister Garwe.\n\nHe said maintaining a clean environment will go a long way in curbing the spread of diseases such as cholera.\n\nMinister Garwe applauded the collaboration between the Government and the private sector.\n\nThe launch of Operation Chenesa Phase Three was attended by the Minister of State for Harare Metropolitan Province and Devolution Senator Charles Tawengwa who underscored the need for proper waste management in Harare.\n\nThe ceremony was also attended by senior Government officials, the private sector, and other stakeholders.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Screenshot-52-680x380.png",
            "description": "Talent Chimutambgi Herald Reporter Government has intensified efforts to address the waste management challenges bedevilling Harare. Speaking during the launch of Operation Chenesa Phase Three in Glen View, Local Government and Public Works Minister Daniel Garwe said proper solid waste management is in line with the aspirations of an upper-middle income society. “Proper solid waste […]",
            "time": "20:38",
            "date": "03 Feb 2025"
        }
    ]
}