{
    "news": [
        {
            "title": "Urban Connect’s licence suspended following Beitbridge-Masvingo horror crash",
            "url": "https://www.herald.co.zw/urban-connects-licence-suspended-following-beitbridge-masvingo-horror-crash/",
            "content": "Bongani Ndlovu\n\nOnline Reporter\n\nGovernment has suspended Urban Connect Holdings (Pvt) Limiteds licence for six months after its bus killed 25 people in a head on collision with a haulage truck last Thursday along the Beitbridge-Masvingo highway.\n\nDuring the six months period, the companys fleet of buses will be unable to operate on the countrys roads.\n\nIn a statement today, Transport and Infrastructural Development Minister Felix Mhona said the bus involved in the accident did not have a valid Passenger Insurance Policy and route permit while the driver was non-compliant with retest requirements.\n\nThe above violations by the bus operator are a serious breach of the terms and conditions of the operators licence issued to the company for it to operate in Zimbabwe.\n\nInformed by the foregoing violations, I have directed the Commissioner of Road Motor Transportation to invoke provisions of Section 17(b)(i) of the Road Motor Transportation Act [Chapter 13:15] and suspend, with immediate effect, Urban Connect (Pvt) Ltd from operating all its omnibuses in all routes for a period of six months as we investigate further, he said.\n\nThe Minister expressed heartfelt condolences to the bereaved families and said the Government is mourning with the rest of the country.\n\nWe mourn the demise of innocent men and women, most of whom were breadwinners, who perished in this crash. Our thoughts are with all the families of the deceased, and our prayers are with those injured as they continue to receive treatment and care. We wish them a speedy recuperation, said Minister Mhona.\n\nIn light of the recent road fatalities, Minister Mhona said he has taken a bold stance to reduce road carnage by enforcing road laws and safety regulations.\n\nGoing forward, we shall build on this momentum of strict enforcement of road motor transportation and safety regulations for the safety and well-being of the people, said the Minister.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/89b11f6a-223c-4951-8ee3-52f546ce2345-680x380.jpeg",
            "description": "Bongani Ndlovu Online Reporter Government has suspended Urban Connect Holdings (Pvt) Limited’s licence for six months after its bus killed 25 people in a head on collision with a haulage truck last Thursday along the Beitbridge-Masvingo highway. During the six months period, the company’s fleet of buses will be unable to operate on the country’s […]",
            "time": "21:26",
            "date": "19 Feb 2025"
        },
        {
            "title": "Karoi man kills wife, headman and teen relative",
            "url": "https://www.herald.co.zw/karoi-man-kills-wife-headman-and-teen-relative/",
            "content": "Walter Nyamukondiwa\n\nMashonaland West Bureau Chief\n\nPolice in Mashonaland West province have launched a manhunt for a suspected serial murderer who killed his wife, a headman who had gone to counsel the couple and a relative.\n\nThe triple murder has shaken Mubaira Chani Village in Hurungwe under Chief Chundu where the suspect, Trymore Tore (37) killed his wife before dumping the body a few metres from the homestead.\n\nTore, who was married to his wife for the past three years, had frequent misunderstandings with his wife and on the fateful day, the couple had an altercation which allegedly drew the attention of headman Nyikadzino.\n\nIt is suspected that Tore held the headman hostage before killing him and a teenage relative Anet Nabwalo (17), who had allegedly gone to Tores homestead to watch a movie before meeting her fate.\n\nThe community became suspicious after days passed without the two returning to their respective home.\n\nA relative went to the homestead and allegedly found Tore at home but he professed ignorance on the whereabouts of his wife and the other missing persons.\n\nThe relative suggested to him that they should visit a prophet for insights into the whereabouts of the missing relatives.\n\nThis did not go down well with Tore who allegedly grabbed the relative before attempting to rape her.\n\nShe managed to escape before reporting the issue to the police. A search led to the discovery of Moleen Chabayanzaras body about 40 metres away from the homestead while headman Nyikadzino, Kuwesi Masawus body was found in a disused latrine with the head severed from the torso.\n\nThe teenager, Anets body was found buried in a shallow grave near a hut. Chief Chundu confirmed the incident and called for amicable ways of solving domestic disputes.\n\nIt is a very sad development where three lives have been lost. It must be noted that this man (Tore) had a known violent streak in the area, said Chief Chundu.\n\nNational police spokesperson Commissioner Paul Nyathi confirmed the tragic incident adding that investigations were in progress.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/10/Murder-investigation-.jpeg",
            "description": "Walter Nyamukondiwa Mashonaland West Bureau Chief Police in Mashonaland West province have launched a manhunt for a suspected serial murderer who killed his wife, a headman who had gone to counsel the couple and a relative. The triple murder has shaken Mubaira Chani Village in Hurungwe under Chief Chundu where the suspect, Trymore Tore (37) […]",
            "time": "21:26",
            "date": "19 Feb 2025"
        },
        {
            "title": "Delta Beverages investigates breach at Southerton brewery",
            "url": "https://www.herald.co.zw/delta-beverages-investigates-breach-at-southerton-brewery/",
            "content": "Online Reporter\n\nDelta Beverages Private Limited is investigating an alleged attempt by unidentified individuals to gain unauthorised access to its Southerton brewery through an underground storm-water drain.\n\nIn a statement, the company said the incident was discovered by employees on Monday.\n\nThe incident which was discovered in February 17 2025, by Delta Beverages employees, has not caused disruption to our operations, read the statement.\n\nWe are working closely with the police and responsible authorities to determine the veracity of the report and the possible motive and identity of the perpetrators.\n\nThe company urged anyone with information on the incident to contact the police or reach out to Delta Beverages directly.\n\nDelta Beverages, a leading manufacturer of lagers in Zimbabwe, operates one of the countrys largest distribution networks and is a key player in the brewing of beer and producing soft drinks.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Screenshot-2025-02-19T160014.723-680x380.png",
            "description": "Online Reporter Delta Beverages Private Limited is investigating an alleged attempt by unidentified individuals to gain unauthorised access to its Southerton brewery through an underground storm-water drain. In a statement, the company said the incident was discovered by employees on Monday. “The incident which was discovered in February 17 2025, by Delta Beverages employees, has […]",
            "time": "21:26",
            "date": "19 Feb 2025"
        },
        {
            "title": "VP leads tribute to Sekuru Kashiri",
            "url": "https://www.herald.co.zw/vp-leads-tribute-to-sekuru-kashiri/",
            "content": "Mukudzei Chingwere in MutareVice President Dr Constantino Chiwenga today joined the Muchinguri and Kashiri families in Mutare for the burial of Sekuru Leonard Mwatambandini Kashiri, father-in-law to Zanu PF National Chairman and Minister of Defence, Cde Oppah Muchinguri-Kashiri.Sekuru Kashiri, father to Reverend Antony Kashirihusband of Cde Muchinguri-Kashiripassed away last Friday at the age of 103.His burial took place this afternoon.Speaking on behalf of President Mnangagwa, VP Chiwenga paid tribute to Sekuru Kashiris remarkable life, describing him as an individual whose legacy would continue to inspire future generations.He was a devoted family man, a skilled building instructor and a passionate sportsman, said VP Chiwenga.His work in teaching bricklaying and concreting at St Faith Mission and Elise Gladhill High School left an indelible mark on our communities.The Vice President urged mourners to celebrate Sekuru Kashiris life rather than grieve his passing, emphasising his contributions to both his family and society.The funeral was attended by several high-ranking officials, including Deputy President of the Senate, Lieutenant General (Retd) Mike Nyambuya, as well as Ministers Cde Misheck Mugadza and Cde Mariam Chombo, among other senior Government officials and Zanu PF Politburo members.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Screenshot-83-1-680x380.png",
            "description": "Mukudzei Chingwere in Mutare Vice President Dr Constantino Chiwenga today joined the Muchinguri and Kashiri families in Mutare for the burial of Sekuru Leonard “Mwatambandini” Kashiri, father-in-law to Zanu PF National Chairman and Minister of Defence, Cde Oppah Muchinguri-Kashiri. Sekuru Kashiri, father to Reverend Antony Kashiri—husband of Cde Muchinguri-Kashiri—passed away last Friday at the age […]",
            "time": "21:26",
            "date": "19 Feb 2025"
        },
        {
            "title": "BREAKING: SA 2025 Budget cancelled until further notice",
            "url": "https://www.herald.co.zw/breaking-sa-2025-budget-cancelled-until-further-notice/",
            "content": "The 2025 Budget Speech scheduled for 19 February has been cancelled and postponed to a date that is yet to be determined.This follows a disagreement between parties within the Government of National Unity (GNU) on the proposals within the budget.\n\nThe executive decided to adjourn and postpone the National Assemblys sitting to allow enough time to reassess the budget.\n\nThe budget is now expected sometime in March.\n\nThis is a developing story.\n\n Business Tech\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/0143097e-f358-4f86-ad73-eca111c16b5b-680x380.jpeg",
            "description": "The 2025 Budget Speech scheduled for 19 February has been cancelled and postponed to a date that is yet to be determined. This follows a disagreement between parties within the Government of National Unity (GNU) on the proposals within the budget. The executive decided to adjourn and postpone the National Assembly’s sitting to allow enough […]",
            "time": "21:26",
            "date": "19 Feb 2025"
        },
        {
            "title": "Digitrucks to be rolled out nationwide",
            "url": "https://www.herald.co.zw/digitrucks-to-be-rolled-out-nationwide/",
            "content": "Blessings Chidakwa\n\nHerald Reporter\n\nGovernment will roll out Digitrucks in all the countrys 10 provinces as it continues to enhance digital empowerment in line with attaining Vision 2030, Information Communication Technology and Courier Services Minister Dr Tatenda Mavetera has said.\n\nSpeaking at the launch of a Digitruck by President Mnangagwa at State House, Minister Mavetera said the National Development Strategy 1 identifies the digital economy as a key pillar of growth.\n\nMinister Mavetera said it is crucial to equip Zimbabweans with essential digital skills, enabling them to interact, innovate and thrive in the digital landscape.\n\nBy doing so, we are building a technologically proficient society capable of maximising digital innovation, she said.\n\nMinister Mavetera said the digital truck features a 10-kilowatt solar-powered system that supports a mobile digital laboratory, which also has batteries that can last for more than three days without recharging.\n\nShe said the truck can accommodate 20 students and one instructor, with each person having access to a laptop.\n\nAdditionally, there is a 65-inch smart screen for digital skills training.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/80e70037-96fd-48f7-a705-a7a88f6ddb2a-1-680x380.jpeg",
            "description": "Blessings Chidakwa Herald Reporter Government will roll out Digitrucks in all the country’s 10 provinces as it continues to enhance digital empowerment in line with attaining Vision 2030, Information Communication Technology and Courier Services Minister Dr Tatenda Mavetera has said. Speaking at the launch of a Digitruck by President Mnangagwa at State House, Minister Mavetera […]",
            "time": "21:26",
            "date": "19 Feb 2025"
        },
        {
            "title": "Digitruck to empower marginalised communities: Chinese Ambassador Zhou",
            "url": "https://www.herald.co.zw/digitruck-to-empower-marginalised-communities-chinese-ambassador-zhou/",
            "content": "Blessings Chidakwa\n\nHerald Reporter\n\nThe Digitruck initiative is aimed at enhancing digital empowerment for the Zimbabwean people, especially those in rural areas, Chinese Ambassador to Zimbabwe Zhou Ding has said.\n\nSpeaking at the launch of the Digitruck by President Mnangagwa at State House this morning, Ambassador Zhou said the initiative will improve peoples digital awareness and skills.\n\nHe encouraged the continuation of this endeavour to utilise digital technology and break down barriers.\n\nYour Excellency, the President, your unwavering dedication to modernisation, infrastructure expansion, and social equity is notable across the country and beyond, Ambassador Zhou said.\n\nWe are working on the exciting programme regionally. We are championing your noble philosophy of leaving no place and no one behind.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/03afa0e1-1971-44ae-ae0c-5688bd6ac71a-680x380.jpeg",
            "description": "Blessings Chidakwa Herald Reporter The Digitruck initiative is aimed at enhancing digital empowerment for the Zimbabwean people, especially those in rural areas, Chinese Ambassador to Zimbabwe Zhou Ding has said. Speaking at the launch of the Digitruck by President Mnangagwa at State House this morning, Ambassador Zhou said the initiative will improve people’s digital awareness […]",
            "time": "21:26",
            "date": "19 Feb 2025"
        },
        {
            "title": "Zimbabwe urges families to identify deceased relatives from South Africa’s “Operation Vala Umgodi”",
            "url": "https://www.herald.co.zw/zimbabwe-urges-families-to-identify-deceased-relatives-from-south-africas-operation-vala-umgodi/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nGovernment has appealed to families with missing relatives or friends in South Africa, particularly those who may have lost their lives during Operation Vala Umgodi, to come forward and assist in the identification of the deceased.\n\nIn a statement, the director of Public Diplomacy, Communication and Advocacy in the Ministry of Foreign Affairs and International Trade, Mrs Philisiwe Chidawanyika said it is important to identify the deceased to ensure a dignified burial for the deceased.\n\nWe are calling upon all Zimbabweans who may have relatives unaccounted for in South Africa, especially in the affected mining areas, to come forward and provide any information that may assist in the identification process, Mrs Chidawanyika said.\n\nShe said several unidentified bodies remain in mortuaries in South Africa following the crackdown on illegal mining activities in the Northwest Province, where Zimbabweans were among those affected.\n\nThe Government is working closely with South African authorities to ensure that the remains of the deceased are identified, and where possible, repatriated for proper burial, she said. We understand this is a distressing time for many families, and we are committed to assisting them throughout this process.\n\nFamilies and friends of missing persons are encouraged to bring photographs, medical or dental records, identification documents or any distinguishing details that could help confirm identities.\n\nThe Zimbabwean Consulate in Johannesburg has been designated as the point of contact for inquiries from Zimbabweans.\n\nThose within Zimbabwe can approach the nearest Zimbabwe Republic Police station or visit Provincial and District Social Welfare Offices under the Ministry of Public Service, Labour and Social Welfare.\n\nThe Government has assured the public that it is prioritising the matter and urged affected families to act swiftly.\n\nFor further inquiries, the Ministry of Foreign Affairs and International Trades Department of Consular Services and Protection of Zimbabwean Nationals Living Abroad is available to assist.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Screenshot-2025-02-19T134103.617-680x380.png",
            "description": "Ivan Zhakata Herald Correspondent Government has appealed to families with missing relatives or friends in South Africa, particularly those who may have lost their lives during “Operation Vala Umgodi,” to come forward and assist in the identification of the deceased. In a statement, the director of Public Diplomacy, Communication and Advocacy in the Ministry of […]",
            "time": "21:26",
            "date": "19 Feb 2025"
        },
        {
            "title": "School bursar jailed 10 years for embezzlement",
            "url": "https://www.herald.co.zw/school-bursar-jailed-10-years-for-embezzlement/",
            "content": "Online Reporter\n\nA 34-year-old woman who worked as a bursar at Littlerock International School in Harare has been sentenced to 10 years in prison for embezzling more than US$150 000 in school fees.\n\nTambudzai Majuru, of Kaseke Village in Dema, was convicted of theft and money laundering after it was proven that she misappropriated funds for more than two years.\n\nDelivering the ruling on Wednesday, Harare Regional Magistrate Donald Ndirowe initially sentenced Majuru to 10 years behind bars.\n\nHowever, three years were suspended on condition of good behaviour, while another three years were suspended on the condition that she repays the stolen amount.\n\nAs a result, Majuru will serve a total of four years in jail.\n\nThe court heard that Majuru used parallel receipt books to siphon US$289 997 through 309 fraudulent transactions between January 1, 2022, and May 2024.\n\nPolice recovered US$150 847 of the stolen funds.\n\nThe remainder could not be recovered, as Majuru allegedly destroyed financial records to cover her tracks.\n\nHarare South Provincial Public Prosecutor Tafara Chirambira led the States case.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/08/Arrested.jpg",
            "description": "Online Reporter A 34-year-old woman who worked as a bursar at Littlerock International School in Harare has been sentenced to 10 years in prison for embezzling more than US$150 000 in school fees. Tambudzai Majuru, of Kaseke Village in Dema, was convicted of theft and money laundering after it was proven that she misappropriated funds […]",
            "time": "21:26",
            "date": "19 Feb 2025"
        },
        {
            "title": "Nyabadza to walk free if Geza fails to attend court",
            "url": "https://www.herald.co.zw/nyabadza-to-walk-free-if-geza-fails-to-attend-court/",
            "content": "Prosper Dembedza\n\nHerald Correspondent\n\nThe State has been put on notice that if Blessed Runesu Geza does not appear in court on February 25, the court will remove former Agricultural and Rural Development Authority (Arda) board chairman Basil Nyabadza on remand.\n\nNyabadza is facing allegations of defrauding Geza of US$1 362 000 in a land deal.\n\nAccording to prosecutor Anesu Chirenje, Geza bought a piece of land measuring 42,3504 hectares from Nyabadza for US$1 362 000 on October 29, 2020.\n\nChirenje said Geza was granted sole authority to subdivide, develop, and sell the land.\n\nWhen the agreement of sale was done, Nyabadza allegedly misrepresented to Geza that the piece of land had title deeds which he would avail in a month. However, he failed to deliver.\n\nChirenje told the court that while Geza was in the process of obtaining subdivision permits for the land from the Department of Physical Planning in Mashonaland West Province, he discovered that Nyabadza had sold the same land to Velda Estates.\n\nThe court heard that Geza engaged Nyabadza hoping for an amicable solution, only to discover that his agreement of sale had been cancelled without his knowledge.\n\nThe matter was reported to the police, leading to Nyabadza being summoned to the courts.\n\nMagistrate Mazhande remanded the matter to January 31 for ruling on the application for exemption.\n\nGeza was prejudiced of US$1 362 000 and nothing was recovered.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/images-22.jpeg",
            "description": "Prosper Dembedza Herald Correspondent The State has been put on notice that if Blessed Runesu Geza does not appear in court on February 25, the court will remove former Agricultural and Rural Development Authority (Arda) board chairman Basil Nyabadza on remand. Nyabadza is facing allegations of defrauding Geza of US$1 362 000 in a land […]",
            "time": "21:26",
            "date": "19 Feb 2025"
        }
    ]
}