{
    "news": [
        {
            "title": "Live coverage: Zimbabwe bids farewell to national hero Cde Chigudu",
            "url": "https://www.herald.co.zw/live-coverage-zimbabwe-bids-farewell-to-national-hero-cde-chigudu-2/",
            "content": "All set for Cde Chigudus burial\n\nThousands of people from across the country are gathered at the National Heroes Acre for the burial of National Hero, Cde Tinaye Elisha Nzirasha Chigudu.\n\nBuses ferrying mourners from the provinces are still arriving, setting the stage for a huge send-off.\n\nThe former Zanu PF Manicaland provincial chairperson and a distinguished civil servant, Cde Chigudu, died last Wednesday and was declared a national hero by the President on Friday.\n\nChigudu a stern disciplinarian\n\nNational Hero, Cde Tinaye Elisha Nzirasha Chigudu, has been described as a stern no-nonsense disciplinarian.\n\nZanu PF Council of Elders member Cde David Parirenyatwa whose late father and national hero Tichafa Samuel Parirenyatwa worked with Cde Chigudu during the liberation struggle, said he was a straight forward man.\n\nYes, my father, as you know, was the vice president of ZAPU, before the formation of ZANU PF. They worked very closely with my father.\n\nThe type of person who was, what I can tell you, he was a stern disciplinarian, that I know, that he really loved discipline, he said.\n\nCde Parirenyatwa added: I think he has been well-recognized by his Excellency, the President, Dr Mnangagwa and I think its a well-deserved national national hero\n\nVice Presidents, Cde Kembo Mohadi and Dr Constantino Chiwenga have arrived at the National Heroes Acre for the burial of Cde Chigudu.\n\nThe body of national hero Cde Chigudu has arrived at the National Heroes Acre.\n\nPresident Mnangagwa and First Lady Amai Dr Auxillia Mnangagwa have arrived at the National Shrine for the burial of Cde Tinaye Elisha Nzirasha Chigudu.\n\nCde Chigudu remembered\n\nIn an interview on the sidelines, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere expressed gratitude to President Mnangagwa for bestowing national hero status on Cde Chigudu.\n\nMinister Muswere chronicled his personal relationship with the late national hero.\n\nPresidential Advisor Dr Paul Tungwarara said he learnt a lot from Cde Chigudu.\n\nVeterans of the Liberation Struggle Affairs Deputy Minister Headman Moyo said he worked with the national hero Cde Chigudu.\n\nCde Chigudu was among the first cadres to go to the liberation struggle under ZIPRA and he was a very principled cadre, he said.\n\nWe know him very well. He worked with us well before his demise.\n\nActing Minister of Home Affairs and Cultural Heritage Ziyambi Ziyambi is now on the podium to direct the ceremony.\n\nThe Chigudu family representative, Mr Edgar Chigudu says Cde Chigudu is also an icon in the family.\n\nHe thanks President Mnangagwa and the Government for bestowing national hero status on Cde Chigudu.\n\nCde Chigudu was a man of protocol, who always said mukuru mukuru hanga haigare pfunde.\n\nYes he was a political animal but never rigid as you could have an open and frank discussion with him, says Mr Chigudu.\n\nHe says the late national hero lives a legacy in the family as he loved his wife and family.\n\nMinister Ziyambi Ziyambi is back on the podium and chronicles briefly, Cde Chigudus pre and post-independence history.\n\nHe invites President Mnangagwa to give his keynote address.\n\nCde Chigudu was a loyal cadre: President Mnangagwa\n\nPresident Mnangagwa says Cde Chigudus passing is a huge blow to the nation and expresses his deepest condolences to the Chigudu family.He plays Cde Chigudu played a pivotal role in the liberation of the country from colonial rule.\n\nThe President says that Cde Chigudu was among many brave, selfless sons and daughters of the soil who took a stand and fought for our Independence.\n\nHe is honoured as one of the first combatants to be sent for training in North Korea under the Zimbabwe Peoples Revolutionary Army (ZIPRA), the military wing of the Zimbabwe African Peoples Union (ZAPU).\n\nHe was deployed as an intelligence operative in the then Salisbury.\n\nAfter the attainment of independence in 1980, the late National Hero, Cde Chigudu, joined the Government as an Assistant Secretary in the Ministry of Transport.\n\nDue to his hard work ethic and dedication to national service, he was promoted to Deputy Secretary in the Ministry of Home Affairs before his elevation to the position of Permanent Secretary in the same Ministry.\n\nCde Chigudu also served as Permanent Secretary in the Ministry of Mines, thereafter as Governor for Manicaland Province.\n\nHis Excellency says Cde Chigudu was a principled and ideologically rooted cadre who actively participated within the ruling ZANU PF Party and Government, with unflinching allegiance, loyalty and commitment.\n\nHe was a fountain of wisdom who offered sound counsel and advice in conducting both Party and Government business, drawing from his vast experience and institutional memory.\n\nHe always exuded the virtues of straight-forwardness and frankness in every aspect of life.\n\nHis integrity, sense of excellence, adherence to truth and honesty left an indelible mark on our body politic.\n\nPRESIDENT MNANGAGWAS ADDRESS AT THE BURIAL OF THE LATE NATIONAL HERO TINAYE CHIGUDU\n\nSpeech National Hero Cde Chigudu FINAL FINAL csd (_250210_103930\n\nThe body of national hero Cde Chigudu is now being taken to its final resting place.\n\nPresident Mnangagwa hands over the national flag to Mai Chigudu\n\nThe programme has ended at the National Heroes Acre.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/live1-680x380.jpg",
            "description": "All set for Cde Chigudu’s burial Thousands of people from across the country are gathered at the National Heroes Acre for the burial of National Hero, Cde Tinaye Elisha Nzirasha Chigudu. Buses ferrying mourners from the provinces are still arriving, setting the stage for a huge send-off. The former Zanu PF Manicaland provincial chairperson and […]",
            "time": "21:46",
            "date": "10 Feb 2025"
        },
        {
            "title": "Cde Chigudu’s legacy will live on: VP Chiwenga",
            "url": "https://www.herald.co.zw/cde-chigudus-legacy-will-live-on-vp-chiwenga/",
            "content": "Mukudzei Chingwere\n\nHerald Reporter\n\nThe late National Cde Tinaye Chigudu contributed immensely to the growth and success of the liberation movement, Vice President Dr Constantino Chiwenga has said.\n\nThe Vice President made the remarks in his condolence message following the death of Cde Chigudu last week.\n\nCde Chigudu was buried at the National Heroes Acre this (Monday) morning.\n\nThe Vice President said Zimbabwe has lost a great son of the soil, but emphasised that Cde Chigudus sacrifices and contributions will serve as a lasting inspiration for future generations.\n\nCde Chigudu was a distinguished and pioneering figure in the liberation struggle, said VP Chiwenga.\n\nIn 1964, he became one of the first Zimbabwe Peoples Liberation Army (ZIPRA) cadres to receive training in North Korea.\n\nUpon his return, he was deployed as an intelligence operative in Salisbury, now Harare, where his bravery, intellect, and strategic foresight contributed immensely to the growth and success of the liberation movement.\n\nHis ability to recruit urban cadres and provide critical intelligence was vital to the strategic operations of ZIPRA during the struggle for Zimbabwes freedom.\n\nHe said Cde Chigudus principles of hard work, dedication, loyalty and selflessness have left an indelible mark in politics and agricultural sectors of the nation.\n\nVP Chiwenga said in 1965, Cde Chigudu was captured by the Rhodesian regime but despite enduring the hardships of a brutal 12-year imprisonment at Gonakudzingwa and Hwahwa prisons, his resolve to achieve a free Zimbabwe never wavered.\n\nUpon his release, he immediately reunited with his fellow freedom fighters in Zambia, and furthered his law education at Exeter University in Britain, said VP Chiwenga.\n\nIn post-independence Zimbabwe, Cde Chigudu continued to serve with distinction at various senior levels in both Government and the ruling ZANU PF.\n\nHis commitment to national development was evident in his passionate involvement in Zimbabwes agrarian reforms, particularly through his successful farming activities in Makoni District.\n\nHe embodied the principles of hard work, dedication, loyalty and selflessness, leaving behind a lasting legacy in politics and the agricultural sector.\n\nWe take comfort in knowing that his legacy of service, unity and perseverance lives on in the progress and prosperity of our nation, said Dr Chiwenga.\n\nAs we bid farewell to our dear comrade, let us embrace his spirit of togetherness, peace, and unity.\n\nMay we draw strength from his example of hard work and selflessness in building a brighter future for Zimbabwe.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/vp-680x380.jpg",
            "description": "Mukudzei Chingwere Herald Reporter The late National Cde Tinaye Chigudu contributed immensely to the growth and success of the liberation movement, Vice President Dr Constantino Chiwenga has said. The Vice President made the remarks in his condolence message following the death of Cde Chigudu last week. Cde Chigudu was buried at the National Heroes Acre […]",
            "time": "21:46",
            "date": "10 Feb 2025"
        },
        {
            "title": "Chivhu woman ordered to pay US$2 786 for illegal water connection",
            "url": "https://www.herald.co.zw/chivhu-woman-ordered-to-pay-us2-786-for-illegal-water-connection/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nA 65-year-old Chivhu resident has been ordered to pay nearly US$2 800 to the Zimbabwe National Water Authority (ZINWA) after being convicted for illegally bypassing her water metre and accessing water for free for over a decade.\n\nMaud Funhiro was sentenced to 12 months in jail at the Chivhu Magistrates Court (Case CHIVP41/25) but the entire sentence was suspended on conditions including full restitution to ZINWA by May 30, 2025.\n\nThe court heard that Funhiro illegally diverted water from the ZINWA system into her home, fowl run and garden since 2014, avoiding payments for her usage.\n\nThe scheme was uncovered during a ZINWA operation aimed at reducing non-revenue water in Chivhu.\n\nThe magistrate suspended four months of her sentence for five years, provided she does not commit a similar offence during that period.\n\nThe remaining months were suspended on the condition that she repays the full amount owed.\n\nIn a statement, ZINWAs head of corporate communications and marketing Mrs Marjorie Munyonga commended the public for assisting in uncovering illegal water usage and urged citizens to report any suspected cases.\n\nThe case served as a warning to others who may be illegally accessing water, as authorities intensify efforts to curb such activities and recover lost revenue.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/06/convicted-word-red-frame-d-rendering-convicted-red-frame-130759894.jpeg",
            "description": "Ivan Zhakata Herald Correspondent A 65-year-old Chivhu resident has been ordered to pay nearly US$2 800 to the Zimbabwe National Water Authority (ZINWA) after being convicted for illegally bypassing her water metre and accessing water for free for over a decade. Maud Funhiro was sentenced to 12 months in jail at the Chivhu Magistrates Court […]",
            "time": "21:46",
            "date": "10 Feb 2025"
        },
        {
            "title": "Driver, conductor flee accident scene as bus overturns injuring 13",
            "url": "https://www.herald.co.zw/driver-conductor-flee-accident-scene-as-bus-overturns-injuring-13/",
            "content": "Conrad Mupesa Mashonaland West Bureau\n\nThe bus driver of a Sanyati-bound Nehoreka Bus and his conductor, fled from an accident scene recently after their bus overturned and landed on its left side at the 26-kilometre peg along the Kadoma-Sanyati Road.\n\nThe accident left 13 passengers seriously injured. The bus had 51 passengers on board.\n\nPosting on its X handle, the Zimbabwe Republic Police said investigations were underway.\n\n13 people were injured when a Nehoreka bus with 51 passengers on board overturned and landed on its left side, the police said.\n\nThe bus driver and the conductor fled from the scene.\n\nThe injured were taken to Kadoma General Hospital where they were admitted.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/04/accident-7.jpg",
            "description": "Conrad Mupesa Mashonaland West Bureau The bus driver of a Sanyati-bound Nehoreka Bus and his conductor, fled from an accident scene recently after their bus overturned and landed on its left side at the 26-kilometre peg along the Kadoma-Sanyati Road. The accident left 13 passengers seriously injured. The bus had 51 passengers on board. Posting […]",
            "time": "21:46",
            "date": "10 Feb 2025"
        },
        {
            "title": "Cllr Kadzombe to address service delivery issues",
            "url": "https://www.herald.co.zw/cllr-kadzombe-to-address-service-delivery-issues/",
            "content": "Diana Nherera\n\nSuburban Reporter\n\nWard 41 Councillor Kudzai Kadzombe has reassured residents of her ward of her dedication to addressing issues affecting the ward such as water, refuse collection, informal activities like invasions, vendors and other issues.\n\nIn statement, Cllr Kadzombe said there has been a spate of robberies and break-ins with some areas failing to establish effective neighbourhood watches to assist the police with patrols.\n\nI am organising a ZRP constabulary workshop for volunteers who would have passed through their vetting processes and I would like to take this opportunity to encourage communities to organise themselves and forward volunteers for the neighbourhood watch, name and logo and I will donate 10 reflector bibs and whistles for each and every neighbourhood watch, read the statement.\n\nI would like to encourage residents to be part of the Light Ward 41 programme and buy cheap solar lights that can be installed on roofs, poles, trees and precast walls for as little as $15.\n\nIf every household does this, our streets will no longer be dark and we can save lives and reduce crime activity as council will take many years to build and maintain the infrastructure.\n\nCllr Kadzombe urged residents who did not attend the ward masterplan meeting last week to sign the online form to make their contributions.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/kz-680x380.jpg",
            "description": "Diana Nherera Suburban Reporter Ward 41 Councillor Kudzai Kadzombe has reassured residents of her ward of her dedication to addressing issues affecting the ward such as water, refuse collection, informal activities like invasions, vendors and other issues. In statement, Cllr Kadzombe said there has been a spate of robberies and break-ins with some areas failing […]",
            "time": "21:46",
            "date": "10 Feb 2025"
        },
        {
            "title": "Women scalds husband with boiling cooking oil",
            "url": "https://www.herald.co.zw/women-scalds-husband-with-boiling-cooking-oil/",
            "content": "Conrad Mupesa Mashonland West Bureau\n\nA 40-year-old woman from Chief Chivero in Mhondoro-Mubaira has been arrested by Norton police for pouring boiling cooking on her husbands face over a misunderstanding.\n\nMelody Tambudzai is now facing attempted murder charges. Zimbabwe Republic Police confirmed the arrest on its X handle on Sunday.\n\nPolice in Norton arrested Melody Tambudzai (40) for attempted murder which occurred at Makava Village, Chivero, Mhondoro on 27/01/25. The suspect allegedly poured boiling cooking oil on her husbands face whilst he was asleep, said the ZRP.\n\nThe victim sustained facial burns and is currently hospitalised in Norton.\n\nInvestigations by the police also established that the couple had a long-standing domestic dispute over infidelity issues.\n\nThe accused is expected to be arraigned before the courts soon.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/12/Arrested.jpg",
            "description": "Conrad Mupesa Mashonland West Bureau A 40-year-old woman from Chief Chivero in Mhondoro-Mubaira has been arrested by Norton police for pouring boiling cooking on her husband’s face over a misunderstanding. Melody Tambudzai is now facing attempted murder charges. Zimbabwe Republic Police confirmed the arrest on its X handle on Sunday. “Police in Norton arrested Melody […]",
            "time": "21:46",
            "date": "10 Feb 2025"
        },
        {
            "title": "Manicaland, Masvingo receive heavy rains",
            "url": "https://www.herald.co.zw/manicaland-masvingo-receive-heavy-rains/",
            "content": "Precious Manomano\n\nHerald Reporter\n\nA cloud system has brought heavy rains to the southern regions of Manicaland and Masvingo provinces.\n\nAccording to the Meteorological Services Department (MSD), significant rainfall was recorded in several areas, with the highest measurements reported in Chimanimani Ward 10A  Chikukwa (148 mm), followed by Makohoholi (107 mm), and Chimanimani Ward 4  Nhedziwa (106 mm).\n\nA total of 102 mm was recorded at both Chisengu and the Chimanimani met offices, Chayamiti in Manicaland (97 mm), Ngorima in Manicaland (75 mm), Ndima in Manicaland (74 mm), Rusape (64 mm) and Mukandi (55 mm).\n\nThe department said as the weather continues to develop, cloudy and mild conditions, with widespread thunderstorms were expected, particularly in parts of Masvingo, Midlands, Manicaland, and Mashonaland East provinces.\n\nIn light of the heavy rainfall and potential thunderstorms, the public is urged to take precautions, the department said.\n\n It is advisable to seek proper shelter during storms, avoid crossing flooded rivers and low-lying bridges, and secure property and infrastructure vulnerable to heavy rain.\n\nAdditionally, residents should remain informed by following local weather bulletins for any further updates and alerts.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/12/190126-Heavy-rains-Mullaitivu-NH-2.jpg",
            "description": "Precious Manomano Herald Reporter A cloud system has brought heavy rains to the southern regions of Manicaland and Masvingo provinces. According to the Meteorological Services Department (MSD), significant rainfall was recorded in several areas, with the highest measurements reported in Chimanimani Ward 10A – Chikukwa (148 mm), followed by Makohoholi (107 mm), and Chimanimani Ward […]",
            "time": "21:46",
            "date": "10 Feb 2025"
        },
        {
            "title": "Chatikobo outreach empowers community on consumer rights",
            "url": "https://www.herald.co.zw/chatikobo-outreach-empowers-community-on-consumer-rights/",
            "content": "Ivan Zhakata recently in MASVINGO\n\nVillagers in Chatikobo, Masvingo rural district have been empowered with vital knowledge on consumer protection following a joint consumer rights outreach.\n\nThe event, hosted by the Postal and Telecommunications Regulatory Authority of Zimbabwe (POTRAZ), in collaboration with the Reserve Bank of Zimbabwe (RBZ), the Procurement Authority of Zimbabwe (PRAZ), the Consumer\n\nProtection Commission (CPC) and the Consumer Council of Zimbabwe (CCZ) was aimed at informing the community about their rights and responsibilities.\n\nAddressing the villagers, Dr Vengesai Magadzire, deputy director of Economics, Tariffs and Competition and also in charge of consumer affairs said consumer education in rural areas was significant.\n\nWe are here to ensure that consumers are well-informed about their rights especially in relation to postal and telecommunications services, Dr Magadzire said.\n\nOur focus is to help the community understand how to protect themselves and make informed decisions about the services they use.\n\nThe event also addressed issues related to digital financial services with a focus on inclusivity for rural consumers.\n\nWe want to make sure that no one is left behind when it comes to accessing digital financial services, Dr Magadzire said.\n\nParticipants were provided with essential information on how to file complaints if they encounter issues with services.\n\nMr Phillimon Chereni, CCZ corporate affairs director said it was important to empower consumers.\n\nMany people are still unaware of their rights under the Consumer Protection Act. Todays event is a critical step in bridging that gap, Mr Chereni said.\n\nThe outreach also focused on marginalised groups such as women, youths and people living with disabilities.\n\nMr Mqhele Tshuma, PRAZ corporate communications manager said affirmative procurement aimed to integrate these groups into the public procurement system.\n\nWe are working to ensure that marginalised groups have access to Government tenders, Tshuma said.\n\nLocals expressed gratitude for the event and said it provided valuable insights into consumer rights.\n\nI now understand my rights better and know where to go if I have a problem with service, said Mrs Patricia Chikarabwa a community member.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2013/07/potraz-logo-2011.jpg",
            "description": "Ivan Zhakata recently in MASVINGO Villagers in Chatikobo, Masvingo rural district have been empowered with vital knowledge on consumer protection following a joint consumer rights outreach. The event, hosted by the Postal and Telecommunications Regulatory Authority of Zimbabwe (POTRAZ), in collaboration with the Reserve Bank of Zimbabwe (RBZ), the Procurement Authority of Zimbabwe (PRAZ), the […]",
            "time": "21:46",
            "date": "10 Feb 2025"
        },
        {
            "title": "Cde Chigudu’s death a huge blow to the nation-President",
            "url": "https://www.herald.co.zw/cde-chigudus-death-a-huge-blow-to-the-nation-president/",
            "content": "Wallace Ruzvidzo\n\nHerald Reporter\n\nPresident Mnangagwa has described the passing on of Cde Tinaye Chigudu as a huge blow to Zimbabwe.\n\nSpeech National Hero Cde Chigudu FINAL FINAL csd (_250210_103930\n\nIn his remarks at the National Heroes Acre today, the President said Cde Chigudu would always be remembered for his immense contributions before and after independence.\n\nOur late National Hero, Cde Chigudu, was among many brave, selfless sons and daughters of the soil who took a stand and fought for our independence, he said.\n\nHe is honoured as one of the first combatants to be sent for training in North Korea under the Zimbabwe Peoples Revolutionary Army (ZIPRA), the military wing of the Zimbabwe African Peoples Union (ZAPU).\n\nHe was deployed as an intelligence operative in the then Salisbury.\n\nPresident Mnangagwa said during the countrys struggle for independence, Cde Chigudu undertook risky and critical tasks.\n\nwhich helped to gather information regarding the modus operandi of the racist Rhodesian forces, said the President.\n\nLive coverage: Zimbabwe bids farewell to national hero Cde Chigudu\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/ee3aae97-79a7-46d9-b750-403469cba948-680x380.jpeg",
            "description": "Wallace Ruzvidzo Herald Reporter President Mnangagwa has described the passing on of Cde Tinaye Chigudu as a huge blow to Zimbabwe. Speech National Hero Cde Chigudu FINAL FINAL csd (_250210_103930 In his remarks at the National Heroes Acre today, the President said Cde Chigudu would always be remembered for his immense contributions before and after […]",
            "time": "21:46",
            "date": "10 Feb 2025"
        },
        {
            "title": "Chimombe, Mpofu, goats-fraud trial deferred",
            "url": "https://www.herald.co.zw/chimombe-mpofu-goats-fraud-trial-deferred/",
            "content": "Fidelis Munyoro\n\nThe trial of business partners Moses Mpofu and Mike Chimombe, initially scheduled to resume today at the High Court, has been postponed to February 20.\n\nThe deferral comes in light of a bereavement in Chimombes lawyer Advocate Tapson Dzveteros family, prompting Justice Pisirayi Kwenda to grant the postponement.\n\nMpofu and Chimombe stand accused of misappropriating millions of dollars from the Presidential Goat Pass-On Scheme, a case that has captured national attention as one of the countrys most prominent corruption scandals.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/06/Mike-Chimombe-and-Moses-Mpofu.jpg",
            "description": "Fidelis Munyoro The trial of business partners Moses Mpofu and Mike Chimombe, initially scheduled to resume today at the High Court, has been postponed to February 20. The deferral comes in light of a bereavement in Chimombe’s lawyer Advocate Tapson Dzvetero’s family, prompting Justice Pisirayi Kwenda to grant the postponement. Mpofu and Chimombe stand accused […]",
            "time": "21:46",
            "date": "10 Feb 2025"
        }
    ]
}