{
    "news": [
        {
            "title": "Chombo awards scholarship to a bright female student",
            "url": "https://www.herald.co.zw/chombo-awards-scholarship-to-a-bright-female-student/",
            "content": "Conrad Mupesa Mashonaland West Bureau\n\nMASHONALAND West Provincial Affairs and Devolution Minister Marian Chombo has awarded a full scholarship to a gifted Grade 7 student, Mellisa Hwata, who attained eight points in her Grade 7 exams last year\n\nThe scholarship will cover her fees, uniforms and stationery for the next six academic years.\n\nMellisa, who was accompanied by her mother, met Minister Chombo at her offices on Thursday morning.\n\nMinister Chombo said her initiative demonstrates her commitment to fulfilling the Presidents Vision of ensuring every child has access to education, ultimately contributing to an upper-middle-income society by 2030.\n\nMellisa thanked the Minister before assuring her of her commitment to school work for the betterment of the nation and the girl child.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Screenshot-15-680x380.png",
            "description": "Conrad Mupesa Mashonaland West Bureau MASHONALAND West Provincial Affairs and Devolution Minister Marian Chombo has awarded a full scholarship to a gifted Grade 7 student, Mellisa Hwata, who attained eight points in her Grade 7 exams last year The scholarship will cover her fees, uniforms and stationery for the next six academic years. Mellisa, who […]",
            "time": "18:08",
            "date": "09 Jan 2025"
        },
        {
            "title": "President meets Algerian bound students",
            "url": "https://www.herald.co.zw/president-meets-algerian-bound-students-2/",
            "content": "Wallace Ruzvidzo\n\nHerald Reporter\n\nPresident Mnangagwa on Thursday saw off five students who will be leaving for Algeria on a scholarship programme accorded to Zimbabwe.\n\nIn his remarks at State House, the President charged the students to always remember that they are not just representing themselves but the country at large.\n\nWhen you are there you individually and collectively become ambassadors of our country. So never think that you are an individual, wherever you are, you are actually representing us, he said.\n\nOne of the scholarship beneficiaries, Natasha Ruvimbo, said she was elated to have been accorded the scholarship.\n\nI am 20 and I was overjoyed, excited and most of all grateful to God for awarding me this opportunity and also to the President for this scholarship opportunity, she said.\n\nAnother student, Melogina Mano said: I am very happy because this is not an opportunity accorded to many.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/9e01f7d6-fc4e-4286-aa74-2191f5f0f26a-680x380.jpeg",
            "description": "Wallace Ruzvidzo Herald Reporter President Mnangagwa on Thursday saw off five students who will be leaving for Algeria on a scholarship programme accorded to Zimbabwe. In his remarks at State House, the President charged the students to always remember that they are not just representing themselves but the country at large. “When you are there […]",
            "time": "18:08",
            "date": "09 Jan 2025"
        },
        {
            "title": "President meets Algerian bound students",
            "url": "https://www.herald.co.zw/president-meets-algerian-bound-students/",
            "content": "Wallace Ruzvidzo\n\nHerald Reporter\n\nPresident Mnangagwa on Thursday saw off five students who will be leaving for Algeria on a scholarship programme accorded to Zimbabwe.\n\nIn his remarks at State House, the President charged the students to always remember that they are not just representing themselves but the country at large.\n\nWhen you are there you individually and collectively become ambassadors of our country. So never think that you are an individual, wherever you are, you are actually representing us, he said.\n\nOne of the scholarship beneficiaries, Natasha Ruvimbo, said she was elated to have been accorded the scholarship.\n\nI am 20 and I was overjoyed, excited and most of all grateful to God for awarding me this opportunity and also to the President for this scholarship opportunity, she said.\n\nAnother student, Melogina Mano said: I am very happy because this is not an opportunity accorded to many.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/9e01f7d6-fc4e-4286-aa74-2191f5f0f26a-680x380.jpeg",
            "description": "Wallace Ruzvidzo Herald Reporter President Mnangagwa on Thursday saw off five students who will be leaving for Algeria on a scholarship programme accorded to Zimbabwe. In his remarks at State House, the President charged the students to always remember that they are not just representing themselves but the country at large. “When you are there […]",
            "time": "18:08",
            "date": "09 Jan 2025"
        },
        {
            "title": "SAPS dismiss ritual murder claims by foreigners in Limpopo province",
            "url": "https://www.herald.co.zw/saps-dismiss-ritual-murder-claims-by-foreigners-in-limpopo-province/",
            "content": "Thupeyo Muleya\n\nBeitbridge Bureau\n\nSouth Africas police commander for Limpopo province, Lieutenant General Thembi Hadebe has dismissed as false claims on some social media platforms that migrants (foreign nationals) are allegedly working with South Africans in the province to kill people for their body parts.\n\nAccording to the claims, there are organised criminals stealing vehicles and approaching houses, pretending to seek help.\n\nAs soon as they gain entry into the houses, they then kill the occupants by removing their body parts while they are still alive.\n\nIn a statement on Thursday, Lt Hadebe condemned the spreading of fake news.\n\nOne of our biggest threats at the moment is fake news, she said.\n\nWe strongly condemn the spreading of fake news, unverified information, rumours or threats as this seeks to cause panic and confusion, and in some instances incite possible violence. We urge the members of the public to fact-check first before sharing anything on social media platforms.\n\nLt Hadebe said the police will arrest those who will be found sharing inflammatory messages.\n\nShe urged members of the public to promptly report such incidents were people spread false or fake news to ensure that law enforcement deals with the culprits.\n\nOf late there has been an upsurge of false information being shared in various media platforms in South Africa to the effect that foreign nationals are responsible for unending crime in the neighbouring country.\n\nAccording to the World Population Review in 2024, South Africa was ranked the fifth country with the highest crime rate index of 75.5 per 100 000 people.\n\nIt experiences high rates of violent crimes including assaults, rape and murder.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Screenshot-14-680x380.png",
            "description": "Thupeyo Muleya Beitbridge Bureau South Africa’s police commander for Limpopo province, Lieutenant General Thembi Hadebe has dismissed as false claims on some social media platforms that migrants (foreign nationals) are allegedly working with South Africans in the province to kill people for their body parts. According to the claims, there are organised criminals stealing vehicles […]",
            "time": "18:08",
            "date": "09 Jan 2025"
        },
        {
            "title": "National Arts Council of Zimbabwe announces 2025 registration, renewal fees",
            "url": "https://www.herald.co.zw/national-arts-council-of-zimbabwe-announces-2025-registration-renewal-fees/",
            "content": "Trust Khosa\n\nThe National Arts Council of Zimbabwe has announced the registration and renewal fees for participants in the creative sector for 2025.\n\nIn a statement, the council emphasised that each licence issued expires on December 31 of each year and renewals and registrations can be paid for in either US dollars or local currency.\n\nAll registrations processed from October 1 are valid until December 31 of the following year, while renewal fees apply to applications submitted before the expiration of the existing permit.\n\nArts groups will be required to pay US$50 for registration and an equal amount for renewal.\n\nTo complete the registration process, groups must submit their constitution, a list of members, a report of activities from the previous year, contact details, and copies of identity cards.\n\nArts institutions, associations, trusts, and community festivals organisers will need to pay US$250 for registration and US$150 for renewal.\n\nFor effective regulation, these groups should also provide their constitutions, a list of executive members, physical addresses, and identity particulars of their members.\n\nAdditionally, a concept document, a report of activities from the previous year, a certified copy of the deed of trust, and minutes from previous meetings are required.\n\nBusiness promoters are supposed to pay registration fees of US$1850 and US$1 750 for renewal.\n\nRequired documentation includes stamped bank statements, two trade reference letters from suppliers or creditors, a copy of the ZIMRA tax clearance, and certified copies of the certificate of incorporation.\n\nVenue promoters must pay US$500 for registration and US$400 for renewal. Similarly, commercial festival promoters and arts awards organisers will pay US$500 in registration fees and US$400 for renewals.\n\nA stamped bank statement and two trade reference letters from suppliers and creditors are also required.\n\nOwners of arts studios are required to pay US$500 for registration and US$400 for renewal.\n\nThey must submit a copy of their ZIMRA tax clearance along with a stamped current bank statement.\n\nRegistration fees for church organisers stand at US$500, with renewal fees at US$400. NGOs and trusts are also required to pay US$500 for registration and US$400 for renewals.\n\nIndividual artists will need to pay US$20 for both registration and renewal. A copy of their national identity and an artists profile are required for this process.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/images-5.jpeg",
            "description": "Trust Khosa The National Arts Council of Zimbabwe has announced the registration and renewal fees for participants in the creative sector for 2025. In a statement, the council emphasised that each licence issued expires on December 31 of each year and renewals and registrations can be paid for in either US dollars or local currency. […]",
            "time": "18:08",
            "date": "09 Jan 2025"
        },
        {
            "title": "Prosecutor-General commends Commissioner General Mutamba’s appointment as Police chief",
            "url": "https://www.herald.co.zw/prosecutor-general-commends-commissioner-general-mutambas-appointment-as-police-chief/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nThe recent appointment of Stephen Mutamba as the Commissioner General of Zimbabwe Republic Police has been widely lauded, with the Prosecutor-General Justice Loice Matanda-Moyo, leading the chorus of congratulations.\n\nIn a statement, Justice Matanda-Moyo praised Commissioner General Mutambas leadership qualities and expressed optimism about his ability to lead the Zimbabwe Republic Police (ZRP) with integrity and professionalism.\n\nWe extend our heartfelt congratulations to Commissioner General Stephen Mutamba on this significant appointment. His experience, dedication, and commitment to upholding the rule of law make him an excellent choice for this pivotal role, she said.\n\nThe prosecutor-general emphasised the importance of a strong working relationship between the ZRP and the National Prosecuting Authority of Zimbabwe (NPAZ).\n\nThe ZRP is a vital partner in our shared mission to uphold justice and the rule of law. Under Commissioner General Mutambas leadership, we are confident that our collaboration will grow even stronger, ensuring justice and safety for all citizens, she said.\n\nCommissioner General Mutambas appointment comes at a critical time for the ZRP as the nation grapples with the need for strengthened crime prevention strategies and enhanced public trust in law enforcement.\n\nMany see his leadership as a turning point for the police force, with expectations of reforms and heightened professionalism.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Screenshot-13-680x380.png",
            "description": "Ivan Zhakata Herald Correspondent The recent appointment of Stephen Mutamba as the Commissioner General of Zimbabwe Republic Police has been widely lauded, with the Prosecutor-General Justice Loice Matanda-Moyo, leading the chorus of congratulations. In a statement, Justice  Matanda-Moyo praised Commissioner General Mutamba’s leadership qualities and expressed optimism about his ability to lead the Zimbabwe Republic […]",
            "time": "18:08",
            "date": "09 Jan 2025"
        },
        {
            "title": "Harare seeks volunteers for health committees",
            "url": "https://www.herald.co.zw/harare-seeks-volunteers-for-health-committees/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nThe Harare City Council is calling on community members to join its revamped Health Centre Committees (HCCs) as part of efforts to strengthen local healthcare delivery.\n\nIn a statement, the council said the committees play a vital role in bridging the gap between communities and clinics under the Public Health Act Chapter 15:17, 2018.\n\nWe have had Health Centre Committees for the past 10 years, and they have played a pivotal role in the implementation of the Results Based Financing Programme while facilitating a seamless community-clinic interface, read the statement.\n\nWith reconstitution set for early this year, the committees are expected to take on an expanded role including local fundraising, oversight of clinic user fees, strategic planning and implementing a community-based health insurance scheme.\n\nMembership will include representatives from diverse groups such as the youth, churches, businesses and womens organisations.\n\nThis is an opportunity for residents to contribute to improved healthcare in Harare, read the statement.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/10/harare-city-council.jpg",
            "description": "Ivan Zhakata Herald Correspondent The Harare City Council is calling on community members to join its revamped Health Centre Committees (HCCs) as part of efforts to strengthen local healthcare delivery. In a statement, the council said the committees play a vital role in bridging the gap between communities and clinics under the Public Health Act […]",
            "time": "18:08",
            "date": "09 Jan 2025"
        },
        {
            "title": "Government commits to sustainable waste management",
            "url": "https://www.herald.co.zw/government-commits-to-sustainable-waste-management/",
            "content": "Mutsawashe Mashandure\n\nHerald Correspondent\n\nThe recycling of waste is an avenue for generating income and creating employment in the waste management sector, which can help in the attainment of Vision 2030, Minister of State for Provincial Affairs and Devolution for Harare Metropolitan Province Charles Tawengwa has said.\n\nHe was addressing a clean-up campaign in Chitungwiza recently, that was running under the theme Integrated Clean Ecosystem Approach in Fighting Wetland Pollution,\n\nThe minister said that the Government was obligated by Section 73 of the Environmental Rights 2013, to ensure that every person has the right to an environment that is not harmful to their health or well-being.\n\nMinister Tawengwa said there is need to prepare for the hosting of the 15th Meeting of the Conference of the Contracting Parties to the Ramsar Convention on Wetlands (COP15) that will take place in Victoria Falls, Zimbabwe in July.\n\nThe focus will be on removing waste from our wetlands or waste dumped near wetland areas, which if not removed will pollute our wetlands, he said.\n\nAwareness raising will focus on creating a clean wetland ecosystem as the nation prepares to observe World Wetland Day, one of the critical precursors to COP 15.\n\nHe urged all stakeholders to collaborate towards attaining a clean, safe and healthy environment.\n\nI urge industries to adopt the principle of extended producer responsibility, ensuring that all waste generators track their products from manufacture to disposal. I encourage sectors within the province to implement best practices in waste management, which remain essential, he said.\n\nSpeaking at the same time, Chitungwiza Mayor Rosaria Mangoma advised residents to desist from creating scrap heaps.\n\nSome dumps are, however, created in areas that are not easily accessed by our trucks. We commit ourselves to improving roads in those areas this year and increasing the fleet of functioning waste management vehicles from seven. One of the functioning vehicles is a front-end loader, she said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/09/charles-tavengwa.jpg",
            "description": "Mutsawashe Mashandure Herald Correspondent The recycling of waste is an avenue for generating income and creating employment in the waste management sector, which can help in the attainment of Vision 2030, Minister of State for Provincial Affairs and Devolution for Harare Metropolitan Province Charles Tawengwa has said. He was addressing a clean-up campaign in Chitungwiza […]",
            "time": "18:08",
            "date": "09 Jan 2025"
        },
        {
            "title": "9-year-old commits suicide",
            "url": "https://www.herald.co.zw/9-year-old-commits-suicide/",
            "content": "Conrad Mupesa Mashonaland West Bureau\n\nA nine-year-old Mhondoro boy was found hanging from a tree by a neigbour in a suspected case of suicide.\n\nPolice identified the now deceased as Malvern Runyararo of Denhere village under Chief Chivero.\n\nMashonaland West provincial police spokesperson, Inspector lan Kohwera said the deceased was found hanging from a tree using a rope by one of the villagers Rodrick Andrea (47) on December 29, 2024.\n\nInspector Kohwera said on the night of December 28, 2024, the boys family retired to bed as usual.\n\nRodrick Andrea discovered Malverns lifeless body hanging from a tree before alerting his family.\n\nA police report was made at ZRP Gonza Base who attended the scene before conveying the body to Norton District Hospital mortuary for post-mortem.\n\nInspector Kohwera said it was worrisome that minors were among the people committing suicide.\n\nIt is worrisome that the trend is increasing where minors take their lives after being corrected by their parents or guardians.\n\nWe appeal to the general public to counsel young people that considering taking ones life after being corrected is not a solution rather they must understand that it is being done to make sure they become future leaders, said Inspector Kohwera.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/11/zrp.jpg",
            "description": "Conrad Mupesa Mashonaland West Bureau A nine-year-old Mhondoro boy was found hanging from a tree by a neigbour in a suspected case of suicide. Police identified the now deceased as Malvern Runyararo of Denhere village under Chief Chivero. Mashonaland West provincial police spokesperson, Inspector lan Kohwera said the deceased was found hanging from a tree […]",
            "time": "18:08",
            "date": "09 Jan 2025"
        },
        {
            "title": "CCC faction suspends Tshabangu",
            "url": "https://www.herald.co.zw/ccc-faction-suspends-tshabangu/",
            "content": "Herald Correspondent\n\nThe acting Citizens Coalition for Change president Welshman Ncube has suspended the partys interim secretary-general Senator Sengezo Tshabangu with immediate effect, as the opposition partys internal strife continues to tear it apart.\n\nThis decision follows the High Court ruling on Wednesday, which blocked Tshabangu from making changes to the partys parliamentary leadership.\n\nIn a statement, CCC presidential spokesperson, Mr Kuraone Chihwayi said the party had suspended Tshabangu pending disciplinary action.\n\nActing in terms of Article 9.1.2.3 of the CCC Constitution the Acting President Prof Welshman Ncube has suspended Sengezo Tshabangu with immediate effect, read part of the statement.\n\nThis decision was made in light of Tshabangus actions, which were deemed to be in contravention of the partys constitution.\n\nTshabangus suspension is pending a disciplinary hearing, which will be conducted in accordance with the partys internal processes.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/02/Sengezo-Tshabangu.jpg",
            "description": "Herald Correspondent The acting Citizens’ Coalition for Change president Welshman Ncube has suspended the party’s interim secretary-general Senator Sengezo Tshabangu with immediate effect, as the opposition party’s internal strife continues to tear it apart. This decision follows the High Court ruling on Wednesday, which blocked Tshabangu from making changes to the party’s parliamentary leadership. In […]",
            "time": "18:08",
            "date": "09 Jan 2025"
        }
    ]
}