{
    "news": [
        {
            "title": "Acting President Attends Youth Business and Innovation Fundraising Dinner",
            "url": "https://www.herald.co.zw/acting-president-attends-youth-business-and-innovation-fundraising-dinner/",
            "content": "Mukudzei Chingwere\n\nHerald Reporter\n\nActing President Dr Constantino Chiwenga is at St Canisius Parish in Marlborough, where he will officiate at the Catholic Youth Business and Innovation Hub Exhibition and Fundraising Dinner.\n\nDuring his visit, Dr Chiwenga toured various stands to gain insight into the entrepreneurial ventures of the youth and explore ways to enhance their contributions to the economy.\n\nHe is accompanied by his wife, Colonel Miniyothabo Chiwenga, as well as Cde Charles Tavengwa, the Minister of State for Harare Metropolitan Province, along with other senior Government officials.\n\nThe Acting Presidents participation underscores the Governments commitment, under President Mnangagwas leadership, to bolster economic growth and empower the youth to engage actively in national development.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/IMG-20250125-WA0119-680x380.jpg",
            "description": "Mukudzei Chingwere Herald Reporter Acting President Dr Constantino Chiwenga is at St Canisius Parish in Marlborough, where he will officiate at the Catholic Youth Business and Innovation Hub Exhibition and Fundraising Dinner. During his visit, Dr Chiwenga toured various stands to gain insight into the entrepreneurial ventures of the youth and explore ways to enhance […]",
            "time": "09:07",
            "date": "26 Jan 2025"
        },
        {
            "title": "New ZIFA board ushered in",
            "url": "https://www.herald.co.zw/new-zifa-board-ushered-in/",
            "content": "Tadious Manyepo\n\nSports Reporter\n\nNqobile Magwizi will lead the newly-elected ZIFA Board that was ushered in following an election held in Harare this afternoon.\n\nThe Harare businessman becomes the first ZIFA president after the dissolution of the Felton Kamambo-led executive in November 2021 with the country placed under FIFA administration since June 2023.\n\nPrior to that, Zimbabwe was under FIFA suspension.\n\nAnd the elections were much-awaited with all eyes on who would be selected by the 77 councillors to lead the association.\n\nMagwizi was the outright favourite and duly romped to victory after picking 80 percent of the vote.\n\nPhillemon Machana was a distant second with Twine Phiri on third while Marshal Gore and Makwinji Phiri who failed to get a single vote were fourth and fifth respectively.\n\nOne of the front-runners before the election, Martin Kweza withdrew his candidature just before the election citing personal reasons.\n\nLoveness Mukura and Kenny Ndebele will deputize Magwizi after doing well in their race where they managed to garner significant nominations to outwit their more experienced contestants.\n\nAlice Zeure, Tafadzwa Benza, Davison Muchena, Thomas Marambanyika, Brighton Ushendibaba and Kudzai Kadzombe took the available six slots on the board coming off in a strong field of 39 contestants.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/IMG-20250125-WA0010-680x380.jpg",
            "description": "Tadious Manyepo Sports Reporter Nqobile Magwizi will lead the newly-elected ZIFA Board that was ushered in following an election held in Harare this afternoon. The Harare businessman becomes the first ZIFA president after the dissolution of the Felton Kamambo-led executive in November 2021 with the country placed under FIFA administration since June 2023. Prior to […]",
            "time": "09:07",
            "date": "26 Jan 2025"
        },
        {
            "title": "Live Coverage: ZIFA Elections",
            "url": "https://www.herald.co.zw/live-coverage-zifa-elections/",
            "content": "\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/ZIFA-1.jpg",
            "description": "",
            "time": "09:07",
            "date": "26 Jan 2025"
        },
        {
            "title": "Hwedza accident victims named",
            "url": "https://www.herald.co.zw/hwedza-accident-victims-named/",
            "content": "Victor Maphosa\n\nMashonaland East Bureau\n\nPolice have identified two of the three young people who tragically died in a road traffic accident along the Hwedza-Mutiweshiri highway on January 22, on the way to collect their Ordinary Level results at Mount St Marys High School in Hwedza.\n\nReports indicate they succumbed to head injuries sustained during the crash.\n\nThe deceased are Wayne Nyera (16) from Southlea Park, Harare and Danziel Genani (16) from New Mabvuku, Harare.\n\nThe accident occurred at about 2pm at the 7km peg along the Hwedza-Mutiweshiri road.\n\nMs Nolan Njenjema (30), from Harare, was the driver of the Toyota Hiace, with 12 passengers when she lost control of the vehicle.\n\nIt veered off the road, fell into a ditch, and overturned twice before coming to rest on its right side.\n\nAll passengers were injured and transported to Mt St Marys Hospital, with three passengers dying upon admission.\n\nTen others who had varying degrees of injuries were transferred to hospitals in Harare and Chitungwiza for further treatment.\n\nNational police spokesperson Commissioner Paul Nyathi stressed the importance of road safety.\n\nDrivers should promote road safety at all times, he said.\n\nWe urge parents and guardians to ensure their childrens safety.\n\nWhat happened here is truly tragic. We need drivers to self-reflect to prevent further accidents.\n\nThe Passenger Association of Zimbabwe (PAZ) also expressed their condolences, with the national coordinator Mr Tafadzwa Goliati, saying: PAZ is deeply saddened by the tragic loss of three high school students in a kombi accident while on their way to collect their O-Level results.\n\nWe extend our heartfelt condolences to the families, friends, and the entire school community of Mt St Marys High School in Hwedza.\n\nThis incident underscores the urgent need for improved road safety measures and stricter regulations on public transportation.\n\nPAZ called on relevant authorities to address the root causes of such tragedies and ensure better adherence to traffic regulations to prevent further loss of life.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/04/accident-3.jpg",
            "description": "Victor Maphosa Mashonaland East Bureau Police have identified two of the three young people who tragically died in a road traffic accident along the Hwedza-Mutiweshiri highway on January 22, on the way to collect their Ordinary Level results at Mount St Mary’s High School in Hwedza. Reports indicate they succumbed to head injuries sustained during […]",
            "time": "09:07",
            "date": "26 Jan 2025"
        },
        {
            "title": "MSD advises of decrease in rainfall",
            "url": "https://www.herald.co.zw/msd-advises-of-decrease-in-rainfall/",
            "content": "Elita Chikwati\n\nThe Meteorological Services Department has advised of a decline in rainfall over the southern and western parts of the country.\n\nIn an advisory, the MSD said Bulawayo Metropolitan, Midlands, Masvingo, Matabeleland North and South will experience a decrease in rainfall from today until Friday, January 31.\n\nMoisture from the Intertropical Convergence Zone (|TCZ) is being pushed further north of the country resulting in the northern and eastern areas of the country; Mashonaland West, Mashonaland Central, Mashonaland East and Manicaland Provinces expected to have thundershowers while Masvingo, Midlands, Bulawayo Metropolitan and all Matabeleland provinces are anticipated to be mostly sunny and hot due to the circulation of relatively dry air over the southwestern parts of Zimbabwe, said MSD.\n\nMembers of the public have been advised to watch out for sunny and hot conditions. Those in the southern parts of the country are advised to keep hydrated by drinking water and wearing sun hats, shades and using umbrellas to protect from direct sunshine.\n\nIt is also advisable to irrigate or water crops when signs of heat stress are noted or as recommended by extension officers.\n\nEnsure animals have adequate drinking water, advised the MSD.\n\nThe department will keep sending weather updates.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/The-Meteorological-Services-Department.jpg",
            "description": "Elita Chikwati The Meteorological Services Department has advised of a decline in rainfall over the southern and western parts of the country. In an advisory, the MSD said Bulawayo Metropolitan, Midlands, Masvingo, Matabeleland North and South will experience a decrease in rainfall from today until Friday, January 31. “Moisture from the Intertropical Convergence Zone (|TCZ) […]",
            "time": "09:07",
            "date": "26 Jan 2025"
        },
        {
            "title": "Magaya breaks silence, backs Magwizi",
            "url": "https://www.herald.co.zw/magaya-breaks-silence-backs-magwizi/",
            "content": "Online Reporter\n\nYADAH Stars president Prophet Walter Magaya has broken his silence on the ZIFA elections scheduled for Rainbow Towers in Harare on Saturday and also threw his weight behind Nqobile Magwizis candidature.\n\nSpeaking for the first time since he lost his High Court bid to stop the elections, Magaya, also pledged to continue supporting the development of football, when he addressed 73 of the 78 ZIFA councillors at his Yadah Complex on Friday night.\n\nMagaya invited members of the ZIFA Assembly to his complex and during his address he backed Magwizi for the ZIFA presidency.\n\nHe revealed that he has been assessing the candidates who are left on the ballot paper and also met several high-profile personalities since Thursday when he lost the High Court case.\n\nCandidates approached me, telling me their plans and narratives and out of them there was no one better than Magwizi, Magaya said.\n\nThe clergyman also revealed that he had withdrawn his appeal with the Court of Arbitration for Sport (CAS).\n\nI have been receiving calls and meeting a number of people. They have been asking me now that you have been disqualified who would you back from the remaining contestants, he said.\n\nI was honest and told them none qualified. But after a thorough assessment of the candidates there is one candidate who stood out.\n\nMagaya also said he had sought clarity on the future of the councillors amid unsubstantiated rumours that the ZIFA Congress was to be dissolved after the elections.\n\nI told some of the people whom I met that they should promise me that the councillors who are not PSL board of governors will not be removed and they did, he said..\n\nI also asked them not to forget womens football and they promised me that they will not. So, I am standing in front of you today to alert you that I am endorsing that candidate.\n\nHe emphasised his passion for football saying no amount of money would take away his passion for the game.\n\nI will not stop my drive towards football development. We had plans for all sectors, we had plans for womens football, he said.\n\nWe will continue building stadiums, if you give Gwanzura I will improve it, if you give me Chibuku, I will do the same.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Magaya.jpg",
            "description": "Online Reporter YADAH Stars president Prophet Walter Magaya has broken his silence on the ZIFA elections scheduled for Rainbow Towers in Harare on Saturday and also threw his weight behind Nqobile Magwizi’s candidature. Speaking for the first time since he lost his High Court bid to stop the elections, Magaya, also pledged to continue supporting […]",
            "time": "09:07",
            "date": "26 Jan 2025"
        },
        {
            "title": "Eminent citizens to get Presidential honour",
            "url": "https://www.herald.co.zw/eminent-citizens-to-get-presidential-honour/",
            "content": "Blessings Chidakwa, Herald Reporter\n\nPRESIDENT Mnangagwa will this year honour outstanding citizens and organisations as part of the Second Republics thrust of bestowing honour where it is deserved, with nominations now open.\n\nThe awards and orders are informed by a desire by the Government to honour inspirational role models, personalities and organisations who render invaluable service to the people and place Zimbabwe on the global map.\n\nPresident Mnangagwa last year conferred the Royal Order of Munhumutapa and the Order of the Star of Zimbabwe along with valour medals of the Gold Cross of Zimbabwe, Silver Cross of Zimbabwe and the Commendation Medal to seven individuals excelling in various spheres of influence.\n\nThe seven are former Chief Secretary to the President and Cabinet Dr Misheck Sibanda, who was conferred with the Order of the Star of Zimbabwe (Platinum) while Messrs Sirizani Butau and Jubilee Utsiwegota were awarded the Gold Cross of Zimbabwe, the top award for bravery.\n\nOthers are Messrs Peace Magaya and Luckmore Magaya, who got the Silver Cross of Zimbabwe, Mr Devnanda Popatial who was awarded the Royal Order of Munhumatapa and musical outfit Black Umfolosi who received the Order of the Star of Zimbabwe in Bronze.\n\nIn a statement yesterday, Chief Secretary to the President and Cabinet Dr Martin Rushwaya called for nominees for conferment with honours and awards.\n\nGovernment intends to award eligible and deserving Zimbabwean citizens across all our range of honours and awards.\n\nThe individuals should be luminaries who meet the eligibility criteria for the award under which they are nominated, he said.\n\nAmong the honours and awards, there is the Order of the Great Zimbabwe to be conferred on Zimbabwes gallant sons and daughters for their supreme sacrifice in connection with the liberation struggle, survival and development of Zimbabwe.\n\nThe Royal Order of Munhumutapa will be conferred in honour of brothers and sisters from other states for their exceptional sacrifice and commitment towards the liberation and well-being of Zimbabwe as a nation.\n\nThe Order of the Star of Zimbabwe symbolises the yearnings and aspirations which propel Zimbabweans in their quest to achieve the highest possible goals in the spheres of human endeavour and is thus a fitting honour and award for superlative achievements.\n\nThe National Historical Legacy Award will be conferred on Zimbabweans who have selflessly and relentlessly dedicated themselves to the preservation of Zimbabwes peace, order, sovereignty, integrity and unity, thereby fostering the countrys socio-economic development.\n\nThe bravery awards are headed by the Gold Cross of Zimbabwe awarded to members of the uniformed forces and civilians for conspicuous bravery in circumstances of extreme peril.\n\nIt is the highest award and as such will head the order of precedence followed by the Silver Cross of Zimbabwe, which is awarded to members of the uniformed forces and civilians for conspicuous bravery in circumstances of great peril.\n\nThe Bronze Cross of Zimbabwe is awarded to members of the uniformed forces and civilians for acts of bravery in hazardous circumstances.\n\nThe Medal for Meritorious Service is conferred on members of the uniformed forces and civilians for meritorious service to Zimbabwe or humanity at large.\n\nThe Commendation Medal is conferred on any person for a commendable act of bravery, commendable service or continuous devotion to duty which deserves recognition.\n\nThere are also commendation awards.\n\nThe Robert Gabriel Mugabe Commendation Award for Service in Human Capital Development is conferred for outstanding, transformative service in human capital development that has opened up and achieved growth in new economic sectors while ensuring inclusivity.\n\nThe Joshua Mqabuko Nyongolo Nkomo Commendation Award for Community Development, Peace Building and Fostering Unity is conferred for outstanding and consistent transformative service in the improvement of livelihoods at community level engendering peace making and fostering unity.\n\nThe Herbert Wiltshire Pfumaindini Chitepo Commendation Award for Justice and Human Rights is conferred for distinguished and consistent pursuit of justice and human rights for the greater good of humanity.\n\nThe Jairos Jiri Humanitarian Award is conferred on persons who have worked and dedicated their lives to the betterment of humanity through rendering humanitarian service. It recognises the spirit of humanism exhibited by the recipient, while honouring the virtues of concern for the disadvantaged and vulnerable members of society.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/President-Mnangagwa-7.jpg",
            "description": "Blessings Chidakwa, Herald Reporter PRESIDENT Mnangagwa will this year honour outstanding citizens and organisations as part of the Second Republic’s thrust of bestowing honour where it is deserved, with nominations now open. The awards and orders are informed by a desire by the Government to honour inspirational role models, personalities and organisations who render invaluable […]",
            "time": "09:07",
            "date": "26 Jan 2025"
        },
        {
            "title": "Constitutional Amendment to allow Trump third term introduced",
            "url": "https://www.herald.co.zw/constitutional-amendment-to-allow-trump-third-term-introduced/",
            "content": "A REPUBLICAN House member has introduced a resolution to amend the United States Constitution to allow President Donald Trump, and any other future President, to be elected to a third term in the White House.\n\nPresident Trump has proven himself to be the only figure in modern history capable of reversing our nations decay and restoring America to greatness, and he must be given the time necessary to accomplish that goal, said Representative Andy Ogles of Tennessee on Thursday, who proposed extending the current maximum of two elected terms.\n\nIt is imperative that we provide President Trump with every resource necessary to correct the disastrous course set by the Biden administration, Ogles said in a statement.\n\nHe is dedicated to restoring the republic and saving our country, and we, as legislators and as states, must do everything in our power to support him, said Ogles, a hard-line conservative who is serving his second term in the House.\n\nI am proposing an amendment to the Constitution to revise the limitations imposed by the 22nd Amendment on presidential terms, he added.\n\nOgles move came three days after Trump was sworn in for a second, non-consecutive term  becoming only the second US president to accomplish that feat.\n\nAnd the resolution comes two months after Representative Dan Goldman, a New York Democrat, introduced a House resolution that reaffirms that the 22nd Amendment applies to two terms in the aggregate as President of the United States, and that the amendment applies to the 78-year-old Trump.\n\nA White House spokesperson did not immediately reply to a request for comment on Ogles resolution.\n\nFor a resolution to amend the Constitution to be sent to the Archivist of the United States, it must receive a two-thirds majority vote in both the House of Representatives and the Senate. If that is done, three-fourths of the states  38  must ratify the amendment for it to become part of the Constitution.\n\nThe 22nd Amendment of the Constitution states in part, No person shall be elected to the office of the President more than twice.\n\nOgles resolution seeks to revise this to read, No person shall be elected to the office of the President more than three times.\n\nThe original amendment also states, No person who has held the office of President, or acted as President, for more than two years of a term to which some other person was elected President shall be elected to the office of the President more than once.\n\nIn his statement Thursday, Ogles said the resolution he was introducing would allow President Trump to serve three terms, ensuring that we can sustain the bold leadership our nation so desperately needs.\n\nProposed in 1947 and ratified in 1951, the 22nd Amendment was authored to prevent a repeat of President Franklin Roosevelts unprecedented election to four terms in office.\n\nTo this day, Roosevelt is the only president ever to have been elected to more than two terms. He died in 1945, less than 90 days after his fourth inauguration.\n\nRepublicans currently hold an extremely narrow, three-seat majority in the House, and have a majority by the same number of states in the Senate. Few, if any Democrats, are likely to vote for Ogles resolution with Trump in office.\n\nOver the course of his political career, Trump has repeatedly hinted at his willingness to serve more than two terms in office.\n\nI suspect I wont be running again, unless you say, Hes so good weve got to figure something else out, Trump reportedly mused to House Republicans during a private meeting in November, shortly after his electoral victory over Democratic former Vice President Kamala Harris.\n\nSpeaking to members of the National Rifle Association in May, Trump said, ?I dont know, are we going to be considered three-term or two-term? Are we three-term or two-term if we win??\n\nTrumps openness to a third term does not come as a surprise to some people who know him.\n\nThe former Fox News journalist Geraldo Rivera, who was friendly with Trump for decades in New York, predicted in December that Trump and his allies would soon turn their attention to the 22nd Amendment.\n\nFor future reference: President Trump & Co. will soon start chattering about revoking/amending the 22nd Amendment, which limits presidents to two four year terms, Rivera wrote on X.\n\nAmending the Constitution is not the only way that Trump could stay in power after his current term ends.\n\nThough the 22nd Amendment prohibits Trump from being elected president again, it does not prohibit him from serving as president beyond Jan. 20, 2029, wrote Philip Klinkner, a professor of government at Hamilton College, in a recent article in The Conversation.\n\nThe reason for this is that the 22nd Amendment only prohibits someone from being elected more than twice, Klinkner wrote.\n\nIt says nothing about someone becoming president in some other way than being elected to the office.\n\nKlinkner wrote that one hypothetical scenario would be for Trump to run for vice president in 2028, and have Vice President JD Vance run at the top of the ticket, for president.\n\nIf elected, Vance could then resign, making Trump president again, Klinkner wrote. But Vance would not even have to resign in order for a Vice President Trump to exercise the power of the presidency.\n\nThe 25th Amendment to the Constitution states that if a president declares that he is unable to discharge the powers and duties of the office  such powers and duties shall be discharged by the Vice President as Acting President.\n\nAnother scenario Klinkner imagined is for Trump to encourage a family member to run for, and win, the White House. Once elected, they would serve as little more than a figurehead president, while Trump made the key decisions.  CNBC\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/06/1006-1-1-DON.jpg",
            "description": "A REPUBLICAN House member has introduced a resolution to amend the United States Constitution to allow President Donald Trump, and any other future President, to be elected to a third term in the White House. President Trump “has proven himself to be the only figure in modern history capable of reversing our nation’s decay and […]",
            "time": "09:07",
            "date": "26 Jan 2025"
        },
        {
            "title": "Police go digital, roadblocks to stay",
            "url": "https://www.herald.co.zw/police-go-digital-roadblocks-to-stay/",
            "content": "Blessings Chidakwa and Remember Deketeke\n\nTHE Zimbabwe Republic Police (ZRP) has gone digital and is creating an automated fingerprint identification system for smart policing that will make it easier to track criminals.\n\nFurther, police roadblocks will remain in place as they are part of the forces Constitutional mandate while an ongoing operation to eradicate illegal pirate taxis that have been causing havoc and endangering the lives of motorists and pedestrians will be intensified.\n\nThe Automated Fingerprint Identification System (AFIS) for smart policing, set to be launched soon, is being jointly developed by ZRP and the Zimbabwe Centre for High-Performance Computing (ZCHPC).\n\nSpeaking at a demonstration of the new system at ZCHPC offices in Harare yesterday, Permanent Secretary for Higher and Tertiary Education, Science and Technology Development Professor Fanuel Tagwira said the initiative would be a game-changer.\n\nProf Tagwira said the new system was inspired by National Development Strategy 1 (NDS1) where ZCHPC contributes towards the realisation of an innovation-led and knowledge-driven economy.\n\nThese efforts align with the Governments vision of fostering home-grown solutions to national challenges. The ZRP AFIS system showcases how technology can enhance law enforcement by improving crime detection, prevention, and overall efficiency.\n\nThis progress highlights Zimbabwes growing capacity to develop cutting-edge solutions that meet global standards. May I commend the Commissioner-General of Police for embracing this technology, he said.\n\nProf Tagwira said technological innovation was being leveraged to enhance national security and public service delivery.\n\nThis initiative reflects the power of collaboration in leveraging technology to enhance national security and public service delivery. As the President, Dr ED Mnangagwa, always says, the future of Zimbabwe must be anchored on innovation, science and technology, he said.\n\nPermanent Secretary in the Ministry of Higher and Tertiary Education, Innovation, Science and Technolgy Development Professor Fanuel Tagwira (left) unpacks the smart traffic tracking system whle flanked by the Zimbabwe Republic Police (ZRP) Comissioner General Stephen Mutamba (right) and the University of Zimbabwe Vice Chancellor (second from right) at the Zimbabwe Centre for High Performance Computing at the University of Zimbabwe-Picture:Joshua Muswere\n\nPolice Commissioner-General Steven Mutamba said the new system would bring about a modern way of handling criminal cases timeously and accurately.\n\nWe have been doing this manually, and you can imagine looking at the fingerprint lines manually, producing a magnifying glass. It takes time. In this day and age, we dont expect criminals to be waiting for us.\n\nWe have got to measure them through systems like the one that we have been shown. So, I would like to applaud the team for the steady work, and I would like to urge you to go further and develop more of these systems, he said.\n\nComm-Gen Mutamba said the new system was used in well-developed countries.\n\nThat is something that we have been longing for. When it comes to investigations, its not an easy thing to do, especially when you would like to identify persons that have committed crimes.\n\nYou will perhaps know, when someone has broken into premises, one of the critical pieces of evidence that is required is something that can show that Mr So-and-So or Ms So-and-So broke into someones property, he said.\n\nComm-Gen Mutamba said when police have a system that can pick up fingerprints at scenes of crime, then they were home and dry.\n\nWe can also do our investigations as quickly as people expect us to do, he said.\n\nPermanent Secretary in the Ministry of Higher and Tertiary Education, Innovation, Science and Technolgy Development Professor Fanuel Tagwira (left) is joined by the Zimbabwe Republic Police (ZRP) Comissioner General Stephen Mutamba (second from left) and the University of Zimbabwe Vice Chancellor Paul Mapfumo (right) as they are taken on a tour of facilities found at the Zimbabwe Centre for High Performance Computing at the University of Zimbabwe-Picture:Joshua Muswere\n\nNational police spokesperson Commissioner Paul Nyathi said roadblocks had always been part of policing.\n\nRoadblocks are there for smuggled goods, whether into or out of the country. You can also have roadblocks to account for moving criminals, including those who commit robbery cases.\n\nThen we can also have roadblocks for traffic management. Currently, we have an operation targeting mushikashika and lawlessness on the roads; that is why we have some roadblocks, he said.\n\nComm Nyathi said roadblocks were part of the ZRPs Constitutional mandate.\n\nThat is why we are appealing to all motorists to lead by example whether one is driving a family car, company car or a public service vehicle, he said.\n\nComm Nyathi also urged drivers to always adhere to road regulations.\n\nYou will not be killed for passing through a police checkpoint. If you have committed an offence, wait for the due process of the law to be followed.\n\nThere is no need to be militant, arrogant or confrontational, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Z1.jpg",
            "description": "Blessings Chidakwa and Remember Deketeke THE Zimbabwe Republic Police (ZRP) has gone digital and is creating an automated fingerprint identification system for smart policing that will make it easier to track criminals. Further, police roadblocks will remain in place as they are part of the force’s Constitutional mandate while an ongoing operation to eradicate illegal […]",
            "time": "09:07",
            "date": "26 Jan 2025"
        },
        {
            "title": "Hero Mupamhanga on final journey",
            "url": "https://www.herald.co.zw/hero-mupamhanga-on-final-journey/",
            "content": "Mukudzei Chingwere and Fungai lupande\n\nACTING President Dr Constantino Chiwenga will preside over the burial of national hero Cde Justin Mupamhanga at the National Heroes Acre in Harare on Monday.\n\nThe Acting President will stand in for President Mnangagwa who is on his annual leave, and is set to be accompanied by his wife Colonel Miniyothabo Chiwenga at the burial.\n\nCde Mupamhanga, a former Deputy Chief Secretary to the President and Cabinet, passed away on Wednesday at a Harare hospital, leaving behind a legacy of forthright public service and dedication to duty.\n\nIn a statement, the Ministry of Home Affairs and Cultural Heritage gave an update on his final journey, which saw his body being airlifted yesterday to Rukariro Farm in Matepatepa, Mashonaland Central Province, where it was set to lie in state before being moved to Farm 108 in Chesa, Mt Darwin.\n\nThe Ministry of Home Affairs and Cultural Heritage is advising the nation that the late National Hero and former Deputy Chief Secretary to the President and Cabinet, Cde Justin Mupamhanga, who died on 22 January 2025, will be laid to rest on Monday 27 January 2025 at the National Heroes Acre, reads part of the statement.\n\nThe Acting President, General (Rtd) Dr Constantino Chiwenga will preside over this burial. Tomorrow Saturday 25 January, 2025, from 1300hrs, the body of the late National Hero will be airlifted back to Harare where it will lie in state at Charles Gumbo Barracks. On Sunday, 26 January from 0900hrs, a church service in his honour will be conducted at Mabelreign Revelation-Methodist Church.\n\nThe body will pass through Inner City Methodist Church where he used to attend. The body of the late national hero will lie in state at 104 Drew Rd, Grange, Chisipite ahead of burial on Monday.\n\nThe body of the late national hero Cde Justin Mupamhanga was taken to his Rukariro Farm in Matepatepa and later to his rural home in the Chesa area, Mt Darwin where it will lie in state\n\nGovernment said on the burial date, gates will open at 6am at the national shrine and mourners are expected to be seated by 7am\n\nThe Government has invited the public to come and give a befitting farewell to the son of the soil and dedicated public servant.\n\nWhen his body arrived at Rukariro Farm in Matepatepa yesterday, it was warmly received by neighbours, family, and friends.\n\nCde Mupamhanga was described as a successful and passionate farmer who was willing to share his knowledge and practices with his colleagues.\n\nNeighbour, Mrs Loice Dhliwayo said Cde Mupamhanga was inspirational.\n\nHe inspired us as we witnessed how he was growing his business. We started believing that farming is a viable business. This is a depressing moment for us as his neighbours, she said.\n\nWhen he was with the Ministry of Energy, he convinced a lot of farmers in Matepatepa to join the Jatrofa project.\n\nAnother neighbour, Mr Gidfrey Chindito, said he started knowing Cde Mupamhanga in the Chesa area in Mt Darwin.\n\nAfter the liberation struggle, we worked together in Government. I learnt a lot, including discipline and respect. We became neighbour farmers and he taught me that discipline is also needed in farming, he said.\n\nThe national hero had a diversified farm doing dairy farming, poultry, piggery, fisheries and horticulture.\n\nAgritex supervisor Mr Misheck Muparagwa for Ward 3, 4 and 19 described Cde Mupamhanga as a prominent farmer.\n\nHe said Cde Mupamhanga left a legacy and transformed many farms into centres of excellence.\n\nThe body of the late national hero Cde Justin Mupamhanga was taken to his Rukariro Farm in Matepatepa and later to his rural home in the Chesa area, Mt Darwin where it will lie in state\n\nThe chief mourner in the province, Minister of State for Provincial Affairs and Devolution Christopher Magomo, said the province had lost a dedicated farmer who also championed developmental projects in Mashonaland Central.\n\nWe have lost a father figure in the province who was loyal until his death. We honour and cherish his life and we thank President Mnangagwa for honouring him, he said.\n\nHome Affairs and Cultural Heritage Minister Kazembe Kazembe said war veterans, including the late Cde Mupamhanga, created a better life for all Zimbabweans.\n\nHe was a mentor and advisor who worked tirelessly worked for the country.\n\nHis body was later transported to his rural home in the Chesa area of Mt Darwin, where it will lie in state.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/M1-2.jpg",
            "description": "Mukudzei Chingwere and Fungai lupande ACTING President Dr Constantino Chiwenga will preside over the burial of national hero Cde Justin Mupamhanga at the National Heroes Acre in Harare on Monday. The Acting President will stand in for President Mnangagwa who is on his annual leave, and is set to be accompanied by his wife Colonel […]",
            "time": "09:07",
            "date": "26 Jan 2025"
        }
    ]
}