{
    "news": [
        {
            "title": "Zim, SA border authorities implement integrated plans for December traffic",
            "url": "https://www.herald.co.zw/zim-sa-border-authorities-implement-integrated-plans-for-december-traffic/",
            "content": "Thupeyo Muleya\n\nBeitbridge Bureau\n\nZimbabwe and South Africa border authorities have started implementing integrated plans to be able to seamlessly deal with the festive season traffic that has already started building up on both sides of the border.The regional immigration officer in charge of Southern Regional (Beitbridge, Masvingo and Sango), Mr Joshua Chibundu said there is a notable surge in traffic, adding that they are ready for the peak period.\n\nDuring the off-peak period, boarder authorities clear about 13 000 travellers, 1000 commercial trucks, 120 buses, and 2000 light cars every day.\n\nThe number increases threefold during major holidays.\n\nWe have realised an increase in volumes of travellers and we applaud the Government for installing the online border management system which has enabled us to timeously facilitate entries and exits of travellers, said Mr Chibundu.\n\nWe appeal to travellers to avoid deals with touts who usually try to take advantage of the increased traffic to dupe travellers of their hard-earned money. The Department of Immigration does not require the services of agents, hence every traveller should present himself or herself for clearance.\n\nIf there are challenges, please request to see the supervisors who are readily available for assistance. We also urge parents to ensure that their children are accompanied by reliable relatives as opposed to giving them to bus crews, he said.\n\nSouth Africas Commissioner of the Border Management Authority (BMA), Dr Michael Masiapato said they have noted a significant increase in traveller movements across all ports of entry as the peak holiday season approaches.\n\nWe are aware of the increased traveller volumes, which are normally experienced around this time. We are working closely with all stakeholders to manage operations efficiently and reduce waiting times, he said.\n\nOur teams on the ground are working tirelessly to manage the flow of people and to ensure that everyone is assisted as quickly as possible.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/WhatsApp-Image-2024-12-16-at-15.23.26-680x380.jpeg",
            "description": "Thupeyo Muleya Beitbridge Bureau Zimbabwe and South Africa border authorities have started implementing integrated plans to be able to seamlessly deal with the festive season traffic that has already started building up on both sides of the border. The regional immigration officer in charge of Southern Regional (Beitbridge, Masvingo and Sango), Mr Joshua Chibundu said […]",
            "time": "18:45",
            "date": "16 Dec 2024"
        },
        {
            "title": "Zimbabwe welcomes Zambian delegation for MSME development mission",
            "url": "https://www.herald.co.zw/zimbabwe-welcomes-zambian-delegation-for-msme-development-mission/",
            "content": "Mutsawashe Mashandure\n\nHerald Correspondent\n\nIn a significant move to strengthen bilateral relations and promote economic cooperation, Zimbabwe and Zambia have embarked on a joint mission to develop the Micro, Small and Medium Enterprises (MSMEs) sector.\n\nThe delegation is in the country on a four-day mission aimed at strengthening bilateral relations and enhancing cooperation in the MSMEs sector.\n\nSpeaking during a press conference, Women Affairs, Community, Small and Medium Enterprises Development Minister Monica Mutsvangwa emphasised the importance of the visit.\n\nWe are deeply excited to have you in Zimbabwe at a time when our two nations are working to solidify the long-standing and excellent relations that have culminated in numerous agreements over the years, she said.\n\nThe minister highlighted that MSMEs are the backbone of African economies, accounting for 90 percent of the continents economic activity.\n\nThe sector has untapped and immense potential to drive structural transformation, she added.\n\nThe minister also pointed out that a significant portion of these enterprises, about 56.4 percent, are owned and operated by women.\n\nThis makes them crucial for promoting gender equality and economic inclusion, she said.\n\nMinister Mutsvangwa highlighted that the Government has prioritised MSME growth through the National Development Strategy and the National Micro, Small and Medium Enterprises Policy Framework.\n\nShe also said the Zimbabwean Government is reviewing the SME Act to improve the operating environment for MSMEs.\n\nWe aim to enhance digitalization, access to finance, and overall capacity for MSMEs.\n\nWe are committed to creating a conducive environment that empowers MSMEs to become formalised, competitive, and export-oriented, she stated.\n\nThe Zambian delegation will receive a detailed presentation on the operations of the ministry and engage with successful entrepreneurs to learn about effective business practices.\n\nAs part of the visit, the two nations will discuss revisiting their Memoranda of Understanding on Small and Medium Enterprises and Cooperatives Development, with a signing ceremony scheduled for Thursday.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/05/Untitled-168.jpg",
            "description": "Mutsawashe Mashandure Herald Correspondent In a significant move to strengthen bilateral relations and promote economic cooperation, Zimbabwe and Zambia have embarked on a joint mission to develop the Micro, Small and Medium Enterprises (MSMEs) sector. The delegation is in the country on a four-day mission aimed at strengthening bilateral relations and enhancing cooperation in the […]",
            "time": "18:45",
            "date": "16 Dec 2024"
        },
        {
            "title": "Chief Hwenje bounces back, thanks First Family for support in cancer journey",
            "url": "https://www.herald.co.zw/chief-hwenje-bounces-back-thanks-first-family-for-support-in-cancer-journey/",
            "content": "Zvamaida Murwira\n\nSenior Reporter\n\nPopular musician Chief Hwenje has paid tribute to the First Family for their benevolence that saw him being flown to India for medical treatment after he was diagnosed of blood cancer.\n\nChief Hwenje, born Admire Sanyange Sibanda, entertained a bumper crowd at Mkandapi Business Centre in Shurugwi last Thursday as President Mnangagwa commissioned the resurfaced 43-kilometre Shurugwi-Mhandamabwe Road.\n\nHis energetic dances made it hard to believe that the renowned singer had just undergone a medical procedure in India.\n\nThe 37-year-old musician recently disclosed that he had been diagnosed with lymphoma, a type of blood cancer that affects the lymphatic and immune systems.\n\nIn an interview on the sidelines of the event, Chief Hwenje thanked President Mnangagwa and his family for facilitating his trip to India and for constantly checking on him.\n\nI want to thank the First Family for ensuring that I went to India. The President ensured that I got all the treatment and attention that I needed, including the medical procedure that I went through.\n\nThey would constantly check on me to hear about my progress. I also thank Zanu PF and its leadership in the Midlands Province, Gutu West legislator, Cde John Paradza, among others. They assisted a lot, particularly in taking care of my family as I was away. I had a medical procedure done and I am now feeling better, said Chief Hwenje.\n\nWhen asked about the new album that he was working on, Chief Hwenje said medical doctors have advised him to rest.\n\nFor now I will not be pursuing the new album. My medical team strongly advised me to rest and I am duty bound to do as they have directed. Until they say I can resume my work, I will be resting at my rural home, he said.\n\nChief Hwenje became a household name with songs such as Mai Welly, among others, and became an instant force to reckon with in the entertainment industry.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/12389ebb-d58e-47e2-9c11-6327a75e5edf-680x380.jpeg",
            "description": "Zvamaida Murwira Senior Reporter Popular musician Chief Hwenje has paid tribute to the First Family for their benevolence that saw him being flown to India for medical treatment after he was diagnosed of blood cancer. Chief Hwenje, born Admire Sanyange Sibanda, entertained a bumper crowd at Mkandapi Business Centre in Shurugwi last Thursday as President […]",
            "time": "18:45",
            "date": "16 Dec 2024"
        },
        {
            "title": "Government committed to supporting ZPCS: President",
            "url": "https://www.herald.co.zw/government-committed-to-supporting-zpcs-president/",
            "content": "Nqobile Bhebhe in Ntabazinduna\n\nPresident Mnangagwa has reassured the Zimbabwe Prisons and Correctional Service (ZPCS) of continued Government support to enable the organisation to fulfill its constitutional mandate.\n\nSpeaking at a pass-out parade of more than 1600 correctional officers at Ntabazinduna Training School this morning, President Mnangagwa said prison services are a vital cog in the security sector, adding that the Government will always support the institution.\n\nGovernment will render support to ZPCS to fulfill its constitutional mandate of protecting the nation through human incarceration and rehabilitation, said President Mnangagwa.\n\nHe told recruits that their career path demands unwavering commitment, and that their behaviour should not be tarnished by selfishness.\n\nPresident Mnangagwa said the Government will not tolerate untoward behaviour and corruption.\n\nHe said any member of ZPCS caught on the wrong side of the law will be brought to book.\n\nPresident Mnangagwa congratulated the recruits for completing the course.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/80a62152-9e23-47d3-ab87-72ca8e63e399-680x380.jpeg",
            "description": "Nqobile Bhebhe in Ntabazinduna President Mnangagwa has reassured the Zimbabwe Prisons and Correctional Service (ZPCS) of continued Government support to enable the organisation to fulfill its constitutional mandate. Speaking at a pass-out parade of more than 1600 correctional officers at Ntabazinduna Training School this morning, President Mnangagwa said prison services are a vital cog in […]",
            "time": "18:45",
            "date": "16 Dec 2024"
        },
        {
            "title": "Foreign Affairs Minister champions regional integration",
            "url": "https://www.herald.co.zw/foreign-affairs-minister-champions-regional-integration/",
            "content": "Wallace Ruzvidzo\n\nHerald Reporter\n\nRegional and continental integration must be championed by all countries, Foreign Affairs and International Trade Minister Professor Amon Murwira has said.\n\nSpeaking at a meeting with the Africa Group of Ambassadors in Harare today, Prof Murwira said Zimbabwe is committed to pan-African progress.\n\nAs provided and guided by His Excellency the President of the Republic of Zimbabwe, Dr Mnangagwa, Zimbabwe is an enemy to none and a friend to all.\n\nForeign Affairs and International Trade Minister, Professor Amon Murwira (centre) pose for a photo with group of African ambassadors after a meeting in Harare today. -Picture Memory Mangombe\n\nThis is a commitment to peaceful coexistence with other countries, as spelt out in our Constitution.\n\nWe know that you as individual ambassadors are working very hard and in an excellent way to enhance our bilateral relations.\n\nAs a collective, the African Group of Ambassadors is deploying all efforts to advance our continents development and integration agenda, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/fm1-680x380.jpeg",
            "description": "Wallace Ruzvidzo Herald Reporter Regional and continental integration must be championed by all countries, Foreign Affairs and International Trade Minister Professor Amon Murwira has said. Speaking at a meeting with the Africa Group of Ambassadors in Harare today, Prof Murwira said Zimbabwe is committed to pan-African progress. “As provided and guided by His Excellency the […]",
            "time": "18:45",
            "date": "16 Dec 2024"
        },
        {
            "title": "Public hearings on Broadcasting Services Amendment Bill begin",
            "url": "https://www.herald.co.zw/public-hearings-on-broadcasting-services-amendment-bill-begin/",
            "content": "Zvamaida Murwira\n\nSenior Reporter\n\nParliaments Portfolio Committee on Information, Publicity and Broadcasting Services today held a public hearing on the Broadcasting Services Amendment Bill that seeks to make it mandatory for motorists to buy radio licenses before buying vehicle licences and insurance cover, among other things.\n\nLegislators are required to gather views from members of the public through public hearings.\n\nInformation, Publicity and Broadcasting Services Minister, Dr Jenfan Muswere tabled the Bill in the National Assembly last Thursday where it was read for the first time.\n\nThe Bill was referred to the Parliamentary Legal Committee whose mandate is to scrutinise all Bills and Statutory Instruments that come before Parliament to check their compliance with the national Constitution.\n\nThe committee, chaired by Marondera Central legislator Mr Caston Matewu will visit several places this week, including Marondera, Mutare, Masvingo, Bulawayo, Bubi and Kwekwe.\n\nMinister Muswere, who is steering the Bill, is expected to deliver a comprehensive overview of the proposed law during its second reading stage.\n\nThe Bill provides that the requirement to buy a radio licence can only be waived through an exemption from the Zimbabwe Broadcasting Corporation.\n\nClause 15 of the Bill seeks to prohibit the sale of motor insurance cover and vehicle licence discs to persons who do not have ZBC radio licences.\n\nThe Zimbabwe National Road Administration and every motor insurance company shall only issue a motor vehicle licence and motor insurance policy to individuals who either hold a current radio licence issued by the Zimbabwe Broadcasting Corporation or a valid exemption certificate from ZBC, unless if the vehicle to be insured is not equipped with a radio receiver, reads the clause.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Minister-Muswere.jpg",
            "description": "Zvamaida Murwira Senior Reporter Parliament’s Portfolio Committee on Information, Publicity and Broadcasting Services today held a public hearing on the Broadcasting Services Amendment Bill that seeks to make it mandatory for motorists to buy radio licenses before buying vehicle licences and insurance cover, among other things. Legislators are required to gather views from members of […]",
            "time": "18:45",
            "date": "16 Dec 2024"
        },
        {
            "title": "Armed robbers pounce on Mukuru Money Transfer agency in Glen View",
            "url": "https://www.herald.co.zw/armed-robbers-pounce-on-mukuru-money-transfer-agency-in-glen-view/",
            "content": "Crime Reporter\n\nA gang of armed robbers this Monday morning raided a Mukuru Money Transfer agency at Makomva Shopping Centre in Glen View, Harare, and got away with a yet-to-be-disclosed amount of money.\n\nThe Mukuru booth, which is located inside a pharmacy, was raided at around 10am.\n\nThe robbers were armed with pistols and were travelling in a black Toyota Mark X that they parked in front of the premises before producing the firearms.\n\nAccording to sources, the robbers held the workers hostage before looting the cash.\n\nThey later fired shots in the air as they sped off from the scene while being chased by members of the public.\n\nPolice are yet to issue a statement over the case and a team of detectives from the CID Homicide and other departments have since been deployed to the scene to conduct investigations.\n\nMeanwhile, police in Harare are investigating a case of unlawful entry and theft which occurred on December 13 at a house along Abyone Drive in Newlands.\n\nThe suspect broke the dining room door and gained entry into the house before stealing a cash box containing US$20 000 and a laptop.\n\nPolice in Marondera are also investigating another case of unlawful entry and theft that occurred at Rakodzi Estate on December 12.\n\nThe suspects broke the main entrance door and gained entry into the house where they stole a Farbam shotgun, a Brno shotgun and a BSA rifle.\n\nThe incident occurred while the complainant was away in Harare.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/05/armed-robbers-used-gun-robbery-260nw-1495712093.jpeg",
            "description": "Crime Reporter A gang of armed robbers this Monday morning raided a Mukuru Money Transfer agency at Makomva Shopping Centre in Glen View, Harare, and got away with a yet-to-be-disclosed amount of money. The Mukuru booth, which is located inside a pharmacy, was raided at around 10am. The robbers were armed with pistols and were […]",
            "time": "18:45",
            "date": "16 Dec 2024"
        },
        {
            "title": "Live Coverage: President officiates at ZPCS pass out parade",
            "url": "https://www.herald.co.zw/president-officiates-at-zpcs-pass-out-parade/",
            "content": "10.32 President Mnangagwa has arrived at the Zimbabwe Prisons and Correctional Service (ZPCS) Training School in Ntabazinduna ahead of the 154th pass out parade.\n\nScores of people, including newly recruited correctional officers, Government officials, senior prison officers and relatives of the graduates are in attendance.\n\nThere is a hive of activity at the graduation grounds as the prison band is entertaining guests.\n\nPresident Mnangagwa is anticipated to officiate at the event and deliver his keynote address.\n\nA total of 1 600 officers will graduate following the completion of a rigorous six-month training programme.\n\nAmong the graduating officers are recruits from the San community in Tsholotsho, whose representation in national security services has been progressively increasing.\n\nThis development follows the graduation of a group of 20 youths from the community in June 2022.\n\nBefore the Second Republic intervened, the San people lived in isolation, disconnected from the rest of the country.\n\nMany of them did not have birth certificates or identity documents, which impeded them from accessing essential services such as healthcare and voting.\n\nAs a result of these challenges, a significant number of San individuals were unable to attend school, leaving them without the qualifications needed for formal employment.\n\nOur Bulawayo Bureau, Nqobile Bhebhe is in Ntabazinduna and will be giving us live updates of the event. Stay tuned to get all the details.\n\n11.21 President arrives in NtabazindunaPresident Mnangagwa has arrived for the pass out parade of 1619 recruits, at ZPCS Ntabazinduna Training School in Matabeleland North Province, of which 513 are female.\n\n10.31 Entertainment galore as recruits display their drills\n\nZimbabwe Prisons and Correctional Service (ZPCS) Training School in Ntabazinduna is bursting with excitement as recruits entertain guests with well-choreographed drills.\n\nThe pass out parade consists of 1107 males and 512 females, a combined parade of correctional officers from course numbers 154 and 155.\n\nDressed in their immaculate grey uniforms, the recruits are displaying various drills.\n\nThere are loud cheers from guests as recruits pass through various stands.\n\nPresident Mnangagwa is the guest of honour.\n\n13.35 Government committed to supporting ZPCS: President\n\nPresident Mnangagwa has reassured the Zimbabwe Prisons and Correctional Service (ZPCS) of continued Government support to enable the organisation to fulfill its constitutional mandate.\n\nSpeaking at a pass-out parade of more than 1600 correctional officers at Ntabazinduna Training School this morning, President Mnangagwa said prison services are a vital cog in the security sector, adding that the Government will always support the institution.\n\nGovernment will render support to ZPCS to fulfill its constitutional mandate of protecting the nation through human incarceration and rehabilitation, said President Mnangagwa.\n\nHe told recruits that their career path demands unwavering commitment, and that their behaviour should not be tarnished by selfishness.\n\nPresident Mnangagwa said the Government will not tolerate untoward behaviour and corruption\n\n.He said any member of ZPCS caught on the wrong side of the law will be brought to book.\n\nPresident Mnangagwa congratulated the recruits for completing the course.\n\n",
            "image_url": null,
            "description": "10.32 – President Mnangagwa has arrived at the Zimbabwe Prisons and Correctional Service (ZPCS) Training School in Ntabazinduna ahead of the 154th pass out parade. Scores of people, including newly recruited correctional officers, Government officials, senior prison officers and relatives of the graduates are in attendance. There is a hive of activity at the graduation grounds […]",
            "time": "18:45",
            "date": "16 Dec 2024"
        },
        {
            "title": "President to officiate at ZPCS pass out parade",
            "url": "https://www.herald.co.zw/president-to-officiate-at-zpcs-pass-out-parade/",
            "content": "Nqobile Bhebhe in Ntabazinduna\n\nPresident Mnangagwa has arrived at the Zimbabwe Prisons and Correctional Service (ZPCS) Training School in Ntabazinduna ahead of the 154th pass out parade.\n\nScores of people, including newly recruited correctional officers, Government officials, senior prison officers and relatives of the graduates are in attendance.\n\nThere is a hive of activity at the graduation grounds as the prison band is entertaining guests.\n\nPresident Mnangagwa is anticipated to officiate at the event and deliver his keynote address.\n\nA total of 1 600 officers will graduate following the completion of a rigorous six-month training programme.\n\nAmong the graduating officers are recruits from the San community in Tsholotsho, whose representation in national security services has been progressively increasing.\n\nThis development follows the graduation of a group of 20 youths from the community in June 2022.\n\nBefore the Second Republic intervened, the San people lived in isolation, disconnected from the rest of the country.\n\nMany of them did not have birth certificates or identity documents, which impeded them from accessing essential services such as healthcare and voting.\n\nAs a result of these challenges, a significant number of San individuals were unable to attend school, leaving them without the qualifications needed for formal employment.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/ZP4-680x380.jpeg",
            "description": "Nqobile Bhebhe in Ntabazinduna President Mnangagwa has arrived at the Zimbabwe Prisons and Correctional Service (ZPCS) Training School in Ntabazinduna ahead of the 154th pass out parade. Scores of people, including newly recruited correctional officers, Government officials, senior prison officers and relatives of the graduates are in attendance. There is a hive of activity at […]",
            "time": "18:45",
            "date": "16 Dec 2024"
        },
        {
            "title": "Passengers Association of Zimbabwe demands action against touts harassing passengers",
            "url": "https://www.herald.co.zw/passengers-association-of-zimbabwe-demands-action-against-touts-harassing-passengers/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nThe Passengers Association of Zimbabwe (PAZ) has condemned the persistent harassment of travellers at bus termini and ranks across the country.\n\nThis follows a surge in reports of touts intimidating, harassing, and even assaulting passengers at transit hubs, including Simon Muzenda Bus Terminus, Mbare Musika, Mutare Rank, Mutoko Rank and at the Harare Exhibition Park.\n\nPAZ national coordinator Mr Tafadzwa Goliati expressed deep concern over the growing insecurity in public transport spaces.\n\nThis behavior is unacceptable, said Mr Goliati.\n\nPassengers are being bullied, manhandled, and subjected to verbal abuse by touts operating with impunity. It is time for decisive action to protect travellers. The safety and dignity of passengers must be prioritised.\n\nPAZ called on the Zimbabwe Republic Police (ZRP) and municipal police to strengthen their presence at these hotspots and crack down on unlicensed operators and rogue elements.\n\nSaid Mr Goliati: We demand the immediate arrest of these touts who are tarnishing the public transport sector. We also urge the police to work closely with municipalities to create a safer environment for passengers. Enough is enough.\n\nThe association has also encouraged passengers who are harassed to report such incidences to PAZ or local authorities.\n\nWe understand that some victims are afraid to speak out, but by reporting these cases, we can help bring perpetrators to justice, Mr Goliati said.\n\nPAZ vowed to continue advocating for the rights of passengers.\n\nWe want a public transport system that respects people, not one that thrives on intimidation, Mr Goliati said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Tafadzwa-Goliati.gif",
            "description": "Ivan Zhakata Herald Correspondent The Passengers Association of Zimbabwe (PAZ) has condemned the persistent harassment of travellers at bus termini and ranks across the country. This follows a surge in reports of touts intimidating, harassing, and even assaulting passengers at transit hubs, including Simon Muzenda Bus Terminus, Mbare Musika, Mutare Rank, Mutoko Rank and at […]",
            "time": "18:45",
            "date": "16 Dec 2024"
        }
    ]
}