{
    "news": [
        {
            "title": "Zim committed to a prosperous world: President . . . ‘People-centred development critical’",
            "url": "https://www.herald.co.zw/zim-committed-to-a-prosperous-world-president-people-centred-development-critical/",
            "content": "Wallace Ruzvidzo in KAMPALA, Uganda\n\nZimbabwe is committed to playing its role in ensuring sustainable and people-centred development across the world and Africa in particular, SADC Chairperson, President Mnangagwa, has said.\n\nThe President, who arrived here yesterday, will today join fellow Heads of State and Government at the 11th Session of the Africa Regional Forum on Sustainable Development (ARFSD-11) which will be held under the theme, Driving job creation and economic growth through sustainable, inclusive, science-and evidence-based solutions for the 2030 Agenda and Agenda 2063.\n\nHe was welcomed by Ugandan Public Service Minister Wilson Mukasa and Zimbabwean Ambassador to Uganda Mrs Winpeg Moyo, among other officials.\n\nWriting on his official X handle soon after touching down at Entebbe International Airport, President Mnangagwa reaffirmed Zimbabwes commitment to the attainment of the United Nations agenda 2030 and the African Unions Agenda 2063.\n\nI have arrived in Entebbe, Uganda, for the 11th Africa Regional Forum on Sustainable Development (ARFSD11).\n\nWe are committed to building a prosperous Africa through sustainable, people-centred development anchored in innovation and regional cooperation for Agenda 2030 and 2063, he said.\n\nAs the current SADC Chair, the President is set to deliver remarks during a Presidential Panel session alongside his counterparts  President William Ruto of Kenya (East Africa Community Chair), President Bola Tinubu of Nigeria (Chair of the Economic Community of West African States), President Teodoro Mbasogo of Equatorial Guinea (Chair of the Economic Community of Central African States), President Ismael Guelleh of Djibouti (Chair of the Intergovernmental Authority for Development), President Alassane Ouattara of Ivory Coast (Champion of the Second Ten-year implementation plan (STYIP) of Agenda 2063), and Philemon Yang of the UN GeneralAssembly.\n\nThe ARFSD-11 is a timely opportunity to drive real change and to rescue the SDGs and Agenda 2063.\n\nAfrica, like the rest of the world, is off track in meeting most targets of the Sustainable Development Goals and has even regressed in some areas.\n\nAlongside the SDGs, Heads of State and Government of the African Union have adopted and called for effective implementation of the Second Ten-year implementation plan (STYIP) of Agenda 2063.\n\nIn an interview in Harare yesterday just before departure for Uganda, the Minister of Foreign Affairs and International Trade, Professor Amon Murwira, said the President is expected to contribute to a panel that will discuss the financing of all socio-economic indicators.\n\nPresident Mnangagwa is attending the United Nations meeting under the United Nations Economic Commission for Africa. He is going there as chair of SADC and he is going to contribute to a very important panel on socio-economic development indicators, as well as the financing of all these socio-economic indicators.\n\nThe high-level meeting brings together governments, officials, experts, and stakeholders to discuss progress, challenges and opportunities in implementing sustainable development goals in Africa.\n\nTomorrow, (today) he will join that panel of other regional economic communities, like the East African Community (EAC). He is going there as SADC chair and he is going to make very important interventions, said Professor Murwira.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/President-in-Uganda-680x380.jpg",
            "description": "Wallace Ruzvidzo in KAMPALA, Uganda Zimbabwe is committed to playing its role in ensuring sustainable and people-centred development across the world and Africa in particular, SADC Chairperson, President Mnangagwa, has said. The President, who arrived here yesterday, will today join fellow Heads of State and Government at the 11th Session of the Africa Regional Forum […]",
            "time": "06:41",
            "date": "09 Apr 2025"
        },
        {
            "title": "Govt rolls out Internet for 2 400 wards",
            "url": "https://www.herald.co.zw/govt-rolls-out-internet-for-2-400-wards/",
            "content": "Zvamaida Murwira-Senior Reporter\n\nCABINET has approved the rollout of the Presidential Internet Scheme, a transformative initiative aimed at delivering high-speed broadband connectivity to all 2 400 administrative wards across Zimbabwe.\n\nAddressing a post-Cabinet media briefing in Harare yesterday, Information, Publicity and Broadcasting Services Minister, Dr Jenfan Muswere, said this is part of a programme to consolidate the Second Republics thematic area on digital economy in line with the National Development Strategy 1 (NDS1).\n\nCabinet considered and approved the Implementation of the Presidential Internet Scheme. In accordance with the provisions of the Thematic Area on Digital Economy of the National Development Strategy 1, the Presidential Internet Scheme aims to provide reliable broadband internet connectivity targeting all 2 400 administrative wards across the nation. This initiative will employ advanced Low Earth Orbit satellite technology and fibre optic infrastructure to ensure comprehensive coverage and accessibility, said Dr Muswere.\n\nThese will cover schools, Community Information Centres, Zimbabwe Republic Police stations, health institutions, traditional leaders homesteads, Agriculture Extension offices, courts, District Development Coordinators offices, Vocational Training Centres and Growth Points in the wards. The programme will target to connect the unconnected by focusing on the areas and sites that are situated in remote parts of the country and are currently not connected.\n\nHe said the project is expected to start in June 2025 and run until 2030 with continuous review due to the ever-changing technology landscape.\n\nThe Presidential Internet Scheme will bring out the following outcomes to rural communities: enhanced broadband connectivity, improved access to digital services, increased Information Communication Technology utilisation, improved financial inclusion, increased digital literacy, improved digital economy growth, increased transparency, effectiveness and efficiency in governance services. This is in line with the Smart Zimbabwe Master Plan, Dr Muswere said.\n\nResponding to questions from journalists, Information Communication and Technology, Postal and Courier Services Minister Tatenda Mavetera said there were ongoing discussions to partner with Space X (Starlink) and engage other local internet service providers, in a bid to improve internet access and affordability.\n\nShe said they have been engaging service providers to rationalise data tariffs and make them affordable, particularly to the rural community.\n\nWe had conversations on how we can reduce the premiums, and we agreed on a figure that we are going to disclose very soon, and its quite lower than what we are getting as of now. So, we need to conclude on all the documentation so that we can then publicise that, Minister Mavetera said.\n\nWe are going to come up with free Wi-Fi zones that we are going to institute, especially in our rural areas. We will be using our community information centres, to be called digital centres. So, they definitely will have access to free Wi-Fi, and more efforts are still being made for us to work on the price of data. But I am sure you all agree that the price of data has relatively gone down for months.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Ministers-cabinet-briefing-680x380.jpg",
            "description": "Zvamaida Murwira-Senior Reporter CABINET has approved the rollout of the Presidential Internet Scheme, a transformative initiative aimed at delivering high-speed broadband connectivity to all 2 400 administrative wards across Zimbabwe. Addressing a post-Cabinet media briefing in Harare yesterday, Information, Publicity and Broadcasting Services Minister, Dr Jenfan Muswere, said this is part of a programme to […]",
            "time": "06:41",
            "date": "09 Apr 2025"
        },
        {
            "title": "Zimstat survey signals positive economic outlook",
            "url": "https://www.herald.co.zw/zimstat-survey-signals-positive-economic-outlook/",
            "content": "Tapiwanashe Mangwiro-Senior Business Reporter\n\nTHE latest Business Tendency Survey (BTS) conducted by the Zimbabwe National Statistics Agency (Zimstat) for the fourth quarter of 2024 has revealed an optimistic outlook for the countrys economy, with improvements noted in several key business confidence indicators.\n\nThe BTS is a quarterly assessment aimed at gauging the sentiments and expectations of business managers regarding various aspects of the economy, such as production, employment, investment and demand.\n\nIt serves as a critical tool for policymakers, economists and investors to monitor economic trends and make informed decisions.\n\nAccording to Zimstat, the survey showed that about 43 percent of the respondents expected an improvement in the general business situation over the next quarter.\n\nThis demonstrates growing confidence among business operators, particularly in the manufacturing and retail sectors, which have been pivotal in driving economic growth.\n\nFurthermore, Zimstat highlighted that 33 percent of respondents reported increased sales in the current quarter compared to the previous quarter.\n\nThis positive performance was largely attributed to favourable demand conditions and enhanced marketing strategies by businesses.\n\nAdditionally, the survey noted that the overall employment expectations index was positive, with 45 percent of respondents anticipating an increase in employment in the next quarter.\n\nThis projection aligns with the Governments broader objectives of stimulating job creation and improving livelihoods.\n\nSpeaking on the surveys findings, economist Mr Tinevimbo Shava said: The positive sentiment expressed by businesses is a sign of resilience and adaptation amid various economic challenges. It also reflects confidence in ongoing economic reforms.\n\nAnother economist, Gladys Shumbambiri-Mutsopotsi, echoed similar sentiments, stating: The improvements in sales and employment expectations are encouraging. It suggests that businesses are beginning to see tangible results from their strategic efforts to optimise operations.\n\nZimstat further reported that investment intentions remained positive, with 52 percent of respondents indicating plans to expand their businesses.\n\nSuch intentions are crucial for long-term economic growth and stability, particularly as Zimbabwe seeks to attract more domestic and foreign investments.\n\nThe BTS also revealed that 35 percent of respondents reported increased production during the survey period.\n\nThis up-tick in production is expected to bolster the countrys manufacturing sector, which has been recovering steadily following supply chain disruptions caused by global economic turbulence.\n\nAnalysts believe the positive indicators captured by the survey can be further strengthened through continued policy consistency and improved access to finance.\n\nIf the Government maintains its reform agenda and addresses bottlenecks such as energy supply, we are likely to see sustained growth, noted Mr Shava.\n\nAs the country navigates 2025, the optimistic outlook reflected in the Business Tendency Survey provides a promising foundation for economic growth. The findings will be instrumental for stakeholders across the economy as they plan for the future with greater confidence.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/02/zimstat.jpg",
            "description": "Tapiwanashe Mangwiro-Senior Business Reporter THE latest Business Tendency Survey (BTS) conducted by the Zimbabwe National Statistics Agency (Zimstat) for the fourth quarter of 2024 has revealed an optimistic outlook for the country’s economy, with improvements noted in several key business confidence indicators. The BTS is a quarterly assessment aimed at gauging the sentiments and expectations […]",
            "time": "06:41",
            "date": "09 Apr 2025"
        },
        {
            "title": "Zimbabwe, Zambia to deepen ties",
            "url": "https://www.herald.co.zw/zimbabwe-zambia-to-deepen-ties/",
            "content": "Blessings Chidakwa-Herald Reporter\n\nZIMBABWE and Zambia are one and should continue deepening political and economic ties through enhanced collaboration, trade promotion and education partnerships, Zambias ruling United Party for National Development (UPND) secretary-general Mr Batuke Imenda, has said.\n\nMr Imenda made the remarks after paying a courtesy call on President Mnangagwa at State House in Harare yesterday during a visit aimed at strengthening party-to-party and national ties.\n\nThe visit was a follow-up to one made to Zambia by a delegation led by Zanu PF secretary-general Cde Obert Mpofu two years ago.\n\nSpeaking to journalists after the meeting, Mr Imenda highlighted the deep-rooted historical ties between the two countries that date back to the liberation struggle.\n\nZimbabwe (Southern Rhodesia) and Zambia (Northern Rhodesia) were once part of the Federation of Rhodesia and Nyasaland in the colonial era.\n\nEven after independence, we feel that the long-standing relationship should continue and that we have agreed, as two political parties  Zanu PF and the United Party for National Development  to work together, to be united, Mr Imenda said.\n\nWe strongly want to see to it that these two countries persevere under difficult conditions. And we are going to support our brothers who are in Government. As far as we are concerned, Zimbabwe is part of Zambia, and Zambia is part of Zimbabwe.\n\nThe UPND Secretary-General stressed the importance of non-interference in each others internal affairs and mutual respect, calling for increased trade and educational cooperation.\n\nHe said more than 6,000 Zimbabwean students are currently studying at Zambian universities.\n\nSo, we feel, as a country, these are the kinds of exchanges we should have between the two nations, Mr Imenda said.\n\nHe lauded President Mnangagwa, describing him as an accommodating leader.\n\nWe thank President Mnangagwa for giving us a rare opportunity within a short period of time to see him. As soon as he heard that we were meeting at the Zanu PF headquarters, he indicated to Dr Mpofu, please, I would spare a few minutes to meet our Zambian visitors before I proceed to Uganda; bring them here so that I can greet them. That was a rare opportunity accorded to us. We thank him very much.\n\nMr Imenda said following Cde Mpofus visit to Zambia two years ago, they felt it was their duty to reciprocate the visit.\n\nCde Mpofu said one of the major issues raised during the discussions was that of fugitives who commit crimes in Zambia and hide in Zimbabwe, and vice versa.\n\nSo that is one issue that we deliberated upon, and then we indicated to our counterparts that Zimbabwe recognises and works with political parties that are in power.\n\nHe added that it was important for ruling parties to meet regularly and deal with various issues of mutual interest.\n\nWe agreed that we would be meeting regularly and clearing out some of the grey areas. This was endorsed by many of the members of the UPND.\n\nThe visit marks another step in strengthening bilateral and socio-economic cooperation between the two nations.\n\nPresent at the meeting were Zimbabwes Ambassador to Zambia, Charity Charamba, Dr Mpofu, Foreign Affairs Minister Professor Amon Murwira, and Zanu PF secretary for External Affairs, Cde Simbarashe Mumbengegwi\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/President-Mnangagwa-with-Zambian-Batuke-Imenda-680x380.jpg",
            "description": "Blessings Chidakwa-Herald Reporter ZIMBABWE and Zambia are one and should continue deepening political and economic ties through enhanced collaboration, trade promotion and education partnerships, Zambia’s ruling United Party for National Development (UPND) secretary-general Mr Batuke Imenda, has said. Mr Imenda made the remarks after paying a courtesy call on President Mnangagwa at State House in […]",
            "time": "06:41",
            "date": "09 Apr 2025"
        },
        {
            "title": "Sadc to resolve DRC-Zambia border challenges",
            "url": "https://www.herald.co.zw/sadc-to-resolve-drc-zambia-border-challenges/",
            "content": "Gibson Nyikadzino-Zimpapers Politics Hub\n\nSADC ministers responsible for trade, transport, infrastructure, and security are set to meet virtually on Friday to address challenges at the Kasumbalesa Border Post between the Democratic Republic of Congo (DRC) and Zambia.\n\nIn a statement yesterday, the regional body noted that the Kasumbalesa Border Post has faced persistent issues, including congestion, trade facilitation-related constraints, infrastructure challenges, and rising security concerns, particularly affecting truck drivers and the broader trading community.\n\nRecognising the strategic importance of the Kasumbalesa border post for intra-regional trade, the SADC region will adopt a corridor-wide approach to address these ongoing challenges.\n\nThis approach takes into account that resolving issues at a single border post alone is not sustainable, as efficiencies gained may be offset by bottlenecks at adjacent border crossings and along the trade corridors, the statement read.\n\nKasumbalesa connects several regional trade arteries such as the North-South Corridor, the Central Development Corridor (Dar es Salaam), the Walvis Bay-Ndola-Lubumbashi Corridor, and the Beira and Lobito development corridors.\n\nMinister of Transport and Infrastructural Development Felix Mhona will chair the meeting as the bloc seeks to create actionable plans for infrastructure improvement, enhanced trade facilitation, and security measures along these essential corridors, ensuring seamless regional trade flow.\n\nIn January, DRC and Zambian officials met at the directive of their principals, Presidents Felix Tshisekedi and Hakainde Hichilema, to find ways to clear the congestion issues after the introduction of a new Electronic Seals Clearance System (ESCS) at the border post.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Zanbia-Border-post-680x380.jpg",
            "description": "Gibson Nyikadzino-Zimpapers Politics Hub SADC ministers responsible for trade, transport, infrastructure, and security are set to meet virtually on Friday to address challenges at the Kasumbalesa Border Post between the Democratic Republic of Congo (DRC) and Zambia. In a statement yesterday, the regional body noted that “the Kasumbalesa Border Post has faced persistent issues, including […]",
            "time": "06:41",
            "date": "09 Apr 2025"
        },
        {
            "title": "President Chapo to open ZITF",
            "url": "https://www.herald.co.zw/president-chapo-to-open-zitf/",
            "content": "Zvamaida Murwira-Senior Reporter\n\nMozambican President Daniel Chapo will open this years 65th edition of the Zimbabwe International Trade Fair on 25 April 2024 in Bulawayo, as more exhibitors continue to register to participate in the countrys premier annual trade exhibition event.\n\nThis was said by Information, Publicity and Broadcasting Services Minister, Dr Jenfan Muswere, while delivering the ninth Post-Cabinet briefing held in Harare yesterday.\n\nCabinet received an update on the State of Preparedness for the 2025 Zimbabwe International Trade Fair: April 21-26 2025. The 65th Edition of the Zimbabwe International Trade Fair (ZITF) is scheduled for 21 to 26 April 2025 and will be held under the theme Industrialisation: Crafting an Integrated Landscape. A key highlight is the extension of the event to six days. The President of the Republic of Mozambique, His Excellency Daniel Chapo, will officially open the 65th Edition of ZITF on April 25, 2025, he said.\n\nThe Ministry of Industry and Commerce, said Dr Muswere, is conducting strategic dialogues with national Business Member Organisations and industry associations to maximise private sector participation and input.\n\nAs part of preparations for the event, Air Zimbabwe and Fast Jet were engaged with the aim of increasing flight frequency for exhibitors and visitors, ensuring a positive customer experience. As at April 7, 2025, 596 direct exhibitors had registered to participate, compared to 428 who registered during the same period in 2024. Of these, 98 are exhibiting for the first time, said Dr Muswere.\n\nIn terms of the current space booking situation, 95% has been booked to date, compared to 87% booked during the same period in 2024. International exhibitor space uptake has increased, with 29 countries having registered. These include: Afghanistan, Angola, Austria, Belarus, Botswana, Brazil, Canada, China, the European Union delegation, Egypt, Ethiopia, France, Germany, Indonesia, Italy, Japan, Kenya, Malawi, Mozambique, Netherlands, Pakistan, Rwanda, South Africa, Sweden, Tanzania, the United Kingdom, the United States of America, United Arab Emirates, and Zambia.\n\nHe said this surpassed the 27 participating nations as of 2024, while India will also be participating.\n\nSome of the events that will take place during ZITF include: the International Business Community, Connect Africa Symposium, and a return of the CBZ Original Equipment Manufacturers, among others.\n\nThere will also be the Rural Industrialisation Indaba featuring for the first time, said Dr Muswere.\n\nThe increase in the number of participating nations at the trade showpiece is evidence of the success of the Governments engagement and re-engagement drive.\n\nSince coming to power in 2017, President Mnangagwas administration has made economic diplomacy an integral part of the Governments foreign policy.\n\nThe mandate of the ZITF Company, responsible for organising the exhibition, includes spearheading national branding efforts, promoting investments, and economic growth.\n\nThe ZITF Company recently launched a series of regional roadshows in Botswana, South Africa, and Zambia to signal the official countdown to the 65th edition of its annual exhibition in Bulawayo.\n\nThe roadshows were interactive networking sessions that sought to highlight the benefits of participating in ZITF events and exploring regional collaboration opportunities.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Daniel-Chapo.jpg",
            "description": "Zvamaida Murwira-Senior Reporter Mozambican President Daniel Chapo will open this year’s 65th edition of the Zimbabwe International Trade Fair on 25 April 2024 in Bulawayo, as more exhibitors continue to register to participate in the country’s premier annual trade exhibition event. This was said by Information, Publicity and Broadcasting Services Minister, Dr Jenfan Muswere, while […]",
            "time": "06:41",
            "date": "09 Apr 2025"
        },
        {
            "title": "US$12 million  for ARVs availed",
            "url": "https://www.herald.co.zw/us12-million-for-arvs-availed/",
            "content": "George Maponga-Masvingo Bureau\n\nGOVERNMENT has allayed fears of an impending shortage of anti-retroviral drugs (ARVs) as the country has sufficient stocks of drugs after US$12 million was made available to import the life-saving drugs which will last the nation until September this year.\n\nThere were fears the country could be plagued by a shortage of ARVs in the wake of reports that the US Government was withdrawing aid for critical areas such as the fight against HIV and Aids and other pandemics under a new pivot by the administration of President Donald Trump.\n\nWith the US government being a major bilateral donor to Zimbabwes health sector directly and through the Global Fund for fighting against HIV and Aids, there were fears the country could be caught off guard by Washingtons withdrawal.\n\nHowever, the Minister of Health and Child Care, Dr Douglas Mombeshora, recently said there was no need to press the panic button as the Government was pulling all the stops to make sure the country has enough stocks for HIV and Aids drugs and others for diseases such as malaria.\n\nMinister Mombeshora told journalists attending a National Aids Council(NAC) media workshop in Chinhoyi that Zimbabwe would soon take delivery of HIV and Aids drugs sufficient to last the nation up to September this year.\n\nHe said the Government had put in place strategies to assuage the effects of an abrupt cut in funding by the United States Government.\n\nWe have put in place strategies to make sure that our people are not vulnerable and I want to assure the nation that we have enough stocks of ARVs for all those in need and those who need them so there is no need to panic. By the end of June we will be receiving new stocks so dont panic, said Minister Mombeshora.\n\nWe have made available US$12 million to import more drugs and this means the additional stock of drugs will now take us up to the end of September so there is no need to panic. We purchase these drugs in batches so that we dont run out.\n\nThe minister revealed that the Government was looking at other avenues to raise funds to procure ARVs other than relying on the Aids levy only.\n\nGovernment was reprioritising to make sure first preference was given to procurement of ARVs and medication for other diseases such as malaria and tuberculosis that were mainly covered by US aid.\n\nMinister Mombeshora said conservative estimates showed that support from the US government in terms of fighting HIV and Aids together with malaria and tuberculosis was around 36 percent.\n\nTo cover for the 36 percent funding gap that has been created we are reprioritising the provision of these drugs (ARVs, TB and Malaria) so that there are no consequences and our people do not die, said Minister Mombeshora.\n\nWe are guided by the President Cde Dr ED Mnangagwas philosophy that Nyika Inovakwa Nevene Vayo, and we are doing that in the health sector too, if we get donors they are welcome but they must be a bonus.\n\nAccording to the Minister, there has been a remarkable decline in new HIV and Aids infections in the country that has resulted in the achievement of the 95-95-95 target.\n\nHowever, we cannot afford to be complacent, we must continue to work especially targeting specific vulnerable populations such as sex workers and adolescents, said the Minister.\n\nZimbabwe was also on the cusp of a new dawn with Minister Mombeshora announcing that plans to introduce a National Health Insurance Scheme that would cover every Zimbabwean were in the pipeline.\n\nHe said the Ministry of Finance would work out the modalities of how funds for the scheme would be raised and the amounts involved but pointed out that proceeds from the scheme would also mobilise sufficient funding to equip the countrys health sector and give every citizen health insurance.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/10/Minister-Mombeshora.jpg",
            "description": "George Maponga-Masvingo Bureau GOVERNMENT has allayed fears of an impending shortage of anti-retroviral drugs (ARVs) as the country has sufficient stocks of drugs after US$12 million was made available to import the life-saving drugs which will last the nation until September this year. There were fears the country could be plagued by a shortage of […]",
            "time": "06:41",
            "date": "09 Apr 2025"
        },
        {
            "title": "Urban renewal project roars to life",
            "url": "https://www.herald.co.zw/urban-renewal-project-roars-to-life/",
            "content": "Remember Deketeke-Herald Correspondent\n\nThe large-scale urban renewal programme has started on a high note in Harare, with Mbare becoming the first beneficiary under the initiative aimed at transforming the suburb into a thriving economic hub and tourist destination.\n\nThe project aligns with the National Revitalisation Plan (NRP), which aims to improve conditions for social, spatial, cultural, and economic development in degraded areas, creating favourable conditions for business investment.\n\nThe project, currently underway, includes the construction of a new Mbare market and a complete overhaul of the suburbs road network.\n\nHarare Metropolitan Provincial Affairs and Devolution Minister Charles Tavengwa said Mbare holds a strategic position in Harares economic and cultural landscape and is a key target in the Governments master plan for upgrading urban living standards across the province.\n\nWe are leaving no stone unturned in transforming Mbare. This is not just about erecting buildings or fixing roads; it is about restoring dignity, order, and opportunity to a suburb that has historically been a pillar of trade and community life in Harare, Minister Tavengwa said.\n\nAmong the measures being rolled out are enhanced security patrols, improved waste management systems, and infrastructural development focused on accessibility.\n\nThe minister said authorities are working closely with law enforcement agencies and local council departments to ensure that Mbare is safe for residents, tourists, and business operators.\n\nWe have boosted lighting in key areas, deployed more police patrols, and introduced smart waste disposal initiatives. Cleanliness and safety are at the heart of this transformation, he added.\n\nMinister Tavengwa emphasised that Mbare is among the top urban zones listed in the provinces master plan for development, with a focus on improving housing, sanitation, public transport, and public spaces.\n\nUpgrading living standards in Mbare is not just a priority; it is a responsibility. We are working on long-term housing solutions and better social services to ensure that residents enjoy a decent quality of life, said Tavengwa.\n\nThe facelift will not only enhance Mbares infrastructure but will also rebrand its image and revive its historic significance as a commercial powerhouse.\n\nThe rehabilitation of roads and the erection of the new Mbare Market are part of a broader strategy to reposition Mbare as an economic giant, said Eng. Tendai Mafoti, Project Manager for the Masimba-led development.\n\nWe want to attract business from across the globe and promote tourism by improving the infrastructure, especially around the Mbare hub.\n\nIn recent years, Mbare has faced deteriorating infrastructure and congestion, deterring both visitors and investment.\n\nThe Government believes that modernising the suburbs core facilities will draw in tourists and traders who had previously avoided the area due to its poor road conditions and outdated market facilities.\n\nThe road rehabilitation works, which include widening, resurfacing, and improved signage on Remembrance Drive and Chaminuka Street, among other major roads, are expected to ease traffic flow and ensure safer, more accessible routes for locals and tourists alike.\n\nEngineer Mafoti said this model will be replicated across other urban centres in Zimbabwe as part of a long-term national renewal strategy.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Mbare-Musika1-680x380.jpg",
            "description": "Remember Deketeke-Herald Correspondent The large-scale urban renewal programme has started on a high note in Harare, with Mbare becoming the first beneficiary under the initiative aimed at transforming the suburb into a thriving economic hub and tourist destination. The project aligns with the National Revitalisation Plan (NRP), which aims to improve conditions for social, spatial, […]",
            "time": "06:41",
            "date": "09 Apr 2025"
        },
        {
            "title": "1 000 Youth Service graduates earmarked for employment",
            "url": "https://www.herald.co.zw/1-000-youth-service-graduates-earmarked-for-employment/",
            "content": "Herald Reporter\n\nOver 1 000 graduates from the first two cohorts of the Youth Service in Zimbabwe Programme will soon be employed at various public institutions and State Owned Enterprises across the country, a cabinet Minister has said.\n\nPresident Mnangagwa launched the Youth Service in Zimbabwe Programme in Murehwa last year.\n\nSpeaking at a post Cabinet briefing in Harare yesterday, Information, Publicity and Broadcasting Services Minister, Dr Jenfan Muswere, said the initiative, which targets youth empowerment through six months of training, is channelling graduates from the first two cohorts into public institutions, uniformed forces, state enterprises, and national development programmes.\n\nOther graduates from the same cohort are pursuing further skills training at vocational centres across the country.\n\nThe Youth Service in Zimbabwe Programme that was launched by His Excellency President Dr Emerson Mnangagwa in May 2024, is already harnessing positive dividends on the youth demographic group, Dr Muswere said.\n\nThe first two cohorts of students numbering 1 077 who graduated from the six months training programme are already earmarked for employment at State-funded higher and tertiary education institutions, the Public Service, Uniformed forces, State-Owned Enterprises, including special programmes, such as the Presidential Solarisation Programme, the Emergency Road Rehabilitation Programme and the Presidential Borehole Drilling Scheme.\n\nOther graduates are already enrolling for further skills upgrading at various Vocational Training Centres around the country.\n\nGovernment has already made it mandatory that vocational certificates will be prioritised for accessing empowerment loans and entrepreneurial start-ups, from the Empower Bank.\n\nThe Youth Service in Zimbabwe, aims to empower and train youth aged 18-35 through a 6-month program focusing on life skills, entrepreneurship, and national orientation, with a goal of fostering patriotism and civic responsibility.\n\nIt was established in 2001, following the Nziramasanga Commission Report of 1999, which recommended youth civic education training.\n\nThe new curriculum infuses national orientation with life skills training and entrepreneurial development.\n\nThe program aims to inculcate values of patriotism, discipline, national identity, service, and civic responsibility.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Minister-Muswere-2-680x380.jpg",
            "description": "Herald Reporter Over 1 000 graduates from the first two cohorts of the Youth Service in Zimbabwe Programme will soon be employed at various public institutions and State Owned Enterprises across the country, a cabinet Minister has said. President Mnangagwa launched the Youth Service in Zimbabwe Programme in Murehwa last year. Speaking at a post […]",
            "time": "06:41",
            "date": "09 Apr 2025"
        },
        {
            "title": "Editorial Comment: Govt delivering on  Mbare market promises",
            "url": "https://www.herald.co.zw/editorial-comment-govt-delivering-on-mbare-market-promises/",
            "content": "WHEN the Mbare Musika traders market went up in flames in October last year, thousands were devastated, having lost both their meagre stocks and the stalls where they could legally do business.\n\nThe Government stepped in promptly, President Mnangagwa declaring a state of disaster which immediately allowed central Government to intervene despite the market being in a municipal area. The thrust of the intervention was not just to help the stallholders get back into business, but to take advantage of the fire and build something a lot better, a proper modern market complex.\n\nIt quickly became obvious that the site, the customer demand and the number of potential traders would allow a centrepiece three-storey market. Meanwhile, the existing stallholders needed somewhere to trade, and a subsidiary site round the corner was allocated for a temporary market.\n\nA proper structure was quickly planned and built, and will be officially opened this week by President Mnangagwa. Although described as a temporary market, it is a proper permanent structure and while able to accommodate several thousand traders, is smaller than the eventual permanent main market structure. The main advantage of this structure is that it could be built a lot quicker than the main market.\n\nThe President will, at the official opening, be delivering on his promises, not only with a decent market already built but also with the ground breaking ceremony for the far grander main market.\n\nBut the traders will already have somewhere suitable, safe and respectable to trade from, and it will be important to keep the market that way. There is an ideal opportunity to work out the organisation and what is needed to maintain a proper market structure, and here those responsible for administering the structure and those holding the stalls need to work together.\n\nThere are certain past problems that need never to recur. For a start, any attempt by criminals in the guise of space barons need to be barred, along with any attempt at sub-letting. Whoever is administering the market needs to be hair-shirted honest, and totally immune to corrupt activity and ready to prevent any emergence of such activity.\n\nPrivate sector markets tend to flourish, but Harare City Council has a poor record. It will be essential, however, that the final administration is worked out, and Government maintains at least a strong watching brief to prevent any sign of dishonesty.\n\nTo keep costs down and stall fees low, stallholders will need to maintain the cleanliness of the market, each making sure their own stall is immaculate while co-operating on aisles and common areas. When you start off with something brand new, the standard is easy to set.\n\nBesides offering a proper market space, this temporary market also offers the opportunity to work out and adjust all the administration and co-operation requirements of the far larger main market that will now be built, and will have space for new people who perhaps do not know each other nearly so well as those who were together before the fire.\n\nAs newcomers are granted stalls, it should be possible to make it explicitly clear just how things work and just how everyone needs to behave.\n\nIt will probably be useful to look at a proper licensing regime for the very small businesses that need a market building. Licensing would be useful in conjunction with the stall allocation records, but cannot and must not be pricey. A very simple and cheap licence, something like the old municipal hawkers licence perhaps but with a monthly fee, would move the stallholders into the ranks of the formal sector, albeit on the bottom rung of that ladder.\n\nWhile most of the businesses at the market will be too small to attract tax, Zimra could still take a look at the larger concerns. In any case since registering for tax is free, or should be free, perhaps it would be a good idea to get the stallholders to start registering, even if their assessed taxes are zero or close to zero. The point is to start the formalisation process so that as tiny businesses grow into small businesses, they are already in the system.\n\nMeanwhile, as the new three-storey complex is being built, thought needs to be given to the future use of the complex the President opens on Friday. It might be described as a temporary market, but it is a good-quality permanent structure.\n\nThere are many possibilities, some linked with the general upgrade of Mbare now starting. As tourism increases and Zimbabweans become prouder of their own cultures and traditions, there would seem to be need for a decent central arts and craftwork market, and as the ordinary traders move out into their own large complex, there would be something really suitable already built.\n\nBut, however Mbare market space continues to be developed, the Government has delivered on its promises to build something modern and upmarket, and is supporting a better future for thousands of people in Mbare.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/New-Mbare-Musika-680x380.jpg",
            "description": "WHEN the Mbare Musika traders market went up in flames in October last year, thousands were devastated, having lost both their meagre stocks and the stalls where they could legally do business. The Government stepped in promptly, President Mnangagwa declaring a state of disaster which immediately allowed central Government to intervene despite the market being […]",
            "time": "06:41",
            "date": "09 Apr 2025"
        }
    ]
}