{
    "news": [
        {
            "title": "Ramaphosa appoints Gwede Mantashe as acting police minister",
            "url": "https://www.newzimbabwe.com/ramaphosa-appoints-gwede-mantashe-as-acting-police-minister/",
            "content": "In a decisive move to address escalating concerns within South Africas police ministry, President Cyril Ramaphosa has appointed Mineral and Petroleum Resources Minister Gwede Mantashe as the acting Minister of Police, effective immediately as of Tuesday evening,Cape {town} Etcreports.\n\nThis temporary appointment comes as allegations of misconduct and malfeasance involving high-ranking officials cast a shadow over the law enforcement agency.\n\nMantashes role will be short-lived as he is slated to hold the position until Professor Firoz Cachalia steps into the role at the beginning of August.\n\nCachalia, who has spent most of his career in academia, is poised to take the reins following his retirement from the University of the Witwatersrand at the end of this month.\n\nHis appointment was previously announced by Ramaphosa during a televised address on Sunday.\n\nThe political landscape is particularly volatile at present, with serious allegations surfacing against former Police Minister Senzo Mchunu. In a stark revelation, KwaZulu-Natal Provincial Police Commissioner, Lieutenant General Nhlanhla Mkhwanazi, claimed a powerful criminal syndicate has infiltrated South Africas law enforcement and judicial systems.\n\nMkhwanazi went one step further, accusing Mchunu of meddling in sensitive cases and colluding with a businessman accused of murder, aiming to dismantle the task force investigating a spate of political killings in KwaZulu-Natal.\n\nIn light of these explosive allegations, President Ramaphosa has taken decisive action, placing Mchunu on special leave while also initiating a judicial commission of inquiry to be led by Acting Deputy Chief Justice Mbuyiseli Madlanga.\n\nThe commission is tasked with investigating claims of interference in investigations, complicity among government officials, and the suppression of crucial law enforcement activities.\n\nMchunu, embroiled in controversy over the past week, has been accused by Mkhwanazi of being entwined with drug cartels and influential business concerns.\n\nAmong the allegations presented was an assertion that Lieutenant-General Shadrack Sibiya, deputy national commissioner for crime detection, colluded with Mchunu and a known information dealer, Brown Mogotsi, in a plot to disband the KwaZulu-Natal political killings task team.\n\nPolice Commissioner Masemola announced that Sibiya would also be requesting a leave of absence while investigations unfold, indicating a stern approach to restoring integrity within the police service.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/03003040/Gwede-Mantashe.png",
            "description": "<p>Cape ETC In a decisive move to address escalating concerns within South Africa’s police ministry, President Cyril Ramaphosa has appointed Mineral and Petroleum Resources Minister Gwede Mantashe as the acting Minister of Police, effective immediately as of Tuesday evening, Cape {town} Etc reports. This temporary appointment comes as allegations of misconduct and malfeasance involving high-ranking officials cast</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ramaphosa-appoints-gwede-mantashe-as-acting-police-minister/\">Ramaphosa appoints Gwede Mantashe as acting police minister</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:49",
            "date": "16 Jul 2025"
        },
        {
            "title": "ZAA invites global diaspora to annual gathering in Harare",
            "url": "https://www.newzimbabwe.com/zaa-invites-global-diaspora-to-annual-gathering-in-harare/",
            "content": "The Zimbabwe Achievers Awards (ZAA) proudly announces its flagship ZAA Global Diaspora Forum & Awards Gala, set to take place from 2930 August 2025 at the prestigious Hyatt Regency Hotel in Harare.\n\nThis highly anticipated event, organised by the Destiny Media Group, will bring together Zimbabweans from across the world for two days of connection, collaboration, celebration, and impact.\n\nNow in its milestone edition, the ZAA Global Diaspora Gathering serves as a bridge between Zimbabwes thriving diaspora and the motherland. With representation from Canada, the UK, USA, Australia, South Africa, UAE and beyond, the gathering is a vibrant homecoming and a rallying call to build the Zimbabwean dreamtogether.\n\nWhy the Diaspora Should Attend\n\nFor many, this is more than an eventit is a return to ones roots. The Harare gathering offers a moment to reconnect with home, reignite your Zimbabwean identity, and be part of the national conversation.\n\nThe ZAA Global Awards Gala will honour outstanding Zimbabweans from around the world who are making remarkable strides in business, arts, philanthropy, innovation, and leadership. Its a night of glamour, pride, and powerful inspiration.\n\nFounder Conrad Mwanza will officially launch his new book, The Zimbabwean Dream, capturing the vision of a united, prosperous, and globally connected Zimbabwe. The book is a call to action for the diaspora to shape the countrys future.\n\nThe forum on Day 1 will feature engaging panels, investment showcases, and policy discussions, bringing together thought leaders, entrepreneurs, government representatives, and development partners to explore diaspora-led development.\n\nWhether youre looking to invest back home, build new partnerships, or simply connect with like-minded Zimbabweans, the ZAA Diaspora Gathering offers unmatched networking opportunities.\n\nHarare, the heartbeat of the nation, will serve as the backdrop for this iconic eventreminding us all that no matter where we are in the world, home is where the heart is.\n\nFor media inquiries, partnerships, or to confirm attendance, please contactinfo@zimachievers.orgor visit www.zimachievers.org.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/09/28130223/Conrad-Mwanza.png",
            "description": "<p>The Zimbabwe Achievers Awards (ZAA) proudly announces its flagship ZAA Global Diaspora Forum & Awards Gala, set to take place from 29–30 August 2025 at the prestigious Hyatt Regency Hotel in Harare. This highly anticipated event, organised by the Destiny Media Group, will bring together Zimbabweans from across the world for two days of connection,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zaa-invites-global-diaspora-to-annual-gathering-in-harare/\">ZAA invites global diaspora to annual gathering in Harare</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:49",
            "date": "16 Jul 2025"
        },
        {
            "title": "Zim referee Brighton Chimene to officiate at CHAN",
            "url": "https://www.newzimbabwe.com/zim-referee-brighton-chimene-to-officiate-at-chan/",
            "content": "By Sports Reporter\n\nZimbabwe top referee, Brighton Chimene, has been selected as one of the match officials at the 2024 CHAN tournament, scheduled to be played next month.\n\nThe tournament will be co-hosted by Kenya, Tanzania and Uganda and will run from the 2nd to the 30th of August.\n\nChimene is one of the 75 selected referees to serve at the tournament.\n\nCHAN call-up marks Chimenes second major tournament this year, the first one being the AFCON boys under 17 three months ago.\n\nAged 35, Chimene was elevated to be an Elite B class on the FIFA panel early this year, making himself eligible for major CAF tournaments.\n\nThe four-time Zimbabwe Premier Soccer League Referee of the Year is now one level lower to officiate at the FIFA World Cup.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/16052432/Brighton-Chimenes.jpg",
            "description": "<p>By Sports Reporter Zimbabwe top referee, Brighton Chimene, has been selected as one of the match officials at the 2024 CHAN tournament, scheduled to be played next month. The tournament will be co-hosted by Kenya, Tanzania and Uganda and will run from the 2nd to the 30th of August. Chimene is one of the 75</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zim-referee-brighton-chimene-to-officiate-at-chan/\">Zim referee Brighton Chimene to officiate at CHAN</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:49",
            "date": "16 Jul 2025"
        },
        {
            "title": "Zimbabwe ranks among the world’s 10 most difficult places to live",
            "url": "https://www.newzimbabwe.com/zimbabwe-ranks-among-the-worlds-10-most-difficult-places-to-live/",
            "content": "Business Insider Africa\n\nZimbabwe and Nigeria have been ranked among the worlds 10 most difficult places to live, according to a new global livability index that highlights the harsh realities of urban life in some of the worlds most challenged cities.\n\nThe annual report, compiled by the Economist Intelligence Unit (EIU), measures cities based on stability, healthcare, education, infrastructure, and environment, key indicators that affectoverall quality of life.\n\nThe Global Livability Index evaluates cities based on over 30 indicators across five core categories: stability, healthcare, culture and environment, education, and infrastructure. Stability measures crime levels, civil unrest, and the threat of conflict.\n\nHealthcare assesses the quality and availability of public and private services. Culture and environment consider factors like climate, recreational options, and personal freedoms.\n\nEducation is judged by access to quality public and private schooling, while infrastructure focuses on roads, transport, housing, and global connectivity. These combined metrics provide a snapshot of how liveable a city is for its residents.\n\nMost African nations are grappling with persistent economic pressures, insecurity, and strained public services.\n\nIn many of these cities, ongoing political unrest, insecurity, limited access to quality healthcare, and under-resourced education systems contribute topoor livability scores.\n\nIn Nigeria, cities like Lagos and Port Harcourt continue to suffer from overcrowding, inadequate healthcare systems, and rising crime rates, while Zimbabwes capital, Harare, remains burdened by hyperinflation, aging infrastructure, and limited access to essential services.\n\nAlgeria and Libya have also been named among the worldsmost difficult placesto live, joining Nigeria and Zimbabwe in a ranking that highlights the pressures facing several African cities.\n\nFor example, Tripoli in Libya continues to struggle with the effects of prolonged conflict and weakened institutions, while Algiers faces structural economic challenges and restrictions on civil liberties.\n\nThese issues are compounded byinadequate infrastructureand housing conditions that fall short of global standards.\n\nThe table below presents the ten most challenging cities to live in globally.\n\nCities at the bottom of the liveability rankings are predominantly located in the Middle East and Africa, reflecting persistent instability, limited infrastructure, and constrained access to quality services.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/09/17050648/harare.webp",
            "description": "<p>Business Insider Africa Zimbabwe and Nigeria have been ranked among the world’s 10 most difficult places to live, according to a new global livability index that highlights the harsh realities of urban life in some of the world’s most challenged cities. Zimbabwe and Nigeria rank among the world’s most difficult places to live, according to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-ranks-among-the-worlds-10-most-difficult-places-to-live/\">Zimbabwe ranks among the world’s 10 most difficult places to live</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:49",
            "date": "16 Jul 2025"
        },
        {
            "title": "1.5 million people are homeless in Zimbabwe – report reveals, as ZimRights calls for repeal of Vagrancy Act",
            "url": "https://www.newzimbabwe.com/1-5-million-people-are-homeless-in-zimbabwe-report-reveals-as-zimrights-calls-for-repeal-of-vagrancy-act/",
            "content": "By Thandiwe Garusa\n\nTHE Zimbabwe Human Rights Association (ZimRights) has renewed calls for the repeal of the colonial era Vagrancy Act, which criminalises homelessness.\n\nThe Vagrancy Act (Chapter 10:25), criminalises homelessness and disproportionately affects marginalised communities as it gives power to the police to arrest and charge homeless people.\n\nThe law also criminalises any person who assists people living on the streets.\n\nSpeaking at the launch of their 2024 Annual Report, Dzikamai Bere, National Director for ZimRights, said an estimated over a million Zimbabweans do not have homes, adding that nine people previously died in police custody after they were arrested using that law.\n\nDzikamai Bere\n\nWe have a vagrancy act, a colonial piece of legislation that makes it a criminal offence for you to not have a place to stay and if the police find you on the road, they can arrest and charge you under the Act and about US$1.5 million people are affected by that law.\n\nAt one point, about nine people died in police custody after they had been arrested as vagrants.\n\nWe have sent a petition to parliament and we are in the process of engaging with the parliament so that the law may be removed, Bere said.\n\nZimRights last year launched a campaign to repeal the Vagrancy Act and later petitioned parliament.\n\nThe campaign was driven by concerns from communities in Chitungwiza and Harare,where growing numbers of homeless individuals were increasinglytargetedbyauthorities rather than receiving support.\n\nZimRights National Chairman Takesure Musiiwa also added that laws like these are outdated policies introduced by former colonial governments to serve their own interests and no longer benefit citizens.\n\nThese are policies which were imposed on us by previous regimes, (the whites) they brought their own issues for their own reasons and as an organisation we are engaging with the government to say can we have a look at this policy, it is not helping our citizens, so how best can we try to change it maybe replace it with a better law which will protect our citizens, Musiiwa said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/19125926/Screenshot-2024-11-19-at-14.59.12.png",
            "description": "<p>By Thandiwe Garusa THE Zimbabwe Human Rights Association (ZimRights) has renewed calls for the repeal of the colonial era Vagrancy Act, which criminalises homelessness. The Vagrancy Act (Chapter 10:25), criminalises homelessness and disproportionately affects marginalised communities as it gives power to the police to arrest and charge homeless people. The law also criminalises any person</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/1-5-million-people-are-homeless-in-zimbabwe-report-reveals-as-zimrights-calls-for-repeal-of-vagrancy-act/\">1.5 million people are homeless in Zimbabwe – report reveals, as ZimRights calls for repeal of Vagrancy Act</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:49",
            "date": "16 Jul 2025"
        }
    ]
}