{
    "news": [
        {
            "title": "Los Angeles celebrities lose homes, share reactions to wildfires",
            "url": "https://www.newzimbabwe.com/los-angeles-celebrities-lose-homes-share-reactions-to-wildfires/",
            "content": "By BBC\n\nJEFF Bridges and Mel Gibson are among the celebrities who have lost homes in the deadly wildfires raging in the Los Angeles area.\n\nUS actor Bridges, who won an Oscar for Crazy Heart and stars in the TV series The Old Man, has lost his home in Malibu which he and his siblings inherited from their parents.\n\nOscar-winning film star Mel Gibson also revealed his Malibu home has been completely toasted while he was away recording Joe Rogans podcast.\n\nA series of major wind-driven fires in California have killed 11 people, ravaged communities, and sent thousands of people frantically fleeing their properties, including areas dotted with celebrity homes.\n\nThousands of structures have been destroyed as six separate blazes burn in and around the city, which is dotted with film stars mansions.\n\nWhich other celebrities have lost their homes?\n\nVentimiglia, best known for his roles in Gilmore Girls and Heroes, was filmed returning to his burnt-out home.\n\nYou start thinking about all the memories in the different parts of the house and whatnot, said Ventimiglia on CBS Evening News.\n\nThen you see your neighbours houses and everything around, and your heart just breaks.\n\nVentimiglia and his wife left their home on Tuesday and watched on security cameras as the flames took over.\n\nThe 47-year-old acknowledged that his character, Jack Pearson, in TV series This Is Us suffers from smoke inhalation after his home burns down in the hit series. Its not lost on me, life imitating art, he said.\n\nHotel heiress Hilton confirmed earlier this week she had lost her home in Malibu.\n\nIn a new Instagram post on Friday, Hilton uploaded a video of what was left of her home. The heartbreak is truly indescribable, she said. Its devastating beyond words.\n\nThis isnt just my story, she continued. So many people have lost everything. Its not just walls and roofs  its the memories that made those houses homes. Its the photos, the keepsakes, the irreplaceable pieces of our lives\n\nAnd yet, in this pain, I know Im incredibly lucky. My loved ones, my babies, and my pets are safe.\n\nHilton also thanked the fire fighters, first responders and volunteers risking their lives to fight these fires.\n\nRosie ODonnell, a former co-host for The View, also lost her home in Malibu.\n\nOn PCH (Pacific Coast Highway) in Malibu  the whole of beach front homes gone  including the one i lived in, she wrote in a post on TikTok.\n\nSome of the worst devastation was in the scenic enclave of Pacific Palisades, where a wind-whipped inferno exploded from several hundred acres to more than 15,000 in size since Tuesday.\n\nA swathe of the neighbourhood, which is a haven of hillside streets nestled against the Santa Monica Mountains and winding down to beaches along the Pacific Ocean, was reduced to ash.\n\nActor James Woods, who starred in films including Nixon and Casino, broke down in tears on CNN as he described losing his Pacific Palisades property.\n\nOne day youre swimming in the pool and the next day its all gone, he told the network.\n\nActor Billy Crystal said in a statement that he and his wife Janice were heartbroken by the loss of their Pacific Palisades home where they had lived since 1979.\n\nThe When Harry Met Sally star said in a statement: We raised our children and grandchildren here.\n\nEvery inch of our house was filled with love. Beautiful memories that cant be taken away.\n\nWe are heartbroken of course but with the love of our children and friends we will get through this.\n\nA home reportedly belonging to Adam Brody, who stars in hit Netflix show Nobody Wants This, and Gossip Girl star wife Leighton Meester, was also destroyed.\n\nJurassic World actress Daniella Pineda also lost her home, saying she escaped as the fire took over with only her dog and laptop.\n\nI have one pair of shoes to my name, she said.\n\nIm grateful to be alive. People really show up for one another when disaster hits.\n\nThe Hills stars Spencer Pratt and Heidi Montag, who are married, also lost their home in the blaze.\n\nIm watching our house burn down on the security cameras, Pratt posted.\n\nMontag said: So our house is on fire, and we were able to get out in time, but I keep going over and over in my mind of the things I shouldve got, but were out safe and that is the most important thing, and Spencer is behind me.\n\nIn a later post, she said while tearing up that she was so sad our house has gone and they had lost everything we worked so hard for.\n\nSinger and This Is Us actress Mandy Moore posted a video of the scene of destruction as she evacuated.\n\nGrateful for my family and pets getting out last night before it was too late (and endless gratitude to friends for taking us in and bringing us clothes and blankets).\n\nHonestly, Im in shock and feeling numb for all so many have lost, including my family. My childrens school is gone.\n\nOur favourite restaurants, levelled. So many friends and loved ones have lost everything too. Our community is broken but we will be here to rebuild together.\n\nTV host Ricki Lake told followers she had lost her dream home, adding: I grieve along with all of those suffering during this apocalyptic event.\n\nActors Sir Anthony Hopkins, John Goodman, Anna Faris and Cary Elwes also reportedly lost their homes.\n\nMiles Teller, best known for his role in Top Gun: Maverick, and his wife, Keleigh Sperry, reportedly lost their home in the Pacific Palisades.\n\nPosting on Instagram, Sperry shared a picture of the fires and a broken heart emoji.\n\nShe urged people to leave bowls of water for animals left behind as they evacuate their homes.\n\nOther stars forced to flee include Star Wars actor Mark Hamill and Schitts Creek actor Eugene Levy.\n\nIn a post on Instagram, Hamill called the blaze the most horrific since 1993, when 18,000 acres burned, destroying 323 homes in Malibu.\n\nHe said he had evacuated his Malibu house so last-minute there [were] small fires on both sides of the road.\n\nEugene Levy described black smoke appearing on the horizon before he evacuated.\n\nLevy described to local media black and intense smoke over Temescal Canyon.\n\nI couldnt see any flames but the smoke was very dark, he told the Los Angeles Times.\n\nJamie Lee Curtis said her home was safe but the situation was gnarly.\n\nObviously, there have been horrific fires in many places, she said. This is literally where I live. Everything the market, I shop in, the schools my kids go to. Friends  many, many, many friends  now have lost their homes.\n\nCurtis and her husband, fellow actor Christopher Guest, pledged $1m (800,000) to start a fund of support for our great city and state and the great people who live and love there.\n\nActor Cameron Mathison also shared a clip of his house reduced to smouldering ruins. We are safe. But this is whats left of our beautiful home, the General Hospital star wrote.\n\nOur home where our kids were raised and where they wanted to raise their own someday.\n\nTwo maps that show the scale of the area burnt by the Paliside wildfire by imposing the area in red on top of the centres of New York and London.\n\nLegendary songwriter Diane Warren, who composed classic hits including If I Could Turn Back Time and I Dont Want to Miss a Thing, also lost her home.\n\nShe posted a picture of the beachfront near her house, saying that the property shes had for close to three decades was gone.\n\nGrammy-nominated R&B singer and rapper Jhen Aiko took to Instagram to share that her home was burned to the ground.\n\nStarting from scratch. My heart is so heavy, she wrote with a broken heart emoji.\n\nActor Steve Guttenberg, known for Police Academy, stayed to help firefighters by moving cars to clear a path for incoming fire trucks.\n\nHe urged fellow Pacific Palisades residents to leave the keys in their abandoned cars so they could be moved.\n\nMeanwhile, the Palisades Charter High School  used in the 1976 horror classic Carrie  has been devastated.\n\nThe Oscar nominations have been postponed by two days because of the fires, and other star-studded events were also cancelled.\n\nFilm premieres for Unstoppable, Better Man and Wolfman have been called off, as has the Screen Actors Guild Awards nominations announcement.\n\nMeanwhile, a new blaze broke out on Wednesday night, the Sunset fire, in the Hollywood Hills, near where the world-famous Hollywood sign nestles in the hillside.\n\nSeveral other celebrities fled the city to escape the fires.\n\nSinger songwriter Dua Lipa revealed in a post on her Instagram stories that she fled the city and is safe.\n\nShe described the scene as absolutely devastating and scary couple of days in LA\n\nThinking of all my friends and the people of the city who had to evacuate their homes, she wrote.\n\nTake That singer, Mark Owen and his family also fled from the fires. His wife Emma Ferguson said the couple and their children and pets had to evacuate after waking up to helicopters, thick black smoke, winds howling, and that the uncertainty that our house would survive.\n\nIm not sure what our next step is. Right now, Im just heavy and tired, she said.\n\nRicki Lake had a home on the bluffs in the Palisades, where she was married three years ago and where she said she planned to grow old.\n\nOther celebrities who have lost their homes, according to reports and social media, include:John C Reilly, Cobie Smulders, John Goldman, Tina Knowles, Anthony Hopkins, Rikki Lake, Anna Faris, Jennifer Grey, Denise Crosby, Melissa Rivers, Cary Elwes, Carolyn Murphy and Sandra Lee.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/11041428/MV5BMTQwNTM0NDAwMF5BMl5BanBnXkFtZTcwNjcyMTAzNQ%40%40._V1_.jpg",
            "description": "<p>By BBC  JEFF Bridges and Mel Gibson are among the celebrities who have lost homes in the deadly wildfires raging in the Los Angeles area. US actor Bridges, who won an Oscar for Crazy Heart and stars in the TV series The Old Man, has lost his home in Malibu which he and his siblings</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/los-angeles-celebrities-lose-homes-share-reactions-to-wildfires/\">Los Angeles celebrities lose homes, share reactions to wildfires</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "11 Jan 2025"
        },
        {
            "title": "Bride’s fury after Instagram stunt wedding turns out to be real",
            "url": "https://www.newzimbabwe.com/brides-fury-after-instagram-stunt-wedding-turns-out-to-be-real/",
            "content": "By BBC\n\nA WOMAN in Australia has annulled her marriage after realising that a fake wedding ceremony she took part in for a social media stunt was in fact real.\n\nThe unknowing bride said her partner was a social media influencer who convinced her to take part in the ceremony as a prank for his Instagram account.\n\nShe only discovered the marriage was genuine when he tried to use it to gain permanent residency in Australia.\n\nA Melbourne judge granted the annulment after accepting the woman was tricked into getting married, in a judgement published on Thursday.\n\nThe bizarre case began in September 2023 when the woman met her partner on an online dating platform. They began seeing each other regularly in Melbourne, where they lived at the time.\n\nIn December that year, the man proposed to the woman and she accepted.\n\nTwo days later, the woman attended an event with the man in Sydney. She was told it would be a white party  where attendees would wear white-coloured clothing  and was told to pack a white dress.\n\nBut when they arrived, she was shocked and furious to find no other guests present except for her partner, a photographer, the photographers friend and a celebrant, according to her deposition quoted in court documents.\n\nSo, when I got there, and I didnt see anybody in white, I asked him, Whats happening?.\n\nAnd he pulled me aside, and he told me that hes organising a prank wedding for his social media, to be precise, Instagram, because he wants to boost his content, and wants to start monetising his Instagram page, she said.\n\nShe said she had accepted his explanation as he was a social media person who had more than 17,000 followers on Instagram. She also believed that a civil marriage would be valid only if it were held in a court.\n\nStill, she remained concerned. The woman rang a friend and voiced her worries, but the friend laughed it off and said it would be fine because, if it were real, they would have had to file a notice of intended marriage first, which they had not.\n\nReassured, the woman went through the ceremony where she and her partner exchanged wedding vows and kissed in front of a camera. She said she was happy at that time to play along to make it look real.\n\nTwo months later, her partner asked her to add him as a dependant in her application for permanent residency in Australia. Both of them are foreigners.\n\nWhen she told him she could not as they were technically not married, he then revealed that their Sydney wedding ceremony had been genuine, according to the womans testimony.\n\nThe woman later found their marriage certificate, and discovered a notice of intended marriage which had been filed the month before their Sydney trip  before they even got engaged  which she said she did not sign. According to the court documents, the signature on the notice bears little resemblance to the womans.\n\nIm furious with the fact that I didnt know that that was a real marriage, and the fact that he also lied from the beginning, and the fact that he also wanted me to add him in my application, she said.\n\nIn his deposition, the man claimed they had both agreed to these circumstances and that following his proposal the woman had agreed to marry him at an intimate ceremony in Sydney.\n\nThe judge ruled that the woman was mistaken about the nature of the ceremony performed and did not provide real consent to her participation in the marriage.\n\nShe believed she was acting. She called the event a prank. It made perfect sense for her to adopt the persona of a bride in all things at the impugned ceremony so as to enhance the credibility of the video depicting a legally valid marriage, he stated in the judgement.\n\nThe marriage was annulled October of 2024.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/05001007/Marriage.png",
            "description": "<p>By BBC  A WOMAN in Australia has annulled her marriage after realising that a fake wedding ceremony she took part in for a social media stunt was in fact real. The unknowing bride said her partner was a social media influencer who convinced her to take part in the ceremony as a “prank” for his</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/brides-fury-after-instagram-stunt-wedding-turns-out-to-be-real/\">Bride’s fury after Instagram stunt wedding turns out to be real</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "11 Jan 2025"
        },
        {
            "title": "Installation of bucket seats at National Sports Stadium almost complete",
            "url": "https://www.newzimbabwe.com/installation-of-bucket-seats-at-national-sports-stadium-almost-complete/",
            "content": "By Sport Reporter\n\nGOVERNMENT says it is now finalising the installation of bucket seats at the National Sports Stadium (NSS) to ensure the giant facility gets certified to host international games.\n\nThis was revealed by Acting President Kembo Mohadi during a media address on Friday at his Munhumutapa office.\n\nWe are having our home games played elsewhere. But what l can tell you is that we are now finalising the installation system of the bucket seats at the National Sports Stadium, said Mohadi.\n\nThe NSS was closed in 2023 for renovations after failing to meet Confederation of African Football (CAF) standards to host international matches due to lack of amenities, among other concerns.\n\nThis has forced the Warriors and all Zimbabwean clubs which participated in any CAF competition last year to host fixtures in foreign countries.\n\nBucket seats installation was amongst the top list of things required by CAF at the giant facility.\n\nOther than that, CAF also required the fitting of electronic turnstiles at the stadium, an uplift in the changing and medical area room.\n\nMohadi also added that government has embarked on a journey to renovate other dilapidated sporting facilities across the country.\n\nWe are also working on modernising other sporting facilities such as Magamba and others which are under the Ministry of Sport, he added.\n\nA report presented by the Minister of Sport, Recreation, Arts and Culture in 2024 before Parliament revealed that 90% of the countrys sporting facilities are nolonger fit for use and are in need of urgent facelifts.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/05/04150859/A-an-ariel-view-of-the-National-Sports-Stadiums-turf-scaled.jpg",
            "description": "<p>By Sport Reporter GOVERNMENT says it is now finalising the installation of bucket seats at the National Sports Stadium (NSS) to ensure the giant facility gets certified to host international games. This was revealed by Acting President Kembo Mohadi during a media address on Friday at his Munhumutapa office. “We are having our home games</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/installation-of-bucket-seats-at-national-sports-stadium-almost-complete/\">Installation of bucket seats at National Sports Stadium almost complete </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "11 Jan 2025"
        },
        {
            "title": "Boy (8) receiving trauma therapy after straying into wildlife-infested jungle where he spent five harrowing days",
            "url": "https://www.newzimbabwe.com/boy-8-receiving-trauma-therapy-after-straying-into-wildlife-infested-jungle-where-he-spent-five-harrowing-days/",
            "content": "By Staff Reporter\n\nHEROIC Tinotenda Pudu, the brave eight-year-old boy who strayed into wildlife-infested Matusadonha Game Park and spent five days wandering, is suffering trauma and needs specialist therapy.\n\nTinotenda, who wandered 49km in the game park, survived on eating wild berries known in vernacular as tsvanzva.\n\nAccording to Mashonaland West Proportional Representation MP Mutsa Murombedzi, posting on social media,Tinotenda and his mother will be temporarily moved away from their home, and be assessed by a mental health support team.\n\nToday, 08 Jan 2025, the Mashonaland West Provincial Medical Director called me with an update and had a discussion regarding Tinotendas situation.\n\nThe mental health team has visited the boy down in the Zambezi Valley and begun their assessments. It has become clear that his disappearance and harrowing ordeal and encounter with big game animals in Matusadonha Game Park, deep in the Zambezi Valley, has deeply affected not only him but also his family.\n\nAs part of their recommendations, the team has decided to temporarily move Tinotenda and his mother away from their home for a few days to provide them with a safer and calmer environment to prevent people from disturbing the recovery process, said the legislator.\n\nThe assessment team, she noted, will remain in the community for several days and also engage with school officials to prevent any discussions that could re-trigger trauma.\n\nAdditionally, the mental health team will return and be stationed in the community for not less than seven days to continue providing support and monitoring the boys and family progress.\n\nWith schools reopening soon, they will also engage the school authorities to ensure that when Tinotenda comes back to school, no interviews or discussions take place that might retraumatize him, said Murombedzi.\n\nThe mental health team still strongly advise against anyone conducting interviews at this stage as it may trigger emotional distress for the learner who is now proceeding to Grade Three.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/02163507/e3fc1860-c90a-11ef-b64d-9d290e039e0a.jpg.webp",
            "description": "<p>By Staff Reporter  HEROIC Tinotenda Pudu, the brave eight-year-old boy who strayed into wildlife-infested Matusadonha Game Park and spent five days wandering, is suffering trauma and needs specialist therapy. Tinotenda, who wandered 49km in the game park, survived on eating wild berries known in vernacular as ‘tsvanzva.’ According to Mashonaland West Proportional Representation MP Mutsa</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/boy-8-receiving-trauma-therapy-after-straying-into-wildlife-infested-jungle-where-he-spent-five-harrowing-days/\">Boy (8) receiving trauma therapy after straying into wildlife-infested jungle where he spent five harrowing days</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "11 Jan 2025"
        },
        {
            "title": "General manager suspended over suspected US$300,000 theft and fraud",
            "url": "https://www.newzimbabwe.com/general-manager-suspended-over-suspected-us300000-theft-and-fraud/",
            "content": "By Tapiwa Svondo\n\nBOTHA Mine general manager, Angela Mpofu-Chisvo has been suspended over allegations of theft and fraud that reportedly involve over US$300,000.\n\nIn a statement this week, mine authorities said Mpofu-Chisvo is alleged to have concealed transactions from the company.\n\nBotha Mine wishes to inform all stakeholders that Angela Mpofu-Chisvo is suspended from duty without pay or benefits from Botha Mine effective from the 6th of January 2025.\n\nShe is currently facing serious criminal allegations of theft and fraud involving more than $300 000.00 United States Dollars and charges related to concealing a transaction from the principal.\n\nInvestigations are underway under Bindura RRB 5874696, reads the statement\n\nThe company has taken precautionary measures, barring accused person from entering the mine and any of its premises while investigations are ongoing.\n\nBotha Mine warned that individuals, who engage with Mpofu in monetary transactions will be held liable.\n\nWe would like to emphasise that any individual or entity engaging in transactions with her will be held liable for any repercussions arising from such dealings.\n\nThe Bindura community to be specific is, therefore, warned from engaging in any monetary or any other transactions with Mrs. Mpofu on behalf of Botha Mine, reads the statement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/05/30184728/Fraud.jpg",
            "description": "<p>By Tapiwa Svondo  BOTHA Mine general manager, Angela Mpofu-Chisvo has been suspended over allegations of theft and fraud that reportedly involve over US$300,000. In a statement this week, mine authorities said Mpofu-Chisvo is alleged to have concealed transactions from the company. “Botha Mine wishes to inform all stakeholders that Angela Mpofu-Chisvo is suspended from duty</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/general-manager-suspended-over-suspected-us300000-theft-and-fraud/\">General manager suspended over suspected US$300,000 theft and fraud</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "11 Jan 2025"
        },
        {
            "title": "Mnangagwa grabs gold-rich mine a month after cronies raise false alarm of shaft collapse",
            "url": "https://www.newzimbabwe.com/mnangagwa-grabs-gold-rich-mine-a-month-after-cronies-raise-false-alarm-of-shaft-collapse/",
            "content": "By Leopold Munhende recently in Gwanda\n\nZANU PF officials led by one Dambudzo Mnangagwa, who claims to represent the First Family, are reportedly targeting the illegal takeover of gold-rich Vubachikwe Mine in Gwanda, Matabeleland South province.\n\nThe property, owned by Australian entity Duration Gold Limited, has been at the receiving end of numerous attacks by a group linked to Mnangagwa and a local Zanu PF shadow Member of Parliament (MP) Limukani Ncube, popularly known as Two Minutes.\n\nMnangagwa in company of individuals associated with Ncube this week besieged the mine with heavy earth moving equipment and proceeded to extract gold ores within Vubachikwes claim.\n\nDriving around in Zanu PF party branded vehicles, Mnangagwa threatened police officers if they dared interfere forcing them to stand akimbo and watch haplessly.\n\nNcube, on the other hand, is reported to have threatened takeover of the mine and hand it over to Zanu PF youths as part of a purported empowerment drive.\n\nTo demonstrate the chaos surrounding Vubachikwe Mine, in November last year, Ncube sent government officials who included the Zimbabwe Republic Police (ZRP) and the Ministry of Mines on a two-week long wild goose chase after sharing false information that a section of the mine had collapsed killing over 30 miners.\n\nBoth the Provincial Mining Directorate and police told NewZimbabwe.com that the search that later ensued had not found any dead bodies or signs of the reported collapse.\n\nWe have yet to hear of anyone missing. We conducted a search and rescue operation with the police and the mines sub-aqua unit but failed to find anyone after the report, it was a wild goose chase, said provincial mining director, Tariro Ndlovu.\n\nThese kinds of false alarms are criminal in that they do not just waste public resources but affect business as a lot would have been invested by those in charge of such businesses.\n\nIn the process of searching for the reported dead miners, police instead arrested 29 illegal gold panners who were operating about 400 metres below the surface.\n\nWe can confirm the arrest of 29 illegal gold panners during the search operation that was undertaken after news of a collapse at the mine was received, said the polices Gwanda District head one Ndlovu, before referring all questions to the public relations office.\n\nThe case is being handled under RRB number CR15/12/24 (DR28/12/24).\n\nIn a conversation with NewZimbabwe.com Councillor Simbarashe Lisimati also confirmed that neither an indication of a collapse nor victims had been found after the claim.\n\nVubachikwe Mine has since threatened legal action against Ncube who did not respond to requests for a comment on the matter.\n\nThis was an elaborate hoax, and this was being pushed by people who are supposed to be respectable people within our community.\n\nWhat saddened us was why eminent members of the community would spread such fake news, said Vubachikwe Mine spokesperson, Robert Mukondiwa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/11030836/Vubachikwe-Mine-2.png",
            "description": "<p>By Leopold Munhende recently in Gwanda ZANU PF officials led by one Dambudzo Mnangagwa, who claims to represent the First Family, are reportedly targeting the illegal takeover of gold-rich Vubachikwe Mine in Gwanda, Matabeleland South province. The property, owned by Australian entity Duration Gold Limited, has been at the receiving end of numerous attacks by</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-grabs-gold-rich-mine-a-month-after-cronies-raise-false-alarm-of-shaft-collapse/\">Mnangagwa grabs gold-rich mine a month after cronies raise false alarm of shaft collapse </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "11 Jan 2025"
        },
        {
            "title": "OK Zimbabwe branches ‘intermittently’ run out of merchandise, speculation of imminent closure dispelled",
            "url": "https://www.newzimbabwe.com/ok-zimbabwe-branches-intermittently-run-out-of-merchandise-speculation-of-imminent-closure-dispelled/",
            "content": "By Tapiwa Svondo\n\nLEADING retailer, OK Zimbabwe says it experienced intermittent stock outs during the just-ended festive season.\n\nA Masvingo-based weekly newspaper this week posted images of empty shelves in the beverages and fresh produce sections of the supermarket as well as deserted tills at its various branches, raising fears of imminent closure.\n\nIn a counter press release, OK Zimbabwe group company secretary, Margaret Munyuru, confirmed the retail giant faced brief stock outs during Christmas and New Year holidays.\n\nThe company faced intermittent product supply challenges during the festive period.\n\nShe asserted that all its stores remain open and operational.\n\nIt has come to our attention that there has been a surge of frenzied and speculative commentary circulating on social media platforms regarding the viability and going concern status of OK Zimbabwe Limited (the Company).\n\nWe assure all stakeholders, including customers, shareholders, employees, and partners, that our stores are open for trading.\n\nAlthough the company faced intermittent product supply challenges during the festive period, we continue to serve our loyal customers and contribute to the economic growth and development of Zimbabwe, said Munyuru.\n\nThe company secretary reassured stakeholders that OK Zimbabwe is here to stay, as its on the verge of restoring its image despite the economic challenges posed by a volatile operating environment.\n\nWe are grateful to our supplier partners, bankers and other stakeholders for their support at a time when the company, as well as most of the formal retail sector, has been adversely impacted by a volatile operating environment.\n\nWe are actively engaged with our suppliers, and key stakeholders, including industry associations and regulators, to restore supplies to normal levels whilst working on solutions that stabilise the trading environment, said Munyuru.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/11030315/IMG-20250111-WA0003.jpg",
            "description": "<p>By Tapiwa Svondo  LEADING retailer, OK Zimbabwe says it experienced intermittent stock outs during the just-ended festive season. A Masvingo-based weekly newspaper this week posted images of empty shelves in the beverages and fresh produce sections of the supermarket as well as deserted tills at its various branches, raising fears of imminent closure. In a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ok-zimbabwe-branches-intermittently-run-out-of-merchandise-speculation-of-imminent-closure-dispelled/\">OK Zimbabwe branches ‘intermittently’ run out of merchandise, speculation of imminent closure dispelled </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "11 Jan 2025"
        },
        {
            "title": "Exiled Moyo portrays as ‘malcontents’ political actors working against Mnangagwa’s presidential term extension",
            "url": "https://www.newzimbabwe.com/exiled-moyo-portrays-as-malcontents-political-actors-working-against-mnangagwas-presidential-term-extension/",
            "content": "By Staff Reporter\n\nEXILED former Cabinet minister Jonathan Moyo, once a fervent critique of President Emmerson Mnangagwa, has described as malcontents those against his envisaged presidential term extension.\n\nHis comments come days after a faction of the main opposition party, Citizens Coalition for Change (CCC), revealed that it was in support of Mnnagagwas stay beyond 2028, a position which another faction led by Jameson Timba has rubbished.\n\nSome members of Zanu PF are seeking amendments to Zimbabwes Constitution that will remove term limits and allow Mnangagwa a third term in office.\n\nThe move is facing resistance, not just from opposing figures, but factions within the ruling party in favour of a takeover by Vice President Constantino Chiwenga.\n\nSections 91(2) and 382(7) of the Constitution must be amended to allow Mnangagwa a third term.\n\nInteresting. Meanwhile, there are some malcontents who are already eyeing the 2028 elections and agitating for their holding only and only because, as is now the toxic ritual, said Moyo in response to a CCC factions support of the idea.\n\nThey hope to dispute their conduct and outcome, even without the V11s or evidence of anything untoward!\n\nHis comment appeared a veiled attack on Chamisa, who has disputed results of two consecutive elections and accused Mnangagwa of rigging.\n\nTimba, who is sympathetic to Chamisa, is the one calling on Zanu PF and those supporting Mnangagwas term extension to respect the supreme law of the land.\n\nMoyo has been in self-exile since he fled marauding soldiers at the height of a 2017 coup that ushered Mnangagwa into office and scattered the G40 grouping.\n\nMoyo and his G40 apparatchiks looked set to take control after Mugabe until Mnangagwa roped in Chiwenga and the military.\n\nAfter spending years laying into Mnangagwa, questioning his leadership and chronicling the former Vice Presidents role in atrocities such as Gukurahundi, Moyo has since 2023 been in support of the Zanu PF supremo.\n\nMoyos damascene moment came when his offer to help a then united CCC was snubbed, with the partys top officials arguing that he could not be trusted.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/03/06225846/Jonathan-Moyo.jpg",
            "description": "<p>By Staff Reporter EXILED former Cabinet minister Jonathan Moyo, once a fervent critique of President Emmerson Mnangagwa, has described as malcontents those against his envisaged presidential term extension. His comments come days after a faction of the main opposition party, Citizens Coalition for Change (CCC), revealed that it was in support of Mnnagagwa’s stay beyond</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/exiled-moyo-portrays-as-malcontents-political-actors-working-against-mnangagwas-presidential-term-extension/\">Exiled Moyo portrays as ‘malcontents’ political actors working against Mnangagwa’s presidential term extension </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "11 Jan 2025"
        },
        {
            "title": "Opposition CCC leadership wrangles intensify; Welshman Ncube argues Timba doesn’t represent any faction",
            "url": "https://www.newzimbabwe.com/opposition-ccc-leadership-wrangles-intensify-welshman-ncube-argues-timba-doesnt-represent-any-faction/",
            "content": "By Staff Reporter\n\nCITIZENS Coalition for Change (CCC) factional fights have intensified after the Welshman Ncube-led faction fired salvos at a top member of another splinter grouping using the same name.\n\nJameson Timba, who recently spent a prolonged stay in pretrial detention at Harare Remand Prison, purports to lead another CCC faction reportedly loyal to Nelson Chamisa, the founding party leader who later abandoned ship citing Zanu PF infiltration.\n\nNcube has also issued a stern warning to all opposition MPs and cajoled them to stay loyal to him or risk unspecified disciplinary action.\n\nThe developments come barely a fortnight after opposition MPs planned to visit Precabe farm owned by President Emmerson Mnangagwa in Kwekwe, raising questions over CCC lawmakers allegiance.\n\nThe aborted farm visit also caused a public outcry on social media leading to many people questioning Mnangagwas claim that he is a constitutionalist as it is alleged, he wanted to use the meeting to discuss deferment of 2028 elections.\n\nIn a statement this Friday, the Ncube-led CCC, through its spokesperson Willias Madzimure, said it does not recognise Timba as leader of the CCC party and denied existence of any other group by the same nomenclature.\n\nNcubes CCC outfit argued former party leader, Chamisa, resigned a year ago and was replaced by him.\n\nCCC Welshman Ncube party has noted with concern a statement issued by Jameson Timba, in which he purported to be the interim party leader and chief administrator of the CCC party.\n\nWe categorically dismiss and refute the claims made in that statement. There is no position of party leader and administrator under the CCC party Constitution, CCC spokesperson Madzimure said.\n\nHe further said CCC MPs would continue serving the countrys constituencies.\n\nThe High Court decision, the day before yesterday confirmed that there is only one CCC, led by acting president Prof Welshman Ncube and one caucus in Parliament.\n\nThe rebuke by Ncube also sought to whip disloyalty stemming from CCC legislators planned tour of Precabe farm belonging to the ruling Zanu PF party leader, which sparked an outcry among supporters and observers.\n\nWe warn any Member of Parliament who attends meetings of another political party, other than the one whose ticket they were elected on in August 2023, will face disciplinary action, added Madzimure.\n\nHe affirmed that Ncube is the bonafide CCC interim leader.\n\nFor the record, Nelson Chamisa resigned as president of the CCC party over twelve months ago and was replaced by acting president Welshman Ncube, whose position has been confirmed by the latest High Court ruling.\n\nThe Ncube faction of CCC this week suspended self-styled interim secretary-general, Sengezo Tshabangu, as the tussle for control of Zimbabwes biggest opposition movement continues.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/07/22052344/Welshman-Ncube1.jpg",
            "description": "<p>By Staff Reporter CITIZENS Coalition for Change (CCC) factional fights have intensified after the Welshman Ncube-led faction fired salvos at a top member of another splinter grouping using the same name. Jameson Timba, who recently spent a prolonged stay in pretrial detention at Harare Remand Prison, purports to lead another CCC faction reportedly loyal to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/opposition-ccc-leadership-wrangles-intensify-welshman-ncube-argues-timba-doesnt-represent-any-faction/\">Opposition CCC leadership wrangles intensify; Welshman Ncube argues Timba doesn’t represent any faction </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "11 Jan 2025"
        },
        {
            "title": "Landmine detonates killing three in Binga",
            "url": "https://www.newzimbabwe.com/landmine-detonates-killing-three-in-binga/",
            "content": "By Staff Reporter\n\nTHREE people were Wednesday killed in a landmine explosion in Binga, believed to be a remnant of explosives buried underneath during the countrys 1970s liberation struggle.\n\nThe explosive is said to have detonated after a Binga Rural District Council vehicle carrying six people onboard ran over it.\n\nThe landmine, not recently planted, was reportedly on the edges of the road connecting Mabwe and Sebungwe Narrows.\n\nPictures of the explosion site at Simatelele under Chief Siachilaba were circulated on social media depicting the overturned vehicle.\n\nInformation secretary Nick Mangwana confirmed the incident.\n\nThe explosion killed a 14-year-old girl on the spot and two men passed away in transit to Binga Rural District Hospital, said Mangwana.\n\nThe de-mining team from the Zimbabwe National Army (ZNA) is on the ground checking for other landmines within the vicinity.Sebungwe Narrows is a conservancy belonging to Binga RDC chief executive officer Joshua Muzamba, and that is where the vehicle was coming from at the time of the incident.Zimbabwe has had a sustained demining programme that saw the removal of explosives in various communities, particularly those along borders.\n\nThe de-mining team from the Zimbabwe National Army (ZNA) is on the ground checking for other landmines within the vicinity.\n\nSebungwe Narrows is a conservancy belonging to Binga RDC chief executive officer Joshua Muzamba, and that is where the vehicle was coming from at the time of the incident.\n\nZimbabwe has had a sustained demining programme that saw the removal of explosives in various communities, particularly those along borders.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/10164304/Gg7iZk1XAAA2lq1.jpeg",
            "description": "<p>By Staff Reporter  THREE people were Wednesday killed in a landmine explosion in Binga, believed to be a remnant of explosives buried underneath during the country’s 1970s liberation struggle. The explosive is said to have detonated after a Binga Rural District Council vehicle carrying six people onboard ran over it. The landmine, not recently planted,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/landmine-detonates-killing-three-in-binga/\">Landmine detonates killing three in Binga</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "11 Jan 2025"
        }
    ]
}