{
    "news": [
        {
            "title": "ICT Minister Mavetera under fire for leading Chiwenga diss song at National Shrine; VP’s supporters label her “reckless, provocative”",
            "url": "https://www.newzimbabwe.com/ict-minister-mavetera-under-fire-for-leading-chiwenga-diss-song-at-national-shrine-vps-supporters-label-her-reckless-provocative/",
            "content": "By Staff Reporter\n\nICT Minister Tatenda Mavetera is facing a firestorm of criticism for leading a provocative song targeting Acting President General Constantino Chiwenga. This dramatic scene unfolded yesterday at the National Heroes Acre in Harare, exposing the deep fault lines within Zanu PF.\n\nMavetera, who formed the Young Women for ED group ahead of the disputed 2023 elections, was seen in the stands leading her group in a song with the lyrics: mupanduki mupanduki nguva yakwana, chera mwena which translates to traitor, traitor, your time is up.This song, like a dagger aimed at the heart, indirectly accused Acting President Chiwenga of being a traitor.\n\nThe burial of national hero Justin Mupamhanga became a stage for open Zanu PF infighting, much to the embarrassment of the party and government.\n\nThe division was evident: two groups in the stands, as different as night and day. One group, dressed in pink Young Women For ED t-shirts and led by Mavetera, clashed with another group sharing space with soldiers.\n\nMaveteras group also waved faux crocodiles in the air, a display of loyalty to President Emmerson Mnangagwa.\n\nThese supporters of Mavetera clashed head-on with the other group, who loudly praised Chiwenga and sang in his support, with the refrain: siyanai naye Chiwenga munovengerei or leave Chiwenga alone, why do you hate him?. This pro-Chiwenga group grew even more fervent every time Chiwenga spoke against corruption  their support, like a tidal wave, building with each denunciation.\n\nNtokozo Msipha, Secretary-General of the General Chiwenga Voluntary Supporters Association, stated that Mavetera had crossed the line, calling her actions at the national shrine not just reckless but provocative.\n\nIn a statement Tuesday morning, Msipha said: Hon Minister, you have crossed the line. This must never happen again. Let this statement serve as a final warning. Discipline, respect and loyalty are the cornerstones of leadership. Those who fail to uphold them will find themselves on the wrong side of history.\n\nLast week, during the burial of three other national heroes, Chiwenga himself had described disrespect as a mortal sin which he said cannot be forgiven on earth and in heaven  a pronouncement now hanging over this conflict like a dark cloud.\n\nClive Malunga, a staunch critic of the Mnangagwa 2030 agenda and a veteran of the liberation struggle, told NewZimbabwe.Com that Mavetera was a disrespectful and a Mnangagwa bootlicker who has neglected her duties, focusing instead on pleasing one man over the needs of the country.\n\nThe calibre of ministers that we have in the current government are just bootlickers and they are always bent on pleasing an individual over the citizens of Zimbabwe. Mavetera should stop that kind of 1950s politics. She should concentrate on her ministry and constituency, Malunga said, his words dripping with disdain.\n\nPolitical analyst Lazurus Sauti, a lecturer at the University of Zimbabwe, said that Mnangagwas cabinet was not formed on merit basis.\n\nMost, if not all, public office holders are not chosen based on merit. So, they lack knowledge on how to formulate policies that can transform our economy in many respects. Mavetera is a prime example. She was busy at the national shrine dancing kongonya dissing political opponents instead of promoting ICT policies, he added, his tone critical.\n\nAttempts to get a comment from Minister Mavetera proved unsuccessful, with her mobile phone going unanswered.\n\nZanu PF spokesperson Farai Marapira distanced the party from Maveteras actions.\n\nYoung Women for ED is an affiliate of the party Zanu PF and it is an independent juristic person therefore it has its own structures that speak and defend on its own behalf. I speak on behalf of the party, Marapira said.\n\nThis event has thrown the simmering tensions within Zanu PF into sharp relief, revealing a party divided and struggling to contain its internal conflicts. The political stage is set for more drama as the rival factions continue to threaten tear each other apart.\n\nSocial media was set ablaze this morning, as many erupted with a cacophony of commentary and fervent debate surrounding Maveteras conduct at the National Heroes Acre yesterday.\n\nThe incandescent display of factionalism at the hallowed grounds of the national shrine has spurred a maelstrom of reactions, with many suggesting that the minister should perhaps commence preparations for an expeditious departure from Zimbabwe.\n\nThese voices, fuelled by historical precedent, posit that her exit strategy should mirror the abrupt exoduses of Professor Jonathan Moyo and his coterie of G40 kingpins who fled the nation during the tumultuous Operation Restore Legacy in 2017.\n\nThis military-led intervention forced the resignation of the late President Robert Mugabe, leaving key loyalists to his wife, Grace Mugabe, under the G40 banner scrambling for sanctuary in disparate locales beyond the borders of Zimbabwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/28115514/MAVETERA.jpg",
            "description": "<p>By Staff Reporter ICT Minister Tatenda Mavetera is facing a firestorm of criticism for leading a provocative song targeting Acting President General Constantino Chiwenga. This dramatic scene unfolded yesterday at the National Heroes Acre in Harare, exposing the deep fault lines within Zanu PF. Mavetera, who formed the “Young Women for ED” group ahead of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ict-minister-mavetera-under-fire-for-leading-chiwenga-diss-song-at-national-shrine-vps-supporters-label-her-reckless-provocative/\">ICT Minister Mavetera under fire for leading Chiwenga diss song at National Shrine; VP’s supporters label her “reckless, provocative”</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:40",
            "date": "28 Jan 2025"
        },
        {
            "title": "Magaya’s fraud exposed – UNISA says diploma submitted to High Court is fake",
            "url": "https://www.newzimbabwe.com/magayas-fraud-exposed-unisa-says-diploma-submitted-to-high-court-is-fake/",
            "content": "By Staff Reporter\n\nINVESTIGATIONS have revealed that a University of South Africa (UNISA) diploma submitted by Prophet Walter Magaya to the High Court last week is a forgery, while his name does not appear in any of their databases.\n\nMagaya submitted a photocopied and certified diploma in marketing to the High Court as he sought to fight his way back into standing for the ZIFA presidency.\n\nOnce a front-runner for the top ZIFA post having been involved in football administration for over two decades, a lack of proper educational documents saw him being barred from contesting.\n\nZIFA had set an Ordinary Level qualification as a prerequisite.\n\nRELATED:High Court dismisses overqualified Magayas application challenging elimination from ZIFA Presidential race\n\nInvestigations by Zimbabwean journalist Maynard Manyowa, of UK-based Dug Up, exposed the fraud. The publication sought clarification and confirmation from UNISAs press office.\n\nKindly be advised that based on the details you provided; our system could not trace either a student number or date of birth for Mr. Magaya, read UNISAs response to Manyowa in a letter dated January 28, 2025.\n\nThis effectively means that we do not have Mr. Magaya as a student of UNISA.\n\nIn 2017 state owned papers reported Magaya had been awarded an honorary PhD by the same institution.\n\nDespite Magaya seeking to prove otherwise, that he did not have an Olevel qualification has always been an open secret.\n\nZIFAs strict conditions for presidential candidates saw him presenting two more diplomas whose authenticity is yet to be confirmed.\n\nSection 137 of the Criminal Law (Codification and Reform) Act criminalises forgery and places a fine or 20-year imprisonment or both as punishment.\n\nMagaya owns Yadah FC which plays in the Castle Lager premiership.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/14120808/magaya.gif",
            "description": "<p>By Staff Reporter INVESTIGATIONS have revealed that a University of South Africa (UNISA) diploma submitted by Prophet Walter Magaya to the High Court last week is a forgery, while his name does not appear in any of their databases. Magaya submitted a photocopied and certified diploma in marketing to the High Court as he sought</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/magayas-fraud-exposed-unisa-says-diploma-submitted-to-high-court-is-fake/\">Magaya’s fraud exposed – UNISA says diploma submitted to High Court is fake</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:40",
            "date": "28 Jan 2025"
        },
        {
            "title": "Delta Corp highlights operational hurdles from Zimbabwe’s turbulent economy",
            "url": "https://www.newzimbabwe.com/delta-corp-highlights-operational-hurdles-from-zimbabwes-turbulent-economy/",
            "content": "IOL\n\nZimbabwean beer brewer and soft drinks maker, Delta Corporation, has flagged the prohibitive operating environment and currency instability obtaining in South Africas northern neighbour, arguing that policy changes were occasioning challenges that rendered operators uncompetitive and supply chains ineffective.\n\nOver the past few weeks, retail and wholesale companies have been closing down in Zimbabwe as they bulk under the heavy saddle of currency instability. The Zimbabwean government enforces that formal companies also take the local unit of exchange for purchases while informal players mostly trade in US dollars, leaving retailers at a disadvantage.\n\nThe operating environment in Zimbabwe remains complex, influenced by policy changes and currency instability. The beverages sector faces further challenges relating to uncompetitive retail prices arising from high input costs and taxes which attract lower priced imports from the region and policy driven changes to the route to market, said Delta Corp secretary, Faith Musinga.\n\nDelta Corp cited fluctuations in exchange rates, disruptions in utilities supply (electricity and water), and varied consumer spending patterns during the traditional summer and festive peak period as the key developments that marred the operating environment during the quarter period to the end of December 2024.\n\nDuring the period under review, Delta managed to lift lager beer volumes by 4% over prior year same period. This was despite some disruptions to supply arising from prolonged water and power outages.\n\nInterestingly, demand remained firm and this had resulted in some mismatches in the supply of key brands and packs. The uplift in lager beer volumes was a consequence of the companys recent investments into capacity.\n\nDelta Corps sorghum based opaque beer volume for Zimbabwe grew by 2% for the quarter, but declined by 2% for the nine months compared to prior year.\n\nVolumes for the companys sparkling beverages (that includes brands such as Coca-Cola, Fanta and others) declined by 16% during the quarter compared to prior year.\n\nThe volume loss is attributed to the impact of sugar tax-induced price increases and the surge in imports from the region, explained Musinga.\n\nThe sectors competitiveness was affected by the relatively high sugar tax and cost differentials, leading to an increase in imports of similar offerings from neighbouring countries.\n\nZimbabwe introduced a sugar content surtax in January 2024.\n\nMusinga further said that the exchange rate disparities that dogged the quarter contributed to pricing misalignment in the formal sectors while the tight liquidity conditions that prevailed during the quarter resulted in sub-optimal stocking patterns in key retail channels.\n\nGroup revenue for the quarter only marginally increased by 1% compared to prior year and grew by 7% for the nine months. The company said this reflected the mixed volume performance across its business units.\n\nPart of the revenue increase in soft drinks was also related to the sugar tax induced price increases.\n\nNonetheless, the proportion of sales in US dollars varied month-to-month in response to the exchange rate and changes to the route to market but remained above 70% for the year.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/28024735/Screenshot-2025-01-28-at-04.47.21.png",
            "description": "<p>IOL Zimbabwean beer brewer and soft drinks maker, Delta Corporation, has flagged the prohibitive operating environment and currency instability obtaining in South Africa’s northern neighbour, arguing that policy changes were occasioning challenges that rendered operators uncompetitive and supply chains ineffective. Over the past few weeks, retail and wholesale companies have been closing down in Zimbabwe</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/delta-corp-highlights-operational-hurdles-from-zimbabwes-turbulent-economy/\">Delta Corp highlights operational hurdles from Zimbabwe’s turbulent economy</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:40",
            "date": "28 Jan 2025"
        },
        {
            "title": "ZCTU blames monetary and fiscal policies for company closures",
            "url": "https://www.newzimbabwe.com/zctu-blames-monetary-and-fiscal-policies-for-company-closures/",
            "content": "By Alois Vinga\n\nTHE Zimbabwe Congress of Trade of Unions (ZCTU) has blamed misdirected Fiscal and Monetary Policy initiatives for accelerated company closures on the back of calls for authorities to avert the crises.\n\nThe calls come on the back of companies such as regional retailer Choppies Enterprise Limited (Choppies) and British multinational professional services and fast-moving consumer goods firms, PricewaterhouseCoopers International Limited and Unilever plc indicating the intention to close down operations in Zimbabwe.\n\nFirms like cement manufacturer Khayah Cement Limited and clothing retailer Truworths Limited entered corporate rescue in December and August 2024, respectively.\n\nAt the core of the escalation in problems being experienced by industry is the flooding of the local ZWG currency in the formal sector at a time when companies have no easily accessible route to obtain the much-needed US$.\n\nIn its annual assessment for the just-ended year of 2024, the Zimbabwe National Chamber of Commerce (ZNCC) bemoaned the lack of willing foreign currency sellers in the Interbank Market, leaving many companies in a dire situation.\n\nThe complex problems come on the back of limited access to capital from local banks which continue to struggle to meet productive needs at reasonable rates.\n\nIn a statement, the Zimbabwe Congress of Trade Unions (ZCTU) acting secretary general, Runesu Dzimiri blamed policies in operation for the demise which is leaving the countrys workers hardest hit.\n\nThe companies that are closing are all citing skewed fiscal and monetary policies that are pushing the retail sector out, including imports of not only cheap but also fake goods that are being sold in the informal sector. While those who are importing these cheap goods are not paying any taxes, formal shops are forced to pay hefty taxes, pushing them to bankruptcy, he said.\n\nDzimiri said it is time the government realizes that there is a serious impact on the economy if the retail and wholesale sector is left to collapse.\n\nFirst, when jobs are lost, the government will also lose revenue not only on corporate taxes but also in the form of Pay as You Earn (PAYE) and it will obviously fail to meet its operational requirements as well as meeting social services. As PAYE is depleted, the Value Added Tax will also be eroded as workers will not have disposable income, he said.\n\nSecondly, he said pension schemes both private and public will be affected as every employee whose contract is terminated will look up to the government for social welfare but resources are scarce at the moment.\n\nThe labour organ said lack of access to social protection and benefits usually associated with full-time employment leaves employees vulnerable and dependent on the already strained public service provisions.\n\nThirdly, the ZCTU leader said the general condition of fear and insecurity also dissuades workers from joining trade unions, leaving them even more vulnerable to precarious work arrangements leaving communities in unstable and insecure situations due to disruptions of their life plans.\n\nAdded Dzimiri, The ZCTU demands the government to move fast and address the situation and immediately stop the current wave of company closures. The ZCTU warns the government that the current carnage in the retail and wholesale sector is a recipe for political instability as disgruntled workers will turn against their government for failure to protect them.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/03/06002305/Choppies.jpg",
            "description": "<p>By Alois Vinga THE Zimbabwe Congress of Trade of Unions (ZCTU) has blamed misdirected Fiscal and Monetary Policy initiatives for accelerated company closures on the back of calls for authorities to avert the crises. The calls come on the back of companies such as regional retailer Choppies Enterprise Limited (Choppies) and British multinational professional services</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zctu-blames-monetary-and-fiscal-policies-for-company-closures/\">ZCTU blames monetary and fiscal policies for company closures</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:40",
            "date": "28 Jan 2025"
        },
        {
            "title": "Chitungwiza municipality to demolish unapproved precast walls, shut down unlicensed mobile cash cabins",
            "url": "https://www.newzimbabwe.com/chitungwiza-municipality-to-demolish-unapproved-precast-walls-shut-down-unlicensed-mobile-cash-cabins/",
            "content": "By Staff Reporter\n\nThe Chitungwiza Municipality has given a notice to homeowners and businesses with unapproved precast walls to visit council offices for regularization.\n\nThe council has temporarily waived the US$200 penalty fee for each approval stage for those who comply before February 28, 2025, allowing them to pay a reduced fee of US$150 instead.\n\nIn the notice, the Chitungwiza municipal acting town clerk, Japson Nemuseso, said demolition of unauthorised precast walls will take place if compliance is not achieved within a month.\n\nChitungwiza Municipality is inviting homeowners and businesses with durawalls that have not been approved to visit council offices for regularisation by going through the approval processes. Please also note that those who are not within their boundaries should revert back to original pegs.\n\nThe council is waiving the US$200 penalty fee for each approval stage to people who respond to this call before 28 February 2025. Those who respond before the deadline will only pay a US$150 approval fee.\n\nIf compliance is not achieved within a month, the municipality will not hesitate to demolish the durawalls, a cost that will be met by their owners, said Nemuseso\n\nThe municipality further directed individuals operating mobile cash cabins or containers without the required licenses, permits, or legitimate leases to cease their operations immediately.\n\nThe Chitungwiza Municipality hereby directs anyone running a business in mobile cash cabins or containers without the required licenses, permits, or legitimate leases to cease operations immediately and vacate the area you operate at by February 6, 2025.\n\nFailure to comply with this notice will result in confiscation of any goods and equipment. The Municipality firmly urges you to act promptly to avoid financial or legal consequences, said Nemuseso.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/28023014/Chitungwiza-council.jpg",
            "description": "<p>By Staff Reporter The Chitungwiza Municipality has given a notice to homeowners and businesses with unapproved precast walls to visit council offices for regularization. The council has temporarily waived the US$200 penalty fee for each approval stage for those who comply before February 28, 2025, allowing them to pay a reduced fee of US$150 instead.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chitungwiza-municipality-to-demolish-unapproved-precast-walls-shut-down-unlicensed-mobile-cash-cabins/\">Chitungwiza municipality to demolish unapproved precast walls, shut down unlicensed mobile cash cabins</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:40",
            "date": "28 Jan 2025"
        },
        {
            "title": "SADC chair Mnangagwa condemns attacks on UN, SADC peacekeepers in DRC; vows action against perpetrators",
            "url": "https://www.newzimbabwe.com/sadc-chair-mnangagwa-condemns-attacks-on-un-sadc-peacekeepers-in-drc-vows-action-against-perpetrators/",
            "content": "By Thandiwe Garusa\n\nPRESIDENT Emmerson Mnangagwa has expressed grave concern over the attacks on UN and SADC peacekeepers in the eastern Democratic Republic of Congo (DRC) and vowed to take action against the perpetrators.\n\nAccording to the UN and army officials in the DRC, 13 soldiers serving with peacekeeping forces in the country were killed in clashes with March 23 Movement (M23) rebels.\n\nThe Chairman of SADC, His Excellency President Emmerson Dambudzo Mnangagwa expresses grave concern on the deteriorating security and humanitarian situation in the Eastern DRC occasioned by the offensive operations of the M23 rebels.\n\nThe chairman condemns, unreservedly, the cowardly attacks on the UN and SADC peacekeepers that have resulted in some of them paying the ultimate sacrifice for the cause of peace in the Eastern DRC.\n\nThe Chairman of SADC points out that SADC will assume its full responsibility and take action to deal with the deteriorating security and humanitarian situation in Eastern DRC.\n\nThose responsible for the situation should be held accountable, Mnangagwa said.\n\nHe further extended his condolences to the families of the fallen soldiers and wished those injured a speedy recovery.\n\nThe Chairman of SADC conveys his heartfelt condolences to the families of the deceased peacekeepers and wishes those injured a swift recovery, he added.\n\nAccording to the United Nations, clashes between M23 rebels and government forces in the DRC have displaced 400,000 people since the beginning of the year.\n\nThe M23 is among roughly 100 Congolese armed groups vying for control in the mineral-rich region amid a decades-long conflict.\n\nThe rebels briefly seized Goma in 2012 but withdrew following international pressure.\n\nThey reemerged in late 2021, reportedly with increased support from Rwanda, according to the Congolese government and UN experts.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/28022424/drc-un.webp",
            "description": "<p>By Thandiwe Garusa PRESIDENT Emmerson Mnangagwa has expressed grave concern over the attacks on UN and SADC peacekeepers in the eastern Democratic Republic of Congo (DRC) and vowed to take action against the perpetrators. According to the UN and army officials in the DRC, 13 soldiers serving with peacekeeping forces in the country were killed</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sadc-chair-mnangagwa-condemns-attacks-on-un-sadc-peacekeepers-in-drc-vows-action-against-perpetrators/\">SADC chair Mnangagwa condemns attacks on UN, SADC peacekeepers in DRC; vows action against perpetrators</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:40",
            "date": "28 Jan 2025"
        },
        {
            "title": "Elbowed out farm owner drags residents association to court over development of Leengate’s Spitzkop upmarket stands",
            "url": "https://www.newzimbabwe.com/elbowed-out-farm-owner-drags-residents-association-to-court-over-development-of-leengates-spitzkop-upmarket-stands/",
            "content": "By Mary Taruvinga\n\nUpmarket residential stands at Spitzkop Farm being sold by property developer, Leengate are under scrutiny after the farm owner stumbled upon adverts of her land being advertised without her knowledge.\n\nSpitzkop farm owner, Diana Catherine Rodrigues has since approached the High Court seeking an order against Spitzkop Farm Residents Association which sold the land to Leengate.\n\nRodrigues said the association illegally obtained a court order declaring the farm as abandoned.\n\nThe order was granted by former judge Webster Chinamhora who resigned from the bench in 2023 ahead of a tribunal inquiry into his suitability to hold office following a litany of allegations against him.\n\nHe was under fire for delivering a judgement in a case he never heard.\n\nIn the present matter, Rodrigues told the High Court that she became aware of the order against her on August 1 2024 after she had engaged her lawyers to find out why Leengate was advertising and selling her land.\n\nThe 1st and 2nd Respondents (Spitzkop Farm Residents Association and Tinashe Mananzva) representing the association had approached the High Court via the chamber book for an order in terms of the Titles Registration and Derelict Lands Act.\n\nThe said process was never served on me. As appears on the record attached above, the 1st and 2nd Respondents alleged that our whereabouts were unknown despite the fact that I was born and raised in Zimbabwe and have always resided in Zimbabwe, she said.\n\nThe record of proceedings also shows that the respondents advertised their provisional and final order in the Herald Newspaper relating to a different deed and not Rodrigues.\n\nHowever, in this digital world, I have not bought a single hard-copy newspaper for the last ten years.\n\nFurther, the matter was filed and processed during the novel Covid 19 era in which most people chose to stay indoors both in compliance with WHO and Zimbabwean regulations around self-distancing and lockdowns.\n\nThe above facts illustrate but one thing; that I was never in willful default. The explanation for my failure to oppose the process commenced before this Honourable Court is reasonable, she said.\n\nShe alleged that no due diligence was done to contact her and went to attach the Zvimba RDC assessment notices for the payment of levies which contains her address as P.O Box 1593, Harare.\n\nRodrigues said the address is still active and houses a company she jointly owns with her late husband.\n\nShe also told the High Court that the residents took advantage of Covid-19 to mount an application with full knowledge that the prospects of it going unopposed and unseen by her were high.\n\nRodrigues said she never abandoned her farm and still has interest in it.\n\nI am the co-owner of the undivided share in two pieces of land situated in the district of Salisbury called Lot 10A and Lot 11Spitzkop registered under Deed of Transfer Number 2568/88. See Annexure C being a copy of my deed.\n\nThe 1st and 2nd Respondents approached the court alleging that the land was abandoned by its owners and desired to acquire it.\n\nThat was not true. I never at any point abandoned my land and still want it. In any event, the 1st and 2nd Respondents founding affidavit referred to DT2563/88. I am advised that a case stands or falls on its founding papers.\n\nShe said the association cannot seek to hold on to a default judgment adding that she deserves to be heard on merits.\n\nShe said she wanted to understand how the court issued an order when the application and all adverts related to a different deed.\n\nRodrigues said she bought the property in question in 1988 together with the late Urebai Rodrigues.\n\nShe said it is therefore not just for her to lose the property to the respondents who did not spend any money on it.\n\nThe applicant also said at no stage did the respondents mistake their status as farm employees.\n\nIn their own words, they were cheap labour, she said.\n\nShe also complained that the court was not told about the current membership of the association and how long they have resided at the property and on what basis.\n\nSecondly, I deny the fact that the 1st and 2nd Respondents resided at the property at any time before the present application.\n\nThe farm was vacant as we always went to check if no land barons had taken up occupation on the land. It was in one of these regular checks that we discovered that access roads were being created in the land and some land developers had started advertising for sale.\n\nThe 1st and 2nd Respondents alleged that they conducted a thorough due diligence with the Zvimba RDC and found that rates had never been paid since 1988. This is false. Of note is the fact that Zvimba RDC only came into being in 1993. So how could rates be paid in 1988 to a non-existent entity?\n\nTo further demonstrate the fabrications, Zvimba RDC would write and deliver a rates assessment letter to me at my physical address which I still use to date, every year until 2002 when it stopped. I would, as such, pay the assessed levy, the last of which was paid in 2002- the last year the RDC sent the assessment.\n\nA perusal of the record will reveal that the application and founding affidavit as well as the draft order referred to Deed of Transfer Number 2563/88. The said Deed of Transfer does not belong to me or relate to my land, she said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/27171328/spitzkop-leengate.jpg",
            "description": "<p>By Mary Taruvinga Upmarket residential stands at Spitzkop Farm being sold by property developer, Leengate are under scrutiny after the farm owner stumbled upon adverts of her land being advertised without her knowledge. Spitzkop farm owner,  Diana Catherine Rodrigues has since approached the High Court seeking an order against Spitzkop Farm Residents Association which sold</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/elbowed-out-farm-owner-drags-residents-association-to-court-over-development-of-leengates-spitzkop-upmarket-stands/\">Elbowed out farm owner drags residents association to court over development of Leengate’s Spitzkop upmarket stands</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:40",
            "date": "28 Jan 2025"
        },
        {
            "title": "Shurugwi mayor calls for dialogue with Chinese miner Chengxi over violations",
            "url": "https://www.newzimbabwe.com/shurugwi-mayor-calls-for-dialogue-with-chinese-miner-chengxi-over-violations/",
            "content": "By Mary Taruvinga\n\nShurugwi Mayor Fanuel Machiya says Chinese company Chengxi Pvt Ltd, chaired by President Emmerson Mnangagwas son Collins, should be more responsible as it has put immense pressure on the mining towns infrastructure while contributing very little to the well-being of society.\n\nMachiya said there was a need for urgent dialogue between the company, the towns residents and other stakeholders to address growing tensions as a result of the companys mining activities.\n\nHe revealed that previous efforts to engage the company have been futile because it has been resisting engagement.\n\nA recent investigation conducted by NewZimbabwe.com and commissioned by the Information for Development Trust (IDT) revealed that hundreds of houses in Shurugwi are at risk of collapse due to the companys blasting operations.\n\nResidents also complained about the large amount of dust they are inhaling because of the companys mining operations as well as the disruption of their lifestyles.\n\nChengxi is engaged in large-scale opencast gold mining across several sites, including the Peak Area Boterekwa, Wanderer, and Dunraven, where it has caused massive damage to tourist attractions and picturesque areas.\n\nResidents say they receive little to no warning before blasting occurs, which takes place randomly, day and night, leading to significant structural damage.\n\nThe investigation highlighted that Chengxi employs high-capacity explosives, leading to severe impacts felt in residents homes.\n\nCracks in walls, roadsand falling ceilings have become common, with many residents fearing for the safety of their houses, particularly as many are built on top of outdated underground mining tunnels.\n\nRELATED:Blasting livelihoods away: Chinese miner Chengxis operations disrupt life in Shurugwi\n\nIn an interview with NewZimbabwe.com following the publication of the investigation, Mayor Machiya expressed frustration over the difficulty of engaging with Chengxi.\n\nHe welcomed the medias attention to the issue, suggesting that continued coverage might prompt the company to improve its practices.\n\nThe situation is unfortunate, Machiya stated, as Chinese mining operations are pervasive, with claims in areas like Boterekwa, close to Fern Creek, and Wanderer, resulting in extensive mining activities.\n\nBesides the blasting, theirheavy machinery also wreaks havoc on our roads and local infrastructure.\n\nResidents have raised numerous complaints, and while the mayor insists that they aim to coexist peacefully with the company, he emphasised the pressing nature of the challenges posed by Chengxis operations.\n\nThe town of Shurugwi is small, and our resources are insufficient to tackle the significant problems caused by the company. Its difficult to maintain roads and infrastructure; we hope for their investment to help improve our community, he added.\n\nMayor Machiya revealed that his attempts to engage with Chengxi have been largely ignored.\n\nWe have made several written requests to meet, but there has been no response, he said. We began these efforts when I was still a councillorand first wrote themin 2022, but our calls for meetings have often gone unacknowledged.\n\nIn interviews, residents said the company was acting with impunity because of its close association with the First Family and Zanu PF officials.\n\nMachiya said Chengxi should follow the positive example set by Anglo-Americans, which has contributed resources to local schools and helped the community in various ways.\n\nWe want to discuss how they can minimise damage to our community while continuing to operate. Were not opposed to mining in Shurugwi, but we ask that they consider the impact on the local residents, Machiya explained.\n\nOther companies, like Zimasco and Unki, have functioned here for years without such significant complaints.\n\nConcerns from the community were echoed by Pardon Machocho, chairperson of the Shurugwi Residents Trust, who lamented that their grievances have been largely disregarded. He also raised alarms about respiratory issues stemming from dust emissions due to mining activities.\n\nIn the Wanderer area, weve observed massive cracks on the ground extending over two kilometres, signalling an impending disaster, he warned.\n\nThe issue of dust is critical. We have buriedabout eightcommunity memberswho I personally know,recently from silicosis, a concerning trend.\n\nLocal health officials were unavailable for immediate comment on the situation.\n\nChengxi has operated in Shurugwi since 2021 and, while it has a significant presence in Southeast Asia, East Africa, and Central America, details of its local ownership remain largely unknown. Collins Mnangagwa, identified as a senior partner of the company, was acknowledged by Chengxis general manager at a recent event.\n\nThe company has faced criticism for its environmental impact, having caused significant degradation to popular tourist sites like the Wolfshall Pass and Dunraven Waterfalls.\n\nChengxi general manager Simon Karimanzira insists that they have done a lot for the community to address problems caused by their operations.\n\nWe have a lot of projects we are currently implementing in giving back to the community or as we implement our Corporate Social Responsibility Policy which targets education, agriculture, mining and health sector.\n\nThis CSR policy is being implemented through working with the DDCs office, our local MPs, Councillors and relevant government stakeholders of the specific socio-economic target sectors.\n\nWe want to empower communities both in Shurugwi North and South hence the projects we targeted are of high impact covering as many beneficiaries as possible, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/20184819/20241024_132942-scaled.jpg",
            "description": "<p>By Mary Taruvinga Shurugwi Mayor Fanuel Machiya says Chinese company Chengxi Pvt Ltd, chaired by President Emmerson Mnangagwa’s son Collins, should be more responsible as it has put immense pressure on the mining town’s infrastructure while contributing very little to the well-being of society. Machiya said there was a need for urgent dialogue between the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/shurugwi-mayor-calls-for-dialogue-with-chinese-miner-chengxi-over-violations/\">Shurugwi mayor calls for dialogue with Chinese miner Chengxi over violations </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:40",
            "date": "28 Jan 2025"
        },
        {
            "title": "Warriors prospect dreams big in Lesotho",
            "url": "https://www.newzimbabwe.com/warriors-prospect-dreams-big-in-lesotho/",
            "content": "By Sport Reporter\n\nWarriors prospect Tatenda Blessed Mukubiya is dreaming big in Lesotho, where he is currently playing for topflight league side Majanta Football Club.\n\nThe Total Football Academy product has been doing well since making his move in 2022.\n\nMukubiya was part of the squad that helped Majanta gain back topflight league promotion in 2023, a season he was one of the best performers.\n\nAged 24, the right-footed defender is humbled that he is playing for Majanta.\n\nIts been a journey considering that when I joined Majanta, the team was in the lower division, and we helped it to regain its topflight league status.\n\nIts one of the big clubs here (Lesotho), and it is the first club from this nation to play in the CAF Champions League.\n\nSo Im humbled to be part of such a club,\n\nInspired by his uncle Tanaka Nyashanu, who has been supporting him throughout his journey, Mukubiya hopes to make it to Europe.\n\nMy uncle Nyashanu played a key role, he was always supporting me and pushing me.\n\nAlso Total Football Academy made me the player that I am today, so I owe them a lot for playing a key role in my development, he added.\n\nHaving moved to Lesotho, straight from Total Football Academy, Mukubiya is still open to having a dance in the Zimbabwe Premier Soccer League, provided a good opportunity comes through.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/27171803/IMG-20250127-WA0063.jpg",
            "description": "<p>By Sport Reporter Warriors’ prospect Tatenda Blessed Mukubiya is dreaming big in Lesotho, where he is currently playing for topflight league side Majanta Football Club. The Total Football Academy product has been doing well since making his move in 2022. Mukubiya was part of the squad that helped Majanta gain back topflight league promotion in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/warriors-prospect-dreams-big-in-lesotho/\">Warriors prospect dreams big in Lesotho</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:40",
            "date": "28 Jan 2025"
        },
        {
            "title": "ZIMRA warned against intensified anti-smuggling campaign",
            "url": "https://www.newzimbabwe.com/zimra-warned-against-intensified-anti-smuggling-campaign/",
            "content": "By Alois Vinga\n\nExperts in the retail sector have urged the government to be more cautious by balancing the anti-smuggling campaign with the general needs of ordinary citizens on the back of indications that basic commodities prices risk rising sharply.\n\nIn December 2024, the Zimbabwe Revenue Authority (ZIMRA) intensified smuggled goods seizures at the borders, confiscating merchandise running into millions of dollars in some instances.\n\nIn a notice signifying an intensified anti-smuggled goods campaign this week, the government further listed 19 products which shall be deemed smuggled and these include; Alcoholic beverages, cement, clothing footwear, diapers, motor spares, washing powder and detergents among others.\n\nIf your business is found in possession of these goods, and you cannot show ZIMRA proof that you paid duty for them, you will be deemed to have smuggled the goods and liable to payment of the duty thereof, including applicable penalties, an accompanying statement reads in part.\n\nHowever, a local retailerwho spoke to NewZimbabwe.com warned against the long-term effects of the anti-smuggling campaign.\n\nYes. Duties must be paid for by these importers but while the operation is highly noble, there is a need for authorities to be realistic about our countrys productive status. These products listed as specified for smuggling have been found at a very cheaper price locally, enabling citizens to purchase them at a cheaper price.\n\nAs we speak, the formal retail sector is already going down, with empty shelves becoming the order of the day. Indications on the ground are that many are likely to close shop. We have received reports of some supermarkets resorting to three days at work and three days outside work due to reduced business, she said.\n\nThe source said many formal outlets are folding operations at some branches and underscored that what this means is that the informal sector, a survival option now under pressure, will be left with no choice except to increase the prices of basic commodities.\n\nThere is a need for authorities to balance the interests, bearing in mind the possible risks of a surging cost of living for an already struggling populace, she added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/04/06225722/zimra-taxes.jpg",
            "description": "<p>By Alois Vinga Experts in the retail sector have urged the government to be more cautious by balancing the anti-smuggling campaign with the general needs of ordinary citizens on the back of indications that basic commodities prices risk rising sharply. In December 2024, the Zimbabwe Revenue Authority (ZIMRA) intensified smuggled goods seizures at the borders,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimra-warned-against-intensified-anti-smuggling-campaign/\">ZIMRA warned against intensified anti-smuggling campaign</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:40",
            "date": "28 Jan 2025"
        }
    ]
}