{
    "news": [
        {
            "title": "MPs get upmarket stands barely two years after receiving US$40,000 housing loans",
            "url": "https://www.newzimbabwe.com/mps-get-upmarket-stands-barely-two-years-after-receiving-us40000-housing-loans/",
            "content": "By Staff Reporter\n\nMEMBERS of Parliament (MPs) including those who were in the previous house, are set to receive prime Harare residential stands in the leafy Borrowdale district, barely two years after receiving US$40,000 as a housing loan.\n\nOpposition MPs such as Citizens Coalition for Change (CCC) Chief Whip Bridget Nyandoro, led by self-styled Secretary General Sengezo Tshabangu are some of the beneficiaries.\n\nThe land, which is in Marlborough, Borrowdale Central and Greystone Park, had been reserved for a community centre.\n\nThis is a project being carried out throughout the cities and provinces after Local Government Minister Daniel Garwe wrote letters to various local authorities for them to avail land for legislators to build their residential homes, said Zanu PF Chief Whip Pupurai Togarepi to a local daily.\n\nThe MPs will pay for the stands, with the strategy being to remove MPs from hotels.\n\nZimbabwean MPs have been living their best lives since Mnangagwas takeover, getting loans, increased allowances and even free passage at tollgates.\n\nThis latest land grab comes a week after outspoken war veteran Blessed Geza vowed to have Mnangagwa impeached and has been widely interpreted as another way of bribing MPs not to do so.\n\nGeza has been calling for Mnangagwas immediate resignation, accusing him of orchestrating grand corruption by cronies around him.\n\nWhat raises further questions is that some of the beneficiaries actually got a minimum of US$40,000 in 2022 while Cabinet Ministers pocketed US$500,000 in what were presented as housing loans.\n\nMarondera Central legislator Caston Matewu, whose name appeared on a list of beneficiaries took to social media, confirmed the news and said he had not taken the Zanu PF offer.\n\nWhile I was on the list of a Parliamentary Housing Scheme; I did not accept it. I did not take or grab any land as alluded to, said Matewu.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/04120822/pupurai-scaled.jpg",
            "description": "<p>move comes week after Geza threatens to have Mnangagwa impeached   By Staff Reporter MEMBERS of Parliament (MPs) including those who were in the previous house, are set to receive prime Harare residential stands in the leafy Borrowdale district, barely two years after receiving US$40,000 as a housing loan. Opposition MPs such as Citizens Coalition</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mps-get-upmarket-stands-barely-two-years-after-receiving-us40000-housing-loans/\">MPs get upmarket stands barely two years after receiving US$40,000 housing loans</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "10 Apr 2025"
        },
        {
            "title": "UZ weaponising disciplinary processes to intimidate, punish union leaders— teachers’ union",
            "url": "https://www.newzimbabwe.com/uz-weaponising-disciplinary-processes-to-intimidate-punish-union-leaders-teachers-union/",
            "content": "By Staff Reporter\n\nTHE University of Zimbabwe (UZ) management has been accused of abusing the colleges disciplinary processes to silence and punish union leadership, which is at the forefront of demanding decent salaries for lecturers.\n\nThis follows the recent suspension of members of the Association of University Teachers (AUT) at the countrys oldest university.\n\nIn a solidarity statement issued this Wednesday, ARTUZ said the varsitys Vice Chancellor, Paul Mapfumo, together with his executive, was attempting to muzzle dissent.\n\nThe Amalgamated Rural Teachers Union of Zimbabwe (ARTUZ) stands in unwavering solidarity with the suspended leaders of the AUT, following the disturbing actions taken by the UZ to silence genuine labour concerns.\n\nWe are deeply concerned by the suspension of AUT President Phillemon Munyaradzi Chamburuka and fellow union leaders Borncase Mwakorera, Obvious Vengeyi, Justin Tandire, and Munyaradzi Gwisai. These educators are being persecuted not for misconductbut for courageously organising and demanding fair wages that reflect the dignity of their labour, ARTUZ noted.\n\nIt is appalling that instead of engaging meaningfully with the AUTs legitimate demand for the restoration of pre-October 2018 salaries pegged at US$2,500, UZ management has chosen to weaponise disciplinary processes to intimidate and punish union leaders, the union added.\n\nThe suspensions, the labour body went further, were a direct assault on workers rights, academic freedom, and the constitutional right to freedom of association.\n\nARTUZ condemned the suspensions, describing them as an anti-worker, authoritarian attempt to suppress labour organising in the higher education sector.\n\nThe demand for living wages is not riotousit is righteous. The balloting exercise held by AUT reflects democratic principles, not disruption. If anything, it is managements refusal to address salary erosion that is disrupting higher learning.\n\nWe remind authorities that education cannot thrive in an environment where educators are punished for demanding fair treatment. This attack on AUT is an attack on all educators across the country, ARTUZ said.\n\nTo our colleagues in AUT, we say: You are not alone. Your fight is our fight. Your resilience is an inspiration to every underpaid and overworked teacher across Zimbabwe.\n\nARTUZ demanded that the vice chancellor and his executive immediately reverse the suspensions and engage AUT in good faith. The union also appealed to the Higher and Tertiary Education Ministry to intervene and protect the rights of tutors.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/12142202/UZ-1.png",
            "description": "<p>By Staff Reporter THE University of Zimbabwe (UZ) management has been accused of abusing the college’s disciplinary processes to silence and punish union leadership, which is at the forefront of demanding decent salaries for lecturers. This follows the recent suspension of members of the Association of University Teachers (AUT) at the country’s oldest university. In</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uz-weaponising-disciplinary-processes-to-intimidate-punish-union-leaders-teachers-union/\">UZ weaponising disciplinary processes to intimidate, punish union leaders— teachers’ union</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "10 Apr 2025"
        },
        {
            "title": "Loyal blood donors eligible for free transfusions for immediate family members – NBSZ",
            "url": "https://www.newzimbabwe.com/loyal-blood-donors-eligible-for-free-transfusions-for-immediate-family-members-nbsz/",
            "content": "By Staff Reporter\n\nINDIVIDUALSwho have donated blood at least ten times, with their most recent donation within the past year, can have their biological parents, children, or spouse receive free blood in times of medical need, the National Blood Services Zimbabwe (NBSZ) has announced.\n\nIn a statement Wednesday, NBSZ said it has a Blood Components Beneficiary Policy, which grants free blood transfusions to family members of regular donors who meet the criteria.\n\nWe would like to announce that NBSZ has a Blood Components Beneficiary Policy designed to ensure that our donors are adequately recognized and cared for. Under this policy, blood donors who have given blood ten times or more, with their last donation made within the past 12 months, are entitled to free blood for their biological parents, children, or spouse should they require a blood transfusion.\n\nNBSZ is committed to doing whatever it takes to ensure that blood donors are well-catered for, the statement reads.\n\nAlthough the government maintains that blood is always available free of charge to patients in public hospitals, the situation on the ground tells a different story.\n\nMany public hospitals, including Parirenyatwa, Zimbabwes largest referral hospital, do not consistently offer free blood transfusions.\n\nIn many instances, patients are simply told to purchase blood themselves, as it is often unavailable at the hospitals.\n\nNBSZ said that the costs associated with blood are not for the blood itself, but rather for the necessary processes involved in preparing it for safe use.\n\nIt is important to understand that once blood is donated, it does not go directly for transfusion. Instead, it undergoes rigorous testing for infections, blood grouping, separation into components, safe storage and then distribution. These processes require advanced equipment, skilled scientific personnel, specialized storage facilities and strict adherence to international safety standards.\n\nAs a non-profit organization, NBSZ strives to recover only the operational costs associated with these processes, while ensuring that blood products remain accessible and affordable to all individuals who require transfusion, NBSZ added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/09214516/blood-donor.jpg",
            "description": "<p>By Staff Reporter INDIVIDUALS who have donated blood at least ten times, with their most recent donation within the past year, can have their biological parents, children, or spouse receive free blood in times of medical need, the National Blood Services Zimbabwe (NBSZ) has announced. In a statement Wednesday, NBSZ said it has a Blood Components</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/loyal-blood-donors-eligible-for-free-transfusions-for-immediate-family-members-nbsz/\">Loyal blood donors eligible for free transfusions for immediate family members – NBSZ</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "10 Apr 2025"
        },
        {
            "title": "Tight policy deflation trend not sustainable – Industry",
            "url": "https://www.newzimbabwe.com/tight-policy-deflation-trend-not-sustainable-industry/",
            "content": "By Alois Vinga\n\nINFLATION decline hinged on the pursuit of a tight monetary policy stance is not sustainable in the long term due to its adverse effects on investment and economic growth, the Confederation of Zimbabwe Industries (CZI) has warned.\n\nSince February 2025, the month-on-month ZiG inflation rate fell to 0.5% in February, a sharp drop from the 10.5% recorded in January. The trajectory was sustained in March 2025 when the ZWG inflation declined to settle at-0,1%.\n\nWhile a fall in prices is generally desirable, deflation can also result in adverse consequences to the economy if it is sustained. It can drive down spending, investment and impede economic growth. Thus, it is advisable for the authorities to keep an eye on inflation so that sustained deflation would signal increasing liquidity into the economy, he said.\n\nThe industry lobby group said to some extent a month-on-month inflation rate of  0.1% indicates that the monetary authorities tight monetary policy stance is paying off.\n\nProducts that registered the lowest inflation included gas, which registered the lowest inflation rate of about -6%.\n\nAlso making it to the top five on the lowest inflation rates are electrical appliances for personal care(-4%), other services (-3%), books (-3%) and stationery (-3%).\n\nThe industry lobby group said US$ monthly declined to 0.1% in March 2025, representing a 0,1% drop from February 2025s rate of 0.2%, attributable to both US$ and ZiG month-on-month inflation rates decreased.\n\nThe US$ year-on-year inflation for the month of March declined to 15%, which was a 0.1 percentage point drop from 15.1% in February 2025. Although there are signs of declining inflation, having double-digit annual inflation (10% and above) is still considered high and distorts economic decisions, especially since it pertains to foreign currency, CZI added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/02115157/zig.webp",
            "description": "<p>By Alois Vinga INFLATION decline hinged on the pursuit of a tight monetary policy stance is not sustainable in the long term due to its adverse effects on investment and economic growth, the Confederation of Zimbabwe Industries (CZI) has warned. Since February 2025, the month-on-month ZiG inflation rate fell to 0.5% in February, a sharp</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tight-policy-deflation-trend-not-sustainable-industry/\">Tight policy deflation trend not sustainable – Industry  </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "10 Apr 2025"
        },
        {
            "title": "Musengezi in court, charged with assaulting vendor who disrupted his press conference",
            "url": "https://www.newzimbabwe.com/musengezi-in-court-charged-with-assaulting-vendor-who-disrupted-his-press-conference/",
            "content": "By Staff Reporter\n\nPresident Emmerson Mnangagwas challenger, Sybeth Musengezi appeared in court Wednesday, charged with assault following an altercation with an airtime vendor who disrupted his press conference at the Media Centre on Tuesday.\n\nMusengezi appeared before Harare Magistrate Ruth Moyo, who granted him US$100 bail.\n\nHis trial has been set for April 30.\n\nThe complainant Norest Taruberekera deposed an affidavit claiming that he was assaulted by Musengezi after chasing after his colleague, who took his airtime before fleeing to the second floor of Bothwell House where Musengezi was holding his press conference.\n\nTarubekera also said that instead of having a conversation with him, Musengezi directed his friends to capture the altercation on their camera.\n\nThe accused asked what I wanted and assaulted me with his hands on my face.\n\nI asked why he was attacking me, but he did not respond and told his colleagues to record me, he said.\n\nMusengezi was arrested and taken into custody Tuesday after two unidentified men, posing as vendors, violently disrupted his press conference.\n\nHe was about to begin addressing the media when the masked men stormed the venue and grabbed his speech.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/21165521/Musengezi-Sybeth.png",
            "description": "<p>By Staff Reporter President Emmerson Mnangagwa’s challenger, Sybeth Musengezi appeared in court Wednesday, charged with assault following an altercation with an airtime vendor who disrupted his press conference at the Media Centre on Tuesday. Musengezi appeared before Harare Magistrate Ruth Moyo, who granted him US$100 bail. His trial has been set for April 30. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/musengezi-in-court-charged-with-assaulting-vendor-who-disrupted-his-press-conference/\">Musengezi in court, charged with assaulting vendor who disrupted his press conference</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "10 Apr 2025"
        },
        {
            "title": "Zimbabwe issues dollar bonds to pay ex-farmers for land grabs",
            "url": "https://www.newzimbabwe.com/zimbabwe-issues-dollar-bonds-to-pay-ex-farmers-for-land-grabs/",
            "content": "Bloomberg\n\nZimbabwe issued treasury bonds worth $308 million and made small cash payments to White farmers who were dispossessed of their property 25 years ago under a state-backed land reform program.\n\nThe payments are the first under a so-called Global Compensation Deed signed in 2020 between the state and the former farm owners in which Zimbabwe committed to paying $3.5 billion for improvements done on the farmland.\n\nA Land Compensation Committee has approved compensation for 740 former farm owners, with the first 378 farmers paid 1% of the total compensation value of $311 million in late March as well as receiving Treasury bonds, Finance Minister Mthuli Ncube said.\n\nFollowing the cash payment the balance is being paid in US dollar denominated Treasury bonds with a 2% coupon and maturities of two to 10 years, Ncube said Wednesday in a statement. The bonds, issued last week, can be sold and held by other market players including pension funds, before their maturity date, he said.\n\nThe Compensation Steering Committees Chairperson and former Commercial Farmers Union President Andrew Pascoe confirmed receipt of the payments. The former farm owners received dollar payments on March 24, he added.\n\nThe payment is the latest attempt to resolve the decades-long dispute triggered by former Zimbabwean President Robert Mugabe encouraging veterans of the liberation war to evict farmers and their workers from their land in a bid to win support in a close-fought election in 2000. By 2002, at least seven White farmers had been killed alongside dozens of their workers, Human Rights Watch said.\n\nThat contributed to sanctions being imposed on Zimbabwean politicians by the US, UK and the European Union leading to the southern African nations protracted fallout with the West.\n\nZimbabwe, also has a history of not paying its debts. It has been locked out of international capital markets since 1999 after it defaulted on debt from lenders including the World Bank, Paris Club and African Development Bank.\n\nIn February, Zimbabwe began paying compensation to five nations namely Denmark, Germany, Netherlands, Switzerland and the former Yugoslavia and to 56 foreign nationals who despite having their farms protected under bilateral agreements had them seized. The compensation is a crucial step demanded by foreign creditors as the southern African nation seeks to restructure its debt. Zimbabwe owes 57% of its $21 billion debt pile to external creditors.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/27145047/Mthuli-Ncube.png",
            "description": "<p>Bloomberg Zimbabwe issued treasury bonds worth $308 million and made small cash payments to White farmers who were dispossessed of their property 25 years ago under a state-backed land reform program. The payments are the first under a so-called “Global Compensation Deed” signed in 2020 between the state and the former farm owners in which</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-issues-dollar-bonds-to-pay-ex-farmers-for-land-grabs/\">Zimbabwe issues dollar bonds to pay ex-farmers for land grabs</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "10 Apr 2025"
        },
        {
            "title": "Harare man locked up for using relatives’ properties as surety to secure US$1 million loan",
            "url": "https://www.newzimbabwe.com/harare-man-locked-up-for-using-relatives-properties-as-surety-to-secure-us1-million-loan/",
            "content": "By Staff Reporter\n\nA Harare man is in trouble with the law after he used his relatives upmarket properties as surety to secure a US$1 million loan from banks.\n\nTonderai Chikuni (55) of the Grange appeared before Harare regional magistrate Marehwanazvo Gofa facing fraud charges.\n\nHe was not asked to plead and was freed on US$500 bail.\n\nHe is expected back in court on April 21 for his routine remand.\n\nIt is the States case that sometime in February 2023, Chikuni and his accomplice Oscar Guti Njanji, who is still at large hatched a plan to defraud his aunt Florence Madake.\n\nHe allegedly approached Madake and misrepresented to her that he was employed as a business consultant by Njanji.\n\nIt is alleged that he deceived his aunt into believing that his accomplice had viable business operations at Freda Rebecca Mine, Bindura, which required some funding.\n\nThe accused person indicated to the complainant that they had made an application for a business loan at BancABC but it was not successful due to the unavailability of collateral security. It was then that the accused enticed the complainant into releasing the title deed for her house which is situated at stand 16, Giraffe Crescent, Borrowdale West, Harare measuring 2 339 square meters registered under deed of transfer 2772/97.\n\nThe accused person and his accomplice took the complainants title deed on the pretext that they were applying for a 90-day loan facility worth US$252,842.29. The accused further misrepresented to the complainant that they had the capacity to service the loan within 90 days and would return the title deed thereafter.\n\nActing on the misrepresentation, the complainant gave the accused person the title deed for her house which is valued at US$460 000. The accused person and his accomplice then successfully made a loan application at BancABC using the complainants title deed as collateral security.\n\nThe accused person failed to service the loan and the complainants title deeds remained at the bank. The complainant made follow ups but the accused person and his accomplice kept on giving empty promises.\n\nAfter a while, the complainant was apprised of BancABCs intentions to dispose of her house due to non-servicing of the loan by the accused and his accomplice. The complainant engaged the accused person and his accomplice but nothing materialised, the State alleges.\n\nThe court heard that he used that same method when he deceived his cousin, Farai Chikuni after getting the title deeds for stand 2462 Glen Lorne measuring 6,211 square meters registered under Deed of Grant number 8372/2008.\n\nIt is alleged that Farai gave in to his request and gave him the title deeds for his house, which is worth US$600,000.\n\nThe accused person and his accomplice then successfully made a loan application at NMB Bank Limited using the complainants deed of grant as collateral security.\n\nThe accused person failed to service the loan, and the complainants title deeds remained at the bank. The complainant made follow ups but the accused person and his accomplice kept on giving empty promises.\n\nAfter a while, the complainant was apprised of NMB Bank Limiteds intentions to dispose of his house due to non-servicing of the loan by the accused and his accomplice. The complainant engaged the accused person and his accomplice but nothing materialised, the State alleges further.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/05/30184728/Fraud.jpg",
            "description": "<p>By Staff Reporter A  Harare man is in trouble with the law after he used his relatives’ upmarket properties as surety to secure a US$1 million loan from banks. Tonderai Chikuni (55) of the Grange appeared before Harare regional magistrate Marehwanazvo Gofa facing fraud charges. He was not asked to plead and was freed on</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-man-locked-up-for-using-relatives-properties-as-surety-to-secure-us1-million-loan/\">Harare man locked up for using relatives’ properties as surety to secure US$1 million loan</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "10 Apr 2025"
        },
        {
            "title": "Unauthorized advertising of unapproved medicines by influencers attracts prosecution – MCAZ",
            "url": "https://www.newzimbabwe.com/unauthorized-advertising-of-unapproved-medicines-by-influencers-attracts-prosecution-mcaz/",
            "content": "By Staff Reporter\n\nThe Medicines Control Authority of Zimbabwe (MCAZ) has warned against the unauthorized advertising of unapproved medicines, particularly by social media influencers and celebrities.\n\nMCAZ has noted and observed this trend on platforms like Facebook, WhatsApp, and X (formerly Twitter), raising significant concerns for public health.\n\nIn a statement, the MCAZ, Director General, Richard Rukwata said such practices violate the Medicines and Allied Substances Control Act (Chapter 15:03), and it prohibits any person from advertising any medicine without prior written approval from the Authority.\n\nThis is in contravention of Section 40 of the Medicines and Allied Substances Control Act (Chapter 15:03) (hereinafter referred to as the Act) and Section 65 of the Medicines and Allied Substances Control (General) Regulations, 1991, (S.I. 150 of 1991) (hereinafter referred to as the Regulations). Section 40 of the Act prohibits the publication or distribution of false or misleading advertisements for medicines, stipulating that those requiring professional direction for use may only be advertised in approved medical journals or healthcare professionals.\n\nAdditionally, Section 65(1b) states that No person shall advertise any other medicine without the approval of the Authority in writing whilst Section 65(3) states that No person shall advertise any medicine to members of the public in terms calculated to lead to its use for the treatment of human beings for any of the conditions set out in the Seventh Schedule, said Rukwata.\n\nRukwata, outlined several ways in which the public can easily identify authorized advertisements by the MCAZ.\n\nMedicines that have been approved for use typically display a unique registration number, which is assigned after evaluation of their safety and efficacy. Members of the public can easily verify this registration number by checking the medicines register on the MCAZ website.\n\nBe cautious of advertisements making unrealistic claims, such as promises of instant results, 100% cure rates, or zero side effects, as these are often deceptive. Reliable advertisements should be informative, balanced, and up to date, with claims that can be substantiated.\n\nBe cautious of advertisements that make unsubstantiated claims of being better than other brands, as these claims are often unfounded and misleading. Prescription medicines should not be advertised for direct sale to the public. If an advertisement encourages buying a prescription medicine without consulting your medical practitioner, it is likely unapproved.\n\nIf one medicine claims to cure multiple diseases, from diabetes to cancer, it is likely a scam. Advertisements that use language intended to create fear or distress should be treated with caution. Advertisements for medicines in connection with any bonus offer or discount, he added.\n\nThe Authority, working with the Zimbabwe Republic Police, will take necessary measures, including prosecution, should anyone contravene these provisions. We urge members of the public, socialites, celebrities, and influencers to desist from advertising medicines without written approval from the MCAZ.\n\nAn advertisement, according to the Act in relation to any medicine, means any written, pictorial, visual, or other descriptive matter or verbal statement or reference (a) appearing in any newspaper or other publication; or (b) appearing on any television or cinematograph film; or (c) distributed to members of the public; or (d) brought to the notice of members of the public in any manner whatsoever, which is intended to promote the sale of that medicine; Contravention of the above provisions is an offence which may attract penalties in terms of both the Act and the Regulations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/09220910/rukwata.jpg",
            "description": "<p>By Staff Reporter The Medicines Control Authority of Zimbabwe (MCAZ) has warned against the unauthorized advertising of unapproved medicines, particularly by social media influencers and celebrities. MCAZ has noted and observed this trend on platforms like Facebook, WhatsApp, and X (formerly Twitter), raising significant concerns for public health. In a statement, the MCAZ, Director General,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/unauthorized-advertising-of-unapproved-medicines-by-influencers-attracts-prosecution-mcaz/\">Unauthorized advertising of unapproved medicines by influencers attracts prosecution – MCAZ </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "10 Apr 2025"
        },
        {
            "title": "Chiredzi man found in possession of ivory slapped with mandatory nine-year jail term",
            "url": "https://www.newzimbabwe.com/chiredzi-man-found-in-possession-of-ivory-slapped-with-mandatory-nine-year-jail-term/",
            "content": "By Staff Reporter\n\nA MAN from Chiredzi, Lowveld, in Masvingo province, has been sentenced to the mandatory maximum nine-year jail sentence after his conviction for unlawful possession of an elephant tusk.\n\nAccused person, Robert Lithlathla aged 58 was arraigned before the Chiredzi Magistrates Court facing charges of contravening the Parks and Wildlife Act.\n\nThe State case is that on March 25, 2025, game rangers from Gonarezhou National Park received information to the effect that Lithlathla was in possession of ivory.\n\nArmed with that intelligence, the rangers teamed up with members of the Zimbabwe Republic Police (ZRP) and proceeded to Davata Market, where accused person was found with the ivory stashed in a sack that was tied to his motorcycles carrier.\n\nThe law enforcement agents identified themselves before demanding to search the luggage. They conducted the search and recovered an unmarked elephant tusk weighing 3,5 kilogrammes and an Eland horn, both with a combined value of US$55,000.\n\nAccused person failed to produce a permit allowing him to be in possession of parts of the wildlife.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/05/16125356/Ivory.jpg",
            "description": "<p>By Staff Reporter A MAN from Chiredzi, Lowveld, in Masvingo province, has been sentenced to the mandatory maximum nine-year jail sentence after his conviction for unlawful possession of an elephant tusk. Accused person, Robert Lithlathla aged 58 was arraigned before the Chiredzi Magistrates Court facing charges of contravening the Parks and Wildlife Act. The State</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chiredzi-man-found-in-possession-of-ivory-slapped-with-mandatory-nine-year-jail-term/\">Chiredzi man found in possession of ivory slapped with mandatory nine-year jail term</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "10 Apr 2025"
        },
        {
            "title": "Bindura Nickel Corporation moves to engage creditors",
            "url": "https://www.newzimbabwe.com/bindura-nickel-corporation-moves-to-engage-creditors/",
            "content": "By Alois Vinga\n\nBINDURA Nickel Corporation (BNC) is set to engage creditors in a bid to map the way forward in easing hefty debt on its shoulders.\n\nThe Victoria Falls Stock Exchange (VFEX) last year suspended trading in miner BNC shares after a reconstruction order was issued against its subsidiary, Trojan Nickel Mine Limited (TNML).\n\nJustice, Legal and Parliamentary Affairs minister Ziyambi Ziyambi issued the reconstruction order in terms of section 4 of the Reconstruction of State-Indebted Insolvent Companies Act last week.\n\nThe order is issued if a state-indebted company cannot repay a credit made from public funds on time due to fraud, mismanagement, or other factors, or if the state is liable to make payments under a guarantee issued to the company.\n\nBNC incurred an operating loss before tax of US$24.2 million for the year ended March 31, 2023. As of March 31, 2023, the companys current liabilities exceeded its current assets by US$13.3 million.\n\nFollowing the Reconstruction Order, BNC is scheduled to meet its creditors and map the way forward on easing debt.\n\nNotice is hereby given to creditors and members of Trojan Nickel Mine Limited (TNML) and BNC together that the first statutory meetings of creditors and members of the Companies pursuant to Section 21 of the Reconstruction of State-Indebted Insolvent Companies Act [Chapter 24:27] the Reconstruction Act), shall be held on 23 April 2025 at Chapman Golf Club, Number 1, Henry Chapman Road, Eastlea, Harare, Zimbabwe, the company said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/09221727/Bindura-Nickel.jpeg",
            "description": "<p>By Alois Vinga BINDURA Nickel Corporation (BNC) is set to engage creditors in a bid to map the way forward in easing hefty debt on its shoulders. The Victoria Falls Stock Exchange (VFEX) last year suspended trading in miner BNC shares after a reconstruction order was issued against its subsidiary, Trojan Nickel Mine Limited (TNML).</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/bindura-nickel-corporation-moves-to-engage-creditors/\">Bindura Nickel Corporation moves to engage creditors</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "10 Apr 2025"
        }
    ]
}