{
    "news": [
        {
            "title": "‘Big Brother Mzansi’ contestant Kay B disqualified for alleged sexual harassment",
            "url": "https://www.newzimbabwe.com/big-brother-mzansi-contestant-kay-b-disqualified-for-alleged-sexual-harassment/",
            "content": "TshisaLive\n\nIn a shocking turn of events,Big Brother Mzansiseason 5 contestant Florence Kay B Maphirime has been disqualified due to alleged sexual harassment of other housemates.\n\nMzansi Magic said a thorough investigation was conducted and it was deemed necessary to remove Kay B from the show to ensure the safety and wellbeing of the other contestants.\n\nIn light of a conversation in theBig Brother Mzansihouse concerning a housemate (Beekay) who said he was physically violated by fellow housemate (Kay B), Big Brother investigated the matter as the safety of all housemates is of utmost importance.\n\nAfter careful consideration, taking into account the serious nature of the claim, Big Brother has decided that the housemate (Kay B) will be disqualified from the Big Brother house. Her behaviour has caused serious offence to fellow housemates.\n\nThis decision follows an educational session held with all the housemates on Sunday to raise awareness about gender-based violence.\n\nWe do not condone any acts of gender-based violence and will take corrective action.\n\nAs a result, voting for this weeks eviction has also been closed as Kay B was one of the contestants up for eviction.\n\nThis is to ensure fairness and adhere to voting procedures for remaining housemates.\n\nThe disqualification comes as Kay B was already facing scrutiny for her behaviour in the house. Before her removal, Kay B apologised to her fellow housemates for her touchy behaviour, saying she is a naturally flirtatious person.\n\nThis is not the first time Kay B has been at the centre of controversy in theBig Brother Mzansihouse. Last week, two of her housemates, Ash-ley Ogle and Bonni B, came under fire for making insensitive remarks about Kay Bs past experience as a rape victim. The two housemates were given strikes and punishment for their behaviour and Bonni B was evicted from the show on Sunday.\n\nKay B, a 23-year-old model and student from Bloemfontein, had initially been eager to showcase her personality and talents on national TV, competing for the prize of R2m.\n\nI am talkative and loud  tapestry woven from diverse experiences, aspirations and influences emerging as an individual woman shaped by triumphs and tribulations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/31062725/kay-b.webp",
            "description": "<p>TshisaLive In a shocking turn of events, Big Brother Mzansi season 5 contestant Florence “Kay B” Maphirime has been disqualified due to alleged sexual harassment of other housemates. Mzansi Magic said a thorough investigation was conducted and it was deemed necessary to remove Kay B from the show to ensure the safety and wellbeing of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/big-brother-mzansi-contestant-kay-b-disqualified-for-alleged-sexual-harassment/\">‘Big Brother Mzansi’ contestant Kay B disqualified for alleged sexual harassment</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:39",
            "date": "31 Jan 2025"
        },
        {
            "title": "Migrant workers in Canada exposed to ‘shocking abuse and discrimination,’ Amnesty says",
            "url": "https://www.newzimbabwe.com/migrant-workers-in-canada-exposed-to-shocking-abuse-and-discrimination-amnesty-says/",
            "content": "CNN\n\nMigrant workers in Canada have been exposed to shocking abuse and discrimination while working under the countrys Temporary Foreign Worker Program (TFWP), according to a new report by Amnesty International.\n\nIn thereportpublished Thursday, Amnesty criticized the structure of Canadas TFWP, which allows employers to hire migrant workers for primarily low-paid jobs across sectors including agriculture, food processing, construction, and hospitality.\n\nThe human rights organization said laborers were vulnerable to abuse through harmful provisions in the program, including closed work permits that tie workers to a single employer who controls both their migration status and labor conditions.\n\nAmnesty interviewed 44 migrant workers from 14 countries for the report, predominantly from what it termed the Global South, with most workers reporting unpaid wages and excessive hours. Some workers told Amnesty their contracts stipulated zero rest days.\n\nOne woman from Cameroon, Bndicte, told Amnesty she had suffered racist psychological and sexual abuse at the hands of her employer while working on a two-year closed work permit on a farm.\n\nAfter leaving the farm in July 2018, her employer canceled her work permit, leaving Bndicte with an irregular migration status. I did not expect to be a slave here, she told Amnesty.\n\nAnother worker told Amnesty he faced severe forms of control by his employer.\n\nMiguel, a Guatemalan migrant worker with a two-year visa under the TFWP, told Amnesty he was threatened and surveilled. He said his boss confiscated his passport and placed cameras in the container where he lived and the garage where he worked.\n\nThe abuse experienced by migrant workers in Canada is deeply troubling, especially for a country that claims to be a leader when it comes to protecting human rights, Erika Guevara-Rosas, senior director for research, advocacy, policy and campaigns at Amnesty International, said.\n\nAmnesty also said many workers reported living in inadequate housing conditions, with a few saying they did not have drinking water in their accommodation.\n\nAn official at Amnesty International Canada, Ketty Nivyabandi, called on Canadas leaders to implement reforms to bring the program in line with Canadas human rights obligations  and, ultimately, to respect the rights of workers.\n\nThe Canadian government told CNN it was aware of the Amnesty report.\n\nThe government of Canada takes the safety and dignity of temporary foreign workers very seriously and has been taking strong action to protect workers, said Nancy Caron, the spokesperson for Immigration, Refugees, and Citizenship Canada (IRCC).\n\nWhile in Canada, temporary foreign workers have the same employment standards, rights, and protections under federal, provincial, and territorial law as do Canadian citizens and permanent residents.\n\nShe added the government was continuously taking steps to strengthen its temporary foreign worker programs, including programs to help workers obtain private health insurance, a tip line to report wrongdoing, and open work permits to allow temporary foreign workers to change employers.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/31061912/gettyimages-1567046462.webp",
            "description": "<p>CNN Migrant workers in Canada have been exposed to “shocking abuse and discrimination” while working under the country’s Temporary Foreign Worker Program (TFWP), according to a new report by Amnesty International. In the report published Thursday, Amnesty criticized the structure of Canada’s TFWP, which allows employers to hire migrant workers for primarily low-paid jobs across sectors including</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/migrant-workers-in-canada-exposed-to-shocking-abuse-and-discrimination-amnesty-says/\">Migrant workers in Canada exposed to ‘shocking abuse and discrimination,’ Amnesty says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:39",
            "date": "31 Jan 2025"
        },
        {
            "title": "DRC conflict: Can Mnangagwa steer SADC through the storm?",
            "url": "https://www.newzimbabwe.com/drc-conflict-can-mnangagwa-steer-sadc-through-the-storm/",
            "content": "By Costa Nkomo\n\nAs Southern African leaders gather in Harare today to tackle the escalating conflict in the Democratic Republic of Congo, a critical question hangs in the air: is President Emmerson Mnangagwa the right captain to steer the regions response?\n\nMnangagwas leadership is coming under intense scrutiny as his own political party appears to be splitting.\n\nThe fault lines within Mnangagwas party, Zanu-PF, are deepening. Two factions, one staunchly backing him and the other rallying behind Vice President Constantino Chiwenga, are locked in a power struggle, a visible crack in the partys facade.\n\nThis internal strife spilled into the open this week during the burial of a national hero Justin Mupamhanga at the national shrine where factions clashed publicly. Despite Mnangagwas pledge to step down in 2028, his silence on those calling for him to extend his rule has only fueled doubt.\n\nThe DRC conflict itself is a tempest, and Mnangagwa finds himself in the thick of it, his hands seemingly tied by domestic turmoil. Whispers are turning into shouts: some of his own comrades are imploring him to leave office peacefully, failure to which he may go the Robert Mugabe way in November 2017.\n\nThe DRC conflict has already been worsened by public spats between South African President Cyril Ramaphosa and Rwandan President Paul Kagame.\n\nRamaphosas accusations of Rwandas support for M23 rebels met with Kagames vehement denial, have created a dangerous rift. South Africas loss of 13 soldiers in DRC has only heightened the tension. Kagame, in a display of fiery defiance, has even threatened to confront South Africa militarily if it chooses confrontation.\n\nRELATED:\n\nObert Masaraure, a human rights defender and president of the Amalgamated Rural Teachers Union of Zimbabwe (ARTUZ), is blunt in his observation.\n\nWhat is happening right now in Zanu PF is a clear testimony of Emmerson Mnangagwas failure to calm storms in his own party. His party is in turmoil as factions are gunning for each others head.\n\nHow then can he manage to lead the regions response to the DRC conflict? He does not have the capacity. Why is he failing to sit down with his comrades whom he went to war with and make peace? queried Masaraure.\n\nMasaraure further painted Mnangagwa as a man who creates problems but cannot solve them.\n\nHe is a man who creates problems but cannot solve the same. He created problems in Mozambique and he has created economic hardships and political conflict in the country. The man has many problems to deal with. The DRC conflict is too much for him. President Ramaphosa is the one who is now acting as if is the SADC chair, he said.\n\nAdvocate Fadzayi Mahere took to X Thursday, demanding that Information Permanent Secretary Nick Mangwana clarify Zimbabwes official stance on the escalating DRC conflict. She pointedly highlighted the divergent positions taken by South Africa, Rwanda, and even Kenya.\n\nWhose side are we on? she questioned, Or are we neutral? Or, worse, are we indifferent?\n\nMangwana did not respond to Mahere.\n\nHowever, Zanu-PF communications director, Farai Marapira, defended Mnangagwa, dismissing his critics as having put wool over their eyes and conveniently forgetting Zimbabwes history of conflict resolution.\n\nThey clearly have chosen to put wool over their eyes because they have conveniently forgotten the role Zimbabwe played in the late 1990s. Under the leadership of President Mnangagwa, Zimbabwe and SADC is more than equal to the task, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/26042227/mnangagwa-sadc.jpg",
            "description": "<p>By Costa Nkomo As Southern African leaders gather in Harare today to tackle the escalating conflict in the Democratic Republic of Congo, a critical question hangs in the air: is President Emmerson Mnangagwa the right captain to steer the region’s response? Mnangagwa’s leadership is coming under intense scrutiny as his own political party appears to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/drc-conflict-can-mnangagwa-steer-sadc-through-the-storm/\">DRC conflict: Can Mnangagwa steer SADC through the storm?</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:39",
            "date": "31 Jan 2025"
        },
        {
            "title": "ZIFA elections: Losing presidential candidates appeal to CAS, argue polls were not free and fair due to Chivayo’s ‘vote-buying’",
            "url": "https://www.newzimbabwe.com/zifa-elections-losing-presidential-candidates-appeal-to-cas-argue-polls-were-not-free-and-fair-due-to-chivayos-vote-buying/",
            "content": "By Sport Reporter\n\nPhilemon Machana and Twine Phiri who lost the ZIFA presidential race have appealed to the Court of Arbitration for Sport (CAS) citing that the elections were not free and fair due to third-party influence from controversial businessman Wicknell Chivayo and should be declared null and void.\n\nHours before the polls, Chivayo promised ZIFA councillors new cars and a US$10 million donation to the football body if they voted for Nqobile Magwizi. Magwizi later won the election, garnering 61 votes.\n\nA DEFINING MOMENT FOR ZIMBABWEAN FOOTBALLBarely 24 hours from now, Zimbabwes football fraternity will stand on the brink of a MOMENTOUS OCCASIONthe election of a new ZIFA President and Board. This is no ordinary event, as it marks a CRITICAL JUNCTURE in the journey of ourpic.twitter.com/eTBGOtaPUw\n\n sir_wicknell. (@wicknellchivayo)January 25, 2025\n\nMachana and Phiri through their lawyer Method Ndlovu argued that Saturdays polls are null and void as Chivayos vote buying disadvantaged other candidates as delegates knew they stood to benefit if Magwizi won.\n\nPhilemon Machana\n\nTwine Phiri\n\nMagwizi is cited as the first respondent and ZIFA as the second respondent.\n\nA third party, Wicknell Chivayo, who is aprominent businessman in Zimbabwe, issued a statement before the election that he preferred 1st respondent to be electedpresident of 2nd respondent.\n\nThe third party did not stop there. He further stated that he will gift 2nd respondent a sumof USD10 million (ten million United StatesDollars) if 1st respondent was elected itspresident.\n\nThis was a clear influence peddling by a third party, clearly meant to influence the voting delegates to prefer the 1st respondent ahead of each of the claimants.\n\nThis because the third party promised that2nd respondent, i.e. ZIFA will benefit a hugesum of money only if 1st respondent waselected president and that the voting\n\ndelegates stood to personally benefit fromhim as they would be given brand new motor vehicles if they voted 1st respondent as president of ZIFA, read part of the duos appeal to CAS.\n\nAs part of their evidence, the duo further argues that the disqualification of one of the electorates who was caught trying to take a photo of his vote on the ballot paper is enough evidence of how third-party influence played a role in Saturdays polls.\n\nGovernment wields power in a nation when its senior official issues a statement as to who should be voted for and become president of ZIFA; that invariably puts a lot of pressure on the voting delegates.\n\nNo wonder why one voting delegate wascaught taking a photo of his cast ballot while in the voting booth.\n\nThis was meant to show his handlers how he had voted. The probabilities are that he and his fellow voting delegates were underpressure to show third parties how they hadvoted.\n\nThat means they did not exercise their right to vote freely; in other words, they did not vote according to their conscience.\n\nThe election for president of ZIFA was not free and fair, further read their appeal.\n\nSaturdays election saw Magwizi recording the highest victory in a ZIFA presidential election.\n\nNone of the other contesting presidential candidates managed a double figure in their defeat, Phelimon Machana managed six votes while Twine Phiri had four.\n\nMarshall Gore another losing candidate managed only one vote while former football player Makwinji Soma-Phiri had zero.\n\nCommenting on Machana and Phiris appeal to CAS, a renowned football analyst said the applicants do not have solid evidence of how the third party influenced the election.\n\nIt seems to me that the applicants are challenging the integrity of the election, which is very difficult to prove.\n\nThe integrity impact approach entails that the petitioners must prove that irregularities occurred, and they substantially undermined the integrity of the election process, he said.\n\nMeanwhile, the new ZIFA executive is set to go through the handover process with the outgoing FIFA-imposed Normalization Committee on Friday in the capital.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/10051510/NQOBILE-Magwizi.jpg",
            "description": "<p>By Sport Reporter Philemon Machana and Twine Phiri who lost the ZIFA presidential race have appealed to the Court of Arbitration for Sport (CAS) citing that the elections were not free and fair due to third-party influence from controversial businessman Wicknell Chivayo and should be declared null and void. Hours before the polls, Chivayo promised</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zifa-elections-losing-presidential-candidates-appeal-to-cas-argue-polls-were-not-free-and-fair-due-to-chivayos-vote-buying/\">ZIFA elections: Losing presidential candidates appeal to CAS, argue polls were not free and fair due to Chivayo’s ‘vote-buying’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:39",
            "date": "31 Jan 2025"
        },
        {
            "title": "Nottinghamshire nurse raped junior colleague and tried to cover it up",
            "url": "https://www.newzimbabwe.com/nottinghamshire-nurse-raped-junior-colleague-and-tried-to-cover-it-up/",
            "content": "Nottinghamshire Live\n\nANottinghamshirenurse has been struck off after raping a junior colleague and getting a co-worker to give him a false alibi.Edmore Manjengwais currently serving a16-year prison sentencefor raping and sexually assaulting the woman at her home in September 2020.\n\nThe 51-year-old was also convicted of raping another woman at her home two months prior. Manjengwa, who was employed as a nurse by Nottinghamshire Healthcare Foundation Trust (NHFT), was banned from the profession following a Nursing and Midwifery Council (NMC) hearing on Tuesday, January 27.\n\nNottinghamshire Police first investigated Manjengwa in December 2020 over an allegation of rape and sexual assault but decided to take no further action on that occasion. A second allegation of rape, this time in relation to a junior colleague, was made in September 2021 and Manjengwa wascharged with the offence the following March.\n\nAs a result the first allegation was reinvestigated and he was convicted of two counts of rape and sexual assault, as well as trying to pervert the course of justice, at Nottingham Crown Court on September 14, 2023.\n\nThe following month he was sentenced to 16 years in prison and placed on the sex offenders register for life. The NMC hearing was told Manjengwa raped a woman at her home in July 2020, before raping and sexually assaulting a colleague at her home less than two months later. He then got a colleague to provide him a false alibi.\n\nNHFT said he was suspended immediately after the first allegations were made, and was dismissed four months after being charged. Presenting the case, Grace Khaile saidManjengwa had shown a lack of remorse for his actions. You were someone who they trusted as an NHS professional, she said.\n\nYour lack of insight and remorse, and the profound unacceptability of your behaviour, are indicative of deep-seated attitudinal problems.The hearing was told Manjengwa, who is being held at HMP Whatton, disagreed with the conviction and was in the process of trying to lodge an appeal.\n\nFinding in favour of a striking off order, the hearing panel said: Your behaviour has breached fundamental tenets of the nursing profession and therefore brought its reputation into disrepute.\n\n[We] considered that this order was necessary to mark the importance of maintaining public confidence in the profession, and to send to the public and the profession a clear message about the standard of behaviour required of a registered nurse.\n\nDiane Hull, executive director of nursing at NHFT, said: We take any allegations against staff very seriously. As soon as we were made aware of the allegations against this individual, we immediately suspended them pending investigation, informed the police and referred them to the NMC.\n\nWhen we were made aware of a further allegation, we again notified the NMC. I can confirm that we dismissed this person from employment in July 2022.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/30165446/manjengwa-rape.webp",
            "description": "<p>Nottinghamshire Live A Nottinghamshire nurse has been struck off after raping a junior colleague and getting a co-worker to give him a false alibi. Edmore Manjengwa is currently serving a 16-year prison sentence for raping and sexually assaulting the woman at her home in September 2020. The 51-year-old was also convicted of raping another woman at her home two months prior.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nottinghamshire-nurse-raped-junior-colleague-and-tried-to-cover-it-up/\">Nottinghamshire nurse raped junior colleague and tried to cover it up</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:39",
            "date": "31 Jan 2025"
        },
        {
            "title": "Mafume running Harare City Council like it’s his household – top official accuses Mayor of tyranny, nepotism",
            "url": "https://www.newzimbabwe.com/mafume-running-harare-city-council-like-its-his-household-top-official-accuses-mayor-of-tyranny-nepotism/",
            "content": "By Darlington Gatsi\n\nHARARE Mayor Jacob Mafume is embroiled in nepotism and authoritarian rule at Town House, a top council official has told the Harare Commission of Inquiry.\n\nThe Commission is probing the operationsof Harare City Council from 2017 till date.\n\nExecutive Assistant Town Clerk, Mathew Marara, told the Commission how rife nepotism is at the City Council, implicating several top officials.\n\nMafume was accused by Marara of appointing Lovemore Chinoputsa to the position of Research and Protocol Officer without adhering to recruitment processes.\n\nMarara described a chaotic and lawless environment at Town House, with Mafume at the centre of the recruitment of council workers without adhering to proper procedures.\n\nSpecifically for the Mayor, when the Mayor occupied his office there was a Mayors driver, who had been there for years but the Mayor was not happy. I do not know the reason with that driver and he brought in a certain youngster to be his driver.\n\nWe were pushed to second him to the Mayors office when the incumbent was still in office. Interestingly the one who came in did not even have the competence to drive a manual vehicle. He was competent in automatic vehicles, said Marara.\n\nRELATED:\n\nMafume is accused of improperly suspending a council official, Samson Madzokere, who despite being absent from the City Council continues to receive a salary.\n\nNo one at the council knows the preference of the Mayor with regards to the ERP that he wants he has called us to many meetings forcing us to take that particular company to do ERP and there are minutes and that is why Samson Madzokere is at home because of ERP not because he answered to a newspaper article, he said.\n\nLast year, Mafume suspended Town Clerk Hosiah Chisango with the lattergetting wind of this through social media and even rocked up at Town House reporting for duty.\n\nMarara said there is bad blood between Chisango and Mafume which has led to numerous problems at the HCC.\n\nThere is a direct interface between the Town Clerk and the Mayor. I talked to both of them, Chisango and the Mayor. I said they needed to sit down because of the disharmony that is between them because there was friction and the disharmony was affecting the Council as a whole.\n\nThe problem is unlike the other Mayors like Mayor Masunda who could come to work once a week, the current one 0800 hours is in office and at the leaves end of the day but he is getting an allowance from government of US$95 as a Mayor. It tells you a big story, said Marara.\n\nWhen he recently made his first appearance before the Commission, Mafume denied interfering in the work of the executive at the Town House.\n\nI meet a lot of people. I meet individual Councillors and committees. Even in the Act, if a Committee is in session and I the Mayor feel that I need to come into that Committee, I am allowed to go into that Committee, said Mafume.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/18055321/Mafume-Mayor.jpeg",
            "description": "<p>By Darlington Gatsi HARARE Mayor Jacob Mafume is embroiled in nepotism and authoritarian rule at Town House, a top council official has told the Harare Commission of Inquiry. The Commission is probing the operations of Harare City Council from 2017 till date. Executive Assistant Town Clerk, Mathew Marara, told the Commission how rife nepotism is at</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mafume-running-harare-city-council-like-its-his-household-top-official-accuses-mayor-of-tyranny-nepotism/\">Mafume running Harare City Council like it’s his household – top official accuses Mayor of tyranny, nepotism</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:39",
            "date": "31 Jan 2025"
        },
        {
            "title": "Khaya Cement to meet creditors to map way forward after being placed under  corporate rescue",
            "url": "https://www.newzimbabwe.com/khaya-cement-to-meet-creditors-to-map-way-forward-after-being-placed-under-corporate-rescue/",
            "content": "By Alois Vinga\n\nKHAYAH Cement Limited (KCL) has scheduled a meeting with its creditors to map the way forward following the recent placement of the firm under corporate rescue.\n\nThis follows the decision by the countrys second-largest cement producer to adopt a resolution to be placed under corporate rescue in terms of the Insolvency Act [Chapter 6:07] which took effect on December 30 2024.\n\nA corporate rescue provides a company with an opportunity to restructure its affairs and continue on a solvent business. A corporate rescue shields the company from liquidation and safeguards stakeholders interests.\n\nIn 2022, Fossil Mine acquired a 76,45% stake in the then Lafarge Cement Zimbabwe Limited from Associated International Cement Limited, a member of the Holcim Group before rebranding the Lafarge Cement Zimbabwe Limited to Khayah.\n\nRELATED:Legal Discussions with Vengai Madzima: Corporate Rescue in Zimbabwe\n\nThe United States Office of Foreign Assets Control (OFAC) swiftly moved in and designated Fossil Agro, Fossil Contracting and Obey Chimuka and crippled the new shareholders plans, forcing Khaya to re-strategise.\n\nThis week, the corporate rescue practitioner, Bulisa Mbano of Grant Thornton, said during the corporate rescue proceedings no legal proceeding, including enforcement action, against the Company, or in relation to any property belonging to the Company, or lawfully in its possession, may commence or proceeded in any form without the authority of the Corporate Rescue Practitioner.\n\nHe invited all creditors to attend a meeting scheduled to take place later next month and participate in mapping the way forward.\n\nFollowing the Master of High Courts approval to extend the notice period for notifying affected persons to 31stof January 2025, the first meeting of creditors and members of the company will now be held on the 19th of February 2025 at 0900hrs at Chapman Golf Club, 6 Smit Cresent, Harare, Zimbabwe.\n\nThis meeting is for proof of claims, an overview of corporate rescue proceedings, a statement by the Master of the High Court about reasonable prospects of rescuing the company, and appointment of a committee of creditors, he said.\n\nThose owed money by the company were required to complete an affidavit for Proof of Claim Form and complete these forms in duplicate, attach all supporting documents, and lodge them with the Master of the High Court, at the Masters office.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/30170448/khaya.jpeg",
            "description": "<p>By Alois Vinga KHAYAH Cement Limited (KCL) has scheduled a meeting with its creditors to map the way forward following the recent placement of the firm under corporate rescue. This follows the decision by the country’s second-largest cement producer to adopt a resolution to be placed under corporate rescue in terms of the Insolvency Act</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/khaya-cement-to-meet-creditors-to-map-way-forward-after-being-placed-under-corporate-rescue/\">Khaya Cement to meet creditors to map way forward after being placed under  corporate rescue</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:39",
            "date": "31 Jan 2025"
        },
        {
            "title": "In tune with the mind: Decluttering for your mental health",
            "url": "https://www.newzimbabwe.com/in-tune-with-the-mind-decluttering-for-mental-health/",
            "content": "By Nqoba M Sibenke\n\nResearch has shown that physical clutter harms our mental wellbeing. A disorganized environment, and chaotic affects cognition, and decision-making and even impact our mood1. Clutter has also been associated with mental health issues such as depression, anxiety and stress. As such, decluttering has been proven to have a positive influence on our mental health, reducing stress and negative emotions, boosting self-confidence and esteem, and enhancing heightened motivation and productivity2.\n\nAnd so the decluttering process can start in our physical spaces. We have lots of stuff that we are keeping that we need to get rid of  in our wardrobes piles of clothes that we are no longer in need of yet we could give away to those in need. Ive come across old pots in my mothers cupboards and I am sure many are still holding on to pots and plates that are no longer in use. Maybe if we clear up our cupboards and create more space it will also help us to clear up our minds. Theres a lot that we are holding onto; old carpets, and old furniture that is breaking down, our spaces are so congested and so is our mind space.\n\nIn the physical space, clutter takes up more space and leaves no space for new furniture or property. Similarly, mental clutter congests the mind and prevents us from new experiences. For some of us, trauma is the clutter that we are still holding onto. It might be childhood trauma or recent trauma. Trauma brings with it anxiety, fear, anger, mood swings and all other mental baggage. Imagine moving around with such a load of negativity.\n\nTrauma repels positive relationships and experiences, it deprives us of enjoying life as we should. And this is why we should offload trauma before the year ends. One of the best ways of offloading trauma is therapy. Therapy will help us to develop coping mechanisms to deal with the triggers. Therapy also helps us to manage our emotions and be able to manage our situations.\n\nAs part of decluttering, we need to deal with toxic relationships and partnerships. Toxic relationships are not just limited to romantic relationships but also extend to friendships. By definition a toxic relationship is a relationship characterized by harmful, damaging, and destructive patterns of behaviour. It can be romantic, familial, friendship, or professional. Such relationships exhibit abusive and manipulative characteristics, lack of respect and overstepping boundaries, emotional abuse, manipulation, emotional unavailability, and a train of unpleasant experiences. Toxic relationships leave us feeling wretched and useless. They reduce our self-image and self-esteem and lead to conditions like depression, anxiety, trust issues and lack of confidence. We need to surround ourselves with positive relationships and support systems, people who appreciate us and value us, and people who bring out the best in us. Moving away is a choice that we can make. Its time to get up, dust ourselves and start a fresh new journey.\n\nWe have feelings that we have bottled up for so long, feelings that make us angry, bitter and irritable. We also ruminate, yes I said ruminate. Rumination is the process of re-chewing food, in mental health spaces it refers to repetitive negative thinking patterns where we fish out past regrets, disappointments, thoughts, and experiences and we re-live them. This compromises not only our mental but also our physical well-being. It also affects our relationships with the people around us as well as intimate relationships. People who ruminate often suffer from anxiety and stress. It is time to let go. Journaling is an excellent way of expressing our feelings. Write about it. If there is a way of saying it out, this is the chance. Find someone to talk to and share your frustrations and negative experiences. This will help you to release the pressure.\n\nIt has always been said that we are our own enemies. Negative self-talk is one way that we sabotage ourselves. We focus on our weaknesses and we tell ourselves that we are not good enough. Sometimes we compare ourselves with the next person and fail to see our real value. This creates clutter in our minds and we need to remove it. We have to affirm ourselves and practice self-compassion. This will go a long way in promoting our mental health.\n\nThere are habits that we have developed which are unhealthy, unproductive and destructive. It is time for us to deal with these habits. Procrastination, lack of punctuality, laziness, self-sabotaging, and indecision, are all things that we have to offload if we desire a happy new year.\n\nHere are steps that can help us in the process of decluttering;\n\nIt is not too late to make important changes in our lives. Prioritising our mental health will go a long way in 2025.\n\nNqoba Sibenke is registered with AHPCZ as an intern Counselling Psychologist and can be reached atnqoba.sibenke@icloud.com\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/30172653/DeclutterYourHouse.jpg",
            "description": "<p>By Nqoba M Sibenke Research has shown that physical clutter harms our mental wellbeing. A disorganized environment, and chaotic affects cognition, and decision-making and even impact our mood 1.  Clutter has also been associated with mental health issues such as depression, anxiety and stress. As such, decluttering has been proven to have a positive influence</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-tune-with-the-mind-decluttering-for-mental-health/\">In tune with the mind: Decluttering for your mental health</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:39",
            "date": "31 Jan 2025"
        },
        {
            "title": "Kagame says South Africa not equipped to mediate in DRC, warns of confrontation",
            "url": "https://www.newzimbabwe.com/kagame-says-south-africa-not-equipped-to-mediate-in-drc-warns-of-confrontation/",
            "content": "The Mail and Guardian\n\nRwanda President Paul Kagame issued a stark warning to South Africa late on Wednesday night, accusing President Cyril Ramaphosa and his government of distorting facts about the ongoing conflict in the eastern Democratic Republic of the Congo (DRC) and suggesting that Rwanda is prepared for confrontation if necessary.\n\nWhat has been said about [the conversations I had with Ramaphosa this week] in the media by South African officials and President Ramaphosa himself contains a lot of distortion, deliberate attacks, and even lies.\n\nIf words can change so much from a conversation to a public statement, it says a lot about how these very important issues are being managed, Kagame said in a post on his X account, in reply to Ramaphosas posted statement.\n\nRamaphosas statement followed the death of 13 South African soldiers deployed as part of the Southern African Development Community Mission in the Democratic Republic of Congo (SAMIDRC).\n\nThe death of the South African soldiers has intensified political and military scrutiny in Pretoria, forcing the government to justify its intervention in the decades-long conflict while navigating increasingly strained ties with Rwanda.\n\nSouth African officials have blamed the escalating violence on the M23 rebel group and the Rwandan Defence Force.\n\nInternational relations minister Ronald Lamola has said that South Africa is engaging with the African Union Peace and Security Council and the United Nations Security Council to push for an immediate ceasefire.\n\nIn his post, Kagame dismissed South Africas involvement in the peacekeeping, saying that SAMIDRC was not a peacekeeping mission but a belligerent force supporting the Congolese government.\n\nHe accused SAMIDRC of working alongside the Forces Dmocratiques de Libration du Rwanda (FDLR), a militia with historical ties to perpetrators of the 1994 Rwandan genocide.\n\nFDLR targeted Rwanda, Kagame said, while also threatening to take the war to Rwanda itself.\n\nHe accused SAMIDRC of replacing the East African Community Regional Force, which he characterised as the only legitimate peacekeeping operation in the region.\n\nPresident Ramaphosa has never given a warning of any kind, unless it was delivered in his local language which I do not understand, Kagame said in his statement, addressing the notion that he had been cautioned by his South African counterpart.\n\nHe claimed instead that Ramaphosa had requested logistical assistance to ensure that South African troops had electricity, food, and water, which Rwanda would help facilitate.\n\nKagame said Ramaphosa had personally acknowledged that M23 was not responsible for the deaths of South African soldiers, but rather the Armed Forces of the DRC (FARDC).\n\nIf South Africa wants to contribute to peaceful solutions, that is well and good, but South Africa is in no position to take on the role of a peacemaker or mediator. And if South Africa prefers confrontation, Rwanda will deal with the matter in that context any day.\n\nEarlier, Ramaphosa had said that the fighting was the result of an escalation by the rebel group M23 and Rwanda Defence Force militia engaging the Armed Forces of the DRC and attacking peacekeepers from the SADC Mission.\n\nHe described the security situation as tense, volatile, and unpredictable.\n\nHe said that full support was being provided to those injured in the fighting, as well as to the families of the slain South African soldiers.\n\nRamaphosa said that South Africas military presence in the DRC was part of a regional and international peacekeeping effort.\n\nSouth Africas military presence in the eastern DRC is not a declaration of war against any country or state, he said. The SAMIDRC was there to protect civilians and uphold stability in the war-torn region.\n\nHe called on all parties to honour peace agreements, including the Luanda Process, and to respect the DRCs territorial integrity. He also welcomed the recent United Nations Security Council resolution urging an end to hostilities and the withdrawal of foreign forces from Congolese territory.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/07/02030105/Paul-Kagame.jpg",
            "description": "<p>The Mail and Guardian Rwanda President Paul Kagame issued a stark warning to South Africa late on Wednesday night, accusing President Cyril Ramaphosa and his government of distorting facts about the ongoing conflict in the eastern Democratic Republic of the Congo (DRC) and suggesting that Rwanda is prepared for confrontation if necessary. “What has been</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kagame-says-south-africa-not-equipped-to-mediate-in-drc-warns-of-confrontation/\">Kagame says South Africa not equipped to mediate in DRC, warns of confrontation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:39",
            "date": "31 Jan 2025"
        },
        {
            "title": "Take seriously your responsibility for the health of your people – US tells Zimbabwe as Trump halts foreign aid programs",
            "url": "https://www.newzimbabwe.com/take-seriously-your-responsibility-for-the-health-of-your-people-us-tells-zimbabwe-as-trump-halts-foreign-aid-programs/",
            "content": "By Alois Vinga\n\nTHE United States has told Zimbabwe to take responsibility for its peoples health and urgently take over health programs it immensely contributed towards over the past years.\n\nThe U.S. government has since the countrys independence provided over US$5 billion in humanitarian and development assistance to the Zimbabwean people, including more than $1 billion in the past three years alone.\n\nU.S. has so far remained the largest provider of development and humanitarian assistance, including through the U.S. Presidents Emergency Plan for AIDS Relief (PEPFAR), the Presidents Malaria Initiative (PMI), and the Feed the Future hunger and food security initiative.\n\nDonald Trump administrations America First Agenda suspended donor support across the globe, the U.S. Agency for International Development (USAID) was currently working towards strengthening its programs on health, development, and cultural exchange among others.\n\nIn a statement against a background of ongoing developments, the US Embassy in Zimbabwe said consistent with Trumps Executive Order on Reevaluating and Realigning United States Foreign Aid, Secretary Rubio has paused all U.S. foreign assistance funded by or through the State Department and USAID for review.\n\nThe mission said Rubio is initiating a review of all foreign assistance programs to ensure they are efficient and consistent with U.S. foreign policy under the America First agenda.\n\nAt this moment, in order to do a thorough review, all programs and grants without a waiver approved by the Secretary of State using foreign assistance funding are paused. It is time for Zimbabwe to take seriously its responsibility for the health of its people.\n\nFor HIV, Zimbabwe has hit the 95/95/95 targets. They urgently need to be focused on buying ART and getting nurses in clinics. They can do this, the US mission said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/15215508/Tremont-Photo-scaled.jpg",
            "description": "<p>By Alois Vinga THE United States has told Zimbabwe to take responsibility for its people’s health and urgently take over health programs it immensely contributed towards over the past years. The U.S. government has since the country’s independence provided over US$5 billion in humanitarian and development assistance to the Zimbabwean people, including more than $1</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/take-seriously-your-responsibility-for-the-health-of-your-people-us-tells-zimbabwe-as-trump-halts-foreign-aid-programs/\">Take seriously your responsibility for the health of your people – US tells Zimbabwe as Trump halts foreign aid programs</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:39",
            "date": "31 Jan 2025"
        }
    ]
}