{
    "news": [
        {
            "title": "Wicknell Chivayo flaunts his wealth again, offers veteran broadcaster 2025 Land Cruiser, US$100,000 cash",
            "url": "https://www.newzimbabwe.com/wicknell-chivayo-flaunts-his-wealth-again-offers-veteran-broadcaster-2025-land-cruiser-us100000-cash/",
            "content": "By Staff Reporter\n\nWicknell Chivayo\n\nWICKNELL Chivayo, a figure often embroiled in controversy and dubbed Zimbabwes tenderpreneur, has once more made headlines with his latest act of largesse.\n\nThis Thursday, the businessman presented veteran Zimbabwe Broadcasting Corporation (ZBC) journalist Reuben Barwe with a brand-new 2025 Toyota Land Cruiser VXR LX 300 Series, accompanied by a hefty US$100,000 in cash.\n\nChivayo, whose sources of income have come under scrutiny, appears to have a price for anyone in the country at the moment.\n\nCritics have questioned why the businessmans heart is not moved by Zimbabwes crumbling public healthcare system, where many expect him to seed more resources to save lives.\n\nIn response, Chivayo asserted that he does as he pleases with his own money, and no one should dictate how he spends it.\n\nOn Thursday morning, Chivayo took to X (formerly Twitter) to announce his generosity towards Barwe, who has dedicated over 30 years to ZBC.\n\nReuben Barwe\n\nIn recognition of the decades of your professional and loyal dedication to the national broadcaster and in honour of your patriotism, your excellence and resolute service as one of Zimbabwes finest journalists and news reporters, a big congratulations to you Mr Reuben Barwe.Please go and see Farai at FARAMATSI Motors, Club Chambers Showroom, corner 3rd Street and Nelson Mandela Avenue  your brand new 2025 Toyota Land Cruiser VXR LX 300 series is ready for collection and fully paid for, Chivayo wrote on X.Alongside the vehicle, Chivayo also gifted Barwe US$100,000 in cash, describing it as a token to help him stay afloat  a pocket money gesture in the rough waters of Zimbabwes economic climate.To keep you afloat, a small token of US$100,000 in cash pocket money is also ready for collection from my lawyer Mr Sikhumbuzo Mpofu at Munangati and Associates at your earliest convenience, he added.President Emmerson Mnangagwa was once asked to clarify Chivayos activities but chose instead to describe the businessman as a genuine philanthropist, asserting that he could not dictate how Chivayo utilises his wealth.However, earlier this year, without mentioning Chivayo by name, Vice President Constantino Chiwenga described certain individuals as zviganandaa Shona term meaning people who loot State resources shamelessly and then retreat into the shadows.\n\nIn recognition of the decades of your professional and loyal dedication to the national broadcaster and in honour of your patriotism, your excellence and resolute service as one of Zimbabwes finest journalists and news reporters, a big congratulations to you Mr Reuben Barwe.\n\nPlease go and see Farai at FARAMATSI Motors, Club Chambers Showroom, corner 3rd Street and Nelson Mandela Avenue  your brand new 2025 Toyota Land Cruiser VXR LX 300 series is ready for collection and fully paid for, Chivayo wrote on X.\n\nAlongside the vehicle, Chivayo also gifted Barwe US$100,000 in cash, describing it as a token to help him stay afloat  a pocket money gesture in the rough waters of Zimbabwes economic climate.\n\nTo keep you afloat, a small token of US$100,000 in cash pocket money is also ready for collection from my lawyer Mr Sikhumbuzo Mpofu at Munangati and Associates at your earliest convenience, he added.\n\nPresident Emmerson Mnangagwa was once asked to clarify Chivayos activities but chose instead to describe the businessman as a genuine philanthropist, asserting that he could not dictate how Chivayo utilises his wealth.\n\nHowever, earlier this year, without mentioning Chivayo by name, Vice President Constantino Chiwenga described certain individuals as zviganandaa Shona term meaning people who loot State resources shamelessly and then retreat into the shadows.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/22170835/Gridx4uWkAA1cPR.jpeg",
            "description": "<p>By Staff Reporter WICKNELL Chivayo, a figure often embroiled in controversy and dubbed Zimbabwe’s “tenderpreneur,” has once more made headlines with his latest act of largesse. This Thursday, the businessman presented veteran Zimbabwe Broadcasting Corporation (ZBC) journalist Reuben Barwe with a brand-new 2025 Toyota Land Cruiser VXR LX 300 Series, accompanied by a hefty US$100,000</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/wicknell-chivayo-flaunts-his-wealth-again-offers-veteran-broadcaster-2025-land-cruiser-us100000-cash/\">Wicknell Chivayo flaunts his wealth again, offers veteran broadcaster 2025 Land Cruiser, US$100,000 cash </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:40",
            "date": "22 May 2025"
        },
        {
            "title": "US singer Chris Brown granted $6.7 million bail for world tour by UK court",
            "url": "https://www.newzimbabwe.com/us-singer-chris-brown-granted-6-7-million-bail-for-world-tour-by-uk-court/",
            "content": "U.S. singer Chris Brown was granted bail by a London court on Wednesday over a charge of serious assault after promising to pay a 5 million-pound ($6.7 million) security fee, clearing the way for his world tour to begin next month.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/22052415/chris-brown.jpg",
            "description": "<p>Reuters U.S. singer Chris Brown was granted bail by a London court on Wednesday over a charge of serious assault after promising to pay a 5 million-pound ($6.7 million) security fee, clearing the way for his world tour to begin next month. Brown has been charged with inflicting grievous bodily harm in what prosecutors said was an</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-singer-chris-brown-granted-6-7-million-bail-for-world-tour-by-uk-court/\">US singer Chris Brown granted $6.7 million bail for world tour by UK court</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:40",
            "date": "22 May 2025"
        },
        {
            "title": "‘We won’t bow to imperialism’: Malema defends EFF stance after Trump plays ‘Kill the Boer’ clip",
            "url": "https://www.newzimbabwe.com/we-wont-bow-to-imperialism-malema-defends-eff-stance-after-trump-plays-kill-the-boer-clip/",
            "content": "IOL\n\nEconomic Freedom Fighters (EFF) leader Julius Malema has dismissed the high-level meeting between Presidents Cyril Ramaphosa and Donald Trump at the White House, describing it as a group of older men meeting to gossip about me.\n\nThis remark comes after Trump paused the meeting on Wednesday to show a video montage of Malema chanting Kill the Boer, subsequently questioning why the EFF leader had not been arrested for using the controversial liberation-era slogan.\n\nIn response, Malema maintained that there is no credible intelligence or evidence to support the claim of a white genocide in South Africa. He also reiterated the EFFs firm stance on land reform.\n\nWe will not agree to compromise our political principles on land expropriation without compensation for political expediency, he said on X (formerly Twitter).\n\nIn a statement, the EFF condemned the meeting and said they never bow and succumb to imperialism.\n\nThe EFF is proud that its legislative and political agenda, led by the President and Commander in Chief Julius Malema has shaken the corridors of imperialism in Washington\n\nAs a result, the EFF is concerned by this call that something must be done to stop the EFF President from chanting a liberation heritage song, the EFF said.\n\nThe red berets said it would continue to follow the developments in Washington.\n\nPlay Video\n\nMeanwhile, the party has reiterated that they will oppose any compromising of our laws to allow Starlink to operate in South Africa.\n\nWe will oppose any reversal of transformative legislation, including that which will allow for expropriation of land, it said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/22051912/Screenshot-2025-05-22-at-06.18.33.png",
            "description": "<p>IOL Economic Freedom Fighters (EFF) leader Julius Malema has dismissed the high-level meeting between Presidents Cyril Ramaphosa and Donald Trump at the White House, describing it as “a group of older men meeting to gossip about me.” This remark comes after Trump paused the meeting on Wednesday to show a video montage of Malema chanting</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/we-wont-bow-to-imperialism-malema-defends-eff-stance-after-trump-plays-kill-the-boer-clip/\">‘We won’t bow to imperialism’: Malema defends EFF stance after Trump plays ‘Kill the Boer’ clip</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:40",
            "date": "22 May 2025"
        },
        {
            "title": "‘Rise of ‘blank’ Tagwirei to presidency a disaster that should be stopped’ – Biti",
            "url": "https://www.newzimbabwe.com/rise-of-blank-tagwirei-to-presidency-a-disaster-that-should-be-stopped-biti/",
            "content": "By Staff Reporter\n\nThe potential rise of ZANU-PF benefactor Kudakwashe Tagwirei to the presidency could have dire consequences for Zimbabwe, former opposition MP Tendai Biti has said.\n\nBiti has criticised Tagwirei, who has wormed himself into the ruling party after being nominated for the Central Committee by ZANU-PFs Harare Province.\n\nFormer ZANU-PF member and war veteran Blessed Geza claims that Tagwireis promotion to the Central Committee is a stepping stone to the presidency, positioning him to succeed President Emmerson Mnangagwa.\n\nSpeaking in a recent online discussion, Biti warned that Tagwireis ascent would undermine the countrys reform efforts:\n\nThe next president could be Kudakwashe Tagwirei, and that would be a total disaster. The rise of this blank, totally vacuous comrado eliteso proximate to the seat of powerspells trouble for Zimbabwe, said Biti.\n\nFormer opposition MP Tendai Biti\n\nTagwirei, through his proxies, has secured lucrative government contracts, including a multimillion-dollar deal to construct the Mbudzi Interchange flyover.\n\nHis business empire has expanded into mining, and he holds a near-monopoly in Zimbabwes fuel sector.\n\nAdditionally, he oversees the controversial Command Agriculture programme and chairs the Land Tenure Implementation Committee.\n\nHis company, Sakunda Holdings, was implicated in the misappropriation of $3 billion from the Ministry of Agriculture between 2017 and 2018.\n\nThe United States of America sanctioned Tagwirei for allegedly enabling corruption among senior government officials.\n\nThough Tagwirei has remained silent, his name continues to circulate as a potential successor to Mnangagwa amid ZANU-PFs internal factional battles.\n\nBiti further argued that the decline of liberation-era war veterans has created a vacuum, allowing opportunistic figures like Tagwireiderisively termed zvigananda (parasites)to exploit their proximity to power for political gain:\n\nThe vacuum left by the departure of the liberation generation is being filled by parasitic comrades with no social base, no shame, and no restraintindividuals who conflate themselves with the state. Some are being fast-tracked to the presidium, said Biti.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/03/17054811/Kuda-Tagwirei.jpg",
            "description": "<p>By Staff Reporter The potential rise of ZANU-PF benefactor Kudakwashe Tagwirei to the presidency could have dire consequences for Zimbabwe, former opposition MP Tendai Biti has said. Biti has criticised Tagwirei, who has wormed himself into the ruling party after being nominated for the Central Committee by ZANU-PF’s Harare Province. Former ZANU-PF member and war</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rise-of-blank-tagwirei-to-presidency-a-disaster-that-should-be-stopped-biti/\">‘Rise of ‘blank’ Tagwirei to presidency a disaster that should be stopped’ – Biti</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:40",
            "date": "22 May 2025"
        },
        {
            "title": "Henry Olonga: Zimbabwe legend who made cricket’s bravest stand now sings on cruise ships",
            "url": "https://www.newzimbabwe.com/henry-olonga-zimbabwe-legend-who-made-crickets-bravest-stand-now-sings-on-cruise-ships/",
            "content": "The Telegraph\n\nFormer fast bowler has no regrets despite being exiled from his country after protesting against Robert Mugabe\n\nHenry Olonga recites the lyrics of a song he recorded when he was a Zimbabwean cricketer at the height of his career in the early 2000s and before he was exiled from his country.\n\nOur Zimbabweis a patriotic, idealistic ballad, a love song to his country. It was released at a time of political violence in 2001 as thethuggish Robert Mugabe regimepromoted land grabs and farm invasions.\n\nOne of the lines goes: Though I may go to distant borders, My soul will yearn for this my home, For time and space may separate us, And yet she holds my heart alone. And then another is: As we all stand to build our nation, This our land, our Zimbabwe.\n\nOlonga pauses. Literally some of the words in that song they speak of where my life is now but when I listen to the song again its somewhat triggering.\n\nTwo years after releasing the song he and Andy Flower wore black armbands during the 2003 World Cup to protest at the death of democracy in their country.\n\nOlonga received death threats, was thrown off the team bus and forced to flee Zimbabwe. He has never been back. He has not seen his father, who is now in his mid-80s and still lives in Bulawayo, for more than 20 years.\n\nOur Zimbabwewas a call for Zimbabweans to work together. I try to be a peacemaker, a lot of people think Im the opposite. I dont know why, but if you look at my lyrics, if you look at things Ive done in my life, I think generally, Im trying to inspire people for better outcomes.\n\nIm not just wagging a finger at people and thats what the black armband protest was about; we can be better as a country we can be better as politicians, we can be better as citizens. And I got slaughtered for it.\n\nThis week Olonga will be at Trent Bridge working as a summariser forTest Match Specialduring their coverage of Zimbabwes first Test match in England since 2003, not long after Olongas act of defiance. His voice is deep and sonorous, perfectly audible on a shaky WhatsApp phone line and he will make listeners sit up and take notice this week.\n\nHe is on a European holiday with his family at the moment, taking in the Test match before returning to Australia where he is now settled in Adelaide making ends meet with coaching, commentary and odd jobs as he tries to forge a career as a singer that looked to be taking off when he appeared on the Australian version ofThe Voicein 2019, singingThis is the Momentto pass the blind audition, only to be shut down a year later by the Covid pandemic.\n\nIt was a struggle mate, he recounts. I had this amazing platform, this springboard to then hopefully, you know, go on to record, and it all just came to nothing.\n\nHe now releases music on his YouTube channel and picks up gigs where he can. Recently he was singing on cruise ships. Its not necessarily the peak of music performance being on a cruise ship. In fact, some people think that singers go to die on cruise ships. Its like where you go when you havent made it anywhere else.\n\nBut I dont mind that. I dont have an ego about my music. I sing in little retirement villages, Ive sung to school kids, Ive sung in little bars in front of three people. I just love singing. I love performing.\n\nIve done all sorts of jobs. Ive cleaned peoples boats. Ive done public speaking, as in motivational talks, after-dinner talks. I wont say Im having the time of my life, because I just live a sort of drab, very predictable, boring life in some peoples eyes, but at least its honest, and Im staying out of trouble.\n\nOlonga was the first black Zimbabwean Test cricketer, and also the youngest, when he made his debut aged 18. He played 30 Tests, 50 ODIs as a quick but erratic fast bowler, peaking with five for 70 as Zimbabwe beat India in a Test in Harare (imagine that now).\n\nHe was just 27 when he wore the black armband, a protest that started at Zimbabwes first group game in Bulawayo and continued throughout the tournament. The backlash was vicious. A Zanu PF official called him an uncle Tom and a man with a black skin and white mask.\n\nWhile Flower resettled in England, played county cricket and then coached all over the world, leading England to Ashes victory in Australia in 2010-11, Olongas career was over apart from games for the Lashings World XI and Bishops Lydeard in the West of England Premier League. This was a time before the franchise T20 safety net for players; Olonga had no fallback.\n\nHe says cricket was triggering, even just to commentate. Working as a BBC pundit after a heavy Zimbabwe defeat at Lords in 2003 he was sent nasty messages from Zimbabweans for being too negative.\n\nWhile playing for Lashings in Luton a spectator spent all day shouting the C-word at him until the police were called and when he met the Zimbabwe high commissioner at an event in Australia in 2017  nearly 15 years after his black armband protest  he was cold-shouldered.\n\nIve been accused of being scared. Ive been accused of being a chicken; that I should have stayed in Zimbabwe. The high commissioner pulled me aside. The first thing he said was: Why are you denigrating the government of Zimbabwe? I thought: My gosh, thats a lovely way to say hello.\n\nI tried to be respectful. I excused myself but he was that old-school mentality and thought Id betrayed the country like no one else had ever done. And so the whole cricket, Zimbabwes politics scene was very triggering for me because the perception was that I was a troublemaker. Does that make sense? Imagine a bad divorce and separation. And every time you think about that person, I have a conversation about them, its mostly unpleasant.\n\nHe admits he was perhaps naive to the consequences, the repercussions that would change his life. Im always dealing with the fallout. I daily deal with the idea that some people view me as a guy who couldnt just play the game, he had to bring politics into sport, and that has connotations positive and negative.\n\nIve had some unpleasant conversations, even in recent times, with Zimbabweans online or in person. They just have this beef with me. I try to deal with it gracefully, but there was a real cost attached to it. But that cost doesnt translate to regret. I still stand by what I did. Did it make a tangible difference on the ground to anybody? Probably not.\n\nI was young, I had very strong feelings about what was happening in Zimbabwe with the farm invasions and the political instability, and I had a very small opportunity in a sliver of time to try to make a difference.\n\nI took a stance, and I know that I tried to make a difference. I could have had more time as a cricket player but its hard to quantify taking a moral, conscientious stance against a dictator versus runs and wickets.\n\nOlonga was close to returning when Mugabe, who died in 2019, was overthrown in 2017 but there was no homecoming; he remained in Australia. Its in the too-hard basket. Ive started a new life. I think like a Westerner now. I live in Adelaide where things just work.\n\nOur government invests billions of dollars into infrastructure. Were getting new roads put in, the hospital system is excellent, in spite of the whinging that happens. As an African my jaw is always hitting the floor at how efficient things are.\n\nBut I feel as strongly as I did back then against the forces of corruption in Zimbabwe. If theres any kind of vindication for us it is that Zimbabwe has gone backwards. So many people have left the country looking for opportunities abroad.\n\nIve bumped into so many Zimbabweans overseas all looking for greener pastures, but doing it unwillingly. They all love Zimbabwe. They all loved living there. They would, in a heartbeat, go back if it was stable, or anything resembling the new lives they have, but they cant do it because theres an understanding of the instability of the country.\n\nHe wonders if life would have turned out differently had he accepted a scholarship at the London Academy of Music and Dramatic Arts when he was teenager instead of pursuing a cricket career.\n\nI think I would always have been a better stage performer than I was a cricketer. I would have enjoyed it more and there would have been less failure and disaster. Ive always felt that it would have been a more fulfilling career for me.\n\nOlonga readily admits it is hard to make ends meet from music. His YouTube channel has around 2,000 subscribers and when he tried to crowdfund an album last year he was hit hard by reality.\n\nIm a chronically broke ex-cricketer. I thought the only way I can afford to do this, because it costs, like 200,000 Aussie dollars to record an album, is with crowdfunding.\n\nNo word of a lie, I got nine people investing. I actually thought it was 10. And then I discovered that someone had donated twice. Nine people backed me. That was it. And then I thought: Yikes. OK, Im definitely a has-been now. That dream just fell flat.\n\nIt was a punch to the gut, but it was a wake-up call to make me realise how I was not even registering on anyones minds as worthy of backing. So I just thought: Well, Ill just do it myself. Ill just do it through the YouTube channels with maybe 100 views per video, but as long as I get enough videos up there, maybe thatll lead to more work elsewhere. Ill still get my music out there somehow.\n\nHis voice, speaking not singing (although you cant rule out a duet with Jonathan Agnew on his euphonium), will be heard this week on the airwaves from Trent Bridge and he says he is at peace now with cricket, that life has moved on.\n\nIm 49, Im washed up. Im over the hill. Having said that, I think I now know my instrument. I know which songs work for me. Im an old dude trying to rewind the clock and go back to that fork in the road where I had a choice between music and cricket. Im revisiting that music path and lets see where it ends up.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/21192640/olonga.webp",
            "description": "<p>The Telegraph Former fast bowler has no regrets despite being exiled from his country after protesting against Robert Mugabe Henry Olonga recites the lyrics of a song he recorded when he was a Zimbabwean cricketer at the height of his career in the early 2000s and before he was exiled from his country. Our Zimbabwe is</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/henry-olonga-zimbabwe-legend-who-made-crickets-bravest-stand-now-sings-on-cruise-ships/\">Henry Olonga: Zimbabwe legend who made cricket’s bravest stand now sings on cruise ships</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:40",
            "date": "22 May 2025"
        },
        {
            "title": "MPs grill Kambamura over delays in tabling Mines and Minerals Amendment Bill, EPOs as foreigners take over sector",
            "url": "https://www.newzimbabwe.com/mps-grill-kambamura-over-delays-in-tabling-mines-and-minerals-amendment-bill-epos-as-foreigners-take-over-sector/",
            "content": "By Anna Chibamu\n\nZANU PF legislators, Wednesday grilled Mines and Mining DevelopmentDeputy Minister Polite Kambamura over delays in the tabling of the Mines and Minerals Amendment Bill in the National Assembly.\n\nThe MP alleged that Zimbabweans rights to mining were being undermined as the bill has been kept out of Parliament for too long.\n\nAs of March 26, 2025, the Bill status reads: Bill proofs transmitted to Attorney Generals Office.\n\nGokwe-Kabuyuni MP Spencer Tshuma said the delays in amending the bill had a negative bearing on how mining rights were awarded to citizens, as foreign nationals have an upper hand, leaving out hungry locals.\n\nDuring the question and answer (Q and A) session,Tshuma alleged thatlocals were also being charged the same fees asforeigners.\n\nLooking at the delays in the Mines and Minerals Amendment Bill to this August House so that it is reviewed, what is government doing to ensure that those who are in mining will be accorded different rights from foreign miners?\n\nWe are noting that at the moment they are treated the same from the monies that they pay during the pegging of mines and even in paying their taxes, and that our local people are given rights as citizens of this nation compared to foreigners.\n\nWe have been anticipating this new law for quite some time, and it has been a long time since the 9th Parliament. What is happening, Madam Speaker, is that mining is going on and our minerals are being exploited whilst we are waiting for the law? Tshuma said.\n\nLegislators have in the past also accused the government of mortgaging minerals to foreigners at the expense of citizens who are languishing in poverty.\n\nFurther, Tshuma demanded an explanation on the delays from the deputy minister.\n\nSo, may the Hon. Minister explain how long it is going to take and the challenges that are preventing the new law from coming to this august House so that it is tabled in Parliament and discussed, instead of foreign companies coming to take all the money? Tshuma said.\n\nMedia reports have shown that Chinese-owned companies are flooding the mining sector, violating Environmental and Mining laws, causing devastating land degradation.\n\nGoromonzi West constituency MP Biata Beatrice Karimatsenga-Nyamupinga on EPOs said: When local people apply so that they get the applications processed, they do not succeed, but foreign miners are found mining in schools and in other protected places or in other gazetted places.\n\nOur locals should be able to go to such places and their applications must also be treated with priority over the foreign applications.\n\nZanu PF Rushinga MP Tendai Nyabani urged the Mines Ministry to follow up on miners as most cheat on the value and type of mineral being mined, thereby paying less royalties to the State.\n\nWill the government make a follow-up to check exactly what the miner is mining for, because sometimes they might peg mining minerals of lesser value, yet they are mining some precious minerals?\n\nKambamura saidthat all raised issues would be looked at in the new bill.\n\nWe are reviewing and are going to be looking at these issues. When someone comes from outside the country to bring investment, they should have a substantial investment.\n\nWe cannot just allow people who come into the mining sector without a significant amount of investment.\n\nWe are going to enact a law that stipulates that foreign investors should give locals opportunities to be employed. We have noticed that most investors bring their workers from their countries, who sometimes do not share the technical expertise with locals, the deputy minister responded.\n\nKambamura assured the legislatorsthat locals are going to be prioritised in the next few months.\n\nWe are going to ensure that small-scale miners or the sector will only be for black local Zimbabweans.\n\nRegarding delays in gazetting of the bill, he explained: In the past few days, we gazetted the Act and some sections were noted that needed editing.\n\nSo, the Attorney Generals Office is reviewing such errors, such mistakes which are going to be corrected then it will be regazetted.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/19231053/Deputy-Mines-Minister-Polite-Kambamura.png",
            "description": "<p>By Anna Chibamu ZANU PF legislators, Wednesday grilled Mines and Mining Development Deputy Minister Polite Kambamura over delays in the tabling of the Mines and Minerals Amendment Bill in the National Assembly. The MP alleged that Zimbabweans’ rights to mining were being undermined as the bill has been kept out of Parliament for too long. As</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mps-grill-kambamura-over-delays-in-tabling-mines-and-minerals-amendment-bill-epos-as-foreigners-take-over-sector/\">MPs grill Kambamura over delays in tabling Mines and Minerals Amendment Bill, EPOs as foreigners take over sector</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:40",
            "date": "22 May 2025"
        },
        {
            "title": "Govt to allocate 50,000 residential stands to war veterans",
            "url": "https://www.newzimbabwe.com/govt-to-allocate-50000-residential-stands-to-war-veterans/",
            "content": "By Tapiwa Svondo\n\nWar veterans are set to benefit from an initiative which will see the allocation and development of 50,000 residential stands from the government.\n\nThe Ministry of Local Government and Public Works, the Ministry of the Veterans of the Liberation Struggle Affairs, and the CEO of Prevail Private Limited International, Paul Tungwarara, who is set to develop the land, signed a tripartite agreement on Tuesday.\n\nLocal government minister Daniel Garwe said this program will cover all ten provinces in Zimbabwe.\n\nAs we may be aware that section 23 of the Constitution of Zimbabwe has provisions for looking after war veterans in terms of quarter system that 20 percent of the developments taking place in the country in various economic spheres must be set aside for war veterans.\n\nAs the Ministry of local government, we are here to honor that provision in the constitution by today signing a Memorandum of Agreement, between the ministry of local government and public works, the ministry of war veterans affairs and our developer for the construction to completion of developments for stands for war veterans throughout our 10 provinces, said Garwe.\n\nThe Minister of War Veterans, Monica Mavhunga said 50,000 war veterans are set to benefit during the first phase.\n\nThe first phase is to benefit about 50,000 war veterans which is a substantial number and as a ministry responsible for the identification and the final allocation of these stands we are going to do this transparently and we promise everyone in this country that we are not going to be found on the side of those who are corrupt, it mean we are going to do our work transparently, she said.\n\nGarwe said his ministry will ensure that suitable land is identified and no issues will arise in the future, which will result in demolitions.\n\nAdded Garwe, What we are going to do as the Ministry of local government and public works is to identify suitable land where we will then invite the developer to come and provide the road network, water and sewer reticulation and other services that fall under the first line of services.\n\nWe are the Ministry responsible of ensuring that we follow the law in terms of providing developed pieces of land for housing purposes. We will not witness a situation where the developer will be allocated a wetland as a piece of land for this program, it is not happening and we are the Ministry responsible for ensuring that the urban councils act is being respected by anyone including ourselves.\n\nSo there is no way you will find people coming to demolish these houses that the war veterans were building on properly planned survey and governed settlements it will not happen, dont worry about that.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/21201825/219058-scaled.jpg",
            "description": "<p>By Tapiwa Svondo War veterans are set to benefit from an initiative which will see the allocation and development of 50,000 residential stands from the government. The Ministry of Local Government and Public Works, the Ministry of the Veterans of the Liberation Struggle Affairs, and the CEO of Prevail Private Limited International, Paul Tungwarara, who</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-to-allocate-50000-residential-stands-to-war-veterans/\">Govt to allocate 50,000 residential stands to war veterans </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:40",
            "date": "22 May 2025"
        },
        {
            "title": "Masvingo woman ordered to pay US$25k in adultery damages",
            "url": "https://www.newzimbabwe.com/masvingo-woman-ordered-to-pay-us25k-in-adultery-damages/",
            "content": "By Mary Taruvinga\n\nHigh Court judge, Justice Joel Mambara has ordered a Masvingo woman, Eugenia Machaya to pay US$25,000 adultery damages to the wife of a man she snatched six years ago.\n\nA default order was granted in favour of the complainant, Viola Dhudhla Machingura after Machaya failed to attend pretrial meetings.\n\nMachingura had sued Machaya for US$50,000 after she invaded her 41-year-old marriage.\n\nBroken down, US$30,000 was for contumelia and US$20,000 was for loss of consortium, arising from a protracted adulterous relationship between Machaya and her husband.\n\nThe court heard the relationship started in 2019 and Machaya now has two children with Dhudhlas husband.\n\nThe plaintiff, a retired university lecturer and church elder, testified through affidavit to public humiliation in her congregation and community, severe emotional trauma requiring medical treatment for diabetes, hypertension and depression, and the stripping away of her role in the family estate (bank accounts, farm operations and vehicles), the court heard.\n\nSince 2019 the plaintiffs husband has cohabited with the defendant; intimacy, companionship and joint family life have ceased entirely. The marriage now subsists only in name, court papers further show.\n\nMachaya, despite the service, elected to remain absent and therefore offered no apology or mitigation.\n\nThematter was set down on the unopposed roll afterherplea was struck out for non-attendance at the pre-trial conference and her subsequent application for rescission was deemed abandoned.\n\nLiabilitywas therefore not in issueand the courtwas onlyseized with the assessment of quantum under r 25(1) of the High Court Rules, 2021.\n\nWhile handing down his judgement, Justice Mambara said that when fixing adultery damages, the court considers the nature and duration of the marriage, knowledge of the marriage by the adulterer, character and social-economic standing of the parties and the extent of contumelia and loss of consortium proved.\n\nThe judge also looked into contrition (or lack thereof) by the adulterer, the need for deterrence, and the level of awards in comparable cases.\n\nMambara said there is no reported High Court decision afterthat ofTaoneyivs Madzima (HH 18-25)has exceeded the composite figure of US$20,000.\n\nInflation-adjusted though that award is, it remains the highest recent comparable award placed before the court, he said.\n\nThe judge said the plaintiff had along, otherwise stable marriage.\n\nHe said there was a total lack of contrition by Machaya, adding that such offenders deserve deterrent penalties.\n\nThe court is satisfied that an award modestly above the most recent ceiling of US $20,000 is justified to reflect both changing economic realities and the egregious facts of this case.\n\nAccordingly, it is ordered that the defendant shall pay to the plaintiff the sum of US $25,000 made up as follows:(a) Contumelia: US$16,000 (b) Loss of consortium: US$9,000.\n\nHe ruled that interest shall run on the above amount at the prescribed rate of 5 % per annum from the date of this judgment to the date of full and final payment.\n\nMachaya will also pay Dhudhlas costs of suit.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg",
            "description": "<p>By Mary Taruvinga High Court judge, Justice Joel Mambara has ordered a Masvingo woman, Eugenia Machaya to pay US$25,000 adultery damages to the wife of a man she snatched six years ago. A default order was granted in favour of the complainant, Viola Dhudhla Machingura after Machaya failed to attend pretrial meetings. Machingura had sued</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/masvingo-woman-ordered-to-pay-us25k-in-adultery-damages/\">Masvingo woman ordered to pay US$25k in adultery damages</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:40",
            "date": "22 May 2025"
        }
    ]
}