{
    "news": [
        {
            "title": "Zimbabweans shot dead in Limpopo, South African police launch manhunt",
            "url": "https://www.newzimbabwe.com/zimbabweans-shot-dead-in-limpopo-south-african-police-launch-manhunt/",
            "content": "By Mary Taruvinga\n\nLimpopo police have launched a massive manhunt after two Zimbabwean nationals were brutally gunned down at Ha-Rangani Village in the Masisi policing area, Vhembe District, early Sunday morning.\n\nPolice said they were called to the scene at around 07:30 am on August 17 and discovered a grisly double murder.\n\nInside the vehicle, a man was found seated in the drivers seat with multiple gunshot wounds. The second victim was found nearby, also fatally wounded with several gunshots, the South African Police Service (SAPS) said in a statement.\n\nThe victims, aged 30 and 28, were originally from Bulawayo. One had been living at Musina Location while the other resided in Ha-Rangani Village.\n\nAt the crime scene, police recovered live ammunition, several spent cartridges and a cellphone belonging to one of the deceased.\n\nProvincial police commissioner Lieutenant General Thembi Hadebe vowed that law enforcement would leave no stone unturned.\n\nResources have been mobilised to track down the suspects, she said.\n\nA case of two counts of murder has been opened at Masisi Police Station and referred to the Provincial Organised Crime Unit for further investigation.\n\nPolice have appealed for public assistance in hunting down the killers.\n\nAnyone with information that could lead to the arrest of the suspects must urgently contact Lieutenant Colonel Rodney Ndou at 082 807 2666, their nearest police station, or the Crime Stop number 08600 10111, SAPS said, adding that anonymous tip-offs could also be made via the MySAPS App.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/08004602/sa-police.png",
            "description": "<p>By Mary Taruvinga Limpopo police have launched a massive manhunt after two Zimbabwean nationals were brutally gunned down at Ha-Rangani Village in the Masisi policing area, Vhembe District, early Sunday morning. Police said they were called to the scene at around 07:30 am on August 17 and discovered a grisly double murder. “Inside the vehicle,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabweans-shot-dead-in-limpopo-south-african-police-launch-manhunt/\">Zimbabweans shot dead in Limpopo, South African police launch manhunt</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "19 Aug 2025"
        },
        {
            "title": "ZWG acceptance still a challenge – Hippo Valley",
            "url": "https://www.newzimbabwe.com/zwg-acceptance-still-a-challenge-hippo-valley/",
            "content": "By Alois Vinga\n\nLEADING sugar producer, Hippo Valley Estates Limited (HVEL) has decried the mismatch between the obtaining ZWG exchange rate stability and therejection ofthe unit across the markets.\n\nThe outcry comes on the back of stable exchange rates, which have maintained sanity since the September 2024 official devaluation of 43%. The two markets, official and parallel, have maintained a close range, hovering between ZWG28, 00 to a high of ZWG34, 00 against the greenback.\n\nBut presenting a trading update for the companys first quarter period, Hippo Valley said the local unit still faces acceptance challenges.\n\nWhile the ZWG currency has shown relative stability since the significant devaluation experienced at the end of September 2024, it faces significant challenges, particularly in gaining widespread acceptance.\n\nThe tight liquidity conditions that prevailed during the quarter and the currency mix dilemma when trading using the ZWG currency resulted in episodes of excess ZWG cash balances for the company and USD working capital challenges, with most suppliers of goods and services, particularly the informal sector, continuing to favor the USD currency due to perceived stability, the company said.\n\nThe sugar producer said that despite the first quarter ending with relatively stable exchange rates, input costs were elevated due to inflationary pressures and geopolitical tensions as global trade policies shifted.\n\nIn terms of operations, the first quarter sugar production period ended on a positive note, marked by a 15% increase in cane supply from the companys plantations (miller-cum-planter), attributed to the higher milling crushing season.\n\nAdditionally, cane quality improved from an Estimated Recoverable Crystal of 11,30% to 11,46%.\n\nDespite some minimal mill start-up challenges, the plant had impressive recoveries, after achieving a cane sugar ratio of 8.49 against the prior year of 8.50 and the target of 8.75. Private cane deliveries marginally dropped due to diversions to the Triangle mill after the start-up challenges referred to above, the company added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/06044805/Hippo-Valley-Sugar-Estates.png",
            "description": "<p>By Alois Vinga LEADING sugar producer, Hippo Valley Estates Limited (HVEL) has decried the mismatch between the obtaining ZWG exchange rate stability and the rejection of the unit across the markets. The outcry comes on the back of stable exchange rates, which have maintained sanity since the September 2024 official devaluation of 43%. The two markets, official</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zwg-acceptance-still-a-challenge-hippo-valley/\">ZWG acceptance still a challenge – Hippo Valley</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "19 Aug 2025"
        },
        {
            "title": "Former Warriors striker Tendai Ndoro dies",
            "url": "https://www.newzimbabwe.com/former-warriors-striker-tendai-ndoro-dies/",
            "content": "By Sports Reporter\n\nFormer Warriors and Orlando Pirates striker, Tendai Ndoro, has died aged 40.\n\nNdoro was found dead in his apartment in South Africa, Monday.\n\nNicknamed Fire, the ex-Orlando Pirate player was forced into early retirement due to a diabetic illness.\n\nNdoro played for several teams during his lengthy career, which started in Zimbabwe and took him to South Africa and Saudi Arabia.\n\nThe former Chicken Inn player is one of the few Zimbabwean players to score at AFCON, a feat he achieved during the 2017 edition against Tunisia.\n\nMore to follow\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/02/13043201/Tendai-Ndoro.jpg",
            "description": "<p>By Sports Reporter Former Warriors and Orlando Pirates striker, Tendai Ndoro, has died aged 40. Ndoro was found dead in his apartment in South Africa, Monday. Nicknamed Fire, the ex-Orlando Pirate player was forced into early retirement due to a diabetic illness. Ndoro played for several teams during his lengthy career, which started in Zimbabwe</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/former-warriors-striker-tendai-ndoro-dies/\">Former Warriors striker Tendai Ndoro dies</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "19 Aug 2025"
        },
        {
            "title": "M23 rebels suspend peace talks with DR Congo government",
            "url": "https://www.newzimbabwe.com/m23-rebels-suspend-peace-talks-with-dr-congo-government/",
            "content": "BBC\n\nThe main rebel group in eastern Democratic Republic of Congo, the M23, has walked away from peace talks with the government, saying it will not return unless the authorities adhere to a previous ceasefire deal.\n\nFighting between the two sides escalated in January, when the M23 captured large parts of the mineral-rich east, including the regional capital Goma.\n\nIn Qatar last month, the rebels and the government signed a ceasefire agreement, intended as a step towards a permanent peace deal.\n\nBut on Monday, as negotiations were set to resume, the M23 said its representatives were not present in Qatar.\n\nM23 spokesperson Lawrence Kanyuka told the BBCs Great Lakes service that the Congolese government doesnt want peace.\n\nHe accused the authorities of not respecting the provisions contained in the ceasefire deal, but DR Congos military denies this charge.\n\nKanyuka alleged that government forces had continued to attack rebel positions, despite the agreement stating that both sides must refrain from assaults.\n\nHowever, the Congolese armed forces accused the M23 of launching attacks almost daily in the North Kivu and South Kivu provinces.\n\nThe Qatar peace deal was supposed to be signed by Monday.\n\nOn Sunday, an unnamed official from Qatar told the AFP news agency that a draft agreement had been shared with DR Congo and the M23.\n\nThe agreement runs alongside a peace deal between DR Congo and Rwanda, which was brokered by the US in June.\n\nDR Congo, the UN and numerous Western powers have accused Rwanda of backing the M23.\n\nDespite participating in the Washington peace talks, Rwanda has long denied the allegations against it.\n\nThe Washington peace deal, hailed by President Donald Trump as a glorious triumph,could grant the US access to DR Congos vast mineral wealth.\n\nHowever, it is the latest in a long line of failed peace deals in the region.\n\nDuring the ongoing conflict, thousands of people have been killed and hundreds of thousands of civilians forced from their homes, the UN says.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/18183327/m23-.webp",
            "description": "<p>BBC The main rebel group in eastern Democratic Republic of Congo, the M23, has walked away from peace talks with the government, saying it will not return unless the authorities adhere to a previous ceasefire deal. Fighting between the two sides escalated in January, when the M23 captured large parts of the mineral-rich east, including</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/m23-rebels-suspend-peace-talks-with-dr-congo-government/\">M23 rebels suspend peace talks with DR Congo government</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "19 Aug 2025"
        },
        {
            "title": "Warriors prospect Cobert Chimedza loaned to Portugal lower division side",
            "url": "https://www.newzimbabwe.com/warriors-prospect-cobert-chimedza-loaned-to-portugal-lower-division-side/",
            "content": "By Sports Reporter\n\nWarriors prospect Cobert Chimedza has joined the lower division side AC Marinhense in Portugal on a one-year loan deal.\n\nChimedza was loaned by his parent club, Gil Vicente, which plays in the Portuguese top-flight league.\n\nAt 20 years old, Chimedza joined Gil Vicente earlier this year but was unable to play for their developmental side due to a delay in processing his international clearance papers.\n\nBorn and raised in Zimbabwe, Chimedza moved to England six years ago after being scouted by English Football League Two side MK Dons, with whom he eventually parted ways upon his move to Portugal.\n\nHe once received a national team call-up three years ago under former Warriors coach Zdravko Logarusic but did not make his international debut.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/18183017/cobert-chimedza.jpeg",
            "description": "<p>By Sports Reporter Warriors prospect Cobert Chimedza has joined the lower division side AC Marinhense in Portugal on a one-year loan deal. Chimedza was loaned by his parent club, Gil Vicente, which plays in the Portuguese top-flight league. At 20 years old, Chimedza joined Gil Vicente earlier this year but was unable to play for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/warriors-prospect-cobert-chimedza-loaned-to-portugal-lower-division-side/\">Warriors prospect Cobert Chimedza loaned to Portugal lower division side</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "19 Aug 2025"
        }
    ]
}