{
    "news": [
        {
            "title": "Zimbabweans escaping economic hardship trapped in the UK care visa crackdown",
            "url": "https://www.newzimbabwe.com/zimbabweans-escaping-economic-hardship-trapped-in-the-uk-care-visa-crackdown/",
            "content": "By Business Insider Africa\n\nZimbabwean professionals seeking a way out of their countrys prolonged economic crisis are facing fresh hurdles as the UK government moves to permanently scrap care worker visas, a route many had used to migrate.\n\nWere permanently shutting down the care visa route. Care workers from overseas have made a huge contribution, but too many have been subject to abuse and exploitation, the UK Home Office announced via its official X account on May 12.Were moving away from our dependence on overseas workers to restore control and fairness to the system.\n\nIndia, Nigeria and Zimbabwe have been the three biggest sources of care workers migrating to the UK since it began offering them such visas. According to UK Home Office data, 15,709 care-worker visas were issued to Zimbabwean nationals in 2023, while Nigerians received 19,449, including dependents.\n\nThe visa cancellation is part of a wider clampdown on immigration under Prime Minister Keir Starmers government, which is facing increasing pressure to reduce migrant numbers amid growing support for anti-immigration parties like Nigel Farages Reform UK, according toBloomberg.\n\nFor many Zimbabweans, the permits had offered a lifeline, an opportunity to escape an economy marked by instability and inflation. Over the years, Zimbabwes currency has been one of the worlds worst performers.\n\nThe countrys latest attempt at monetary stability, thegold-backed ZiG, marks its sixth currency experiment in just 15 years. Despite its promise, the ZiG has yet to gain meaningful traction. In September, the central bank devalued the ZiG by 43% to narrow the gulf between official and black-market exchange rates.\n\nThe migration surge has triggered a significant brain drain in Zimbabwe, depleting the country of skilled professionals, not only in health care but also across critical sectors such as banking, accounting, and information technology, said Memory Nguwi, managing consultant at Industrial Psychology Consultants, a Harare-based HR advisory firm.\n\nZimbabwean authorities have raised concerns that the exodus of nurses and doctors to the UK has created a severe gap in the countrys already fragile healthcare system.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/28072448/Nurse-UK.png",
            "description": "<p>By Business Insider Africa The UK government announced the cancellation of care worker visas, affecting migration routes for Zimbabwean professionals. Care worker visas had been crucial for Zimbabweans fleeing economic challenges and finding work in the UK. This migration route’s closure exacerbates Zimbabwe’s brain drain, affecting critical sectors like healthcare and IT. Zimbabwean professionals seeking</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabweans-escaping-economic-hardship-trapped-in-the-uk-care-visa-crackdown/\">Zimbabweans escaping economic hardship trapped in the UK care visa crackdown</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "16 May 2025"
        },
        {
            "title": "Mnangagwa offers Lukashenko minerals as opposition raises red flags over Zim’s relationship with Belarus",
            "url": "https://www.newzimbabwe.com/mnangagwa-offers-lukashenko-minerals-as-opposition-raises-red-flags-over-zims-relationship-with-belarus/",
            "content": "By Darlington Gatsi\n\nPRESIDENT Emmerson Mnangagwa has offered his Belarusian counterpart, Aleksandr Lukashenko, an opportunity to explore vast mineral reserves in the country.\n\nMnangagwa dangled the minerals opportunity to Lukashenko during his recently concluded working visit to Belarus in yet another attempt at salvaging the ailing economy.\n\nAccompanied by the better half of his cabinet ministers, Mnangagwa signed several Memoranda of Understanding with Belarus.\n\nWe see great benefits, including in the field of mineral extraction. Together, we can develop a serious framework for investment, which will ensure productivity growth in this sector and let our economies prosper, he said.\n\nZimbabwe has abundant mineral resources, which have led to a rush by foreign investors, particularly the Chinese, in the lithium sector.\n\nHowever, according to observers, the extraction has not translated into an improvement in the livelihoods of ordinary citizens.\n\nIf Lukashenko heeds Mnangagwas invitation, Belarus will become the latest country to join the mineral rush.\n\nTuesday, a Citizens Coalition for Change (CCC) Member of Parliament, Edwin Mushoriwa, raised concerns about the relationship between Zimbabwe and Belarus while debating the bilateral agreement between the two countries on the promotion and reciprocal protection of investments.\n\nWe also need to be worried when we end up having a trade arrangement which can easily be manipulated and exploited by a few well-connected individuals, who end up bringing in certain items.\n\nSome of these deals were done by the Ministry of Local Government and then imposed on local authorities under devolution funds.\n\nWe cannot, as a country, continue to allow ourselves, as Parliament, to endorse this agreement. An agreement cannot be based on political friendship. It cannot be an agreement based on friendship alone, said Mushoriwa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/15200657/lukashenko-mnangagwa.jpeg",
            "description": "<p>By Darlington Gatsi PRESIDENT Emmerson Mnangagwa has offered his Belarusian counterpart, Aleksandr Lukashenko, an opportunity to explore vast mineral reserves in the country. Mnangagwa dangled the minerals opportunity to Lukashenko during his recently concluded working visit to Belarus in yet another attempt at salvaging the ailing economy. Accompanied by the better half of his cabinet</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-offers-lukashenko-minerals-as-opposition-raises-red-flags-over-zims-relationship-with-belarus/\">Mnangagwa offers Lukashenko minerals as opposition raises red flags over Zim’s relationship with Belarus </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "16 May 2025"
        },
        {
            "title": "Delta, ZIMRA tiff over US$74,8 million tax payment rages on",
            "url": "https://www.newzimbabwe.com/delta-zimra-tiff-over-us748-million-tax-payment-rages-on/",
            "content": "By Alois Vinga\n\nTHE legal dispute between beverages manufacturer Delta Corporation and the Zimbabwe Revenue Authority (ZIMRA) over a disputed US$74,8 million continues to rage on, with alternatives to resolve the matter being explored.\n\nPresenting the groups performance for the year ended March 31 2025, Delta board chairmanTodd Moyosaid the figure is still under dispute with no indication on the matters outcome.\n\nThe company is contesting the tax assessments issued by the Zimbabwe Revenue Authority (ZIMRA) for amounts that they consider were payable exclusively in foreign currency. The disputed additional assessments amount to US$74.8 million.\n\nManagement continues to engage with ZIMRA while appealing some legal and factual issues of the assessments and the judgments, with guidance from tax experts and legal counsel. These assessments have a material impact on the Groups operations, if they materialise as per the extant assessments, he said.\n\nMoyo described the ambiguities in the tax legislation as pervasive, thereby creating risks of further disagreements in interpretations and application to current taxes.\n\nMeanwhile, during the period, group revenue for the year at US$807 million increased by 5% compared to the restated prior year figures, reflecting the volume growth in Lager Beer and the sugar tax-induced price increases in sparkling beverages.\n\nThe proportion of domestic sales undertaken in foreign currency was around 80% for most of the year, although there were periodic shifts in response to the performance of the formal retail sector, which was affected by exchange rate disparities and the level of enforcement of the dual pricing regulations.\n\nOperating Income (Earnings before interest and tax) is indicated at US$153 million, which is in line with the prior year. Profit before tax is indicated at US$139.9 million compared to US$104.4 million for the prior year. It is noted that the prior year comparative figures included currency-related distortions.\n\nThe trading margins in the current period were partly affected by the under recovery on the sugar tax and the higher cost of imported maize. It is highlighted that an equivalent of US$20.7 million was paid as sugar tax by Delta Beverages and Schweppes Zimbabwe during the current year.\n\nThe operating environment in Zimbabwe remains complex, influenced by policy changes and currency instability. The beverages sector faces further challenges relating to uncompetitive retail prices arising from high input costs and taxes which attract lower-priced imports from the region and policy-driven changes to the route to market.\n\nWe continue to urge the authorities to implement policies that would ensure the stability of the local currency and access to foreign currency through the banking channels or through trading, added Moyo.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/28024735/Screenshot-2025-01-28-at-04.47.21.png",
            "description": "<p>By Alois Vinga THE legal dispute between beverages manufacturer Delta Corporation and the Zimbabwe Revenue Authority (ZIMRA) over a disputed US$74,8 million continues to rage on, with alternatives to resolve the matter being explored. Presenting the group’s performance for the year ended March 31 2025, Delta board chairman Todd Moyo said the figure is still under dispute</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/delta-zimra-tiff-over-us748-million-tax-payment-rages-on/\">Delta, ZIMRA tiff over US$74,8 million tax payment rages on</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "16 May 2025"
        },
        {
            "title": "One Mic, One Band, One Stage – Reggae Roadblock ignites Harare",
            "url": "https://www.newzimbabwe.com/one-mic-one-band-one-stage-reggae-roadblock-ignites-harare/",
            "content": "By Own Correspondent\n\nA fresh wave of sound and spirit is set to hit Harare as the inaugural edition of the Reggae Roadblock concert series kicks off on May 30 at the Green Screen Cinema Jam Tree entrance.\n\nThis electrifying quarterly event celebrates the essence of roots reggae and is poised to become Zimbabwes definitive platform for reggae music and culture.\n\nThe show will feature a dynamic lineup of Zimbabwes top reggae artists: Cello Culture, Buhle, Jr Bantan, Mannex Motsi, Mr Muffin, Sniper Storm, Dino Mudondo, Helgah, and Satisfaction, all backed by the legendary House of Stone Band and hosted by MC J Boss.\n\nInspired by Bob Marleys historic 1980 independence performance in Zimbabwe, Reggae Roadblock aims to rekindle the unifying, revolutionary spirit of reggae music. As Zimdancehall dominates the mainstream, this concert series fills the gap for traditional reggae lovers, offering a consistent platform for artists and fans.\n\nReggae Meets Fashion\n\nIn a powerful fusion of sound and style, this edition of Reggae Roadblock will also showcase Zimbabwes vibrant fashion scene. All performers will be dressed by local designers, shining a spotlight on homegrown creativity and sartorial excellence.\n\nFeatured designers are Nandi Larethi, Rubys Touch Designs, Jerry  Revenge Fashion Zim, George Takora, Tunga Tumaz, Fungai Tanyaradzwa  Black Gem, Mae_vis, Clessy Designs, Hilda Marinda, Alfonse Marivadzi.\n\nBeyond the music, Reggae Roadblock is a movement and a cultural celebration that brings people together across age, race, and class.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/15195211/WhatsApp-Image-2025-05-15-at-12.03.01.jpeg",
            "description": "<p>By Own Correspondent A fresh wave of sound and spirit is set to hit Harare as the inaugural edition of the Reggae Roadblock concert series kicks off on May 30 at the Green Screen Cinema Jam Tree entrance. This electrifying quarterly event celebrates the essence of roots reggae and is poised to become Zimbabwe’s definitive</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/one-mic-one-band-one-stage-reggae-roadblock-ignites-harare/\">One Mic, One Band, One Stage – Reggae Roadblock ignites Harare</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "16 May 2025"
        },
        {
            "title": "Zanu PF tops human rights violations in April – report",
            "url": "https://www.newzimbabwe.com/zanu-pf-tops-human-rights-violations-in-april-report/",
            "content": "By Staff Reporter\n\nThe ruling Zanu PF party has been identified as the main perpetrator of violence across the country in April, followed by the military and the controversial Forever Associates of Zimbabwe (FAZ).\n\nThis was revealed by the Zimbabwe Peace Projects (ZPP) April 2025 report.\n\nThe ZPP expressed grave concern over the ongoing politically motivated violence, coercion, and systemic abuses perpetrated by both state and non-state actors.\n\nThe human rights watchdog group added that the recorded violations serve as a stark reminder of the urgent need for institutional reform, enhanced accountability, and the implementation of protective mechanisms. These steps are paramount to safeguarding the fundamental rights of all Zimbabweans.\n\nThe ZPP warned that without deliberate action to reverse these disturbing trends, the pursuit of sustainable peace, democracy, and justice remains critically undermined.\n\nThe government, as well as local authorities, have also been implicated as perpetrators of human rights violations.\n\nAccording to the report, Zanu PF committed over thirty-four percent of the total of all human rights violations recorded by the peace watchdog in April 2025.\n\nAnalysis of the data indicates that individuals affiliated with the ruling party, ZANU PF, were responsible for 34.1% of the reported violations, the report stated.\n\nThe ZPP also fingered the Zimbabwe National Army (ZNA) as one of the main perpetrators of human rights violation, alleging that about six percent of the total rights violations cases were committed by the military.\n\nThe Zimbabwe Republic Police (ZRP) accounted for 24.1% of the perpetrators, while local councils were responsible for 15.64%. The Zimbabwe National Army contributed 6.41%, and government officials 4.62%, the report detailed, highlighting the wide net of responsibility for the abuses.\n\nAccording to the report, Masvingo Province recorded the highest number of violations with 20 cases, followed by Harare Province with 14, mirroring the same patterns observed in March 2025.\n\nOther provinces included Manicaland 12, Mashonaland Central 13, Mashonaland East 11, and Mashonaland West 12. The situation remains bleak across much of the country.\n\nMidlands Province reportedly recorded a decrease in reported incidents, from 14 in March to five in April. Bulawayo 1 (one), Matabeleland North 2 (two), and Matabeleland South 3 (three) reported significantly fewer violations.\n\nOn a positive note, ZPP says apart from the worrying human rights violations trend in the country, the High Court ruling last month that justified the University of Zimbabwe (UZ) lecturers industrial strike offered a glimmer of hope.\n\nDespite the worrying trends, the month also brought a positive development in the form of a High Court ruling affirming the constitutional right to strike by the University of Zimbabwes Association of University Teachers (AUT), the report noted, providing a chink of light in what is otherwise a very dark tunnel.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/07/18014149/Zanu-PF-violence.png",
            "description": "<p>By Staff Reporter The ruling Zanu PF party has been identified as the main perpetrator of violence across the country in April, followed by the military and the controversial Forever Associates of Zimbabwe (FAZ). This was revealed by the Zimbabwe Peace Project’s (ZPP) April 2025 report. The ZPP expressed grave concern over the ongoing politically</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-tops-human-rights-violations-in-april-report/\">Zanu PF tops human rights violations in April – report</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "16 May 2025"
        },
        {
            "title": "Father jailed for pledging 14-year-old daughter into marriage",
            "url": "https://www.newzimbabwe.com/father-jailed-for-pledging-14-year-old-daughter-into-marriage/",
            "content": "By Staff Reporter\n\nA SHAMVA man who pledged his underage daughter into marriage has been convicted and sentenced to 12 months imprisonment.\n\nThe offender, whose identity was concealed to protect the girl, appeared at Shamva Magistrates Court, where he was slapped with 12 months imprisonment for unlawfully pledging his 14-year-old daughter in marriage.\n\nFour months of the sentence were suspended on condition of good behaviour. He will, therefore, serve an effective eight months behind bars.\n\nThe State case was that on March 3, 2025, at Red Dragon, Shamva, the offender accepted US$55 from a man as part of a lobola arrangement, effectively promising the minor in marriage, which is a clear violation of Zimbabwes child protection laws.\n\nThe National Prosecuting Authority of Zimbabwe (NPAZ) said the case emphasises the need to protect vulnerable children from harmful cultural practices that violate their rights and compromise their future.\n\nThis case sends a strong message: child marriage is a crime not culture, the prosecution said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/09/22055656/arrested-handcuffed-e1667358262642.jpeg",
            "description": "<p>By Staff Reporter A SHAMVA man who pledged his underage daughter into marriage has been convicted and sentenced to 12 months’ imprisonment. The offender, whose identity was concealed to protect the girl, appeared at Shamva Magistrates Court, where he was slapped with 12 months’ imprisonment for unlawfully pledging his 14-year-old daughter in marriage. Four months</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/father-jailed-for-pledging-14-year-old-daughter-into-marriage/\">Father jailed for pledging 14-year-old daughter into marriage</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "16 May 2025"
        },
        {
            "title": "Tapiwa Makore murderers’ death sentences substituted with life imprisonment",
            "url": "https://www.newzimbabwe.com/tapiwa-makore-murderers-death-sentences-substituted-with-life-imprisonment/",
            "content": "By Mary Taruvinga\n\nMurderers Tafadzwa Shamba and Tapiwa Makore (Snr), who were convicted of killing seven-year-old Tapiwa Makore (Jnr) for ritual purposes in 2020, have had their death sentences substituted with life imprisonment by the Supreme Court.\n\nThe two killed Tapiwa, namesake and nephew of the second offenderand dismembered his bodyin a murder that shook the nation.\n\nTapiwa went missing on the afternoon of 17 September 2020, and his torso was later found being mauled by dogs at a fellow villagers homestead. Some of his remains were discovered shoved in a disused pit latrine.\n\nHis torso was buried a year after the chilling murder and his head was never recovered.\n\nShamba, a herdboyand Makore were convicted in 2023 after a full trial.\n\nThey had an automatic right of appeal to the Supreme Court, but this was overtaken by events as the death penalty was abolished in Zimbabwe before their appeal could be confirmed.\n\nFollowing their conviction for murder in 2023, Shamba and Makore had an automatic right of appeal to the Supreme Court.\n\nBefore the appeal could be heard, the death penalty was abolished in Zimbabwe, hence the Supreme Court could not confirm the sentence handed down by the High Court, the prosecution said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/27165855/Tapiwa-Makore.webp",
            "description": "<p>By Mary Taruvinga Murderers Tafadzwa Shamba and Tapiwa Makore (Snr), who were convicted of killing seven-year-old Tapiwa Makore (Jnr) for ritual purposes in 2020, have had their death sentences substituted with life imprisonment by the Supreme Court. The two killed Tapiwa, namesake and nephew of the second offender and dismembered his body in a murder that shook</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tapiwa-makore-murderers-death-sentences-substituted-with-life-imprisonment/\">Tapiwa Makore murderers’ death sentences substituted with life imprisonment</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "16 May 2025"
        },
        {
            "title": "Chris Brown arrested over alleged bottle attack",
            "url": "https://www.newzimbabwe.com/chris-brown-arrested-over-alleged-bottle-attack/",
            "content": "BBC\n\nUS singer Chris Brown has been arrested in the UK in connection with a bottle attack at a London nightclub in 2023.\n\nBrown was arrested at a hotel in Manchester in the early hours of Thursday, and held on suspicion of causing grievous bodily harm to music producer Abe Diaw at the Tape nightclub in Mayfair.\n\nThe Sun said it became awareof Browns presence in the UK on Wednesday, at which point it alerted the Met Police.\n\nThe Met said a 36-year-old man remains in custody. Representatives for Brown have been approached for comment.\n\nA Met spokesman told BBC News: A 36-year-old man was arrested at a hotel in Manchester shortly after 02:00hrs on Thursday, 15 May on suspicion of grievous bodily harm.\n\nHe has been taken into custody where he remains.\n\nThe arrest relates to an incident at a venue in Hanover Square on 19 February 2023.\n\nThe investigation is being led by detectives from the Central West Area Basic Command Unit.\n\nThe Sun said Met Police officers travelled to Manchester after the newspaper learned the singer had flown to the UK via private jet, and asked officers whether Brown was under arrest.\n\nSpeaking to the Sun in 2023,Mr Diaw claimed Brown hit him over the head with a bottle before punching and kicking him as he lay on the floor.\n\nHe said his knee collapsed and he was taken to hospital, and needed crutches to walk when he was discharged.\n\nR&B singer Brown rose to fame two decades ago and is known for hits such as Beautiful People, No Air, Under The Influence, Run It and Turn Up The Music.\n\nHe is currently on tour and scheduled to play several UK shows in June and July.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/22162924/chris-brown.webp",
            "description": "<p>BBC US singer Chris Brown has been arrested in the UK in connection with a bottle attack at a London nightclub in 2023. Brown was arrested at a hotel in Manchester in the early hours of Thursday, and held on suspicion of causing grievous bodily harm to music producer Abe Diaw at the Tape nightclub</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chris-brown-arrested-over-alleged-bottle-attack/\">Chris Brown arrested over alleged bottle attack</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "16 May 2025"
        },
        {
            "title": "White South Africans going to US are cowards, Ramaphosa says",
            "url": "https://www.newzimbabwe.com/white-south-africans-going-to-us-are-cowards-ramaphosa-says/",
            "content": "BBC\n\nPresident Cyril Ramaphosa has called a group of 59 white South Africans who have moved to the US to resettle cowards, saying theyll be back soon.\n\nThe group of Afrikanersarrived in the US on Mondayafter President Donald Trump granted them refugee status, saying they faced racial discrimination.\n\nBut Ramaphosa said those who wanted to leave were not happy with efforts to address the inequities of the apartheid past, terming their relocation a sad moment for them.\n\nAs South Africans, we are resilient. We dont run away from our problems. We must stay here and solve our problems. When you run away you are a coward, and thats a real cowardly act, he added.\n\nTrump and his close ally, South Africa-born Elon Musk, have said there was a genocide of white farmers in South Africa a claim that has been widely discredited.\n\nThe US has also accused the South African government of seizing land from white farmers without paying compensation.\n\nMore than 30 years after the end of decades of rule by South Africas white minority, black farmers own only a small fraction of the countrys best farmland, with the majority still in white hands, leading to anger over the slow pace of change.\n\nIn January President Ramaphosa signed acontroversial law allowing the government to seize privately owned landwithout compensation in certain circumstances, when it is deemed equitable and in the public interest.\n\nBut the government says no land has yet been seized under the act.\n\nTrump has offered to resettle the white Afrikaners, descendants of mostly Dutch settlers, saying they were fleeing a terrible situation in South Africa.\n\nSpeaking on Monday at an agricultural exhibition in the Free State province, Ramaphosa said the Afrikaners were moving to the US because they were not favourably disposed to efforts aimed at addressing the countrys challenges.\n\nIf you look at all national groups in our country, black and white, theyve stayed in this country because its our country and we must not run away from our problems. We must stay here and solve our problems, Ramaphosa said.\n\nI can bet you that they will be back soon because there is no country like South Africa, he added.\n\nHis coward remark angered some social media users, who condemned it as an insult to aggrieved white South Africans.\n\nThe group of Afrikaners were welcomed by top US officials who claimed they had been living under a shadow of violence and terror in South Africa.\n\nWelcome to the land of the free, Deputy Secretary of State Chris Landau said as he received the South Africans who landed at Dulles airport near Washington DC on Monday.\n\nSome held young children and waved small American flags in the arrival area adorned with red, white and blue balloons on the walls.\n\nEarlier on Monday, President Ramaphosa told an Africa CEO forum in Abidjan, Ivory Coast, that he had recently told Trump during a phone call the US assessment of the situation was not true.\n\nWere the only country on the continent where the colonisers came to stay and we have never driven them out of our country, he added, dismissing claims Afrikaners were being persecuted.\n\nRamaphosa said dozens of white South Africans who arrived in the US on Monday dont fit the bill for refugees.\n\nAccording to theUS embassy in South Africa, to be considered eligible for the refugee resettlement scheme, someone must be:\n\nThe South African leader said he was due to meet his US counterpart soon regarding the issue.\n\nTrump has threatened to boycott the forthcoming G20 summit in South Africa unless the situation is taken care of.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/07/29012333/Ramaphosa.jpeg",
            "description": "<p>BBC President Cyril Ramaphosa has called a group of 59 white South Africans who have moved to the US to resettle “cowards”, saying “they’ll be back soon”. The group of Afrikaners arrived in the US on Monday after President Donald Trump granted them refugee status, saying they faced racial discrimination. But Ramaphosa said those who wanted to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/white-south-africans-going-to-us-are-cowards-ramaphosa-says/\">White South Africans going to US are cowards, Ramaphosa says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "16 May 2025"
        },
        {
            "title": "March 31 protests: 89 granted bail",
            "url": "https://www.newzimbabwe.com/march-31-protests-89-granted-bail/",
            "content": "By Staff Reporter\n\nHigh Court judge Justice Esther Muremba has granted bail to 89 individuals accused of staging the March 31 protests against President Emmerson Mnangagwa.\n\nTheir freedom follows a successful appeal against the magistrates court decision to deny them bail.\n\nIn a brief court order, Muremba freed the suspects without giving reasons for her decision.\n\nThe appeal by all the appellants be and is hereby allowed.\n\nThe decision by the court a quo denying the appellants bail be and is hereby set aside and in its place is substituted by the following: Each accused shall deposit US$100 with the Clerk of Court at Harare Magistrates Court.\n\nUntil the matter is finalised, each accused shall reside at the address listed in the schedule submitted to the State and the court by the accuseds counsel during the appeal hearing, she said.\n\nMuremba said each accused, save for Joseph Gatsi, Kudzanai Murungweni, Memory Dehwe and Munyaradzi Kanonama, shall report once a fortnight, every alternate Friday, between 6 am and 6 pm at CID Law and Order until the matter is finalised.\n\nGatsi shall report to Chegutu Police Station, Murungweni to Sanyati Police Station, Dehwe to Rusape Police Station and Munyaradzi Kanonama to Glendale Police Station once a fortnight, every alternate Friday, between 6 am and 6 pm until the matter is finalised.\n\nThey were also ordered not to interfere with investigations.\n\nThe suspects were represented by their lawyers Kossam Ncube, Douglas Coltart, Jeremiah Bamu and Gift Mutisi of the Zimbabwe Lawyers for Human Rights.\n\nSome of them were granted bail earlier by the High Court.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/31133846/march-7.png",
            "description": "<p>By Staff Reporter High Court judge Justice Esther Muremba has granted bail to 89 individuals accused of staging the March 31 protests against President Emmerson Mnangagwa. Their freedom follows a successful appeal against the magistrates’ court decision to deny them bail. In a brief court order, Muremba freed the suspects without giving reasons for her</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/march-31-protests-89-granted-bail/\">March 31 protests: 89 granted bail</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "16 May 2025"
        }
    ]
}