{
    "news": [
        {
            "title": "An ungrateful man – Mwonzora slams Mnangagwa as MDC opposes ZANU PF’s 2030 agenda",
            "url": "https://www.newzimbabwe.com/an-ungrateful-man-mwonzora-slams-mnangagwa-as-mdc-opposes-zanu-pfs-2030-agenda/",
            "content": "By Staff Reporter\n\nMOVEMENT for Democratic Change (MDC) leader Douglas Mwonzora has described President Emmerson Mnangagwa as an ungrateful man, as Zanu PFs controversial push to extend the presidents tenure beyond 2028 continues to face mounting opposition.\n\nDespite Mnangagwa publicly rejecting the idea of a term extension beyond the constitutionally mandated two terms, Zanu PF has been spearheading a plan to amend the Constitution to enable him to remain in power.\n\nThe ruling party is reportedly seeking to amend Section 91(2), which bars Mnangagwa from running for a third term, and Section 328(7), which prevents a sitting president from benefiting from such an amendment.\n\nAddressing the media in Harare recently, Mwonzora stopped short of saying Mnangagwa has overstayed his welcome at the helm of the country.\n\nWhy should we give President Mnangagwa who is 83 with another term? He has been Minister since 1980 and he has been President, first completing the tenure of President Mugabe and the two terms that he has been given. He needs to be an ungrateful man to seek anything beyond that, said Mwonzora.\n\nAt the just-ended Zanu PF Peoples Conference in Mutare, the ruling party resolved to fast-track constitutional amendments that would allow Mnangagwa to continue his tenure beyond 2028.\n\nMwonzora said the country has seen no tangible improvement under Mnangagwas leadership, who took over from long-time ruler Robert Mugabe following the 2017 military coup.\n\nThere is nothing special that we have received from his presidency at all. Zimbabweans continue wallowing in poverty, although they say that there is economic development in Zimbabwe. Average Zimbabweans have become poorer. Some Zimbabweans cannot afford a meal a day every day and there is a lot of unemployment, so why should we have a term? said Mwonzora.\n\nAccording to a leaked corruption dossier allegedly authored by Vice President Constantino Chiwenga, Zanu PF is plotting to smuggle a document into Parliament titled the Breaking Barriers Initiative (BBI), which seeks to postpone elections and extend the tenure of the National Assembly until 2030.\n\nThe BBI is reportedly being packaged as a national stability project aimed at helping Zimbabwe move away from the toxic cycle of elections.\n\nMwonzora, however, warned against tampering with the 2013 Constitution, which was overwhelmingly endorsed by citizens in a national referendum.\n\nMDC was an active participant in the drafting of the constitution and it heard the views of the people of Zimbabwe. The people of Zimbabwe want a limited term. Somebody rules the country, is given a second term if possible, then they go home. So we remain opposed to the so-called 2030 agenda, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/29172327/Douglas-Mwonzora.jpg",
            "description": "<p>By Staff Reporter MOVEMENT for Democratic Change (MDC) leader Douglas Mwonzora has described President Emmerson Mnangagwa as “an ungrateful man,” as Zanu PF’s controversial push to extend the president’s tenure beyond 2028 continues to face mounting opposition. Despite Mnangagwa publicly rejecting the idea of a term extension beyond the constitutionally mandated two terms, Zanu PF</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/an-ungrateful-man-mwonzora-slams-mnangagwa-as-mdc-opposes-zanu-pfs-2030-agenda/\">An ungrateful man – Mwonzora slams Mnangagwa as MDC opposes ZANU PF’s 2030 agenda</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "22 Oct 2025"
        },
        {
            "title": "DNC bus that killed 43 people was unroadworthy, overloaded and speeding – Limpopo Premier",
            "url": "https://www.newzimbabwe.com/dnc-bus-that-killed-43-people-was-unroadworthy-overloaded-and-speeding-limpopo-premier/",
            "content": "IOL\n\nLimpopo Premier Dr Phophi Ramathuba has describedthe deadly N1 bus crash that claimed 43 livesas a preventable disaster and an act of criminal negligence, following revelations that the vehicle was overloaded, unroadworthy and speeding when it plunged down a steep embankment near Louis Trichardt last week.\n\nOn Monday, Ramathuba met with the families and relatives of the deceased at Siloam Hospital in the Vhembe District, where she extended her condolences and expressed solidarity with those mourning the loss of their loved ones. Addressing the gathering, she said the tragedy was not an unavoidable act of fate but the result of lawlessness and greed within the cross-border transport industry.\n\nThe victims  mostly Zimbabwean and Malawian nationals  were travelling home when the bus veered off the N1 North near Louis Trichardt on 13 October, killing 43 passengers and injuring 40 others.\n\nAccording to a technical report by the Road Traffic Management Corporation (RTMC), the bus was operating without meeting roadworthiness standards, carried passengers beyond its legal limit and was travelling at an unsafe speed along a mountainous route. Ramathuba said such conditions made the tragedy not just an accident, but a crime against humanity.\n\nThe government will not allow lives to be lost due to greed, lawlessness and disregard for human life, she said. We condemn reckless driving, non-compliance with transport regulations, and the operation of unroadworthy vehicles. The law must take its course, and those responsible must be held accountable.\n\nLimpopo Premier Dr Phophi Ramathuba\n\nRamathuba also commended the emergency services and hospital staff who responded to the scene, saying their swift action saved lives under difficult and dangerous conditions. Our rescue teams risked their own lives to retrieve bodies and transport survivors to safety. Their commitment gave dignity to the deceased and comfort to the grieving, she said.\n\nThe Limpopo government has partnered with the diplomatic missions of Zimbabwe and Malawi to identify and repatriate the deceased. Forensic teams have completed postmortem examinations and begun DNA testing to ensure accurate identification of remains.\n\nFamilies of the victims were provided with counselling and logistical support as they began the painful process of identifying their loved ones.\n\nThe tragedy has reignited concerns over South Africas road safety record and the persistent operation of unsafe, overloaded cross-border buses. Transport experts and activists have long warned that weak enforcement and corruption in vehicle inspections allow dangerous operators to remain on the road, turning long-distance routes into death corridors.\n\nFor many families, the loss goes beyond the immediate grief  it also means the loss of breadwinners who had been working in South Africa to support relatives in neighbouring countries.\n\nEvery life lost on our roads is a blow to a family, a community, and to our shared humanity, Ramathuba said.\n\nAs the province continues to assist with repatriations and investigations, the premier urged all road users to prioritise safety and accountability.\n\nLife has no duplicate, she said.\n\nEvery journey must begin with responsibility. Let us not wait for another disaster to remind us of the value of a single human life.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/14083758/dnc-bus.webp",
            "description": "<p>IOL Limpopo Premier Dr Phophi Ramathuba has described the deadly N1 bus crash that claimed 43 lives as “a preventable disaster” and “an act of criminal negligence,” following revelations that the vehicle was overloaded, unroadworthy and speeding when it plunged down a steep embankment near Louis Trichardt last week. On Monday, Ramathuba met with the families</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dnc-bus-that-killed-43-people-was-unroadworthy-overloaded-and-speeding-limpopo-premier/\">DNC bus that killed 43 people was unroadworthy, overloaded and speeding – Limpopo Premier</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "22 Oct 2025"
        },
        {
            "title": "French ex-president Sarkozy goes to jail over Gaddafi money",
            "url": "https://www.newzimbabwe.com/french-ex-president-sarkozy-goes-to-jail-over-gaddafi-money/",
            "content": "BBC\n\nNicolas Sarkozy has become the first French ex-president to go to jail, as he starts a five-year sentence for conspiring to fund his election campaign with money from late Libyan dictator Muammar Gaddafi.\n\nNot since World War Two Nazi collaborationist leader Philippe Ptain was jailed for treason in 1945 has any French ex-leader gone behind bars.\n\nSarkozy, who was president from 2007-2012, has appealed against his jail term at La Sant prison, where he will occupy a small cell in the its isolation wing.\n\nMore than 100 people applauded and shouted Nicolas! as he left his villa in the exclusive 16th district of Paris, holding his wife Carla Bruni-Sarkozy by the hand.\n\nHis son Louis, 28, had appealed to supporters for a show of support, while another son, Pierre, called for a message of love  nothing else, please.\n\nNicolas Sarkozy, 70, was driven through the entrance of the notoriously overcrowded 19th-Century prison in the Montparnasse district south of the River Seine at 09:40 local time (07:40 GMT), while dozens of police officers cordoned off most of the surrounding streets.\n\nHe continues to protest his innocence in the highly controversial Libyan money affair and posted a message on X as he was driven to the jail, saying: I have no doubt. Truth will prevail. But how crushing the price will have been.\n\nWith unwavering strength I tell [the French people] it is not a former president they are locking up this morning  it is an innocent man, he wrote. Do not feel sorry for me because my wife and my children are by my side but this morning I feel deep sorrow for a France humiliated by a will for revenge.\n\nMoments after Sarkozy entered jail, his lawyer Christophe Ingrain said a request for his release had been filed. Nothing justified his imprisonment, said Mr Ingrain, adding: Hell be inside for at least three weeks or a month.\n\nSarkozy has said he wants no special treatment at La Sant prison, although he has been put in its isolation section for his own safety as other inmates are infamous drugs dealers or have been convicted for terror offences.\n\nSarkozys cell in the prisons isolation wing is believed to be on the top floor and will measure between 9-11 sq m (95-120 sq ft). There had earlier been talk of him serving his term in the another wing for vulnerable people, where other VIPs have been jailed in the past.\n\nHe will have a toilet, a shower, a desk, a small electric hob and a small TV, for which he will have to pay a monthly 14 (12) fee, and the right to a small fridge.\n\nThe former president has the right to receive information from the outside world and family visits as well as written and phone contact.\n\nBut he is in effect in solitary confinement, allowed just one hour a day for exercise, by himself in the wings segregated courtyard.\n\nConditions of detention in an isolation wing are pretty hard, La Sant ex-deputy head Flavie Rault told BFMTV. You are alone, all the time. The only contact you have is with prison staff. You never come across another detainee for security reasons and theres a type of social isolation which makes life difficult.\n\nAt the end of last week, Sarkozy was received at the lyse Palace by President Emmanuel Macron, who told reporters on Monday it was normal that on a human level I should receive one of my predecessors in that context.\n\nMacron stressed on Tuesday that it was not his role to comment on or criticise judicial decisions, but he said it was normal that for many in France the sight of a president jailed by this judicial decision would provoke comment.\n\nIn a further measure of official support for the ex-president, Justice Minister Grald Darmanin said he would go to visit him in prison as part of his role in ensuring Sarkozys safety and the proper functioning of the jail.\n\nI cannot be insensitive to a mans distress, he added.\n\nEver since he left office in 2012, Sarkozy has been dogged by criminal inquiries and for months had to wear an electronic tag around his ankle after a conviction last December for trying to bribe a magistrate for confidential information about a separate case.\n\nLate next month, Frances highest administrative court will give its verdict on Sarkozys appeal against a six-month jail term in another illegal campaign financing case known as the Bygmalion affair.\n\nAhead of his arrival at La Sant prison, Sarkozy gave a series of media interviews, telling La Tribune: Im not afraid of prison. Ill keep my head held high, including at the prison gates.\n\nSarkozy has always denied doing anything wrong in a case involving allegations that his 2007 presidential campaign was funded by millions of euros in Libyan cash.\n\nThe former centre-right leader was cleared of personally receiving the money but convicted of criminal association with two close aides, Brice Hortefeux and Claude Guant, for their role in secret campaign financing from the Libyans.\n\nThe two men both had talks with Gaddafis intelligence chief and brother-in-law in 2005, a meeting arranged by a Franco-Lebanese intermediary called Ziad Tiakeddine, who died in Lebanon shortly before Sarkozys conviction.\n\nAs he lodged an appeal, Sarkozy is still considered innocent but he has been told he must go to jail in view of the exceptional seriousness of the facts.\n\nSarkozy said he would take two books with him into prison, a life of Jesus by Jean-Christian Petitfils and the Count of Monte Cristo, Alexandre Dumass classic story of a man wrongly imprisoned who escapes to wreak vengeance on his prosecutors.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/21173512/sarkozy.webp",
            "description": "<p>BBC Nicolas Sarkozy has become the first French ex-president to go to jail, as he starts a five-year sentence for conspiring to fund his election campaign with money from late Libyan dictator Muammar Gaddafi. Not since World War Two Nazi collaborationist leader Philippe Pétain was jailed for treason in 1945 has any French ex-leader gone</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/french-ex-president-sarkozy-goes-to-jail-over-gaddafi-money/\">French ex-president Sarkozy goes to jail over Gaddafi money</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "22 Oct 2025"
        },
        {
            "title": "Zimbabwe faces intensified power cuts as ZESA shuts down Hwange Unit 8 for 10 days",
            "url": "https://www.newzimbabwe.com/zimbabwe-faces-intensified-power-cuts-as-zesa-shuts-down-hwange-unit-8-for-10-days/",
            "content": "By Staff Reporter\n\nZimbabweans are set to endure worsening power cuts after ZESA Holdings announced that Hwange Power Stations Unit 8 has been taken off the grid for 10 days due to a technical fault,further straining the countrys already fragile electricity supply.\n\nThe shutdown comes at a time when Unit 3 has been offline since September 10 for statutory maintenance, which is expected to be completed by October 24.\n\nAs of October 21, the Zimbabwe Power Company (ZPC) was generating 1,296MW, far below the countrys peak demand of around 2,000MW.\n\nIn a statement released Tuesday, ZESA said Unit 8 will remain out of service for 10 days to allow for restoration work.\n\nZESA Holdings wishes to inform its valued stakeholders that Hwange Unit 8 has been taken off the grid due to a technical fault. The unit will be out of service for 10 days while restoration work is carried out.\n\nDuring this outage, Hwange Unit 7 will remain in operation, generating 335MW to support system stability, the statement read.\n\nThe utility added that power generation at Kariba South has been increased to help mitigate the temporary shortfall.\n\nGeneration at Kariba South Power Station has also been ramped up, with careful management of water allocations, to help compensate for the temporary shortfall.\n\nWe sincerely apologise for any inconvenience this may cause and appreciate your understanding as we work to restore the unit to service.\n\nUrban areas across Zimbabwe have already been experiencing up to 20 hours of load-shedding daily, a situation expected to worsen during the Unit 8 shutdown period.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/02/09033305/Hwange-Power-Station.png",
            "description": "<p>By Staff Reporter Zimbabweans are set to endure worsening power cuts after ZESA Holdings announced that Hwange Power Station’s Unit 8 has been taken off the grid for 10 days due to a technical fault, further straining the country’s already fragile electricity supply. The shutdown comes at a time when Unit 3 has been offline since</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-faces-intensified-power-cuts-as-zesa-shuts-down-hwange-unit-8-for-10-days/\">Zimbabwe faces intensified power cuts as ZESA shuts down Hwange Unit 8 for 10 days</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "22 Oct 2025"
        },
        {
            "title": "Court strikes down University of Zimbabwe’s appeal in contract dispute with former employee",
            "url": "https://www.newzimbabwe.com/court-strikes-down-university-of-zimbabwes-appeal-in-contract-dispute-with-former-employee/",
            "content": "By Mary Taruvinga\n\nThe Constitutional Court has struck down the University of Zimbabwes (UZ) appeal in a long-running labour dispute with former bursar Vengai Mugabe, declaring prior court proceedings a nullity in every sense.\n\nDelivering the judgment, Justice Anne-Mary Gowora ruled that both the Labour Court and the Supreme Court acted without proper jurisdiction.\n\nIt has been made clear that there must be compliance with statutory requirements in order for the court to assert jurisdiction over matters, she said. The lack of adherence to these procedural safeguards rendered the previous judgments ineffective and void.\n\nMugabe, appointed bursar on a fixed-term contract from July 2017 to June 2021, was dismissed following clashes with university management. A labour officer later awarded him US$323,036 for unfair dismissal, a ruling UZ unsuccessfully appealed.\n\nRepresenting Mugabe, attorney Tawanda Zhuwarara said the earlier rulings violated fundamental rights enshrined in sections 56 and 71 of the Constitution, adding that the Supreme Courts decision was an arbitrary deprivation of property.\n\nUZs lawyer, G. Madzoka, countered that the application was nothing more than a disguised appeal, arguing that the underlying issues had already been settled.\n\nJustice Rita Makarau noted the unacceptable failure by lower courts to address preliminary points vital to fairness.\n\nDeclaring both earlier rulings void, the Court found the proceedings fraught with irregularities.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/12142202/UZ-1.png",
            "description": "<p>By Mary Taruvinga The Constitutional Court has struck down the University of Zimbabwe’s (UZ) appeal in a long-running labour dispute with former bursar Vengai Mugabe, declaring prior court proceedings “a nullity in every sense.” Delivering the judgment, Justice Anne-Mary Gowora ruled that both the Labour Court and the Supreme Court acted without proper jurisdiction. “It</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/court-strikes-down-university-of-zimbabwes-appeal-in-contract-dispute-with-former-employee/\">Court strikes down University of Zimbabwe’s appeal in contract dispute with former employee</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "22 Oct 2025"
        }
    ]
}