{
    "news": [
        {
            "title": "Images: Protesters barricade intersection of Rotten Row, Robert Mugabe streets in Harare, chant anti-2030 agenda slogans",
            "url": "https://www.newzimbabwe.com/images-protesters-barricade-intersection-of-rotten-row-robert-mugabe-streets-in-harare-chant-anti-2030-agenda-slogans/",
            "content": "Harare  Protesters have barricaded the intersection of Rotten Row and Robert Mugabe streets in Harare with stones. The group is demonstrating against the extension of President Emmerson Mnangagwas term, singing 2030 taramba and tipeiwo commander.\n\nWATCH:\n\nProtesters barricading Rotten Row & Robert Mugabe junction in Harare.\n\nFollow NewZimbabwe WhatsApp Channelhttps://t.co/4EHrosKaUfpic.twitter.com/7m0oi5XxME\n\n NewZimbabwe.com (@NewZimbabweCom)March 31, 2025\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/31133655/march-5.png",
            "description": "<p>Harare – Protesters have barricaded the intersection of Rotten Row and Robert Mugabe streets in Harare with stones. The group is demonstrating against the extension of President Emmerson Mnangagwa’s term, singing “2030 taramba” and “tipeiwo commander”. WATCH: Protesters barricading Rotten Row & Robert Mugabe junction in Harare. Follow NewZimbabwe WhatsApp Channelhttps://t.co/4EHrosKaUf pic.twitter.com/7m0oi5XxME — NewZimbabwe.com (@NewZimbabweCom)</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/images-protesters-barricade-intersection-of-rotten-row-robert-mugabe-streets-in-harare-chant-anti-2030-agenda-slogans/\">Images: Protesters barricade intersection of Rotten Row, Robert Mugabe streets in Harare, chant anti-2030 agenda slogans</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "31 Mar 2025"
        },
        {
            "title": "Business suffers in Zimbabwe’s major cities amid call for protests",
            "url": "https://www.newzimbabwe.com/business-suffers-in-zimbabwes-major-cities-amid-call-for-protests/",
            "content": "Bloomberg\n\nZimbabwes capital Harare and its second city Bulawayo were quiet on Monday despite calls for protests against the countrys leader.\n\nThe police stepped up security in the city centers while assuring the public in a statement on X that people should feel free to embark on their day-to-day activities.\n\nThe protests were called by opponents of President Emmerson Mnangagwa over suspicions that he is planning to extend his rule after his current term ends in 2028, despite repeated assurances that this isnt the case.\n\nAnger has also been fermented by years of economic mismanagement and sky-high inflation that has collapsed a series of domestic currencies and driven most people to conduct business in dollars.\n\nMnangawas supporters passed a resolution at a ruling party conference in October that he stay in power.\n\nMnangagwa insists he is a constitutionalist and will step down in 2028. But few believe him because he has done nothing to cancel, the resolution, Peter Fabricius, a consultant at the Institute for Security Studies in Pretoria, wrote in a March 28 note.\n\nFirst Vice President Constantino Chiwenga, who, with Mnangagwa led a military takeover to oust long-time ruler Robert Mugabe in November 2017, is seen as the next in line to become president. Thats nurtured speculation he quietly supports the protest call. The government has denied a rift exists between the two men.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/31135513/malls--e1743425738721.jpeg",
            "description": "<p>Bloomberg Zimbabwe’s capital Harare and its second city Bulawayo were quiet on Monday despite calls for protests against the country’s leader. The police stepped up security in the city centers while assuring the public in a statement on X that people should “feel free to embark on their day-to-day activities.” The protests were called by</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/business-suffers-in-zimbabwes-major-cities-amid-call-for-protests/\">Business suffers in Zimbabwe’s major cities amid call for protests</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "31 Mar 2025"
        },
        {
            "title": "WATCH: Police break up flash protest at Robert Mugabe Square",
            "url": "https://www.newzimbabwe.com/watch-police-break-up-flash-protest-at-robert-mugabe-square/",
            "content": "By Staff Reporter\n\nZimbabwe Republic Police (ZRP) officers have dispersed a group of protesters who had gathered at Robert Mugabe Square, also known as Freedom Square, Harare to demonstrate against President Emmerson Mnangagwas government.\n\nDespite being dispersed, the protesters appear to be using Freedom Square as a focal point. They keep returning soon after being chased away by the police, creating a cat-and-mouse situation.\n\nOne of the protesters, identified as Memory, vowed not to leave the area until the protest she came for was complete.\n\nIf it means Im dying here today, let it be. We want our country to be fixed. We cant continue like this, she declared forcefully.\n\nAnother protester, an elderly woman, stated that President Mnangagwa must leave office, arguing that he had failed to address economic challenges and corruption.\n\nHe wants to rule until 2030, doing what exactly? Corruption is everywhere. Our economy has collapsed. He must go now, she said.\n\nDespite the police presence,theprotesters are steadily trickling back to Robert Mugabe Square.\n\nWATCH: Police has just dispersed a flash demonstration at Robert Mugabe Square.\n\nFollow NewZimbabwe WhatsApp Channelhttps://t.co/4EHrosKaUfpic.twitter.com/dIglDnyYVK\n\n NewZimbabwe.com (@NewZimbabweCom)March 31, 2025\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/31103159/IMG-20250331-WA0018.jpg",
            "description": "<p>By Staff Reporter Zimbabwe Republic Police (ZRP) officers have dispersed a group of protesters who had gathered at Robert Mugabe Square, also known as Freedom Square, Harare to demonstrate against President Emmerson Mnangagwa’s government. Despite being dispersed, the protesters appear to be using Freedom Square as a focal point. They keep returning soon after being</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/watch-police-break-up-flash-protest-at-robert-mugabe-square/\">WATCH: Police break up flash protest at Robert Mugabe Square</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "31 Mar 2025"
        },
        {
            "title": "Trump says he is not joking about third presidential term",
            "url": "https://www.newzimbabwe.com/trump-says-he-is-not-joking-about-third-presidential-term/",
            "content": "By Reuters\n\nWASHINGTON  Republican President Donald Trump said on Sunday he was not joking about seeking a third presidential term, which is barred by the U.S. Constitution, but that it was too early to think about doing so.\n\nTrump, who took office on January 20 for his second, non-consecutive White House term, has made allusions to seeking a third one but addressed it directly in a telephone interview with NBC News.\n\nNo, Im not joking. Im not joking, Trump said, but it is far too early to think about it.\n\nThere are methods which you could do it, as you know, he said, declining to elaborate on specific methods.\n\nU.S. presidents are limited to two four-year terms, consecutive or not, according to the 22nd Amendment of the U.S. Constitution.\n\nA proposal to overturn a constitutional amendment requires a two-thirds vote in both houses of Congress and ratification by the legislatures of three-fourths of the 50 U.S. states.\n\nSome Trump allies have floated the idea of keeping Trump in the White House beyond 2028, and the president has also brought up the idea on a number of occasions in a manner that seemed to poke at his political opponents.\n\nTrump, who at 78 was the oldest U.S. president at the time of his inauguration, would be 82 if he took on another four-year term following the November 2028 election.\n\nGeorge Washington in 1796 set the precedent for a two-term presidency, a self-imposed limit that was observed by most U.S. presidents for more than 140 years until Franklin D. Roosevelt in 1940.\n\nRoosevelt, a Democrat who was president during the Great Depression and World War 2, broke tradition and served a third term, then died months into his fourth term in 1945. This paved the way for the amendment on term limits in 1951.\n\nLongtime Trump adviser Steve Bannon said in a March 19 interview with NewsNation that he believes Trump will run again in 2028. Bannon said he and others are looking into ways to make that happen, including examining the definition of a term limit.\n\nWere working on it, Bannon said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/20082232/trump_daywithout_ap_img-e1613365784259.jpg",
            "description": "<p>By Reuters  WASHINGTON — Republican President Donald Trump said on Sunday he was not joking about seeking a third presidential term, which is barred by the U.S. Constitution, but that it was too early to think about doing so. Trump, who took office on January 20 for his second, non-consecutive White House term, has made</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/trump-says-he-is-not-joking-about-third-presidential-term/\">Trump says he is not joking about third presidential term</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "31 Mar 2025"
        },
        {
            "title": "Couple accused of killing niece (4) extradited from South Africa to face justice back home",
            "url": "https://www.newzimbabwe.com/couple-accused-of-killing-niece-4-extradited-from-south-africa-to-face-justice-back-home/",
            "content": "By Staff Reporter\n\nA MARRIED couple has been extradited from South Africa back to Zimbabwe to face justice for allegedly killing their four-year-old niece in 2023 before skipping the border.\n\nOn March 27, 2025, accused persons, John Zvivi (36) and Alista Sibanda (35), were transported back into Zimbabwe following their dramatic arrest in the neighbouring country.\n\nThe duo appeared Saturday before Harare Magistrate Isheunesu Matova, who remanded them in custody and advised to apply for bail at the High Court. They will be back in court on April 11.\n\nCircumstances are that sometime in April 2023, the now deceased Princess Shoko aged four, and her six-year-old sister, Susan Mandaza, were left in the custody of aunt and her husband in Zvimba.\n\nThe childrens mother Nomsa Sibanda is a sister to Alista.\n\nUpon her return to South Africa, Nomsa left the children in the care of the couple who allegedly started to abuse the two children, subjecting them to beatings and denying them food.\n\nCourt heard that in July 2023, Princess Shoko succumbed to injuries inflicted on her and died on July 23, 2023.\n\nIn a bid to cover up their heinous crime, accused persons allegedly placed the childs corpse in a sack, and shoved it in the boot of a Honda Fit vehicle before driving to Kuwadzana Extension, where they dumped the body in a stream.\n\nThe court heard how the accused persons informed Nomsa Sibanda of her daughters death but failed to provide her with a satisfactory explanation.\n\nIt was further heard that the deceased childs mother returned to Zimbabwe and, on August 1, 2023, reported a missing persons case to ZRP Dzivarasekwa.\n\nThe very next day, the slain girls body was found in the stream in Dzvivarasekwa, Harare.\n\nThe remains were positively identified and taken to Parirenyatwa Hospital for a post-mortem. The pathologists findings were inconclusive as toxicology results were still pending.\n\nFearing arrest, the Zvivi and his wife fled to South Africa, but the matter was widely circulated on social media leading to their arrest and eventual extradition.\n\nTakudzwa Jambawu prosecuted the matter.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/28155839/Harare-Magistrates-Court.jpg",
            "description": "<p>By Staff Reporter  A MARRIED couple has been extradited from South Africa back to Zimbabwe to face justice for allegedly killing their four-year-old niece in 2023 before skipping the border. On March 27, 2025, accused persons, John Zvivi (36) and Alista Sibanda (35), were transported back into Zimbabwe following their dramatic arrest in the neighbouring</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/couple-accused-of-killing-niece-4-extradited-from-south-africa-to-face-justice-back-home/\">Couple accused of killing niece (4) extradited from South Africa to face justice back home </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "31 Mar 2025"
        },
        {
            "title": "Cleric Wutawunashe wades into anti-2030 couldron, says Geza is fighting for ‘Zimbabwe’s wrongs to be righted’",
            "url": "https://www.newzimbabwe.com/cleric-wutawunashe-wades-into-anti-2030-couldron-says-geza-is-fighting-for-zimbabwes-wrongs-to-be-righted/",
            "content": "By Staff Reporter\n\nTHE founder and leader of the Family of God Church (FOG), Bishop Andrew Wutawunashe, has made a bold call for his church members to pray for outspoken war veteran Blessed Runesu Bombshell Geza.\n\nLast week, Wutawunashe denounced the growing calls for protests, warning that people would be attempting to crucify their own liberator, that is President Emmerson Mnangagwa.\n\nSpeaking on Sunday at his church, Wutawunashe stated that Geza is the one who can cleanse Zimbabwe with a bathe.\n\nThere is one man we left out, and today I want you to pray for him. This man fought for the liberation of this country, amen, and at some point, when he saw the problems which pained him, he decided just like his namethat this country needs a bath.\n\nDeep in the heart of that man is something that just says this country needs a bath, thats why his name is Geza.\n\nAnd today, Comrade Geza, we want you to know that we appreciate all the sacrifices you did for our nation and the desires you have that the wrongs to the things that are negative, may be righted in our nation, said Wutawunashe.\n\nGezas calls for protests have raised alarm nationwide, prompting the State security agencies to deploy officers, water cannons, and patrol trucks.\n\nMnangagwa has also called for peace during these trying times, which are now a threat to his leadership.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/30044557/wutawunashe.jpg",
            "description": "<p>By Staff Reporter THE founder and leader of the Family of God Church (FOG), Bishop Andrew Wutawunashe, has made a bold call for his church members to pray for outspoken war veteran Blessed Runesu ‘Bombshell’ Geza. Last week, Wutawunashe denounced the growing calls for protests, warning that people would be “attempting to crucify their own</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cleric-wutawunashe-wades-into-anti-2030-couldron-says-geza-is-fighting-for-zimbabwes-wrongs-to-be-righted/\">Cleric Wutawunashe wades into anti-2030 couldron, says Geza is fighting for ‘Zimbabwe’s wrongs to be righted’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "31 Mar 2025"
        },
        {
            "title": "Rufaro erupts! Dynamos happy again following triumph over Simba Bhora",
            "url": "https://www.newzimbabwe.com/rufaro-erupts-dynamos-happy-again-following-triumph-over-simba-bhora/",
            "content": "By Darlington Gatsi\n\nDYNAMOS fans finally got to experience the adrenaline rush associated with victory after the Harare giants defeated Simba Bhora 1-0 in a Castle Lager Premier Soccer League encounter Sunday.\n\nDynamos ended a three-match winless run thanks to a second half goal by Shadrack Nyahwa, who capitalised on poor goalkeeping by Simba Bhoras shot-stopper, William Thole.\n\nThe solitary goal delighted the Dynamos faithfuls, who had endured a frustrating winless streak in the PSL since November last year.\n\nIn the process, Nyahwa became the first Dynamos player to score in the PSL since last season.\n\nThe win also ended an unwanted record for DeMbare, as it was their first victory against Simba Bhora since the latters promotion to the top flight in 2023.\n\nThe victory sparked wild celebrations among the Vietnam end at Rufaro Stadium, which houses the Dynamos supporters who had been starved of success.\n\nDynamos coach Lloyd Chigowe was relieved to have finally found a winning formula, especially in front of their demanding crowd.\n\nI am grateful for the performance by my team. They stuck to instructions. We knew very well that after beating Simba Bhora in the Chibuku Super Cup, they would come at us, but we understood the importance of absorbing pressure and taking our chances, said Chigowe.\n\nThe win lifted DeMbare to sixth place, four points behind Ngezi Platinum, who lead by 10 points.\n\nDynamos are also one of only four teams yet to lose a match in the four games played so far this season.\n\nSimba Bhora coach Joel Luphahla, who has now lost to Chigowe twice this year, conceded that the student was inferior to the teacher.\n\nDynamos were more motivated from the first whistle, and we spoke about how they had nothing to lose. Its disappointing that in four weeks, weve lost twice. It shows that he (Chigowe) is my mentor, said Luphahla.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/11/24052151/dynamos-google-supporter.png",
            "description": "<p>By Darlington Gatsi  DYNAMOS fans finally got to experience the adrenaline rush associated with victory after the Harare giants defeated Simba Bhora 1-0 in a Castle Lager Premier Soccer League encounter Sunday. Dynamos ended a three-match winless run thanks to a second half goal by Shadrack Nyahwa, who capitalised on poor goalkeeping by Simba Bhora’s</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rufaro-erupts-dynamos-happy-again-following-triumph-over-simba-bhora/\">Rufaro erupts! Dynamos happy again following triumph over Simba Bhora</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "31 Mar 2025"
        },
        {
            "title": "Rising tensions in Zimbabwe as Mnangagwa’s ambitions spark outcry from opposition and allies alike",
            "url": "https://www.newzimbabwe.com/rising-tensions-in-zimbabwe-as-mnangagwas-ambitions-spark-outcry-from-opposition-and-allies-alike/",
            "content": "By Peter Fabricius l The Daily Maverick\n\nTENSIONS are rising in Zimbabwe over President Emmerson Mnangagwas evident intention to remain in power after his second term ends in 2028.\n\nZimbabwes constitution explicitly prohibits serving more than two terms, but there are suspicions that Mnangagwa intends somehow to circumvent that provision.\n\nThis is fuelling criticism not just from the political opposition and civil society, but even the ruling Zimbabwe African National Union-Patriotic Front (Zanu-PF) party.\n\nIn particular, Vice-President Constantino Chiwenga is against the move. He has been waiting to be passed the baton  which Mnangagwa supposedly promised him  when together they ousted former president Robert Mugabe in November 2017 in a military takeover.\n\nAmong the rising chorus of critics calling for Mnangagwa to go is a strong faction of war veterans, a key constituency in the Zanu-PF establishment who back Chiwenga. Led by Blessed Bombshell Runesu Geza, the faction plans an uprising against him on 31 March 2025. Geza was a Member of Parliament and a member of Zanu-PFs Central Committee until he was expelled for fanning factionalism.\n\nGeza has gone into hiding and the government is cracking down on anyone transmitting his calls. Alpha Media Holdings (AMH) journalist Blessed Mhlanga was arrested after he broadcast Gezas interviews on AMHs Heart and Soul TV. He has been denied bail twice. Others have gone into hiding.\n\nThis clampdown has provoked widespread criticism in and beyond Zimbabwe.\n\nIdriss Ali Nassah, a senior Human Rights Watch Africa researcher, demanded the immediate release and withdrawal of charges against Mhlanga, which showed the rights to freedom of expression and the media are under serious threat in Zimbabwe.\n\nAgitation\n\nThe agitation dates back to August 2024 when Zanu-PFs National Congress passed Resolution 1, saying Mnangagwas terms as party head and Zimbabwes president should be extended beyond 2028 to 2030  and that the countrys constitution be amended accordingly.\n\nMnangagwa insists he is a constitutionalist and will step down in 2028. But few believe him because he has done nothing to cancel Resolution 1. Stepping down would also mean abandoning the vast wealth he and his faction in Zanu-PF have accumulated over the years, largely through graft.\n\nThis is perhaps the key grievance of his enemies. In a broadcast from a hidden location on Wednesday, Geza listed alleged Mnangagwa business cronies who he said had grown fat on corrupt government contracts.\n\nBut how Mnangagwa would remain in office constitutionally is unclear. An anonymous senior opposition leader, also one of the constitutions architects, told ISS Today that three safeguards in the constitution prevented anyone from seeking a third term. These include that: no one should serve more than two terms; constitutional amendments require approval by a national referendum; and no incumbent can benefit from a constitutional amendment.\n\nSo, the legal obstacles to Mnangagwa seeking a third term were considerable, he said. As are the political obstacles  and especially that the necessary referendum would probably turn into a referendum on Mnangagwas rule. Considering the broad unhappiness with him, that would be a hard vote to win.\n\nThe opposition leader thought Mnangagwas strategy would simply be to extend his term and those of current parliamentarians. This would still require amending the constitution, but he suspected Mnangagwas faction believed they could pass an amendment without a referendum.\n\nIts hard to assess how serious these rumblings are, if there will be a 31 March uprising, and whether that might unseat Mnangagwa.\n\nPolitical loyalties\n\nIt was the military, then headed by Chiwenga, that removed Mugabe in 2017, so speculation about its political loyalties is rife.\n\nDaily Maverick recently quoted unnamed military sources saying Chiwenga still commanded considerable support in the Zimbabwe Defence Forces. However, Mnangagwa retains the allegiance of Defence Force Chief General Philip Valerio Sibanda.\n\nIbbo Mandaza, the director of Zimbabwes Sapes Trust, told ISS Today: I dont know whether its a coup in the making, but all indications are that the centre can no longer hold.\n\nBrian Raftopoulos, a Zimbabwe and democracy expert at the University of Cape Towns Nelson Mandela School of Public Governance, believes there is real danger of an upheaval.\n\nHe says Chiwengas resentment about Mnangagwas broken promise to step down in 2028 is creating divisions in Zanu-PF, the military and the security establishment. But he doesnt foresee the kind of massive support on the streets they had in 2017.\n\nDavid Moore, retired professor of development studies at the University of Johannesburg, agreed, saying: I would be surprised if a lot of people participated.\n\nHe doubted that the main opposition party  the greatly weakened Citizens Coalition for Change  would join in, as that would show they had given up on rallying the masses, choosing instead to ally with a faction of the ruling party and the military, thus perhaps verifying what some observers already think.\n\nRaftopoulos added that civil society was also weak. He said that even if there were violent protests within Zanu-PF, Mnangagwa is going to keep this under control. For example, he noted how Mnangagwa shifted Zimbabwe National Army Lieutenant-General Anselem Sanyatwe (believed to be a Chiwenga supporter) to Minister of Sport, Recreation and Culture  perceived as a huge demotion.\n\nAnd, he will continue to move people he feels that he cant trust. The long run for him is either to contain Chiwenga as much as possible, or push him out and isolate him.\n\nThere would be disturbances and unrest, maybe even an attempt to oust Mnangagwa. But whether it will be a full-blown coup attempt, I have my doubts.\n\nProtests\n\nAnd Raftopoulos believes regional and global politics will be on Mnangagwas side if he does crack down on protests.\n\nThe global rise of the right has given traction to authoritarians like Mnangagwa. He can now say to the West, especially the Trump administration, who are you to talk to us about democracy?\n\nHe said Zimbabwe was no longer on the European Unions watch list either, So (Mnangagwa) wont have to worry about any kind of blowback from the North, if he gets violent.\n\nAnd the Southern African Development Community (SADC)  which Mnangagwa now chairs  is too preoccupied with other issues like the Democratic Republic of the Congo to do anything, according to Raftopoulos.\n\nMnangagwa might also have in mind that neither the SADC nor the African Union took action after the November 2017 overthrow, even though their rules stipulate that member states be suspended after a coup.\n\nOne does not wish a military coup on Zimbabwe, especially if it just replaces one rapacious Zanu-PF faction with another. But neither does one wish to see Mnangagwa smash any protests while an indifferent world looks on. The region should intervene. DM\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/03005736/SONA-1-Mnangagwa.png",
            "description": "<p>By Peter Fabricius l The Daily Maverick  TENSIONS are rising in Zimbabwe over President Emmerson Mnangagwa’s evident intention to remain in power after his second term ends in 2028. Zimbabwe’s constitution explicitly prohibits serving more than two terms, but there are suspicions that Mnangagwa intends somehow to circumvent that provision. This is fuelling criticism not</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rising-tensions-in-zimbabwe-as-mnangagwas-ambitions-spark-outcry-from-opposition-and-allies-alike/\">Rising tensions in Zimbabwe as Mnangagwa’s ambitions spark outcry from opposition and allies alike</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "31 Mar 2025"
        },
        {
            "title": "March 31 protests: Wicknell Chivayo shields Mnangagwa from militant war veteran Blessed ‘Bombshell’ Geza",
            "url": "https://www.newzimbabwe.com/march-31-protests-wicknell-chivayo-shields-mnangagwa-from-militant-war-veteran-blessed-bombshell-geza/",
            "content": "By Darlington Gatsi\n\nAFTER sustaining a barrage of threats from combative war veteran Blessed Bombshell Runesu Geza and his acolytes, Zanu PF-linked tenderprenuer Wicknell Chivayo has jumped to shield President Emmerson Mnangagwa from the planned nationwide protests.\n\nMnangagwa is facing mounting pressure from a disgruntled clique of war veterans, fronted by Geza, who are calling for his ouster, accusing him of presiding over corruption in his failed government.\n\nThe protest threats have sent the government into defensive mode, deploying security apparatus to thwart the demonstrations.\n\nBlessed Runesu Bombshell Geza\n\nControversial businessman Chivayo, has taken a swipe at Geza, saying the former liberation war combatant lacks political clout and should not be taken seriously.\n\nZimbabwe is a peaceful nation, known for its educated and responsible citizens, most of whom carry Christian values and are law-abiding. The reckless call for an illegal uprising and incitement to violence is totally unZimbabwean and must be rejected by every peace-loving citizen.\n\nAt the centre of this chaos is an individual who no longer deserves the respected title of Cde but a chap called Blessed Geza, a useless, failed politician and fugitive from justice, whose only remaining strategy is to provoke instability from his self-imposed exile.\n\nExpelled from Zanu PF for his dishonourable conduct, Geza has become a political nonentity, desperately trying to stay relevant by leading a criminal cartel of fugitives and bitter opposition remnants, said Chivayo in a social media post.\n\nChivayo has become a target of Gezas threats, accused of directly benefitting from corruption through government contracts.\n\nLast year, Chivayo was embroiled in controversy after it emerged that he fronted a company awarded a US$100 million tender by the Zimbabwe Electoral Commission (ZEC) to supply materials for the 2023 general elections.\n\nHe was also on a list of individualsincluding Kudakwashe Tagwirei warned by Geza. In a suspicious move, cars were torched Thursday night at the premises of the two business tycoons.\n\nChivayo said the March 31 protests equate to terrorism against the government.\n\nTo shift from legal and peaceful demonstrations and start burning vehicles, destroying property belonging to innocent individuals, and calling for the violent removal of a government is illegal, treasonous, and easily qualifies as terrorism.\n\nNo serious, patriotic Zimbabwean should entertain this. I urge all citizens to ignore the empty call to protest tomorrow or on any other day called for by anarchists such as Geza. Let us all continue normally with our lives tomorrow and beyond, said Chivayo.\n\nThe call to protest against Mnangagwa has laid bare the factional battles simmering within the ruling party.\n\nAt Thursdays Zanu PF Central Committee meeting, Mnangagwa read the riot act, warning party members backing Geza.\n\nChivayo further stated that those harbouring leadership ambitions should wait for Mnangagwa to step down after his term expires in 2028.\n\nPresident Mnangagwa still has three full years remaining in his term, and he has publicly pledged to step down at the end of itas a true constitutionalist. If anyone has ambitions, they must respect party processes and wait for the next congress.\n\nWhen that time comes, I personally will support whoever has been democratically elected, with every prayer and every cent I have saved, to ensure we keep Zanu PF as the ruling party forever and ever, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/13064002/CHIVAYO-MNANGWA.webp",
            "description": "<p>By Darlington Gatsi  AFTER sustaining a barrage of threats from combative war veteran Blessed ‘Bombshell’ Runesu Geza and his acolytes, Zanu PF-linked tenderprenuer Wicknell Chivayo has jumped to shield President Emmerson Mnangagwa from the planned nationwide protests. Mnangagwa is facing mounting pressure from a disgruntled clique of war veterans, fronted by Geza, who are calling</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/march-31-protests-wicknell-chivayo-shields-mnangagwa-from-militant-war-veteran-blessed-bombshell-geza/\">March 31 protests: Wicknell Chivayo shields Mnangagwa from militant war veteran Blessed ‘Bombshell’ Geza</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "31 Mar 2025"
        },
        {
            "title": "Scottland F.C salvage a point against Highlanders at Barbourfields",
            "url": "https://www.newzimbabwe.com/scottland-f-c-salvage-a-point-against-highlanders-at-barbourfields/",
            "content": "By Sports Reporter\n\nMTHOKOZISI Msebes 92nd goal was all Scottland needed to walk away with a point against Highlanders at Barbourfields Sunday afternoon in a match that ended in a 1-1 draw.\n\nThe result saw Highlanders registering a second consecutive draw following a 2-2 away outcome against Green Fuel a fortnight ago.\n\nBosso had a good first half show, which saw then creating several chances, only to be denied by Scottlands resolute back line led by Peter Muduwa, an ex-Highlanders player.\n\nComing back to the second half Scottland seemed hungrier for a goal, with team coach Tonderai Ndiraya introducing star players Khama Billiat and Walter Musona in the 67th minute.\n\nThe duo, however, did not make much impact after failing to create chances upfront.\n\nHighlanders goal came in the 82nd minute, thanks to Andrew Mbeba, who delivered a direct free kick.\n\nThe visitors did not stay behind for too long after Msebe headed on target to pick a point for his side.\n\nCommenting after the match, Highlanders coach Kelvin Kaindu said, I am a bit dissapointed. Our tactics didnt work as planned.This is how we drew again the last game.\n\nWith a bit of luck, we could have won, and with such an atmosphere l honestly think we should have won.\n\nHaving salvaged a point, Scottland coach Ndiraya applauded his boys for the performance.\n\nI think it was a good game. It was 50/50 in the second half; we were a bit better. We came back, and we should a good character to pick this point.\n\nThis is a new team, so coming here to Barbourfields to pick a point is a good thing, Ndiraya said.\n\nSundays outcome left Scottland on seven points after four games, while Highlanders are on five points from as many games.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/28165838/WhatsApp-Image-2025-02-28-at-18.58.14.jpeg",
            "description": "<p>By Sports Reporter MTHOKOZISI Msebe’s 92nd goal was all Scottland needed to walk away with a point against Highlanders at Barbourfields Sunday afternoon in a match that ended in a 1-1 draw. The result saw Highlanders registering a second consecutive draw following a 2-2 away outcome against Green Fuel a fortnight ago. Bosso had a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/scottland-f-c-salvage-a-point-against-highlanders-at-barbourfields/\">Scottland F.C salvage a point against Highlanders at Barbourfields</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "31 Mar 2025"
        }
    ]
}