{
    "news": [
        {
            "title": "Panic grips Chegutu residents after sighting of stray lion",
            "url": "https://www.newzimbabwe.com/panic-grips-chegutu-residents-after-sighting-of-stray-lion/",
            "content": "By Staff Reporter\n\nRESIDENTS of Chegutu town in Mashonaland West province are living in fear after a stray lion was spotted roaming in nearby bushes, causing widespread panic.\n\nThe big cat, believed to have wandered away from a nearby wildlife area, was seen prowling along Chakari road, sending shockwaves among locals.Authorities have been alerted, and efforts are underway to safely capture and relocate the lion.Zimbabwe Parks and Wildlife Management Authority (ZimParks) spokesperson, Tinashe Farawo confirmed the news.ZimParks has confirmed a lion sighting along Chakari road in Chegutu. A reaction team is actively tracking the animal after discovering spoors and hearing roars in the area, said Farawo in a statement.Meanwhile, residents are advised to remain vigilant and avoid secluded areas, where the lion could hide.We advise the public to exercise caution by avoiding bushy, isolated areas, especially near open water sources during early morning and at night, he added.ZimParks urged the public to pen livestock and closely monitor the movement of children.\n\nThe big cat, believed to have wandered away from a nearby wildlife area, was seen prowling along Chakari road, sending shockwaves among locals.\n\nAuthorities have been alerted, and efforts are underway to safely capture and relocate the lion.Zimbabwe Parks and Wildlife Management Authority (ZimParks) spokesperson, Tinashe Farawo confirmed the news.ZimParks has confirmed a lion sighting along Chakari road in Chegutu. A reaction team is actively tracking the animal after discovering spoors and hearing roars in the area, said Farawo in a statement.Meanwhile, residents are advised to remain vigilant and avoid secluded areas, where the lion could hide.We advise the public to exercise caution by avoiding bushy, isolated areas, especially near open water sources during early morning and at night, he added.ZimParks urged the public to pen livestock and closely monitor the movement of children.\n\nAuthorities have been alerted, and efforts are underway to safely capture and relocate the lion.\n\nZimbabwe Parks and Wildlife Management Authority (ZimParks) spokesperson, Tinashe Farawo confirmed the news.ZimParks has confirmed a lion sighting along Chakari road in Chegutu. A reaction team is actively tracking the animal after discovering spoors and hearing roars in the area, said Farawo in a statement.Meanwhile, residents are advised to remain vigilant and avoid secluded areas, where the lion could hide.We advise the public to exercise caution by avoiding bushy, isolated areas, especially near open water sources during early morning and at night, he added.ZimParks urged the public to pen livestock and closely monitor the movement of children.\n\nZimbabwe Parks and Wildlife Management Authority (ZimParks) spokesperson, Tinashe Farawo confirmed the news.\n\nZimParks has confirmed a lion sighting along Chakari road in Chegutu. A reaction team is actively tracking the animal after discovering spoors and hearing roars in the area, said Farawo in a statement.Meanwhile, residents are advised to remain vigilant and avoid secluded areas, where the lion could hide.We advise the public to exercise caution by avoiding bushy, isolated areas, especially near open water sources during early morning and at night, he added.ZimParks urged the public to pen livestock and closely monitor the movement of children.\n\nZimParks has confirmed a lion sighting along Chakari road in Chegutu. A reaction team is actively tracking the animal after discovering spoors and hearing roars in the area, said Farawo in a statement.\n\nMeanwhile, residents are advised to remain vigilant and avoid secluded areas, where the lion could hide.We advise the public to exercise caution by avoiding bushy, isolated areas, especially near open water sources during early morning and at night, he added.ZimParks urged the public to pen livestock and closely monitor the movement of children.\n\nMeanwhile, residents are advised to remain vigilant and avoid secluded areas, where the lion could hide.\n\nWe advise the public to exercise caution by avoiding bushy, isolated areas, especially near open water sources during early morning and at night, he added.ZimParks urged the public to pen livestock and closely monitor the movement of children.\n\nWe advise the public to exercise caution by avoiding bushy, isolated areas, especially near open water sources during early morning and at night, he added.\n\nZimParks urged the public to pen livestock and closely monitor the movement of children.\n\nZimParks urged the public to pen livestock and closely monitor the movement of children.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/26142156/Lion.jpg",
            "description": "<p>By Staff Reporter  RESIDENTS of Chegutu town in Mashonaland West province are living in fear after a stray lion was spotted roaming in nearby bushes, causing widespread panic. The big cat, believed to have wandered away from a nearby wildlife area, was seen prowling along Chakari road, sending shockwaves among locals. Authorities have been alerted,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/panic-grips-chegutu-residents-after-sighting-of-stray-lion/\">Panic grips Chegutu residents after sighting of stray lion </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "27 Jun 2025"
        },
        {
            "title": "Stigma, discrimination remain the most damaging barriers to Zimbabwe’s HIV response – Health Minister",
            "url": "https://www.newzimbabwe.com/stigma-discrimination-remain-the-most-damaging-barriers-to-zimbabwes-hiv-response-health-minister/",
            "content": "By Anna Chibamu\n\nSTIGMA and discrimination remain the most damaging barriers to the countrys national HIV response, Health and Child Care Minister Douglas Mombeshora has said.\n\nAddressing journalists at a Zimbabwe National Network of People Living with HIV (ZNNP+) breakfast meeting in Harare this Thursday, Mombeshora said stigma discouraged vital actions meant to reduce the spread and treatment of HIV.\n\nThe stigma index 2.0 has risen to 69.7% from 65% between 2018 and 2023.\n\nStigma and discrimination remain among the most damaging barriers to Zimbabwes national HIV response.\n\nFor people living with HIV, the impact goes beyond emotional distress. It is structural and systemic. Stigma, isolated individuals, erode their self-worth and discourage vital actions like HIV testing, disclosure and adherence to treatment.\n\nDiscrimination in families, workplaces, health care settings and communities creates fear and silence that allow the virus to spread unchecked, Mombeshora said.\n\nOur collective commitment must be to build a pathway where every person living with HIV is treated with dignity, respect and compassion, free from judgment and fully supported to live a healthy, productive life.\n\nThe minister reported that the World Health Organisation emphasised that quality health care involved not only medicines, access, but also dignity, equity and inclusivity.\n\nDiscrimination in health care, such as segregated queues, bridges of confrontation or denial of care, atomised public trust, discourages service use and perpetuates inequities.\n\nResearch shows internalised stigma leads to shame, isolation, depression and loss of obesity, which reduce mental wellbeing and deter engagement with HIV services, the minister told the media.\n\nHe warned that fear of judgment causes delayed care, increasing risks of late diagnosis and treatment failure, undermining individual and public health.\n\nMombeshora commended the ZNNP+ for playing a pivotal role in shaping the countrys national HIV response.\n\nYou share public awareness, foster accountability and encourage dialogue that informs everything best decisions. You are not only merely conveyors of information, you are agenda setters, influencers of public sentiment and advocates for justice. Your voices are essential to advancing health equity, dispelling myths and amplifying the resilience of those affected by HIV.\n\nTo date, Zimbabwe has 1.3 million Zimbabweans living with HIV and over 96% are accessing life-saving antiretroviral therapy.\n\nWe have reached the UNAs 95-95-95 targets ahead of schedule, a milestone reflecting our strong infrastructure, committed healthcare workers and effective multi-sector collaboration.\n\nThe countrys gains on HIV remain fragile, according to Mombeshora.\n\nOur gains remain fragile. Between January and June this year, Zimbabwe recorded 5,932 AIDS-related deaths compared to 5,712 in the same period in 2024, an increase of 220 deaths. Reminding us, our work is still not done.\n\nThis rise is not due to partial withdrawal of partner support. By the time key partners like the US government withdrew some funding, our institutions had adequate ARR fees and supplies.\n\nThe minister highlighted that Zimbabwes systems had shown resilience and continued to monitor closely to ensure uninterrupted treatment.\n\nThe government has mobilised domestic resources through SIM taxes on alcohol, tobacco, sugar drinks at the AIDS level to protect ARR fees, stockpiles and maintain service continuity.\n\nThe Finance Ministry is reinforcing but in allocations, while we engage strategic partners to close funding gaps.\n\nWe must, however, be candid. The transition to full domestic financing introduces complex challenges, said the Minister.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/19201620/mombeshora.jpeg",
            "description": "<p>By Anna Chibamu STIGMA and discrimination remain the most damaging barriers to the country’s national HIV response, Health and Child Care Minister Douglas Mombeshora has said. Addressing journalists at a Zimbabwe National Network of People Living with HIV (ZNNP+) breakfast meeting in Harare this Thursday, Mombeshora said stigma discouraged vital actions meant to reduce the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/stigma-discrimination-remain-the-most-damaging-barriers-to-zimbabwes-hiv-response-health-minister/\">Stigma, discrimination remain the most damaging barriers to Zimbabwe’s HIV response – Health Minister</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "27 Jun 2025"
        },
        {
            "title": "Chevrons to host Sri Lanka in white-ball series",
            "url": "https://www.newzimbabwe.com/chevrons-to-host-sri-lanka-in-white-ball-series/",
            "content": "By Sports Reporter\n\nZimbabwe Cricket (ZC) has announced Sri Lanka will be in the countrylater this year for a white-ball series to be played at Harare Sports Club.\n\nThe upcoming tour features two One-Day Internationals scheduled for 29 and 31 August, followed by three Twenty20 Internationals on 3, 6 and 7 September.\n\nWe are delighted to confirm Sri Lankas visit to Zimbabwe for what we expect to be a thrilling and competitive series, said Zimbabwe Cricket managing director Givemore Makoni.\n\nZimbabwe will use the T20I games as part of preparations for the ICC Mens T20 World Cup Africa Regional Finals which they will host from September 19 to October 4.\n\nMatches between our two nations have always produced entertaining cricket and this tour comes at a crucial time for our team as we prepare for the upcoming T20 World Cup qualifying campaign, added Makoni.\n\nThe top two teams from the ICC Mens T20 World Cup Africa Regional Finals will qualify for the 2026 World Cup which will be jointly hosted by India and Sri Lanka.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/01/15041235/sri-lanka-zim-cricket.jpeg",
            "description": "<p>By Sports Reporter Zimbabwe Cricket (ZC) has announced Sri Lanka will be in the country later this year for a white-ball series to be played at Harare Sports Club. The upcoming tour features two One-Day Internationals scheduled for 29 and 31 August, followed by three Twenty20 Internationals on 3, 6 and 7 September. “We are delighted</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chevrons-to-host-sri-lanka-in-white-ball-series/\">Chevrons to host Sri Lanka in white-ball series</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "27 Jun 2025"
        },
        {
            "title": "Lack of funding dampens elephant conservation efforts – ZimParks",
            "url": "https://www.newzimbabwe.com/lack-of-funding-dampens-elephant-conservation-efforts-zimparks/",
            "content": "By Mary Taruvinga\n\nThe Zimbabwe Parks and Wildlife Management Authority (ZimParks) has said the lack of funding to manage elephants in its game reserves is negatively impacting elephant conservation efforts, leading to increased human-wildlife conflict.\n\nThe authority is working with a budget of US$500,000 at its biggest game reserve, Hwange National Park, against the required US$21 million to manage the ever-increasing elephant population.\n\nZimParks recently hosted a review and updating workshop on the Zimbabwe Elephant Management Plan (2021-2025) to assess implementation of the plan, emerging issues, evaluate management approaches, and exploring effective strategies from past experiences which was for the first time attended by chiefs from Hwange.\n\nIn a statement issued on Thursday, ZimParks spokesperson Tinashe Farawo said chiefs complained that their affected communities have not benefited from their proximity to the wildlife.\n\nThe chiefs expressed their concerns on the lack of tangible benefits for communities who bear the brunt of sharing borders with elephants and a relief fund for injured community people.\n\nThe traditional leaders expressed concerns over the ongoing poverty faced by these communities, worsened by crop raiding, resource competition, and incidents of injury and property damage caused by elephants, he said.\n\nThe increased elephant populations and localised overabundance have resulted in increased human-elephant conflicts.\n\nAccording to Farawo, while this is happening, ZimParks efforts to curb the crisis are dampened by a lack of resources.\n\nThe countrys elephant conservation efforts are severely under-financed, with the current budget for Hwange National Park falling below US$500,000 annually, compared to the estimated US$21 million required based on management costs in other well-managed protected areas in Southern Africa, he said.\n\nFarawo also said sustainable utilisation is hindered by various factors, including global trade restrictions.\n\nMeanwhile, while elephant poaching for ivory has declined, effective partnerships have played a vital role in enhancing conservation efforts.\n\nFarawo said elephant conservation requires collective efforts from all stakeholders.\n\nZimbabwe has the second-largest elephant population in the world, with an estimated 82,000 elephants.\n\nWhile Zimbabwe is lauded for its conservation efforts, the elephant population is growing faster than the environment can sustain, leading to human-wildlife conflict and habitat degradation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/25193036/Zimbabwe-Elephants.png",
            "description": "<p>By Mary Taruvinga The Zimbabwe Parks and Wildlife Management Authority  (ZimParks) has said the lack of funding to manage elephants in its game reserves is negatively impacting elephant conservation efforts, leading to increased human-wildlife conflict. The authority is working with a budget of US$500,000 at its biggest game reserve, Hwange National Park, against the required</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/lack-of-funding-dampens-elephant-conservation-efforts-zimparks/\">Lack of funding dampens elephant conservation efforts – ZimParks</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "27 Jun 2025"
        },
        {
            "title": "UN Women hails Zimbabwe’s progress on gender equality",
            "url": "https://www.newzimbabwe.com/un-women-hails-zimbabwes-progress-on-gender-equality/",
            "content": "APA News\n\nThe UN Women executive board has commended Zimbabwe for its strides in promoting gender equality and womens empowerment.\n\nSpeaking after a week-long visit led by board president Nicola Clase, the UN agency praised Zimbabwes legal frameworks supporting womens rights.\n\nI note the strong legal frameworks for gender equality and womens empowerment. We encourage the government and partners to focus on the effective implementation of these laws, said Clase who is Swedens permanent representative to the UN in New York.\n\nThe visit featured high-level discussions, including a meeting with President Emmerson Mnangagwa who reiterated his administrations commitment to gender parity.\n\nGender equality is not only a fundamental right, but also a necessity for national growth, Mnangagwa said.\n\nThe delegation also met with Women Affairs Minister Monica Mutsvangwa and Speaker of Parliament Jacob Mudenda, both of whom highlighted legislative and policy initiatives aimed at advancing womens social and economic inclusion.\n\nField visits to projects supported by UN Women  including the Umzingwane and Epworth Safe Markets and the Maker Space Innovation Hub  offered tangible evidence of community-level impact.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/26210102/schoolgirls-1536x1024-1.webp",
            "description": "<p>APA News The UN Women executive board has commended Zimbabwe for its strides in promoting gender equality and women’s empowerment. Speaking after a week-long visit led by board president Nicola Clase, the UN agency praised Zimbabwe’s legal frameworks supporting women’s rights. “I note the strong legal frameworks for gender equality and women’s empowerment. We encourage</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/un-women-hails-zimbabwes-progress-on-gender-equality/\">UN Women hails Zimbabwe’s progress on gender equality</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "27 Jun 2025"
        }
    ]
}