{
    "news": [
        {
            "title": "Internet abuzz as Anele Mdoda flashes diamond ring on red carpet",
            "url": "https://www.newzimbabwe.com/internet-abuzz-as-anele-mdoda-flashes-diamond-ring-on-red-carpet/",
            "content": "Anele Mdodas diamond ring on the fourth finger of her left hand has set the internet abuzz after her attendance at the 97th Academy Awards in Hollywood on Sunday.\n\nThe media personality, who co-produced a short film titledThe Last Rangerwhich was nominated for Best Live-Action Short Film, walked the Oscars red carpet in a Xhosa-inspired red and black dress designed by Asanda Madyibi.\n\nShe posted on Instagram that it was themost complimented dress at the Oscars.\n\nThe Last Rangeris the first Xhosa anything to be nominated for an Oscar so I thought it fitting to rock Xhosaaesthetic. UmbhacoXhosa traditional wear and as you can see, its worldly and, most importantly, regal. Thank you, Asanda. Brief nailed, she captioned the Instagram post.\n\nBut it was the sparkly diamond on her ring finger that sparked questions about her relationship status.\n\nRing finger Maam, one Instagram user wrote in the comments of her picture.\n\nCongratulations on the engagement, I did say last December that lobola is coming? another wrote.\n\nDuring her appearance on Lasizwe DambuzasAwkward Dateson YouTube, Anele was asked why she had a ring on her finger, to which she responded cause Im married.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/04184327/anele-ring.png",
            "description": "<p>Anele Mdoda’s diamond ring on the fourth finger of her left hand has set the internet abuzz after her attendance at the 97th Academy Awards in Hollywood on Sunday. The media personality, who co-produced a short film titled The Last Ranger which was nominated for Best Live-Action Short Film, walked the Oscars red carpet in a Xhosa-inspired</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/internet-abuzz-as-anele-mdoda-flashes-diamond-ring-on-red-carpet/\">Internet abuzz as Anele Mdoda flashes diamond ring on red carpet</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "04 Mar 2025"
        },
        {
            "title": "Where are they? Media fraternity seeks answers on missing journalist Aserie Ndlovu and partner",
            "url": "https://www.newzimbabwe.com/where-are-they-media-fraternity-seeks-answers-on-missing-journalist-aserie-ndlovu-and-partner/",
            "content": "IOL\n\nIt has been two weeks since community radio journalist Aserie Sibusiso Ndlovu and his partner Zodwa Precious Mdhluli vanished without a trace, and despondency has been growing among members of the media fraternity across South Africa.\n\nNdlovu runs his CapitalLive FM, a community radio station with offices at Denlyn Mall in Mamelodi, east of Pretoria.\n\nAccording to the couples families, Ndlovu and Mdhluli went missing on February 18 even though they were in different provinces. Ndlovu left Denlyn Mall in Gauteng in the evening of February 18 while his lover vanished from Mpumalanga.\n\nNdlovu was last seen wearing blue jeans, a blue and white long-sleeve shirt, and Nike sneakers. His mobile phone is not reachable.\n\nOn Monday, IOL reported that police in Gauteng are searching for Ndlovu and Mdhluli. Provincial police spokesperson Lieutenant Colonel Mavela Masondo confirmed that Ndlovu was reported missing in Mamelodi.\n\nHe was last seen leaving his workplace on the 18th of February 2025 at approximately 6pm.\n\nPolice are appealing to anyone who might have information that can help in the search to please call Sergeant Lekganyane on 082 768 6433 or call the nearest police station, he said.\n\nVeteran journalist, communications specialist and chairperson of the African Media and Communicators Forum, Elijah Mhlanga said the disappearance of Ndlovu and Mdhluli has caused anxiety within the South African media circles.                      As the African Media and Communication Forum we are extremely worried and anxious about our brother and colleague Aserie Ndlovu and his wife Zodwa Mdlhluli. With each passing day we become increasingly concerned about their safety, Mhlanga told IOL.\n\nWe hope they are alive and that they will return to tell of their ordeal. Its a complex situation which the police will hopefully be able to solve. All we need is our brother and his wife back.\n\nSithembile Moyo, publisher and owner of Inner City Gazette and Joburg Gazette added her voice to the demands for the missing couples safe return.\n\nThe disappearance of Aserie has left an unsettling void in our community, and were united in our call for his safe return. As colleagues, were deeply invested in Aseries well-being and that of his girlfriend, and we urge anyone with information to come forward. His absence has sparked a wave of concern and uncertainty, and were committed to support his loved ones until the couple is found, she said.\n\nWe stand in solidarity, demanding answers and action to ensure Aserie and Zodwas safe return and reunification with their families and friends. Our thoughts are with Aserie and Zodwas loved ones during this challenging time, and well continue to advocate for their safe return, until they are back home.\n\nSouth African-based Turkish journalist Turkmen Terzi who is Ndlovus friend told IOL that he has been thrust into distressby the news of Ndlovus disappearance.\n\nAserie is not just a journalist, he is a father, a husband, and a son. Zodwa, too, has a family anxiously waiting for her. Their absence is a painful reminder of the risks we face in this field. I understand Aseries situation all too well, as I have personally faced threats from Turkish authorities due to my reporting on President Recep Tayyip Erdoans corruption and the unresolved mysteries surrounding the July 15, 2016, coup attempt. Under Erdoans rule, 170 media houses have been shut down, and critical journalists have been silenced, said Terzi.\n\nWhile I deeply value South Africas media freedom, the high crime rate poses significant dangers, and kidnappings have become alarmingly frequent. Although we do not yet know what happened to Aserie and Zodwa, this tragedy underscores the urgent need for greater security measures to protect journalists. Media practitioners must remain vigilant, and law enforcement must ensure our safety.\n\nMedia specialist Lazarus Tshwari also added his voice: I am worried about Aseries mysterious disappearance, no one can just disappear like that, one in Gauteng and his partner in Mpumalanga. This is very concerning. Im praying for their safe return.\n\nTelevision news reporter, Princess Siziba told IOL that the disappearance of Ndlovu and Mdhluli has rekindled memories of her tough experiences while gathering news.\n\nEvery time his disappearance crosses my mind, l try to brush it away because l know if he is kept in captivity ,l know what he is going through cos l have been there and its something l dont wish on anyone. l spoke to Aserie a week before his disappearance. He was joking about me taking pictures of him regularly, yet I do not send the pictures to him. Such a humble person.\n\nI personally plead for his safe return, said Siziba.\n\nOn the other hand, veteran journalist and photographer, Diana Chiyangwa also pleaded for the safe return of the missing couple.\n\nThe disappearance of Aserie Ndlovu and his partner comes three months after I attended and participated in the African Investigative Journalism Conference in Wits University. Journalism is not a crime was our motto, it resonates with the couples disappearance and I believe they chose this career to tell peoples stories and their everyday experiences, she said.\n\nTheir disappearance raises concerns if the targeting of journalists is a new trend. We have seen it happening in Zimbabwe and in other countries in the Southern African region.We plead for the couples safe return. We also plead with SAPS to add more resources to find Aserie and his partner.\n\nOn Sunday, family representative Vusi Mahlasela appealed to anyone that can assist to help find Ndlovu and his partner.Mahlasela also urged people to also pray for the missing couple.\n\nHave positive prayers, more so that the couple can come back home safely. We are not going to talk about them as past tense. We have to be positive and be positive.\n\nThinking is like a constant prayer. Lets think positive. And that we will be able to see them. All the family is asking for is help from all sides, all corners, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/04050835/aserie.webp",
            "description": "<p>IOL It has been two weeks since community radio journalist Aserie Sibusiso Ndlovu and his partner Zodwa Precious Mdhluli vanished without a trace, and despondency has been growing among members of the media fraternity across South Africa. Ndlovu runs his CapitalLive FM, a community radio station with offices at Denlyn Mall in Mamelodi, east of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/where-are-they-media-fraternity-seeks-answers-on-missing-journalist-aserie-ndlovu-and-partner/\">Where are they? Media fraternity seeks answers on missing journalist Aserie Ndlovu and partner</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "04 Mar 2025"
        },
        {
            "title": "Deaf Zimbabwe Trust halts crucial disability programs amid US foreign aid cuts",
            "url": "https://www.newzimbabwe.com/deaf-zimbabwe-trust-halts-crucial-disability-programs-amid-us-foreign-aid-cuts/",
            "content": "By Staff Reporter\n\nThe Deaf Zimbabwe Trust (DZT), a local nonprofit organization dedicated to empowering persons with disabilities, particularly within the deaf community, is facing a severe funding crisis that has led to the suspension of several key programs.\n\nThis crisis follows a US Executive Order by President Donald Trump that cut foreign aid.\n\nIn a statement, DZT revealed that the reduction in funding has forced the organization to cut staffing levels and decrease operational capacity.\n\nThe organization has experienced a substantial reduction in funding, which has directly affected staffing levels and overall operational capacity. The cessation of funding has led to the suspension of crucial programs, including entrepreneurship training and informal apprenticeship opportunities.\n\nThese programs were essential for fostering skills development and providing pathways to financial inclusion for these young people. The halt in these initiatives not only stifles their potential for economic empowerment but also affects their confidence and self-esteem.\n\nThe opportunities to equalise opportunities between youths with disabilities and those without disabilities have been lost, reads the statement.\n\nDZT is now actively exploring various options to sustain its operations.\n\nThis includes leveraging technology and community partnerships to continue the momentum built over the years. The passionate team at DZT, comprised of individuals deeply committed to their mission, serves as a driving force to navigate these difficult times.\n\nBy implementing these strategies, DZT aims not only to mitigate the impact of the recent stop work order but also to ensure that their important mission of empowering youths with disabilities continues to thrive. Through resilience and innovation, DZT is determined to create lasting change and improve the lives of those they serve, reads the statement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/04044553/hearing-aid.jpg",
            "description": "<p>By Staff Reporter The Deaf Zimbabwe Trust (DZT), a local nonprofit organization dedicated to empowering persons with disabilities, particularly within the deaf community, is facing a severe funding crisis that has led to the suspension of several key programs. This crisis follows a US Executive Order by President Donald Trump that cut foreign aid. In</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/deaf-zimbabwe-trust-halts-crucial-disability-programs-amid-us-foreign-aid-cuts/\">Deaf Zimbabwe Trust halts crucial disability programs amid US foreign aid cuts</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "04 Mar 2025"
        },
        {
            "title": "John Symth’s victims and their families in Zimbabwe hope for closure",
            "url": "https://www.newzimbabwe.com/john-symths-victims-and-their-families-in-zimbabwe-hope-for-closure/",
            "content": "By Cyril Zenda | Religion Unplugged\n\nHe hurt us.  Guide was an only boy in a family of seven girls. What he (the abuser) did was grossly unfair. May his spirit burn in hell!\n\nThese are sentiments of Judith Nyachuru, the sister of Guide Nyachuru, the boy who died in 1992 at a holiday camp run by serial abuser John Smyth through his Zambezi Ministries in Zimbabwe.\n\nFor decades, the Nyachuru family has hoped for closure, which has proved to be elusive. When the scathingMakin Reportreleased this past November  which ultimately resulted in the resignation of Archbishop of CanterburyJustinWelby recommended that the Church of England also probe the atrocities committed by Smyth in Zimbabwe, the family was hopeful.\n\nMonths later, nothing seems to be happening about the recommended investigation into the activities of the man described as an unhinged tyrant and the embodiment of Satan by John Thorn, the former headmaster of Winchester College, in his 1989 autobiography, The Road to Winchester.\n\nNot that I know, Judith toldReligion Unpluggedwhen asked if anything had started regarding the investigations in Zimbabwe recommended by the Makin Report.\n\nEven Douglas Coltart, the lawyer who investigated allegations of abuse against Smyth in 1993 and has been the focal person for the case in Zimbabwe, remains in the dark.\n\nI am not aware of anything other than that I have been instructed by the family of the late Guide Nyachuru to investigate whether damages can be claimed following the tragic loss of Guide in the 1990s, he said.\n\nThe Church of England did not respond to questions on the status of the recommended investigation.\n\nIt is this ongoing silence that worries the victims of Smyths abuses in Zimbabwe  estimated to number about 80  and their families, as it raises fears of potential cover-up attempts by church officials.\n\nRebekah Read, senior associate solicitor at U.K.-based law firm Leigh Day Solicitors,blamed the Church of England for historically dragging its feet when it comes to handling this particular case.\n\nThese additional investigations cannot come quickly enough, Read said. The Makin Review and the police investigation into Smyths actions were announced in 2017, despite the Church of England havingfirst had knowledge of the disturbing allegations as far back as 1982. This lack of action meant that Smyth had access to children in Zimbabwe and South Africa for decades after this. The Church should waste no more time in providing restitution for the Zimbabwean and South African survivors of Smyths sadistic abuse.\n\nJason Leanders, 44, another of Smyths victims,toldBBC that many of his friends are still so traumatized by the beatings they are not even prepared to talk about it. After initially agreeing to share his story withReligion Unplugged, Leanders later changed his mind, something that, according to Coltart, who has dealt with some of these victims, isnot unusual.\n\nI think possibly there are still victims in Zimbabwe, perhaps in South Africa, who are suffering from PTSD, and I think the Anglican church has a responsibility to identify those individuals and to supply them with the medical assistance that they might require, Coltart added.\n\nEfforts to stop the abuses when they were taking place were resisted in Zimbabwe as Smyth enjoyed the support and protection of church leaders, lawyers and politicians.\n\nIt was one of those embarrassing cases that had to be swept under the carpet, a retired priest in Harare familiar with case toldReligion Unplugged. I dont think the attitudes have changed much even now, it would be difficult to get the whole truth on this matter because a lot of church leaders and lawyers took part in this cover up and considering what has happened to Welby, there is even good reason to avoid any further investigation.\n\nSmyth had been blacklisted in the U.K. after an investigation revealed he had subjected boys in the country to traumatic physical, psychological and sexual abuse. He had met most of his victims at Christian holiday camps run by a charity he chaired that was linked to the Church of England.\n\nThe 1982 report about the canings, prepared by Anglican clergyman Mark Ruston, concluded that the scale and severity of the practice was horrific, with accounts of boys beaten so badly that some of them had to wear nappies. He was also accused of promoting nudity and masturbation among the boys in his camps.The Ruston Reportfindings were not widely circulated, allowing Smyth to quietly move to Zimbabwe from Winchester in 1984.\n\nTwo years later, he has set up his Zambezi Ministries  with funding from the U.K.  and was meting out the same horrible punishments at the Christian holiday camps held at Ruzawi School in Marondera, a small town 45 miles (70 kilometers) east of the Zimbabwean capital, Harare. Zambezi Ministries exclusively marketed these holiday camps at the countrys elite private Christian schools.\n\nStarting in August 1986, the abuses went unchecked until 1993, when some parents of children from schools in Bulawayo  the countrys second largest city  complained about the severity of injuries that their children had suffered at one of Smyths camps, prompting some clergymen to engage Coltart to investigate.\n\nAfter a torrid time dealing with Smyth and his army of sympathizers, Coltarts21-page reportwas then published in October 1993, and its circulation was restricted to a handful headmasters and church leaders, conscious of the dangers of a defamation suit.\n\nAccording to Coltarts report, Smyth  an influential barrister with the right contacts within the countrys Christian, judicial and political circles  was also accused of resorting to blackmail, threats and lies to escape prosecution. Some church leaders even defended him, claiming that the acts that had been deemed inappropriate in the U.K. were acceptable in Zimbabwe. Some accused the Christian church leaders from Bulawayo of being jealous and pursuing personal vendettas against Smyth.\n\nBut the protests and subsequent investigation caused Smyth to stop the beatings, and his camps continued in some other guises.\n\nColtart later instructed another law firm to pursue a legal case against Smyth, who was eventually charged with culpable homicide over Guides death, as well as charges relating to the beatings of many others schoolboys.\n\nAfter the Coltart report and prosecution, Smyth and his family lived in Zimbabwe on temporary residency permits, which were renewable monthly. In 2001, upon their return from a long trip abroad, they were denied entry into the country, causing them to move to South Africa, where Smyth spent the last 17 years of his life. His sudden death in August 2018  ahead of being questioned from U.K. authorities or facing extradition  lead to speculation about a suicide.\n\nIn the aftermath of the Makin Report, the archbishop of Cape Town, Thabo Makgoba, immediately set up a commission to establish if the Church of England had been lacking in protecting young people from Smyth during the years that he was member of the church, but this probe has also been rocked byallegationsof renewed cover-up attempts.\n\nWith two of the three panel members holding posts in the Anglican Church of South Africa, critics questioned the objectivity of the commission, pointing out that the church could not investigate itself.\n\nThese cover-up allegations ended up claiming the scalp of Jeremy Gauntlett, a senior lawyer and a member of the Anglican Church who had been appointed to the panel, only for one sexual abuse victim of Gauntlett himself tocry out in protest. This prompted the veteran lawyer to ignominiouslyresignfrom both the panel and practicing law.\n\nSmyth was protected in England and he was protected in Zimbabwe, Leanders said. The protection went on for so long it robbed victims the chance to confront Smyth as adults.\n\nCyril Zenda is a Christian and an African journalist and writer based in Harare, Zimbabwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/14162502/guide-nyachuru.jpg",
            "description": "<p>By Cyril Zenda | Religion Unplugged “He hurt us. … Guide was an only boy in a family of seven girls. What he (the abuser) did was grossly unfair. May his spirit burn in hell!” These are sentiments of Judith Nyachuru, the sister of Guide Nyachuru, the boy who died in 1992 at a holiday</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/john-symths-victims-and-their-families-in-zimbabwe-hope-for-closure/\">John Symth’s victims and their families in Zimbabwe hope for closure</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "04 Mar 2025"
        },
        {
            "title": "Rufaro Stadium a muddy swamp as world-class dream is washed away by rains; Mafume insists it will host international matches",
            "url": "https://www.newzimbabwe.com/rufaro-stadium-a-muddy-swamp-as-world-class-dream-is-washed-away-by-rains-mafume-insists-it-will-host-international-matches/",
            "content": "By Darlington Gatsi\n\nPutting lipstick on a pig  this idiom aptly summarises the superficial renovations carried out at Rufaro Stadium by the Harare City Council.\n\nRufaro Stadium was reopened last year after years of closure, with Harare Mayor Jacob Mafume touting the facility as one of the best in Zimbabwe, even comparing its pitch to Spains Santiago Bernabeu Stadium.\n\nMafume enthusiastically described Rufaro Stadium as a lush green venue, celebrating the achievement of reopening the imposing structure in Mbare.\n\nHowever, less than a year after its reopening, Rufaro is already showing signs of deterioration, with the superficial facelift beginning to unravel.\n\nThe stadium has hosted four matches in eight days as the 2025 Castle Lager Premier Soccer League kicked off last week.\n\nIn the rains, the pitch is prone to waterlogging, with large patches of thick, sticky mud covering parts of the field.\n\nThis is in stark contrast to Mafumes assurances that a proper drainage system had been installed during the renovations.\n\nSpeaking recently at a council meeting, Mafume praised the developments at Rufaro, saying that the aim was to bring international football back to Mbare.\n\nWe are the biggest investors in sport in this country as the City of Harare. Every weekend, something is happening in Harare. Our contribution to sport is not something that should be taken lightly. We must improve Rufaro Stadium, Gwanzura Stadium, and many other stadiums in the city, he said.\n\nWe are happy that we have six teams in the PSL, and our next goal is to bring international soccer back to the streets of Harare.\n\nHowever, with the league still in its early stages, questions are being raised overRufaro Stadiums readiness to host multiple matches.\n\nDynamos, CAPS United, ZPC Kariba, and Herentals are using the stadium for their home matches, as renovations at the National Sports Stadium are yet to be completed.\n\nDespite these plans, Rufaro Stadium remains far from meeting the standards required to host international matches, with several areas falling short.\n\nMafume deceived football fans when the City Council, through a deal with Henrietta Rushwayas Okima Plastics, installed bucket seats in a small section of Rufaro Stadium.\n\nThe situation raises concerns about the sustainability of the renovations and whether the stadium can withstand the demands of a full football season, let alone attract international fixtures.\n\nZimbabwe is burdened with a lack of proper facilities, which has forced football teams to play outside the country. The situation is predicted to exacerbate with a visible lack of appetite by relevant authorities to address the dire situation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/03180341/WhatsApp-Image-2025-03-03-at-20.02.50.jpeg",
            "description": "<p>By Darlington Gatsi Putting lipstick on a pig – this idiom aptly summarises the superficial renovations carried out at Rufaro Stadium by the Harare City Council. Rufaro Stadium was reopened last year after years of closure, with Harare Mayor Jacob Mafume touting the facility as one of the best in Zimbabwe, even comparing its pitch</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rufaro-stadium-a-muddy-swamp-as-world-class-dream-is-washed-away-by-rains-mafume-insists-it-will-host-international-matches/\">Rufaro Stadium a muddy swamp as world-class dream is washed away by rains; Mafume insists it will host international matches</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "04 Mar 2025"
        },
        {
            "title": "Most corrupt country in SADC! Parliament demands answers from Ziyambi on Zimbabwe’s graft record",
            "url": "https://www.newzimbabwe.com/most-corrupt-country-in-sadc-parliament-demands-answers-from-ziyambi-on-zimbabwes-graft-record/",
            "content": "By Darlington Gatsi\n\nParliament has called upon the Minister of Justice, Legal and Parliamentary Affairs, Ziyambi Ziyambi, to issue a statement in the National Assembly regarding the countrys efforts to combat corruption.\n\nThis follows a recent report that identified Zimbabwe as the most corrupt nation in the Southern African region.\n\nCorruption continues to plague the country unabated, with Transparency International, the global anti-corruption watchdog, ranking Zimbabwe among the worst-performing nations in the world.\n\nThis ranking is a damning indictment of President Emmerson Mnangagwas administration, particularly given his 2017 pledge to eradicate corruption when he assumed the presidency.\n\nDuring a parliamentary session, Citizens Coalition for Change (CCC) Member of Parliament (MP) Gladys Hlatywayo challenged the government to address the countrys poor standing in the fight against corruption.\n\nGiven how disastrous the effects of corruption are, including the crowding out of social services to the citizenry, this House cannot be silent on this matter Mr. Speaker Sir.\n\nIn an era characterised by the rolling back of international aid and development, the prudential use of national resources cannot be overemphasised. After all, Parliament has the responsibility of oversight and to ensure the efficient use of national resources.\n\nI, therefore appeal to you Mr. Speaker, for the Minister of Justice, Legal and Parliamentary Affairs to favour this very House with a Ministerial Statement on how the Executive is tackling the question of corruption, including how far the Executive has gone in terms of the whistleblowers protection legislation and the witness protection legislation, said Hlatywayo.\n\nThe entrenchment of corruption has been attributed to inefficiencies within key institutions, such as the Zimbabwe Anti-Corruption Commission (ZACC). ZACC has faced criticism for its perceived leniency towards individuals associated with the ruling party, ZANU PF.\n\nAdditionally, the absence of robust legislation to protect whistleblowers has been identified as a significant obstacle in the fight against corruption.\n\nSpeaker of Parliament Jacob Mudenda emphasised the urgency of tabling the Whistleblowers Act in the National Assembly.\n\nI am not sure about the agreement. What I can only advise in support of part of what you have said is the Whistleblowers Bill that must come as soon as possible to this House. As for the indexes, I have my reservation, said Mudenda.\n\nMeasures to curb corruption are among the key areas Zimbabwe must address as part of the Structured Dialogue Platform between the country and the African Development Bank (AfDB).\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/18024540/Ziyambi-Ziyambi.png",
            "description": "<p>By Darlington Gatsi Parliament has called upon the Minister of Justice, Legal and Parliamentary Affairs, Ziyambi Ziyambi, to issue a statement in the National Assembly regarding the country’s efforts to combat corruption. This follows a recent report that identified Zimbabwe as the most corrupt nation in the Southern African region. Corruption continues to plague the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/most-corrupt-country-in-sadc-parliament-demands-answers-from-ziyambi-on-zimbabwes-graft-record/\">Most corrupt country in SADC! Parliament demands answers from Ziyambi on Zimbabwe’s graft record </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "04 Mar 2025"
        },
        {
            "title": "PPC’s share price surges 11% as turnaround benefits start to boost the bottom line",
            "url": "https://www.newzimbabwe.com/ppcs-share-price-surges-11-as-turnaround-benefits-start-to-boost-the-bottom-line/",
            "content": "IOL\n\nPPCs share price flew up 11.4% on the JSE Monday after the aggregates, cement and ready-mix concrete producer said the positive results from a turnaround plan had continued into the second half of its financial year.\n\nIn an operational update for the 10 months to January 31, the group said benefits from the turnaround plan, which was started after the appointment a year ago of Matias Cardarelli as CEO and other changes to the executive team, were growing as the plan gained momentum.\n\nIn the key areas of commercial, operations, and supply chain, the initiatives are already showing results, namely plant sourcing optimisation, sales product mix enhancement, improved thermal energy costs and logistics management, PPC said.\n\nThese results had increased the EBITDA margin and cash flowgeneration, Cardarelli said in the update.\n\nThe Awaken the Giant turnaround plans first key steps included key personnel changes, simplification of the organisational structure and realignment of the organisation culture to ensure the appropriate results-oriented focus, cost discipline and a sense of urgency.\n\nRevenue fell 3%, while earnings before interest tax, depreciation and amortisation (EBITDA) was up 20%. The EBITDA margin increased by 3.2 percentage points.\n\nThe decrease in revenue was mainly due to a decline in the revenue in PPCs Zimbabwe operations, while the South Africa and Botswana operation delivered a flat performance.\n\nThe increase in EBITDA and EBITDA margins was due to all business units improving their results, mainly as a consequence of the turnaround plan, PPC directors said in a statement.\n\nCapital expenditure was expected to be slightly below the guidance of R400 million to R450m for the full year. Some optimisation of capital expenditure was being re-assessed, while maintenance expenditure was as planned.\n\nAs the stringent focus on costs and working capital take effect, the South Africa & Botswana operations free cash flow net cash inflow before financing activities excluding dividends from Zimbabwe  increased by a substantial 90% to R692m.\n\nAs at January 31, 2025, the SA and Botswana group was in a net cash position of R106m. PPC Zimbabwe continues to remain debt-free and held $13m in unencumbered cash at January 31.\n\nPPC Zimbabwe also increased its free cash flowgeneration leading to an increase in dividends declared and paid of $13m compared to the $11m paid in the comparable period.\n\nOverall sales volumes in the South Africa and Botswana group fell 1%. The decline was from lower Botswana sales volumes, since sales volumes in South Africa were flat. Price increases were implemented in July and offset the decline in volumes with revenue increasing by 2%.\n\nSouth Africa and Botswana group EBITDA increased 32%, resulting in margin expansion to 14.8% from 11.4%. This was also an increase from the margin of 13.7% at the half year.\n\nWhile most of the operational improvements are yet to materialise, the margin increase reflects the early delivery of a reduction in general and administrative expenses, and a contribution margin increase.\n\nThe materials business, comprising three businesses: ready mix concrete, aggregates and fly ash, saw EBITDA improve significantly.\n\nIn Zimbabwe, volumes fell 9%, consistent with the half-year. This trend started improving in January. Revenue fell 12% in rand terms, due to the rand strengthening in the current period compared to the comparable period.\n\nThe integrated cement plant in the Western Cape that was planned to secure PPCs cost competitiveness and low carbon cement leadership, was in the final stage ahead of seeking board approval.\n\nThe improvement of the results in the current period already reflects early delivery of the turnaround plan, ahead of the previously advised timeline, the board said, adding it would consider a dividend for the year.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/02/07095716/PPC-Zimbabwe.png",
            "description": "<p>IOL PPC’s share price flew up 11.4% on the JSE Monday after the aggregates, cement and ready-mix concrete producer said the positive results from a turnaround plan had continued into the second half of its financial year. In an operational update for the 10 months to January 31, the group said benefits from the turnaround</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ppcs-share-price-surges-11-as-turnaround-benefits-start-to-boost-the-bottom-line/\">PPC’s share price surges 11% as turnaround benefits start to boost the bottom line</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "04 Mar 2025"
        },
        {
            "title": "African Sun Limited not exiting the hospitality industry – board chairperson",
            "url": "https://www.newzimbabwe.com/african-sun-limited-not-exiting-the-hospitality-industry-board-chairperson/",
            "content": "By Alois Vinga\n\nLEADING Hospitality group African Sun Limited (ASL) has dismissed speculations that it plans to exit the industry, maintaining that the strategic decisions are aimed at positioning the group as a market leader.\n\nASL has placed its three assets, the Beitbridge Express Hotel, Great Zimbabwe Hotel in Masvingo and the Monomotapa Hotel in Harares CBD on sale, prompting market speculators to suggest that ASL could be on its way out of the hospitality industry.\n\nBut speaking exclusively to NewZimbabwe.com this week, the ASL board chairperson Lloyd Mhishidismissed the claims and maintained that the recent developments are part of a broader strategy to strengthen the group.\n\nTo the contrary, the organization is consolidating its portfolio through channeling its resources to particular assets with a view to unlocking shareholder value and driving sustained growth. It is not true that ASL is disposing of its top hotels, but it is exiting some of its assets that do not align with the vision espoused above.\n\nA good example of the enhancing of value is the Hwange Safari Lodge and TroutbeckResort, which haverecentlyreceived massive refurbishments that have transformed and repositioned them well for the target market, and which has led to all the right boxes being ticked currently, he said.\n\nQuizzed on why ASL took the bold step of disposing of the prestigious Monomotapa Hotel, Mhishi said various factors, including the current economic climate being a major factor, prompted ASL to explore alternative fund-raising activities.\n\nHe added that the company decided to dispose of non-core properties that generate minimal revenue, with the decision being based on a thorough evaluation of their fit within ASLs strategic thrust and performance matrix.\n\nSuch disinvestments are not a new phenomenon as we have been implementing such a strategy over the pastfifteen years, again with the aim of focusing on enhancing shareholder valueand guest experience.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/06070051/Mhishi.jpg",
            "description": "<p>By Alois Vinga LEADING Hospitality group African Sun Limited (ASL) has dismissed speculations that it plans to exit the industry, maintaining that the strategic decisions are aimed at positioning the group as a market leader. ASL has placed its three assets, the Beitbridge Express Hotel, Great Zimbabwe Hotel in Masvingo and the Monomotapa Hotel in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/african-sun-limited-not-exiting-the-hospitality-industry-board-chairperson/\">African Sun Limited not exiting the hospitality industry – board chairperson</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "04 Mar 2025"
        },
        {
            "title": "UN food agency shuts Southern Africa office amid Trump aid cuts",
            "url": "https://www.newzimbabwe.com/un-food-agency-shuts-southern-africa-office-amid-trump-aid-cuts/",
            "content": "Bloomberg\n\nThe United Nations World Food Programme, which gets much of its funding from the US, is closing its Southern African bureau at a time when the agency is leading a response to the worst drought in the region in four decades.\n\nThe decision, which was communicated to staff around the world in an email on Friday from Global Executive Director Cindy McCain, comes as 26 million people across seven countries in the region run short of food ahead of this years harvest in May. President Donald Trump has been dismantling US foreign aid affecting everything from health care to food supplies  Washington provides nearly half of WFPs $9.7 billion budget.\n\nWe have reached the difficult decision to close WFPs regional bureau for southern Africa in Johannesburg, McCain said in the email seen by Bloomberg. Challenging times demand some difficult choices.\n\nThe southern Africa bureau buys and transports hundreds of thousands of tons from South Africa and other countries. It procures more than 60% of its food, goods and services locally, WFP said on its website. The region is regularly hit by droughts because its periodically affected by the El Nino weather phenomenon, as it was last year.\n\nThe WFPs regional director and media team didnt respond to an emailed request for comment.\n\nThe WFP has been instrumental in raising funds for countries such as Zimbabwe and Mozambique as they contend with the impact of the worst drought in at least four decades, which slashed corn harvests by as much as 70%.\n\nSome of the responsibilities of the bureau, which manages the response and deals with WFP country offices in a region spanning from South Africa to the Democratic Republic of Congo, will be taken over by the East African bureau in Nairobi, McCain said in the email.\n\nMcCain said the agency remains committed to southern Africa, adding that a transition and integration team will be established to implement the changes over the course of the year.\n\nThe 160 employees in the Johannesburg office were initially told their bureau might be combined with the one in Nairobi, a person familiar with the situation said. On February 27, Carl Skau, McCains deputy, was in Johannesburg and told staff that a decision had been taken to close the office, surprising everyone including senior management, the person said. McCains email arrived a day later.\n\nSouth Africas Department of International Relations & Cooperation has been informed, the person said. The department said it will respond to Bloombergs query later.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/02055234/WFP-6-scaled.jpg",
            "description": "<p>Bloomberg The United Nations’ World Food Programme, which gets much of its funding from the US, is closing its Southern African bureau at a time when the agency is leading a response to the worst drought in the region in four decades. The decision, which was communicated to staff around the world in an email</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/un-food-agency-shuts-southern-africa-office-amid-trump-aid-cuts/\">UN food agency shuts Southern Africa office amid Trump aid cuts</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "04 Mar 2025"
        },
        {
            "title": "TSL decries low ZWG demand from raw materials suppliers",
            "url": "https://www.newzimbabwe.com/tsl-decries-low-zwg-demand-from-raw-materials-suppliers/",
            "content": "By Alois Vinga\n\nTSL Limited has bemoaned the mismatch between the ZWG currency and its general unacceptability by raw materials suppliers who continue to demand payment in the US$ currency.\n\nIntroduced on April 5 2024, the ISO certified ZWG, short for Zimbabwe Gold, premiered at a rate of US$1:ZWG13,56 , almost flexing its muscle as the countrys lasting solution to the decades-old currency challenges. Six months after, the local unit nosedived into problems, forcing the Reserve Bank of Zimbabwe (RBZ) to unilaterally order an immediate 43% devaluation.\n\nPresenting performance details for the year ended October 31, 2024, TSL board chairman Anthony Mandiwanza described the operating environment as difficult.\n\nThe first half of the financial year witnessed significant policy shifts in policies as the authorities grappled with the prevailing economic challenges. The ZIGs inaugural exchange rate to the US$ was US$1 to ZIG13.56.Agricultural trading businesses and businesses in general were confronted with the dilemma of pricing in ZWG but sourcing products in US$, he said.\n\nTSL also raised concerns over frequent power supply outages, which are increasing the cost of doing business as companies resort to alternative but expensive power sources as well as significant cost of connectivity and data.\n\nDuring the period, the group said that despite a 22% drop in the national tobacco crop, Tobacco Sales Floor maintained its volume of tobacco handled at 52 million kilograms. The company maintained its close relationship with its tobacco merchant customers, handling 44 million kilograms of contract tobacco in the season, a 13% increase from the previous season.\n\nThe decentralised floors in Karoi, Mvurwi and Marondera were expanded and upgraded for the convenience of both tobacco merchants and farmers.\n\nPropak paper volumes increased by 52% to give the company a 70% market share of national tobacco paper. Tobacco hessian volumes, however, declined by 16% as a result of the 22% national decline in tobacco crop output from 296 to 231.7 million kilograms. Exports are underway to continue to increase tobacco paper and hessian export revenue in the region.\n\nThe operating environment remains challenging, characterised by constrained liquidity from the banking sector, firming interest rates and US$ inflation, added TSL.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/04045510/Mr-Antony-Mandiwanza.jpg",
            "description": "<p>By Alois Vinga TSL Limited has bemoaned the mismatch between the ZWG currency and its general unacceptability by raw materials suppliers who continue to demand payment in the US$ currency. Introduced on April 5 2024, the ISO certified ZWG, short for Zimbabwe Gold, premiered at a rate of US$1:ZWG13,56 , almost flexing its muscle as</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tsl-decries-low-zwg-demand-from-raw-materials-suppliers/\">TSL decries low ZWG demand from raw materials suppliers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "04 Mar 2025"
        }
    ]
}