{
    "news": [
        {
            "title": "Top reasons why health & social care providers fail CQC checks",
            "url": "https://www.newzimbabwe.com/top-reasons-why-health-social-care-providers-fail-cqc-checks/",
            "content": "ByDr Richard Dune\n\nMost CQC failures arent caused by funding or staffing but by missing systems, poor implementation, and policies that never make it into practice\n\nBetween 2023 and 2025, nearly 200 health and social care providers in England were rated Inadequate by the Care Quality Commission (CQC). This included 47 domiciliary care agencies and 111 care homes, all of which were found to have serious, systemic weaknesses in areas such as governance, safety, safeguarding, and the overall quality of care.\n\nBut the key takeaway from these failures may surprise you. Most of them werent caused by isolated incidents, lack of funding, or staff shortages. Instead, the most common underlying issue was this:\n\nThe absence, or poor implementation, of fundamental policies and procedures.\n\nPolicies were either missing, sitting unread in a folder, or not embedded into daily practice. In other words, providers had the documents but no systems to turn them into action.\n\nIn this article,Dr Richard Duneunpacks why so many providers continue to fail inspections and how you can avoid the same fate by putting structure, leadership, and accountability at the centre of your compliance and care delivery.\n\nWhen CQC inspectors visit, theyre not just looking for a tick-box policy folder or cloud-based platform. They want to know:\n\nCan this provider consistently deliver safe, person-centred care and prove it with evidence?\n\nTime and again, inspection reports reveal the same recurring problems. Below are some of the most common failures identified in CQC reports from 2023 to 2025.\n\nThese arent just oversights; theyre apparent breaches of CQC regulations. The most frequently cited ones include:\n\nIts crucial to understand that these failings are rarely about bad apples. Instead, they reflect a lack of internal systems, oversight, and structure.\n\nMost providers have a set of policies. But in far too many cases, they are:\n\nA policy thats not read, understood, applied, and audited is effectively useless.\n\nCQC inspectors know this. Thats why they dont just ask if you have a policy, they ask:\n\nThis is where ComplyPlus makes the real difference. Its not just a document library; its a fully integrated compliance management system.\n\nComplyPlus helps you:\n\nWe designed it to address the structural reasons why providers fail inspections rather than just providing generic templates.\n\nTo help providers address the issues most commonly found in CQC inspection reports, we developed the ComplyPlus 10-Policy Framework, a strategic toolkit aligned with regulations, risk areas, and operational needs.\n\nLets explore each of the 10 areas and how ComplyPlus helps you build lasting compliance.\n\nFailure:No audit cycle, no quality dashboard, no governance structure.\n\nRegulation:Regulation 17  Good governance\n\nSolution:Build monthly audit schedules, add real-time dashboards, and maintain governance logs for senior oversight. Non-conformities and actions are tracked automatically.\n\nFailure:Missing or templated risk assessments for key clinical and behavioural risks.\n\nRegulation:Regulation 12  Safe care and treatment\n\nSolution:Use condition-specific templates with review reminders. Integrate risk alerts into care plans to prevent incidents before they occur.\n\nFailure:No PRN protocols, MAR sheets missing data, no audits.\n\nRegulation:Regulation 12  Safe care and treatment\n\nSolution:Weekly digital audits, eMAR integration, and real-time medication tracking with staff competency validation.\n\nFailure:Incomplete recruitment checks and induction.\n\nRegulation:Regulation 19  Fit and proper persons\n\nSolution:Pre-employment checklists, automatic alerts for DBS and references, plus links to rota software to prevent unsupervised deployment.\n\nFailure:No training evidence or role-specific skills mapping.\n\nRegulations:Regulations 12 & 18\n\nSolution:Individual training records with built-in assessments, gap analysis, and CPD audits linked to care packages.\n\nFailure:No MCA or DoLS documentation.\n\nRegulation:Regulation 11  Need for consent\n\nSolution:Capacity assessment templates, best-interest decision logs, and MCA audit tools. Assign MCA champions to promote compliance.\n\nFailure:Unreported concerns, no logs, poor staff awareness.\n\nRegulation:Regulation 13  Safeguarding\n\nSolution:Supervision prompts, safeguarding in team meeting agendas, and automated alerts for incident tracking and whistleblowing follow-up.\n\nFailure:Generic or copy-paste care plans.\n\nRegulations:Regulations 9 & 10\n\nSolution:Co-produced templates, review cycles, and tools to involve families and advocates.\n\nFailure:Complaints ignored, no learning loops.\n\nRegulations:Regulations 16 & 20\n\nSolution:Central complaint tracker, RCA tools, and structured reflective practice sessions to foster accountability and learning.\n\nFailure:Cultural needs ignored, no language support.\n\nRegulation:Regulation 10  Dignity and respect\n\nSolution:EDI assessment tools, format/language preferences embedded in care planning, and mandatory cultural competency training.\n\nYes, the care sector is under pressure. Recruitment is tough. Budgets are squeezed. However, the most consistent reason providers fail isnt a lack of resources; its a lack of structure.\n\nEven the most caring team cannot deliver high-quality care without the following:\n\nOutstanding care isnt about luck. Its about leadership and repeatable systems.\n\nWe created ComplyPlus at The Mandatory Training Group to help providers move from survival to sustainability.\n\nYou get more than a digital binder of policies; you gain a compliance framework built for action:\n\nBest of all? You dont need to overhaul your entire system. ComplyPlus integrates with your existing infrastructure and is easy to roll out, even for small providers.\n\nWhether youre:\n\nNow is the time to act. CQC inspections are changing, but your approach doesnt have to be reactive.\n\nCQC failures dont come out of nowhere. They are predictable, preventable, and, most importantly, fixable.\n\nIf your team lacks structure, your systems dont support good practice, and your policies dont translate into action, youre at risk. But with the right tools and leadership, you can create a culture of continuous improvement.\n\nDont wait until youre in crisis. Invest in structure. Build in quality. Stay inspection-ready.\n\nAt The Mandatory Training Group, we created ComplyPlus to help providers embed lasting quality into everything they do, from policies and training to audits, supervision, and beyond.\n\nExplore our complete compliance ecosystem:\n\nLearn more aboutComplyPlusand discover how were helping providers across England deliver safe, effective, and well-led services.\n\nDr Richard Dune is the CEO of LearnPac Systems, a leading UK provider of edtech and compliance software solutions for regulated sectors. He specialises in governance, compliance, and innovation in both public and private sectors. He can be reached atdocduner@gmail.comor +44 24 7610 0090.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/06170910/Top-reasons-why-health-social-care-providers-fail-CQC-checks-Dr-Rchard-Dune-1-scaled.jpg",
            "description": "<p>By Dr Richard Dune   Most CQC failures aren’t caused by funding or staffing but by missing systems, poor implementation, and policies that never make it into practice Between 2023 and 2025, nearly 200 health and social care providers in England were rated “Inadequate” by the Care Quality Commission (CQC). This included 47 domiciliary care</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/top-reasons-why-health-social-care-providers-fail-cqc-checks/\">Top reasons why health & social care providers fail CQC checks</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:28",
            "date": "06 Jul 2025"
        },
        {
            "title": "US$4 million Ecobank armed robbery: Police arrest two suspects in SA",
            "url": "https://www.newzimbabwe.com/us4-million-ecobank-armed-robbery-police-arrest-two-suspects-in-sa/",
            "content": "By Staff Reporter\n\nTWO suspects have been arrested in connection with the infamous US$4.4 million bank heist at an Ecobank branch in Bulawayo last year.\n\nIn a statement this Sunday, Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the latest arrests of two Zimbabweans, who were holed up in neighbouring SouthAfrica.\n\nZRP confirms the arrest of Abraham Tendayi Vumbunu and Elijah Temayi Vumbunu in connection with the US$4 million Bulawayo Ecobank robbery heist which occurred on 3rd October 2024, said Nyathi.\n\nThe pair was nabbed on July 5, 2025, in the Republic of South Africa.\n\nDue processes of the law are now taking effect for the suspects extradition to Zimbabwe, the police spokesman added.\n\nHe said detectives are pursuing other suspects linked to the fiery daylight robbery that shocked the world.\n\nThe crime was orchestrated by a gang of six armed robbers, brandishing AK-47 rifles and pistols, who ambushed a Safeguard Security cash-in-transit van outside the Ecobank branch at the NRZ Building on the corner of Fife Street and 9th Avenue.\n\nThe security guards had just collected several metal cash boxes when they were confronted by the robbers, who swiftly overpowered them and vanished with the cash, using a white Ford Ranger single-cab getaway truck.\n\nInvestigations later revealed that the number plate on the getaway car had been stripped from a Mazda Demio.\n\nCCTV footage and bystander videos of the heist circulated widely on social media, capturing the robbers executing the operation with shocking ease.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/06111120/img_1751796074305.jpg",
            "description": "<p>By Staff Reporter  TWO suspects have been arrested in connection with the infamous US$4.4 million bank heist at an Ecobank branch in Bulawayo last year. In a statement this Sunday, Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the latest arrests of two Zimbabweans, who were holed up in neighbouring South Africa. “ZRP confirms</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us4-million-ecobank-armed-robbery-police-arrest-two-suspects-in-sa/\">US$4 million Ecobank armed robbery: Police arrest two suspects in SA</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:28",
            "date": "06 Jul 2025"
        },
        {
            "title": "Zimbabwean who recently graduated with PhD stabbed to death in Scotland while daughter watched",
            "url": "https://www.newzimbabwe.com/zimbabwean-who-recently-graduated-with-phd-stabbed-to-death-in-scotland-while-daughter-watched/",
            "content": "By Staff Reporter\n\nREPORTS emerging from Scotland in the United Kingdom have confirmed the stabbing to death of a female Zimbabwean immigrant, a newly graduated PhD holder.\n\nThe now deceased was identified as Dr. Fortune Gomo, believed to be in her 30s.The violent attack reportedly occurred Saturday, around dusk, as victim was walking alongside her 10-year-old daughter on South Road in Dundee, sparking public fury and calls for justice from the local African community.News reports say despite emergency intervention by paramedics, Gomo died at the scene.A 20-year-old man has reportedly been arrested in connection with the bizarre killing of Gomo, who according to reports had recently earned her PhD from the University of Dundee.In viral footage posted online, concerned members of the Black community vented their anger over apparent police lethargy and media blackout.You can take my picture or record meI dont care. Im speaking boldly because I dont mind, a tearful Black woman is heard saying to a police officer.This is about that innocent woman who was murdered, someone who was going to support the Dundee community. She was a doctor, just graduated with a PhD from Dundee University. She had so much to offer, unlike the person who killed her. Were hardworking peopleThe media should be talking to us, listening to us, and sharing our story, but they dont hear us, she added.Scottish authorities have since released a statement confirming arrest of the suspected stabber.Detective Superintendent Peter Sharp, who is leading the investigation, appealed to members of the public with relevant information to help cops in the investigation.\n\nThe now deceased was identified as Dr. Fortune Gomo, believed to be in her 30s.\n\nThe violent attack reportedly occurred Saturday, around dusk, as victim was walking alongside her 10-year-old daughter on South Road in Dundee, sparking public fury and calls for justice from the local African community.News reports say despite emergency intervention by paramedics, Gomo died at the scene.A 20-year-old man has reportedly been arrested in connection with the bizarre killing of Gomo, who according to reports had recently earned her PhD from the University of Dundee.In viral footage posted online, concerned members of the Black community vented their anger over apparent police lethargy and media blackout.You can take my picture or record meI dont care. Im speaking boldly because I dont mind, a tearful Black woman is heard saying to a police officer.This is about that innocent woman who was murdered, someone who was going to support the Dundee community. She was a doctor, just graduated with a PhD from Dundee University. She had so much to offer, unlike the person who killed her. Were hardworking peopleThe media should be talking to us, listening to us, and sharing our story, but they dont hear us, she added.Scottish authorities have since released a statement confirming arrest of the suspected stabber.Detective Superintendent Peter Sharp, who is leading the investigation, appealed to members of the public with relevant information to help cops in the investigation.\n\nThe violent attack reportedly occurred Saturday, around dusk, as victim was walking alongside her 10-year-old daughter on South Road in Dundee, sparking public fury and calls for justice from the local African community.\n\nNews reports say despite emergency intervention by paramedics, Gomo died at the scene.A 20-year-old man has reportedly been arrested in connection with the bizarre killing of Gomo, who according to reports had recently earned her PhD from the University of Dundee.In viral footage posted online, concerned members of the Black community vented their anger over apparent police lethargy and media blackout.You can take my picture or record meI dont care. Im speaking boldly because I dont mind, a tearful Black woman is heard saying to a police officer.This is about that innocent woman who was murdered, someone who was going to support the Dundee community. She was a doctor, just graduated with a PhD from Dundee University. She had so much to offer, unlike the person who killed her. Were hardworking peopleThe media should be talking to us, listening to us, and sharing our story, but they dont hear us, she added.Scottish authorities have since released a statement confirming arrest of the suspected stabber.Detective Superintendent Peter Sharp, who is leading the investigation, appealed to members of the public with relevant information to help cops in the investigation.\n\nNews reports say despite emergency intervention by paramedics, Gomo died at the scene.\n\nA 20-year-old man has reportedly been arrested in connection with the bizarre killing of Gomo, who according to reports had recently earned her PhD from the University of Dundee.In viral footage posted online, concerned members of the Black community vented their anger over apparent police lethargy and media blackout.You can take my picture or record meI dont care. Im speaking boldly because I dont mind, a tearful Black woman is heard saying to a police officer.This is about that innocent woman who was murdered, someone who was going to support the Dundee community. She was a doctor, just graduated with a PhD from Dundee University. She had so much to offer, unlike the person who killed her. Were hardworking peopleThe media should be talking to us, listening to us, and sharing our story, but they dont hear us, she added.Scottish authorities have since released a statement confirming arrest of the suspected stabber.Detective Superintendent Peter Sharp, who is leading the investigation, appealed to members of the public with relevant information to help cops in the investigation.\n\nA 20-year-old man has reportedly been arrested in connection with the bizarre killing of Gomo, who according to reports had recently earned her PhD from the University of Dundee.\n\nIn viral footage posted online, concerned members of the Black community vented their anger over apparent police lethargy and media blackout.You can take my picture or record meI dont care. Im speaking boldly because I dont mind, a tearful Black woman is heard saying to a police officer.This is about that innocent woman who was murdered, someone who was going to support the Dundee community. She was a doctor, just graduated with a PhD from Dundee University. She had so much to offer, unlike the person who killed her. Were hardworking peopleThe media should be talking to us, listening to us, and sharing our story, but they dont hear us, she added.Scottish authorities have since released a statement confirming arrest of the suspected stabber.Detective Superintendent Peter Sharp, who is leading the investigation, appealed to members of the public with relevant information to help cops in the investigation.\n\nIn viral footage posted online, concerned members of the Black community vented their anger over apparent police lethargy and media blackout.\n\nYou can take my picture or record meI dont care. Im speaking boldly because I dont mind, a tearful Black woman is heard saying to a police officer.This is about that innocent woman who was murdered, someone who was going to support the Dundee community. She was a doctor, just graduated with a PhD from Dundee University. She had so much to offer, unlike the person who killed her. Were hardworking peopleThe media should be talking to us, listening to us, and sharing our story, but they dont hear us, she added.Scottish authorities have since released a statement confirming arrest of the suspected stabber.Detective Superintendent Peter Sharp, who is leading the investigation, appealed to members of the public with relevant information to help cops in the investigation.\n\nYou can take my picture or record meI dont care. Im speaking boldly because I dont mind, a tearful Black woman is heard saying to a police officer.\n\nThis is about that innocent woman who was murdered, someone who was going to support the Dundee community. She was a doctor, just graduated with a PhD from Dundee University. She had so much to offer, unlike the person who killed her. Were hardworking peopleThe media should be talking to us, listening to us, and sharing our story, but they dont hear us, she added.Scottish authorities have since released a statement confirming arrest of the suspected stabber.Detective Superintendent Peter Sharp, who is leading the investigation, appealed to members of the public with relevant information to help cops in the investigation.\n\nThis is about that innocent woman who was murdered, someone who was going to support the Dundee community. She was a doctor, just graduated with a PhD from Dundee University. She had so much to offer, unlike the person who killed her. Were hardworking people\n\nThe media should be talking to us, listening to us, and sharing our story, but they dont hear us, she added.Scottish authorities have since released a statement confirming arrest of the suspected stabber.Detective Superintendent Peter Sharp, who is leading the investigation, appealed to members of the public with relevant information to help cops in the investigation.\n\nThe media should be talking to us, listening to us, and sharing our story, but they dont hear us, she added.\n\nScottish authorities have since released a statement confirming arrest of the suspected stabber.Detective Superintendent Peter Sharp, who is leading the investigation, appealed to members of the public with relevant information to help cops in the investigation.\n\nScottish authorities have since released a statement confirming arrest of the suspected stabber.\n\nDetective Superintendent Peter Sharp, who is leading the investigation, appealed to members of the public with relevant information to help cops in the investigation.\n\nDetective Superintendent Peter Sharp, who is leading the investigation, appealed to members of the public with relevant information to help cops in the investigation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/06095328/1751787728513.jpg",
            "description": "<p>By Staff Reporter  REPORTS emerging from Scotland in the United Kingdom have confirmed the stabbing to death of a female Zimbabwean immigrant, a newly graduated PhD holder. The now deceased was identified as Dr. Fortune Gomo, believed to be in her 30s. The violent attack reportedly occurred Saturday, around dusk, as victim was walking alongside</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-who-recently-graduated-with-phd-stabbed-to-death-in-scotland-while-daughter-watched/\">Zimbabwean who recently graduated with PhD stabbed to death in Scotland while daughter watched</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:28",
            "date": "06 Jul 2025"
        },
        {
            "title": "Cricketer Masvaure ruled out of second Test against South Africa",
            "url": "https://www.newzimbabwe.com/cricketer-masvaure-ruled-out-of-second-test-against-south-africa/",
            "content": "By James Muonwa\n\nZIMBABWEs Chevrons opening batter Prince Masvaure will miss the second Test match against South Africa, which gets underway at Queens Sports Club in Bulawayo this Sunday morning.\n\nMasvaure is suffering from a respiratory tract infection and was deemed unfit to feature in the battle against the world champions.\n\nZimbabwe Cricket (ZC) Media and Communications Manager Darlington Majonga confirmed the latest development in a statement.He (Masvaure) had come into the team as a concussion replacement for Brian Bennett during the first Test played last week.Bennett himself remains unavailable for selection as he continues to recover from the concussion he sustained in that match, said Majonga.Dion Myers has been named as Masvaures replacement in one of two changes made to the Zimbabwe playing XI for the second Test.The other change sees Kundai Matigimu making his Test debut, coming in for Vincent Masekesa.ZIMBABWE PLAYING XI FOR SECOND TEST VS SOUTH AFRICA:Takudzwanashe Kaitano, Nick Welch, Dion Myers, Sean Williams, Craig Ervine, Wessly Madhevere, Tafadzwa Tsiga, Wellington Masakadza, Blessing Muzarabani, Tanaka Chivanga, Kundai Matigimu.\n\nZimbabwe Cricket (ZC) Media and Communications Manager Darlington Majonga confirmed the latest development in a statement.\n\nHe (Masvaure) had come into the team as a concussion replacement for Brian Bennett during the first Test played last week.\n\nBennett himself remains unavailable for selection as he continues to recover from the concussion he sustained in that match, said Majonga.\n\nDion Myers has been named as Masvaures replacement in one of two changes made to the Zimbabwe playing XI for the second Test.\n\nThe other change sees Kundai Matigimu making his Test debut, coming in for Vincent Masekesa.\n\nZIMBABWE PLAYING XI FOR SECOND TEST VS SOUTH AFRICA:\n\nTakudzwanashe Kaitano, Nick Welch, Dion Myers, Sean Williams, Craig Ervine, Wessly Madhevere, Tafadzwa Tsiga, Wellington Masakadza, Blessing Muzarabani, Tanaka Chivanga, Kundai Matigimu.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/06092240/385286.jpg",
            "description": "<p>By James Muonwa  ZIMBABWE”s Chevrons opening batter Prince Masvaure will miss the second Test match against South Africa, which gets underway at Queens Sports Club in Bulawayo this Sunday morning. Masvaure is suffering from a respiratory tract infection and was deemed unfit to feature in the battle against the world champions. Zimbabwe Cricket (ZC) Media</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cricketer-masvaure-ruled-out-of-second-test-against-south-africa/\">Cricketer Masvaure ruled out of second Test against South Africa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:28",
            "date": "06 Jul 2025"
        },
        {
            "title": "Zimbabwe’s Sables in Uganda to defend Africa Rugby Cup title",
            "url": "https://www.newzimbabwe.com/sables-in-uganda-to-defend-africa-rugby-cup-title/",
            "content": "By Sports Reporter\n\nZIMBABWE senior mens rugby team arrived in Uganda on Saturday for the 2025 Rugby Africa Cup.\n\nFondly known as the Sables, the local side walks into this years edition with aspirations to defend the title which they won last year.\n\nThis years Rugby Africa Cup will see eight countries battling for honours, namely Zimbabwe, Tunisia, Kenya, Namibia, Algeria, Senegal, Ivory Coast and hosts Uganda.\n\nZimbabwe will open its campaign with a clash against Tunisia on Tuesday at Mandela National Stadium.\n\nTeam head coach Piet Benade is banking on continuity going into the match.\n\nWe are fortunate to get a lot of the boys back who were here last year.\n\nSo hopefully, as I said, the continuity and the spirit of the guys, the good memories from last year, hopefully will keep us spirit high, Benade said.\n\nWinner between Zimbabwe and Tunisia will face victor between Kenya and hosts Uganda in the semi-finals.\n\nThis years Rugby Africa Cup winner will automatically qualify for the 2027 Rugby World Cup.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/06071412/IMG-20250706-WA0000.jpg",
            "description": "<p>By Sports Reporter  ZIMBABWE senior men’s rugby team arrived in Uganda on Saturday for the 2025 Rugby Africa Cup. Fondly known as the ‘Sables’, the local side walks into this year’s edition with aspirations to defend the title which they won last year. This year’s Rugby Africa Cup will see eight countries battling for honours,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sables-in-uganda-to-defend-africa-rugby-cup-title/\">Zimbabwe’s Sables in Uganda to defend Africa Rugby Cup title</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:28",
            "date": "06 Jul 2025"
        },
        {
            "title": "Young Warriors coach Simon Marange parts ways with Orlando Pirates",
            "url": "https://www.newzimbabwe.com/young-warriors-coach-simon-marange-parts-ways-with-orlando-pirates/",
            "content": "By Sports Reporter\n\nSIMON Marange, coach of Zimbabwe mens national Under 20 soccer side, the Young Warriors, has parted ways with Orlando Pirates after seven years of service.\n\nMarange was the Under 21 head coach at The Sea Robbers and won several cups during his time.Last month, the Zimbabwean gaffer led the Warriors as head coach at the 2025 mens Confederation of Southern African Football (COSAFA) Cup, which was hosted in South Africa.Although he did not specify reasons for his departure from Orlando Pirates, Marange appreciated the club for believing in him.(Seven) 7 yrs, incredible teams, unbelievable talents, obsessed staff. Thank you for giving me a platform to chase my dreams, forever in my heart Orlando Pirates, he posted on social media.Thank you management for the faith support & lessons. Thank you everyone who took this journey with me, till next time.Maranges highlight at Orlando Pirates was in 2018 when he marshalled the side to clinching the Future Champions Trophy.\n\nMarange was the Under 21 head coach at The Sea Robbers and won several cups during his time.\n\nLast month, the Zimbabwean gaffer led the Warriors as head coach at the 2025 mens Confederation of Southern African Football (COSAFA) Cup, which was hosted in South Africa.Although he did not specify reasons for his departure from Orlando Pirates, Marange appreciated the club for believing in him.(Seven) 7 yrs, incredible teams, unbelievable talents, obsessed staff. Thank you for giving me a platform to chase my dreams, forever in my heart Orlando Pirates, he posted on social media.Thank you management for the faith support & lessons. Thank you everyone who took this journey with me, till next time.Maranges highlight at Orlando Pirates was in 2018 when he marshalled the side to clinching the Future Champions Trophy.\n\nLast month, the Zimbabwean gaffer led the Warriors as head coach at the 2025 mens Confederation of Southern African Football (COSAFA) Cup, which was hosted in South Africa.\n\nAlthough he did not specify reasons for his departure from Orlando Pirates, Marange appreciated the club for believing in him.(Seven) 7 yrs, incredible teams, unbelievable talents, obsessed staff. Thank you for giving me a platform to chase my dreams, forever in my heart Orlando Pirates, he posted on social media.Thank you management for the faith support & lessons. Thank you everyone who took this journey with me, till next time.Maranges highlight at Orlando Pirates was in 2018 when he marshalled the side to clinching the Future Champions Trophy.\n\nAlthough he did not specify reasons for his departure from Orlando Pirates, Marange appreciated the club for believing in him.\n\n(Seven) 7 yrs, incredible teams, unbelievable talents, obsessed staff. Thank you for giving me a platform to chase my dreams, forever in my heart Orlando Pirates, he posted on social media.Thank you management for the faith support & lessons. Thank you everyone who took this journey with me, till next time.Maranges highlight at Orlando Pirates was in 2018 when he marshalled the side to clinching the Future Champions Trophy.\n\n(Seven) 7 yrs, incredible teams, unbelievable talents, obsessed staff. Thank you for giving me a platform to chase my dreams, forever in my heart Orlando Pirates, he posted on social media.\n\nThank you management for the faith support & lessons. Thank you everyone who took this journey with me, till next time.Maranges highlight at Orlando Pirates was in 2018 when he marshalled the side to clinching the Future Champions Trophy.\n\nThank you management for the faith support & lessons. Thank you everyone who took this journey with me, till next time.\n\nMaranges highlight at Orlando Pirates was in 2018 when he marshalled the side to clinching the Future Champions Trophy.\n\nMaranges highlight at Orlando Pirates was in 2018 when he marshalled the side to clinching the Future Champions Trophy.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/06071040/Simon-Marange.jpg",
            "description": "<p>By Sports Reporter  SIMON Marange, coach of Zimbabwe men’s national Under 20 soccer side, the Young Warriors, has parted ways with Orlando Pirates after seven years of service. Marange was the Under 21 head coach at ‘The Sea Robbers’ and won several cups during his time. Last month, the Zimbabwean gaffer led the Warriors as</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/young-warriors-coach-simon-marange-parts-ways-with-orlando-pirates/\">Young Warriors coach Simon Marange parts ways with Orlando Pirates</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:28",
            "date": "06 Jul 2025"
        },
        {
            "title": "Zimbabwe launches wildlife translocation programme to restore biodiversity at national park",
            "url": "https://www.newzimbabwe.com/zimbabwe-launches-wildlife-translocation-programme-to-restore-biodiversity-at-national-park/",
            "content": "By Mary Taruvinga\n\nZIMBABWE Parks and Wildlife Management Authority (ZimParks) has announced the implementation of a comprehensive wildlife transformation programme.\n\nThe exercise is aimed at improving the biodiversity in one of its major game reserves, the Matusadonha National Park (MNP).\n\nZimParks spokesperson Tinashe Farawo said the multi-year initiative will be rolled out in partnership with the African Parks Network and The Matusadona Conservation Trust.\n\nThis will be done to restore biodiversity, enhance ecological resilience, and support sustainable natural resource management within MNP and its broader landscape.\n\nThe authority issued permits to translocate 10 eland (Taurotragus oryx) and 50 buffalos (Syncerus caffer) from Tsetse Island, part of the Lake Kariba Recreational Park, to Matusadona.\n\nAdditionally, 20 sable antelope (Hippotragus niger) will be relocated from Sibilobilo Safari Area, alongside other key herbivores-including sable, eland, and roan antelope (Hippotragus equinus) sourced from carefully selected populations across the country.\n\nThis strategic intervention aims to re-establish viable, self-sustaining herbivore populations, contributing to ecosystem restoration and the rewilding of Matusadona as part of the larger Sebungwe landscape, Farawo said in a Friday statement.\n\nAccording to Farawo these efforts are underpinned by scientific ecological assessments to safeguard the health and sustainability of source populations.\n\nHe said throughout the duration of this multi-year programme, additional measures will be implemented to strengthen conservation outcomes.\n\nThese include enhanced law enforcement, biodiversity monitoring, and community development initiatives aimed at improving local livelihoods, boosting anti-poaching efforts, and generating tangible conservation benefits for communities living adjacent to the national park.\n\nSuch integrated approaches are essential to promoting coexistence and ensuring the long-term sustainability of conservation efforts.\n\nMatusadona National Park is currently undergoing a transformative phase, driven by substantial investments in infrastructure, ecological restoration, and stakeholder engagement, these initiatives are positioning the park once again as a key national conservation asset.\n\nThe translocation programme is a vital component of this broader strategy, ensuring that wildlife populations thrive and that the ecological, cultural, and economic benefits are preserved for present and future generations.\n\nFarawo said ZimParks and its partners remain committed to responsible, evidence-based conservation practices that uphold biodiversity integrity, ecosystem health, and community well-being.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/09/08134815/Hwange-National-Park.jpg",
            "description": "<p>By Mary Taruvinga  ZIMBABWE Parks and Wildlife Management Authority (ZimParks) has announced the implementation of a comprehensive wildlife transformation programme. The exercise is aimed at improving the biodiversity in one of its major game reserves, the Matusadonha National Park (MNP). ZimParks spokesperson Tinashe Farawo said the multi-year initiative will be rolled out in partnership with</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-launches-wildlife-translocation-programme-to-restore-biodiversity-at-national-park/\">Zimbabwe launches wildlife translocation programme to restore biodiversity at national park</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:28",
            "date": "06 Jul 2025"
        },
        {
            "title": "Woman imprisoned 15 years for bizarre sexual act on girl (7)",
            "url": "https://www.newzimbabwe.com/woman-imprisoned-15-years-for-bizarre-sexual-act-on-girl-7/",
            "content": "By Mary Taruvinga\n\nA 19-year-old woman from Chirumanzu in Midlands province has been slapped with a 15-year jail term for indecent assault on a seven-year-old girl.\n\nTatenda Madanhire of Munetsi village in Chirumazu, Midlands province, was convicted by Gweru Magistrate Christopher Maturure after pleading guilty to the charge.\n\nThe court heard she violated the minor on the pretext of teaching her a game.\n\nThe accused and the complainant are not related.\n\nThe State proved that the incident occurred on June 21, 2025, at around 1500 hours.\n\nThe complainant was walking from school with her schoolmate also aged seven.\n\nThey then met Madanhire, who was gathering firewood in a bush in the riverbanks of dry stream near the village.\n\nThe accused walked for a distance of approximately 500 metres with the two and she grabbed the complainants hand and told that she wanted to play a game with her.\n\nShe scolded the other child and instructed her to proceed home.\n\nThe accused took the complainant to a secluded place where she undressed her before sexually assaulting her using her enlarged genitalia, which bizarrely resembles a male persons private organ.\n\nWhen the complainant arrived home, she told her aunt that she was sexually abused by a male person who was wearing a skirt.\n\nThe matter was reported to the police and investigations were carried out leading to the arrest of the accused.\n\nThe complainant and accused were sent to St Theresas Hospital for medical examination, and they were medically examined.\n\nMonica Mungwena prosecuted.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/08/27185530/Rape-e1598550954788.jpeg",
            "description": "<p>By Mary Taruvinga A 19-year-old woman from Chirumanzu in Midlands province has been slapped with a 15-year jail term for indecent assault on a seven-year-old girl. Tatenda Madanhire of Munetsi village in Chirumazu, Midlands province, was convicted by Gweru Magistrate Christopher Maturure after pleading guilty to the charge. The court heard she violated the minor</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/woman-imprisoned-15-years-for-bizarre-sexual-act-on-girl-7/\">Woman imprisoned 15 years for bizarre sexual act on girl (7)</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:28",
            "date": "06 Jul 2025"
        },
        {
            "title": "FC Platinum challenged to win PSL title in honour of late Brian Banda",
            "url": "https://www.newzimbabwe.com/fc-platinum-challenged-to-win-psl-title-in-honour-of-late-brian-banda/",
            "content": "By Sports Reporter\n\nWARRIORS midfielder Thandolwenkosi Ngwenya has challenged former club FC Platinum to win the 2025 Castle Lager Premier Soccer League title in honour of the late Brian Banda, who passed away Sunday last week.\n\nBanda was involved in an accident, which claimed two other lives on the spot along Zvishavane -Filabusi road and was laid to rest last Wednesday in Bulawayo.Ngwenya, who completed a move from FC Platinum to South Africas Betway Premiership side Amazulu, was last week voted Castle Lager Premier Soccer League Player of The Month June after a good run which saw him scoring three goals.Brian Bandas passing away was a shock but we just have to accept the reality.I just want to say to the boys (FC Platinum team) stay strong and work hard.You (players ) just have to win the league for the sake of Brian Banda, said Ngwenya.The 22-year-old added that 2025 has been the best year for him at FC Platinum and he will forever cherish the memories.I can say this was the best season for me at FC Platinum, especially the month of June, l did enjoy a lot although we had to part, added Ngwenya.Ngwenya was FC Platinums best performing player during the first half of the season, scoring nine goals in 17 games.\n\nBanda was involved in an accident, which claimed two other lives on the spot along Zvishavane -Filabusi road and was laid to rest last Wednesday in Bulawayo.\n\nNgwenya, who completed a move from FC Platinum to South Africas Betway Premiership side Amazulu, was last week voted Castle Lager Premier Soccer League Player of The Month June after a good run which saw him scoring three goals.Brian Bandas passing away was a shock but we just have to accept the reality.I just want to say to the boys (FC Platinum team) stay strong and work hard.You (players ) just have to win the league for the sake of Brian Banda, said Ngwenya.The 22-year-old added that 2025 has been the best year for him at FC Platinum and he will forever cherish the memories.I can say this was the best season for me at FC Platinum, especially the month of June, l did enjoy a lot although we had to part, added Ngwenya.Ngwenya was FC Platinums best performing player during the first half of the season, scoring nine goals in 17 games.\n\nNgwenya, who completed a move from FC Platinum to South Africas Betway Premiership side Amazulu, was last week voted Castle Lager Premier Soccer League Player of The Month June after a good run which saw him scoring three goals.\n\nBrian Bandas passing away was a shock but we just have to accept the reality.I just want to say to the boys (FC Platinum team) stay strong and work hard.You (players ) just have to win the league for the sake of Brian Banda, said Ngwenya.The 22-year-old added that 2025 has been the best year for him at FC Platinum and he will forever cherish the memories.I can say this was the best season for me at FC Platinum, especially the month of June, l did enjoy a lot although we had to part, added Ngwenya.Ngwenya was FC Platinums best performing player during the first half of the season, scoring nine goals in 17 games.\n\nBrian Bandas passing away was a shock but we just have to accept the reality.\n\nI just want to say to the boys (FC Platinum team) stay strong and work hard.You (players ) just have to win the league for the sake of Brian Banda, said Ngwenya.The 22-year-old added that 2025 has been the best year for him at FC Platinum and he will forever cherish the memories.I can say this was the best season for me at FC Platinum, especially the month of June, l did enjoy a lot although we had to part, added Ngwenya.Ngwenya was FC Platinums best performing player during the first half of the season, scoring nine goals in 17 games.\n\nI just want to say to the boys (FC Platinum team) stay strong and work hard.\n\nYou (players ) just have to win the league for the sake of Brian Banda, said Ngwenya.The 22-year-old added that 2025 has been the best year for him at FC Platinum and he will forever cherish the memories.I can say this was the best season for me at FC Platinum, especially the month of June, l did enjoy a lot although we had to part, added Ngwenya.Ngwenya was FC Platinums best performing player during the first half of the season, scoring nine goals in 17 games.\n\nYou (players ) just have to win the league for the sake of Brian Banda, said Ngwenya.\n\nThe 22-year-old added that 2025 has been the best year for him at FC Platinum and he will forever cherish the memories.I can say this was the best season for me at FC Platinum, especially the month of June, l did enjoy a lot although we had to part, added Ngwenya.Ngwenya was FC Platinums best performing player during the first half of the season, scoring nine goals in 17 games.\n\nThe 22-year-old added that 2025 has been the best year for him at FC Platinum and he will forever cherish the memories.\n\nI can say this was the best season for me at FC Platinum, especially the month of June, l did enjoy a lot although we had to part, added Ngwenya.Ngwenya was FC Platinums best performing player during the first half of the season, scoring nine goals in 17 games.\n\nI can say this was the best season for me at FC Platinum, especially the month of June, l did enjoy a lot although we had to part, added Ngwenya.\n\nNgwenya was FC Platinums best performing player during the first half of the season, scoring nine goals in 17 games.\n\nNgwenya was FC Platinums best performing player during the first half of the season, scoring nine goals in 17 games.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/29175151/IMG-20250629-WA0043.jpg",
            "description": "<p>By Sports Reporter WARRIORS midfielder Thandolwenkosi Ngwenya has challenged former club FC Platinum to win the 2025 Castle Lager Premier Soccer League title in honour of the late Brian Banda, who passed away Sunday last week. Banda was involved in an accident, which claimed two other lives on the spot along Zvishavane -Filabusi road and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/fc-platinum-challenged-to-win-psl-title-in-honour-of-late-brian-banda/\">FC Platinum challenged to win PSL title in honour of late Brian Banda</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:28",
            "date": "06 Jul 2025"
        }
    ]
}