{
    "news": [
        {
            "title": "Broken spine, leg and bedridden for seven years — The painful story of nurse injured on duty, betrayed by government she served",
            "url": "https://www.newzimbabwe.com/broken-spine-leg-and-bedridden-for-seven-years-the-painful-story-of-nurse-injured-on-duty-betrayed-by-government-she-served/",
            "content": "By Thandiwe Garusa\n\nA NURSE at Bikita Rural Hospital in Masvingo province, who was seriously injured by a violent maternity patient while on duty seven years ago, is now bedridden without compensation, support, and medical care she was denied by the government.\n\nOn the night of August 13, 2018, Progress Muzuva left Bikita Rural Hospital after she was assigned to escort a pregnant patient in need of emergency care to Silveira Mission Hospital as part of her duties.\n\nThe patient she was escorting seemed stable when they began the journey, but suddenly became violent, screaming, throwing herself against the ambulances body, and trying to leap from the moving vehicle in a bid to commit suicide.\n\nMuzuva fought to save her patient from taking her own life while the ambulance bounced along the rural road. The driver was reportedly unaware of the chaos in the back.\n\nAt one point, the woman smashed the ambulance window and tried to leap out. That is when the driver realised something was amiss and finally stopped and opened the door, only to be greeted by punches. The patient then fled.\n\nMuzuva and the driver chased her through the darkness and brought her back into the ambulance.\n\nMuzuva, fearing another outburst, refused to leave the woman alone and stayed in the back of the ambulance.\n\nMoments later, the woman went into labour and Muzuva delivered the baby with her bare hands.\n\nThe violent mother, now delusional, accused Muzuva of swapping the baby upon realising it was a girl and started screaming and trying to kill the infant.\n\nI was shielding the newly born baby from her mother who wanted to kill her with one hand holding the slippery baby while another one pushing the bleeding mother away, Muzuva narrated her ordeal to NewZimbabwe.com.\n\nMuzuva and the driver finally arrived at Silveira and handed over the baby and the mother safely; however, her own body was broken.\n\nSeasoned obstetrician and gynaecologist, Dr Tawanda Matsa told NewZimbabwe.com that the patients condition may have been triggered by post natal depression that may be caused by social circumstances.\n\nThis may have been a result of the social circumstances she was in. Maybe she was looking for a boy child for a long time and this may have made her end up rejecting the child and going through a condition called Puerperal Psychosis\n\nSometimes the patient may also have suffered from an underlying psychotic disorder, previously or bipolar.\n\nMost of these psychotic issues happen soon after delivery. About 80% of women experience postpartum blues, which usually last a few days. 20% of women also suffer from postpartum depression which most people do not take seriously as it is mild.\n\nAbout 2% to 5% of women suffer from puerperal psychosis, which happened in this situation and this is the far end of postpartum depression, Matsa said.\n\nDenied medical assistance by the government\n\nThe following day after the incident, Muzuva realised she had sustained serious injuries as her left leg was swollen, and she could barely walk.\n\nX-rays confirmed her leg was fractured and her spine had been injured.\n\nThe government which is the very institution she served, turned its back on her.\n\nI was given a normal sick leave instead of compensatory sick leave, which is supposed to be given to someone who has been injured while on duty. I was referred to a neurosurgeon in Gweru at Claybank Hospital, Muzuva said.\n\nHer requests for an ambulance to travel to specialist hospitals were denied. Authorities from the district office refused even to write her a letter explaining how she got injured.\n\nThe process of having to find money delayed her from getting assistance while her condition deteriorated.\n\nI struggled to get money and I finally managed to hire a commuter omnibus, removing seats and lying on a mattress just to get to my appointments as I cannot sit anymore, she narrated.\n\nShe paid for every CT scan, every X-ray, and every consultation out of her own pocket money, which she did not have.\n\nShe is now bedridden and owes US$11,000 in medical bills, and has to go through another surgery.\n\nDespite multiple specialist referrals, Muzuva was denied government assistance at every turn.\n\nMedical reports seen by NewZimbabwe.com show that a neurosurgeon confirmed that her spine was fractured and required immediate surgery.\n\nThe Ministry of Health refused to help and turned down every ambulance request or financial assistance.\n\nBetrayed by a system which does not care\n\nMuzuva only got her full salary in the first two months after sick leave and in the third month, the salary was deducted by 50%.\n\nShe kept begging the human resource (HR) manager to put her on compensatory sick leave so she could get her full salary and other assistance, but was told off.\n\nI really needed the salary for medical expenses and I kept begging the District HR to put me on compensatory sick leave and he said to me, if you now want to work here at the HR offices, you may come and I will come and sleep in that bed as you, Muzuva told NewZimbabwe.com.\n\nAfter a full year of agony, Muzuva finally underwent spinal surgery in December 2019 at Parirenyatwa Hospital.\n\nAccording to her, four days later, Bikita District HR called her to come so they could discuss her situation, and she explained to her that she could not manage as she had gone through surgery and was still recovering in the hospital.\n\nThe HR made it clear that if she failed to present herself immediately, she should not bother them with her matter. This threat forced Muzuva to hire transport and make the journey, only to be told the medical board she was supposed to meet was not available.\n\nShe had to hire a car back to Parirenyatwa Hospital in Harare to continue with her admission.\n\nHer spine continued to deteriorate, she could no longer sit, walk, or use the toilet and started wearing adult diapers.\n\nLater in 2021, while her health worsened, the government deepened its betrayal and wrote to her saying it wanted her to retire but she refused on the basis that the letter stated she was not injured at work, which meant she was not entitled to the compensation she was supposed to get.\n\nSince then, she used to do follow ups and they have ignored her.\n\nShe reached every responsible office in the ministry from the district level to the minister and has been ignored, denied access, had calls dropped, and denied appointments.\n\nAt one point, she was allegedly told by an official, one Miss Masale in Masvingo province, that I am your employer and if I am quiet, it means there is nothing which needs us to communicate, we have the whole province to run, so I do not bath to just come and handle your matter alone. So I will call you,usandinetse, she said.\n\nDoctors recommended another operation, but again, she lacked the money.\n\nIn January 2023, she underwent a second major operation to install rods and screws in her back and she was assisted by private doctors out of pity, even when she could not afford it.\n\nThe procedure was too late to stop the permanent damage and she still needs reviews, MRIs, and dynamic X-rays but she cannot afford them.\n\nIn September 2023, Muzuva had her last check-up, and two years have now passed without medical follow-up.\n\nNdonzwa kubaiwa (I feel stabbing pain when I move, when I step. The iron in my back is shifting, but I cannot go back for help, Muzuva trembled as she narrated her story to this publication.\n\nSince 2023 to date, Muzuva has been home and she went to the Masvingo Provincial Medical Director earlier this year and was denied access.\n\nShe then went to the provincial HR office where another unidentified official who was there said: munonetsa imimi handiti makati munozvigona mukaenda kuhead office saka mazovingei kuno.\n\nIn 2024, she learned that the ministry had forged a letter on her behalf showing she had accepted retirement in 2022.\n\nThrough the back and forth of trying to get her deserved assistance, Muzuva then got to know that the government had even hired a legal team to handle her case as they tried to deny she was injured at work.\n\nSeven years still investigating while her health deteriorates\n\nMeanwhile, after facing a deluge of criticism over the matter, the panicky Ministry of Health issued a press statement at the weekend saying it is reviewing Muzuvas case through legal and administrative channels.\n\nThe Ministry wishes to clarify that this case has not been ignored by the current administration. In fact, procedures are actively underway to assist her.\n\nHowever, it is important to note that resolution of such matters is not a one-day event. Reviewing a case that dates back to 2018 requires careful and thorough examination of both records and procedures.\n\nTo that end, the matter was referred to the ministrys legal advisors to assess whether all applicable legal and human resources guidelines were properly followed during her handling, including her leave, retirement, and any associated benefits, reads a statement from the underfire ministry.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/04042411/Screenshot_20250804-051338_2.jpg",
            "description": "<p>By Thandiwe Garusa A NURSE at Bikita Rural Hospital in Masvingo province, who was seriously injured by a violent maternity patient while on duty seven years ago, is now bedridden without compensation, support, and medical care she was denied by the government. On the night of August 13, 2018, Progress Muzuva left Bikita Rural Hospital</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/broken-spine-leg-and-bedridden-for-seven-years-the-painful-story-of-nurse-injured-on-duty-betrayed-by-government-she-served/\">Broken spine, leg and bedridden for seven years — The painful story of nurse injured on duty, betrayed by government she served</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:20",
            "date": "04 Aug 2025"
        },
        {
            "title": "Legal Discussions with Vengai Madzima: Compulsory Land Acquisition and Compensation by the State in Zimbabwe",
            "url": "https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-compulsory-land-acquisition-and-compensation-by-the-state-in-zimbabwe/",
            "content": "NewZimbabwe.com hasinvited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal), to discuss with us legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer.\n\nReporter: Welcome back Mr. Madzima, there was a recent landmark judgment in the Zimbabwe Courts on land acquisition and compensation by the government which may affect some acquired land, what was the case about?\n\nVM: Yes, there was indeed a landmark constitutional judgment delivered on 29thJuly, 2025 in Alistair Michael Fletcher v Minister of Lands, Agriculture, Fisheries, Water and Rural Development and others.\n\nWell, I will attempt to summarise the facts. The land in question is in Umguza on the peripheries of Bulawayo City. It was incorporated into the City of Bulawayo through a statutory instrument issued by the President in 1999. Sometime in 2000, the land was subsequently gazetted for acquisition by the State under the land reform program and caveats were placed on the title deeds to perfect the acquisition.\n\nThe main issue for contention was whether or not the land was capable of acquisition under the land reform program which targeted agricultural land, as the land had become urban land by means of the statutory instrument of 1999, I referred to and various correspondence from the Bulawayo City Council which referred to it and adjacent lands as urban territory.\n\nReporter: At face value, it appears simple enough, what where the main areas of contention?\n\nVM: It may appear so, however, there was a conflict in the understanding and application of various constitutional provisions. Main being the interpretation of S16B (2) of the old constitution which limited the rights of individual to challenge the acquisition of land for agricultural purposes after it has been gazetted and conversely, the rights of the courts to adjudicate on such cases where land was acquired under the land reform process. S16B (3) of the same constitution reserved judicial review powers with the courts where expropriation was not in terms of section 16 B(2) as was eventually decided in this case. The other constitutional questions which had to be decided included the right to hold, use and not be deprived of property and the right to equal protection and benefit of the law in situations where the application of s16B(2)a was challenged, which section is now s72 of the new constitution.,\n\nReporter: What was the decision of the court and its reasoning?\n\nVM: The Constitutional Court agreed with the decision of the High Court that the land in question was urban land by virtue of it being classified as such by law and the City of Bulawayo, that being so, the State cannot compulsorily acquire urban land without compensation by using the constitutional provisions reserved for land reform acquisitions.\n\nCompensation in land reform acquisitions is limited to improvements made on land.\n\nIn reaching its decision, the court considered the meaning of agricultural land in terms of the constitution and whether Mr. Fletchers land can be classified as agricultural land. It also considered its own jurisdiction to hear the matter on the basis of whether the land in question was agricultural or urban land.\n\nReporter: What are the key takeaways from this judgment?\n\nVM: Key takeaways are that the land reform constitutional provisions ousting the authority of the courts to hear and determine acquired land refer only to agricultural land.\n\nThe courts still retain the right to hear cases to confirm whether such acquisition was done in terms of the constitutional provisions and for cases referring to compensation of improvements.\n\nThe courts also upheld the constitutional provisions relating to right to property and equal access to the courts for all urban land.\n\nThe other takeaway is not mentioned in the judgment but is necessary as it reasserts the position that our court system still functions; this is a clear case separating the government and judiciary in their interpretation of the law.\n\nReporter: How will this judgment affect owners of tracts of land in periurban areas?\n\nVM: In my view, it brings certainty that once land is classified as urban land, it is not capable of compulsory acquisition under the land reform program or acquisition without compensation. It will assist developers and investors in their planning, knowing there is precedent from the highest court securing property rights\n\nReporter: Thank you, Mr. Madzima, we have to end here because of our time.\n\nVM: Thank you.\n\nRELATED:\n\nYou can contact Vengai Madzima onvengai@mcmlegal.co.zwor at www.mcmlegal.co.zw.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/03200530/Newzimbabwe.com-Artwork-750x500_20250803_202914_0000.png",
            "description": "<p>NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal), to discuss with us legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer. Reporter: Welcome back Mr. Madzima, there was a recent landmark judgment in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-compulsory-land-acquisition-and-compensation-by-the-state-in-zimbabwe/\">Legal Discussions with Vengai Madzima: Compulsory Land Acquisition and Compensation by the State in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:20",
            "date": "04 Aug 2025"
        },
        {
            "title": "South African court orders forfeiture of R446,000 cash and Toyota Fortuner from Zimbabwean who failed to explain money’s origins",
            "url": "https://www.newzimbabwe.com/r446000-cash-and-toyota-fortuner-forfeited-as-zimbabwean-fails-to-explain-moneys-origins/",
            "content": "By Jonisayi Maromo l IOL\n\nPOLICE in Limpopo searched a Toyota Fortuner driven by a Zimbabwean national on the N1 freeway and found R446,000 in a bag, which was then seized by the law enforcement authorities.\n\nThe High Court in Limpopo has granted a forfeiture order for a cash amount of R446,000 and a Toyota Fortuner sport utility vehicle, which were seized by police.\n\nThe Hawks asset forfeiture investigation unit and the National Prosecuting Authoritys asset forfeiture unit (AFU) worked tirelessly to ensure the forfeiture of the money and the vehicle.\n\nThis emanates from the arrest conducted by members of the South African Police Service attached to Musina in 2024. On 4 July 2024, police conducted a stop and search operation along the N1 road in Musina, said Warrant Officer Lethunya Mmuroa, provincial spokesperson for the Hawks in Limpopo.\n\nDuring the operation, the police officers stopped the Toyota Fortuner which was driven by a foreign national.\n\nDuring a search, police found a plastic bag that contained South African bank notes underneath blankets inside the boot. Police interviewed the driver, and he failed to give a clear explanation for carrying the large amount of money inside the vehicle, said Mmuroa.\n\nThe driver was immediately arrested and the money was seized.\n\nThe Hawks asset forfeiture investigation unit was consulted for asset investigation.\n\nAfter completion of the investigations, the Hawks referred the matter to the National Prosecuting Authoritys asset forfeiture unit for further handling.\n\nFollowing court processes, the High Court in Limpopo granted a preservation order for the Toyota Fortuner and the money in February, before the forfeiture order was granted last week.\n\nThe cash was deposited into the criminal asset recovery account on 29 July. The forfeited Toyota Fortuner is about to be sold on auction, said Mmuroa.\n\nEarlier this year, IOL reported that a 49-year-old man was arrested on charges of money laundering after being found in possession of about R1.2 million in cash.\n\nAt the time, provincial police spokesperson in Mpumalanga, Lieutenant Colonel Jabu Ndubane, said the arrested man had allegedly tried to bribe police officers after the money was found.\n\nThis achievement is the result of the dedication by members deployed for Operation Vala Umgodi, and the man was nabbed on 16 March 2025 at Tonga near Komatipoort, said Ndubane.\n\nShe said police officers received a tip-off about a man who was allegedly in possession of an unlicenced firearm.\n\nThey then responded swiftly and followed the information, and upon arrival at Tonga View, they found the owner of the house and conducted a search and it was during that time when they discovered the large sum of money hidden under the bed as well as inside the wardrobe, said Ndubane.\n\nThe astute members continued searching in other rooms where they further found a bag full of money. It was during the process when the man tried his luck to bribe the police officials with R50,000, but his attempts failed dismally.\n\nNdubane said the money amounted to R1.2 million in banknotes and coins, while there was also Mozambican currency.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/04/13211547/SA-Limpopo-High-Court.jpeg",
            "description": "<p>By Jonisayi Maromo l IOL POLICE in Limpopo searched a Toyota Fortuner driven by a Zimbabwean national on the N1 freeway and found R446,000 in a bag, which was then seized by the law enforcement authorities. The High Court in Limpopo has granted a forfeiture order for a cash amount of R446,000 and a Toyota</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/r446000-cash-and-toyota-fortuner-forfeited-as-zimbabwean-fails-to-explain-moneys-origins/\">South African court orders forfeiture of R446,000 cash and Toyota Fortuner from Zimbabwean who failed to explain money’s origins</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:20",
            "date": "04 Aug 2025"
        },
        {
            "title": "Nigerian man who identified as a Zimbabwean national denied spousal permit",
            "url": "https://www.newzimbabwe.com/nigerian-man-who-identified-as-a-zimbabwean-national-denied-spousal-permit/",
            "content": "By Sinenhlanhla Masilela l IOL News\n\nA NIGERIAN man who also identified as a Zimbabwean national had his application for spousal permit dismissed in an unopposed matter.\n\nIn an application at the North Gauteng High Court in Pretoria, Valentine Ezihe submitted an affidavit under the name Marshall Banda. In the affidavit, he identified himself as a Zimbabwean man living in Centurion, possessing a Zimbabwean passport with an unverified number.\n\nAccording to the supporting affidavit, Ezihes spousal application had been pending for two years without a response or decision from Home Affairs.\n\nIn June 2025, he served a notice of motion on home affairs and the director general of home affairs.\n\nEzihe asked the court to direct home affairs officials to issue a decision on the outcome of his application within 30 days.\n\nIn May 2025, Bandas affidavit, which claimed to be from Ezihe, was deposed and commissioned to support the notice of motion.\n\nLater, Ezihes supplementary affidavit, which supports Bandas affidavit, was deposed and commissioned in June 2025. This occurred without the prior leave of the court.\n\nEzihes legal representative argued that there were no legal provisions requiring the parties to obtain leave before supplementing their court submissions.\n\nHowever, Judge Keitumetse Johanna Mogale said the decision to permit the filing of an additional affidavit remains within the courts discretion.\n\nJudge Mogale said if affidavits are filed without leave from the court, the affidavits can be ignored.\n\nI conclude that supplementing court papers without prior leave from the court is not allowed. Disregarding rules governing the filing of affidavits can result in the affidavit being struck from the record or the court refusing to consider it, she said.\n\nFurthermore, the judge was not impressed with the application and said it was drafted as a cut-and-paste from a template.\n\nShe further criticised Ezihes legal representative for failing to comply with procedural standards.\n\nMs. Hadebe bears the duty to uphold professional integrity in her dealings with the client, the court, and in all professional interactions, said judge Mogale.\n\nTherefore, it is my view that the applicant (Ezihe) has failed to make out a proper case for an order compelling the respondents (home affairs officials) to issue the outcome of the applicants spousal permit application, she said.\n\nEzihes application was dismissed.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/15225721/SA-Home-Affairs2.jpg",
            "description": "<p>By Sinenhlanhla Masilela l IOL News A NIGERIAN man who also identified as a Zimbabwean national had his application for spousal permit dismissed in an unopposed matter. In an application at the North Gauteng High Court in Pretoria, Valentine Ezihe submitted an affidavit under the name Marshall Banda. In the affidavit, he identified himself as</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nigerian-man-who-identified-as-a-zimbabwean-national-denied-spousal-permit/\">Nigerian man who identified as a Zimbabwean national denied spousal permit</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:20",
            "date": "04 Aug 2025"
        },
        {
            "title": "COP15 concludes with enhanced global resolve to wetland conservation",
            "url": "https://www.newzimbabwe.com/cop15-concludes-with-enhanced-global-resolve-to-wetland-conservation/",
            "content": "By Xinhua\n\nTHE 15th Meeting of the Conference of the Contracting Parties to the Ramsar Convention on Wetlands (COP15) concluded Thursday in the resort city of Victoria Falls, Zimbabwe, with an increased global commitment to wetland conservation.\n\nThe COP15 ran under the theme of Protecting Wetlands for Our Common Future, drawing government representatives to highlight the vital role of wetlands in sustaining ecological health, biodiversity, and climate resilience.Adopted resolutions at COP15 include accelerating national and regional actions, enhancing monitoring and reporting, capacity building and mobilization of resources for wetlands conservation, and mainstreaming the wetlands into climate adaptation and disaster risk reduction, among others.Related parties also agreed to strengthen flyway conservation efforts to protect migratory birds, endorsed the establishment of the Global Waterbird Estimates Partnership, and recognized the importance of conserving river dolphins and other inland wetland indicator species.A key outcome of COP15 was the Victoria Falls Declaration, which emphasised the need for increased resource mobilisation, political commitment, and investment in wetland protection and restoration.In her closing remarks, COP15 President and Zimbabwes Minister of Environment, Climate and Wildlife Evelyn Ndlovu urged all contracting parties to embed the commitments of COP15 into national policies and strategies.Ndlovu called for international cooperation and financial mechanisms to close the resource gap for wetland restoration and protection.We also call upon strengthening of synergies with other multilateral environmental agencies and agreements to enable us to address complex, interconnected environmental challenges like climate change, plastic and mercury pollution more effectively and efficiently, she said.This will help us simplify our collective influence on global environmental protection and improve outcomes for ecosystems and human health, while fostering innovation and shared learning for all, she added.\n\nThe COP15 ran under the theme of Protecting Wetlands for Our Common Future, drawing government representatives to highlight the vital role of wetlands in sustaining ecological health, biodiversity, and climate resilience.\n\nAdopted resolutions at COP15 include accelerating national and regional actions, enhancing monitoring and reporting, capacity building and mobilization of resources for wetlands conservation, and mainstreaming the wetlands into climate adaptation and disaster risk reduction, among others.Related parties also agreed to strengthen flyway conservation efforts to protect migratory birds, endorsed the establishment of the Global Waterbird Estimates Partnership, and recognized the importance of conserving river dolphins and other inland wetland indicator species.A key outcome of COP15 was the Victoria Falls Declaration, which emphasised the need for increased resource mobilisation, political commitment, and investment in wetland protection and restoration.In her closing remarks, COP15 President and Zimbabwes Minister of Environment, Climate and Wildlife Evelyn Ndlovu urged all contracting parties to embed the commitments of COP15 into national policies and strategies.Ndlovu called for international cooperation and financial mechanisms to close the resource gap for wetland restoration and protection.We also call upon strengthening of synergies with other multilateral environmental agencies and agreements to enable us to address complex, interconnected environmental challenges like climate change, plastic and mercury pollution more effectively and efficiently, she said.This will help us simplify our collective influence on global environmental protection and improve outcomes for ecosystems and human health, while fostering innovation and shared learning for all, she added.\n\nAdopted resolutions at COP15 include accelerating national and regional actions, enhancing monitoring and reporting, capacity building and mobilization of resources for wetlands conservation, and mainstreaming the wetlands into climate adaptation and disaster risk reduction, among others.\n\nRelated parties also agreed to strengthen flyway conservation efforts to protect migratory birds, endorsed the establishment of the Global Waterbird Estimates Partnership, and recognized the importance of conserving river dolphins and other inland wetland indicator species.A key outcome of COP15 was the Victoria Falls Declaration, which emphasised the need for increased resource mobilisation, political commitment, and investment in wetland protection and restoration.In her closing remarks, COP15 President and Zimbabwes Minister of Environment, Climate and Wildlife Evelyn Ndlovu urged all contracting parties to embed the commitments of COP15 into national policies and strategies.Ndlovu called for international cooperation and financial mechanisms to close the resource gap for wetland restoration and protection.We also call upon strengthening of synergies with other multilateral environmental agencies and agreements to enable us to address complex, interconnected environmental challenges like climate change, plastic and mercury pollution more effectively and efficiently, she said.This will help us simplify our collective influence on global environmental protection and improve outcomes for ecosystems and human health, while fostering innovation and shared learning for all, she added.\n\nRelated parties also agreed to strengthen flyway conservation efforts to protect migratory birds, endorsed the establishment of the Global Waterbird Estimates Partnership, and recognized the importance of conserving river dolphins and other inland wetland indicator species.\n\nA key outcome of COP15 was the Victoria Falls Declaration, which emphasised the need for increased resource mobilisation, political commitment, and investment in wetland protection and restoration.In her closing remarks, COP15 President and Zimbabwes Minister of Environment, Climate and Wildlife Evelyn Ndlovu urged all contracting parties to embed the commitments of COP15 into national policies and strategies.Ndlovu called for international cooperation and financial mechanisms to close the resource gap for wetland restoration and protection.We also call upon strengthening of synergies with other multilateral environmental agencies and agreements to enable us to address complex, interconnected environmental challenges like climate change, plastic and mercury pollution more effectively and efficiently, she said.This will help us simplify our collective influence on global environmental protection and improve outcomes for ecosystems and human health, while fostering innovation and shared learning for all, she added.\n\nA key outcome of COP15 was the Victoria Falls Declaration, which emphasised the need for increased resource mobilisation, political commitment, and investment in wetland protection and restoration.\n\nIn her closing remarks, COP15 President and Zimbabwes Minister of Environment, Climate and Wildlife Evelyn Ndlovu urged all contracting parties to embed the commitments of COP15 into national policies and strategies.Ndlovu called for international cooperation and financial mechanisms to close the resource gap for wetland restoration and protection.We also call upon strengthening of synergies with other multilateral environmental agencies and agreements to enable us to address complex, interconnected environmental challenges like climate change, plastic and mercury pollution more effectively and efficiently, she said.This will help us simplify our collective influence on global environmental protection and improve outcomes for ecosystems and human health, while fostering innovation and shared learning for all, she added.\n\nIn her closing remarks, COP15 President and Zimbabwes Minister of Environment, Climate and Wildlife Evelyn Ndlovu urged all contracting parties to embed the commitments of COP15 into national policies and strategies.\n\nNdlovu called for international cooperation and financial mechanisms to close the resource gap for wetland restoration and protection.We also call upon strengthening of synergies with other multilateral environmental agencies and agreements to enable us to address complex, interconnected environmental challenges like climate change, plastic and mercury pollution more effectively and efficiently, she said.This will help us simplify our collective influence on global environmental protection and improve outcomes for ecosystems and human health, while fostering innovation and shared learning for all, she added.\n\nNdlovu called for international cooperation and financial mechanisms to close the resource gap for wetland restoration and protection.\n\nWe also call upon strengthening of synergies with other multilateral environmental agencies and agreements to enable us to address complex, interconnected environmental challenges like climate change, plastic and mercury pollution more effectively and efficiently, she said.This will help us simplify our collective influence on global environmental protection and improve outcomes for ecosystems and human health, while fostering innovation and shared learning for all, she added.\n\nWe also call upon strengthening of synergies with other multilateral environmental agencies and agreements to enable us to address complex, interconnected environmental challenges like climate change, plastic and mercury pollution more effectively and efficiently, she said.\n\nThis will help us simplify our collective influence on global environmental protection and improve outcomes for ecosystems and human health, while fostering innovation and shared learning for all, she added.\n\nThis will help us simplify our collective influence on global environmental protection and improve outcomes for ecosystems and human health, while fostering innovation and shared learning for all, she added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/23201538/Wetlands-COP15-meeting-in-Zimbabwe.jpeg",
            "description": "<p>By Xinhua THE 15th Meeting of the Conference of the Contracting Parties to the Ramsar Convention on Wetlands (COP15) concluded Thursday in the resort city of Victoria Falls, Zimbabwe, with an increased global commitment to wetland conservation. The COP15 ran under the theme of “Protecting Wetlands for Our Common Future,” drawing government representatives to highlight</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cop15-concludes-with-enhanced-global-resolve-to-wetland-conservation/\">COP15 concludes with enhanced global resolve to wetland conservation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:20",
            "date": "04 Aug 2025"
        },
        {
            "title": "Train driver in heroic water bottle throwing stunt that saved woman from being run over by locomotive",
            "url": "https://www.newzimbabwe.com/train-driver-in-heroic-water-bottle-throwing-stunt-that-saved-woman-from-being-run-over-by-locomotive/",
            "content": "By Staff Reporter\n\nJUST a few metres away from running over an inattentive woman walking on rail tracks, an engineman threw a water bottle that startled her, prompting her to flee with her life.\n\nIn a statement at the weekend, the National Railways of Zimbabwe (NRZ) confirmed the dramatic incident in which 23-year-old Lisa Shumba of Mutare, Manicaland province, cheated death by a whisker.A 23-year-old woman walking on the tracks putting on earphones escaped death by a whisker after a quick-thinking engineman threw a water bottle at her to alert her of an approaching train in Mutare yesterday (Saturday), said NRZ.Lisa Shumba, startled by the water bottle which fell in front of her, turned and saw the train.The locomotive hit her as she jumped off its direct path. She suffered bruises on her knees. She was treated and discharged from hospital.The heroic act by the engineman saved her life since the earphones had prevented her from hearing locomotives warning horn.We salute the engineman and appeal to members of the public to avoid walking on the railway lines, especially when putting on earphones, further reads the statement.\n\nIn a statement at the weekend, the National Railways of Zimbabwe (NRZ) confirmed the dramatic incident in which 23-year-old Lisa Shumba of Mutare, Manicaland province, cheated death by a whisker.\n\nA 23-year-old woman walking on the tracks putting on earphones escaped death by a whisker after a quick-thinking engineman threw a water bottle at her to alert her of an approaching train in Mutare yesterday (Saturday), said NRZ.Lisa Shumba, startled by the water bottle which fell in front of her, turned and saw the train.The locomotive hit her as she jumped off its direct path. She suffered bruises on her knees. She was treated and discharged from hospital.The heroic act by the engineman saved her life since the earphones had prevented her from hearing locomotives warning horn.We salute the engineman and appeal to members of the public to avoid walking on the railway lines, especially when putting on earphones, further reads the statement.\n\nA 23-year-old woman walking on the tracks putting on earphones escaped death by a whisker after a quick-thinking engineman threw a water bottle at her to alert her of an approaching train in Mutare yesterday (Saturday), said NRZ.\n\nLisa Shumba, startled by the water bottle which fell in front of her, turned and saw the train.The locomotive hit her as she jumped off its direct path. She suffered bruises on her knees. She was treated and discharged from hospital.The heroic act by the engineman saved her life since the earphones had prevented her from hearing locomotives warning horn.We salute the engineman and appeal to members of the public to avoid walking on the railway lines, especially when putting on earphones, further reads the statement.\n\nLisa Shumba, startled by the water bottle which fell in front of her, turned and saw the train.\n\nThe locomotive hit her as she jumped off its direct path. She suffered bruises on her knees. She was treated and discharged from hospital.The heroic act by the engineman saved her life since the earphones had prevented her from hearing locomotives warning horn.We salute the engineman and appeal to members of the public to avoid walking on the railway lines, especially when putting on earphones, further reads the statement.\n\nThe locomotive hit her as she jumped off its direct path. She suffered bruises on her knees. She was treated and discharged from hospital.\n\nThe heroic act by the engineman saved her life since the earphones had prevented her from hearing locomotives warning horn.We salute the engineman and appeal to members of the public to avoid walking on the railway lines, especially when putting on earphones, further reads the statement.\n\nThe heroic act by the engineman saved her life since the earphones had prevented her from hearing locomotives warning horn.\n\nWe salute the engineman and appeal to members of the public to avoid walking on the railway lines, especially when putting on earphones, further reads the statement.\n\nWe salute the engineman and appeal to members of the public to avoid walking on the railway lines, especially when putting on earphones, further reads the statement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/11032208/NRZ-train-1.jpg",
            "description": "<p>By Staff Reporter JUST a few metres away from running over an inattentive woman walking on rail tracks, an engineman threw a water bottle that startled her, prompting her to flee with her life. In a statement at the weekend, the National Railways of Zimbabwe (NRZ) confirmed the dramatic incident in which 23-year-old Lisa Shumba</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/train-driver-in-heroic-water-bottle-throwing-stunt-that-saved-woman-from-being-run-over-by-locomotive/\">Train driver in heroic water bottle throwing stunt that saved woman from being run over by locomotive </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:20",
            "date": "04 Aug 2025"
        },
        {
            "title": "Can Artificial Intelligence Save Lives in the NHS?",
            "url": "https://www.newzimbabwe.com/can-artificial-intelligence-save-lives-in-the-nhs/",
            "content": "By Dr Richard Dune\n\nAs the UK deploys AI to detect healthcare risks in real time, what lessons can be drawn for regulatory compliance and governance worldwide?\n\nOn 30 June 2025, the UK government announced the launch of a world-first AI early warning system for the National Health Service (NHS). The initiative, part of its 10-Year Health Plan, aims to transform patient safety and regulatory inspections by using real-time data to detect early signs of harm, before tragedy occurs.\n\nThis system will empower the Care Quality Commission (CQC), Englands independent health and social care regulator, to carry out rapid response inspections whenever AI algorithms detect anomalies in care, such as a spike in stillbirths, preventable deaths, or critical incidents.\n\nIn the context of mounting regulatory failures in recent years, particularly within NHS maternity and mental health services, this bold shift towards predictive oversight and digital compliance could not be more timely.\n\nBut will it work? And what can healthcare systems in Zimbabwe, across Africa, and in the diaspora learn from this transformative approach?\n\nFrom Mid Staffordshire, where up to 1,200 patients died due to neglect, to the Lucy Letby case, in which a neonatal nurse was convicted of murdering seven babies, failures in the NHS have highlighted one painful truth: the system doesnt catch harm soon enough.\n\nIn 2023, multiple NHS maternity units were under investigation, with affected families saying they were ignored or gaslit when they raised concerns.\n\nThe Dash Review (2024) revealed the scale of the problem: the average wait time for a reinspection of Inadequate providers had increased from 87 to 136 days, while some with Requires Improvement ratings waited up to a year. Hundreds of inspection reports were lost due to IT failures, leaving vulnerable patients at risk.\n\nThe NHS, with its 1.3 million employees, thousands of hospitals and clinics, and a massive volume of patient interactions, still largely relies on:\n\nThis approach is reactive, not preventive, and ill-equipped to keep pace with modern healthcare risks.\n\nRapid Response Inspections, introduced in recent years, are an improvement, but still depend on someone raising the alarm. What if the system could detect risk from within  automatically and in real-time?\n\nThis is the very problem that digital compliance systems, supervision Learning Management Systems (LMS), and Training Management Systems (TMS) are built to solve.\n\nThe new AI system, developed under the Plan for Change, will:\n\nThe first rollout, the Maternity Outcomes Signal System, will go live in November 2025. It will monitor indicators such as neonatal deaths, neurological injuries, and emergency escalations across NHS trusts.\n\nIf successful, the model will expand to cover wider incidents, making England the first country in the world to integrate AI directly into regulatory inspections.\n\nThe table below outlines how the CQC will now operate under a two-track model.\n\nIn support of this, the CQC will also:\n\nThis is no longer just about inspections. Its about embedding digital surveillance into governance frameworks, a move that will resonate with policymakers worldwide grappling with similar healthcare risks.\n\nThis new AI capability is built on the NHS Federated Data Platform (FDP), which brings together:\n\nThis 360 view of compliance risk means that NHS providers, and their leaders, must now be audit-ready every day, not just every few years.\n\nFor health and social care leaders in Zimbabwe and across Africa, the message is clear:\n\nThese are no longer nice-to-haves. They are essential components of a resilient and transparent compliance ecosystem.\n\nThe NHS has long been accused of failing to act on known risks, a problem dubbed the implementation gap.\n\nFor this new AI system to succeed, it must be backed by:\n\nAs Sir Julian Hartley, CEO of the CQC, stated, this approach requires aclearer, simpler assessment framework, but it also demands systems that help providers improve, not just fear failure.\n\nThe UKs plan also pledges to strengthen Freedom to Speak Up protocols, with CQC checking whether Integrated Care Boards (ICBs) and providers support whistleblowers.\n\nIn a world of machine-learning models and automated alerts, the human voice, especially that of frontline workers and their families, must not be drowned out.\n\nAI should amplify, not replace, human insight.\n\nAt The Mandatory Training Group, we believe in embedding compassionate governance into all digital systems, whether thats through supervision pathways, LMS/TMS compliance dashboards, or workforce wellbeing initiatives.\n\nInnovation is exciting, but innovation without people is meaningless.\n\nAs Professor Nicola Ranger, General Secretary of the Royal College of Nursing, warned:\n\nTechnology has a role, but in todays NHS, one nurse can be caring for 15 patients. Thats drastically unsafe.\n\nDaniel Elkeles, CEO of NHS Providers, echoed this:\n\nTrusts need time and support to improve. Regulation must be collaborative, not combative.\n\nDigital compliance must empower frontline teams, not overwhelm them with automated penalties.\n\nThe NHS AI early warning system presents a template not just for the UK, but for any country looking to modernise healthcare governance.\n\nFor Zimbabwean policymakers and healthcare entrepreneurs, this offers key insights:\n\nWhether youre running a clinic in Bulawayo, managing training systems for diaspora health workers, or building a compliance framework for a public hospital, this model is worth watching.\n\nBehind every scandal is a silent alarm that was missed.\n\nThis AI system promises to change the timeline of regulation, from reactive punishment to proactive prevention. But success depends on more than algorithms.\n\nIt requires:\n\nTo help health and social care providers adapt, Ive led the development ofComplyPlus, an all-in-one regulatory compliance management platform.\n\nDesigned for both UK and international health and social care providers, ComplyPlus supports:\n\nExplore the ComplyPlus suite:\n\nWith AI reshaping regulation, your systems must evolve too.\n\nRELATED:\n\nFor more insights on regulatory reform, AI in healthcare, training systems, and governance tools, follow my weekly columns onNewZimbabwe.comand connect with me on LinkedIn.\n\nDr Richard Dune is the CEO of LearnPac Systems, a leading UK provider of edtech and compliance software solutions for regulated sectors. He specialises in governance, compliance, and innovation in both public and private sectors.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/03200625/Screenshot-2025-08-03-at-21.05.56.png",
            "description": "<p>By Dr Richard Dune As the UK deploys AI to detect healthcare risks in real time, what lessons can be drawn for regulatory compliance and governance worldwide? On 30 June 2025, the UK government announced the launch of a world-first AI early warning system for the National Health Service (NHS). The initiative, part of its</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/can-artificial-intelligence-save-lives-in-the-nhs/\">Can Artificial Intelligence Save Lives in the NHS?</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:20",
            "date": "04 Aug 2025"
        },
        {
            "title": "Zanu PF grabs Chinhoyi council seat amid CCC boycott, voter apathy",
            "url": "https://www.newzimbabwe.com/zanu-pf-grabs-chinhoyi-council-seat-amid-ccc-boycott-voter-apathy/",
            "content": "By Staff Reporter\n\nTHE ruling party, Zanu PF has won the Chinhoyi Ward 14 seat in a by-election which the opposition Citizens Coalition for Change (CCC) boycotted.\n\nOf the 2,339 registered voters in the ward, only a third turned out to cast their ballots. A NewZimbabwe.com crew witnessed the low voter attendance at the main polling station at Alaska Dolomite Primary School.\n\nDespite the apathy by the majority of the electorate, Zanu PF candidate Solomon Bizwork garnered 599 votes against his rival Hope Zimbiri, who scrapped only 194 votes. Statistics show that the turnout was 33 percent of registered voters.\n\nZimbabwe Electoral Commission (ZEC) presiding officer, Taona Pfunye confirmed the results as posted at the polling station.\n\nBouyed by support from Zanu PF bigwigs, including President Emmerson Mnangagwas advisor, Paul Tungwarara ahead of polls, Biswork promised to champion infrastructural development, including six boreholes to ease water supply crisis in the mining settlement, fixing roads and initiating community business start-ups.\n\nOn the other hand, Zimbiri pursued a quiet election campaign if any, never convened a single rally and was literally off the medias radar.\n\nThe Chinhoyi Ward 14 post became vacant following the jailing of then-councillor and deputy mayor Chipo Mlotshwa of CCC on fraud charges involving double-dipping in the allocation of land. Her sentence was however commuted to community service.\n\nMeanwhile, in Harares Epworth Ward 6, Zanu PF candidate Civilised Bushe won by a huge margin, amassing 3,022 votes trailed by MDC-Ts Alice Nyahunzvi, who managed 120 votes, while independent candidate Peter Nyapetwa got a measly 23 votes.\n\nZEC presiding officer, Chenjerai Chirere confirmed the results.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/09/09060811/Chinhoyi-council.jpg",
            "description": "<p>By Staff Reporter  THE ruling party, Zanu PF has won the Chinhoyi Ward 14 seat in a by-election which the opposition Citizens Coalition for Change (CCC) boycotted. Of the 2,339 registered voters in the ward, only a third turned out to cast their ballots. A NewZimbabwe.com crew witnessed the low voter attendance at the main</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-grabs-chinhoyi-council-seat-amid-ccc-boycott-voter-apathy/\">Zanu PF grabs Chinhoyi council seat amid CCC boycott, voter apathy </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:20",
            "date": "04 Aug 2025"
        }
    ]
}