{
    "news": [
        {
            "title": "IMF wants Zimbabwe’s gold-backed ZiG to become sole currency",
            "url": "https://www.newzimbabwe.com/imf-wants-zimbabwes-gold-backed-zig-to-become-sole-currency/",
            "content": "Bloomberg\n\nThe International Monetary Fund said it would like to see the ZiG fully becoming a national currency, as it weighs whether to place Zimbabwe on a staff-monitored program.\n\nThe ZiG, short for Zimbabwe Gold, succeeded the Zimbabwean dollar in April 2024 after multiple crashes. Its the countrys sixth attempt since 2009 to replace the dollar as the southern African nations main transacting currency, but is yet to succeed.\n\nSeveral measures will need to be adopted to boost ZiG usage, including deepening the foreign-exchange market to ensure full price discovery, said Wojciech Maliszewski, the Washington-based lenders mission chief, who is in Zimbabwe to review its request for a new SMP. The nations last program ended abruptly in 2019 after the central bank printed money that fueled the collapse of the local currency.\n\nRight now we see good stability in the official market and we also see a convergence between the parallel and official rate, he told reporters Monday after meeting Zimbabwean President Emmerson Mnangagwa in the capital, Harare. Ideally, we would like to see an elimination of this gap, we would like to see one exchange rate.\n\nStill, the ZiGs 43% devaluation in September to narrow the gap between the official and unofficial rate and its inconvertibility has led citizens to favor dollars.\n\nThe ZiG traded little changed on Tuesday at 26.96 against the dollar and exchanged hands at 32 to 35 on the parallel market.\n\nThe Washington-based lender said it isnt pushing for more exchange rate depreciation but for the two rates to converge supported by government fiscal discipline.\n\nThere is a good chance that these rates will converge, Maliszewski said.\n\nFinance Minister Mthuli Ncube last month at the annual meetings of the African Development Bank said he expected the SMP to be finalized by the end of June. The program would bring Zimbabwe closer toward revamping its $21 billion debt pile with creditors that want assurances that its authorities are pursuing prudent fiscal and monetary policies.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171626/zig-6.jpg",
            "description": "<p>Bloomberg The International Monetary Fund said it would like to see the ZiG “fully becoming a national currency,” as it weighs whether to place Zimbabwe on a staff-monitored program. The ZiG, short for Zimbabwe Gold, succeeded the Zimbabwean dollar in April 2024 after multiple crashes. It’s the country’s sixth attempt since 2009 to replace the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/imf-wants-zimbabwes-gold-backed-zig-to-become-sole-currency/\">IMF wants Zimbabwe’s gold-backed ZiG to become sole currency</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:18",
            "date": "11 Jun 2025"
        },
        {
            "title": "University of Zimbabwe docks salaries of striking lecturers",
            "url": "https://www.newzimbabwe.com/university-of-zimbabwe-docks-salaries-of-striking-lecturers/",
            "content": "By Darlington Gatsi\n\nTHE University of Zimbabwe (UZ) has withheld the salaries of striking lecturers as turmoil continues at the institution.\n\nThe lecturers have now reached 58 days of industrial action, demanding a salary increase that aligns with Zimbabwes soaring cost of living.\n\nWhile UZ has remained silent on the strike, it has retaliated by withholding salaries from the defiant lecturers, who are steadfast in their demand for a return to pre-2018 wages of US$2,250 per month for junior staff  up from the current US$230.\n\nObvious Vengeyi, spokesperson for the Association of University Teachers (AUT), condemned the salary deductions as an attempt to force an end to the strike.\n\nOf course, it is an act of trying to force our members to return to work for the US$230 they initially rejected. Its a way of arm-twisting certain members of our community to resume teaching.\n\nMany here who have not been paid have resolved that, whether they receive the US$230 or not, they will not return. The majority of us have not been paid  yes. But we remain committed. Until junior lecturers get US$2,250, we will not go back to class, said Vengeyi.\n\nThe universitys latest move follows its hiring of adjunct lecturers last month to fill gaps left by the striking staff.\n\nHowever, the AUT has dismissed this as futile, claiming most replacements lack the qualifications to teach at a university level.\n\nThere is no teaching happening at the university. No supervision is taking place. A few scabs have been hired to replace sort of  the lecturers on strike, said Vengeyi further.\n\nThe prolonged strike has disrupted examinations, with planned sittings facing further delays, potentially derailing the academic year.\n\nLast month, six students were arrested after staging flash protests demanding the lecturers return, signalling the growing unrest on campus.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/09165523/1000639185-scaled.jpg",
            "description": "<p>By Darlington Gatsi  THE University of Zimbabwe (UZ) has withheld the salaries of striking lecturers as turmoil continues at the institution. The lecturers have now reached 58 days of industrial action, demanding a salary increase that aligns with Zimbabwe’s soaring cost of living. While UZ has remained silent on the strike, it has retaliated by</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/university-of-zimbabwe-docks-salaries-of-striking-lecturers/\">University of Zimbabwe docks salaries of striking lecturers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:18",
            "date": "11 Jun 2025"
        },
        {
            "title": "Fame doesn’t shake me! – Ex-Mommy Club star Nunurai",
            "url": "https://www.newzimbabwe.com/fame-doesnt-shake-me-ex-mommy-club-star-nunurai/",
            "content": "Daily Sun\n\nNUNURAI Mudarikwa left a lasting impression on fans during her stint in The Mommy Club.\n\nThe show, celebrated for its bold and outspoken cast, quickly became a Mzansi favourite.\n\nKnown for speaking her mind, Nunurai quickly gained attention and fame for her candid approach and unfiltered opinions.\n\nWhile some viewers praised her honesty and confidence, others were more critical.\n\nStill, her presence on the show made her one of its most talked-about personalities.\n\nDespite the attention and growing fan base, Nunurai says fame has never gone to her head.\n\nSometimes, fame is overwhelming, but its nothing I cant handle.\n\nI dont consider myself a full-blown celebrity, she told Daily Sun.\n\nThe Zimbabwean-born, South African-based businesswoman insists that the world of fame hasnt changed who she is.\n\nIve always been grounded. I know who I am and what I stand for.\n\nAlthough her time in The Mommy Club put her in the public eye, Nunurai has no plans to continue with TV, for now.\n\nI dont think youll be seeing more of me on TV anytime soon.\n\nNunurai shared what shes been up to since stepping away from the cameras.\n\nIve been focused on my business. Outside of The Mommy Club, Im a full-blown businesswoman.\n\nI literally work 12-hour days  Im all about building and growing my brand, she said.\n\nNunurai stated that she is fully dedicated to her entrepreneurial pursuits.\n\nShe says the hustle keeps her grounded and fulfilled.\n\nI love what I do, and for now, thats where my energy is going.\n\nDespite fame, Nunurai remains focused, driven, and unapologetically on and off the screen.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/10195652/nunurai.jpeg",
            "description": "<p>Daily Sun NUNURAI Mudarikwa left a lasting impression on fans during her stint in The Mommy Club. The show, celebrated for its bold and outspoken cast, quickly became a Mzansi favourite. Known for speaking her mind, Nunurai quickly gained attention and fame for her candid approach and unfiltered opinions. While some viewers praised her honesty</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/fame-doesnt-shake-me-ex-mommy-club-star-nunurai/\">Fame doesn’t shake me! – Ex-Mommy Club star Nunurai</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:18",
            "date": "11 Jun 2025"
        },
        {
            "title": "“We are working under impossible conditions, we cannot continue like this” – nurses plead with govt to prioritise public health sector",
            "url": "https://www.newzimbabwe.com/we-are-working-under-impossible-conditions-and-cannot-continue-like-this-nurses-plead-with-govt-to-prioritise-public-health-sector/",
            "content": "By Thandiwe Garusa\n\nTHE Zimbabwe Nurses Association (ZINA) has made a desperate appeal to the government to urgently address the situation in public hospitals, saying they are working under impossible conditions which are endangering lives.\n\nGovernment has for years continued to neglect public hospitals, which are the largest providers of healthcare services in the country.\n\nPublic hospitals across Zimbabwe lack basic medical supplies, with patients being left topurchase their ownor referred to private hospitals where charges are beyond the reach of many.\n\nIn a statement Tuesday, ZINA president Enock Dongo said the governmenthas failed the health sector.\n\nAs nurses, we are working under impossible conditions. We are forced toimprovise daily just to preserve life. But we cannot continue like this. The systemhas failed, and the suffering is unbearable.\n\nWe call on the government of Zimbabwe to urgently prioritise the health sector.Equip hospitals. Support nurses. Save lives. This situation must be addressedwithout delay, Dongo said.\n\nDongo also said public hospitals do not have blankets for patients in this winter season andsome wards do not have windows.\n\nFacilities are deteriorating fast. There are no blankets in many wards as weapproach winter. Some hospitals do not even have proper windows.\n\nX-ray departments are not functioning. Diagnostic centres are almost non-existent.Basic lab services are unavailable.\n\nNurses are unable to conduct essential tests, and the sick are being referred to private hospitals that they cannot afford. They remain in public wards, in pain, waiting, suffering, Dongo added.\n\nRecently, Health Minister Douglas Mombeshora admitted that Zimbabwes biggest referral public hospital, Parirenyatwa, is in a bad state after a tour following a public outcry.\n\nThe situation at Parirenyatwa is a reflection of all public hospitals in the country.\n\nOver the years, health workers have submitted numerous petitions and staged protests calling for urgent government intervention; however, the authorities have taken little to no action.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/09/22145327/A-patient-on-a-stretcher-bed-being-helped-into-the-hospital-by-relatives-as-one-oth-doctors-looks-on-e1746463851506.jpg",
            "description": "<p>By Thandiwe Garusa THE Zimbabwe Nurses Association (ZINA) has made a desperate appeal to the government to urgently address the situation in public hospitals, saying they are working under “impossible conditions” which are endangering lives. Government has for years continued to neglect public hospitals, which are the largest providers of healthcare services in the country.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/we-are-working-under-impossible-conditions-and-cannot-continue-like-this-nurses-plead-with-govt-to-prioritise-public-health-sector/\">“We are working under impossible conditions, we cannot continue like this” – nurses plead with govt to prioritise public health sector</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:18",
            "date": "11 Jun 2025"
        },
        {
            "title": "ZACC arrests three Rusape town council officials",
            "url": "https://www.newzimbabwe.com/zacc-arrests-three-rusape-town-council-officials/",
            "content": "By Staff Reporter\n\nThe Zimbabwe Anti-Corruption Commission (ZACC) has arrested three officials from Rusape Town Council on allegations of criminal abuse of duty as public officers.\n\nThe three are Togarepi Nerwande, Director of Human Capital & Administration and Acting Town Secretary; Morris Tekwa, Director of Housing, Health and Community Services; and Arnold Mandizvidza Kutoka, former Council Engineer.\n\nThe trio is charged with violating Section 174 of the Criminal Law (Codification and Reform) Act [Chapter 9:23] after unlawfully reviving and processing a rejected application from Texas Energy Pvt Ltd for a solar power plant in Tsanzaguru.\n\nIn 2018, Texas Energy Pvt Ltd proposed developing a solar power plant in Tsanzaguru, Rusape, but the Ministry of Local Government rejected the proposal due to insufficient land and existing residential zoning.\n\nBetween September and December 2022, the accused unlawfully revived and reprocessed the previously rejected application without adhering to required legal procedures.\n\nOn 28 December 2022, Togarepi Nerwande illegally signed a 99-year lease with Texas Energy, misrepresenting the land as open space suitable for development, despite its designation for residential use.\n\nThe accused deliberately bypassed statutory procedures, including public notification and ministerial approval required for land-use changes, reads ZACCs statement.\n\nThe three appeared at the Mutare Magistrate Court on Tuesday for their initial remand.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/09/22055656/arrested-handcuffed-e1667358262642.jpeg",
            "description": "<p>By Staff Reporter The Zimbabwe Anti-Corruption Commission (ZACC) has arrested three officials from Rusape Town Council on allegations of criminal abuse of duty as public officers. The three are Togarepi Nerwande, Director of Human Capital & Administration and Acting Town Secretary; Morris Tekwa, Director of Housing, Health and Community Services; and Arnold Mandizvidza Kutoka, former</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zacc-arrests-three-rusape-town-council-officials/\">ZACC arrests three Rusape town council officials</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:18",
            "date": "11 Jun 2025"
        },
        {
            "title": "Tensions rise as memorial for former Zambian president Lungu takes place in South Africa amid ongoing dispute with government",
            "url": "https://www.newzimbabwe.com/tensions-rise-as-memorial-for-former-zambian-president-lungu-takes-place-in-south-africa-amid-ongoing-dispute-with-government/",
            "content": "The Star\n\nA memorial service for Zambias former President Edgar Chagwa Lungu is being held Tuesday at the Cathedral in Pretoria, South Africa, under a cloud of political tension and unresolved conflict between his family and the Zambian government.\n\nMourners, including members of the Patriotic Front (PF), Lungus former ruling party, filled the cathedral as emotional tributes were paid to the late statesman.\n\nHowever, the atmosphere was not one of peace.\n\nInstead, it reflected the deepening rift over Lungus legacy, his cause of death, and the governments controversial handling of his passing.\n\nThe 68-year-old former president died last Thursday in a South African hospital, where he had been undergoing treatment for an undisclosed illness.\n\nSince his death, speculation and accusations have surfaced, with some PF leaders claiming Lungu may have been poisoned  a charge the Zambian government has not addressed publicly.\n\nAccording to hospital sources, government officials allegedly tried to repatriate Lungus body to Zambia without the familys consent.\n\nMedical staff say they were intimidated and threatened, prompting outrage from PF leaders and human rights groups alike.\n\nSpeaking at a media roundtable in Sandton, Johannesburg, PF Secretary General Mangani Nakacinda condemned the governments actions, calling them a calculated political manoeuvre to seize control of the narrative. Nakacinda added,\n\nThis is no longer just about mourning a former president  it is about defending his dignity and our democracy.\n\nOne of the most contentious issues is the Zambian governments reported insistence on taking full control of Lungus funeral arrangements.\n\nThe Lungu family, backed by PF allies, has resisted this, citing concerns about trust and transparency. So far, the standoff has stalled any official state funeral plans.\n\nAdding to the pain and confusion, two of Lungus children were allegedly denied permission to leave Zambia to attend their fathers memorial in South Africa. Family representatives say the travel ban is another example of the administrations deliberate cruelty.\n\nInside Zambia, the situation is increasingly volatile. PF members have vowed to fight until the end to expose what they claim is a campaign to erase Lungus political legacy and prevent scrutiny into the events leading to his death.\n\nMeanwhile, the government appears determined to maintain authority over the funeral process, citing protocol and national interest.\n\nThe late presidents political comeback in 2023 had reignited tensions in the country. After years of relative silence, Lungu announced his intention to run in the 2026 elections, challenging the ruling United Party for National Development (UPND) and its leader, President Hakainde Hichilema.\n\nIn response, the Constitutional Court ruled him ineligible, sparking legal and political protests.Shortly after, Lungu was stripped of all state benefits, including security and medical support, further isolating him.\n\nPF leaders claim these actions left him vulnerable, even hindering access to vital medical treatment in the months before his death.\n\nAs his body remains in South Africa and legal negotiations continue behind the scenes, todays memorial has become more than a moment of remembrance  it is a flashpoint in a deepening national crisis.\n\nThe treatment of former President Lungu is a reflection of the state of our democracy, said Brian Mundubile, a senior PF figure.\n\nThis is about justice, truth, and respect  not just for him, but for all Zambians.With the cause of Lungus death still unconfirmed and calls for an independent investigation growing louder, todays service may not be the end of mourning but the beginning of a prolonged battle for answers.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/01/01182032/Edgar-Lungu.jpg",
            "description": "<p>The Star A memorial service for Zambia’s former President Edgar Chagwa Lungu is being held Tuesday at the Cathedral in Pretoria, South Africa, under a cloud of political tension and unresolved conflict between his family and the Zambian government. Mourners, including members of the Patriotic Front (PF), Lungu’s former ruling party, filled the cathedral as</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tensions-rise-as-memorial-for-former-zambian-president-lungu-takes-place-in-south-africa-amid-ongoing-dispute-with-government/\">Tensions rise as memorial for former Zambian president Lungu takes place in South Africa amid ongoing dispute with government</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:18",
            "date": "11 Jun 2025"
        }
    ]
}