{
    "news": [
        {
            "title": "US wants to join G20 summit, end boycott: South Africa",
            "url": "https://www.newzimbabwe.com/us-wants-to-join-g20-summit-end-boycott-south-africa/",
            "content": "AFP\n\nWashington had said it would not take part in the 22-23 November summit because it objected to the priorities for the meeting set by South Africa, which holds the G20s rotating presidency this year.\n\nWe have received notice from the United States, a notice which we are still in discussions with them over, about a change of mind about participating in one shape, form or other in the summit, Ramaphosa told reporters.\n\nThis comes at the late hour before the summit begins. And so therefore, we do need to engage in those types of discussions to see how practical it is and what it finally really means, he said.\n\nAll countries are here, and the United States, the biggest economy in the world, needs to be here, he said.\n\nSo its pleasing to hear that there is a change of approach, and so we are still discussing how that will manifest.\n\nUS President Donald Trump has singled out South Africa for harsh treatment on a number of issues since he returned to the White House in January, notably making debunked claims of white Afrikaners being systematically killed and slaughtered in the country.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/20172724/ramaphosa.jpg",
            "description": "<p>AFP The United States has had a “change of mind” about boycotting the G20 summit in Johannesburg this weekend and wanted to take part in some form, South African President Cyril Ramaphosa said Thursday. Washington had said it would not take part in the 22-23 November summit because it objected to the priorities for the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-wants-to-join-g20-summit-end-boycott-south-africa/\">US wants to join G20 summit, end boycott: South Africa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:32",
            "date": "20 Nov 2025"
        },
        {
            "title": "Kenyan authorities paid trolls to threaten Gen Z protesters, Amnesty says",
            "url": "https://www.newzimbabwe.com/kenyan-authorities-paid-trolls-to-threaten-gen-z-protesters-amnesty-says/",
            "content": "BBC\n\nThe Kenyan authorities paid a network of trolls to threaten and intimidate young protesters during recent anti-government demonstrations, Amnesty International has said.\n\nA new report by the human rights organisation said government agencies also employed surveillance and disinformation to target organisers of the mass protests, which swept Kenya across 2024 and 2025.\n\nThe demonstrations were driven largely by Gen Z activists who used social media platforms to mobilise.\n\nIn response to Amnestys report, Kenyas interior minister said the government does not sanction harassment or violence against any citizen.\n\nBut Amnesty said it had uncovered a campaign to silence and suppress the protesters.\n\nYoung women and LGBT+ activists were disproportionately targeted, with misogynistic and homophobic comment, as well as AI-generated pornographic images, the report said.\n\nThe BBC has approached the government for further comment.\n\nOne activist told Amnesty: I had people coming into my inbox and telling me: You will die and leave your kids. We will come and attack you.\n\nI even had to change my childs school. Someone sent me my childs name, the age the school bus number plate. They told me: If you continue doing what youre doing then we will take care of this child for you.\n\nIt has long been believed that the government employs a network of individuals, known as keyboard warriors, to push its online messages.\n\nThe report features a man who said he was part of a team paid between 25,000 and 50,000 Kenyan shillings (about $190-$390; 145-300) per day to amplify government messaging and drown out trending protest hashtags on social media platform X.\n\nAs part of its research, Amnesty spoke to 31 young human rights defenders who had participated in the protests. Nine of these activists said they had received violent threats via X, TikTok, Facebook and WhatsApp.\n\nAs well as digital abuse, the authorities have also been accused of carrying out a brutal crackdown on the protests.\n\nMore than 100 people died, rights groups say, when police clashed with protesters during two waves of demonstrations  one in 2024 and one in 2025.\n\nThe authorities were also accused of arbitrary arrests, enforced disappearances and using lethal force against the protesters.\n\nThe government accepted there had been some case of excessive force by police, butalso defended the security forces in other instances.\n\nThe demonstrations railed against issues such as proposed tax rises, increasing femicide and corruption.\n\nAmnesty chief Agns Callamard said the organisations report clearly demonstrates widespread and coordinated tactics on digital platforms to silence and suppress protests by young activists.\n\nOur research also proves that these campaigns are driven by state-sponsored trolls, individuals and networks paid to promote pro-government messages and dominate Kenyas daily trends on X, she added.\n\nKenyas Interior Minister Kipchumba Murkomen said: The government of Kenya does not sanction harassment, or violence against any citizen any officer implicated in unlawful conduct bears individual responsibility and is subject to investigation and sanction.\n\nAmnesty also raised concerns about unlawful state surveillance, including allegations  denied by Kenyas largest telecom provider, Safaricom  that authorities used mobile data to monitor protest leaders.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/29173036/kenya-protests.webp",
            "description": "<p>BBC The Kenyan authorities paid a network of trolls to threaten and intimidate young protesters during recent anti-government demonstrations, Amnesty International has said. A new report by the human rights organisation said government agencies also employed surveillance and disinformation to target organisers of the mass protests, which swept Kenya across 2024 and 2025. The demonstrations</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kenyan-authorities-paid-trolls-to-threaten-gen-z-protesters-amnesty-says/\">Kenyan authorities paid trolls to threaten Gen Z protesters, Amnesty says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:32",
            "date": "20 Nov 2025"
        },
        {
            "title": "Just In: Trucks pile up on Harare-Masvingo highway, block flow of traffic",
            "url": "https://www.newzimbabwe.com/just-in-trucks-pile-up-on-harare-masvingo-highway-block-flow-of-traffic/",
            "content": "By Leopold Munhende\n\nTHREE trucks have piled up on the Harare to Masvingo highway, 12km towards Featherstone, towards Chivhu.\n\nNo official statement has been shared yet about the accident which occurred right on the bridge that crosses Ngezi River, a few metres from Chiwashira School turnoff.\n\nDrivers are being instructed to use an old road just nearby as the highway is completely blocked.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/20131649/IMG-20251120-WA0044.jpg",
            "description": "<p>By Leopold Munhende THREE trucks have piled up on the Harare to Masvingo highway, 12km towards Featherstone, towards Chivhu. No official statement has been shared yet about the accident which occurred right on the bridge that crosses Ngezi River, a few metres from Chiwashira School turnoff. Drivers are being instructed to use an old road</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/just-in-trucks-pile-up-on-harare-masvingo-highway-block-flow-of-traffic/\">Just In: Trucks pile up on Harare-Masvingo highway, block flow of traffic</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:32",
            "date": "20 Nov 2025"
        },
        {
            "title": "Three convenient ways to log into 1win Ghana",
            "url": "https://www.newzimbabwe.com/three-convenient-ways-to-log-into-1win-ghana/",
            "content": "Getting started with 1win Ghana is designed to be simple and accessible for every user. The platform offers different entry points so that newcomers and experienced players alike can join quickly without unnecessary complications. This flexibility makes the first steps comfortable, no matter where you are connecting from.\n\nWhen visiting theOfficial site of 1win Ghana, users immediately notice that there is more than one way to access their personal account. Each method is adapted for a modern audience, focusing on speed, safety, and convenience. Such diversity allows players to choose the option that feels most natural for them.\n\nOne of the key advantages of this approach is the elimination of barriers for new members. Whether someone prefers classic registration, fast login through social networks, or authorization via mobile number, the system ensures a smooth experience. The process is designed with user-friendliness at its core.\n\nIn the end, 1win Ghana emphasizes accessibility and choice. By providing three distinct login methods, the platform demonstrates its commitment to user comfort and adaptability. Its not just about logging in  its about making sure every customer feels at ease right from the very beginning of their journey.\n\nBefore diving into the entertainment and opportunities available on the platform, every player must go through a simple authorization process. This step is not just a formality  it lays the foundation for a safe and personalized gaming experience. Without logging in, users are limited in what they can access and miss out on the core benefits of being part of the community.\n\nAuthorization is also a guarantee of trust between the platform and its players. By confirming your identity, the system ensures that your personal data, financial transactions, and gaming preferences are protected. This is the moment when a casual visitor turns into a recognized member of 1win Ghana, gaining access to everything the service has to offer.\n\nThese reasons highlight how essential authorization is for a seamless journey on 1win Ghana. It transforms the site from a simple interface into a personalized environment tailored to the players needs. Without this step, the experience would remain incomplete.\n\nUltimately, authorization is about more than just logging in  it is the gateway to a safe, rewarding, and fully functional platform. By signing in, users are assured that their time and resources are protected, while at the same time opening the door to exciting opportunities that are exclusive to active members.\n\nThe platform offers flexibility when it comes to authorization, giving players several convenient methods to enter their personal accounts. Each option is tailored to suit different user preferences, ensuring that everyone can choose the path that feels most comfortable. Whether you value simplicity, security, or speed, there is a suitable way to log in without unnecessary complications.\n\nFor newcomers, these alternatives remove possible barriers and make the first steps much smoother. Returning users, on the other hand, can select the method they find most efficient, whether it is tied to their mobile device, a familiar social account, or the traditional combination of email and password. Below is a clear breakdown of the available login methods on 1win Ghana.\n\nEach of these methods has its own advantages. The phone number option is particularly useful for those who rely on mobile devices daily, making it a straightforward choice. Logging in via social networks adds speed and removes the hassle of remembering additional passwords, though availability depends on local access to these platforms.\n\nMeanwhile, the email and password option remains the most universal and secure approach. It appeals to players who value control and are accustomed to traditional login systems. By offering all three options side by side, 1win Ghana ensures that every type of user can find the right balance between convenience and security.\n\nA reliable login system is one of the cornerstones of any online platform, and 1win Ghana takes this aspect seriously. By providing clear, straightforward authorization methods, the site removes unnecessary complications that might discourage new users. This simplicity encourages players to focus on what truly matters  enjoying the wide range of games, bets, and opportunities available after signing in.\n\nMoreover, a seamless login process reflects the platforms overall commitment to user comfort. Each authorization method is not only functional but also designed with convenience in mind. This ensures that every player, regardless of their experience level, can start their journey on 1win Ghana without obstacles, setting a positive tone for everything that follows.\n\nAuthorization on 1win Ghana is more than just a formality  it is the essential step that opens the door to a complete user experience. Without logging in, the platform remains only a showcase, but once you sign in, it transforms into a personalized space filled with opportunities. This first move is what truly defines the beginning of a players journey.\n\nThe three login methods  by phone number, through social networks, and via email with password  are designed to accommodate different preferences. Each carries its own strengths, from simplicity to security, ensuring that no user feels excluded. By offering such versatility, the platform demonstrates its commitment to convenience and accessibility.\n\nLooking at the reasons to authorize, it becomes clear that the process provides not only practical benefits but also an extra layer of protection. Secure access, eligibility for bonuses, and full functionality are all tied to this step. That makes authorization the central element around which the entire 1win Ghana experience is built.\n\nIn conclusion, logging in is not just about gaining entry  it is about establishing trust, enjoying rewards, and unlocking the full scale of entertainment the site has to offer. By giving players multiple ways to authorize, 1win Ghana ensures that every journey begins smoothly and continues without barriers.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/20073842/1win.jpg",
            "description": "<p>Getting started with 1win Ghana is designed to be simple and accessible for every user. The platform offers different entry points so that newcomers and experienced players alike can join quickly without unnecessary complications. This flexibility makes the first steps comfortable, no matter where you are connecting from. When visiting the Official site of 1win</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/three-convenient-ways-to-log-into-1win-ghana/\">Three convenient ways to log into 1win Ghana</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:32",
            "date": "20 Nov 2025"
        },
        {
            "title": "NMBZ draws down Afreximbank’s US$50 million loan facility",
            "url": "https://www.newzimbabwe.com/nmbz-draws-down-afreximbanks-us50-million-loan-facility/",
            "content": "By Alois Vinga\n\nNMBZ Bank has begun drawing down Afreximbanks US$50 million loan facility, with the mining and construction sectors emerging as the biggest beneficiaries after absorbing 50% of the funds.\n\nPresenting a trading update for the third quarter ended September 30, 2025, NMBZ company secretary Violet Mutandwa said the facility has significantly supported key economic sectors through improved access to offshore credit lines.\n\nNMBZ company secretary Violet Mutandwa\n\nDuring the quarter under review, the bank started drawing down on the US$50 million Afreximbank line with over US$25 million already disbursed to the mining and construction sectors. The Bank finalised a US$15 million Agrobond which was privately placed with a European Fund and will go towards supporting the agriculture sector, she said.\n\nDuring the period under review, the Group generated operating income of ZWG1.3 billion for the nine months to September 30, 2025.\n\nIn terms of the Groups core business, net interest income rose by 63% compared to the same period in 2024, driven by increased loans and advances to productive sectors and support for consumer needs. Core income streams remain resilient, supported by strong growth in loans and deposits, while management continues to prioritise revenue diversification and cost optimisation.\n\nThe Group incurred operating expenditure of ZWG1.1 billion, a 70% increase from the prior year. This variance primarily reflects the impact of strategic business reengineering initiatives undertaken during the year, including restructuring and staff rationalisation to align operations with the Groups strategic vision.\n\nTotal assets increased to ZWG9.2 billion, up 27% from ZWG7.3 billion recorded on December 31, 2024. The growth was anchored by an expansion in loans and advances, which stood at ZWG4.2 billion at the end of the quarter.\n\nThe domestic economy is projected to grow by 6.6% in 2025 in line with earlier projections in light of the sustained macroeconomic stability, record-high gold prices, growing remittances and a 12.8% rebound in agriculture following the 2024 El Nino.\n\nIn light of the above, the Group will continue to focus on supporting key sectors of the economy through its core business, Mutandwa added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/07/03034559/NMB-Bank.png",
            "description": "<p>By Alois Vinga NMBZ Bank has begun drawing down Afreximbank’s US$50 million loan facility, with the mining and construction sectors emerging as the biggest beneficiaries after absorbing 50% of the funds. Presenting a trading update for the third quarter ended September 30, 2025, NMBZ company secretary Violet Mutandwa said the facility has significantly supported key</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nmbz-draws-down-afreximbanks-us50-million-loan-facility/\">NMBZ draws down Afreximbank’s US$50 million loan facility</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:32",
            "date": "20 Nov 2025"
        },
        {
            "title": "South Africa to lead global PGM supply rebound next year after dragged output",
            "url": "https://www.newzimbabwe.com/south-africa-to-lead-global-pgm-supply-rebound-next-year-after-dragged-output/",
            "content": "IOL\n\nLower production from platinum group metals mines in South Africa muzzled global PGM supply in the third quarter although gains from the worlds biggest producers of the metal, including Zimbabwe, where Valterra, Impala Platinum and Sibanye-Stillwater operate, are expected to lift up supply by 2% next year.\n\nThe World Platinum Investment Council said on Wednesday that global PGM supplywas flatin the third quarter year on year weighed on by lower South African mineproduction.\n\nThis was after refined volumes fromValterra(formerly Anglo American Platinum) fell inSouth Africa.\n\nThis was reflective of a significant destocking of semi-finished inventory in Q324.\n\nImplats own refined production was, however, little changed year-on-year, although scheduled processing maintenance led to a further build in already elevated work-in-progress stocks.\n\nSouth African production contracted 2% year-on-year to 1 028 koz, said WIPC in a quarterly report.\n\nNonetheless, following the unusually high rainfall and flooding that disrupted South African mining operations earlier this year, as well as theprocessing constraints that curtailed refined volumes,PGMsupply is expected to recover over the latter half of the year.\n\nThe completionof maintenance at Implats South African smelters should allow some destocking of excess inventory that had been deferredearlier in the year, partly due to disruptions to water, power and hydrogen supply to the refineries, further noted WIPC.\n\nAlthough South African mine production is forecast to contract 5% to 3,945 koz, mine supply for PGM from the country is projected to rise by 2% year-on-year in 2026, with gains from South Africa and Zimbabwe partially offset by a modest decline from North America and Russia.\n\nOutput from major South African producers is expected to rise, with improved processing availability anticipated to support a modestincrease in output from Implats, aided by the drawdown of excess semi-finished inventory.\n\nInvestor sentiment in South African platinum miners and future pricing prospects has brightened with the commoditys recent good run in prices providing favourable momentum among fund managers.\n\nLong dogged by suppressed investor sentiment due to low prices and uncertainty that demand could be subdued due to popularity and uptake of electric vehicles, platinum group metals have been on a rebound in the past few weeks.\n\nThis is despite the World Platinum Investment Council saying earlier this year that full-year output will still be 6% lower than last year, since South African producers will not benefit from the large drawdown of work-in-process inventory that occurred last year.\n\nBesides the inclination towards platinum, the South African fund managers have exhibited lowpositioninginhealthcare,offshore,telecomandcash. Thebiggest fallswere recorded forheavyindustrialsand cash, according to Bank of America analysts.\n\nZimbabweanPGMproduction slipped 10% to 119 koz, largely reflecting significant destocking of semi-processed material at Unki, owned by Valterra.\n\nOutput from Zimplats,Zimbabweslargest producer, edged lower owing to furnace repairs.\n\nThus, PGM supply from Zimbabwe is expected to contract by 4% year-on-year to 493 koz, retreating from the record level achieved in 2024.\n\nThe decline primarily reflects the absence of a drawdown of semi-finished stock that boosted last years volumes, said WIPC.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/20044527/gold-platinum.jpg",
            "description": "<p>IOL Lower production from platinum group metals mines in South Africa muzzled global PGM supply in the third quarter although gains from the world’s biggest producers of the metal, including Zimbabwe, where Valterra, Impala Platinum and Sibanye-Stillwater operate, are expected to lift up supply by 2% next year. The World Platinum Investment Council said on</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africa-to-lead-global-pgm-supply-rebound-next-year-after-dragged-output/\">South Africa to lead global PGM supply rebound next year after dragged output</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:32",
            "date": "20 Nov 2025"
        }
    ]
}