{
    "news": [
        {
            "title": "Mzembi remanded in custody to July 1; magistrate says former minister was not as sick as he wants court to believe",
            "url": "https://www.newzimbabwe.com/mzembi-remanded-in-custody-to-july-1-magistrate-says-former-minister-was-not-as-sick-as-he-wants-court-to-believe/",
            "content": "By Staff Reporter\n\nFormer Foreign Affairs Minister, Walter Mzembi, will languish in jail after Harare magistrate Donald Ndirowei revoked his bail on the grounds that he willfully skipped court for the past seven years.\n\nThe magistrate dismissed his application seeking cancellation of his three arrest warrants and remanded him in custody until July 1.\n\nNdirowei, in his ruling, said Mzembi failed to give a convincing explanation why he defaulted court.\n\nThere is a gap as to what transpired in his medical report since the attached medical reports should have worked if he availed himself in 2019, not 2025, the magistrate noted.\n\nNdirowei noted that after his discharge in 2024 in Zambia, Mzembi never made an effort to come and cancel his warrants.\n\nHe was not sick to the extent that he wants the court to believe; however, he was Saviour Kasukuweres campaigner for the 2023 elections, and he was active on his social media.\n\nThe accuseds submissions fall far short and the warrants of arrests are hereby confirmed, bail revoked, he is hereby committed to prison pending trial, he ruled.\n\nMzembi had said he was not in wilful default.\n\nHe told the court that he had been in and out of the hospital over the years, and he was out of the country, adding that he had undergone many operations to correct his ailment.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/05/10034227/Walter-Mzembi.jpg",
            "description": "<p>By Staff Reporter Former Foreign Affairs Minister, Walter Mzembi, will languish in jail after Harare magistrate Donald Ndirowei revoked his bail on the grounds that he willfully skipped court for the past seven years. The magistrate dismissed his application seeking cancellation of his three arrest warrants and remanded him in custody until July 1. Ndirowei,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mzembi-remanded-in-custody-to-july-1-magistrate-says-former-minister-was-not-as-sick-as-he-wants-court-to-believe/\">Mzembi remanded in custody to July 1; magistrate says former minister was not as sick as he wants court to believe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "17 Jun 2025"
        },
        {
            "title": "Explosion at fireworks factory in central China kills nine and injures 26",
            "url": "https://www.newzimbabwe.com/explosion-at-fireworks-factory-in-central-china-kills-nine-and-injures-26/",
            "content": "AFP\n\nAn explosion at a fireworks factory in central China killed nine people. It injured 26 others, state media said on Tuesday, as challenging on-site rescue work continued a day after the incident.\n\nThe blast occurred shortly before 8:30 am Monday at a factory in a village outside Changde, a city in Hunan province, state-run China National Radio (CNR) said.\n\nAs of 9:00 am on Tuesday, nine people were dead and 26 injured, CNR said, citing a rescue command centre.\n\nRescue work at the scene was ongoing, CNR reported, noting a complicated situation and the risk of additional explosions hampering response efforts.\n\nAdding to the challenge, the site was in a mountainous area with no large water source, it added.\n\nDuring more than 20 hours of uninterrupted and continuous rescue, the rescue team used remote-controlled water cannons to extinguish the fire, the report said.\n\nState news agency Xinhua also said Tuesday that the Ministry of Emergency Management had sent a working team to Hunan to oversee the rescue.\n\nEfforts must be made to ascertain the cause of the explosion as soon as possible and to hold those responsible accountable, the ministry said, according to Xinhua.\n\nIndustrial accidents are fairly common in China due to vague regulations and lax safety standards.\n\nLast month, an explosion at a chemical plant in the eastern province of Shandong killed at least five people.\n\nIn 2015, blasts at warehouses containing flammable chemicals in the port city of Tianjin killed more than 170 people and injured 700 others.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/17092806/Screenshot-2025-06-17-at-10.27.17.png",
            "description": "<p>AFP An explosion at a fireworks factory in central China killed nine people. It injured 26 others, state media said on Tuesday, as challenging on-site rescue work continued a day after the incident. The blast occurred shortly before 8:30 am Monday at a factory in a village outside Changde, a city in Hunan province, state-run</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/explosion-at-fireworks-factory-in-central-china-kills-nine-and-injures-26/\">Explosion at fireworks factory in central China kills nine and injures 26</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "17 Jun 2025"
        },
        {
            "title": "Overloaded Honda Fit, Ford Ranger collision kills four on Karoi-Binga road",
            "url": "https://www.newzimbabwe.com/overloaded-honda-fit-ford-ranger-collision-kills-four-on-karoi-binga-road/",
            "content": "By Costa Nkomo\n\nA road accident on the Karoi-Binga Road has claimed the lives of four members of the same family after a Honda Fit, overloaded with twelve passengers, collided head-on with a Ford Ranger carrying seven people.\n\nThe accident occurred on Sunday at the 25-kilometre peg of the road.\n\nNational Police spokesperson Commissioner Paul Nyathi confirmed the details, stating that the deceased belonged to the Matonde family and resided at Dixie Farm in Magunje.\n\nThe Zimbabwe Republic Police (ZRP) confirms a fatal road traffic accident which occurred on the 15th June 2025 at 1830 hours at the 25-kilometre peg along Karoi-Binga Road, where a Ford Ranger vehicle with seven passengers on board collided head-on with a Honda Fit vehicle carrying 12 passengers. As a result, four people died on the spot, while 15 others were seriously injured, Nyathi said in a statement released on Monday.\n\nNyathi confirmed that the bodies of the deceased and the injured had been transported to Karoi District Hospital.\n\nThe bodies of the victims were taken to Karoi District Hospital mortuary for post-mortem examination and the injured were referred to the same hospital for treatment, he stated.\n\nIn a plea for road safety, Nyathi urged motorists to exercise caution and avoid overloading vehicles.\n\nThe Zimbabwe Republic Police implores motorists to exercise caution on the roads and avoid overloading vehicles to safeguard human lives, he said.\n\nThe accident has sparked outrage on social media, with many questioning how a Honda Fit, designed to carry a maximum of five people, could have been allowed to transport more than double its capacity.\n\nMuch of the anger has been directed at the police, with accusations of corruption and negligence levelled against law enforcement agencies.\n\nThe police are to blame here. That Honda Fit probably went through at least two or three roadblocks and because the police only focus on taking bribes they let such recklessness go unpunished. Secondly, most of the Honda Fits that pirate these routes belong to very same officers, wrote X user Davison Feliate.\n\nAnother X user, identified as Leeman, shared the same sentiment, condemning the police for their alleged failure to enforce traffic laws.\n\nPolice have no law enforcement officers. How can a Honda Fit carry 12 people? Leeman queried.\n\nThe tragic incident is a reminder of the concerns about road safety and the enforcement of traffic regulations in Zimbabwe, with overloading and unroadworthy vehicles continuing to make the headlines for bad reasons.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/31184346/Accident4.jpg",
            "description": "<p>By Costa Nkomo A road accident on the Karoi-Binga Road has claimed the lives of four members of the same family after a Honda Fit, overloaded with twelve passengers, collided head-on with a Ford Ranger carrying seven people. The accident occurred on Sunday at the 25-kilometre peg of the road. National Police spokesperson Commissioner Paul</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/overloaded-honda-fit-ford-ranger-collision-kills-four-on-karoi-binga-road/\">Overloaded Honda Fit, Ford Ranger collision kills four on Karoi-Binga road</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "17 Jun 2025"
        },
        {
            "title": "Mnangagwa visits Parirenyatwa, Sally Mugabe hospitals to “gain clearer understanding” of collapsing public health sector",
            "url": "https://www.newzimbabwe.com/mnangagwa-visits-parirenyatwa-sally-mugabe-hospitals-to-gain-clearer-understanding-of-collapsing-public-health-sector/",
            "content": "By Thandiwe Garusa\n\nPRESIDENT Emmerson Mnangagwa has said his visits to Parirenyatwa and Sally Mugabe hospitals on Monday are meant to provide him with a clearer understanding of Zimbabwes deteriorating public health sector.\n\nThese visits follow a public outcry over the collapsing state of public hospitals.\n\nMnangagwa also toured the NatPharm warehouse.\n\nLast month, Youth Empowerment Minister Tinoda Machakaire took to social media, lamenting the deteriorating conditions in public hospitals and challenged Mnangagwa to go witness the crisis firsthand.\n\nI visited Parirenyatwa and Sally Mugabe Hospitals, as well as the NatPharm warehouse, to gain a clearer understanding of the current state of our public health services. Strengthening healthcare delivery remains a central focus of the Second Republic, the President wrote on his X account.\n\nMnangagwas government has been accused of neglecting Zimbabwes public hospitals, which have dilapidated infrastructure and an inadequate supply of medicines.\n\nHealthcare workers remain poorly paid, which has led to low staff morale and a significant brain drain with skilled personnel leaving the country for greener pastures.\n\nOver the years, health workers have submitted numerous petitions and held protests calling for urgent government intervention.\n\nHowever, the authorities have taken little to no action, leaving hospitals in such a dire state that they are now described as death traps.\n\nLast week, the Zimbabwe Nurses Association made a desperate plea to the government to urgently address the crisis in hospitals, highlighting that lives are being lost as a result.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/17060121/ed-hospital-scaled.jpeg",
            "description": "<p>By Thandiwe Garusa PRESIDENT Emmerson Mnangagwa has said his visits to Parirenyatwa and Sally Mugabe hospitals on Monday are meant to provide him with a clearer understanding of Zimbabwe’s deteriorating public health sector. These visits follow a public outcry over the collapsing state of public hospitals. Mnangagwa also toured the NatPharm warehouse. Last month, Youth</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-visits-parirenyatwa-sally-mugabe-hospitals-to-gain-clearer-understanding-of-collapsing-public-health-sector/\">Mnangagwa visits Parirenyatwa, Sally Mugabe hospitals to “gain clearer understanding” of collapsing public health sector</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "17 Jun 2025"
        },
        {
            "title": "Harare Mayor Mafume fears temporary ban on Rufaro Stadium as facility deteriorates",
            "url": "https://www.newzimbabwe.com/harare-mayor-mafume-fears-temporary-ban-on-rufaro-stadium-as-facility-deteriorates/",
            "content": "By Darlington Gatsi\n\nRUFARO STADIUM could be on the brink of condemnation as the iconic venue continuesto show visible signs of deterioration just one year after reopening to host top-flight matches.\n\nThe imposing Mbare facility is struggling to withstand the demands of hosting elite fixtures, with the pitch visibly damaged, posing a danger to players.\n\nRufaro Stadium is home to Dynamos, CAPS United, Herentals, and Scottland FC. The ground is also used by Division One clubs, further straining its capacity.\n\nWith midweek Castle Lager Premier Soccer League matches scheduled, Rufaro would have hosted six encounters in 11 days, excluding Northern Region Division One games.\n\nSpeaking at a recent council meeting at Town House, Harare Mayor Jacob Mafume expressed concerns that the stadium could be barred from hosting top-tier matches.\n\nTwo weeks is too long. The renovations must be done because the stadium is about to be condemned again, Mafume told councillors.\n\nShould Rufaro be condemned, Premier Soccer League (PSL) teams in Harare could be left in limbo unless the City Council acts swiftly to upgrade the facility.\n\nEarlier this year, the council announced a partnership with Scottland FC, owned by Mabvuku Member of Parliament Pedzai Scott Sakupwanya, to renovate the stadium.\n\nHowever, no notable improvements have been made since, dashing Mafumes hopes of the venue hosting international matches.\n\nThe installation of bucket seats, which Mafume had promised would be completed by mid-year, remains far behind schedule.\n\nInstallation of electronic turnstiles is yet to be completed. Rufaro stadium is still using an archaic scoreboard, another task on the hands of Mafume-led Council.\n\nRufaro Stadium reflects the broader decline of sports facilities under the Harare City Council (HCC), many of which are in deplorable condition.\n\nMafume told councillors he was tired of apologising for the state of council-owned facilities.\n\nThe state of City Sportslet us look at them. Every time, I have to apologise when I arrive at any council facility. It is not nice. The place does not look good, but there are simple things we should fix, said Mafume.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/05120417/rufaro-1.jpg",
            "description": "<p>By Darlington Gatsi RUFARO STADIUM could be on the brink of condemnation as the iconic venue continues to show visible signs of deterioration just one year after reopening to host top-flight matches. The imposing Mbare facility is struggling to withstand the demands of hosting elite fixtures, with the pitch visibly damaged, posing a danger to players.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-mayor-mafume-fears-temporary-ban-on-rufaro-stadium-as-facility-deteriorates/\">Harare Mayor Mafume fears temporary ban on Rufaro Stadium as facility deteriorates </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "17 Jun 2025"
        },
        {
            "title": "CCTV footage gives away US$300 ATM thief",
            "url": "https://www.newzimbabwe.com/cctv-footage-gives-away-us300-atm-thief/",
            "content": "By Staff Reporter\n\nA VICTORIA Falls man has been convicted and jailed for stealing US$300 from a faulty automated teller machine (ATM) at a ZB Bank in Hwange.\n\nKaleb Murahwa (48) was slapped with a 12-month imprisonment, of which three months were suspended on condition he restitutes US$300 to the complainant by July 11, 2025. He will, therefore, effectively serve nine months behind bars.\n\nThe prosecutor proved that on May 24, 2024, the complainant, a 29-year-old teacher at a school in Binga, attempted to withdraw US$300 from an ATM. After inserting her card and completing the transaction, the machine failed to dispense the cash.\n\nAs a result of the malfunctioning ATM, the complainant went inside the bank to enquire. While doing that, the ATM dispensed cash, and the offender seized the opportunity and took the lucky money.\n\nThe court further heard that bank staff, unaware of the incident, helped serve the client and facilitated the withdrawal of US$300 manually.\n\nOn July 2 last year, the bank, during routine reconciliations, discovered that the complainant had double benefited and debited the US$300 from her account.\n\nIt was heard that during investigations, closed-circuit television (CCTV) footage from the day of the withdrawals revealed the offender walking away from the ATM with the lucky cash after the complainant had gone inside the premises.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/17083347/zb-atm.jpg",
            "description": "<p>By Staff Reporter A VICTORIA Falls man has been convicted and jailed for stealing US$300 from a faulty automated teller machine (ATM) at a ZB Bank in Hwange. Kaleb Murahwa (48) was slapped with a 12-month imprisonment, of which three months were suspended on condition he restitutes US$300 to the complainant by July 11, 2025.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cctv-footage-gives-away-us300-atm-thief/\">CCTV footage gives away US$300 ATM thief </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "17 Jun 2025"
        },
        {
            "title": "How Zimbabwe’s Health System Profits From the Dead",
            "url": "https://www.newzimbabwe.com/how-zimbabwes-health-system-profits-from-the-dead/",
            "content": "By Linda Mujuru, GPJ Zimbabwe\n\nThis story was originally published byGlobal Press Journal.\n\nHARARE, ZIMBABWE  Blessing Mucharambeis uncle was just having lunch when he stood up, then collapsed. [He] started bleeding from the nose, she says, and died on the spot.\n\nAs far as his family knew, he had no health problems. As they struggled to make sense of the news, Chitungwiza Hospital  where his body had been taken to a mortuary  told them that a forensic postmortem would be required.\n\nZimbabwean law mandates postmortems for sudden or unexplained deaths, and public hospitals offer them for free. But there are only five qualified pathologists in Zimbabwe serving a population of close to 17 million people. The wait could stretch for days. And each day the funeral was delayed would add to the cost of hosting mourners, as some traditions require.\n\nA police officer stationed at the hospital offered them a workaround. Instead of a forensic postmortem, they could do a general one  an option when no foul play is suspected, and quicker since it doesnt require a specialist. But even that, he warned, could take days. He offered to fast-track the process for a US$30 fee. Desperate to bury their loved one, they paid.\n\nWe couldnt afford the time, Mucharambei says. We did it because we had no choice.\n\nPostmortem bribes are just one element of a health system  and state  in freefall.Hospitals across the country are plaguedby chronic underfunding, obsolete infrastructure and the mass emigration of medical professionals seeking better pay abroad. The government estimates that the country needs more than US$1.6 billion for its health sector to recover.\n\nUnderpaid and overstretched health workers have come to rely on informal payments as a means of survival, says Dr. Norman Matara, secretary general of the Zimbabwe Hospital Doctors Association. People are trying to survive. But over time, corruption becomes part of the culture.\n\nHe says its a common problem across hospital services, from the moment a patient is admitted.New mothers, for example, face extortionfor birth cards meant to be free. A 2021 study from Transparency International Zimbabwe surveyed over 1,000 people in Zimbabwe and found that 74% had been asked to pay a bribe while trying to access health care services.\n\nIn March, a nurses protest at Sally Mugabe Central Hospital  the largest referral hospital in the country  exposed how dire the situation is. It was the latest in a long history of strikes by health workers, who have repeatedly protested poor pay and deteriorating working conditions. But their actions are often met with intimidation. In June 2022, the government responded to a strike by passing a law banning health care workers from striking longer than 72 hours, with penalties of up to six months in jail for participants and organizers.\n\nA hospital corridor leads to the mortuary at Parirenyatwa Hospital. Zimbabwes public health system faces a severe shortage of pathologists, leading to postmortem delays and widespread bribery. Families say theyre often pressured to pay unofficial fees to expedite the process or obtain basic information about their loved ones.Photo credit: Linda Mujuru, GPJ Zimbabwe\n\nPathology services are particularly strained, Matara says. The few available specialists are clustered in major hospitals, which creates opportunities for exploitation.\n\nFew medical students choose the career, and those who do face an uphill battle. Training programs are underfunded, mentorship is scarce and working conditions at public hospitals are dismal.\n\nBut this is partly a manufactured problem, says Memory, a nurse at Sally Mugabe Central Hospital, who asked to use her middle name for fear of losing her job. Memory has worked at the hospitals mortuary close to 20 years.\n\nThere isnt really a backlog but a fake one is created by police officers, the doctors and mortuary staff to pressure families into paying, she says.\n\nThese services are supposed to be easily available, she adds. A Cuban doctor performs the forensic postmortems on Mondays, Wednesdays and Fridays, while the general ones are done daily. But families are often told there are delays. At times, they are asked to pay US$50 to skip it entirely, even when its required by law, or US$100 to expedite the process, Memory says.\n\nIts a moneymaking scheme at the expense of grieving people, she says.\n\nGlobal Press Journal reached out to Sally Mugabe Central Hospital for a response to these allegations. They declined to comment.\n\nTendai Terrence Mautsi, the public relations officer at Parirenyatwa Hospital, the largest public hospital in Zimbabwe, says there are occasional delays with forensic postmortem cases, mostly due to demand. The hospital, he says, has responded by increasing forensic postmortem days from two to three. Theyve also cut the average waiting time from up to two weeks to just three days. To address the national shortage, Mautsi says, the hospital has partnered with Cuban doctors to fill the skills gap.\n\nHe acknowledges that corruption has plagued the process. But, he says, its part of a much bigger unravelling, and everyone has become complicit.\n\nAt times you cant find evidence, he says. When you want to investigate it, the patient is complicit. The service provider is also complicit.\n\nIn the end, corruption harms people in need, says Tafadzwa Chikumbu, the executive director of Transparency International Zimbabwe. For those who cant afford to pay [a bribe], it means being left unattended, he says, which erodes the integrity of public institutions.\n\nThe solution, he says, is to make ethical conduct  including fair hiring and honest service delivery  the standard.\n\nEmily Muchabaiwa, in hat, Antonette Chisango and Keldon Muchabaiwa sit at their home in Harare. The sudden death of Emily Muchabaiwas brother  Chisangos husband  was marred by irregularities, including the absence of a written report and the lack of a clear explanation from medical staff.Photo credit: Linda Mujuru, GPJ Zimbabwe\n\nPostmortem corruption means some families never find out what happened to their loved one. When Emily Muchabaiwas brother was found dead in Harares industrial area, his family was desperate for answers. The circumstances of his death werent clear, and the family hoped a postmortem at Parirenyatwa Hospital would offer closure.\n\nPer standard procedure, a medical doctor or the pathologist should explain the results to the family, Matara says. There should also be a written report. But it was a police officer who delivered the results, verbally, to Muchabaiwas family. There was no official report.\n\n[He] told us my brother had died from tuberculosis and a cold in the lungs, but he struggled to explain the medical terms. Prior to all this, my brother had no signs of sickness, she says.\n\nThe family was suspicious. Muchabaiwa says they believe the death involved foul play and the process was compromised. It would cost the family money to delay the funeral, so they buried her brother, who left behind a young son.\n\nWe had no choice, she says, voice trembling. The postmortem failed us. Corruption failed us.\n\nLinda Mujuruis a Reporter-in-Residence for Global Press Journal in Zimbabwe, where she covers foreign direct investment and its effects on local communities. She holds an MBA from Midlands State University and Masters and Bachelors degrees in Journalism and Media Studies from the National University of Science and Technology. Linda is one of Global Press most widely read and syndicated journalists and won the Community Champions Award from the Nonprofit News Awards for her story Push for Gold Leaves a Toxic Legacy.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/16183122/01_GPJNews_Zimbabwe_LM_PostMortem_71_L_T.JPG_web.jpg",
            "description": "<p>By Linda Mujuru, GPJ Zimbabwe This story was originally published by Global Press Journal. HARARE, ZIMBABWE — Blessing Mucharambei’s uncle was just having lunch when he stood up, then collapsed. “[He] started bleeding from the nose,” she says, “and died on the spot.” As far as his family knew, he had no health problems. As</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/how-zimbabwes-health-system-profits-from-the-dead/\">How Zimbabwe’s Health System Profits From the Dead</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "17 Jun 2025"
        },
        {
            "title": "We are sick and tired of earning peanuts – teachers stage protest over poor salaries",
            "url": "https://www.newzimbabwe.com/we-are-sick-and-tired-of-earning-peanuts-teachers-stage-protest-over-poor-salaries/",
            "content": "By Staff Reporter\n\nDOZENS of teachers under the Amalgamated Rural Teachers Union of Zimbabwe (ARTUZ) in Manicaland, Monday, staged a protest over paltry salaries and poor working conditions.\n\nSince 2018, the teachers have been demanding at least US$1,260 monthly salary from the government.\n\nThey currently earn around US$300, and many struggle to afford basic necessities like healthcare, education and accommodation.\n\nWe are sick and tired of the peanuts that we are being paid. It is high time we demanded our US$1,260 salary a month.\n\nThat money will be enough to take our children to school. We also demand basic education for all.\n\nThe elites have been able to take their children to universities out of the country. Our children are languishing in poverty; it is high time we make sure that our children are taken to quality education, said one of the protesters.\n\nThey also demanded meaningful collective bargaining, the restoration of their three-month vacation leave, paternity leave for male staff, and improved conditions that reflect their professional status, saying they have had enough of poverty.\n\nResponding to the following call by President@OMasaraureManicaland Province took to the streets today and petitioned duty bearers.\n\nThe struggle is now being led from below.\n\nTeachers, Our Profession is Under Attack  It's Time to Fight Back!\n\n12 June 2025\n\nFellow teachers, ourpic.twitter.com/DGfOo2v5Hv\n\n Amalgamated Rural Teachers Union of Zimbabwe,ARTUZ (@ARTUZ_teachers)June 16, 2025\n\nWe want collective bargaining that will speak to teachers issues, we also demand the restoration of our three months vacation leave, we want men to be sent on paternity leave. We have had enough of poverty; it is time we must be seen as professionals.\n\nThis comes at a time when the University of Zimbabwe (UZ) lecturers have been staging weekly protests as part of their ongoing strike against poor salaries, which has reached day 63.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/16210918/Screenshot-2025-06-16-at-22.06.42.png",
            "description": "<p>By Staff Reporter DOZENS of teachers under the Amalgamated Rural Teachers Union of Zimbabwe (ARTUZ) in Manicaland, Monday, staged a protest over paltry salaries and poor working conditions. Since 2018, the teachers have been demanding at least US$1,260 monthly salary from the government. They currently earn around US$300, and many struggle to afford basic necessities</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/we-are-sick-and-tired-of-earning-peanuts-teachers-stage-protest-over-poor-salaries/\">We are sick and tired of earning peanuts – teachers stage protest over poor salaries</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "17 Jun 2025"
        }
    ]
}