{
    "news": [
        {
            "title": "Jah Prayzah receives latest vehicle, US$150k from controversial Chivayo",
            "url": "https://www.newzimbabwe.com/jah-prayzah-receives-latest-vehicle-us150k-from-controversial-chivayo/",
            "content": "By Darlington Gatsi\n\nBARELY a week after releasing his 14th studio album Jah Prayzah has received the latest Range Rover Autobiography and money from controversy-ridden tenderpreneur Wicknell Chivayo.\n\nJah Prayzah, who has never hidden his affinity for the ruling party, Zanu PF, has become a beneficiary of Chivayos generosity yet again.\n\nThe latest gift, a Range Rover Autobiography, is worth over US$200,000, along with US$150,000 in cash.\n\nThe gift comes as the Zanu PF government faces backlash over the deteriorating state of the health system, which is characterised by a lack of medical supplies.\n\nAmid the dire state of healthcare, Zanu PF has been accused of lavishing gifts on its supporters while neglecting the general populace.\n\nAnnouncing the gift, Chivayo said it was in recognition of Jah Prayzahs achievements following the launch of his album Ndini Mukudzei at Old Hararians Club.\n\nAs I promised before, and in celebration of your unstoppable progress and the major success of the launch of Ndini Mukudzei last Saturday, please go and see Victor at Exquisite Motorsyour brand-new 2025 Range Rover Autobiography is fully paid for and ready for collection.\n\nA GOAT like you deserves to drive nothing but the highest luxury. In addition, please collect your US$150,000 in cash as promised.\n\nThis is just a small token of my gratitude for your immense contribution to Zimbabwean music and your patriotism in uniting thousands of people through music, preaching peace, love, and unity in every song, posted Chivayo on social media.\n\nChivayo was last month implicated by South African financial institutions in receiving money from Ren-Form CC, which was awarded a tender by the Zimbabwe Electoral Commission (ZEC) during the 2023 elections. Ren-Form CC allegedly charged inflated prices for the goods.\n\nFunds amounting to R800 million were traced to accounts linked to Chivayo.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/06145611/WhatsApp-Image-2025-05-06-at-15.30.25.jpeg",
            "description": "<p>By Darlington Gatsi BARELY a week after releasing his 14th studio album Jah Prayzah has received the latest Range Rover Autobiography and money from controversy-ridden tenderpreneur Wicknell Chivayo. Jah Prayzah, who has never hidden his affinity for the ruling party, Zanu PF, has become a beneficiary of Chivayo’s generosity yet again. The latest gift, a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/jah-prayzah-receives-latest-vehicle-us150k-from-controversial-chivayo/\">Jah Prayzah receives latest vehicle, US$150k from controversial Chivayo</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:29",
            "date": "06 May 2025"
        },
        {
            "title": "Journalist Mhlanga granted US$500 bail",
            "url": "https://www.newzimbabwe.com/journalist-mhlanga-granted-us500-bail/",
            "content": "By Mary Taruvinga\n\nHigh Court judge Justice Gibson Mandaza has granted Alpha Media Holdings journalist Blessed Mhlanga bail.\n\nThis followed his successful appeal through his lawyers, Advocate Thabani Mpofu and Chris Mhike.\n\nThe accused be and is hereby granted bail. He is to deposit US$500 bail with the clerk of court, said the judge.\n\nThere are indeed changed circumstances. Im of the view that the court a quo misdirected itself. The appellant is a permanent resident of this country.\n\nTo allay the fears, the state can place conditions to ensure that he does not interfere and abscond.\n\nThe judge said the fear of interference does not stand because the docket is now complete.\n\nThe appeal was his second before the High Court.\n\nMhlanga had been denied bail thrice.\n\nHis lawyer, Advocate Thabani Mpofu, who is taking instructions from Chris Mhike, urged the judge to grant the journalist freedom, submitting that there have been changed circumstances.\n\nMpofu said Mhlanga was locked up following calls for protests by war veteran Blessed Geza, but people did not flood the streets as called for.\n\nThe lawyer also said that when Geza called for a national shutdown, people went on with their business.\n\nWe submit that there was an obvious change in circumstances and the court a quo misdirected itself in dealing with a question that was placed before it.\n\nThere have been changes that serve to address the concerns that were initially raised by the courts in denying the appellant bail.\n\nThe charge is transmitting material with the intention of inciting violence. It is critical to consider the importance of the charge.\n\nIt was transmission linked to an event or events and this said, the appellant is a journalist, he asked questions in an interview and answers were given, so if there is an allegation that material meant to incite violence was transmittedthe time of the protests has come and gone.\n\nMay this court take judicial notice that the first call of protest was made and there were no people who flooded the streets.\n\nThere was a call for a national shutdown, but people went on with their business.\n\nWhat is alleged by the state to be the transmission of inciting messages has come and gone. What has not come and gone is the continuity of the incarceration of the appellant in jail.\n\nPart of the reasons for denying bail was that there might be disturbance of peacedisturbance in connection with the event.\n\nMpofu said there was no violence in the country, adding that even the judge, being a Zimbabwean, has noticed this.\n\nMhlanga has filed an application seeking direct access to the Constitutional Court, arguing that he was unlawfully arrested and charged.\n\nThe passage of time in this matter must constitute a changed circumstance. It constitutes a change in circumstance that entitles the appellant to bail.\n\nIf there is no evidence that links him to the crime, he should not be in jail, Mpofu said.\n\nIn challenging the granting of bail to Mhlanga, the state said there is electronic and video evidence.\n\nThe police said they have overwhelming evidence. This means they have gathered the evidence. They have assessed it and came to the conclusion that it is overwhelming. Under those circumstances, there has been a passage of time, and all the witnesses have been interviewed.\n\nSo, My Lord, there is no longer evidence to be interfered with.\n\nThe protests have come and gone.\n\nThat has to have changed circumstances, he said.\n\nFungai Nyahunzvi, representing the state, said prosecution is still opposed to bail.\n\nHe said the argument that Mhlanga has not interfered with witnesses and evidence does not stand and does not change the complexion of the case.\n\nThe fear is still being held. The trial date has now been given.\n\nOne circumstance that has changed is that there has been passage of time, which has given the state time to prepare for trial, and now we are saying we are now ready for trial.\n\nIf we had not done so may be the argument that they have failed to give us a trial date would have helped their case, he said.\n\nHe also said that if granted bail, he might influence witnesses not to testify.\n\nAs we speak, there are people who are appearing in this court after taking heed of the calls to protests so we still have that fear, said the prosecutor.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26003108/InShot_20250225_165102005-scaled-e1741780334367.jpg",
            "description": "<p>By Mary Taruvinga High Court judge Justice Gibson Mandaza has granted Alpha Media Holdings journalist Blessed Mhlanga bail. This followed his successful appeal through his lawyers, Advocate Thabani Mpofu and Chris Mhike. “The accused be and is hereby granted bail. He is to deposit US$500 bail with the clerk of court,” said the judge. “There</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/journalist-mhlanga-granted-us500-bail/\">Journalist Mhlanga granted US$500 bail</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:29",
            "date": "06 May 2025"
        },
        {
            "title": "Unwarranted mischievous attacks – Health Ministry dismisses Machakaire’s plea for redress of deteriorating public health care system",
            "url": "https://www.newzimbabwe.com/unwarranted-mischievous-attacks-health-ministry-dismisses-machakaires-plea-for-redress-of-deteriorating-public-health-care-system/",
            "content": "By Thandiwe Garusa\n\nThe Ministry of Health and Child Care has dismissed Youth Empowerment Minister Tinoda Machakaires call for President Emmerson Mnangagwa to urgently address the dire situation in public hospitals.\n\nMachakaire took to social media to lament the deteriorating conditions in public hospitals after his relative sought medical attention at one such facility.He urged President Mnangagwa to visit public hospitals personally to witness the crisis firsthand.\n\nHowever, in a statement Tuesday, the Ministry of Health dismissed Machakaires remarks as unwarranted and mischievous attacks that deliberately ignore the critical services being provided despite limited resources.\n\nThe Ministry of Health and Child Care has taken note of recent negative remarks circulating on social media, which appear to form part of a broader pattern of unwarranted and mischievous attacks.\n\nThese comments seem to be well-orchestrated efforts aimed at selectively highlighting challenges within the public healthcare system, while deliberately overlooking the critical services still being providedoften under resource-constrained conditionsand the significant progress made in recent years, reads the statement.\n\nZimbabwes public hospitals suffer from dilapidated infrastructure and an inadequate supply of medicines, with patients often required to pay for essentials such as blood, drugs, and diagnostic services.\n\nAdditionally, healthcare workers remain poorly paid.\n\nRecently, a South African had to be airlifted back home from Bulawayo, where he had fallen ill and could not get adequate medical treatment.\n\nDespite all these concerns, the Health Ministry did not acknowledge that the healthcare system is in crisis and instead made vague claims that notable improvements have been made under Mnangagwas leadership.\n\nWhile we recognise and respect the publics right to express concerns, and we welcome constructive engagement from all citizens and leaders, it is vital that such discourse remains fair, balanced, and based on verified facts.\n\nThe Ministry is open to meaningful dialogue and informed critique; however, we strongly reject narratives that unfairly undermine the tireless efforts of our healthcare professionals and ignore the notable achievements underway across the country.\n\nWe therefore call upon all public officials, civil society actors, the private sector, and development partners to work together in good faith to address challenges within the health sector. Collaboration, not confrontation, is the path to sustainable progress.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/01/08044936/mombeshora.webp",
            "description": "<p>By Thandiwe Garusa The Ministry of Health and Child Care has dismissed Youth Empowerment Minister Tinoda Machakaire’s call for President Emmerson Mnangagwa to urgently address the dire situation in public hospitals. Machakaire took to social media to lament the deteriorating conditions in public hospitals after his relative sought medical attention at one such facility. He urged</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/unwarranted-mischievous-attacks-health-ministry-dismisses-machakaires-plea-for-redress-of-deteriorating-public-health-care-system/\">Unwarranted mischievous attacks – Health Ministry dismisses Machakaire’s plea for redress of deteriorating public health care system</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:29",
            "date": "06 May 2025"
        },
        {
            "title": "Proplastics slams tight policy inducing ZWG scarcity",
            "url": "https://www.newzimbabwe.com/proplastics-slams-tight-policy-inducing-zwg-scarcity/",
            "content": "By Alois Vinga\n\nLISTED pipes and fittings manufacturers, Proplastics Limited, have blamed the implementation of tight Monetary Policy for ZWG shortages, which have hit the business flows.\n\nWhile credited for relative exchange rate stability, which has seen exchange rates hovering between ZWG26 to ZWG32, experts believe the current stability is stage-managed and risks going haywire in the event of the Treasury removing the tight grip on money supply.\n\nEchoing similar sentiments this week, despite a promising start to the quarter, the environment remains constrained by liquidity issues, low economic activity and increasing power disruptions.\n\nThe tight monetary policy measures currently in place have resulted in the scarcity of the local currency, with the resulting slowing in Government projects. Whilst the exchange rate and inflation have been brought under control, the availability of ZWG remains limited, thereby negatively impacting potential revenue streams, the company said.\n\nProplastics said the increase in the foreign currency surrender requirement from 25% to 30% for exports has not only eroded the competitiveness of our exports but has also negatively impacted overall market positioning and exporting viability.\n\nRevenue for the first quarter was primarily received in US$, with US$ payments dominating transactions throughout the period.\n\nIn the current quarter, the formal market, particularly the retail sector, the company made appeals for a reduction in the cost of doing business and the removal of informal sector advantages.\n\nDespite the prevailing liquidity issues, the quarterly sales volumes grew by 11% over the prior period. Revenue grew by 3% to US$4,263 million against US$4,123 million achieved in the prior period, without any export contribution recorded in the current quarter.\n\nProduction volumes also increased by 11% against the previous period, as the business cleared supply backlogs and replenished stocks for high-demand products. The raw material supply remained consistent throughout the quarter.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/06/26072344/Proplastics.jpg",
            "description": "<p>By Alois Vinga LISTED pipes and fittings manufacturers, Proplastics Limited, have blamed the implementation of tight Monetary Policy for ZWG shortages, which have hit the business flows. While credited for relative exchange rate stability, which has seen exchange rates hovering between ZWG26 to ZWG32, experts believe the current stability is stage-managed and risks going haywire</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/proplastics-slams-tight-policy-inducing-zwg-scarcity/\">Proplastics slams tight policy inducing ZWG scarcity </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:29",
            "date": "06 May 2025"
        },
        {
            "title": "Victoria Falls region sees increased tourist arrivals in Q1",
            "url": "https://www.newzimbabwe.com/victoria-falls-region-sees-increased-tourist-arrivals-in-q1/",
            "content": "Xinhua\n\nA total of 61,139 tourists visited the Zimbabwean side of Victoria Falls in the first quarter (Q1) of 2025, marking an increase compared to the same period last year, the Zimbabwe Parks and Wildlife Management Authority (ZimParks) said Monday.\n\nZimParks spokesperson Tinashe Farawo said in a statement that the increase was largely attributed to a noticeable rise in international arrivals, which reached 47,633 in 2025, up from 44,110 in 2024 during the same period. In contrast, domestic tourism has experienced a slight decline.\n\nKey source markets driving international interest in Victoria Falls include Europe, particularly the United Kingdom, Ireland, and Germany, largely due to the availability of dedicated tour packages, said Farawo, adding that South Africa continues to be the largest source of visitors, followed closely by Botswana.\n\nEnhanced accessibility through the expansion of Victoria Falls International Airport, along with the introduction of new flight routes, including direct flights from Frankfurt, has further facilitated the growing interest among German tourists, he said.\n\nThe implementation of the KAZA UniVisa, which simplifies cross-border travel between Zimbabwe and Zambia, has also played a role in encouraging visitors to explore both sides of the falls, offering a more seamless travel experience for tourists from many countries, Farawo added.\n\nLocated on the border between Zambia and Zimbabwe, Victoria Falls is one of the worlds largest waterfalls, renowned for its rich biodiversity in flora and fauna.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/09/21060705/vic-falls.jpeg",
            "description": "<p>Xinhua A total of 61,139 tourists visited the Zimbabwean side of Victoria Falls in the first quarter (Q1) of 2025, marking an increase compared to the same period last year, the Zimbabwe Parks and Wildlife Management Authority (ZimParks) said Monday. ZimParks spokesperson Tinashe Farawo said in a statement that the increase was largely attributed to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/victoria-falls-region-sees-increased-tourist-arrivals-in-q1/\">Victoria Falls region sees increased tourist arrivals in Q1</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:29",
            "date": "06 May 2025"
        },
        {
            "title": "A test for ZAOGA as Chivayo showers Guti with 2025 Toyota Land Cruiser",
            "url": "https://www.newzimbabwe.com/a-test-for-zaoga-as-chivayo-showers-guti-with-2025-toyota-land-cruiser/",
            "content": "By Staff Reporter\n\nControversial businessman and tenderpreneur Wicknell Chivayo has gifted Eunor Guti, the widow of the late founder of ZAOGA Forward in Faith Ministries Ezekiel Guti, with a 2025 brand new Toyota Land Cruiser 300 Series VXR, along with a US$250,000 cash gift.\n\nGuti died in July 2023 after a short illness and was buried on Bindura Mountain, where he started the church.\n\nChivayo, who is always looking to make a splash, said he is waiting for the churchs response to accept the gift.\n\nI am profoundly humbled to express my deepest gratitude to my beloved mother, Dr. Eunor Guti. Ordinarily, I would say, please go and see Farai but Farai from Faramatsi Motors, Club Chambers Showroom along 4th Street will come to you and deliver your 2025 brand new Toyota Land Cruiser 300 Series VXR which is fully paid for and ready for delivery, subject to the Churchs Governing Boards consent.Furthermore, please accept USD250,000 in CASH for fuel and your personal use, Chivayo wrote on his Facebook account Monday, attaching a video clip of the vehicle in question.\n\nIt remains to be seen if ZAOGA church leadership will approve of Chivayos donation, given the raging fury over his controversial wealth.\n\nChivayo said he was moved to honour Guti in death because he was a man whom he turned to in difficult times, and largely because he left a gospel seed that continues to positively impact the lives of millions of people across the globe.\n\nI wish to honor a distinguished man, a humble servant of God whom I had the privilege to call Father. A man I would turn to in times of sorrow, in times of distress, in times of seeking divine clarity. A man whose voice of calm would quiet the storms within me and many others, he said.\n\nChivayo also said he honours Guti for standing with the government during turbulent times as he offered prayers and guidance.\n\nHe stood with the Government through every phase of our nations difficult evolution, offering prayers, wisdom and guidance. Wherever he went, he spoke glowingly of Zimbabwe, just as passionately as he spoke about the Bible. In every word he preached and every step he took, he upheld the values of humility, unity, prayer, hard work and divine purpose, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/06081323/eunor-guti.jpg",
            "description": "<p>By Staff Reporter Controversial businessman and tenderpreneur Wicknell Chivayo has gifted Eunor Guti, the widow of the late founder of ZAOGA Forward in Faith Ministries Ezekiel Guti, with a 2025 brand new Toyota Land Cruiser 300 Series VXR, along with a US$250,000 cash gift. Guti died in July 2023 after a short illness and was</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/a-test-for-zaoga-as-chivayo-showers-guti-with-2025-toyota-land-cruiser/\">A test for ZAOGA as Chivayo showers Guti with 2025 Toyota Land Cruiser</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:29",
            "date": "06 May 2025"
        },
        {
            "title": "Mutare starts fumigating potential breeding areas amid bedbug outbreak",
            "url": "https://www.newzimbabwe.com/mutare-starts-fumigating-potential-breeding-areas-amid-bedbug-outbreak/",
            "content": "By Staff Reporter\n\nThe City of Mutarehas started fumigating possible bedbug breeding areas and has launched awareness campaigns amid an outbreak in Harares Mbare suburb.\n\nA bedbug outbreak was confirmed in Mbare housing units in April. Harare City Council and the government are targeting to fumigate over 5000 units in the high-density suburb.\n\nAccording to Harare City Council officials, initial investigations revealed the bedbug outbreak had been caused by second-hand clothes sold in Mbare markets.\n\nCity of Mutare is currently conducting routine spraying of potential bedbug breeding areas in and around the City.\n\nDue to the confirmed outbreak of bedbugs in the country, we have also scaled up awareness campaigns to educate our residents on how to protect themselves in the event of an outbreak. All potential areas where bedbugs can breed and spread are being targeted for fumigation, reads the statement.\n\nMutare Cityfurtherdismissed social media claims that there are bedbugs in the Bako flea market.\n\nThe fumigation being carried out is a preventive measure to ensure that our residents are safe from a potential outbreak.\n\nResidents will be kept updated on the situation as we continue with our investigations and awareness efforts.\n\nGuidelines have been issued for residents to prevent a bed bugoutbreak.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/07052122/bedbugs-what-to-know-2500x1300-1.jpg",
            "description": "<p>By Staff Reporter The City of Mutare has started fumigating possible bedbug breeding areas and has launched awareness campaigns amid an outbreak in Harare’s Mbare suburb. A bedbug outbreak was confirmed in Mbare housing units in April. Harare City Council and the government are targeting to fumigate over 5000 units in the high-density suburb. According to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mutare-starts-fumigating-potential-breeding-areas-amid-bedbug-outbreak/\">Mutare starts fumigating potential breeding areas amid bedbug outbreak</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:29",
            "date": "06 May 2025"
        },
        {
            "title": "Corporates leaving CBD in favour of suburbs – First Mutual",
            "url": "https://www.newzimbabwe.com/corporates-leaving-cbd-in-favour-of-suburbs-first-mutual/",
            "content": "By Alois Vinga\n\nFIRST Mutual Property (FMP) has seen a considerable number of corporate tenants leaving the CBD in favour of nearby suburbs, which now offer better convenience and facilities.\n\nPresenting the groups performance for the period ended December 31 2024, FMP board chairperson, Elisha Moyo, described the countrys real estate sector as navigating both challenges and opportunities.\n\nHe said both public and private sector investments are driving growth and underscored that investment in infrastructure is required to sustain the property market.\n\nHigh vacancy rates persist in the Central Business District (CBD) as tenants relocate to suburban offices and office parks. Businesses are moving away from traffic congestion, parking space shortages and unsatisfactory building conditions, such as malfunctioning elevators and air-conditioning systems in the CBD, he said.\n\nMoyo said recent local plans, such as the Avondale and E.D. Mnangagwa Road Local Development Plans, have also influenced demand as they permit mixed-use developments along major arterial roads.\n\nDuring the period, the Groups Net Property Income increased by 62% to US$4,842,676, while revenue was up 31% to US$9,027,117 as rental income remained the main source of revenue.\n\nRevenue growth was driven by growth in property services income, predominantly project management fees, an upsurge in pure US dollar rentals, and timely rental reviews.\n\nDue to tenants financial challenges, rental collection rates fell from 85% in 2023 to 75% in 2024. Management is working closely with tenants to resolve the arrears.\n\nManagement will continue to adapt its strategies to protect shareholder value and sustain business operations. Prudent capital management, stakeholder engagement, effective utilisation of the available lettable space (occupancy levels), quality and ambience of our property portfolio will be prioritized, added Moyo.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/09/26035218/elisha-moyo.jpg",
            "description": "<p>By Alois Vinga FIRST Mutual Property (FMP) has seen a considerable number of corporate tenants leaving the CBD in favour of nearby suburbs, which now offer better convenience and facilities. Presenting the group’s performance for the period ended December 31 2024, FMP board chairperson, Elisha Moyo, described the country’s real estate sector as navigating both</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/corporates-leaving-cbd-in-favour-of-suburbs-first-mutual/\">Corporates leaving CBD in favour of suburbs – First Mutual</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:29",
            "date": "06 May 2025"
        },
        {
            "title": "Rihanna reveals she is pregnant with third child",
            "url": "https://www.newzimbabwe.com/rihanna-reveals-she-is-pregnant-with-third-child/",
            "content": "BBC\n\nSinger Rihanna has confirmed she is expecting her third baby while attending fashions biggest night of the year, the Met Gala in New York.\n\nThe 37-year-old cradled her bump and smiled for the cameras while appearing on the red carpet, which was navy with daffodils.\n\nRihanna, whose real name is Robyn Fenty, and her partner, rapper A$AP Rocky, already have two sons.\n\nA$AP Rocky, also known as Rakim Mayers,thanked reporters who offered their congratulations on the red carpet.\n\nIt is time to just show the people what we were cooking up, he said.\n\nGetty Images\n\nRihanna was the last to arrive at the benefit event for New Yorks Metropolitan Museum of Art, which marks the opening of its Costume Institutes annual fashion exhibit.\n\nEach year celebrities wear extravagant outfits in line with the events theme. This years concept was Superfine: Tailoring Black Style, the first since 2003 to focus exclusively on menswear.\n\nA$AP Rocky, a co-chair of the event, confirmed the couples pregnancy newson the red carpet.\n\nThank you, thank you, thank you, the rapper said.\n\nIm glad everybodys happy for us because were definitely happy, he added.\n\nThe pop star and businesswoman is known for her high-profile pregnancy announcements.\n\nShe debuted the pregnancy of her first child with a photoshoot with her partner in Harlem, New York City in 2022.\n\nWhen she performed at the Super Bowl halftime show in 2023 she revealed she was expecting their second child.\n\nShes not the first star to reveal their baby bump at the Met Gala  the formertennis player, Serena Williams and model Karlie Kloss both publicly revealed their pregnancies at the 2023 event.\n\nReuters Speculation started mounting that the couple were expecting their third child when Rihanna was seen entering the Carlyle Hotel ahead of the event\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/06073453/rihanna-.webp",
            "description": "<p>BBC Singer Rihanna has confirmed she is expecting her third baby while attending fashion’s biggest night of the year, the Met Gala in New York. The 37-year-old cradled her bump and smiled for the cameras while appearing on the red carpet, which was navy with daffodils. Rihanna, whose real name is Robyn Fenty, and her</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rihanna-reveals-she-is-pregnant-with-third-child/\">Rihanna reveals she is pregnant with third child</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:29",
            "date": "06 May 2025"
        },
        {
            "title": "Ndebele King Bulelani responds to Minister Garwe’s uncivil letter – urges respect and dialogue",
            "url": "https://www.newzimbabwe.com/ndebele-king-bulelani-responds-to-minister-garwes-uncivil-letter-urges-respect-and-dialogue/",
            "content": "By Leopold Munhende\n\nNdebele King Bulelani Khumalo has responded in a dignified manner to Local Government Minister Daniel Garwes rude letter that disparaged his officeanddescribedhim as a charlatan.\n\nGarwe had been angered by King Bulelanis visit to Bulawayo Mayor David Coltart last week.\n\nKing Bulelani is a descendant of King Mzilikazi, who foundeduMthwakazi, a name used to refer to the Ndebele nation, having fled north from Zulu King Shaka to present-day Bulawayo during theuMfecaneera.\n\nGarwes dismissive letter not only generated interest amongst Zimbabweans, it angered a large section of the Ndebele-speaking community who have recognised King Bulelanis reign since his coronation in 2018.\n\nHis Majesty King Bulelani Lobengula kaMzilikazi holds a deeply rooted ancestral and cultural position within the hearts of the uMthwakazi people, as a direct descendant of King Lobengula, and ultimately of King Mzilikazi, the founder of the Ndebele nation, read a statement from King Bulelani.\n\nHis role is not political but restorative, cultural, and symbolicaimed at uniting Mthwakazi descendants across Southern Africa and the diaspora through heritage, identity, and community development.\n\nHis Majestys visit to Bulawayo was in no way a political event or an act of defiance. It was a private and dignified cultural pilgrimage to the historical heartland of the Ndebele peoplea journey marked by mutual respect, peaceful engagement, and cultural significance.\n\nKing Bulelanis presence at Town House was at the behest of Coltart, who had invited him for a meeting wherein they discussed the honouring of certain culturally important days and historically significant sites around Bulawayo.\n\nGarwe responded after images of Coltart and the King were sent on X.\n\nHe went on to express shock, disgust, claimed the Ndebele throne was defunct, described King Bulelani as self-styled and urged Bulawayo not to recognise him.\n\nAdded King Bulelani in response: We respectfully urge public officials to exercise caution, decorum, and cultural sensitivity when speaking on matters of heritage and traditional leadership.\n\nDismissive language or threats of arrest directed at a traditional and cultural figurewhose mission is reconciliation, unity, and empowermentdo not reflect the spirit of Ubuntu or the values enshrined in Pan-Africanism.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/29061714/coltart-bulelani.jpeg",
            "description": "<p>By Leopold Munhende Ndebele King Bulelani Khumalo has responded in a dignified manner to Local Government Minister Daniel Garwe’s rude letter that disparaged his office and described him as a ‘charlatan.’ Garwe had been angered by King Bulelani’s visit to Bulawayo Mayor David Coltart last week. King Bulelani is a descendant of King Mzilikazi, who founded uMthwakazi, a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ndebele-king-bulelani-responds-to-minister-garwes-uncivil-letter-urges-respect-and-dialogue/\">Ndebele King Bulelani responds to Minister Garwe’s uncivil letter – urges respect and dialogue</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:29",
            "date": "06 May 2025"
        }
    ]
}