{
    "news": [
        {
            "title": "Zimbabwe’s gold coins top $4,000 for first time on Bullion rally",
            "url": "https://www.newzimbabwe.com/zimbabwes-gold-coins-top-4000-for-first-time-on-bullion-rally/",
            "content": "\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/07/21142401/gold-coins.webp",
            "description": "<p>Bloomberg Zimbabwe’s gold coins topped the $4,000 mark for the first time, lifted by a global rally in the metal that’s up 45% this year. The 22-carat “Mosi-Oa-Tunya” gold coins — named after Victoria Falls, a popular tourist destination, and introduced in 2022 to counter a rapid depreciation of the now-defunct local dollar — were</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-gold-coins-top-4000-for-first-time-on-bullion-rally/\">Zimbabwe’s gold coins top $4,000 for first time on Bullion rally</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "01 Oct 2025"
        },
        {
            "title": "Zimbabwe orders spending clampdown to keep budget under control",
            "url": "https://www.newzimbabwe.com/zimbabwe-orders-spending-clampdown-to-keep-budget-under-control/",
            "content": "Zimbabwe ordered government departments to halt unbudgeted spending and focus funds only on projects that will support economic growth in the southern African nation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/05/03011105/George-Guvamatanga.jpg",
            "description": "<p>Bloomberg Zimbabwe ordered government departments to halt unbudgeted spending and focus funds only on projects that will support economic growth in the southern African nation. Secretary of Finance George Guvamatanga issued the instruction in a circular seen by Bloomberg and confirmed by his ministry on Monday. He suspended government-funded foreign trips, froze hiring and barred</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-orders-spending-clampdown-to-keep-budget-under-control/\">Zimbabwe orders spending clampdown to keep budget under control</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "01 Oct 2025"
        },
        {
            "title": "South Africa’s top diplomat in France found dead near Paris hotel",
            "url": "https://www.newzimbabwe.com/south-africas-top-diplomat-in-france-found-dead-near-paris-hotel/",
            "content": "BBC\n\nSouth Africas ambassador to France, Nathi Mthethwa, has been found dead near the four-star Hyatt Regency Hotel in Paris, French officials have told the BBC.\n\nMthethwa, 58, was reported missing by his wife on Monday evening, after a worrying message from him, the Paris prosecutors office said.\n\nHe had booked a room on the 22nd floor of the high-rise hotel, whose security window was forced open, it added.\n\nThe circumstances around his death are unclear at this stage, and an investigation has been opened, the Paris prosecutors office said, adding that a duty magistrate was going to the scene.\n\nMthethwa was a high-ranking member of the African National Congress, the party that brought in democratic rule in 1994 with Nelson Mandela as South Africas first black president.\n\nHe had been serving as South Africas ambassador to Paris since December 2023, and had previously been in government as police minister and also arts and culture minister.\n\nHe was a close ally of former President Jacob Zuma and was implicated in what is known in South Africa as the state capture inquiry, which looked into allegations of high-level corruption during Zumas presidency.\n\nIn a statement, South Africas Foreign Minister Ronald Lamola hailed Mthethwa as a distinguished servant of the nation.\n\nI have no doubt that his passing is not only a national loss but is also felt within the international diplomatic community, he added.\n\nLamola confirmed that the circumstances around Mthethwas death were being investigated by the French authorities.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/30181743/nathi-mtetwa.webp",
            "description": "<p>BBC South Africa’s ambassador to France, Nathi Mthethwa, has been found dead near the four-star Hyatt Regency Hotel in Paris, French officials have told the BBC. Mthethwa, 58, was reported missing by his wife on Monday evening, after a “worrying message from him”, the Paris prosecutor’s office said. He had booked a room on the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africas-top-diplomat-in-france-found-dead-near-paris-hotel/\">South Africa’s top diplomat in France found dead near Paris hotel</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "01 Oct 2025"
        },
        {
            "title": "Diaspora Insurance partners global firm Homeland International in groundbreaking move",
            "url": "https://www.newzimbabwe.com/diaspora-insurance-partners-global-firm-homeland-international-in-groundbreaking-move/",
            "content": "By Staff Reporter\n\nDiaspora Insurancehas entered into a strategic partnership with global repatriation services company Homeland International to launch a new insurance product tailored for Africans living abroad.\n\nThe Homeland International Diaspora Funeral Cash Plan (HIDFCP) has been developed to provide financial assistance to Africans in the diaspora during bereavement, addressing the limitations of traditional travel insurance and funeral plans, which often fail to cover the full costs of repatriation and tend to carry high monthly premiums.\n\nEdwin Tsvere, Channels Director forDiaspora Insurance, hailed the collaboration, describing it as a major step forward in serving the African diaspora community.\n\nI believe this collaboration with Homeland International is highly beneficial and effectively addresses the needs of the African diaspora community. The seamless integration of services from both companies provides much-needed peace of mind and support during difficult times.\n\nThe commitment to understanding and serving the specific requirements of Africans living abroad, while ensuring their final wishes are respected in their homeland, is truly commendable. This partnership exemplifies excellent customer focus and operational efficiency, making a significant positive impact on those it serves, said Tsvere.\n\nThe HIDFCP stands out for its early release of funds upon proof of death, disbursed in a currency of choice. The service will cover more than 20 African nationalities residing in the United Kingdom, the European Union, Middle East, the United States, Australia, Canada, and other regions.\n\nSamuel Tester, Homeland International Operations Director\n\nSamuel Tester, Operations Director at Homeland International, also expressed delight in the partnership.\n\nWe are proud to partner with Diaspora Insurance to bring this essential product to the African diaspora, said Tester.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/30132849/Dr-Edwin-Tsvere-Channels-Director.png",
            "description": "<p>By Staff Reporter Diaspora Insurance has entered into a strategic partnership with global repatriation services company Homeland International to launch a new insurance product tailored for Africans living abroad. The Homeland International Diaspora Funeral Cash Plan (HIDFCP) has been developed to provide financial assistance to Africans in the diaspora during bereavement, addressing the limitations of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/diaspora-insurance-partners-global-firm-homeland-international-in-groundbreaking-move/\">Diaspora Insurance partners global firm Homeland International in groundbreaking move</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "01 Oct 2025"
        },
        {
            "title": "Minister Marian Chombo escapes jail as High Court dismisses contempt case",
            "url": "https://www.newzimbabwe.com/minister-marian-chombo-escapes-jail-as-high-court-dismisses-contempt-case/",
            "content": "By Mary Taruvinga\n\nMashonaland West Provincial Affairs Minister and Zanu PF legislator Marian Chombo has been spared jail after the High Court struck down a contempt of court application against her.\n\nJustice Joel Mambara struck down the bid by Cubs Den Consolidated (Pvt) Ltd, which sought to have Chombo,the former wife of ex-Finance Minister Ignatius Chombo,together with businessman Tawoneyi Nyazema and Stephen Mutamba jailed for allegedly defying a court order to vacate leased commercial premises.\n\nThe judge ruled the application fatally defective, finding that the provisional order central to the dispute was never personally served on the respondents.\n\nOur courts have long insisted on strict compliance with the personal-service requirement in contempt proceedings, Justice Mambara said. Failure to serve an order affecting liberty personally renders the proceedings defective.\n\nThe court further noted that the Deputy Sheriff had not attempted to enforce the August 22 provisional order authorising eviction, meaning there was no evidence that Chombo and her co-respondents wilfully defied the court.\n\nIn fact, the applicants admit that no service took place, the judge said. Without proof of a breached obligation, no contempt can be found.\n\nThe urgent chamber application, filed by MD Hungwe Attorneys, was therefore struck off the roll with costs.\n\nChombo, who is also a Member of Parliament, was represented by Advocate Zikiti and T. Serengwa of the Civil Division.\n\nThe case stemmed from a dispute over commercial premises leased by Cubs Den Consolidated, which accused Chombo, Nyazema, and Mutamba of unlawfully occupying and interfering with its operations. Although the court issued a provisional order in August barring the trio from the property, the failure to serve and enforce that order ultimately undermined the contempt case.\n\nThe ruling comes as a relief for Chombo, who had faced the possibility of imprisonment if found guilty.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/11/28050901/WhatsApp-Image-2023-11-28-at-07.01.46-e1701148160606.jpeg",
            "description": "<p>By Mary Taruvinga Mashonaland West Provincial Affairs Minister and Zanu PF legislator Marian Chombo has been spared jail after the High Court struck down a contempt of court application against her. Justice Joel Mambara struck down the bid by Cubs Den Consolidated (Pvt) Ltd, which sought to have Chombo, the former wife of ex-Finance Minister Ignatius</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/minister-marian-chombo-escapes-jail-as-high-court-dismisses-contempt-case/\">Minister Marian Chombo escapes jail as High Court dismisses contempt case</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "01 Oct 2025"
        },
        {
            "title": "Supreme Court revives US$455k farm feud appeal",
            "url": "https://www.newzimbabwe.com/supreme-court-revives-us455k-farm-feud-appeal/",
            "content": "By Mary Taruvinga\n\nThe Supreme Court has granted Fernicary Farm (T/A Rutendo Farm) a lifeline in its bitter multimillion-dollar dispute with Des Monies Farm (Pvt) Ltd, reinstating an appeal against a High Court order that awarded US$455,000 in compensation for farm improvements.\n\nJustice George Chiweshe, sitting in chambers, ruled that although Rutendo Farm had failed to meet procedural timelines, its case carried reasonable prospects of success, allowing the appeal to proceed.\n\nAlthough the delay in complying with the infringed rule is not inordinate, the explanation for such delay is not plausible. However, I am of the view that the intended appeal has reasonable prospects of success. It is for that reason that the application must succeed, Chiweshe said.\n\nThe case dates back to 2019, when Rutendo Farm leased its property to Des Monies Farm for a term of eight years, expiring in 2027. The lease collapsed amid disputes, leading to a Deed of Settlement in which the tenant agreed to vacate but would be compensated for improvements, including road repairs, fencing, water reticulation, irrigation maintenance and refurbishment of the main house.\n\nWhen compensation was not paid, Des Monies Farm sued, and in 2022 the High Courts Commercial Division ordered Rutendo Farm to pay US$455,000, dismissing claims it had not consented to the improvements. The court said the landlord had been kept informed and never objected.\n\nRutendo Farm appealed, arguing the improvements were never properly approved, no valuation report was produced, and some of the claimed amounts such as US$150,000 for bush clearance, were operational costs, not improvements. However, it missed deadlines in serving its notice of appeal, causing the case to be deemed abandoned until this latest ruling.\n\nThe High Court award of US$455,000, convertible to local currency at the interbank rate, remains in dispute. If Rutendo Farm succeeds on appeal, Des Monies Farm could lose its compensation for the contested farm developments.\n\nThe Supreme Courts ruling means the appeal will now be heard on its merits, setting the stage for a decisive judgment in this commercial farming dispute.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/07024130/Supreme-Court.png",
            "description": "<p>By Mary Taruvinga The Supreme Court has granted Fernicary Farm (T/A Rutendo Farm) a lifeline in its bitter multimillion-dollar dispute with Des Monies Farm (Pvt) Ltd, reinstating an appeal against a High Court order that awarded US$455,000 in compensation for farm improvements. Justice George Chiweshe, sitting in chambers, ruled that although Rutendo Farm had failed</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/supreme-court-revives-us455k-farm-feud-appeal/\">Supreme Court revives US$455k farm feud appeal</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "01 Oct 2025"
        }
    ]
}