{
    "news": [
        {
            "title": "Zimbabwe all-rounder suspended from bowling",
            "url": "https://www.newzimbabwe.com/zimbabwe-all-rounder-suspended-from-bowling/",
            "content": "ICC\n\nKelis Ndhlovu of the Zimbabwe womens team has been suspended from bowling in international cricket with immediate effect.\n\nThe decision regarding Kelis Ndhlovu of theZimbabwewomens team came after an independent assessment confirmed that the left-arm spinner uses an illegal bowling action.\n\nThe 19-year-old has been suspended from bowling in international cricket with immediate effect. She was reported by match officials during the first ODI against Ireland in Belfast on 26 July and she underwent the assessment in Pretoria, South Africa.\n\nIn accordance with Article 6.1 of theBowling Regulations, Ndhlovus suspension shall remain in place until she submits to a re-assessment of her bowling action which confirms that she can bowl without using an illegal bowing action.\n\nNdhlovu captain Zimbabwe U19 side during the inaugural ICC Womens Under-19 T20 World Cup in 2023. Thus far, she has played 13 womens ODIs and 51 womens T20Is with 19 and 44 wickets respectively. With the ball, she averages close to 19 in both the formats.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/27150133/kellis-ndhlovu.webp",
            "description": "<p>ICC Kelis Ndhlovu of the Zimbabwe women’s team has been suspended from bowling in international cricket with immediate effect. The decision regarding Kelis Ndhlovu of the Zimbabwe women’s team came after an independent assessment confirmed that the left-arm spinner uses an illegal bowling action. The 19-year-old has been suspended from bowling in international cricket with immediate</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-all-rounder-suspended-from-bowling/\">Zimbabwe all-rounder suspended from bowling </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "27 Aug 2025"
        },
        {
            "title": "U.S Embassy extends crew or transit visa validity for Zimbabweans as routine services remain suspended",
            "url": "https://www.newzimbabwe.com/u-s-embassy-extends-crew-or-transit-visa-validity-for-zimbabweans-as-routine-services-remain-suspended/",
            "content": "By Thandiwe Garusa\n\nTHE United States (U.S) Embassy in Harare has extended the validity of C1/D (transit or crew member) visas for Zimbabwean applicants to 24 months with multiple entry.\n\nRoutine visa services, however, remain suspended at the Harare Embassy and applications will only be accepted at U.S. missions outside Zimbabwe.\n\nThis comes after the U.S embassy in Harare earlier this month announced suspension of all routine immigrant and non-immigrant visa services, except for most diplomatic and official visas, citing national security and public safety concerns.\n\nIn a statement Wednesday, the embassy said applications cannot be submitted at the U.S embassy in Harare due to the pause on immigrant and non-immigrant visa services.\n\nThe validity of C1/D (transit or crew member) visas for Zimbabwean applicants has been extended to 24 months with multiple entry.\n\nApplications for C1/D visas may be submitted at a U.S. embassy or consulate outside of Zimbabwe at this time.\n\nThe U.S. Embassy in Harare continues the pause on routine immigrant and non-immigrant visa services, the statement reads.\n\nA C1/D visa is a U.S. nonimmigrant visa issued to foreign nationals working as crew members on ships or airlines.\n\nIt allows them to travel through the United States either to join their vessel or aircraft, or to transit on their way to another destination.\n\nMeanwhile, it is alleged that 709 Zimbabweans, or about 10.57%, overstayed in the U.S. on their B1 and B2 visas (non-immigrant visas for temporary stays, either business or tourism).\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/20182253/embassy.jpg",
            "description": "<p>By Thandiwe Garusa THE United States (U.S) Embassy in Harare has extended the validity of C1/D (transit or crew member) visas for Zimbabwean applicants to 24 months with multiple entry. Routine visa services, however, remain suspended at the Harare Embassy and applications will only be accepted at U.S. missions outside Zimbabwe. This comes after the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/u-s-embassy-extends-crew-or-transit-visa-validity-for-zimbabweans-as-routine-services-remain-suspended/\">U.S Embassy extends crew or transit visa validity for Zimbabweans as routine services remain suspended </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "27 Aug 2025"
        },
        {
            "title": "Greed and no consideration for children – judges says as ZETDC HR boss loses Supreme Court bid in bitter divorce battle",
            "url": "https://www.newzimbabwe.com/greed-and-no-consideration-for-children-judges-says-as-zetdc-hr-boss-loses-supreme-court-bid-in-bitter-divorce-battle/",
            "content": "By Mary Taruvinga\n\nThe Supreme Court has dismissed with costs an application by Rodger Sibanda, Principal Human Resources Officer at the Zimbabwe Electricity Transmission and Distribution Company (ZETDC), who sought to overturn the High Courts award of the couples Buena Vista home and a Mercedes-Benz to his former wife, whom he married when she was just 19.\n\nIn a recent ruling, Justice Nicholas Mathonsi, sitting with Justices Antoneta Guvava and Tendai Uchena, said Sibandas appeal was both hopeless and motivated by greed and an unbelievable lack of consideration for the best interests of his two minor children and the interests of his former wife.\n\nSibanda, now 56, who married Thandiwe Casenege Sibanda in 2011 when he was 42, almost twice her age, had persuaded her to abandon school and take up a job at ZETDC.\n\nTheir marriage collapsed in 2017, sparking an acrimonious divorce that saw the High Court grant custody of the couples children, now aged 12 and 10, to Thandiwe, along with the disputed house and car.\n\nDespite retaining three other immovable properties and four motor vehicles, Sibanda launched repeated attempts to wrestle back Buena Vista and the Mercedes-Benz, filing four separate condonation applications after failing to appeal within the 15-day limit.\n\nThe applicant does not deserve the indulgence of condonation and extension of time within which to prosecute a doomed appeal, ruled Mathonsi.\n\nIt is unconscionable that a father can wish that for his family  to render the children and their mother homeless and to use public transport to school and to work, while he luxuriates with multiple houses and vehicles.\n\nThe court dismissed Sibandas excuse that he had been battling depression, noting he provided no evidence to back up his claims.\n\nThe explanation is demonstrably unsatisfactory, Mathonsi said. Clearly, the applicant does not give an honest account of his default.\n\nWith the Supreme Courts decision, Thandiwe will retain both the Buena Vista property and the Mercedes-Benz, while Sibanda remains with the larger share of their estate.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/07024130/Supreme-Court.png",
            "description": "<p>By Mary Taruvinga The Supreme Court has dismissed with costs an application by Rodger Sibanda, Principal Human Resources Officer at the Zimbabwe Electricity Transmission and Distribution Company (ZETDC), who sought to overturn the High Court’s award of the couple’s Buena Vista home and a Mercedes-Benz to his former wife, whom he married when she was</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/greed-and-no-consideration-for-children-judges-says-as-zetdc-hr-boss-loses-supreme-court-bid-in-bitter-divorce-battle/\">Greed and no consideration for children – judges says as ZETDC HR boss loses Supreme Court bid in bitter divorce battle</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "27 Aug 2025"
        },
        {
            "title": "Zimbabwe urges African nations to prioritise sustainable health financing as donor support declines",
            "url": "https://www.newzimbabwe.com/zimbabwe-urges-african-nations-to-prioritise-sustainable-health-financing-as-donor-support-declines/",
            "content": "By Thandiwe Garusa\n\nZIMBABWE has called on African nations to prioritise sustainable health financing following recent withdrawals of donor funding across the region.\n\nHealth Minister Douglas Mombeshora said this at the ongoing 75th World Health Organisation Regional Committee for Africa meeting in Zambia.\n\nMombeshora, who acknowledged that Zimbabwes struggling healthcare system has for too long depended heavily on donor support, which made it more fragile after funding withdrawals urged long-term resilience rather than short-term dependency, saying this was key to building strong national health systems.\n\nZimbabwes message is clear: sustainable health financing is the cornerstone of strong national health institutions.\n\nWe must move away from dependence and toward resilience from short-term cycles to long-term stability.\n\nLet us work together as a region to mobilise domestic resources, innovate in our financing approaches, and deepen partnerships with the private sector.\n\nIn doing so, Africas health systems will not only survive, but thrive delivering tangible results for our people, Mombeshora said.\n\nAs a way to boost domestic health financing in Zimbabwe, Mombeshora said the nation increased its health budget allocation from 9.4% to 13% and introduced new levies on airtime, sugar, fast foods and other products.\n\nHe also added that the government is rolling out a National Health Insurance scheme to protect citizens from catastrophic medical costs.\n\nZimbabwes government has long neglected general hospitals, which now face crumbling infrastructure, medicine shortages, costly patient care and poor wages that have led to low staff morale and a massive brain drain.\n\nMombeshora also added that the government is strengthening primary healthcare, investing in human resources, upgrading infrastructure, and promoting community engagement.\n\nMeanwhile, Botswana has declared a public health emergency, with President Duma Boko saying the national medical supply chain has collapsed due to depleted government coffers and steep cuts in aid from the United States.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/19201620/mombeshora.jpeg",
            "description": "<p>By Thandiwe Garusa ZIMBABWE has called on African nations to prioritise sustainable health financing following recent withdrawals of donor funding across the region. Health Minister Douglas Mombeshora said this at the ongoing 75th World Health Organisation Regional Committee for Africa meeting in Zambia. Mombeshora, who acknowledged that Zimbabwe’s struggling healthcare system has for too long</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-urges-african-nations-to-prioritise-sustainable-health-financing-as-donor-support-declines/\">Zimbabwe urges African nations to prioritise sustainable health financing as donor support declines</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "27 Aug 2025"
        },
        {
            "title": "Court halts RioZim’s asset sales amid corporate rescue proceedings",
            "url": "https://www.newzimbabwe.com/court-halts-riozims-asset-sales-amid-corporate-rescue-proceedings/",
            "content": "By Mary Taruvinga\n\nThe High Court of Zimbabwe granted an urgent interdict to the Zimbabwe Diamond & Allied Minerals Workers Union (ZDAMWU), effectively blocking RioZim Limited from disposing of its mining assets while pending corporate rescue proceedings.\n\nThe judgment, delivered by Justice Maxwell Dembure, encapsulated the precarious intersection of corporate governance and worker rights.\n\nThe case arose after RioZim, a publicly listed company, issued a cautionary statement on July 21, 2025, initiating discussions regarding the potential sale of its mining and non-core assets. This announcement followed ZDAMWUs filing of a court application on April 28, seeking to place the company under supervision due to financial distress.\n\nDembure noted, The mere filing of the application for corporate rescue triggers an immediate moratorium on the disposal of a companys assets, emphasising the protective nature of the law intended to shield creditors and employees from the adverse effects of asset stripping.\n\nHe further highlighted that any attempt at asset disposal during this phase could render the corporate rescue application academic, fundamentally undermining the purpose of such proceedings.\n\nIn lambasting RioZims move, the judge said, If the applicants rights are not preserved, the purpose of the ongoing litigation will be defeated, which is against the interests of all affected, including the workers. The court affirmed that allowing the asset disposals would suit a strategy that frustrates and defeats the pending corporate rescue proceedings, further noting that the company must not be allowed to operate as if it were free from legal encumbrances.\n\nZDAMWUs counsel, R. Mabwe, characterised the urgency of the application as essential, asserting that should the court fail to act swiftly, irreparable harm would result, reflecting the unions commitment to safeguarding employee interests linked to the companys asset base.\n\nRioZims response, led by attorney E. Donzvambeva, contended that the company should be allowed to explore transactions to alleviate financial duress without impediment.\n\nHe argued, The proposed disposals are necessary for the companys survival, pointing out that asset sales could provide much-needed liquidity during corporate rescue discussions.\n\nHowever, Dembure countered, highlighting the lack of clarity in RioZims intentions about which specific assets might be sold, noting that such details could impact any ruling on the matter.\n\nThe court granted two key orders: prohibiting any asset sales contemplated in RioZims cautionary statement and mandating the company to bear the costs of the proceedings.\n\nThe balance of convenience strongly lies in favouring the applicants request for an interim interdict to prevent potential asset dissipation until a determination is made on the main application.\n\nAs a result of this significant ruling, RioZims shareholders and stakeholders will need to navigate the complexities of corporate restructuring under the courts oversight, while the future of the companys asset management remains uncertain.\n\nThe outcome of the wider corporate rescue proceedings now looms large, with potential implications for the mining sector and employee security within the industry at stake.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/13181521/high-court-of-zimbabwe-3.jpg",
            "description": "<p>By Mary Taruvinga The High Court of Zimbabwe granted an urgent interdict to the Zimbabwe Diamond & Allied Minerals Workers’ Union (ZDAMWU), effectively blocking RioZim Limited from disposing of its mining assets while pending corporate rescue proceedings. The judgment, delivered by Justice Maxwell Dembure, encapsulated the precarious intersection of corporate governance and worker rights. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/court-halts-riozims-asset-sales-amid-corporate-rescue-proceedings/\">Court halts RioZim’s asset sales amid corporate rescue proceedings</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "27 Aug 2025"
        }
    ]
}