{
    "news": [
        {
            "title": "Municipal worker dies in refuse truck accident",
            "url": "https://www.newzimbabwe.com/municipal-worker-dies-in-refuse-truck-accident/",
            "content": "By Staff Reporter\n\nA CHITUNGWIZA municipal worker, Simon Maketo, died Thursday after sustaining injuries in a tragic workplace accident that occurred while he was on duty in Manyame Park.\n\nMaketo reportedly hit his head against a precast wall and lost balance after the truck attempted to navigate around a stationary commuter omnibus obstructing its path.In a statement Friday, Municipality of Chitungwiza said Maketo was rushed to St Marys Clinic and later transferred to Chitungwiza Central Hospital, where he was pronounced dead on arrival.Preliminary reports indicate that during refuse collection, the refuse truck encountered a stationary commuter omnibus obstructing it. Mr. Maketo was positioned on the right side of the truck.As the driver attempted to maneuver around the obstruction, Mr. Maketo reportedly panicked, hitting his head against a precast wall before being struck again by the truck. He then lost balance and fell to the ground.He was immediately rushed to St Marys Clinic and later transferred to Chitungwiza Central Hospital by our municipal ambulance.Unfortunately, he was pronounced dead on arrival, the statement reads.\n\nMaketo reportedly hit his head against a precast wall and lost balance after the truck attempted to navigate around a stationary commuter omnibus obstructing its path.\n\nIn a statement Friday, Municipality of Chitungwiza said Maketo was rushed to St Marys Clinic and later transferred to Chitungwiza Central Hospital, where he was pronounced dead on arrival.Preliminary reports indicate that during refuse collection, the refuse truck encountered a stationary commuter omnibus obstructing it. Mr. Maketo was positioned on the right side of the truck.As the driver attempted to maneuver around the obstruction, Mr. Maketo reportedly panicked, hitting his head against a precast wall before being struck again by the truck. He then lost balance and fell to the ground.He was immediately rushed to St Marys Clinic and later transferred to Chitungwiza Central Hospital by our municipal ambulance.Unfortunately, he was pronounced dead on arrival, the statement reads.\n\nIn a statement Friday, Municipality of Chitungwiza said Maketo was rushed to St Marys Clinic and later transferred to Chitungwiza Central Hospital, where he was pronounced dead on arrival.\n\nPreliminary reports indicate that during refuse collection, the refuse truck encountered a stationary commuter omnibus obstructing it. Mr. Maketo was positioned on the right side of the truck.As the driver attempted to maneuver around the obstruction, Mr. Maketo reportedly panicked, hitting his head against a precast wall before being struck again by the truck. He then lost balance and fell to the ground.He was immediately rushed to St Marys Clinic and later transferred to Chitungwiza Central Hospital by our municipal ambulance.Unfortunately, he was pronounced dead on arrival, the statement reads.\n\nPreliminary reports indicate that during refuse collection, the refuse truck encountered a stationary commuter omnibus obstructing it. Mr. Maketo was positioned on the right side of the truck.\n\nAs the driver attempted to maneuver around the obstruction, Mr. Maketo reportedly panicked, hitting his head against a precast wall before being struck again by the truck. He then lost balance and fell to the ground.He was immediately rushed to St Marys Clinic and later transferred to Chitungwiza Central Hospital by our municipal ambulance.Unfortunately, he was pronounced dead on arrival, the statement reads.\n\nAs the driver attempted to maneuver around the obstruction, Mr. Maketo reportedly panicked, hitting his head against a precast wall before being struck again by the truck. He then lost balance and fell to the ground.\n\nHe was immediately rushed to St Marys Clinic and later transferred to Chitungwiza Central Hospital by our municipal ambulance.Unfortunately, he was pronounced dead on arrival, the statement reads.\n\nHe was immediately rushed to St Marys Clinic and later transferred to Chitungwiza Central Hospital by our municipal ambulance.\n\nUnfortunately, he was pronounced dead on arrival, the statement reads.\n\nUnfortunately, he was pronounced dead on arrival, the statement reads.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/31184346/Accident4.jpg",
            "description": "<p>By Staff Reporter A CHITUNGWIZA municipal worker, Simon Maketo, died Thursday after sustaining injuries in a tragic workplace accident that occurred while he was on duty in Manyame Park. Maketo reportedly hit his head against a precast wall and lost balance after the truck attempted to navigate around a stationary commuter omnibus obstructing its path.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/municipal-worker-dies-in-refuse-truck-accident/\">Municipal worker dies in refuse truck accident </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:47",
            "date": "02 Aug 2025"
        },
        {
            "title": "Zimbabwe on track for 6% growth as economy recovers from drought",
            "url": "https://www.newzimbabwe.com/zimbabwe-on-track-for-6-growth-as-economy-recovers-from-drought/",
            "content": "Reuters\n\nZimbabwe is on track to achieve a forecasted 6% economic growth in 2025 helped by good agricultural output and strong commodity prices, Finance Minister Mthuli Ncube said on Thursday.\n\nThe Southern African countrys economy has shown signs of recovery in the first half of the year following a severe drought and currency turbulence in 2024 that pushedGDP growth down to 2%.\n\nGiven the positive economic developments during the period January to June, we are confident that the projected economic growth of 6% alluded to in the 2025 National Budget is achievable, Ncube told parliament in a mid-year budget review.\n\nAll sectors of the economy are expected to record positive growth in 2025, mainly on account of a favourable agriculture season, improved electricity generation, stable exchange rate and inflation rate, he said.\n\nHe did not give an update on the budget deficit, which was seen at 0.4% of gross domestic product in 2025 during the budget forecast last November.\n\nZimbabwes fiscal position remains under strain from grain imports, drought relief spending and the public sector wage bill. While the government has collected more revenue than in the same period last year, analysts say containing the deficit may prove difficult without new fiscal measures.\n\nThe local currency, the ZiG, launched in April 2024 to replace the Zimbabwe dollar, has largely remained stable against the U.S. dollar but is still overshadowed by widespread use of the dollar in everyday transactions.\n\nNcube reiterated the governments commitment to the gold-backed unit and said the currency had benefited from tight monetary and fiscal policies.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/19181244/Vendors-4.jpg",
            "description": "<p>Reuters Zimbabwe is on track to achieve a forecasted 6% economic growth in 2025 helped by good agricultural output and strong commodity prices, Finance Minister Mthuli Ncube said on Thursday. The Southern African country’s economy has shown signs of recovery in the first half of the year following a severe drought and currency turbulence in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-on-track-for-6-growth-as-economy-recovers-from-drought/\">Zimbabwe on track for 6% growth as economy recovers from drought</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:47",
            "date": "02 Aug 2025"
        },
        {
            "title": "Sinking Dynamos finally registers Denver Mukamba",
            "url": "https://www.newzimbabwe.com/sinking-dynamos-finally-registers-denver-mukamba/",
            "content": "By Sports Reporter\n\nDynamos on Thursday finally registered midfielder Denver Mukamba after a one-month trial.\n\nMukamba becomes the fifth player to be registered by the fading giants, who are currently second from bottom on the log.\n\nMukamba is marking his return to Dynamos since his departure in 2023.\n\nHe last featured for Scottland FC in the Northern Region Division One League last season and was currently unattached to any club this year.\n\nMeanwhile, former Yadah FC coach Thomas Ruzive has been appointed assistant coach at Dynamos.\n\nRuzive will be working with incoming coach Kelvin Kaindu, who is expected to start training the side next week Monday, once his work permit is done.\n\nAccording to inside sources, Ruzive will lead the technical team on Saturday when Dynamos hosts MWOS at RufaroStadium.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/07/25043049/Denver-Mukamba.jpg",
            "description": "<p>By Sports Reporter Dynamos on Thursday finally registered midfielder Denver Mukamba after a one-month trial. Mukamba becomes the fifth player to be registered by the fading giants, who are currently second from bottom on the log. Mukamba is marking his return to Dynamos since his departure in 2023. He last featured for Scottland FC in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sinking-dynamos-finally-registers-denver-mukamba/\">Sinking Dynamos finally registers Denver Mukamba</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:47",
            "date": "02 Aug 2025"
        },
        {
            "title": "Minister Garwe defends government, blames Chitungwiza Municipality for delayed response to Seke Road accident",
            "url": "https://www.newzimbabwe.com/minister-garwe-defends-government-blames-chitungwiza-municipality-for-delayed-response-to-seke-road-accident/",
            "content": "By Darlington Gatsi\n\nLocal Government Minister Daniel Garwe has insisted that the Civil Protection Department responded well and swiftly to the Seke Road accident that claimed 17 lives, despite criticism over the slow emergency response.\n\nSeventeen people died when a haulage truck veered off the road, swerving into the opposite lane and colliding with an oncoming minibus along Seke Road last week.\n\nThe accident exposed the governments weak emergency response mechanisms, with eyewitnesses reporting that many victims died on the accident scene due to the absence of a rescue crane.\n\nResponding to questions in the National Assembly recently, Minister of Local Government and Public Works, Daniel Garwe, defended the governments handling of the tragedy.\n\nThe issue of responsiveness in terms of time taken is subject to the time that the accident is reported to the responsible authority, in this case, the Civil Protection Department.\n\nWe cannot say the Ministry failed to respond timeously. It depends on the time when the incident was reported. I will have to find out the time that was taken to receive the response and the time we went to the site, said Garwe.\n\nHe added:The issue of having cranes on site also depends on how the accident was reported. Maybe people just reported that there was an accident along the Chitungwiza Road at a river bridge without giving the intimate details of how the accident was reported.\n\nSo, we cannot answer that in that regard, it is very difficult, but from the Civil Protection Department side, the Government is doing extremely well. We responded swiftly.\n\nFollowing the horrific crash, the government faced criticism from observers and opposition figures, including Nelson Chamisa, over its lack of preparedness for emergencies.\n\nHowever, Garwe shifted blame onto the Chitungwiza Municipality, accusing it of a delayed response despite being equipped to handle such situations.\n\nAt the Chitungwiza Road accident, the Department of Civil Protection was there first before everybody else and the fire tenders which came from Harare, were also activated by that department.\n\nMadam Speaker, you may want to know that the Government has capacitated all 92 local authorities with firefighting equipment to use in situations such as what happened last week on Friday in Chitungwiza, where a road traffic accident cost the lives of 17 of our citizens.\n\nAll local authorities in the urban areas were equipped with at least two fire tenders each and we wanted to sit down and ask the local authority responsible in Chitungwiza why its reaction was so slow and to ask the city council to come and assist, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/22133122/1000794263-scaled.jpg",
            "description": "<p>By Darlington Gatsi Local Government Minister Daniel Garwe has insisted that the Civil Protection Department responded “well and swiftly” to the Seke Road accident that claimed 17 lives, despite criticism over the slow emergency response. Seventeen people died when a haulage truck veered off the road, swerving into the opposite lane and colliding with an</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/minister-garwe-defends-government-blames-chitungwiza-municipality-for-delayed-response-to-seke-road-accident/\">Minister Garwe defends government, blames Chitungwiza Municipality for delayed response to Seke Road accident</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:47",
            "date": "02 Aug 2025"
        },
        {
            "title": "National Sports Stadium renovations delay as World Cup Qualifiers loom for homeless Warriors",
            "url": "https://www.newzimbabwe.com/national-sports-stadium-renovations-delay-as-world-cup-qualifiers-loom-for-homeless-warriors/",
            "content": "By Darlington Gatsi\n\nGOVERNMENT is racing against time to complete the renovation of the National Sports Stadium, with doubts growing over whether the Zimbabwe national team will play their remaining World Cup qualifiers on home soil.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/08040038/WhatsApp-Image-2025-05-07-at-22.29.25.jpeg",
            "description": "<p>By Darlington Gatsi GOVERNMENT is racing against time to complete the renovation of the National Sports Stadium, with doubts growing over whether the Zimbabwe national team will play their remaining World Cup qualifiers on home soil. The stadium has been undergoing renovations after being deemed unfit to host international matches in 2021 by the Confederation</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/national-sports-stadium-renovations-delay-as-world-cup-qualifiers-loom-for-homeless-warriors/\">National Sports Stadium renovations delay as World Cup Qualifiers loom for homeless Warriors</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:47",
            "date": "02 Aug 2025"
        }
    ]
}