{
    "news": [
        {
            "title": "Zimbabwe records 124 cholera cases amid latest outbreak",
            "url": "https://www.newzimbabwe.com/zimbabwe-records-124-cholera-cases-amid-latest-outbreak/",
            "content": "By Xinhua\n\nZIMBABWE has recorded 124 confirmed cases of cholera since the latest outbreak started in November last year, Minister of Health and Child Care Douglas Mombeshora said on Friday.\n\nAddressing a press conference in the national capital of Harare, Mombeshora said Zimbabwe has registered 15 confirmed deaths, 608 suspected cases, and 566 recoveries.\n\nSix out of the countrys 10 provinces have been affected, with the bulk of recent cases reported in Mashonaland Central Province, the minister noted.\n\nAccording to Mombeshora, most cases were identified among artisanal miners along the Mazowe River and the small farming town of Glendale in Mashonaland Central Province.\n\nArtisanal miners move from place to place and as they move, they also spread cholera. As a result, we have seen the persistence of cases coming up from Mashonaland Central Province, especially along the Mazowe River where a lot of gold panning is taking place, he said.\n\nWe are looking at the possibility of getting more vaccines because our stocks have run out. We now have about 4,000 doses only left, which are not enough to deal with the affected areas, the health minister added.\n\nMombeshora also revealed that recurring cholera outbreaks continued to hit Zimbabwe, primarily driven by a lack of sustainable water and sanitation infrastructure.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/24110127/cholera.webp",
            "description": "<p>By Xinhua ZIMBABWE has recorded 124 confirmed cases of cholera since the latest outbreak started in November last year, Minister of Health and Child Care Douglas Mombeshora said on Friday. Addressing a press conference in the national capital of Harare, Mombeshora said Zimbabwe has registered 15 confirmed deaths, 608 suspected cases, and 566 recoveries. Six</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-records-124-cholera-cases-amid-latest-outbreak/\">Zimbabwe records 124 cholera cases amid latest outbreak</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:39",
            "date": "16 Mar 2025"
        },
        {
            "title": "Juan Mutudza inspires CAPS United to register first victory of the season",
            "url": "https://www.newzimbabwe.com/juan-mutudza-inspires-caps-united-to-register-first-victory-of-the-season/",
            "content": "By Sports Reporter\n\nJUAN Mutudzas first half brace was enough to earn CAPS United three points against Triangle in a match that ended 2-0 at Green Fuel Arena in Chisumbanje Sunday afternoon.\n\nMarking his first league start at Makepeke, Mutudza did not disappoint as he opened the matchs scoring account in the 15th minute before completing his double 11 minutes later.\n\nThe victory was a relief for the Harare giants, who started the season with a 1-1 draw against Green Fuel before losing to Scottland 2-0 last week.\n\nSo happy was CAPS United coach Lloyd Chitembwe after the match that he applauded his boys for a brave show.\n\nIm happy we have gone about our business today, the first two games we faltered and at some point, we needed to win.\n\nIm extremely happy with the way we played especially the first half, of course our second half was not the best, but we knew they were going to come at us, said Chitembwe during post-match interview.\n\nSundays victory saw Makepekepe recording its first clean sheet of the season, at the same time propelling themselves up on the log table to position nine with four points.\n\nOn the other end, the outcome stretched Triangles winless run to three games without a point.\n\nThe Sugar Boys are the only team that have lost all the three games in the league, and they remain bottom on the standing.\n\nMatchday 3 Castle Lager Premier Soccer League Results\n\nScottland 0-1 Ngezi PlatinumDynamos 1-1 Tel OneManica Diamonds 1-0 ZPC KaribaSimba Bhora 1-0 HerentalsGreen Fuel 2-2 HighlandersMWOS 2  0 YadahTriangle 0- 2 CAPS UnitedChicken Inn 1 -1 FC PlatinumKwekwe United 1  0 Bikita Minerals.\n\nScottland 0-1 Ngezi Platinum\n\nDynamos 1-1 Tel One\n\nManica Diamonds 1-0 ZPC Kariba\n\nSimba Bhora 1-0 Herentals\n\nGreen Fuel 2-2 Highlanders\n\nMWOS 2  0 Yadah\n\nTriangle 0- 2 CAPS United\n\nChicken Inn 1 -1 FC Platinum\n\nKwekwe United 1  0 Bikita Minerals.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/07190603/thumbnail_William-Manondo-right-celebrating-after-opening-the-scoring-for-Caps-United-at-the-National-Sports-Stadium-on-Friday.jpeg",
            "description": "<p>By Sports Reporter JUAN Mutudza’s first half brace was enough to earn CAPS United three points against Triangle in a match that ended 2-0 at Green Fuel Arena in Chisumbanje  Sunday afternoon. Marking his first league start at Makepeke, Mutudza did not disappoint as he opened the match’s scoring account in the 15th minute before</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/juan-mutudza-inspires-caps-united-to-register-first-victory-of-the-season/\">Juan Mutudza inspires CAPS United to register first victory of the season</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:39",
            "date": "16 Mar 2025"
        },
        {
            "title": "‘I was duped into leaving London for school in Ghana – but it saved me’",
            "url": "https://www.newzimbabwe.com/i-was-duped-into-leaving-london-for-school-in-ghana-but-it-saved-me/",
            "content": "By Mark Wilberforce l BBC\n\nWHEN my mother told me at the age of 16 that we were going from the UK to Ghana for the summer holidays, I had no reason to doubt her.\n\nIt was just a quick trip, a temporary break  nothing to worry about. Or so I thought.\n\nOne month in, she dropped the bombshell  I was not coming back to London until I had reformed and had earned enough GCSEs to continue my education.\n\nI was hoodwinked in a similar way to the British-Ghanaian teenager who recently took his parents to the High Court in London for sending him to school in Ghana.\n\nIn their defence, they told the judge they did not want to see their 14-year-old son become yet another black teenager stabbed to death in the streets of London.\n\nBack in the mid-1990s, my mother, a primary school teacher, was motivated by similar concerns.\n\nI had been excluded from two high schools in the London Borough of Brent, hanging out with the wrong crowd (becoming the wrong crowd)  and heading down a dangerous path.\n\nMy closest friends at the time ended up in prison for armed robbery. Had I stayed in London, I would have almost certainly been convicted with them.\n\nBut being sent to Ghana also felt like a prison sentence.\n\nI can empathise to a degree with the teenager, who said in his court statement that he feels like he is living in hell.\n\nYet, speaking for myself, by the time I turned 21 I realised what my mother had done had been a blessing.\n\nUnlike the boy at the centre of the London court case  which he lost  I did not go to boarding school in Ghana.\n\nMy mother placed me in the care of her two closest brothers, they wanted to keep an eye on me, and it was felt that being around boarders could prove too much of a distraction.\n\nI first stayed with my Uncle Fiifi, a former UN environmentalist, in a town called Dansoman, near the capital, Accra.\n\nThe lifestyle change hit hard. In London, I had my own bedroom, access to washing machines and a sense of independence  even if I was using it recklessly.\n\nIn Ghana, I was waking up at 05:00 to sweep the courtyard and wash my uncles often muddy pick-up truck and my aunts car.\n\nIt was her vehicle that I would later steal  something of a watershed moment.\n\nI did not even know how to drive properly, treating a manual like an automatic and I crashed it into a high-ranking soldiers Mercedes.\n\nI tried to flee the scene. But that soldier caught me and threatened to take me to Burma Camp, the notorious military base where people had disappeared in the past.\n\nThat was the last truly reckless thing I did. It was not just discipline that I learnt in Ghana  it was perspective. Life in Ghana showed me how much I had taken for granted.\n\nWashing clothes by hand and preparing meals with my aunt made me appreciate the effort needed.\n\nFood, like everything in Ghana, required patience. There were no microwaves, no fast-food runs.\n\nMaking the traditional dough-like dish fufu, for example, is laborious and involves pounding cooked yams or cassava into a paste with a mortar.\n\nAt the time, it felt like punishment. Looking back, it was building resilience.\n\nInitially, my uncles considered placing me in high-end schools like the Ghana International School or SOS-Hermann Gmeiner International College.\n\nBut they were smart. They knew I might just form a new crew to cause chaos and mischief.\n\nInstead, I received private tuition at Accra Academy, a state secondary school that my late father had attended. It meant I was often taught on my own or in small groups.\n\nLessons were in English, but out of school those around me were often speaking local languages and I found it easy to pick them up perhaps because it was such an immersive experience.\n\nBack home in London, I used to love to learn swear words in my mothers Fante language  but was far from fluent.\n\nWhen I later moved to the city of Tema to stay with my favourite uncle, Uncle Jojo  an agricultural expert, I continued private tuition at Tema Secondary School.\n\nIn contrast to the boy making the headlines in the UK, who claimed Ghanas education system was not up to standard, I found it to be exacting.\n\nI was considered academically gifted in the UK, despite my troublesome ways, but actually found it tough going in Ghana. Students my age were far ahead in subjects like maths and science.\n\nThe rigour of the Ghanaian system pushed me to study harder than I ever had in London.\n\nThe result? I earned five GCSEs with grades C and above  something that once seemed impossible.\n\nBeyond academic achievements, Ghanaian society instilled values that have stayed with me for life.\n\nRespect for elders was non-negotiable. Throughout the neighbourhoods I lived in, you greeted those older than you, regardless of whether or not you knew them.\n\nGhana did not just make me more disciplined and respectful  it made me fearless.\n\nFootball played a huge part in that transformation. I played in the parks, which were often hard red clay with loose pebbles and stones, with two square goalposts fashioned out of wood and string.\n\nIt was a far cry from the neatly maintained pitches in England, but it toughened me up in ways I could not have imagined  and it is no wonder some of the greatest footballers seen in the English Premier League have come from West Africa.\n\nOn Sundays children and teenagers flock to Ghanas beaches to play football\n\nThe aggressive style played in Ghana was not just about skill  it was about resilience and endurance. Getting tackled on rough ground meant picking yourself up, dusting yourself off and carrying on.\n\nEvery Sunday, I played football on the beach  though I would often be late because there was absolutely no way either of my uncles would allow me to stay home instead of attending church.\n\nThose services felt like they lasted forever. But it was also a testament to Ghana as a God-fearing nation, where faith is deeply embedded in everyday life.\n\nThe first 18 months were the hardest. I resented the restrictions, the chores, the discipline.\n\nI even tried stealing my passport to fly back to London, but my mother was ahead of me and had hidden it well. There was no escape.\n\nMy only choice was to adapt. Somewhere along the way, I stopped seeing Ghana as a prison and started seeing it as happy home.\n\nI know of a few others like me who were sent back to Ghana by their parents living in London.\n\nMichael Adom was 17 when he arrived in Accra for school in the 1990s, describing his experience as bittersweet. He stayed until he was 23 and now lives back in London working as a probation officer.\n\nHis main complaint was the loneliness  he missed his family and friends. There were times of anger about his situation and the complications of feeling misunderstood.\n\nThis largely stemmed from the fact that his parents had not taught him or his siblings any of the local languages when growing up in London.\n\nI didnt understand Ga. I didnt understand Twi. I didnt understand Pidgin, the 49-year-old tells me.\n\nThis made him feel vulnerable for his first two-and-a-half years  and, he says, liable to being fleeced, for example, by those increasing prices because he seemed foreign.\n\nAnywhere I went, I had to make sure I went with somebody else, he says.\n\nBut he ended up becoming fluent in Twi and, overall, he believes the positives outweighed the negatives: It made me a man.\n\nMy Ghana experience matured me and changed me for the better, by helping me to identify with who I am, as a Ghanaian, and cemented my understanding of my culture, background and family history.\n\nPatience Wilberforce, a primary school teacher, was determined her son should leave school with qualifications\n\nI can concur with this. By my third year, I had fallen in love with the culture and even stayed on for nearly two more years after passing my GCSEs.\n\nI developed a deep appreciation of the local food. Back in London, I never thought twice about what I was eating. But in Ghana, food was not just sustenance  each dish had its own story.\n\nI became obsessed with waakye  a dish made from rice and black-eyed peas, often cooked with millet leaves, giving it a distinctive purple-brown colour. It was usually served with fried plantain, the spicy black pepper sauce shito, boiled eggs, and sometimes even spaghetti or fried fish. It was the ultimate comfort food.\n\nI enjoyed the music, the warmth of the people and the sense of community. I was not just stuck in Ghana any more  I was thriving.\n\nMy mother, Patience Wilberforce, passed away recently, and with her loss I have reflected deeply on the decision she made all those years ago.\n\nShe saved me. Had she not tricked me into staying in Ghana, the chances of me having a criminal record or even serving time in prison would have been extremely high.\n\nI went on to enrol at the College of North West London aged 20 to study media production and communications, before joining BBC Radio 1Xtra via a mentoring scheme.\n\nThe guys I used to hang out with in north-west London did not get the second chance that I did.\n\nGhana reshaped my mindset, my values and my future. It turned a misguided menace into a responsible man.\n\nWhile such an experience might not work for everyone, it gave me the education, discipline and respect I needed to reintegrate into society when I returned to England.\n\nAnd for that, I am forever indebted to my mother, to my uncles and to the country that saved me.\n\nMark Wilberforce is a freelance journalist based in London and Accra.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/16171901/c0204490-0071-11f0-a8b1-950887ddc6e5.jpg.webp",
            "description": "<p>By Mark Wilberforce l BBC  WHEN my mother told me at the age of 16 that we were going from the UK to Ghana for the summer holidays, I had no reason to doubt her. It was just a quick trip, a temporary break – nothing to worry about. Or so I thought. One month</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/i-was-duped-into-leaving-london-for-school-in-ghana-but-it-saved-me/\">‘I was duped into leaving London for school in Ghana – but it saved me’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:39",
            "date": "16 Mar 2025"
        },
        {
            "title": "Musician Nyasha David loses laptop with unreleased music in burglary",
            "url": "https://www.newzimbabwe.com/musician-nyasha-david-loses-laptop-with-unreleased-music-in-burglary/",
            "content": "By Staff Reporter\n\nTHIEVES broke into the home of musician Nyasha David, stealing a laptop with unreleased music along with other valuable items.\n\nThe Ta Ta Ta hit-maker said the break-in happened Saturday, while he was away performing at a concert.\n\nThe artist posted on all his social media platforms pleading with the thieves to return his laptop and hard drives, offering a cash reward.\n\nThieves broke into my house while I was at a show and stole the following. Please direct message me or contact Martin : 0773395000 if they try to sell these things to you\n\nHP Probook G7, Soundcore Rav Neo Speaker, Playstation 4 with 4 Controllers and four games (Tekken 7, FC25, Mortal Kombat 11, God of War), Timberland 79 Boots, black power bank, iPad 5th Gen White locked with Nyasha David I cloud, iPad 2nd Gen Locked with Nyasha David iCloud and two Toshiba 500GB hard drives.\n\nTo the person who stole my stuff, I will pay if you return my laptop and hard drives. The laptop has all my unreleased music, he said.\n\nMeanwhile, the artist released a hit song last month currently holding the second spot on YouTube trending with close to two million views.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/16171228/nyasha-david.jpg",
            "description": "<p>By Staff Reporter THIEVES broke into the home of musician Nyasha David, stealing a laptop with unreleased music along with other valuable items. The Ta Ta Ta hit-maker said the break-in happened Saturday, while he was away performing at a concert. The artist posted on all his social media platforms pleading with the thieves to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/musician-nyasha-david-loses-laptop-with-unreleased-music-in-burglary/\">Musician Nyasha David loses laptop with unreleased music in burglary </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:39",
            "date": "16 Mar 2025"
        },
        {
            "title": "Marvellous Nakamba ruled out of Warriors World Cup Qualifiers, replaced by Ngezi Platinum’s Hachiro",
            "url": "https://www.newzimbabwe.com/marvellous-nakamba-ruled-out-of-warriors-world-cup-qualifiers-replaced-by-ngezi-platinums-hachiro/",
            "content": "By Sports Reporter\n\nAFTER a fine performance Friday against Scottland, Ngezi Platinum Stars midfielder Richard Hachiro has been called up in the Warriors squad to play the upcoming 2026 World Cup Qualifiers.\n\nHe replaces injured captain Marvellous Nakamba.\n\nHachiro is no stranger in the Warriors team as he received more than three call ups last year.\n\nZimbabwe is set to host Benin on Thursday at Moses Mabhidha Stadium in Durban, South Africa before travelling to Nigeria for a clash against the Super Eagles five days later.\n\nAccording to ZIFA, the Warriors captain suffered a recurrence of his calf injury over the weekend and is ruled out for the coming two fixtures.\n\nMeanwhile, the Warriors left the country Sunday afternoon for South Africa ahead of their match against Benin.\n\nThe team is expected to conduct its first training Monday morning although it will have locally-based players only.\n\nForeign players are expected to join camp starting Monday afternoon and the coach is expected to conduct his first training with a full squad Tuesday morning.\n\nZimbabwe is currently bottom of Group C with two points and Michael Nees will be hoping to give the side its first win in the campaign.\n\nThe Warriors started with two draws against Rwanda and Nigeria before losing to Lesotho and South Africa.\n\nGroup C World Cup Qualifiers Standings\n\n1. Rwanda = 7points\n\n2. South Africa = 7 points\n\n3. Benin = 7 points\n\n4. Lesotho = 5 points\n\n5. Nigeria = 3 points\n\n6. Zimbabwe = 2 points\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/02/08072353/Marvelous-Nakamba.jpg",
            "description": "<p>By Sports Reporter  AFTER a fine performance Friday against Scottland, Ngezi Platinum Stars midfielder Richard Hachiro has been called up in the Warriors squad to play the upcoming 2026 World Cup Qualifiers. He replaces injured captain Marvellous Nakamba. Hachiro is no stranger in the Warriors team as he received more than three call ups last</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/marvellous-nakamba-ruled-out-of-warriors-world-cup-qualifiers-replaced-by-ngezi-platinums-hachiro/\">Marvellous Nakamba ruled out of Warriors World Cup Qualifiers, replaced by Ngezi Platinum’s Hachiro </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:39",
            "date": "16 Mar 2025"
        },
        {
            "title": "Voice of America staff put on leave after Trump orders cuts",
            "url": "https://www.newzimbabwe.com/voice-of-america-staff-put-on-leave-after-trump-orders-cuts/",
            "content": "By Reuters\n\nEMPLOYEES at Voice of America were placed on paid leave on Saturday and funding for two U.S. news services that broadcast to authoritarian regimes was slashed, one day after President Donald Trump signed an executive order gutting the government-funded media outlets parent and six other federal agencies.\n\nMultiple workers at Voice of America, an international media broadcaster that operates in more than 40 languages, shared with Reuters an email that placed them on administrative leave with full pay and benefits until otherwise notified.\n\nThe emails, sent by a human resources executive at the U.S. Agency for Global Media, the VOAs parent agency, instructed them not to enter their work premises or access internal systems.\n\nIt was not immediately clear how many employees were placed on leave.\n\nThe U.S. Agency for Global Media (USAGM) also terminated funding for Radio Free Europe/Radio Liberty, which broadcasts to countries in Eastern Europe, including Russia and Ukraine, as well as for Radio Free Asia, which broadcasts to China and North Korea, according to letters seen by Reuters.\n\nOn its website, Radio Free Europe/Radio Liberty notes that it has been declared an undesirable organization by the Russian government and warns readers in Russia and Russia-occupied Ukraine that they could face fines or imprisonment for sharing, liking, commenting on, or saving our content, or for contacting us.\n\nThe move follows Trump signing an executive order on Friday instructing USAGM and six other little-known agencies to reduce their operations to the bare minimum mandated by the law, saying it was necessary to shrink bureaucracy.\n\nTrump, who clashed with the Voice of America during his first term, picked former news anchor Kari Lake to be its director for his second term. Lake, a staunch ally of the president, has often accused mainstream media of harboring anti-Trump bias.\n\nIn a message on the social media platform X on Saturday, Lake said Trumps order impacted USAGM and its outlets VOA and OCB, referring to the Office of Cuba Broadcasting. She told employees of the agency to check their emails immediately.\n\nFree press advocates critical\n\nThe president of the National Press Club in Washington, Mike Balsamo, released a statement on social media objecting to the moves at Voice of America.\n\nFor decades, Voice of America has delivered fact-based, independent journalism to audiences worldwide, often in places where press freedom does not exist, Balsamo said.\n\nThe decision, he said, undermines Americas commitment to a free and independent press.\n\nThe Paris-based Reporters Without Borders also blasted the move, with its director general, Thibaut Bruttin, saying that it threatens press freedom worldwide and negates 80 years of American history in supporting a free flow of information.\n\nSome Republicans have accused VOA and other publicly-funded media outlets of being biased against conservatives. Last month, billionaire Elon Musk, who is spearheading Trumps government downsizing effort, called for VOA and Radio Free Europe/Radio Liberty to be shut down in a post to his X social media platform.\n\nIn a speech at the Conservative Political Action Conference, Lake said that while she understood calls to completely dismantle VOA, she believed it could be improved.\n\nIn addition to USAGM, Trumps order also targeted the Federal Mediation and Conciliation Service, the Woodrow Wilson International Center for Scholars, the Institute of Museum and Library Services, the U.S. Interagency Council on Homelessness, the Community Development Financial Institutions Fund, and the Minority Business Development Agency for cuts.\n\nThe order said those agencies should eliminate all operations not codified in statute as well as reduce the performance of their statutory functions and associated personnel to the minimum presence and function required by law.\n\nSo far, Musks Department of Government Efficiency has produced potential cuts of more than 100,000 jobs across the 2.3 million-member federal civilian workforce, the freezing of foreign aid, and the cancellation of thousands of programs and contracts.\n\nOn Friday, several DOGE employees arrived at the United States Institute of Peace, accompanied by two FBI agents, according to Gonzo Gallegos, the institutes communications director. They left after a brief discussion about the institutes status.\n\nThe institute is not part of the federal executive branch, but is instead an independent, non-profit agency that was established by Congress in 1984.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/16092246/106802388-1606321114188-AP20195132368014.jpg",
            "description": "<p>By Reuters EMPLOYEES at Voice of America were placed on paid leave on Saturday and funding for two U.S. news services that broadcast to authoritarian regimes was slashed, one day after President Donald Trump signed an executive order gutting the government-funded media outlets’ parent and six other federal agencies. Multiple workers at Voice of America,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/voice-of-america-staff-put-on-leave-after-trump-orders-cuts/\">Voice of America staff put on leave after Trump orders cuts</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:39",
            "date": "16 Mar 2025"
        },
        {
            "title": "Eastern Region Division One League Pacific Storm sponsorship deal launch set for month-end",
            "url": "https://www.newzimbabwe.com/eastern-region-division-one-league-pacific-storm-sponsorship-deal-launch-set-for-month-end/",
            "content": "By Staff Reporter\n\nDETAILS of the Zimbabwe Football Association (ZIFA) Eastern Region Division One Leagues Pacific Storm sponsorship will be shared on March 29 at Mucheke Stadium in Masvingo, NewZimbabwe.com has learnt.\n\nDespite having confirmed the deal, the Eastern Region administration is yet to share details on prize money and how much will be set aside for the leagues marketing.\n\nThis will be the first title sponsor of the regional league that stretches from Marondera, the whole breadth of Manicaland and Masvingo provinces.\n\nThe launch has been set for March 29 in Masvingo and that is where details will be officially divulged, said a source close to developments.\n\nWithout confirming the event, Eastern Region Soccer League Chairperson Wisdom Simba said: This is a monumental step for us as the deal will also focus, beyond the core package, on branding and marketing of the league. We cannot currently share details of its worth.\n\nPacific Storm Marketing Manager Kudakwashe Chiutsi said the sponsorship was part of their corporate social responsibility (CSR) and a continuation of the organisations longstanding support for local football.\n\nMuch recently, the cigarette brand was principal sponsor of 2024 Castle Lager premiership champions Simba Bhora where it poured in half a million US dollars.\n\nIn the mid-2000s, Pacific Storm financed Zimbabwean giants Dynamos and Highlanders in a deal that was in the tens of millions, then in Zimbabwean dollars.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/18033126/football_net.jpg",
            "description": "<p>By Staff Reporter DETAILS of the Zimbabwe Football Association (ZIFA) Eastern Region Division One League’s Pacific Storm sponsorship will be shared on March 29 at Mucheke Stadium in Masvingo, NewZimbabwe.com has learnt. Despite having confirmed the deal, the Eastern Region administration is yet to share details on prize money and how much will be set</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/eastern-region-division-one-league-pacific-storm-sponsorship-deal-launch-set-for-month-end/\">Eastern Region Division One League Pacific Storm sponsorship deal launch set for month-end</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:39",
            "date": "16 Mar 2025"
        },
        {
            "title": "Women’s lobby group petitions Parliament over lapsed National Gender Policy",
            "url": "https://www.newzimbabwe.com/womens-lobby-group-petitions-parliament-over-lapsed-national-gender-policy/",
            "content": "By Alois Vinga\n\nTHE Economic Justice for Womens Project (EJWP) has petitioned Parliament on the need to enact a relevant National Gender Policy following the expiry of the previous blueprint back in 2022.\n\nThe policy is a government framework that outlines strategies and actions to achieve gender equality and equity, ensuring that both men and women benefit equally from development and participate fully in all aspects of society.\n\nAfter its lapse in 2022, Zimbabwe has not yet enacted another policy blueprint to dictate the way forward in attaining gender-based goals for the country.\n\nSpeaking to NewZimbabwe.com shortly after filing a petition at the Parliament of Zimbabwe, EJWP Executive Director, Margaret Mutsamvi said the gender policy is an important instrument for promoting gender equality in all spheres of society to include employment, health, education and political representation.\n\nAt the moment so many strategies, Bills and policies are being developed and without incorporating the gender policy, may overlook the significance of being gender- responsive and inclusive meaning women are missing out on the ongoing development gains since its expiration. See why its urgent? she said.\n\nShe noted that petitioning Parliament was inspired by the realisation that they are the lawmakers with the mandate to propose, draft or vote for laws with authority to summon hearings, investigate issues and monitor the full implementation of laws and the respective financing of such.\n\nMutsamvi said parliamentary officials, who received the petition on behalf of the Clerk of Parliament said we would get a response on the matter in three weeks.\n\nIn the meantime, we are having a parallel online campaign, building awareness amongst other women groups on why the gender policy is key in our everyday work in empowering women and towards gender justice.\n\nAs we celebrate the Womens Month, at every opportunity we get, we highlight why the gender policy is critical at the moment and the opportunity costs. We primarily seek to engage all relevant stakeholders through any means to push for this urgent request, added Mutsamvi.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/16025444/Margaret-Mutsamvi.webp",
            "description": "<p>By Alois Vinga THE Economic Justice for Women’s Project (EJWP) has petitioned Parliament on the need to enact a relevant National Gender Policy following the expiry of the previous blueprint back in 2022. The policy is a government framework that outlines strategies and actions to achieve gender equality and equity, ensuring that both men and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/womens-lobby-group-petitions-parliament-over-lapsed-national-gender-policy/\">Women’s lobby group petitions Parliament over lapsed National Gender Policy</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:39",
            "date": "16 Mar 2025"
        },
        {
            "title": "Expelled SA Ambassador to the United States Ebrahim Rasool given 72 hours to leave",
            "url": "https://www.newzimbabwe.com/expelled-sa-ambassador-to-the-us-ebrahim-rasool-given-72-hours-to-leave/",
            "content": "By News24\n\nTHE US has given the expelled Ambassador to the United States, Ebrahim Rasool, 72 hours to leave.\n\nRasool was expelled on Friday following comments he made during a webinar.\n\nPretoria is making arrangements for his return as well as appointing a replacement.\n\nChrispin Phiri, spokesperson for International Relations and Cooperation Minister Ronald Lamola, confirmed to News24 that Pretoria was arranging to have him back very soon.\n\nOnce in South Africa, Rasool will be expected to debrief Pretoria.\n\nPhiri said Pretoria had received official confirmation from the SA mission in the US late on Friday night that Rasool had been expelled.\n\nRasool, who returned to Washington as SAs ambassador in December, was expelled by US Secretary of State Marco Rubio.\n\nRasool had also previously served as US ambassador from 2010 to 2015, when Barack Obama was the president.\n\nRubio wrote in a post on X that Rasool is no longer welcome in our great country, and that the US now considers him persona non grata.\n\nRasools expulsion stemmed from comments he made while addressing a webinar facilitated by the think-tank, Mapungubwe Institute for Strategic Reflection.\n\nAmong other things, he accused US President Donald Trumps administration of supremacism.\n\nSpeaking to News24 on Saturday, Phiri said: Ambassador Rasool has 72 hours to leave the United States and hence we are facilitating his return.\n\nHe added: And then, from there, Pretoria will assess the next steps that need to be done and attend to replace him.\n\nPhiri said Rasools expulsion was regrettable as there had been positive developments between the two countries  and the process to expel him had, to some extent, scuttled those.\n\nNonetheless, we are determined to ensure that our relationship with the United States not only remains mutually respectful, but mutually beneficial.\n\nSo ensuring that we have a very capable and able replacement for our Ambassador Rasool is critical And also with someone who carries the full authority of the South African government, he said, adding that it was important for Pretoria to ensure it continued engagements with Washington.\n\nHe also said the correct diplomatic channel would have been for the US to rather have Rasool understand the context in which he made his remarks at the webinar before making any decision. However, the US chose not to follow that process.\n\nTheyve gone through another process rather than just declaring our Ambassador PNG [persona non grata]. So thats the route that they have chosen, and we will have to respect the decision as a sovereign state, said Phiri.\n\nMeanwhile, speaking to the SABC on Saturday, Lamola said the expulsion of Rasool was an unprecedented, regrettable decision by the US as it was not done via normal diplomatic relations.\n\nIt is also regrettable because he was at a very advanced stage to prepare for the special envoys, to reset the relations and so forth. But we are now where we are we have to work with what we have, and that is what we will continue to do because we believe the relationship between the two countries is mutually beneficial, it is strategic, and it has to be maintained.\n\nLamola added: We need to find time to engage with each other behind closed doors, where the US can raise their concerns with us, and we can also raise our concerns with them because it is not helpful to engage in megaphone and Twitter diplomacy. But we have to engage each other face-to-face on various issues of mutual concern.\n\nHe said South Africa would continue to engage and open the lines of diplomatic engagements with the US.\n\nLamola said it was unfortunate the Trump administration had taken the route of engaging in tweets, adding that this was not helpful in mending the relationship.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/16024317/b5797c971e4a4dcf902615151673150c.jpg",
            "description": "<p>By News24 THE US has given the expelled Ambassador to the United States, Ebrahim Rasool, 72 hours to leave. Rasool was expelled on Friday following comments he made during a webinar. Pretoria is making arrangements for his return as well as appointing a replacement. Chrispin Phiri, spokesperson for International Relations and Cooperation Minister Ronald Lamola,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/expelled-sa-ambassador-to-the-us-ebrahim-rasool-given-72-hours-to-leave/\">Expelled SA Ambassador to the United States Ebrahim Rasool given 72 hours to leave</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:39",
            "date": "16 Mar 2025"
        },
        {
            "title": "‘Zimbabwe’s maternal, neonatal deaths unacceptably high’, says Health and Child Care official",
            "url": "https://www.newzimbabwe.com/zimbabwes-maternal-neonatal-deaths-unacceptably-high-says-health-and-child-care-official/",
            "content": "By Thandiwe Garusa\n\nZIMBABWEs pregnant women and newborn babies remain at risk as the country is grappling with unacceptably high maternal and neonatal deaths, Health and Child Care minister has revealed.\n\nThis is expected to get worse as international donors like the UKAID, which helps over two million women and babies access essential maternal and neonatal healthcare, recently announced a significant budget cut to its international assistance.\n\nThe countrys health sector is generally poorly funded and relies heavily on the benevolence of Western development partners.\n\nAddressing a press conference Friday on his ministrys achievements, Health and Child Care Minister Douglas Mombeshora revealed that despite a notable reduction in under five mortality rate institutional maternal and neonatal deaths remain high.\n\nMombeshora did not share the statistics related to the neonatal and maternal deaths.\n\nThe life expectancy at birth increased from 61 years to an average of 65 and to as high as 68 years for women.\n\nMaternal and under five mortality rates have been on a declining trend since 2010. For instance, the maternal mortality declined from 525 maternal deaths per 100,000 live births in 2012 to 363/100,000 live births in 2022 according to the Zimbabwe Population Census Report.\n\nThe under-five mortality rate decreased to 39.8 deaths per 1,000 live births. However, institutional maternal and neonatal deaths are still unacceptably high, Mombeshora said.\n\nRecently, the deputy Minister of Health and Childcare, Sleiman Kwidini, told Parliament that nearly 300 infants and 54 women died due to complications during childbirth in January 2025 alone.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/14204714/Pregnant.jpg",
            "description": "<p>By Thandiwe Garusa ZIMBABWE’s pregnant women and newborn babies remain at risk as the country is grappling with unacceptably high maternal and neonatal deaths, Health and Child Care minister has revealed. This is expected to get worse as international donors like the UKAID, which helps over two million women and babies access essential maternal and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-maternal-neonatal-deaths-unacceptably-high-says-health-and-child-care-official/\">‘Zimbabwe’s maternal, neonatal deaths unacceptably high’, says Health and Child Care official</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:39",
            "date": "16 Mar 2025"
        }
    ]
}