{
    "news": [
        {
            "title": "National Sports Stadium renovations delay as World Cup Qualifiers loom for homeless Warriors",
            "url": "https://www.newzimbabwe.com/national-sports-stadium-renovations-delay-as-world-cup-qualifiers-loom-for-homeless-warriors/",
            "content": "By Darlington Gatsi\n\nGOVERNMENT is racing against time to complete the renovation of the National Sports Stadium, with doubts growing over whether the Zimbabwe national team will play their remaining World Cup qualifiers on home soil.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/08040038/WhatsApp-Image-2025-05-07-at-22.29.25.jpeg",
            "description": "<p>By Darlington Gatsi GOVERNMENT is racing against time to complete the renovation of the National Sports Stadium, with doubts growing over whether the Zimbabwe national team will play their remaining World Cup qualifiers on home soil. The stadium has been undergoing renovations after being deemed unfit to host international matches in 2021 by the Confederation</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/national-sports-stadium-renovations-delay-as-world-cup-qualifiers-loom-for-homeless-warriors/\">National Sports Stadium renovations delay as World Cup Qualifiers loom for homeless Warriors</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:43",
            "date": "01 Aug 2025"
        },
        {
            "title": "Diaspora remittances rise to US$635.2 million",
            "url": "https://www.newzimbabwe.com/diaspora-remittances-rise-to-us635-2-million/",
            "content": "By Alois Vinga\n\nDIASPORA remittances rose to US$635.2 million in the years first half, signalling a 7.1% increase compared to the same period last year.\n\nPresenting the Mid-term Budget Review Thursday, Finance Minister Mthuli Ncube said the revenue category performed fairly well.\n\nRemittances increased by 7,1%, from US$593.2 million in the first quarter of 2024 to US$635.2 million in 2025. The remittances have had a favourable impact on the current account balance.\n\nTo year end, remittances are projected to increase by 4.9% from US$2.6 billion in 2024 to US$2.7 billion in 2025, sustaining a positive current account balance. Given the strategic importance of the diaspora community, the Government seeks to strengthen their role in the development of the country, he said.\n\nNcube said the government is finalising the formulation of the Diaspora Policy, which will outline measures to promote remittances at a minimum cost and give guidelines on various investment initiatives.\n\nDuring the period, direct investment inflows were estimated at US$184,9 million in the first quarter of 2025, up from US$103,5 million recorded in the corresponding quarter of 2024.\n\nThe inflows were mainly in the form of capital equipment, predominantly directed towards the mining and manufacturing sectors.\n\nDuring the quarter, 207 new investment licenses were issued, marking a 44.8% increase compared to the corresponding period in 2024.\n\nThe successful launch of ZIDAs digital investment license issuance system is anticipated to streamline processes, thereby enhancing investor confidence and operational efficiency.\n\nDirect investment inflows are projected to grow to over US$600 million in 2025, with the major recipients being the energy, mining and manufacturing sectors.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/13025414/Diaspora-Remittances.png",
            "description": "<p>By Alois Vinga DIASPORA remittances rose to US$635.2 million in the year’s first half, signalling a 7.1% increase compared to the same period last year. Presenting the Mid-term Budget Review Thursday, Finance Minister Mthuli Ncube said the revenue category performed fairly well. “Remittances increased by 7,1%, from US$593.2 million in the first quarter of 2024</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/diaspora-remittances-rise-to-us635-2-million/\">Diaspora remittances rise to US$635.2 million</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:43",
            "date": "01 Aug 2025"
        },
        {
            "title": "Polokwane Mayor defends merit-based appointment of Zimbabwean engineer Kennedy Chihota amid public backlash",
            "url": "https://www.newzimbabwe.com/polokwane-mayor-defends-merit-based-appointment-of-zimbabwean-engineer-kennedy-chihota-amid-public-backlash/",
            "content": "CentralNewsZA\n\nPolokwane Mayor John Mpe defends merit-based appointment of Zimbabwean engineer Kennedy Chihota amid public backlash, insisting the decision prioritises skills to tackle water challenges rather than politics or nationality.\n\nIn a media briefing held at Peter Mokaba Stadium on Thursday, Mayor John Mpe addressed growing criticism over the recent council approval of Kennedy Chihota, a Zimbabwean national, as the new Director of Water and Sanitation at Polokwane Municipality. Mpe stressed that the choice was driven by Chihotas strong qualifications and experience, which he believes will help fix long-standing water shortages and infrastructure issues in the city.\n\nChihota is a professionally registered engineer (ECSA) and holds: a Bachelors Degree in Civil Engineering (University of Zimbabwe), Mpe said, highlighting the engineers academic background. He added that Chihota also has Four Masters Degrees in: Water Resources Engineering & Management (University of Zimbabwe), Business Administration (University of Zimbabwe), Property Development (University of the Witwatersrand), and Engineering (University of Stellenbosch).\n\nThis defence comes after widespread public outcry on social media and in local communities, where some residents accused the municipality of favouring foreign nationals over South Africans amid high unemployment rates. The appointment has sparked debates about job opportunities for locals, especially in a province like Limpopo where water access remains a daily struggle for many.\n\nChihotas Qualifications and Experience Under the Spotlight\n\nMpe went into detail about why Chihota stood out during the selection process. He described the new director as a seasoned professional with over 20 years in water systems management, mostly in South African municipalities. He brings experience from: University of Limpopo (Senior Lecturer), Capricorn District Municipality (PMU Manager, Water Services Manager, and Senior Manager for Infrastructure), City of Cape Town, Johannesburg Water, and City of Ekurhuleni, Managing Director at Ekurhuleni Water Care Company, the mayor explained. Mpe made it clear that with such a track record, the municipality is not experimenting but executing on its plans to improve services.\n\nChihotas role is seen as key in dealing with Polokwanes water backlogs, which have left some areas without reliable supply for years. The city has faced ongoing problems like ageing pipes, leaks, and unequal distribution, made worse by rapid urban growth. Residents in townships often rely on communal taps or tankers, while rural parts battle droughts. Mpe argued that Chihotas expertise in water resources and infrastructure will speed up fixes, including upgrades to dams, treatment plants, and distribution networks. Supporters on social media have echoed this, with one user praising him as a seasoned engineer who has spent 20 years serving mostly municipality water systems, hoping for flowing taps of clean water.\n\nHowever, critics question if local talent was overlooked. Opposition parties like the Economic Freedom Fighters (EFF) and Democratic Alliance (DA) have called for transparency in the hiring process, pointing to thousands of unemployed South African engineers. They argue that while merit matters, the government should prioritise citizens in public jobs to fight poverty and build skills at home.\n\nBacklash Linked to Broader Allegations of Favouritism\n\nThe controversy around Chihotas appointment has been fuelled by recent claims that Polokwane Municipality awards tenders to foreign nationals, which Mpe confirmed but defended as merit-based. Just days before, explosive allegations surfaced about a R56 million tender for water infrastructure reportedly given to a company owned by the municipal manager Thuso Nemugumonis alleged Zimbabwean boyfriend. The deal, worth R56,309,901.35, involved supply and maintenance work, but opposition groups labelled it as nepotism and corruption. Mpe has denied any wrongdoing, calling the claims a smear campaign aimed at damaging the municipalitys image.\n\nSocial media has been ablaze with mixed views. Some posts slam the hire as spitting on the faces of voters, with one user noting qualified South African youth are overlooked while foreigners get top posts. Others defend it, saying, Zimbabweans are doing great and serving our communities well. The backlash has hints of xenophobia, with calls to put South Africans first amid economic hardships. Community groups worry this could strain relations with migrant workers who contribute to Limpopos economy in farming and services.\n\nNew Chief Operations Officer Appointed to Strengthen Leadership\n\nIn the same council meeting, Polokwane also named Babalwa Mosomane as the new Chief Operations Officer (COO), a move Mpe hailed as another step to boost efficiency. Mosomane brings a wealth of auditing and management skills to the role. She holds Postgraduate Diplomas in Forensic Auditing and Internal Auditing from UNISA, along with B-Tech and National Diplomas in Internal Auditing from Nelson Mandela Metropolitan University. Her other qualifications include the Municipal Finance Management Programme and Programme in Management Development from Wits Business School.\n\nMosomane is a certified internal audit practitioner, certified ethics practitioner, and a qualified quality assessor, accredited by the relevant professional bodies. Mpe said her expertise will help tighten controls on spending and fight corruption, especially after recent tender troubles. Her appointment has received less criticism, with many seeing it as a positive for good governance in the municipality.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/31195725/KENNEDY-CHIHOTA.webp",
            "description": "<p>CentralNewsZA Polokwane Mayor John Mpe defends merit-based appointment of Zimbabwean engineer Kennedy Chihota amid public backlash, insisting the decision prioritises skills to tackle water challenges rather than politics or nationality. In a media briefing held at Peter Mokaba Stadium on Thursday, Mayor John Mpe addressed growing criticism over the recent council approval of Kennedy Chihota,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/polokwane-mayor-defends-merit-based-appointment-of-zimbabwean-engineer-kennedy-chihota-amid-public-backlash/\">Polokwane Mayor defends merit-based appointment of Zimbabwean engineer Kennedy Chihota amid public backlash</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:43",
            "date": "01 Aug 2025"
        },
        {
            "title": "AzamTV secures CHAN 2024 broadcast rights",
            "url": "https://www.newzimbabwe.com/azamtv-secures-chan-2024-broadcast-rights/",
            "content": "By Sports Reporter\n\nAzamTV has secured exclusive broadcast rights for the upcoming TotalEnergies CAF African Nations Championship (CHAN) 2024.\n\nThe CHAN tournament exclusively features players from domestic leagues. It will run from2 to 30 Augustco-hosted by Uganda and Kenya.\n\nIn addition to CHAN 2024, AzamTV subscribers will also enjoy an impressive lineup of international football leagues and competitions,includingthe Italian Serie A, German Bundesliga, Spanish La Liga, Carabao Cup (England), Saudi Pro League, and the Barclays Womens Super League.\n\nAzamTV has secured broadcast rights for the TotalEnergies African Nations Championship (CHAN) 2024 games. This partnership underscores our dedication to provide the best sporting entertainment to our audience. The tournament will run from 2-30 August 2025.\n\nSubscribers can also watch Serie A; Bundesliga; La Liga; Carabao Cup; Saudi Pro League, and the Barclays Womens Super League, reads a statement released by AzamTV.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/15075337/chan.jpg",
            "description": "<p>By Sports Reporter AzamTV has secured exclusive broadcast rights for the upcoming TotalEnergies CAF African Nations Championship (CHAN) 2024. The CHAN tournament exclusively features players from domestic leagues. It  will run from 2 to 30 August co-hosted by Uganda and Kenya. In addition to CHAN 2024, AzamTV subscribers will also enjoy an impressive lineup of international football</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/azamtv-secures-chan-2024-broadcast-rights/\">AzamTV secures CHAN 2024 broadcast rights</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:43",
            "date": "01 Aug 2025"
        }
    ]
}