{
    "news": [
        {
            "title": "Lady Sables leave for Rugby Africa Division One Women’s Cup",
            "url": "https://www.newzimbabwe.com/lady-sables-leave-for-rugby-africa-division-one-womens-cup/",
            "content": "By Sports Reporter\n\nZimbabwe senior womens rugby team, Tuesday left the country for the Ivory Coast, where they will compete in the Rugby Africa Division One Womens Cup.\n\nThe competition, set to take place from April 9 to 20and will see Zimbabwe competing against Uganda, Tunisia, and hosts Ivory Coast.\n\nThe winner of the tournament will earn a coveted spot in the Rugby Africa Cup alongside South Africa, Kenya, and Madagascar.\n\nLady Sables captain Sikhumbuzo Muchenje, said the team is ready to deliver a positive result.\n\nWe appreciate the support we got in our preparations for the tournament, especially the work put in by our coaches and sponsors, said Muchenje before departure.\n\nShe added, We have three matches in the next ten days and we believe in ourselves as a team despite having a short time to prepare.\n\nWe are coming into this tournament rated as the underdogs, but that is not deterring our spirits because we want to come home with something for Zimbabweans to cheer about.\n\nZimbabwe kicks off the tournament on April 11 against hosts Cte dIvoire in their opening match before playing Tunisia on April 15 and wraps up their group fixtures with a showdown against Uganda on April 19.\n\nWith a strong squad featuring the likes of Mabel Marungweni, Mercy Runesu, Rutendo Morosi, and Cleopatra Kadimu, the Lady Sables are looking to build momentum and make a lasting impression in San Pedro.\n\nLady Sables Full Squad:\n\nVimbai Dewa (Vice Captain), Skhumbuzo Muchenje (Captain), Mbalehle Mzizi, Mabel Marungweni, Tariro Nyamudeza, Patience Harubereki, Mercy Runesu, Gabriella Chawatama, Rutendo Morosi, Fadzai Mandizha, Erika Mack, Natalia Nyabinde, Wadzanai Chidawa, Hazel Njaya, Chiwaniso Mabika, Tanaka Mutaramutswa, Simphiwe Gumbo, Ropafadzo Muzanechita, Kudzai Wasili, Tarren Munodaani (Vice Captain), Memory Moyo, Nokutenda Shoriwa, Cleopatra Kadimu, Pauline Sianga, Rufaro Tagarira, Ruvimbo Mudyanadzo, Lovelight Fusire, Kudzanai Chirinda.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/09060434/IMG-20250408-WA0035.jpg",
            "description": "<p>By Sports Reporter Zimbabwe senior women’s rugby team, Tuesday left the country for the Ivory Coast, where they will compete in the Rugby Africa Division One  Women’s Cup. The competition, set to take place from April 9 to 20 and will see Zimbabwe competing against Uganda, Tunisia, and hosts Ivory Coast. The winner of the tournament</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/lady-sables-leave-for-rugby-africa-division-one-womens-cup/\">Lady Sables leave for Rugby Africa Division One Women’s Cup</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:29",
            "date": "09 Apr 2025"
        },
        {
            "title": "Mnangagwa’s legitimacy challenger Musengezi arrested, press conference disrupted",
            "url": "https://www.newzimbabwe.com/mnangagwas-legitimacy-challenger-musengezi-arrested-press-conference-disrupted/",
            "content": "By Staff Reporter\n\nDISGRUNTLED Zanu PF activist Sybeth Musengezi was arrested and taken into custody Tuesday after two unidentified men, posing as vendors, violently disrupted his press conference.\n\nMusengezi was about to begin addressing the media when the masked men stormed the venue and grabbed his notes, throwing the event into chaos.\n\nThe men concealed their identities using face masks, hats, and reflective bibs.\n\nThis is not how you do it, Musengezi said as he attempted to remove one of the mens masks.\n\nShortly after the disruption, officers from the Zimbabwe Republic Police arrived at the scene, arrested Musengezi and took him into custody.\n\nThe charges against him remain unclear but Musengezi has previously clashed with Zanu PF leadership when he challenged Mnangagwas presidency.\n\nHe argued Mnangagwawas not thelegitimate leader of the ruling Zanu PF party claiming that he was not properly elected in 2017 through a central committee meeting orchestrated by unknown individuals during the 2017 military coup that ousted Robert Mugabe.\n\nFormer Zanu PF activist Sybeth Musengezi, who previously contested President Emmerson Mnangagwa's rise to power in court, has been arrested at the Harare Media Center shortly after two individuals posing as vendors interrupted his press conference and seized his speech before hepic.twitter.com/1D06gXBoxm\n\n NewZimbabwe.com (@NewZimbabweCom)April 8, 2025\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/21165521/Musengezi-Sybeth.png",
            "description": "<p>By Staff Reporter DISGRUNTLED Zanu PF activist Sybeth Musengezi was arrested and taken into custody Tuesday after two unidentified men, posing as vendors, violently disrupted his press conference. Musengezi was about to begin addressing the media when the masked men stormed the venue and grabbed his notes, throwing the event into chaos. The men concealed</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwas-legitimacy-challenger-musengezi-arrested-press-conference-disrupted/\">Mnangagwa’s legitimacy challenger Musengezi arrested, press conference disrupted</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:29",
            "date": "09 Apr 2025"
        },
        {
            "title": "NPA declines to prosecute Manicaland man accused of insulting Mnangagwa",
            "url": "https://www.newzimbabwe.com/npa-declines-to-prosecute-manicaland-man-accused-of-insulting-mnangagwa/",
            "content": "By Staff Reporter\n\nThe National Prosecuting Authority ( NPA) has declined to prosecute a Manicaland man who was accused of insulting President Emmerson Mnangagwa, stating that change was coming on March 31 2025.\n\nAlfred Ngonidzashe Machakaire who was represented by Leonard Chigadza of the Zimbabwe Lawyers for Human Rights (ZLHR) had spent 36 days in custody.\n\nHe was accused of undermining the authority of the President.\n\nThe NPA declined his prosecution for lack of criminality.\n\nAccording to prosecutors, Machakaire undermined authority of and insulted President Mnangagwa when he was involved in a verbal altercation with Leonard Chidemo, the ruling ZANU PF political party Councillor for Ward 5 in Makoni North constituency in Makoni District in Manicaland, who was drinking beer at Mugadza Bottle Store at Runyange Business Centre in Chendambuya, where he allegedly asked Chidemo to buy him some beer.\n\nChidemo reportedly told Machakaire that he did not have some money to buy him beer and this did not go down well with him and he started shouting at the ZANU PF political party Councillor, said the ZLHR.\n\nIt was alleged that he uttered the following words; You Chidemo, down with Mnangagwa, I am Geza, on the 31st, the country will be fine, Mnangagwa is a vagina, you have caused the death of people in the country.\n\nAccording to prosecutors, Machakaire acted unlawfully when he allegedly uttered the insulting words and also praised Geza, a veteran of the liberation war and a ZANU PF political party central committee member, who was recently expelled from the ruling political party, after opposing manoeuvres to amend the Constitution and extend President Emmerson Mnangagwas tenure beyond two terms.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/08/14051558/zdf-Mnangagwa-0.jpeg",
            "description": "<p>By Staff Reporter The National Prosecuting Authority ( NPA) has declined to prosecute a Manicaland man who was accused of insulting President Emmerson Mnangagwa, stating that change was coming on March 31 2025. Alfred Ngonidzashe Machakaire who was represented by Leonard Chigadza of the Zimbabwe Lawyers for Human Rights (ZLHR) had spent 36 days in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/npa-declines-to-prosecute-manicaland-man-accused-of-insulting-mnangagwa/\">NPA declines to prosecute Manicaland man accused of insulting Mnangagwa   </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:29",
            "date": "09 Apr 2025"
        },
        {
            "title": "Dorcas Moyo opens up about cyberbullying nightmare, says “it was not an easy period”",
            "url": "https://www.newzimbabwe.com/dorcas-moyo-opens-up-about-cyberbullying-nightmare-says-it-was-not-an-easy-period/",
            "content": "By Darlington Gatsi\n\nDORCAS Moyo is having the last laugh and it is the loudest.\n\nMoyos fortitude was tested when she was dragged on social media late last month after posting the opening lyrics of her song Hakotsire.\n\nRanganai henyu asi zvichakona was lost in translation amid a boiling political pot on the eve of protests fronted by war veteran Blessed Geza.\n\nMoyo became a figure of ridicule and a victim of the political polarity embedded in society, facing vitriolic attacks.\n\nIn an interview withNewZimbabwe.com, Moyo said the period was draining for her.\n\nIt was not easy to take. It was not an easy period. The only solace was that for every devilish dart aimed at me, there were ten in support. I received enormous support from the people around me.\n\nMy manager was always there, my family was fervently praying, my producer made melodies to soothe me. Clergymen, pastors, friends, government officialsyou name itall these people made the arduous journey traversable, said Moyo.\n\nThe award-winning gospel artist is no stranger to criticism, as it has been synonymous with her career.\n\nThe reproval over her voice projection has overshadowed the talent and lyrical depth her music carries.\n\nHowever, Moyo says she looks beyond criticism, focusing mainly on her craft.\n\nWhat doesnt kill you surely makes you stronger. Everyone is entitled to their opinion, and I respect that. I may not know the recipe for success, but surely the recipe for demise is trying to please everyone.\n\nThe few who appreciate my art are the most important, and I will continue to work to please them. Criticism is part of every living organism; as such, we must accept it, be it painful or constructive. That will make you a better person, she said.\n\nMoyos sorrow has been turned into dancing, with the musician being gifted a Toyota Fortuner by controversial businessman Wicknell Chivayo.\n\nChivayo said the gift was compensation for the humiliation she endured, along with an additional US$20,000 on top of the vehicle.\n\nRANGANAI HENYU, ASI ZVICHAKONAwhat was supposed to be a VERY BEAUTIFUL song, boldening our FAITH in God and affirming that whatever the DEVIL plots will NOT succeed, was unnecessarily turned POLITICAL. It spiraled into HATEFUL speech and CYBER-BULLYING at an unprecedentedpic.twitter.com/05YOi7M2gH\n\n sir_wicknell. (@wicknellchivayo)April 7, 2025\n\nMoyo said she was overwhelmed by Chivayos gesture.\n\nIt would be follyand the gravest level of wickednessshould one fail to appreciate such an astronomical act of generosity. He has a big heart, and I accept the gift with the utmost appreciation. Thank you, Sir Wicknell, for your unmatched kindness.\n\nTruly, the gift came as an analgesic to me after going through cyber atrocities aimed at me. I literally feel the pains dissolving, the tears drying, and my emotions reinvigorated, said Moyo.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/09051531/dorcas-moyo.webp",
            "description": "<p>By Darlington Gatsi DORCAS Moyo is having the last laugh and it is the loudest. Moyo’s fortitude was tested when she was dragged on social media late last month after posting the opening lyrics of her song “Hakotsire”. “Ranganai henyu asi zvichakona” was lost in translation amid a boiling political pot on the eve of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dorcas-moyo-opens-up-about-cyberbullying-nightmare-says-it-was-not-an-easy-period/\">Dorcas Moyo opens up about cyberbullying nightmare, says “it was not an easy period”</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:29",
            "date": "09 Apr 2025"
        },
        {
            "title": "Stay in your lane: Zanu PF’s Mutsvangwa slams Information Minister for prematurely announcing Women’s League poll results",
            "url": "https://www.newzimbabwe.com/stay-in-your-lane-zanu-pfs-mutsvangwa-slams-information-minister-for-prematurely-announcing-womens-league-poll-results/",
            "content": "By Staff Reporter\n\nZANU PF spokesperson Christopher Mutsvangwa has written a letter to Information Minister Jenfan Muswere accusing him of allowing state-controlled media to prematurely announce results for the Manicaland Womens League internal elections, which the party had not yet ratified.\n\nThe election, held Sunday, saw Dorothy Mabika voted in as Chair, replacing Happiness Nyakuedzwa, who was dismissed last year. The results were announced by the ZBC and The Herald before they had been tabled by the party.\n\nIn the letter addressed, Mutsvangwa said the results announcement is invalid and has no official standing.\n\nIt has come to the Departments attention that you allowed the announcing of Womens League election results in the Provincial Elections held in Manicaland on the ZBC 8 p.m. news of the 6th of April 2025, as well as in The Herald on the 7th of April 2025.\n\nThis announcement was irregular and intended to pre-empt the due electoral provisions and procedures of the Party.\n\nThe other motive was to upend standard internal consultations with the Party leadership in accordance with the Party constitution and tenets.\n\nThe other motive was to undermine standard internal consultations with Party leadership in accordance with the Party constitution and principles, deriving out of all this, this announcement is thus deemed to be of no consequence.\n\nThe correct and proper position, once finalized, will be announced by this department, as the rightful Party mouthpiece, in due course, Mutsvangwa wrote.\n\nMeanwhile, the Ministry of Information continues to face criticism for allegedly prioritizing ruling party interests over government affairs, with Muswere and Permanent Secretary Nick Mangwana frequently under fire.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/16052318/InShot_20240415_165630255-scaled.jpg",
            "description": "<p>By Staff Reporter ZANU PF spokesperson Christopher Mutsvangwa has written a letter to Information Minister Jenfan Muswere accusing him of allowing state-controlled media to prematurely announce results for the Manicaland Women’s League internal elections, which the party had not yet ratified. The election, held Sunday, saw Dorothy Mabika voted in as Chair, replacing Happiness Nyakuedzwa,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/stay-in-your-lane-zanu-pfs-mutsvangwa-slams-information-minister-for-prematurely-announcing-womens-league-poll-results/\">Stay in your lane: Zanu PF’s Mutsvangwa slams Information Minister for prematurely announcing Women’s League poll results</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:29",
            "date": "09 Apr 2025"
        },
        {
            "title": "SADC raises concern over US tariffs – says collective action will be taken",
            "url": "https://www.newzimbabwe.com/sadc-raises-concern-over-us-tariffs-says-collective-action-will-be-taken/",
            "content": "Anadolu Agency\n\nThe Southern African Development Community (SADC) on Tuesday expressed concern over the new tariffs imposed by the US on imported products, including those from the bloc member states.\n\nA new baseline tariff of 10% slapped on all imports announced on April 2 came into force on April 5, while reciprocal tariffs will enter into force on Wednesday.\n\nThe new tariffs will affect all SADC countries to varying degrees, with products from Lesotho will be hit by a 50% reciprocal tariff, while 47% will be applied to imports from Madagascar.\n\nWhile the US has announced a list of exempted products, this does not include products such as textiles and clothing, which are amongst those exported to the US by SADC countries, the bloc said in a statement.\n\nAlmost all SADC countries currently enjoy duty-free access to the US market under the USs African Growth and Opportunity Act (AGOA).\n\nHowever, the reciprocal tariffs will end these benefits stemming from AGOA, whose current term was due to expire by the end of September this year.\n\nSADC is carrying out a detailed assessment of the impact of the global geopolitical developments on the different sectors of the region, for consideration by an extraordinary meeting of the blocs council of ministers scheduled for June, according to the statement.\n\nSADC reiterates its commitment to further the objectives of the SADC Treaty through continued adherence to multilateral trade rules and fair competition administered by the World Trade Organization (WTO) and remains open to engagement with stakeholders on these matters, it said.\n\nAfrican countries have been responding differently since President Donald Trump announced reciprocal tariffs.\n\nLast week, Zimbabwes President Emmerson Mnangagwa, in a post on X, announced a suspension of all tariffs levied on goods originating from the US to facilitate the expansion of American imports within the Zimbabwean market, while simultaneously promoting the growth of Zimbabwean exports destined for the US.\n\nZimbabwe, one of the SADC member countries under US sanctions for human rights violations, was slapped with an 18% tariff.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/01065949/Elias-Magosi-SADC-Executive-Secretary.jpg",
            "description": "<p>Anadolu Agency The Southern African Development Community (SADC) on Tuesday expressed concern over the new tariffs imposed by the US on imported products, including those from the bloc member states. A new baseline tariff of 10% slapped on all imports announced on April 2 came into force on April 5, while “reciprocal” tariffs will enter</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sadc-raises-concern-over-us-tariffs-says-collective-action-will-be-taken/\">SADC raises concern over US tariffs – says collective action will be taken</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:29",
            "date": "09 Apr 2025"
        },
        {
            "title": "Mnangagwa to reward 1,000 ‘Green Bombers’ with jobs in government, including army",
            "url": "https://www.newzimbabwe.com/mnangagwa-to-reward-1000-green-bombers-with-jobs-in-government-including-army/",
            "content": "By Staff Reporter\n\nIN a move aimed at currying favour with the youth demography, President Emmerson Mnangagwa has promised 1,000 Youth Service in Zimbabwe graduates with jobs within government, including the uniformed forces.\n\nDerogatorily known as Green Bombers for their green-coloured uniforms, the first two cohorts of graduates will soon be enlisted at various public institutions and State Owned Enterprises (SOEs) across the country.\n\nSpeaking at a post-Cabinet briefing in Harare Tuesday, Information Minister Jenfan Muswere said the initiative, which targets youth empowerment through six months of training, is channelling graduates from the first two cohorts into public institutions, uniformed forces, State enterprises, and national development programmes.\n\nThe Youth Service in Zimbabwe Programme that was launched by His Excellency President Dr Emmerson Mnangagwa in May 2024, is already harnessing positive dividends on the youth demographic group, Muswere said.\n\nThe first two cohorts of students numbering 1,077 who graduated from the six months training programme are already earmarked for employment at State-funded higher and tertiary education institutions, the Public Service, uniformed forces, State-Owned Enterprises, including special programmes, such as the Presidential Solarisation Programme, the Emergency Road Rehabilitation Programme and the Presidential Borehole Drilling Scheme.\n\nOther graduates are already enrolling for further skills upgrading at various Vocational Training Centres around the country.\n\nGovernment has already made it mandatory that vocational certificates will be prioritised for accessing empowerment loans and entrepreneurial start-ups, from the Empower Bank.\n\nThe initiative aims to empower and train youth aged 18-35 through a six-month programme focusing on life skills, entrepreneurship, and national orientation, with a goal of fostering patriotism and civic responsibility.\n\nNicknamed Border Gezi training programme was named after the then Youth minister. The youth service training was established in 2001, following the Nziramasanga Commission Report of 1999, which recommended education of young people to inculcate values of patriotism, discipline, national identity, service, and civic responsibility.\n\nThe hugely unpopular programme was blamed for breeding a militia that propped Zanu PF during electioneering, going about brutalizing opposition activists.\n\nIt was later disbanded under a cloud of suspicion that the then Youth minister was assembling a private army, only to be reintroduced by President Mnangagwa last year.\n\nThe new curriculum infuses national orientation with life skills training and entrepreneurial development.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/09054809/muswere.jpeg",
            "description": "<p>By Staff Reporter IN a move aimed at currying favour with the youth demography, President Emmerson Mnangagwa has promised 1,000 Youth Service in Zimbabwe graduates with jobs within government, including the uniformed forces. Derogatorily known as ‘Green Bombers’ for their green-coloured uniforms, the first two cohorts of graduates will soon be enlisted at various public</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-to-reward-1000-green-bombers-with-jobs-in-government-including-army/\">Mnangagwa to reward 1,000 ‘Green Bombers’ with jobs in government, including army </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:29",
            "date": "09 Apr 2025"
        },
        {
            "title": "Company employee loses US$71,000 to robbers while on errand to deliver the cash",
            "url": "https://www.newzimbabwe.com/company-employee-loses-us71000-to-robbers-while-on-errand-to-deliver-the-cash/",
            "content": "By Staff Reporter\n\nAN unnamed Beitbridge company is counting its loss after its employee was robbed of US$71,120 while on his way to deliver money to an agent in Harare.\n\nThe Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident.\n\nThe ZRP is investigating a case of robbery which occurred in Dulibadzimu, Beitbridge on March 6, 2025 where a 34-year-old man was robbed of US$71,120 company money, which was meant to be delivered to the companys agent in Harare.\n\nThe complainant was attacked by an unidentified suspect who was armed with a pistol, said Nyathi.\n\nThe suspect fired one shot while demanding cash and was handed a bag which contained the money.\n\nInvestigations to account for the robber are reportedly in progress.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/04/07065619/Armed-robberry.jpg",
            "description": "<p>By Staff Reporter AN unnamed Beitbridge company is counting its loss after its employee was robbed of US$71,120 while on his way to deliver money to an agent in Harare. The Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident. “The ZRP is investigating a case of robbery which occurred in Dulibadzimu,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/company-employee-loses-us71000-to-robbers-while-on-errand-to-deliver-the-cash/\">Company employee loses US$71,000 to robbers while on errand to deliver the cash </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:29",
            "date": "09 Apr 2025"
        },
        {
            "title": "Mozambican President Chapo to officially open ZITF; nearly 600 direct exhibitors register",
            "url": "https://www.newzimbabwe.com/mozambican-president-chapo-to-officially-open-zitf-nearly-600-direct-exhibitors-register/",
            "content": "By Staff Reporter\n\nPRESIDENT Daniel Chapo of Mozambique is scheduled to officially open this years edition of the Zimbabwe International Trade Fair (ZITF) in Bulawayo.\n\nThe annual premier business showcase, which has so far attracted close to 600 direct exhibitors, will run from April 21-26, 2025.\n\nAddressing the media during a post-Cabinet briefing in Harare Tuesday, Information Minister, Jenfan Muswere, said Cabinet had received an update on preparations for the countrys foremost business event.\n\nCabinet received an update on the state of preparedness for the 2025 Zimbabwe International Trade Fair: April 21-26 2025.\n\nThe 65th Edition of the Zimbabwe International Trade Fair (ZITF) is scheduled for 21 to 26 April 2025 and will be held under the theme Industrialisation: Crafting an Integrated Landscape. A key highlight is the extension of the event to six days, said Muswere.\n\nThe President of the Republic of Mozambique, His Excellency Daniel Chapo, will officially open the 65th Edition of ZITF on April 25, 2025, he added.\n\nIt was noted that as at April 7, 2025, 596 direct exhibitors had registered to participate, compared to 428 who expressed interest during the same period in last year.\n\nOf these, 98 are exhibiting for the first time. In terms of the current space booking situation, 95% has been booked to date, compared to 87% booked during the same period in 2024. International exhibitor space uptake has increased, with 29 countries having registered.\n\nThese include: Afghanistan, Angola, Austria, Belarus, Botswana, Brazil, Canada, China, the European Union delegation, Egypt, Ethiopia, France, Germany, Indonesia, Italy, Japan, Kenya, Malawi, Mozambique, Netherlands, Pakistan, Rwanda, South Africa, Sweden, Tanzania, the United Kingdom, the United States of America, United Arab Emirates, and Zambia.\n\nThe Information Minister said this surpassed the 27 participating countries as of 2024, with India among the participants.\n\nAmong the highlights of this years ZITF will be the Rural Industrialisation Indaba, the International Business Community, Connect Africa Symposium, and the CBZ Original Equipment Manufacturers, which makes a comeback.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/09054013/chapo-moza.webp",
            "description": "<p>By Staff Reporter PRESIDENT Daniel Chapo of Mozambique is scheduled to officially open this year’s edition of the Zimbabwe International Trade Fair (ZITF) in Bulawayo. The annual premier business showcase, which has so far attracted close to 600 direct exhibitors, will run from April 21-26, 2025. Addressing the media during a post-Cabinet briefing in Harare</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mozambican-president-chapo-to-officially-open-zitf-nearly-600-direct-exhibitors-register/\">Mozambican President Chapo to officially open ZITF; nearly 600 direct exhibitors register</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:29",
            "date": "09 Apr 2025"
        },
        {
            "title": "Bulawayo Chiefs suspend administrator in connection with ex-Highlanders CEO’s fraud case",
            "url": "https://www.newzimbabwe.com/bulawayo-chiefs-suspend-administrator-in-connection-with-ex-highlanders-ceos-fraud-case/",
            "content": "By Sports Reporter\n\nBulawayo Chiefs has suspended its administrator, Andrew Mandigora, in connection with a US$5,000 fraud case involving former Highlanders CEO Brian Moyo.\n\nMandigora is accused of furnishing Moyo with details, which the latter used to generate a fake invoice that was used to defraud Highlanders.\n\nMoyo, who resigned on Saturda,y allegedly generated a fake US$23,000 invoice for Highlanders to pay Bulawayo Chiefs in a transaction involving two players, when Bosso was supposed to pay only US$18,000. He pocketed the extra US$5,000.\n\nMandigora was notified of his suspension on Monday evening.\n\nThe Bulawayo Chiefs Football Club Executive Board is writing to inform you that, effective immediately, you are hereby suspended from your duties as an administrator at Bulawayo Chiefs Football Club.\n\nThis decision has been made in light of serious allegations regarding your involvement in fraudulent transactions, specifically concerning the submission of invoices with exaggerated amounts in collaboration with another clubs official.\n\nIn accordance with our clubs policies and procedures, this suspension is necessary to ensure the integrity of the ongoing investigation.\n\nWe must emphasize that you are not permitted to interfere with or participate in any aspect of this investigation.\n\nThis includes any communication with other parties involved or related to the matter. Please return all club property and ensure that you have no further access to club resources, systems, or confidential information during this period.\n\nWe take these allegations seriously, and appropriate steps will be taken to ensure a thorough investigation is conducted.\n\nYou will be informed of any developments regarding this matter. We appreciate your cooperation in this sensitive issue, reads the suspension letter.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/08082028/bulawayo-chiefs.jpg",
            "description": "<p>By Sports Reporter Bulawayo Chiefs has suspended its administrator, Andrew Mandigora, in connection with a US$5,000 fraud case involving former Highlanders CEO Brian Moyo. Mandigora is accused of furnishing Moyo with details, which the latter used to generate a fake invoice that was used to defraud Highlanders. Moyo, who resigned on Saturda,y allegedly generated a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/bulawayo-chiefs-suspend-administrator-in-connection-with-ex-highlanders-ceos-fraud-case/\">Bulawayo Chiefs suspend administrator in connection with ex-Highlanders CEO’s fraud case</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:29",
            "date": "09 Apr 2025"
        }
    ]
}