{
    "news": [
        {
            "title": "US wants to join G20 summit, end boycott: South Africa",
            "url": "https://www.newzimbabwe.com/us-wants-to-join-g20-summit-end-boycott-south-africa/",
            "content": "AFP\n\nWashington had said it would not take part in the 22-23 November summit because it objected to the priorities for the meeting set by South Africa, which holds the G20s rotating presidency this year.\n\nWe have received notice from the United States, a notice which we are still in discussions with them over, about a change of mind about participating in one shape, form or other in the summit, Ramaphosa told reporters.\n\nThis comes at the late hour before the summit begins. And so therefore, we do need to engage in those types of discussions to see how practical it is and what it finally really means, he said.\n\nAll countries are here, and the United States, the biggest economy in the world, needs to be here, he said.\n\nSo its pleasing to hear that there is a change of approach, and so we are still discussing how that will manifest.\n\nUS President Donald Trump has singled out South Africa for harsh treatment on a number of issues since he returned to the White House in January, notably making debunked claims of white Afrikaners being systematically killed and slaughtered in the country.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/20172724/ramaphosa.jpg",
            "description": "<p>AFP The United States has had a “change of mind” about boycotting the G20 summit in Johannesburg this weekend and wanted to take part in some form, South African President Cyril Ramaphosa said Thursday. Washington had said it would not take part in the 22-23 November summit because it objected to the priorities for the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-wants-to-join-g20-summit-end-boycott-south-africa/\">US wants to join G20 summit, end boycott: South Africa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:43",
            "date": "20 Nov 2025"
        },
        {
            "title": "Chevrons beat Sri Lanka to pick first Tri-Series win",
            "url": "https://www.newzimbabwe.com/chevrons-beat-sri-lanka-to-pick-first-tri-series-win/",
            "content": "By Sports Reporter\n\nThe Zimbabwe senior mens cricket team delivered a solid performance on Thursday, defeating Sri Lanka by 67 runs in their second Tri-Series match at the Rawalpindi Cricket Stadium.\n\nThe victory marked the Chevrons first win of the tournament, bouncing back strongly after their 5-wicket loss to Pakistan in the opening match on Tuesday.\n\nAfter losing the toss and being sent in to bat, Zimbabwe posted a competitive 162 runs, led by opener Brian Bennett, who top-scored with 49 runs off 42 balls. Captain Sikandar Raza followed closely with an impressive 47 off 32 deliveries.\n\nDefending their total, the Chevrons were disciplined with the ball and sharp in the field, restricting Sri Lanka to 95 runs in their 20 overs.\n\nBrad Evans starred with the ball, taking three wickets, while Richard Ngarava chipped in with two. The rest of the bowling attack each picked up a wicket, contributing to a strong all-round performance.\n\nThe defeat marked a disappointing start for Sri Lanka in their Tri-Nations campaign, while Zimbabwe gained a confidence boost after their earlier loss to hosts Pakistan.\n\nSri Lanka will now take on Pakistan on Saturday to conclude the first-round fixtures, before the Chevrons face Pakistan again on Sunday as round two begins.\n\nThe tri-series serves as preparation for next years T20 World Cup, in which all three nations are set to participate.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/20175919/chevrons-paki.jpg",
            "description": "<p>By Sports Reporter The Zimbabwe senior men’s cricket team delivered a solid performance on Thursday, defeating Sri Lanka by 67 runs in their second Tri-Series match at the Rawalpindi Cricket Stadium. The victory marked the Chevrons’ first win of the tournament, bouncing back strongly after their 5-wicket loss to Pakistan in the opening match on</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chevrons-beat-sri-lanka-to-pick-first-tri-series-win/\">Chevrons beat Sri Lanka to pick first Tri-Series win</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:43",
            "date": "20 Nov 2025"
        },
        {
            "title": "Mwazha dies aged 107",
            "url": "https://www.newzimbabwe.com/mwazha-dies-aged-107/",
            "content": "By Staff Reporter\n\nClergyman and founder of the African Apostolic Church, Archbishop Paul Mwazha, has died aged 107.\n\nMwazha passed away on Thursday after a long illness.\n\nIn a statement, African Apostolic Church General Secretary Jeshua Mhizha confirmed the death of the church leader.\n\nGood morning! The African Apostolic Church, VaApostora veAfrica.\n\nI regret to inform you that our Archbishop, Paul Mwazha of Africa, our church leader, has just passed on today, November 20, 2025. He has departed from us, but in spirit we are together with him.\n\nMore information will be released in due course. Any further announcements will be released in due course. Kudzai Jehovah, Kudzai Jehovah, said Mhizha.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/20100021/mwazha-.jpg",
            "description": "<p>By Staff Reporter Clergyman and founder of the African Apostolic Church, Archbishop Paul Mwazha, has died aged 107. Mwazha passed away on Thursday after a long illness. In a statement, African Apostolic Church General Secretary Jeshua Mhizha confirmed the death of the church leader. “Good morning! The African Apostolic Church, VaApostora veAfrica. “I regret to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mwazha-dies-aged-107/\">Mwazha dies aged 107</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:43",
            "date": "20 Nov 2025"
        },
        {
            "title": "NMBZ draws down Afreximbank’s US$50 million loan facility",
            "url": "https://www.newzimbabwe.com/nmbz-draws-down-afreximbanks-us50-million-loan-facility/",
            "content": "By Alois Vinga\n\nNMBZ Bank has begun drawing down Afreximbanks US$50 million loan facility, with the mining and construction sectors emerging as the biggest beneficiaries after absorbing 50% of the funds.\n\nPresenting a trading update for the third quarter ended September 30, 2025, NMBZ company secretary Violet Mutandwa said the facility has significantly supported key economic sectors through improved access to offshore credit lines.\n\nNMBZ company secretary Violet Mutandwa\n\nDuring the quarter under review, the bank started drawing down on the US$50 million Afreximbank line with over US$25 million already disbursed to the mining and construction sectors. The Bank finalised a US$15 million Agrobond which was privately placed with a European Fund and will go towards supporting the agriculture sector, she said.\n\nDuring the period under review, the Group generated operating income of ZWG1.3 billion for the nine months to September 30, 2025.\n\nIn terms of the Groups core business, net interest income rose by 63% compared to the same period in 2024, driven by increased loans and advances to productive sectors and support for consumer needs. Core income streams remain resilient, supported by strong growth in loans and deposits, while management continues to prioritise revenue diversification and cost optimisation.\n\nThe Group incurred operating expenditure of ZWG1.1 billion, a 70% increase from the prior year. This variance primarily reflects the impact of strategic business reengineering initiatives undertaken during the year, including restructuring and staff rationalisation to align operations with the Groups strategic vision.\n\nTotal assets increased to ZWG9.2 billion, up 27% from ZWG7.3 billion recorded on December 31, 2024. The growth was anchored by an expansion in loans and advances, which stood at ZWG4.2 billion at the end of the quarter.\n\nThe domestic economy is projected to grow by 6.6% in 2025 in line with earlier projections in light of the sustained macroeconomic stability, record-high gold prices, growing remittances and a 12.8% rebound in agriculture following the 2024 El Nino.\n\nIn light of the above, the Group will continue to focus on supporting key sectors of the economy through its core business, Mutandwa added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/07/03034559/NMB-Bank.png",
            "description": "<p>By Alois Vinga NMBZ Bank has begun drawing down Afreximbank’s US$50 million loan facility, with the mining and construction sectors emerging as the biggest beneficiaries after absorbing 50% of the funds. Presenting a trading update for the third quarter ended September 30, 2025, NMBZ company secretary Violet Mutandwa said the facility has significantly supported key</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nmbz-draws-down-afreximbanks-us50-million-loan-facility/\">NMBZ draws down Afreximbank’s US$50 million loan facility</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:43",
            "date": "20 Nov 2025"
        },
        {
            "title": "South Africa to lead global PGM supply rebound next year after dragged output",
            "url": "https://www.newzimbabwe.com/south-africa-to-lead-global-pgm-supply-rebound-next-year-after-dragged-output/",
            "content": "IOL\n\nLower production from platinum group metals mines in South Africa muzzled global PGM supply in the third quarter although gains from the worlds biggest producers of the metal, including Zimbabwe, where Valterra, Impala Platinum and Sibanye-Stillwater operate, are expected to lift up supply by 2% next year.\n\nThe World Platinum Investment Council said on Wednesday that global PGM supplywas flatin the third quarter year on year weighed on by lower South African mineproduction.\n\nThis was after refined volumes fromValterra(formerly Anglo American Platinum) fell inSouth Africa.\n\nThis was reflective of a significant destocking of semi-finished inventory in Q324.\n\nImplats own refined production was, however, little changed year-on-year, although scheduled processing maintenance led to a further build in already elevated work-in-progress stocks.\n\nSouth African production contracted 2% year-on-year to 1 028 koz, said WIPC in a quarterly report.\n\nNonetheless, following the unusually high rainfall and flooding that disrupted South African mining operations earlier this year, as well as theprocessing constraints that curtailed refined volumes,PGMsupply is expected to recover over the latter half of the year.\n\nThe completionof maintenance at Implats South African smelters should allow some destocking of excess inventory that had been deferredearlier in the year, partly due to disruptions to water, power and hydrogen supply to the refineries, further noted WIPC.\n\nAlthough South African mine production is forecast to contract 5% to 3,945 koz, mine supply for PGM from the country is projected to rise by 2% year-on-year in 2026, with gains from South Africa and Zimbabwe partially offset by a modest decline from North America and Russia.\n\nOutput from major South African producers is expected to rise, with improved processing availability anticipated to support a modestincrease in output from Implats, aided by the drawdown of excess semi-finished inventory.\n\nInvestor sentiment in South African platinum miners and future pricing prospects has brightened with the commoditys recent good run in prices providing favourable momentum among fund managers.\n\nLong dogged by suppressed investor sentiment due to low prices and uncertainty that demand could be subdued due to popularity and uptake of electric vehicles, platinum group metals have been on a rebound in the past few weeks.\n\nThis is despite the World Platinum Investment Council saying earlier this year that full-year output will still be 6% lower than last year, since South African producers will not benefit from the large drawdown of work-in-process inventory that occurred last year.\n\nBesides the inclination towards platinum, the South African fund managers have exhibited lowpositioninginhealthcare,offshore,telecomandcash. Thebiggest fallswere recorded forheavyindustrialsand cash, according to Bank of America analysts.\n\nZimbabweanPGMproduction slipped 10% to 119 koz, largely reflecting significant destocking of semi-processed material at Unki, owned by Valterra.\n\nOutput from Zimplats,Zimbabweslargest producer, edged lower owing to furnace repairs.\n\nThus, PGM supply from Zimbabwe is expected to contract by 4% year-on-year to 493 koz, retreating from the record level achieved in 2024.\n\nThe decline primarily reflects the absence of a drawdown of semi-finished stock that boosted last years volumes, said WIPC.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/20044527/gold-platinum.jpg",
            "description": "<p>IOL Lower production from platinum group metals mines in South Africa muzzled global PGM supply in the third quarter although gains from the world’s biggest producers of the metal, including Zimbabwe, where Valterra, Impala Platinum and Sibanye-Stillwater operate, are expected to lift up supply by 2% next year. The World Platinum Investment Council said on</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africa-to-lead-global-pgm-supply-rebound-next-year-after-dragged-output/\">South Africa to lead global PGM supply rebound next year after dragged output</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:43",
            "date": "20 Nov 2025"
        }
    ]
}