{
    "news": [
        {
            "title": "UZ reinstates students suspended after protesting in support of lecturers’ strike",
            "url": "https://www.newzimbabwe.com/uz-reinstates-students-suspended-after-protesting-in-support-of-lecturers-strike/",
            "content": "By Thandiwe Garusa\n\nTHE University of Zimbabwe has lifted its suspension on six student activists who were dismissed for staging a protest on campus in May in solidarity with their striking lecturers.\n\nThe students, Narshon Kohlo, Blessing Mtisi, Nodesha Maingehama, Tafadzwa Katsande, Tawana Hove and Tariro Mtukura are members of the Zimbabwe National Students Union (ZINASU), UZ Chapter.\n\nThey staged a flash protest at UZ campus where they demanded an urgent resolution to the grievances of their lecturers, who have been on strike since April 16.\n\nThe student activists were later suspended in July by UZ Vice Chancellor Paul Mapfumo, citing that they had put the institution in disrepute.\n\nThe suspension drew criticism from opposition politicians and was raised in Parliament on Wednesday.\n\nIn separate letters seen by NewZimbabwe.com which were written to the six students by UZ registrar Munyaradzi Madambi, the institution made a U-turn and announced the withdrawal of student disciplinary matter against them.\n\nPlease be advised that the University has reconsidered its position and decided to lift your suspension from the University of Zimbabwe and also withdraw the Student Disciplinary matter which had previously beenleveledagainstyou.\n\nIt is sincerely hoped that you have atoned for your behaviour, which seriously threatens the integrity and reputation of the University.\n\nWe anticipate that you desist from engaging in behaviour that may put the University into disrepute.\n\nBy copy of this letter, the Manager, Examinations and Certification is requested to reactivate your E-mhare account and release your results and all other relevant Departments of the University are advised to take the necessary steps to facilitate the resumption of studies by the student, the letters read.\n\nThree weeks ago, the university also fired four leaders of the ongoing lecturers industrial action after having been initially suspended and undergoing a hearing for using the campuss great hall without approval from authorities.\n\nThe lecturers are demanding a salary increase to at least US$2,250 from their current US$250 as well as improved working conditions.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/12142202/UZ-1.png",
            "description": "<p>By Thandiwe Garusa THE University of Zimbabwe has lifted its suspension on six student activists who were dismissed for staging a protest on campus in May in solidarity with their striking lecturers. The students, Narshon Kohlo, Blessing Mtisi, Nodesha Maingehama, Tafadzwa Katsande, Tawana Hove and Tariro Mtukura are members of the Zimbabwe National Students Union</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uz-reinstates-students-suspended-after-protesting-in-support-of-lecturers-strike/\">UZ reinstates students suspended after protesting in support of lecturers’ strike</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:10",
            "date": "17 Jul 2025"
        },
        {
            "title": "Govt approves exam classes vacation school",
            "url": "https://www.newzimbabwe.com/govt-approves-exam-classes-vacation-school/",
            "content": "By Thandiwe Garusa\n\nTHE government has given schools the green light to conduct August vacation classes for examination classes, saying that different challenges may have affected syllabus coverage.\n\nIn a statement, the Ministry of Primary and Secondary Education Permanent Secretary, Moses Mhike said the holiday lessons must be done for ten days only between 18 and 29 August.\n\nIt is recognised that schools have different challenges that may have affected their syllabus coverage and necessitated the conduct of vacation school for examination classes.\n\nTherefore, for the year 2025, authority is granted for schools to conduct vacation school during the August holidays for the examination classes of Grade 7, Form Four and Upper Sixth.\n\nThe holiday lessons will take place between 18 and 29 August, a period of ten (10) working days only, Mhike said.\n\nThe Ministry also stressed the importance of preventing the ever-escalating cost of teaching and learning for parents in view of disadvantaged pupils who may be excluded from these vacation schools due to financial constraints.\n\nPrimary schools will charge US$2.00 per Learning Area per Grade 7 or its equivalent bank rate in Zimbabwe Gold currency.\n\nSecondary Schools will charge USD$3.00 per learning area for form fours (4) and USD$5.00 per learning area for Upper Six (6) or its equivalent bank rate in Zimbabwe Gold currency.\n\nAll borders will pay an extra USD$5.00 per day for their upkeep during the vacation school period, Mhike said.\n\nMhike also said parents must be given receipts upon payment, and accurate financial records should be kept for auditing purposes.\n\nThe vacation school should be fully supervised and monitored by the District Literacy Coordinators and the Remedial Tutors.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/30220718/Picture5.jpg",
            "description": "<p>By Thandiwe Garusa THE government has given schools the green light to conduct August vacation classes for examination classes, saying that different challenges may have affected syllabus coverage. In a statement, the Ministry of Primary and Secondary Education Permanent Secretary, Moses Mhike said the holiday lessons must be done for ten days only between 18</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-approves-exam-classes-vacation-school/\">Govt approves exam classes vacation school</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:10",
            "date": "17 Jul 2025"
        },
        {
            "title": "MDC-T power struggle: VP Mudzuri moves to oust Mwonzora from party headquarters",
            "url": "https://www.newzimbabwe.com/mdc-t-power-struggle-vp-mudzuri-moves-to-oust-mwonzora-from-party-hq/",
            "content": "By Staff Reporter\n\nA dramatic power struggle has unfolded within the MDC-T party as Vice President Elias Mudzuri, allegedly in collaboration with Morgen Komichi, launched a bid to oust the partys embattled leader, Douglas Mwonzora, and seize control of Harvest House  the party headquarters in Harare CBD.\n\nThe move comes on the heels of a High Court ruling in late February 2025, in which Justice Hapias Zhou ordered Mwonzora to resign and facilitate a fresh congress within six months.\n\nThe ruling cited irregularities in the 2022 MDC-T Extraordinary Congress that saw Mwonzora elevated to the party leadership.\n\nMudzuri is arguing that, in light of Justice Zhous ruling, he is now the rightful leader of the party, by virtue of his position as Vice President.\n\nMudzuri arrived at Harvest House this morning with a considerable entourage, but was met with fierce resistance from Mwonzoras militant youth supporters, who aggressively blocked his entry.\n\nPolice intervention was ultimately required to prevent the situation from escalating further.\n\nMudzuri was seen leavingin his black Toyota Land Cruiser amidst the commotion.\n\nEarlier, Mudzuri had reportedly ordered Mwonzoras supporters and loyalists to vacate the building, prompting a heated confrontation.\n\nThis resulted in the arrival of truckloads of police officers in riot gear.\n\nMudzuri then briefly disappeared before resurfacing, claiming he had visited Harare Central Police Station to request a police escort to facilitate his occupation of Harvest House.\n\nMwonzora is no longer the President, as per the High Court ruling in February 2025. There is a void in the party presidency that must be filled, claimed one of Mudzuris security personnel, who requested anonymity.\n\nHowever, Albert Chidhakwa, the MDC National Youth Chairman and leader of Mwonzoras militant youth faction at Harvest House, insisted that Mudzuris actions are premature and invalid, as the party has lodged an appeal against Justice Zhous ruling.\n\nThe party has appealed Justice Zhous ruling. Mudzuri cannot rely on the High Court ruling because the appeal has rendered it ineffective. President Mwonzora remains the party leader. There is no change to that, he stated.\n\nThe battle for control of Harvest House has been a long-standing source of conflict within the opposition. It intensified following the Supreme Courts decision in March 2020 to nullify Nelson Chamisas ascendancy to the party presidency after the death of founding leader, Morgan Tsvangirai in 2018.\n\nWhile Mwonzora, in his then role as Secretary General, assumed leadership, he has struggled to maintain stability within the party. Many members defected to Chamisa and later to his Citizens Coalition for Change (CCC), which was officially formed in 2022.\n\nMwonzoras party chose not to participate in the 2023 elections, citing concerns over irregularities in the delimitation exercise.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/26140654/Mudzuri.jpg",
            "description": "<p>By Staff Reporter A dramatic power struggle has unfolded within the MDC-T party as Vice President Elias Mudzuri, allegedly in collaboration with Morgen Komichi, launched a bid to oust the party’s embattled leader, Douglas Mwonzora, and seize control of Harvest House – the party headquarters in Harare CBD. The move comes on the heels of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mdc-t-power-struggle-vp-mudzuri-moves-to-oust-mwonzora-from-party-hq/\">MDC-T power struggle: VP Mudzuri moves to oust Mwonzora from party headquarters</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:10",
            "date": "17 Jul 2025"
        },
        {
            "title": "Fidelity insurance contract revenue up 45%",
            "url": "https://www.newzimbabwe.com/fidelity-insurance-contract-revenue-up-45/",
            "content": "By Alois Vinga\n\nFIDELITY Life Assurance has seen insurance contract revenue growing by 45% compared to the prior year, signifying the groups resilience.\n\nPresenting the groups annual report this week, FLA chairman Livingstone Gwata said the segment grew by 45% from US$7,9 million to US$11,4 million in the year under review on the strength of the groups customised service approach which continues to drive uptake of the Companys products offering on the market.\n\nThe Vaka Yako product performed very well and contributed significantly to the Gross Premium Written (GPW) at 85% of the premium inflows. On the premium inflows, the Zimbabwean operation contributed 68% for the year under review compared to 62% in 2023, whilst for the year under review 32% was attributable to the Malawi operation which contributed 38% in 2023, he said.\n\nThe insurance service result declined by 174% owing to higher insurance service expenses incurred compared to the earned revenue. The segments expenses increased by 66% compared to the growth in Insurance Contract Revenue of 45%.\n\nNet investment income grew by 55% compared to the prior year from USD5.6 million to USD9.0 million. The Group profit for the period increased by 174%.\n\nFLA said the Asset Separation exercise, which is currently underway, is close to completion and is set to be concluded in Q1 2025.\n\nThe business is now wrapping up the paperwork required to fully execute the exercise. The exercise brings added transparency and protections to both policyholders and shareholders, especially noting Zimbabwes fluid policy environment.\n\nFor policyholders, the separation of assets will unlock more, in terms of quantum and value, investment opportunities, sustainable growth and profitability, said Gwata.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/03/22145953/Fidelity-Life-Assurance-building.jpg",
            "description": "<p>By Alois Vinga FIDELITY Life Assurance has seen insurance contract revenue growing by 45% compared to the prior year, signifying the group’s resilience. Presenting the group’s annual report this week, FLA chairman Livingstone Gwata said the segment grew by 45% from US$7,9 million to US$11,4 million in the year under review on the strength of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/fidelity-insurance-contract-revenue-up-45/\">Fidelity insurance contract revenue up 45%</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:10",
            "date": "17 Jul 2025"
        },
        {
            "title": "Pedestrian killed, two others injured after trailer dislodged from commuter omnibus",
            "url": "https://www.newzimbabwe.com/pedestrian-killed-two-others-injured-after-trailer-dislodged-from-commuter-omnibus/",
            "content": "By James Muonwa\n\nA PEDESTRIAN died while two others were seriously injured after they were hit by a trailer that had dislodged from a commuter omnibus towing it.\n\nThe Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi, confirmed the tragedy that occurred along Plumtree Road in Bulawayo.\n\nThe ZRP confirms a fatal road traffic accident which occurred on July 14, 2025 at around 1330 hours along Plumtree Road in Belmont, Bulawayo said Nyathi.\n\nA trailer of a Mercedes-Benz Sprinter with one passenger on board disengaged. It then hit three pedestrians who were walking on the edge of the road.\n\nThe victims sustained varying injuries and were ferried to Mpilo Hospital for treatment. Unfortunately, one of the victims succumbed to the injuries.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/31184346/Accident4.jpg",
            "description": "<p>By James Muonwa  A PEDESTRIAN died while two others were seriously injured after they were hit by a trailer that had dislodged from a commuter omnibus towing it. The Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi, confirmed the tragedy that occurred along Plumtree Road in Bulawayo. “The ZRP confirms a fatal road traffic</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pedestrian-killed-two-others-injured-after-trailer-dislodged-from-commuter-omnibus/\">Pedestrian killed, two others injured after trailer dislodged from commuter omnibus</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:10",
            "date": "17 Jul 2025"
        },
        {
            "title": "Dynamos adds foreign players in effort to survive relegation",
            "url": "https://www.newzimbabwe.com/dynamos-adds-foreign-players-in-effort-to-survive-relegation/",
            "content": "By Sports Reporter\n\nRelegation candidates Dynamos FC have signed three new foreign players in a move to beef up the squad.\n\nDembare is currently in the relegation zone as they are second from bottom (17) on the log with 15 points, six ahead of Kwekwe United.\n\nThe three new foreigners are two Ghanaian infield players, Felix Hammond (defender), Mohammed Issaka (striker) and a Zambian goalkeeper, Sitali Nyambe.\n\nNew Zimbabwe.com understands that the trio signed with the club on Tuesday and will be ready for selection for Saturdays match against Simba Bhora at Wadzanayi Stadium in Shamva.\n\nOther than the three foreigners, Dembare has also signed midfielder Wisdom Mutasa, who is coming from Botswanas Orapa United.\n\nThis will mark Mutasas second stint at the Glamour Boys, the first being in 2017 when he played under his father, Lloyd Mutasa, who was head coach then.\n\nMeanwhile, former Zimbabwe Premier Soccer League Soccer Star of the Year Denver Mukamba is training with Dynamos.\n\nMukamba is eyeing a return to Dembare after parting ways with the club in 2012.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/17030319/WhatsApp-Image-2025-07-17-at-04.02.55.jpeg",
            "description": "<p>By Sports Reporter Relegation candidates Dynamos FC have signed three new foreign players in a move to beef up the squad. Dembare is currently in the relegation zone as they are second from bottom (17) on the log with 15 points, six ahead of Kwekwe United. The three new foreigners are two Ghanaian infield players,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dynamos-adds-foreign-players-in-effort-to-survive-relegation/\">Dynamos adds foreign players in effort to survive relegation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:10",
            "date": "17 Jul 2025"
        }
    ]
}