{
    "news": [
        {
            "title": "UN alarmed by Mozambique’s escalating post-election violence, mass displacement",
            "url": "https://www.newzimbabwe.com/un-alarmed-by-mozambiques-escalating-post-election-violence-mass-displacement/",
            "content": "By AFP\n\nTHE United Nations voiced alarm Tuesday at the violence surrounding post-election protests in Mozambique, which has forced thousands to seek shelter in neighbouring countries.\n\nUNHCR, the UN refugee agency, raised concerns over the growing number of displaced people and its impact on affected populations.\n\nThousands have fled Mozambique in the past week to neighbouring Malawi seeking refuge from the southern African nations deadly post-election demonstrations.\n\nHundreds of others have made their way to the tiny Kingdom of Eswatini to Mozambiques southwest.\n\nWe are deeply alarmed by the ongoing situation in Mozambique, where escalating violence has forced thousands to flee, said Chansa Kapaya, UNHCRs regional director for southern Africa.\n\nRefugees and civilians are facing immense risks, losing their livelihoods and relying on humanitarian assistance.\n\nWhile we are grateful for the generosity of Malawi and Eswatini, immediate support is crucial to tackle the worsening crisis and prevent further suffering.\n\nOn December 23, Mozambiques top court confirmed the ruling partys win in Octobers vote.\n\nThat result has been denounced as fraudulent by the opposition, and its rubber-stamping triggered an especially violent week of protests marred by incidents of vandalism and looting.\n\nSince December 23 at least 13,000 people have crossed over into Malawi, according to government sources.\n\nUNHCR said the refugee agency and the authorities in Malawi have identified around 2,000 individuals who have crossed into the country in the last week, while another 1,000 have entered Eswatini.\n\nSituation critical\n\nAmong the new arrivals are refugees and asylum seekers of various nationalities who have been living in Mozambique, UNHCR said.\n\nThe situations in both Malawi and Eswatini are becoming critical, with the rising number of refugees and asylum-seekers straining already overstretched resources, the Geneva-based agency said.\n\nIn Malawi, people who fled Mozambique said they escaped attacks and looting in their villages, UNHCR said, adding that many walked long distances and crossed the Shire River on foot or by small boats.\n\nShelters are overcrowded and sanitation facilities are inadequate.\n\nIn Eswatini, many of the new arrivals reported having lost their shops and businesses due to the violence, said UNHCR.\n\nThe agency urged the international community to step in with urgent assistance for refugees in both host countries.\n\nMozambiques top court last week confirmed that Frelimo, president-elect Daniel Chapos party that has been in power for 50 years, won the October 9 vote, triggering days of unrest that saw streets blocked, shops and businesses torched and looted.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/02055529/With-the-political-climate-in-Mozambique-growing-ever-more-volatile-thousands-are-escaping-violence-seeking-refuge-in-neighbouring-countries.webp",
            "description": "<p>By AFP THE United Nations voiced alarm Tuesday at the violence surrounding post-election protests in Mozambique, which has forced thousands to seek shelter in neighbouring countries. UNHCR, the UN refugee agency, raised concerns over the growing number of displaced people and its impact on affected populations. Thousands have fled Mozambique in the past week to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/un-alarmed-by-mozambiques-escalating-post-election-violence-mass-displacement/\">UN alarmed by Mozambique’s escalating post-election violence, mass displacement</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:28",
            "date": "02 Jan 2025"
        },
        {
            "title": "Clergyman Paul Mwazha enters 2025 aged 106 and still counting leaving Passion Java exposed amid false death prophesy",
            "url": "https://www.newzimbabwe.com/clergyman-paul-mwazha-enters-2025-aged-106-and-still-counting-leaving-passion-java-exposed-amid-false-death-prophesy/",
            "content": "By Staff Reporter\n\nCONTROVERSIAL self-styled prophet, Passion Javas false prophecy has been exposed after prominent African Apostolic Church leader, Paul Mwazha, now aged 106, entered the New Year alive.\n\nThis followed Javas earlier false claim that Mwazha also referred to as Mutumwa would die before January 2025.\n\nOn November 1, 2024, Java claimed he had envisioned the departure of Mwazha, before year end, urging churchgoers to pray for peace and unity within his congregation.\n\nAs the year draws to a close, I saw the departure of Paul Mwazha, going to be with the Lord.\n\nTo the church in Zimbabwe, I urge you to pray fervently for peace and unity within the walls of his congregation.\n\nFor I have seen a vision of discord and division among the top leadership, threatening to fracture the church. Succession disputes shall arise.\n\nPray for wisdom and guidance, love, forgiveness, and unity to prevail, that the church may continue to stand, said Java\n\nHowever, as the year 2024 ended and 2025 commences, Mwazha remains alive though frail.\n\nThe centenarians last public appearance was during his 106th birthday.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/25165726/Mwazha-Paul-e1582649870677.jpg",
            "description": "<p>By Staff Reporter  CONTROVERSIAL self-styled prophet, Passion Java’s false prophecy has been exposed after prominent African Apostolic Church leader, Paul Mwazha, now aged 106, entered the New Year alive. This followed Java’s earlier false claim that Mwazha also referred to as “Mutumwa” would die before January 2025. On November 1, 2024, Java claimed he had</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/clergyman-paul-mwazha-enters-2025-aged-106-and-still-counting-leaving-passion-java-exposed-amid-false-death-prophesy/\">Clergyman Paul Mwazha enters 2025 aged 106 and still counting leaving Passion Java exposed amid false death prophesy </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:28",
            "date": "02 Jan 2025"
        },
        {
            "title": "Ecobank’s US$4 million heist money was never found in Chitungwiza— ZRP",
            "url": "https://www.newzimbabwe.com/ecobanks-us4-million-heist-money-was-never-found-in-chitungwiza-zrp/",
            "content": "By Tapiwa Svondo\n\nTHE Zimbabwe Republic Police (ZRP) has dismissed viral social media reports suggesting the discovery of a portion of the US$4 million stolen in a Bulawayo bank robbery.\n\nThis comes after viral audios that are circulating on the social media pointing out that in Chitungwiza, Seke, Unit F there were people who discovered large sums of money in a room that they also suspect to be part of the US$4 million seized during an Ecobank robbery in Bulawayo.\n\nThere have not been any arrests since the money heist.\n\nIn a statement, the ZRP Commissioner Paul Nyathi, said the public should refrain from spreading misinformation on social media platforms, as evidenced by the recent events in the Chitungwiza drama.\n\nThe ZRP dismisses viral social media posts on alleged discovery of part of US$4 million Bulawayo bank robbery heist at a certain house in Unit F, Seke, Chitungwiza.\n\nThe allegations are false and should be dismissed with the contempt they deserve.\n\nThe ZRP warns the public, especially criminal elements against abuse of social media platforms to engage in criminal activities as revealed by this incident, said Nyathi\n\nFollowing the spread of the misleading posts, police noted that the incident was sparked by locals, who forcibly entered the home of a local businessman while he was away and stole US$13,500.\n\nPolice have established that after the viral social media post, the public forced entry into the local businessmans house, damaged property and some took away US$13 500. The businessman runs a hardware in Harare Central Business District and was away at the time of the incident.\n\nThe public did not find part of the US$4 million heist as alleged on the social media platforms.\n\nThe public is urged to be cautious and avoid being reactionary to false social media messages, said Nyathi.\n\nZRP is conducting investigations into the US$13,500 that was stolen.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/10180145/ecobank-robbery-711x470-1.webp",
            "description": "<p>By Tapiwa Svondo  THE Zimbabwe Republic Police (ZRP) has dismissed viral social media reports suggesting the discovery of a portion of the US$4 million stolen in a Bulawayo bank robbery. This comes after viral audios that are circulating on the social media pointing out that in Chitungwiza, Seke, Unit F there were people who discovered</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ecobanks-us4-million-heist-money-was-never-found-in-chitungwiza-zrp/\">Ecobank’s US$4 million heist money was never found in Chitungwiza— ZRP</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:28",
            "date": "02 Jan 2025"
        },
        {
            "title": "Pension and insurance industry bankrolls renewable energy project to boost Zimbabwe’s power self-sufficiency, spur economic growth",
            "url": "https://www.newzimbabwe.com/pension-and-insurance-industry-bankrolls-renewable-energy-project-to-boost-zimbabwes-power-self-sufficiency-spur-economic-growth/",
            "content": "By James Muonwa l Mashonaland West Correspondent\n\nAMID a worsening electricity deficit that has resulted in average households experiencing 18-hour blackouts, the need for alternative energy sources cannot be overemphasized.\n\nAfter realising the efficacy of accelerating the deployment of solar plants to the countrys energy mix, stakeholders in the insurance and pensions industry have invested in a solar power project located in Mashonaland West province, which has confirmed its status as not only the breadbasket of Zimbabwe, but the energy basket as well.\n\nAlready, the province is home to the countrys foremost hydroelectricity generation plant at Kariba.\n\nNow, through significant investment by the National Social Security Authority (NSSA) and Old Mutual Limited life has been breathed into a new solar power plant called Centragrid Nyabira Solar PV Park.\n\nThe independent power producer is licensed to own, finance, construct, and operate a 25MW solar power plant and its associated transmission facilities at Nyabira.\n\nNSSA and pan-African financial services group Old Mutual put a combined investment of $30 million in the solar power project.\n\nIt is, therefore, a refreshing reality that the pensions and insurance industry is contributing significantly towards the countrys socio-economic growth with players embarking on the transformative infrastructural development sitting on 50 hectares of land.\n\nMinister of State for Provincial Affairs and Devolution for Mashonaland West, Marian Chombo hailed the milestone infrastructural development that consolidates the provinces tag as a power house.\n\nMashonaland West is a power-producing province, and we have set the conditions for investors to come and invest in the energy sector. We need to produce more power to meet our energy needs, said Chombo.\n\nThere is still scope for more projects to ensure Zimbabwe has adequate energy for domestic consumption and surplus for export. We are particularly impressed by the solar power plant in our province.\n\nThe expansion of the solar farm and its associated transmission facilities followed an impact investment strategy of Old Mutual Limited and NSSA that was announced in December 2021.\n\nThe power plant is located at the 35km mark along the Harare-Chirundu highway, and it is now feeding into the grid, thanks to local pension fund, NSSA, as well as the investment arms of Old Mutual for helping make the project a reality. It is now the second largest utility-scale plant in Zimbabwe.\n\nCentragrid plant manager, Engineer Tariro Muka said the power from the solar panels feeds into the national grid through the 88KV Norton to Mazowe powerline, reiterating the need to embrace clean energy.\n\nConsidering issues of global warming and climate change, it is important for us to go green. That will be a significant step in reducing global warming, said Muka.\n\nEnergy expert, Munashe Ngwerume told NewZimbabwe.com that locally-funded solar power plants could help alleviate the countrys electricity generation shortfall in a short space of time.\n\nSolar plants of this size can be built fairly quickly and can be up and running in under a year. The biggest challenge experienced by independent power producers in Zimbabwe is lack of funding.\n\nWith foreign funding having proven to be difficult to secure for most developers for over a decade due to several factors, including the countrys high risk profile, a locally-funded model based on the learnings from Centragrids first 25MW plant as well as the government putting its own resources into the mix as it did with the accelerated road rehabilitation project, could change the game for local IPPs, said Ngwerume.\n\nAt current pricing, Ngwerume emphasised, going solar is attractive right now due to the incredible reduction in the price of solar panels.\n\nA 25MWp solar PV plant can now probably be constructed for about $20 million in this part of the world at current prices.\n\nThis cost includes all the development, permitting, and construction costs up to the Commercial Operation Date (COD)Zimbabwe has 10 provinces, they could even build one plant in each province for easier integration into the grid and also spread the solar love around the country equitably.\n\nAdding four of these 25MW plants to each province would get 1GWp of good installed nameplate solar capacity in a very short time.\n\nNgwerume said Zimbabwe needs cheaper, faster-to-build electricity generation plants hence the Centragrid solar PV project aligns with governments efforts in scaling up renewable energy capacity\n\nGovernment has targeted to generate 16.5% of total electricity or 1,100 MW from renewables by 2025, and 26.5 % of total generation or 2,100 MW from renewables by 2030.\n\nThe investment comes at a time when Zimbabwe faces a power deficit of around 600 MW to 700 MW, according to energy estimates by authorities. This deficit is due to severe climate changes that lowered the dam levels at the countrys largest electricity generation station, the Kariba South Hydro Power Plant.\n\nCentragrid founder and managing director, Victor Utedzi was recently quoted in the media expressing pride in the project, highlighting the importance of local investment in driving Africas energy future.\n\nThis flagship project stands as a testament to what can be accomplished by local investors in Africa in the pursuit of alleviating energy shortages, Utedzi said.\n\nThe Nyabira solar plant is one of the first IPPs to connect to Zimbabwes national grid, and its expansion further cements its role as a key player in the countrys renewable energy landscape. The increased capacity will contribute to the national grid, offering much-needed relief to Zimbabwes energy supply challenges.\n\nThe success of this project is seen as a model for other renewable energy initiatives across the country, with hopes that more locally funded projects will follow suit to reduce dependency on external capital and improve energy security.\n\nUtedzi said the project was critical to Zimbabwes intention to add about 4 000 MW of electricity by 2030, given the growing demand for electricity.\n\nHe acknowledged there is a lot of demand for electricity in new industries coming up, taking advantage of favourable investment conditions created by President Emmerson Mnangagwas government.\n\nMining, agricultural, manufacturing and tourism sectors are growing significantly and demand more electricity.\n\nSo, we need to add more electricity to this country and Centragrid is that first step of the large-scale renewable energy projects that are adding to electricity generation in Zimbabwe, said Utedzi.\n\nLiu Yachen, the Sinohydro project manager for the solar project said at the peak of the project, employed about 400 locals and about 10 Chinese experts.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/01/29093058/Solar.jpg",
            "description": "<p>By James Muonwa l Mashonaland West Correspondent  AMID a worsening electricity deficit that has resulted in average households experiencing 18-hour blackouts, the need for alternative energy sources cannot be overemphasized. After realising the efficacy of accelerating the deployment of solar plants to the country’s energy mix, stakeholders in the insurance and pensions industry have invested</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pension-and-insurance-industry-bankrolls-renewable-energy-project-to-boost-zimbabwes-power-self-sufficiency-spur-economic-growth/\">Pension and insurance industry bankrolls renewable energy project to boost Zimbabwe’s power self-sufficiency, spur economic growth</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:28",
            "date": "02 Jan 2025"
        },
        {
            "title": "‘You are just a comical noisemaker who can’t come back home’— exiled former minister told as Ian Smith, Mnangagwa comparison rages",
            "url": "https://www.newzimbabwe.com/you-are-just-a-comical-noisemaker-who-cant-come-back-home-exiled-former-minister-told-as-ian-smith-mnangagwa-comparison-rages/",
            "content": "By Staff Reporter\n\nFORMER opposition Member of Parliament (MP) Fadzai Mahere has taken to X to caution exiled ex-Cabinet minister Jonathan Moyo against giving political advice as he is not just making comical noise but also failing to come back home.\n\nMaheres backlash follows attempts by Moyo to chastise opposition figure Nelson Chamisa for having supporters, who believe the colonial era was way better than both President Emmerson Mnangagwas new dispensation and his predecessor Robert Mugabes regime.\n\nMoyo, who up until being snubbed by Mahere and colleagues then in the Citizens Coalition for Change (CCC), had been all cosy with the opposition officials, seemed to blast Chamisa for remaining mum as his supporters questioned the true independence of Zimbabwe while comparing how they were living and being treated to former Prime Minister Ian Smiths colonial era.\n\nNo political dividend will come out of it for you. None, whatsoever! read part of Moyos statement that was widely believed to have been targeting Chamisa.\n\nThe issue was hot topic on social media over the festive season as Zimbabweans focused on the harsh economic climate the country finds itself in.\n\nIf you are that exiled political leader trying to bark instructions from a hole and tell people how they can attain power when you cannot even attain entry into the republic, no political dividend will come out of this for you. Never, said Mahere in response.\n\nAll you are is comical noise trying to attribute views of ordinary citizens to someone who is not responsible for them, who is minding their business and enjoying their holiday.\n\nIf you think you can pull the strings here and make real political actors your puppets, forget it!\n\nChamisa took time to share images of himself on holiday at his rural Gutu home.\n\nMoyo is believed to be in Kenya, having fled Mnangagwas 2017 coup after attempts on his life were made by soldiers looking for him at his Harare home.\n\nAccording to a short narration of events soon after he resurfaced alive, Moyo was assisted to flee by former first lady Grace Mugabe as Mnangagwa, his deputy Constantino Chiwenga and the armys Valerio Sibanda all bayed for his blood and that of his G40 faction members.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/03/06225846/Jonathan-Moyo.jpg",
            "description": "<p>By Staff Reporter FORMER opposition Member of Parliament (MP) Fadzai Mahere has taken to X to caution exiled ex-Cabinet minister Jonathan Moyo against giving political advice as he is not just making comical noise but also failing to come back home. Mahere’s backlash follows attempts by Moyo to chastise opposition figure Nelson Chamisa for having</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/you-are-just-a-comical-noisemaker-who-cant-come-back-home-exiled-former-minister-told-as-ian-smith-mnangagwa-comparison-rages/\">‘You are just a comical noisemaker who can’t come back home’— exiled former minister told as Ian Smith, Mnangagwa comparison rages</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:28",
            "date": "02 Jan 2025"
        },
        {
            "title": "Police officer killed as truck attempts to evade roadblock",
            "url": "https://www.newzimbabwe.com/police-officer-killed-as-truck-attempts-to-evade-roadblock/",
            "content": "By Staff Reporter\n\nA ZIMBABWE Republic Police (ZRP) officer tragically lost his life in a road traffic accident while on duty at a roadblock along the Mazowe-Centenary road.\n\nPolice confirmed the fatal incident that occurred around 5:50 PM at the 42 km peg.In a statement, the ZRP said, the now deceased was conducting routine roadblock checks when the truck tried to bypass the checkpoint without stopping resulting in the officer being struck on the head by the trailer.The ZRP confirms a fatal road traffic accident which occurred on December 30, 2024, at around 1750 hours at the 42 km peg along Mazowe-Centenary road, Mvurwi in which a police officer was killed.The police officer was conducting roadblock duties when a Freightliner Columbia truck travelling towards Mazowe with no passengers on board, evaded the checkpoint and hit him on the head with the trailer, police said.The vehicle only came to a halt when it collided with a stationary Nissan X-Trail at the checkpoint.Subsequently, the truck collided with a Nissan X-trail vehicle which was stationary at the roadblock site. The police officer sustained head injuries and was pronounced dead upon arrival at Mvurwi Hospital.\n\nPolice confirmed the fatal incident that occurred around 5:50 PM at the 42 km peg.\n\nIn a statement, the ZRP said, the now deceased was conducting routine roadblock checks when the truck tried to bypass the checkpoint without stopping resulting in the officer being struck on the head by the trailer.The ZRP confirms a fatal road traffic accident which occurred on December 30, 2024, at around 1750 hours at the 42 km peg along Mazowe-Centenary road, Mvurwi in which a police officer was killed.The police officer was conducting roadblock duties when a Freightliner Columbia truck travelling towards Mazowe with no passengers on board, evaded the checkpoint and hit him on the head with the trailer, police said.The vehicle only came to a halt when it collided with a stationary Nissan X-Trail at the checkpoint.Subsequently, the truck collided with a Nissan X-trail vehicle which was stationary at the roadblock site. The police officer sustained head injuries and was pronounced dead upon arrival at Mvurwi Hospital.\n\nIn a statement, the ZRP said, the now deceased was conducting routine roadblock checks when the truck tried to bypass the checkpoint without stopping resulting in the officer being struck on the head by the trailer.\n\nThe ZRP confirms a fatal road traffic accident which occurred on December 30, 2024, at around 1750 hours at the 42 km peg along Mazowe-Centenary road, Mvurwi in which a police officer was killed.The police officer was conducting roadblock duties when a Freightliner Columbia truck travelling towards Mazowe with no passengers on board, evaded the checkpoint and hit him on the head with the trailer, police said.The vehicle only came to a halt when it collided with a stationary Nissan X-Trail at the checkpoint.Subsequently, the truck collided with a Nissan X-trail vehicle which was stationary at the roadblock site. The police officer sustained head injuries and was pronounced dead upon arrival at Mvurwi Hospital.\n\nThe ZRP confirms a fatal road traffic accident which occurred on December 30, 2024, at around 1750 hours at the 42 km peg along Mazowe-Centenary road, Mvurwi in which a police officer was killed.\n\nThe police officer was conducting roadblock duties when a Freightliner Columbia truck travelling towards Mazowe with no passengers on board, evaded the checkpoint and hit him on the head with the trailer, police said.The vehicle only came to a halt when it collided with a stationary Nissan X-Trail at the checkpoint.Subsequently, the truck collided with a Nissan X-trail vehicle which was stationary at the roadblock site. The police officer sustained head injuries and was pronounced dead upon arrival at Mvurwi Hospital.\n\nThe police officer was conducting roadblock duties when a Freightliner Columbia truck travelling towards Mazowe with no passengers on board, evaded the checkpoint and hit him on the head with the trailer, police said.\n\nThe vehicle only came to a halt when it collided with a stationary Nissan X-Trail at the checkpoint.Subsequently, the truck collided with a Nissan X-trail vehicle which was stationary at the roadblock site. The police officer sustained head injuries and was pronounced dead upon arrival at Mvurwi Hospital.\n\nThe vehicle only came to a halt when it collided with a stationary Nissan X-Trail at the checkpoint.\n\nSubsequently, the truck collided with a Nissan X-trail vehicle which was stationary at the roadblock site. The police officer sustained head injuries and was pronounced dead upon arrival at Mvurwi Hospital.\n\nSubsequently, the truck collided with a Nissan X-trail vehicle which was stationary at the roadblock site. The police officer sustained head injuries and was pronounced dead upon arrival at Mvurwi Hospital.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/10/16041506/Roadblock.jpg",
            "description": "<p>By Staff Reporter  A ZIMBABWE Republic Police (ZRP) officer tragically lost his life in a road traffic accident while on duty at a roadblock along the Mazowe-Centenary road. Police confirmed the fatal incident that occurred around 5:50 PM at the 42 km peg. In a statement, the ZRP said, the now deceased was conducting routine</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/police-officer-killed-as-truck-attempts-to-evade-roadblock/\">Police officer killed as truck attempts to evade roadblock </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:28",
            "date": "02 Jan 2025"
        },
        {
            "title": "Local premiership soccer players announce transfers",
            "url": "https://www.newzimbabwe.com/local-premiership-soccer-players-announce-transfers/",
            "content": "By Staff Reporter\n\nDYNAMOS midfielder Donald Mudadi is one of many stars that have already bid farewell to their clubs this New Year in what promises to be a very active and interesting transfer window.\n\nMudadi, who has been undeniably one of the top performers at Dynamos in two seasons, was on the radar of Castle Lager premiership champions Simba Bhora and Gweru based TelOne who almost signed him during last terms mid-season window.\n\nMonied Scottland FC cannot be dismissed as a possible new home as the club has been signing every star it can lay its hands on, with FC Platinum another option.\n\nI have enjoyed my tenure here and I appreciate having had the opportunity to represent the blue family, said Mudadi.\n\nEven though I will miss my colleagues and the team, I am looking forward to this new challenge and starting a new phase in my career.\n\nLot Chiwunga, Caps Uniteds unlucky forward has signed for Herentals to strengthen a strike line up already boasting of John Zhuwawu.\n\nChiwunga never scaled heights he had set for himself as a lethal scorer. He struggled for both goals and game time at Makepekepe.\n\nGoalkeeper Tonderayi Mateyaunga is also leaving the club after six seasons.\n\nNow is time to bid the entire Caps United family goodbye as I embark on the next chapter of my career. No matter where I am, this club will always hold a special place in my heart, said Mateyaunga whose next stop is yet to be made public.\n\nFormer ZPC Kariba defender Nyasha Gurende also bade farewell to Chauya Chituruturu.\n\nGurende reportedly signed for Ngezi Platinum a few weeks before Christmas, putting an end to interests shown by Dynamos after his stellar 2024 season.\n\nThis team has been more than just a group of players, it has been a family, said Gurende.\n\nWhile I step into a new journey, ZPC Kariba will always hold a special place in my heart.\n\nTraditional giants Dynamos and Highlanders might struggle to retain much of their prized talent because of lowly wages, poor working conditions and general administrative disaster at both clubs.\n\nAlready Bosso has lost captain Peter Muduhwa and top striker Lynoth Chikuhwa to Scottland while the exit of Tanaka Shandirwa could signal a mini exodus from DeMbare.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/01180943/Donald-Mudadi.jpg",
            "description": "<p>By Staff Reporter DYNAMOS midfielder Donald Mudadi is one of many stars that have already bid farewell to their clubs this New Year in what promises to be a very active and interesting transfer window. Mudadi, who has been undeniably one of the top performers at Dynamos in two seasons, was on the radar of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/local-premiership-soccer-players-announce-transfers/\">Local premiership soccer players announce transfers </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:28",
            "date": "02 Jan 2025"
        },
        {
            "title": "Zimbabwe to work with Russia, IAEA to establish nuclear energy",
            "url": "https://www.newzimbabwe.com/zimbabwe-to-work-with-russia-iaea-to-establish-nuclear-energy/",
            "content": "VOA\n\nZimbabwe is working with the International Atomic Energy Agency and Russian investors to establish nuclear energy as part of its efforts to end the countrys chronic power shortages, government officials said Thursday.\n\nThe nation has expressed its interest in nuclear power to the IAEA, said Edgar Moyo, Minister of Energy and Power Development, and hopes to develop small, modular reactors.\n\nThey have indicated their willingness to take us through paces until we get there, Moyo told journalists.\n\nEstablishing nuclear power is expensive and complex, said Joseph Siegle, the director of research at the Africa Center for Strategic Studies in Washington, which is the reason countries such as South Africa and Egypt have sought Russias assistance.\n\nThe process is also ripe for corruption, he said, so transparency is critical.\n\nMost economists would argue that those deals cost far more than are warranted for the benefits that they would provide to their economies and to their societies, Siegle said, and so theres a worry that these huge infrastructure projects become a source of corruption, both in the country where it is being built, but also vis-a-vis the state-owned enterprises that the Russians provide to build the plant.\n\nIn the end, it becomes the public in the country that is building the plant that would be responsible for paying off these costs, he said.\n\nZimbabwe says its goal is to have 4,000 megawatts of power capacity by 2035 and end years of power cuts that can sometimes last up to 18 hours per day.\n\nSiegle said Zimbabwes power needs do not warrant a traditional large-scale nuclear reactor and suggested that the government study the lasting impact of waste disposal.\n\n[This] has always been a concern with nuclear energy  what you do with the waste, which requires some 10,000 years for the radioactive elements to decay and not pose a health risk to society, he said.\n\nNuclear power also heightens security risks, Siegle said.\n\nGloria Magombo, secretary for energy and power development, said at the media briefing that Zimbabwe aims to increase the use of other renewable energies besides hydropower, given the nations recurring droughts.\n\nShe mentioned solar, wind and mini-hydro stations.\n\nWe are we are looking at coming in by 2030 with up to about 2,000 megawatts from those sources, Magombo said.\n\nZimbabwes current capacity for power generation is about 2,600 megawatts, according to the government. The actual daily generation is roughly half of that.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/31212646/Edgar-Moyo.webp",
            "description": "<p>VOA Zimbabwe is working with the International Atomic Energy Agency and Russian investors to establish nuclear energy as part of its efforts to end the country’s chronic power shortages, government officials said Thursday. The nation has expressed its interest in nuclear power to the IAEA, said Edgar Moyo, Minister of Energy and Power Development, and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-to-work-with-russia-iaea-to-establish-nuclear-energy/\">Zimbabwe to work with Russia, IAEA to establish nuclear energy</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:28",
            "date": "02 Jan 2025"
        },
        {
            "title": "Zimbabwe’s new currency woes hit traditional stores while illegal night bazaars flourish",
            "url": "https://www.newzimbabwe.com/zimbabwes-new-currency-woes-hit-traditional-stores-while-illegal-night-bazaars-flourish/",
            "content": "AP\n\nBatsirai Pabwe picked detergents, toothpaste, snacks and some pasta among several grocery items spread on the tarmac of a car parking space  an unorthodox night bazaar lit by cellphone flashlights and fluorescent lamps inZimbabwescapital, Harare.\n\nTraditional stores are struggling to survive as the volatility ofZimbabwes new currency pushes prices up. Many like Pabwe now shun them for much cheaper informal markets that pop up at night to avoid the glare of authorities.\n\nFrom dusk, sidewalks, store or office verandahs and car parking spaces burst into unorthodox open air bazaars, offering anything from groceries to fresh meat, electronics, clothes, medicines, fashion accessories and stationery.\n\nUnfettered by expenses such as rising energy costs, taxes and laws that force formal retailers to accept the local currency at artificially low official exchange rates, informal traders, including children, offer better bargains. A box of juice that sells for $3 in a supermarket costs half of that on the street.\n\nIts my first time shopping here. My friend told me that its much cheaper than the supermarkets, 30-year-old Pabwe said, visibly relieved as he filled up a plastic bag with items for just $20. I decided to give it a try and I really enjoyed it.\n\nThe once-prosperous southern African nation of 15 million people in April introduced a new gold-backed currency called ZiG, short for Zimbabwe Gold, to replace one that had been battered by depreciation and often outright rejection by the people.\n\nIt is the countrys sixth attempt at a new currency since the spectacular 2009 collapse of the Zimbabwe dollar and adoption of the U.S. dollar as legal tender amid hyperinflation of 5 billion percent, one of the worlds worst currency crashes to date. The U.S. dollar has since remained legal tender alongside successive local currencies.\n\nThe latest currency, the worlds newest, came with pomp and fanfare  promotional catchy jingles and songs played repeatedly on public radio, television and online.\n\nSeven months on, the ZiG seems to be tanking, like its predecessors. The gap between official and black market exchange rates continues to widen, with many people and informal traders who dominate the economy again preferring the more stable dollar.\n\nTraditional stores, forced by authorities to charge using the local currency, are increasing prices to make ends meet. But they have also become uncompetitive against unregulated informal markets, the Retailers Association of Zimbabwe, an industry representative group, said in September.\n\nIt warned of store closures, saying the situation is clearly untenable.\n\nIn October, Pick n Pay, one of Africas biggest grocery chains that operates more than 70 stores jointly with a local partner in Zimbabwe, said that it had impaired its investment in Zimbabwe to a book value of zero because of the deteriorating economic conditions.\n\nIn every transaction business is doing in the formal setup, its making an exchange rate loss that cannot be compensated. The major issue here is a currency crisis, said Gift Mugano, an economics professor. Huge overheads worsen the retailers situation.\n\nEverything is against their survival. The informal sector works at night, (if there is) no electricity they use their phones, they dont care. They are there for survival, Mugano said.\n\nThe contrast is palpable in Harares Central Business District, where only a few shoppers solemnly scanned prices in a supermarket on a recent day.\n\nSoothing music played from speakers inside but was drowned out by the buzz created outside by hordes of street vendors shouting out bargains to a sea of shoppers.\n\nBusiness is booming, said Oswald Gari, a vendor, adding that he only works at night when the police leave.\n\nGari, 51, said hes fending for his six children and four nephews under his care from the night trade. He harbors no hope of finding formal employment in a country where once roaring industrial sites are being turned into giant warehouses for imported goods, many which end up on the streets, and rail tracks are now overgrown with weeds.\n\nMore than 80% of Zimbabwes employable population ekes out a living in the informal sector, according to official figures and the International Labor Organization.\n\nFor Pabwe, shopping from the informal night markets means less headaches.\n\nIts quite confusing, especially for people like me who really dont understand the value of the ZiG. I always get confused when I get into supermarkets, he said.\n\nHe was satisfied with his shopping at night bazaar.\n\nI got everything I was looking for and the pricing is really affordable. I actually managed to buy a handful for just $20. I even got my washing powder and dishwashing liquid, he said. I think I will do this more often.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/23123737/Harare-Night-Streets.jpg",
            "description": "<p>AP Batsirai Pabwe picked detergents, toothpaste, snacks and some pasta among several grocery items spread on the tarmac of a car parking space — an unorthodox night bazaar lit by cellphone flashlights and fluorescent lamps in Zimbabwe’s capital, Harare. Traditional stores are struggling to survive as the volatility of Zimbabwe’s new currency pushes prices up. Many like</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-new-currency-woes-hit-traditional-stores-while-illegal-night-bazaars-flourish/\">Zimbabwe’s new currency woes hit traditional stores while illegal night bazaars flourish</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:28",
            "date": "02 Jan 2025"
        },
        {
            "title": "Angelina Jolie and Brad Pitt reach divorce settlement after 8 years",
            "url": "https://www.newzimbabwe.com/angelina-jolie-and-brad-pitt-reach-divorce-settlement-after-8-years/",
            "content": "AP\n\nAngelina JolieandBrad Pitthave reached a divorce settlement, her lawyer said Monday, bringing an apparent end to one of the longest and most contentious divorces in Hollywood history.\n\nJolies attorney James Simon confirmed to The Associated Press that the couple had come to a deal. News of the settlement was first reported by People magazine.\n\nMore than eight years ago, Angelina filed for divorce from Mr. Pitt, Simon said in a statement. She and the children left all of the properties they had shared with Mr. Pitt, and since that time she has focused on finding peace and healing for their family. This is just one part of a long ongoing process that started eight years ago. Frankly, Angelina is exhausted, but she is relieved this one part is over.\n\nNo court documents have been filed yet, and a judge will need to sign off on the agreement. An email late Monday night to Pitts attorney seeking comment was not immediately answered.\n\nJolie, 49, and Pitt, 61, were among Hollywoods most prominent couples for 12 years. The two Oscar winners have six children together.\n\nJoliefiled for divorce in 2016,after a private jet flight from Europe during which she said Pitt was abusive toward her and their children. A judge in 2019declared them divorced and single,but the splitting of assets and child custody needed to be separately settled.\n\nA private judge that the two had hired to handle the case reached a decision soon after that included equal custody of their children, but Joliefiled to have him removedfrom the case over an unreported conflict of interest. An appeals court agreed, the judge was removed, and the couple had to start over.\n\nNo details of the agreement were immediately revealed, and the couples use of the private judge  an increasingly common move among splitting celebrities in recent years  has kept the proceedings largely under wraps. Some details, however, have been revealed through a separate lawsuit filed by Pitt, in which he alleged Jolie reneged on an agreement that she would sell him her half of a French winery the two owned together. Its not clear how the divorce agreement will affect that lawsuit.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/07014513/Pitt-Jolie.jpeg",
            "description": "<p>AP Angelina Jolie and Brad Pitt have reached a divorce settlement, her lawyer said Monday, bringing an apparent end to one of the longest and most contentious divorces in Hollywood history. Jolie’s attorney James Simon confirmed to The Associated Press that the couple had come to a deal. News of the settlement was first reported by People magazine.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/angelina-jolie-and-brad-pitt-reach-divorce-settlement-after-8-years/\">Angelina Jolie and Brad Pitt reach divorce settlement after 8 years</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:28",
            "date": "02 Jan 2025"
        }
    ]
}