{
    "news": [
        {
            "title": "Zimbabwe on track for 6% growth as economy recovers from drought",
            "url": "https://www.newzimbabwe.com/zimbabwe-on-track-for-6-growth-as-economy-recovers-from-drought/",
            "content": "Reuters\n\nZimbabwe is on track to achieve a forecasted 6% economic growth in 2025 helped by good agricultural output and strong commodity prices, Finance Minister Mthuli Ncube said on Thursday.\n\nThe Southern African countrys economy has shown signs of recovery in the first half of the year following a severe drought and currency turbulence in 2024 that pushedGDP growth down to 2%.\n\nGiven the positive economic developments during the period January to June, we are confident that the projected economic growth of 6% alluded to in the 2025 National Budget is achievable, Ncube told parliament in a mid-year budget review.\n\nAll sectors of the economy are expected to record positive growth in 2025, mainly on account of a favourable agriculture season, improved electricity generation, stable exchange rate and inflation rate, he said.\n\nHe did not give an update on the budget deficit, which was seen at 0.4% of gross domestic product in 2025 during the budget forecast last November.\n\nZimbabwes fiscal position remains under strain from grain imports, drought relief spending and the public sector wage bill. While the government has collected more revenue than in the same period last year, analysts say containing the deficit may prove difficult without new fiscal measures.\n\nThe local currency, the ZiG, launched in April 2024 to replace the Zimbabwe dollar, has largely remained stable against the U.S. dollar but is still overshadowed by widespread use of the dollar in everyday transactions.\n\nNcube reiterated the governments commitment to the gold-backed unit and said the currency had benefited from tight monetary and fiscal policies.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/19181244/Vendors-4.jpg",
            "description": "<p>Reuters Zimbabwe is on track to achieve a forecasted 6% economic growth in 2025 helped by good agricultural output and strong commodity prices, Finance Minister Mthuli Ncube said on Thursday. The Southern African country’s economy has shown signs of recovery in the first half of the year following a severe drought and currency turbulence in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-on-track-for-6-growth-as-economy-recovers-from-drought/\">Zimbabwe on track for 6% growth as economy recovers from drought</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:10",
            "date": "01 Aug 2025"
        },
        {
            "title": "Minister Garwe defends government, blames Chitungwiza Municipality for delayed response to Seke Road accident",
            "url": "https://www.newzimbabwe.com/minister-garwe-defends-government-blames-chitungwiza-municipality-for-delayed-response-to-seke-road-accident/",
            "content": "By Darlington Gatsi\n\nLocal Government Minister Daniel Garwe has insisted that the Civil Protection Department responded well and swiftly to the Seke Road accident that claimed 17 lives, despite criticism over the slow emergency response.\n\nSeventeen people died when a haulage truck veered off the road, swerving into the opposite lane and colliding with an oncoming minibus along Seke Road last week.\n\nThe accident exposed the governments weak emergency response mechanisms, with eyewitnesses reporting that many victims died on the accident scene due to the absence of a rescue crane.\n\nResponding to questions in the National Assembly recently, Minister of Local Government and Public Works, Daniel Garwe, defended the governments handling of the tragedy.\n\nThe issue of responsiveness in terms of time taken is subject to the time that the accident is reported to the responsible authority, in this case, the Civil Protection Department.\n\nWe cannot say the Ministry failed to respond timeously. It depends on the time when the incident was reported. I will have to find out the time that was taken to receive the response and the time we went to the site, said Garwe.\n\nHe added:The issue of having cranes on site also depends on how the accident was reported. Maybe people just reported that there was an accident along the Chitungwiza Road at a river bridge without giving the intimate details of how the accident was reported.\n\nSo, we cannot answer that in that regard, it is very difficult, but from the Civil Protection Department side, the Government is doing extremely well. We responded swiftly.\n\nFollowing the horrific crash, the government faced criticism from observers and opposition figures, including Nelson Chamisa, over its lack of preparedness for emergencies.\n\nHowever, Garwe shifted blame onto the Chitungwiza Municipality, accusing it of a delayed response despite being equipped to handle such situations.\n\nAt the Chitungwiza Road accident, the Department of Civil Protection was there first before everybody else and the fire tenders which came from Harare, were also activated by that department.\n\nMadam Speaker, you may want to know that the Government has capacitated all 92 local authorities with firefighting equipment to use in situations such as what happened last week on Friday in Chitungwiza, where a road traffic accident cost the lives of 17 of our citizens.\n\nAll local authorities in the urban areas were equipped with at least two fire tenders each and we wanted to sit down and ask the local authority responsible in Chitungwiza why its reaction was so slow and to ask the city council to come and assist, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/22133122/1000794263-scaled.jpg",
            "description": "<p>By Darlington Gatsi Local Government Minister Daniel Garwe has insisted that the Civil Protection Department responded “well and swiftly” to the Seke Road accident that claimed 17 lives, despite criticism over the slow emergency response. Seventeen people died when a haulage truck veered off the road, swerving into the opposite lane and colliding with an</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/minister-garwe-defends-government-blames-chitungwiza-municipality-for-delayed-response-to-seke-road-accident/\">Minister Garwe defends government, blames Chitungwiza Municipality for delayed response to Seke Road accident</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:10",
            "date": "01 Aug 2025"
        },
        {
            "title": "National Sports Stadium renovations delay as World Cup Qualifiers loom for homeless Warriors",
            "url": "https://www.newzimbabwe.com/national-sports-stadium-renovations-delay-as-world-cup-qualifiers-loom-for-homeless-warriors/",
            "content": "By Darlington Gatsi\n\nGOVERNMENT is racing against time to complete the renovation of the National Sports Stadium, with doubts growing over whether the Zimbabwe national team will play their remaining World Cup qualifiers on home soil.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/08040038/WhatsApp-Image-2025-05-07-at-22.29.25.jpeg",
            "description": "<p>By Darlington Gatsi GOVERNMENT is racing against time to complete the renovation of the National Sports Stadium, with doubts growing over whether the Zimbabwe national team will play their remaining World Cup qualifiers on home soil. The stadium has been undergoing renovations after being deemed unfit to host international matches in 2021 by the Confederation</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/national-sports-stadium-renovations-delay-as-world-cup-qualifiers-loom-for-homeless-warriors/\">National Sports Stadium renovations delay as World Cup Qualifiers loom for homeless Warriors</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:10",
            "date": "01 Aug 2025"
        },
        {
            "title": "Polokwane Mayor defends merit-based appointment of Zimbabwean engineer Kennedy Chihota amid public backlash",
            "url": "https://www.newzimbabwe.com/polokwane-mayor-defends-merit-based-appointment-of-zimbabwean-engineer-kennedy-chihota-amid-public-backlash/",
            "content": "CentralNewsZA\n\nPolokwane Mayor John Mpe defends merit-based appointment of Zimbabwean engineer Kennedy Chihota amid public backlash, insisting the decision prioritises skills to tackle water challenges rather than politics or nationality.\n\nIn a media briefing held at Peter Mokaba Stadium on Thursday, Mayor John Mpe addressed growing criticism over the recent council approval of Kennedy Chihota, a Zimbabwean national, as the new Director of Water and Sanitation at Polokwane Municipality. Mpe stressed that the choice was driven by Chihotas strong qualifications and experience, which he believes will help fix long-standing water shortages and infrastructure issues in the city.\n\nChihota is a professionally registered engineer (ECSA) and holds: a Bachelors Degree in Civil Engineering (University of Zimbabwe), Mpe said, highlighting the engineers academic background. He added that Chihota also has Four Masters Degrees in: Water Resources Engineering & Management (University of Zimbabwe), Business Administration (University of Zimbabwe), Property Development (University of the Witwatersrand), and Engineering (University of Stellenbosch).\n\nThis defence comes after widespread public outcry on social media and in local communities, where some residents accused the municipality of favouring foreign nationals over South Africans amid high unemployment rates. The appointment has sparked debates about job opportunities for locals, especially in a province like Limpopo where water access remains a daily struggle for many.\n\nChihotas Qualifications and Experience Under the Spotlight\n\nMpe went into detail about why Chihota stood out during the selection process. He described the new director as a seasoned professional with over 20 years in water systems management, mostly in South African municipalities. He brings experience from: University of Limpopo (Senior Lecturer), Capricorn District Municipality (PMU Manager, Water Services Manager, and Senior Manager for Infrastructure), City of Cape Town, Johannesburg Water, and City of Ekurhuleni, Managing Director at Ekurhuleni Water Care Company, the mayor explained. Mpe made it clear that with such a track record, the municipality is not experimenting but executing on its plans to improve services.\n\nChihotas role is seen as key in dealing with Polokwanes water backlogs, which have left some areas without reliable supply for years. The city has faced ongoing problems like ageing pipes, leaks, and unequal distribution, made worse by rapid urban growth. Residents in townships often rely on communal taps or tankers, while rural parts battle droughts. Mpe argued that Chihotas expertise in water resources and infrastructure will speed up fixes, including upgrades to dams, treatment plants, and distribution networks. Supporters on social media have echoed this, with one user praising him as a seasoned engineer who has spent 20 years serving mostly municipality water systems, hoping for flowing taps of clean water.\n\nHowever, critics question if local talent was overlooked. Opposition parties like the Economic Freedom Fighters (EFF) and Democratic Alliance (DA) have called for transparency in the hiring process, pointing to thousands of unemployed South African engineers. They argue that while merit matters, the government should prioritise citizens in public jobs to fight poverty and build skills at home.\n\nBacklash Linked to Broader Allegations of Favouritism\n\nThe controversy around Chihotas appointment has been fuelled by recent claims that Polokwane Municipality awards tenders to foreign nationals, which Mpe confirmed but defended as merit-based. Just days before, explosive allegations surfaced about a R56 million tender for water infrastructure reportedly given to a company owned by the municipal manager Thuso Nemugumonis alleged Zimbabwean boyfriend. The deal, worth R56,309,901.35, involved supply and maintenance work, but opposition groups labelled it as nepotism and corruption. Mpe has denied any wrongdoing, calling the claims a smear campaign aimed at damaging the municipalitys image.\n\nSocial media has been ablaze with mixed views. Some posts slam the hire as spitting on the faces of voters, with one user noting qualified South African youth are overlooked while foreigners get top posts. Others defend it, saying, Zimbabweans are doing great and serving our communities well. The backlash has hints of xenophobia, with calls to put South Africans first amid economic hardships. Community groups worry this could strain relations with migrant workers who contribute to Limpopos economy in farming and services.\n\nNew Chief Operations Officer Appointed to Strengthen Leadership\n\nIn the same council meeting, Polokwane also named Babalwa Mosomane as the new Chief Operations Officer (COO), a move Mpe hailed as another step to boost efficiency. Mosomane brings a wealth of auditing and management skills to the role. She holds Postgraduate Diplomas in Forensic Auditing and Internal Auditing from UNISA, along with B-Tech and National Diplomas in Internal Auditing from Nelson Mandela Metropolitan University. Her other qualifications include the Municipal Finance Management Programme and Programme in Management Development from Wits Business School.\n\nMosomane is a certified internal audit practitioner, certified ethics practitioner, and a qualified quality assessor, accredited by the relevant professional bodies. Mpe said her expertise will help tighten controls on spending and fight corruption, especially after recent tender troubles. Her appointment has received less criticism, with many seeing it as a positive for good governance in the municipality.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/31195725/KENNEDY-CHIHOTA.webp",
            "description": "<p>CentralNewsZA Polokwane Mayor John Mpe defends merit-based appointment of Zimbabwean engineer Kennedy Chihota amid public backlash, insisting the decision prioritises skills to tackle water challenges rather than politics or nationality. In a media briefing held at Peter Mokaba Stadium on Thursday, Mayor John Mpe addressed growing criticism over the recent council approval of Kennedy Chihota,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/polokwane-mayor-defends-merit-based-appointment-of-zimbabwean-engineer-kennedy-chihota-amid-public-backlash/\">Polokwane Mayor defends merit-based appointment of Zimbabwean engineer Kennedy Chihota amid public backlash</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:10",
            "date": "01 Aug 2025"
        },
        {
            "title": "Mid-term Budget Review: Zimbabwe’s debt stock hits US$21.5 billion",
            "url": "https://www.newzimbabwe.com/mid-term-budget-review-zimbabwes-debt-stock-hits-us21-5-billion/",
            "content": "By Alois Vinga\n\nZIMBABWEs total debt stock has surged to US$21.5 billion, rising by an estimated US$1 billion from the official figures disclosed during the same period last year.\n\nThe unsustainable debt continues to choke Zimbabwes capacity to unlock external funding, with local debt being criticised for crowding out the private sector.\n\nPresenting the 2025 Mid-Term Budget Review Thursday, Finance Minister Mthuli Ncube said the debt stock comprises local and external debt.\n\nIn US$ terms, the total PPG debt as at end March 2025, amounted to US$21.5 billion, comprising external debt stock of US$12.6 billion and domestic debt stock of US$8.9 billion. This brings the debt-to-GDP ratio to 44% as at 31 March 2025, he said.\n\nIn local currency terms, the countrys stock of Public and Publicly Guaranteed (PPG) debt stood at ZiG576.5 billion as at the end of March 2025. The debt was external debt totalling ZiG337.7 billion, and domestic debt amounting to ZiG238.8 billion, representing 58.6% and 41.4% respectively.\n\nThe external and domestic debt arrears as at end March 2025 amounted to US$7.8 billion, constituting 36% of total PPG debt. The accumulation of arrears since the year 2000 have been worsening the country`s debt situation, constraining access to external concessional financing.\n\nIn this regard, the government is implementing the Arrears Clearance and Debt Resolution Roadmap in order to restore debt sustainability and unlock critical external financing needed for the countrys development programs, he said.\n\nDomestic debt service in local currency totalled ZiG1.64 billion, comprising both principal and interest payments during the period January to June 2025.\n\nDuring the period January to June 2025, Treasury made payments amounting to US$176.28 million for external debt service, which includes US$93.72 million towards the active portfolio, US$79.75 million for legacy debts and US$2.81 million of token payments to the International Financial Institutions and the sixteen Paris Club Bilateral Creditors.\n\nOf this, ZiG39.52 million was paid towards interest payments and ZiG1.60 billion for principal payments related to ZiG-denominated Treasury Bills and bonds.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/12/01093427/mthuli-1.jpg",
            "description": "<p>By Alois Vinga ZIMBABWE’s total debt stock has surged to US$21.5 billion, rising by an estimated US$1 billion from the official figures disclosed during the same period last year. The unsustainable debt continues to choke Zimbabwe‘s capacity to unlock external funding, with local debt being criticised for crowding out the private sector. Presenting the 2025</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mid-term-budget-review-zimbabwes-debt-stock-hits-us21-5-billion/\">Mid-term Budget Review: Zimbabwe’s debt stock hits US$21.5 billion</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:10",
            "date": "01 Aug 2025"
        }
    ]
}