{
    "news": [
        {
            "title": "ZACC clashes with NPA over Chisango’s acquittal in US$9 million streetlights tender scandal; to prefer new criminal charges",
            "url": "https://www.newzimbabwe.com/zacc-clashes-with-npa-over-chisangos-acquittal-in-us9-million-streetlights-tender-scandal-to-prefer-new-criminal-charges/",
            "content": "By Mary Taruvinga\n\nThe Zimbabwe Anti-Corruption Commission (ZACC) has said will be casting new criminal charges against former Harare Town clerk Josiah Chisango and four top officials who were acquitted by the State in a US$9 million streetlights scandal last Friday.\n\nOn Friday the National Prosecuting Authority (NPA) withdrew charges against Chisango and his four colleagues Never Murerwa the Supply Chain Manager, Denford Zhungu Principal Accountant, Tawanda Mutenhabundo the Engineering Technician and Artikins Mandaza Principal Contracts Administrator before plea.\n\nThe charges against Jabulani Mukomazi, the principal buyer were not withdrawn and he was indicted for trial commencing on March 10 2025 at the High Court.\n\nThe group was accused of facilitating the US$9 million streetlights tender deal in favour of a company owned by Moses Mpofu and Mike Chimombe, Juluka Endo.\n\nMpofu and Chimombe are currently locked up over the tender scam and another one involving goats.\n\nProvincial Public Prosecutor Witness Mabhaudhi said he didnt see anything wrong which all the other officials had done except for Mukomazi.\n\nThe signed agreement between the City of Harare and Juluka was a nullity at law and the principal buyer, who had the duty to proceed by way of section 31 of PPDPA Act but chose to proceed by way of Section 34, attracted the criminal liability, he said.\n\nFrom the foregoing it is apparent that we know who committed the offence and there is no need for nitpicking in order to enlarge the group.\n\nIt was the principal buyer who misrepresented that he had been authorised by PRAZ to do what he did and there is no evidence that he committed the offence in association with any other person.\n\nProsecuting the present accused persons will be an exercise in futility, theres no prima facie against the accused persons.\n\nBright prospects of a conviction are there in respect of the principal buyer, that is how the State will proceed, Mabhaudhi said.\n\nFollowing the withdrawal of charges, there has been so much criticism over how Chisango and his colleagues were absolved of wrongdoing.\n\nZACCsaid it is not happy with the NPAs decision further noting that the five should have theirday in court.\n\nZACC respects the position taken by the NPA and acknowledges that it is the mandate of the prosecuting authority to institute and manage criminal prosecutions in Zimbabwe.\n\nThe Commission, however, maintains that the accused persons are criminally liable for the fraudulent awarding of the tender and should defend their actions in court.\n\nAccordingly, ZACC is looking into the matter and will be preferring new charges against the five accused persons, it said in a statement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/06/03181857/Hosiah-Chisango-Harare-City-Town-Clerk.jpg",
            "description": "<p>By Mary Taruvinga The Zimbabwe Anti-Corruption Commission (ZACC) has said will be casting new criminal charges against former Harare Town clerk Josiah Chisango and four top officials who were acquitted by the State in a US$9 million streetlights scandal last Friday. On Friday the National Prosecuting Authority (NPA) withdrew charges against Chisango and his four</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zacc-clashes-with-npa-over-chisangos-acquittal-in-us9-million-streetlights-tender-scandal-to-prefer-new-criminal-charges/\">ZACC clashes with NPA over Chisango’s acquittal in US$9 million streetlights tender scandal; to prefer new criminal charges</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "05 Feb 2025"
        },
        {
            "title": "High Court rules HIV no longer deadly, convicts seeking lenient sentences should stop using it as ‘special circumstance’",
            "url": "https://www.newzimbabwe.com/high-court-rules-hiv-no-longer-deadly-convicts-seeking-lenient-sentences-should-stop-using-it-as-special-circumstance/",
            "content": "By Mary Taruvinga\n\nThe High Court has advised convicted criminals to stop raising HIV as a special circumstance during mitigation because the infection is no longer deadly due to advancements in its treatment.\n\nJudges of appeal Justices Munamato Mutevedzi and Naison Chivayo said this while handing down their ruling on an appeal by two convicts who were convicted for unlawful possession of ivory tusks.\n\nBoth convicts whose identity is being withheld because of their HIV status were jailed for 11 and nine years minimum mandatory sentences respectively for the offence.\n\nOne of them was jailed 11 years after it emerged that he was a serial offender.\n\nThey both raised their positive HIV status as a mitigatory factor while seeking a lenient sentence.\n\nThe court said being infected with HIV was not a special circumstance.\n\nThey were general items of mitigation which this court in previous pronouncements has ruled as not constituting special circumstances even when taken cumulatively.\n\nBut perhaps what needs special mention among those is the submission by both appellants that they were infected with HIV, the virus that causes AIDS.\n\nWe were not sure what they wanted to achieve from that, said the judges.\n\nMuch as being HIV positive used to be scary and was viewed by many as terminal, it is a notorious fact, which the court will take judicial notice of, that this is no longer the case.\n\nMany forms of treatment have been developed over the years to mitigate the effects of HIV on humans.\n\nDr Amos had the following to say regarding the previously catastrophic effects of the condition: Treatments used, mean people living with HIV live long and healthy lives because the virus is controlled and its effects on someones health are limited.\n\nThe treatment also brings the level of virus in the body of someone living with HIV down to such low levels that it cant be detected by HIV tests  and this also means that it cant be passed on to someones sexual partners, whether they use condoms or not.\n\nThe judges said in Zimbabwes case, as far back as 1993 when being infected with HIV was still viewed as a death penalty, the High Court in the case of S v Mahachi (1993 2 SACR 36 (Z)), rejected the notion of treating those with HIV as a special category of offenders.\n\nIn its final determination, it held further that because the accused it was sentencing had previous convictions, his state of health was not decisive. It sentenced him to imprisonment regardless of his HIV condition.\n\nI also wish to add that the effects of HIV have since been downgraded to the levels of any other disease and conditions like the common colds, diabetes, and hypertension among others.\n\nIn fact, it is a fact that there are more deadly infections and diseases than HIV.\n\nIt is time therefore that people accused of crime must stop seeking special sentences in the guise of their HIV statuses because their conditions are no different from other illnesses.\n\nThe courts will view that as nothing but an abuse of ones medical condition.\n\nFor the avoidance of doubt, being HIV positive, like any other ailment, and without more is not a special circumstance warranting a court to depart from imposing a prescribed minimum sentence on an offender, said Mutevedzi.\n\nHe said the lower court was correct to impose the minimum mandatory eleven years on him regardless of his HIV condition.\n\nEqually the sentence of nine years imprisonment imposed on the second appellant was an appropriate one, they ruled.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/03/06230138/HIV-web-image-1050x650.jpg",
            "description": "<p>By Mary Taruvinga The High Court has advised convicted criminals to stop raising HIV as a special circumstance during mitigation because the infection is no longer deadly due to advancements in its treatment. Judges of appeal Justices Munamato Mutevedzi and Naison Chivayo said this while handing down their ruling on an appeal by two convicts</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-rules-hiv-no-longer-deadly-convicts-seeking-lenient-sentences-should-stop-using-it-as-special-circumstance/\">High Court rules HIV no longer deadly, convicts seeking lenient sentences should stop using it as ‘special circumstance’   </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "05 Feb 2025"
        },
        {
            "title": "Harare Commission of Inquiry: Mayor Mafume suspends top council official who accused him of nepotism, corruption",
            "url": "https://www.newzimbabwe.com/harare-commission-of-inquiry-mayor-mafume-suspends-top-council-official-who-accused-him-of-nepotism-corruption/",
            "content": "By Darlington Gatsi\n\nHARARE City Council (HCC) Executive AssistantTown Clerk, Mathew Marara has made foes at the Town House following his blunt testimony at the ongoing commission of inquiry, with officials baying for his blood.\n\nMarara recently appeared at the Commission of Inquiry investigating operations at the HCC, with his testimony implicating top officials in corruption that has become pervasive at Town House.\n\nIn the aftermath of his appearance before the Commission, a directive to suspend Marara was issued by the Acting Human Capital Director, Bosman Matengarufu, with theorder from Mayor Jacob Mafume.\n\nHowever, the suspension could not be carried out as the acting town clerk, Phakamile Mabhena Moyo refused to append his signature citing the ambiguity of the Council resolution, upon which it was based.\n\nAppearing before the retired Justice Maphios Cheda-led Commission of Inquiry Tuesday, Mabhena Moyo said, I thought there were still some issues that were still going through Council and I did not have a council resolution to effect the contents of the documents. There was a specific resolution that he should be suspended. Usually, I am guided by Council resolutions, I did not have a specific resolution on this one, said Mabhena Moyo.\n\nRELATED:\n\nThe tensions at Town House are so high that Marara, Tuesday, gave his testimony before the Commission of Inquiry behind closed doors.\n\nIn his last appearance, Marara had painted a grim picture of the HCC with lawlessness and corruption reigning supreme.\n\nDeath threats, and attempted murder through poisoning have been reported as officials cover their tracks of corruption.\n\nMatthew Marara\n\nMarara rose to his current position in which he is earning US$12,000 in unclear circumstances.\n\nMabhena Moyo implicated the councillors in the plot to oust Marara who has become a detested figure at the HCC.\n\nMatengarufu said he was being pressured to effect the resolution of 18th of December which was very ambiguous. Pressured by councillors and policymakers. From his side, it was coming from human resources committee members and probably the Mayor, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/18055321/Mafume-Mayor.jpeg",
            "description": "<p>By Darlington Gatsi HARARE City Council (HCC) Executive Assistant Town Clerk, Mathew Marara has made foes at the Town House following his blunt testimony at the ongoing commission of inquiry, with officials baying for his blood. Marara recently appeared at the Commission of Inquiry investigating operations at the HCC, with his testimony implicating top officials in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-commission-of-inquiry-mayor-mafume-suspends-top-council-official-who-accused-him-of-nepotism-corruption/\">Harare Commission of Inquiry: Mayor Mafume suspends top council official who accused him of nepotism, corruption</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "05 Feb 2025"
        },
        {
            "title": "Tatenda Taibu pumped for return of full Test cricket schedule for Zimbabwe",
            "url": "https://www.newzimbabwe.com/tatenda-taibu-pumped-for-return-of-full-test-cricket-schedule-for-zimbabwe/",
            "content": "Legendary Zimbabwe cricketerTatenda Taibuis excited that his nation will once more be playing regular Test cricket in 2025.\n\nThe 41-year-old who played 195 matches for Zimbabwe combined across all formats, was reacting to the news that the Southern African nation is scheduled to play nine Tests in 2025.\n\nTheir schedule includes playing England in May on their home turf for the first time in 22 years, before they host South Africa and New Zealand in Zimbabwe.\n\nWith Zimbabwe not currently included among the nine teams competing in the World Test Championship (WTC), a revitalised scheduled will do much to plead their case to be included among the top nations in the future.\n\nI commend them for doing this. Test cricket was always big in Zimbabwe, but the country went through problems [in the mid-2000s], we didnt play for six years [2005-2011] and started again, Taibu toldSportsboom.com.\n\nZimbabwe has not gone down because they love Test cricket. You have youngsters who want to play Test cricket as a profession, knowing that the coaching will be expensive.\n\nTaibu who played 150 One-Day Internationals and 28 Tests for Zimbabwe, was, however, concerned about the development of cricket in the country.\n\nThe country has been going through economic problems. It plays a role in the development of any sport. I dont think the administrators have made a concerted effort to find new cricketers who are better than before. If you have 10,000 cricketers in the country, increasing the number to 15,000 increases your chances of quality.\n\nYou need to spread cricket to the rural areas; thats where most of the numbers are. You will find the guys scoring hundreds and taking fifers. You will feel like following those players to other games. While you are watching them, you may spot someone else. Then you put all the diamonds and gold in one place, and then only you can unearth someone like Andy Flower.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/05040828/FILE-Former-Zimbabwe-cricketer-Tatenda-Taibu-has-welcomed-the-return-of-regular-Test-cricket-for-his-country-Seen-here-Taibu-during-his-playing-days-for-Zimabwe-Picture-Deshakalyan-Chowdhury-AFP.webp",
            "description": "<p>Legendary Zimbabwe cricketer Tatenda Taibu is excited that his nation will once more be playing regular Test cricket in 2025. The 41-year-old who played 195 matches for Zimbabwe combined across all formats, was reacting to the news that the Southern African nation is scheduled to play nine Tests in 2025. Their schedule includes playing England in May</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tatenda-taibu-pumped-for-return-of-full-test-cricket-schedule-for-zimbabwe/\">Tatenda Taibu pumped for return of full Test cricket schedule for Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "05 Feb 2025"
        },
        {
            "title": "Mahere reports colleague Joshua Chirambwe to Law Society for making lusty comments about her in an Advocates WhatsApp group",
            "url": "https://www.newzimbabwe.com/mahere-reports-colleague-joshua-chirambwe-to-law-society-for-making-lusty-comments-about-her-in-an-advocates-whatsapp-group/",
            "content": "By Mary Taruvinga\n\nTop Harare lawyer Fadzayi Mahere has reported her colleague, Joshua Chirambwe to the Law Society of Zimbabwe (LSZ) after he made lusty comments about her on a WhatsApp group.\n\nAmong other things, Chirambwe who is also a self-styled prophet said he was fond ofMahere.\n\nYou seeThere is this woman I adore beyond words-lets say Im rather fond of Fadzi.\n\nAnd there is another lady in this group, whose elegance could give royalty a run for their money. Her character? Sweet enough to make sugar but how can I approach them? he said in one of the messages which has gone viral.\n\nIn her letter to the LSZ Executive Secretary Norman Mapara, Mahere said this amounts to sexual harassment adding that Chirambwe has been doing this for a long time.\n\nAt one time she was forced to exit the group.\n\nPrevious messages of this nature caused me to exit the group. I have attached copies of the said messages to this complaint for your attention. They are published under the moniker Young Money.\n\nIt is my humble view that such sexual harassment has no place in the legal profession.\n\nI therefore lodge this complaint in terms of, inter alia, clause 3(23) of Sl 37 of 2018 and request that disciplinary action be taken against this legal practitioner, she said.\n\nMapara has since written to Chirambwe stating that he should respond to the allegations in 14 days.\n\nHe said what Chirambwe did points to a possible contravention of By-Laws of their profession.\n\nThese allegations point to a possible contravention of By Laws 3 (23) of the Legal Practitioners (Code of Conduct) By  Laws, 2018 SI 37 of 2018 and part 6.2.1 of the Law Society of Zimbabwe Sexual Harassment Policy, 2024.- failing or neglecting to treat professional colleagues with courtesy, respect and fairness; unwanted or unwelcome sexual attention of an offensive nature made by a person who knows, or reasonably should know, that the attention is unwanted or unwelcome and the person to whom it is made may conclude that the conduct was intended to offend, humiliate, disrespect or degrade him or her.\n\nIn terms of the Law Society By-Laws, I am required to inform you of the present complaint, and to require you to reply to the allegations within fourteen (14) days.\n\nThe matter is yet to be heard.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/05/28181833/Fadzayi_Mahere.jpg",
            "description": "<p>By Mary Taruvinga Top Harare lawyer Fadzayi Mahere has reported her colleague, Joshua Chirambwe to the Law Society of Zimbabwe (LSZ) after he made lusty comments about her on a WhatsApp group. Among other things, Chirambwe who is also a self-styled prophet said he was “fond of” Mahere. “You see…There is this woman I adore beyond</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mahere-reports-colleague-joshua-chirambwe-to-law-society-for-making-lusty-comments-about-her-in-an-advocates-whatsapp-group/\">Mahere reports colleague Joshua Chirambwe to Law Society for making lusty comments about her in an Advocates WhatsApp group</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "05 Feb 2025"
        },
        {
            "title": "Drama as man disrupts ex-Zanu PF Youth Leader Tsenengamu’s press conference demanding goats",
            "url": "https://www.newzimbabwe.com/drama-as-man-disrupts-ex-zanu-pf-youth-leader-tsenengamus-press-conference-demanding-goats/",
            "content": "By Thandiwe Garusa\n\nFORMER Zanu PFYouth League Political Commissar Godfrey Tsenengamus press conference in Harare has been disrupted by an unidentifiedman who claimed that the former owed him two goats.\n\nTsenengamu,leader of the FRONT for Economic Emancipation in Zimbabwe (FEEZ)last year said that he was quitting politics to focus on fighting corruption. At the press conference, Tuesdayhe announced he was returning toactivepolitics.\n\nJust as he was about to present the agenda,an unknown man stormed the venue, disrupting the briefing.\n\nThe man initially demanded money from Tsenengamu beforeclaimingthat he was owed two goats.\n\nHe alleged that Tsenengamu used him during the 2023 general elections to campaign for President Emmerson Mnangagwa and failed to pay him the goats he had promised for the campaign work.\n\nYou used us for your campaign in Mt Darwin. I want my two goats. You told us to campaign for Mnangagwa, and then you later said you were no longer in politics. I want my goats for campaigning for you, the man said.\n\nTsenengamu repeatedly denied knowing the man or owing him anything.\n\n Former Zanu-PF Youth League National Political Commissar Godfrey Tsenengamu's presser today was disrupted by an unknown individual. The man was claiming that Tsenengamu who had just announced that he was back in active politics owed him goats.\n\n: Open parlypic.twitter.com/MkjnzA5MlD\n\n NewZimbabwe.com (@NewZimbabweCom)February 4, 2025\n\nHe offered the unknown man some money equivalent to the value of two goats so he could proceed with his press briefing, however, the man refused, insisting that he wanted the goats, not money.\n\nI know nothing about your goats. I do not know you. Who are you? If I owe you, go and report it to the police. I know you have been sent to disrupt this press conference, Tsenengamu shot back.\n\nThe press conference was dismissed following the altercation.\n\nTsenengamu, now a critic of Mnangagwasaid, I am here to announce that I am back in politics full-time. We cannot continue to fold our hands while the ruling party abuses institutions for personal gain.\n\nI have reconsidered my decision to quit politics because I realized that politics affects every aspect of life, including the causes I aimed to pursue, such as charity, economic empowerment, and the fight against corruption, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/11160418/Tsenengamu-.png",
            "description": "<p>By Thandiwe Garusa FORMER Zanu PF Youth League Political Commissar Godfrey Tsenengamu’s press conference in Harare has been disrupted by an unidentified man who claimed that the former owed him two goats. Tsenengamu, leader of the FRONT for Economic Emancipation in Zimbabwe (FEEZ) last year said that he was quitting politics to focus on fighting corruption. At the press</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/drama-as-man-disrupts-ex-zanu-pf-youth-leader-tsenengamus-press-conference-demanding-goats/\">Drama as man disrupts ex-Zanu PF Youth Leader Tsenengamu’s press conference demanding goats</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "05 Feb 2025"
        },
        {
            "title": "Education in Zimbabwe has lost its value: Study asks young people how they feel about that",
            "url": "https://www.newzimbabwe.com/education-in-zimbabwe-has-lost-its-value-study-asks-young-people-how-they-feel-about-that/",
            "content": "The Conversation\n\nEducation, especially higher education, is a step towards adulthood and a foundation for the future.\n\nBut what happens when education loses its value as a way to climb the social ladder? What if a degree is no guarantee of getting stable work, being able to provide for ones family, or owning a house or car?\n\nThis devaluing of higher education as a path to social mobility is a grim reality for young Zimbabweans. Over the past two decades the southern African country has been beset byeconomic,financial,politicalandsocialchallenges.\n\nThese crises have severely undermined the premises and promises of education, especially at a tertiary level. A recent survey by independent research organisationAfrobarometerfound that 90% of young Zimbabweans had secondary and post-secondary education compared to 83% of those aged between 36 and 55. But 41% of the youth were unemployed and looking for a job as opposed to 26% of the older generation.\n\nThe situation is so dire that its become a recurring theme inZimdancehall, a popular music genre produced and consumed by young Zimbabweans. Hustling (attempts to create income-generating opportunities), informal livelihoods and young peoples collapsed dreams are recurrent topics in songs like Winky DsTwenty Five, Junior Tatendas Kusvikira Rinhi and She CalazsKurarama.\n\nIstudythe way people experience the informal economy in Zimbabwe and Zambia. Ina recent studyI explored the loss of educations value as a social mobility tool in the Zimbabwean context.\n\nMy research revealed how recent school and university graduates think about the role of education in their lives. My respondents felt let down by the fact that education no longer provided social mobility. They were disappointed that there was no longer a direct association between education and employment.\n\nHowever, the graduates I interviewed were not giving up. Some were working towards new qualifications, hoping and preparing for economic improvements. They also thought deeply about how the educational system could be improved. Many young people got involved in protests. These included actions by theCoalition of Unemployed Graduatesand the #ThisGownprotests, which addressed graduate unemployment issues. Some also took part in #ThisFlag and #Tajamukaprotests, which had wider socio-economic and political agendas.\n\nTo understand the current status and state of education in Zimbabwe its important to look to the countrys history.\n\nZimbabwe was colonised by the British fromthe late 19th century. The colonialeducation system was racialised. Education for white students was academic. For Black students, it was mostly practice-oriented, to create a pool of semi-skilled workers.\n\nIn the 1930s education was instrumental in the formation of Zimbabwes Blackmiddle class. A small number of Black graduates entered white collar jobs, using education as a social mobility tool. The educational system also opened up somewhatfor women.\n\nDespite someuniversity reformsduring the 1950s, the system remained deeply racialised until the 1980s. Thats when the post-colonial governmentdemocratisedthe education system.Primary school enrolment went up by 242%, and 915% more students entered secondary school. In the 1990snine morestate universities were opened.\n\nHowever, worsening economic conditions throughoutthe 1990sput pressure on the system. Apresidential commissionin 1999 noted that secondary schools were producing graduates with non-marketable skills  they were too academic and focused on examinations. Students experiences, including at the university level, haveworsened since then.\n\nThe decline has been driven bysystemic and institutional problemsin primary and secondary education, like reduced government spending, teachers poor working conditions, political interference and brain drain. This, coupled with the collapse of the formal economic sector and a sharp drop informal employment opportunities, severely undermined educations social mobility function.\n\nMy recent article was based on my widerdoctoral research. For this, I studied economic informalisation in Zimbabwes capital city, Harare. It involved more than 120 interviews during eight months of in-country research.\n\nThis particular paper builds on seven core interviews with recent school and university graduates in the informal sector, as well as former student leaders.\n\nSome noted that education had lost part of its value as it related to ones progression in society. As one of my respondents, Ashlegh Pfunye (former secretary-general of the Zimbabwe National Students Union),described it, young people were told that education was a key to success  but there was no door to open.\n\nSome of my respondents were working in the informal sector, as vendors and small-scale producers. Some could not use their degrees to secure jobs, while others gave up their dreams of obtaining a university degree.Lisa, for example, was very upset about giving up on her dream to pursue post-secondary education and tried to re-adjust to her current circumstances:\n\nI used to dream that I will have my own office, now I dream that one day Ill have my own shop.\n\nThose who had university qualifications stressed that, despite being unable to apply their degrees in the current circumstances, they kept going to school and getting more certification. This prepared them for future opportunities in the event of what everyone hoped for: economic improvement.\n\nSome of my interviewees, especially recent university graduates and activists, were looking for possible solutions  like changing the curriculum and approach to education that trains workers rather than producers and entrepreneurs. As Makomborero Haruzivishe, former secretary-general of the Zimbabwe National Students Union,said: Our educational system was created to train human robots who would follow the instructions.\n\nEntrepreneurship education is apopular approachin many countries to changing the structure of classic education. In the absence of employment opportunities for skilled graduates,it is supposed toprovide them with the tools to create such opportunities for themselves and others.\n\nRead more:Nigerias universities need to revamp their entrepreneurship courses  theyre not meeting student needs\n\nIn 2018, the government introduced what it calls theeducation 5.0 framework. It has a strong entrepreneurship component. Its too soon to say whether it will bear fruit. And it may be held back by history.\n\nFor example, the introduction of theEducation-with-Productionmodel in the 1980s, which included practical subjects and vocational training, was met withresistancebecause it was seen as a return to the dual system.\n\nBecause of Zimbabwes historically racialised education system, many students and parents favour the UK-designed Cambridge curriculum and traditional academic educational programmes. Zimbabwe hasthe highest number of entrantsinto the Cambridge International exam in Africa.\n\nThe link between education and employment in Zimbabwe has many tensions: modernity and survival, academic pursuits and practicality, promises and reality. Its clear from my study that graduates feel let down because the modernist promises of education have failed them.\n\nLeverhulme Early Career Research Fellow, University of Edinburgh\n\nThis article is republished fromThe Conversationunder a Creative Commons license.Read the original articlehere.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/04095411/Screenshot-2025-02-04-at-11.53.02.png",
            "description": "<p>The Conversation Education, especially higher education, is a step towards adulthood and a foundation for the future. But what happens when education loses its value as a way to climb the social ladder? What if a degree is no guarantee of getting stable work, being able to provide for one’s family, or owning a house</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/education-in-zimbabwe-has-lost-its-value-study-asks-young-people-how-they-feel-about-that/\">Education in Zimbabwe has lost its value: Study asks young people how they feel about that</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "05 Feb 2025"
        },
        {
            "title": "Rituals, rites and rumours: how women claim power in Zimbabwe’s informal gold mines",
            "url": "https://www.newzimbabwe.com/rituals-rites-and-rumours-how-women-claim-power-in-zimbabwes-informal-gold-mines/",
            "content": "The Conversation\n\nIn Zimbabwe they say,hanzi bhande rinonzvenga vakadzi vakapinda mumigoghi(The gold belt will disappear if women go into the underground mine).\n\nMany men on artisanal or small-scale gold mining sites are uncomfortable working with women in their syndicates because of this commonly held cultural belief, that women pollute the sacredness of the mining space.\n\nYet women remain a lively, if sidelined, community in the countrys growing mining sector. By 2000 there were more than500,000 peopleworking in artisanal and small-scale mining in Zimbabwe. By 2018 it wasestimatedthat number could be up to 1.5 million. But this doesnt include people operating illegally.\n\nWomens roles have varied inside this industry: they have been vendors, sex workers, and alluvial gold washers, panning for gold along streams.\n\nWe are researchers ofresource extraction and environmental changeand ofhistory and the environment. Zimbabwean women in artisanal mining are the subject of our recentpaper, drawn from a largerstudyin Mazowe, 40km from the capital, Harare.\n\nWhile the main goal of the research was to understand womens experiences and power relations in this apparently masculine sector, we realised there was something else to be uncovered. A secret world of ritual, rite and rumours.\n\nWe found that women under spiritual and ancestral possession (often referred to asmasvikiro) have developed a new commercial vision on the mines.\n\nThey have created spiritual shrines that are visited by men seeking to make their fortunes. They profit from the beliefs of miners that their ritual instructions help them find gold.\n\nWomen at these mines are not allowed to go underground themselves, but their occult spirit being accompanies miners deep underground and guides them in looking for gold.\n\nSo, some women have tapped into spiritual economies in Mazowe to support their livelihood. Even in a deeply patriarchal society, these women push back against the social and cultural order of masculine mine spaces.\n\nOur study of occult practices is one of the outcomes of extensive fieldwork over the course of 13 months in the small mining community of Jumbo in Mazowe.\n\nResearch involved interviews with 40 women and 20 men, as well as social conversations and observations. It included analysis of social media, mining reports and archive material. The goal was to shine a light on the dynamics that shaped womens experiences in a gold mining frontier.\n\nThis included exploring the connections between gender and the occult, and the intimate rituals of how women survive on the mines.\n\nPersisting land inequalities in Zimbabwe have catapulted women into artisanal gold washing to support their rural livelihoods. Yet poverty was not the only trigger; other women acquired gold mining licences and accumulated more profits in Mazowe.\n\nSome women in Mazowe engaged in cross border trading activities and those who worked as domestic workers in South Africa and Botswana returned to Mazowe andinvestedin gold pits. They sub-contracted male labourers to work for them  a process that came to be known asku sponsor makomba(financing gold pits).\n\nIn the post-2000 era, illegal gold mining continued to escalate. This was followed by a surge ofsex workersin artisanal gold mining sites across the country. Sex work offered a lucrative business opportunity for women in adeclining economic situation. Women in our study highlighted the need to providefoodfor their families as a key factor that pushed them into the sex trade.\n\nA further commercial opportunity in Mazowes mines became spiritual work.\n\nIn Zimbabwe there is a long history ofsuperstitionsabout women and mining. We discovered occult practices are popular and are used for different purposes by various social groups.\n\nIn the postcolonial period, miners have become targets of a growing number offake prophetsand diviners. They promise easy access into the mining world and a guarantee of striking rich gold veins.\n\nMen in the mines use the occult to increase theirdominanceand masculinity over other men. There are many forms of rituals, including using marijuana (mbanje) to instil courage and chase away evil spirits.\n\nSome women tapped into these existing spiritual life worlds to make money through spiritual entrepreneurship. In Mazowe, for example,Nehanda a powerful and revered ancestral spirit  is still venerated. Artisanal miners shared stories about visits to these shrines to seek advice from women under the possession of Nehandas spirit. The diviners provide specific instructions for rituals that the men need to perform at mining sites.\n\nThere were also numerous stories of how the older women were consulted by miners. It was reported, for example, that one helped the miners throughkurombesa(the use of ritual charms). Miners would suck her breast and then they would strike a gold belt afterwards.\n\nWhile these stories portray a mythical productive role played by women in ritual practices, they also show how this mining community regards the female body. In this case, it is associated with good fortune and at the same time death. Its important to note that the sucking of breasts was seen to be a sacred activity and miners were supposed to honour the purity of the act.\n\nThese local beliefs have roots in the countrys precolonial history. Like many cultures across Africa, Zimbabwean iron smelters have traditionallyusedfemale body features in decorating and creating the shapes of their mining tools.\n\nSex workers in the district also developed new strategies of making a living, tapping into rituals and using rumours circulating in the community. These women gained an understanding of the social economic dynamics of mining settlements: when some miners get money from selling gold, they spend it on alcohol and sex.\n\nHowever, some men in the community feared the agency of sex workers who were using rituals. They referred to these women as sperm mongers who secretly kept used condoms to take the sperm to witchdoctors to create potions to bathe in. It was believed this would make them sexually appealing.\n\nWhile some sex workers denied the claims, a few admitted to them. One said:\n\nWe use muti to attract our clients and get more money to feed our families  as compared to our men who usually want the money to spend and drink alcohol.\n\nWe argue that instead of being just polluters of the mines, women are central to understanding the ritual life of artisanal gold mining in Zimbabwe.\n\nA neglected part of womens history can be understood by unpacking their entrepreneurial everydayness. This can help to trace the role of women as they work to survive within male dominated communities.\n\nPostdoctoral researcher, University of Groningen\n\nProfessor of History, Stellenbosch University\n\nThis article is republished fromThe Conversationunder a Creative Commons license.Read the original articlehere.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/04094756/Screenshot-2025-02-04-at-11.47.33.png",
            "description": "<p>The Conversation In Zimbabwe they say, hanzi bhande rinonzvenga vakadzi vakapinda mumigoghi (The gold belt will disappear if women go into the underground mine). Many men on artisanal or small-scale gold mining sites are uncomfortable working with women in their syndicates because of this commonly held cultural belief, that women “pollute” the sacredness of the mining</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rituals-rites-and-rumours-how-women-claim-power-in-zimbabwes-informal-gold-mines/\">Rituals, rites and rumours: how women claim power in Zimbabwe’s informal gold mines</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "05 Feb 2025"
        },
        {
            "title": "What is USAID, why Trump wants to shut it down and what the impact will be?",
            "url": "https://www.newzimbabwe.com/what-is-usaid-why-trump-wants-to-shut-it-down-and-what-the-impact-will-be/",
            "content": "BBC\n\nThe future of the US governments main overseas aid agency has been cast into doubt, with employees locked out and the Trump administration planning to merge it with the US Department of State.\n\nThe United States Agency for International Development (USAID) would continue to function as a branch of the state department, but the plan involves a significant reduction in its funding and the workforce, CBS News, the BBCs US partner, reports.\n\nOn Monday, Secretary of State Marco Rubio accused USAIDs leadership of insubordination and said he was now its acting head.\n\nUS President Donald Trump and one of his top advisers, billionaire Elon Musk, have been strongly critical of the agency.\n\nBut the move toshut it downcould have a profound impact on humanitarian programmes around the world.\n\nThe United States Agency for International Development (USAID) was set up in the early 1960s to administer humanitarian aid programmes on behalf of the US government around the world.\n\nIt employs around 10,000 people, two-thirds of whom work overseas. It has bases in more than 60 countries and works in dozens of others. However, most of the work on the ground is carried out by other organisations that are contracted and funded by USAID.\n\nThe range of activities it undertakes is vast. For example, not only does USAID provide food in countries where people are starving, it also operates the worlds gold-standard famine detection system, which uses data analysis to try to predict where food shortages are emerging.\n\nMuch of USAIDs budget is spent on health programmes, such as offering polio vaccinations in countries where the disease still circulates and helping to stop the spread of viruses which have the potential to cause a pandemic.\n\nThe BBCs international charity BBC Media Action, which is funded by external grants and voluntary contributions, receives funding from USAID.According to a 2024 report, USAID donated $3.23m (2.6m), making it the charitys second-largest donor that financial year.\n\nAccording to government data, the US spent $68bn (55bn) on international aid in 2023.\n\nThat total is spread across several departments and agencies, but USAIDs budget constitutes more than half of it at around $40bn.\n\nThe vast majority of that money is spent in Asia, sub-Saharan Africa and Europe  primarily on humanitarian efforts in Ukraine.\n\nThe US is the worlds biggest spender on international development  and by some margin.\n\nTo put it into context, the UK is the worlds fourth-largest aid spender. In 2023, itspent 15.3bn around a quarter of what the US provided.\n\nTrump is a long-term critic of overseas spending and has said it does not represent value for money for American taxpayers. He has singled out USAID for particularly strong criticism, describing senior officials there as radical lunatics.\n\nAbolishing the agency would likely enjoy popular support. Opinion polls have long suggested that American voters favour slashing foreign aid spending. According to theChicago Council on Global Affairs, polling data going back to the 1970s has indicated broad support for cuts.\n\nOne of Trumps first actions after returning to office was signing an executive order pausing almost all international spending for 90 days while a review could be carried out.\n\nA memo was then issued by the State Department which halted the vast majority of work being done on the ground. Waivers were later issued for humanitarian programmes, but the announcement upended the world of international development and caused widespread disruption to services.\n\nProgrammes including those providing medication to the worlds poorest and installing clean water supplies had to stop overnight. One veteran humanitarian worker told the BBC the pause waslike an earthquake across the aid sector.\n\nTensions between the White House and USAIDescalated over the weekendwhen officials working for Elon Musk  who Trump has tasked with identifying spending cuts in the federal budget  were reportedly denied access to secure financial data at USAID headquarters. Two senior security officials there were placed on leave in the aftermath, according to reports.\n\nOn Monday, Musk  who was speaking in a public conversation on X, the social media platform he owns  said: With regards to the USAID stuff, I went over it with [the president] in detail and he agreed that we should shut it down.\n\nUSAIDs website has gone offline andemployees were told to stay at home on Monday.\n\nLater on Monday, Secretary of State Marco Rubio accused USAIDs leadership of insubordination and said he was now its acting head. He added that a lot of functions carried out by the agency would continue but that spending has to be in alignment with the national interest.\n\nWhile it is clear the White House wields significant influence over USAID, that power is theoretically limited.\n\nUSAID came into being after Congress passed the Foreign Assistance Act in 1961. That law mandated for a government agency to be set up and tasked with administering overseas spending.\n\nShortly after, then-President John F Kennedy set up USAID using an executive order. Another law was passed in 1998 which confirmed USAIDs status as an executive agency in its own right.\n\nIn short, that means Trump cannot necessarily simply abolish USAID by signing an executive order, and any attempt to do so would almost certainly face strong challenges in the courts and Congress.\n\nClosing USAID altogether would likely require an act of Congress  where Trumps Republican Party holds slim majorities in both houses.\n\nOne of the options reportedly being considered by the Trump administration is effectively making USAID a branch of the State Department, as opposed to it being a government agency in its own right.\n\nThat type of arrangement would not be completely unheard of: in 2020, then UK Prime Minister Boris Johnsonmerged the Department for International Development with the Foreign Office.\n\nMinisters said at the time that it would ensure international spending supported the governments wider foreign policy goals  but critics warned it would reduce expertise in the aid sector and damage the UKs overseas standing and influence.\n\nGiven the disproportionate amount of funding which comes from the US, any changes to how that money is spent will doubtless be felt around the world.\n\nUSAIDs activities range from providing prosthetic limbs to soldiers injured in Ukraine, to clearing landmines and containing the spread of Ebola in Africa. The effects could be truly global.\n\nAfter the 90-day overseas spending freeze was announced, Secretary of State Marco Rubio said every dollar must be justified by evidence that it makes the US safer, stronger and more prosperous.\n\nDemocratic Party politicians have called the moves illegal and have said they would jeopardise national security, citing reports that prison guards in Syria, who were charged with securing thousands of Islamic State fighters, nearly walked off the job when US funding was temporarily cut off.\n\nTrump has made it clear he wants overseas spending to be closely aligned with his America First approach and the international development sector is braced for more shockwaves.\n\nThere are also questions about how much the US will spend overseas in years to come, as Musk  empowered by Trump  attempts to cut billions from the governments budget.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/07/07030414/USAID.jpg",
            "description": "<p>BBC The future of the US government’s main overseas aid agency has been cast into doubt, with employees locked out and the Trump administration planning to merge it with the US Department of State. The United States Agency for International Development (USAID) would continue to function as a branch of the state department, but the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/what-is-usaid-why-trump-wants-to-shut-it-down-and-what-the-impact-will-be/\">What is USAID, why Trump wants to shut it down and what the impact will be?</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "05 Feb 2025"
        },
        {
            "title": "Police raise concern over spike in drowning cases as two girls perish while fishing in dam",
            "url": "https://www.newzimbabwe.com/police-raise-concern-over-spike-in-drowning-cases-as-two-girls-perish-while-fishing-in-dam/",
            "content": "By Staff Reporter\n\nTHE onset of the rains has resulted in a rise in drowning cases, worrying police.\n\nThis follows the drowning of two girlsaged 11 and 10 in a dam while fishing in Tengwe, Hurungwe district in Mashonaland West province.\n\nThe now-deceased persons were identified as Kudzai Chitehwe (11) and Yolanda Madiro (10).\n\nZimbabwe Republic Police (ZRP) Mashonaland West acting provincial spokesperson, Assistant Inspector Effort Chapoto confirmed the incident.\n\nI can confirm a sad incident in which two juveniles drowned in Tengwe on February 2, 2025 at around 1400 hours at Ndiripo dam situated at Ndiripo farm, Tengwe, said Chapoto.\n\nKudzai Chitehwe, a female juvenile aged 11 of Plot 34, Yolanda Madiro a female juvenile aged 10 of plot 3 and Talent Madiro a female juvenile aged 10 of Plot 3 all from Ndiripo farm, Tengwe were fishing at Ndiripo farm Dam.\n\nYolanda Madiros fishing rod broke and she got into the dam trying to retrieve it and drowned. Kudzai Chitehwe then got into the dam trying to help and she also drowned.\n\nTalent Madiro rushed home and informed Kudzai Chitehwes uncle Christopher Chitehwe (58) of Plot 34 Ndiripo farm, Tengwe.\n\nThe uncle and other locals proceeded to the dam and retrieved the bodies. The matter was reported at ZRP Tengwe, who attended the scene and conveyed the bodies to Karoi District Hospital mortuary for postmortem. No foul play is suspected, said Chapoto.\n\nThe incident in Tengwe follows yet another drowning of a 12-year-old Chinhoyi boy in the Hunyani River last Saturday while swimming with his friend.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/02/16044936/Drown.jpg",
            "description": "<p>By Staff Reporter THE onset of the rains has resulted in a rise in drowning cases, worrying police. This follows the drowning of two girls aged 11 and 10 in a dam while fishing in Tengwe, Hurungwe district in Mashonaland West province. The now-deceased persons were identified as Kudzai Chitehwe (11) and Yolanda Madiro (10). Zimbabwe</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/police-raise-concern-over-spike-in-drowning-cases-as-two-girls-perish-while-fishing-in-dam/\">Police raise concern over spike in drowning cases as two girls perish while fishing in dam  </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "05 Feb 2025"
        }
    ]
}