{
    "news": [
        {
            "title": "Duo caged 15 years each for stock theft",
            "url": "https://www.newzimbabwe.com/duo-caged-15-years-each-for-stock-theft/",
            "content": "By Staff Reporter\n\nA Concession magistrate has jailed two men from Glendale for 15 years each following their conviction for stealing cattle.\n\nThe two are Casper Matope (36) and Kudakwashe Ziome (34).\n\nThey were convicted on two counts of stock theft.\n\nThe state proved that during the night of July 3, 2025, the two offenders unlawfully entered Plymouth Farm and stole two brown oxen from Christopher Gwazes kraal.\n\nAfter driving the stolen livestock to Chinyemba Village under Chief Chiweshe, they sold the animals to Elijah Chamunorwa Chinyemba, a butcher operating at Nyachuru Business Centre, prosecutors proved.\n\nThe total value of the stolen livestock was US$1,300.\n\nIn a separate incident on the night of June 17 to 18, 2025, the pair stole an ox from Shingirai Kamota of Ballyholly Farm.\n\nThey again sold the stolen beast to the same butcher, who admitted to having slaughtered it.\n\nUnfortunately, none of the meat or remaining parts of the animal could be recovered. The ox was valued at US$700.\n\nThe accused were apprehended after alerting local farmers, and investigators followed up on information provided.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/08/15024025/cattle.jpg",
            "description": "<p>By Staff Reporter A Concession magistrate has jailed two men from Glendale for 15 years each following their conviction for stealing cattle. The two are Casper Matope (36) and Kudakwashe Ziome (34). They were convicted on two counts of stock theft. The state proved that during the night of July 3, 2025, the two offenders</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/duo-caged-15-years-each-for-stock-theft/\">Duo caged 15 years each for stock theft</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:49",
            "date": "15 Jul 2025"
        },
        {
            "title": "Motorists face nightmare as ZBC licence demand comes into force",
            "url": "https://www.newzimbabwe.com/motorists-face-nightmare-as-zbc-licence-demand-comes-into-force/",
            "content": "By Costa Nkomo\n\nThe controversial Broadcasting Services Amendment Act of 2025 has come into effect and is now being implemented by the Zimbabwe National Road Authority (ZINARA), with potentially crippling consequences for vehicle owners.\n\nThe crux of the problem lies in Clause 15 of the Act, which mandates that all motorists must obtain a valid ZBC radio licence before they can renew their ZINARA vehicle licence and insurance. This effectively forces drivers to pay US$30 per term to access ZBC radio services, regardless of whether they listen.\n\nFor motorists, this translates to a minimum additional cost of US$90 per term just to keep their vehicles roadworthy  a hefty sum that many fear will force them to disable their car radios or seek exemption certificates in an attempt to avoid the added expense.\n\nIn a memorandum dated 15th July 2025, ZINARAs Revenue Operations Director, Mr P.M. Shuro issued strict instructions to all licensing centre staff across the country. The directive is clear: no motorist will be permitted to renew their vehicle licence without first presenting a valid ZBC radio licence or a certificate of exemption.\n\nIn line with the enacted Broadcasting Services Amendment Act, all motorists are required to obtain a ZBC radio license before they can renew their vehicle insurance or acquire a ZINARA vehicle licence disc, the memorandum states.\n\nZINARA has, however, placed the onus on motorists to obtain exemption certificates themselves by visiting ZBC licensing offices nationwide.\n\nCustomers whose vehicles are not equipped with a radio receiver are now required to obtain an exemption certificate from the ZBC. They will need to personally visit any ZBC Licensing Office to complete the necessary declaration form and obtain this exemption. We cannot process their ZINARA disc or insurance renewal until they present a valid exemption certificate, Mr Shuros statement continues.\n\nThe Broadcasting Services Amendment Act has been a source of fierce debate since its inception. Public hearings last year generated significant opposition, and even after President Emmerson Mnangagwa signed the bill into law in March this year, the controversy has continued.\n\nMedia freedom advocates, including the Media Institute of Southern Africa (MISA) and its partners, such as the Media Alliance of Zimbabwe (MAZ), lobbied in vain for Information Minister Jenfan Muswere to withdraw the bill before it was enacted, urging him to take public feedback into account.\n\nThe primary point of contention centres on Clause 15.\n\nCritics and analysts have argued that the Act is discriminatory, singling out motorists while allowing all citizens to access ZBC radio services through digital devices like mobile phones, without incurring this additional charge.\n\nThe new law is viewed by many as an unfair tax, further burdening already financially stretched citizens.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/17051029/radio.webp",
            "description": "<p>By Costa Nkomo The controversial Broadcasting Services Amendment Act of 2025 has come into effect and is now being implemented by the Zimbabwe National Road Authority (ZINARA), with potentially crippling consequences for vehicle owners. The crux of the problem lies in Clause 15 of the Act, which mandates that all motorists must obtain a valid</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/motorists-face-nightmare-as-zbc-licence-demand-comes-into-force/\">Motorists face nightmare as ZBC licence demand comes into force</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:49",
            "date": "15 Jul 2025"
        },
        {
            "title": "Mutare man jailed 30 years for raping daughter",
            "url": "https://www.newzimbabwe.com/mutare-man-jailed-30-years-for-raping-daughter/",
            "content": "By Staff Reporter\n\nA 46-year-old Mutare man has been slapped with a 30-year jail term following conviction for raping his biological daughter.\n\nThe offender, not named to protect the victim, was found guilty on two counts of rape after a full trial.\n\nFor each count, he was sentenced to 15 years.\n\nThe daughter is aged18 and the sexual assault took place on two different occasions.\n\nThe first offence occurred in October 2024 when the victim had entered her fathers bedroom to collect blankets and he blocked her exit.\n\nLater that night, he approached her as she was sleeping in another room and raped her, the state proved.\n\nThe second incident took place in November 2024 while the young woman was bathing.\n\nThe offender entered the bathroom without permission and proceeded to force himself on her despite her efforts to resist.\n\nThe victim initially remained silent out of fear but later disclosed the abuse to a trusted friend in December 2024, leading to a police report.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/02/06125625/jail-e1675980742403.jpg",
            "description": "<p>By Staff Reporter A 46-year-old Mutare man has been slapped with a 30-year jail term following conviction for raping his biological daughter. The offender, not named to protect the victim, was found guilty on two counts of rape after a full trial. For each count, he was sentenced to 15 years. The daughter is aged 18</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mutare-man-jailed-30-years-for-raping-daughter/\">Mutare man jailed 30 years for raping daughter </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:49",
            "date": "15 Jul 2025"
        },
        {
            "title": "I never believed my child would one day have a birth certificate – Binga villager says in salute to ongoing remote registration blitz",
            "url": "https://www.newzimbabwe.com/i-never-believed-my-child-would-one-day-have-a-birth-certificate-binga-villager-says-in-salute-to-ongoing-remote-registration-blitz/",
            "content": "By Leopold Munhende recently in Binga\n\nWITH his wife seated on the carrier and their one-year-old son on her back, Honest Mudenda (28) cycled 10 kilometres on a perry bike to register a birth certificate last Wednesday, a two-hour ride through dense forests lined with all manner of wild animals found along Lake Kariba.\n\nOnly those who witnessed the couples smiles would understand how something so ordinary, so simple for most urbanites, can make a villager in far-flung Siamusanga, Binga happy.\n\nThe Mudenda family is one of many villagers in hard to reach areas that have benefited from a Civil Registration Department (CRD) led, Swedish government-funded and UNICEF-supported initiative to register birth certificates, national identity cards and death certificates.\n\nWearing brightly lit smiles, Mudenda said they were confident the certificate would change fortunes for their baby.\n\nThey live at Mujere Fishing Camp, some 198km from Binga Centre, on the shores of Lake Kariba, where internet is a luxury, radio signal is yet to reach and Zambia is a herd mans whistle away.\n\nThat Siamusanga is hard to reach is not up for discussion.\n\nElephants roam freely on the shores of the mighty Lake Kariba, and leopards and lions are not a rare sight too deep amongst the Tonga-speaking communities there.\n\nHonest Mudenda, a beneficiary of the ongoing programme, called for it to extend to their fishing camps that are also hard to reach.\n\nI never believed that one day my child would have a birth certificate. A lot of people in our community do not have these documents because there is nowhere to get them and Binga Centre is too far for them to travel to, said a visibly happy Mudenda.\n\nThere is no transport to get here from the fishing camp I work at, I for one used a bicycle to get here with my wife and child on the carrier, cautiously riding through forests which are usually full of wild animals.\n\nWe hope this programme continues so as to benefit more people; if it is possible, they can actually visit our camps too.\n\nBefore the satellite registration centre was opened, villagers had to travel 183km to Binga Centre, a distance that would be short were it tarred.\n\nIt is, however, a gruelling seven-hour drive, and costs no less than US$15 when using public transport, which is a fortune for simple fishermen.\n\nThe only public transport they know of is a ZUPCO bus that plies their route twice a week, on Wednesdays and Sundays, and even then, it does not get anywhere near Siamusanga. Its route ends about 60km from Siamusanga, at Chunga Growth Point.\n\n39-year-old Norah Mende, who proudly brandished her fifth childs new birth certificate, called for authorities to consider building a registry office closer to their remote villages.\n\nThe process is so smooth, I now have my sons birth certificate, have changed my ID and gotten my picture taken, said Mende with a giddy laugh. She walked four kilometres to the centre.\n\nThis facility should not leave this area because a lot of people do not have these documents and without it, we have to go to Siabuwa or Binga. Our children need these documents to attend school and write examinations, now consider that children are born every year.\n\nA young lady giving details as officials take them down to process her first ever identify card at Siamusanga Primary School.\n\nBinga, just like Mwenezi, is considered a hard-to-reach area, where villagers and animals share resources, clash often, and far more depressing, where basic services are hardly accessible.\n\nThere is 150km of partially tarred road between Cross Dete (along the Bulawayo-Victoria Falls highway) and Binga, most of which is a strip of a potholed former road.\n\nThe place is so far flung, Zambia could easily have claimed it and most Zimbabweans would not know of it.\n\nUp until the Zimbabwean, Swedish governments, and UNICEFs recent intervention, tens of thousands lived and died without having procured a birth certificate or national identity document, not for a shortage of need but access.\n\nThis is part of a broader programme that the CRD is embarking on in collaboration with UNICEF, where we are going around eight rural provinces of Zimbabwe targeting hard-to-reach areas to issue birth, death certificates and national IDs, said Christina Chikerema, the CRDs Deputy Registrar General in Charge of Operations.\n\nBy targeting hard-to-reach areas, we are ensuring that we leave no one and no place behind. So far, we have been to Chikombedzi (Masvingo Province), Mhangura (Mashonaland West) and Mangwe (Matabeleland South).\n\nOur partnership with the Swedish government and development partners such as UNICEF is very key in this programme.\n\nTraditional leaders also have been roped in the drive that has seen them taking on the responsibility to teach their communities on the process, encourage them to take identity documents and also register births that occur within their areas.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/15011841/WhatsApp-Image-2025-07-14-at-18.45.33.jpeg",
            "description": "<p>By Leopold Munhende recently in Binga WITH his wife seated on the carrier and their one-year-old son on her back, Honest Mudenda (28) cycled 10 kilometres on a perry bike to register a birth certificate last Wednesday, a two-hour ride through dense forests lined with all manner of wild animals found along Lake Kariba. Only</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/i-never-believed-my-child-would-one-day-have-a-birth-certificate-binga-villager-says-in-salute-to-ongoing-remote-registration-blitz/\">I never believed my child would one day have a birth certificate – Binga villager says in salute to ongoing remote registration blitz   </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:49",
            "date": "15 Jul 2025"
        },
        {
            "title": "Industrial supplies dominate Zimbabwe’s import list",
            "url": "https://www.newzimbabwe.com/industrial-supplies-dominate-zimbabwes-import-list/",
            "content": "By Alois Vinga\n\nINDUSTRIAL supplies dominated Zimbabwes import list in the latest reporting period, the Reserve Bank of Zimbabwe (RBZ) has revealed.\n\nThe RBZ monthly economic review for April 2025 shows that US$313 million was spent on industrial supplies, with US$154 million being spent on fuels and lubricants. Capital goods chewed up US$128,1 million and Transport and Equipment US$73,7 million.\n\nOut of the US$818,3 million spent during the period, just US$98,3 million and US$44,5 million was spent on food and consumer goods.\n\nZimbabwe is currently pursuing an industrial turnaround strategy with the objective to align with Vision 2030 as well as minimise the huge foreign exchange expenditure on the importation of simple consumables.\n\nThe countrys imports were mainly sourced from South Africa (37.1%), China (14.5%), Bahrain (10.4%), the Bahamas (7.4%), and Mozambique (3.8%). The remainder of the imports came from various other markets.\n\nDuring April 2025, the countrys trade deficit narrowed to US$118.7 million, from US$235.2 million recorded in the previous month. Relative to April 2024, the trade deficit narrowed from US$206.1 million to US$118.7 million in the reporting month.\n\nThe countrys merchandise exports increased by 13.6% to US$662.6 million, from the previous months outturn of US$583.1 million. The increase was largely underpinned by growth in export earnings from gold, platinum group of metals (PGMs) and diamond.\n\nOn a year-on-year basis, exports were 29.0% higher compared to US$513.5 million recorded in April 2024.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/15010733/pump-and-steel-supplies-zimbabwe-0009a-scaled-1.jpg",
            "description": "<p>By Alois Vinga INDUSTRIAL supplies dominated Zimbabwe’s import list in the latest reporting period, the Reserve Bank of Zimbabwe (RBZ) has revealed. The RBZ monthly economic review for April 2025 shows that US$313 million was spent on industrial supplies, with US$154 million being spent on fuels and lubricants. Capital goods chewed up US$128,1 million and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/industrial-supplies-dominate-zimbabwes-import-list/\">Industrial supplies dominate Zimbabwe’s import list</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:49",
            "date": "15 Jul 2025"
        },
        {
            "title": "Warriors midfielder Maswanhise aims big in Scottish league",
            "url": "https://www.newzimbabwe.com/warriors-midfielder-maswanhise-aims-big-in-scottish-league/",
            "content": "By Sports Reporter\n\nWarriors midfielder Tawanda Maswanhise has set his sights high at Motherwell FCthis season in the Scottish Premier Soccer League after kicking off his campaign with two goals over the weekend.\n\nMaswanhise scored a brace over the weekend against Clyde FC in the Premier Sports Cup, which was the first competitive match for his side this season.\n\nSo important were the two goals that it saw his side picking a draw in regulation time (2-2) before they won 5-4 on penalties to proceed to the next round.\n\nIm happy to kick-start the campaign with two goals.\n\nI really want to get more goals this season and Im just delighted with the two goals.\n\nThere is always room for improvement, but I have set myself higher goals this season because I know what the leagues, said Maswanhise.\n\nMotherwell FC will be in action on Tuesday when they play Peterheadin the second match of the season, and all eyes will be on the Zimbabwean midfielder to deliver.\n\nWith new coach Jens Berthel, who joined the side in June, Maswanhise added that he is happy to be given first-team preference.\n\nIts good that I have been through one or two managers now.\n\nObviously, its my first season in professional football, so Im taking on board what he is doing and its going really well so far.\n\nSo Im happy that Im being selected for the team, really, he added.\n\nThis season will be the second in a row for Maswanhise, who joined Motherwell last season.\n\nThe 22-year-old won Motherwells best goals of the season (2024-25), and all eyes will be on him this season under new manager Jens Berthel.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/31090359/IMG-20241031-WA0003.jpg",
            "description": "<p>By Sports Reporter Warriors midfielder Tawanda Maswanhise has set his sights high at Motherwell FC this season in the Scottish Premier Soccer League after kicking off his campaign with two goals over the weekend. Maswanhise scored a brace over the weekend against Clyde FC in the Premier Sports Cup, which was the first competitive match for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/warriors-midfielder-maswanhise-aims-big-in-scottish-league/\">Warriors midfielder Maswanhise aims big in Scottish league</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:49",
            "date": "15 Jul 2025"
        }
    ]
}