{
    "news": [
        {
            "title": "Family living in Zimbabwe refugee camp for 20 years, finally gets approval to arrive in Western Massachusetts",
            "url": "https://www.newzimbabwe.com/family-living-in-zimbabwe-refugee-camp-for-20-years-finally-gets-approval-to-arrive-in-western-massachusetts/",
            "content": "New England Public Media\n\nThere was a special celebration taking place in the basement of Trinity United Methodist Church in Springfield.\n\nA family, stuck in a refugee camp in Zimbabwe for two decades, walked into cheers and applause from members of Jewish Family Service of Western Massachusetts, one of the resettlement agencies in the region.\n\nTheyre helping the family get settled in an apartment in Springfield and decided to throw them a potluck.\n\nThis moment holds so much excitement and so much sadness at the same time, Natasha Perales, senior director of the New American program at JFS, said. But, were here. We have a lot of good food. The family has prepared many dishes. They said [theyre only bringing] one, but as you can see, theres eight behind me\n\nThis moment seemed impossible when just one month ago more than125,000approved refugee cases were cancelled leaving many stranded and scrambling for safety. This followed President Donald Trumps executive order indefinitely pausing the refugee resettlement program.\n\nNational resettlement agencies across the country have been in a seven-month legal battle with the Trump administration to resume the U.S. refugee admissions program.\n\nIn July, a district court judge from Seattle, Washington issued anorderreinstating the approval of 160 refugees who were due to arrive within two weeks of Trumps executive order to be admitted into the U.S.\n\nTheres no word to describe how I feel, said a father of six who was among the 160 refugees who got approval to come to the U.S. The closest word he said is happiness.\n\nWere not using the fathers name because hes afraid of getting deported.\n\nHe and his wife both fled the countries they were born in, Rwanda and the Democratic Republic of the Congo, fearing persecution. They met in a refugee camp in Zimbabwe where their children were born and raised.\n\nThe father said hes ready to start a life here after living in the refugee camp for 20 years.\n\nThere are so many refugees in the camp, he said in Swahili, but they just took a few people to get this chance to come to the U.S. He said hes grateful to have the opportunity, but the cost for others he knows in the camp is great.\n\nThere is no life in the camp, he said. You dont work, youre just expected to wait for aid organizations to deliver medical supplies and food. Theres usually not enough.\n\nThe father said back in the camp, he was allowed to maintain a small garden. He said it gave him some semblance of independence as a way to provide for his family, even a little, and for something to do.\n\nThis new life he said in America is a chance for his family to survive.\n\nHe and his wife say, as any parent in this country, they want their children to have a bright future. He said they want their kids to have a good education and succeed so they can help this country.\n\nHe said theyre also looking to become U.S. citizens.\n\nAlda Balbino, assistant director for resettlement at Jewish Family Service in Springfield, said this family came into the country with some federal funding.\n\nIt typically gets used for rent, first, last, and security. Furniture, if needed. All of the things that the family needs to be settled, she said.\n\nOther important services, Balbino said, will be provided by JFS through state grants, since federal funds have dwindled for resettlement agencies.\n\nThe kids will be registered for school, so theyll be attending Springfield schools, Balbino said. The parents will be enrolled in ESL, employment programs. Previous to this administration, all the families would be getting these services. So, itll be permanent. Theyll be settled, and theyre just going to be living their normal lives.\n\nBalbino said securing English language classes for the parents and other members of the family will be vital to helping them get employment, which leads to them getting health insurance benefits.\n\nWhile there are these challenges left to navigate in the near future, Balbino underscores how special it was for this family to even arrive after so much uncertainty.\n\nTo be stopped and to be cancelled, and then have nothing, and then to be rescheduled and to come in and to have all the services available that a family would prior to the new administration is special, especially in the time were at, Balbino said.\n\nThe father of this family only has one request of the federal government. He asks that they reconsider the executive order and wants the rest of the refugees at his camp in Zimbabwe who were approved to come to the U.S. to get the same opportunity hes been given.\n\nThe chance at a new life, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/02083213/nepm.webp",
            "description": "<p>New England Public Media There was a special celebration taking place in the basement of Trinity United Methodist Church in Springfield. A family, stuck in a refugee camp in Zimbabwe for two decades, walked into cheers and applause from members of Jewish Family Service of Western Massachusetts, one of the resettlement agencies in the region.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/family-living-in-zimbabwe-refugee-camp-for-20-years-finally-gets-approval-to-arrive-in-western-massachusetts/\">Family living in Zimbabwe refugee camp for 20 years, finally gets approval to arrive in Western Massachusetts</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "02 Sep 2025"
        },
        {
            "title": "Midfielder Sean Fusire says ZIFA still owes him allowances from last call-up after Warriors squad omission",
            "url": "https://www.newzimbabwe.com/midfielder-sean-fusire-says-zifa-still-owes-him-allowances-from-last-call-up-after-warriors-squad-omission/",
            "content": "By Sports Reporter\n\nEngland-based Warriors midfielder Sean Fusire has broken his silence after his omission from the squad to play in the upcoming World Cup Qualifiers against Benin and Rwanda.\n\nFusire was drafted into the initial Warriors squad only to be dropped on Sunday when ZIFA announced that he would be replaced by Tivonge Rushesha.\n\nIn a statement, ZIFA said the Sheffield Wednesday midfielder was dropped because the football governing body could not meet his financial demands.\n\nHowever, the midfielder broke his silence on Monday evening and shared his side of the story.\n\nAfter I had been informed of my selection for the camp and given flights, I simply inquired with officials about the total travel duration, which would have amounted to in excess of 40+ hours.\n\nIn my opinion, and considering my previous injury history and the physical demands on my body due to being in cramped travel situations, I requested an upgrade in flights.\n\nThis request was made just to ensure that I am fully fit and ready for Abidjan, Johannesburg, and also when I return to my club after the camp.\n\nI requested that my flights be upgraded to either business or at least premium economy. After this was declined, I further requested that I do all flights in economy except the last flight from South Africa back to the UK, read part of Fusires statement.\n\nThe Sheffield Wednesday midfielder added that he even asked ZFA to use part of his outstanding allowances from his last international call-up, but it was to no avail.\n\nI offered to put my owed allowances from the last camp towards an upgrade of the last flight. I was hoping for a response from the official I was communicating with, but unfortunately, there was no further communication.\n\nI am not sure as to why? At this stage, I did not feel comfortable travelling without a resolution to the matter, he added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/27041455/sean-fusire-Sheffield-Wednesday.jpeg",
            "description": "<p>By Sports Reporter England-based Warriors midfielder Sean Fusire has broken his silence after his omission from the squad to play in the upcoming World Cup Qualifiers against Benin and Rwanda. Fusire was drafted into the initial Warriors squad only to be dropped on Sunday when ZIFA announced that he would be replaced by Tivonge Rushesha.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/midfielder-sean-fusire-says-zifa-still-owes-him-allowances-from-last-call-up-after-warriors-squad-omission/\">Midfielder Sean Fusire says ZIFA still owes him allowances from last call-up after Warriors squad omission</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "02 Sep 2025"
        },
        {
            "title": "Legal Discussions with Vengai Madzima: Environmental Compliance and Legal Liability in Zimbabwe’s Mining Sector",
            "url": "https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-environmental-compliance-and-legal-liability-in-zimbabwes-mining-sector/",
            "content": "NewZimbabwe.com hasinvited Mr. Vengai Madzima, the Senior Partner atMadzima Chidyausiku Museta Legal Practitioners (MCM Legal)to discuss with us legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer.\n\nReporter: Welcome back Mr. Madzima, following recent revelations by Channel 4 news of an environmental catastrophe in Zambia, our neighbor, allegedly as a result of the spilling of a cocktail of toxic materials in the Kafue river by a Chinese company, we want to discuss our own environmental compliance in the Zimbabwe mining sector and whether enough is being done to protect us from such an occasion?\n\nVM: Thank you.\n\nI am aware of the alleged contamination which allegedly happened in February this year and has recently made headlines around the world. There are conflicting reports as to the extent of the contamination and counter allegations of geopolitical connotations which I will not bedevil myself discussing.\n\nWhat is critical from a Zimbabwe context is that the environment and its protection are an ongoing obligation and its conservation should continually be monitored and discussed as the mining sector grows because of the permanency of the effects of environmental contamination and the potential impact of certain mining methods on the way of life of our posterity.\n\nEnvironmental protection is one of the areas where patriotism by either enforcers or local actors is a must. Our blessing in the extent and diversity of our mineral resources is conversely our curse in enforcement costs.\n\nOur laws governing environmental protection in general and the mining sector in particular are well developed and comparative in the region. However, from a cost perspective, monitoring for bigger mining players in the industry is simpler and for smaller players slightly more difficult, despite the laws being in place.\n\nReporter:What laws are in place to protect the environment against the impact of mining?\n\nVM: As a start, it is important to understand that environmental protection is a constitutional right. Our constitution establishes that every person has a right to an environment that is not harmful to their health and wellbeing. It therefore obliges our lawmakers to secure the protection of the environment.\n\nSuch laws include the Environment Management Act [Ch20:27], being the main legislation governing environmental issues, assisted by other complementary legislation like the Water Act and Forestry Act prescribing conservation laws. Further and specific to the mining industry, the current Mines and Minerals Act [Ch21:05] and the proposed Mining Bill have prescriptive provisions aimed at protecting and rehabilitating mining areas before, during and after mining.\n\nWe also have statutory instruments released from time to time to address areas that may not have been addressed by current legislation, for example, the Environmental Management (Control of Alluvial Mining) Amendment Regulations, 2024, published as Statutory Instrument 188 of 2024, banning alluvial prospecting and mining along river beds. As stated earlier, it is an ongoing engagement that requires the affected parties, responsible bodies and parliament to remain vigilant in prescribing and reacting to issues of environmental concern.\n\nReporter: If the laws are in place, what are the common environmental violations in Zimbabwe and their reasons?\n\nVM: I think the question has to be addressed contextually. Zimbabwe has an abundance of various minerals over vast areas, making monitoring expensive for the responsible bodies. Further, as our mining methods are a mix of mechanised large and medium scale mining together with small scale artisanal mining, mainly by locals and in some unfortunate circumstances by foreign companies.\n\nThe application and enforcement of the laws become difficult in the absence of general community engagement and education, specifically from a constitutional right perspective. Our Environmental Management Act grants a unique right to any person or group acting in the public interest the right to approach our courts and stop or interdict an activity that is harmful to the environment, even where the person or group is not directly affected by the activity. This, in our law, is a powerful right which is not used enough.\n\nTo the first part of your question, the common violations are land degradation, deforestation, and abandonment of mining sites without rehabilitation, causing potential damage to animals and humans. This normally results from miners operating without an environmental impact assessment report (EIA), which is a prerequisite and prescribes community engagement, enabling the community to be aware of the potential mining activity and its plan for land rehabilitation.\n\nReporter: What liabilities are in place for companies or individuals that are caught contaminating or destroying the environment?\n\nVM: There are administrative orders and penalties that are chargeable directly from the Environmental Management Authority (EMA) that may compel a miner to do a certain thing or cease doing a certain thing. Beyond this, a miner may suffer civil liabilities from affected parties for damage caused to the environment which may include individuals, companies and communities. In the extreme and specifically for those miners who operate without an EIA, there are criminal sanctions or liabilities.\n\nReporter: Thank you, Mr. Madzima we have run out of time.\n\nVM: Thank you.\n\nRELATED:\n\nYou can contact Vengai Madzima onvengai@mcmlegal.co.zwor at www.mcmlegal.co.zw.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/01183751/Newzimbabwe.com-Artwork-750x500_20250901_190742_0000.png",
            "description": "<p>NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal) to discuss with us legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer. Reporter: Welcome back Mr. Madzima,  following recent revelations by Channel 4 news</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-environmental-compliance-and-legal-liability-in-zimbabwes-mining-sector/\">Legal Discussions with Vengai Madzima: Environmental Compliance and Legal Liability in Zimbabwe’s Mining Sector</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "02 Sep 2025"
        },
        {
            "title": "Inside the ‘Bondage’ of Zimbabwe’s Contract Tobacco Farming",
            "url": "https://www.newzimbabwe.com/inside-the-bondage-of-zimbabwes-contract-tobacco-farming/",
            "content": "By Linda Mujuru, GPJ Zimbabwe\n\nThis story was originally published byGlobal Press Journal\n\nLand reforms gave Zimbabweans farms  but contract tobacco deals have handed power to private companies.\n\nHARARE, ZIMBABWE  Zimbabwes tobacco sector was once on the brink of collapse. Now, its booming again. Last year alone, it earned the country close to US$1 billion in revenue.\n\nBut though the crop is one of the countrys top exports and production has soared, small-scale contract farmers say they see little profit due to restrictive financing agreements.\n\nThe tobacco boom, farmers say, is keeping them in debt.\n\nGift Ngoma is among them. When he lost his clerk job eight years ago, tobacco farming was the only way he could feed his family. But fertilizer, seeds and labor proved expensive. Even money from the few cows he sold wasnt enough.\n\nLike many rural Zimbabweans, hed gotten land  about 3.5 hectares (9 acres)  through traditional tenure. But those who secured land that way often lack a title deed. For Ngoma, formal credit was out of the question.\n\nNgoma knew of local farmers who had entered agreements with private companies. The deals looked good at first: Each planting season, a company provided farmers with seeds and fertilizer on credit. Theyd offer technical support throughout the season. In return, farmers sold enough of their crop to the company and used part of the revenue to cover what they owed.\n\nNgoma signed on with Premium Leaf Zimbabwe, a subsidiary of Premium Tobacco  a global company headquartered in Dubai.\n\nThe company provided him with seeds and some money for labor. Once harvest came, he sold enough tobacco to the company to pay off his debt. But over time, he says, this agreement came to feel like a trap. The seeds and other inputs are overpriced, he says, and theres little money left over to find true success as a farmer.\n\nGift Ngoma, a tobacco farmer, waits to sell his crop in Harare. He turned to farming after losing his formal job, but he says contract agreements have trapped him in debt. He now advocates for land rights and alternative financing. Photo Credit: Linda Mujuru, GPJ Zimbabwe\n\nMore than 100,000 small-scale tobacco farmers in Zimbabwe have entered into contracts with tobacco companies, according to data from the Tobacco Industry and Marketing Board, a statutory body that oversees tobacco production in the country.\n\nThe contracts  heavily financed by companies such as British American Tobacco and Tian Ze (China Tobacco)  now support over 95% of Zimbabwes tobacco production.\n\nThat production has rebounded from just 44 million kilograms in 2006 to 232 million kilograms in 2024. The industry brings in hundreds of millions of United States dollars each year and contributes nearly 10% of Zimbabwes gross domestic product. It accounts for 30% of all exports and over 50% of agricultural exports. In 2024, Zimbabwe was the worlds third-largest exporter of raw tobacco, accounting for 10% of global exports, behind Brazil and India.\n\nSources: International Trade Centre; Zimbabwe National Statistics Agency; UN COMTRADE\n\nBut smallholding farmers dont feel that success. In December 2024, the government announced plans to issue title deeds to beneficiaries of the land reform program, which would give farmers a chance to use their land as collateral and rely less on contract farming. But for now, many still rely on tobacco contracts.\n\nWe are in a cycle of oppression, Ngoma says. There is poverty in contract farming. Its as if we are laborers on our farms.\n\nWhen Global Press Journal reached out to Premium Leaf Zimbabwe for comment, they said it was the companys policy to protect the privacy of our farmers and operational integrity. Tian Ze and British American Tobacco did not respond to several requests for comment.\n\nTobacco farmers Chamu Rukwere and Rudo Nedziwe grade their harvest at home in Rusape, Zimbabwe. While contract farming connects them to global markets, they say it strips away the autonomy land reform was meant to provide. Photo credit: Gamuchirai Masiyiwa, GPJ Zimbabwe\n\nZimbabwes shift to contract farming has roots in a wider story of land reform.\n\nAt independence in 1980, white Zimbabweans  who made up less than 2% of the population  controlled nearly half of all agricultural land. The majority black population was confined to degraded, overcrowded communal areas.\n\nIn 2000, then-President Robert Mugabe launched the controversial Fast Track Land Reform Programme. The government redistributed millions of hectares of land from about 6,000 large, white-owned farms to more than 168,000 black-owned farms, according to a Human Rights Watch report.\n\nThe reforms were rushed, controversial and violent, but they brought a new agrarian structure. Tobacco, at the time one of the most valuable crops and dominated by white-owned farms, shifted to small-scale operations by the new landowners.\n\nBut the new generation of farmers didnt have access to traditional bank credit since they didnt hold deeds to their land. Tobacco production dropped dramatically, from over 197,000 tons in 1998 to about 44,000 tons in 2006.\n\nSource: Food and Agriculture Organization; The Ministry of Lands, Agriculture, Fisheries, Water and Rural Development; Tobacco Industry & Marketing Board Election Commission of India, New Delhi\n\nFarmers needed support, and into the vacuum stepped contract schemes, mostly by Chinese agribusinesses such as Tian Ze. They supplied seeds, fertilizers and technical support in exchange for crop guarantees, price control and access to global markets. Ultimately, those contracts played a key role in the post-reform tobacco boom.\n\nContract schemes now dominate Zimbabwes tobacco farming, says Emmanuel Matsvaire, acting chief executive officer of the Tobacco Industry and Marketing Board. In the 2024-25 season alone, the board recorded a total of 106,555 small-scale growers, he says, and about 89% of these are contract farming. In the 2025 season, the board licensed 43 companies to contract tobacco farmers.\n\nThe countrys economy has long struggled and local financing is generally limited, Matsvaire says. These companies fill the gap.\n\nBut farmers say the fine print works against them.\n\nSeeds and fertilizer are overpriced, Ngoma says. For half a hectare, he receives seven bags of fertilizer for US$65 each. At the shops, the same bag costs about US$40. Many farmers dont have ready cash to buy directly from shops, so they rely on private companies to provide fertilizer and other inputs, even if it means paying more when harvest comes.\n\nPiles of tobacco await processing in Rusape, Zimbabwe. Though tobacco is one of the countrys top exports and production has soared, small-scale contract farmers say that thanks to restrictive agreements, they see little profit. Photo credit: Gamuchirai Masiyiwa, GPJ Zimbabwe\n\nBecause of poverty, we continue to be dependent, Ngoma says.\n\nOnce contract farmers pay back the debts, very little is left. In some cases, the total earnings dont even cover the debt, Ngoma says, which forces them to grow tobacco for the same company the next season.\n\nThe companies control the whole process, including land use, Ngoma says, adding that at times they bring in agricultural experts who dictate seed types, planting times and farming methods, completely disregarding local farming knowledge.\n\nPeter Neshumba, 36, began contract farming for Premium Leaf Zimbabwe in 2024. He says these companies go as far as controlling whether farmers can plant anything else. They want full devotion for their crops, he says. Until harvest, the land essentially belongs to them.\n\nIf a farmer doesnt stick to the rules, the company might refuse to buy their crop or leave them without a contract the next season, he says.\n\nA contract analyzed in a 2023 study in Oikos, a journal published by Zimbabwe Ezekiel Guti University, shows just how tobacco contracts lock small-scale farmers into risky debt. The 2019-20 Tian Ze contract required farmers to repay loans before seeing any profit, even requiring some to put their property on the line as collateral.\n\nThese arrangements undermine Zimbabwes land reforms, says George Seremwe, the president of the Zimbabwe Tobacco Growers Association. The reforms were meant to redress colonial imbalances, but contract farming introduces new vulnerabilities for small-scale farmers as they cede control of their land to contracting companies.\n\nBut Nelson Marongwe, an independent land expert who has researched tobacco farming and land rights, doesnt think so. The contracts are valid, he says, and address a production gap.\n\nBut it needs to be for a limited period, he says, as there is a risk of farmers losing autonomy and companies abusing their bargaining power.\n\nTobacco farmer Peter Neshumba waits for payment after selling his crop to Premium Leaf Zimbabwe in Harare. He says contract farming controls nearly every aspect of production, leaving farmers with little say over their land until harvest. Photo credit: Linda Mujuru, GPJ Zimbabwe\n\nThe tobacco board is trying to make these arrangements fairer to farmers, Matsvaire says. The government is implementing a framework to ensure farmers receive a fair share of profits, receive inputs in time and arent burdened with overpriced or substandard inputs. The framework will also set a minimum input package for farmers.\n\nMatsvaire adds that this farming season, the Reserve Bank of Zimbabwe has mandated that tobacco farmers retain 70% of their earnings, in US dollars to protect them from exchange-rate losses.\n\nBut Ngoma says other issues, like land control and alternative financing methods, still need to be addressed.\n\nOne solution, Marongwe, the land expert, says, is to secure rural land rights for all farmers, which would expand access to other financing options.\n\nSeremwe says farmers need fairer terms, but the solution is not to abandon contract farming, since the country needs the foreign investment.\n\nDespite the challenges, Neshumba plans to keep contract farming. He doesnt have financing alternatives. When he started, he hoped for better returns. Now that Im in it, he says, I feel used.\n\nFor farmers like Ngoma, the goal is self-financing.\n\nContract farming, he says, is a bondage.\n\nLinda Mujuruis a Reporter-in-Residence based in Harare, Zimbabwe. A renowned international reporter and public speaker, she has spent nearly a decade covering human rights, the mining sector, the economy, and public health. She holds an MBA from Midlands State University and both masters and bachelors degrees in Journalism and Media Studies from the National University of Science and Technology in Zimbabwe. Linda is one of Global Presss most widely read and syndicated journalists. In 2023, she won the Community Champion Award from the Institute for Nonprofit News for her story Push for Gold Leaves a Toxic Legacy.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/01085300/01_GPJNews_Zimbabwe_GM_TobaccoFDI_65_LEAD.JPG_web.jpg",
            "description": "<p>By Linda Mujuru, GPJ Zimbabwe This story was originally published by Global Press Journal Land reforms gave Zimbabweans farms — but contract tobacco deals have handed power to private companies. HARARE, ZIMBABWE — Zimbabwe’s tobacco sector was once on the brink of collapse. Now, it’s booming again. Last year alone, it earned the country close</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/inside-the-bondage-of-zimbabwes-contract-tobacco-farming/\">Inside the ‘Bondage’ of Zimbabwe’s Contract Tobacco Farming</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "02 Sep 2025"
        },
        {
            "title": "Zimbabwe central bank outlines plans to adopt ZiG as sole currency",
            "url": "https://www.newzimbabwe.com/zimbabwe-central-bank-outlines-plans-to-adopt-zig-as-sole-currency/",
            "content": "Bloomberg\n\nZimbabwes central bank has set targets it must achieve before the gold-backed ZiG becomes the nations sole currency by the end of the decade.\n\nThe southern African nation plans to abandon the use of US dollars in transactions by 2030 and switch to a mono-currency system. Five previous attempts have failed, with the ZiG, short for Zimbabwe Gold, introduced in April 2024 the latest bid.\n\nThe steps include building foreign reserves to three to six months of import cover, reducing annual inflation from 94% to single digits by next year and containing the exchange rate premium between the official and parallel market at less than 30%, the central bank said in a post on its X account on Monday.\n\nThe state-controlled Sunday Mail newspaper reported that the country has enough reserves to only cover one month of imports, citing Governor John Mushayavanhu.\n\nUnder a mono-currency system, individuals and businesses will be allowed to hold local- and foreign-currency denominated accounts but will need to convert foreign currency into ZiG to conduct domestic transactions, the central bank said.\n\nThe nations lenders will also continue to honour legitimate foreign-currency requirements such as imports, travel and expenses, it said. A top business lobby group last week called for the central bank to formalise and legalise its proclamations on phasing out the dollar.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171609/mushayavanhu-zig-4.jpg",
            "description": "<p>Bloomberg Zimbabwe’s central bank has set targets it must achieve before the gold-backed ZiG becomes the nation’s sole currency by the end of the decade. The southern African nation plans to abandon the use of US dollars in transactions by 2030 and switch to a mono-currency system. Five previous attempts have failed, with the ZiG,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-central-bank-outlines-plans-to-adopt-zig-as-sole-currency/\">Zimbabwe central bank outlines plans to adopt ZiG as sole currency</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "02 Sep 2025"
        },
        {
            "title": "Take positions – government says over a year after announcing Mutasa Airport plans",
            "url": "https://www.newzimbabwe.com/take-positions-government-says-over-a-year-after-announcing-mutasa-airport-plans/",
            "content": "By Staff Reporter\n\nMORE than a year after announcing plans to construct an International Airport in Manicaland, government is still inviting investors for the take-off of the project.\n\nLast year, government announced plans to construct an airport in Mutare which is envisagedto be vital for the Manicaland provincestourism sites as wellas the mining sector.\n\nThe project had been touted as a game changer in exposing the tourist destinations in Manicaland.\n\nAfter identifying an area in Mutasa, government indicated that a feasibility study would have been completed by theend of the first quarterof this year.\n\nPosting on his X handle under the pseudonym Jamwanda, Presidential Spokesperson, George Charamba said investors should take positions for the airport project.\n\nBy the way, a new International Airport has been planned for Manicaland in the Mutasa Area. Those keen to invest must take forward positions, said Charamba.\n\nCharambas sentiments follow an announcement by Air Zimbabwe that it would be introducing the Mutare flights during the Sanganai/Hlanganani World Travel Expo, which will run from September 10 to 12.\n\nThe flights will provide a seamless travel for tourists to visit attractions in Manicaland Province.\n\nIn a statement, Air Zimbabwe Chief Executive Edmund Makona indicated that the flights might be a common feature after the Expo.\n\nThis operation is a pilot project. We are testing the market, understanding demand, and exploring the long-term viability of this route. If the demand is there, Air Zimbabwe will be ready to make it a permanent feature of our network, said Makona.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/01/20170847/The-AirZimbabwe-B777.jpg",
            "description": "<p>By Staff Reporter MORE than a year after announcing plans to construct an International Airport in Manicaland, government is still inviting investors for the take-off of the project. Last year, government announced plans to construct an airport in Mutare which is envisaged to be vital for the Manicaland province’s tourism sites as well as the mining sector. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/take-positions-government-says-over-a-year-after-announcing-mutasa-airport-plans/\">Take positions – government says over a year after announcing Mutasa Airport plans </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "02 Sep 2025"
        },
        {
            "title": "Putin says he reached ‘understandings’ with Trump over end of Ukraine war",
            "url": "https://www.newzimbabwe.com/putin-says-he-reached-understandings-with-trump-over-end-of-ukraine-war/",
            "content": "BBC\n\nRussian President Vladimir Putin says he reached understandings with US President Donald Trump over the end of the Ukraine war at their meeting in Alaska last month.\n\nBut he did not say whether he would agree to peace talks with Ukrainian President Volodymyr Zelensky brokered by Trump, who had apparently given Monday as a deadline for Putins response.\n\nSpeaking during a summit in China, Putin continued to defend his decision to invade Ukraine, once again blaming the West for the war.\n\nFollowingthe Alaska meeting, US special envoy Steve Witkoff said Putin had agreed to security guarantees for Ukraine as part of a potential future peace deal, though Moscow has yet to confirm this.\n\nPutin was speaking in Tianjin at the Shanghai Co-operation Organisation summit, where he met Xi Jinping and Narendra Modi.\n\nHe thanked the Chinese and Indian leaders for their support and their efforts to facilitate the resolution of the Ukrainian crisis.\n\nChina and India are the biggest buyers of Russian crude oil, attracting criticism from the West that they are propping up the Russian economy which has been battered by the war effort.\n\nIn his speech, Putin also said that the understandings reached at his meeting with Trump in Alaska were I hope, moving in this direction, opening the way to peace in Ukraine.\n\nAt the same time, he reiterated his view that this crisis wasnt triggered by Russias attack on Ukraine, but was a result of a coup in Ukraine, which was supported and provoked by the West.\n\nHe also attributed the war to the Wests constant attempts to drag Ukraine into Nato.\n\nThe Russian president has consistently opposed the idea of Ukraine joining the Western military alliance. But both this claim  and that the war was provoked  have been repeatedly rebuffed by Western allies.\n\nIt was in 2014 that Putin seized Crimea and Russian proxies grabbed part of eastern Ukraine. Years later, in February 2022,Putin then ordered Russias full-scale invasion of Ukraine.\n\nPutins latest comments come days after Russia launched itssecond biggest aerial attackon Ukraine in the war.\n\nOn Friday, French President Emmanuel Macron said that Putin faced a Monday deadline set by Trump to agree to peace talks with Zelensky.\n\nIf the Russian leader does not agree, it will show again President Putin has played President Trump, said Macron.\n\nBut in an interview with CNN, on 22 August, Trump himself again gave Putin a couple of weeks to give a response before the US takes action, in the latest of a series of ultimatums and deadlines he has issued to the Russian leader.\n\nTrump had previously said he could solve the Ukraine war in one day.\n\nFollowing his meeting with Putin last month, Trump dropped a demand for a ceasefire and called instead for a permanent peace deal.\n\nHe also met Zelensky along with top European leaders who paid an urgent visit to Washington DC.\n\nTrump insisted there would be no going into Nato by Ukraine as part of a peace deal.\n\nBut he also hinted there would be security guarantees, saying Europe was the first line of defence and that the US would be involved.\n\nWell give them good protection, he said, though he clarified it would not mean sending US troops to Ukraine.\n\nUS Special Envoy Witkoff also told CNN thatPutin had agreed to security guarantees.\n\nHe said this would see the US and Europe effectively offer Article 5-like language to cover a security guarantee, referring to the Nato clause which states that member states should defend another member that has come under attack.\n\nZelensky has said he expected a framework for security guarantees to be set out on paper as soon as this week.\n\nBut last Friday, Russia criticised Western proposals as one-sided and clearly designed to contain Russia, adding that it turned Kyiv into a strategic provocateur.\n\nRussian attacks on Ukraine have continued. Last Thursday, Moscow fired 629 drones and missiles at Kyiv, killing 23 people in one of the biggest aerial assaults of the war so far, prompting outrage from European leaders.\n\nGermany and France have since pledged to put pressure on Russia to agree to a deal.\n\nMeanwhile, Zelensky hasrejected proposals for a buffer zonewith Russia as part of a peace deal.\n\nHe has accused Russia of not being ready for diplomacy and seeking ways to postpone the end of the war.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/26183936/Russian-President-Vladimir-Putin.png",
            "description": "<p>BBC Russian President Vladimir Putin says he reached “understandings” with US President Donald Trump over the end of the Ukraine war at their meeting in Alaska last month. But he did not say whether he would agree to peace talks with Ukrainian President Volodymyr Zelensky brokered by Trump, who had apparently given Monday as a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/putin-says-he-reached-understandings-with-trump-over-end-of-ukraine-war/\">Putin says he reached ‘understandings’ with Trump over end of Ukraine war</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "02 Sep 2025"
        },
        {
            "title": "Kaya fires Sol Phenduka over ‘misogynistic remarks’ about Minnie Dlamini",
            "url": "https://www.newzimbabwe.com/kaya-fires-sol-phenduka-over-misogynistic-remarks-about-minnie-dlamini/",
            "content": "SowetanLive\n\nKaya 959 has officially fired radio personality Sol Phenduka as co-host of the breakfast show after misogynistic remarks were made about media personality Minnie Dlamini onPodcast and Chill with MacG.\n\nPhenduka was the co-host of #SizTheWorld breakfast show with Sizwe Dhlomo.\n\nIn a lengthy statement released on Monday, Kaya 959 acting managing executive, Dave Tiltmann, confirmed that the station had terminatedPhendukas contract with immediate effect after an internal review.\n\nKaya 959 cannot and will not condone comments made on the MacG Vodcast, where Sol Phenduka is an integral part of the presenting team, saidTiltmann.\n\nMisogynistic remarks made about actress Minnie Dlamini were unacceptable and inconsistent with respect owed to women. As a content provider of our flagship breakfast show, his alignment with comments made on the vodcast does not reflect who we are as a station, nor what our listeners expect of us.\n\nPhenduka was placed under suspension on August 20 pending the outcome of an internal process.\n\nTiltmann added that the incident was a further material breach of his Independent Contract, despite Sols written assurance to Kaya management in June 2023 that such conduct would not recur, while acknowledging his responsibilities as a representative of the station, apologising to the Kaya family and stakeholders, and committing to upholding the standards expected of him.\n\nTiltmann reiterated Kaya 959s values are not open to compromise.\n\nTrust, integrity, accountability, respect, and inclusivity are the foundations of Kaya 959. They guide everything we do on air, online and off air. We are answerable to our listeners, and when conduct falls short, we act decisively, Tiltmann said.\n\nTiltmann further explained that the decision followed a process aligned with Kaya 959s Independent Contractor Agreement, which allows for immediate termination in cases where the actions of an individual with a public profile bring the station into disrepute. Kaya 959 remains committed to maintaining a safe, respectful, and inclusive working environment, supported by rigorous broadcasting standards and a culture of accountability across all platforms.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/20183902/sol-phenduka.jpg",
            "description": "<p>SowetanLive Kaya 959 has officially fired radio personality Sol Phenduka as co-host of the breakfast show after “misogynistic remarks” were made about media personality Minnie Dlamini on Podcast and Chill with MacG. Phenduka was the co-host of #SizTheWorld breakfast show with Sizwe Dhlomo. In a lengthy statement released on Monday, Kaya 959 acting managing executive, Dave</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kaya-fires-sol-phenduka-over-misogynistic-remarks-about-minnie-dlamini/\">Kaya fires Sol Phenduka over ‘misogynistic remarks’ about Minnie Dlamini</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "02 Sep 2025"
        }
    ]
}