{
    "news": [
        {
            "title": "Ngezi Platinum coach Chiragwi fined US$4,000 for slapping player",
            "url": "https://www.newzimbabwe.com/ngezi-platinum-coach-chiragwi-fined-us4000-for-slapping-player/",
            "content": "By Sports Reporter\n\nNgezi Platinum Stars coach Takesure Chiragwi has been fined US$4,000 for slapping his player, Macdonald Makuwe in a heated match against Dynamos in October.\n\nUS$1,000 will be suspended on condition that he attends anger management sessions.\n\nChiragwi was captured in viral videos slapping Makuwe, who was trying to calm him down as he protested a red card issued for insulting the referee and challenged his decision.\n\nFollowing the incident, Chiragwi was suspended by his club, Ngezi Platinum Stars, for the remainder of the season and he stepped down as Warriors assistant coach.\n\nAs investigations into the assault commenced, Makuwe issued a statement trying to downplay the incident, saying Chiragwis hand had mistakenly come in contact with his face.\n\nIn a statement the PSL Disciplinary Committee said, Ngezi Platinum Stars FC were found guilty of disturbing the normal proceedings of a game and improper behavior by their players and technical team and fined a sum of US$5,000.\n\nHead Coach Takesure Chiragwi pleaded guilty to charges of violent and disorderly conduct and improper behavior likely to bring the League into disrepute.\n\nHe was fined US$4,000, of which US$1,000 was suspended on the condition that he attends anger management lessons with an organization approved by the PSL.\n\nThe PSL has also fined US$100.00 to Ngezi Platinum Stars player Kudzai Chigwida for challenging match officials decisions.\n\nNgezi Platinum Stars FC player Kudzai Chigwida was also found guilty of ungentlemanly conduct and improper utterances to a match official and fined US$100, further stated the PSL.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/05054452/takesure-chiragwi.jpeg",
            "description": "<p>By Sports Reporter Ngezi Platinum Stars coach Takesure Chiragwi has been fined US$4,000 for slapping his player, Macdonald Makuwe in a heated match against Dynamos in October. US$1,000 will be suspended on condition that he attends anger management sessions. Chiragwi was captured in viral videos slapping Makuwe, who was trying to calm him down as</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ngezi-platinum-coach-chiragwi-fined-us4000-for-slapping-player/\">Ngezi Platinum coach Chiragwi fined US$4,000 for slapping player</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "15 Nov 2025"
        },
        {
            "title": "Former NW Development Corporation CFO Kudakwashe Mpofu sentenced to three years in jail for fraud",
            "url": "https://www.newzimbabwe.com/former-nw-development-corporation-cfo-kudakwashe-mpofu-sentenced-to-three-years-in-jail-for-fraud/",
            "content": "Times Live\n\nThe Molopo specialised commercial crimes court has sentenced former CFO of the North West Development Corporation (NWDC) Kudakwashe Mpofu to three years imprisonment for fraud.\n\nThe court found Mpofu, 33, guilty of two counts of fraud, one of which was a custodial sentence.\n\nHe received an additional three years imprisonment, wholly suspended for five years, on condition he is not convicted of fraud during the period of suspension.\n\nMpofu was arrested in January by members of the Hawks serious corruption investigation unit after probes into the use of a fraudulent South African permanent residence permit, National Prosecuting Authority (NPA) spokesperson Sivenathi Gunya said.\n\nInvestigations revealed that the permit submitted by Mpofu had never been issued by the department of home affairs\n\n Sivenathi Gunya, NPA spokesperson\n\nThe court heard that in March 2021, the NWDC advertised a position of asset manager based at its head office in Mahikeng. Mpofu applied for the post and submitted all required documentation, including a fraudulent permanent residence permit. He was appointed on May 1 2021 and later promoted to CFO on June 1 2023.\n\nInvestigations revealed that the permit submitted by Mpofu had never been issued by the department of home affairs, Gunya said.\n\nDuring the trial, Mpofu pleaded guilty to both counts.\n\nIn aggravation of sentence, state advocate Nkhetheni Mudau argued that fraud remains a serious and prevalent offence. Mudau said the accused failed to disclose how he obtained the fraudulent document and had benefited financially, earning more than R3m during his tenure at the entity.\n\nThese sentences underscore the NPAs commitment to combating and prosecuting commercial crimes that undermine public trust and institutional integrity, North West director of public prosecutions Rachel Makhari said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/13102413/kudakwashe-mpofu.jpg",
            "description": "<p>Times Live The Molopo specialised commercial crimes court has sentenced former CFO of the North West Development Corporation (NWDC) Kudakwashe Mpofu to three years’ imprisonment for fraud. The court found Mpofu, 33, guilty of two counts of fraud, one of which was a custodial sentence. He received an additional three years’ imprisonment, wholly suspended for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/former-nw-development-corporation-cfo-kudakwashe-mpofu-sentenced-to-three-years-in-jail-for-fraud/\">Former NW Development Corporation CFO Kudakwashe Mpofu sentenced to three years in jail for fraud</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "15 Nov 2025"
        },
        {
            "title": "COP30: Zimbabwe’s forest and energy projects reveal the downside of carbon credits",
            "url": "https://www.newzimbabwe.com/cop30-zimbabwes-forest-and-energy-projects-reveal-the-downside-of-carbon-credits/",
            "content": "By Fadzai Chipato, The Conversation\n\nCarbon offsetsare a way for companies or countries that pollute the air to cancel out some of their carbon emissions by funding projects that protect forests, plant trees, or provide clean energy  sometimes on the other side of the world. Polluting companies in the US, Europe, Asia or elsewhere can buy onecarbon creditfrom a green project anywhere in exchange for emitting one metric tonne of carbon dioxide (CO). But do these projects benefit the African countries that host them? Rural development researcher Fadzai Chipato studied two carbon offset projects in Zimbabwe.Her research foundthat these projects can negatively affect local communities.\n\nIn Zimbabwe, carbon offsetting began around 2011 with theKariba REDD+(reducing emissions from deforestation and forest degradation in developing countries) project.\n\nIt was run by a Zimbabwean company,Carbon Green Africa, which leased 758,000 hectares of degraded forest from four local councils in northern Zimbabwe where forest could be regrown for the purpose of selling carbon credits.\n\nThe company aimed to work with local communities to halt deforestation throughconservation farming protecting the soil by not digging in it and planting a variety of crops. They also funded nutrition gardens and beekeeping projects, and providedbiogas digestersand fuel-efficient stoves to reduce the number of trees cut down for firewood.\n\nMany families benefited through food, education, and extra income. However, the projects were run from the top down. Decisions were made by investors, the government, and rural district councils. Local villagers had very little say.\n\nIn 2023, Zimbabwe passed anew carbon trading law. This required all carbon projects to be registered withthe governmentand pay 30% of revenues to the state. TheKariba REDD+was stopped, leaving villagersunsurewhether their gardens, beekeeping, and clean energy projects would continue.\n\nThe second project I studied is theCicada Holdings Project, which aimed to plant 100 million indigenous trees over 30 years and give out 120,000 cookstoves that use less firewood.\n\nUnlike Kariba, Cicada worked more closely with local farmers and by December 2025, it had given out 160,000 environmentally friendly stoves. However, it was also slowed down by the new law, with the government taking more than 18 months to process new registrations.\n\nOn the positive side,the Kariba projectset up 24 community gardens, including seven school gardens, that provided 3,000 people directly or indirectly with food. One garden generated enough income to support 10 orphans.\n\nThe community gardens have improved my familys quality of life. I managed to pay my daughters school fees and buy household supplies.\n\nNewconservation farmingmethods were introduced. Maize, and two nutritious crops that are fairly drought resistant  sorghum and millet  were grown. Beekeeping in the forests was also introduced. As farmers said:\n\nWe learned about innovative agriculture practices to improve our yields, which were low due to the low rainfall. We now experience better harvests, improving our food sustenance and even selling excess crops, generating financial income.\n\nBeyond forest preservation, beekeeping provides additional income for farmers and serves as a rich source of food for humans, thereby improving community livelihoods.\n\nThe Kariba REDD+ project also builtbiogas digestersat hospitals to generate clean energy from dung. Local villagers could sell cattle dung to these projects in exchange for medical treatments and cash.\n\nCicadas clean cookstoves reduced smoke-related illnesses and had other benefits:\n\nThe stoves are very helpful; we are no longer collecting firewood, which was getting difficult to find.\n\nOn the other hand,my research revealedthat many communities were excluded from decision-making. Some only found out about projects in their villages through the media. Local politicians were also unhappy when projects were put on ice after the new law introduced stringent registration requirements:\n\nWe were shocked when the project was stopped, saying the government was not involved. We asked ourselves, arent Rural District Councils part of the government?\n\nA further problem was that project funds went through many intermediary brokers, councils and non-governmental organisations. Villagers never knew how much money the carbon credits were generating or how it was spent. This lack of transparency caused mistrust.\n\nOverall,my research found thatcarbon offsets in Zimbabwe have not been neutral tools. They are political and economic processes that reshape who controls land, who benefits, and who is left out. Because they restrict traditional access to forests, firewood and grazing land, these projects create virtual dispossession.\n\nFor example, people were stopped from collecting firewood, grazing cattle, or making bricks in forest areas that had always been communal land. Women and youth who earned a living from the forests were badly affected by having fewer rights to use their land.\n\nThismirrorswider patterns across Africa, where communal land that supports households is redefined as underutilised and given over global carbon markets, often without fair consultation with the people using the land.\n\nTo make carbon offsetting fairer in Zimbabwe and the global south, several measures are needed:\n\nWithout these changes, carbon offsetting risks becoming another form of green grabbing that takes land and resources from Indigenous people who have used them for centuries in the name of climate change adaptation.\n\nLecturer in the Department of Sociology and Social Anthropology, Great Zimbabwe University\n\nThis article was originally published byThe Conversation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/04/22192853/vegetation-scaled-e1587580165697.jpg",
            "description": "<p>By Fadzai Chipato, The Conversation Carbon offsets are a way for companies or countries that pollute the air to “cancel out” some of their carbon emissions by funding projects that protect forests, plant trees, or provide clean energy – sometimes on the other side of the world. Polluting companies in the US, Europe, Asia or elsewhere</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cop30-zimbabwes-forest-and-energy-projects-reveal-the-downside-of-carbon-credits/\">COP30: Zimbabwe’s forest and energy projects reveal the downside of carbon credits</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "15 Nov 2025"
        },
        {
            "title": "Zimbabwe lithium miners seek VAT moratorium until end of 2026",
            "url": "https://www.newzimbabwe.com/zimbabwe-lithium-miners-seek-vat-moratorium-until-end-of-2026/",
            "content": "Bloomberg\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/21050825/lithium.webp",
            "description": "<p>Bloomberg Zimbabwean lithium miners have asked the government to defer the imposition of a tax on concentrates until the end of 2026, so they can raise capital to construct processing plants. The southern African country levies VAT of 5% on lithium concentrates, which have to be beneficiated to a certain level to avoid the tax.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-lithium-miners-seek-vat-moratorium-until-end-of-2026/\">Zimbabwe lithium miners seek VAT moratorium until end of 2026</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "15 Nov 2025"
        },
        {
            "title": "Zimbabwe seeks to increase SMEs’ access to Chinese market, says minister",
            "url": "https://www.newzimbabwe.com/zimbabwe-seeks-to-increase-smes-access-to-chinese-market-says-minister/",
            "content": "Xinhua\n\nZimbabwe is actively seeking to increase access for its small and medium-sized enterprises (SMEs) to the Chinese market, leveraging on existing trade relations between the two countries, a Zimbabwean cabinet minister said Wednesday.\n\nResponding to a question from Xinhua on the sidelines of the SMEs International Expo in Harare, Zimbabwes capital, Minister of Women Affairs, Community, Small and Medium Enterprises Development Monica Mutsvangwa said the Chinese market can provide momentum to propel SMEs into globally competitive enterprises through market access and industry partnerships.\n\nChina is a big market, and we want to take advantage and leverage the good relationships between our two countries, she said.\n\nMutsvangwa said locally produced heritage products and cultural artefacts, such as indigenous stone and wood sculptures, can be exported to China, further elevating the export portfolios of local SMEs.\n\nWhen it comes to indigenous products, we have very good products which Chinese consumers really love, especially artifacts, she said. What we do produce is organic, and it is what the Chinese are very much interested in.\n\nThe minister noted that to further expand into the Chinese market, local enterprises, including medium enterprises, exhibited at the China International Import Expo, which just ended in Chinas Shanghai.\n\nMutsvangwa emphasized the need to capacitate local SMEs through digital skills to enable them to achieve scalable growth and expand into the Chinese digital market.\n\nWe want our SMEs to learn, especially digital skills. We know that a lot of businesses are now being done online, so when we do not train our SMEs enough digital skills, we are automatically discriminating them from the e-commerce, e-market, she said.\n\nZimbabwes SMEs International Expo is an annual exhibition that seeks to create synergies and a networking platform for micro, small and medium businesses.\n\nSMEs are a key pillar of Zimbabwes economy, accounting for a significant share of employment and contributing more than 60 percent to Zimbabwes gross domestic product, according to the Ministry of Women Affairs, Community, Small and Medium Enterprises Development.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/11/05165231/Monica-Mutsvangwa-Information-Minister.jpg",
            "description": "<p>Xinhua Zimbabwe is actively seeking to increase access for its small and medium-sized enterprises (SMEs) to the Chinese market, leveraging on existing trade relations between the two countries, a Zimbabwean cabinet minister said Wednesday. Responding to a question from Xinhua on the sidelines of the SMEs International Expo in Harare, Zimbabwe’s capital, Minister of Women</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-seeks-to-increase-smes-access-to-chinese-market-says-minister/\">Zimbabwe seeks to increase SMEs’ access to Chinese market, says minister</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "15 Nov 2025"
        },
        {
            "title": "5 killed in car crash along Harare-Nyamapanda highway",
            "url": "https://www.newzimbabwe.com/5-killed-in-car-crash-along-harare-nyamapanda-highway/",
            "content": "By Staff Reporter\n\nA UNITED Methodist Church reverend and four others died in an accident Wednesday night after the vehicle they were travelling in rammed into a stationary truck.\n\nThe accident occurred around 9 pm along the Harare-Nyamapanda highway.\n\nThe Zimbabwe Republic Police (ZRP) confirmed the road traffic accident.\n\nThe ZRP confirms a fatal road traffic accident which occurred on November 12, 2025 at around 2055 hours at the 68 kilometre peg along Harare-Nyamapanda Road, said Commissioner Paul Nyathi.\n\nFive people were killed when a Toyota Hilux vehicle with four passengers on board rammed into the back of a stationary Iveco, 10-tonne truck.\n\nThe bodies of the victims were taken to Musami Hospital mortuary for post-mortem.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/14063147/Hre-Nyamapanda-accident.jpeg",
            "description": "<p>By Staff Reporter A UNITED Methodist Church reverend and four others died in an accident Wednesday night after the vehicle they were travelling in rammed into a stationary truck. The accident occurred around 9 pm along the Harare-Nyamapanda highway. The Zimbabwe Republic Police (ZRP) confirmed the road traffic accident. “The ZRP confirms a fatal road</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/5-killed-in-car-crash-along-harare-nyamapanda-highway/\">5 killed in car crash along Harare-Nyamapanda highway</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "15 Nov 2025"
        }
    ]
}