{
    "news": [
        {
            "title": "Isiah Mupfurutsa elected new PSL boss, Chido Chizondo takes reins at ZWSL",
            "url": "https://www.newzimbabwe.com/isiah-mupfurutsa-elected-new-psl-boss-chido-chizondo-takes-reins-at-zwsl/",
            "content": "By Sports Reporter\n\nSimba Bhora chairman Isiah Mupfurutsa has been elected the new Premier Soccer League (PSL) chairman.\n\nMupfurutsa received 10 votes, defeating Masimba Chihowa who secured 8 votes.\n\nIn the first round, Mupfurutsa had garnered 8 votes, followed by Chihowa with 5, Leonard Musariri of Ngezi Platinum Stars with 3, and Dumisani Sisale of FC Platinum with 2 votes.\n\nMupfurutsa will be deputised by Highlanders chairman Kenneth Mhlope, while Dynamos chairman Moses Maunganidze and TelOnes Oscar Nduwure have been elected as members of the Emergency Committee.\n\nMeanwhile, in the Zimbabwe Womens Super League (ZWSL) election, Platinum Royals Chido Chizondo was elected the new chairperson.\n\nChizondo defeated Ntokoziso Moyo of Black Rhinos Queens in a two-horse race.\n\nShe will be assisted by Lewis Muzhara as vice-chairperson, while Mercy Makuwatsine, James Shamuyarira, Mupfudza Rugwevera, Sibusisiwe Dube, and Talent Chitsaka were elected as board members.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/25124324/Isaiah-Mupfurutsa2.jpg",
            "description": "<p>By Sports Reporter Simba Bhora chairman Isiah Mupfurutsa has been elected the new Premier Soccer League (PSL) chairman. Mupfurutsa received 10 votes, defeating Masimba Chihowa who secured 8 votes. In the first round, Mupfurutsa had garnered 8 votes, followed by Chihowa with 5, Leonard Musariri of Ngezi Platinum Stars with 3, and Dumisani Sisale of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/isiah-mupfurutsa-elected-new-psl-boss-chido-chizondo-takes-reins-at-zwsl/\">Isiah Mupfurutsa elected new PSL boss, Chido Chizondo takes reins at ZWSL</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:10",
            "date": "25 Jul 2025"
        },
        {
            "title": "COP15 opens in Zimbabwe with call for global efforts in wetland preservation",
            "url": "https://www.newzimbabwe.com/cop15-opens-in-zimbabwe-with-call-for-global-efforts-in-wetland-preservation/",
            "content": "Xinhua\n\nThe 15th Meeting of the Conference of the Contracting Parties to the Ramsar Convention on Wetlands (COP15) opened on Thursday in Zimbabwes resort city of Victoria Falls, with a call for international cooperation in the global wetland preservation.\n\nRunning under the theme of Protecting Wetlands for Our Common Future, the COP15 brought together its contracting parties to strengthen international commitments for wetland conservation and to highlight the vital role of wetlands in sustaining ecological health, biodiversity, and climate resilience.\n\nAddressing the opening ceremony, Musonda Mumba, secretary general of the Convention on Wetlands, said global efforts are crucial in safeguarding wetlands, as they play a vital role in the health of the ecosystem.\n\nShe noted that through global efforts, the convention offers a platform for collaboration and for science-based action. Across the world and even here in Africa, the change has been seen. Countries are working very hard.\n\nMumba urged policymakers and responsible stakeholders to make decisions and adopt policies that prioritize wetland protection.\n\nLet us make this moment where political leadership meets practical action, when commitments become implementation, and where wetlands are finally recognized as the backbone of sustainability, she added.\n\nYan Zhen, deputy head of Chinas National Forestry and Grassland Administration, noted that in recent years, China has continuously improved its legal and institutional framework for wetland conservation, comprehensively protected wetland ecosystems, and actively engaged in international cooperation, continuously contributing to global wetland protection efforts.\n\nThe Chinese delegation said they will engage in open dialogue to share experiences and build consensus with all contracting parties to help produce meaningful and impactful outcomes from the conference.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/23201538/Wetlands-COP15-meeting-in-Zimbabwe.jpeg",
            "description": "<p>Xinhua The 15th Meeting of the Conference of the Contracting Parties to the Ramsar Convention on Wetlands (COP15) opened on Thursday in Zimbabwe’s resort city of Victoria Falls, with a call for international cooperation in the global wetland preservation. Running under the theme of “Protecting Wetlands for Our Common Future,” the COP15 brought together its</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cop15-opens-in-zimbabwe-with-call-for-global-efforts-in-wetland-preservation/\">COP15 opens in Zimbabwe with call for global efforts in wetland preservation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:10",
            "date": "25 Jul 2025"
        },
        {
            "title": "Cape Verde, Zimbabwe and South Africa projects triumph at Durban FilmMart",
            "url": "https://www.newzimbabwe.com/cape-verde-zimbabwe-and-south-africa-projects-triumph-at-durban-filmmart/",
            "content": "ScreenDaily\n\nProjects from South Africa, Cape Verde and Zimbabwe were among the big winners at the 16th edition of the Durban FilmMart (DFM), which wrapped this week.\n\nThis years market was attended by 1,364 filmmakers and industry professionals from 63 countries, and culminated in the presentation of 39 awards for projects focused on African storytellingincluding development grants, co-production opportunities, festival invitations, and industry mentorships.\n\nCape Verde documentary projectPlastic Atlantis, about the link between slavery and ocean pollution in Cape Verde, won six prizes including the Sundance Institute Documentary Fund New Voices Award, a Climate Story Labs award, plus prizes from OIF-ACP-EU, Sheffield Doc Fest,DOC-A and Women Make Movies. It is directed by Samira Vera-Cruz and produced by Pedro Soul through Cape Verde-based Kriolscope (KS).\n\nZimbabwean feature documentaryGoldenwon three prizes: a Red Sea Film Fund award, a Canal+ development grant, and the DOK.fest Mnchen award. The documentary traces Zimbabwe womens national hockey teams road to the 2025 Womens FIH Hockey Junior World Cup  45 years after the countrys only Olympic medal in a team sport. It is directed by Rumbi Katedzaand produced by Rumbi Katedza and Ingrid Martens through Mai Jai Films.\n\nSouth African dark comedy projectThe Second Coming, about a man convinced he is the Messiah, won three prizes including a Red Sea Film Fund award, a National Film and Video Foundation of South Africa (NFVF) best fiction grant, and the Inkaba Award.The Second Coming isdirected by Durban-based Michael James and produced by Siyabonga Xaba of Maverick Resistance.\n\nWe are delighted to have hosted such a dynamic array of filmmakers from across the African continent. They entrusted us with their projects and ideas, and generously shared their time, expertise, and passion through enriching conversations, creating a truly African event, said Magdalene Reddy, director of the Durban FilmMart Institute (DFMI).\n\nDFM 2025, took place from 18  21 July in Durban.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/24201001/1455962_dfm2025awardwinnersanddfmteam_120356_crop.jpg",
            "description": "<p>ScreenDaily Projects from South Africa, Cape Verde and Zimbabwe were among the big winners at the 16th edition of the Durban FilmMart (DFM), which wrapped this week. This year’s market was attended by 1,364 filmmakers and industry professionals from 63 countries, and culminated in the presentation of 39 awards for projects focused on African storytelling—including</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cape-verde-zimbabwe-and-south-africa-projects-triumph-at-durban-filmmart/\">Cape Verde, Zimbabwe and South Africa projects triumph at Durban FilmMart</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:10",
            "date": "25 Jul 2025"
        },
        {
            "title": "What the Eastern Cape High Court ruling means for foreign employee terminations",
            "url": "https://www.newzimbabwe.com/what-the-eastern-cape-high-court-ruling-means-for-foreign-employee-terminations/",
            "content": "IOL\n\nSOUTH AFRICA  A foreign national employee must be provided with proper notice of their termination in line with the Basic Conditions of Employment Act (BCA). Failure to provide such notice may result in the termination being unlawful.\n\nThis is the warning of employment law experts at Cliffe Dekker Hofmeyr (CDH), following a recent Eastern Cape High Court judgment.\n\nThis was after an application by a research assistant and Zimbabwean national, Samuel Nyakudya.\n\nHe was granted a temporary residence permit allowing him to reside in South Africa and seek employment in the category of general work as provided for under the Immigration Act.\n\nHis employer, the OR Tambo District Municipality, however, terminated his employment contract due to allegations of its unlawfulness and irregularity.\n\nCommenting on the case, CDH said that this area of termination has just become a lot clearer for employers after the recent ruling, stating that employing a foreign national without a work visa does not automatically grant an employer the right to summarily terminate the employment contract.\n\nThis indicates a key warning for employers highlighting their responsibility to act lawfully and in accordance with the BCA, CDH said.\n\nThe experts explained that a foreign national employee must be provided with proper notice of their termination in line with the BCA. Failure to provide such notice may result in the termination being unlawful. The dismissal may also be found to be unfair in the CCMA (Commission for Conciliation, Mediation and Arbitration).\n\nNyakudya was employed on successive fixed-term contracts, but following the expiration of his last contract, the municipality allowed him to continue working without a new fixed-term contract.\n\nThroughout his employment, Nyakudya was not consistently in possession of a work visa. In November 2023, the municipality notified him that his contract had expired on March 31, 2022, and that he had failed to provide a copy of his South African identity document, despite being requested to do so.\n\nConsequently, the municipality claimed it had no choice but to terminate his employment immediately, citing the unlawful nature of his contract due to the expiration of his work visa.\n\nWhile Nyakudya could have contested the fairness of his dismissal before the CCMA, he opted to challenge the termination in the High Court.\n\nThe court ultimately ruled that Nyakudyas employment contract termination was unlawful..\n\nCDH said the Immigration Act outlines an employers responsibilities regarding the employment of foreign nationals, specifically in Section 38, which prohibits the employment of illegal foreigners or those whose status does not authorise them to work.\n\nIt said the court also referenced Section 49(3) of the Immigration Act, which states that employing an illegal foreigner or a foreigner in violation of the Act constitutes a criminal offence.\n\nThe court confirmed that such employment is punishable by fines or imprisonment upon conviction.\n\nRegarding the summary termination of Nyakudyas contract, the court considered Section 37(1) of the BCEA, which stipulates the notice period required for termination based on the duration of employment.\n\nThe court highlighted that the purpose of providing notice is to allow employees to prepare for a smooth transition.\n\nNyakudyas lack of a work visa or South African identity document was a critical factor in the case. The court determined that employing a foreign national without a work visa is prohibited, and thus, the municipalitys immediate termination of Nyakudyas contract was unlawful.\n\nThis case serves as a significant reminder that employing a foreign national without a work visa does not automatically grant an employer the right to terminate the employment contract summarily, CDH warned.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/24202404/Screenshot-2025-07-24-at-21.20.52.png",
            "description": "<p>IOL SOUTH AFRICA – A foreign national employee must be provided with proper notice of their termination in line with the Basic Conditions of Employment Act (BCA). Failure to provide such notice may result in the termination being unlawful. This is the warning of employment law experts at Cliffe Dekker Hofmeyr (CDH), following a recent</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/what-the-eastern-cape-high-court-ruling-means-for-foreign-employee-terminations/\">What the Eastern Cape High Court ruling means for foreign employee terminations</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:10",
            "date": "25 Jul 2025"
        },
        {
            "title": "Tens of thousands knocked offline after software failure at Musk’s Starlink",
            "url": "https://www.newzimbabwe.com/tens-of-thousands-knocked-offline-after-software-failure-at-musks-starlink/",
            "content": "The Guardian\n\nSpaceXs Starlink suffered one of its biggest international outages on Thursday when an internal software failure knocked tens of thousands of users offline, a rare disruption forElon Musks powerful satellite internet system.\n\nUsers began experiencing the outage at around 3pm EDT (1900 GMT), according to Downdetector, a crowdsourced outage tracker that said as many as 61,000 user reports to the site had been made.\n\nStarlink, which has more than 6 million users across roughly 140 countries and territories, later acknowledged the outage on its X account and said we are actively implementing a solution.\n\nStarlink service mostly resumed after 2.5 hours, Michael Nicolls, Starlink vice-president of Starlink Engineering, wrote on X.\n\nThe outage was due to failure of key internal software services that operate the core network, Nicolls said, apologizing for the disruption and vowing to find its root cause.\n\nMusk also apologized. Sorry for the outage.SpaceXwill remedy root cause to ensure it doesnt happen again, the SpaceX CEO wrote on X.\n\nThe outage was a rare hiccup for SpaceXs most commercially sensitive business that had experts speculating whether the service, known for its resilience and rapid growth, had been beset by a glitch, a botched software update or even a cyber-attack.\n\nDoug Madory, an expert at the internet analysis firm Kentik, said the outage was global and that such a sweeping interruption was unusual.\n\nThis is likely the longest outage ever for Starlink, at least while it became a major service provider, Madory said.\n\nAs Starlink has gained more users, SpaceX has focused heavily in recent months on updating its network to accommodate demands for higher speed and bandwidth.\n\nThe company, in a partnership with T-Mobile, is also expanding the constellation with larger, more powerful satellites to offer direct-to-cell text-messaging services, a line of business in which mobile phone users can send emergency text messages through the network in rural areas.\n\nSpaceX has launched more than 8,000 Starlink satellites since 2020, building a uniquely distributed network in low Earth orbit that has attracted intense demand from militaries, transportation industries and consumers in rural areas with poor access to traditional, fiber-based internet.\n\nId speculate this is a bad software update, not entirely dissimilar to the CrowdStrike mess with Windows last year, or a cyber-attack, said Gregory Falco, director of a space and cybersecurity laboratory at Cornell University.\n\nAn update to CrowdStrikes widely used cybersecurity software led to worldwide flight cancellations and affected industries around the globe in July last year. The outage disrupted internet services, affecting 8.5 million Microsoft Windows devices.\n\nIt was unclear whether Thursdays outage affected SpaceXs other satellite-based services that rely on the Starlink network. Starshield, the companys military satellite business unit, has billions of dollars worth of contracts with the Pentagon and US intelligence agencies.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/02/22182245/starlink.jpeg",
            "description": "<p>The Guardian SpaceX’s Starlink suffered one of its biggest international outages on Thursday when an internal software failure knocked tens of thousands of users offline, a rare disruption for Elon Musk’s powerful satellite internet system. Users began experiencing the outage at around 3pm EDT (1900 GMT), according to Downdetector, a crowdsourced outage tracker that said as</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tens-of-thousands-knocked-offline-after-software-failure-at-musks-starlink/\">Tens of thousands knocked offline after software failure at Musk’s Starlink</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:10",
            "date": "25 Jul 2025"
        },
        {
            "title": "Journalist Edmund Kudzayi seeks reversal of US$100,000 defamation award to Mahere",
            "url": "https://www.newzimbabwe.com/journalist-edmund-kudzayi-seeks-reversal-of-us100000-defamation-award-to-mahere/",
            "content": "By Mary Taruvinga\n\nJournalist Edmund Kudzayi has formally requested the High Court to rescind a default judgment that awarded US$100,000 in damages to top lawyer Fadzayi Mahere in a defamation case.\n\nThe case stemmed from allegations by the Kukurigo owner that Mahere was dating a married businessman, Tinashe Murapata which had caused the collapse of his marriage.\n\nKudzayi argues that the judgment was issued without proper legal procedure, and he claims a bona fide defense against the allegations made by Mahere.\n\nKudzayi, through his legal representatives at Gunje Legal Practice in Harare, stated that he was neither in wilful default nor was he given adequate opportunity to present his defense.\n\nThe default judgment, which was granted on July 10, 2025, arose from a civil claim filed by Mahere in case number HC3060/22.\n\nThe crux of Kudzayis argument rests on a series of procedural irregularities.\n\nHe said the case had previously been struck off the court roll due to Maheres failure to prosecute, alleging further that her claims regarding the status of the case were misrepresented to the court.\n\nAt all material times, I have been participating in the matter, filing all papers on time, demonstrating my desire to have my defense ventilated and vindicated in open court, Kudzayi stated.\n\nKudzayi also contends that he was obstructed from attending a crucial hearing due to security restrictions at the High Court, an incident he claims was acknowledged by both Mahere and her legal representatives.\n\nIt is his argument that this obstruction led to his defense being struck off without his knowledge or the proper legal foundation.\n\nMy defence was struck out and the matter placed on the unopposed my knowledge, apparently without a formal application (I certainly one on the consolidated record) after a hearing on 24 March 2025 before Hon Justice Wamambo, a hearing I was obstructed from attending by High Court security even though I was in the High Court building.\n\nThe fact that I was obstructed from attending the hearing by security at the High Court is known to the Court and the Defendant and her legal practitioners who, as officers of the Court, would have known that I was not in wilful default and should not have chosen to snatch at a judgment but sought to have the matter heard on the merits.\n\nEven if the judgment is rescinded and the matter is set back to where it was, I have reasonable grounds for success in the main action, he said.\n\nIn his application, Kudzayi also said that Maheres claims are not only unfounded but also benefit from an exaggerated damages award.\n\nHe draws attention to previous defamation judgments in Zimbabwe, noting that the US$100,000 award is unprecedented and significantly higher than any earlier awards, including Maheres own cases, where damages did not exceed US$18,000.\n\nHe said, Fraud vitiates everything, highlighting what he describes as misleading representations made by Mahere during the reinstatement process.\n\nEven if I am found to have been in wilful default or go on to lose the main action, this judgment must still be rescinded on the basis that it was erroneously granted as no court in Zimbabwe would award the quantum of damages awarded to the respondent as it is so extraordinary as to constitute a manifest injustice, he said.\n\nThe defamation claim itself revolves around Kudzayis allegations of Maheres extramarital affair, which he argues serves the public interest.\n\nHis legal team insists that Mahere cannot substantiate her claims without proper cross-examination and that the judgments value is disproportionate to the alleged damages.\n\nKudzayis application for rescission also focuses on the implications of allowing the judgment to stand.\n\nHe argues that the case has spiralled into a deliberate and calculated deception, undermining the integrity of the judicial process.\n\nThe matter is yet to be heard.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/28044431/Fadzai-Mahere-1.png",
            "description": "<p>By Mary Taruvinga Journalist Edmund Kudzayi has formally requested the High Court to rescind a default judgment that awarded US$100,000 in damages to top lawyer Fadzayi Mahere in a defamation case. The case stemmed from allegations by the Kukurigo owner that Mahere was dating a married businessman, Tinashe Murapata which had caused the collapse of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/journalist-edmund-kudzayi-seeks-reversal-of-us100000-defamation-award-to-mahere/\">Journalist Edmund Kudzayi seeks reversal of US$100,000 defamation award to Mahere</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:10",
            "date": "25 Jul 2025"
        }
    ]
}