{
    "news": [
        {
            "title": "Mudenda says culprit will ‘regret the day of their existence’ after generator failure causes power outage during Mnangagwa’s SONA",
            "url": "https://www.newzimbabwe.com/mudenda-says-culprit-will-regret-the-day-of-their-existence-after-generator-failure-causes-power-outage-during-mnangagwas-sona/",
            "content": "By Thandiwe Garusa\n\nThe Parliament Building was being powered by a generator with ZESA electricity on standby as per prior arrangements when President Emmerson Mnangagwas State of the Nation Address (SONA) was disrupted by a power outage,NewZimbabwe.comhas learnt.\n\nMnangagwa was concluding his SONA when the power outage occurred, forcing him to use a torchlight to finish his speech.\n\nSpeaker of Parliament Jacob Mudenda was visibly angered by the incident, saying, We shall go beyond what happened, trace the culprit, and deal with them accordingly. Those found wanting will regret the day of their existence.\n\nAccording to Parliament, the generator had been activated at midday, with ZESA engineers on site to monitor proceedings.\n\nHowever, the backup system reportedly developed a technical fault approximately two and a half hours into the address, causing the blackout while Mnangagwa was still delivering his speech.\n\nA letter from Acting Clerk of Parliament Nomasonto Sunga to Local Government Permanent Secretary John Bhasera, dated October 21, had requested a serviced, fully tested and fit generator for the SONA, citing previous blackouts during important sessions.\n\nWATCH : President Emmerson Mnangagwa was on Tuesday forced to complete his State of the Nation Address (SONA) using a torchlightafter the New Parliament Building was plunged into darkness.\n\n\"The person who switched off electricity while the President was speaking will regrethttps://t.co/TqTPubyuMxpic.twitter.com/IIlyQncs8O\n\n NewZimbabwe.com (@NewZimbabweCom)October 28, 2025\n\nThis is the second time a blackout has occurred at the Parliament Building in Mnangagwas presence, following a similar incident in November 2024 during Finance Minister Mthuli Ncubes 2025 National Budget presentation.\n\nWe request your ministrys coordination and oversight in ensuring uninterrupted power supply during the State of the Nation Address (SONA), which has been tentatively scheduled for 28 October 2025 at Parliament Building.\n\nIt is noted that there is an approved arrangement to run the event using the generator as the primary source of power, with ZETDC on standby, following previous power disruptions experienced during important sessions, Sunga wrote.\n\nIn view of this, the generator must be serviced, fully tested, and confirmed fit for uninterrupted operation during the event. ZETDC technical staff should be physically on standby throughout the proceedings to provide an immediate response if required.\n\nParliament also assured that it would promptly pay the company contracted to provide generator services and supply sufficient fuel to ensure smooth power supply throughout the event.\n\nParliament will ensure timely payment to the service provider contracted for the generator service, as well as the provision of adequate fuel to power the system throughout the duration of the event, added Sunga.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/28130416/ED-SONA-torch-1.jpeg",
            "description": "<p>By Thandiwe Garusa The Parliament Building was being powered by a generator with ZESA electricity on standby as per prior arrangements when President Emmerson Mnangagwa’s State of the Nation Address (SONA) was disrupted by a power outage, NewZimbabwe.com has learnt. Mnangagwa was concluding his SONA when the power outage occurred, forcing him to use a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mudenda-says-culprit-will-regret-the-day-of-their-existence-after-generator-failure-causes-power-outage-during-mnangagwas-sona/\">Mudenda says culprit will ‘regret the day of their existence’ after generator failure causes power outage during Mnangagwa’s SONA</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "28 Oct 2025"
        },
        {
            "title": "Dawn arson, police raid scuttle Biti’s address on Mnangagwa’s term extension bid",
            "url": "https://www.newzimbabwe.com/dawn-arson-police-raid-scuttle-bitis-address-on-mnangagwas-term-extension-bid/",
            "content": "By Staff Reporter\n\nA planned address by opposition and civic society leaders at the Southern Africa Political Economy Series (SAPES) Trust was abruptly disrupted on Tuesday after Zimbabwe Republic Police (ZRP) anti-riot officers stormed the venue.\n\nOpposition figures Tendai Biti, Job Sikhala, and Jacob Ngarivhume were scheduled to speak on an alleged plot by ZANU PF to extend President Emmerson Mnangagwas term beyond 2028.\n\nIn the early hours of Tuesday, the SAPES Trust premises were reportedly petrol-bombed and a guard on duty was abducted, in what is believed to be a coordinated attempt to stop the discussion.\n\nSAPES Trust Director Ibbo Mandaza said there appeared to be a clear link between the arson attack and the subsequent police disruption.\n\nIt is not surprising at all. There is a correlation between what happened after midnight,the arson, the abduction of the security guard.\n\nIt was done by people who know the job of fear. They seem to have forgotten that we have endured such harassment for the past two years, said Mandaza.\n\nThe ruling party has endorsed a resolution seeking to extend Mnangagwas presidency to 2030, which would require amending Section 91(2) of the Constitution, which limits a president to two terms, and Section 328(7), which bars incumbents from benefiting from constitutional amendments.\n\nAccording to party insiders, ZANU PF intends to use its parliamentary majority to push through the proposed changes.\n\nSpeaking at the disrupted event, Biti condemned the attacks and reaffirmed the groups commitment to defending the Constitution.\n\nWe are very sorry to Dr. Mandaza over the arson, and to Gilbert Mbwende, whose house was also attacked.\n\nThis is a new initiative by concerned citizens to resist the mutilation of the Constitution. It is not a political effort, but a civic one, to defend the rule of law, Biti said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/28164119/biti-sikhala-sapes.jpg",
            "description": "<p>By Staff Reporter A planned address by opposition and civic society leaders at the Southern Africa Political Economy Series (SAPES) Trust was abruptly disrupted on Tuesday after Zimbabwe Republic Police (ZRP) anti-riot officers stormed the venue. Opposition figures Tendai Biti, Job Sikhala, and Jacob Ngarivhume were scheduled to speak on an alleged plot by ZANU</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dawn-arson-police-raid-scuttle-bitis-address-on-mnangagwas-term-extension-bid/\">Dawn arson, police raid scuttle Biti’s address on Mnangagwa’s term extension bid</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "28 Oct 2025"
        },
        {
            "title": "Kadewere likely to miss AFCON due to knee injury",
            "url": "https://www.newzimbabwe.com/kadewere-likely-to-miss-afcon-due-to-knee-injury/",
            "content": "By Sports Reporter\n\nWarriors striker Tino Kadewere is likely to miss the 2025 Africa Cup of Nations (AFCON) after sustaining a knee injury.\n\nKadeweres injury was confirmed by his Greek club, Aris Thessaloniki, in a statement released on Monday.\n\nAccording to the club, the 29-year-old Zimbabwe international will be sidelined for up to three months as he is set to undergo surgery.\n\nUnfortunately, the news is not good for Tino Kadewere. According to the MRI results, the 29-year-old Zimbabwe international striker, who was injured in training, suffered a torn medial meniscus in his right knee and will undergo immediate surgery, Aris Thessaloniki said.\n\nThe injury setback comes barely a week after Kadewere returned from a one-month layoff due to a separate injury.\n\nHe also missed Zimbabwes World Cup qualifiers against South Africa and Lesotho earlier this year.\n\nKadeweres absence would be a major blow for the Warriors, who are preparing for their return to the continental stage at AFCON 2025.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/28062700/Tino-Kadewere.webp",
            "description": "<p>By Sports Reporter Warriors striker Tino Kadewere is likely to miss the 2025 Africa Cup of Nations (AFCON) after sustaining a knee injury. Kadewere’s injury was confirmed by his Greek club, Aris Thessaloniki, in a statement released on Monday. According to the club, the 29-year-old Zimbabwe international will be sidelined for up to three months</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kadewere-likely-to-miss-afcon-due-to-knee-injury/\">Kadewere likely to miss AFCON due to knee injury</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "28 Oct 2025"
        },
        {
            "title": "SAPES Trust firebombed, guard abducted ahead of National Press Conference challenging Mnangagwa’s term extension",
            "url": "https://www.newzimbabwe.com/sapes-trust-firebombed-guard-abducted-ahead-of-national-press-conference-challenging-mnangagwas-term-extension/",
            "content": "By Staff Reporter\n\nThe Southern Africa Political Economy Series (SAPES) Trusts premises were gutted by fire in a suspected arson attack and a security guard on duty was allegedly abducted by unknown assailants around midnight.\n\nSAPES Trust Director, Ibbo Mandaza, said the attack targeted the seminar room, which is regularly used as a venue for meetings and press conferences.\n\nSAPES Trust is scheduled to host a National Press Conference this morning against ZANU PFs Agenda 2030, which Mandaza says will go ahead despite the setback.\n\nSAPES Trust Director Ibbo Mandaza\n\nThis is to announce that theres been another arson attack (the first was in August 2023 ahead of the elections) at SAPES Trust at midnight, with the PanAfrika Restaurant on fire and the security staff overtaken by a group of armed attackers.\n\nThis is hardly a coincidence: thereis the National Press Conference against the 2030 Agenda scheduled for 11 am at SAPES Trust today 28 October.\n\nIt was an organised attack at 12:40 am today: the main target was the SAPES Trust Seminar Room, the usual venue for meetings, which has been left gutted to the ground by fire; and then they abducted the guard on duty after locking up the gate with two padlocks, Mandaza said on his X account on Tuesday.\n\nThe attack follows a fierce debate on X and public forums regarding the constitutional procedures that must be followed to amend the Constitution to allow Mnangagwa to rule until 2030, beyond his term limit ending in 2028.\n\nTop Harare lawyer, Thabani Mpofu, condemned the attack, describing itas an act of cowardice.\n\nThis is just not right. This cowardly act must be condemned in the strongest terms possible. How can we live in a country that fears words? Mpofu wrote on his X account on Tuesday morning.\n\nWriting on his X account on Tuesday morning, self-exiled former Cabinet Minister, Saviour Kasukuwere, said the bombing of SAPES Trust is a shameful act.\n\nThis is shameful. A leopard cannot change its spots! We have to choose hope over fear.\n\nAlthough Mnangagwa styles himself as a constitutionalist and has declined to plan for running beyond 2028, he has done little to stop those who are canvassing support for him to continue in power until 2030.\n\nThe calls for Mnangagwa to continue beyond 2028 have caused fissures within his ruling party, Zanu PF.\n\nAnalysts have warned that the succession battle in Zanu PF could cause chaos and violence in the country, as they believe that the calls for Mnangagwa to go beyond 2028 are purely a strategy to frustrate his deputy, Rtd Constantino Chiwenga, who is widely expected to take over.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/28062421/sapes.jpeg",
            "description": "<p>By Staff Reporter The Southern Africa Political Economy Series (SAPES) Trust’s premises were gutted by fire in a suspected arson attack and a security guard on duty was allegedly abducted by unknown assailants around midnight. SAPES Trust Director, Ibbo Mandaza, said the attack targeted the seminar room, which is regularly used as a venue for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sapes-trust-firebombed-guard-abducted-ahead-of-national-press-conference-challenging-mnangagwas-term-extension/\">SAPES Trust firebombed, guard abducted ahead of National Press Conference challenging Mnangagwa’s term extension</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "28 Oct 2025"
        }
    ]
}