{
    "news": [
        {
            "title": "Businessman Mimana to pay US$11k maintainance to ex-wife",
            "url": "https://www.newzimbabwe.com/businessman-mimana-to-pay-us11k-maintainance-to-ex-wife/",
            "content": "By Mary Taruvinga\n\nThe High Court has ruled that businessman Murombo Josiah Mimana must continue supporting his estranged wife, Marvel Mtisi, with monthly maintenance after finding that he had the capacity to pay for the familys upkeep, previously pegged at US$20,000 per month.\n\nJustice Maxwell delivered the judgment on October 9, 2025, granting Mtisi maintenance of US$11,726 per month and ordering Mimana to contribute 80% of her legal costs pending the conclusion of their divorce proceedings.\n\nThe couple, married under an unregistered customary union in 2001, has eight children. Mtisi approached the court seeking a declaration that the marriage had ended and for Mimana to resume the US$20,000 monthly payments he allegedly stopped in February 2025, despite having consistently paid that amount since March 2024.\n\nMtisi told the court she was unemployed and had been excluded from the couples lucrative businesses, despite holding a 50% stake. She said the companies were financially sound, citing lucrative Jet A1 fuel supply contracts and profitable mining operations. She argued Mimana was well able to meet the US$21,936 in monthly expenses and contribute to her legal costs.\n\nMimana denied personally paying the US$20,000, claiming it was the company that had made the payments for the upkeep of the family. He accused Mtisi of failing to account for the funds and said payments stopped after she engaged in activities that disrupted the smooth running of the company.\n\nHe further disputed that she was a shareholder and insisted she was not entitled to dividends or business proceeds.\n\nBut in his ruling, Justice Fatima Maxwell found that Mimana had the means to continue supporting his wife, noting that even if the company had made the payments, it acted on his behalf.\n\nIt is common cause that the applicant has been dependent on the US$20,000 per month she was getting. The bottom line is that she has no source of income except the contribution she was receiving, the judge said.\n\nRespondent has not disputed that he is unilaterally running the company and that the US$20,000 was being paid on his behalf. He is therefore in a position to contribute to the applicants legal costs whether personally or through the company.\n\nThe court trimmed some nonrecurring and tutoring costs from Mtisis claim, disallowing US$10,210 in total, leaving US$11,726 as the payable monthly amount.\n\nOn Mimanas technical objection that Mtisis affidavit was improperly commissioned, the court described it as a desperate attempt by the respondent to avoid going into the merits of the matter.\n\nThe application for maintenance pendente lite and contribution towards costs be and is hereby granted,  she ruled.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg",
            "description": "<p>By Mary Taruvinga  The High Court has ruled that businessman Murombo Josiah Mimana must continue supporting his estranged wife, Marvel Mtisi, with monthly maintenance after finding that he had the capacity to pay for the family’s upkeep, previously pegged at US$20,000 per month. Justice Maxwell delivered the judgment on October 9, 2025, granting Mtisi maintenance</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/businessman-mimana-to-pay-us11k-maintainance-to-ex-wife/\">Businessman Mimana to pay US$11k maintainance to ex-wife </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:42",
            "date": "13 Oct 2025"
        },
        {
            "title": "DNC bus horror: 42 Zimbabweans and Malawians dead, Limpopo premier Phophi Ramathuba visits scene",
            "url": "https://www.newzimbabwe.com/dnc-bus-horror-42-zimbabweans-and-malawians-dead-limpopo-premier-phophi-ramathuba-visits-scene/",
            "content": "IOL\n\nThe death toll fromSundays horrific bus crash on the N1 north near Makhado(formerly Louis Trichardt) has risen to 42, Limpopo Premier Dr Phophi Ramathuba confirmed.\n\nMost of the victims were Zimbabwean and Malawian nationals travelling home from Gqeberha (Port Elizabeth) in the Eastern Cape.\n\nThe DNC bus reportedly veered off a mountainous section of the N1 and plunged down an embankment. Emergency services, including paramedics, transport officers, and law enforcement officials, responded swiftly, recovering the deceased and transporting injured passengers to nearby hospitals.\n\nPremier Ramathuba is scheduled to visit the crash site at 11 am on Monday to meet the multi-disciplinary emergency team for updates. She will later address the media and visit hospitals where the injured are receiving care.\n\nThis is a heartbreaking tragedy. Losing so many lives in one incident is painful beyond words. On behalf of the Limpopo Provincial Government, we extend our deepest condolences to the affected families, including those in Zimbabwe and Malawi. We wish a full and speedy recovery to all survivors. Our thoughts and prayers are with them during this difficult time, Ramathuba said.\n\nEarlier, Limpopo Transport MEC Violet Mathye confirmed that the deceased included a 10-month-old baby. She said driver fatigue or a possible mechanical fault could have caused the bus to lose control, though investigations are ongoing.\n\nThe N1 freeway was temporarily closed following the crash. Motorists were advised to use alternative routes: from Makhado to Musina via the Witvlag turnoff, and from Musina to Makhado via the Williespoort turnoff.\n\nThe tragedy follows reports that the bus carried passengers from Zimbabwe and Malawi who were returning home for personal reasons. Rescue operations continued late into Sunday evening, with law enforcement and transport officials coordinating efforts alongside disaster management teams.\n\nThe Limpopo government is also providing psychosocial support to survivors and working with consular services from Zimbabwe and Malawi to assist affected families. Traffic authorities and the South African Police Service continue to investigate the cause of the crash.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/13122907/DNC-Bus.png",
            "description": "<p>IOL The death toll from Sunday’s horrific bus crash on the N1 north near Makhado (formerly Louis Trichardt) has risen to 42, Limpopo Premier Dr Phophi Ramathuba confirmed. Most of the victims were Zimbabwean and Malawian nationals travelling home from Gqeberha (Port Elizabeth) in the Eastern Cape. The DNC bus reportedly veered off a mountainous section</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dnc-bus-horror-42-zimbabweans-and-malawians-dead-limpopo-premier-phophi-ramathuba-visits-scene/\">DNC bus horror: 42 Zimbabweans and Malawians dead, Limpopo premier Phophi Ramathuba visits scene</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:42",
            "date": "13 Oct 2025"
        },
        {
            "title": "Walter Musanhu sues Dynamos legend Murape Murape for defamation",
            "url": "https://www.newzimbabwe.com/walter-musanhu-sues-dynamos-legend-murape-murape-for-defamation/",
            "content": "By Leopold Munhende\n\nFORMER Motor Action defender and Zimbabwe Youth International Walter Ringers Musanhu has sued Dynamos legend Murape Murape for defamation of character.\n\nMurape, a former Dynamos captain and one of the clubs most capped players, accused Musanhu of incest and homosexuality.\n\nAccording to a letter sent to Murape by Musanhus lawyers, James Majatame Attorneys, he uttered the statements on a WhatsApp group named Former Footballers.\n\nMusanhu is demanding that Murape retract his statements on the same platform, publish apologies in publicly owned papers, The Herald and The Sunday Mail, for five consecutive weeks and refrain from making contact with him.\n\nThese allegations are false, malicious, and wholly unsubstantiated, reads the letter.\n\nYour statements are factually incorrect in their entirety and were clearly intended to tarnish our clients reputation.\n\nTo aggravate the matter, you subsequently sent our client direct messages via WhatsApp, again referring to him as mainini.\n\nSuch conduct constitutes cyberbullying and harassment and is a criminal offence under section 164B of the Cyber and Data Protection Act.\n\nMusanhu owns JADEL FA, a Beijing, China-based academy with branches in Zimbabwe. Over the past few years, it has taken junior footballers from the country to China and other parts of the world for tournaments.\n\nMurape works at Real Viedo Academy, a well-funded junior football initiative that is partnered with Spanish La Liga side Real Viedo.\n\nThe two are products of Dynamos once vibrant junior policy.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/01/23121813/Murape-Murape-e1674476400929.png",
            "description": "<p>By Leopold Munhende FORMER Motor Action defender and Zimbabwe Youth International Walter “Ringers” Musanhu has sued Dynamos legend Murape Murape for defamation of character. Murape, a former Dynamos captain and one of the club’s most capped players, accused Musanhu of incest and homosexuality. According to a letter sent to Murape by Musanhu’s lawyers, James Majatame</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/walter-musanhu-sues-dynamos-legend-murape-murape-for-defamation/\">Walter Musanhu sues Dynamos legend Murape Murape for defamation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:42",
            "date": "13 Oct 2025"
        },
        {
            "title": "Zanu PF annual ‘feast’ to gobble US$4 million, party to donate leftover food to hospitals, orphanages",
            "url": "https://www.newzimbabwe.com/zanu-pf-conference-to-gobble-us4-million-party-to-donate-leftover-food-to-hospitals-orphanages/",
            "content": "By Staff Reporter\n\nTHE 22nd Zanu PF Annual National Peoples Conference, which kicks off tomorrow, 14 October, and runs until the 18th, is set to gobble a staggering US$4 million at a time ordinary citizens are wallowing in poverty.\n\nThe yearly feast, characterised by pomp and fanfare, is a display of extravagance at which the partys top leaders flaunt their wealth, dressed in designer suits and driving fuel-guzzling vehicles while sipping on expensive champagne.\n\nZanu PF National Chairperson Oppah Muchinguri-Kashiri told State media that all is set for the indaba in Mutare, which will chew millions to transport and host delegates.\n\nShe confirmed that nearly US$4 million had been mobilised for the successful hosting of the National Peoples Conference, with US$2 million having been provided by the ruling partys elite.\n\nI would like to report that we have raised adequate resources. As we speak, as the Zanu PF leadership and well-wishers, we have raised almost US$4 million, with US$2 million coming from the leadership, Muchinguri-Kashiri was quoted saying.\n\nThey have surpassed all our expectations, so thank you to Zanu PF Manicaland. Last week, I reported that we only had 5 percent (of preparations) to attend to, to make sure that we are 100 percent ready.\n\nI can safely say we are good to go. Everything is 100 percent ready. We are all ready to go. The first is the well-furnished main hall. The offices were also not quite ready, but now they are ready, well-furnished, and we are very happy, said Muchinguri-Kashiri.\n\nShe hinted that the Zimbabwe Electricity Supply Authority (ZESA) had been ordered to ensure uninterrupted power supplies throughout the conference. All roads leading to the venue have been rehabilitated, while enough food has also been made available.\n\nThe party national chairperson added that leftovers after feeding 5,000 delegates will be donated to hospitals, orphanages and other institutions that require assistance, as is tradition.\n\nAll the food; in fact, we can feed 10,000 people from the donations that were made, she said.\n\nThe traditional Zanu PF indaba brings together the nations top leaders and thousands of provincial leaders to discuss and endorse decisions. This time around, expectations are high that a faction behind President Emmerson Mnangagwas term extension will use the event to rubber-stamp the position.\n\nMnangagwa, now aged 83, is Zanu PFs First Secretary giving him the mandate to lead all meetings during the National Peoples Conference at Mutare Polytechnic College this week.\n\nThis weeks Zanu PF itinerary at the annual showcase begins with a Politburo meeting tomorrow, Tuesday, followed by a Central Committee sitting on Wednesday, with both being held in Harare.\n\nOther highlights during the conference will include commissioning of the Mega Market Milling Plant by Mnangagwa as well as opening of the Ministry of Health and Child Care-constructed National Pharmaceutical Warehouse situated at Victoria Chitepo Provincial Hospital.\n\nThe octogenarian leader will also launch the national tree-planting initiative by leading the exercise at the site where the new Zanu PF Provincial offices will be built, adjacent to the conference venue.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/19063012/mnangagwa-zanu-e1760326655896.jpeg",
            "description": "<p>By Staff Reporter  THE 22nd Zanu PF Annual National People’s Conference, which kicks off tomorrow, 14 October, and runs until the 18th, is set to gobble a staggering US$4 million at a time ordinary citizens are wallowing in poverty. The yearly feast, characterised by pomp and fanfare, is a display of extravagance at which the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-conference-to-gobble-us4-million-party-to-donate-leftover-food-to-hospitals-orphanages/\">Zanu PF annual ‘feast’ to gobble US$4 million, party to donate leftover food to hospitals, orphanages </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:42",
            "date": "13 Oct 2025"
        },
        {
            "title": "Woman poisons girl (4) to death in revenge after goats destroy crops",
            "url": "https://www.newzimbabwe.com/woman-poisons-girl-4-to-death-in-revenge-after-goats-destroy-crops/",
            "content": "By Thandiwe Garusa\n\nA MINOR girl from Mandinyenya village in Bikita, Masvingo province, reportedly died after allegedly eating poisoned rice in what police say was an act of revenge linked to a neighbourhood dispute.\n\nThe Zimbabwe Republic Police (ZRP) confirmed that Sabina Maziva (4) died a week ago after she was allegedly fed the poisoned food by a neighbour, Violet Gamera (60), who accused the childs parents of letting their goats stray and destroy her crops.Gamera, along with Chamunorwa Kwanga (60) and Regina Tavengerarwei (30), have since been arrested as police continue investigating the suspected murder.Initial investigations reveal that on 1st October 2025, Violet Gamera allegedly gave the victim poisoned rice as an act of revenge against the childs parents, whose goats had previously destroyed her crops.The child later began vomiting and was referred to a local clinic, where she received medical attention. Unfortunately, her condition continued to deteriorate, leading to her death on 5th October 2025, ZRP national spokesperson, Commissioner Paul Nyathi said in a statement.It was during the childs burial when rumour started circulating that the deceased may have been poisoned leading villagers to alert Chief Ziki, who then instructed the victims mother to report the case to the police.Following investigations Gamera implicated Kwanga as the person who advised her to poison the child as well as Tavengerarwei as the supplier of the poison.Police have since recovered rat poison and a liquid substance suspected to be a cotton pesticide, believed to have been used in the commission of the offence.Meanwhile, the body of the victim has been exhumed and taken to Silveira Mission Hospital mortuary for a post-mortem examination.Nyathi urged members of the public to resolve disputes through lawful and peaceful means.\n\nThe Zimbabwe Republic Police (ZRP) confirmed that Sabina Maziva (4) died a week ago after she was allegedly fed the poisoned food by a neighbour, Violet Gamera (60), who accused the childs parents of letting their goats stray and destroy her crops.\n\nGamera, along with Chamunorwa Kwanga (60) and Regina Tavengerarwei (30), have since been arrested as police continue investigating the suspected murder.Initial investigations reveal that on 1st October 2025, Violet Gamera allegedly gave the victim poisoned rice as an act of revenge against the childs parents, whose goats had previously destroyed her crops.The child later began vomiting and was referred to a local clinic, where she received medical attention. Unfortunately, her condition continued to deteriorate, leading to her death on 5th October 2025, ZRP national spokesperson, Commissioner Paul Nyathi said in a statement.It was during the childs burial when rumour started circulating that the deceased may have been poisoned leading villagers to alert Chief Ziki, who then instructed the victims mother to report the case to the police.Following investigations Gamera implicated Kwanga as the person who advised her to poison the child as well as Tavengerarwei as the supplier of the poison.Police have since recovered rat poison and a liquid substance suspected to be a cotton pesticide, believed to have been used in the commission of the offence.Meanwhile, the body of the victim has been exhumed and taken to Silveira Mission Hospital mortuary for a post-mortem examination.Nyathi urged members of the public to resolve disputes through lawful and peaceful means.\n\nGamera, along with Chamunorwa Kwanga (60) and Regina Tavengerarwei (30), have since been arrested as police continue investigating the suspected murder.\n\nInitial investigations reveal that on 1st October 2025, Violet Gamera allegedly gave the victim poisoned rice as an act of revenge against the childs parents, whose goats had previously destroyed her crops.The child later began vomiting and was referred to a local clinic, where she received medical attention. Unfortunately, her condition continued to deteriorate, leading to her death on 5th October 2025, ZRP national spokesperson, Commissioner Paul Nyathi said in a statement.It was during the childs burial when rumour started circulating that the deceased may have been poisoned leading villagers to alert Chief Ziki, who then instructed the victims mother to report the case to the police.Following investigations Gamera implicated Kwanga as the person who advised her to poison the child as well as Tavengerarwei as the supplier of the poison.Police have since recovered rat poison and a liquid substance suspected to be a cotton pesticide, believed to have been used in the commission of the offence.Meanwhile, the body of the victim has been exhumed and taken to Silveira Mission Hospital mortuary for a post-mortem examination.Nyathi urged members of the public to resolve disputes through lawful and peaceful means.\n\nInitial investigations reveal that on 1st October 2025, Violet Gamera allegedly gave the victim poisoned rice as an act of revenge against the childs parents, whose goats had previously destroyed her crops.\n\nThe child later began vomiting and was referred to a local clinic, where she received medical attention. Unfortunately, her condition continued to deteriorate, leading to her death on 5th October 2025, ZRP national spokesperson, Commissioner Paul Nyathi said in a statement.It was during the childs burial when rumour started circulating that the deceased may have been poisoned leading villagers to alert Chief Ziki, who then instructed the victims mother to report the case to the police.Following investigations Gamera implicated Kwanga as the person who advised her to poison the child as well as Tavengerarwei as the supplier of the poison.Police have since recovered rat poison and a liquid substance suspected to be a cotton pesticide, believed to have been used in the commission of the offence.Meanwhile, the body of the victim has been exhumed and taken to Silveira Mission Hospital mortuary for a post-mortem examination.Nyathi urged members of the public to resolve disputes through lawful and peaceful means.\n\nThe child later began vomiting and was referred to a local clinic, where she received medical attention. Unfortunately, her condition continued to deteriorate, leading to her death on 5th October 2025, ZRP national spokesperson, Commissioner Paul Nyathi said in a statement.\n\nIt was during the childs burial when rumour started circulating that the deceased may have been poisoned leading villagers to alert Chief Ziki, who then instructed the victims mother to report the case to the police.Following investigations Gamera implicated Kwanga as the person who advised her to poison the child as well as Tavengerarwei as the supplier of the poison.Police have since recovered rat poison and a liquid substance suspected to be a cotton pesticide, believed to have been used in the commission of the offence.Meanwhile, the body of the victim has been exhumed and taken to Silveira Mission Hospital mortuary for a post-mortem examination.Nyathi urged members of the public to resolve disputes through lawful and peaceful means.\n\nIt was during the childs burial when rumour started circulating that the deceased may have been poisoned leading villagers to alert Chief Ziki, who then instructed the victims mother to report the case to the police.\n\nFollowing investigations Gamera implicated Kwanga as the person who advised her to poison the child as well as Tavengerarwei as the supplier of the poison.Police have since recovered rat poison and a liquid substance suspected to be a cotton pesticide, believed to have been used in the commission of the offence.Meanwhile, the body of the victim has been exhumed and taken to Silveira Mission Hospital mortuary for a post-mortem examination.Nyathi urged members of the public to resolve disputes through lawful and peaceful means.\n\nFollowing investigations Gamera implicated Kwanga as the person who advised her to poison the child as well as Tavengerarwei as the supplier of the poison.\n\nPolice have since recovered rat poison and a liquid substance suspected to be a cotton pesticide, believed to have been used in the commission of the offence.Meanwhile, the body of the victim has been exhumed and taken to Silveira Mission Hospital mortuary for a post-mortem examination.Nyathi urged members of the public to resolve disputes through lawful and peaceful means.\n\nPolice have since recovered rat poison and a liquid substance suspected to be a cotton pesticide, believed to have been used in the commission of the offence.\n\nMeanwhile, the body of the victim has been exhumed and taken to Silveira Mission Hospital mortuary for a post-mortem examination.Nyathi urged members of the public to resolve disputes through lawful and peaceful means.\n\nMeanwhile, the body of the victim has been exhumed and taken to Silveira Mission Hospital mortuary for a post-mortem examination.\n\nNyathi urged members of the public to resolve disputes through lawful and peaceful means.\n\nNyathi urged members of the public to resolve disputes through lawful and peaceful means.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/06/09010217/poison-death.jpg",
            "description": "<p>By Thandiwe Garusa A MINOR girl from Mandinyenya village in Bikita, Masvingo province, reportedly died after allegedly eating poisoned rice in what police say was an act of revenge linked to a neighbourhood dispute. The Zimbabwe Republic Police (ZRP) confirmed that Sabina Maziva (4) died a week ago after she was allegedly fed the poisoned</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/woman-poisons-girl-4-to-death-in-revenge-after-goats-destroy-crops/\">Woman poisons girl (4) to death in revenge after goats destroy crops</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:42",
            "date": "13 Oct 2025"
        }
    ]
}