{
    "news": [
        {
            "title": "Trump caps refugee admissions at record low – with most to be white South Africans",
            "url": "https://www.newzimbabwe.com/trump-caps-refugee-admissions-at-record-low-with-most-to-be-white-south-africans/",
            "content": "BBC\n\nThe Trump administration will limit the number of refugees admitted to the US to 7,500 over the next year, and give priority to white South Africans.\n\nThe move, announced in a notice published on Thursday, marks a dramatic cut from the previous limit of 125,000 set by former President Joe Biden and will bring the cap to a record low.\n\nNo reason was given for the cut, but the notice said it was justified by humanitarian concerns or is otherwise in the national interest.\n\nIn January, Trump signed an executive order suspending the US Refugee Admissions Programme, or USRAP, which he said would allow US authorities to prioritise national security and public safety.\n\nThe previous lowest refugee admissions cap was set by the first Trump administration in 2020, when it allocated 15,000 spots for fiscal year 2021.\n\nThe notice posted to the website of the Federal Register said the 7,500 admissions would primarily be allocated to Afrikaner South Africans and other victims of illegal or unjust discrimination in their respective homelands.\n\nIn February, the US president announced the suspension of critical aid to South Africa and offered to allow members of the Afrikaner community  who are mostly white descendants of early Dutch and French settlers  to settle in the US as refugees.\n\nSouth Africas ambassador to Washington, Ebrahim Rasool, was later expelled after accusing Trump of mobilising a supremacism and trying to project white victimhood as a dog whistle.\n\nIn the Oval Office in May, Trump confronted South Africas President Cyril Ramaphosa and claimed white farmers in his nation were being killed and persecuted.\n\nThe White House also played a video which they said showed burial sites for murdered white farmers. It later emerged that the videos were scenes from a 2020 protest in which the crosses represented farmers killed over multiple years.\n\nThe tense meeting came just days after the US granted asylum to 60 Afrikaners.\n\nThe South African government has vehemently denied that Afrikaners and other White South Africans are being persecuted.\n\nOn his first day in office on 20 January, Trump said the US would suspend USRAP to reflect the USs lack of ability to absorb large numbers of migrants, and in particular, refugees, into its communities in a manner that does not compromise the availability of resources for Americans and protects their safety and security.\n\nThe US policy of accepting white South Africans has already prompted accusations of unfair treatment from refugee advocacy groups.\n\nSome have argued the US is now effectively shut to other persecuted groups or people facing potential harm in their home country, and even former allies that helped US forces in Afghanistan or the Middle East.\n\nThis decision doesnt just lower the refugee admissions ceiling, Global Refuge CEO and president Krish OMara Vignarajah said on Thursday. It lowers our moral standing.\n\nAt a time of crisis in countries ranging from Afghanistan to Venezuela to Sudan and beyond, concentrating the vast majority of admissions on one group undermines the programmes purpose as well as its credibility, she added.\n\nRefugees International also slammed the move, saying it makes a mockery of refugee protection and of American values.\n\nLet us be frank: whatever hardships some Afrikaners may face, this population has no plausible claim on refugee status  they are not fleeing systematic persecution, Refugees International said in its statement.\n\nThe South African government has yet to respond to the latest announcement.\n\nDuring the Oval Office meeting, President Ramaphosa said only that he hoped that Trump officials would listen to South Africans about the issue, and later said he believed there is doubt and disbelief about all this in [Trumps] head.\n\nEarlier this year, Ramaphosa signed a controversial law allowing the government to seize privately-owned land without compensation in some circumstances.\n\nWhile the country does not release race-based crime figured, figures published earlier this year showed that 7,000 people were murdered in South African between October and December 2024.\n\nOf these, 12 were killed in farm attacks and only one of the 12 was a farmer. Five others were farm dwellers and four were employees, who are likely to have been black.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/21194112/skynews-donald-trump-cyril-ramaphosa_6923546.jpg",
            "description": "<p>BBC The Trump administration will limit the number of refugees admitted to the US to 7,500 over the next year, and give priority to white South Africans. The move, announced in a notice published on Thursday, marks a dramatic cut from the previous limit of 125,000 set by former President Joe Biden and will bring</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/trump-caps-refugee-admissions-at-record-low-with-most-to-be-white-south-africans/\">Trump caps refugee admissions at record low – with most to be white South Africans</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "31 Oct 2025"
        },
        {
            "title": "Tough economy forces NTS to delist from ZSE",
            "url": "https://www.newzimbabwe.com/tough-economy-forces-nts-to-delist-from-zse/",
            "content": "By Alois Vinga\n\nNATIONAL Tyre Services (NTS) has tabled plans to delist from the Zimbabwe Stock Exchange (ZSE) due to insignificant returns prompted by a tough economic environment and the influx of cheaper imports.\n\nIn a Circular to shareholders published this week, NTS said after a comprehensive review of the companys listing requirements, it was agreed that the benefits of maintaining the listing status no longer pay off as was the case in the previous years.\n\nThe company, which has been on the ZSE listing since 1969, is now seeking shareholder approval to green-light the move.\n\nThe operating environment has, however, been characterised by persistent macroeconomic instability over the past decades. The business has been adversely affected by severe exchange rate volatility, liquidity constraints and shortages of foreign currency, all of which have materially hindered the importation of tyres and raw materials, the company said.\n\nThe Zimbabwean tyre industry has, in recent years, experienced heightened competition due to low entry barriers and the influx of imported brands, resulting in a loss of market share for the company said limited access to long-term and affordable capital has also constrained the companys ability to execute its expansion strategy and maintain adequate working capital levels.\n\nDespite numerous efforts to secure funding through the local banking system, borrowing has remained prohibitively expensive. Operationally, NTS continues to face significant challenges, such as power supply deficits have disrupted production at the retreading factory, where capacity utilisation has averaged approximately 30%.\n\nIn conjunction with the proposed delisting, major shareholder Radun Investments (Private) Limited is extending a mandatory offer to acquire all shares held by minority shareholders. The offer is for a cash consideration of US$0.0248 per share. This provides a clear and structured opportunity for minority shareholders to exit their investment at a price deemed fair and reasonable by Independent Financial Advisors, said NTS.\n\nThe total indicative share trading liquidity for National Tyre Services Limited (NTS.zw) in the past 12 months, as of 1st October 2025, is US$1.06million (ZWG28.41million). An average of US$88,170 (ZWG2.37 million) per month.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/03/06063255/National-Tyre-service.png",
            "description": "<p>By Alois Vinga NATIONAL Tyre Services (NTS) has tabled plans to delist from the Zimbabwe Stock Exchange (ZSE) due to insignificant returns prompted by a tough economic environment and the influx of cheaper imports. In a Circular to shareholders published this week, NTS said after a comprehensive review of the company’s listing requirements, it was</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tough-economy-forces-nts-to-delist-from-zse/\">Tough economy forces NTS to delist from ZSE</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "31 Oct 2025"
        },
        {
            "title": "Underfire Tanzanian authorities deport human rights activist Vava",
            "url": "https://www.newzimbabwe.com/underfire-tanzanian-authorities-deport-human-rights-activist-vava/",
            "content": "By Staff Reporter\n\nPANICKY Tanzanian authorities have reportedly denied entry to Zimbabwean human rights activist Blessing Vava before deporting him, amid rising tensions following the countrys tumultuous presidential election.\n\nVava, the Director of the Crisis in Zimbabwe Coalition (CiZC), was barred from entering Tanzania and deported on Tuesday. He had travelled to meet with civil society organisations (CSOs) to discuss rights violations and to offer solidarity.\n\nCiZC described Vavas deportation as a barbaric act of repression.\n\nIn a statement, CiZC condemned the treatment of its director, describing it as an attack to human rights.\n\nWe are disturbed by the continued harassment and deportations of human rights defenders and election observers whose work is not criminal but aimed at promoting human rights, good governance and democracy, the statement read.\n\nCiZC criticised President Samia Suluhu Hassan and her regime for trampling on the values of ubuntu and pan-Africanism that the countrys founding president, Julius Nyerere, stood for.\n\nVava reportedly arrived at Julius Nyerere International Airport in Dar es Salaam on 28 October as part of a regional solidarity mission to engage with CSOs and social movements. The mission aimed to discuss concerns over the escalating crackdown on dissent under what the coalition called the increasingly authoritarian regime which has also shut down the internet.\n\nUpon arrival, Vavas passport was reportedly confiscated by immigration officials, who subjected him to hours of interrogation and profiling in restricted airport rooms. He was later informed that he was not welcome in Tanzania and labelled a security risk-without any formal explanation.\n\nThe coalition said Vava spent the night detained in a holding cell at the airport without blankets before being deported on 29 October.\n\nTanzanian officials have remained mum on the incident.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/31035543/blessing-vava.gif",
            "description": "<p>By Staff Reporter PANICKY Tanzanian authorities have reportedly denied entry to Zimbabwean human rights activist Blessing Vava before deporting him, amid rising tensions following the country’s tumultuous presidential election. Vava, the Director of the Crisis in Zimbabwe Coalition (CiZC), was barred from entering Tanzania and deported on Tuesday. He had travelled to meet with civil</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/underfire-tanzanian-authorities-deport-human-rights-activist-vava/\">Underfire Tanzanian authorities deport human rights activist Vava</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "31 Oct 2025"
        },
        {
            "title": "Six killed, 40 injured in bus crash",
            "url": "https://www.newzimbabwe.com/six-killed-40-injured-in-bus-crash/",
            "content": "By James Muonwa\n\nA FATAL road traffic accident along the Harare-Mukumbura road in Mashonaland Central province has left six people dead, while 40 were injured.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the accident, which occurred on Thursday morning.\n\nThe ZRP confirms a fatal road traffic accident which occurred at the 131-kilometre peg along HarareMukumbura Road on October 30, 2025 at around 0430 hours.\n\nA Yutong bus with 55 passengers on board, travelling towards Bindur,a allegedly had a tyre burst, resulting in the driver losing control of the bus. The bus overturned once and landed on its side. As a result, six people died on the spot, while 40 others were injured, said Nyathi.\n\nThe bodies of the victims were taken to Bindura Provincial Hospital for post-mortem examination, while the injured were referred to Karanda, Madziwa, Mt Darwin and Bindura Hospitals for treatment.\n\nPolice said the names of the victims will be released once identification has been made by their next of kin.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/31184346/Accident4.jpg",
            "description": "<p>By James Muonwa A FATAL road traffic accident along the Harare-Mukumbura road in Mashonaland Central province has left six people dead, while 40 were injured. Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the accident, which occurred on Thursday morning. “The ZRP confirms a fatal road traffic accident which occurred at the 131-kilometre</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/six-killed-40-injured-in-bus-crash/\">Six killed, 40 injured in bus crash</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "31 Oct 2025"
        },
        {
            "title": "Two more suspects arrested over murder of Ruwa businessman Mutangadura",
            "url": "https://www.newzimbabwe.com/two-more-suspects-arrested-over-murder-of-ruwa-businessman-mutangadura/",
            "content": "By Staff Reporter\n\nThe net has closed in on two more suspects linked to the brutal murder of Ruwa businessman Joseph Mutangadura in August this year.\n\nPolice have confirmed the arrest of Tariro Mutsamanye (34) and Dexter Mugaro (31) in connection with the killing, which shocked the nation.\n\nZimbabwe Republic Police (ZRP) national spokesperson Commissioner Paul Nyathi confirmed the development.\n\nThe ZRP confirms the arrest of Tariro Mutsamanye (34) and Dexter Mugaro (31) in connection with the murder of businessman Joseph Mutangadura (67) in Ruwa on August 17, 2025, said Nyathi.\n\nThe arrests come shortly after the dramatic capture of another suspect, Vengesai Jabulani Mutasa (41), who was apprehended after fatally shooting a police officer in Sanyati, Mashonaland West Province, over the weekend.\n\nThis brings the total number of suspects arrested in connection with Mutangaduras murder to six. Police said further details will be released in due course.\n\nIn recent weeks, law enforcement officers also apprehended Given Mandizadza (34), Phillip Mutasa (38), and Anesu Machadu (32), who have since appeared in court facing murder charges.\n\nMutangadura was killed on the night of August 17, when a gang of seven armed men stormed his farmhouse in Ruwa, just outside Harare, and shot him dead.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/18132443/Joseph-Mutangazi-Mutangadura-1280px-t-feat-750x375-1.webp",
            "description": "<p>By Staff Reporter The net has closed in on two more suspects linked to the brutal murder of Ruwa businessman Joseph Mutangadura in August this year. Police have confirmed the arrest of Tariro Mutsamanye (34) and Dexter Mugaro (31) in connection with the killing, which shocked the nation. Zimbabwe Republic Police (ZRP) national spokesperson Commissioner</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/two-more-suspects-arrested-over-murder-of-ruwa-businessman-mutangadura/\">Two more suspects arrested over murder of Ruwa businessman Mutangadura</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "31 Oct 2025"
        },
        {
            "title": "Mliswa takes aim at Chiwenga’s wife – accuses her of sabotaging Mnangagwa, says she should quit army position",
            "url": "https://www.newzimbabwe.com/mliswa-takes-aim-at-chiwengas-wife-accuses-her-of-sabotaging-mnangagwa-says-she-should-quit-army-position/",
            "content": "By Darlington Gatsi\n\nDEPUTY President Constantino Chiwengas wife, Minoyothabo Baloyi, has been drawn into the ZANU PF succession fight, with Temba Mliswa accusing her of using her military position to sabotage President Emmerson Mnangagwa.\n\nMliswa, who has made Chiwenga the centre of his attacks, has now taken aim at Miniyothabo, whom he accuses of misusing her position in the army to further her husbands ambitions.\n\nThe problem that we have which I must say to the nation, is that we also have the wife of the Vice President, who is part of the intelligence of the army which is MID. That being the case, she certainly has the interests of her husband. We know the interests. We know how eager he is to become the president of the country; in so doing, she will serve the interests of her husband and not the country, said Mliswa.\n\nMliswas tirade against her follows an embarrassing power outage at the new Parliament Building, which forced President Emmerson Mnangagwa to complete his State of the Nation Address (SONA) using torchlight.\n\nMliswa says the hiccup was not a coincidence but sabotage against Mnangagwa.\n\nThe former Norton legislator accuses Miniyothabo of establishing a parallel structure within the military ranks.\n\nShe is running a parallel structure and it is important that the President knows. My expos of my passport and my boarding card, which was done on social media by Ali Naka, came through her. She has been doing that. What is also important is that the commander of MID certainly does not tolerate her. In not tolerating her, she is able to run a parallel structure. You can not have a parallel structure from a security perspective, he said.\n\nDespite being a colonel in the army, Miniyothabo has become a darling of the public and has never publicly declared any political ambitions.\n\nThe attack by Mliswa also comes as factionalism is deepening in ZANU PF over the succession of Mnangagwa, whose term of office expires in 2028. His loyalists are campaigning for an extended term of office by two years, until 2030.\n\nAdded Mliswa,I had already suggested and proposed that she can not be in office, being the wife of the Vice President, because she is already compromised. When people see her, they see the Vice President. How do you expect them not to take instructions from her? If you do not take instructions from her, you are fired. Why is it taking so long to retire her?\n\nThis is very important and for as long as this is not attended to, these issues will continue. There is a parallel structure which is being run from a security perspective.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/08/14051524/zdf-chiwengas.jpeg",
            "description": "<p>By Darlington Gatsi DEPUTY President Constantino Chiwenga’s wife, Minoyothabo Baloyi, has been drawn into the ZANU PF succession fight, with Temba Mliswa accusing her of using her military position to sabotage President Emmerson Mnangagwa. Mliswa, who has made Chiwenga the centre of his attacks, has now taken aim at Miniyothabo, whom he accuses of misusing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mliswa-takes-aim-at-chiwengas-wife-accuses-her-of-sabotaging-mnangagwa-says-she-should-quit-army-position/\">Mliswa takes aim at Chiwenga’s wife – accuses her of sabotaging Mnangagwa, says she should quit army position</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "31 Oct 2025"
        },
        {
            "title": "ZIFA to announce new Warriors Coach as over 300 apply for post",
            "url": "https://www.newzimbabwe.com/zifa-to-announce-new-warriors-coach-as-over-300-apply-for-post/",
            "content": "By Sports Reporter\n\nThe Zimbabwe Football Association (ZIFA) is set to announce the new Warriors head coach on Monday following an overwhelming response to the vacancy, which attracted more than 300 applications from both local and international coaches.\n\nZIFA president Nqobile Magwizi revealed the announcement date during an interview with SuperSports Soccer Africa on Thursday night, saying the process was now at an advanced stage.\n\nThe process of appointing the Warriors coach is at an advanced stage. We will announce by Monday at the latest; it should be Tuesday, said Magwizi.\n\nThe post became vacant after Michael Nees was dismissed due to a string of poor results, leaving the national team without a coach just two weeks before the November FIFA international break.\n\nSources say the online application portal, which closed Thursday, drew a stampede of interest, with over 300 curriculum vitae submitted. Among the notable applicants is former Tottenham Hotspur, Newcastle United, and Ghana national team manager Chris Hughton, who is said to be among the frontrunners.\n\nZIFA has set a minimum requirement of a CAF or UEFA Pro License, effectively ruling out local coaches, none of whom currently hold such qualifications.\n\nThe new coach will immediately begin preparations for the Warriors upcoming friendly matches against Algeria on November 13 in Saudi Arabia, and Qatar four days later as part of the build-up to the Africa Cup of Nations (AFCON) scheduled for December 2025.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/10051510/NQOBILE-Magwizi.jpg",
            "description": "<p>By Sports Reporter The Zimbabwe Football Association (ZIFA) is set to announce the new Warriors head coach on Monday following an overwhelming response to the vacancy, which attracted more than 300 applications from both local and international coaches. ZIFA president Nqobile Magwizi revealed the announcement date during an interview with SuperSport’s Soccer Africa on Thursday</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zifa-to-announce-new-warriors-coach-as-over-300-apply-for-post/\">ZIFA to announce new Warriors Coach as over 300 apply for post</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "31 Oct 2025"
        },
        {
            "title": "Zimbabwe calls for sustainable domestic financing to curb tuberculosis",
            "url": "https://www.newzimbabwe.com/zimbabwe-calls-for-sustainable-domestic-financing-to-curb-tuberculosis/",
            "content": "Xinhua\n\nZimbabwean authorities on Wednesday called for sustainable domestic financing to fight against tuberculosis (TB) as external funding declined.\n\nOwen Mugurungi, director of AIDS and TB programs in the Ministry of Health and Child Care, said at a conference in the Zimbabwean capital of Harare that the reduction in global donor funding posed a direct threat to the countrys TB response, and the country needs to explore sustainable domestic financing to respond to the infectious disease.\n\nWe can not build a resilient TB response on unpredictable and external funding alone, Mugurungi said, adding that the situation underscores the urgent need for sustainable financing and domestic investment.\n\nHe noted that Zimbabwe faces a high burden of TB/HIV co-infection and a persistent challenge of drug-resistant TB.\n\nAccording to him, the ministry estimated that approximately 15,000 TB cases were missed last year, and the gap represents the single greatest challenge in the fight against the disease.\n\nOur national TB response is at a crossroads. We have the strategy, we have the evidence, and we have the dedicated workforce. What we need now is the collective will to convert our commitments into concrete action. We must find the missing cases, secure the necessary resources and embrace the innovations that will allow us to end TB in Zimbabwe, Mugurungi said.\n\nSpeaking at the same event, Zimbabwean Health and Child Care Minister Douglas Mombeshora commended Zimbabwe for progress in the fight against the infectious disease.\n\nOur TB response has made real progress. But as we celebrate progress, we must also be honest about the road ahead. TB remains a serious public health challenge and the shifting landscape of global health financing is creating uncertainty for critical programs, he added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/30064847/Tuberculosis.jpg",
            "description": "<p>Xinhua Zimbabwean authorities on Wednesday called for sustainable domestic financing to fight against tuberculosis (TB) as external funding declined. Owen Mugurungi, director of AIDS and TB programs in the Ministry of Health and Child Care, said at a conference in the Zimbabwean capital of Harare that the reduction in global donor funding posed a direct</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-calls-for-sustainable-domestic-financing-to-curb-tuberculosis/\">Zimbabwe calls for sustainable domestic financing to curb tuberculosis</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "31 Oct 2025"
        }
    ]
}