{
    "news": [
        {
            "title": "Withdrawal of donor funding a threat to Zimbabwe’s HIV financing; Health Ministry now seeks supplementary budget",
            "url": "https://www.newzimbabwe.com/withdrawal-of-donor-funding-a-threat-to-zimbabwes-hiv-financing-health-ministry-now-seeks-supplementary-budget/",
            "content": "By Anna Chibamu\n\nPermanant Secretary in the Ministry of Health and Child Care Dr Aspect Maunganidze says the United States withdrawal of funding for Zimbabwes healthcare sector, coupled with general donor fatigue, has disrupted the countrys HIV financing and programming.\n\nThe Trump administration withdrew funding by at least 85% worldwide earlier this year, severely affecting several poor countries, including Zimbabwe.\n\nGiving oral evidence to the Joint Portfolio Committee on Health and Child Care and the Thematic Committee on HIV and AIDS on HIV financing this Tuesday, Maunganidze said the reduced financing due to donor withdrawal had forced the ministry to re-strategise its funding mechanisms.\n\nHe told the committees that the ministry had written to Treasury seeking a supplementary budget to close the funding gap created by the US withdrawal and donor fatigue, in order to strengthen the national HIV response.\n\nThe main challenges in HIV and AIDS funding have always included some funding gaps, regardless of donor support or otherwise. Even ensuring that our strategic plan is truly a national HIV strategic plan that is sustainable, particularly in HIV prevention and related initiatives, has been difficult.\n\nHowever, the major threat right now is the withdrawal of donor funding.\n\nWhat we have observed globally is a general fatigue in donor funding. Whether it comes through the UN, the Global Fund, or other partners, this fatigue is concerning. There are now many competing global health and humanitarian challenges that have emerged in recent years, not just HIV and AIDS.\n\nThis has unfortunately been compounded by the abrupt withdrawal of funding from one of our key donorsthe US government, Maunganidze said.\n\nHe explained that the US had been supporting HIV funding through PEPFAR (Presidents Emergency Plan for AIDS Relief) and by contributing significantly to the Global Fund.\n\nThe US government contributes 30% of the Global Fund, which supports HIV, TB, and malaria interventions.\n\nThrough PEPFAR and US implementing agencies like the CDC and the Presidents Malaria Initiative, this sudden funding withdrawal has had significant consequences for our healthcare services, he said.\n\nMaunganidze also outlined Zimbabwes domestic and international HIV financing models.\n\nDomestically, we rely on the national budget allocation and the Health Levy (a 5% tax on mobile data and airtime), which supports various programs, including HIV.\n\nWeve also introduced specific taxes through the main budgetlike the recently implemented Health Sugar Levyto help strengthen our HIV response, he said.\n\nOn the international front, Maunganidzecited continued support from the Global Fund, the Health Development Fund, and donors such as the Bill and Melinda Gates Foundation.\n\nHe added that the ministry also works with the United Nations and follows UNAIDS Fast-Track commitments for 2020 and 2026, which aim to strengthen HIV responses in the country.\n\nIn general, partners contribute between 50% and 65% of funding for our HIV response.\n\nWhen looking at the overall health budget, development partners have contributed between 35% and 45%, and in some years, even beyond 50%, he noted.\n\nFollowing the US funding withdrawal announced on January 20, 2025, the government responded by announcing on May 15, 2025, intensified efforts to mobilise more domestic resources and laid out a roadmap to strategically boost local HIV drug production.\n\nI must say we are okay on HIV funding until at least January 20, 2026. The same applies to TB and malaria medicines.\n\nHowever, we must continue ensuring that our local revenue streams support a sustained HIV response so that we maintain our gains, particularly on the 95-95-95 UN targets, which we have already achieved.\n\nSince January, over 5,000 HIV-related deaths have been recorded, raising serious concerns about the governments need to increase investment in HIV financing and programming.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/16170027/Dr-Aspect-Maunganidze.jpeg",
            "description": "<p>By Anna Chibamu Permanant Secretary in the Ministry of Health and Child Care Dr Aspect Maunganidze says the United States’ withdrawal of funding for Zimbabwe’s healthcare sector, coupled with general donor fatigue, has disrupted the country’s HIV financing and programming. The Trump administration withdrew funding by at least 85% worldwide earlier this year, severely affecting</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/withdrawal-of-donor-funding-a-threat-to-zimbabwes-hiv-financing-health-ministry-now-seeks-supplementary-budget/\">Withdrawal of donor funding a threat to Zimbabwe’s HIV financing; Health Ministry now seeks supplementary budget</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:46",
            "date": "17 Jul 2025"
        },
        {
            "title": "Government to set caps on private healthcare fees, mandates emergency treatment access",
            "url": "https://www.newzimbabwe.com/government-to-set-caps-on-private-healthcare-fees-mandates-emergency-treatment-access/",
            "content": "By Staff Reporter\n\nGOVERNMENT has announced that fees at private health institutions will be subject to prescribed maximum limits and percentage increases, unless specifically approved by the Minister responsible for health.\n\nPresenting the Bill during its second reading in the National Assembly on Tuesday, Minister of Justice, Legal and Parliamentary Affairs Ziyambi Ziyambi said the legislation seeks to align the Medical Services Act with the fundamental principles enshrined in the Constitution.\n\nThis Bill, Mr Speaker Sir, is a testament of our commitment to ensuring that every citizen and permanent resident of our nation has access to essential health services.\n\nThe memorandum accompanying this Bill clearly outlines its primary objective, that is to uphold constitutional rights related to health and these rights are clearly stipulated in the Constitution, said Ziyambi.\n\nA key provision of the Bill, Clause 9, proposes amendments concerning fees and charges at private health institutions.\n\nZiyambi revealed that under the new amendments, no private hospital authority may impose fees exceeding prescribed amounts or increase fees beyond prescribed percentages without the Ministers approval.\n\nSubsection 1 stated that no responsible authority at a private hospital should impose fees above a prescribed amount or increase them by more than a prescribed percentage except with the approval of the Minister, he said.\n\nIt also included a proviso that paragraph A, imposing fees above a prescribed amount, would not apply to fees already being charged immediately before a fixed date.\n\nThe amendment in this Bill repeals this provision. Fees and charges at private health institutions, regardless of when they were first introduced, will be subject to the prescribed maximums and percentage increases unless specifically approved by the Minister. This change ensures greater oversight and control over the cost of private healthcare, aiming to protect patients from exorbitant charges, said Ziyambi further.\n\nThe proposed law will likely impact the operations of private medical facilities, which have assisted in alleviating the burden being suffered by Public facilities.\n\nAs public hospitals are in dire straits, citizens are left at the mercy of private institutions which are better equipped to cater for sick patients.\n\nClause 10 of the bill further empowers the Minister to enact regulations relating to healthcare for children, persons with chronic illnesses, liberation war veterans, and persons with disabilities.\n\nIt also provides for the establishment of healthcare packages at various service levels and the creation of a National Consultative Health Forum to facilitate public consultation.\n\nOther significant provisions include Clause 7, which broadens grounds for non-discrimination in healthcare, aligning with Section 56(3) of the Constitution, thereby reinforcing the Governments commitment to inclusive healthcare for all.\n\nZiyambi said the new Section 12(a), introduced by Clause 8, which prohibits private health institutions from refusing emergency medical treatment is of utmost importance.\n\nPerhaps, Mr. Speaker, one of the most impactful provisions is the new Section 12(a), inserted by Clause 8, which prohibits the refusal of emergency medical treatment by private health institutions, aligning with Section 76, Subsection 3 of the Constitution.\n\nThis mandates private institutions to admit patients suffering from life-threatening conditions for a period of not less than 48 hours for stabilisation, even if they cannot afford treatment. This is a lifeline for many and the Bill also allows for agreements between the Minister and private institutions for cost recovery, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/09/29054941/Doctor.jpg",
            "description": "<p>By Staff Reporter GOVERNMENT has announced that fees at private health institutions will be subject to prescribed maximum limits and percentage increases, unless specifically approved by the Minister responsible for health. Presenting the Bill during its second reading in the National Assembly on Tuesday, Minister of Justice, Legal and Parliamentary Affairs Ziyambi Ziyambi said the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/government-to-set-caps-on-private-healthcare-fees-mandates-emergency-treatment-access/\">Government to set caps on private healthcare fees, mandates emergency treatment access</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:46",
            "date": "17 Jul 2025"
        },
        {
            "title": "Zimbabwe partners with Chinese firms for construction of landmark $270m lithium plant",
            "url": "https://www.newzimbabwe.com/zimbabwe-partners-with-chinese-firms-for-construction-of-landmark-270m-lithium-plant/",
            "content": "Business Insider Africa\n\nZimbabwes state-owned Kuvimba Mining House is set to begin construction of a $270 million lithium concentrator at its Sandawana mine in the third quarter of 2025.\n\nAccording to CEO Trevor Barnard, the commissioning is targeted for early 2027.\n\nThe project, designed to process 600,000 metric tons of lithium ore annually, will be developed in partnership with two major Chinese metals companies,Reutersreported.\n\nUnder the agreement, the Chinese partners will build and operate the plant for at least five years before handing it over to Kuvimba. Barnard declined to disclose the names of the firms, citing ongoing negotiations.\n\nWe are still finalising the last few agreements that we need to put in place and making sure we have all the necessary and compatible industry conditions for our partner to start construction, Barnard said.\n\nWe are looking at breaking ground in the third quarter, he added.\n\nBarnard noted that the planned completion of the $270 million Sandawana lithium concentrator could align with a rebound in lithium prices.\n\nAlthough spot prices have since plunged by nearly 90% due to oversupply and weaker-than-expected EV demand, Chinese companies continue to invest heavily in Zimbabwes lithium sector to secure feedstock for their domestic refineries.\n\nAccording to data from CRU Group, Zimbabwe accounted for roughly 14% of Chinas lithium imports last year.\n\nAnalysts suggest that the current price slump may not last. Recent production cuts, paired with a rebound in EV sales in China, are expected to tighten the market, with lithium demand potentially outpacing supply by the end of the year.\n\nOur forecast is that lithium prices will recover sometime in the year 2027, right at a point in time when we expect the concentration plant to be in production, Barnard said.\n\nLast month, Zimbabwe,Africas leading lithium producer, announced plans to ban the export of lithium concentrates starting January 2027, as part of a broader strategy to boost local value addition in the mining sector.\n\nFor years, Chinese firms operating in Zimbabwe have exported lithium concentrates to China for refining, bypassing local processing.\n\nAs part of its industrialisation drive, Zimbabwe revealed that two lithium sulphate processing plants are currently under development.\n\nOne is at Bikita Minerals, owned by Chinas Sinomine Resource Group, and the other at Prospect Lithium Zimbabwe, operated by Zhejiang Huayou Cobalt.\n\nInterest in lithium is surging across Africa. Countries like Namibia, Mali, Ghana, and the Democratic Republic of the Congo (DRC) are ramping up exploration and mining efforts.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/17033731/Screenshot-2025-07-17-at-04.37.13.png",
            "description": "<p>Business Insider Africa Zimbabwe’s state-owned Kuvimba Mining House is set to begin construction of a $270 million lithium concentrator at its Sandawana mine in the third quarter of 2025. According to CEO Trevor Barnard, the commissioning is targeted for early 2027. The project, designed to process 600,000 metric tons of lithium ore annually, will be</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-partners-with-chinese-firms-for-construction-of-landmark-270m-lithium-plant/\">Zimbabwe partners with Chinese firms for construction of landmark $270m lithium plant</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:46",
            "date": "17 Jul 2025"
        },
        {
            "title": "Chiredzi sugarcane farmers to benefit from new ZETDC 330kV power line",
            "url": "https://www.newzimbabwe.com/chiredzi-sugarcane-farmers-to-benefit-from-new-zetdc-330kv-power-line/",
            "content": "By Anna Chibamu\n\nLOWVELD sugarcane producers are set to benefit from Zimbabwe Electricity Supply Authoritys (ZESA) construction of a 330 kilovolt power line by its subsidiary, the Zimbabwe Electricity Transmission and Distribution Company (ZETDC).\n\nZETDC Acting Managing Director Abel Gurupira told a Parliamentary Portfolio Committee on Industry and Commerce this Tuesday that a 330 kilovolt line from Mutare to Chiredzi is under construction.\n\nSugarcane farmers in the lowveld have had power shortages over the years due to the dilapidated power infrastructure in the area.\n\nThis development is expected to see an increase in sugarcane production.\n\nGurupira told the committee that ZETDC was already on site to install the much-needed line.\n\nZETDC Acting Managing Director Abel Gurupira\n\nWe want to install a 330 kilovolt line from Orange Grove, which is in Mutare, to Triangle. This is a way to capacitate us to bring power from Mozambique, like from EDM, through Mutare, via that corridor, to Orange Grove, then to Triangle.\n\nWe are already on the site and we are having supplies coming from another route, like from Mwangi, via Tokwe, to Triangle, because that line exists.\n\nThe installation will increase the capacity within the low-field areas where we have a lot of farmers in desperate need of electricity, Gurupira said\n\nGurupira highlighted that ZETDC was working closely with wheat, tobacco and sugarcane farmers to make sure load shedding is minimised on their farms.\n\nWe are working together with the winter wheat farming clusters, where we ensure that there is no load-shedding during the farming season.\n\nWe are saying the same thing for the sugar industry. As long as the clusters are organised and they are irrigating, then we also ensure we ring fence so that there is no load-shedding for them, said Gurupira.\n\nThe companys Commercial Services manager John Chikeya bemoaned infrastructure vandalism, saying ZETDC was working towards the resuscitation of the vandalised and dilapidated infrastructure.\n\nThis initiative seeks to enhance electricity reliability for sugarcane farmers and producers in Chiredzi.\n\nAs ZETDC we are advancing a smart grid initiative which includes ithe nstallation of smart water reclosers and smart metres.\n\nThe initiative also seeks to enhance electricity reliability for sugar millers and irrigators and ensure prioritised power supply during outages, Chikeya said.\n\nSmart metres and MCCBs, which are motorised circuit breakers, enable segregation of the power supply.\n\nThis means ZETDC can select who will have power and who will not, and what quantum of power they will have during periods of suppressed generation.\n\nThe lowveld had been one of the most needy areas, identified for the solar initiatives.\n\nZETDC is envisaged to have a private sector setting up commercial and industrial solar plants to benefit the farming community who have good credit ratings.\n\nAmongst other initiatives, ZETDC is also undertaking network rehabilitation and reinforcement and expansion to upgrade the old and aged infrastructure that was prone to a high rate of falls.\n\nThe substations were being reviewed and inspected and aligned to the poor demand of the low-yield.\n\nThere is a 132 kv transmission line from Orange Grove to the low-yield that will be supporting the growth of the sugarcane value chain.\n\nThere is also a scheduled upgrade for Chiredzi Town substation transformer 1 from 5 MVA to 10 MVA, which is a 100% increase in capacity. Then the resuscitation of Buffalo Range capacitor banks and resuscitation of Chiredzi Town L18 substation, said Chikeya.\n\nZaka South MP, Clemence Chiduwa chaired the Committee, which was receiving oral evidence on challenges that are affecting the sugar industry value chain in the country, among them, overpricing.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/04/22173018/sugarcane1.jpg",
            "description": "<p>By Anna Chibamu LOWVELD sugarcane producers are set to benefit from Zimbabwe Electricity Supply Authority’s (ZESA) construction of a 330 kilovolt power line by its subsidiary, the Zimbabwe Electricity Transmission and Distribution Company (ZETDC). ZETDC Acting Managing Director Abel Gurupira told a Parliamentary Portfolio Committee on Industry and Commerce this Tuesday that a 330 kilovolt</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chiredzi-sugarcane-farmers-to-benefit-from-new-zetdc-330kv-power-line/\">Chiredzi sugarcane farmers to benefit from new ZETDC 330kV power line</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:46",
            "date": "17 Jul 2025"
        }
    ]
}