{
    "news": [
        {
            "title": "‘One of us’: Ugandan pride in New York mayor with roots in their country",
            "url": "https://www.newzimbabwe.com/one-of-us-ugandan-pride-in-new-york-mayor-with-roots-in-their-country/",
            "content": "BBC\n\nMany Ugandans are expressing their pride in the newly elected mayor of New York, Zohran Mamdani, who was born in Uganda and retains dual nationality.\n\nSome have described him as one of their own, saying he inspires them.\n\nA journalist who mentored him during his teenage internship at one of Ugandas leading newspapers told the BBC that there was a lot of excitement in Uganda about Mamdanis rise especially because of his young age. Uganda has the second-lowest median age worldwide of just 16.2, according to the CIA World Factbook.\n\nZohran, 34, is the son of Prof Mahmood Mamdani, a prominent Ugandan academic, while his mother, Mira Nair, is an acclaimed filmmaker.\n\nJournalist Angelo Izama told the BBCs Newsday programme that the younger Mamdani was initially shy while they worked together, but was absolutely determined to get things done.\n\nHe says Zohran is very fond of Kampala, Ugandas capital, which he often mentions.\n\nMahmood Mamdani was raised in Uganda and worked for more than a decade at Makerere University, the countrys main and oldest university. He met his wife in Kampala while she was researching Mississippi Masala, a film about the expulsion of Asians from Uganda under Idi Amin.\n\nProf Mamdani is known for his anti-colonialist scholarship, which examines the legacy of colonialism in Africa and its impact on governance, identity and justice.\n\nMakerere University professor Okello Ogwang says he feels great about Zohrans success, describing him as the son of a colleague. This is somebody from home.\n\nWe have one of us there, he told the BBC.\n\nIt gives me hope that the children we are raising are the hope of this world. As a continent we are missing out on the greatest resource we have  the youth.\n\nWhile many Ugandans had not heard of Zohran until his election, a student at the university said people were very happy, saying it proved that anyone could rise above their background.\n\nIt gives morale, especially to us as youths, said Abno Collins Kuloba. Wherever you have grown up, be it poor or rich, you can become something big, like what [Mamdani] has done.\n\nAnother student, Chemtai Zamzam, said she was happy, for herself and Ugandans. She said Mamdani was an inspiration to her as a young person, as it shows we can become anything we want as long as we put faith and determination.\n\nThe new mayor is also being celebrated elsewhere in the continent.\n\nAbdul Mohamed, an Ethiopian who is a former senior UN and African Union official, describes Mahmood Mamdani as a distinguished scholar of African politics, a man who interrogated power and justice.\n\nHe says having known Zohran since infancy, he sees him as having inherited his fathers commitment to pan-Africanism, his parents courage to think freely, and their belief that one can belong everywhere.\n\nHe says Zohrans rise is symbolic and practical especially to young Africans, asking them to draw from him lessons in politics.\n\nI think through him, [the] power and beauty of multi-ethnic, multi-religious identity found its voice. And Africa is by and large a multi-ethnic and a multi-religious society, he says.\n\nHe adds that as Zohran has demonstrated, young people need to organise and build political action and avoid despair and avoid pure anger.\n\nUganda is holding elections next year, with 81-year-old President Yoweri Museveni seeking another term after almost 40 years in power.\n\nThe Mamdani family also spent at around three years in Cape Town, South Africa, after Mahmood was appointed the Chair of African Studies at the University of Cape Town in the 1990s.\n\nSome South Africans have also been taking pride in his historic election.\n\nHailing his victory as as a remarkable achievement, the imam of Cape Towns Claremont Road Mosque, Rashied Omar, said that Zohrans formative years were shaped, in small part, in our congregation.\n\nHe said that Zohran began his Islamic education at the mosque, and started his schooling at St Georges Grammar.\n\nIt is inspiring to see how Zohrans early South African experiences, though modest, made a lasting impression on his political consciousness and helped shape his creative, community-based approach to politics, Dr Omar said.\n\nAs South African social justice activists, we can now learn from Zohrans example, how to practise progressive politics that resonates with new generations and builds bridges across race, class, and faith, he added.\n\nThe Economic Freedom Fighters (EFF), the fourth-biggest party in South Africa which champions left-wing economic policies, also hailed Zohrans victory as historic.\n\nHis election represents not only a transformative moment for the people of New York but also a powerful signal to the world that progressive justice-driven leadership is rising even in the heart of the global capitalist order, the party said in a statement.\n\nIn Nigeria, a Christian pastor who is a supporter of President Bola Tinubu also welcomed Zohrans victory.\n\nPastor Okezie J Atai said on X that Nigeria cannot be threatenedby US President Donald Trump, whose threats could not subdue the 34-year-old Zohran.\n\nLast week,Trump threatened to take military action to tackle Islamist insurgents in Nigeria, accusing the government of failing to protect Christians.\n\nGovernment officials responded by saying that jihadists were not targeting members of a particular religion and that they had killed people from all faiths, or none.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/05180408/mamdani.webp",
            "description": "<p>BBC Many Ugandans are expressing their pride in the newly elected mayor of New York, Zohran Mamdani, who was born in Uganda and retains dual nationality. Some have described him as one of “their own”, saying he inspires them. A journalist who mentored him during his teenage internship at one of Uganda’s leading newspapers told</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/one-of-us-ugandan-pride-in-new-york-mayor-with-roots-in-their-country/\">‘One of us’: Ugandan pride in New York mayor with roots in their country</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "05 Nov 2025"
        },
        {
            "title": "Govt apologises to travel vlogger denied access to Mbuya Nehanda statue",
            "url": "https://www.newzimbabwe.com/govt-apologises-to-travel-vlogger-denied-access-to-mbuya-nehanda-statue/",
            "content": "By Staff Reporter\n\nThe Ministry of Tourism and Hospitality Industry has apologised to travel vlogger Davud Akhundzada, who posted a viral video complaining he had been denied access to the Mbuya Nehanda statue.\n\nThe statue, a bronze monument honouring the legendary Shona spirit medium and heroine of the 18961897 First Chimurenga war against British colonisers, stands at the intersection of Samora Machel Avenue and Julius Nyerere Way in Harares central business district.\n\nAkhundzada alleged that he was prevented from accessing the monument,a move that has drawn widespread attention online. In response, the Tourism Ministry issued a statement defending existing access restrictions at the heritage site.\n\nThe Ministry of Tourism and Hospitality Industry has noted with concern a circulating video involving travel vlogger Davud Akhundzada, who was reportedly restricted from accessing the Mbuya Nehanda Statue site in Harare, the ministry said in a statement on Wednesday.\n\nWe wish to clarify that the Mbuya Nehanda Statue is a National Heritage Monument managed by the Ministry of Home Affairs and Cultural Heritage. It stands as a proud symbol of Zimbabwes liberation history and identity.\n\nThe site is subject to specific preservation and security protocols and, as such, public access to certain areas,including elevated or restricted zones,may be limited for safety, preservation, and security reasons.\n\nHowever, as the Ministry of Tourism and Hospitality Industry, we are taking proactive steps to enhance tourist management at such sites.\n\nThrough a Whole-of-Government Approach Strategy in coordination with our counterparts at the Ministry of Home Affairs and Cultural Heritage, we are in the process of deploying tourism officers at key heritage and cultural monuments. These officers will facilitate seamless, well-informed, and welcoming access for tourists, ensuring a positive experience while safeguarding our national heritage.\n\nThe ministry, led by Minister Barbra Rwodzi, apologised to Akhundzada for the inconvenience caused and reaffirmed its commitment to ensuring that all tourists visiting Zimbabwes heritage sites enjoy safe, accessible, and memorable experiences.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/05175521/davud.jpg",
            "description": "<p>By Staff Reporter The Ministry of Tourism and Hospitality Industry has apologised to travel vlogger Davud Akhundzada, who posted a viral video complaining he had been denied access to the Mbuya Nehanda statue. The statue, a bronze monument honouring the legendary Shona spirit medium and heroine of the 1896–1897 First Chimurenga war against British colonisers,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-apologises-to-travel-vlogger-denied-access-to-mbuya-nehanda-statue/\">Govt apologises to travel vlogger denied access to Mbuya Nehanda statue</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "05 Nov 2025"
        },
        {
            "title": "Pomona Flats construction takes shape",
            "url": "https://www.newzimbabwe.com/pomona-flats-construction-takes-shape/",
            "content": "By Staff Reporter\n\nBUILDING of the Pomona flats is progressing well with the first block now under construction and indications that two more blocks will be out of the ground by year-end.\n\nTwo blocks are already sold out while blocks three and four are on the market and selling equally fast.\n\nWestProp Holdings is renowned for its signature developments, including Millennium Heights and Pokugara. Its latest project, The Hills Luxury Golf Estate, is set to redefine the live, work, shop, and play lifestyle that underpins all WestProp communities  offering a bold new standard in integrated urban living.\n\nWith the introduction of apartments at Pomona City, Westprop chief executive Ken Sharpe is making a bold statement and declaring confidence in Harares urban evolution.\n\nWith three blocks already sold out, the project is capturing the attention of homebuyers and investors alike  a testament to its strategic location, modern design, and flexible ownership models.\n\nIn response to growing demand for quicker delivery timelines, WestProp has introduced a dedicated block tailored for buyers seeking occupancy within six months. This block comes with a synchronised payment plan, allowing purchasers to align their financial commitments with the construction schedule  a move designed to ease pressure on buyers while maintaining WestProps hallmark quality.\n\nThe Pomona Flats project is part of WestProps broader vision to redefine urban living in Zimbabwe through sustainable, secure, and stylish communities. With construction now underway and momentum building, prospective buyers are encouraged to act swiftly to secure units in the remaining blocks.\n\nPomona, dubbed a City within a City, borders with one of Harares premier 18-hole golf clubs  Wingate and is within striking distance of Harares growing commercial hubs  the Green Zone.\n\nA total of 22 blocks consisting of 16-unit apartments on three floors each will decorate the Pomona landscape, creating a new vibrant community and business opportunities.\n\nThis means in phase 1, there will be 352 apartment units  translating to housing 352 families. Phase 2 will have the same number of units. The architects created a spacious parking space of 530 bays for residents and 178 for visitors.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/10055033/Pomona_City_tOTx.jpg",
            "description": "<p>By Staff Reporter BUILDING of the Pomona flats is progressing well with the first block now under construction and indications that two more blocks will be out of the ground by year-end. Two blocks are already sold out while blocks three and four are on the market and selling equally fast. WestProp Holdings is renowned</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pomona-flats-construction-takes-shape/\">Pomona Flats construction takes shape</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "05 Nov 2025"
        },
        {
            "title": "TN Cybertech launches aggressive rebranding exercise",
            "url": "https://www.newzimbabwe.com/tn-cybertech-launches-aggressive-rebranding-exercise/",
            "content": "By Alois Vinga\n\nTN Cybertech Investments Limited (TNCI) has launched an aggressive rebranding exercise, which is set to be rolled out across the group as the year progresses.\n\nPresenting the groups half-years performance for the period ended August 31 2025, TNCI GCEO, James Mushore, said the group is undertaking an extensive rebranding program which has so far started off with selected bank branches such as the Borrowdale Platinum Branch.\n\nIn the second half of the financial year, this initiative will extend to our agent network, kiosks, digital platforms, products and remaining branches. At the heart of this transformation are the Banks core values encapsulated in the acronym IDIFOH  Innovation, Dignity, Industry, Faith, Originality and Humility  which form the foundation of our brand identity and customer promise, said Mushore.\n\nDuring the period, digital bank revenue reached ZWG 179 million, representing a 40% increase compared to the same period in the prior year on the back of a performance driven by strong growth in mobile banking and POS channels, the latter rising 89% year-on-year.\n\nTreasury and funded income segments also performed strongly, with interest-earning assets up 32% and net interest income up 235%. In the second half of the year, the bank expects to deepen partnerships with corporates in the mining, agriculture and manufacturing sectors to further strengthen its loan book and funded income base.\n\nTNCI intends to build on the Reserve Bank of Zimbabwes National Payment System Report on digital banking which stated that transaction volumes grew by 6% during the first half of 2025, while ATM and POS volumes rose by 8% and 13% respectively.\n\nBuilding on this momentum, the Bank deployed smart ATMs in Bulawayo and Harares CBD and expanded its POS network to enhance service delivery for both corporates and SMEs. The Bank continues to digitalise its agent-banking model, ensuring that infrastructure growth matches its expanding footprint, Mushore said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/05180109/nyambirai.jpg",
            "description": "<p>By Alois Vinga TN Cybertech Investments Limited (TNCI) has launched an aggressive rebranding exercise, which is set to be rolled out across the group as the year progresses. Presenting the group’s half-year’s performance for the period ended August 31 2025, TNCI GCEO, James Mushore, said the group is undertaking an extensive rebranding program which has</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tn-cybertech-launches-aggressive-rebranding-exercise/\">TN Cybertech launches aggressive rebranding exercise</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "05 Nov 2025"
        },
        {
            "title": "Improve our welfare or we leave – nurses tell government",
            "url": "https://www.newzimbabwe.com/improve-our-welfare-or-we-leave-nurses-tell-government/",
            "content": "By Staff Reporter\n\nNURSES have bluntly told government to improve their welfare to avoid growing discontent and a mass exodus of medical practitioners seeking better opportunities abroad.\n\nMedical practitioners have been at loggerheads with the government, bemoaning low salaries, which are coupled with poor working conditions that have driven the majority out of public health institutions.\n\nAddressing the annual general meeting in Masvingo recently, Zimbabwe Nurses Association (ZINA) president Enock Dongo told Deputy Minister of Health and Child Welfare Sleiman Kwidini that government shouldtake care of the workforce to avoid strikes.\n\nOur covenant is that we do not engage in strike. Strike is the last resort. We should not be pushed to that limit. So when you hear us complaining it would be so that nurses receive meaningful salaries. If they get enough salaries they forget about going on strike, said Dongo.\n\nHealth professionalshave been leavingthe countryin droves, in the process affecting service delivery in public hospitals.\n\nDongo said 4 000 nurses have applied to government for verification as they attempt to leave the country.\n\nWe have a very topical issue of verification which was supposed to be given by the Nurses Council, is not being given right now. Power has been taken by the Ministry. Legally Ministry does not have the power to withhold a letter of good standing, but it is still doing that.\n\nLetter of good standing is supposed to be given so that one can go wherever he wants. If I have done anything wrong just write rather than withholding it. We have more than 4 000 verification applications by nurses is because of poor working conditions and salaries.\n\nWe do not even aim to go outside the country. All the nurses here are very patriotic, added Dongo.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/05015541/Nursees-on-Strike.png",
            "description": "<p>By Staff Reporter NURSES have bluntly told government to improve their welfare to avoid growing discontent and a mass exodus of medical practitioners seeking better opportunities abroad. Medical practitioners have been at loggerheads with the government, bemoaning low salaries, which are coupled with poor working conditions that have driven the majority out of public health</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/improve-our-welfare-or-we-leave-nurses-tell-government/\">Improve our welfare or we leave – nurses tell government </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "05 Nov 2025"
        }
    ]
}