{
    "news": [
        {
            "title": "I am not a spy – Mliswa denies enticing Mzembi back to Zimbabwe, blames fallout with Kasukuwere",
            "url": "https://www.newzimbabwe.com/i-am-not-a-spy-mliswa-denies-enticing-mzembi-back-to-zimbabwe-blames-fallout-with-kasukuwere/",
            "content": "By Darlington Gatsi\n\nOUTSPOKEN politician Temba Mliswa has denied allegations of luring Walter Mzembi back to Zimbabwe for incarceration, claiming the former cabinet minister was living in fear after a fallout with exiled ex-ZANU PF commissar Saviour Kasukuwere.\n\nMzembi returned to Zimbabwe after seven years of exile and has been in pretrial detention for violating his 2018 bail conditions.\n\nAt the centre of his return and subsequent arrest was allegedly Mliswa, an accusation which he denies.\n\nThe Mzembi issue is an unfortunate exhibition of callous politicians conveniently altering facts and pseudo-journalists crafting an alternative reality for excitable masses to imbibe on. Its a total shame to accuse me or anyone of enticing him back. This was his own idea, said Mliswa in a social media post.\n\nMliswa said the return of Mzembi was of his own volition due to fear of Kasukuwere after a fallout.\n\nThe facts are verifiable. There was never any CIO operation because Mzembi approached me as he wanted to return. One major reason is that he had split with Kasukuwere. For more than a year and half they have never spoke. He felt unsafe which is why he moved from SA to Zambia!\n\nAll this talk about me selling him out is noonday hogwash. Im no spy and never worked for CIO. Characters like Ali Naka, are merely (social media) guns for hire operating as Sekuru Tysons instruments. Ali is working for his food and will peddle any nonsense he is fed.\n\nInstead, they should admit how Mzembi was pushed back here due to fear of Kasukuwere as he no longer felt safe. He crafted his own idea, approached me to facilitate engagements with the relevant powers. Which I did. What part of those actions constitutes enticing him back? said Mliswa.\n\nThe alleged fallout between Kasukuwere and Mzembi comes as a surprise, as the two had been as thick as thieves and worked together during the 2023 election season.\n\nNow languishing in prison, Mzembi is reportedly ill as he awaits the commencement of his trial.\n\nI have always advocated for the return of everyone in exile. For both times involving Mzembi and Kasukuwere in 2018 when approached I simply spoke with the powers that be and facilitated engagements between the parties. Whatever else they agreed or didnt, I was never part of!\n\nAccusations of betrayal are outright fabrications by individuals like Ali Naka who are mere marionettes in this charade. Mzembi is not a victim of anything I did but of that which compelled him to flee from SA. Whatever agreements they spoke about back here I was never part of, added Mliswa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/05/10034227/Walter-Mzembi.jpg",
            "description": "<p>By Darlington Gatsi OUTSPOKEN politician Temba Mliswa has denied allegations of luring Walter Mzembi back to Zimbabwe for incarceration, claiming the former cabinet minister was living in fear after a fallout with exiled ex-ZANU PF commissar Saviour Kasukuwere. Mzembi returned to Zimbabwe after seven years of exile and has been in pretrial detention for violating</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/i-am-not-a-spy-mliswa-denies-enticing-mzembi-back-to-zimbabwe-blames-fallout-with-kasukuwere/\">I am not a spy – Mliswa denies enticing Mzembi back to Zimbabwe, blames fallout with Kasukuwere</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "03 Sep 2025"
        },
        {
            "title": "When African digital transformation narratives meet truth-challenged prosperity",
            "url": "https://www.newzimbabwe.com/when-african-digital-transformation-narratives-meet-truth-challenged-prosperity/",
            "content": "By Andile Masuku, IOL\n\nA crypto entrepreneur posting as@goodalexanderon X recently offered some disconcertingobservationsabout powerful people and truth-telling. His cynical take  that Warren Buffetts folksy investment wisdom and Peter Thiels contrarian innovation insights might be theatrical misdirection  feels particularly relevant when applied to how we discuss Africas digital transformation.\n\nThese musings come alongside @goodalexanders promotion ofPost Fiat, a blockchain project that reimagines XRPs consensus mechanism with AI-driven validator selection. Whether his X handle reflects genuine identity or careful branding around good intentions, his scepticism about curated reality deserves journalistic scrutiny.\n\nSide-bar:XRP is a cryptocurrency created in 2012 by developers David Schwartz, Jed McCaleb, and Arthur Britto. Unlike Bitcoin, all 100 billion XRP tokens were created upfront, with most going to Ripple Labsthe company that helped develop it. XRP runs on its own blockchain designed for fast, cheap international payments, though Ripple doesnt actually own the network.\n\nEmpire fragments\n\nTheres something almost poetic about someone called Alexander critiquing the machinery of influence. The original Alexander (the Great) succeeded miserably at conquering the world, dying young after swiftly taking over vast territories that immediately fragmented. Perhaps our modern Alexanders insights about fabricated methodologies and post-truth economics carry similar warnings about the sustainability of narratives built on strategic misdirection.\n\nThis scepticism is a handy tool for weighing how we discuss Africas digital transformation. We celebrate mobile money penetration statistics while sidestepping questions about whose systems actuallypowerthis leapfrogging. We herald blockchain fixes for financial inclusion while rarelyexaminingwhether these primarily extract value to foreign tech conglomerates.\n\nPayment rails\n\nTake Zimbabwes EcoCash, operated by Econet Wireless. The platforms partnerships reveal the intricate web of global alliances that define modern African fintech.EcoCash Diaspora, a nifty product innovation that my family recently found handy for channelling financial lovegifts to my mother from all over the world following my fathers death, facilitates remittances from Zimbabweans abroad through partnerships with Shoprite, WorldRemit, M-Pesa, MTN and other international money transfer agents.\n\nMasterCardsinvolvementruns deeper than simple processing. The company has reportedly issued over 3 million MasterCard debit cards linked to EcoCash accounts, creating Zimbabwes largest EMV chip and PIN card rollout and allowing customers to withdraw money from MasterCard-licensed ATMs whilst paying for goods locally and internationally.\n\nThe same underlying infrastructure also supports newer market entrants like InDrive. The Russian ride-hailing platform, which operates on a haggling model where passengers name their price, accepts EcoCash and MasterCard payments for wallet top-ups. Even though the extent of MasterCards direct role in facilitating InDrives aggressive Zimbabwe expansion lacks detailed public documentation, the payment options clearly build on the existing EcoCash-MasterCard ecosystem that has already reduced barriers for international platforms seeking local market access.\n\nCurated realities\n\nThe arrangement illustrates @goodalexanders point about curated realities. From one angle, its a success story about African fintech systems driving financial inclusion. MasterCards 3 million debit cards represent the largest such rollout in Zimbabwes history, while EcoCash Diaspora processes an increasingly significant portion of total remittances into the country. From another, it demonstrates how global payment networks create pathways for foreign platform market penetration, with transaction fees and data flowing through multiple international intermediaries.\n\nEcoCash benefits from increased transaction volume, MasterCard collects processing fees, InDrive gains market access, and Zimbabwean consumers get cheaper rides, but the value capture primarily accrues outside the local economy.\n\nThis success story operates within the same structural constraints that necessitated its existence: currency volatility, limited formal banking penetration, and regulatory uncertainty that can see mobile money agents nabbed for facilitating transactions in ways that suddenly fall afoul of fiscal and monetary policy oversight.\n\nSimilar complexities emerge when examiningChinese involvementin African technology systems. Cameroons CamTel partnership with Huawei to expand 4G coverage across the country genuinely improved telecommunications access in underserved regions, connecting rural communities to digital services for the first time. Simultaneously, it embedded Chinese technology standards and created dependencies on Huaweis technical expertise and equipment supply chains.\n\nSteel cuts\n\nThe uncomfortable truth is that both narratives can be simultaneously accurate. Zimbabwes Manhize steel plant, a joint venture between Chinese firm Tsingshan and local partners, nowproducessteel that competes directly with South African manufacturers in regional markets. ArcelorMittal South Africa and other domestic producers haveraised concernsabout cheap Zimbabwean steel imports undermining their pricing structures and threatening local employment.\n\nZimbabwes steel industry revival, financed by Chinese capital and technology, potentially destabilises South Africas manufacturing base, even as Beijing emerges as the primary beneficiary of both countries steel consumption patterns.\n\nThese dualities extend beyond individual projects to systemic questions about agency and self-determination.\n\nWhen Lagos-based fintech companies integrate with international payment processors to serve African diaspora communities, theyre solving real problems while also channelling transaction fees to foreign financial infrastructure. When Sub-Saharan African AI researchers collaborate with European institutions onAI for good projects, theyre building local capacity while potentially training algorithms that offshore critical IP and analytical potential which primarily serve Global North applications.\n\nNarrative honesty\n\nIginio Gagliardone, professor of media studies at Wits University and inauguralSARChI SA-UK Bilateral Chair in Digital Humanities, speaks of using technology to reimagine more humane ways of interfacing with digital development, pointing toward something crucial: the need to centre historically marginalised forms of knowledge rather than simply adopting external approaches wholesale.\n\nYet heres where @goodalexanders cynicism about fabricated methodologies becomes most relevant. If powerful actors routinely say whatever serves their immediate objectives  whether thats attracting investment capital or maintaining market position  how do we distinguish between genuine transformation and sophisticated marketing?\n\nFirst-party data\n\n@goodalexanders observation about the only data worth anything being first-party study and collection becomes essential here. We cannot afford to rely on others curated interpretations of our own transformation. When I reflect on CamTels relationship with Huawei or analyse Zimbabwes retail sector challenges, the goal is to place progress within the full complexity of whats actually happening.\n\nThe question becomes whether were tellingcomplete storiesthat serve the next generations ability to make genuinely informed choices about their digital futures.\n\nThe Venn diagram where digital economy meets real economy exists precisely in this space of complexity. Digital banking thrives in markets where traditional banking failed, operating within the samestructural constraintsthat caused that failure. AI-powered systems promise efficiency gains whilstraising questionsabout whose intelligence is being optimised and toward what ends.\n\nPerhaps the most honest approach acknowledges that transformation narratives inevitably serve multiple audiences with different objectives. The challenge for those of us documenting these changes is to be transparent about whose interests our framing serves whilst resisting the temptation to oversimplify for the sake of compelling stories.\n\nCounter algorithm\n\nIf @goodalexander, whoever stands behind that handle, is correct about powerful peoples relationship with truth-telling, then our responsibility as journalists, or indeed quasi-journalists, becomes critical. Someone needs to document whats actually happening, rather than what various interested parties want us to believe is happening.\n\nThe algorithms of influence operate through narrative as much as code. Our counter-algorithm might simply be: radical honesty about complexity, even when complexity is less marketable than tantalising transformation myths.\n\nAndile Masuku is Co-founder and Executive Producer atAfrican Tech Roundup. Connect and engage with Andile onX(@MasukuAndile) and viaLinkedIn.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/03142937/truth.png",
            "description": "<p>By Andile Masuku, IOL A crypto entrepreneur posting as @goodalexander on X recently offered some disconcerting observations about powerful people and truth-telling. His cynical take – that Warren Buffett’s folksy investment wisdom and Peter Thiel’s contrarian innovation insights might be theatrical misdirection – feels particularly relevant when applied to how we discuss Africa’s digital transformation. These musings come alongside</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/when-african-digital-transformation-narratives-meet-truth-challenged-prosperity/\">When African digital transformation narratives meet truth-challenged prosperity</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "03 Sep 2025"
        },
        {
            "title": "Sikandar Raza becomes ICC World’s No. 1 ODI all-rounder",
            "url": "https://www.newzimbabwe.com/sikandar-raza-becomes-icc-worlds-no-1-odi-all-rounder/",
            "content": "CricTracker\n\nZimbabwes star player Sikandar Raza has become the top-ranked all-rounder in the ICC Mens ODI Player Rankings for the first time in his career after a fine show in the two-match series against Sri Lanka in Harare.\n\nThe 39-year-old scored 92 and 59 not out in the two matches and took one wicket in the series to overtake the Afghanistan pair of Azmatullah Omarzai and Mohammad Nabi, who are now placed second and third, respectively. Razas previous best was the second position that he attained in December 2023.\n\nRazas aggregate of 151 runs also lifted him nine places to 22nd position in the batting rankings, which is two places off his career-best 24th position reached in June 2023. He has also gained one spot to reach 38th position among bowlers.\n\nSri Lanka opener Pathum Nissanka, who topped the aggregate with 198 runs to be named the Player of the Series, has moved up seven places to 13th position while Janith Liyanage (up 13 places to 29th) of Sri Lanka and Sean Williams of Zimbabwe (up three places to 47th) are others to move up the batting rankings after the series.\n\nScotland batter George Munsey is up three places to 34th after a match-winning 84 not out against Canada in the ICC Mens Cricket World Cup League 2 while South Africas Tony de Zorzi has moved from 67th to 64th.\n\nThe ODI bowling rankings see South Africa spinner Keshav Maharaj shake off Sri Lanka spinner Maheesh Theekshana to take the sole No. 1 position after a match-winning haul of four for 22 in the first ODI against England in Leeds with Jofra Archer (up six places to 19th) and Lungi Ngidi (up five places to joint-23rd) among the others to move up the bowling rankings after the match.\n\nAsitha Fernando has advanced six places to 31st while Dilshan Madushankas match-winning four for 62 in the first Harare ODI, that included a hat-trick, has lifted him from 60th to 52nd position.\n\nThe ICC Mens T20I Player Rankings see Afghanistan batters Ibrahim Zadran and Sediqullah Atal make huge progress after helping beat Pakistan in a tri-series match in Sharjah with scores of 65 and 64, respectively. Zadran is up 12 places to 20th while Atal has rocketed 346 places to 127th position.\n\nPakistan batters Hasan Nawaz (up two places to joint-31st) is among those to gain in the batting rankings while Sufiyan Muqeem (up 11 places to 22nd), Shaheen Afridi (up eight places to 26th and Mohammad Nawaz (up 15 places to 43rd) are among those to move up the bowling rankings.\n\nRazas upward movement may have resulted in Nabi slipping to third position in the ODI all-rounders list, but he has moved up one spot to second position among T20I all-rounders.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/25140222/SIKANDAR-RAZA.jpg",
            "description": "<p>CricTracker Zimbabwe’s star player Sikandar Raza has become the top-ranked all-rounder in the ICC Men’s ODI Player Rankings for the first time in his career after a fine show in the two-match series against Sri Lanka in Harare. The 39-year-old scored 92 and 59 not out in the two matches and took one wicket in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sikandar-raza-becomes-icc-worlds-no-1-odi-all-rounder/\">Sikandar Raza becomes ICC World’s No. 1 ODI all-rounder</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "03 Sep 2025"
        },
        {
            "title": "14 foreigners arrested in Highlands cocaine bust",
            "url": "https://www.newzimbabwe.com/14-foreigners-arrested-in-highlands-cocaine-bust/",
            "content": "By Staff Reporter\n\nPolice have arrested 14 foreign nationals in a drug raid at a Highlands lodge following a tip-off.\n\nAccording to police spokesperson Commissioner Paul Nyathi, a separate operation at Beitbridge Border Post uncovered a dagga smuggling syndicate.\n\nOn September 2, 2025, detectives from CID Drugs and Narcotics, Harare, swooped on a lodge along Knightsbridge Road, Highlands, acting on a tip-off.\n\nThe suspects were caught red-handed sniffing cocaine from a wooden tray, said in a statement.\n\nPolice recovered two sachets of cocaine, one sachet of crystal meth, one sachet containing a mixture of cocaine and crystal meth.\n\nNyathi confirmed all 14 suspects were arrested for abuse and dealing in dangerous drugs.\n\nIn a separate incident a day earlier, on September 1, 2025, police at the Beitbridge Border Post arrested Last Chiyangwa (44), a bus conductor, after a suitcase stuffed with 24 cobs of dagga was discovered in the luggage compartment of a cross-border bus.\n\nFurther investigations led detectives to Harare, where they arrested Studymore Marimo (44) after he received the smuggled suitcase.\n\nPolice said the seized drugs and exhibits are being held pending court proceedings.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/03/06225836/Cocaine.jpg",
            "description": "<p>By Staff Reporter Police have arrested 14 foreign nationals in a drug raid at a Highlands lodge following a tip-off. According to police spokesperson Commissioner Paul Nyathi, a separate operation at Beitbridge Border Post uncovered a dagga smuggling syndicate. On September 2, 2025, detectives from CID Drugs and Narcotics, Harare, swooped on a lodge along</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/14-foreigners-arrested-in-highlands-cocaine-bust/\">14 foreigners arrested in Highlands cocaine bust </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "03 Sep 2025"
        },
        {
            "title": "Diaspora Remittances Fuel Property Boom in Zimbabwe",
            "url": "https://www.newzimbabwe.com/diaspora-remittances-fuel-property-boom-in-zimbabwe-utm_sourcenewzimbabweutm_mediumblogutm_campaignnewzimbabwe-blog/",
            "content": "For many Zimbabweans living abroad,real estate investmentis becoming an increasingly powerful way to remain rooted in the homeland. In 2024, diaspora remittances soared toUS $2.2 billiona 22% rise from 2023 cementing their role as one of the most reliable sources of foreign currency and a lifeline for the economy. A significant share of this money is flowing directly into real estate.\n\nWhere the Money Is Flowing: Top Areas in Demand\n\nRecent market activity highlights several areas dominating diaspora demand:\n\nWhy the Diaspora Is Investing Back Home\n\nThe strong appetite for real estate among Zimbabweans abroad is driven by several factors:\n\n1.Currency ProtectionProperty offers a safe hedge against currency volatility and inflation, allowing buyers to preserve value in a tangible asset.\n\n2.Security and Retirement PlanningMany invest in homes for future retirement or to provide secure accommodation for relatives back home.\n\n3.Attractive Rental YieldsSuburbs such as Borrowdale, Madokero, and parts of Mount Pleasant are producing gross rental yields of6%12%, making property a viable income stream.\n\n4.Preference for Serviced Land and Cluster HomesA large portion of diaspora inquiries focus on titled, serviced stands and lock-up-and-go cluster housing in secure, managed estates.\n\n5.Flexible Payment OptionsDevelopers offering installment plans in USD over 624 months are making property purchases more accessible to diaspora buyers.\n\nLooking Ahead\n\nThe role of the diaspora in Zimbabwes property market will continue to grow in 2025 and beyond. Demand forgated communities, cluster housing, andserviced standsis expected to remain strong, while interest spreads beyond Harare into growth hubs like Victoria Falls, Mutare, and Gweru.\n\nFor Zimbabweans abroad, property is more than an investment it is a symbol of belonging, security, and hope for the future.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/07/29141403/Diaspora-remittances-.jpg",
            "description": "<p>For many Zimbabweans living abroad, real estate investment is becoming an increasingly powerful way to remain rooted in the homeland. In 2024, diaspora remittances soared to US $2.2 billion a 22% rise from 2023 cementing their role as one of the most reliable sources of foreign currency and a lifeline for the economy. A significant share of this money</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/diaspora-remittances-fuel-property-boom-in-zimbabwe-utm_sourcenewzimbabweutm_mediumblogutm_campaignnewzimbabwe-blog/\">Diaspora Remittances Fuel Property Boom in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "03 Sep 2025"
        },
        {
            "title": "Miscommunication from unauthorised office! – presidential spokesperson dismisses ban on tinted vehicle windows",
            "url": "https://www.newzimbabwe.com/miscommunication-from-unauthorised-office-presidential-spokesperson-dismisses-ban-on-tinted-vehicle-windows/",
            "content": "By Leopold Munhende\n\nPRESIDENTIAL Spokesperson George Charamba has dismissed Provincial Affairs and Devolution Secretary Tafadzwa Mugutis decision to ban the tinting of windows on private and public vehicles.\n\nThe ban, announced on Tuesday this week, was said to be a response to drug use and transportation by vehicles that had tinted windows and also a rape that occurred at Harares Rezende Rank where a grade seven pupil was locked and violated inside a tinted commuter omnibus.\n\nPosting on Twitter, formerly X, using his Dhonzamusoro account, Charamba said Mugutis office did not have the authority he sought to imply it had.\n\nKINDLY NOTE: There is no basis in fact or law to the accompanying announcement attributed to Muguti. Kindly ignore this miscommunication from an unauthorised office and officer! said Charamba in a tweet that was accompanied by a video of Muguti passing his declaration.\n\nKINDLY NOTE: There is no basis in fact or law to the accompanying announcement attributed to Secretary Muguti. Kindly ignore this mis-communication from an unauthorized office and Officer!pic.twitter.com/78O2P5Lw2t\n\n dhonzamusoro007 (@dhonzamusoro007)September 3, 2025\n\nThe confusion was not explained, while Charamba maintained that he was correcting an anomaly and fixing the negative.\n\nAll provinces will enforce a complete ban on private vehicles and public transporters having tinted windows on their vehicles, except for government VIP, security vehicles and all those manufactured with standard shades of tint, Muguti had announced.\n\nThis follows an increase in crime in transportation vehicles, especially Mushikashika, armed robbers and other criminals and also the recent rape of a grade seven girl in an omnibus.\n\nSo we will not be allowing any commuter omnibus to have tint.\n\nMuguti had gone to the extent of ordering police officers to rip it off dissenting drivers vehicles or have them impounded for failure to comply.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/15192357/George-Charamba.jpeg",
            "description": "<p>By Leopold Munhende PRESIDENTIAL Spokesperson George Charamba has dismissed Provincial Affairs and Devolution Secretary Tafadzwa Muguti’s decision to ban the tinting of windows on private and public vehicles. The ban, announced on Tuesday this week, was said to be a response to drug use and transportation by vehicles that had tinted windows and also a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/miscommunication-from-unauthorised-office-presidential-spokesperson-dismisses-ban-on-tinted-vehicle-windows/\">Miscommunication from unauthorised office! – presidential spokesperson dismisses ban on tinted vehicle windows</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "03 Sep 2025"
        },
        {
            "title": "NMBZ fees and commission income almost doubles",
            "url": "https://www.newzimbabwe.com/nmbz-fees-and-commission-income-almost-doubles/",
            "content": "By Alois Vinga\n\nLISTED financial services provider, NMBZs fees and commission income reached ZWG623, 3 million during the first half of 2025, almost double the amount generated in the same period last year.\n\nIn banking terms, fee and commission income refers to the revenue a bank generates from charging for its products and services, rather than from lending interest. This income stream is generated by fees for transactions such as withdrawals, transfers, currency exchanges, and card issuance, as well as commissions.\n\nPresenting the groups half-years performance this week, NMBZ CEO, Gerald Gore, said a total ZWG623,3 million was generated compared to ZWG383,6 million generated last year under the same revenue category.\n\nThis indicator confirms the earlier complaints by the banking public on the need for monetary authorities to prevent banks from charging high commission fees.\n\nHigh charges have been singled out for discouraging Zimbabweans from using formal banking services in favour of risky informal systems.\n\nA recent study by the National Economic Competitiveness Forum (NECF) also revealed that the cost of banking in Zimbabwe is a bit on the high side when compared to best practices.\n\nMeanwhile, during the period under review,the group operated profitably for the period under review, generating a comprehensive income of ZWG 98.9 million for the period compared to ZWG56,1 million for the prior comparative period.\n\nRestructuring expenses of ZWG138,5 million were incurred during the year, primarily related to a change in strategic focus towards a digital and more efficient operation. These costs include severance payments and other termination costs.\n\nTotal assets closed the period at ZWG7.8 billion, up 6% from ZWG7.4 billion as at 31 December 2024. The growth was largely funded by an increase in customer deposits. Loans and advances stood at ZWG3.4 billion as at 30 June 2025, up from ZWG2.9 billion as at 31 December 2024.\n\nThe growth was driven by the deployment of foreign lines of credit, largely to exporting companies. The groups focus remains on maintaining a robust credit risk management framework to ensure a sustainable quality portfolio.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/10024509/NMB-Bank-Zimbabwe.png",
            "description": "<p>By Alois Vinga LISTED financial services provider, NMBZ’s fees and commission income reached ZWG623, 3 million during the first half of 2025, almost double the amount generated in the same period last year. In banking terms, fee and commission income refers to the revenue a bank generates from charging for its products and services, rather</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nmbz-fees-and-commission-income-almost-doubles/\">NMBZ fees and commission income almost doubles</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "03 Sep 2025"
        },
        {
            "title": "Bombing of Job Sikhala’s house raises fears of renewed attacks targeting Zanu PF critics",
            "url": "https://www.newzimbabwe.com/bombing-of-job-sikhalas-house-raises-fears-of-renewed-attacks-targeting-zanu-pf-critics/",
            "content": "By Staff Reporter\n\nHUMAN rights defenders have criticised the recent bombing of opposition leader Job Sikhalas Chitungwiza home, amid fears of a renewed wave of raids on properties linked to exiled Zimbabweans.\n\nThe alleged bombing of Sikhalas house while he was away in South Africa raises the spectre of a fresh campaign of political persecution, says human rights activist Munacho Humbasha.\n\nHe says the attack on Sikhalas house is a chilling message to critics of Zanu PF, both at home and abroad.\n\nSikhala, a former legislator and long-time government critic, has been frequenting South Africa for medical and political engagements.\n\nHumbasha told NewZimbabwe.com that Zanu PF functionaries and State security agents have openly declared war on activists in the diaspora, with families back home being deliberately targeted.\n\nThose with houses visited in the widening campaign and searches include that of Petty Ziramba, Panganayi Mauzinyu, Ralph Dube, Fransisca Chiduku, and Shepherd Yuda, said Humbasha.\n\nIn Mabvuku, unknown men believed to be State agents raided the home of the late opposition activist Tonderai Ndira. The assailants took household property and left the house empty, promising to return and destroy their livelihoods. The family is still in shock.\n\nIn Harare, suspected operatives broke into Blessing Makeyis house and again into his family home, allegedly searching for incriminating material. Makevi has been active in diaspora protests against President Emmerson Mnangagwas government, Humbasha told NewZimbabwe.com in an interview.\n\nAlso, another dissenter, Ralph Dubes family, is living in uncertainty after receiving threatening messages, says Humbasha.\n\nBack home, he further claimed, several homes in Seke, Chitungwiza, having been visited by suspicious individuals in recent days, thereby sparking fears in the community.\n\nDespite repeated reports of break-ins and intimidation, police have not arrested anyone in connection with the incidents. Efforts to get a comment from police national spokesman, Commissioner Paul Nyathi, were fruitless by the time of publishing.\n\nVictims and their families say the inaction points to the States complicity.\n\nThis is meant to punish those of us who are in the UK and elsewhere. Our families are being harassed everyday because we speak out, said UK-based activist, Melody Magejo, who spoke to NewZimbabwe.com in a telephone interview.\n\nA human rights lawyer, who preferred anonymity, said as Mnangagwa gravitates towards entrenching his rule through his 2030 agenda, the political environment is set to worsen.\n\nThe use of Patriotic Act and Cyber Security Act 2023 will lead to many arrests of those who are actively participating in campaigns on social media.\n\nIt is without a doubt that Mnangagwas government does not want the outside world to know what is happening in the country, said the lawyer.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/02001450/Job-Sikhala.png",
            "description": "<p>By Staff Reporter HUMAN rights defenders have criticised the recent bombing of opposition leader Job Sikhala’s Chitungwiza home, amid fears of a renewed wave of raids on properties linked to exiled Zimbabweans. The alleged bombing of Sikhala’s house while he was away in South Africa raises the spectre of a fresh campaign of political persecution,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/bombing-of-job-sikhalas-house-raises-fears-of-renewed-attacks-targeting-zanu-pf-critics/\">Bombing of Job Sikhala’s house raises fears of renewed attacks targeting Zanu PF critics</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "03 Sep 2025"
        }
    ]
}