{
    "news": [
        {
            "title": "UNDP, government launch innovative zero-emission cooling system to tackle climate impacts",
            "url": "https://www.newzimbabwe.com/undp-government-launch-innovative-zero-emission-cooling-system-to-tackle-climate-impacts/",
            "content": "UNDP\n\nThe United Nations Development Programme (UNDP), in partnership with the Ministry of Environment, Climate and Wildlife; Ministry of Power and Energy Development; and Scientific and Industrial Research and Development Centre (SIRDC) today launched theLow Temperature Evaporative Cooling System (LTEIHT-AC) an innovative, zero-emission cooling technology designed to provide sustainable and affordable temperature control in Zimbabwes increasingly warming climate.\n\nDeveloped byPhokeng Global Health and Environmental Solutions, the Evaporative Cooling System leverages atmospheric enthalpy and water evaporation to produce cooling effects without relying on electricity or ozone-depleting refrigerants. Built using locally available materials, the system is both environmentally friendly and economically accessible, offering a scalable solution to Zimbabwes energy and climate resilience challenges.\n\nThis initiative represents a practical example of climate innovation in Zimbabwe  a solution that not only reduces greenhouse gas emissions but also empowers communities through local manufacturing and skills development, saidDr. Ayodele Odusola, UNDP Resident Representative. By investing in sustainable technologies like this, we are helping to ensure that no one is left behind in the transition to a greener, more resilient future.\n\nKey Highlights of the Event:\n\nTheEvaporative Cooling System Inception Meeting, held at UNDPs Harare offices, marked a significant milestone in Zimbabwes transition toward climate-resilient and energy-efficient technologies. The event brought together key stakeholders from government, academia, the private sector, and development partners to discuss the systems design, applications, and roadmap for national deployment.\n\nA highlight of the event was theformal introduction of the prototypefrom Phokeng Global Health and Environmental Solutions to the Scientific and Industrial Research and Development Centre (SIRDC), symbolizing the transition from design to institutional adoption and field testing. The technology will undergo pilot testing and performance monitoring in selected communities, with results informing wider national rollout.\n\nThe system directly supports the National Climate Change Policy (2017), the Energy Efficiency Policy (2024), and Zimbabwes Nationally Determined Contributions (NDC 3.0). It also contributes to the achievement of Sustainable Development Goals (SDGs) 7, 9, and 13, advancing access to clean energy, innovation, and climate action.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/07072932/undp-scaled.jpg",
            "description": "<p>UNDP The United Nations Development Programme (UNDP), in partnership with the Ministry of Environment, Climate and Wildlife; Ministry of Power and Energy Development; and Scientific and Industrial Research and Development Centre (SIRDC) today launched the Low Temperature Evaporative Cooling System (LTEIHT-AC) — an innovative, zero-emission cooling technology designed to provide sustainable and affordable temperature control in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/undp-government-launch-innovative-zero-emission-cooling-system-to-tackle-climate-impacts/\">UNDP, government launch innovative zero-emission cooling system to tackle climate impacts</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:27",
            "date": "07 Oct 2025"
        },
        {
            "title": "Trump says chance of Gaza peace deal ‘really good’ as talks to continue in Egypt",
            "url": "https://www.newzimbabwe.com/trump-says-chance-of-gaza-peace-deal-really-good-as-talks-to-continue-in-egypt/",
            "content": "BBC\n\nIndirect talks aimed at reaching a final agreement on a US peace plan to end the war in Gaza are set to continue on Tuesday in the Egyptian city of Sharm El-Sheikh.\n\nPalestinian and Egyptian officials have told the BBC that the sessions are focused on creating the field conditions for a possible exchange that would see the release of all Israeli hostages in return for a number of Palestinian prisoners.\n\nIsraels prime minister said on Saturday that he hoped to announce the release of hostages in the coming days.\n\nAs the officials met on Monday, US President Donald Trump told reporters at the White House: We have a really good chance of making a deal, and itll be a lasting deal.\n\nHamas has said it agrees to the peace plan proposals in part, but has not responded to several key demands  including its disarmament andnot having any future role in the governance of Gaza.\n\nA senior Israeli security source said the talks initially would focus only on the release of hostages and give Hamas a few days to complete that phase.\n\nThe second day of thetalks, which will see Egyptian and Qatari officials holding shuttle meetings with delegations from both Israel and Hamas separately, will be taking place on the second anniversary of the Hamas-led attack on southern Israel on 7 October 2023, in which about 1,200 people were killed and 251 others were taken hostage.\n\nThe Israeli military launched a campaign in Gaza in response. Since then, 67,160 have been killed by Israeli military operations in Gaza, including 18,000 children, according to the territorys Hamas-run health ministry.\n\nIn a statement commemorating the 7 October anniversary, United Nations Secretary-General Antonio Guterres said Trumps plan presents an opportunity that must be seized to bring this tragic conflict to an end.\n\nUK Prime Minister Sir Keir Starmer reiterated his support for the plan in his statement commemorating the anniversary, saying: We welcome the US initiative towards peace in the Middle East, and this government will do everything in our power to bring about the day where every child of Israel can live peacefully, alongside their Palestinian neighbours, in safety and security.\n\nThese discussions are expected to be among the most consequential since the start of the war and could determine whether a path toward ending the conflict is finally within reach.\n\nUS special envoy Steve Witkoff, Trumps son-in-law Jared Kushner and Qatari foreign minister Sheikh Mohammed bin Abdulrahman Al Thani are among those attending.\n\nTrump, writing on social media, has urged everyone involved in efforts to end the Gaza war to move fast and says he has been told the first phase of the peace plan  which includes the hostage release  should be completed this week.\n\nOn Monday, he told reporters at the White House that Hamas has been agreeing to things that are very important.\n\nI really think were going to have a deal, he added.\n\nA Palestinian official close to the negotiations told the Reuters news agency that the first session ended late Monday evening, and more talks were due to take place on Tuesday.\n\nState-affiliated Al-Qahera News also said talks would continue on Tuesday  and that the first day had ended amid a positive atmosphere.\n\nThe 20-point plan, which has been agreed upon by Trump and Israeli Prime Minister Benjamin Netanyahu, proposes an immediate end to fighting and the release of 48 hostages, only 20 of whom are thought to be alive, in exchange for hundreds of detained Gazans.\n\nThe plan stipulates that once both sides agree to the proposal full aid will be immediately sent into the Gaza Strip.\n\nIt also states that Hamas would have no role in governing Gaza, and it leaves the door open for an eventual Palestinian state.\n\nHowever, after the plan was announced publicly a week ago, Netanyahu reinstated his longstanding opposition to a Palestinian state, saying in a video statement: Its not written in the agreement. We said we would strongly oppose a Palestinian state.\n\nOn Friday,Hamas responded to the proposalin a statement, in which the groupagreed to release all Israeli prisoners, both living and dead, according to the exchange formula contained in Trumps proposal  if the proper conditions for the exchanges are met.\n\nIt did not specifically mention or accept Trumps 20-point plan but said it renews its agreement to hand over the administration of the Gaza Strip to a Palestinian body of independents (technocrats), based on Palestinian national consensus and Arab and Islamic support.\n\nThe statement made no mention of the demands that Hamas agree to its disarmament and to playing no further role in the governance of Gaza.\n\nIt added that the part of the proposals dealing with the future of Gaza and the rights of Palestinian people was still being discussed within a national framework, of which it said Hamas will be a part.\n\nMany Palestinians described Hamas response to the peace plan as unexpected, after days of indications that the group was preparing to reject or at least heavily condition its acceptance of Trumps peace plan proposal.\n\nInstead, Hamas refrained from including its traditional red lines in the official statement, a move many interpret as a sign of external pressure.\n\nEuropean and Middle Eastern leaders have welcomed the proposal. The Palestinian Authority (PA), which governs parts of the Israeli-occupied West Bank, has called the US presidents efforts sincere and determined.\n\nIran  which has been one of Hamass main sponsors for many years  has also now signalled its support for Trumps Gaza peace plan.\n\nIsraeli bombardment continued in several parts of the Gaza Strip on Monday ahead of the talks beginning.\n\nIsrael is carrying out an offensive in the city, which it has said is aimed at securing the release of the remaining hostages.\n\nMahmoud Basal, spokesman for Gazas Hamas-run civil defence, told the BBC that no aid trucks have been allowed into Gaza City since the offensive began four weeks ago.\n\nThere are still bodies we cannot retrieve from areas under Israeli control, he said.\n\nHundreds of thousands of Gaza City residents have been forced to flee after the Israeli military ordered evacuations to a designated humanitarian area in the south, but hundreds of thousands more are believed to have remained.\n\nIsraels defence minister has warned that those who stay during the offensive would be terrorists and supporters of terror.\n\nIn the last 24 hours, 21 Palestinians have been killed in Gaza and a further 96 injured, the Hamas-run health ministry said in its latest update.\n\nInternational journalists have been banned by Israel from entering the Gaza Strip independently since the start of the war, making verifying claims from both sides difficult.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/07055500/gaza-city.webp",
            "description": "<p>BBC Indirect talks aimed at reaching a final agreement on a US peace plan to end the war in Gaza are set to continue on Tuesday in the Egyptian city of Sharm El-Sheikh. Palestinian and Egyptian officials have told the BBC that the sessions are focused on “creating the field conditions” for a possible exchange</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/trump-says-chance-of-gaza-peace-deal-really-good-as-talks-to-continue-in-egypt/\">Trump says chance of Gaza peace deal ‘really good’ as talks to continue in Egypt</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:27",
            "date": "07 Oct 2025"
        },
        {
            "title": "Smartphones become tools of resistance in queer film project",
            "url": "https://www.newzimbabwe.com/smartphones-become-tools-of-resistance-in-queer-film-project/",
            "content": "Beyond the Margins\n\nIt took four years, from conception to completion, to put together the anthology film,Map Your Love. Shot entirely on smartphones, by activists in countries such as Burkina Faso, Tunisia, Tanzania, Zimbabwe, Ghana, Ethiopia, Kenya, Jamaica, Peru and Canada, the four films that make up the anthology showcase deeply personal stories that explore the complexities of queer love, identity, and resilience in nations where homosexuality is criminalised.\n\nIn 2024, screenings of the anthology were held in various countries across Africa.\n\nKarin Haz is the founder and director of75 Shots, the Canada-based organisation which spearheaded the project. Haz says: Every screening in Africa was conducted underground, ranging from private gatherings in homes where traditional coffee ceremonies and food were shared, to full-scale festivals at undisclosed locations for safety reasons. Some were also held in community centres run by feminist activists. Each screening was unique, courageous, and extraordinary.\n\nFor Beyond the Margins,Carl Collisonspoke to three queer rights activists  Ghanas Prince Frimpong, TanzaniasMwamba T Nyanda and Zimbabwe-based Kudzai Kay-Dee  all of whomparticipated in the creation of this anthology and also put together a screening of the four-part film in their respective countries.\n\nIn this conversation, the activists discuss what drew them to film as an advocacy tool, how the medium is shaping their activism, and how, especially in repressive contexts, there is great power in telling ones story.\n\nKayuure (Nameless): The short documentary, Kayuure (Nameless), looks into the life of a transgender man from Burkina Faso, offering a glimpse into their journey of resilience, love, and self-discovery. Image: Supplied\n\nCarl Collison (CC):So, tell us about the screenings. How did it go? What stood out for you?Kudzai Kay-Dee (KK):So, I engaged an LBQ organisation. They were having a meetingSo, I took that opportunity to go there and screen our films. What stood out for me the most in terms of the people who were watching is that they realised that were using really simple gadgets to come up with something so beautiful; something so movingWe also had conversations around privilege and how we can be more supportive in our communities; how we can support each other, encourage each other to, you know, live our lives to the fullest.\n\nPrince Frimpong (PF):I collaborated with a youth-led organisation, called Let It Shine, in Lagos, and we did the screening together. They were doing a couple of activities for Pride in LagosSo, yeah, we did a screening, and (about 25) LGBTQI youth (attended). It was very amazing, you know, to witness this community coming together to watchMap Your Love. How it resonated with them was powerful to watch. And I think what really struck me was how people decode theMap Your Lovefilm in their own ways; in their own understandingIt felt so surreal. And it felt like, you know, people are really getting into the film that weve made. People are really, you know, resonating with it in their own waysand how they see themselves in the film that we made.\n\nAnd they were surprised that the film was even made (on) a mobile phone. You know, when the film started, I told them, Dont have any expectations. It is not the traditional way of making films. Just watch with an open-mindedness, and just like, you know, let yourself flow in what youre about to watch. They did, and they were stunned.\n\nIn Wildly Authentic, a young soul raised by two loving mothers, ponders the enigma of belonging. Image: Supplied\n\nMwamba T Nyanda (MN):The movie screening we did was done on 30thof June. We wanted to share these narrative stories of our lives on the African continent. And also to tell people that it is possible to narrate a story through the use of a phone, for example an iPhone or Samsung. And that, as an activist, a smartphone can be a tool for advocacy. Luckily, the turnout was good. A lot of members showed up (and) a lot were intrigued and also interested in learning how to create movies through mobile phones. Because most of the queer people in our society are very shy, but they are willing to tell the stories (from)( behind the camera. So, that was a good take-away for me.\n\nCC:None of you are filmmakers, right? All of you are queer activists in your respective countries. What made you decide to use film as a tool for your advocacy?\n\nKK:I think the first thing is accessibility So, (with traditional filmmaking,) by the time you get to the camera, and you know, all that editing, it kind of takes away from the rawness of the story. So, the phone is the one thing thats in your pocket that you can randomly take out and start creating something.\n\nPF:Mobile filmmaking is a powerful tool. And in my advocacy work, I feel like it is a way to establish the visibility of the LGBT community in Ghana and also across Africa. Ive always been someone who loves employing creative elements when it comes tojust putting our work online and utilising digital tools to drive positive change. So, to me, using mobile filmmaking or even arriving to doMap Your Loveits a way for me to, you know, tell stories that have been overlooked and tell it my own way. And utilise these mechanisms, or these tools, to tell these stories with no restrictions, with no boundaries and tell it unapologetically.\n\nMN:Ive always been interested in knowing about films and how to create (them), because I knew that at one point in my life this could be a good tool to sustain myself. I am also very interested in telling our stories. Because, as Africans, we have a lot of untold stories which we hide under the rugs due to the country contexts. I think narrating stories through film is a great way to reach people. So, I thought that being equipped myself with film skills can also help me to run my advocacy well.\n\nCC:How has this experience with film shaped your activism?\n\nInThe Sourcea trans man in Tanzania spends a day at the beach with his Rastafarian father, who shares life lessons with him and teaches him to swim. Image: Supplied\n\nMN:Filming has definitely shaped my activism because, number one, I have evolved from the strategies that I (employ) in the organisation. Because for many years we have been giving people capacity. We have been providing emergency support. We have been providing entrepreneurship skills. But we never have dealt with art or arti-vism; using art  music, dancing and filming  in advocating for our rights, visibility and freedom. So, this category of art, which is filming, has given me power. To me, its like a superpower because I get to narrate the stories, and create them however I want (in order) to pass on messages to the community at large.\n\nKK:I think, going forward, Ill definitely continue to use film and maybe not just film, but even pictures (created with) my mobile phone. Because its the one thing that is always in my pocket  other than my wallet. And I can always use that to tell different stories. Like you were saying, these are stories that are not told. These are stories that were telling in repressive countries. We dont stop telling the stories because of the nature of the environment. (So,) this is actually a very innovative and creative way to continue telling these stories in otherwise unsafe environment(s).\n\nCC:And for you, Prince?\n\nPF:You know, as part of my advocacy, Im always preaching about queer joy, queer liberation, queer freedom, and living our authentic self, unapologetically. You know, we are living in a homophobic country. And that is how its going to be. I feel like how does it all end when we are being killed and discriminated (against)? But when we take ownership of our own stories and tell them authentically, I feel like that is a way for us to mobilise more support networks, gain more resources, and invite people to the table to (discuss) critical issues that we face as a queer community. And these (things) can be done through filmmaking. So, it has really shaped my activism in so many ways. I mean, you know, its a new wave of activism. Its a new way of telling queer stories and giving us that kind of visibility or recognition that we need as a queer community. So, for me, it is something that Im always going to adopt in my advocacy: continue telling queer stories, continue telling Ghanaian queer stories and using these tools to Africanise and reshape our narrative. Also, as a side, teaching people the ways of using mobile (phones) to tell their own stories. And, you know, keep the movement going, and create positive change in this way.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/07055151/prince-fimpong.png",
            "description": "<p>Beyond the Margins It took four years, from conception to completion, to put together the anthology film, Map Your Love. Shot entirely on smartphones, by activists in countries such as Burkina Faso, Tunisia, Tanzania, Zimbabwe, Ghana, Ethiopia, Kenya, Jamaica, Peru and Canada, the four films that make up the anthology “showcase deeply personal stories that explore</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/smartphones-become-tools-of-resistance-in-queer-film-project/\">Smartphones become tools of resistance in queer film project</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:27",
            "date": "07 Oct 2025"
        }
    ]
}