{
    "news": [
        {
            "title": "Zimbabwe police officers banned from betting shops while in uniform",
            "url": "https://www.newzimbabwe.com/zimbabwe-police-officers-banned-from-betting-shops-while-in-uniform/",
            "content": "Gambling Insider\n\nZimbabwes police force has introduced a ban on officers entering betting shops or gambling while in uniform, due to reputational risks.\n\nThe announcement was made by National Police spokesperson Commissioner Paul Nyathi at the H-Metro National Forum On Responsible Betting, held in Harare over the weekend.\n\nThe forum, held in partnership with the Lotteries and Gaming Board, brought together government officials, regulators and industry stakeholders to discuss the rapid expansion of betting in Zimbabwe.\n\nThe discussion also touched on criminal cases linked to gambling misuse, including the conviction of a former manager who stole over $3,000 from his employer to fund a gambling addiction.\n\nHowever, betting industry representatives questioned the attribution of blame, arguing that some individuals may use gambling as a scapegoat for unrelated crimes.\n\nCommissioner Nyathi addressed growing concerns over law enforcements visibility in gambling environments, particularly after several viral images showed uniformed officers allegedly betting in shops, having said, This does not give a good picture of the countrys police force.\n\nThe ban is part of a wider push to strengthen regulation and safeguard the industrys growth, particularly as crash games continue to gain popularity across the country.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/15015112/Police-Gambling-Betting-jpg.webp",
            "description": "<p>Gambling Insider Zimbabwe’s police force has introduced a ban on officers entering betting shops or gambling while in uniform, due to reputational risks. The announcement was made by National Police spokesperson Commissioner Paul Nyathi at the H-Metro National Forum On Responsible Betting, held in Harare over the weekend. The forum, held in partnership with the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-police-officers-banned-from-betting-shops-while-in-uniform/\">Zimbabwe police officers banned from betting shops while in uniform</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:46",
            "date": "15 Jul 2025"
        },
        {
            "title": "Industrial supplies dominate Zimbabwe’s import list",
            "url": "https://www.newzimbabwe.com/industrial-supplies-dominate-zimbabwes-import-list/",
            "content": "By Alois Vinga\n\nINDUSTRIAL supplies dominated Zimbabwes import list in the latest reporting period, the Reserve Bank of Zimbabwe (RBZ) has revealed.\n\nThe RBZ monthly economic review for April 2025 shows that US$313 million was spent on industrial supplies, with US$154 million being spent on fuels and lubricants. Capital goods chewed up US$128,1 million and Transport and Equipment US$73,7 million.\n\nOut of the US$818,3 million spent during the period, just US$98,3 million and US$44,5 million was spent on food and consumer goods.\n\nZimbabwe is currently pursuing an industrial turnaround strategy with the objective to align with Vision 2030 as well as minimise the huge foreign exchange expenditure on the importation of simple consumables.\n\nThe countrys imports were mainly sourced from South Africa (37.1%), China (14.5%), Bahrain (10.4%), the Bahamas (7.4%), and Mozambique (3.8%). The remainder of the imports came from various other markets.\n\nDuring April 2025, the countrys trade deficit narrowed to US$118.7 million, from US$235.2 million recorded in the previous month. Relative to April 2024, the trade deficit narrowed from US$206.1 million to US$118.7 million in the reporting month.\n\nThe countrys merchandise exports increased by 13.6% to US$662.6 million, from the previous months outturn of US$583.1 million. The increase was largely underpinned by growth in export earnings from gold, platinum group of metals (PGMs) and diamond.\n\nOn a year-on-year basis, exports were 29.0% higher compared to US$513.5 million recorded in April 2024.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/15010733/pump-and-steel-supplies-zimbabwe-0009a-scaled-1.jpg",
            "description": "<p>By Alois Vinga INDUSTRIAL supplies dominated Zimbabwe’s import list in the latest reporting period, the Reserve Bank of Zimbabwe (RBZ) has revealed. The RBZ monthly economic review for April 2025 shows that US$313 million was spent on industrial supplies, with US$154 million being spent on fuels and lubricants. Capital goods chewed up US$128,1 million and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/industrial-supplies-dominate-zimbabwes-import-list/\">Industrial supplies dominate Zimbabwe’s import list</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:46",
            "date": "15 Jul 2025"
        },
        {
            "title": "DRC nationals in court for smuggling skin bleaching creams into Zimbabwe",
            "url": "https://www.newzimbabwe.com/drc-nationals-in-court-for-smuggling-skin-bleaching-creams-into-zimbabwe/",
            "content": "By Staff Reporter\n\nTWO men from the Democratic Republic of Congo (DRC) have appeared in court facing a charge of smuggling skin bleaching creams into Zimbabwe.\n\nAccused persons, Aurora Mujinga (35) and Lolo Kapamba (45), appeared before the Chinhoyi Magistrates Court, where they were convicted of the crime.\n\nThe pair was sentenced to pay a US$200 fine each or in default, spend the next four months in jail. In addition to the sentence, the contraband was forfeited to the State.\n\nThe prosecutor told the court that on June 29, 2025, at Chirundu One-Stop Border Post, the offenders unlawfully imported a significant quantity of various goods from Zambia into the country without the required permits.\n\nCourt heard that at around 6pm on the same day, detectives from the Criminal Investigations Department (CID) received a tip-off that there were smuggled goods aboard a CAG bus parked at the Chirundu bus terminus.\n\nThe cops proceeded to the rank and directed the bus to the Zimbabwe Revenue Authority (ZIMRA) Chirundu yard for a search.\n\nDuring the search, three bags were found containing a variety of items, including bleaching products namely CT Plus, Lemon Plus, Dema Clair, Mark Clear, Extra Clear, Infirm Clear, Princes Clear, and Coco Pulp, which are cosmetic or medicinal creams/liquids.\n\nThe duo claimed to have purchased the goods in Zambia but could not produce any customs documentation to prove declaration to ZIMRA customs leading to their arrest. The following day, the recovered goods were seized by authorities.\n\nIn passing sentence, the magistrate noted that the defendants had shown disregard for the law and the potential harm caused by the products. However, considering they were first offenders and had pleaded guilty, the court decided to impose a fine.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/15011638/Skin-lightening-creams.jpeg",
            "description": "<p>By Staff Reporter TWO men from the Democratic Republic of Congo (DRC) have appeared in court facing a charge of smuggling skin bleaching creams into Zimbabwe. Accused persons, Aurora Mujinga (35) and Lolo Kapamba (45), appeared before the Chinhoyi Magistrates’ Court, where they were convicted of the crime. The pair was sentenced to pay a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/drc-nationals-in-court-for-smuggling-skin-bleaching-creams-into-zimbabwe/\">DRC nationals in court for smuggling skin bleaching creams into Zimbabwe </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:46",
            "date": "15 Jul 2025"
        },
        {
            "title": "10 Zimbabweans making waves in Australia",
            "url": "https://www.newzimbabwe.com/10-zimbabweans-making-waves-in-australia/",
            "content": "By Darlington Gatsi\n\nZimbabwes global diaspora continues to be a powerful force shaping narratives, industries, and communities far beyond its borders. Among the most vibrant hubs is Australia  a land of opportunity where many Zimbabweans have not only settled but thrived. From the bustling cities of Sydney and Melbourne to the academic halls of Brisbane and the cultural melting pot of Perth, Zimbabweans have made their mark with tenacity, innovation, and a deep sense of purpose.\n\nNewZimbabwe.comshines a spotlight on 10 influential Zimbabweans based in Australia who are excelling in their respective fields and contributing meaningfully to both their host country and their motherland. These individuals embody the spirit of resilience and excellence. They are entrepreneurs, health professionals, community leaders, creatives, academics, and changemakers whose stories are rooted in hard work, cultural pride, and a desire to make a lasting impact.\n\nMore than a celebration of individual success, this article serves as a reminder of the potential of diaspora communities to uplift nations, drive change, and build bridges across cultures. It also affirms that Zimbabwes greatest export remains its people  whose talents and contributions extend well beyond geographical borders.\n\nTkayMaidza\n\nTkayMaidza\n\nTkay Maidzais a Zimbabwean-Australian musician who set aside her love for tennis in favour of studio time. Since then, she has made a name for herself in the music scene. Maidza has released two albums, Tkay (2016) and Sweet Justice (2023). Last year, she was named in the Forbes 30 Under 30 Australia list.\n\nMelody mbuya vaRaphy Magengezha\n\nMelody mbuya vaRaphy Magengezha\n\nMagengezha is a mental wellness advocate who leverages her academic background as a DBT (Dialectical Behaviour Therapy) therapist and holds certifications in Trauma Therapy and Solution-Based Therapy from Australia. Magengezha uses online platforms to champion mental health awareness in Australia.\n\nKnown as Mbuya vaRaphy, she has over 20 years of experience in therapy, coaching, and community-based mental wellness support. She is the CEO of Rising Serenity Coaching and Therapy Services, an organisation that focuses on mental and emotional resilience among children, youth, young adults, and families.\n\nMagengezha has written extensively on mental health, as evidenced by her two books: Forgiveness is Key to Freedom and Stagnant or Soaring: Impact of Your Inner Circle.\n\nRecently, Magengezha was honoured with the Influencer of the Year Award (Fluxx Awards, Education Hong Kong) and Mental Health Care Expert of the Year Award (Fluxx Awards, Health and Wellness Hong Kong). These follow the honours she received in 2023: Community Leader Award (Australian Ladies in Business Initiative) and Zimbabwe Achievers Award  Community Champion of the Year.\n\nTatendaTatsNyaruwe\n\nTatendaTatsNyaruwe\n\nTatsis an Australia-based Zimbabwean content creator, also known as ManLikeTats on social media. Having left Zimbabwe at a young age for Australia, Tatshas been using digital media to shine a spotlight on his roots. He advocates for Zimbabweans abroad to stay connected with their culture. He recently won Content Creator of the Year at the Amari Gala.\n\nRutendo Mupedzi\n\nRue Mupedzi\n\nMupedzi rose to prominence after appearing in the 15th season of MasterChef Australia. An oral health therapist based in Western Australia with a passion for culinary arts, she made history as the first Zimbabwean to reach the MasterChef Australia top 10. She has also launched her sauce brand, BarbeRue, sold in Australian outlets.\n\nAudius Mtawarira\n\nAudius Mtawarira\n\nThe Zimbabwean music legend has not been off the radar, contrary to some notions. Mtawarira recently released his song Trigger, which has reminded many of the good old urban grooves era. Mtawarira has been releasing music despite last releasing an album  Seeds of Change  two years ago. Last year, he was honoured with a Lifetime Achievement Award at the Zimbabwe Achievers Awards Australia.\n\nJoyce Takaidza\n\nJoyce Takaidza\n\nThe Zimbabwe Netball team player has been a mainstay in the Gems squad. Takaidza played a crucial role in the past World Cups that Zimbabwe has featured in, including Liverpool (2019) and Cape Town (2023). In 2017, she won three awards at the Zimbabwe Achievers Awards Australia (ZAA)  Sport Personality of the Year, Peoples Choice, and Chairmans Award.\n\nLucky Ngoshi\n\nLucky Ngoshi\n\nNgoshi is an entrepreneur who began an online grocery service and has since diversified into cakes, pharmaceuticals, solar installations, carpentry, and building supplies, creating a One-Stop Shop for Zimbabweans in the diaspora. She also runs an online podcast, Keeping in Touch with Lucky.\n\nNgoshi has also established a Non-Profit Organisation (NGO), Ladies of Zimbabwe in Australia (LOZA), where close to 6,000 Zimbabwean women (living in Australia) are empowered through community engagement and professional development. Last year, she was honoured at the Zimbabwe Achievers Awards (ZAA) with a Peoples Choice Award.\n\nAnesu Mushangwe\n\nAnesu Mushangwe\n\nThe Zimbabwe Womens Cricket player has been making waves in local teams in Australia. The Adelaide Strikers Women player has become an integral part of the team. Last season, she took 33 wickets in 21 games and scored 99 runs in the same number of matches.\n\nRavai Makwara\n\nRavai Makwara\n\nMakwara, through her bold venture Madhuve Catering, has been serving Zimbabwean cuisine in Melbourne. This has made several Zimbabweans fall in love with her restaurant, which offers many nostalgic dishes. Ravai is a strong advocate for cultural awareness and inclusivity, using food as a bridge to connect communities.\n\nTendayi Ganga\n\nTendayi Ganga\n\nGanga has established herself as a champion of womens rights and social justice through her community work in Australia. With a background in medicine as a registered nurse and pastoral work, she periodically uses her YouTube channel to advocate for womens rights. In 2019, she was honoured with a double recognition at the Zimbabwean Achievers Awards (ZAA) Australia.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/14165120/rutendo-mupedzi.webp",
            "description": "<p>By Darlington Gatsi Zimbabwe’s global diaspora continues to be a powerful force shaping narratives, industries, and communities far beyond its borders. Among the most vibrant hubs is Australia – a land of opportunity where many Zimbabweans have not only settled but thrived. From the bustling cities of Sydney and Melbourne to the academic halls of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/10-zimbabweans-making-waves-in-australia/\">10 Zimbabweans making waves in Australia</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:46",
            "date": "15 Jul 2025"
        }
    ]
}