{
    "news": [
        {
            "title": "US orders non-emergency staff to leave South Sudan as tensions rise",
            "url": "https://www.newzimbabwe.com/us-orders-non-emergency-staff-to-leave-south-sudan-as-tensions-rise/",
            "content": "BBC\n\nThe United States has ordered all its non-emergency staff in South Sudan to leave, amid rising tensions in the country.\n\nFighting in recent days has threatened an already fragile peace deal between President Salva Kiir and Vice-President Riek Machar.\n\nThe two leaders signed a peace agreement in 2018 to end a five-year civil war that killed hundreds of thousands of people, but their relationship has remained fraught.\n\nOn Sunday, the US State Department said that fighting was ongoing in South Sudan between various political and ethnic groups and that weapons are readily available to the population.\n\nDue to the risks in the country, on March 08, 2025, the Department of State ordered the departure of non-emergency US government employees, it said.\n\nThe UN human rights commission for South Sudan on Saturday warned of an alarming regression that threatened to undo years of progress towards peace.\n\nPresident Kiir has called for calm and made an assurance that the country would not return to war.\n\nIn an escalation of the tensions, a UN helicopter that had been evacuating members of the national army was shot at on Friday, killing several people, including one crew member.\n\nEarlier in the week, the deputy chief of the army and two ministers allied to Machar were arrested by security forces, which an opposition spokesman termed a grave violation of the peace deal.\n\nThe arrests of the Machar-allied officials followed clashes in the countrys Upper Nile state between government forces and a militia known as the White Army, which had fought alongside Machar during the civil war.\n\nSouth Sudan, the worlds newest nation, gained independence in 2011 after seceding from Sudan.\n\nBut just two years later, following a rift between Kiir and Machar, the country descended into a civil war, in which more than 400,000 people were killed.\n\nThe 2018 power-sharing agreement between the two stopped the fighting, but key elements of the deal have not been implemented  including a new constitution, an election, and the reunification of armed groups into a single army.\n\nSporadic violence between ethnic or local groups has continued in parts of the country.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/26074345/Sudan-War.png",
            "description": "<p>BBC The United States has ordered all its non-emergency staff in South Sudan to leave, amid rising tensions in the country. Fighting in recent days has threatened an already fragile peace deal between President Salva Kiir and Vice-President Riek Machar. The two leaders signed a peace agreement in 2018 to end a five-year civil war</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-orders-non-emergency-staff-to-leave-south-sudan-as-tensions-rise/\">US orders non-emergency staff to leave South Sudan as tensions rise</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "11 Mar 2025"
        },
        {
            "title": "I will not subscribe to mining in national parks – Mudenda slams Sunny Yi Feng’s application to prospect for coal in Hwange National Park",
            "url": "https://www.newzimbabwe.com/i-will-not-subscribe-to-mining-in-national-parks-mudenda-slams-sunny-yi-fengs-application-to-prospect-for-coal-in-hwange-national-park/",
            "content": "By Thandiwe Garusa\n\nThe Speaker of Parliament, Jacob Mudenda, has strongly opposed coal mining in Hwange National Park, citing alternative locations with abundant coal deposits.\n\nThis comes after a Chinese company, Sunny Yi Feng, recently proposed a coal mining project in Sinamatella, a section of Hwange National Park.\n\nThe proposed site is a critical habitat for black rhinos and currently supports a growing population of this endangered species.\n\nSpeaking during a parliamentary session on tourism, Mudenda expressed strong reservations about mining in national parks.\n\nSpeaker of Parliament Jacob Mudenda\n\nI will not subscribe to mining in national parks. The place that has been identified for mining purposes is not the only location where coal can be found.\n\nWe have coal in the southern part of Binga, as well as in the southeast and southwest of Bingastill virgin land with plenty of coal deposits.\n\nWhy disturb the ecology of the animals there? Mudenda said.\n\nMeanwhile, Sunny Yi Fengs proposal has been opposed by environmental rights activists, parliamentarians, and Hwange residents, who have raised alarms over the potential impacts of mining within a national park.\n\nThese include biodiversity loss, wildlife habitat destruction, and increased human- wildlife conflict.\n\nRights activists have warned that allowing mining in a national park will damage Zimbabwes global reputation for sustainable conservation.\n\nThey also fear that mining in Sinamatella will negatively affect both visitors and nature due to air, noise, and land pollution.\n\nAdditionally, Sunny Yi Feng has a history of environmental infractions, including a recent closure order from the Environmental Management Agency (EMA) due to pollution.\n\nThe Ministry of Mines has yet to respond to Sunny Ye Fengs application.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26171635/Hwange-National-Park_11.jpg",
            "description": "<p>By Thandiwe Garusa The Speaker of Parliament, Jacob Mudenda, has strongly opposed coal mining in Hwange National Park, citing alternative locations with abundant coal deposits. This comes after a Chinese company, Sunny Yi Feng, recently proposed a coal mining project in Sinamatella, a section of Hwange National Park. The proposed site is a critical habitat</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/i-will-not-subscribe-to-mining-in-national-parks-mudenda-slams-sunny-yi-fengs-application-to-prospect-for-coal-in-hwange-national-park/\">I will not subscribe to mining in national parks – Mudenda slams Sunny Yi Feng’s application to prospect for coal in Hwange National Park</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "11 Mar 2025"
        },
        {
            "title": "Dam collapse kills four in Chipinge, two still missing",
            "url": "https://www.newzimbabwe.com/dam-collapse-kills-four-in-chipinge-two-still-missing/",
            "content": "By Staff Reporter\n\nThe death toll in the Bandama dam breach in Chipinge, Manicaland Province, has risen to four, with two others still missing.\n\nThe dam collapsed Sunday, sweeping away livestock, irrigation pumps, and grinding mills on nearby farms.\n\nMinister of State for Provincial affairs and Devolution for Manicaland Province Misheck Mugadza conducted a site visit Monday.\n\nIconducted a site visit to the Bandama dam in Chipinge, which unfortunately burst, resulting in devastating consequences.\n\nIn my capacity, I extended condolences to the families of the victims and engaged in discussions with local leaders to assess the situation and explore avenues for support.\n\nRegrettably, the floods have claimed the lives of at least four individuals, and two persons remain unaccounted for. The disaster has also resulted in significant property damage, including the loss of livestock, destruction of pumps, and grinding mills on adjacent farms, leaving a trail of devastation in its wake, he wrote.\n\nAmong the deceased is a minor who had accompanied his mother to do laundry downstream when the dam breached.\n\nAlthough we are waiting for finer details, we are told that there was a female adult who was washing clothes downstream in the company of her two children. One of them, a four-year-old, was swept away, and the body was later retrieved.\n\nThe other person who died was a 30-year-old man who was on a fishing expedition, Civil Protection UNit chairman for Manicaland, John Misi told state media.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/11093300/bandama.jpeg",
            "description": "<p>By Staff Reporter The death toll in the Bandama dam breach in Chipinge, Manicaland Province, has risen to four, with two others still missing. The dam collapsed Sunday, sweeping away livestock, irrigation pumps, and grinding mills on nearby farms. Minister of State for Provincial affairs and Devolution for Manicaland Province Misheck Mugadza conducted a site</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dam-collapse-kills-four-in-chipinge-two-still-missing/\">Dam collapse kills four in Chipinge, two still missing</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "11 Mar 2025"
        },
        {
            "title": "1win history & expert betting strategies for success",
            "url": "https://www.newzimbabwe.com/1win-history-expert-betting-strategies-for-success/",
            "content": "The online betting industry has witnessed significant growth over the years, with platforms like 1win establishing themselves as major players in the market. Since its inception, 1win has continuously evolved, expanding its services and improving its platform to provide users with an unparalleled betting experience. From introducing new sports markets to enhancing its casino offerings, the company has made notable strides in becoming a trusted destination for bettors worldwide.\n\nBeyond its history and achievements, success on 1win is not just about placing random betsit requires strategy, discipline, and a solid understanding of the betting landscape. Whether wagering on sports events or exploring casino games, having a well-thought-out approach can significantly improve a players chances of winning. Expert betting strategies, such as bankroll management, value betting, and understanding odds movements, play a crucial role in making informed decisions.\n\nFor both beginners and experienced bettors, learning the right techniques is essential to maximizing profits while minimizing risks. Whether you are looking to place single bets, accumulators, or live wagers, applying smart strategies ensures a more controlled and strategic approach to betting. By combining knowledge with disciplined gameplay, players can enhance their betting experience and make the most out of their time on1win.\n\nWith a rich history of growth and a platform that continues to evolve, 1win remains a top choice for those seeking a reliable and rewarding betting experience. By understanding its journey and applying expert-backed betting strategies, users can confidently navigate the world of online betting and increase their chances of success.\n\nSince its inception, 1win has steadily grown into a major player in the online betting and casino industry. What started as a small bookmaker has expanded into a global platform offering diverse sports markets, live betting, and casino gaming. Over the years, the company has achieved significant milestones, adapting to industry trends and continuously improving user experience.\n\nThe table below highlights the key moments in 1wins history and the accomplishments that have shaped its reputation as a reliable and innovative betting platform:\n\nThrough consistent improvements and innovative solutions, 1win has established itself as a trusted platform for both new and experienced bettors. By continuously evolving, embracing technological advancements, and prioritizing user satisfaction, the company remains a top choice for players looking for a high-quality sports betting and casino experience.\n\nAchieving consistent success in sports betting requires more than just luck. Whether you are a beginner or an experienced bettor, applying the right strategies can significantly improve your chances of making profitable wagers. 1win offers a variety of betting markets, and understanding key tactics can help maximize returns while managing risks effectively. Below are expert-recommended strategies that can enhance your betting experience on 1win:\n\nBy applying these expert-backed strategies, bettors can enhance their overall experience on 1win while improving their chances of making profitable decisions. A combination of research, discipline, and smart wagering tactics will lead to a more rewarding and enjoyable betting journey.\n\n1win has established itself as a dynamic and evolving betting platform, offering a rich history of innovation, expansion, and technological advancements. From its early days as a sportsbook to its growth into a global betting hub, the platform continues to enhance the user experience by introducing new features, competitive odds, and diverse betting markets. Its commitment to providing a seamless, secure, and engaging environment has made it a preferred choice for players worldwide.\n\nBeyond understanding the history and achievements of 1win, bettors must approach wagering with a strategic mindset. Success in sports betting is not solely about luckit requires discipline, research, and a calculated approach. By implementing expert strategies such as bankroll management, value betting, and live wagering techniques, players can maximize their potential winnings while minimizing unnecessary risks. Utilizing available promotions, analyzing statistics, and staying disciplined are key factors in maintaining long-term success on the platform.\n\nWhether you are a new user looking to explore the world of online betting or an experienced bettor refining your strategies, 1win provides the perfect balance of entertainment, innovation, and rewarding opportunities. By leveraging the platforms advanced features and applying smart betting techniques, players can elevate their betting experience and increase their chances of success in an ever-evolving market.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/11071901/Screenshot-2025-03-11-at-09.16.30.png",
            "description": "<p>1win: evolution, achievements, and betting strategies for success The online betting industry has witnessed significant growth over the years, with platforms like 1win establishing themselves as major players in the market. Since its inception, 1win has continuously evolved, expanding its services and improving its platform to provide users with an unparalleled betting experience. From introducing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/1win-history-expert-betting-strategies-for-success/\">1win history & expert betting strategies for success</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "11 Mar 2025"
        },
        {
            "title": "1win Ghana – your go-to platform for betting & gaming",
            "url": "https://www.newzimbabwe.com/1win-ghana-your-go-to-platform-for-betting-gaming/",
            "content": "The world of online gambling offers numerous opportunities, and 1win stands out as a platform that goes beyond just being an online casino. It provides players with a comprehensive betting experience, combining a vast sportsbook with an immersive casino section. Whether users are interested in placing wagers on live sporting events or enjoying exciting casino games, 1win delivers a well-rounded and engaging environment.\n\nFor sports enthusiasts in Ghana, the platform presents a variety of betting markets, allowing them to explore different wagering strategies. From football and basketball to niche sports, 1win ensures that bettors have access to competitive odds and real-time action. With a user-friendly interface and a seamless mobile experience, it caters to both beginners and experienced players alike.\n\nBefore diving into sports betting, its important for players to consider essential recommendations to enhance their overall experience. Understanding betting markets, managing bankrolls responsibly, and staying informed about odds and statistics can significantly impact their success.1winequips players with the necessary tools and insights to make informed betting decisions, ensuring a smooth and enjoyable journey.\n\nAs online betting continues to grow in Ghana, platforms like 1win provide a secure and dynamic space for users to engage in both casino gaming and sports wagering. With the right strategies and a responsible approach, players can maximize their opportunities and enjoy a premium betting experience.\n\nWhen it comes to online gambling, many players recognize 1win for its extensive casino offerings. However, the platform is much more than just an online casinoit is a reliable and well-structured sports betting destination. Whether users are passionate about live sports betting or prefer the thrill of casino games, 1win provides a seamless experience that caters to different preferences.\n\nWith a modern interface, a wide selection of betting markets, and attractive promotions, 1win ensures that players enjoy both variety and security. The sportsbook covers a broad spectrum of sports, ranging from globally popular football leagues to emerging esports competitions. Meanwhile, the casino section boasts an impressive array of slots, table games, and live dealer options for those seeking immersive gaming experiences.\n\nThe following table highlights the essential features that make 1win a standout platform for both sports betting and casino gaming:\n\nFor players in Ghana looking to get started with sports betting on 1win, it is important to approach wagering with the right mindset and strategy. While betting can be an exciting way to engage with sports, it requires careful planning to maximize enjoyment and minimize potential risks. Below are key recommendations to consider before placing bets on 1win:\n\nBy keeping these recommendations in mind, Ghanaian players can enhance their betting experience on 1win while maintaining a responsible and strategic approach. Whether a beginner or an experienced bettor, applying these tips can lead to more informed and enjoyable wagering sessions.\n\n1win has successfully established itself as more than just an online casino, offering Ghanaian players a well-rounded platform for both sports betting and gaming. With its user-friendly interface, extensive sportsbook, and immersive casino section, the platform caters to a wide range of preferences, ensuring a dynamic and engaging experience for all users.\n\nFor those looking to maximize their betting potential, understanding the various wagering options and applying strategic recommendations is essential. From setting a budget to researching teams and leveraging promotions, players can take a structured approach to betting that enhances both enjoyment and profitability. The ability to switch seamlessly between sports betting and casino gaming further enhances 1wins appeal, making it a go-to destination for those seeking entertainment and excitement.\n\nAs online betting continues to grow in Ghana, platforms like 1win provide a secure and convenient environment for players to explore. By following key betting tips and practicing responsible gaming, users can make the most of what 1win has to offer. Whether placing live bets, enjoying virtual sports, or engaging in casino games, 1win delivers a premium and comprehensive gambling experience tailored to both new and experienced players.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/11071624/Screenshot-2025-03-11-at-09.12.02.png",
            "description": "<p>1win – a versatile platform for casino gaming and sports betting The world of online gambling offers numerous opportunities, and 1win stands out as a platform that goes beyond just being an online casino. It provides players with a comprehensive betting experience, combining a vast sportsbook with an immersive casino section. Whether users are interested</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/1win-ghana-your-go-to-platform-for-betting-gaming/\">1win Ghana – your go-to platform for betting & gaming</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "11 Mar 2025"
        },
        {
            "title": "Exploring the exciting world of online betting with 1win",
            "url": "https://www.newzimbabwe.com/exploring-the-exciting-world-of-online-betting-with-1win/",
            "content": "The online betting industry continues to evolve, offering players innovative platforms with diverse opportunities to enjoy sports wagering. Among the platforms gaining popularity is 1win, a betting service that attracts players with its user-friendly interface, vast sports selection, and competitive odds. Whether you are an experienced bettor or just starting your journey, 1win provides a dynamic environment where users can explore a variety of betting options.\n\nOne of the key attractions of 1win is its broad sportsbook, covering numerous sports and events worldwide. From mainstream leagues to niche competitions, bettors can access an extensive range of markets tailored to different preferences. Live betting features enhance the experience, allowing players to place wagers in real time while following the action closely. This level of engagement makes sports betting more interactive and thrilling.\n\n1winextends its services to Ghanaian players, offering a dedicated platform tailored to meet local preferences. The official 1win Ghana website provides users with a seamless betting experience, ensuring secure transactions, reliable customer support, and an intuitive navigation system. The platform is designed to accommodate both seasoned bettors and newcomers, making it a versatile choice for those looking to engage in online sports betting.\n\nAs online betting continues to thrive, platforms like 1win stand out by delivering an optimized and entertaining experience for users. With a strong emphasis on accessibility and a diverse range of betting options, 1win remains a competitive choice for sports enthusiasts eager to explore the dynamic world of online wagering.\n\nSports betting enthusiasts seeking variety and flexibility will find an extensive range of wagering opportunities on 1win. The platform caters to different betting styles, providing users with multiple ways to engage with their favorite sports. Whether players prefer traditional bets or more dynamic options, 1win ensures a well-rounded experience with competitive odds and real-time betting features. Below is an overview of the key types of sports wagers available on the platform:\n\n1win has established itself as a leading online betting platform, offering Ghanaian players a seamless and dynamic experience. Designed to cater to both new and experienced bettors, the official 1win Ghana website provides a user-friendly interface, secure payment options, and a wide range of betting opportunities. Below is a detailed breakdown of the key features that define the 1win Ghana platform:\n\nWith its extensive range of features and commitment to user satisfaction, 1win Ghana stands out as a top-tier betting platform in the country. Whether for sports enthusiasts or casino players, the site delivers an all-in-one gambling experience that meets the needs of every bettor.\n\nThe world of online sports betting continues to expand, and 1win Ghana has positioned itself as a top contender in this ever-growing industry. With its diverse range of sports betting options, intuitive platform, and commitment to user satisfaction, the bookmaker delivers an experience that caters to both casual players and seasoned bettors. Whether its single bets, accumulators, live wagering, or outright predictions, the platform ensures that users have the flexibility to engage with sports in the way that suits them best.\n\nBeyond its extensive sportsbook, 1win Ghana impresses with its modern interface, secure payment methods, and enticing promotional offers. Players can access the site from both desktop and mobile devices, ensuring that betting remains convenient and accessible at all times. The addition of a dedicated casino section further enhances the entertainment factor, allowing users to explore various gaming opportunities beyond traditional sports betting.\n\nSecurity and customer support are also key pillars of 1win Ghanas success. With advanced encryption technology and a licensed operational framework, the platform guarantees a safe and reliable betting environment. The availability of responsive customer service ensures that users can resolve any issues quickly, making their experience smooth and enjoyable.\n\nFor those seeking a feature-rich and dynamic online betting platform, 1win Ghana stands as an excellent choice. By combining competitive odds, diverse betting markets, and a seamless user experience, the bookmaker continues to attract players looking for a premium sports wagering destination. As the industry evolves, 1win Ghana remains a strong and reliable option for bettors eager to explore the excitement of online gambling.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/11070834/Screenshot-2025-03-11-at-09.06.25.png",
            "description": "<p>Exploring the exciting world of online betting with 1win The online betting industry continues to evolve, offering players innovative platforms with diverse opportunities to enjoy sports wagering. Among the platforms gaining popularity is 1win, a betting service that attracts players with its user-friendly interface, vast sports selection, and competitive odds. Whether you are an experienced</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/exploring-the-exciting-world-of-online-betting-with-1win/\">Exploring the exciting world of online betting with 1win</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "11 Mar 2025"
        },
        {
            "title": "RTG tables expansion drive after shelling out debt",
            "url": "https://www.newzimbabwe.com/rtg-tables-expansion-drive-after-shelling-out-debt/",
            "content": "By Alois Vinga\n\nLEADING hospitality concern Rainbow Tourism Group (RTG) has shelled out heavy debt, creating flexible room to table an aggressive expansion drive within and outside the countrys borders.\n\nSpeaking to NewZimbabwe.com on the sidelines of an event to share the groups performance for the year ended December 31 2024, RTGs CEO Tendai Madziwanyika said the debt repayment commitment has managed to ease the companys gearing from an exorbitant ratio of 70% when he took over in 2012 to the current debt free position.\n\nIn the last six years from 2019, which was just before Covid-19 we spent about US$42 million on capital projects and loan servicing, which was split into repayment and interests. Our loan repayment during that period was about US$17 million and interest payments were about US$2,4 million, making it to a total loan servicing of US$19,5 million right from Covid-19 era to now, he said.\n\nThe RTG boss, who is widely acclaimed for taking the hospitality concern out of the woods, revealed that over the years, the group has spent US$22,6 million, out of which US$11,8 million went towards refurbishment and US$10,8 million basic care and maintenance.\n\nWhen we started, our gearing was about 70%. Today, we are almost debt free. In 2020, we managed to pay back the last part of our loans. It was a debenture of US$16,7 million and this was actually paid to our shareholder NSSA. The amount was in full and final settlement in 2020 during Covid-19, he said.\n\nResultantly, the group has tabled an aggressive expansion plan on the back of revelations that the acquisition of Montclair Hotel is now in the final stages, with a whopping US$1 million budget having already been set aside for refurbishment.\n\nThe group is yet to unveil finer details on another project in South Africa on the back of plans to expand its footprint with the Harare.\n\nThe just-ended reporting year ended December 31 2024, saw the group delivering strong performance driven by 4% growth in occupancy and a 15% rise in foreign currency revenues.\n\nI would like to highlight that in the revenue of US$ 44,3 million, about US$19 million is the actual foreign currency. That number last year was US$16,4 million and a year before that, we were excited as we were at US$11,1 million.\n\nIt shows the capacity of the business to generate foreign currency so that is quite exciting and coming back to 2012 we were at about US$5 million, added Madziwanyika.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/04/12003704/Rainbow-Towers-Hotel-e1586648288559.jpeg",
            "description": "<p>By Alois Vinga LEADING hospitality concern Rainbow Tourism Group (RTG) has shelled out heavy debt, creating flexible room to table an aggressive expansion drive within and outside the country’s borders. Speaking to NewZimbabwe.com on the sidelines of an event to share the group’s performance for the year ended December 31 2024, RTG’s CEO Tendai Madziwanyika</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rtg-tables-expansion-drive-after-shelling-out-debt/\">RTG tables expansion drive after shelling out debt</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "11 Mar 2025"
        },
        {
            "title": "Orchard On 25 founder Jay Badza passes away at 38",
            "url": "https://www.newzimbabwe.com/orchard-on-25-founder-jay-badza-passes-away-at-38/",
            "content": "News24\n\nJay Badza, CEO and founder of brand and marketing agency Orchard on 25, has died. He was 38 years old.\n\nA statement announcing his death was shared on the business Instagram account.\n\nIt is with deep sadness that we share the devastating news of the passing of Orchard on 25 founder and head honcho, Jay Badza, reads the statement. The cause of his death has not been disclosed.\n\nBadza, who hails from Dobsonville, Soweto, founded the PR, creative, and communications agency in 2017. He began his career with an internship at Meropa Communications and thereafter worked for agencies like Jennie Newman PR and DNA Brand Architects.\n\nIn an interview withMark Lives, he mentioned that it was at DNA Brand Architects where his entrepreneurial spirit took shape.\n\nBadza described success toGQas determination and the undying spirit to keep fighting, even when it all looks impossible.\n\nIn the statement, Badza is described as a true visionary and passionate leader in the PR and marketing industry who poured his heart into elevating young creatives.\n\nHe wasnt just a mentor but a guiding light who nurtured countless individuals and ignited their potential. His unwavering commitment to innovation and the relentless pursuit of excellence not only transformed the industry: it transformed lives, continued the statement.\n\nOur deepest sympathies and unwavering support are with Jays family during this unbearable time. We share in their grief and express our eternal gratitude for the extraordinary legacy he leaves behind, ended the statement.\n\nBadzas memorial and funeral details will be announced when they are finalised.\n\nSEE THE FULL STATEMENT HERE:\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/08092734/WhatsApp-Image-2024-10-08-at-10.23.58-scaled-e1728376074212.jpeg",
            "description": "<p>News24 Jay Badza, CEO and founder of brand and marketing agency Orchard on 25, has died. He was 38 years old. A statement announcing his death was shared on the business’ Instagram account. “It is with deep sadness that we share the devastating news of the passing of Orchard on 25 founder and head honcho,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/orchard-on-25-founder-jay-badza-passes-away-at-38/\">Orchard On 25 founder Jay Badza passes away at 38</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "11 Mar 2025"
        },
        {
            "title": "Pasuwa’s Malawi to face South Africa in final CHAN qualifying round",
            "url": "https://www.newzimbabwe.com/pasuwas-malawi-to-face-south-africa-in-final-chan-qualifying-round/",
            "content": "By Sport Reporter\n\nCelebrated Zimbabwe international coach Calisto Pasuwa will be in for a big test as his side facesSouth Africa in the final African Nations Championships (CHAN) qualifying match.\n\nPasuwas Malawi recorded a 2-0 win over Comoros over the weekend to complete a 4-0 aggregate win, which propelled them to the final round, which carries a ticket to the 2025 CHAN edition.\n\nMalawi and South Africa will play the first and second leg of the final qualifiation round in May and winner between the two sides automatically makes it to CHAN.\n\nPasuwa was officially appointed head coach of The Flames last month after signing a three-year contract.\n\nPart of his expected target as Malawis head coach is to help the side make a maiden appearance at the CHAN tournament, which is yet to have its dates confirmed.\n\nThe 2025 CHAN tournament will be co-hosted later this year by Kenya, Uganda and Tanzania, who are racing to have their infrastructure ready for the big games.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/12135744/Kalisto-Pasuwa.webp",
            "description": "<p>By Sport Reporter Celebrated Zimbabwe international coach Calisto Pasuwa will be in for a big test as his side faces South Africa in the final African Nations Championships (CHAN) qualifying match. Pasuwa’s Malawi recorded a 2-0 win over Comoros over the weekend to complete a 4-0 aggregate win, which propelled them to the final round, which</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pasuwas-malawi-to-face-south-africa-in-final-chan-qualifying-round/\">Pasuwa’s Malawi to face South Africa in final CHAN qualifying round</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "11 Mar 2025"
        },
        {
            "title": "No hope for Zimbabwe, Africa as US shuts down 83% of USAID programmes",
            "url": "https://www.newzimbabwe.com/no-hope-for-zimbabwe-africa-as-us-shuts-down-83-of-usaid-programmes/",
            "content": "By Staff Reporter\n\nHEALTH, education and a range of other sectors in Zimbabwe and the rest of Africa that were benefiting from USAID might just be in for a long, grueling run following announcements that 83% of the agencys programmes had been suspended.\n\nUnited States Secretary of State Marco Rubio on Monday announced that the US government had cancelled 5,200 contracts that were gobbling tens of billions of their funds in ways that did not serve the core interests of the United States.\n\nHis announcement comes barely a month after the suspension of all but a select few programmes funded through USAID, its tax-funded humanitarian agency.\n\nThe global suspension, which came into effect less than a week into President Donald Trumps second term in office, left most of Africas humanitarian needs unattended as most had been benefiting from Americas benevolence.\n\nAfter a six-week review, we are officially cancelling 83% of the programmes at USAID, said Rubio.\n\nThe 5,200 contracts that are now cancelled spent tens of billions of dollars in ways that did not serve, (and in some cases even harmed), the core national interests of the United States.\n\nIn consultation with Congress, we intend for the remaining 18% of programmes we are keeping (approximately 1,000) to now be administered more effectively under the State Department.\n\nThe review was conducted by the infamous DOGE, a unit tasked with auditing, streamlining and recommending future operations of USAID or its disbandment.\n\nIn Zimbabwe, USAID was funding part of the countrys health sector through payments to nurses, skills, technology purchase and in many cases, building of clinics primarily in underserved rural areas.\n\nDespite its failure to invest in public health and education over Zimbabwes 45 years of independence, the government maintains it has a Plan B and that citizens should not panic.\n\nIn South Africa, clinics which were offering free antiretroviral drugs (ARVs) have been shut.\n\nThe African situation has been worsened by the pulling out of UKAID and other European aid agencies.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/07/07030414/USAID.jpg",
            "description": "<p>By Staff Reporter HEALTH, education and a range of other sectors in Zimbabwe and the rest of Africa that were benefiting from USAID might just be in for a long, grueling run following announcements that 83% of the agency’s programmes had been suspended. United States Secretary of State Marco Rubio on Monday announced that the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/no-hope-for-zimbabwe-africa-as-us-shuts-down-83-of-usaid-programmes/\">No hope for Zimbabwe, Africa as US shuts down 83% of USAID programmes</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "11 Mar 2025"
        }
    ]
}