{
    "news": [
        {
            "title": "Cape Verde, Zimbabwe and South Africa projects triumph at Durban FilmMart",
            "url": "https://www.newzimbabwe.com/cape-verde-zimbabwe-and-south-africa-projects-triumph-at-durban-filmmart/",
            "content": "ScreenDaily\n\nProjects from South Africa, Cape Verde and Zimbabwe were among the big winners at the 16th edition of the Durban FilmMart (DFM), which wrapped this week.\n\nThis years market was attended by 1,364 filmmakers and industry professionals from 63 countries, and culminated in the presentation of 39 awards for projects focused on African storytellingincluding development grants, co-production opportunities, festival invitations, and industry mentorships.\n\nCape Verde documentary projectPlastic Atlantis, about the link between slavery and ocean pollution in Cape Verde, won six prizes including the Sundance Institute Documentary Fund New Voices Award, a Climate Story Labs award, plus prizes from OIF-ACP-EU, Sheffield Doc Fest,DOC-A and Women Make Movies. It is directed by Samira Vera-Cruz and produced by Pedro Soul through Cape Verde-based Kriolscope (KS).\n\nZimbabwean feature documentaryGoldenwon three prizes: a Red Sea Film Fund award, a Canal+ development grant, and the DOK.fest Mnchen award. The documentary traces Zimbabwe womens national hockey teams road to the 2025 Womens FIH Hockey Junior World Cup  45 years after the countrys only Olympic medal in a team sport. It is directed by Rumbi Katedzaand produced by Rumbi Katedza and Ingrid Martens through Mai Jai Films.\n\nSouth African dark comedy projectThe Second Coming, about a man convinced he is the Messiah, won three prizes including a Red Sea Film Fund award, a National Film and Video Foundation of South Africa (NFVF) best fiction grant, and the Inkaba Award.The Second Coming isdirected by Durban-based Michael James and produced by Siyabonga Xaba of Maverick Resistance.\n\nWe are delighted to have hosted such a dynamic array of filmmakers from across the African continent. They entrusted us with their projects and ideas, and generously shared their time, expertise, and passion through enriching conversations, creating a truly African event, said Magdalene Reddy, director of the Durban FilmMart Institute (DFMI).\n\nDFM 2025, took place from 18  21 July in Durban.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/24201001/1455962_dfm2025awardwinnersanddfmteam_120356_crop.jpg",
            "description": "<p>ScreenDaily Projects from South Africa, Cape Verde and Zimbabwe were among the big winners at the 16th edition of the Durban FilmMart (DFM), which wrapped this week. This year’s market was attended by 1,364 filmmakers and industry professionals from 63 countries, and culminated in the presentation of 39 awards for projects focused on African storytelling—including</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cape-verde-zimbabwe-and-south-africa-projects-triumph-at-durban-filmmart/\">Cape Verde, Zimbabwe and South Africa projects triumph at Durban FilmMart</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:47",
            "date": "25 Jul 2025"
        },
        {
            "title": "What the Eastern Cape High Court ruling means for foreign employee terminations",
            "url": "https://www.newzimbabwe.com/what-the-eastern-cape-high-court-ruling-means-for-foreign-employee-terminations/",
            "content": "IOL\n\nSOUTH AFRICA  A foreign national employee must be provided with proper notice of their termination in line with the Basic Conditions of Employment Act (BCA). Failure to provide such notice may result in the termination being unlawful.\n\nThis is the warning of employment law experts at Cliffe Dekker Hofmeyr (CDH), following a recent Eastern Cape High Court judgment.\n\nThis was after an application by a research assistant and Zimbabwean national, Samuel Nyakudya.\n\nHe was granted a temporary residence permit allowing him to reside in South Africa and seek employment in the category of general work as provided for under the Immigration Act.\n\nHis employer, the OR Tambo District Municipality, however, terminated his employment contract due to allegations of its unlawfulness and irregularity.\n\nCommenting on the case, CDH said that this area of termination has just become a lot clearer for employers after the recent ruling, stating that employing a foreign national without a work visa does not automatically grant an employer the right to summarily terminate the employment contract.\n\nThis indicates a key warning for employers highlighting their responsibility to act lawfully and in accordance with the BCA, CDH said.\n\nThe experts explained that a foreign national employee must be provided with proper notice of their termination in line with the BCA. Failure to provide such notice may result in the termination being unlawful. The dismissal may also be found to be unfair in the CCMA (Commission for Conciliation, Mediation and Arbitration).\n\nNyakudya was employed on successive fixed-term contracts, but following the expiration of his last contract, the municipality allowed him to continue working without a new fixed-term contract.\n\nThroughout his employment, Nyakudya was not consistently in possession of a work visa. In November 2023, the municipality notified him that his contract had expired on March 31, 2022, and that he had failed to provide a copy of his South African identity document, despite being requested to do so.\n\nConsequently, the municipality claimed it had no choice but to terminate his employment immediately, citing the unlawful nature of his contract due to the expiration of his work visa.\n\nWhile Nyakudya could have contested the fairness of his dismissal before the CCMA, he opted to challenge the termination in the High Court.\n\nThe court ultimately ruled that Nyakudyas employment contract termination was unlawful..\n\nCDH said the Immigration Act outlines an employers responsibilities regarding the employment of foreign nationals, specifically in Section 38, which prohibits the employment of illegal foreigners or those whose status does not authorise them to work.\n\nIt said the court also referenced Section 49(3) of the Immigration Act, which states that employing an illegal foreigner or a foreigner in violation of the Act constitutes a criminal offence.\n\nThe court confirmed that such employment is punishable by fines or imprisonment upon conviction.\n\nRegarding the summary termination of Nyakudyas contract, the court considered Section 37(1) of the BCEA, which stipulates the notice period required for termination based on the duration of employment.\n\nThe court highlighted that the purpose of providing notice is to allow employees to prepare for a smooth transition.\n\nNyakudyas lack of a work visa or South African identity document was a critical factor in the case. The court determined that employing a foreign national without a work visa is prohibited, and thus, the municipalitys immediate termination of Nyakudyas contract was unlawful.\n\nThis case serves as a significant reminder that employing a foreign national without a work visa does not automatically grant an employer the right to terminate the employment contract summarily, CDH warned.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/24202404/Screenshot-2025-07-24-at-21.20.52.png",
            "description": "<p>IOL SOUTH AFRICA – A foreign national employee must be provided with proper notice of their termination in line with the Basic Conditions of Employment Act (BCA). Failure to provide such notice may result in the termination being unlawful. This is the warning of employment law experts at Cliffe Dekker Hofmeyr (CDH), following a recent</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/what-the-eastern-cape-high-court-ruling-means-for-foreign-employee-terminations/\">What the Eastern Cape High Court ruling means for foreign employee terminations</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:47",
            "date": "25 Jul 2025"
        },
        {
            "title": "PSL, ZWSL set to elect new executives",
            "url": "https://www.newzimbabwe.com/psl-zwsl-set-to-elect-new-executives/",
            "content": "By Sports Reporter\n\nThe Premier Soccer League (PSL) and Zimbabwe Womens Super League (ZWSL) will today head to the polls in Harare to elect new executive leadership, under the oversight of the Zimbabwe Football Association (ZIFA).\n\nThe elections mark a significant step forward for both leagues, which have been operating under interim leadership in recent months. The PSL has been without a chairman since the resignation of Farai Jere in 2024.\n\nFour candidates are vying for the PSL chairmanship: Dumisani Sisale (FC Platinum), Masimba Chihowa (Manica Diamonds), Leonard Musariri (Ngezi Platinum), and Isiah Mupfurutsa (Simba Bhora).\n\nIn the ZWSL, two candidates are in the running for the chairperson position: Chido Chizondo of Platinum Royals and Thokoziso Moyo of Black Rhinos Queens.\n\nThe ZWSL has been under the leadership of an interim committee appointed by the ZIFA Normalisation Committee, following the dissolution of the Barbara Chikosi-led executive over allegations of poor management.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/25060345/vote.png",
            "description": "<p>By Sports Reporter The Premier Soccer League (PSL) and Zimbabwe Women’s Super League (ZWSL) will today head to the polls in Harare to elect new executive leadership, under the oversight of the Zimbabwe Football Association (ZIFA). The elections mark a significant step forward for both leagues, which have been operating under interim leadership in recent</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/psl-zwsl-set-to-elect-new-executives/\">PSL, ZWSL set to elect new executives </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:47",
            "date": "25 Jul 2025"
        }
    ]
}