{
    "news": [
        {
            "title": "Police warns against participation in Geza’s October 17 protests",
            "url": "https://www.newzimbabwe.com/police-warns-against-participation-in-gezas-october-17-protests/",
            "content": "By Thandiwe Garusa\n\nTHEZimbabwe Republic Police (ZRP) has warned that any attempts to engage in illegal demonstrations or gatheringson Fridaywill be met with the full wrath of the law.\n\nThis follows war veteran and ex-Zanu PF committee member Blessed Gezas call for nationwide protests against President Emmerson Mnangagwa and his allies, accusing them of corruption.\n\nIn a statement Thursday, policespokespersonCommissionerPaul Nyathisaid comprehensive security measures havebeen put in place nationwideto ensure peace and stability.\n\nThe Zimbabwe Republic Police assures all Zimbabweans and visitors that comprehensive security measures have been put in place to ensure peace, law and order prevails before, during and after October 17.\n\nThe public is urged not to be misled or intimidated by rumours, misinformation, or threats circulating on social media platforms.\n\nActs of violence, threats, vandalism, or incitement to commit crime will be severely dealt with in line with the countrys laws\n\nAny attempts to engage in unlawful demonstrations, gatherings, or processions will be met with the full wrath of the law, Nyathi said.\n\nHe further urged the public to go about their daily activities without fear, adding that all essential services, including schools, businesses, public transport, and government offices will continue to operate as normal.\n\nMembers of the public are implored to go about their daily activitieswithoutfear.All essential services, including schools, businesses, public transport and government institutions,willcontinue to operate as usual, headded.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/12055423/geza_vid_2.jpg",
            "description": "<p>By Thandiwe Garusa THE Zimbabwe Republic Police (ZRP) has warned that any attempts to engage in illegal demonstrations or gatherings on Friday will be met with “the full wrath of the law”. This follows war veteran and ex-Zanu PF committee member Blessed Geza’s call for nationwide protests against President Emmerson Mnangagwa and his allies, accusing them of corruption.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/police-warns-against-participation-in-gezas-october-17-protests/\">Police warns against participation in Geza’s October 17 protests</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:05",
            "date": "16 Oct 2025"
        },
        {
            "title": "Panicky Mnangagwa announces US$150 ‘Special Presidential Bonus’ for civil servants ahead of planned anti-govt protests",
            "url": "https://www.newzimbabwe.com/panicky-mnangagwa-announces-us150-special-presidential-bonus-for-civil-servants-ahead-of-planned-anti-govt-protests/",
            "content": "By Staff Reporter\n\nPresident Emmerson Mnangagwas administration has announced a US$150 Special Presidential Bonus for civil servants, a move widely viewed as an attempt to ease growing frustration and avert planned anti-government protests called by war veteran and former Zanu PF committee member Blessed Geza.\n\nThe announcement, made a day before the scheduled October 17 demonstrations, has fueled speculation that the government is seeking to appease the civil serviceand maintain calm amid rising economic discontent.\n\nIn a statement issued Thursday, Public Service, Labour and Social Welfare Minister Edgar Moyo said the bonus will be disbursed in two instalments of US$75 each in November and December.\n\nFollowing ongoing engagement between government and its employees and in pursuit of achieving this objective, government seeks to announce the following interventions:\n\nTo provide festive season relief and recognise dedicated service, the government will pay a once-off Special Presidential Bonus of US$150 for all civil servants, which will be disbursed in two equal instalments of US$75 in November and December 2025.This will be in addition to the regular annual bonus and salaries, said Moyo.\n\nHe added that the government will next year implement a Job Evaluation Framework to align salaries with job responsibilities and restore long-withdrawn benefits for public workers.\n\nThe civil servants vehicle rebate scheme,which allows duty-free car imports,has been reinstated to 2022 benefit levels with effect from December.\n\nThe civil servants vehicle rebate is being fully restored to 2022 benefit levels, rewarding long service and commitment as reflected in Statutory Instrument 124 of 2022 with effect from 1 December 2025.\n\nFurthermore, government is revitalising medical insurance by recapitalising Premier Service Medical Aid Society (PSMAS) to ensure sustainable access to quality healthcare for public servants, he said.\n\nThe government also pledged to assist civil servants in acquiring housing, offering 26,000 residential stands, 20,000 in Harare and 6,000 in Bulawayo, with more to be made available nationwide.\n\nGeza, who is reportedly backed by Vice President Constantino Chiwenga, has urged citizens to take to the streets accusing Mnangagwa and his allies of corruption and economic mismanagement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/09192321/President-Emmerson-Mnangagwa-.jpg",
            "description": "<p>By Staff Reporter President Emmerson Mnangagwa’s administration has announced a US$150 “Special Presidential Bonus” for civil servants, a move widely viewed as an attempt to ease growing frustration and avert planned anti-government protests called by war veteran and former Zanu PF committee member Blessed Geza. The announcement, made a day before the scheduled October 17</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/panicky-mnangagwa-announces-us150-special-presidential-bonus-for-civil-servants-ahead-of-planned-anti-govt-protests/\">Panicky Mnangagwa announces US$150 ‘Special Presidential Bonus’ for civil servants ahead of planned anti-govt protests</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:05",
            "date": "16 Oct 2025"
        },
        {
            "title": "Knives out in ZANU PF as Mutsvangwa raps Chiwenga over corruption dossier, accuses VP of turning presidium into a kangaroo court",
            "url": "https://www.newzimbabwe.com/knives-out-in-zanu-pf-as-mutsvangwa-raps-chiwenga-accuses-vp-of-turning-presidium-into-a-kangaroo-court/",
            "content": "By Staff Reporter\n\nZanu PFs internal power struggles have escalated dramatically, with party spokesperson Christopher Mutsvangwa publicly rebuking Vice President Constantino Chiwenga, accusing him of turning the presidium into a kangaroo court.\n\nThe confrontation reportedly followed Chiwengas demand for President Emmerson Mnangagwa to take action against individuals named in a corruption dossier he presented to the Politburo.\n\nSources told NewZimbabwe.com tensions were high during the meeting. Chiwengas allies initially rallied behind him before retreating when questions were raised about the motives behind his dossier.\n\nThe document reportedly implicates several prominent businessmen closely associated with Mnangagwa, including Wicknell Chivayo, Delish Nguwaya, Kudakwashe Tagwirei, Pedzai Sakupwanya, and Paul Tungwarara.\n\nThe group is accused of siphoning millions from state coffers, calling for their immediate arrest,a move that has deepened divisions within the ruling party.\n\nOur Vice President decides to turn the Presidium into a kangaroo court. An inquisitive court.KutongaPresident citing that document which was authored by Kasukuwere and his colleagues, Mutsvangwa told journalists at a press briefing in Harare, Thursday, expressing his disapproval of Chiwengas actions.\n\nMutsvangwa claimed that everyone in the Politburo professed ignorance about the origins of the dossier, with the exception of Chiwengaleading to speculation that the Vice President is acting alone.\n\nHefurther suggested that the incident had served as a reminder to Chiwenga that he is merely a Presidential appointee and lacks independent powerandshould conduct himself accordingly.\n\nIt reminded the Presidium that you are appointees of the President like us. You have no powers as the Presidium. And it was one person among these Presidium members who was championing that document. All these other people were just being dragged along.\n\nThe Politburo asked who penned the document, do you accept the ownership individually? All other members of the Presidium said we dont know where it came from. So it zeroed in on the Vice President.\n\nChiwenga has consistentlyslammed corruption, describing it as a national security threat. He has also repeatedly warned those who amass wealth through unscrupulous means to watch their backs, suggesting that their day of reckoning is coming.\n\nThe individuals named in the dossier are alleged to be securing government tenders through corrupt practices. These allegations are not new, but their formal presentation within the Politburo has brought the issue to a head.\n\nFor instance, Chivayo previously defrauded ZESA of US$5 million in the Gwanda Solar Power project through his Intratek Company, and failed to deliver on the project.\n\nTagwirei has been linked to the over US$3 billion Command Agriculture scandal and is also implicated in the recent dossier alleging that approximately US$3.2 billion has been stolen from state coffers. Meanwhile, Paul Tungwarara secured a tender to drill 10,000 boreholes under the Presidential Borehole Drilling Scheme, but was recently criticised by Parliament for failing to deliver.\n\nThe government has acknowledged that it is losing US$2 billion annually due to corruption and illicit financial dealings, making the current accusations all the more damaging and increasing the pressure on Mnangagwa to take action.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/16163123/chris-mutsvangwa.jpg",
            "description": "<p>By Staff Reporter Zanu PF’s internal power struggles have escalated dramatically, with party spokesperson Christopher Mutsvangwa publicly rebuking Vice President Constantino Chiwenga, accusing him of “turning the presidium into a kangaroo court.” The confrontation reportedly followed Chiwenga’s demand for President Emmerson Mnangagwa to take action against individuals named in a corruption dossier he presented to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/knives-out-in-zanu-pf-as-mutsvangwa-raps-chiwenga-accuses-vp-of-turning-presidium-into-a-kangaroo-court/\">Knives out in ZANU PF as Mutsvangwa raps Chiwenga over corruption dossier, accuses VP of turning presidium into a kangaroo court</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:05",
            "date": "16 Oct 2025"
        },
        {
            "title": "Kenya police fire shots and tear gas at crowds gathered to see body of ex-PM Odinga",
            "url": "https://www.newzimbabwe.com/kenya-police-fire-shots-and-tear-gas-at-crowds-gathered-to-see-body-of-ex-pm-odinga/",
            "content": "BBC\n\nHuge crowds of mourners in Kenya fled screaming after police fired gunshots and tear gas in a stadium where they had gathered to see the body of former Prime Minister Raila Odinga.\n\nSeveral people at the arena, located in the capital Nairobi, were reportedly injured in the chaos as security officers sought to disperse the surging crowds.\n\nIt is not yet clear whether the police were using live ammunition or rubber bullets.\n\nOdingas body was flown back from India, where he died on Wednesday morning. Thousands of supporters had earlier travelled to the countrys main airport to receive the coffin, in an outpouring of grief that forced a brief halt to flights.\n\nThe authorities said mourners had gained access to restricted areas, prompting a precautionary closure that lasted about two hours.\n\nFrom the airport, thousands of people moved in a procession to escort the vehicle carrying the body to the stadium, about 10km (six miles) from the city centre.\n\nBecause of the unexpectedly large crowds, the public viewing ceremony for Odingas body was moved to Nairobis Moi International Sports Centre in the Kasarani neighbourhood, rather than inside the parliament building where it was initially scheduled to take place.\n\nThe convoy arrived to a packed stadium, with more people waiting outside.\n\nMinutes afterwards, a large crowd breached a gate in the arena, prompting the police to fire tear gas. Masses of mourners rushed towards the exits in response.\n\nA BBC reporter at the scene also saw men in civilian clothing beating protesters with batons.\n\nAt least three people were visibly injured and one had a serious head wound, the AFP news agency reported.\n\nAfter the chaos had settled, government officials and dignitaries were able to view it the coffin.\n\nA stream of supporters had earlier gathered at Lee Funeral Home, where the body was first expected, and around parliament.\n\nI came here at six in the morning. We have been at the airport to welcome Baba [Odingas nickname], one mourner had told the BBC near the airport.\n\nWe are sad, we have been left as orphans. He is our father.\n\nMotorcycle rider William Otieno Adoyo said he was a Baba die-hard.\n\nWe want to see Baba, how do we know its him in the casket? Let them show us and well be contented, he told the BBC.\n\nMourners have been carrying twigs and palm branches, a symbol of mourning and grief among the Luo ethnic group that Odinga belonged to.\n\nThe state funeral will be held at the Nyayo National Stadium in Nairobi on Friday and on Saturday his body will be transported to Kisumu, a city in western Kenya on the shores of Lake Victoria  his political stronghold.\n\nMembers of the public will get a chance to view the body before he is buried on Sunday at his farm in Bondo, about 60km west of Kisumu.\n\nAccording to the family, it was Odingas wish to be laid to rest within the shortest time possible, ideally within 72 hours.\n\nThe 80-year-old former prime minister collapsed during a morning walk in India on Wednesday morning and he was taken to Devamatha Hospital, about 50km (30 miles) east of the port city of Kochi.\n\nA seven-day period of mourning has been declared. Odinga will also be accorded a state funeral with full military honours, Kenyan President William Ruto said.\n\nHe was towering figure in Kenyan politics and for many years was the countrys main opposition leader, losing five presidential campaigns, most recently three years ago.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/16161129/kenya.webp",
            "description": "<p>BBC Huge crowds of mourners in Kenya fled screaming after police fired gunshots and tear gas in a stadium where they had gathered to see the body of former Prime Minister Raila Odinga. Several people at the arena, located in the capital Nairobi, were reportedly injured in the chaos as security officers sought to disperse</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kenya-police-fire-shots-and-tear-gas-at-crowds-gathered-to-see-body-of-ex-pm-odinga/\">Kenya police fire shots and tear gas at crowds gathered to see body of ex-PM Odinga</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:05",
            "date": "16 Oct 2025"
        },
        {
            "title": "After destroying CCC, Tshabangu now pushing for suspension of 2028 elections",
            "url": "https://www.newzimbabwe.com/after-destroying-ccc-tshabangu-now-pushing-for-suspension-of-2028-elections/",
            "content": "By Darlington Gatsi\n\nSelf-imposed Citizens Coalition for Change (CCC) Secretary General Sengezo Tshabangu is spearheading a plan to suspend the 2028 general elections, a move that would effectively extend President Emmerson Mnangagwas stay in power.\n\nAccording to Ziyambi, the proposal contained in a document titled Building Bridges Initiative (BBI) seeks to amend Section 92 of the Constitution to allow for the suspension of general elections.\n\nIf enacted, the amendment would pave the way for Mnangagwas term to be extended beyond the constitutional limit.\n\nZiyambi, however, dismissed claims linking Jonathan Moyo and businessmen Kudakwashe Tagwirei and Pedzai Sakupwanya to the alleged plot, insisting that the initiative originated from Tshabangu.\n\nThe BBI is an opposition document which was initially brought to my attention by the leader of the opposition in Parliament, Sengezo Tshabangu, in the company of a General Khumalo from the Vice Presidents Office.\n\nAs a Party, we should appreciate the relationship with the opposition, which has been beneficial to us. There is no proof whatsoever that the BBI Project is being funded by the named individuals. It appears the author is more seized with it and would have assisted us by unpacking it further, said Ziyambi.\n\nThe move has deepened tensions within Zanu PF, angering a faction backing Vice President Constantino Chiwenga as Mnangagwas successor.\n\nThis has created a tense atmosphere at the National Peoples Conference, which is being held in Mutare and is expected to cement last years resolution number one, extending Mnangagwas term.\n\nZiyambi further defended the BBI, describing it as a nation-building initiative rather than a treasonous plot.\n\nIt is surprising how the writer got hold of the Building Bridges Initiative (BBI) document if it was meant for Parliament. This tendency of stalking officials who are carrying out their duties is regrettable.\n\nThere is nothing treasonous about improving a political system. This BBI, which is being referred to, is not strange to us, and its actually promoting nation building and cohesion as compared to the authors divisive and inciteful document, said Ziyambi.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/02/10060245/tshabangu.jpeg",
            "description": "<p>By Darlington Gatsi Self-imposed Citizens Coalition for Change (CCC) Secretary General Sengezo Tshabangu is spearheading a plan to suspend the 2028 general elections, a move that would effectively extend President Emmerson Mnangagwa’s stay in power. This was revealed by ZANU-PF’s Secretary for Legal Affairs, Ziyambi Ziyambi, in a recent Politburo meeting. He was responding to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/after-destroying-ccc-tshabangu-now-pushing-for-suspension-of-2028-elections/\">After destroying CCC, Tshabangu now pushing for suspension of 2028 elections</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:05",
            "date": "16 Oct 2025"
        },
        {
            "title": "US plays downs claims Hamas is violating ceasefire deal over hostage remains",
            "url": "https://www.newzimbabwe.com/us-plays-downs-claims-hamas-is-violating-ceasefire-deal-over-hostage-remains/",
            "content": "BBC\n\nThe US has downplayed claims that Hamas is violating the ceasefire deal with Israel by not returning all the bodies of dead hostages.\n\nOnly nine of the 28 dead hostages have been returned, with Hamas saying it needs time and specialised equipment to recover the others from the ruins of Gaza.\n\nThe latest wo bodies returned on Wednesday have been identified as Inbar Hayman and Sgt Maj Muhammad al-Atresh, the Israel Defense Forces said early on Thursday.\n\nThe row over the return of dead hostages has led Israel to limit promised aid supplies to Gaza, but two senior advisers to US President Donald Trump have said plans to demilitarise the Strip and build a new transitional government are under way.\n\nIn an update on the implementation of Trumps 20-point peace plan, the advisers told reporters that the US government did not so far believe Hamas had broken the agreement by not retrieving more remains.\n\nThe advisers argued that Hamas had acted in good faith by returning all living hostages and was working with various interlocutors to find and return the remains of the others.\n\nHamass armed wing said in a statement it was committed to the deal but had returned all the bodies of hostages it was able to reach.\n\nOne senior US adviser said the recovery of all the bodies could take weeks because of the level of destruction in Gaza.\n\nHe said rewards might be offered for Gazan civilians who gave information and that Turkish experts were expected to join the search.\n\nConfirming the return of two more deceased hostages on Thursday, the IDF said Hayman was 27 when she was killed by Hamas on 7 October 2023 at the Nova festival. Her body was taken into the Gaza Strip.\n\nSgt Maj al-Atresh, who was 39, fell in combat on the same day, the IDF said.\n\nHamas is required to fulfill its part of the agreement and make the necessary efforts to return all the hostages to their families and to a dignified burial, it added.\n\nIn a statement, the Hostages Families Forum said: The families of the hostages and of those released embrace the families of Inbar Hayman and Muhammad al-Atresh, whose loved ones came home yesterday for proper burial in Israel.\n\nAlongside the grief and the understanding that their hearts will never be whole, the return of Inbar and Muhammad, may their memories be a blessing, brings some measure of comfort to families who have lived with agonising uncertainty for over two years.\n\nWe will not rest until all 19 hostages are brought home.\n\nHamas is required to return all 28 dead hostages as part of thefirst phase of the Gaza peace plan.\n\nBut Hamass armed wing said in a statement the remaining bodies require significant efforts and specialised equipment to search for and retrieve, and we are making a great effort to close this file.\n\nEarlier, Israel said it would not compromise on hostage returns, saying the mission is not complete.\n\nIsraels defence minister said he had instructed the IDF to prepare a comprehensive plan to defeat Hamas in Gaza in the event of a renewal of the war.\n\nAfter meeting senior generals on Wednesday, Israel Katz said the military must be prepared to act if Hamas refuses to implement the peace plan.\n\nThe latest repatriations came after Israel said one of four bodies returned by Hamas on Tuesday was not one of the missing hostages.\n\nUN humanitarian chief Tom Fletcherhas urged Israel to immediately open all border crossings into Gazafor humanitarian aid, as called for in the ceasefire plan.\n\nIn a post on X, Fletcher said Hamas must make strenuous efforts to return all the bodies of the deceased hostages.\n\nHe added: As Israel has agreed, they must allow the massive surge of humanitarian aid  thousands of trucks a week  on which so many lives depend, and on which the world has insisted.\n\nHe called for a genuine, practical, problem-solving approach to removing remaining obstacles and said withholding aid from civilians is not a bargaining chip.\n\nTrumps ceasefire plan, which both Israel and Hamas accepted, envisaged the handover of all 48 hostages would be completed by noon on Monday. Hamas returned all the 20 living hostages on Monday.\n\nBut the US-brokered ceasefire agreement appears to acknowledge that Hamas and other Palestinian factions may not have been able to find all hostage remains before the initial deadline on Monday.\n\nUnder the agreement, Israel also agreed to hand over the bodies of 15 Palestinians in return for every deceased Israeli hostage.\n\nSo far, Israel has returned the bodies of 90 Palestinians in exchange for the Israeli hostages remains.\n\nMeanwhile in Gaza, residents report growing concern about the durability of the ceasefire  and food prices have surged as Palestinians stockpile food.\n\nTraders and suppliers in the enclave have been hoarding food items to create shortages and drive up profits, fearing that the war could resume, local residents told the BBC.\n\nEvery time we start to feel safe, new threats appear, and we fear the war will start all over again, says mother-of-six Neven Al-Mughrabi, a displaced resident from Gaza who lives in Khan Younis.\n\nI lost my house in Gaza City, I decided to stay here with my family because I dont trust the ceasefire and were sick of displacement.\n\nShe added that a trader in Khan Youniss main market said demand for flour, oil and sugar had surged within hours. Despite the sudden rise of prices by about 30%, people are buying as if they dont trust the calm will last long, everyone is afraid aid will stop, Neven says.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/16070756/gaza.webp",
            "description": "<p>BBC The US has downplayed claims that Hamas is violating the ceasefire deal with Israel by not returning all the bodies of dead hostages. Only nine of the 28 dead hostages have been returned, with Hamas saying it needs time and specialised equipment to recover the others from the ruins of Gaza. The latest wo</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-plays-downs-claims-hamas-is-violating-ceasefire-deal-over-hostage-remains/\">US plays downs claims Hamas is violating ceasefire deal over hostage remains</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:05",
            "date": "16 Oct 2025"
        },
        {
            "title": "Zimbabwe’s Nate Landman sets franchise tackles record for the Los Angeles Rams",
            "url": "https://www.newzimbabwe.com/zimbabwes-nate-landman-sets-franchise-tackles-record-for-the-los-angeles-rams/",
            "content": "ESPN\n\nZimbabwesNate Landmanset a franchise tackles record for theLos Angeles Ramsin their 17-3 win over theBaltimore Ravensas Week 6 saw African players dominate on defense.\n\nTheSeattle SeahawksJaxon Smith-Njigbawas the one shining light on offense this week, but after coming flying out of the blocks at the start of the season, wide receivers with ties to the continent generally had a more quiet round.\n\nArguably more than any before, this week showed that the NFLs attempts to grow the sport in Africa are bearing fruit  both in terms of developments on and off the field.\n\nThe impenetrable Landman  born in Harare  set a Rams franchise record with 17 total tackles in their win over the Ravens, including a quarterback hit and eight solo tackles.\n\nA convert from rugby, former Colorado Buffaloes linebacker Landman had arguably the best game of his American football career in the Rams win. His defining moment came on the stroke of half-time, as he contributed to two crucial stops within 10 yards of the end zone, as well as another earlier tackle in the same drive which saw the Rams held up over the course of eight plays.\n\nAt the time, the scores were deadlocked at 3-3. The Rams defense, led by Landman, prevented the Ravens from taking control at a crucial point in the game. In the third quarter, the Rams themselves took charge and never looked back.\n\nWhat a stop by our guys, really buckling up there,Landman told Tom Bradyfor Fox Sports after the legendary quarterback selected him as his LFG Player of the Game. Thats the pride of the defense right there, how you play goal line, and we rose up to the occasion. Way to set the tone for the rest of the game.\n\nSmith-Njigba, who has ties to Sierra Leone through his grandfather, is on a run where everything he touches turns to gold  and much of what he touches turns to touchdowns.\n\nThe wide receiver scored a 61-yard touchdown in the Seattle Seahawks 20-12 win over theJacksonville Jaguars. It came at a crucial time, too, as the Seahawks had been 6-3 behind midway through the second quarter before he crept in behind the defense and latched onto aSam Darnoldpass.\n\nAlthough Landman walks away with Africas MVP honors this week as far as we are concerned, Smith-Njigba is the most likely candidate from the continent to be in the running for NFL MVP a the end of the season.\n\nSmith-Njigba made a total of eight catches for 162 yards. Although there were many other moments worth celebrating from players with ties to Africa in week 6  notably a hugely impressive 72-yard kick return fromKene Nwangwu(ties to Nigeria) in theNew York Jets defeat to theDenver Broncos there was ultimately nobody who could top Smith-Njigba in terms of a notable single play.\n\nHonorable mentions\n\nUchenna Nwosu who has family ties to Nigeria  got 1.5 sacks for the Seahawks in their win over the Jaguars.\n\nNigeria-born duoDavid OnyemataandRuke Orhorhoroeach picked up a sack as theAtlanta Falconsupset theBuffalo Bills24-14.Charles Omenihu who has ties to Nigeria through his parents  got one for theKansas City Chiefsas they gained a crucial 30-17 win over theDetroit Lions.\n\nEyioma Uwazurike who also has parental ties to Nigeria  made a sack for the Denver Broncos in their narrow win over the New York Jets.\n\nOdafe Oweh raised in a Nigerian household in New Jersey  also had a memorable Sunday as he got a sack on debut for theLos Angeles Chargersin their 29-27 win over theMiami Dolphins. Oweh was recently traded from the Baltimore Ravens.\n\nWeek 6 was one to remember for African-born players, with few if any that can compare in recent memory. Landman (born in Zimbabwe), Onyemata, Orhorhoro (both born in Nigeria) and Paye (born in Guinea) all had performances to remember.\n\nThere was a crucial development off the field, too, as Nigerian International Player Pathway (IPP) Program standout Basil Chijioke CJ Okoye was officially signed to the Baltimore Ravens active roster from their practice squad shortly before his third straight NFL regular season appearance.\n\nOkoye and the Ravens may have ended up on the losing side against Landmans Rams, but he  just as much as the Zimbabwean  will remember the weekend for years to come.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/16070248/nate-landman.jpeg",
            "description": "<p>ESPN Zimbabwe’s Nate Landman set a franchise tackles record for the Los Angeles Rams in their 17-3 win over the Baltimore Ravens as Week 6 saw African players dominate on defense. The Seattle Seahawks‘ Jaxon Smith-Njigba was the one shining light on offense this week, but after coming flying out of the blocks at the start of the season, wide receivers with ties</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-nate-landman-sets-franchise-tackles-record-for-the-los-angeles-rams/\">Zimbabwe’s Nate Landman sets franchise tackles record for the Los Angeles Rams</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:05",
            "date": "16 Oct 2025"
        },
        {
            "title": "DNC bus accident: Police want owner of medication found at crash scene to come forward",
            "url": "https://www.newzimbabwe.com/dnc-bus-accident-police-want-owner-of-medication-found-at-crash-scene-to-come-forward/",
            "content": "IOL\n\nThe South African Police Service (SAPS) in Limpopo has launched an official inquiry following the discovery of bottles appearing to be medication atthe site of the horrific bus crash on the N1 freeway near Makhado, which killed 43 people on Sunday.\n\nThe provincial commissioner of police in Limpopo, Lieutenant General Thembi Hadebe, confirmed that an inquiry docket has been opened by Makhado police in the Vhembe district to investigate the discovery. The bottles of medication were found on the accident scene, a few kilometres outside Makhado.\n\nThe inquiry comes as police explore potential contraventions of the countrys drug laws. According to the SAPS statement, Section 22A of the Medicines and Related Substances Act in South Africa makes it a crime to possess certain scheduled medicines without proper authorization.\n\nProvincial commissioner of police in Limpopo, Lieutenant General Thembi Hadebe. Image: SAPS\n\nLegally, someone is only permitted to possess and carry the quantity of medicine you have been prescribed by an authorized prescriber. Carrying a large quantity of medicine without exception is illegal, provincial police spokesperson, Colonel Malesela Ledwaba said.\n\nWhile the lawful owner of the medication has not yet been identified, police are treating the find seriously as their investigation into the cause of the fatal crash continues.\n\nThe tragedy occurred on Sunday, October 13, when a cross-border bus, reportedly travelling from Gqeberha to Zimbabwe and Malawi, veered off the mountainous road on the N1 and plunged down an embankment. The death toll rose to 43, with scores of other passengers injured.\n\nAlthough for now the lawful owner of the bottles of medication is not yet identified to get the explanation regarding its origin, the police have, in the meantime, opened an inquiry for further investigation, said Ledwaba.\n\nAnyone or the lawful owner of the medication is requested to contact the nearest police, call the SAPS toll-free number 08600 10111 or use the My SAPS App.\n\nVisuals seen on television news channels showed bottles of what appears to be BronCleer spewed among the luggage at the crash scene. The images and videos have sparked outrage, with many social media users accusing foreign nationals of looting South Africas health system.\n\nOn Tuesday,IOL reported that health authorities have moved to quash viral social media claims that South Africas public healthcare system is distributing BronCleer, a codeine-based cough syrup, insisting the medication is strictly controlled and only available through private or illegal channels.\n\nThe clarification comes amid a police bust in Kimberley that uncovered a stash of unregistered medicines  including BronCleer  being sold unlawfully by unlicensed operators.\n\nCity of Tshwanes MMC for Health Services, Tshegofatso Mashabela, has dismissed claims circulating on social media about public healthcare facilities in South Africa distributing BronCleer, a codeine-based cough syrup.\n\nMashabela clarified that BronCleer is a controlled substance and not included in the official formularies or procurement lists of any government hospitals or clinics.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/13122907/DNC-Bus.png",
            "description": "<p>IOL The South African Police Service (SAPS) in Limpopo has launched an official inquiry following the discovery of bottles appearing to be medication at the site of the horrific bus crash on the N1 freeway near Makhado, which killed 43 people on Sunday. The provincial commissioner of police in Limpopo, Lieutenant General Thembi Hadebe, confirmed that</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dnc-bus-accident-police-want-owner-of-medication-found-at-crash-scene-to-come-forward/\">DNC bus accident: Police want owner of medication found at crash scene to come forward</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:05",
            "date": "16 Oct 2025"
        }
    ]
}