{
    "news": [
        {
            "title": "Zim-born Jean Gasho, ‘Kubala tribe’ evicted from Scottish woodland, two arrested",
            "url": "https://www.newzimbabwe.com/zim-born-jean-gasho-kubala-tribe-evicted-from-scottish-woodland-two-arrested/",
            "content": "BBC\n\nMembers of a self-styled African tribe have been evicted from their camp on council-owned land in the Scottish Borders.\n\nThe three people, who call themselves the Kingdom of Kubala, have been staying in a wooded area near Jedburgh.\n\nThe tribe streamed the eviction live on TikTok on Thursday morning. It showed a man and a woman being led from the camp by uniformed officers.\n\nThe group had previously said they were reclaiming land that was stolen from their ancestors 400 years ago and refused to recognise the powers of the courts to evict them.\n\nA convoy of police, sheriffs officers and immigration enforcement officials moved into the camp at about 08:00. A police cordon had been in place since the early hours.\n\nDrone footage showed a long line of uniformed officers entering the camp before the detention of two members of the group was streamed on the social media feed.\n\nKofi Offeh, 36, a Ghanaian who describes himself as King Atehene, and handmaiden Kaura Taylor, from Texas, were handcuffed by immigration officers.\n\nIt is understood they have been arrested on suspicion of immigration offences.\n\nJean Gasho, 43, who is originally from Zimbabwe and calls herself Queen Nandi, left with her head covered, lying low in the back of a pick-up truck.\n\nThe cordon was lifted at about 10:00 when journalists were allowed back into the woodland.\n\nCouncil workmen could be seen dismantling the camp and throwing bags of blankets, clothes, food and drink into the back of a refuse lorry.\n\nMr Offeh and Ms Gasho first arrived in Jedburgh in the spring and they set up camp on a hillside above the town.\n\nThey were later joined by Ms Taylor, who calls herself Asnat.\n\nThe group have a large online presence, with more than 100,000 followers on TikTok and Facebook, and have received worldwide media attention.\n\nOn Wednesday, they were banned from moving back to private land they had already been evicted from, at a hearing at Selkirk Sheriff Court.\n\nLast week, the court granted an order banning them from any council land in the area, including where they had been staying.\n\nJedburgh and district councillor Scott Hamilton said he was very much relieved by the eviction.\n\nIt has been a long effort by the local council, police and other services to achieve this outcome, he said.\n\nIt is the absolute right outcome today. The locals have had to put up with a great deal with this.\n\nHe added: This is an industrial estate. There are businesses operating from here  they have been put under a huge amount of pressure over the last few months.\n\nWe have had to work through the courts and the law process and that does take its time but ultimately we have achieved the right outcome.\n\nBBC Scotland reporter Cameron Buttle, who was at the scene of the eviction, describes what he saw:\n\nI arrived this morning just after 06:30 and the police cordon was already in place.\n\nWe were kept well back from the piece of woodland the group had named the Kubala Kingdom. The authorities wanted everyone well back as they moved in.\n\nJust before 08:00 a convoy of cars and vans swept through the cordon and on down to the woods.\n\nA local man had his drone up, I joined the crowd and watched the screen to see the police, immigration officers and sheriff officers file along a path into the trees.\n\nThen a shout from a woman on her phone, one of the group was live streaming from inside the camp as the authorities moved in.\n\nEveryone was then glued to their screens watching events unfold.\n\nEventually we were allowed down to the woods. Inside the campsite was bare, rows and rows of black bin bags with the groups belongings spilling out.\n\nThere was nothing left of their Kingdom of Kubala.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/02180301/kubala.jpg",
            "description": "<p>BBC Members of a self-styled African tribe have been evicted from their camp on council-owned land in the Scottish Borders. The three people, who call themselves the Kingdom of Kubala, have been staying in a wooded area near Jedburgh. The tribe streamed the eviction live on TikTok on Thursday morning. It showed a man and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zim-born-jean-gasho-kubala-tribe-evicted-from-scottish-woodland-two-arrested/\">Zim-born Jean Gasho, ‘Kubala tribe’ evicted from Scottish woodland, two arrested</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:29",
            "date": "02 Oct 2025"
        },
        {
            "title": "Tagwirei to takeover from Mnangagwa – says Mliswa in leaked audio, adds that Chiwenga is being misled by wife to think he has influence in army",
            "url": "https://www.newzimbabwe.com/tagwirei-to-takeover-from-mnangagwa-says-mliswa-in-leaked-audio-adds-that-chiwenga-is-being-misled-by-wife-to-think-he-has-influence-in-army/",
            "content": "By Leopold Munhende\n\nOutspoken former legislator Temba Mliswa has sensationally declared businessman Kudakwashe Tagwirei as President Emmerson Mnangagwas natural successor, dismissing Vice President Constantino Chiwengas chances of ever taking over.\n\nIn a leaked audio of a phone conversation between Mliswa and controversial businessman Agrippa Bopela Masiyakurima, secretly recorded by the latter, Mliswa argued that Chiwenga is being misled by his wife, Miniyothabo Baloyi, into believing he still commands enough military influence to claim the presidency.\n\nMliswa, once a fierce critic of Tagwirei, defended his change of stance by insisting he has no permanent enemies but only permanent interests.\n\nThe person who is going to take over from Mnangagwa is someone he trusts, who will protect his interests, Tagwirei, said Mliswa.\n\nSocial media does not install a leader. To tell you the truth, I know how you feel about Mnangagwa but we cannot have permanent enemies, we should have permanent interests. Who does not eat, everyone is doing so.\n\nWalk with the father who is there, not a step-father. Chiwenga is a stepfather. We will lose deals because of things that do not matter, you are business people, you must look at things that make you money.\n\nBoth Masiyakurima and Mliswa appeared to agree on Tagwireis succession prospects, with Masiyakurima adding that he could never support Mnangagwa because of a failed US$5 million business deal between them.\n\nMliswa accused Chiwenga of corruption and pursuing personal vendettas, even over trivial issues such as unreceived wedding gifts.\n\nOnce considered the most powerful man in Zimbabwe after leading the November 2017 military intervention that toppled the late Robert Mugabe and ushered in Mnangagwa, Chiwenga is now widely viewed as having lost influence since retiring from the army to assume the role of deputy president.\n\nDespite perceptions that the military has shifted allegiance to the MnangagwaTagwirei faction within Zanu PF, Chiwenga reportedly still believes he retains significant sway.\n\nAdded Mliswa: There is no longer any opposition in Zanu PF, they are headed to a conference with Mnangagwa tightly holding onto power, there is no coup that will ever happen in Zimbabwe.\n\nThe cars that were given to the military came from Tagwirei with Zimbabwe Defence Forces (ZDF) Commander Phillip Valerio Sibanda saluting, remember Valerio is from ZIPRA, not ZANLA.\n\nChiwenga will never direct operations for the army, that will never happen. He removed his uniform. That man is being misled by his wife, he should remember that he no longer wears a uniform.\n\nBaloyi, a serving Colonel, has in recent months stepped up her public presence, which analysts view as part of both her own rebranding and that of the Chiwenga family. This comes as the Mnangagwa administration continues to face criticism over alleged corruption, ruthless tactics, and an expanding grip on key economic sectors such as mining.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/03/17054811/Kuda-Tagwirei.jpg",
            "description": "<p>By Leopold Munhende Outspoken former legislator Temba Mliswa has sensationally declared businessman Kudakwashe Tagwirei as President Emmerson Mnangagwa’s natural successor, dismissing Vice President Constantino Chiwenga’s chances of ever taking over. In a leaked audio of a phone conversation between Mliswa and controversial businessman Agrippa “Bopela” Masiyakurima, secretly recorded by the latter, Mliswa argued that Chiwenga</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tagwirei-to-takeover-from-mnangagwa-says-mliswa-in-leaked-audio-adds-that-chiwenga-is-being-misled-by-wife-to-think-he-has-influence-in-army/\">Tagwirei to takeover from Mnangagwa – says Mliswa in leaked audio, adds that Chiwenga is being misled by wife to think he has influence in army</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:29",
            "date": "02 Oct 2025"
        },
        {
            "title": "Robert Mugabe Jnr remanded in custody over dagga possession",
            "url": "https://www.newzimbabwe.com/robert-mugabe-jnr-remanded-in-custody-over-dagga-possession/",
            "content": "By Mary Taruvinga\n\nRobert Mugabe Jnr (33), son of the late former president Robert Mugabe, has been remanded in custody after appearing before Harare magistrate Lisa Mutendereki on charges of possessing dagga.\n\nHe will remain in custody until Friday, when the court is expected to hand down its bail ruling.\n\nProsecutor Mandirasa Chigumira told the court that Mugabe was arrested during a police traffic blitz on October 1 along 2nd Street Extension in Harare, after he drove against a one-way street in a silver Honda Fit.\n\nUpon searching the accuseds black sling bag, police officers recovered two sachets of dagga, one pack of Rizla, and a white dagga crusher, Chigumira said.\n\nThe court heard that Mugabe refused to sign the seizure receipt issued to him. The dagga was later weighed at Harare Main Post, confirming a total of two grams with a street value of US$30.\n\nThe seized dagga can be tendered in court as an exhibit, the prosecutor added.\n\nMugabe, who resides at 25 Budleigh Close, Helensview, Borrowdale, and is currently unemployed, was arrested on the spot and charged with unlawful possession of dagga.\n\nThe accused acted unlawfully, Chigumira stressed, urging the court to deny him immediate release.\n\nMagistrate Mutendereki remanded him in custody pending Fridays bail ruling.\n\nHe is represented by lawyer Ashiel Mugiya.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/02155751/robert-jnr-mugabe.webp",
            "description": "<p>By Mary Taruvinga Robert Mugabe Jnr (33), son of the late former president Robert Mugabe, has been remanded in custody after appearing before Harare magistrate Lisa Mutendereki on charges of possessing dagga. He will remain in custody until Friday, when the court is expected to hand down its bail ruling. Prosecutor Mandirasa Chigumira told the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/robert-mugabe-jnr-remanded-in-custody-over-dagga-possession/\">Robert Mugabe Jnr remanded in custody over dagga possession</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:29",
            "date": "02 Oct 2025"
        },
        {
            "title": "Nelson Mandela’s grandson Mandla ‘abducted’ by Israeli forces during intercept of humanitarian flotilla",
            "url": "https://www.newzimbabwe.com/nelson-mandelas-grandson-mandla-abducted-by-israeli-forces-during-intercept-of-humanitarian-flotilla/",
            "content": "IOL\n\nActivist and grandson of Nelson Mandela, Mandla Mandela, who was sailing to Gaza aboard a boat which is part of the Global Sumud Flotilla (GSF), has been kidnapped by Israeli forces who intercepted the flotilla in the early hours of Thursday.\n\nMandela prerecorded a message in case of interception by Israel.\n\nIm a citizen of the Republic of South Africa. If you are receiving this video, it means that we have been intercepted and have been abducted by the state of apartheid Israel, he said. I call you to request our government to exert pressure for my immediate release.\n\nThe South African group of the flotilla has condemned the interception of its vessels by Israeli occupation forces in international waters, describing the attack as a deliberate attempt to block humanitarian aid to Gaza.\n\nDelegates aboard the flotilla, which included South African civilians, were reportedly detained and faced drone and water cannon attacks.\n\nIn a statement, the Global Sumud Flotilla (GDF) confirmed that the Israeli occupation forces ambushed the Global Sumud Flotilla in international waters, detaining some of the delegates and attacking the vessels with drones and water cannons.\n\nThese actions represent yet another attempt to silence voices of solidarity and to prevent even the smallest lifeline of relief from reaching Gaza. This is illegal under international law, the GDF said in a statement.\n\nThe organisation emphasised that the flotillas mission was purely humanitarian and peaceful.\n\nThe GSF was carrying civilians committed to drawing attention to the devastating conditions faced by Palestinians. Their mission is peaceful. Their objective is humanitarian. Their interception exposes once more the reality that Gaza is held under siege not only by walls and checkpoints, but by warships, drones, and policies of isolation.\n\nThe GSF called on the South African government to act immediately to ensure the safe return of its citizens.\n\nThe Global Sumud Flotilla  RSA demands the immediate and unconditional release of all the delegates with full access to their lawyers, and for Israel to respect all international laws and measures governing the protection of civilians and humanitarian missions, the unhindered delivery of the humanitarian aid, and the lifting of the siege that continues to strangle Gaza, they said.\n\nOn Wednesday, Chrispin Phiri, spokesperson for the Department of International Relations and Cooperation (Dirco), emphasised South Africas call for restraint and adherence to international law.\n\nSouth Africa wishes to reiterate, in the strongest terms, its call for all actors to adhere strictly to international law, including the United Nations Convention on the Law of the Sea and relevant international humanitarian law principles, he said.\n\nPhiri stressed that the safety and security of the flotillas participants, includingSouth African citizens, are of paramount importance.\n\nThe safety, security, and physical integrity of all unarmed participants aboard the Flotilla, including South African citizens, are of paramount importance, he added.\n\nHe warned that any military engagement or forceful detention of the vessels in international waters would constitute a serious breach of international norms. Phirifurther highlighted the peaceful and humanitarian mission of theflotilla.\n\nIt must be underscored that the Flotilla is a civilian-led initiative, embarked upon a peaceful and humanitarian mission. Its participants aim to draw attention to the severe and urgent humanitarian needs of the Palestinian people in Gaza and to deliver vital aid to alleviate the widespread suffering, Phiri said.\n\nOther South Africans who are part of the mission include Fatima Hendricks, Zaheera Soomar, Zukisa Wanner, Reaaz Moola, Bashera Soomar and Carolyn Shelver.\n\nFormer Economic Freedom Fighters (EFF) MP Mbuyiseni Ndlozi shared his support of Mandela. \n\nMandla Mandela! Selfless brave soul. You make us eternally proud Madiba. Strength to the Sumud Flotilla, Free Palestine, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/02093932/mandla-.png",
            "description": "<p>IOL Activist and grandson of Nelson Mandela, Mandla Mandela, who was sailing to Gaza aboard a boat which is part of the Global Sumud Flotilla (GSF), has been kidnapped by Israeli forces who intercepted the flotilla in the early hours of Thursday. Mandela prerecorded a message in case of interception by Israel. “I’m a citizen</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nelson-mandelas-grandson-mandla-abducted-by-israeli-forces-during-intercept-of-humanitarian-flotilla/\">Nelson Mandela’s grandson Mandla ‘abducted’ by Israeli forces during intercept of humanitarian flotilla</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:29",
            "date": "02 Oct 2025"
        },
        {
            "title": "Mugabe’s son arrested over illegal drugs possession",
            "url": "https://www.newzimbabwe.com/mugabes-son-arrested-over-illegal-drugs-possession/",
            "content": "By Staff Reporter\n\nFormer President Robert Mugabes son, Robert Mugabe Jr. (33), is set to appear in court in Harare today.\n\nThis follows his arrest on Wednesday after he was allegedly found in possession of cannabis and cocaine.\n\nWATCH: Mugabe's son arrested over illegal drugs possession\n\nRead more:https://t.co/aBEsNpCHCdhttps://t.co/4kaaN5zVdmpic.twitter.com/WOiNPOC2IA\n\n NewZimbabwe.com (@NewZimbabweCom)October 2, 2025\n\nMore details to follow\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/02082338/Robert-Mugabe-Jr-Regalia2.jpg",
            "description": "<p>By Staff Reporter Former President Robert Mugabe’s son, Robert Mugabe Jr. (33), is set to appear in court in Harare today. This follows his arrest on Wednesday after he was allegedly found in possession of cannabis and cocaine. WATCH: Mugabe's son arrested over illegal drugs possession Read more: https://t.co/aBEsNpCHCd https://t.co/4kaaN5zVdm pic.twitter.com/WOiNPOC2IA — NewZimbabwe.com (@NewZimbabweCom) October</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mugabes-son-arrested-over-illegal-drugs-possession/\">Mugabe’s son arrested over illegal drugs possession</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:29",
            "date": "02 Oct 2025"
        },
        {
            "title": "NoViolet Bulawayo wins the best of 25 years of the Caine Prize. Why she deserves it",
            "url": "https://www.newzimbabwe.com/noviolet-bulawayo-wins-the-best-of-25-years-of-the-caine-prize-why-she-deserves-it/",
            "content": "The Conversation\n\nZimbabwean writerNoViolet Bulawayohas beenhonouredas Africas best short story writer after winning theBest of Caine Award. The special recognition marks 25 years of the annualCaine Prize for African Writing.\n\nAn esteemed panel of judges unanimously selected Bulawayo as the standout winner of the 25 stories awarded the prize so far. Her short story,Hitting Budapest, won the prize in 2011. She has gone on to publish two acclaimed novels,We Need New NamesandGlory. Both were shortlisted for the Booker Prize.\n\nFor me as ascholarof African literary cultures, Bulawayos recognition by the judges feels like a generational milestone. Hitting Budapest follows a band of children wandering in a decaying urban landscape in search of food. Their journey, told through a fractured, childlike voice, captures both the immediacy of play and the stark realities of deprivation.\n\nThe storys unsettling blend of innocence and brutality provoked livelydebatewhen it appeared. It raised questions about the aesthetics of the African literature the prize sought to celebrate. About whether its power lived in its inventive narration and perspective, or whether it leaned too easily into global appetites for African suffering and spectacle.\n\nBut there was never any doubt about Bulawayos singular talent. Shes today known for her virtuoso ability with language and her sharp eye for the textures of African life.\n\nNoViolet Bulawayo, the pen name of Elizabeth Tshele, was born in 1981 in Tsholotsho, Zimbabwe. She grew up in the city of Bulawayo, from which she takes part of her literary name. NoViolet is in honour of her late mother, Violet. She later moved to the US, where she studied and began her writing career.\n\nIn 2013, her debut novel We Need New Names announced her arrival as a major talent. Its sharp social observation, childlike candour, and lyrical experimentation made it both accessible and unsettling. Her Caine Prize story makes up the first chapter of this book.\n\nA decade later,Gloryconfirmed her daring imagination. Set in an allegorical animal kingdom, it transforms Zimbabwes turbulent politics into a fable of authoritarianism and resistance. Its inventive form  mixing satire, oral traditions, and digital-age idioms  reimagines how the novel can respond to todays African realities.\n\nTogether, these works have marked Bulawayo as a defining voice of her generation. She isnt afraid to stretch the form of the African novel while capturing the hopes and contradictions of our times.\n\nSince its inauguration in 2000, theCaine Prize for African Writinghas set itself a lofty goal: to identify and celebrate a new generation of African writers.\n\nWhen the first-ever prize was awarded to acclaimed Sudanese writerLeila Aboulelathat year, it signalled a shift: the new African writers were not just beholden to writing back to colonial history, they wrote from the urgency of their own moment.\n\nManypast Caine winnershave gone on to make enduring contributions to African literature.Binyavanga Wainaina,Helon Habila,Yvonne Adhiambo Owuor,Brian Chikwava,Mary Watson, among others. Their work shows how the prize has provided a platform for innovative writing that unsettles conventions and shifts the contours of the field.\n\nOn average more than 200 entries are received each year, and significantly, more women than men have won the prize. This is notable compared to the heavily male-dominatedAfrican Writers Seriesgeneration of the 1960s. These included literary powerhouses LikeChinua Achebe,Wole SoyinkaandNgg wa Thiongo.\n\nUnlike many other prizes, the Caine made a decision early on to accept entries frominternet publications. This proved prescient. Online platforms have inspired a boom in short stories. The art form has links with age-old traditions of storytelling in Africa and seems particularly suited to the pace of contemporary living.\n\nBeyond the award, the Caine Prize has hosted annual writing workshops in various African cities, helping to nurture local literary communities. Its award ceremonies have been accompanied by efforts to ensure the stories remain accessible to African readers.\n\nToday, more than a dozen African co-publishers distribute the Caine Prize anthologies. These books include each years shortlisted stories and workshop entries.\n\nFor much of its history, the Caine Prize has championed the African short story written in English, by writers based either on the continent or abroad. This has not been without controversy, especiallydebatesabout who counts as an African writer, and why the prize is based in the UK rather than Africa.\n\nIf anything, the prize has forced readers to think harder about who belongs to an African literary community, and who gets left out when boundaries are drawn too tightly. The true currency of prizes is recognition, and in this sense the Caine has often exceeded expectations by bringing visibility to writers who might not otherwise have reached global audiences.\n\nControversies endure. The prizes location in Europe, its emphasis on the short story form, andits rolein shaping global perceptions of African literature all remain points of contention.\n\nEven with that noise in the background, the Caine Prize remains the only freestanding and consistent award dedicated solely to African writing. That distinction alone has made it the preeminent platform for new African voices in the 2000s.\n\nBulawayos crowning as the best of the lot underscores both the continuity and the evolution of the prize. All the winners embody or react against African political and social contexts, at the same time addressing issues of race, identity, sexuality and historical injustices.\n\nThe Caine Prize has been an imperfect but vital incentive for a new generation of African writers and their often politically charged perspectives. It has sparked robust discourse, created opportunities, and amplified voices that might have been overlooked. It has become a cultural institution to be reckoned with and arguably the most influential global event for African literature.\n\nAnd in celebrating NoViolet Bulawayo at its 25-year mark, it affirms what many already knew: she is a generational talent, one whose work will resonate far beyond the prize itself.\n\nAssistant Professor, Harvard University\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/02061520/noviolet-bulawayo.png",
            "description": "<p>The Conversation Zimbabwean writer NoViolet Bulawayo has been honoured as Africa’s best short story writer after winning the Best of Caine Award. The special recognition marks 25 years of the annual Caine Prize for African Writing. An esteemed panel of judges unanimously selected Bulawayo as the standout winner of the 25 stories awarded the prize so far. Her short story, Hitting Budapest,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/noviolet-bulawayo-wins-the-best-of-25-years-of-the-caine-prize-why-she-deserves-it/\">NoViolet Bulawayo wins the best of 25 years of the Caine Prize. Why she deserves it</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:29",
            "date": "02 Oct 2025"
        },
        {
            "title": "Cardi B claims Nicki Minaj is on drugs, bipolar, and her husband takes her credit card",
            "url": "https://www.newzimbabwe.com/cardi-b-claims-nicki-minaj-is-on-drugs-bipolar-and-her-husband-takes-her-credit-card/",
            "content": "Complex\n\nAs the fiery beef betweenNicki MinajandCardi Brages on, the two rappers continue to fire off inflammatory accusations against each other.\n\nIn the latest installment of the saga, Cardi accuses Minaj of being on drugs. Quiet as kept the truth is you BEEN diagnosed with schizophrenia and bipolar for almost 9 years and you also on heavy drugs COCAINE..PERCS.. AND XANAX!!! the Bodak Yellow rapper alleges. You dont listen to nobody around you.. the only person that have the power is Kenneth Petty but you know what happens wit that Amex when you sedated.\n\nCardi is referring to Minajs husband,Kenneth Petty,claiming he takes away her credit card.\n\nCardi B on X\n\nThe rapper also warned Minaj to keep her child out of the arguments, while doubling down on her claim that Minajs son, Papa Bear, is developmentally disabled. Im letting you know again.. stop playing with my kid btch.. you just mad cuz your son fav color is 5.. GET TF ON YOU CRACKHEAD, she wrote on X.\n\nCardi B on X\n\nMinaj fired back, writing, tucking a DL man raw & got pregnant wit another monkey. You said oh well, he all our baby daddies now, referring to Stefon Diggs allegedly fathering a child with another woman. Your husband said he NEVER LIKED YOU. Your pussy on YUCK. HUBBY told PEE YEARS ago how UGLY you look always swollen & botched in the face from surgery. So guess what? Zoo TAKE MY MONEY!!!!! YASSSSS ZADDY. OWWWWW. Its BOTH OUR MONEY NEOW ZADDY.\n\nNicki Minaj on X\n\nShe also brought up Quavo, the former Migos member alongside Cardis ex-husband, Offset. Quavo was it worth it dummy? No career, takeoff gone. Remember you told me u were the Beyonc of the group? I laughed so hard inside. Anyway. Pay offset his alimony Barney B.\n\nOn Monday (Sept. 29), their feud resurfaced following the release of Cardis latest album,Am I The Drama?Since then, the two have exchanged devastating blows, with the conflict escalating from petty remarks about album sales to accusations of drug use, assault, and more.\n\nMinaj took aim at Cardis youngest, tweeting, Kulture vulture you ugly too, and Cardi countered with, Your son nonverbal cuz you fucked him up wit them drugs.\n\nThe feud entered its third day with no end in sight, and Minajs 2026 album could add further fuel to the fire. Of course, we rounded up all the wild and viciousinsults on social media between the two here.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/02061053/cardinicki_yaqumh.webp",
            "description": "<p>Complex As the fiery beef between Nicki Minaj and Cardi B rages on, the two rappers continue to fire off inflammatory accusations against each other. In the latest installment of the saga, Cardi accuses Minaj of being on drugs. “Quiet as kept the truth is you BEEN diagnosed with schizophrenia and bipolar for almost 9 years and you also</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cardi-b-claims-nicki-minaj-is-on-drugs-bipolar-and-her-husband-takes-her-credit-card/\">Cardi B claims Nicki Minaj is on drugs, bipolar, and her husband takes her credit card</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:29",
            "date": "02 Oct 2025"
        }
    ]
}