{
    "news": [
        {
            "title": "Knowledge Musona joins Scottland FC",
            "url": "https://www.newzimbabwe.com/knowledge-musona-joins-scottland-fc/",
            "content": "By Sports Reporter\n\nFormer Warriors captain Knowledge Musona has officially joined Scottland FC.\n\nThe 34-year-old forward joins the Mabvuku-based side as a free agent after parting ways with Saudi Arabian club Al-Okhdood earlier this month.\n\nMusona joins his younger brother Walter at Scottland, with the two set to play for the same club for the first time.\n\nThe former Kaizer Chiefs star will be featuring in the Zimbabwe Premier League for the first time in his career, having left Aces Academy for South Africa back in 2010.\n\nKnowledge Musona becomes Scottlands fourth mid-season signing, joining Terrence Dzvukamanja, Khuda Muyaba, and Moses Shidolo.\n\nMore to follow\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/12095834/Zimbabwe_captain_Knowledge_Musona_during_the_2021_Africa_Cup_of_Nations.JPG.webp",
            "description": "<p>By Sports Reporter Former Warriors captain Knowledge Musona has officially joined Scottland FC. The 34-year-old forward joins the Mabvuku-based side as a free agent after parting ways with Saudi Arabian club Al-Okhdood earlier this month. Musona joins his younger brother Walter at Scottland, with the two set to play for the same club for the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/knowledge-musona-joins-scottland-fc/\">Knowledge Musona joins Scottland FC</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:35",
            "date": "28 Jul 2025"
        },
        {
            "title": "Unlock opportunities: explore 1win bonuses and start playing today",
            "url": "https://www.newzimbabwe.com/unlock-opportunities-explore-1win-bonuses-and-start-playing-today/",
            "content": "In Nigerias booming online betting landscape, players arent just searching for fun  theyre also seeking real value. And thats exactly what 1win delivers. Whether youre a casual gamer or a passionate sports fan, 1win combines exciting gameplay with a rich array of promotions that reward both new and returning users.\n\nFrom the moment you land on the platform, its clear that bonuses are more than just a marketing tool  theyre an integral part of the 1win experience. Designed to enhance engagement and extend playtime, these offers range from welcome packages to cashback deals and event-specific promotions tailored to the Nigerian audience.\n\nWhat also sets1winapart is how easy it is to get started. The registration process is simple, fast, and designed for mobile-first users who want to jump in without unnecessary delays. In just a few steps, anyone can create an account, claim a bonus, and place their first bet  no technical knowledge or prior experience required.\n\nIn this article, well highlight the exciting promotions available specifically for Nigerian players and guide you through the process of joining 1win today. Whether youre in it for the games, the rewards, or both, this platform ensures that your journey begins with an edge.\n\nOne of the standout advantages of using 1win in Nigeria is the platforms generous bonus system. Rather than limiting rewards to new users only, 1win continues to engage its Nigerian audience through a variety of dynamic promotions. These bonuses are crafted not just to attract, but also to retain  giving both beginners and seasoned bettors more reasons to stay and play.\n\nBelow is a detailed look at the key bonuses and offers available for Nigerian users, showcasing the value and variety that make 1win a rewarding experience:\n\nThese promotions are regularly updated and often tailored to align with trends in Nigerian betting behavior, such as a spike in interest during local football derbies or public holidays. Most importantly, 1win ensures that claiming these bonuses is quick, transparent, and free from complicated conditions  meaning more time playing and less time decoding fine print.\n\nBy blending flexibility with real value, 1wins bonus system shows its commitment to Nigerian users who want not just entertainment, but rewards that truly matter.\n\nGetting started on 1win is fast, user-friendly, and designed for all experience levels  whether youre new to online gaming or making a switch from another platform. The registration process is optimized for Nigerian players, allowing access through mobile devices, desktops, or even the dedicated app without hassle. Heres how you can create your account and begin your journey in just a few easy steps:\n\nThis entire process takes only a few minutes and doesnt require any complicated documentation upfront. Plus, the interface supports English and offers local customization, so Nigerian players can register with ease and familiarity.\n\nWith your account activated, the full world of 1win Nigeria opens up  from thrilling casino games and live betting to bonus opportunities and secure transactions, all from one convenient platform.\n\nThe journey into online gaming doesnt have to be complex  and with 1win Nigeria, its as simple as it is rewarding. From the moment you register, youre met with an inviting platform built to serve your preferences, whether you enjoy sports betting, casino games, or chasing bonus opportunities.\n\nWhat truly sets 1win apart is its dedication to making each step of the user experience smooth and localized. From easy sign-up methods to Nigerian-friendly payment systems and tailored promotional offers, the platform is designed to help you get started fast and stay engaged longer.\n\nFor those seeking both fun and fairness, 1win delivers. With just a few taps, you gain access to a complete entertainment hub that doesnt just welcome you  it keeps rewarding you every step of the way. Whether youre a beginner or a seasoned player, 1win ensures your gaming journey begins on the right foot and keeps moving forward with purpose.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/28095434/Screenshot-2025-07-28-at-10.51.39.png",
            "description": "<p>In Nigeria’s booming online betting landscape, players aren’t just searching for fun — they’re also seeking real value. And that’s exactly what 1win delivers. Whether you’re a casual gamer or a passionate sports fan, 1win combines exciting gameplay with a rich array of promotions that reward both new and returning users. From the moment you</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/unlock-opportunities-explore-1win-bonuses-and-start-playing-today/\">Unlock opportunities: explore 1win bonuses and start playing today</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:35",
            "date": "28 Jul 2025"
        },
        {
            "title": "Ex-convict gets horticulture starter pack as ZPCS rehabilitation and reintegration policy bears fruits",
            "url": "https://www.newzimbabwe.com/ex-convict-gets-horticulture-starter-pack-as-zpcs-rehabilitation-and-reintegration-policy-bears-fruits/",
            "content": "By James Muonwa\n\nA REHABILITATED former inmate at Chinhoyi Farm Prison has found renewed hope of life after undergoing training in horticulture, which will be his source of livelihood post-incarceration.\n\nBernard Bennet (37), who completed a two-year jail term for robbery, at the weekend, upon his release, became the first beneficiary of the reintegration programme, receiving a horticultural starter pack consisting of a water pump, knapsack sprayer, seed and fertilizers.\n\nBennet is expected to start an income-generating horticultural project at his rural home in Zvimba.\n\nSpeaking at the handover ceremony, Zimbabwe Prisons and Correctional Services (ZPCS) Officer Commanding Mashonaland West, Commissioner Luke Zondai Makuvire expressed confidence that the pilot project will help reduce chances of re-offending.\n\nZPCS Officer Commanding Mashonaland West Commissioner Makuvire hands over a knapsack sprayer, among other goods, to ex-convict as he heads home\n\nWhat makes this event more special than any other release is that for the first time in Mashonaland West province, Bernard Bennet is being released and given a starter pack to go and start a new life devoid of crime, said Makuvire.\n\nThe ZPCS provincial commander noted that the event marked a major milestone in prison management as enunciated in his turnaround blueprint rolled out on May 15, 2023.\n\nThe turnaround strategy is meant to address certain challenges bedevilling the ZPCS thereby improving the welfare of both inmates and officers. This is exactly what we are witnessing today.\n\nMakuvire said the occasion marked the fulfilment of ZPCS mandate which is to protect society from criminal elements through incarceration and rehabilitation of offenders for their successful reintegration into society whilst exercising reasonable, safe, secure and human control.\n\nHe reiterated progress ZPCS has made in recent years in closing the missing link of reintegration of inmates back into society.\n\nWe have been doing well in terms of fulfilling our mandate of incarceration and rehabilitation, but the missing link has been the reintegration aspect. I am proud but remain humble that this aspect has finally been realised, said the commissioner.\n\nFormer inmate Bernard Bennet bid ZPCS officers farewell\n\nWithout reintegration, he added, ex-convicts find it difficult to join society and face rejection resulting in recidivism.\n\nAddressing guests gathered to witness the release and handover ceremony, Chinhoyi Prison Farm Officer-in-Charge Superintendent Gilbert Mavhako said Bennets release was a unique milestone.\n\nThis event is more than just the end of a prison sentence; it is a powerful symbol of renewal, personal growth, and the triumph of rehabilitation. It reflects the core purpose of our correctional efforts  to restore dignity, rebuild lives, and return individuals to society better equipped to contribute positively.\n\nBennets journey reminds us all that with the right support, opportunities, and determination, transformation is not only possible but attainable.\n\nHe is a shining example of how rehabilitation programmes can cultivate not only crops, but character.\n\nDuring his time in incarceration, Bennet did not allow his circumstances to define his future. Instead, he embraced the opportunity for growth and development through the prisons rehabilitation programmes. He dedicated himself to horticultural training, acquiring hands-on experience in crop production, nursery management, soil preparation, composting, and sustainable irrigation techniques.\n\nThe produce from the farm not only fed fellow inmates but also supported prison operations, giving him a clear purpose and a feeling of being useful once again.\n\nOn his part, Bennet thanked the ZPCS command element led by Commissioner Makuvire for moulding him into a better and purposeful citizen.\n\nI promise to put the skills and resources to good use and rebuild my life free of crime. I will never return to this system as a criminal but to give back to a system that gave me a fresh start to life, said Bennet, who returns to his wife who stood by him throughout his incarceration.\n\nThe reintegration initiative will benefit inmates pursuing other vacations in animal husbandry, crop production, tailoring, carpentry, among other projects.\n\nThe initiative reinforces ZPCSs commitment to ensuring the rehabilitation of offenders and supporting their reintegration into the community through practical empowerment initiatives.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/28073824/IMG_6718-scaled.jpg",
            "description": "<p>By James Muonwa  A REHABILITATED former inmate at Chinhoyi Farm Prison has found renewed hope of life after undergoing training in horticulture, which will be his source of livelihood post-incarceration. Bernard Bennet (37), who completed a two-year jail term for robbery, at the weekend, upon his release, became the first beneficiary of the reintegration programme,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ex-convict-gets-horticulture-starter-pack-as-zpcs-rehabilitation-and-reintegration-policy-bears-fruits/\">Ex-convict gets horticulture starter pack as ZPCS rehabilitation and reintegration policy bears fruits </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:35",
            "date": "28 Jul 2025"
        },
        {
            "title": "CAPS United beat Highlanders as Manica Diamonds and Simba Bhora share spoils",
            "url": "https://www.newzimbabwe.com/caps-united-beat-highlanders-as-manica-diamonds-and-simba-bhora-share-spoils/",
            "content": "By Sports Reporter\n\nNYASHA Chintulis second-half strike made the difference between CAPS United and Highlanders at Rufaro Stadium in a match, which ended 1-0 in favour of the former on Sunday\n\nThe two sides staged a goalless first half, which nothing much to write home about as they both created a few chances.Coming back to the second half, CAPS United finally found the back of the net in the 67th minute through Chintuli, who benefited from a Phenias Bamusi through-pass in the penalty area.The visitors almost equalised in the 83rd minute, but still CAPS Uniteds goalkeeper was equal to the task to keep his side ahead.Sundays win saw Makepekepe bouncing back to winning ways, at the same time ending their three match winless run.Sitting on ninth position on the log, CAPS United are now on 28 points, the same with Highlanders who maintained their eigth spot on the table.Elsewhere, at Sakubva Stadium in Mutare, log leaders Simba Bhora played a 1-1 draw against Manica Diamonds.The Shamva-based side went for the break leading 1-0 thanks to Nomore Tsaboras goal, which was cancelled in the 80th minute through Anelka Chiwandires strike.Despite the draw, Simba stretched its lead on top with a point as they are now on 44 points, two ahead of second place occupiers MWOS, who are on 42 points.Sunday PSL ResultsCAPS United 1-0 HighlandersChicken Inn 3-0 DynamosTriangle United 3-0 Bikita MineralsManica Diamonds 1-1 Simba Bhora.\n\nThe two sides staged a goalless first half, which nothing much to write home about as they both created a few chances.\n\nComing back to the second half, CAPS United finally found the back of the net in the 67th minute through Chintuli, who benefited from a Phenias Bamusi through-pass in the penalty area.The visitors almost equalised in the 83rd minute, but still CAPS Uniteds goalkeeper was equal to the task to keep his side ahead.Sundays win saw Makepekepe bouncing back to winning ways, at the same time ending their three match winless run.Sitting on ninth position on the log, CAPS United are now on 28 points, the same with Highlanders who maintained their eigth spot on the table.Elsewhere, at Sakubva Stadium in Mutare, log leaders Simba Bhora played a 1-1 draw against Manica Diamonds.The Shamva-based side went for the break leading 1-0 thanks to Nomore Tsaboras goal, which was cancelled in the 80th minute through Anelka Chiwandires strike.Despite the draw, Simba stretched its lead on top with a point as they are now on 44 points, two ahead of second place occupiers MWOS, who are on 42 points.Sunday PSL ResultsCAPS United 1-0 HighlandersChicken Inn 3-0 DynamosTriangle United 3-0 Bikita MineralsManica Diamonds 1-1 Simba Bhora.\n\nComing back to the second half, CAPS United finally found the back of the net in the 67th minute through Chintuli, who benefited from a Phenias Bamusi through-pass in the penalty area.\n\nThe visitors almost equalised in the 83rd minute, but still CAPS Uniteds goalkeeper was equal to the task to keep his side ahead.Sundays win saw Makepekepe bouncing back to winning ways, at the same time ending their three match winless run.Sitting on ninth position on the log, CAPS United are now on 28 points, the same with Highlanders who maintained their eigth spot on the table.Elsewhere, at Sakubva Stadium in Mutare, log leaders Simba Bhora played a 1-1 draw against Manica Diamonds.The Shamva-based side went for the break leading 1-0 thanks to Nomore Tsaboras goal, which was cancelled in the 80th minute through Anelka Chiwandires strike.Despite the draw, Simba stretched its lead on top with a point as they are now on 44 points, two ahead of second place occupiers MWOS, who are on 42 points.Sunday PSL ResultsCAPS United 1-0 HighlandersChicken Inn 3-0 DynamosTriangle United 3-0 Bikita MineralsManica Diamonds 1-1 Simba Bhora.\n\nThe visitors almost equalised in the 83rd minute, but still CAPS Uniteds goalkeeper was equal to the task to keep his side ahead.\n\nSundays win saw Makepekepe bouncing back to winning ways, at the same time ending their three match winless run.Sitting on ninth position on the log, CAPS United are now on 28 points, the same with Highlanders who maintained their eigth spot on the table.Elsewhere, at Sakubva Stadium in Mutare, log leaders Simba Bhora played a 1-1 draw against Manica Diamonds.The Shamva-based side went for the break leading 1-0 thanks to Nomore Tsaboras goal, which was cancelled in the 80th minute through Anelka Chiwandires strike.Despite the draw, Simba stretched its lead on top with a point as they are now on 44 points, two ahead of second place occupiers MWOS, who are on 42 points.Sunday PSL ResultsCAPS United 1-0 HighlandersChicken Inn 3-0 DynamosTriangle United 3-0 Bikita MineralsManica Diamonds 1-1 Simba Bhora.\n\nSundays win saw Makepekepe bouncing back to winning ways, at the same time ending their three match winless run.\n\nSitting on ninth position on the log, CAPS United are now on 28 points, the same with Highlanders who maintained their eigth spot on the table.Elsewhere, at Sakubva Stadium in Mutare, log leaders Simba Bhora played a 1-1 draw against Manica Diamonds.The Shamva-based side went for the break leading 1-0 thanks to Nomore Tsaboras goal, which was cancelled in the 80th minute through Anelka Chiwandires strike.Despite the draw, Simba stretched its lead on top with a point as they are now on 44 points, two ahead of second place occupiers MWOS, who are on 42 points.Sunday PSL ResultsCAPS United 1-0 HighlandersChicken Inn 3-0 DynamosTriangle United 3-0 Bikita MineralsManica Diamonds 1-1 Simba Bhora.\n\nSitting on ninth position on the log, CAPS United are now on 28 points, the same with Highlanders who maintained their eigth spot on the table.\n\nElsewhere, at Sakubva Stadium in Mutare, log leaders Simba Bhora played a 1-1 draw against Manica Diamonds.The Shamva-based side went for the break leading 1-0 thanks to Nomore Tsaboras goal, which was cancelled in the 80th minute through Anelka Chiwandires strike.Despite the draw, Simba stretched its lead on top with a point as they are now on 44 points, two ahead of second place occupiers MWOS, who are on 42 points.Sunday PSL ResultsCAPS United 1-0 HighlandersChicken Inn 3-0 DynamosTriangle United 3-0 Bikita MineralsManica Diamonds 1-1 Simba Bhora.\n\nElsewhere, at Sakubva Stadium in Mutare, log leaders Simba Bhora played a 1-1 draw against Manica Diamonds.\n\nThe Shamva-based side went for the break leading 1-0 thanks to Nomore Tsaboras goal, which was cancelled in the 80th minute through Anelka Chiwandires strike.Despite the draw, Simba stretched its lead on top with a point as they are now on 44 points, two ahead of second place occupiers MWOS, who are on 42 points.Sunday PSL ResultsCAPS United 1-0 HighlandersChicken Inn 3-0 DynamosTriangle United 3-0 Bikita MineralsManica Diamonds 1-1 Simba Bhora.\n\nThe Shamva-based side went for the break leading 1-0 thanks to Nomore Tsaboras goal, which was cancelled in the 80th minute through Anelka Chiwandires strike.\n\nDespite the draw, Simba stretched its lead on top with a point as they are now on 44 points, two ahead of second place occupiers MWOS, who are on 42 points.Sunday PSL ResultsCAPS United 1-0 HighlandersChicken Inn 3-0 DynamosTriangle United 3-0 Bikita MineralsManica Diamonds 1-1 Simba Bhora.\n\nDespite the draw, Simba stretched its lead on top with a point as they are now on 44 points, two ahead of second place occupiers MWOS, who are on 42 points.\n\nSunday PSL ResultsCAPS United 1-0 HighlandersChicken Inn 3-0 DynamosTriangle United 3-0 Bikita MineralsManica Diamonds 1-1 Simba Bhora.\n\nSunday PSL Results\n\nCAPS United 1-0 HighlandersChicken Inn 3-0 DynamosTriangle United 3-0 Bikita MineralsManica Diamonds 1-1 Simba Bhora.\n\nCAPS United 1-0 Highlanders\n\nChicken Inn 3-0 Dynamos\n\nTriangle United 3-0 Bikita Minerals\n\nManica Diamonds 1-1 Simba Bhora.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/03/19155655/Joseph-Thulani-celebrates-after-scoring-for-Caps-United-against-Manica-Diamonds-at-the-National-Sports-Stadium-on-Sunday.jpg",
            "description": "<p>By Sports Reporter NYASHA Chintuli’s second-half strike made the difference between CAPS United and Highlanders at Rufaro Stadium in a match, which ended 1-0 in favour of the former on Sunday The two sides staged a goalless first half, which nothing much to write home about as they both created a few chances. Coming back</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/caps-united-beat-highlanders-as-manica-diamonds-and-simba-bhora-share-spoils/\">CAPS United beat Highlanders as Manica Diamonds and Simba Bhora share spoils</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:35",
            "date": "28 Jul 2025"
        },
        {
            "title": "High Court reinstates magistrate Mupindu as trustee in property dispute with estranged lawyer husband",
            "url": "https://www.newzimbabwe.com/high-court-reinstates-magistrate-sandra-mupindu-as-a-trustee-in-property-dispute-with-estranged-lawyer-husband/",
            "content": "By Mary Taruvinga\n\nThe High Court of Zimbabwe has reinstated magistrate Sandra Mupindu as a trustee of the Shamba Charashika Bvumavaranda Trust, overturning what it described as a procedurally flawed amendment to the trust deed by her estranged husband, Simon Mupindu.\n\nThe couple is going through a nasty divorce after Simon, a top Harare lawyer ditched the magistrate for his former intern, Catherine Tatenda Chitopota.\n\nSimon is the one who has filed for divorce and the matter is still pending.\n\nSimon, now based in Chivhu, is also suing Chitopota for adultery.\n\nSandra told the High Court that Simon replaced her with Chitopota in the trust prompting her to approach the courts for redress.\n\nJustice Vivian Ndlovu sitting at the Harare High Court ruled in favour of Sandra declaring the Notarial Deed of Amendment to the trustregistered in 2023to be null, void, and of no effect.\n\nThe court found that both her removal and the appointment of a new trustee, Chitopota, were unlawful.\n\nThe removal of the applicant as a trustee was not procedurally done, the judge wrote in the ruling.\n\nThe appointment of the third respondent as a trustee was not procedurally done either. The applicant is entitled to the declaratory order sought.\n\nSandra had alleged that she was removed from the trust without her knowledge or consent and that her signature was fraudulently appended to documents purporting to authorise the change.\n\nShe also claimed that two properties held under the trust were sold without her involvement.\n\nThe trust, established in 2014 and meant to safeguard family assets and benefit the couples children, had listed both Sandra and Simon Mupindu as trustees.\n\nThe court noted that Simons unilateral actions violated the terms of the original trust deed, which specified that only beneficiaries could alter trustee appointments.\n\nSimon had argued that the trust was his initiative and claimed his wifes role was symbolic.\n\nHowever, the court dismissed his arguments and those of the other respondents, including his legal firm Mupindu Legal Practitioners, and Chitopota.\n\nThe fourth respondent, the Registrar of Deeds, did not oppose the application and has been ordered to amend official records accordingly.\n\nJustice Ndlovu also dismissed all preliminary objections raised by the respondents, including claims of lis pendens (pending litigation), material falsehoods, and misjoinder.\n\nIn a stinging rebuke, the judge ordered Simon Mupindu, Chitopota, and the law firm to pay costs on a legal practitioner-client scale.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/13181521/high-court-of-zimbabwe-3.jpg",
            "description": "<p>By Mary Taruvinga  The High Court of Zimbabwe has reinstated magistrate Sandra Mupindu as a trustee of the Shamba Charashika Bvumavaranda Trust, overturning what it described as a procedurally flawed amendment to the trust deed by her estranged husband, Simon Mupindu. The couple is going through a nasty divorce after Simon, a top Harare lawyer</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-reinstates-magistrate-sandra-mupindu-as-a-trustee-in-property-dispute-with-estranged-lawyer-husband/\">High Court reinstates magistrate Mupindu as trustee in property dispute with estranged lawyer husband</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:35",
            "date": "28 Jul 2025"
        }
    ]
}