{
    "news": [
        {
            "title": "Do not turn Zimbabwe into Operation Dudula – Mutsvangwa slams ‘overzealous’ Tagwirei over anti-foreigner comments",
            "url": "https://www.newzimbabwe.com/do-not-turn-zimbabwe-into-operation-dudula-mutsvangwa-slams-overzealous-tagwirei-over-anti-foreigner-comments/",
            "content": "By Darlington Gatsi\n\nZANU PF spokesperson Christopher Mutsvangwa has rebuked controversial businessman Kudakwashe Tagwirei over his recent remarks calling for foreign nationals to be excluded from investing in certain sectors of the economy, describing the comments as xenophobic.\n\nTagwirei recently told a ZANU PF meeting that foreigners should be removed from sectors such as transport, retail, and energy.\n\nIn response, Mutsvangwa warned Tagwirei against pushing sentiments that could evolve into a movement resembling South Africas anti-immigrant vigilante group, Operation Dudula.\n\nZimbabwe was founded on the support of Africa, the Africa liberation committee and one of the beneficiaries, as a young guerrilla was the current president. Africa matters to us as a country. So you do not go about saying we do not want foreigners in Zimbabwe.\n\nWe do not want Dudula here. We are an African country. Africans are not foreigners in Zimbabwe. If there are certain things that were being done by certain Africans, let them be handled by legal processes, said Mutsvangwa.\n\nThe Indigenisation and Economic Empowerment Act reserves sectors such as retail, employment agencies, and advertising for Zimbabwean citizens. The law is aimed at correcting longstanding economic imbalances, however, foreign nationals have increasingly encroached on these sectors.\n\nMutsvangwa said Zimbabweans should not mistreat foreigners, noting that many citizens themselves live abroad.\n\nWe are a mature brown stick country which has got a lot of respect for our African brethren and when they are here we treat them exactly as Zimbabweans. We are not xenophobic like South Africa. When you live in glass house do not throw stones. The third biggest foreign currency earner in this country is the diaspora. They are strangers in other lands, he said.\n\nMutsvangwas remarks also signalled a shift in tone towards Tagwirei, whom he recently supported for co-option into the ZANU PF Central Committee despite having previously criticised him for allegedly buying influence.\n\nIn a pointed remark, Mutsvangwa suggested that Tagwirei should consider enrolling at the partys Herbert Chitepo School of Ideology.\n\nCertain things are only said by the President. They are not said by everybody otherwise everyone who thinks can be a president can be seen giving polices from his platform.\n\nIt may not be too late particularly for people who want to be presidents to go back to Chitepo school of ideology. I have mentioned it before, he said.\n\nTagwirei has been reported to harbour presidential ambitions after President Emmerson Mnangagwas term ends in 2028.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/16163123/chris-mutsvangwa.jpg",
            "description": "<p>By Darlington Gatsi ZANU PF spokesperson Christopher Mutsvangwa has rebuked controversial businessman Kudakwashe Tagwirei over his recent remarks calling for foreign nationals to be excluded from investing in certain sectors of the economy, describing the comments as xenophobic. Tagwirei recently told a ZANU PF meeting that foreigners should be removed from sectors such as transport,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/do-not-turn-zimbabwe-into-operation-dudula-mutsvangwa-slams-overzealous-tagwirei-over-anti-foreigner-comments/\">Do not turn Zimbabwe into Operation Dudula – Mutsvangwa slams ‘overzealous’ Tagwirei over anti-foreigner comments</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:11",
            "date": "21 Nov 2025"
        },
        {
            "title": "Civil service is collapsing – Senate calls for immediate increase in workers’ salaries",
            "url": "https://www.newzimbabwe.com/civil-service-is-collapsing-senate-calls-for-immediate-increase-in-workers-salaries/",
            "content": "By Darlington Gatsi\n\nThe Senate is piling pressure on the government to urgently review civil servants salaries and align them with regional standards, arguing that this is critical to rescuing the collapsing public sector.\n\nFor years, unions representing government workers have been calling for salaries to be restored to 2018 levels, when the lowest-paid employees earned the equivalent of about US$400. Economic shocks and inconsistent policies have eroded earnings, prompting a mass exodus of skilled professionals seeking better opportunities abroad.\n\nSenator Sithabisiwe Moyo recently tabled a motion in the Upper House demanding an immediate and comprehensive solution to address the worsening plight of government workers.\n\nThe situation on the ground is not fair. Our civil servants are suffering. Our teachers, nurses, clerks and other civil servants are living in poverty while struggling to do their jobs. For example, the average Zimbabwean teacher earns about 350 per month, which is not enough to pay rent or buy food, said Moyo.\n\nShe further urged the government to consider a 50% salary increase and to prioritise restoring wages to the 2018 standard.\n\nThe civil service is collapsing, Hon. President, we must give civil servants a salary increment now, approve an emergency salary increase so that the teachers, nurses and other civil servants earn enough to survive. A 50% increase would do, we must restore their salaries to that of the US dollar era value of 2019 and this should be a top priority, said Moyo.\n\nThe deteriorating working environment in public institutions has fuelled widespread disgruntlement among civil servants, undermining service deliveryparticularly for low-income communities that rely heavily on government services.\n\nMoyo cautioned against politicising the crisis.\n\nThe whole country is watching our civil servants; we are not asking for charity or politics, only the dignity of a living salary and support in order for them to do their work.\n\nTeachers want to teach, nurses want to do their work, all other civil servants want to deliver their duties efficiently, but how can they if they are hungry? We must not allow our Public Service to collapse. Children are travelling long distances to school because of a shortage of schools nearby. We owe the future generation because their future depends on us, she said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/04/28170228/zimbabwe-civil-servants-strike.webp",
            "description": "<p>By Darlington Gatsi The Senate is piling pressure on the government to urgently review civil servants’ salaries and align them with regional standards, arguing that this is critical to rescuing the collapsing public sector. For years, unions representing government workers have been calling for salaries to be restored to 2018 levels, when the lowest-paid employees</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/civil-service-is-collapsing-senate-calls-for-immediate-increase-in-workers-salaries/\">Civil service is collapsing – Senate calls for immediate increase in workers’ salaries</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:11",
            "date": "21 Nov 2025"
        },
        {
            "title": "Zimbabwean national nabbed trying to smuggle illicit cigarettes into SA",
            "url": "https://www.newzimbabwe.com/zimbabwean-national-nabbed-trying-to-smuggle-illicit-cigarettes-into-sa/",
            "content": "The Citizen\n\nThe Border Management Authority (BMA) has intercepted a truck driven by a Zimbabwean national arriving from Zimbabwe with a consignment of illicit cigarettes and tobacco products destined for the South African market.\n\nThe vehicle with its cargo was seized during a targeted operation in the early hours of Wednesday, 19 November 2025, at the Beitbridge commercial port of entry.\n\nThe commissioner of the Border Management Authority (BMA), Dr Michael Masiapato, confirmed the significant seizure of the goods.\n\nAccording to the BMA, at approximately 1am, guards used technology to intercept the fully laden truck.\n\nJunior guards exercised full operational vigilance using the BMAs newly acquired video scope inspection toolkit to inspect a commercial truck arriving from Zimbabwe. Thanks to this new technology that provided advanced imaging, the officials detected a concealed load, prompting a physical inspection, which uncovered 14 master boxes of Remington Gold cigarettes.\n\nThe BMA said the use of its new cargo scanner was decisive in detecting this illicit load, underscoring the value of continued investment in modern border control technology.\n\nThe efforts of our junior border guards continue to ensure coordinated, rapid response. The joint operations approach that needs to be implemented by law enforcement working in vulnerable areas is central to disrupting sophisticated smuggling networks.\n\nDr Masiapato condemned the illicit trade of tobacco products.\n\nIllicit tobaccodeprives the South African Revenue Service (Sars) of critical revenue. By intercepting such consignments, the BMA helps to safeguard tax integrity and public finances. Beyond the immediate financial loss, illicit cigarettes pose health risks and fuel organised crime, Dr Masiapato said.\n\nWith the festive season around the corner, the BMA is expected to be on high alert at all South Africas border points of entry.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/20170525/Illicit-Cigarettes.jpg",
            "description": "<p>The Citizen The Border Management Authority (BMA) has intercepted a truck driven by a Zimbabwean national arriving from Zimbabwe with a consignment of illicit cigarettes and tobacco products destined for the South African market. The vehicle with its cargo was seized during a targeted operation in the early hours of Wednesday, 19 November 2025, at</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-national-nabbed-trying-to-smuggle-illicit-cigarettes-into-sa/\">Zimbabwean national nabbed trying to smuggle illicit cigarettes into SA</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:11",
            "date": "21 Nov 2025"
        },
        {
            "title": "Harare records over 500 cases of hand, foot and mouth disease",
            "url": "https://www.newzimbabwe.com/harare-records-over-500-cases-of-hand-foot-and-mouth-disease/",
            "content": "By Thandiwe Garusa\n\nTHE City of Harare has raised alarm over an outbreak of hand, foot and mouth disease (HFMD), with at least 501 cases recorded across several suburbs, mainly affecting children under the age of 10.\n\nIn a public notice issued Thursday, the local authority said the viral infection has been detected largely in Mabvuku, Mbare, Budiriro and Waterfalls, warning that the disease is highly contagious and spreads through direct contact with blisters or droplets from coughing and sneezing.\n\nSo far 501 cases have been recorded mainly in Mabvuku, Mbare, Budiriro and Waterfalls.\n\nNo deaths have been recorded and those with the symptoms are advised to report to the nearest clinic or hospital, the notice reads.\n\nAlthough HFMD is described as self-limiting, meaning it usually resolves on its own, the City of Harare urged parents and guardians to take symptoms seriously and seek medical assistance.\n\nThe disease is self-limiting and treatment is for symptoms.\n\nThe public is advised to avoid direct contact with those showing symptoms as it is a highly contagious disease, the notice added.\n\nThe city further advised residents to ensure any child showing signs of infection receives immediate medical attention.\n\nWe urge residents to immediately take children with symptoms of the disease to the clinic.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/20184945/hand-foot-and-mouth.jpg",
            "description": "<p>By Thandiwe Garusa THE City of Harare has raised alarm over an outbreak of hand, foot and mouth disease (HFMD), with at least 501 cases recorded across several suburbs, mainly affecting children under the age of 10. In a public notice issued Thursday, the local authority said the viral infection has been detected largely in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-records-over-500-cases-of-hand-foot-and-mouth-disease/\">Harare records over 500 cases of hand, foot and mouth disease</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:11",
            "date": "21 Nov 2025"
        },
        {
            "title": "Chevrons beat Sri Lanka to pick first Tri-Series win",
            "url": "https://www.newzimbabwe.com/chevrons-beat-sri-lanka-to-pick-first-tri-series-win/",
            "content": "By Sports Reporter\n\nThe Zimbabwe senior mens cricket team delivered a solid performance on Thursday, defeating Sri Lanka by 67 runs in their second Tri-Series match at the Rawalpindi Cricket Stadium.\n\nThe victory marked the Chevrons first win of the tournament, bouncing back strongly after their 5-wicket loss to Pakistan in the opening match on Tuesday.\n\nAfter losing the toss and being sent in to bat, Zimbabwe posted a competitive 162 runs, led by opener Brian Bennett, who top-scored with 49 runs off 42 balls. Captain Sikandar Raza followed closely with an impressive 47 off 32 deliveries.\n\nDefending their total, the Chevrons were disciplined with the ball and sharp in the field, restricting Sri Lanka to 95 runs in their 20 overs.\n\nBrad Evans starred with the ball, taking three wickets, while Richard Ngarava chipped in with two. The rest of the bowling attack each picked up a wicket, contributing to a strong all-round performance.\n\nThe defeat marked a disappointing start for Sri Lanka in their Tri-Nations campaign, while Zimbabwe gained a confidence boost after their earlier loss to hosts Pakistan.\n\nSri Lanka will now take on Pakistan on Saturday to conclude the first-round fixtures, before the Chevrons face Pakistan again on Sunday as round two begins.\n\nThe tri-series serves as preparation for next years T20 World Cup, in which all three nations are set to participate.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/20175919/chevrons-paki.jpg",
            "description": "<p>By Sports Reporter The Zimbabwe senior men’s cricket team delivered a solid performance on Thursday, defeating Sri Lanka by 67 runs in their second Tri-Series match at the Rawalpindi Cricket Stadium. The victory marked the Chevrons’ first win of the tournament, bouncing back strongly after their 5-wicket loss to Pakistan in the opening match on</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chevrons-beat-sri-lanka-to-pick-first-tri-series-win/\">Chevrons beat Sri Lanka to pick first Tri-Series win</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:11",
            "date": "21 Nov 2025"
        },
        {
            "title": "Kenyan authorities paid trolls to threaten Gen Z protesters, Amnesty says",
            "url": "https://www.newzimbabwe.com/kenyan-authorities-paid-trolls-to-threaten-gen-z-protesters-amnesty-says/",
            "content": "BBC\n\nThe Kenyan authorities paid a network of trolls to threaten and intimidate young protesters during recent anti-government demonstrations, Amnesty International has said.\n\nA new report by the human rights organisation said government agencies also employed surveillance and disinformation to target organisers of the mass protests, which swept Kenya across 2024 and 2025.\n\nThe demonstrations were driven largely by Gen Z activists who used social media platforms to mobilise.\n\nIn response to Amnestys report, Kenyas interior minister said the government does not sanction harassment or violence against any citizen.\n\nBut Amnesty said it had uncovered a campaign to silence and suppress the protesters.\n\nYoung women and LGBT+ activists were disproportionately targeted, with misogynistic and homophobic comment, as well as AI-generated pornographic images, the report said.\n\nThe BBC has approached the government for further comment.\n\nOne activist told Amnesty: I had people coming into my inbox and telling me: You will die and leave your kids. We will come and attack you.\n\nI even had to change my childs school. Someone sent me my childs name, the age the school bus number plate. They told me: If you continue doing what youre doing then we will take care of this child for you.\n\nIt has long been believed that the government employs a network of individuals, known as keyboard warriors, to push its online messages.\n\nThe report features a man who said he was part of a team paid between 25,000 and 50,000 Kenyan shillings (about $190-$390; 145-300) per day to amplify government messaging and drown out trending protest hashtags on social media platform X.\n\nAs part of its research, Amnesty spoke to 31 young human rights defenders who had participated in the protests. Nine of these activists said they had received violent threats via X, TikTok, Facebook and WhatsApp.\n\nAs well as digital abuse, the authorities have also been accused of carrying out a brutal crackdown on the protests.\n\nMore than 100 people died, rights groups say, when police clashed with protesters during two waves of demonstrations  one in 2024 and one in 2025.\n\nThe authorities were also accused of arbitrary arrests, enforced disappearances and using lethal force against the protesters.\n\nThe government accepted there had been some case of excessive force by police, butalso defended the security forces in other instances.\n\nThe demonstrations railed against issues such as proposed tax rises, increasing femicide and corruption.\n\nAmnesty chief Agns Callamard said the organisations report clearly demonstrates widespread and coordinated tactics on digital platforms to silence and suppress protests by young activists.\n\nOur research also proves that these campaigns are driven by state-sponsored trolls, individuals and networks paid to promote pro-government messages and dominate Kenyas daily trends on X, she added.\n\nKenyas Interior Minister Kipchumba Murkomen said: The government of Kenya does not sanction harassment, or violence against any citizen any officer implicated in unlawful conduct bears individual responsibility and is subject to investigation and sanction.\n\nAmnesty also raised concerns about unlawful state surveillance, including allegations  denied by Kenyas largest telecom provider, Safaricom  that authorities used mobile data to monitor protest leaders.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/29173036/kenya-protests.webp",
            "description": "<p>BBC The Kenyan authorities paid a network of trolls to threaten and intimidate young protesters during recent anti-government demonstrations, Amnesty International has said. A new report by the human rights organisation said government agencies also employed surveillance and disinformation to target organisers of the mass protests, which swept Kenya across 2024 and 2025. The demonstrations</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kenyan-authorities-paid-trolls-to-threaten-gen-z-protesters-amnesty-says/\">Kenyan authorities paid trolls to threaten Gen Z protesters, Amnesty says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:11",
            "date": "21 Nov 2025"
        },
        {
            "title": "Mwazha dies aged 107",
            "url": "https://www.newzimbabwe.com/mwazha-dies-aged-107/",
            "content": "By Staff Reporter\n\nClergyman and founder of the African Apostolic Church, Archbishop Paul Mwazha, has died aged 107.\n\nMwazha passed away on Thursday after a long illness.\n\nIn a statement, African Apostolic Church General Secretary Jeshua Mhizha confirmed the death of the church leader.\n\nGood morning! The African Apostolic Church, VaApostora veAfrica.\n\nI regret to inform you that our Archbishop, Paul Mwazha of Africa, our church leader, has just passed on today, November 20, 2025. He has departed from us, but in spirit we are together with him.\n\nMore information will be released in due course. Any further announcements will be released in due course. Kudzai Jehovah, Kudzai Jehovah, said Mhizha.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/20100021/mwazha-.jpg",
            "description": "<p>By Staff Reporter Clergyman and founder of the African Apostolic Church, Archbishop Paul Mwazha, has died aged 107. Mwazha passed away on Thursday after a long illness. In a statement, African Apostolic Church General Secretary Jeshua Mhizha confirmed the death of the church leader. “Good morning! The African Apostolic Church, VaApostora veAfrica. “I regret to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mwazha-dies-aged-107/\">Mwazha dies aged 107</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:11",
            "date": "21 Nov 2025"
        }
    ]
}