{
    "news": [
        {
            "title": "President Mnangagwa donates US$100,000 towards Sables’ bid to defend Rugby Africa Cup title",
            "url": "https://www.newzimbabwe.com/president-mnangagwa-donates-us100000-towards-sables-bid-to-defend-rugby-africa-cup-title/",
            "content": "By James Muonwa\n\nPRESIDENT Emmerson Mnangagwa has donated US$100,000 to the senior mens rugby team, the Sables, bid to defend their title atthe ongoing Rugby Africa Cup tournament.\n\nThe Sables were invited to State House on Thursday evening, where Mnangagwa presented themoneyto aid the teams campaign in the tourney, while challenging the team to conquer at the tournament and beyond.\n\nI want to congratulate you, the Sables, for the victory against Morocco. The achievement is pivotal as we embark on our journey to reposition and refocus our sporting delivery systems on the critical path of an excelling sporting nation that Zimbabwe is becoming, said Mnangagwa.\n\nYour participation in the international arena, as the Sables, automatically makes you brand ambassadors of Zimbabwe. I, therefore, challenge you to utilise this role as sports diplomats to promote our countrys imagine, our tourism and investment prospects under our engagement and re-engagement policy.\n\nBe assured that our nation is behind you. Government will continue to support you, and l, your President, am confident of your dedication and sporting capabilities\n\nAs you embark on your journey to qualify for the World Cup, may your resurgence yield great success for our country. Go out there and make Zimbabwe proud, Mnangagwa told the guests.\n\nSpeaking to journalists after the event, Zimbabwe Rugby Union (ZRU) Chief Executive Officer Sifiso Made noted that Mnangagwas gesture came as a surprise, but was well-timed to incentivise the players to retain the trophy and proceed to the prestigious World Rugby Jamboree.\n\nZimbabwe are the current holder of the Africa Rugby Cup trophy, which they are defending in the ongoing 2025 tournament scheduled from the 8th to 19th of July in Uganda.\n\nThe Zimbabwe Sables have secured a spot in the semi-finals of the Rugby Africa Cup, following a dominant 43-8 victory over Morocco in the quarter-final match held in Uganda. They will now face Kenya in the semi-final this coming Sunday.\n\nThe winner of the Rugby Africa Cup will earn Africas sole ticket to the 2027 World Cup to be held in Australia.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/10204235/IMG-20250710-WA0069.jpg",
            "description": "<p>By James Muonwa PRESIDENT Emmerson Mnangagwa has donated US$100,000 to the senior men’s rugby team, the Sables, bid to defend their title at the ongoing Rugby Africa Cup tournament. The Sables were invited to State House on Thursday evening, where Mnangagwa presented the money to aid the team’s campaign in the tourney, while challenging the team to conquer</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/president-mnangagwa-donates-us100000-towards-sables-bid-to-defend-rugby-africa-cup-title/\">President Mnangagwa donates US$100,000 towards Sables’ bid to defend Rugby Africa Cup title </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "10 Jul 2025"
        },
        {
            "title": "Simon Marange appointed Upington City FC assistant coach",
            "url": "https://www.newzimbabwe.com/simon-marange-appointed-upington-city-fc-assistant-coach/",
            "content": "By Sports Reporter\n\nYoung Warriors coach Simon Marange has been appointed assistant coach at Upington City FC in South Africa.\n\nThe Motsepe Foundation side has secured the signature of Marange, who last week parted ways with Orlando Pirates after seven years.\n\nAged 34, the Zimbabwean gaffer will be working under coach Abraham Mongoya, who is also new at the club following his appointment last month.\n\nMarange was on the radar of many Zim PSL sides.\n\nHowever, the Young Warriors coach, early this week, told New Zimbabwe.com that he was focusing on a promising project in South Africa and had no plans of working in the PSL anytime soon.\n\nAt Orlando Pirates, Marange made several achievements, his biggest highlight being winning the Future Champions Trophy with Orlando Pirates Under18 side in 2018.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/09/25011129/Simon-Marange.webp",
            "description": "<p>By Sports Reporter Young Warriors coach Simon Marange has been appointed assistant coach at Upington City FC in South Africa. The Motsepe Foundation side has secured the signature of Marange, who last week parted ways with Orlando Pirates after seven years. Aged 34, the Zimbabwean gaffer will be working under coach Abraham Mongoya, who is</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/simon-marange-appointed-upington-city-fc-assistant-coach/\">Simon Marange appointed Upington City FC assistant coach</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "10 Jul 2025"
        },
        {
            "title": "Mahere wins US$100k defamation claim against Kukurigo owner",
            "url": "https://www.newzimbabwe.com/mahere-wins-us100k-defamation-claim-against-kukurigo-owner/",
            "content": "By Mary Taruvinga\n\nLAWYER Fadzayi Mahere has won a US$100,000 defamation claim against journalist Edmund Kudzayi, whom she sued in 2022 after he accused her of dating a married businessman, Tinashe Murapata.\n\nKudzayi got in trouble over a story he published on his online platform Kukurigo, alleging that the top lawyer had caused the collapse of Murapatas marriage.\n\nHigh Court judge Justice Joel Mambara granted the order, ruling that Kudzayi should pay the claimed damages.\n\nWhereupon, after reading documents filed of record and hearing counsel, it is ordered that the plaintiffs claim be and is hereby granted.\n\nThe Defendant shall pay the Plaintiff the sum of US$100,000.00 or the equivalent thereof in local currency at the rate of exchange prevailing at the time of payment.\n\nThe Defendant shall pay interest on the above amount at the prescribed rate, namely 5% per annum from the date of service of summons to the date of payment.\n\nThe Defendant shall pay Plaintiffs costs of suit, ruled the judge.\n\nBefore mounting a lawsuit against the journalist, Mahere initially demanded a retraction, failing which she would sue for damages.\n\nHowever, Kudzayi insisted that there will be no retraction; the story is factual and much more is coming.\n\nMaheres lawyers consequently filed a defamation claim with the High Court.\n\nKudzayi said Mahere had an affair with Murapata, whose marriage has since collapsed because of the illicit affair.\n\nIn her declaration, in summons filed through her lawyers, Honey and Blanckenberg, Mahere said the allegations and publication by Kudzai were aimed at soiling her business image.\n\nThe article was designed to damage the plaintiffs personal and professional reputation, without any attempt at reporting information which was true or in the public interest. In the article itself, it was confirmed that neither the Plaintiff nor Mr. Murapata had confirmed any of the allegations set out in the article, and that efforts to contact the estranged wife were unsuccessful. It is therefore clear that the author of the article made no attempt to establish the veracity of his claims, and had no direct sources for the claims made, and was relying simply on the hearsay of third parties, read part of the summons.\n\nOn 3 July Kudzai published a tweet in which he threatened to produce Mahere story and pictures with a married man, 10AM tomorrow [4 July] (sic).\n\nThereafter, on 4 July 2022, in response to tweets from members of the public who expressed support for Mahere, Kudzai again tweeted, there is nothing honourable about having sex with married men and wrecking marriages.\n\nYou think chonaka because chaitwa neCCC? Munotopenga imi.\n\nMahere said it was clear from the context of the tweets that they were directed at Mahere.\n\nThereafter, on 5 July 2022, an article was published through the Kukurigo online WhatsApp platforms with the headline CCC spokesperson caught up in businessmans marriage collapse, love affair.\n\nThe article also stated that Mahere and Murapata had travelled together to a funeral in Masvingo and slept there under unclear circumstances.\n\nMahere then demanded a retraction but Kudzai said he was not going to do so.\n\nMahere said the Kukurigo website claims that 370,000 people read its news articles every day and claims 46,000 direct subscribers across 185 WhatsApp groups.\n\nShe said his Twitter page has 126,600 followers and since the articles were published, the untrue allegations have been reposted on social media and have been picked up by media sites, including Gambakwe Media, Zim News Online, Zimetro, iHarare.com, MyZimbabwe, Nehanda Radio, Pindula News, and Zimeye.\n\nThe reach of the defamatory allegations is therefore extensive. In light of the above, Plaintiff is entitled to damages as claimed, reads the summons.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/05/28181833/Fadzayi_Mahere.jpg",
            "description": "<p>By Mary Taruvinga LAWYER Fadzayi Mahere has won a US$100,000 defamation claim against journalist Edmund Kudzayi, whom she sued in 2022 after he accused her of dating a married businessman, Tinashe Murapata. Kudzayi got in trouble over a story he published on his online platform Kukurigo, alleging that the top lawyer had caused the collapse</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mahere-wins-us100k-defamation-claim-against-kukurigo-owner/\">Mahere wins US$100k defamation claim against Kukurigo owner</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "10 Jul 2025"
        },
        {
            "title": "Alpha Media Holdings challenges remand as editor-in-chief is dragged to court",
            "url": "https://www.newzimbabwe.com/alpha-media-holdings-challenges-remand-as-editor-in-chief-is-dragged-to-court/",
            "content": "By Mary Taruvinga\n\nThe editor-in-chief at Alpha Media Holdings (AMH), Kholwani Nyathi, on Thursday appeared in court representing his employer, charged with undermining the authority of President Emmerson Mnangagwa.\n\nThe company is accused of insulting the president following the publication of a satirical article in its weekly paper, Zimbabwe Independents Muckracker column.\n\nThe same article titled When you become mafia state landed the Zimbabwe Independent editor Faith Zaba in jail recently. She was granted US$200 bail after spending three nights behind bars.\n\nThrough its lawyer Chris Mhike, AMH challenged placement on remand, arguing that the charge does not disclose an offence.\n\nMhike said in a democratic state, one cannot be arrested for expressing his or her opinion where there is freedom of the media and expression.\n\nThe arrest amounts to restrictions of the right of access to information.\n\nThe disregard of fundamental rights of the accused amount to violation of principle of democracy, he said.\n\nThe lawyer said when the company is placed on remand the state has restricted it from performing its duties to inform the public which is its mandate.\n\nJournalism is not a crime, by placing the company on remand means criminalisation of journalism.\n\nOne consenting to placement on remand means youre admitting to committing the offence, Mhike said.\n\nTakudzwa Jambawu representing the state said there is reasonable suspicion that an offence was committed.\n\nHe said it is not in dispute that Mnangagwa is the current SADC chairperson and the words contained in the article were insulting his authority.\n\nAccording to the state on June 7 2025 accused through the Zimbabwe Independent newspaper edition of 27 June 2025 to 3 July 2025 published an article titled When you become mafia state, intending to undermine the authority of the President by saying: In less than two months, our one year rotating chairmanship of SADC comes to an end and we hope it is not just Muckraker, who has not seen any value that our time in that important role has added to the regional bloc apart from just confirming the obvious fears that SADC is a mere trade union of dictators.\n\nIn the few months that we have been in that role, we have been implicated in the chaos that has rocked most neighbouring countries. We were implicated in the massive vote rigging in Mozambican elections-with proof that our people actually voted for Daniel Chapo in an election in whose disputed outcome resulted in the death of hundreds of people. We were also fingered in the elections in Botswana and Namibia, where our electoral rigging machinery was heavily deployed.\n\nWhen you have become a mafia state, and are known to arm fellow criminals from around the globe with your diplomatic passports, it has become very hard to stop your people from believing just anything.\n\nThere is certainly no doubt who is micro Managing this Chapo chap, so there is not even any need to wonder what our Owner thought when his boy was addressing a virtually empty stadium very soon the boy would have developed a thick skin, just hike his handler who no longer needs to do anything under the cover of the darkness. That is what happens when you become the head of a mafia state.  It is a government that came into power through a coup and is only obsessed with keeping itself in power hence the creation of demons such as the Tshabangus and the like, themselves creations of courts whose top judges are themselves appointed -and kept on  the bench via political chicanery, all to serve the purpose of keeping this criminal enterprise masquerading as a government in power.\n\nThe state alleges that the accused attached a photograph of President Emerson Dambudzo Mnangagwa and Mozambican President Daniel Chapo.\n\nThe state alleges the article was false in material and was designed to engender feelings of hostility by the citizens of Zimbabwe towards the President.\n\nHearing continues Friday.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/10193920/kholwani.jpg",
            "description": "<p>By Mary Taruvinga  The editor-in-chief at Alpha Media Holdings (AMH), Kholwani Nyathi, on Thursday appeared in court representing his employer, charged with undermining the authority of President Emmerson Mnangagwa. The company is accused of insulting the president following the publication of a satirical article in its weekly paper, Zimbabwe Independent’s Muckracker column. The same article</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/alpha-media-holdings-challenges-remand-as-editor-in-chief-is-dragged-to-court/\">Alpha Media Holdings challenges remand as editor-in-chief is dragged to court</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "10 Jul 2025"
        },
        {
            "title": "Olympic champ Semenya did not get a fair hearing in sex eligibility case, human rights court rules",
            "url": "https://www.newzimbabwe.com/olympic-champ-semenya-did-not-get-a-fair-hearing-in-sex-eligibility-case-human-rights-court-rules/",
            "content": "AP\n\nTwo-time Olympic champion runner Caster Semenya won a partial victory at the European Court of Human Rights on Thursday in her seven-year legal fight against track and fields sex eligibility rules.\n\nThe courts 17-judge highest chambersaid in a 15-2 votethat Semenya had some of her rights to a fair hearing violated at Switzerlands Supreme Court,where she had appealedagainst a ruling by the Court of Arbitration for Sport in favor of tracks World Athletics.\n\nHowever, the court declined to rule on several other aspects of Semenyas case, including on the question of whether she was discriminated against in Swiss courts. The European court in Strasbourg, France, said those issues were outside Switzerlands jurisdiction, although four of the 17 judges gave a partial dissent to the majority view.\n\nSemenyas case should now go back to the Swiss federal court in Lausanne. It will be watched closely by other sports which have passed or are reviewing their own rules on eligibility in womens events.\n\nSemenya laterposted on social mediaa photo of herself in the court chamber with a message a three raised fists symbolizing her fight for justice.\n\nToday, my patience in this journey has been rewarded with a result that will pave the way for all athletes human rights to be protected, she said in a statement.\n\nThe original case between Semenya and tracks governing body based in Monaco was about whether athletes like her  who have specific medical conditions, a typical male chromosome pattern and naturally high testosterone levels  should be allowed to compete freely in womens sports.\n\nThe European courts ruling does not overturn the World Athletics rules that effectively ended Semenyas career running the 800 meters after she won two Olympic and three world titles since emerging on the global stage as a teenager in 2009.\n\nThe judges also did not take up other aspects of the appeal filed by Semenya, who was in court to hear their judgment read. It awarded her 80,000 euros ($94,000) from the state of Switzerland in respect of costs and expenses.\n\nThe key legal point in Semenyas win was that the Swiss Federal Court had not carried out a rigorous judicial review. This was required because Semenya had no choice but to pursue her case through the CASs mandatory and exclusive jurisdiction. the Strasbourg judges ruled.\n\nGoverning bodies of sports oblige athletes and national federations to take their disputes to the sports court in the International Olympic Committees home city Lausanne.\n\nThe court considered, however, that the Federal Supreme Courts review had fallen short of that requirement, it said in a statement.\n\nIn dismissing other elements of the South African runners case, including if she had been discriminated against, the court judged it did not fall within Switzerlands jurisdiction in respect of those complaints.\n\nWorld Athletics, led by its president Sebastian Coe, has said its rules maintain fairness because Semenya has an unfair, male-like athletic advantage from her higher testosterone. Semenya argues her testosterone is a genetic gift.\n\nWorld Athletics and CAS did not immediately respond to the ruling. The IOC declined to comment on a case it is not directly involved in.\n\nThursdays win followed a legal victory from the same court two years ago for Semenya.\n\nThat judgment which said she had faced discrimination opened a way for the Swiss supreme court to reconsider its decision to dismiss her appeal against the CAS verdict in favor of World Athletics.\n\nAt CAS in 2019, three judges ruled 2-1 that discrimination against Semenya was necessary, reasonable and proportionate to maintain fairness in womens track events.\n\nWorld Athletics drew up its rules in 2018 forcing Semenya and other female athletes with Differences in Sex Development to suppress their testosterone to be eligible for international womens events.\n\nFour of the 17 judges filed a partial dissent to the majority opinion, arguing their court should have been able to pronounce on substantive conclusions reached by the CAS that went against Semenya.\n\nWorld Athletics eligibility rules specifically targeted the applicant, since they concerned only the events in which she competed  indeed, the fact that they amounted to a kind of lex Semenya clearly demonstrates the arbitrariness of those regulations as a whole, the four judges wrote.\n\nWe are disappointed that her expectations have not been met, said the dissenting judges, who included the chamber president, Marko Bonjak from Slovenia.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/10191357/semenya.webp",
            "description": "<p>AP  Two-time Olympic champion runner Caster Semenya won a partial victory at the European Court of Human Rights on Thursday in her seven-year legal fight against track and field’s sex eligibility rules. The court’s 17-judge highest chamber said in a 15-2 vote that Semenya had some of her rights to a fair hearing violated at Switzerland’s Supreme</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/olympic-champ-semenya-did-not-get-a-fair-hearing-in-sex-eligibility-case-human-rights-court-rules/\">Olympic champ Semenya did not get a fair hearing in sex eligibility case, human rights court rules</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "10 Jul 2025"
        },
        {
            "title": "Trabablas Interchange cost hits US$114 million as Treasury reveals an unbudgeted US$26 million was paid",
            "url": "https://www.newzimbabwe.com/trabablas-interchange-cost-hits-us114-million-as-treasury-reveals-an-unbudgeted-us26-million-was-paid/",
            "content": "By Costa Nkomo\n\nThe cost of constructing the recently commissioned Trabablas Interchange in Harare was beyond the US$88 million initially communicated and budgeted for, Treasury has revealed.\n\nThe Treasury confirmed in Parliament that the project cost a total of US$114 million  an increase of US$26 million.\n\nWhen questions were raised about the projects cost, the government was quick to attribute the increase to the relocation of families who had been settled close to the project site.\n\nExperts have, however, drawn comparisons with regional markets such as South Africa and Botswana, where constructing a similar project would typically cost around US$45 million.\n\nWhile many are still trying to make sense of the initial US$88 million figure, Finance Minister Professor Mthuli Ncube further shocked lawmakers by revealing during a Question and Answer session in Parliament on Wednesday that the project had actually consumed an additional US$26 million, not included in the original budget.\n\nEmakhandeni-Luveve MP Decent Bajila raised the issue in Parliament, requesting that Ncube clarify the full cost of the Trabablas Interchange.\n\nI asked the Minister of Finance, Economic Development and Investment Promotion to brief the House on the total cost of the Trabablas Interchange Project and to clarify whether the funding source was a loan from the private sector or the International Monetary Funds (IMFs) Special Drawing Rights facility, Bajila said.\n\nResponding, Ncube said: The cost of Trabablas Interchange was driven by our initial loan arrangement of the order of US$88 million, which was provided by the Consortium of Contractors. In terms of what we used from the Special Drawing Rights, we were required to pay a deposit of US$26 million. So, we used US$26 million from the SDRs to pay that deposit and then the rest was structured as a loan from that US$88 million arrangement.\n\nBajila followed up, asking whether the US$26 million was part of the US$88 million total, to which Ncube responded that it was not.\n\nThe US$26 million is in addition, but it was a requirement for accessing the US$88 million that we pay that deposit to access that facility. We think that was a very good arrangement indeed because we have been able to complete the piece of infrastructure, said Ncube.\n\nDangamvura Chikanga MP Prosper Mutseyami then pressed Ncube for an explanation on what had caused the additional US$26 million in project costs.\n\nMay the Hon. Minister explain to the House as to what caused the additional US$26 million, bearing in mind that the US$88 million had been budgeted to cover the whole construction of the interchange, he asked.\n\nNcube attributed the extra cost to the relocation of residents living near the construction site.\n\nThe cost of relocating, for example, relocating some of the residents that we relocated to create space, for developing this piece of infrastructure. There were some unexpected escalations of that cost, which then pushed us towards increasing the budget by another US$26 million that I have referred to, Ncube said.\n\nMutseyami was not satisfied and posed another follow-up question.\n\nCan you substantiate to the House as to how this supplementary US$26 million would just come about when the budget had already been sorted, then we have extra figures for the situation of adding US$26 million? How do you account that Hon. Minister?\n\nIn response, Ncube said the cost overruns were unforeseen and occurred during the implementation of the project.\n\nKwekwe Mbizo MP Corban Madzivanyika also challenged Ncube, reminding him that the original Trabablas Interchange budget presented to and approved by Parliament did not include the additional US$26 million. He questioned Ncubes authority to spend the extra funds without Parliamentary approval.\n\nMinister, you came and paid another additional US$26 million outside Parliament, where did you get that power to do such? Madzivanyika queried.\n\nHowever, Ncube insisted that, as Finance Minister, he is empowered to handle project budget overruns.\n\nOne did not have to come back to Parliament to be able to exercise the powers that Parliament and the Executive have already awarded or extended to me as Minister of Finance, he responded.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/10165407/trabablas.jpg",
            "description": "<p>By Costa Nkomo The cost of constructing the recently commissioned Trabablas Interchange in Harare was beyond the US$88 million initially communicated and budgeted for, Treasury has revealed. The Treasury confirmed in Parliament that the project cost a total of US$114 million – an increase of US$26 million. When questions were raised about the project’s cost,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/trabablas-interchange-cost-hits-us114-million-as-treasury-reveals-an-unbudgeted-us26-million-was-paid/\">Trabablas Interchange cost hits US$114 million as Treasury reveals an unbudgeted US$26 million was paid    </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "10 Jul 2025"
        },
        {
            "title": "Father Zimbabwe: Parliament demands public holiday in honour of Joshua Nkomo",
            "url": "https://www.newzimbabwe.com/father-zimbabwe-parliament-demands-public-holiday-in-honour-of-joshua-nkomo/",
            "content": "By Staff Reporter\n\nPARLIAMENT has demanded that President Emmerson Mnangagwa declare 1 July a public holiday in honour of the late deputy president Joshua Nkomo.\n\nNkomo, affectionately known as Father Zimbabwe, died on 1 July 1999 due to prostate cancer.\n\nThe revered former ZAPU leader was credited for his selfless contribution to the unity of Zimbabwe after independence.\n\nThis has warranted calls for the day he died to be observed as a public holiday to cement his hero status.\n\nCitizens Coalition for Change (CCC) lawmaker Charles Moyo said in accordance with Public Holidays and Business Prohibition Act,President Mnangagwa should set aside a Joshua Nkomo Day.\n\nWe are who we are today because of selfless leadership, immense contribution, unifying efforts and the peace-making attributes of the late Dr. Joshua Mqabuko Nyongolo Nkomo, our late Vice President, also known as Father Zimbabwe, Umdala Wethu, Chibwechitedza.\n\nIt is in the same vein that I pray that we continue to have peace and unity in this Parliament and our motherland, Zimbabwe. Furthermore, Mr. Speaker, most importantly, is to request His Excellency, the President of Zimbabwe, Dr. E. D. Mnangagwa, who is also our SADC Chair, to declare 1 July of every year as a public holiday through the Public Holidays and Business Prohibition Act [Chapter 10:21], said Moyo.\n\nNkomo is hailed for the role that he played in ending the mass killings of ZAPU supporters in Matebeleland and parts of the Midlands by State security agents.\n\nThe Unity accord he signed with Robert Mugabe on 22 December signalled an end to one of the most divisive periods in an independent Zimbabwe.\n\nSpeaker of Parliament Jacob Mudenda acknowledged the receipt of Moyos statement in the National Assembly.\n\nI shall convey that sentiment to His Excellency, the President, as indicated in your statement, said Mudenda.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/05/29115441/Joshua-Nkomo.jpg",
            "description": "<p>By Staff Reporter PARLIAMENT has demanded that President Emmerson Mnangagwa declare 1 July a public holiday in honour of the late deputy president Joshua Nkomo. Nkomo, affectionately known as Father Zimbabwe, died on 1 July 1999 due to prostate cancer. The revered former ZAPU leader was credited for his selfless contribution to the unity of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/father-zimbabwe-parliament-demands-public-holiday-in-honour-of-joshua-nkomo/\">Father Zimbabwe: Parliament demands public holiday in honour of Joshua Nkomo</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "10 Jul 2025"
        }
    ]
}