{
    "news": [
        {
            "title": "Zimbabwe seeks to increase SMEs’ access to Chinese market, says minister",
            "url": "https://www.newzimbabwe.com/zimbabwe-seeks-to-increase-smes-access-to-chinese-market-says-minister/",
            "content": "Xinhua\n\nZimbabwe is actively seeking to increase access for its small and medium-sized enterprises (SMEs) to the Chinese market, leveraging on existing trade relations between the two countries, a Zimbabwean cabinet minister said Wednesday.\n\nResponding to a question from Xinhua on the sidelines of the SMEs International Expo in Harare, Zimbabwes capital, Minister of Women Affairs, Community, Small and Medium Enterprises Development Monica Mutsvangwa said the Chinese market can provide momentum to propel SMEs into globally competitive enterprises through market access and industry partnerships.\n\nChina is a big market, and we want to take advantage and leverage the good relationships between our two countries, she said.\n\nMutsvangwa said locally produced heritage products and cultural artefacts, such as indigenous stone and wood sculptures, can be exported to China, further elevating the export portfolios of local SMEs.\n\nWhen it comes to indigenous products, we have very good products which Chinese consumers really love, especially artifacts, she said. What we do produce is organic, and it is what the Chinese are very much interested in.\n\nThe minister noted that to further expand into the Chinese market, local enterprises, including medium enterprises, exhibited at the China International Import Expo, which just ended in Chinas Shanghai.\n\nMutsvangwa emphasized the need to capacitate local SMEs through digital skills to enable them to achieve scalable growth and expand into the Chinese digital market.\n\nWe want our SMEs to learn, especially digital skills. We know that a lot of businesses are now being done online, so when we do not train our SMEs enough digital skills, we are automatically discriminating them from the e-commerce, e-market, she said.\n\nZimbabwes SMEs International Expo is an annual exhibition that seeks to create synergies and a networking platform for micro, small and medium businesses.\n\nSMEs are a key pillar of Zimbabwes economy, accounting for a significant share of employment and contributing more than 60 percent to Zimbabwes gross domestic product, according to the Ministry of Women Affairs, Community, Small and Medium Enterprises Development.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/11/05165231/Monica-Mutsvangwa-Information-Minister.jpg",
            "description": "<p>Xinhua Zimbabwe is actively seeking to increase access for its small and medium-sized enterprises (SMEs) to the Chinese market, leveraging on existing trade relations between the two countries, a Zimbabwean cabinet minister said Wednesday. Responding to a question from Xinhua on the sidelines of the SMEs International Expo in Harare, Zimbabwe’s capital, Minister of Women</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-seeks-to-increase-smes-access-to-chinese-market-says-minister/\">Zimbabwe seeks to increase SMEs’ access to Chinese market, says minister</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:12",
            "date": "14 Nov 2025"
        },
        {
            "title": "Nigeria cancels mother-tongue teaching in primary schools and reverts to English",
            "url": "https://www.newzimbabwe.com/nigeria-cancels-mother-tongue-teaching-in-primary-schools-and-reverts-to-english/",
            "content": "BBC\n\nThe Nigerian government has announced it is cancelling a controversial policy that mandated the use of indigenous languages for teaching in the earliest years of schooling instead of English.\n\nEducation Minister Tunji Alausa said the programme, introduced just three years ago, had failed to deliver and was being scrapped with immediate effect.\n\nInstead, English will be reinstated as the medium of instruction from pre-primary levels through to university.\n\nThe now-defunct programme was launched by former Education Minister Adamu Adamu, who had argued that children learnt more effectively in their mother tongue.\n\nAt the time, Adamu argued that pupils grasped concepts more readily when taught in their own mother tongue  a view supported by numerous UN studies on early childhood education.\n\nNigerias education system is facing serious problems, such as poor-quality teaching, inadequate materials, low pay for teachers and numerous strikes.\n\nAlthough 85% of children go to primary school, less than half complete their secondary education.\n\nSome 10 million children are out of school in Nigeria, more than in any other country, according to the UN.\n\nAnnouncing the reversal of the language policy in the capital, Abuja, Dr Alausa pointed to poor academic results from those areas which had adopted mother-tongue teaching.\n\nHe cited data from the West African Examinations Council (WAEC), the National Examinations Council (Neco), and the Joint Admissions and Matriculation Board (Jamb).\n\nWe have seen a mass failure rate in WAEC, Neco, and Jamb in certain geo-political zones of the country, and those are the ones that adopted this mother tongue in an over-subscribed manner, the minister stated.\n\nThe abrupt cancellation of the policy has drawn a mixed response from education specialists, analysts and parents.\n\nSome have hailed the governments decision, agreeing that the implementation was problematic and contributed to falling standards.\n\nOthers, however, believe the policy was abandoned prematurely. They argue that such a significant shift requires substantial investment in teacher training, the development of textbooks and learning materials, and a longer timeframe before it can be fairly judged and begin to bear fruit.\n\nEducation expert Dr Aliyu Tilde praised the reversal, saying Nigeria isnt ready for such a move.\n\nDoes Nigeria have trained teachers to teach in the dozens of indigenous languages in the country? The answer is no. Also the major exams like WAEC, Jamb are all in English and not in those mother tongue languages.\n\nI think whats needed to improve the quality of our schools is bringing in qualified teachers, he told the BBC.\n\nA mother who has two children in early education schools, Hajara Musa, said she supported the reversal as it would help young children to learn English at an early age.\n\nEnglish is a global language that is used everywhere and I feel its better these kids start using it from the start of their schooling instead of waiting for when they are older, she told the BBC.\n\nHowever, social affairs analyst Habu Dauda disagreed.\n\nI think it was scrapped prematurely instead of giving it more time. Three years is too little to judge a big shift such as this  the government ought to have added more investment, he said.\n\nThe debate highlights the ongoing challenge in Nigeria of balancing the promotion of its rich linguistic heritage with the practical demands of a national curriculum and a globalised economy where English proficiency is dominant.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/13160202/NIGERIA-SCHOOLS.webp",
            "description": "<p>BBC The Nigerian government has announced it is cancelling a controversial policy that mandated the use of indigenous languages for teaching in the earliest years of schooling instead of English. Education Minister Tunji Alausa said the programme, introduced just three years ago, had failed to deliver and was being scrapped with immediate effect. Instead, English</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nigeria-cancels-mother-tongue-teaching-in-primary-schools-and-reverts-to-english/\">Nigeria cancels mother-tongue teaching in primary schools and reverts to English</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:12",
            "date": "14 Nov 2025"
        },
        {
            "title": "COP30: Zimbabwe’s forest and energy projects reveal the downside of carbon credits",
            "url": "https://www.newzimbabwe.com/cop30-zimbabwes-forest-and-energy-projects-reveal-the-downside-of-carbon-credits/",
            "content": "By Fadzai Chipato, The Conversation\n\nCarbon offsetsare a way for companies or countries that pollute the air to cancel out some of their carbon emissions by funding projects that protect forests, plant trees, or provide clean energy  sometimes on the other side of the world. Polluting companies in the US, Europe, Asia or elsewhere can buy onecarbon creditfrom a green project anywhere in exchange for emitting one metric tonne of carbon dioxide (CO). But do these projects benefit the African countries that host them? Rural development researcher Fadzai Chipato studied two carbon offset projects in Zimbabwe.Her research foundthat these projects can negatively affect local communities.\n\nIn Zimbabwe, carbon offsetting began around 2011 with theKariba REDD+(reducing emissions from deforestation and forest degradation in developing countries) project.\n\nIt was run by a Zimbabwean company,Carbon Green Africa, which leased 758,000 hectares of degraded forest from four local councils in northern Zimbabwe where forest could be regrown for the purpose of selling carbon credits.\n\nThe company aimed to work with local communities to halt deforestation throughconservation farming protecting the soil by not digging in it and planting a variety of crops. They also funded nutrition gardens and beekeeping projects, and providedbiogas digestersand fuel-efficient stoves to reduce the number of trees cut down for firewood.\n\nMany families benefited through food, education, and extra income. However, the projects were run from the top down. Decisions were made by investors, the government, and rural district councils. Local villagers had very little say.\n\nIn 2023, Zimbabwe passed anew carbon trading law. This required all carbon projects to be registered withthe governmentand pay 30% of revenues to the state. TheKariba REDD+was stopped, leaving villagersunsurewhether their gardens, beekeeping, and clean energy projects would continue.\n\nThe second project I studied is theCicada Holdings Project, which aimed to plant 100 million indigenous trees over 30 years and give out 120,000 cookstoves that use less firewood.\n\nUnlike Kariba, Cicada worked more closely with local farmers and by December 2025, it had given out 160,000 environmentally friendly stoves. However, it was also slowed down by the new law, with the government taking more than 18 months to process new registrations.\n\nOn the positive side,the Kariba projectset up 24 community gardens, including seven school gardens, that provided 3,000 people directly or indirectly with food. One garden generated enough income to support 10 orphans.\n\nThe community gardens have improved my familys quality of life. I managed to pay my daughters school fees and buy household supplies.\n\nNewconservation farmingmethods were introduced. Maize, and two nutritious crops that are fairly drought resistant  sorghum and millet  were grown. Beekeeping in the forests was also introduced. As farmers said:\n\nWe learned about innovative agriculture practices to improve our yields, which were low due to the low rainfall. We now experience better harvests, improving our food sustenance and even selling excess crops, generating financial income.\n\nBeyond forest preservation, beekeeping provides additional income for farmers and serves as a rich source of food for humans, thereby improving community livelihoods.\n\nThe Kariba REDD+ project also builtbiogas digestersat hospitals to generate clean energy from dung. Local villagers could sell cattle dung to these projects in exchange for medical treatments and cash.\n\nCicadas clean cookstoves reduced smoke-related illnesses and had other benefits:\n\nThe stoves are very helpful; we are no longer collecting firewood, which was getting difficult to find.\n\nOn the other hand,my research revealedthat many communities were excluded from decision-making. Some only found out about projects in their villages through the media. Local politicians were also unhappy when projects were put on ice after the new law introduced stringent registration requirements:\n\nWe were shocked when the project was stopped, saying the government was not involved. We asked ourselves, arent Rural District Councils part of the government?\n\nA further problem was that project funds went through many intermediary brokers, councils and non-governmental organisations. Villagers never knew how much money the carbon credits were generating or how it was spent. This lack of transparency caused mistrust.\n\nOverall,my research found thatcarbon offsets in Zimbabwe have not been neutral tools. They are political and economic processes that reshape who controls land, who benefits, and who is left out. Because they restrict traditional access to forests, firewood and grazing land, these projects create virtual dispossession.\n\nFor example, people were stopped from collecting firewood, grazing cattle, or making bricks in forest areas that had always been communal land. Women and youth who earned a living from the forests were badly affected by having fewer rights to use their land.\n\nThismirrorswider patterns across Africa, where communal land that supports households is redefined as underutilised and given over global carbon markets, often without fair consultation with the people using the land.\n\nTo make carbon offsetting fairer in Zimbabwe and the global south, several measures are needed:\n\nWithout these changes, carbon offsetting risks becoming another form of green grabbing that takes land and resources from Indigenous people who have used them for centuries in the name of climate change adaptation.\n\nLecturer in the Department of Sociology and Social Anthropology, Great Zimbabwe University\n\nThis article was originally published byThe Conversation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/04/22192853/vegetation-scaled-e1587580165697.jpg",
            "description": "<p>By Fadzai Chipato, The Conversation Carbon offsets are a way for companies or countries that pollute the air to “cancel out” some of their carbon emissions by funding projects that protect forests, plant trees, or provide clean energy – sometimes on the other side of the world. Polluting companies in the US, Europe, Asia or elsewhere</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cop30-zimbabwes-forest-and-energy-projects-reveal-the-downside-of-carbon-credits/\">COP30: Zimbabwe’s forest and energy projects reveal the downside of carbon credits</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:12",
            "date": "14 Nov 2025"
        },
        {
            "title": "UN reaffirms commitment to helping Zimbabwe accelerate progress towards SDGs",
            "url": "https://www.newzimbabwe.com/un-reaffirms-commitment-to-helping-zimbabwe-accelerate-progress-towards-sdgs/",
            "content": "Xinhua\n\nThe United Nations (UN) on Wednesday reaffirmed its commitment to helping Zimbabwe accelerate progress towards achieving the Sustainable Development Goals (SDGs) by 2030.\n\nSpeaking at a steering committee meeting in the Zimbabwean capital of Harare, UN Resident and Humanitarian Coordinator in Zimbabwe Edward Kallon said the UN stands ready to support Zimbabwe through the mobilization of expertise, brokering effective partnerships, and ensuring that financing and policy solutions are coherent, socially just, and environmentally sustainable.\n\nIt is through a collective will and practical solidarity that Zimbabwe can achieve the SDGs within the next five years, Kallon said, adding that progress on SDGs will hinge on collective political will, fiscal discipline, and continued macroeconomic stability.\n\nTo accelerate Zimbabwes progress towards the SDGs, Kallon said Zimbabwe should urgently resolve its external debt and arrears to unlock concessionary financing for development, boost investments in renewable energy for rapid rural electrification, boost digital connectivity and its food and land systems.\n\nThe debt and arrears resolution must be sequenced to protect the poor and preserve policy space for SDG investments, Kallon said, noting that Zimbabwe deserves access to concessional finance and guarantees to attract private capital for key sectors such as infrastructure, renewable energy, and productive activities.\n\nHe said Zimbabwe should invest in resilient urban infrastructure, public transport, water and sanitation, and affordable housing to absorb urbanization and create jobs, as well as boost industrialization, social protection, and the care economy.\n\nKallon said Zimbabwe should also strengthen its statistical capacity to enable the collection of timely, disaggregated, and interoperable data to guide evidence-based adjustments and ensure accountability in sustainable development efforts.\n\nHe urged Zimbabwe to develop a comprehensive national SDGs acceleration plan for the next five years that clearly aligns with its national development goals.\n\nIt is essential to scale up targeted, country-led investments that aim to lift people out of poverty by strengthening essential systems such as food security, universal health coverage, water and sanitation, adequate housing, energy access, and quality education, he added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/07/29190200/HE-Edward-Kallon_01-810x759-1.jpg",
            "description": "<p>Xinhua The United Nations (UN) on Wednesday reaffirmed its commitment to helping Zimbabwe accelerate progress towards achieving the Sustainable Development Goals (SDGs) by 2030. Speaking at a steering committee meeting in the Zimbabwean capital of Harare, UN Resident and Humanitarian Coordinator in Zimbabwe Edward Kallon said the UN stands ready to support Zimbabwe through the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/un-reaffirms-commitment-to-helping-zimbabwe-accelerate-progress-towards-sdgs/\">UN reaffirms commitment to helping Zimbabwe accelerate progress towards SDGs</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:12",
            "date": "14 Nov 2025"
        },
        {
            "title": "Why the colour purple is a powerful symbol in the fight against gender-based violence",
            "url": "https://www.newzimbabwe.com/why-the-colour-purple-is-a-powerful-symbol-in-the-fight-against-gender-based-violence/",
            "content": "IOL\n\nPurple is more than just a colour. It tells a story, stands as a symbol and makes a statement.\n\nOver the years, this bold shade has come to represent wisdom, dignity, courage and resistance.\n\nToday, purple is at the heart of a movement that goes beyond social media. It has become a call for justice, unity and change, especially in the fight against gender-based violence (GBV).\n\nPurple has held deep meaning from ancient royalty to todays activism.\n\nBut why is it the colour chosen by movements for womens justice and equality?\n\nHistorically, collective action using this colour has sparked significant change, uniting individuals under a common banner of resistance and hope.\n\nIt stands as a beacon of solidarity that reminds us how powerful we can be when we come together.\n\nHow can we use its power to create real change in a world that sometimes ignores womens voices?\n\nPurple has always been associated with power and transformation.\n\nCenturies ago, it signified wealth and royalty due to the rarity of its dye. But in modern times, purple transitioned into a colour of defiance and solidarity.\n\nThe suffragettes of the early 20th century adopted purple as a symbol of justice and dignity in their fight for womens right to vote.\n\nIn the 1960s and the 70s, second-wave feminists revived its use, tying it to the broader womens liberation movement.\n\nToday, purple is worn and displayed during Domestic Violence Awareness Month, observed in October, honouring victims and survivors while raising awareness for GBV.\n\nBut its not just about the history. Purples symbolism is personal, spiritual and empowering.\n\nIn colour psychology, it represents creativity, independence and ambition. Its spiritual side aligns with transformation and wisdom, a fitting emblem for movements seeking to challenge entrenched societal norms. \n\nBuilding on its history of transformation, purple now takes on a vital role in South Africa today: resistance.\n\nWomen For Change, a civil society group, has spearheaded a powerful purple-themed movement to confront the countrysepidemic of GBV and femicide.\n\nOver 5,500 women were murdered in South Africa in just one year, according to recent police reports, a 33.8% increase.\n\nThe femicide rate is six times higher than the global average. Behind every number is a life, a story, and a family shattered by violence.\n\nWomen For Change has called for a nationwide shutdown on Friday, November 21. Their demands are simple yet profound: declare GBV a national disaster.\n\nTo amplify their message, theyve turned to the colour purple, urging supporters to change their profile pictures to purple, wear black in mourning and participate in symbolic actions that disrupt daily life.\n\nAfter the shutdown, maintaining momentum is crucial.\n\nActivists are encouraged to contact local officials, demanding stronger policies and accountability measures.\n\nOrganising local events and forums to discuss ongoing strategies can also help sustain pressure and progress.\n\nHeres how to join the purple movement:\n\n Change your profile picture to purple: Amplify the movement online and keep the conversation alive.\n\n Wear black: A simple yet powerful way to symbolise mourning and resistance.\n\n Step away from work: Both paid and unpaid labour for one day, highlight the invisible work women shoulder daily.\n\n Lie down at noon: Join the 15-minute standstill, lying down for one minute for each of the 15 women murdered daily in South Africa.\n\n Dont spend: Withdraw from the economy for a day to demonstrate womens economic power.\n\nThis isnt just a South African issue; this is a global call to action. From Zimbabwe to Namibia, Kenya to Korea, women are using purple to say, Enough is enough.\n\nThe movement is proof that digital platforms can mobilise real change, and purple is its unifying force.\n\nPurples power isnt limited to GBV. It has become a unifying colour for multiple causes:\n\nPurples versatility speaks to its universal appeal. Its a colour of visibility, justice and resilience qualities that resonate across movements and borders.\n\nDespite the overwhelmingcrisis of GBV, South Africas National Disaster Management Centre(NDMC) recently declined a petition to declare it a national disaster.\n\nAccording to Dr Ellias Sithole, the head of the NDMC, the issue, while severe, does not meet the legal definition of a disaster under the Disaster Management Act.\n\nInstead, the government insists that existing mechanisms, like the National Strategic Plan on GBVF, are sufficient to address the crisis.\n\nBut activists disagree. They argue that the current systems are failing to protect women and hold perpetrators accountable.\n\nThe purple movement is a direct response to this inaction, a refusal to accept the status quo.\n\n In South Africa, anyone experiencing GBV can access support through several key services. The GenderBased Violence Command Centre is available 24/7 at 0800428428 or through a Please Call Me to *120*7867# from any cell phone.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/13161939/purple-women-gbv-canva.jpeg",
            "description": "<p>IOL Purple is more than just a colour. It tells a story, stands as a symbol and makes a statement. Over the years, this bold shade has come to represent wisdom, dignity, courage and resistance. Today, purple is at the heart of a movement that goes beyond social media. It has become a call for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/why-the-colour-purple-is-a-powerful-symbol-in-the-fight-against-gender-based-violence/\">Why the colour purple is a powerful symbol in the fight against gender-based violence</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:12",
            "date": "14 Nov 2025"
        },
        {
            "title": "Warriors suffer 3-1 defeat to Algeria as new coach marks debut",
            "url": "https://www.newzimbabwe.com/warriors-suffer-3-1-defeat-to-algeria-as-new-coach-marks-debut/",
            "content": "By Sports Reporter\n\nNew Warriors coach Marian Marinica began his tenure with a 3-1 defeat to Algeria in an international friendly played at the Prince Abdullah Al-Faisal Stadium in Saudi Arabia.\n\nMarinica fielded a starting eleven that featured several new faces, with Gerald Takwara captaining the side.\n\nAlgeria dominated from the first whistle and needed only 14 minutes to open the scoring through Bagdad Bounedjah, who fired past goalkeeper Washington Arubi.\n\nThe Desert Foxes doubled their advantage in the 40th minute when Mohamed Amoura finished superbly after poor marking by the Zimbabwean defence.\n\nRight on the stroke of halftime, Algerian defender Jaouen Ahjam added a third, again capitalising on Zimbabwes weak defense.\n\nAt the start of the second half, Marinica made four changes, bringing on Prosper Padera, Tawanda Chirewa, Godknows Murwira, and Prince Dube to substitute Bill Antonio, Sean Fusire, Washington Navaya, and Tawanda Maswanhise.\n\nThe substitutions steadied the team, and Zimbabwe began to pose occasional threats going forward.\n\nThe Warriors finally found the net in the 86th minute when Chirewa converted a penalty he had won after being fouled in the box.\n\nDespite the 3-1 defeat, Marinica will take some positives, notably helping Zimbabwe end a four-match goal drought, their last goal having come against Niger in a friendly back in June.\n\nZimbabwe now shifts focus to their next fixture against Qatar on Monday.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/13191959/IMG_20251113_211630.jpg",
            "description": "<p>By Sports Reporter New Warriors coach Marian Marinica began his tenure with a 3-1 defeat to Algeria in an international friendly played at the Prince Abdullah Al-Faisal Stadium in Saudi Arabia. Marinica fielded a starting eleven that featured several new faces, with Gerald Takwara captaining the side. Algeria dominated from the first whistle and needed</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/warriors-suffer-3-1-defeat-to-algeria-as-new-coach-marks-debut/\">Warriors suffer 3-1 defeat to Algeria as new coach marks debut</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:12",
            "date": "14 Nov 2025"
        },
        {
            "title": "Robert Mugabe Jnr fined US$300 following conviction for illegal drug possession",
            "url": "https://www.newzimbabwe.com/robert-mugabe-jnr-fined-us300-following-conviction-for-illegal-drug-possession/",
            "content": "By Staff Reporter\n\nLate former President Robert Mugabes son, Robert Tinotenda Mugabe Junior (33), has been fined US$300 after being found guilty of unlawful possession of drugs.\n\nMugabe appeared before Harare magistrate Lisa Mutendereki, who ordered him to pay the fine or serve four months in prison if he defaults.\n\nHe was convicted on Thursday after pleading for leniency, telling the court he is a single father of two children.\n\nMugabe was arrested in October after police allegedly found two sachets of dagga, a pack of Rizla, and a white dagga crusher in his sling bag during a traffic blitz in Harare.\n\nAccording to court papers, he was stopped after driving against a one-way street along Second Street Extension in a silver Honda Fit.\n\nHe was represented by lawyer Ashiel Mugiya.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/13161100/robert-mugabe-jnr.jpeg",
            "description": "<p>By Staff Reporter Late former President Robert Mugabe’s son, Robert Tinotenda Mugabe Junior (33), has been fined US$300 after being found guilty of unlawful possession of drugs. Mugabe appeared before Harare magistrate Lisa Mutendereki, who ordered him to pay the fine or serve four months in prison if he defaults. He was convicted on Thursday</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/robert-mugabe-jnr-fined-us300-following-conviction-for-illegal-drug-possession/\">Robert Mugabe Jnr fined US$300 following conviction for illegal drug possession</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:12",
            "date": "14 Nov 2025"
        },
        {
            "title": "Mugabe Jnr convicted for drug possession – pleads for leniency, says he is a single father of two",
            "url": "https://www.newzimbabwe.com/mugabe-jnr-convicted-for-drug-possession-pleads-for-leniency-says-he-is-a-single-father-of-two/",
            "content": "By Mary Taruvinga\n\nRobert Tinotenda Mugabe Junior, the son of the late former President Robert Mugabe, has been convicted of unlawful possession of drugs and is set to be sentenced this afternoon.\n\nDuring mitigation, Mugabe, 33,pleaded for leniency, telling the court he is a single father of two children.\n\nI am a farmer, single father of two, earning US$7,000 a month, a first-time offender and pleaded on own accord.\n\nHe was arrested in October after police allegedly found two sachets of dagga, a pack of Rizla, and a white dagga crusher in his sling bag during a traffic blitz in Harare.\n\nMugabe was initially granted US$300 bail by Harare magistrate Lisa Mutendereki after spending two nights in custody.\n\nAccording to court papers, he was stopped after driving against a one-way street along 2nd Street Extension in a silver Honda Fit, registration number AGY 5850.\n\nProsecutor Mandirasa Chigumira told the court that the recovered dagga, weighing two grams and valued at US$30, would be tendered as an exhibit.\n\nThe accused acted unlawfully, Chigumira said during the trial, adding that Mugabe refused to sign the police seizure receipt.\n\nMugabe is represented by lawyer Ashiel Mugiya.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/02155751/robert-jnr-mugabe.webp",
            "description": "<p>By Mary Taruvinga Robert Tinotenda Mugabe Junior, the son of the late former President Robert Mugabe, has been convicted of unlawful possession of drugs and is set to be sentenced this afternoon. During mitigation, Mugabe, 33, pleaded for leniency, telling the court he is a single father of two children. “I am a farmer, single father</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mugabe-jnr-convicted-for-drug-possession-pleads-for-leniency-says-he-is-a-single-father-of-two/\">Mugabe Jnr convicted for drug possession – pleads for leniency, says he is a single father of two</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:12",
            "date": "14 Nov 2025"
        },
        {
            "title": "Sikhala granted R10,000 bail by South African court",
            "url": "https://www.newzimbabwe.com/sikhala-granted-r10000-bail-by-south-african-court/",
            "content": "By Costa Nkomo\n\nOpposition leader Job Sikhala and his co-accused Alexander Thema have been granted R10 000 bail each by the Pretoria Magistrates Court.\n\nThe matter has been moved to 3 February 2026.\n\nSikhala and his elderly uncle, Thema were arrested last week on charges of possession of explosives. The two maintain their innocence.\n\nAccording to Gauteng regional spokesperson for South Africas National Prosecuting Authority (NPA), Lumka Mahanjana, police intercepted the pair along Kgosi Mampuru Street in Pretoria on November 6 following a tip-off about a suspicious vehicle.\n\nThe vehicle was searched and found with 26 blasting cartridges and 15 capped fuse connectors.\n\nSikhala insists it was a set-up, describing his detention as politically motivated.\n\nSikhala has been frequenting South Africa for medical treatment after his health deteriorated when he spentover 500 days in pretrial detention before being released without charge.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/10115142/20251110_135118.jpg",
            "description": "<p>By Costa Nkomo Opposition leader Job Sikhala and his co-accused Alexander Thema have been granted R10 000 bail each by the Pretoria Magistrates Court. The matter has been moved to 3 February 2026. Sikhala and his elderly uncle, Thema were arrested last week on charges of possession of explosives. The two maintain their innocence. According</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sikhala-granted-r10000-bail-by-south-african-court/\">Sikhala granted R10,000 bail by South African court</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:12",
            "date": "14 Nov 2025"
        }
    ]
}