{
    "news": [
        {
            "title": "‘Like a sci-fi movie’: US baby born from 30-year-old frozen embryo breaks record",
            "url": "https://www.newzimbabwe.com/like-a-sci-fi-movie-us-baby-born-from-30-year-old-frozen-embryo-breaks-record/",
            "content": "BBC\n\nA baby boy has been born to an Ohio couple from an embryo that was frozen for more than 30 years, reportedly setting a new world record.\n\nLindsey, 35, and Tim Pierce, 34, welcomed their son, Thaddeus Daniel Pierce, on Saturday. Ms Pierce toldMIT Technology Reviewher family thought its like something from a sci-fi movie.\n\nIt is believed to be longest that an embryo has been frozen before resulting in a successful live birth. The previous record-holder wasa pair of twins who were born in 2022 from embryos frozen in 1992.\n\nThe Pierces had tried to have a child for seven years before they decided to adopt the embryo Linda Archerd, 62, made with her then-husband in 1994 through IVF.\n\nAt the time, Ms Archerd initially created four embryos. One become her now-30-year-old daughter, and the other three were left in storage.\n\nDespite separating from her husband, she did not want to get rid of the embryos, donate them for research or give them to another family anonymously.\n\nShe said it was important that she was involved with the baby, as they would be related to her adult daughter.\n\nMs Archerd paid thousands of dollars a year for storage until she found a Christian embryo adoption agency, Nightlight Christian Adoptions, which runs a programme known as Snowflakes. Many of these agencies consider their programmes to be saving lives.\n\nThe programme used by Ms Archerd allows donors to choose a couple, meaning they can state religious, racial and nationality preferences.\n\nMs Archerds preference was for a married Caucasian, Christian couple living in the US, as she didnt want to go out of the country, she told MIT Technology Review.\n\nShe ultimately matched with the Pierces.\n\nThe IVF clinic in Tennessee at which the couple underwent the procedure, Rejoice Fertility, said its aim was to transfer any embryo it received, no matter the age or conditions.\n\nMs Pierce said she and her husband did not set out to break any records, but just wanted to have a baby.\n\nMs Archerd told MIT Technology Review she had not met the baby in person yet, but could already see a resemblance with her daughter.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/31194934/embryo.webp",
            "description": "<p>BBC A baby boy has been born to an Ohio couple from an embryo that was frozen for more than 30 years, reportedly setting a new world record. Lindsey, 35, and Tim Pierce, 34, welcomed their son, Thaddeus Daniel Pierce, on Saturday. Ms Pierce told MIT Technology Review her family thought “it’s like something from a sci-fi</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/like-a-sci-fi-movie-us-baby-born-from-30-year-old-frozen-embryo-breaks-record/\">‘Like a sci-fi movie’: US baby born from 30-year-old frozen embryo breaks record</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "07:05",
            "date": "01 Aug 2025"
        },
        {
            "title": "Mutapa Fund driving sustainable growth – Govt",
            "url": "https://www.newzimbabwe.com/mutapa-fund-driving-sustainable-growth-govt/",
            "content": "By Alois Vinga\n\nFINANCE Minister, Mthuli Ncube, says the Mutapa Investment Fund (MIF) is driving sustainable growth by undertaking projects of high national impact.\n\nEstablished in 2015 and first known as the Sovereign Wealth Fund, the MIF is Zimbabwes sovereign wealth fund, which is a pool of resources that the government invests for the future.It was renamed in 2023.\n\nPresenting the Mid-Term Budget Review before ParliamentThursday, Ncube expressed confidence in the MIFs potential to spur national sustainable growth.\n\nHe said to date,the Fund has achieved significant strides towards strengthening the governance frameworks and enhancing the financial performance of the portfolio companies under its ambit.\n\nThe Fund has injected capital into a significant number of portfolio companies, most of which have started registering improved performance. The capital deployment to the portfolio companies is guided by the Investment Strategy of the Fund and the diagnostic assessment report, prioritising long-term value creation, stability and prosperity, Ncube said.\n\nInvestments currently under consideration include procurement of buses for the Zimbabwe United Passenger Company (ZUPCO) to minimise public transport challenges, capitalisation of the National Railways of Zimbabwe (NRZ) to rehabilitate rail infrastructure and address rolling stock challenges, crafting of sustainable operational models for COTTCO, Air Zimbabwe, Cold Storage Company and Silo Food industries, among others.\n\nThe Fund is also working with the Zimbabwe Electricity Supply Authority (ZESA) on a variety of initiatives to address power shortages, which include enhancing base load, together with the implementation of prepaid, net and smart metering projects.\n\nBased on the current and projected investments in the energy sector, the Fund is optimistic that load shedding will be significantly minimised in the outlook period, not least because of the rehabilitation of Hwange Units 1 to 6 under a Rehabilitate Operate and Transfer concession agreement between Zimbabwe Power Company and Jindal Africa, added Ncube.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/08/05173324/ZUPCO-bus.jpg",
            "description": "<p>By Alois Vinga FINANCE Minister, Mthuli Ncube, says the Mutapa Investment Fund (MIF) is driving sustainable growth by undertaking projects of high national impact. Established in 2015 and first known as the Sovereign Wealth Fund, the MIF is Zimbabwe’s sovereign wealth fund, which is a pool of resources that the government invests for the future. It</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mutapa-fund-driving-sustainable-growth-govt/\">Mutapa Fund driving sustainable growth – Govt</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "07:05",
            "date": "01 Aug 2025"
        },
        {
            "title": "Mid-term Budget Review: Zimbabwe’s debt stock hits US$21.5 billion",
            "url": "https://www.newzimbabwe.com/mid-term-budget-review-zimbabwes-debt-stock-hits-us21-5-billion/",
            "content": "By Alois Vinga\n\nZIMBABWEs total debt stock has surged to US$21.5 billion, rising by an estimated US$1 billion from the official figures disclosed during the same period last year.\n\nThe unsustainable debt continues to choke Zimbabwes capacity to unlock external funding, with local debt being criticised for crowding out the private sector.\n\nPresenting the 2025 Mid-Term Budget Review Thursday, Finance Minister Mthuli Ncube said the debt stock comprises local and external debt.\n\nIn US$ terms, the total PPG debt as at end March 2025, amounted to US$21.5 billion, comprising external debt stock of US$12.6 billion and domestic debt stock of US$8.9 billion. This brings the debt-to-GDP ratio to 44% as at 31 March 2025, he said.\n\nIn local currency terms, the countrys stock of Public and Publicly Guaranteed (PPG) debt stood at ZiG576.5 billion as at the end of March 2025. The debt was external debt totalling ZiG337.7 billion, and domestic debt amounting to ZiG238.8 billion, representing 58.6% and 41.4% respectively.\n\nThe external and domestic debt arrears as at end March 2025 amounted to US$7.8 billion, constituting 36% of total PPG debt. The accumulation of arrears since the year 2000 have been worsening the country`s debt situation, constraining access to external concessional financing.\n\nIn this regard, the government is implementing the Arrears Clearance and Debt Resolution Roadmap in order to restore debt sustainability and unlock critical external financing needed for the countrys development programs, he said.\n\nDomestic debt service in local currency totalled ZiG1.64 billion, comprising both principal and interest payments during the period January to June 2025.\n\nDuring the period January to June 2025, Treasury made payments amounting to US$176.28 million for external debt service, which includes US$93.72 million towards the active portfolio, US$79.75 million for legacy debts and US$2.81 million of token payments to the International Financial Institutions and the sixteen Paris Club Bilateral Creditors.\n\nOf this, ZiG39.52 million was paid towards interest payments and ZiG1.60 billion for principal payments related to ZiG-denominated Treasury Bills and bonds.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/12/01093427/mthuli-1.jpg",
            "description": "<p>By Alois Vinga ZIMBABWE’s total debt stock has surged to US$21.5 billion, rising by an estimated US$1 billion from the official figures disclosed during the same period last year. The unsustainable debt continues to choke Zimbabwe‘s capacity to unlock external funding, with local debt being criticised for crowding out the private sector. Presenting the 2025</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mid-term-budget-review-zimbabwes-debt-stock-hits-us21-5-billion/\">Mid-term Budget Review: Zimbabwe’s debt stock hits US$21.5 billion</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "07:05",
            "date": "01 Aug 2025"
        },
        {
            "title": "Mid-term Budget Review: Despite just 35% expenditure, Finance Minister Mthuli Ncube declares ZWG3.3 billion surplus",
            "url": "https://www.newzimbabwe.com/mid-term-budget-review-despite-just-35-expenditure-finance-minister-mthuli-ncube-declares-zwg33-billion-surplus/",
            "content": "By Alois Vinga\n\nDespite the fact that just 35% of the 2025 National Budget allotted funds were spent six months into the year, Finance Minister Mthuli Ncube declared a ZWG3.3 billion budget surplus in theMid-Term Budget Review Statement.\n\nPresenting the much-awaited Mid-Term Budget Review Statement, Thursday themed,Building Resilience for Sustained Economic Transformation, the Treasury boss confirmed earlier speculation that much of the allotted resources are rarely disbursed efficiently\n\nFiscal outlays for the period January to June 2025 amounted to ZWG98 billion, which is approximately 35.5% of the approved Budget. Recurrent expenditures were ZWG74.4 billion, while financial and non-financial assets (capital expenditure and net lending) amounted to ZWG23.6 billion, he said.\n\nOf this amount, more than half with ZWG45.4 billion, went towards employment costs and operations ZWG18.8 billion, interest payments paltry at ZWG2.5 billion and capital expenditure, including devolution, amounted to ZWG23.6 billion, leaving very few resources for capital expenditure.\n\nHowever, speaking to the media shortly after the budget presentation, Ncube defended the 35% expenditure to slower drawdowns by Ministries in the first quarter of the year.\n\nMinistries often take time to put their papers in order and we often experience limited revenue inflows during the first parts of the year which partly explains the expenditure patterns. However, we are currently working on improving ways in which expenditures can improve, he said.\n\nNcube said during the years first half, Treasury mobilised resources for budget financing totalling ZWG1.3 billion, including US$90 million Treasury Bills, through the issuance of domestic securities.\n\nIn US dollar terms, the fiscal framework translates to revenues of US$7.5 billion and expenditures of US$7,7 billion, as well as a budget deficit of US$168.4 million.\n\nHe said during the first half of the year 2025, both inflation and exchange rate were relatively stable than envisaged. The budget has, therefore, been performing below target in local currency terms, although performance was significantly above target in foreign currency terms.\n\nRevenue collections during the period amounted to ZWG101.2 billion against a target of ZWG118.1 billion, whilst expenditures were ZiG98 billion against a target of ZWG127.5 billion.\n\nOn a cash accounting basis, a budget surplus of ZWG3.3 billion was recorded during the first six months of the year.\n\nNcube added that drastic reforms aimed at improving the ease of doing business and the eradication of multiple licensing fees would be aggressively implemented in the second half.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/24150814/Mthuli-1-e1669302803739.png",
            "description": "<p>By Alois Vinga Despite the fact that just 35% of the 2025 National Budget allotted funds were spent six months into the year, Finance Minister Mthuli Ncube declared a ZWG3.3 billion budget surplus in the  Mid-Term Budget Review Statement. Presenting the much-awaited Mid-Term Budget Review Statement, Thursday themed, “Building Resilience for Sustained Economic Transformation”, the Treasury</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mid-term-budget-review-despite-just-35-expenditure-finance-minister-mthuli-ncube-declares-zwg33-billion-surplus/\">Mid-term Budget Review: Despite just 35% expenditure, Finance Minister Mthuli Ncube declares ZWG3.3 billion surplus  </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "07:05",
            "date": "01 Aug 2025"
        }
    ]
}