{
    "news": [
        {
            "title": "Zimbabwe’s Central Bank orders exporters to surrender 30% foreign currency",
            "url": "https://www.newzimbabwe.com/zimbabwes-central-bank-orders-exporters-to-surrender-30-foreign-currency/",
            "content": "By Alois Vinga\n\nTHE Reserve Bank of Zimbabwe (RBZ) has compelled all exporters to surrender 30% of their earned foreign currency in exchange for the ZWG at the obtaining interbank exchange rate.\n\nPresenting the Monetary Policy Statement (MPS) premised under the theme, Fostering Price, Currency and Exchange Rate Stability Through Balancing Confidence, Trust, Credibility, Efficiency, Stability Growth the RBZ Governor John Mushayavanhu ordered exporters to surrender more US$.\n\nThe foreign currency retention level for exporters has been reduced from 75% to 70%, with immediate effect. This implies that the effective surrender portion of export proceeds has been increased from 25% to 30%, he said.\n\nHe said the initiative is aimed at guaranteeingcontinued stability in the interbank foreign exchange market through augmenting the supply of foreign currency, as well as building the critical foreign currency reserves needed to anchor the ZWG.\n\nHowever, the initiative to raise foreign currency by taking away the hard-earned US$ from the exporters comes at a time when most companies are crying foul over due to choking shortages of foreign currency.\n\nIndications on the ground are that the measure is likely to complicate an already tough situation.\n\nThis review is consistent with the increased use of ZiG in the economy. The additional 5% will ensure that exporters mobilise sufficient ZiG to meet local currency obligations and other expenses, including tax payments, going forward, said Mushayavanhu.\n\nThe central bank also moved to introduce a US Dollar Denominated Deposit Facility (USDDDF) where the export surrender proceeds will have an option to invest the funds in a USDDDF at the RBZ which they can withdraw in ZWG on demand, at the prevailing interbank exchange rate on the settlement date.\n\nGoing forward, Authorized Dealers are expected to on-sell foreign exchange purchased from willing sellers, including the RBZ at a margin consistent with international best practices.\n\nThe limits on funds that can be accessed from the Foreign Exchange Interbank Market had been set at US$500,000 and US$100,000 for Primary and Secondary users of foreign exchange, respectively, per week. The central bank issued streamlined Foreign Exchange Interbank Market Guidelines to operationalise the refinements on the exchange rate management system and removal of foreign exchange trading limits.\n\nIn order to promote the use of prepaid international debit and credit cards, the Reserve Bank has, with immediate effect, reviewed upwards the annual limit from US$500,000 to US$1,000,000. This review will also enhance the ease of doing business and reduce the use of foreign currency cash for cross-border transactions, the exchequer said.\n\nThe Bank Policy Rate was maintained at 35% per annum, as assessed to be appropriate to support the current tight Monetary Policy Stance (MPS).\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171559/mushayavanhu-rbz.jpg",
            "description": "<p>By Alois Vinga THE Reserve Bank of Zimbabwe (RBZ) has compelled all exporters to surrender 30% of their earned foreign currency in exchange for the ZWG at the obtaining interbank exchange rate. Presenting the Monetary Policy Statement (MPS) premised under the theme, “Fostering Price, Currency and Exchange Rate Stability Through Balancing Confidence, Trust, Credibility, Efficiency,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-central-bank-orders-exporters-to-surrender-30-foreign-currency/\">Zimbabwe’s Central Bank orders exporters to surrender 30% foreign currency</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "07 Feb 2025"
        },
        {
            "title": "‘We will not be bullied’: Ramaphosa’s strong message to global foes",
            "url": "https://www.newzimbabwe.com/we-will-not-be-bullied-ramaphosas-strong-message-to-global-foes/",
            "content": "TimesLive\n\nPresident Cyril Ramaphosa used his State of the Nation Address to send a strong message to his countrys detractors, warning that the South Africa he leads will not cower to bullies.\n\nSouth Africa, he said, was very capable of navigating the ever-changing and treacherous waters of the world and its geopolitics.\n\nHe said the country was witnessing the rise of nationalism, protectionism and the pursuit of narrow interests by global leaders.\n\nThis is the world that we, a developing economy, must now navigate. But we are not daunted to navigate our path through this world that constantly changes, said Ramaphosa.\n\nWe will not be deterred. We are a resilient people and we will not be bullied.\n\nThis stern message by Ramaphosa, which received loud applause and cheers in the National Assembly, comes after South Africa was in the past two weeks under an international microscope after leaders of the US and Rwanda censured the country.\n\nIt started with Rwandas Paul Kagame, who along with government officials criticised the presence of South African troops in the eastern DRC, claiming it was not for peacekeeping but to protect financial interests of many, including Ramaphosa himself.\n\nKagame also accused Ramaphosa of lying on the outcomes of their telephone conversation, where Ramaphosa is said to have warned that the continued firing towards the South African troops by M23 and the Rwandan Defence Force would be viewed as a declaration of war.\n\nUS President Donald Trump also zoomed into the affairs of South Africa this week, voicing what he says are concerns over the Expropriation Act that Ramaphosa signed into law.\n\nHe claimed that the country under Ramaphosa was doing very wrong things and that there was confiscation of private properties.\n\nBut Ramaphosa said South Africa had survived apartheid, which sought to dehumanise its people, suggesting the county would also defend and survive this.\n\nWe will stand together and speak with one voice in defence of our national interests, our sovereignty and our constitutional democracy by standing true to our values, by harnessing our unique strengths and endowments, and by forging a common purpose we can turn these trying circumstances to our advantage and propel our country forward.\n\nHe said South Africa stood for peace and justice, equality and solidarity. We stand for a non-racial future and we stand for democracy and tolerance as well as compassion. We stand for equal rights for women and people living with disability and members of the LGBTQIA+ community. We stand for our shared humanity, not for the survival of the fittest, he said.\n\nHis comments come after he had a telephonic conversation with Trumps right hand-man Elon Musk to try to explain that their view on what was happening in South Africa was completely wrong.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/07042857/ramaphosa-SONA.jpg",
            "description": "<p>TimesLive President Cyril Ramaphosa used his State of the Nation Address to send a strong message to his country’s detractors, warning that the South Africa he leads will not cower to bullies. South Africa, he said, was very capable of navigating the ever-changing and treacherous waters of the world and its geopolitics. He said the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/we-will-not-be-bullied-ramaphosas-strong-message-to-global-foes/\">‘We will not be bullied’: Ramaphosa’s strong message to global foes</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "07 Feb 2025"
        },
        {
            "title": "Zimbabwe’s gold, foreign reserves up 87%; hit US$550 million",
            "url": "https://www.newzimbabwe.com/zimbabwes-gold-foreign-reserves-up-87-hit-us550-million/",
            "content": "By Alois Vinga\n\nTHE Reserve Bank of Zimbabwes (RBZ) foreign currency reserves surged by 87% to reach US$550 million.\n\nAt inception in April 2024, the Reserve Bank of Zimbabwe (RBZ) claimed that minerals and foreign currency reserves backing up the ZWG stood at US$285 million, way above the thresholds to defend the local currency from unforeseen uncertainties.\n\nThe reserves consist of foreign currency and precious metals (mainly gold), from mining royalties, direct currency purchases from the interbank market and outright gold purchases.\n\nConsequently, the total holdings of gold and foreign reserves have since increased by 87%, from US$285 million in April 2024 to around US$550 million as at the end of January 2025. This has also ensured the full coverage of the total ZiG deposits in the economy of around ZiG13 billion, thereby supporting the Reserve Banks currency and exchange rate stability objectives, RBZ governor, John Mushayavanhu said.\n\nThe central bank said the reserves accumulation strategy is centred on ensuring that, at any point, the ZiG component of reserve money is fully backed.\n\nBased on the current trends of foreign exchange inflows, including in-kind royalties, the RBZ believes the reserve accumulation strategy for 2025 will result in a significant improvement in foreign reserve holdings at the Reserve Bank.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/07042601/gold.jpg",
            "description": "<p>By Alois Vinga THE Reserve Bank of Zimbabwe’s (RBZ) foreign currency reserves surged by 87% to reach US$550 million. At inception in April 2024, the Reserve Bank of Zimbabwe (RBZ) claimed that minerals and foreign currency reserves backing up the ZWG stood at US$285 million, way above the thresholds to defend the local currency from</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-gold-foreign-reserves-up-87-hit-us550-million/\">Zimbabwe’s gold, foreign reserves up 87%; hit US$550 million</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "07 Feb 2025"
        },
        {
            "title": "Muzarabani’s seven headlines Zimbabwe’s dominant opening day",
            "url": "https://www.newzimbabwe.com/muzarabanis-seven-headlines-zimbabwes-dominant-opening-day/",
            "content": "ESPNCrininfo\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/07041649/cricket.webp",
            "description": "<p>ESPNCrininfo Ireland 260 (McBrine 90*, Adair 78, Muzarabani 7-58, Ngarava 2-65) trail Zimbabwe 72 for 1 (Welch 33*, Kaitano 26*, McCarthy 1-25) by 188 runs What started out as a potentially one-sided day in Bulawayo was anything but. Ireland zig-zagged through multiple ups and downs, however, Zimbabwe ended up dominating the day. Blessing Muzarabani bowled like an Irish curse</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/muzarabanis-seven-headlines-zimbabwes-dominant-opening-day/\">Muzarabani’s seven headlines Zimbabwe’s dominant opening day</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "07 Feb 2025"
        },
        {
            "title": "New Start Centre suspends ART, PrEP refills",
            "url": "https://www.newzimbabwe.com/new-start-centre-suspends-art-prep-refills/",
            "content": "By Mary Taruvinga\n\nThe Population Solutions for Health (PSH) New Start Centre in Harares CBD has temporarily halted services for patients on ART and those seeking PrEP refills, NewZimbabwe.com has established.\n\nThis suspension follows the recent cessation of USAID funding resulting from the implementation of President Donald Trumps America First policy.\n\nAvisitby NewZimbabwe.com on Thursday revealed that the centre is currently providing only HIV testing services, while other programs, such as family planning and cervical cancer screening assistance, have been suspended.\n\nA notice put upat the entrance of the centre, instructsindividuals seeking services to visit their local clinics.\n\nPlease note that the New Start Centre is temporarily closed. For those due for (Antiretroviral Treatment) ART or PrEP refills, please proceed to the nearest city health clinic for assistance. Thank you for understanding, the notice states.\n\nPrEP is a medication that can help reduce your risk of contracting HIV through sexual contact.\n\nSome officials confirmed that testing services are the only offerings at this time.\n\nThe clinic is only open for those who want to be tested for HIV. We are currently not offering other services, officials at the reception explained.\n\nA similar situation is being reported in Masvingo.\n\nThe centre has typically provided integrated clinical services that included HIV testing, PrEP, TB screening and treatment, cervical cancer screening and treatment, as well as short-term and long-acting reversible contraceptives, and sexually transmitted infection (STI) screening and treatment, among other services.\n\nUpon his inauguration, Trump announced a range of changes to the United States funding model, emphasizing reasonable use of taxpayers money and prioritizing developments within the superpower itself.\n\nThis policy shift has led to millions of US dollars in funding being paused for local civil society organizations (CSOs), impacting billions globally.\n\nGiven that the United States is a significant funder of development in both the health and education sectors of Zimbabwe, there are growing concerns regarding the potential ramifications of these changes.\n\nThe US plays a crucial role in Zimbabwes efforts to combat sexually transmitted diseases and HIV, with PEPFAR providing funding for the majority of condoms and antiretroviral drugs (ARVs) distributed by local hospitals.\n\nCurrently, approximately 1.2 million Zimbabweans benefit from PEPFAR, and over 1,600 public hospitals and clinics have received training and technical support from the US government.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/06134918/WhatsApp-Image-2025-02-06-at-15.47.59.jpeg",
            "description": "<p>By Mary Taruvinga The Population Solutions for Health (PSH) New Start Centre in Harare’s CBD has temporarily halted services for patients on ART and those seeking PrEP refills, NewZimbabwe.com has established. This suspension follows the recent cessation of USAID funding resulting from the implementation of President Donald Trump’s America First policy. A visit by NewZimbabwe.com on Thursday</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/new-start-centre-suspends-art-prep-refills/\">New Start Centre suspends ART, PrEP refills</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "07 Feb 2025"
        },
        {
            "title": "Mafume fingers wife in hostel inspection storm",
            "url": "https://www.newzimbabwe.com/mafume-fingers-wife-in-hostel-inspection-storm/",
            "content": "By Staff Reporter\n\nHarare Mayor Jacob Mafume has pointed the finger at his wife in the growing controversy surrounding a luxury hostel inspection report he is building in Belvedere. Mafume told the retired High Court Judge Justice Maphios Cheda-led Commission of Inquiry today that his wife is overseeing the construction of the hostel intended to accommodate over 60 Harare Institute of Technology (HIT) students.\n\nThe property, allegedly acquired through kickbacks from South African firm Quill Associates (involved in Harare City Councils Enterprise Resource Plan), was reportedly built without adhering to council regulations regarding planning and inspection.\n\nMafume presented the commission with an inspection report showing six visits to the property in a single month, sometimes just three days apart, all seemingly documented with the same pen.\n\nTapiwa Fresh Godzi, leading the commissions evidence, questioned the speed of construction. I wonder at what rate the builders are working. Inspection after inspection every three days. Is that reasonable? he asked.Mafume maintained it was reasonable.\n\nCommission chairperson Justice Cheda inquired about the identity of the inspector. Mafume admitted he had never met the person face to face.\n\nThese people approving this building all have the same signature, correct? Justice Cheda asked. Mafume confirmed this and again, implicated his wife in the inspection furore.\n\nI have not met the inspector personally. They visit the site where there is a contractor. This is being handled by my wife, he stated.\n\nNewZimbabwe.com has learned that the City Council has no record of Mafume paying for any of the six inspections he presented to the commission. Sources say Mafume himself lacks receipts to prove payment.\n\nPayment is required for each inspection stage by city officials. Mafume made no payments and has no proof of payment for any of the inspections, a source stated.\n\nDuring his testimony, Mafume admitted he had not obtained council approval to change the propertys use from residential to commercial. Such changes require approval from the works and town planning committee, but Mafume made no application, and no committee meeting minutes exist approving the renovations.\n\nThe change of use plan does not exist. That one is not there, said a noticeably nervous Mafume.\n\nChange-of-use plans are typically paid for before construction begins.\n\nA typical building plan for the hostel Mafume is building costs around United States Dollars three thousand, which he has not paid to the council, a source said.\n\nThis represents a violation of by-laws that Mafume, as Harares mayor, is expected to uphold.\n\nAnother source claims Mafume used intermediaries to handle the hostel construction and the purchase of a Greendale mansion, avoiding direct involvement.\n\nThis, the source believes, was a strategy to evade scrutiny, but his shady deals have now come back to haunt him.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/05173920/mafume-home.png",
            "description": "<p>By Staff Reporter Harare Mayor Jacob Mafume has pointed the finger at his wife in the growing controversy surrounding a luxury hostel inspection report he is building in Belvedere. Mafume told the retired High Court Judge Justice Maphios Cheda-led Commission of Inquiry today that his wife is overseeing the construction of the hostel intended to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mafume-fingers-wife-in-hostel-inspection-storm/\">Mafume fingers wife in hostel inspection storm</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "07 Feb 2025"
        },
        {
            "title": "Tyla announced as part of the host committee for 2025 Met Gala",
            "url": "https://www.newzimbabwe.com/tyla-announced-as-part-of-the-host-committee-for-2025-met-gala/",
            "content": "IOL\n\nAs the countdown to the2025 Met Galabegins, all eyes are on the fresh faces set to make their mark on the iconic event.\n\nAmong the highly anticipated figures this year is Tyla, the South African singer whose rise to international fame has been marked by an unmatched blend of musical talent and bold style choices.\n\nFor the 2025 Met Gala,Tylas presenceon the Host Committee signals her role in amplifying the theme: Superfine: Tailoring Black Style.\n\nVogue revealed that the exhibition will spotlight the role of fashion in the formation and evolution of Black identities, specifically focusing on the rise and significance of theblack dandy.\n\nThis historic figure, whose fashion choices have long been a blend of self-expression and cultural defiance, will be front and center in an exploration of how Black men have reshaped traditional tailoring norms while influencing global style trends.\n\nTylas inclusion on the Host Committee for the event is no coincidence. The singer has become a symbol of how music and fashion intersect in the 21st century.\n\nWith her infectious tracks and dynamic visuals, Tyla has embraced a style that mixes bold streetwear with refined, tailored elements perfectly aligned with the Galas exploration of tailorings role in Black culture. For Tyla, the 2025 Met Gala is not just an event, its an opportunity to push boundaries and represent Black culture through fashion.\n\nThe dress code for the 2025 Met Gala,Tailored For You,invites attendees to interpret the theme with creative freedom, but with an emphasis on structure, fit, and the unique ways that black identity has been shaped by clothing.\n\nTylas influence on fashion and music is proof to how these worlds can converge, showcasing how modern Black style draws inspiration from the past while embracing the future.\n\nHer eclectic approach to fashion, blending bold colours, intricate tailoring, and African cultural elements, places her at the intersection of the events theme: the celebration of sartorial innovation within the Black community.\n\nTylas presence at the Gala alongside other cultural icons like Andr 3000, Janelle Mone, and Usher emphasises the importance of diverse representation across all fields.\n\nFrom music to sports, the committee is a true reflection of the multifaceted ways black culture influences global trends, especially in the world of fashion.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/06094120/Tyla-at-the-2024-Met-Gala.webp",
            "description": "<p>IOL As the countdown to the 2025 Met Gala begins, all eyes are on the fresh faces set to make their mark on the iconic event. Among the highly anticipated figures this year is Tyla, the South African singer whose rise to international fame has been marked by an unmatched blend of musical talent and bold</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tyla-announced-as-part-of-the-host-committee-for-2025-met-gala/\">Tyla announced as part of the host committee for 2025 Met Gala</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "07 Feb 2025"
        },
        {
            "title": "Teen golfer Tanaka Chatora leads R&A Africa Amateur Championship after dramatic round",
            "url": "https://www.newzimbabwe.com/teen-golfer-tanaka-chatora-leads-ra-africa-amateur-championship-after-dramatic-round/",
            "content": "AfricaSport\n\nTanaka Chatora made an impressive comeback in the opening round of the R&A Africa Amateur Championship, finishing with a seven-under-par 65 to lead the tournament at Leopard Creek. Despite early bogeys on the first and third holes, the 18-year-old from Zimbabwe rallied with five birdies and two eagles to secure the top spot.\n\nHis eagles came on the par-four 10th and the picturesque par-four 15th, a challenging hole with water hazards. Chatora expressed satisfaction with his resilience after the early mistakes, acknowledging the difficulty of the course and his ability to stay focused.\n\nJack Buchanan, who shared a match with Chatora, had a strong round of his own, finishing two shots behind with a five-under-par 67. The South African began with an eagle on the second hole and added two more birdies on the front nine.\n\nAlthough he made some mistakes, including a bogey on the 14th, he remained composed and birdied the final hole. Buchanans round was filled with highlights, including an eagle from 25 feet on the second, and he praised his ability to maintain focus despite his setbacks.\n\nIn the Africa Amateur Womens Invitational, South Africas Lisa Coetzer surged ahead with a two-stroke lead, posting a two-under-par 70. Despite a double-bogey on the 18th, Coetzer displayed remarkable poise throughout the round, especially on the back nine where she made three birdies.\n\nThe 14-year-old, who had three birdies on the front nine as well, managed the challenging conditions well and showed maturity beyond her years. Meanwhile, Bobbi Brown and Gia Raad shared second place, with Brown having made a strong comeback from a triple-bogey on the eighth.\n\nOther standout performances came from Kenyas Michael Karanga, who eagled the 18th to finish at four-under-par, and South African Johndre Ludick, who carded a solid 68. Ludick, who had a recent strong finish at the GolfRSA International Amateur Championship, played bogey-free golf until the final hole.\n\nThe tournament, which offers prestigious exemptions for the winner, including entry to The Open at Royal Portrush, is shaping up to be a competitive event with many rising stars ready to challenge the leaders.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/07041907/tanaka-chatora.webp",
            "description": "<p>AfricaSport Tanaka Chatora made an impressive comeback in the opening round of the R&A Africa Amateur Championship, finishing with a seven-under-par 65 to lead the tournament at Leopard Creek. Despite early bogeys on the first and third holes, the 18-year-old from Zimbabwe rallied with five birdies and two eagles to secure the top spot. His</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/teen-golfer-tanaka-chatora-leads-ra-africa-amateur-championship-after-dramatic-round/\">Teen golfer Tanaka Chatora leads R&A Africa Amateur Championship after dramatic round</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "07 Feb 2025"
        },
        {
            "title": "Pilot dies in Air Force of Zimbabwe jet trainer crash",
            "url": "https://www.newzimbabwe.com/pilot-dies-in-air-force-of-zimbabwe-jet-trainer-crash/",
            "content": "By Staff Reporter\n\nA young trainee pilot Nesbert Tambudza has died after a Karakorum-8 (K-8) jet trainer aircraft crashed in Gweru.\n\nThe accident happened near Guinea Fowl where Tambudza, an Air Lieutenantwas engaged in solo navigation training.\n\nIn a statement, ZDF Commander in Chief, Valerio Sibanda said there were no civilian casualties nor damage to property on the ground.\n\nOn behalf of Officers, men and women of the ZDF, the Commander Zimbabwe Defence Forces wishes to express his heartfelt condolences to the family, relatives, friends and colleagues of our departed Officer, Air Lieutenant Tambudza.\n\nAir Lieutenant Tambudza was a young pilot who had demonstrated immense potential and was therefore selected to undergo a jet flying conversion training course at Number 2 Squadron, Josiah Tungamirai Air Force Base in Gweru. At the time of his death, he was in the final phases of training on the K-8 jet.\n\nThe accident occurred about 5 kilometres East of Guinea Fowl and on impact with the ground the aircraft was extensively damaged, reads the statement.\n\nA Board of Inquiry has been constituted to investigate the cause of the accident.\n\nArrangements for the funeral parade and burial for Air Lieutenant Tambudza will be announced in due course.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/06184352/airforce.jpg",
            "description": "<p>By Staff Reporter A young trainee pilot Nesbert Tambudza has died after a Karakorum-8 (K-8) jet trainer aircraft crashed in Gweru. The accident happened near Guinea Fowl where Tambudza, an Air Lieutenant was engaged in solo navigation training. In a statement, ZDF Commander in Chief, Valerio Sibanda said there were no civilian casualties nor damage to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pilot-dies-in-air-force-of-zimbabwe-jet-trainer-crash/\">Pilot dies in Air Force of Zimbabwe jet trainer crash</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "07 Feb 2025"
        },
        {
            "title": "‘King Munhumutapa’ out on bail a month after arrest for insulting Mnangagwa",
            "url": "https://www.newzimbabwe.com/king-munhumutapa-out-on-bail-a-month-after-arrest-for-insulting-mnangagwa/",
            "content": "By Staff Reporter\n\nTimothy Chiminya, a man claiming to be King Munhumutapa who landed in trouble for insulting President Emmerson Mnangagwa is finally free after he was granted bail by the High Court.\n\nHe was arrested over a month ago, charged with undermining the authority of the president after he claimed to have been appointed as King Munhumutapa by a spirit medium which also gave him authority to appoint chiefs in Zimbabwe.\n\nIt is alleged that in February2024, Chiminya went to Chief Sekes homestead where he met Stanley Chimanike who was legally appointed as Chief Seke and told him that he had dethroned him and replaced himwithMasimba Rubatika.\n\nThe court heard that on 11 June 2024, Chimanike made a report of his dethronement by the accused to the Ministry of Local Government.\n\nThereafter, on dates unknown to the prosecutor but during the period from 11 June 2024 to 31 October 2024, the accused further appointed three more chiefs in Chirumhanzu and Zaka areas.\n\nHe appointed Julius Chimbi as Chief Chigegwe and Hama Piki in Chirumanzu. The accused also appointed Chief Nyakunhuwa in Zaka, Masvingo.\n\nAll the accuseds appointments were contrary to the Constitution of Zimbabwe and the Traditional Leaders Act and ridicule to the office of the President who has the executive powers to appoint Chiefs in Zimbabwe.\n\nHe proceeded to create parallel structures contrary to the ones set up by the President as per the Constitution of the Republic of Zimbabwe,  the State alleges further.\n\nThe State alleges that Chiminya undermined the authority of the president by causing ridicule as hepurportedto appoint chiefs he was performing a function that is the preserve of the president.\n\nHarare Magistrate Isheanesu Matova had dismissed his bail application ruling thathe is a security threat and did not deserve to be released from prison as he had dethroned some traditional leaders, who were installed by President Mnangagwa and that some subjects of the Chiefs, who were removed, were bound tofight the Chiefs, whom he had installed.\n\nAfter being denied bail, he mounted an appeal through his lawyerGift Mtisi of Zimbabwe Lawyers for Human Rights.\n\nThe appeal was upheld by High Court judge Justice Faith Mushure whoordered him to pay US$200 or its ZiG equivalent as bail surety.\n\nMushure also restricted him to a 25-kilometre travel radius from Harare Central Police Station until his matter is finalised.\n\nThe Judge also ordered Chiminya to report twice every week on Mondays and Fridays at Harare Central Police Station until his matter is finalised including surrendering his passport to the Clerk of Court at Harare Magistrates Court.\n\nThe traditional healer was also ordered not to interfere with state witnesses or investigations and to continue residing at his given residential address until his matter gets finalised.\n\nChiminya returns to court on 5 March 2025.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/19060748/Timothy-Chiminya-King-Munhumutapa-e1734588504687.jpg",
            "description": "<p>By Staff Reporter Timothy Chiminya, a man claiming to be King Munhumutapa who landed in trouble for insulting President Emmerson Mnangagwa is finally free after he was granted bail by the High Court. He was arrested over a month ago, charged with undermining the authority of the president after he claimed to have been appointed</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/king-munhumutapa-out-on-bail-a-month-after-arrest-for-insulting-mnangagwa/\">‘King Munhumutapa’ out on bail a month after arrest for insulting Mnangagwa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "07 Feb 2025"
        }
    ]
}