{
    "news": [
        {
            "title": "Munetsi on target as Wolves beat Everton in Carabao Cup",
            "url": "https://www.newzimbabwe.com/munetsi-on-target-as-wolves-beat-everton-in-carabao-cup/",
            "content": "By Sports Reporter\n\nWarriors vice-captain Marshall Munetsi was on target for Wolverhampton Wanderers in their 2-0 Carabao Cup victory over Everton on Tuesday night.\n\nMunetsi broke the deadlock in the 28th minute, pouncing on a rebound to hand Wolves a 1-0 halftime lead. His effort was later complemented by Tolu Akodares 87th-minute strike, which sealed the win.\n\nThe goal was Munetsis first of the season and his third since joining Wolves in January. The midfielder has become a key figure at Molineux, particularly following the departure of last seasons star man, Matheus Cunha, to Manchester United.\n\nDespite the cup success, Wolves have endured one of their worst starts in Premier League history, losing all five of their opening league matches. They now turn their attention to a tough weekend fixture away to Tottenham in London.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/24044639/marshall-munetsi-celebrates-carabao-cup-goal-for-wolves-e1758659846671-1.jpg",
            "description": "<p>By Sports Reporter Warriors vice-captain Marshall Munetsi was on target for Wolverhampton Wanderers in their 2-0 Carabao Cup victory over Everton on Tuesday night. Munetsi broke the deadlock in the 28th minute, pouncing on a rebound to hand Wolves a 1-0 halftime lead. His effort was later complemented by Tolu Akodare’s 87th-minute strike, which sealed</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/munetsi-on-target-as-wolves-beat-everton-in-carabao-cup/\">Munetsi on target as Wolves beat Everton in Carabao Cup</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:00",
            "date": "24 Sep 2025"
        },
        {
            "title": "Dairibord milk intake surpasses 20 million litres",
            "url": "https://www.newzimbabwe.com/dairibord-milk-intake-surpasses-20-million-litres/",
            "content": "By Alois Vinga\n\nListed food and dairy products manufacturer Dairibord Zimbabwe Limited (DZL) has surpassed the 20-million-litre mark in milk intake, driven by aggressive management strategies that continue to defy industry challenges.\n\nPresenting the companys half-year performance, DZL board chairman Norbert Chiromo said milk intake grew by 3.7%, rising from 19.6 million litres to 20.3 million litres, which accounts for 38% of national production.\n\nThe milk supply development unit continues to recruit new producers, including small and medium-scale farmers, to meet growing demand. The group achieved an 18% growth in overall sales volume, with food sales up 18%, driven by strong yoghurt and tomato sauce sales, Chiromo said.\n\nNational raw milk production also increased by 3.9% year-on-year, from 55.1 million litres to 57.3 million litres.\n\nDZLs beverages segment surged by 28%, buoyed by exceptional performances from Pfuko and Cascade, alongside a recovery in tea due to improved availability. Liquid milk volumes posted modest growth of 1%.\n\nAs of 30 June 2025, DZL reported total assets of US$53.84 million, compared to US$53.49 million in December 2024, while total liabilities stood at US$27.67 million, down from US$28.54 million in the previous period.\n\nEquity attributable to ordinary shareholders rose to US$26.16 million, up from US$24.95 million.\n\nRevenue for the period reached US$64.32 million, an 18% increase compared to the same period in 2024. Profit before tax jumped 51% year-on-year to US$2.08 million, boosted by lower finance costs. Basic and diluted earnings per share stood at US$0.34 cents.\n\nRetained earnings climbed to US$16.28 million, from US$15.07 million as of December 2024, largely driven by profit growth. No dividend was declared for the period.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/12/22172046/Dairibord.jpg",
            "description": "<p>By Alois Vinga Listed food and dairy products manufacturer Dairibord Zimbabwe Limited (DZL) has surpassed the 20-million-litre mark in milk intake, driven by aggressive management strategies that continue to defy industry challenges. Presenting the company’s half-year performance, DZL board chairman Norbert Chiromo said milk intake grew by 3.7%, rising from 19.6 million litres to 20.3</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dairibord-milk-intake-surpasses-20-million-litres/\">Dairibord milk intake surpasses 20 million litres</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:00",
            "date": "24 Sep 2025"
        },
        {
            "title": "High Court joins developer Arosume to upmarket Carrick Creagh land dispute",
            "url": "https://www.newzimbabwe.com/high-court-joins-developer-arosume-to-upmarket-carrick-creagh-land-dispute/",
            "content": "By Mary Taruvinga\n\nThe High Court has ordered Arosume Property Development (Pvt) Ltd to be joined in a bitter property dispute involving businesswoman Farai Olivia Mashonganyika and the Minister of Local Government, ruling that the developer has a direct and substantial interest in the contested Carrick Creagh land.\n\nDelivering judgment on September 5, 2025, Justice Siyabona Musithu said, The applicant not only has a substantial interest in the issues raised in HCH 884/24 concerning the property, but the applicants rights in the said property will be affected by any judgment that may be rendered without its involvement.\n\nHe said that excluding Arosume from the ongoing litigation would risk an incomplete determination of the matter.\n\nRule 32(12) bestows upon the court the discretion to order any person whose presence before the court is necessary to ensure that all issues in dispute may be effectually and completely determined, he said.\n\nThe case centres on stand 91 Kidron Valley Road, Carrick Creagh Estate, Borrowdale, transferred to Mashonganyika under Deed of Transfer 5690/2011. In 2022, the Ministry of Local Government moved to cancel her title deed, accusing her of failing to pay over US$520,195 in development costs and claiming she was not a member of the Sally Mugabe Housing Cooperative, which was part of the project.\n\nArosume, the developer in a Public-Private Partnership (PPP) with the State and the cooperative, argued it was deliberately excluded when Mashonganyika filed a review application challenging the ministrys cancellation order. The firm alleged that the deed was fraudulently obtained and that it had already filed an urgent application to block Mashonganyika from building on the land.\n\nMashonganyika, however, insists she bought the property legitimately in 2011, paying US$4,000 directly to the ministry after previously being misled by Arosume to part with US$10,000. She maintains the government acted unlawfully by cancelling her deed without a court order.\n\nA deed of transfer confers real rights of ownership which cannot be terminated without a court order, she argued in her opposing affidavit.\n\nShe further accused the ministry of acting at Arosumes behest, alleging connivance between the developer and government to wrestle away her property.\n\nJustice Musithu dismissed her objections, finding that Arosumes interest arose from the tripartite PPP agreement governing Carrick Creagh. He noted that Mashonganyika herself had acknowledged the existence of a dispute with the developer in earlier court filings.\n\nThe dispute is much broader than the mere administrative process that the first respondent claims she wants regularised, the judge said. Any judgment affecting the property will also impact the developers rights under the tripartite arrangement.\n\nThe court granted Arosumes joinder, directing the company to file its opposing papers in the main matter (HCH 884/24) within five days. The question of costs was deferred to that case.\n\nThe ruling paves the way for a full trial in which the High Court will weigh competing claims of fraud, non-payment, and unlawful cancellation in one of Harares most high-profile land battles.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/23072643/carrick-creagh.jpg",
            "description": "<p>By Mary Taruvinga The High Court has ordered Arosume Property Development (Pvt) Ltd to be joined in a bitter property dispute involving businesswoman Farai Olivia Mashonganyika and the Minister of Local Government, ruling that the developer has a “direct and substantial interest” in the contested Carrick Creagh land. Delivering judgment on September 5, 2025, Justice</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-joins-developer-arosume-to-upmarket-carrick-creagh-land-dispute/\">High Court joins developer Arosume to upmarket Carrick Creagh land dispute</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:00",
            "date": "24 Sep 2025"
        },
        {
            "title": "Mnangagwa demotes Mpofu in ZANU PF politburo reshuffle",
            "url": "https://www.newzimbabwe.com/mnangagwa-demotes-mpofu-in-zanu-pf-politburo-reshuffle/",
            "content": "By Staff Reporter\n\nPresident Emmerson Mnangagwa has reshuffled ZANU PFs politburo, with Secretary General Obert Mpofu emerging as the biggest casualty after being reassigned to the less influential post of Secretary for Information Communication Technology (ICT).\n\nThe shake-up comes amid growing instability and factional fights in the ruling party ahead of its National Peoples Conference scheduled for next month in Mutare.\n\nMpofu has been replaced by Jacob Mudenda as Secretary General, while Patrick Chinamasa takes over Mudendas previous portfolio. Justice Minister Ziyambi Ziyambi has been deployed as Secretary for Legal Affairs.\n\nAnnouncing the changes, party spokesperson Christopher Mutsvangwa said the redeployments were effective immediately.\n\nThis reorganisation underscores the Partys enduring commitment to the policies, tenets and ethos of ZANU PF and the Permanent Zimbabwe Revolution in service to the people and the nation of Zimbabwe, said Mutsvangwa.\n\nThe politburo, one of ZANU PFs most powerful organs, has recently been under the spotlight following a dossier allegedly linked to Vice President Constantino Chiwenga, which accused some officials of corruption. Mutsvangwa has since downplayed its credibility.\n\nFactionalism continues to plague the party, with some members advocating for Mnangagwa to extend his stay beyond the constitutionally mandated two terms, while others support Chiwenga as his successor.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/08/02042119/Obert-Mpofu.jpg",
            "description": "<p>By Staff Reporter President Emmerson Mnangagwa has reshuffled ZANU PF’s politburo, with Secretary General Obert Mpofu emerging as the biggest casualty after being reassigned to the less influential post of Secretary for Information Communication Technology (ICT). The shake-up comes amid growing instability and factional fights in the ruling party ahead of its National People’s Conference</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-demotes-mpofu-in-zanu-pf-politburo-reshuffle/\">Mnangagwa demotes Mpofu in ZANU PF politburo reshuffle</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:00",
            "date": "24 Sep 2025"
        },
        {
            "title": "Mutsvangwa tells VP Chiwenga to halt succession push",
            "url": "https://www.newzimbabwe.com/mutsvangwa-tells-vp-chiwenga-to-halt-succession-push/",
            "content": "By Staff Reporter\n\nZANU PF spokesperson Christopher Mutsvangwa has effectively told Vice President Constantino Chiwenga to put aside his presidential ambitions, as factional battles intensify in the ruling party ahead of next months National Peoples Conference in Mutare.\n\nThe party has been rocked by sharp divisions over President Emmerson Mnangagwas succession, with several provinces pushing for him to remain in power beyond his constitutionally mandated two terms, which end in 2028.\n\nAddressing journalists at ZANU PF headquarters on Monday, Mutsvangwa warned the faction rallying behind Chiwenga to shelve its ambitions until the partys elective congress in 2027.\n\nIt is a democratic party. There is palpable prosperity being delivered to Zimbabwe and the membership of ZANU PF is happy with that man. They have not seen anything to blemish him. They say if it aint broke, do not fix it. Lets wait for the date. That debate should not be for all of ZANU PF. Yes, there are some people who cannot wait to rule, said Mutsvangwa.\n\nZanu PF spokesperson Christopher Mutsvangwa\n\nChiwenga is widely tipped to succeed Mnangagwa, although loyalists of the incumbent are reportedly plotting to amend the constitution to extend his tenure.\n\nTensions escalated recently after Chiwenga allegedly tabled a dossier in the politburo, exposing corrupt dealings by a clique of businessmen closely linked to the ruling party.\n\nWithout naming Chiwenga directly, Mutsvangwa confirmed the politburo dismissed the dossier outright.\n\nThere are some people who are urging on one of the people in the presidium to be in a confrontational mood with the whole politburo. It is not good for that member. I am not talking to him, I am talking about people who are urging him on.\n\nTo survive a war is a matter of lucky and once you survive and you begin to see virtue in yourself then you are not respecting those who you left behind. We never fought the war as generals. We fought as commanders. There were no Generals in the war.\n\nThe president said there was this dossier which came from somewhere and the politburo said we do not deal with dossiers which do not come from proper institutions, said Mutsvangwa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/13054207/Chiwenga-Mnangagwa.png",
            "description": "<p>By Staff Reporter ZANU PF spokesperson Christopher Mutsvangwa has effectively told Vice President Constantino Chiwenga to put aside his presidential ambitions, as factional battles intensify in the ruling party ahead of next month’s National People’s Conference in Mutare. The party has been rocked by sharp divisions over President Emmerson Mnangagwa’s succession, with several provinces pushing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mutsvangwa-tells-vp-chiwenga-to-halt-succession-push/\">Mutsvangwa tells VP Chiwenga to halt succession push</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:00",
            "date": "24 Sep 2025"
        },
        {
            "title": "Prison officer in court for freeing armed robber serving 62-year jail term",
            "url": "https://www.newzimbabwe.com/prison-officer-in-court-for-freeing-armed-robber-serving-62-year-jail-term/",
            "content": "By Staff Reporter\n\nA SENIOR officer with the Zimbabwe Prisons and Correctional Service (ZPCS) was recently arrested and appeared in court for illegally releasing an incarcerated armed robber.\n\nChamunorwa Matshalaga (52), a Principal Correctional Officer formerly stationed at Khami Maximum Security Prison, released Charles Nyandoro, an inmate serving 62 years for six counts of armed robbery.\n\nThe top ZPCS official appeared at Bulawayo Regional Court this week, facing criminal abuse of duty as a public officer after he facilitated the unlawful release of the convict.\n\nMatshalaga was denied bail and the matter was remanded to October 3, 2025, for routine remand.\n\nThe State case is that sometime in April 2024, Matshalaga and unnamed accomplices manipulated the Proposed General Amnesty 2024 list by fraudulently including Nyandoro, who was ineligible under Clemency Order No. 1, which excluded violent offenders.\n\nIt was averred that on April 19, 2024, Nyandoro was unlawfully released under the guise of old age clemency. A warrant of committal signed by Matshalaga and prison records linking him to the release were recovered.\n\nAccused person was subsequently arrested on September 16, 2025, in Bulawayo.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/24045552/khami.jpg",
            "description": "<p>By Staff Reporter A SENIOR officer with the Zimbabwe Prisons and Correctional Service (ZPCS) was recently arrested and appeared in court for illegally releasing an incarcerated armed robber. Chamunorwa Matshalaga (52), a Principal Correctional Officer formerly stationed at Khami Maximum Security Prison, released Charles Nyandoro, an inmate serving 62 years for six counts of armed</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/prison-officer-in-court-for-freeing-armed-robber-serving-62-year-jail-term/\">Prison officer in court for freeing armed robber serving 62-year jail term </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:00",
            "date": "24 Sep 2025"
        },
        {
            "title": "SRC appoints new ZRU interim committee",
            "url": "https://www.newzimbabwe.com/src-appoints-new-zru-interim-committee/",
            "content": "By Sports Reporter\n\nThe Sports and Recreation Commission (SRC)has appointed an interim committee led by Paddy Zhanda Jnr to lead the Zimbabwe Rugby Union (ZRU) following the suspension of the entire executive.\n\nThe newly appointed committee, chaired by Zhanda Jnr, will focus on national asset management, with Latifah Kassim as Vice Chair, bringing commercial expertise and overseeing the Nedbank sponsorship.\n\nThe team also includes Gareth Cram, who will be responsible for financial oversight, Wellington Magaya, a legal advisor, and former Sables coachGodwin Murambiwa.\n\nThe interim committee has been tasked with restoring financial accountability within the ZRU, ensuring uninterrupted participation in domestic and international competitions, and overseeing preparations for the 2027 Rugby World Cup through a High-Performance Strategy.\n\nIt will also initiate a constitutional review, safeguard the welfare and dignity of all athletes, including the Lady Sables, and liaise directly with World Rugby and Rugby Africa to unlock technical and financial support.\n\nThis development follows the mass resignation of eight executive memberslast week, which came in the wake of the earlier suspension of ZRU president Losson Mtongwizain May over allegations of poor administration.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/06/21160700/Rugby-ball.jpeg",
            "description": "<p>By Sports Reporter The Sports and Recreation Commission (SRC) has appointed an interim committee led by Paddy Zhanda Jnr to lead the Zimbabwe Rugby Union (ZRU) following the suspension of the entire executive. The newly appointed committee, chaired by Zhanda Jnr, will focus on national asset management, with Latifah Kassim as Vice Chair, bringing commercial expertise</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/src-appoints-new-zru-interim-committee/\">SRC appoints new ZRU interim committee</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:00",
            "date": "24 Sep 2025"
        },
        {
            "title": "Gold panner jailed 20 years for brutal murder over a monkey",
            "url": "https://www.newzimbabwe.com/gold-panner-jailed-20-years-for-brutal-murder-over-a-monkey/",
            "content": "By Mary Taruvinga\n\nA 21-year-old gold panner has been sentenced to 20 years in prison after the High Court found him guilty of fatally stabbing a colleague during a drunken quarrel over what to do with a monkey they had failed to sell.\n\nJustice Kabasa, sitting with two assessors, ruled that Mlindeli Siziba used a knife to stab the victim multiple times in the back, puncturing his lungs, after the deceased suggested they give the monkey away. His co-accused, Mthulisi Moyo, was acquitted for lack of evidence.\n\nAll the deceased had done was ask that you give away a monkey. He died because of such a flimsy reason, Justice Kabasa said in her ruling. Why would one use a lethal weapon to stab a human being several times and aim at vital organs if the intention is not to kill?\n\nThe court dismissed Sizibas claim of self-defence, pointing out that the victim was fleeing when attacked.\n\nA person fleeing is no danger to anyone. The ones pursuing are the danger to the one fleeing. What self-defence is that when the victim is attacked from the back?\n\nThe judge condemned the growing use of knives in violent disputes among artisanal miners.\n\nThe use of knives is becoming worrisome and gold panners appear to take knives as the weapon of choice. People ought to respect the sanctity of life. Life is a gift which ought not to be taken away at the hands of another.\n\nSiziba, who left the victim to bleed to death by a riverbank and lied that he was alright, showed no remorse, the court said.\n\nHanding down sentence, Justice Kabasa stressed that deterrence was necessary.\n\nAt 21 you are not so young to deserve a reduction of an otherwise appropriate sentence. There was nothing youthful in your conduct. The presumptive penalty is 20 years. We find no reason to depart from that.\n\nSiziba was jailed for 20 years, while Moyo walked free after being given the benefit of the doubt.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/29073017/Monkey.jpg",
            "description": "<p>By Mary Taruvinga A 21-year-old gold panner has been sentenced to 20 years in prison after the High Court found him guilty of fatally stabbing a colleague during a drunken quarrel over what to do with a monkey they had failed to sell. Justice Kabasa, sitting with two assessors, ruled that Mlindeli Siziba used a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/gold-panner-jailed-20-years-for-brutal-murder-over-a-monkey/\">Gold panner jailed 20 years for brutal murder over a monkey</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:00",
            "date": "24 Sep 2025"
        },
        {
            "title": "Trump to address UN General Assembly after France recognises Palestinian state",
            "url": "https://www.newzimbabwe.com/trump-to-address-un-general-assembly-after-france-recognises-palestinian-state/",
            "content": "BBC\n\nFrance has formally recognised a Palestinian state, becoming the latest in a wave of countries to take the step.\n\nSpeaking at the UN in New York, President Emmanuel Macron said the time for peace has come and that nothing justifies the ongoing war in Gaza.\n\nUS President Donald Trump is due to address the UN General Assembly on Tuesday, as will the leaders of key regional players such as Jordan and Qatar.\n\nOn Monday, the US did not attend a one-day summit hosted by France and Saudi Arabia which focused on plans for a two-state solution to the conflict. Fellow G7 states Germany and Italy were also absent.\n\nBelgium, Luxembourg, Malta, Andorra and San Marino are also due to recognise a Palestinian state, after the UK, Canada, Australia and Portugal announced recognition on Sunday.\n\nInternational pressure is ramping up on Israel over the unfolding humanitarian crisis in Gaza and settlement building in the West Bank.\n\nIsrael has said recognition would reward Hamas for the Palestinian armed groups 7 October 2023 attack on southern Israel in which about 1,200 people were killed and 251 taken hostage.\n\nMore than 65,000 Palestinians have been killed by Israel since, according to Gazas Hamas-run health ministry. Israeli forces are currently carrying out a ground offensive aimed at taking control of Gaza City, where a million people were living and a famine was confirmed last month.\n\nThe French leader told the conference that the time had come to stop the war and free the remaining Israeli hostages held by Hamas. He warned against the peril of endless wars and said right must always prevail over might.\n\nThe international community had failed to build a just and lasting peace in the Middle East, he said, adding that we must do everything in our power to preserve the possibility of a two-state solution that would see Israel and Palestine side by side in peace and security.\n\nSaudi Arabias Foreign Minister Faisal bin Farhan Al Saud also addressed the UN, on behalf of Crown Prince Mohammed bin Salman.\n\nHe reiterated that a two-state solution was the only way to achieve lasting peace in the region.\n\nEuropean Commission President Ursula von der Leyen said the EU would set up a new financial instrument to work on Gazas reconstruction.\n\nWe must all do more, she told the UN General Assembly. This is why we will set up a Palestine Donor Group.\n\nUN secretary general Antonio Guterres referred to the situation in Gaza as morally, legally and politically intolerable and said a two-state solution was the only credible path for peace between Israelis and Palestinians.\n\nPalestinian President Mahmoud Abbas  who was blocked from attending the UN General Assembly in person after the US revoked his and other Palestinian officials visas  addressed the conference via videolink.\n\nHe called for a permanent ceasefire and said Hamas could have no role in governing Gaza, calling for the group to surrender their weapons to the Palestinian Authority (PA).\n\nWhat we want is one unified state without weapons, he said.\n\nAbbas also condemned Hamass 7 October 2023 attack on southern Israel and addressed Israelis, saying: Our future and yours depends on peace. Enough violence and war.\n\nReuters Israel has been bombarding Gaza City as its forces push deeper into the city\n\nMacron said France was ready to contribute to a stabilisation mission in Gaza and called for a transitional administration involving the PA that would oversee the dismantling of Hamas.\n\nHe said France would only open an embassy to a Palestinian state when all the hostages being held by Hamas are released and a ceasefire had been agreed.\n\nIsraels ambassador to the UN, Danny Dannon, spoke to reporters shortly before Macrons announcement.\n\nDannon said a two-state solution was taken off the table after the 7 October attack and called this weeks talks at the UN a charade. He also refused to rule out Israel annexing the occupied West Bank.\n\nPrime Minister Benjamin Netanyahu has insisted there will be no Palestinian state to the west of the River Jordan, and President Isaac Herzog said recognising one would only embolden the forces of darkness.\n\nAhead of Macrons announcement, the Palestinian and Israeli flags were displayed on the Eiffel Tower on Sunday night. A number of town halls in France also flew Palestinian flags on Monday, despite a government order to local prefects to maintain neutrality.\n\nPro-Palestinian protests also took place in some80 towns and cities across Italy, where Giorgia Melonis government said recently it could be counter-productive to recognise a state that did not exist.\n\nIn Germany, the government has said Palestinian statehood is not currently up for debate, and Foreign Minister Johann Wadephul explained as he left for New York on Monday that, For Germany, recognition of a Palestinian state comes more at the end of the process. But this process must begin now.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/05/09203359/Donald-Trump.png",
            "description": "<p>BBC France has formally recognised a Palestinian state, becoming the latest in a wave of countries to take the step. Speaking at the UN in New York, President Emmanuel Macron said “the time for peace has come” and that “nothing justifies the ongoing war in Gaza”. US President Donald Trump is due to address the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/trump-to-address-un-general-assembly-after-france-recognises-palestinian-state/\">Trump to address UN General Assembly after France recognises Palestinian state</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:00",
            "date": "24 Sep 2025"
        },
        {
            "title": "Jimmy Kimmel show to return after suspension over Charlie Kirk comments",
            "url": "https://www.newzimbabwe.com/jimmy-kimmel-show-to-return-after-suspension-over-charlie-kirk-comments/",
            "content": "BBC\n\nUS comedian Jimmy Kimmel will return to his late-night talk show on Tuesday after he was suspended for making jokes relating to the death of conservative influencer Charlie Kirk.\n\nDisney, which owns the US broadcast network that airs Jimmy Kimmel Live, said on Monday that it suspended the show because it felt some of the comments were ill-timed and thus insensitive.\n\nWe have spent the last days having thoughtful conversations with Jimmy, and after those conversations, we reached the decision to return the show on Tuesday, Disney said.\n\nThe comics abrupt suspension came after threats by the federal tv regulator to revoke ABCs broadcast licence, sparking nationwide debates over free speech.\n\nUS President Donald Trump had welcomed Kimmels suspension and suggested that some TV networks should havetheir licences taken awayfor negative coverage of the president.\n\nTrump did not address Kimmels reinstatement when a reporter asked about it during a White House event on Monday.\n\nSinclair, the largest ABC affiliate group in the US, said on Monday it will replace Jimmy Kimmel Live! with news programming across its ABC affiliate stations from Tuesday.\n\nDiscussions with ABC are ongoing as we evaluate the shows potential return, it added.\n\nSinclair previously called Kimmels remarks inappropriate and deeply insensitive at a critical moment for our country and said it would not lift the suspension before having formal discussions with ABC.\n\nNexstar Media, one of the biggest owners of TV stations in the US, also said last week it would not air Kimmels show for the foreseeable future. It has not yet commented on Kimmels reinstatement.\n\nCritics and First Amendment advocates railed against ABCs decision last week as censorship and a violation of free speech.\n\nKimmel, who has hosted the late-night programme since 2003 and hosted four Oscars ceremonies, has not yet publicly addressed the suspension or the fallout.\n\nThe row started after Kimmel said in his monologue on 15 September that the Maga gang were desperately trying to characterise this kid who murdered Charlie Kirk as anything other than one of them and trying to score political points from it.\n\nHe also made fun of Trumps reaction to the influencers murder, showing a clip of the president responding to a question about how he was mourning the death by changing the subject to construction of a new White House ballroom.\n\nKimmel compared the response to how a four-year-old mourns a goldfish.\n\nBrendan Carr, the Trump-appointed chair of broadcast regulator theFederal Communications Commission (FCC), threatened to act against ABC and its parent company Disney over Kimmels remarks.\n\nThe spat comes as Vice President JD Vance and other White House allies have been pushing a national campaign to punish anyone who has criticised Kirk in the wake of his death.\n\nHours after Mr Carr made his initial remarks about Kimmels monologue, Nexstar said it would not air Kimmels show for the foreseeable future.\n\nSinclair followed suit and ABC announced that it would indefinitely suspend the programme and demanded an apology from Kimmel, as well as a donation to Kirks non-profit organization Turning Point USA.\n\nMr Carr thanked Nexstar for doing the right thing and said he hoped other broadcasters would follow its lead. Nexstar is currently seeking FCC approval for its planned $6.2bn (4.5bn) merger with Tegna.\n\nAnna Gomez, the sole Democrat on the FCC, said on Monday that she was glad to see Disney find its courage in the face of clear government intimidation.\n\nMs Gomez also thanked Americans across the ideological spectrum who protested this blatant attempt to silence free speech and vowed to combat these efforts to stifle free expression.\n\nABCs decisionto suspend Kimmelwas met with protests in California and lambasted by the writers and actors guilds, lawmakers and the American Civil Liberties Union (ACLU) alike, who argued that the suspension violates free speech rights and spurs a chilling effect.\n\nKimmels late-night colleagues, including Jon Stewart, John Oliver and outgoing CBS host Stephen Colbert, rallied behind him and hundreds of celebrities and Hollywood creativessigned on to a letterbacking Kimmel.\n\nBen Stiller, Jennifer Aniston, Meryl Streep and Robert DeNiro are among those who called Kimmels suspension a dark moment for freedom of speech in our nation.\n\nCritics have also called for the cancellation of Disney+, Hulu and other Disney-owned subscription services to cut into the entertainment conglomerates bottom line over it decision to suspend Kimmel.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/23065414/kimmel.webp",
            "description": "<p>BBC US comedian Jimmy Kimmel will return to his late-night talk show on Tuesday after he was suspended for making jokes relating to the death of conservative influencer Charlie Kirk. Disney, which owns the US broadcast network that airs Jimmy Kimmel Live, said on Monday that it suspended the show because it “felt some of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/jimmy-kimmel-show-to-return-after-suspension-over-charlie-kirk-comments/\">Jimmy Kimmel show to return after suspension over Charlie Kirk comments</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:00",
            "date": "24 Sep 2025"
        }
    ]
}