{
    "news": [
        {
            "title": "Former Agriculture deputy minister claims Zanu PF rivals are targeting him for successive election defeats",
            "url": "https://www.newzimbabwe.com/former-agriculture-deputy-minister-claims-zanu-pf-rivals-are-targeting-him-for-successive-election-defeats/",
            "content": "By Staff Reporter\n\nFORMER Deputy Minister of Agriculture Douglas Karoro has said political rivals Takesure Chikwamba and Charles Mutukudzi are behind allegations that he stole fertiliser from the Grain Marketing Board (GMB) mainly because he has beaten them thrice in the Zanu PF partys primary elections.\n\nKaroro spoke following Mutukudzis appearance as a State witness in a case he is facing charges of diverting agricultural inputs.\n\nHe said Mutukudzi and Chikwamba were bitter that they had failed to unseat him in 2015, 2018 and 2023 when he won the election while on remand as a result of the case.\n\nThe primaries sought a candidate from Mbire constituency to represent Zanu PF in Parliamentary elections.\n\nAt the time the allegations arose, Chikwamba was the partys District Coordinating Committee (DCC) Chairperson while Mutukudzi was his deputy.\n\nMutukudzi told the court that he was informed by a certain Zanu PF leader of suspicious trucks, allegedly linked to Karoro, that were loading fertiliser at GMB Mushumbi depot.\n\nHe said he then proceeded, with the blessing of Chikwamba, to file a report with the police. Chikwamba accompanied him.\n\nMutukudzi admitted that he lost thrice to Karoro in the race to represent Mbire in Parliament but said he was not bitter. He said it was just human nature to want to win.\n\nIt is human nature to want to win every election, said Mutukudzi, to which Karoros lawyer Admire Rubaya further asked if he was happy with the defeat.\n\nRubaya questioned why malpractices at GMB would be reported to him if he was neither a government official nor an interested party.\n\nThe matter continues on Friday before Regional Magistrate Marehwanazvo Gofa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/05/21162813/WhatsApp-Image-2022-05-21-at-5.27.36-PM.jpeg",
            "description": "<p>By Staff Reporter FORMER Deputy Minister of Agriculture Douglas Karoro has said political rivals Takesure Chikwamba and Charles Mutukudzi are behind allegations that he stole fertiliser from the Grain Marketing Board (GMB) mainly because he has beaten them thrice in the Zanu PF party’s primary elections. Karoro spoke following Mutukudzi’s appearance as a State witness</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/former-agriculture-deputy-minister-claims-zanu-pf-rivals-are-targeting-him-for-successive-election-defeats/\">Former Agriculture deputy minister claims Zanu PF rivals are targeting him for successive election defeats </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:36",
            "date": "13 Jun 2025"
        },
        {
            "title": "Teen sentenced to life for killing aunt in cold blood before violating her corpse",
            "url": "https://www.newzimbabwe.com/teen-sentenced-to-life-for-killing-aunt-in-cold-blood-before-violating-her-corpse/",
            "content": "By Mary Taruvinga\n\nHIGH Court judge, Justice Munamato Mutevedzi has expressed concern over some cases judges preside over further noting that crimes that are being committed around Zimbabwe may suggest that the world is coming to an end.\n\nThe judge also said court officials would require psychological support for them to cope with things they hear in court everyday.\n\nMutevedzi said this while handing down sentence against one Tapiwa Mereka (19) at the Gweru High Court.\n\nMereka was found guilty of the gruesome murder of his mothers sister Mary Mereka on January 27, 2023, and also raping her lifeless body.\n\nMutevedzi said Mereka deserved capital sentence adding that he is fortunate that death penalty had been scrapped.\n\nIf it is true that on some day God will destroy the world, then that time is nigh. Some of the crimes that we preside over suggest that Armageddon is imminent.\n\nTapiwa Mereka (the offender) has a head but it is doubtful that he has a brain inside it. If he does, then his mind is so perverted and depraved that he should not be living amongst human beings.\n\nThe crime that he committed is unconscionable and would possibly win an Oscar award for horror movies.\n\nEvery one of us who took part in the trial would be thinking about this for a long time to come.\n\nIt lays bare, the oft-repeated myth that judges are inanimate.\n\nThe reality is that judicial officers and other court officials who work in the criminal courts and hear these horrific stories almost on a daily basis may suffer what is called vicarious trauma.\n\nThey all may end up requiring therapy in one form or another, Mutevedzi said.\n\nThe court heard Mereka had plotted to rape and kill his aunt for a long time.\n\nIn his warned and cautioned statement accused person admitted that he always admired her and wanted to sleep with her.\n\nHe was biding his time and waiting for an opportune moment to strike.\n\nHe said the idea became maddening some three days before the murder andcould not shake off the desire and lust to have sexual intercourse with his aunt.\n\nHe convinced himself to carry out the satanic idea on the fateful morning.\n\nI do admit to the allegations levelled against me. The deceased was my aunt but I had quite some time admiring her and I wished that I have some time to rape her.\n\nI also had the intention to kill her. I had no valid reason but I just felt that I have to kill her.\n\nSo, when I was with her in the field weeding together with her I then got the chance and took an axe which was in the field and struck her three times on the head whilst she was not expecting it.\n\nAfter striking her she fell down. I removed her pant and had sexual intercourse with her.\n\nAfter I finished I dressed her and took the axe and threw it outside the field and went to Sebakwe River with the intention to stay there, Mereka admitted.\n\nThe teenager said at the time the time of the sex, the deceased was still alive although in a vegetative state.\n\nMutevedzi said even imagining that his victim was dead by the time he committed the abomination, his actions would have amounted to the crime of violating a dead body in contravention of section 111 of the Criminal Law (Codification and Reform) Act.\n\nHe said in other jurisdictions, it would have been the crime of necrophilia, which criminalises any sexual attraction to a dead person.\n\nThe judge said this aggravates Merekas situation.\n\nHaving found that the murder is aggravated there cannot be escaping the severest punishment.\n\nBefore the abolition of the penalty of death from our statute books this was a case that would have undoubtedly attracted capital punishment.\n\nNeedless to state, that option is no longer available. The only two choices which the court has are sentencing the offender either to life imprisonment or to a determinate term of not less than 20 years.\n\nWhat is worse is that he said he was prepared to kill for no reason. He is, therefore, a dangerous individual whom the court cannot risk letting back into society.\n\nHe may kill again for nothing else other than his enjoyment.\n\nHe appears worse than a robber who kills for financial gain because it is possible to resist that more than a desire that one cannot explain.\n\nIt is like the offender gets possessed by some irresistible spirit.Given the above, our hands are, therefore, tied. It is difficult to empathise with the offender.\n\nIf he could be so sadistic as to easily kill his own mother and still find sexual gratification from her in that state of helplessness, we shudder to think what he could possibly do to a stranger or to children.\n\nHe is someone whose soul must be left to God to correct. As a court, we can do no more than administer justice.\n\nWe will permanently remove him from society and confine him to the secure walls of a prison.\n\nAccordingly, the offender is sentenced to life imprisonment, the judge ruled.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/04/07040958/Crime-and-Murder.jpg",
            "description": "<p>By Mary Taruvinga HIGH Court judge, Justice Munamato Mutevedzi has expressed concern over some cases judges preside over further noting that crimes that are being committed around Zimbabwe may suggest that the world is coming to an end. The judge also said court officials would require psychological support for them to cope with things they</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/teen-sentenced-to-life-for-killing-aunt-in-cold-blood-before-violating-her-corpse/\">Teen sentenced to life for killing aunt in cold blood before violating her corpse</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:36",
            "date": "13 Jun 2025"
        },
        {
            "title": "Harare councillors fight undervaluing land compensated to Chiyangwa’s Pinnacle Holdings",
            "url": "https://www.newzimbabwe.com/harare-councillors-fight-undervaluing-land-compensated-to-chiyangwas-pinnacle-holdings/",
            "content": "By Darlington Gatsi\n\nHARARE City Council risks losing thousands of dollars in land value if the municipality complies with the government directive to compensate Pinnacle Holdings with tracts of stands.\n\nThe Minister of Local Government and Public Works, Daniel Garwe, recently wrote a directive to Harare Mayor Jacob Mafume instructing the City Council to allocate land to Pinnacle Holdings as compensation for property acquired by the government.\n\nPinnacle Holdings is owned by businessman Philip Chiyangwa, who is also a ZANU PF member.\n\nThe directive sparked a heated debate in a recent Council meeting, with Ward 16 Denford Ngadziore expressing concern that the council might part with the land at a value lower than its actual price.\n\nThe report is saying US$5 per square metre. So my argument is, in Malbereign and around Harare, we are selling at US$20 per square metre, whilst on the other side, it is going for US$5 per square metre.\n\nWe cannot transfer land whose value we do not know. We are not transferring tomatoes; this is land we are talking about, said Ngadziore.\n\nThe proposed compensation has angered residents, with associations labelling the move as unconstitutional and tantamount to government interference in the affairs of the local authority.\n\nAs a result, residents are calling for the compensation to Pinnacle Holdings to be halted.\n\nSeveral stands have been earmarked for compensation, subject to the Councils approval. However, anomalies have been raised regarding some of the stands.\n\nAdonia Shoko raised a red flag over stands in Kuwadzana, stating that some individuals already hold offer letters for the land.\n\nKudzai Kadzombe also raised a similar concern regarding land identified as part of the compensation to Pinnacle Holdings.\n\nI have a personal interest because, as Councillor of Ward 41, we have already raised this issue. We have a piece of land in Bluffhill which is on that list, but residents had already submitted a petition and begun mobilising to build a council school, said Kadzombe.\n\nThe HCC Finance Committee is set to deliberate on Garwes directive and conduct due diligence on the anomalies raised in the meeting.\n\nHowever, Mafume bluntly told the Council that those aggrieved should consider mounting a legal challenge.\n\nAnyone who feels aggrieved or has their property rights affected by the letter is advised to make a beeline to their lawyers, said Mafume.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/07224513/town-house.jpg",
            "description": "<p>By Darlington Gatsi HARARE City Council risks losing thousands of dollars in land value if the municipality complies with the government directive to compensate Pinnacle Holdings with tracts of stands. The Minister of Local Government and Public Works, Daniel Garwe, recently wrote a directive to Harare Mayor Jacob Mafume instructing the City Council to allocate</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-councillors-fight-undervaluing-land-compensated-to-chiyangwas-pinnacle-holdings/\">Harare councillors fight undervaluing land compensated to Chiyangwa’s Pinnacle Holdings</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:36",
            "date": "13 Jun 2025"
        },
        {
            "title": "Omnia Holdings increases dividend pay out despite setbacks in agriculture division",
            "url": "https://www.newzimbabwe.com/omnia-holdings-increases-dividend-pay-out-despite-setbacks-in-agriculture-division/",
            "content": "By Business Report\n\nTHE diversified company, propelled by its mining sector which is seeing new orders for its regional markets on the back of a rebound in copper and battery metals, achieved robust results and delivered bumper dividends.\n\nOmnia Holdings delivered a resilient performance for the fiscal year ended March 31, 2025 despite set backs in the agriculture division, which was impacted by currency issues in Zimbabwe, drought in Zambia, and the civil unrest in Mozambique.\n\nThe diversified company, propelled by its mining sector which is seeing new orders for its regional markets on the back of a rebound in copper and battery metals, achieved robust results and delivered bumper dividends.\n\nThe agri business Zambia, Zimbabwe and Mozambique didnt perform well, Seelan Gobalsamy, CEO of Omnia told Business Report in an interview.\n\nZimbabwe had the usual currency issues and a lot of uncertainty (and) we had some regulatory challenges and in Zambia, we saw a massive drought that impacted revenue.\n\nThe unrest that rocked Mozambique in 2024 and early into this year also affected Omnia. The company had to send products via Namibia into Zambia as routes through Mozambique were disturbed by the unrest, impacting working capital and profits negatively.\n\nWith strong performance from Agriculture RSA and mining segment, Omnias revenues for the year to the end of March grew 2.7% to R22.82 billion. Mining has emerged as Omnias strongest business from an outdoor projective.\n\nThere is still a strong demand for metals, you know, the metals that drive that transition to cleaner energy, you know, the battery metals, uranium. So, we are positively disposed to the mining market, and we are winning new customers, renewing new customers, explained Gobalsamy.\n\nHeadline earnings per share increased by 1% to 704 cents, while operating profit remained unchanged at R1.7bn despite the inclusion of the Chemicals restructuring costs, along with the impact of severe drought conditions and currency depreciation in Agriculture Rest of Africa.\n\nThe Mining segment delivered an improved operating margin of 12.4% from 12.1%, supported by strong performance from Mining RSA and Mining International, as well as higher throughput and efficiencies.\n\nIn the mining sector, sustained demand for critical minerals supporting the global energy transition, underpinned exploration activity and supported positive fundamentals for the explosives market.\n\nHowever, geopolitical tensions and trade policy uncertainty presented ongoing risks.\n\nThe group had a net cash balance of R1.77bn was down from R2.3bn.\n\nThe board declared a total dividend of 675 cents per share for the year. This comprises an increased ordinary dividend of 400 cents, from 375 cents the prior year, and a special dividend of 275 cents per share, returning R1.1bn to shareholders.\n\nDespite persistent macroeconomic headwinds, Omnia delivered sustained profitability and continued to create long-term value for shareholders. This performance reflects the strength, quality, and growing diversity of our portfolio, underpinned by a sharpened focus on manufacturing efficiency, supply chain resilience, and customer-driven innovation, Gobalsamy said\n\nThe increased ordinary dividend payout, and special dividend declared is a clear signal of our confidence in the sustainability of our earnings and the successful execution of our growth and diversification strategy.\n\nLooking ahead, Omnia said the outlook for its Agriculture segment remained positive, driven by expected improvements in agronomic conditions across key regions such as the proprietary Nutriology model.\n\nOmnia said 2026 will be a significant transition year in which non-core assets and business lines will be sold, capital released and returns improved.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/12055359/omnia_ssb_trucks_.jpeg",
            "description": "<p>By Business Report THE diversified company, propelled by its mining sector which is seeing new orders for its regional markets on the back of a rebound in copper and battery metals, achieved robust results and delivered bumper dividends. Omnia Holdings delivered a resilient performance for the fiscal year ended March 31, 2025 despite set backs</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/omnia-holdings-increases-dividend-pay-out-despite-setbacks-in-agriculture-division/\">Omnia Holdings increases dividend pay out despite setbacks in agriculture division</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:36",
            "date": "13 Jun 2025"
        },
        {
            "title": "Passerby bites off builder’s lip for greeting him",
            "url": "https://www.newzimbabwe.com/passerby-bites-off-builders-lip-for-greeting-him/",
            "content": "By Staff Reporter\n\nA MAN from Chirundu in Mashonaland West has appeared in court for biting off another mans lower lip for greeting him.\n\nAccused person, Joel Kwenda was arraigned before the Karoi Magistrates Court facing assault charges.He was convicted of the crime and sentenced to 18 months imprisonment of which nine months were suspended for five years. A further nine months were set aside on condition offender performs community service.Prosecutors told the court that on June 1, 2025, at around 10am, at the Roman Catholic Church the victim was plastering a house when the offender passed by the site.The victim greeted Kwenda, who curtly responded saying he didnt want to befriend him and victim thought he was joking.The offender became angry and started chasing the victim before assaulting him with clenched fists. As if that wasnt enough, Kwenda dug his teeth into complainants lower lip and removed a chunk of flesh.\n\nAccused person, Joel Kwenda was arraigned before the Karoi Magistrates Court facing assault charges.\n\nHe was convicted of the crime and sentenced to 18 months imprisonment of which nine months were suspended for five years. A further nine months were set aside on condition offender performs community service.Prosecutors told the court that on June 1, 2025, at around 10am, at the Roman Catholic Church the victim was plastering a house when the offender passed by the site.The victim greeted Kwenda, who curtly responded saying he didnt want to befriend him and victim thought he was joking.The offender became angry and started chasing the victim before assaulting him with clenched fists. As if that wasnt enough, Kwenda dug his teeth into complainants lower lip and removed a chunk of flesh.\n\nHe was convicted of the crime and sentenced to 18 months imprisonment of which nine months were suspended for five years. A further nine months were set aside on condition offender performs community service.\n\nProsecutors told the court that on June 1, 2025, at around 10am, at the Roman Catholic Church the victim was plastering a house when the offender passed by the site.The victim greeted Kwenda, who curtly responded saying he didnt want to befriend him and victim thought he was joking.The offender became angry and started chasing the victim before assaulting him with clenched fists. As if that wasnt enough, Kwenda dug his teeth into complainants lower lip and removed a chunk of flesh.\n\nProsecutors told the court that on June 1, 2025, at around 10am, at the Roman Catholic Church the victim was plastering a house when the offender passed by the site.\n\nThe victim greeted Kwenda, who curtly responded saying he didnt want to befriend him and victim thought he was joking.The offender became angry and started chasing the victim before assaulting him with clenched fists. As if that wasnt enough, Kwenda dug his teeth into complainants lower lip and removed a chunk of flesh.\n\nThe victim greeted Kwenda, who curtly responded saying he didnt want to befriend him and victim thought he was joking.\n\nThe offender became angry and started chasing the victim before assaulting him with clenched fists. As if that wasnt enough, Kwenda dug his teeth into complainants lower lip and removed a chunk of flesh.\n\nThe offender became angry and started chasing the victim before assaulting him with clenched fists. As if that wasnt enough, Kwenda dug his teeth into complainants lower lip and removed a chunk of flesh.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/12/19043340/Karoi-Mag.jpg",
            "description": "<p>By Staff Reporter  A MAN from Chirundu in Mashonaland West has appeared in court for biting off another man’s lower lip for greeting him. Accused person, Joel Kwenda was arraigned before the Karoi Magistrates’ Court facing assault charges. He was convicted of the crime and sentenced to 18 months imprisonment of which nine months were</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/passerby-bites-off-builders-lip-for-greeting-him/\">Passerby bites off builder’s lip for greeting him</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:36",
            "date": "13 Jun 2025"
        },
        {
            "title": "‘There is too much corruption’ — says former MP, dismantles information tsar’s spin on IMF perspective on Zimbabwe’s economic performance",
            "url": "https://www.newzimbabwe.com/there-is-too-much-corruption-says-former-mp-dismantles-information-tsars-spin-on-imf-perspective-on-zimbabwes-economic-performance/",
            "content": "By Staff Reporter\n\nFORMER Mt Pleasant legislator, Fadzayi Mahere has criticized Information Permanent Secretary Nick Mangwana for attempting to portray the International Monetary Fund (IMF)s observations on widespread corruption and the limited acceptance of the ZiG currency as an endorsement of Zimbabwes economic progress.\n\nMahere dismissed this as a disingenuous spin doctoring tactic.\n\nAn IMF delegation, led by Mission Chief Wojciech Maliszewski, is currently in Zimbabwe for the Article IV Consultation, which provides an opportunity to review the countrys economic policies and progress under the IMFs regular assessment framework.\n\nThis weeks review follows an earlier visit in January this year. It is widely considered a critical juncture for Zimbabwes reform agenda.\n\nWhile the Staff Monitored Programme (SMP) does not provide funding, its successful implementation is a prerequisite for future access to concessional financing, potential debt restructuring, and the restoration of confidence among international creditors and investorsall of which Zimbabwe desperately needs.The southern African nation is burdened with a burgeoning public debt that has now exceeded US$21 billion, including more than US$12.3 billion owed to external creditors.Following the visit, IMF Mission Chief Maliszewski said the IMF would like to see a fully functioning local ZiG currency and fiscal discipline with a balance between expenditure and revenue.He also addressed the issue of corruption and stressed the need for a genuine currency exchange market, as well as a credible debt restructuring process.In an attempt to put a positive spin on this, Mangwana posted on his X account his own interpretation of the IMFs comments.The IMF sees macroeconomic stability in Zimbabwe we see it too. They want to see the ZIG becoming fully our national currency  we want that too. They see the ZIG stability we are witnesses.However, Mahere, who is also a constitutional lawyer, strongly disagreed with Mangwanas sentiments.Did you listen carefully to what the IMF representative is actually saying? These are the key takeaways: This Govt has no fiscal discipline. Fiscal discipline is urgently required. The public financial management system is worrisome. Read theres too much corruption.The people need reassurance that the so-called reforms introduced will stay. Read theres no trust or public confidence in what the Govt says about the state of the economy.The ZIG is not yet a national currency. While it may look stable, it is not widely used. The official exchange rate is artificial as demonstrated by the existence of a parallel market rate. The fact that the two dont converge is problematic. You can rig an election but you cannot rig the economy, Mahere wrote on her X account in response to Mangwana.Fourteen months after its introduction, the ZiG currency is still failing to facilitate payments for essential services such as passport issuance, fuel, and other necessities, indicating its shortcomings.The private sector, particularly Small and Medium Enterprises (SMEs), does not accept ZiG as a form of payment in its daily transactions, leaving many, especially civil servants, searching for US dollars on the parallel market, where the exchange rate is US$1: 40 ZiG, even though the Treasury has set the official exchange rate at US$1: 27 ZiG.\n\nWhile the Staff Monitored Programme (SMP) does not provide funding, its successful implementation is a prerequisite for future access to concessional financing, potential debt restructuring, and the restoration of confidence among international creditors and investorsall of which Zimbabwe desperately needs.\n\nThe southern African nation is burdened with a burgeoning public debt that has now exceeded US$21 billion, including more than US$12.3 billion owed to external creditors.\n\nFollowing the visit, IMF Mission Chief Maliszewski said the IMF would like to see a fully functioning local ZiG currency and fiscal discipline with a balance between expenditure and revenue.\n\nHe also addressed the issue of corruption and stressed the need for a genuine currency exchange market, as well as a credible debt restructuring process.\n\nIn an attempt to put a positive spin on this, Mangwana posted on his X account his own interpretation of the IMFs comments.\n\nThe IMF sees macroeconomic stability in Zimbabwe we see it too. They want to see the ZIG becoming fully our national currency  we want that too. They see the ZIG stability we are witnesses.\n\nHowever, Mahere, who is also a constitutional lawyer, strongly disagreed with Mangwanas sentiments.\n\nDid you listen carefully to what the IMF representative is actually saying? These are the key takeaways: This Govt has no fiscal discipline. Fiscal discipline is urgently required. The public financial management system is worrisome. Read theres too much corruption.\n\nThe people need reassurance that the so-called reforms introduced will stay. Read theres no trust or public confidence in what the Govt says about the state of the economy.The ZIG is not yet a national currency. While it may look stable, it is not widely used. The official exchange rate is artificial as demonstrated by the existence of a parallel market rate. The fact that the two dont converge is problematic. You can rig an election but you cannot rig the economy, Mahere wrote on her X account in response to Mangwana.Fourteen months after its introduction, the ZiG currency is still failing to facilitate payments for essential services such as passport issuance, fuel, and other necessities, indicating its shortcomings.The private sector, particularly Small and Medium Enterprises (SMEs), does not accept ZiG as a form of payment in its daily transactions, leaving many, especially civil servants, searching for US dollars on the parallel market, where the exchange rate is US$1: 40 ZiG, even though the Treasury has set the official exchange rate at US$1: 27 ZiG.\n\nThe people need reassurance that the so-called reforms introduced will stay. Read theres no trust or public confidence in what the Govt says about the state of the economy.\n\nThe ZIG is not yet a national currency. While it may look stable, it is not widely used. The official exchange rate is artificial as demonstrated by the existence of a parallel market rate. The fact that the two dont converge is problematic. You can rig an election but you cannot rig the economy, Mahere wrote on her X account in response to Mangwana.\n\nFourteen months after its introduction, the ZiG currency is still failing to facilitate payments for essential services such as passport issuance, fuel, and other necessities, indicating its shortcomings.\n\nThe private sector, particularly Small and Medium Enterprises (SMEs), does not accept ZiG as a form of payment in its daily transactions, leaving many, especially civil servants, searching for US dollars on the parallel market, where the exchange rate is US$1: 40 ZiG, even though the Treasury has set the official exchange rate at US$1: 27 ZiG.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/03/26191811/Nick-Mangwana.jpg",
            "description": "<p>By Staff Reporter FORMER Mt Pleasant legislator, Fadzayi Mahere has criticized Information Permanent Secretary Nick Mangwana for attempting to portray the International Monetary Fund (IMF)’s observations on widespread corruption and the limited acceptance of the ZiG currency as an endorsement of Zimbabwe’s economic progress. Mahere dismissed this as a disingenuous spin doctoring tactic. An IMF</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/there-is-too-much-corruption-says-former-mp-dismantles-information-tsars-spin-on-imf-perspective-on-zimbabwes-economic-performance/\">‘There is too much corruption’ — says former MP, dismantles information tsar’s spin on IMF perspective on Zimbabwe’s economic performance</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:36",
            "date": "13 Jun 2025"
        }
    ]
}