{
    "news": [
        {
            "title": "NetOne CEO’s lawyers demand his release, blame “boardroom politics” for arrest",
            "url": "https://www.newzimbabwe.com/netone-ceos-lawyers-demand-his-release-blame-boardroom-politics-for-arrest/",
            "content": "By Mary Taruvinga\n\nLawyers representing NetOne CEO Raphael Mushanawani have written to the Zimbabwe Anti-Corruption Commission (ZACC) demanding his immediate release, insisting their client is the victim of a calculated power grab within the organisation.\n\nMushanawani was arrested Monday on fraud allegations involving US$1.2 million. However, his legal team claims the charges are fabricated by rivals seeking to force him out, using the names of influential politicians to strengthen their plot.\n\nIn a letter dated September 30, 2025, and seen byNewZimbabwe.com, Mushanawanis lawyer Admire Rubaya argued that the arrest was unlawful, describing his client as being punished for doing things right at the parastatal.\n\nRubaya alleged that ZACC had been misled, insisting that all the CEOs actions were above board and backed by board approval, contrary to claims that he engaged companies without authorisation.\n\nThere are certain individuals who are targeting his post who have approached you (ZACC) on the basis of name dropping very powerful individuals who sit in the high echelons of power and politics in this country yet there is no involvement of any such political figures. The grand plan is for these instigators to take over as the people at the helm of NetOne, the letter states.\n\nZACC accuses Mushanawani of breaching company procedures by secretly engaging Lunartech Solutions (Pvt) Ltd to upgrade NetOnes SAGE 1000 system, which was meant to be replaced under a separate US$3.5 million contract awarded to Farevic Systems (Pvt) Ltd in 2022.\n\nThe commission alleges that Mushanawani did so without the approval of the Executive Committee or the Board.\n\nHowever, his lawyers insist the upgrade was necessary, approved at the board level, and vital to safeguard NetOnes operations.\n\nOur client is at a loss as to why he finds himself languishing in police custody over an issue which exposes your officers lack of understanding of IT systems, the lawyers wrote.\n\nThey explained that the SAP ERP system being implemented by Farevic was distinct from the SAGE 1000 system NetOne had been using for years. SAGE had reached its end-of-sale stage, with support from its South African vendor scheduled to end on December 31, 2024, creating what they said was a significant operational risk.\n\nContrary to your claims, the upgrading of the SAGE ERP 1000 to SAGE L200 was imperative  This was key and had been approved by the board, the lawyers said.\n\nThey further argued that both systems had to run in parallel until the new one was proven fully functional.\n\nThe lawyers also rejected claims that Mushanawani signed addenda worth US$1.2 million to upgrade the SAGE system.\n\nThis is false, and you are challenged to provide such evidence. For your information, the only payments which have been made thus far are for US$184,800 and US$88,002.57, the letter reads.\n\nThey equally dismissed allegations that Mushanawani entered into an unapproved consultancy contract with Diztech (Pvt) Ltd for US$79,467.\n\nFor the record, there is no contract that was signed between Diztech (Pvt) Ltd and NetOne as alleged, neither has there been any payment of even a dime to Diztech (Pvt) Ltd  since no such services were ever provided, the lawyers said.\n\nMushanawanis defence team maintains that the allegations are part of a deliberate campaign to oust him from his position. They attached board documents to support their case and warned ZACC against being used in what they called an orchestrated plot.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/30061209/NETONE-CEO-Raphael.jpeg",
            "description": "<p>By Mary Taruvinga Lawyers representing NetOne CEO Raphael Mushanawani have written to the Zimbabwe Anti-Corruption Commission (ZACC) demanding his immediate release, insisting their client is the victim of a calculated power grab within the organisation. Mushanawani was arrested Monday on fraud allegations involving US$1.2 million. However, his legal team claims the charges are fabricated by</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/netone-ceos-lawyers-demand-his-release-blame-boardroom-politics-for-arrest/\">NetOne CEO’s lawyers demand his release, blame “boardroom politics” for arrest</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "01 Oct 2025"
        },
        {
            "title": "Congo’s ex-president Kabila sentenced to death in absentia by military court",
            "url": "https://www.newzimbabwe.com/congos-ex-president-kabila-sentenced-to-death-in-absentia-by-military-court/",
            "content": "Former Democratic Republic of Congo president Joseph Kabila was sentenced to death in absentia on Tuesday by a military court that convicted him of war crimes, treason, and crimes against humanity.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/04/12005230/Joseph-Kabila-e1530910845219.jpg",
            "description": "<p>Reuters Former Democratic Republic of Congo president Joseph Kabila was sentenced to death in absentia on Tuesday by a military court that convicted him of war crimes, treason, and crimes against humanity. The case stems from his alleged role in backing the advance of Rwanda-backed M23 rebels in Congo’s volatile east. Kabila, who led Congo from</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/congos-ex-president-kabila-sentenced-to-death-in-absentia-by-military-court/\">Congo’s ex-president Kabila sentenced to death in absentia by military court</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "01 Oct 2025"
        },
        {
            "title": "HERD euthanises elephant Limpopo after fatal attack on senior carer",
            "url": "https://www.newzimbabwe.com/herd-euthanises-elephant-limpopo-after-fatal-attack-on-senior-carer/",
            "content": "IOL\n\nTHE elephant involved in a fatal incident with a senior carer at the Hoedspruit Elephant Rehabilitation and Development Trust (HERD) has been euthanised, following a failed attempt to relocate her where she showed aggression to other staff.\n\nHERD senior carer, Israel Shambira, was fatally gored by the 19-year-old female elephant named Limpopo earlier this month.\n\nIn the days following the incident, our dedicated carers remained in a state of heightened stress and concern, particularly regarding the safety of being near Limpopo. After extensive consultation among our senior carers, HERD Elephant Manager Tigere Matipedza, and founder of HERD, Adine Roode, with additional guidance from elephant behaviour expert Brett Mitchell, HERD resolved to move Limpopo along with six of her companions to a secure 35ha enclosure at the Hoedspruit Endangered Species Centre (HESC), located approximately ten kilometres away. The plan was to house the group at HESC under a temporary holding permit while a suitable long-term rewilding site could be identified. The remaining nine elephants were to remain at HERD, the organisation said.\n\n19-year-old female elephant, Limpopo. Image: Hoedspruit Elephant Rehabilitation and Development (HERD)\n\nThe available enclosure allowed for the carers to manage Limpopo and the other elephants under a protected contact type of management.\n\nThis decision was made on ethical and humane grounds to ensure the safety of HERD personnel and the responsible management of the elephants. The selection of elephants to be relocated was based on the best available data and the elephant social bonds.\n\nOn September 19, as the selected elephants started their walk from the HERD boma, within a few hundred metres, the elephants from both groups began vocalising, becoming very excitable.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/30150311/israel-shambira.png",
            "description": "<p>IOL THE elephant involved in a fatal incident with a senior carer at the Hoedspruit Elephant Rehabilitation and Development Trust (HERD) has been euthanised, following a failed attempt to relocate her where she showed aggression to other staff. HERD senior carer, Israel Shambira, was fatally gored by the 19-year-old female elephant named Limpopo earlier this</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/herd-euthanises-elephant-limpopo-after-fatal-attack-on-senior-carer/\">HERD euthanises elephant Limpopo after fatal attack on senior carer</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "01 Oct 2025"
        },
        {
            "title": "Zimbabwe’s gold coins top $4,000 for first time on Bullion rally",
            "url": "https://www.newzimbabwe.com/zimbabwes-gold-coins-top-4000-for-first-time-on-bullion-rally/",
            "content": "\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/07/21142401/gold-coins.webp",
            "description": "<p>Bloomberg Zimbabwe’s gold coins topped the $4,000 mark for the first time, lifted by a global rally in the metal that’s up 45% this year. The 22-carat “Mosi-Oa-Tunya” gold coins — named after Victoria Falls, a popular tourist destination, and introduced in 2022 to counter a rapid depreciation of the now-defunct local dollar — were</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-gold-coins-top-4000-for-first-time-on-bullion-rally/\">Zimbabwe’s gold coins top $4,000 for first time on Bullion rally</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "01 Oct 2025"
        },
        {
            "title": "OK Zimbabwe revenue tumbles by 53% amid supply chain disruptions",
            "url": "https://www.newzimbabwe.com/ok-zimbabwe-revenue-tumbles-by-53-amid-supply-chain-disruptions/",
            "content": "By Alois Vinga\n\nRetail giant OK Zimbabwe has reported a 53% decline in revenues, attributing the slump to supply chain disruptions, a liquidity crunch, and intensifying competition from the informal sector.\n\nPresenting the groups performance for the year ended March 31, 2025, OK Zimbabwe chairman Herbert Nkala said revenues fell to US$240 million, down 53% compared to the prior year, despite an average inflation rate of 15.21%.\n\nThe decline was linked to several factors, including exchange rate controls that distorted pricing and delayed supplier payments, which led to disruptions in product availability.\n\nSupply chain disruptions were as a result of the group failing to settle suppliers accounts on time leading to some withholding deliveries while others demanded payment upfront. These challenges resulted in the Groups operational capacity being impacted negatively, said Nkala.\n\nThe company carried out a comprehensive impairment review of all cash-generating units (CGUs). Due to constrained operational capacity, it recognised an impairment of US$10.3 million, as the recoverable amounts of certain CGUs fell below their carrying values.\n\nA net exchange gain of US$13.5 million was recorded, stemming from the revaluation of monetary liabilities after the devaluation of the Zimbabwe Gold (ZWG).\n\nDespite the challenges, the group has taken steps to strengthen its balance sheet. A rights issue raising US$20 million was concluded in July 2025, with proceeds received in August. An additional capital raise of US$10.5 million through the sale of immovable properties is underway, with offers currently under consideration.\n\nLooking ahead, cost optimisation and in-store as well as online sales strategies will remain central to achieving and sustaining the required growth. The recovery of the Group has started, but it will take some time to return to normal operations, added Nkala.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/27172614/OK-Supermarket.png",
            "description": "<p>By Alois Vinga Retail giant OK Zimbabwe has reported a 53% decline in revenues, attributing the slump to supply chain disruptions, a liquidity crunch, and intensifying competition from the informal sector. Presenting the group’s performance for the year ended March 31, 2025, OK Zimbabwe chairman Herbert Nkala said revenues fell to US$240 million, down 53%</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ok-zimbabwe-revenue-tumbles-by-53-amid-supply-chain-disruptions/\">OK Zimbabwe revenue tumbles by 53% amid supply chain disruptions</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "01 Oct 2025"
        },
        {
            "title": "Zimbabwe orders spending clampdown to keep budget under control",
            "url": "https://www.newzimbabwe.com/zimbabwe-orders-spending-clampdown-to-keep-budget-under-control/",
            "content": "Zimbabwe ordered government departments to halt unbudgeted spending and focus funds only on projects that will support economic growth in the southern African nation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/05/03011105/George-Guvamatanga.jpg",
            "description": "<p>Bloomberg Zimbabwe ordered government departments to halt unbudgeted spending and focus funds only on projects that will support economic growth in the southern African nation. Secretary of Finance George Guvamatanga issued the instruction in a circular seen by Bloomberg and confirmed by his ministry on Monday. He suspended government-funded foreign trips, froze hiring and barred</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-orders-spending-clampdown-to-keep-budget-under-control/\">Zimbabwe orders spending clampdown to keep budget under control</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "01 Oct 2025"
        },
        {
            "title": "South Africa’s top diplomat in France found dead near Paris hotel",
            "url": "https://www.newzimbabwe.com/south-africas-top-diplomat-in-france-found-dead-near-paris-hotel/",
            "content": "BBC\n\nSouth Africas ambassador to France, Nathi Mthethwa, has been found dead near the four-star Hyatt Regency Hotel in Paris, French officials have told the BBC.\n\nMthethwa, 58, was reported missing by his wife on Monday evening, after a worrying message from him, the Paris prosecutors office said.\n\nHe had booked a room on the 22nd floor of the high-rise hotel, whose security window was forced open, it added.\n\nThe circumstances around his death are unclear at this stage, and an investigation has been opened, the Paris prosecutors office said, adding that a duty magistrate was going to the scene.\n\nMthethwa was a high-ranking member of the African National Congress, the party that brought in democratic rule in 1994 with Nelson Mandela as South Africas first black president.\n\nHe had been serving as South Africas ambassador to Paris since December 2023, and had previously been in government as police minister and also arts and culture minister.\n\nHe was a close ally of former President Jacob Zuma and was implicated in what is known in South Africa as the state capture inquiry, which looked into allegations of high-level corruption during Zumas presidency.\n\nIn a statement, South Africas Foreign Minister Ronald Lamola hailed Mthethwa as a distinguished servant of the nation.\n\nI have no doubt that his passing is not only a national loss but is also felt within the international diplomatic community, he added.\n\nLamola confirmed that the circumstances around Mthethwas death were being investigated by the French authorities.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/30181743/nathi-mtetwa.webp",
            "description": "<p>BBC South Africa’s ambassador to France, Nathi Mthethwa, has been found dead near the four-star Hyatt Regency Hotel in Paris, French officials have told the BBC. Mthethwa, 58, was reported missing by his wife on Monday evening, after a “worrying message from him”, the Paris prosecutor’s office said. He had booked a room on the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africas-top-diplomat-in-france-found-dead-near-paris-hotel/\">South Africa’s top diplomat in France found dead near Paris hotel</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "01 Oct 2025"
        }
    ]
}