{
    "news": [
        {
            "title": "Kadewere not dropped for Warriors last match, sources explain – as Nees begs for peace",
            "url": "https://www.newzimbabwe.com/kadewere-not-dropped-for-warriors-last-match-sources-explain-as-nees-begs-for-peace/",
            "content": "By Staff Reporter\n\nREPORTS that Warriors coach Michael Nees was forced to drop forward Tino Kadewere for their World Cup qualifier against Rwanda following his altercation with journalist Yvonne Mangunda, have been dismissed.\n\nKadewere and Mangunda had a short touchline bust-up at Orlando Stadium in South Africa where Zimbabwe were training ahead of their match against Rwanda.\n\nHis absence from the matchday squad had sent tongues wagging, with many arguing he had been dropped by Nees, a case that has been dismissed by sources within the ZIFA entourage in South Africa who explained his absence.\n\nZIFA put out a statement on the matter and that was it. He was not dropped but injured on Monday, said a source from within the entourage.\n\nThose who noticed, on Monday he sat out most of the training because of a knock he got last Friday (when Zimbabwe played Benin in Ivory Coast).\n\nSpeaking after another, slim 1-0 loss Nees fell short of begging for peace and unity, saying the matter had been rested.\n\nI appeal to everybody to stick together, be a little bit humble. We had incidents here and I hope they are all sorted out, said Nees.\n\nWe will not benefit; we all need positive energy. We wanted to break that with a result to get that positive mood. Definitely we have too much noise, there is no doubt about thatwe have to stop that on various platforms.\n\nSocial media has been ablaze since the incident, with fans unevenly divided between Kadewere and Mangunda.\n\nKadewere, despite a dip in form, has found favour and been saluted for standing up for himself while Mangunda is being accused of being toxic towards followers of her Facebook page.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/20005548/Tino-Kadewere-x350.jpg",
            "description": "<p>By Staff Reporter REPORTS that Warriors coach Michael Nees was forced to drop forward Tino Kadewere for their World Cup qualifier against Rwanda following his altercation with journalist Yvonne Mangunda, have been dismissed. Kadewere and Mangunda had a short touchline bust-up at Orlando Stadium in South Africa where Zimbabwe were training ahead of their match</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kadewere-not-dropped-for-warriors-last-match-sources-explain-as-nees-begs-for-peace/\">Kadewere not dropped for Warriors last match, sources explain – as Nees begs for peace</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:37",
            "date": "10 Sep 2025"
        },
        {
            "title": "Brother beheads sister for rituals, goes blind on eve of trial",
            "url": "https://www.newzimbabwe.com/brother-beheads-sister-for-rituals-goes-blind-on-eve-of-trial/",
            "content": "By Mary Taruvinga\n\nA Magunje family was left shattered after their 20-year-old son murdered his own sister in cold blood, then lost his sight on the eve of his trial.\n\nHigh Court judge Justice Philda Muzofa, sitting with assessors in Chinhoyi, convicted Isaac Mashonga, now 28, of brutally killing his sister, Dadirai Mashonga, in their kitchen hut in Mashonga Village, Zvipani, Magunje, in July 2017.\n\nThe horror began when their 93-year-old father, Champion Mashonga, and his wife woke up to find their daughters headless body sprawled in blood.\n\nNo parent can imagine one of his or her children beheading his sibling in their kitchen, Muzofa said while delivering her judgment, calling it a tragedy that will haunt this family and community forever.\n\nOn the night of July 13, 2017, Isaac, then 20, arrived at his parents home in the company of a local businessman known as Giant, real name Robert Tichareva.\n\nThe businessman was arrested together with Mashonga, but has since passed on.\n\nProsecutors told the court the two had conspired to kill Dadirai for ritual purposes, with Isaac allegedly promised US$4,000 for the beheading.\n\nThat night, Dadirai was fast asleep in the kitchen hut.\n\nVillagers later testified that Isaac led Robert straight to her room.\n\nInside, she was strangled and then decapitated using a kitchen knife, axe and adze.\n\nThe pair stuffed the head into a green satchel and smuggled it out to a derelict building near the business centre.\n\nThe following morning, Isaac returned to the homestead wearing blood-soaked clothes.\n\nVillagers who gathered at the gruesome scene apprehended him, tied his hands, and later forced him to lead them to the hidden satchel. Inside was Dadirais head.\n\nHe confessed and showed us the weapons, testified his father, Champion. As a father, I had no reason to misrepresent the facts. I was simply a troubled father.\n\nAs if the ordeal was not enough, Isaac lost his sight while awaiting trial.\n\nPrison doctors confirmed he is now 80% blind, a development that deepened his elderly parents pain.\n\nFor this elderly couple, they have lost two children at the same time  one through death and one through incarceration, the judge noted.\n\nInside prison, Isaacs blindness has left him dependent on fellow inmates for food, bathing and movement. Being blind and in prison presents a double challenge, the court acknowledged, though ruling that disability could not shield him from punishment.\n\nIsaac had claimed he was drugged by Robert and acted under the businessmans instructions. But Justice Muzofa dismissed his story as far-fetched and chicanery.\n\nThe accused literally took the Court for granted, the judge said. He carried the satchel fully aware that it had his sisters head. He then went to sleep. How can a person conduct himself likewise and yet claim he was intoxicated?\n\nThe court found that Isaac acted as a willing accomplice. The proved facts admit of no other inference except that the accused was part of this grand plan, Justice Muzofa ruled.\n\nThe judge said the killing had induced a sense of shock and revulsion in the community and branded it murder in aggravating circumstances.\n\nAlthough Isaacs youth, six years in pre-trial custody and his disability were considered, the court said retribution and deterrence must prevail.\n\nHe now faces decades behind bars,blind, broken, and carrying the weight of a family curse: the brother who killed his sister and destroyed his parents twilight years.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/04/07040958/Crime-and-Murder.jpg",
            "description": "<p>By Mary Taruvinga A Magunje family was left shattered after their 20-year-old son murdered his own sister in cold blood, then lost his sight on the eve of his trial. High Court judge Justice Philda Muzofa, sitting with assessors in Chinhoyi, convicted Isaac Mashonga, now 28, of brutally killing his sister, Dadirai Mashonga, in their</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/brother-beheads-sister-for-rituals-goes-blind-on-eve-of-trial/\">Brother beheads sister for rituals, goes blind on eve of trial</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:37",
            "date": "10 Sep 2025"
        },
        {
            "title": "Despite progressive move to scrap death penalty, new survey reveals majority of Zimbabweans want it back",
            "url": "https://www.newzimbabwe.com/despite-progressive-move-to-scrap-death-penalty-new-survey-reveals-majority-of-zimbabweans-want-it-back/",
            "content": "By Leopold Munhende\n\nMORE than half of Zimbabweans surveyed by Afrobarometer believe the death penalty is a fair punishment for those who commit heinous crimes, the continental organisations latest report has revealed.\n\nThe survey was conducted a few months before the abolishment, on December 31, 2024.\n\nTouted as a progressive move by Amnesty International in 2024, the decision got mixed public feelings from a society caught between a non-violent culture and the desire to see those who commit ruthless crimes punished.\n\nAfrobarometer surveyed Zimbabweans to find out what they think about the death penalty as part of a broader exploration of their perceptions of the countrys judicial system, reads the reports summary.\n\nMore than half of Zimbabweans believe the death penalty is a fair punishment for those who commit the most serious crimes, although a significant minority think there is no crime for which the death penalty can be justified.\n\nZimbabwe became only the fifth African country to do away with the death sentence, an issue made easier for abolitionists by the fact that President Emmerson Mnangagwa had once been on death row in the 1960s.\n\nHe was arrested and charged with terrorism by the colonial regime against his role in the fight for independence.\n\nHis decision to abolish the death sentence saved 59 lives on death row since the early 2000s, when Zimbabwe last carried out an execution.\n\nHigh Court judges were tasked with re-sentencing criminals on death row, taking into consideration their crimes, duration of stay on death row and personal circumstances.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26182920/death-penalty.jpg",
            "description": "<p>By Leopold Munhende MORE than half of Zimbabweans surveyed by Afrobarometer believe the death penalty is a fair punishment for those who commit heinous crimes, the continental organisation’s latest report has revealed. The survey was conducted a few months before the abolishment, on December 31, 2024. Touted as a progressive move by Amnesty International in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/despite-progressive-move-to-scrap-death-penalty-new-survey-reveals-majority-of-zimbabweans-want-it-back/\">Despite progressive move to scrap death penalty, new survey reveals majority of Zimbabweans want it back</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:37",
            "date": "10 Sep 2025"
        },
        {
            "title": "Zimbabwe’s climate crisis: Girls forced into young marriage and boys into illegal mining",
            "url": "https://www.newzimbabwe.com/zimbabwes-climate-crisis-girls-forced-into-young-marriage-and-boys-into-illegal-mining/",
            "content": "Metro UKs foreign correspondent Gergana Krasteva reports from Zimbabwe\n\nThe last time I see Madeline Mgwabi, she is peering through the gates of her crumbling home in western Zimbabwe.\n\nThe grandmother-of-three is clutching a single orange that our driver had slipped to her  leftover from the hotel breakfast.\n\nThe fruit will have to be split four ways between her and her grandsons one of them still a toddler  all of whom she is raising on her own in this godforsaken area in the southern part of Matabeleland North province.\n\nBeside her, on a wooden bench, is her eldest grandson, still dressed in his purple and blueschooluniform, steadily scooping gooey porridge from a plastic container.\n\nTo put food on the table, Madeline fetches firewood and does odd jobs for neighbours in the village of Libeni, in Umguza District, but it is not enough.\n\nBefore droughts robbed the region of water, the grandmother used to farm maize and other Zimbabwean staple crops in her now barren garden.\n\nGesturing at the dried-up shrubs, she tellsMetro: I have lived here for 25 years and each year, the droughts hit us worse and worse.\n\nBecause of the climate, we often do not harvest anything.\n\nHer face is hollowed by the years of loss, and her palms are calloused by the decade of grinding in Zimbabwes artisanal mines.\n\nWhat Madeline fears is that her grandsons will eventually have to abandon education in favour of mining to earn a living.\n\nThe familys financial struggle resembles the one of millions of people who have been burdened by the decades of macroeconomic instability, political isolation and now,climate changein Zimbabwe.\n\nDriving through Matabeleland North  where agricultureused to be one of the key economic sectors Metrowitnesses the scars of theclimate warming cycle, El Nio, firsthand.\n\nHere, the earth appears to have forgotten whatrainfeels like, despite the determination of Zimbabweans to revive what has been lost.\n\nAlongside the road, cattle search for anything to eat  grass, shrubs, any bit of greenery left in a land that has surrendered.\n\nThe SUV rumbles past what the driver tells me was, until 2023, the mighty Shangani River that used to nourish the region; now, it is nothing more than a cracked bed of mud and rocks.\n\nLast year, the Zimbabwean president Emmerson Mnangagwa declared a national disaster to tackle the prolonged drought crisis.\n\nLesotho, Malawi, Namibia and Zambia did so too. Other African nations were also severely affected.\n\nAs most households depend on agriculture for food, seven million people in Zimbabwe faced big shortagesduring the 2024-2025 season, despite improved crops this year.\n\nChildren have been the most impacted by the droughts  with some opting to drop out of school because their parents cannot provide them with food.\n\nA fifth of all Zimbabwean children aged less than five suffer from chronic malnutrition, with merely 10% of babies aged six to 23 months receiving an adequate minimum diet, according to recent figures.\n\nHunger is only one part of a vicious cycle that children are trapped in. With households collapsing under the weight of poverty, boys as young as nine leave school to risk their lives in unregulated mines  and girls are married off to provide their parents a brief financial relief.\n\nInZimbabwe, one girlout of three isalready marriedbefore turning 18, and more than one out of five has given birth.\n\nScores of underage brides fall victim to domestic violence and face gravehealthrisks, from early childbearing to HIV.\n\nAlthoughunderage marriage is illegalin Zimbabwe and local organisations have been fighting against it, families driven by poverty resort to it.\n\nLungisani Nyathi knows all too well the dangers his four children face; yet with no steadyworkand no wages coming in, he feels powerless to shield them.\n\nGesturing at a makeshift shack, clumsily constructed out of wood and blue tarpaulin, that is his new home, he tellsMetrothat his wife gave birth just 10 months ago to their baby girl.\n\nAs a father, I am supposed to provide for my children, he shares his fears.\n\nIf I fail to provide for my daughter when she grows up, I worry that she will have to marry someone very young.\n\nIt is common for girls to be tied into early marriages due to the financial situation of their families.\n\nOne day, our baby girl will have to face the same situation. Young girls are so desperate, they go to bars themselves to search for money.\n\nLungisani, who volunteers as a security guard for a borehole that supplies water in Village 5, in Bubi District, wishes to relocate his wife and children to another area so that his boys are not tempted to work in the gold mines nearby.\n\nWherever schools are located near mining fields, boys are sometimes lured into the pit, under the promise of some money.\n\nAfter working in a gold mine for six months last year, Lungisani knows all too well that this is not the life for a child.\n\nDescribing the conditions as very harsh, because workers are not given any protective clothing, he adds: Even the dust was choking us.\n\nKhumalo Fanta, deputy headteacher at the Amazwimabili Primary School, shares similar fears for her pupils and says that every year, a few children drop out to work in the mines or to be married off.\n\nShe tellsMetrothat boys, not even in their teens, who work as miners, are swiftly swept into a world of alcohol abuse, without parental supervision.\n\nWith what little money they make, they often entice young girls with false promises of a better life  pulling them both into the same cycle of poverty they were trying to escape, before their lives have even started.\n\nKhumalo says: A lot of boys would leave school and go work at the mines. It exposes them to elicit behaviour There is always alcohol near the mines because it sells fast to adolescents.\n\nThere is no control as parents are simply grateful that money is coming home, but it is dangerous.\n\nIt is a ticking time bomb. When they come back, they flash their money and the girls are attracted.\n\nThen they are lost in their behaviour because those boys just get drunk, shouting, they do all sorts of things.\n\nIf children go to school at all, the absence of support systems means that they walk several miles on empty stomachs every morning.\n\nMarys Meals, a Scottish-basedcharity, is working to break that cycle by providing daily school meals for children in early education.\n\nThe concept is simple. Marys Meals provides food for school, but it is the parents  often the mothers of the pupils  who prepare it and serve it up in between classes.\n\nThe promise of a warm bowl of porridge a day has become a lifeline, and sometimes the only meal a child will be guaranteed.\n\nMadelines eldest grandson, for example, is one of the pupils part of the programme.\n\nShe says: There is nothing more important for my grandsons than going to school and having an education. So having porridge at school is so helpful as it reduces the workload for me.\n\nDromoland Primary, the Bubi District of Matabeleland North, is one of the schools with which Marys Meals has been working with.\n\nSimeleni Mguni, the headmaster since 2020, toldMetrothat at the end of last year, there were 255 pupils  but this year there are 279 because of the feeding programme.\n\nWe enroll new learners every week, she says beaming with pride, her smile stretching across her round face.\n\nBefore the programme was introduced at the beginning of the school term in 2022, four boys and four girls dropped out because their parents could not feed them.\n\nSimeleni says, regretfully: I know some of the left because they needed to find jobs. Almost all the boys  aged between 12 and 14  went to search for work in the illegal mines.\n\nFor awhile, they moved from one gold mine to another, in the nearby area. It is not easy work. If they would find any gold they have to sell it for really meagre amounts of money [as it is not from a registered pit].\n\nTwo years later, they are now back in school because of Marys Meals, and passed their exams recently.\n\nThe four girls  aged between 13 and 14  are also back in the classroom.\n\nSimeleni said they had left because they did not have period products and were embarrassed to come to school.\n\nMarys Meals has been operating in Zimbabwe since 2018, with the help of a grassroots-based NGO, ORAP.\n\nWorking in some of the poorest countries across Africa, Asia, the Middle East, Latin America and the Caribbean, the charity has today announced the grim milestone that it is feeding three million children every day.\n\nMetro travelled to Zimbabwe with the help ofMarys Meals, a Scottish-based charity feeding children in the country.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/09173345/climate-crisis-metro-uk.webp",
            "description": "<p>Metro UK’s foreign correspondent Gergana Krasteva reports from Zimbabwe The last time I see Madeline Mgwabi, she is peering through the gates of her crumbling home in western Zimbabwe. The grandmother-of-three is clutching a single orange that our driver had slipped to her – leftover from the hotel breakfast. The fruit will have to be</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-climate-crisis-girls-forced-into-young-marriage-and-boys-into-illegal-mining/\">Zimbabwe’s climate crisis: Girls forced into young marriage and boys into illegal mining</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:37",
            "date": "10 Sep 2025"
        },
        {
            "title": "ZIMRA’s new presumptive vehicle taxes could push prices up, worsen poverty – legislator",
            "url": "https://www.newzimbabwe.com/zimras-new-presumptive-vehicle-taxes-could-push-prices-up-worsen-poverty-legislator/",
            "content": "By Staff Reporter\n\nThe Zimbabwe Revenue Authority (ZIMRA)s newly introduced presumptive taxes will burden vulnerable citizens already struggling with stagnant salaries and rising living costs, Norton legislator Richard Tsvangirayi has said.\n\nZIMRA yesterday announced new presumptive vehicle taxes, which go up to as much as US$500.\n\nThe new presumptive monthly taxes are as follows: commuter omnibuses US$50 for 8 to 14 passengers, US$60 for 15 to 24 passengers, US$80 for 25 to 36 passengers and US$100 for 37 passengers and above.\n\nTaxi cabs of not more than 7 passengers are now required to pay US$35 per month.\n\nDriving schools will also have to pay US$50 for class 4, and US$100 for class 1 and 2.\n\nGoods vehicles more than 10 tonnes but less than 20 tonnes are now required to pay US$200 and more than 20 tonnes US$500, while 10 tonnes or less but with a combination of truck and trailers of more than 15 but less than 20 tonnes US$500.\n\nResponding to these new taxes Tuesday, Tsvangirayi warned that this will only drive up the prices of goods and services while worsening poverty.\n\nThe new presumptive taxes introduced by ZIMRA are unfair and will have a direct negative impact on the most vulnerable in our society.\n\nSalaries have remained stagnant, yet taxes continue to rise, pushing the cost of goods and services beyond the reach of many. This will only deepen poverty, running contrary to the SDGs, particularly the goal of eradicating poverty, as well as the objectives of NDS1, which seeks to reduce the cost of doing business, Tsvangirayi said.\n\nNorton MP Richard Tsvangirayi\n\nHe also urged ZIMRA to pursue incentive-based strategies to boost compliance instead of punitive measures that threaten livelihoods.\n\nWhile the intention may be to encourage companies to register, formalise their operations, and increase government revenue, alternative strategies must be pursued.\n\nThese strategies should focus on incentivising compliance rather than relying on punitive measures that exacerbate the economic hardships already faced by ordinary citizens. In this regard, ZIMRA must urgently revise these figures downwards to ensure fairness and protect livelihoods.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/04/06225722/zimra-taxes.jpg",
            "description": "<p>By Staff Reporter The Zimbabwe Revenue Authority (ZIMRA)’s newly introduced presumptive taxes will burden vulnerable citizens already struggling with stagnant salaries and rising living costs, Norton legislator Richard Tsvangirayi has said. ZIMRA yesterday announced new presumptive vehicle taxes, which go up to as much as US$500. The new presumptive monthly taxes are as follows: commuter</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimras-new-presumptive-vehicle-taxes-could-push-prices-up-worsen-poverty-legislator/\">ZIMRA’s new presumptive vehicle taxes could push prices up, worsen poverty – legislator</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:37",
            "date": "10 Sep 2025"
        }
    ]
}