{
    "news": [
        {
            "title": "Former Zambian President Lungu dies aged 68",
            "url": "https://www.newzimbabwe.com/former-zambian-president-lungu-dies-aged-68/",
            "content": "BBC\n\nZambias former President Edgar Lungu has died at the age of 68, his party has said in a statement.\n\nHe had been receiving specialized treatment in South Africa for an undisclosed illness, the Patriotic Front said confirming the news.\n\nLungu led Zambia for six years from 2015, losing the election to the current President Hakainde Hichilema by a large margin.\n\nAfter that defeat he stepped back from politics but later returned to the fray and appeared to have ambitions to run for the presidency again.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/01/01182032/Edgar-Lungu.jpg",
            "description": "<p>BBC Zambia’s former President Edgar Lungu has died at the age of 68, his party has said in a statement. He had “been receiving specialized treatment in South Africa” for an undisclosed illness, the Patriotic Front said confirming the news. Lungu led Zambia for six years from 2015, losing the election to the current President</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/former-zambian-president-lungu-dies-aged-68/\">Former Zambian President Lungu dies aged 68</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "05 Jun 2025"
        },
        {
            "title": "Government showers rare praises on America, says it wants to fix relationship with Western power",
            "url": "https://www.newzimbabwe.com/government-showers-rare-praises-on-america-says-it-wants-to-fix-relationship-with-western-power/",
            "content": "By Leopold Munhende\n\nFOREIGN Affairs Minister Amon Murwira has showered rare praises on the United States of America (USA) for its humanitarian work and business investments over Zimbabwes 45 years of Independence.\n\nMurwira, who was speaking as guest of honour at early American Independence celebrations hosted by the US Embassy in Harare, expressed Zimbabwes gratitude for the superpowers contributions in its health, agriculture and education sectors, where hundreds of millions have been poured.\n\nHe said government, in its Zimbabwe is Open for Business approach towards international re-engagement, was specifically concerned with improving relations with America.\n\nZimbabwes relationship with America broke down in the early 2000s following a string of human rights abuses that were sanctioned by late President Robert Mugabe against opposition members, targeted white farmers and other dissenting voices.\n\nWe wish to express the gratitude of the government and people of Zimbabwe for the USAs support over the past 45 years which has contributed to the progress and development of Zimbabwe through collaboration in the implementation of programmes in sectors that include agriculture, education and health sector among others, said Murwira.\n\nWe are grateful for this support.\n\nZimbabwe is open for business, it is open to fair cooperation, it is open to deepen relations with the rest of the world, particularly with America and wish therefore to invite all potential US investors to come and invest in Zimbabwe.\n\nZimbabwe is fully committed to the continued enhancement of our bilateral relations.\n\nOver a million people have been fed by America in the past year. Some 47,000 farmers have accessed US markets while more than 500,000 have received antiretroviral drugs (ARVs) from its arm, the Presidents Emergency Fund for AIDS Relief (PEPFAR).\n\nDespite past attempts to thaw relations with America, Zimbabwe has always been found wanting whenever its human rights record is analysed. Arrest of journalists, the continued use of lengthy pre-trial detention as a weapon against dissenting voices, abductions and torture by the secret service have always been brought up.\n\nGrand corruption within the government, headed by Zanu PF-aligned businessmen and a clear disregard to fix the graft have also been raised as red flags.\n\nThis latest attempt at mending relations between the two countries comes barely a month after President Emmerson Mnangagwa announced the suspension of all tariffs on goods being imported from the US in an attempt to court re-elected President Donald Trump.\n\nAdded Murwira: Zimbabwe looks forward to deepening relations and expansion of bilateral cooperation with the USA we appreciate the participation of the USA through its embassy at the 2025 edition of Zimbabwe International Trade Fair (ZITF). We thank you for that participation.\n\nWe applaud all USA companies that have established businesses in Zimbabwe, we would like to assure all these and foreign companies in Zimbabwe that the Zimbabwean government is willing to assist them to expand their operations.\n\nAmericas Independence Day was commemorated earlier in Harare as a significant number of its embassy staff are being redeployed, according to Ambassador Pamela Tremont. America will be celebrating 249 years of Independence on July 4.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/05122143/murwira-tremont.jpeg",
            "description": "<p>By Leopold Munhende FOREIGN Affairs Minister Amon Murwira has showered rare praises on the United States of America (USA) for its humanitarian work and business investments over Zimbabwe’s 45 years of Independence. Murwira, who was speaking as guest of honour at early American Independence celebrations hosted by the US Embassy in Harare, expressed Zimbabwe’s gratitude</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/government-showers-rare-praises-on-america-says-it-wants-to-fix-relationship-with-western-power/\">Government showers rare praises on America, says it wants to fix relationship with Western power</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "05 Jun 2025"
        },
        {
            "title": "ADRA employee in court over US$1 million fraud",
            "url": "https://www.newzimbabwe.com/adra-employee-in-court-over-us1-million-fraud/",
            "content": "By Staff Reporter\n\nAn Adventist Development and Relief Agency (ADRA) employee was taken to court on fraud charges after he allegedly swindled his employer of over US$1 million.\n\nFortune Goredema appeared before Harare regional magistrate Marewanazvo Gofa, who granted him US$1,000.\n\nGoredema was also put under stringent bail conditions, which will see him reporting three times a week to the police.\n\nHe was also ordered to surrender his passport and title deeds to his house as part of his bail conditions.\n\nIt is the states case that in July last year, the organisation received a tip-off that Goredema was misusing their funds.\n\nActing on the information, the ADRA board initiated a forensic audit.\n\nThe audit was done by General Conference Auditing Services (GCAS), which picked up that from 2018 to 2024, Goredema defrauded the organisation using PAYE to the Zimbabwe Revenue Authority (Zimra).\n\nThe court heard he would allegedly post fictitious information in the ADRA accounting system, purporting that money was paid to Zimra when no money was paid.\n\nHe also allegedly misrepresented that he paid NSSA dues, knowing this was false.\n\nHe also misrepresented the nature of periodic financial statements in collaboration with the external auditors Baker Tilly who then confirmed during the audit session that the figures were understated, reads court papers.\n\nThe court heard Goredema had not met the requirements for statutory obligations of US$1,209,397 meant for Zimra PAYE and US$160,437 for NSSA dies.\n\nHe was overpaying himself and a total of US$118,578.69 was directed as his remuneration in the period from 2023 to 2024, said the National Prosecuting Authority.\n\nThe court heard that after the scam was unearthed, Goredema allegedly admitted to the allegations and sought redress and leniency.\n\nThe matter could not be resolved within the church because some of the money was donated; as such, accountability was a priority.\n\nThe complainant suffered an actual prejudice of US$1,488,403.\n\nNothing was recovered.\n\nLancelot Mutsokoti prosecuted.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/28155839/Harare-Magistrates-Court.jpg",
            "description": "<p>By Staff Reporter An Adventist Development and Relief Agency (ADRA) employee was taken to court on fraud charges after he allegedly swindled his employer of over US$1 million. Fortune Goredema appeared before Harare regional magistrate Marewanazvo Gofa, who granted him US$1,000. Goredema was also put under stringent bail conditions, which will see him reporting three</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/adra-employee-in-court-over-us1-million-fraud/\">ADRA employee in court over US$1 million fraud</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "05 Jun 2025"
        },
        {
            "title": "Calls grow to ban pitbulls in Zimbabwe",
            "url": "https://www.newzimbabwe.com/calls-grow-to-ban-pitbulls-in-zimbabwe/",
            "content": "By Darlington Gatsi\n\nPRESSURE is mounting on the government to ban pit bulls as domestic pets, as Zimbabwe continues to record deaths and injuries caused by the vicious dogs.\n\nThis follows the fatal attack of a Harare man, Samuel Machara, by a pitbull in Bluffhill.\n\nMacharas death is not an isolated incident, as similar cases have been recorded, raising concerns over the safety of keeping the dogs as pets.\n\nGospel musician Tembalami has initiated apetitionto push for a ban on pitbulls.\n\nHe argues that the dogs have become a danger and threaten public safety.\n\nWe have had countless deaths caused by pit bulls. Now its time to act. For years, the pit bull breed has been associated with savage attacks resulting in serious injuries and, tragically, fatalities in our communities. Despite taking necessary precautions, the inherent aggressive nature of these dogs has led to unforeseen and heartbreaking incidents involving our loved ones.\n\nThe increasing number of pit bull attacks highlights the urgent need for action. In countries like the United Kingdom and Canada, legislation has been implemented that bans or severely restricts the breeding and ownership of pit bulls. Such measures have led to a decrease in dangerous encounters and have proven effective in enhancing public safety, read the petition.\n\nAn estimated 12 countries worldwide have enforced a ban on keeping pit bulls, and calls are growing louder for Zimbabwe to follow suit.\n\nRecently, Harare Mayor Jacob Mafume indicated that the City Council would address the menace caused by the vicious animals.\n\nTembalamis petition further reads, Zimbabwe must take a similar approach to ensure the well-being of its citizens. A nationwide ban on pit bull ownership as pets and as security dogs will significantly reduce the risk of attacks. Pet owners can opt for other breeds that are known for their kindness and loyalty, providing a safer environment for all.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/01174941/pitbull-e1748796599291.jpeg",
            "description": "<p>By Darlington Gatsi PRESSURE is mounting on the government to ban pit bulls as domestic pets, as Zimbabwe continues to record deaths and injuries caused by the vicious dogs. This follows the fatal attack of a Harare man, Samuel Machara, by a pitbull in Bluffhill. Machara’s death is not an isolated incident, as similar cases</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/calls-grow-to-ban-pitbulls-in-zimbabwe/\">Calls grow to ban pitbulls in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "05 Jun 2025"
        },
        {
            "title": "ZWG annual inflation will not affect consumer purchasing power – Central Bank",
            "url": "https://www.newzimbabwe.com/zwg-annual-inflation-will-not-affect-consumer-purchasing-power-central-bank/",
            "content": "By Alois Vinga\n\nTHE Reserve Bank of Zimbabwe (RBZ) has implored economic agents to ignore annual ZWG inflation rates, arguing the stats have no bearing on pricing dynamics.\n\nThis comes afterinflation statistics by the Zimbabwe National Statistics Agency (Zimstat)revealedthat annual inflation surged to 92,1% in the month of September 2025.\n\nThe developments recently triggered an outcry from industry, which blamed the September 2024 43% local currency devaluation directive for pushing up the inflationary pressures. The business community also contends that the high ZWG annual inflation rates pose challenges for businesses, particularly due to the impact on interest rates.\n\nBut in a statement Wednesday, the RBZ governor, Dr John Mushayavanhu, said the transition from the ZW$ to ZWG-denominated prices inevitably created a statistical gap in the calculation of annual inflation figures. This resulted in Zimstat computing and publishing yearly inflation in April 2015 after obtaining a full year of ZWG prices.\n\nThe RBZ therefore, advised the public that the recorded rise in year-on-year ZWG inflation in April and May 2025 is primarily due to the base effect emanating from the once-off spike in monthly inflation from 5,8% in September 2024 to 37,2% in October 2024.\n\nThe current trend in annual inflation is expected to continue up to September 2025 and decline thereafter to align with the current low and stable monthly inflation. The current annual inflation will therefore not affect consumer purchasing power and value preservation, as the inflation impact has already been realised, said Mushayavanhu.\n\nThe central bank exchequer said going forward, the economy is projected to decline to 30% by 31 December 2025 and to further decline towards single-digit levels in the outlook period.\n\nConsidering the current pricing circumstances where annual ZiG inflation is not reflective of the current pricing dynamics, the RBZ encourages economic agents to focus on month-on-month inflation, which has a more direct link to current ZWG purchasing power expectations.\n\nThe monthly ZWG inflation will remain low and stable as Monetary Policy remains appropriately tight to balance price stability and economic growth, added Mushayavanhu.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171559/mushayavanhu-rbz.jpg",
            "description": "<p>By Alois Vinga THE Reserve Bank of Zimbabwe (RBZ) has implored economic agents to ignore annual ZWG inflation rates, arguing the stats have no bearing on pricing dynamics. This comes after inflation statistics by the Zimbabwe National Statistics Agency (Zimstat) revealed that annual inflation surged to 92,1% in the month of September 2025. The developments recently triggered an</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zwg-annual-inflation-will-not-affect-consumer-purchasing-power-central-bank/\">ZWG annual inflation will not affect consumer purchasing power – Central Bank</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "05 Jun 2025"
        }
    ]
}