{
    "news": [
        {
            "title": "Foreigners can’t dictate South Africa’s affairs – Operation Dudula leader hits back at Zanu PF as Zimbabweans face hospital bans",
            "url": "https://www.newzimbabwe.com/foreigners-cant-dictate-south-africas-affairs-operation-dudula-leader-hits-back-at-zanu-pf-as-zimbabweans-face-hospital-bans/",
            "content": "By Staff Reporter\n\nOPERATION Dudula leader ZandileDabula has hit back at Zanu PF spokesperson Farai Marapiras remarks that the movement betraysubuntu, insisting that no foreigner will dictate how South Africa runs its affairs.\n\nMarapira, the ruling party Zanu PFs information director, told IOL News that the ongoing campaigns against undocumented migrants were a betrayal ofubuntuand a continuation of colonial-era tactics of dividing Africans.\n\nThere is currently an ongoing xenophobic denial of healthcare access to foreign nationals who are being accused of straining the neighbouring countrys already overstretched public resources.\n\nSome of the targeted foreigners are Zimbabweans, who make up a large portion of undocumented immigrants in South Africa and are being chased out of public hospitals.\n\nZanu PF Information Director Farai Marapira\n\nResponding to Marapiras remarks on ubuntu, Dabula said foreigners cannot decide how South Africa should be governed.\n\nWe will not be dictated to by foreigners on how to run our country. We have the Constitution that is supposed to be guiding us, we have immigration laws that we use as guiding documents, shesaid.\n\nDabula added thatZanu-PF was oppressing its citizens and warned that the partys ties with the ANC pose a threat to South Africa, claiming the country risks sliding into the same crisis that Zimbabwe faces.\n\nZanu-PF is a problem for the people of Zimbabwe. They have been voted out, but they are still continuing to bully people.\n\nTheir relationship with the ANC is very problematic to us as South Africans because we can see that we are heading to the state where Zimbabwe is at currently, she added.\n\nSouth African authorities have long expressed concern over the strain placed on public services by Zimbabwean nationals fleeing a collapsed economy back home.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/10045549/Operation-Dudula-leader-Zandile-Dabula.jpeg",
            "description": "<p>By Staff Reporter OPERATION Dudula leader Zandile Dabula has hit back at Zanu PF spokesperson Farai Marapira’s remarks that the movement betrays ubuntu, insisting that no foreigner will dictate how South Africa runs its affairs. Marapira, the ruling party Zanu PF’s information director, told IOL News that the ongoing campaigns against undocumented migrants were a betrayal</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/foreigners-cant-dictate-south-africas-affairs-operation-dudula-leader-hits-back-at-zanu-pf-as-zimbabweans-face-hospital-bans/\">Foreigners can’t dictate South Africa’s affairs – Operation Dudula leader hits back at Zanu PF as Zimbabweans face hospital bans</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "10 Sep 2025"
        },
        {
            "title": "Zimbabwe’s climate crisis: Girls forced into young marriage and boys into illegal mining",
            "url": "https://www.newzimbabwe.com/zimbabwes-climate-crisis-girls-forced-into-young-marriage-and-boys-into-illegal-mining/",
            "content": "Metro UKs foreign correspondent Gergana Krasteva reports from Zimbabwe\n\nThe last time I see Madeline Mgwabi, she is peering through the gates of her crumbling home in western Zimbabwe.\n\nThe grandmother-of-three is clutching a single orange that our driver had slipped to her  leftover from the hotel breakfast.\n\nThe fruit will have to be split four ways between her and her grandsons one of them still a toddler  all of whom she is raising on her own in this godforsaken area in the southern part of Matabeleland North province.\n\nBeside her, on a wooden bench, is her eldest grandson, still dressed in his purple and blueschooluniform, steadily scooping gooey porridge from a plastic container.\n\nTo put food on the table, Madeline fetches firewood and does odd jobs for neighbours in the village of Libeni, in Umguza District, but it is not enough.\n\nBefore droughts robbed the region of water, the grandmother used to farm maize and other Zimbabwean staple crops in her now barren garden.\n\nGesturing at the dried-up shrubs, she tellsMetro: I have lived here for 25 years and each year, the droughts hit us worse and worse.\n\nBecause of the climate, we often do not harvest anything.\n\nHer face is hollowed by the years of loss, and her palms are calloused by the decade of grinding in Zimbabwes artisanal mines.\n\nWhat Madeline fears is that her grandsons will eventually have to abandon education in favour of mining to earn a living.\n\nThe familys financial struggle resembles the one of millions of people who have been burdened by the decades of macroeconomic instability, political isolation and now,climate changein Zimbabwe.\n\nDriving through Matabeleland North  where agricultureused to be one of the key economic sectors Metrowitnesses the scars of theclimate warming cycle, El Nio, firsthand.\n\nHere, the earth appears to have forgotten whatrainfeels like, despite the determination of Zimbabweans to revive what has been lost.\n\nAlongside the road, cattle search for anything to eat  grass, shrubs, any bit of greenery left in a land that has surrendered.\n\nThe SUV rumbles past what the driver tells me was, until 2023, the mighty Shangani River that used to nourish the region; now, it is nothing more than a cracked bed of mud and rocks.\n\nLast year, the Zimbabwean president Emmerson Mnangagwa declared a national disaster to tackle the prolonged drought crisis.\n\nLesotho, Malawi, Namibia and Zambia did so too. Other African nations were also severely affected.\n\nAs most households depend on agriculture for food, seven million people in Zimbabwe faced big shortagesduring the 2024-2025 season, despite improved crops this year.\n\nChildren have been the most impacted by the droughts  with some opting to drop out of school because their parents cannot provide them with food.\n\nA fifth of all Zimbabwean children aged less than five suffer from chronic malnutrition, with merely 10% of babies aged six to 23 months receiving an adequate minimum diet, according to recent figures.\n\nHunger is only one part of a vicious cycle that children are trapped in. With households collapsing under the weight of poverty, boys as young as nine leave school to risk their lives in unregulated mines  and girls are married off to provide their parents a brief financial relief.\n\nInZimbabwe, one girlout of three isalready marriedbefore turning 18, and more than one out of five has given birth.\n\nScores of underage brides fall victim to domestic violence and face gravehealthrisks, from early childbearing to HIV.\n\nAlthoughunderage marriage is illegalin Zimbabwe and local organisations have been fighting against it, families driven by poverty resort to it.\n\nLungisani Nyathi knows all too well the dangers his four children face; yet with no steadyworkand no wages coming in, he feels powerless to shield them.\n\nGesturing at a makeshift shack, clumsily constructed out of wood and blue tarpaulin, that is his new home, he tellsMetrothat his wife gave birth just 10 months ago to their baby girl.\n\nAs a father, I am supposed to provide for my children, he shares his fears.\n\nIf I fail to provide for my daughter when she grows up, I worry that she will have to marry someone very young.\n\nIt is common for girls to be tied into early marriages due to the financial situation of their families.\n\nOne day, our baby girl will have to face the same situation. Young girls are so desperate, they go to bars themselves to search for money.\n\nLungisani, who volunteers as a security guard for a borehole that supplies water in Village 5, in Bubi District, wishes to relocate his wife and children to another area so that his boys are not tempted to work in the gold mines nearby.\n\nWherever schools are located near mining fields, boys are sometimes lured into the pit, under the promise of some money.\n\nAfter working in a gold mine for six months last year, Lungisani knows all too well that this is not the life for a child.\n\nDescribing the conditions as very harsh, because workers are not given any protective clothing, he adds: Even the dust was choking us.\n\nKhumalo Fanta, deputy headteacher at the Amazwimabili Primary School, shares similar fears for her pupils and says that every year, a few children drop out to work in the mines or to be married off.\n\nShe tellsMetrothat boys, not even in their teens, who work as miners, are swiftly swept into a world of alcohol abuse, without parental supervision.\n\nWith what little money they make, they often entice young girls with false promises of a better life  pulling them both into the same cycle of poverty they were trying to escape, before their lives have even started.\n\nKhumalo says: A lot of boys would leave school and go work at the mines. It exposes them to elicit behaviour There is always alcohol near the mines because it sells fast to adolescents.\n\nThere is no control as parents are simply grateful that money is coming home, but it is dangerous.\n\nIt is a ticking time bomb. When they come back, they flash their money and the girls are attracted.\n\nThen they are lost in their behaviour because those boys just get drunk, shouting, they do all sorts of things.\n\nIf children go to school at all, the absence of support systems means that they walk several miles on empty stomachs every morning.\n\nMarys Meals, a Scottish-basedcharity, is working to break that cycle by providing daily school meals for children in early education.\n\nThe concept is simple. Marys Meals provides food for school, but it is the parents  often the mothers of the pupils  who prepare it and serve it up in between classes.\n\nThe promise of a warm bowl of porridge a day has become a lifeline, and sometimes the only meal a child will be guaranteed.\n\nMadelines eldest grandson, for example, is one of the pupils part of the programme.\n\nShe says: There is nothing more important for my grandsons than going to school and having an education. So having porridge at school is so helpful as it reduces the workload for me.\n\nDromoland Primary, the Bubi District of Matabeleland North, is one of the schools with which Marys Meals has been working with.\n\nSimeleni Mguni, the headmaster since 2020, toldMetrothat at the end of last year, there were 255 pupils  but this year there are 279 because of the feeding programme.\n\nWe enroll new learners every week, she says beaming with pride, her smile stretching across her round face.\n\nBefore the programme was introduced at the beginning of the school term in 2022, four boys and four girls dropped out because their parents could not feed them.\n\nSimeleni says, regretfully: I know some of the left because they needed to find jobs. Almost all the boys  aged between 12 and 14  went to search for work in the illegal mines.\n\nFor awhile, they moved from one gold mine to another, in the nearby area. It is not easy work. If they would find any gold they have to sell it for really meagre amounts of money [as it is not from a registered pit].\n\nTwo years later, they are now back in school because of Marys Meals, and passed their exams recently.\n\nThe four girls  aged between 13 and 14  are also back in the classroom.\n\nSimeleni said they had left because they did not have period products and were embarrassed to come to school.\n\nMarys Meals has been operating in Zimbabwe since 2018, with the help of a grassroots-based NGO, ORAP.\n\nWorking in some of the poorest countries across Africa, Asia, the Middle East, Latin America and the Caribbean, the charity has today announced the grim milestone that it is feeding three million children every day.\n\nMetro travelled to Zimbabwe with the help ofMarys Meals, a Scottish-based charity feeding children in the country.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/09173345/climate-crisis-metro-uk.webp",
            "description": "<p>Metro UK’s foreign correspondent Gergana Krasteva reports from Zimbabwe The last time I see Madeline Mgwabi, she is peering through the gates of her crumbling home in western Zimbabwe. The grandmother-of-three is clutching a single orange that our driver had slipped to her – leftover from the hotel breakfast. The fruit will have to be</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-climate-crisis-girls-forced-into-young-marriage-and-boys-into-illegal-mining/\">Zimbabwe’s climate crisis: Girls forced into young marriage and boys into illegal mining</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "10 Sep 2025"
        },
        {
            "title": "ZIMRA’s new presumptive vehicle taxes could push prices up, worsen poverty – legislator",
            "url": "https://www.newzimbabwe.com/zimras-new-presumptive-vehicle-taxes-could-push-prices-up-worsen-poverty-legislator/",
            "content": "By Staff Reporter\n\nThe Zimbabwe Revenue Authority (ZIMRA)s newly introduced presumptive taxes will burden vulnerable citizens already struggling with stagnant salaries and rising living costs, Norton legislator Richard Tsvangirayi has said.\n\nZIMRA yesterday announced new presumptive vehicle taxes, which go up to as much as US$500.\n\nThe new presumptive monthly taxes are as follows: commuter omnibuses US$50 for 8 to 14 passengers, US$60 for 15 to 24 passengers, US$80 for 25 to 36 passengers and US$100 for 37 passengers and above.\n\nTaxi cabs of not more than 7 passengers are now required to pay US$35 per month.\n\nDriving schools will also have to pay US$50 for class 4, and US$100 for class 1 and 2.\n\nGoods vehicles more than 10 tonnes but less than 20 tonnes are now required to pay US$200 and more than 20 tonnes US$500, while 10 tonnes or less but with a combination of truck and trailers of more than 15 but less than 20 tonnes US$500.\n\nResponding to these new taxes Tuesday, Tsvangirayi warned that this will only drive up the prices of goods and services while worsening poverty.\n\nThe new presumptive taxes introduced by ZIMRA are unfair and will have a direct negative impact on the most vulnerable in our society.\n\nSalaries have remained stagnant, yet taxes continue to rise, pushing the cost of goods and services beyond the reach of many. This will only deepen poverty, running contrary to the SDGs, particularly the goal of eradicating poverty, as well as the objectives of NDS1, which seeks to reduce the cost of doing business, Tsvangirayi said.\n\nNorton MP Richard Tsvangirayi\n\nHe also urged ZIMRA to pursue incentive-based strategies to boost compliance instead of punitive measures that threaten livelihoods.\n\nWhile the intention may be to encourage companies to register, formalise their operations, and increase government revenue, alternative strategies must be pursued.\n\nThese strategies should focus on incentivising compliance rather than relying on punitive measures that exacerbate the economic hardships already faced by ordinary citizens. In this regard, ZIMRA must urgently revise these figures downwards to ensure fairness and protect livelihoods.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/04/06225722/zimra-taxes.jpg",
            "description": "<p>By Staff Reporter The Zimbabwe Revenue Authority (ZIMRA)’s newly introduced presumptive taxes will burden vulnerable citizens already struggling with stagnant salaries and rising living costs, Norton legislator Richard Tsvangirayi has said. ZIMRA yesterday announced new presumptive vehicle taxes, which go up to as much as US$500. The new presumptive monthly taxes are as follows: commuter</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimras-new-presumptive-vehicle-taxes-could-push-prices-up-worsen-poverty-legislator/\">ZIMRA’s new presumptive vehicle taxes could push prices up, worsen poverty – legislator</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "10 Sep 2025"
        },
        {
            "title": "Rasta the Artist: From sketching Mandela, honouring legends and painting Africa’s heritage",
            "url": "https://www.newzimbabwe.com/rasta-the-artist-from-sketching-mandela-honouring-legends-and-painting-africas-heritage/",
            "content": "By Jonisayi Maromo | IOL\n\nSeptember isHeritage Month in South Africa a time to celebrate the nations cultural diversity, traditions, and stories that shape its identity. Few artists embody that spirit more than Lebani Rasta Sirenje, a painter whose bold portraits of iconic figures have made him one of the most recognisable cultural voices in the country.\n\nIm Lebani David Thaka Sirenje, born in Zimbabwe, Bulawayo in Pumula East, born to a Zimbabwean mother and a Mozambican father. I grew up in Bulawayo, went to Ingwegwe Primary School, and high schooled at Magwegwe Secondary School. My love for art started when I was in primary school at seven years, when I saw myself doing sketches at school and impressing my classmates who liked my art, he recalls.\n\nHis grandmother, MamMhlanga, played a key role in shaping his artistic path.\n\nIt is my grandmothers love for art that kept me going. She used to come from the rural areas of Zimnyama in Plumtree to buy fabrics from Bulawayo, so I would sketch on those materials and she would follow with different colours of wool and make beautiful designs. I would go with her to those villages to sell, and also design their mud huts with prints like Gogo Esther Mahlangus art.\n\nAs Im doing art now, Im so happy and always treasure the love that was shown by my granny. She always said Im gonna be a big artist. I dont think she meant this big  wayesho nje ukuthi ngizoba ngumdwebi  and I went all out and became this big. Unfortunately, she never saw me escalating to these heights of art, says Rasta.\n\nRasta the Artist with his painting of former president Nelson Mandela.\n\nRastas fame began in high school, when he sketched a portrait of Nelson Mandela straight from a television screen.\n\nMy fame rose from high school when I sketched the former president Nelson Mandela, copying it from a TV screen. I took it to my class, they showed my teacher, then my teacher took it to the principal. I had to explain to myself how I did it. It felt as if I did something wrong, but I was cheered, and the whole school was amazed. We were not familiar with his face, and I illustrated Mandela. If there were socials back then, I was gonna trend, he says.\n\nFrom that moment, he realised the power of his art to connect people with history.\n\nIm inspired by daily living and people who are doing great in our lifetime, as I paint those who have passed on and those who are here with us, making a difference in our lives, to celebrate them as well when they are still alive.\n\nIt started when I saw a gap in that kind of honoring. As we put tombstones on their tombs, for me, it is to do a painting that will last in their lives and be treasured for generations to come. I painted the late Brenda Fassie, Walter Sisulu way back in 2003. So it started way back, even before socials, to say Im not here for trends but for the culture I created.\n\nHis work has since gained global recognition.\n\nI even see some artists as well doing art when there is a legend who has passed on. Good turn up to the creatives, as Im the one to remember. When you raise art, other artists applaud me and say you are great, you set the bar, they follow. Im popular in all the corners of the world, and you will hear a chat about me and my art. Im impressed that I will leave a legacy  from sketchbooks to history books, says Rasta.\n\nFor Rasta, Heritage Month is more than a calendar event  its a reminder of identity, pride, and unity. In this picture, the popular artist is seen with his portrait for Winnie Mandela Image: Rasta the Artist\n\nBeyond galleries, Rastas work has made its way into film, television, and advertising.\n\nIm featured in musical videos, films, and adverts. I did paintings in theGomorafilm and featured in the film. I didDiepCity, where I painted the late Brenda Fassie, HHP, Mandoza on a background wall, and other paintings that were at the bar. It was a big project from Black Brain. They called me again to do the walls in the rooms ofBlack Doorfilm.\n\nI did aChicken Licken advert if there were awards for adverts, I was gonna take an award hahaha. I did a Ballantines Whiskey advert as well. Im looking forward to getting these calls again and being seen doing this other kind of art, he says.\n\nBut his creativity goes beyond painting.\n\nAt a young age, I thought I was gonna be a singer as I was in the school choir and an athlete in long-distance marathon at school. Later on, we formed our own group of isicathamiya where we sang in events as young as 14 years. I still have that passion. I hope I will have a chance and go to the studio and record a song in my career. I have to do that  watch this space, Rasta laughs.\n\nFor Rasta, Heritage Month is more than a calendar event  its a reminder of identity, pride, and unity.\n\nHeritage means Imvelaphi (origin)  our culture, our religion, our beings. Its a pity that we only consider and touch our roots once a year in this month, where we wear our different traditional attire, and show the world how we love and embrace our culture.\n\nAs an artist, I get touched and wish that we can always have our cultures meet regularly, not only during Heritage Month or Heritage Day. Lets hope one day this can be recognized every month. Its so good when we see our different attire collaborating, and those colourful beads that are worn  they are closer to our being as Africans, we are proud.\n\nRasta the artist seen here with his painting of EFF leader Julius Malema. Image: Rasta the Artist\n\nAlso in art it fits. We see a lot of exhibitions, art being involved to honour these days of our Heritage Month, he says.\n\nAnd his message for Africans is clear:\n\nAfricans, lets hold hands and stand tall. This is us. No tribalism, no xenophobia acts in oneself. We are all one, Rasta declares.\n\nLooking ahead, Rasta dreams of creating an academy to nurture young artists.\n\nI wish and hope one day I will have an initiative that will cater to young upcoming artists in music, acting, craft, and visual art  an academy with a gallery to hang works for upcoming artists so they get a chance to show their works.\n\nAs a community, we need to lift one another to flourish. Im so proud to say one day I will fulfil my dreams and see artists being respected and honoured as well. I need a sponsor so we can break ground and have the building where we will create jobs and take all the youth out of the streets, and give them something to do. Skills save the lives of our youth.\n\nIn my community, there are kids and youth who ask me when I am opening my academy. Im worried because I dont have an answer. I use my own materials to help these young artists do art. Way back, I had a sponsor, I had a class in Hillbrow Theatre, Hillbrow Recreation Centre, and Mother Johnsons place in Hillbrow, but I was overpowered by a lack of funding. It was not easy to say they have to pay.\n\nI need help to get a proper studio where I work. Its not good to display my art and have a class at the same time, says Rasta.\n\njonisayi.maromo@iol.co.za\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/09171915/rasta.png",
            "description": "<p>By Jonisayi Maromo | IOL September is Heritage Month in South Africa — a time to celebrate the nation’s cultural diversity, traditions, and stories that shape its identity. Few artists embody that spirit more than Lebani “Rasta” Sirenje, a painter whose bold portraits of iconic figures have made him one of the most recognisable cultural voices in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rasta-the-artist-from-sketching-mandela-honouring-legends-and-painting-africas-heritage/\">Rasta the Artist: From sketching Mandela, honouring legends and painting Africa’s heritage</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "10 Sep 2025"
        },
        {
            "title": "High Court jails businessman Maburutse for contempt in bitter feud over Matebeleland Engineering (Pvt) Ltd",
            "url": "https://www.newzimbabwe.com/high-court-jails-businessman-maburutse-for-contempt-in-bitter-feud-over-matebeleland-engineering-pvt-ltd/",
            "content": "By Mary Taruvinga\n\nThe High Court has found businessman Regis Maburutse in contempt of court and sentenced him to six months in prison, wholly suspended on condition he complies with a 2023 order barring him from interfering in the affairs of Matebeleland Engineering (Pvt) Ltd.\n\nJustice Regis Dembure ruled that Maburutse had wilfully and blatantly defied an earlier judgment by Justice Gladys Mhuri, which interdicted him from disrupting fellow director and shareholder Tony Renato Sarpo.\n\nThe 1st respondent continues to hold himself out as such [a director], blatantly illegally, and continues to usurp the functions of the board, Sarpo told the court in his affidavit, accusing Maburutse of forging records, harassing employees and even rebranding the companys signage in Harare and Bulawayo under new names in a bid to sidestep the order.\n\nMaburutses legal defence collapsed after the court struck out his opposing affidavit, ruling it had been improperly commissioned. Justice Dembure declared, Once an affidavit is found to have been improperly commissioned, it is a nullity. Nothing can flow from it.\n\nThe court accepted Sarpos claims as unchallenged and stressed that its authority had to be respected. The application must succeed as against the first respondent, Dembure ruled.\n\nIn contrast, Wayne Williams, cited as the second respondent, was cleared of contempt. The judge found the 2023 order imposed no clear obligations on him.\n\nThere can be no contempt of court to talk about in these circumstances, he said.\n\nThe ruling marks another dramatic twist in the long-running shareholder war over Matebeleland Engineering, a dispute that has seen allegations of forgery, asset stripping, and multiple appeals  most of which Sarpo has won.\n\nMaburutse will avoid prison if he immediately complies with the High Court order, but Justice Dembure warned that continued defiance would trigger the six-month custodial sentence at Chikurubi Maximum Prison.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/13181521/high-court-of-zimbabwe-3.jpg",
            "description": "<p>By Mary Taruvinga The High Court has found businessman Regis Maburutse in contempt of court and sentenced him to six months in prison, wholly suspended on condition he complies with a 2023 order barring him from interfering in the affairs of Matebeleland Engineering (Pvt) Ltd. Justice Regis Dembure ruled that Maburutse had “wilfully and blatantly”</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-jails-businessman-maburutse-for-contempt-in-bitter-feud-over-matebeleland-engineering-pvt-ltd/\">High Court jails businessman Maburutse for contempt in bitter feud over Matebeleland Engineering (Pvt) Ltd</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "10 Sep 2025"
        },
        {
            "title": "High Court rejects murder suspect’s bid for discharge, rules there is a case to answer",
            "url": "https://www.newzimbabwe.com/high-court-rejects-murder-suspects-bid-for-discharge-rules-there-is-a-case-to-answer/",
            "content": "By Mary Taruvinga\n\nA man accused of fatally assaulting another in Damofalls last December has been ordered to stand trial after the High Court refused to dismiss his case, ruling that the State had established a prima facie case against him.\n\nJustice Gibson Mandaza dismissed Wairo Wairos application for discharge at the close of the States case, saying evidence from witnesses linked him directly to the death of David Sengai, who died after being severely beaten.\n\nAt this stage of the proceedings, the simple question is: on the record, is there evidence against the accused person which requires a reply from him? I take the view that indeed there is evidence before the court, the judge said.\n\nWairo is charged with murder under section 47(1) of the Criminal Law (Codification and Reform) Act. Prosecutors allege that on 23 December 2023, Wairo and three accomplices assaulted Sengai with open hands and fists, causing head injuries from which he later died.\n\nKey witness Noleen Goro, who once dated the accused, told the court she saw Wairo slapping Sengai so hard he fell to the ground while others dragged him by his shirt. She later called a passerby, Tafadzwa Paundi, to help the victim.\n\nDefence lawyers attacked Goros credibility, calling her a self-confessed alcoholic, but the judge found her testimony consistent with that of the investigating officer and Paundi. Calling her names does not detract from her testimony, which is consistent, Mandaza J ruled.\n\nThe judge stressed that at this stage the State was only required to show a prima facie case, not proof beyond reasonable doubt. Once a prima facie case has been established, the evidential burden will shift to the accused to adduce evidence in order to escape conviction, he said.\n\nThe trial will now proceed to the defence case, with Wairo expected to answer to the murder charge.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg",
            "description": "<p>By Mary Taruvinga A man accused of fatally assaulting another in Damofalls last December has been ordered to stand trial after the High Court refused to dismiss his case, ruling that the State had established a prima facie case against him. Justice Gibson Mandaza dismissed Wairo Wairo’s application for discharge at the close of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-rejects-murder-suspects-bid-for-discharge-rules-there-is-a-case-to-answer/\">High Court rejects murder suspect’s bid for discharge, rules there is a case to answer</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "10 Sep 2025"
        },
        {
            "title": "Baba Harare returns to Jiti after sour gospel experience",
            "url": "https://www.newzimbabwe.com/baba-harare-returns-to-jiti-after-sour-gospel-experience/",
            "content": "By Tapiwa Svondo\n\nBaba Harare has returned to his Jiti roots, abandoning the gospel path he had pursued for the past year.\n\nThe musician, who a year ago stunned fans by announcing his decision to leave secular music for gospel, revealed the disrespect and exploitation he faced within the gospel industry. He accused some church event organisers of refusing to pay artists after performances.\n\nIn a Facebook post, Baba Harare, who had rebranded himself asKing Davidduring his gospel stint, said many promoters expect gospel musicians to perform for free, arguing that payment shouldnt matter because its for the Kingdom.\n\nIve been blessed to experience both worlds the secular stage and the gospel stage. From a ministerial perspective, gospel concerts are powerful. They spread the Word, they win souls, and they glorify God. But from a business perspective, its a different story.\n\nOften, people hide under the idea that because youre ministering for the Kingdom, payment shouldnt matter. But lets be honest: I am not only a Christian, I am also a human being and an artist. This is my work, my livelihood, and I need to survive beyond the stage, wrote Baba Harare.\n\nHe warned upcoming musicians not to rely solely on gospel shows, citing widespread exploitation.\n\nI would not advise any upcoming artist to rely exclusively on gospel shows. Too many times Ive been booked to minister at church events and conferences, only to struggle afterwards to recover even my basic expenses.\n\nShame on those who exploit others in the name of Christ. Lets do better as a community.\n\nThe musician also shared a flyer from a recent gospel event where, after performing, he was met with rudeness when he followed up on a promised payment.\n\nLet me give you a recent example. On Friday, I went to minister at a church (see flyer attached). I didnt charge them a performance fee. All I asked for was a token of $200 to cover my fuel and expenses. Instead of being met with understanding, I was met with rudeness. Suddenly, I was no longer a brother in Christ, but mocked and called a comrade (screenshot attached).\n\nThis is not Kingdom behaviour. This is not how we build each other. And its one of the reasons the gospel industry struggles to move forward,lack of respect, lack of accountability, and non-payment of artists.\n\nIm not posting this to attack anyone, but to spark a real conversation. We dont talk about this enough. If youre a promoter, a church, or an organiser, please do better. Honour your word. Respect the artist. Support the ministry in every sense, said Baba Harare.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/01103128/Baba-Harare.webp",
            "description": "<p>By Tapiwa Svondo Baba Harare has returned to his Jiti roots, abandoning the gospel path he had pursued for the past year. The musician, who a year ago stunned fans by announcing his decision to leave secular music for gospel, revealed the “disrespect” and exploitation he faced within the gospel industry. He accused some church</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/baba-harare-returns-to-jiti-after-sour-gospel-experience/\">Baba Harare returns to Jiti after sour gospel experience</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "10 Sep 2025"
        }
    ]
}