{
    "news": [
        {
            "title": "Soccer legend Moses Chunga appointed Chegutu Pirates coach",
            "url": "https://www.newzimbabwe.com/soccer-legend-moses-chunga-appointed-chegutu-pirates-coach/",
            "content": "By Sport Reporter\n\nFormer Premier Soccer League side Chegutu Pirates have appointedMoses Chunga as head coach.\n\nZaire will be hoping to make an immediate top-flight league return after being relegated during the 2024 season.\n\nChunga is set to lead Chegutu Pirates in the Northern Region Division One League where title winners will grab the promotion ticket.\n\nChegutu Pirates FC is thrilled to announce the appointment of Moses Chunga as the teams head coach for the 2025 season.\n\nThe club warmly welcomes Chunga and is confident that his leadership will drive the team to new heights.\n\nThe club and its fans are eagerly anticipating the positive impactChunga will have on the squad, read part of Chegutu Pirates statement.\n\nWith his extensive experience and dedication, the future looks bright for Chegutu Pirates.\n\nChunga has a rich coaching history which sawhim leading several local football teams, amongst those Dynamos and CAPS United.\n\nIn 2009, the Warriors legend won the league title with the Gunners as head coach.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/05052236/FB_IMG_1738688621298.jpg",
            "description": "<p>By Sport Reporter Former Premier Soccer League side Chegutu Pirates have appointed Moses Chunga as head coach. Zaire will be hoping to make an immediate top-flight league return after being relegated during the 2024 season. Chunga is set to lead Chegutu Pirates in the Northern Region Division One League where title winners will grab the promotion</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/soccer-legend-moses-chunga-appointed-chegutu-pirates-coach/\">Soccer legend Moses Chunga appointed Chegutu Pirates coach</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "05 Feb 2025"
        },
        {
            "title": "Mighty Warriors to receive daily allowances from ZIFA while in camp",
            "url": "https://www.newzimbabwe.com/mighty-warriors-to-receive-daily-allowances-from-zifa-while-in-camp/",
            "content": "By Sport Reporter\n\nZimbabwe senior womens football team started their first training session on Tuesday morning with smiles on theirfaces after being assured of daily allowances in camp.\n\nThe Mighty Warriors will be enjoying the same privilege which was only reserved for the Warriors in previous years.\n\nThe new development was revealed ahead of the teams morning training session on Tuesday which saw the new ZIFA president Nqobile Magwizi together with board member Kudzai Kadzombe visiting for an assessment.\n\nAddressing the players, the new ZIFA board promised to push for equality during their era.\n\nNew ZIFA president Nqobile Magwizi and board member Kudzai Kadzombe addressing players\n\nWe are hopeful that you will take Zimbabwe to greater heights through your talents.\n\nYou have our full and undivided support as you go for this campaign.\n\nYou will no longer be treated as second-class citizens as before, said Kadzombe.\n\nAccording to sources, Mighty Warriors wrote to the new board requesting several things including the allowances.\n\nZimbabwe will camp for two weeks before they leave for Angola for a Womens AFCON Qualifiers match against the host in Luanda on February 22.\n\nThis will be followed up by a return fixture scheduled for February 26 at Lucas Moripe Stadium in South Africa.\n\nGender equality has been an issue at ZIFA, in previous years Mighty Warriors used to struggle for accommodation during their days in camp while the Warriors were being booked in five-star hotels.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/05051611/mighty-warriora.jpeg",
            "description": "<p>By Sport Reporter Zimbabwe senior women’s football team started their first training session on Tuesday morning with smiles on their faces after being assured of daily allowances in camp. The Mighty Warriors will be enjoying the same privilege which was only reserved for the Warriors in previous years. The new development was revealed ahead of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mighty-warriors-to-receive-daily-allowances-from-zifa-while-in-camp/\">Mighty Warriors to receive daily allowances from ZIFA while in camp</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "05 Feb 2025"
        },
        {
            "title": "Simba Bhora coach impressed by team’s performance",
            "url": "https://www.newzimbabwe.com/simba-bhora-coach-impressed-by-teams-performance/",
            "content": "By Sport Reporter\n\nSimba Bhora coach Joel Lupahla is impressed with his teams performance in South Africa, where they are going through their pre-season training camp.\n\nThe reigning league champions will stay in South Africa for two weeks and have already kicked off five days.\n\nWith a lot of battle fronts awaiting them this season, the club opted to do a pre-season camp in a foreign land to give the squad exposure ahead of their inaugural dance in the CAF Champions League later this year.\n\nIn South Africa, Simba is testing its strength by playing several South African clubs, and coach Lupahla has praised his charges for a good show.\n\nWe have only played one game versus Baroka, the South Africans are miles ahead in terms of technique but I am proud of the boys because we fought hard.\n\nWe gave them a good run and I as the coach was also impressed especially with their ball artistry they did well we dominated play and scored a beautiful team goal and those are signs of great things to come, said Lupahla.\n\nThe Shamva-based side is currently going through a rebuilding process after a mass exodus, which saw them losing 13 players.\n\nOther than losing players, the team also parted ways with title-winning coach Tonderai Ndiraya, who was since replaced by Lupahla.\n\nSharing his assessment of the rebuilding process, Lupahla said everything is shaping up.\n\nThe pre-season so far has been great we thank our management for sacrificing hard-earned money to bring us here but it wont be in vain as this has made us gel within a short space of time.\n\nRemember we brought in a lot of players and that is unheard of in a soccer setup but we had to plug in the gap.\n\nIt needed that players gel in and in Harare it was going to be hard as players just come to train and go back home but here we have managed to stay together and share rooms with different players and that alone brings together the unity we want, added Lupahla.\n\nSimba Bhora is set to play Dynamos on the 22nd of February in a Castle Challenge Cup match scheduled to be played at Rufaro.\n\nServing as a curtain raiser to the 2025 league season, the traditional fixture is played by defending league champions and Chibuku Super Cup title holders.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/03/25165900/Joel-Luphahla.jpg",
            "description": "<p>By Sport Reporter Simba Bhora coach Joel Lupahla is impressed with his team’s performance in South Africa, where they are going through their pre-season training camp. The reigning league champions will stay in South Africa for two weeks and have already kicked off five days. With a lot of battle fronts awaiting them this season,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/simba-bhora-coach-impressed-by-teams-performance/\">Simba Bhora coach impressed by team’s performance</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "05 Feb 2025"
        },
        {
            "title": "Woman jailed 5 years for trafficking day-old baby",
            "url": "https://www.newzimbabwe.com/woman-jailed-5-years-for-trafficking-day-old-baby/",
            "content": "By Staff Reporter\n\nA HARARE magistrate has sentenced a woman to five years imprisonment for trafficking a two-day-old baby from South Africa to Zimbabwe.\n\nThe accused person, Janet Maromo was found guilty of contravening the Trafficking ln Persons Act after illegally transporting the baby across the borders of the neighbouring countries.\n\nThe court heard that the biological mother of the baby sold the infant to Maromo for an undisclosed amount. The accused person later travelled with the minor from South Africa into Zimbabwe.\n\nIn passing the sentence, the presiding magistrate found special circumstances in the matter, including the offenders bona fide mistake about adoption laws in both countries.\n\nIn addition, the court observed Maromos lack of sophistication and the role of the biological mother in influencing her actions.\n\nMaromo will serve an effective five years behind bars.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/13080322/baby-feet.jpg",
            "description": "<p>By Staff Reporter A HARARE magistrate has sentenced a woman to five years imprisonment for trafficking a two-day-old baby from South Africa to Zimbabwe. The accused person, Janet Maromo was found guilty of contravening the Trafficking ln Persons Act after illegally transporting the baby across the borders of the neighbouring countries. The court heard that</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/woman-jailed-5-years-for-trafficking-day-old-baby/\">Woman jailed 5 years for trafficking day-old baby </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "05 Feb 2025"
        },
        {
            "title": "Rapist ‘prophet’ preys on female congregant",
            "url": "https://www.newzimbabwe.com/rapist-prophet-preys-on-female-congregant/",
            "content": "By Staff Reporter\n\nA SELF-styled prophet has been dragged before the Murehwa Magistrates Court for allegedly raping a female congregant.\n\nState case is that sometime in May 2023, the 55-year-old man of cloth from Chief Nyajina area of Uzumba gave a prophecy that complainant, who was a fellow congregant at the church, would have fertility problems.\n\nThe accused person then invited the woman to his place of residence allegedly for prayers to reverse the supposed curse.\n\nTwo weeks later, complainant proceeded to the self-proclaimed healers homestead, where she stayed for three days.\n\nThe court heard that on the third day, she was instructed to wake up at midnight for a prayer and she complied. While praying, prophet told complainant that she had a foreign object in her womb, which could only be removed by having sexual intercourse with him.\n\nFurther, accused person threatened complainant would die if she refused to comply, before raping her.\n\nThe matter only came to light on February 1, 2025 when prophet asked the complainants husband to allow her to return to his house for further healing prayers. The complainant refused saying the prophet had once raped her.\n\nA police report was made, leading to the accused persons arrest.\n\nThe matter was remanded to February 17, 2025, for routine remand.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/18210835/Rape.jpg",
            "description": "<p>By Staff Reporter A SELF-styled prophet has been dragged before the Murehwa Magistrates’ Court for allegedly raping a female congregant. State case is that sometime in May 2023, the 55-year-old man of cloth from Chief Nyajina area of Uzumba gave a prophecy that complainant, who was a fellow congregant at the church, would have fertility</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rapist-prophet-preys-on-female-congregant/\">Rapist ‘prophet’ preys on female congregant </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "05 Feb 2025"
        },
        {
            "title": "Exports push Seed Co revenue to 43%",
            "url": "https://www.newzimbabwe.com/exports-push-seed-co-revenue-to-43/",
            "content": "By Alois Vinga\n\nEXPORTS have soared Seed Cos revenues by 48% on the back of plans to leverage both domestic and regional sales for future growth.\n\nPresenting a trading update for the third quarter period ended December 31 2024, the seed manufacturer said growth was largely driven by exports.\n\nThe business delivered a strong Q3, with revenue up 48%, driven by higher volumes and record exports amid drought-induced stockouts across the regions. The performance was largely driven by a strong stock carry-over position from the previous season, said the company.\n\nThe company said Zimbabwes economy remains moderately subdued, against a backdrop of a delayed and patchy rainfall pattern that continues to disrupt the sector performance.\n\nIt however expressed confidence in the efforts of authorities who are actively working to mitigate these issues.\n\nThe business sold 26 919 MT in the third quarter of 2025 compared to 18 520 MT sold during the comparative period last year.\n\nRevenue of US$62,7 million was realized up from US$42,5 million recorded in the comparative period. Subsequently, an operating profit of US$25,8 million was achieved, recording a significant increase of 25% from US$20,7 million realized last year.\n\nThe Company remains resilient, leveraging on domestic demand and regional opportunities to close the year strong. As we prepare for the winter cereal season, we are seizing opportunities through market expansion initiatives and operational excellence, added Seed Co.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/09/02191556/Seedco1.jpg",
            "description": "<p>By Alois Vinga EXPORTS have soared Seed Co’s revenues by 48% on the back of plans to leverage both domestic and regional sales for future growth. Presenting a trading update for the third quarter period ended December 31 2024, the seed manufacturer said growth was largely driven by exports. “The business delivered a strong Q3,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/exports-push-seed-co-revenue-to-43/\">Exports push Seed Co revenue to 43%</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "05 Feb 2025"
        },
        {
            "title": "ZACC clashes with NPA over Chisango’s acquittal in US$9 million streetlights tender scandal; to prefer new criminal charges",
            "url": "https://www.newzimbabwe.com/zacc-clashes-with-npa-over-chisangos-acquittal-in-us9-million-streetlights-tender-scandal-to-prefer-new-criminal-charges/",
            "content": "By Mary Taruvinga\n\nThe Zimbabwe Anti-Corruption Commission (ZACC) has said will be casting new criminal charges against former Harare Town clerk Josiah Chisango and four top officials who were acquitted by the State in a US$9 million streetlights scandal last Friday.\n\nOn Friday the National Prosecuting Authority (NPA) withdrew charges against Chisango and his four colleagues Never Murerwa the Supply Chain Manager, Denford Zhungu Principal Accountant, Tawanda Mutenhabundo the Engineering Technician and Artikins Mandaza Principal Contracts Administrator before plea.\n\nThe charges against Jabulani Mukomazi, the principal buyer were not withdrawn and he was indicted for trial commencing on March 10 2025 at the High Court.\n\nThe group was accused of facilitating the US$9 million streetlights tender deal in favour of a company owned by Moses Mpofu and Mike Chimombe, Juluka Endo.\n\nMpofu and Chimombe are currently locked up over the tender scam and another one involving goats.\n\nProvincial Public Prosecutor Witness Mabhaudhi said he didnt see anything wrong which all the other officials had done except for Mukomazi.\n\nThe signed agreement between the City of Harare and Juluka was a nullity at law and the principal buyer, who had the duty to proceed by way of section 31 of PPDPA Act but chose to proceed by way of Section 34, attracted the criminal liability, he said.\n\nFrom the foregoing it is apparent that we know who committed the offence and there is no need for nitpicking in order to enlarge the group.\n\nIt was the principal buyer who misrepresented that he had been authorised by PRAZ to do what he did and there is no evidence that he committed the offence in association with any other person.\n\nProsecuting the present accused persons will be an exercise in futility, theres no prima facie against the accused persons.\n\nBright prospects of a conviction are there in respect of the principal buyer, that is how the State will proceed, Mabhaudhi said.\n\nFollowing the withdrawal of charges, there has been so much criticism over how Chisango and his colleagues were absolved of wrongdoing.\n\nZACCsaid it is not happy with the NPAs decision further noting that the five should have theirday in court.\n\nZACC respects the position taken by the NPA and acknowledges that it is the mandate of the prosecuting authority to institute and manage criminal prosecutions in Zimbabwe.\n\nThe Commission, however, maintains that the accused persons are criminally liable for the fraudulent awarding of the tender and should defend their actions in court.\n\nAccordingly, ZACC is looking into the matter and will be preferring new charges against the five accused persons, it said in a statement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/06/03181857/Hosiah-Chisango-Harare-City-Town-Clerk.jpg",
            "description": "<p>By Mary Taruvinga The Zimbabwe Anti-Corruption Commission (ZACC) has said will be casting new criminal charges against former Harare Town clerk Josiah Chisango and four top officials who were acquitted by the State in a US$9 million streetlights scandal last Friday. On Friday the National Prosecuting Authority (NPA) withdrew charges against Chisango and his four</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zacc-clashes-with-npa-over-chisangos-acquittal-in-us9-million-streetlights-tender-scandal-to-prefer-new-criminal-charges/\">ZACC clashes with NPA over Chisango’s acquittal in US$9 million streetlights tender scandal; to prefer new criminal charges</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "05 Feb 2025"
        },
        {
            "title": "High Court rules HIV no longer deadly, convicts seeking lenient sentences should stop using it as ‘special circumstance’",
            "url": "https://www.newzimbabwe.com/high-court-rules-hiv-no-longer-deadly-convicts-seeking-lenient-sentences-should-stop-using-it-as-special-circumstance/",
            "content": "By Mary Taruvinga\n\nThe High Court has advised convicted criminals to stop raising HIV as a special circumstance during mitigation because the infection is no longer deadly due to advancements in its treatment.\n\nJudges of appeal Justices Munamato Mutevedzi and Naison Chivayo said this while handing down their ruling on an appeal by two convicts who were convicted for unlawful possession of ivory tusks.\n\nBoth convicts whose identity is being withheld because of their HIV status were jailed for 11 and nine years minimum mandatory sentences respectively for the offence.\n\nOne of them was jailed 11 years after it emerged that he was a serial offender.\n\nThey both raised their positive HIV status as a mitigatory factor while seeking a lenient sentence.\n\nThe court said being infected with HIV was not a special circumstance.\n\nThey were general items of mitigation which this court in previous pronouncements has ruled as not constituting special circumstances even when taken cumulatively.\n\nBut perhaps what needs special mention among those is the submission by both appellants that they were infected with HIV, the virus that causes AIDS.\n\nWe were not sure what they wanted to achieve from that, said the judges.\n\nMuch as being HIV positive used to be scary and was viewed by many as terminal, it is a notorious fact, which the court will take judicial notice of, that this is no longer the case.\n\nMany forms of treatment have been developed over the years to mitigate the effects of HIV on humans.\n\nDr Amos had the following to say regarding the previously catastrophic effects of the condition: Treatments used, mean people living with HIV live long and healthy lives because the virus is controlled and its effects on someones health are limited.\n\nThe treatment also brings the level of virus in the body of someone living with HIV down to such low levels that it cant be detected by HIV tests  and this also means that it cant be passed on to someones sexual partners, whether they use condoms or not.\n\nThe judges said in Zimbabwes case, as far back as 1993 when being infected with HIV was still viewed as a death penalty, the High Court in the case of S v Mahachi (1993 2 SACR 36 (Z)), rejected the notion of treating those with HIV as a special category of offenders.\n\nIn its final determination, it held further that because the accused it was sentencing had previous convictions, his state of health was not decisive. It sentenced him to imprisonment regardless of his HIV condition.\n\nI also wish to add that the effects of HIV have since been downgraded to the levels of any other disease and conditions like the common colds, diabetes, and hypertension among others.\n\nIn fact, it is a fact that there are more deadly infections and diseases than HIV.\n\nIt is time therefore that people accused of crime must stop seeking special sentences in the guise of their HIV statuses because their conditions are no different from other illnesses.\n\nThe courts will view that as nothing but an abuse of ones medical condition.\n\nFor the avoidance of doubt, being HIV positive, like any other ailment, and without more is not a special circumstance warranting a court to depart from imposing a prescribed minimum sentence on an offender, said Mutevedzi.\n\nHe said the lower court was correct to impose the minimum mandatory eleven years on him regardless of his HIV condition.\n\nEqually the sentence of nine years imprisonment imposed on the second appellant was an appropriate one, they ruled.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/03/06230138/HIV-web-image-1050x650.jpg",
            "description": "<p>By Mary Taruvinga The High Court has advised convicted criminals to stop raising HIV as a special circumstance during mitigation because the infection is no longer deadly due to advancements in its treatment. Judges of appeal Justices Munamato Mutevedzi and Naison Chivayo said this while handing down their ruling on an appeal by two convicts</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-rules-hiv-no-longer-deadly-convicts-seeking-lenient-sentences-should-stop-using-it-as-special-circumstance/\">High Court rules HIV no longer deadly, convicts seeking lenient sentences should stop using it as ‘special circumstance’   </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "05 Feb 2025"
        },
        {
            "title": "Harare Commission of Inquiry: Mayor Mafume suspends top council official who accused him of nepotism, corruption",
            "url": "https://www.newzimbabwe.com/harare-commission-of-inquiry-mayor-mafume-suspends-top-council-official-who-accused-him-of-nepotism-corruption/",
            "content": "By Darlington Gatsi\n\nHARARE City Council (HCC) Executive AssistantTown Clerk, Mathew Marara has made foes at the Town House following his blunt testimony at the ongoing commission of inquiry, with officials baying for his blood.\n\nMarara recently appeared at the Commission of Inquiry investigating operations at the HCC, with his testimony implicating top officials in corruption that has become pervasive at Town House.\n\nIn the aftermath of his appearance before the Commission, a directive to suspend Marara was issued by the Acting Human Capital Director, Bosman Matengarufu, with theorder from Mayor Jacob Mafume.\n\nHowever, the suspension could not be carried out as the acting town clerk, Phakamile Mabhena Moyo refused to append his signature citing the ambiguity of the Council resolution, upon which it was based.\n\nAppearing before the retired Justice Maphios Cheda-led Commission of Inquiry Tuesday, Mabhena Moyo said, I thought there were still some issues that were still going through Council and I did not have a council resolution to effect the contents of the documents. There was a specific resolution that he should be suspended. Usually, I am guided by Council resolutions, I did not have a specific resolution on this one, said Mabhena Moyo.\n\nRELATED:\n\nThe tensions at Town House are so high that Marara, Tuesday, gave his testimony before the Commission of Inquiry behind closed doors.\n\nIn his last appearance, Marara had painted a grim picture of the HCC with lawlessness and corruption reigning supreme.\n\nDeath threats, and attempted murder through poisoning have been reported as officials cover their tracks of corruption.\n\nMatthew Marara\n\nMarara rose to his current position in which he is earning US$12,000 in unclear circumstances.\n\nMabhena Moyo implicated the councillors in the plot to oust Marara who has become a detested figure at the HCC.\n\nMatengarufu said he was being pressured to effect the resolution of 18th of December which was very ambiguous. Pressured by councillors and policymakers. From his side, it was coming from human resources committee members and probably the Mayor, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/18055321/Mafume-Mayor.jpeg",
            "description": "<p>By Darlington Gatsi HARARE City Council (HCC) Executive Assistant Town Clerk, Mathew Marara has made foes at the Town House following his blunt testimony at the ongoing commission of inquiry, with officials baying for his blood. Marara recently appeared at the Commission of Inquiry investigating operations at the HCC, with his testimony implicating top officials in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-commission-of-inquiry-mayor-mafume-suspends-top-council-official-who-accused-him-of-nepotism-corruption/\">Harare Commission of Inquiry: Mayor Mafume suspends top council official who accused him of nepotism, corruption</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "05 Feb 2025"
        },
        {
            "title": "Tatenda Taibu pumped for return of full Test cricket schedule for Zimbabwe",
            "url": "https://www.newzimbabwe.com/tatenda-taibu-pumped-for-return-of-full-test-cricket-schedule-for-zimbabwe/",
            "content": "Legendary Zimbabwe cricketerTatenda Taibuis excited that his nation will once more be playing regular Test cricket in 2025.\n\nThe 41-year-old who played 195 matches for Zimbabwe combined across all formats, was reacting to the news that the Southern African nation is scheduled to play nine Tests in 2025.\n\nTheir schedule includes playing England in May on their home turf for the first time in 22 years, before they host South Africa and New Zealand in Zimbabwe.\n\nWith Zimbabwe not currently included among the nine teams competing in the World Test Championship (WTC), a revitalised scheduled will do much to plead their case to be included among the top nations in the future.\n\nI commend them for doing this. Test cricket was always big in Zimbabwe, but the country went through problems [in the mid-2000s], we didnt play for six years [2005-2011] and started again, Taibu toldSportsboom.com.\n\nZimbabwe has not gone down because they love Test cricket. You have youngsters who want to play Test cricket as a profession, knowing that the coaching will be expensive.\n\nTaibu who played 150 One-Day Internationals and 28 Tests for Zimbabwe, was, however, concerned about the development of cricket in the country.\n\nThe country has been going through economic problems. It plays a role in the development of any sport. I dont think the administrators have made a concerted effort to find new cricketers who are better than before. If you have 10,000 cricketers in the country, increasing the number to 15,000 increases your chances of quality.\n\nYou need to spread cricket to the rural areas; thats where most of the numbers are. You will find the guys scoring hundreds and taking fifers. You will feel like following those players to other games. While you are watching them, you may spot someone else. Then you put all the diamonds and gold in one place, and then only you can unearth someone like Andy Flower.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/05040828/FILE-Former-Zimbabwe-cricketer-Tatenda-Taibu-has-welcomed-the-return-of-regular-Test-cricket-for-his-country-Seen-here-Taibu-during-his-playing-days-for-Zimabwe-Picture-Deshakalyan-Chowdhury-AFP.webp",
            "description": "<p>Legendary Zimbabwe cricketer Tatenda Taibu is excited that his nation will once more be playing regular Test cricket in 2025. The 41-year-old who played 195 matches for Zimbabwe combined across all formats, was reacting to the news that the Southern African nation is scheduled to play nine Tests in 2025. Their schedule includes playing England in May</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tatenda-taibu-pumped-for-return-of-full-test-cricket-schedule-for-zimbabwe/\">Tatenda Taibu pumped for return of full Test cricket schedule for Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "05 Feb 2025"
        }
    ]
}