{
    "news": [
        {
            "title": "Delayed govt payments force Bitumen World to cut jobs",
            "url": "https://www.newzimbabwe.com/delayed-govt-payments-force-bitumen-world-to-cut-jobs/",
            "content": "By Alois Vinga\n\nDELAYED payments to government contractors have left one of the countrys top construction companies, Bitumen World (BW), with no choice but to cut down jobs.\n\nProblems bedevilling the construction sector are not new, following endless pleading for authorities to consider timely payments for work done in fulfilment of the governments agenda to revamp the countrys infrastructure.\n\nMarket watchers believe the government is withholding the payments, especially in the local ZWG currency, in a bid to curtail parallel market activities, which trigger depreciation. Just recently, mineral exporting companies revealed that the central bank has not been paying their 30% export surrender in local currency.\n\nThe latest decision by Bitumen Worlddemonstrates the authorities appetite to uphold currency stability even at the cost of other critical economic imperatives.\n\nThe Zimbabwean government, one of the companys largest debtors, is experiencing significant challenges in making timely payments to its contractors. The government is facing delays in settling arrears, affecting various projects, including road rehabilitation and dam construction.\n\nWhile efforts are underway to establish payment plans and small payments have been received, these financial constraints have contributed to the companys decision to realign its operations to remain resilient in a challenging fiscal environment, said the company.\n\nThe company said this necessary transition reflects a committed effort to adapt to the current economic challenges, including operating under cash flow pressures caused by delayed payments from clients.\n\nBW said it recognises and deeply values the dedication and professionalism of all its employees and is committed to handling the process with respect, transparency, and dignity, offering support to those affected through severance packages and transition assistance.\n\nBW CEO, Andre Zietsman, said the decision has been very tough but had to be made due to limited options at hand.\n\nOver recent months, we have engaged in extensive discussions and evaluations to guide Bitumen World through this difficult period. While the decision to restructure was not made lightly, it is essential for ensuring our long-term viability and ability to continue contributing meaningfully to infrastructure development in Zimbabwe and beyond, he said.\n\nHe said the employees who have worked tirelessly to restore the countrys infrastructure glory will, unfortunately, suffer heavy blows when they see their jobs going down the drain.\n\nThe tragedy of these layoffs is that they impact the very people who built this prestigious brand  a brand that was wholly created by Zimbabweans, said Zietsman.\n\nThe company committed to handling the process with respect, transparency, and dignity, offering support to those affected through severance packages and transition assistance.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/20210647/bitumen-world-.jpeg",
            "description": "<p>By Alois Vinga DELAYED payments to government contractors have left one of the country’s top construction companies, Bitumen World (BW), with no choice but to cut down jobs. Problems bedevilling the construction sector are not new, following endless pleading for authorities to consider timely payments for work done in fulfilment of the government’s agenda to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/delayed-govt-payments-force-bitumen-world-to-cut-jobs/\">Delayed govt payments force Bitumen World to cut jobs</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "21 Aug 2025"
        },
        {
            "title": "Chinese cement manufacturing company fined US$5k by EMA, operations stopped",
            "url": "https://www.newzimbabwe.com/chinese-cement-manufacturing-company-fined-us5k-by-ema-operations-stopped/",
            "content": "By Mary Taruvinga\n\nThe Environmental Management Agency (EMA) has ordered Wih-Zim Cement to immediately halt construction of its Magunje plant after inspectors found the company was flouting Environmental Impact Assessment (EIA) conditions, including failure to compensate displaced households.\n\nThe company was also fined US$5,000 for non-compliance, while the project was slapped with an enforcement order, directing that all project implementation activities should be stopped until EIA certificate conditions are adhered to.\n\nIn an inspection report dated July 16, 2025, EMA said the company had implemented the project disregarding EIA certificate conditions of relocation and compensation of affected families.\n\nThe inspection, prompted by a High Court provisional order and community complaints, revealed that at least 20 households lost fields to a diversion road, while one homestead still lies within the project boundary.\n\nLocal leader Village Head Kapere told inspectors that construction works continued after the High Court ruling had ordered to stop all activities until compensation had been done.\n\nThe villagers were represented by Tinashe Chinopfukutwa of the Zimbabwe Lawyers for Human Rights.\n\nInspectors noted that Wih-Zim had already cleared 10 hectares of land, installed a concrete mixer producing 225 cubic meters per hour, and begun constructing staff quarters for 600 workers  all without fulfilling mandatory relocation requirements.\n\nThe agency also found the company had failed to obtain a Communal Lands Occupation Certificate from Hurungwe Rural District Council, another violation of the law.\n\nContinuous monitoring of the project is essential as this is a sensitive high-impact project, EMA said, warning that Wih-Zims cement plant cannot proceed unless affected families are compensated and relocated in line with legal requirements.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/20203029/wihzim.png",
            "description": "<p>By Mary Taruvinga The Environmental Management Agency (EMA) has ordered Wih-Zim Cement to immediately halt construction of its Magunje plant after inspectors found the company was flouting Environmental Impact Assessment (EIA) conditions, including failure to compensate displaced households. The company was also fined  US$5,000 for non-compliance, while the project was slapped with an enforcement order,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chinese-cement-manufacturing-company-fined-us5k-by-ema-operations-stopped/\">Chinese cement manufacturing company fined US$5k by EMA, operations stopped</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "21 Aug 2025"
        },
        {
            "title": "PARLIAMENT: MP calls for govt to scrap passport requirements for SADC countries to promote trade, free movement",
            "url": "https://www.newzimbabwe.com/parliament-mp-calls-for-govt-to-scrap-passport-requirements-for-sadc-countries-to-promote-trade-free-movement/",
            "content": "By Anna Chibamu\n\nOPPOSITION legislator Zivai Mhetu has urged the government to scrap passport requirements for countries within the SADC region in order to promote trade, tourism, and labour mobility.\n\nMhetu told Speaker Jacob Mudenda during a point of national interest on Tuesday that Zimbabwe and its neighbours should adopt a system similar to the European Schengen visa, which allows free travel between member states using only ID cards.\n\nSchengen countries in Europe have boosted trade and mobility through the introduction of the Schengen visa, enabling citizens to travel freely within member states using just ID cards. Closer to home, Namibia and Zambia have recently implemented a similar system, removing the need for passports when travelling between their countries,the Epworth South MP said.\n\nHe further argued that such agreements would ease immigration challenges faced by Zimbabweans and other nationalities living in SADC countries without proper documentation.\n\nFollowing these developments, my prayer is that Zimbabwe does the same to enhance trade, tourism, and labour mobility, while advancing intra-African commerce in line with the African Continental Free Trade Area and SADCs vision of free movement. I urge government to pursue similar agreements with neighbours such as Mozambique, Botswana, Zambia, Malawi, Namibia, and South Africa, to allow our citizens to travel, work, and trade more freely, thereby strengthening both economic opportunities and regional unity, he added.\n\nIn response, Lands Minister Masuka said the government was currently engaging Botswana on the issue, with plans to have the same arrangement with more countries across Africa.\n\nMasuka could, however, not provide a timeline for when the discussions will be concluded, citing that the negotiations involve others (countries), hence deadlines cannot be imposed.\n\nI know that there are current discussions with Botswana, for example, to ensure that movement is enhanced. You will recall that we already have a UniVisa for the KAZA area. So, such negotiations with other countries will continue.\n\nI hope that, eventually, the citizens of African countries will be able to travel freely to the 54 African nations. We have made a start to gather momentum in order to accelerate this regional integration that is already in motion and led by our President, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/20212130/E-gate-at-Victoria-Falls-International-Airport-1024x768-1.jpg",
            "description": "<p>By Anna Chibamu OPPOSITION legislator Zivai Mhetu has urged the government to scrap passport requirements for countries within the SADC region in order to promote trade, tourism, and labour mobility. Mhetu told Speaker Jacob Mudenda during a point of national interest on Tuesday that Zimbabwe and its neighbours should adopt a system similar to the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/parliament-mp-calls-for-govt-to-scrap-passport-requirements-for-sadc-countries-to-promote-trade-free-movement/\">PARLIAMENT: MP calls for govt to scrap passport requirements for SADC countries to promote trade, free movement</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "21 Aug 2025"
        },
        {
            "title": "US strikes deportation deals with Honduras and Uganda",
            "url": "https://www.newzimbabwe.com/us-strikes-deportation-deals-with-honduras-and-uganda/",
            "content": "BBC\n\nThe US has reached bilateral deportation agreements with Honduras and Uganda as part of its crackdown on illegal immigration, according documents obtained by the BBCs US partner CBS.\n\nUganda has agreed to take an unclear number of African and Asian migrants who had claimed asylum on the US-Mexico border, while Honduras will receive several hundred deported people from Spanish-speaking countries, CBS reports.\n\nThe move is part of an attempt by Donald Trumps administration to get more countries to accept deported migrants who are not their own citizens.\n\nHuman rights campaigners have condemned the policy, saying migrants face the risk of being sent to countries where they could be harmed.\n\nUnder the agreement, Uganda has agreed to accept deported migrants as long as they do not have criminal histories, but its unclear how many the country would ultimately take, according to CBS.\n\nHonduras agreed to receive migrants over two years, including families travelling with children, but documents suggest it could decide to accept more.\n\nBoth deals are part of the Trump administrations broader push for deportation arrangements with countries on several continents  including those with controversial human rights records.\n\nSo far, at least a dozen nations have agreed to accept deported migrants from other countries.\n\nLast week, the US State Department announced it had signed a safe third country agreement with Paraguay to share the burden of managing illegal immigration.\n\nThe White House has also been actively courting several African nations, with Rwanda saying earlier this month it will take up to 250 migrants from the US.\n\nA condition of the deal specifies that Rwanda would have the ability to approve each individual proposed for resettlement, a government spokesperson told the BBC.\n\nRwanda has previously been criticised for its human rights record, including the risk that those sent to the East African nation could be deported again to countries where they may face danger.\n\nEarlier this year, Panama and Costa Rica agreed to take in several hundred African and Asian migrants from the US.\n\nGovernment documents show the Trump administration has also approached countries like Ecuador and Spain to receive deported migrants, CBS reported.\n\nSince the start of his second term, Trump has embarked on sweeping efforts to remove undocumented migrants  a key election promise that drew mass support during this campaign.\n\nIn June, the US Supreme Court cleared the way for Trump to resume deportations of migrants to countries other than their homeland without giving them the chance to raise the risks they might face.\n\nAt the time, Justices Sonia Sotomayor, Elena Kagan and Ketanji Brown Jackson dissented from the majority ruling, calling the decision a gross abuse.\n\nUN rights experts and human rights groups have also argued that these removals to a nation that is not the migrants place of origin couldviolate international law.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/05/09203359/Donald-Trump.png",
            "description": "<p>BBC The US has reached bilateral deportation agreements with Honduras and Uganda as part of its crackdown on illegal immigration, according documents obtained by the BBC’s US partner CBS. Uganda has agreed to take an unclear number of African and Asian migrants who had claimed asylum on the US-Mexico border, while Honduras will receive several</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-strikes-deportation-deals-with-honduras-and-uganda/\">US strikes deportation deals with Honduras and Uganda</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "21 Aug 2025"
        },
        {
            "title": "Gems to host Kenya in friendly match",
            "url": "https://www.newzimbabwe.com/gems-to-host-kenya-in-friendly-match/",
            "content": "By Sports Reporter\n\nThe Zimbabwe senior netball team is set to host its Kenyan counterparts for a series of friendly matches next week.\n\nThe Gems friendlies against Kenya are scheduled to run from August 26 to the 30th in Harare.\n\nCurrently, Zimbabwe is in camp at Harare Girls High School as part of preparations for the upcoming friendly games against Kenya.\n\nThe friendly matches are part of the Gems preparations for the Celtic Cup in Scotland, which they will compete in this October.\n\nZimbabwe will be marking its second appearance at the invitational tournament, where they scooped bronze last year.\n\nIn addition to preparing for the Celtic Cup, the Gems are also using the upcoming friendly matches as a build-up to the African Netball Championships, which will be hosted by Malawi in December.\n\nTechnical Team\n\nHead Coach (Gems): Ropafadzo Mutsauki  Harare City Queens\n\nAssistant Coach (Gems): Perpetua Siyachitema  Glow Petroleum\n\nTeam Manager (Gems): Agnes Chiroodza\n\nTeam\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/21044800/netball-zim.jpg",
            "description": "<p>By Sports Reporter The Zimbabwe senior netball team is set to host its Kenyan counterparts for a series of friendly matches next week. The Gems’ friendlies against Kenya are scheduled to run from August 26 to the 30th in Harare. Currently, Zimbabwe is in camp at Harare Girls High School as part of preparations for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/gems-to-host-kenya-in-friendly-match/\">Gems to host Kenya in friendly match</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "21 Aug 2025"
        },
        {
            "title": "Our welfare has worsened – Hwende bemoans poor conditions for MPs",
            "url": "https://www.newzimbabwe.com/our-welfare-has-worsened-hwende-bemoans-poor-conditions-for-mps/",
            "content": "By Staff Reporter\n\nFOR the umpteenth time, Members of Parliament have bemoaned their poor conditions, demanding that the government address their grievances.\n\nSpeaking in the National Assembly recently, opposition MP Chalton Hwende said the welfare of the legislators is worsening.\n\nA month ago, during a workshop in Bulawayo, you promised us that you were going to come to Parliament and address on the issue of the welfare of Members of Parliament.\n\nI noticed that you were not around but since that time, nothing has improved. In fact, it is becoming worse and worse. I just want to remind you of that commitment that you did in Bulawayo, said Hwende.\n\nThe disgruntlement expressed by Hwende is the latest in a series of concerns raised by MPs over their poor welfare, which is marked by the late disbursement of salaries.\n\nThis, according to MPs, has been hindering them from discharging their parliamentary duties in their respective constituencies.\n\nMPs are entitled to allowances, vehicles and Community Development Funds (CDF), which are used on different projects in constituencies.\n\nIn response, the Speaker of the National Assembly, Jacob Mudenda, said the government was in the process of disbursing funds for the welfare of the legislators.\n\nWe have had a meeting with the Hon. Minister of Finance, and the matter is being handled. What is outstanding at the moment, what was paid for and other urgent matters where members were behind, including coupons, is ZWL1.5 million and what we, as Parliament, had indicated to bring all the requirements up to date, we needed ZWL5 million.\n\nI was assured that the balance of ZWL3.5 million should be paid before the end of this month. The Hon. Deputy Minister is here. That is what we have arranged, said Mudenda.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/02/02043546/Chalton-Hwende.jpg",
            "description": "<p>By Staff Reporter FOR the umpteenth time, Members of Parliament have bemoaned their poor conditions, demanding that the government address their grievances. Speaking in the National Assembly recently, opposition MP Chalton Hwende said the welfare of the legislators is worsening. “A month ago, during a workshop in Bulawayo, you promised us that you were going</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/our-welfare-has-worsened-hwende-bemoans-poor-conditions-for-mps/\">Our welfare has worsened – Hwende bemoans poor conditions for MPs</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "21 Aug 2025"
        },
        {
            "title": "Bogus police officer jailed",
            "url": "https://www.newzimbabwe.com/bogus-police-officer-jailed/",
            "content": "By Staff Reporter\n\nA BINDURA court has sentenced a 39-year-old security guard to 14 months imprisonment for masquerading as a police officer.\n\nMohamad Chiroroma appeared at Bindura Magistrates Court facing a charge of impersonating a peace officer.\n\nHe pleaded guilty and was sentenced to 24 months imprisonment, of which 10 months were suspended on condition of good behaviour. He will, therefore, effectively serve 14 months behind bars.\n\nThe court heard that on August 15, 2025, the offender, who worked as a security guard, hatched a plan to pose as a police officer in order to extort money from unsuspecting individuals.\n\nArmed with a police constabulary identification card belonging to a police constable, he approached the victim at her home in Chipadze, Bindura, pretending to be investigating drug-related crimes.\n\nIt was heard that the victim grew suspicious after noticing the face on the identity card did not match the offenders and immediately alerted the police.\n\nDetectives quickly tracked the offender, recovered the fake document from his wallet, leading to his arrest.\n\nThe National Prosecuting Authority of Zimbabwe (NPAZ) said the public should remain vigilant and verify the identity of anyone claiming to be a police officer.\n\nImpersonating law enforcement undermines public trust and will be met with stern punishment, said NPAZ.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/05/31071600/prison-e1559283452384.jpg",
            "description": "<p>By Staff Reporter A BINDURA court has sentenced a 39-year-old security guard to 14 months’ imprisonment for masquerading as a police officer. Mohamad Chiroroma appeared at Bindura Magistrates’ Court facing a charge of impersonating a peace officer. He pleaded guilty and was sentenced to 24 months imprisonment, of which 10 months were suspended on condition</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/bogus-police-officer-jailed/\">Bogus police officer jailed</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "21 Aug 2025"
        },
        {
            "title": "Sol Phenduka suspended from Kaya 959 as ‘internal process’ under way",
            "url": "https://www.newzimbabwe.com/sol-phenduka-suspended-from-kaya-959-as-internal-process-under-way/",
            "content": "TimesLive\n\nRadio personality and podcaster Sol Phenduka has been suspended from Kaya 959. He joined the station on July 1 2022.\n\nSol was on air on Wednesday morning with Sizwe Dhlomo but Kaya 959 released a statement at noon saying he was suspended.\n\nKaya 959 confirms that presenter Sol Phenduka has been placed on suspension with immediate effect. This step has been taken pending the outcome of an internal process currently underway. The station is committed to following due process, and no further details will be shared at this stage.\n\nUpdates will be provided once the internal process has been concluded and a final decision has been reached. Kaya 959 appreciates the understanding of its staff, listeners and stakeholders while this matter is being addressed.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/20183902/sol-phenduka.jpg",
            "description": "<p>TimesLive Radio personality and podcaster Sol Phenduka has been suspended from Kaya 959. He joined the station on July 1 2022. Sol was on air on Wednesday morning with Sizwe Dhlomo but Kaya 959 released a statement at noon saying he was suspended. “Kaya 959 confirms that presenter Sol Phenduka has been placed on suspension</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sol-phenduka-suspended-from-kaya-959-as-internal-process-under-way/\">Sol Phenduka suspended from Kaya 959 as ‘internal process’ under way</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "21 Aug 2025"
        }
    ]
}