{
    "news": [
        {
            "title": "ZIFA gets new president after Nqobile Magwizi secures landslide victory",
            "url": "https://www.newzimbabwe.com/zifa-gets-new-president-after-nqobile-magwizi-secures-landslide-victory/",
            "content": "By Staff Reporter\n\nTHE much-hyped Zimbabwe Football Association (ZIFA) elections saw Nqobile Magwizi voted as the new president.\n\nDuring polls held at a Harare hotel Saturday, the respected businessman-cum-football administrator amassed an unassailable 61 of the 77 votes cast, accounting for 80%, while his closest rival, Phillemon Machana, received six votes.\n\nIn third place was Twine Phiri, who got four, Marshall Gore received one, and Makwinji Soma Phiri failed to secure a single vote. There were five spoilt ballots\n\nThe final voter count was later reduced to 77 delegates by ZIFA Normalisation Committee chairman Lincoln Mutasa after one councillor was caught taking a picture of his voting slip, leading to his disqualification.\n\nA few hours ahead of polls, presidential aspirant Martin Kweza withdrew his from the race.\n\nMagwizi, who replaces Felton Kamambo voted into office in 2018, is expected to breathe life into the financially ailing sport whose integrity needs urgent restoration.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/10051510/NQOBILE-Magwizi.jpg",
            "description": "<p>By Staff Reporter  THE much-hyped Zimbabwe Football Association (ZIFA) elections saw Nqobile Magwizi voted as the new president. During polls held at a Harare hotel Saturday, the respected businessman-cum-football administrator amassed an unassailable 61 of the 77 votes cast, accounting for 80%, while his closest rival, Phillemon Machana, received six votes. In third place was</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zifa-gets-new-president-after-nqobile-magwizi-secures-landslide-victory/\">ZIFA gets new president after Nqobile Magwizi secures landslide victory</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:00",
            "date": "25 Jan 2025"
        },
        {
            "title": "‘Zimbabwe will close budget deficit with fast foods and sugar taxes’— Mthuli Ncube tells Davos WEF",
            "url": "https://www.newzimbabwe.com/zimbabwe-will-close-budget-deficit-with-fast-foods-and-sugar-taxes-mthuli-ncube-tells-davos-wef/",
            "content": "By Thandi Garusa\n\nZIMBABWEs Finance Minister, Mthuli Ncube says the newly introduced slew of taxes will help close the countrys budget deficit in the wake of lack of access to external financing.\n\nZimbabwe owes international creditors a whopping US$21 billion and its failure to settle the debt has kept it excluded from global financial markets for the past 25 years.\n\nIn an interview during a session on Navigating the Fiscal Squeeze at the World Economic Forum (WEF) meeting in Switzerland, Ncube was asked how he was funding the financial gap as Zimbabwe has a budget deficit and cannot access the external financing as well.\n\nIt is not easy to fund the gap, first of all you just have to do the plain vanilla fiscal discipline just to deal with minimizing the growth in the primary deficit by running cash budgets or quasi cash budgets that is what we had to do to make sure that we live within our means, and we try to minimize borrowing.\n\nBut also, we have tried to be innovative on the revenue front in terms of domestic resource mobilization to create space for additional expenditure.\n\nWe have introduced taxes such as the intermediate money transfer tax, if you are sending money within Zimbabwe, or doing an inter-bank or whatever transaction you pay tax for that.\n\nWe even have a tax now on fast foods, if you are buying pizza, tacos you pay an extra fee, just some innovation on domestic resource mobilisation is one of the solutions to create the space to fund anything fiscally, Ncube said.\n\nMeanwhile, to address Zimbabwes arrears Ncube also said the government was also engaging in a debt restructuring exercise.\n\nWe are engaging in a debt restructuring exercise which is also political where you have to bring all parties together, spending time doing financial diplomacy, getting everybody on board to do the debt restructuring and we are making progress.\n\nWe created a debt arrears platform which involved creditors all in one room with us and then creating three channels for sets of reforms, economic, governance and land reforms channels, he added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/04204804/Mthuli-Ncube-addressing-56th-UNECA-Conference78.jpg",
            "description": "<p>By Thandi Garusa ZIMBABWE’s Finance Minister, Mthuli Ncube says the newly introduced slew of taxes will help close the country’s budget deficit in the wake of lack of access to external financing. Zimbabwe owes international creditors a whopping US$21 billion and its failure to settle the debt has kept it excluded from global financial markets</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-will-close-budget-deficit-with-fast-foods-and-sugar-taxes-mthuli-ncube-tells-davos-wef/\">‘Zimbabwe will close budget deficit with fast foods and sugar taxes’— Mthuli Ncube tells Davos WEF</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:00",
            "date": "25 Jan 2025"
        },
        {
            "title": "Zimbabwe Cricket announces squads for Ireland series",
            "url": "https://www.newzimbabwe.com/zimbabwe-cricket-announces-squads-for-ireland-series/",
            "content": "By James Muonwa\n\nZIMBABWES cricket mother body has announced national teams for the upcoming multi-format series against Ireland, scheduled for next month.\n\nIn a statement, Zimbabwe Cricket media and communications manager, Darlington Majonga said the tour starts with a one-off Test match set for February 6 to 10 at Queens Sports Club in Bulawayo before shifting action to Harare.\n\nThe action will then move to Harare Sports Club for the white-ball leg, featuring three One-Day Internationals (ODIs) on 14, 16 and 18 February, followed by three Twenty20 Internationals (T20Is) on 22, 23 and 25 February, said Majonga.\n\nZimbabwes Test squad includes two new faces, the uncapped duo of 27-year-old leg-spinner Vincent Masekesa and 26-year-old top-order batter Nicholas Welch, who have both been rewarded for their impressive performances on the domestic front.\n\nMeanwhile, Dion Myers and Tadiwanashe Marumani have been left out of the red-ball set-up.\n\nMajonga said veteran all-rounder Sikandar Raza will also miss the Test match, as he had already committed to franchise cricket before the tour schedule was confirmed.\n\nA major boost for Zimbabwe comes with confirmation of the availability of seasoned all-rounder Sean Williams, who was struggling with a back injury during the recent Test series against Afghanistan.\n\nThe ODI squad sees two changes, with Wessly Madhevere and Nyasha Mayavo coming in for Myers and Joylord Gumbie, Majonga added.\n\nHowever, Myers has retained his place in the T20I squad, which now includes Johnathan Campbell, Tony Munyonga and Mayavo.\n\nFaraz Akram and Takudzwanashe Kaitano have missed out on T20I selection this time.\n\nZIMBABWE TEST SQUAD:\n\nCraig Ervine (Captain), Brian Bennett, Johnathan Campbell, Ben Curran, Joylord Gumbie, Trevor Gwandu, Takudzwanashe Kaitano, Vincent Masekesa, Nyasha Mayavo, Blessing Muzarabani, Richard Ngarava, Newman Nyamhuri, Victor Nyauchi, Nicholas Welch, Sean Williams.\n\nZIMBABWE ODI SQUAD:\n\nCraig Ervine (Captain), Brian Bennett, Johnathan Campbell, Ben Curran, Trevor Gwandu, Wessly Madhevere, Tinotenda Maposa, Tadiwanashe Marumani, Wellington Masakadza, Nyasha Mayavo, Blessing Muzarabani, Richard Ngarava, Newman Nyamhuri, Sikandar Raza, Sean Williams.\n\nZIMBABWE T20I SQUAD:\n\nSikandar Raza (Captain), Brian Bennett, Ryan Burl, Johnathan Campbell, Trevor Gwandu, Wessly Madhevere, Tinotenda Maposa, Tadiwanashe Marumani, Wellington Masakadza, Nyasha Mayavo, Tony Munyonga, Tashinga Musekiwa, Blessing Muzarabani, Dion Myers, Richard Ngarava, Newman Nyamhuri.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/07060758/cricket-2.png",
            "description": "<p>By James Muonwa ZIMBABWE’S cricket mother body has announced national teams for the upcoming multi-format series against Ireland, scheduled for next month. In a statement, Zimbabwe Cricket media and communications manager, Darlington Majonga said the tour starts with a one-off Test match set for February 6 to 10 at Queens Sports Club in Bulawayo before</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-cricket-announces-squads-for-ireland-series/\">Zimbabwe Cricket announces squads for Ireland series</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:00",
            "date": "25 Jan 2025"
        },
        {
            "title": "Poaching lands villager in court, slapped 12 months imprisonment",
            "url": "https://www.newzimbabwe.com/poaching-lands-villager-in-court-slapped-12-months-imprisonment/",
            "content": "By Staff Reporter\n\nA VILLAGER has been hauled before the Karoi Magistrates Court facing charges of wildlife poaching.\n\nTagara Siamachera aged 31 of Maware village, Chief Nenyunga, Gokwe, was brought before a local magistrate for contravening the Parks and Wildlife Act.\n\nThe State case was that on January 12, 2025, game scouts were on patrol in the Manyuli area of Matusadonha National Park, where they spotted some footprints and tracked them.\n\nThe rangers managed to apprehend the accused person while his accomplices escaped.\n\nFollowing his arrest, Siamachera led rangers to two dried carcasses of an African civet and a duiker, whose meat was packed in a sack.\n\nThe court found Siamachera guilty and sentenced him to 12 months imprisonment, of which six months were suspended on condition he performs 210 hours of community service.\n\nA further six months were set aside on condition he pays Zimbabwe National Parks and Wildlife Authority (ZimParks) restitution of US$2,500 in lieu of imprisonment.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/25053110/pngtree-grey-duiker-mammals-browser-legs-photo-image_170788.jpg",
            "description": "<p>By Staff Reporter A VILLAGER has been hauled before the Karoi Magistrates Court facing charges of wildlife poaching. Tagara Siamachera aged 31 of Maware village, Chief Nenyunga, Gokwe, was brought before a local magistrate for contravening the Parks and Wildlife Act. The State case was that on January 12, 2025, game scouts were on patrol</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/poaching-lands-villager-in-court-slapped-12-months-imprisonment/\">Poaching lands villager in court, slapped 12 months imprisonment </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:00",
            "date": "25 Jan 2025"
        },
        {
            "title": "Zimbabwean man sentenced to life imprisonment in UK for killing girlfriend in jealous rage",
            "url": "https://www.newzimbabwe.com/zimbabwean-man-sentenced-to-life-imprisonment-in-uk-for-killing-girlfriend-in-jealous-rage/",
            "content": "By BBC\n\nA JEALOUS boyfriend, who brutally murdered his partner after wrongly believing she was having an affair, has been jailed for life.\n\nTanaka Zivanai, 32, was sentenced at Bristol Crown Court on Thursday to life with a minimum of 20 years and 10 months imprisonment.\n\nZanele Sibanda, 28, was attacked in the street during the early morning hours of 27 August in Tredworth, Gloucestershire, in front of multiple shocked onlookers.\n\nA post-mortem examination found the mother-of-two died from multiple stab wounds to the head, throat, body and arms.\n\nMs Sibanda began a relationship with Zivanai after they got jobs as care workers\n\nRobin Shellard, prosecuting, said the murder was the culmination of an argument which had started the previous evening, in which the defendant had accused his partner of cheating.\n\nTanaka Zivanai murdered his partner, Zanele Sibanda, on the streets of Gloucester in front of a number of members of public after showing signs of jealousy, accusing her of infidelity, and arguing with her, he told the court.\n\nHe brutally assaulted her with a knife he had brought with him from his home, leaving her with multiple stab wounds which caused her to die at the scene of the assault.\n\nThe court heard the Zimbabwe-born defendant and Ms Sibanda, who was from South Africa, had arrived separately in the UK in 2023 but began a relationship after getting jobs as care workers.\n\nThey moved into a flat together in Tredworth, where neighbours would often hear a man shouting and a woman crying.\n\nOn one occasion, neighbours heard the defendant shouting, accusing her of sleeping with someone else.\n\nOn another occasion, Ms Sibanda was visiting a friend when the defendant phoned her and shouted: Ill kill you if you come here, dont come back to this house.\n\nZanele Sibandas friends and colleagues said she always had a smile on her face\n\nOn the evening of the murder, CCTV in the local area captured a man and woman shouting in the street and frequently returning to a nearby flat.\n\nA short time later, neighbours heard a woman screaming and saw a man kneeling on the ground with a woman in his lap, with him pleading: Wake up, get up, get up.\n\nAnother neighbour called the police as he had seen the man with his hand over the womans mouth and then stabbed her repeatedly, Mr Shellard said.\n\nHe described how the defendant started to cut himself.\n\nHis brother also saw the attack and had heard an argument about a visa and the woman saying how she was going to make him go back home.\n\nDetective Chief Inspector Wayne Usher from Gloucestershire Polices Major Crimes Unit said: We suspect Zivanai had his status in the UK threatened, which led him to carry out this savage and premeditated act of extreme violence.\n\nI welcome the sentence handed to Zivanai and hope that Zaneles loved ones can now find some closure as they try and rebuild their lives without her.\n\nMs Sibandas sister, Nonkanyiso Tshuma, said the conviction wont bring Zanela back\n\nSpeaking outside court, Nonkanyiso Tshuma said she had always imagined coming to the UK for the first time to attend her sisters graduation  not her murder trial.\n\nA two-year-old and a nine-year-old have to live today without their mother because of another, its so heartbreaking she said.\n\nZivanai isnt even showing any signs of remorse. Its a hard pill to swallow.\n\nHorrific killing\n\nSentencing Zivanai to life in prison, Judge William Hart said: You were angry and aggressive, and she was cowed by your behaviour.\n\nYou appear to have become convinced that she was in some form of relationship, perhaps an affair, with another man.\n\nThat was, as far as the evidence indicates, a wholly groundless suspicion and that form of jealousy appears to have been a feature of much of your relationship.\n\nThe circumstances of this poor young womans killing were horrific, he added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/25052455/MixCollage-24-Jan-2025-12-15-PM-5514-scaled-1.jpg",
            "description": "<p>By BBC  A JEALOUS boyfriend, who brutally murdered his partner after wrongly believing she was having an affair, has been jailed for life. Tanaka Zivanai, 32, was sentenced at Bristol Crown Court on Thursday to life with a minimum of 20 years and 10 months’ imprisonment. Zanele Sibanda, 28, was attacked in the street during</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-man-sentenced-to-life-imprisonment-in-uk-for-killing-girlfriend-in-jealous-rage/\">Zimbabwean man sentenced to life imprisonment in UK for killing girlfriend in jealous rage</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:00",
            "date": "25 Jan 2025"
        },
        {
            "title": "Mafume admits City of Harare is not making money from its properties",
            "url": "https://www.newzimbabwe.com/mafume-admits-city-of-harare-is-not-making-money-from-its-properties/",
            "content": "By Darlington Gatsi\n\nHARARE Mayor Jacob Mafume struggled to explain the failure of business units owned by the City of Harare (CoH), which top officials have turned into personal feeding troughs.\n\nMafume recently appeared before the ongoing Commission of Inquiry, which is investigating the councils operations from 2017 to the present.\n\nThe commission, chaired by retired Justice Maphios Cheda, grilled Mafume on why the citys business entities are crumbling under the opposition-controlled local authority.\n\nCouncil owns several businesses including City Parking, Harare Quarry, Rufaro Marketing, and Sunshine Holdings, among others.\n\nShockingly, despite owning these businesses, CoH has not been benefitting from the ventures with funds mysteriously unaccounted for.\n\nRufaro Marketing, despite being the biggest property owner after the government, has not been remitting funds to the municipality, except for last year.\n\nThe majority of Rufaro Marketings property is in a state of disrepair with bars in residential areas turning into white elephants. Some have been turned into tuck shops by informal traders.\n\nMafume acknowledged before the commission that the council has not been benefitting.\n\nCouncil is not benefiting from that state of affairs. They are not being run properly. The absence an ERP, we need a software to manage the various leases and properties that are owned by the council and there was a deliberate effort from management not to put these properties of Council into a system package, companies like Old Mutual and Real Estates companies use it, said Mafume.\n\nWithout disclosing the exact number, Mafume told the commission that there are properties that have disappeared from the radar of the local authority.\n\nYou cannot transfer it to where there is equal chaos because if you transfer its without the reforms there are more properties that are supposed to be managed by CoH that are disappearing and not being managed well, he said.\n\nCouncil has lost control of some its buildings after being grabbed by barons, who now demand rentals from shop owners.\n\nLast year, the commission revealed that the council collected US$100 in the first quarter of 2024 from tuckshop owners, exposing leakages and deep corruption within the municipality.\n\nMafume acknowledged that a Citizens for Change (CCC) councillor leases a property from Rufaro Marketing.\n\nI am not aware of any councillor beyond the one that was revealed, Hunters. At the present moment, I know of one councillor who was linked to Hunters Bar. It was publicised that Councillor Nyakudya was leasing, said Mafume.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/18055321/Mafume-Mayor.jpeg",
            "description": "<p>By Darlington Gatsi  HARARE Mayor Jacob Mafume struggled to explain the failure of business units owned by the City of Harare (CoH), which top officials have turned into personal feeding troughs. Mafume recently appeared before the ongoing Commission of Inquiry, which is investigating the council’s operations from 2017 to the present. The commission, chaired by</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mafume-admits-city-of-harare-is-not-making-money-from-its-properties/\">Mafume admits City of Harare is not making money from its properties </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:00",
            "date": "25 Jan 2025"
        },
        {
            "title": "Foreigners should not get gun licences — says Information secretary, as he wades into latest Chinese violence case",
            "url": "https://www.newzimbabwe.com/foreigners-should-not-get-gun-licences-says-information-secretary-as-he-wades-into-latest-chinese-violence-case/",
            "content": "By Leopold Munhende\n\nINFORMATION Ministry permanent secretary, Ndabaningi Mangwana has questioned why foreigners are allowed to wield firearms and called for the policy to be revisited.\n\nHis comments follow a recent skirmish in Gweru where a Chinese national was filmed brandishing and pointing a pistol at a local, who had confronted the foreigners over non-payment of his outstanding salaries.\n\nThey also follow a statement by the police revealing that a 20-year-old man was shot and injured by another Chinese national in Filabusi.\n\nIn Gweru, Liu Haifeng of Ming Chang Sino-Africa Mining Investments, said he had felt threatened by the local, Kholwani Dube, whom he was pointing a gun at.\n\nA Chinese nation captured on camera wielding a gun\n\nIn Zimbabwe we do not have a culture of brandishing guns like some wannabe gangsters. We have a culture of responsible gun ownership, said Mangwana in a post on X marked personal view.\n\nLet us revisit the idea of foreigners owning firearms. I do not believe Zimbabweans living in foreign countries can easily get firearms licences there.\n\nIn 2014, the Centre for Natural Resources Governance (CNRG) petitioned Parliament to investigate Chinese labour practices after a report revealed poor labour relations, gross human rights violations, low wages and unpaid work.\n\nResponding to the Gweru incident, CNRG said it was disturbed.\n\nThe CNRG is deeply disturbed by the escalating use of firearms by Chinese nationals in Zimbabwe to settle labor disputes.\n\nSimilar incidents have been reported in the past, including a case where two Chinese nationals were deported for abusing a mineworker at Makanga Mine in Bindura.\n\nThe Chinese nationals, in question, were deported last year after being recorded torturing some locals whom they accused of stealing fuel.\n\nThey tied their hands on a truck, hung them and beat them.\n\nMore cases have been reported over the years with the Chinese embassy usually defending their nationals, or claiming they are being targeted by local media.\n\nIn its statement released Friday, police confirmed the shooting of 20-year-old Mthandazo Sibanda by a Chinese in Filabusi.\n\nMthandazo Sibanda (20) was shot with a 9 mm Derya Pistol by a Chinese national while allegedly stealing gold dump at Binyup 5 Mine, Filabusi on 22nd January 2025.\n\nPolice have since arrested the Chinese national, read a statement signed by police spokesperson Commissioner Paul Nyathi.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/03/26191811/Nick-Mangwana.jpg",
            "description": "<p>By Leopold Munhende INFORMATION Ministry permanent secretary, Ndabaningi Mangwana has questioned why foreigners are allowed to wield firearms and called for the policy to be revisited. His comments follow a recent skirmish in Gweru where a Chinese national was filmed brandishing and pointing a pistol at a local, who had confronted the foreigners over non-payment</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/foreigners-should-not-get-gun-licences-says-information-secretary-as-he-wades-into-latest-chinese-violence-case/\">Foreigners should not get gun licences — says Information secretary, as he wades into latest Chinese violence case</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:00",
            "date": "25 Jan 2025"
        },
        {
            "title": "Zimbabwe to keep monetary policy tight to help foundering ZiG",
            "url": "https://www.newzimbabwe.com/zimbabwe-to-keep-monetary-policy-tight-to-help-foundering-zig/",
            "content": "Bloomberg\n\nZimbabwes central bank will keep a tight monetary policy stance this year to support its currency thats lost 48% of its value in the nine months since it was introduced.\n\nHigh interest rates will also help the Reserve Bank of Zimbabwe contain month-on-month inflation to single-digit levels, Governor John Mushayavanhu said. Monthly consumer-price gains have significantly slowed to 3.7% in December from 37.2% in October, he said.\n\nThe forthcoming 2025 Monetary Policy Statement will further contextualise and consolidate these positive prospects, and proffer more fine-tuning policies to move the economy from stability to growth, Mushayavanhu said in a written response to questions.\n\nYears of economic mismanagement have doomed five attempts to create a functioning currency in the southern African nation. ZiG  Zimbabwes latest gold-backed currency  isnt faring any better than its predecessors, with residents preferring the US dollar as a store of value. About 90% of transactions are done using the greenback.\n\nThe central bank has increased its key interest rate to 35% to slow inflation and support the currency.\n\nZimbabwes Treasury forecasts the economy to expand 6% this year driven by a recovery in the agricultural sector and growth in the iron and steel industry.\n\nThe central bank late last year announced the Targeted Finance Facility, a special-purpose vehicle meant to finance productive sectors and spur economic growth.\n\nIt is also important to note that the TFF will be financed from the pool of banks statutory reserves at the Reserve Bank, implying that there is no new money created to finance it, unlike in the past, Mushayavanhu said.\n\nMore from the governors comments:\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171609/mushayavanhu-zig-4.jpg",
            "description": "<p>Bloomberg Zimbabwe’s central bank will keep a tight monetary policy stance this year to support its currency that’s lost 48% of its value in the nine months since it was introduced. High interest rates will also help the Reserve Bank of Zimbabwe contain month-on-month inflation to single-digit levels, Governor John Mushayavanhu said. Monthly consumer-price gains</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-to-keep-monetary-policy-tight-to-help-foundering-zig/\">Zimbabwe to keep monetary policy tight to help foundering ZiG</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:00",
            "date": "25 Jan 2025"
        },
        {
            "title": "Zanu PF bosses fall over each other defending Mnangagwa on ED2030 mantra",
            "url": "https://www.newzimbabwe.com/zanu-pf-bosses-fall-over-each-other-defending-mnangagwa-on-ed2030-mantra/",
            "content": "By Staff Reporter\n\nZANU PF politburo member Ziyambi Ziyambi has jumped to President Emmerson Mnangagwas defence amid growing calls, from within the party, for him to rip apart Zimbabwes constitution and extend his term to 2030.\n\nZiyambi, who was speaking to ruling party members in Mashonaland West province said the calls should not be associated with Mnangagwa but with the entire Zanu PF which wants him to stay.\n\nHe said they were the ones pushing for extension and constitutional amendments necessary to ensure Mnangagwa possibly replicates late President Robert Mugabes lengthy stay in office.\n\nZiyambi becomes the third top official in both government and Zanu PF to jump to Mnangagwas defence in recent days as factional battles within the ruling party heat up.\n\nAt no time did President Mnangagwa say he wants this or that, about the issue of 2030, said Ziyambi.\n\nIt is us as the people and general membership of Zanu PF who expressed our desire about what we want him to do.\n\nNow if you hear someone saying anything about our President that he has done this or he intends to do that, tell them that it is not him, but it is us as the people and as Zanu PF. He is not in the equation or this discourse.\n\nZiyambis comment comes days after Information Minister Jenfan Muswere said the same in a statement released hours after Mnangagwas spokesperson George Charamba shared similar sentiments.\n\nBoth are regarded as Mnangagwa loyalists.\n\nThe politically broad-based call to extend the Presidential term of office beyond 2028 remains a rightful and unquestionable obligation for Parliament, the Party of Zimbabwes permanent national democratic revolution -ZANU PF and other legitimate political stakeholders to this matter, said Muswere in a statement.\n\nThose loyal to Mnangagwas deputy Constantino Chiwenga are reportedly grouping to ensure the formerdoes not extend his term.\n\nHe needs to amend theConstitution twice so as to entertain hopes of hanging on.\n\nCharamba said Mnangagwa as President will not tamper with views expressed by people as that right was enshrined in Zimbabwes constitution.\n\nHis comments came after local daily newspaper NewsDay carried a story on leaders of the Zimbabwe Heads of Christian Denominations (ZHOCD) urging Mnangagwa to respect the 2013 constitution and step aside in 2028 when his second term ends.\n\nThe designated role of the President of Zimbabwe in such situations is not to tamper with expressions of viewpoints from the citizenry; rather, it is to allow those viewpoints free play for as long as they remain within the remit of our Constitution, said Charamba.\n\nMnangagwas home province, Masvingo, was the first to urge him to hang on before other provinces and leagues jumped onto the bandwagon.\n\nDespite distancing himself at the partys last Peoples Conference, Mnangagwas allies have continued to push for the move.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/07/22195935/F1o4Bw1WwAEXt93.jpg",
            "description": "<p>By Staff Reporter ZANU PF politburo member Ziyambi Ziyambi has jumped to President Emmerson Mnangagwa’s defence amid growing calls, from within the party, for him to rip apart Zimbabwe’s constitution and extend his term to 2030. Ziyambi, who was speaking to ruling party members in Mashonaland West province said the calls should not be associated</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-bosses-fall-over-each-other-defending-mnangagwa-on-ed2030-mantra/\">Zanu PF bosses fall over each other defending Mnangagwa on ED2030 mantra</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:00",
            "date": "25 Jan 2025"
        },
        {
            "title": "King Kandoro unveils monthly comedy night ‘The New School’ to launch Zimbabwe’s next generation of comics",
            "url": "https://www.newzimbabwe.com/king-kandoro-unveils-monthly-comedy-night-the-new-school-to-launch-zimbabwes-next-generation-of-comics/",
            "content": "By Darlington Gatsi\n\nAfter blazing a trail last year, comedian King Kandoro has curated a comedy concept aimed at providing a platform for upcoming comedians.\n\nKandoro is introducing The New School a comedy night designed to allow young comedians to showcase their talent.\n\nThe New School will be held on the last Friday of every month, debuting at the Jason Mphepho Little Theater in Harare.\n\nIn a statement, King Kandoro said the platform is designed to assist young comics by providing a stepping stone into the industry.\n\nWe aim to shine a spotlight on amazing Zimbabwean comics and help their confidence grow as they navigate their creative journeys, he said.\n\nBaddies & Gentleman, \n\nThis is the plan for January! Please come out and catch the NEW SCHOOL doing their thing!\n\nIll be hosting, tickets available onhttps://t.co/0OZaV8AhiO.\n\nWe only have a 100 seats so get your tickets before theres stories.pic.twitter.com/Ak4ltlwe6e\n\n International Kandizzle  (@KingKandoro)January 17, 2025\n\nHe emphasized that the platform welcomes all practising stand-up comedians.\n\nWe want audiences to get used to attending comedy shows monthly and supporting their favourite comics, he added.\n\nTinashe, Hupenew, Munya, Tanya Alex, and Mike will perform on what promises to be an explosive Friday night.\n\nKandoro, who made waves on the comedy scene last year with his sold-out Properganda tour, both within and outside the country, is hoping to maintain the momentum and continue guiding the sector in the right direction.\n\nOn his shows, Kandoro has provided a platform for young comics like Tinashe, giving them the chance to perform in front of thousands of audience members.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/24052706/king-kandoro.jpeg",
            "description": "<p>By Darlington Gatsi After blazing a trail last year, comedian King Kandoro has curated a comedy concept aimed at providing a platform for upcoming comedians. Kandoro is introducing “The New School” a comedy night designed to allow young comedians to showcase their talent. “The New School” will be held on the last Friday of every</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/king-kandoro-unveils-monthly-comedy-night-the-new-school-to-launch-zimbabwes-next-generation-of-comics/\">King Kandoro unveils monthly comedy night ‘The New School’ to launch Zimbabwe’s next generation of comics</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:00",
            "date": "25 Jan 2025"
        }
    ]
}