{
    "news": [
        {
            "title": "Gwayi- Shangani Dam completion target in doubt, again",
            "url": "https://www.newzimbabwe.com/gwayi-shangani-dam-completion-target-in-doubt-again/",
            "content": "By Alois Vinga\n\nTHE 2025 target set for the completion of the Gwayi-Shangani Construction Project is now in doubt, with the Treasury still to release funds for the work, which has to be finished in the next eight months.\n\nThe Gwayi-Shangani project is seen as a lasting solution to Bulawayos water crisis, but it is behind schedule and has missed deadlines since construction began in 2004.\n\nIn 2018, President Emmerson Mnangagwa, during a tour of the Gwayi-Shangani dam, pledged to do everything in his ability to ensure the project is completed by the end of 2019.\n\nIn 2019, the dam missed the deadline due to delays and budget constraints, and it was pushed to 2022.\n\nAfter missing the 2022 deadline, the completion date was further pushed to the end of 2023.\n\nThe government shifted the dams deadline multiple times, with the most recent target set for completion by the 2023/2024 summer cropping season.\n\nResponding to a question raised by the Hwange East legislator, Hon Joseph Bonda, who demanded to know whether the Dam would be completed this year as scheduled, Lands Deputy Minister, Vangelis Haritatos, hinted that the unavailability of funds could choke the smooth delivery of the project.\n\nWhat needs to be done is that the release of funds has to be done on time. If the releases are not done on time, unfortunately, it is outside of our purview. It is not what we can do. We can make promises. We want to keep to the timeline. If the money comes, we will do our best.\n\nThe contractors are on site. They have every intention, every incentive for them to complete the work. They want to continue and move on. This is a dam that is so fundamental. I have personally visited it more than 20 times and I know the impact it has on the community, he said.\n\nHe said the project is of paramount importance for the communities, not only of the Matabeleland provinces but also of Bulawayo, where 276 kilometres of reticulation will finally end the water woes of the southern region.\n\nThe other impediment with regard to this specific dam is that if we are only given, for example, two million dollars, this means no changes at the Gwayi-Shangani Dam. We require four million US dollars for the dam to be raised another two metres. Every two metres costs four million US dollars. If you are given three million nine hundred thousand, it still cannot be raised until we get the full four million. Not part of it because of the type of dam that we are building. The releases cannot be in drips and drops. They have to be in multipliers of four million and above, said Haritatos.\n\nHe implored stakeholders to encourage the Treasury to prioritise the completion of the dam.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/04195348/Gwayi-Shangani-Dam.png",
            "description": "<p>By Alois Vinga THE 2025 target set for the completion of the Gwayi-Shangani Construction Project is now in doubt, with the Treasury still to release funds for the work, which has to be finished in the next eight months. The Gwayi-Shangani project is seen as a lasting solution to Bulawayo’s water crisis, but it is</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/gwayi-shangani-dam-completion-target-in-doubt-again/\">Gwayi- Shangani Dam completion target in doubt, again</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "13 May 2025"
        },
        {
            "title": "Struggling UK care providers say overseas worker crackdown ‘short-sighted’",
            "url": "https://www.newzimbabwe.com/struggling-uk-care-providers-say-overseas-worker-crackdown-short-sighted/",
            "content": "BBC\n\nCare providers have said the government is taking away the lifeline of overseas recruitment without fixing the problems that make it difficult to recruit UK staff.\n\nSir Keir Starmer, the prime minister, announced sweeping reforms to immigration on Monday, including plans to end the recruitment of care workers from overseas.\n\nEven with staff being brought in from other countries,official estimates show there were 131,000 vacanciesin social care in England last year.\n\nCare companies said some services will struggle to survive without international recruits.\n\nThe sector has been propping itself up with dwindling resources, rising costs, and mounting vacancies, said Prof Martin Green of Care England, which describes itself as the largest representative body for independent care providers.\n\nTaking (international recruitment) away now with no warning, no funding, and no alternative, is not just short-sighted  its cruel, he said.\n\nSir Keir said the visa changes were part of a drive to reduce immigration significantly and that the government wanted to create a migration system that is controlled, selective and fair.\n\nThe government said care providers could extend visas for existing staff and recruit migrants already in the UK who have yet to find a job. It also promised a new fair pay agreement for care staff and wanted companies to recruit and train more people from UK.\n\nHowever, Dr Jane Townson of the Homecare Association said the government was introducing the changes in a vacuum as a fair pay agreement is a long way off and there is no plan to deliver the care workers our country needs.\n\nSocial care has been in crisis for years, with council funding of services squeezed, significant staff-shortages and growing demand from an ageing population. Plans for reform have been delayed time and again.\n\nWhile care workers were clapped along with health workers during the pandemic, that did not translate into an improvement in pay or status.\n\nAbout 1.7 million people work in social care in England, according to Skills for Care, the official body that monitors the workforce.It is often a minimum or just above minimum wage job, with little recognition of the increasing responsibility and complexity of the support staff provide to older and disabled people.\n\nPutting it bluntly, if someone can earn more working, for instance, in a supermarket for fewer, less strenuous hours, then that is the option many will chose.\n\nPost-Covid, some staff left care work because they felt burnt out while others who still loved the job felt they could not afford the increases in the cost of living.\n\nBetween April 2021 and March 2022, social care vacanciesreached a record highof 165,000, a 52% increase on the year before.\n\nBy December 2021, the warnings of imminent collapse prompted Boris Johnsons Conservative government to make care work a shortage occupation,making it easier for companies to look overseas for staff.\n\nRecruits had to earn a minimum of 20,480 a year to qualify for the visa, and they could bring family with them.\n\nThere wasa rapid rise in overseas recruitment in 2022/23 80,000 people arrived in the UK to work in care and in 23/24, there were another 105,000 visas.\n\nMany care companies said bringing in those staff was the difference between providing services and collapsing. However, there was also abuse of this new route into the UK. For instance,some people were exploited, ending up paying middlemen thousands for travel and sponsorship certificates.\n\nThe Home Office says 470 care companies have had their licence to recruit international staff revoked since 2022. It estimates that has led to about 40,000 staff being displaced. Companies say many will have already found alternative care work.\n\nIn March 2024, Rishi Sunaks Conservative government tightened the visa requirements. This included saying recruits could no longer bring family with them. It has led to a significant fall in the number of care workers arriving from abroad.\n\nIn the year up to December 2024, 9,500 visas were granted to people entering the UK to provide caring personal services, according to the government.\n\nHowever, in the four years since staff shortages were most acute, relatively little has changed to encourage more UK people to work in care. There has been anongoing government funded recruitment campaignand talk of the need to improve the pay and status of staff, but many workers fear solutions remain a long way off.\n\nThe independent Casey Commission started work last month to draw up plans for adult social care. It has been described by ministers as a once in a generation opportunity to transcend party politics and build consensus on the future of the sector. Its first update is due next year and its final report by 2028.\n\nAt a time when the NHS is struggling, social care is more important than ever as it can keep vulnerable people out of hospital and support patients when they return home.\n\nMany care workers will say it is an incredibly rewarding job and with overseas recruitment being closed, the question is what needs to change to encourage more UK people to take on the role?\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/17095213/Care-Worker.png",
            "description": "<p>BBC Care providers have said the government is taking away the “lifeline” of overseas recruitment without fixing the problems that make it difficult to recruit UK staff. Sir Keir Starmer, the prime minister, announced sweeping reforms to immigration on Monday, including plans to end the recruitment of care workers from overseas. Even with staff being</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/struggling-uk-care-providers-say-overseas-worker-crackdown-short-sighted/\">Struggling UK care providers say overseas worker crackdown ‘short-sighted’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "13 May 2025"
        },
        {
            "title": "Repetitive licensing fees to stop in six months – govt",
            "url": "https://www.newzimbabwe.com/repetitive-licensing-fees-to-stop-in-six-months-govt/",
            "content": "By Alois Vinga\n\nINDUSTRY and Commerce Minister, Mangaliso Ndlovu, says repetitive licenses, which are negatively contributing towards unsustainable overhead costs for companies, will be history in six months time.\n\nThe challenge of numerous licenses has dogged the economy for years amid indications that, for instance, for one to operate a single supermarket, there is a need to obtain about 25 licenses and permits. These licenses come with hefty fees, affecting large-scale retailers like OK Zimbabwe and TM Pick n Pay, which have over 50 branches nationwide.\n\nAnother example drawn from the poultry sector players shows huge licenses demanded by the National Biotechnology Authority (NBA) and the Agriculture Marketing Authority (AMA), with the former demanding an annual registration fee of $6,500 per annum despite the fact that they do not provide a service, nor do they inspect the plant.\n\nThe sectors players report that AMA also requires a quarterly registration of imported feed ingredients, which include minerals that are not genetically modified, which carry a yearly cost of $36,400.\n\nAgainst the background, AMA also issues almost similar licenses for Feed Mill Registration, costing $1,000 and plant quarantine, which costs $1,800 per annum, despite the fact that they do not provide any service nor do they inspect the plant. These license fees are over and above normal operating taxes, as well as some fees collected by the local authorities.\n\nResponding to Parliamentarians after a question about what the government is doing to ease the burden of regulatory fees, which, according to the CZI, contribute towards 18% of overhead costs, Ndlovu said such burdens will soon be a thing of the past.\n\nWe identified in our reconstruction and growth plan that the regulatory environment weighs heavily on business viability, and to address it, we have the Minister of Finance working with the Office of the President and Cabinet (OPC) to address this. They have identified most of these licences, fees and other compliance issues that have to be addressed, and shortly, Mr. Speaker, those who followed the Minister of Finance did highlight a few months back that in six months, most of these will be done away with, he said.\n\nThe Minister underscored that it is a thorough process that has to be done with due diligence, with those tasked to address the problems nearing completion.\n\nThey have indicated they are almost complete with that exercise. They will, in the nearest possible future, make announcements of the regulations that are falling away and those that will be significantly slashed to make sure we promote the ease and cost of doing business, he added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/28155833/Mangaliso-Ndlovu.jpg",
            "description": "<p>By Alois Vinga INDUSTRY and Commerce Minister, Mangaliso Ndlovu, says repetitive licenses, which are negatively contributing towards unsustainable overhead costs for companies, will be history in six months’ time. The challenge of numerous licenses has dogged the economy for years amid indications that, for instance, for one to operate a single supermarket, there is a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/repetitive-licensing-fees-to-stop-in-six-months-govt/\">Repetitive licensing fees to stop in six months – govt</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "13 May 2025"
        },
        {
            "title": "Treasury perm sec in no show as Parliament seeks answers over mishandled US$400 million",
            "url": "https://www.newzimbabwe.com/treasury-perm-sec-in-no-show-as-parliament-seeks-answers-over-mishandled-us400-million/",
            "content": "By Staff Reporter\n\nFINANCE Ministry Permanent Secretary George Guvamatanga was again a no-show on Monday when he was expected to appear before the Parliamentary Public Accounts Committee (PAC) and explain the gross mismanagement of public funds amounting to US$400 million unearthed by the Auditor Generals report.\n\nPAC has been making efforts to interrogate Treasury officials over the Auditor Generals findings that the Finance Ministry flouted standard Public Finance Management Act (PFMA) procedures and made payments directly to suppliers, bypassing line ministries and agencies.\n\nGuvamatanga is said to have written to Parliament requesting more time to compile documents required by the Committee relating to payments amounting to US$400 million made to several companies, which include Fertilisers Seed Grain (FSG), Ziminya Dam Construction, Ventures Borehole & Exploration, Nyika Kanengoni, Semwa Dam, Makomo Engineering and RenForm CC, which is linked to controversial tenderpreneur Wicknell Chivayo.\n\nThe hearing on the running of affairs at the Treasury and the AGs findings was postponed to Friday, 23 May, to allow Minister Mthuli Ncube and his permanent secretary to put their house in order, avail themselves and give oral evidence.\n\nIf Guvamatanga does not show up again, PAC has warned it will issue a summons through the Clerk of Parliament.\n\nThe Ministry will now appear before the Committee on Friday, 23 May at 1000hrs.\n\nWe have resolved as a Committee that the Ministry of Finance Permanent Secretary (George Guvamatanga) need to appear on Friday and we also resolved last week that the Minister (Mthuli Ncube) must also come because there are policy issues that he must also come and attend to, PAC chairperson Charlton Hwende said.\n\nHe added, Regarding the non-shows, it affects only the permanent secretary (Guvamatanga) because we will be inviting the minister for the first time, so that he can come and address the policy issues that we want him to address.\n\nThe permanent secretary must also appear with his team together with the minister on Friday, at 10 oclock in the morning and failing to appear, we resolved that the Clerk of Parliament must issue summons in terms of Standing Orders that same Friday.\n\nWe give them a very final chance to appear on Friday, and we are preparing summons through the office of the Clerk of Parliament, and if they dont come, summons are issued immediately on that Friday.\n\nThe Finance Ministry is also expected by PAC to answer questions relating to its failure to submit treasury minutes to Parliament.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/05/03011105/George-Guvamatanga.jpg",
            "description": "<p>By Staff Reporter FINANCE Ministry Permanent Secretary George Guvamatanga was again a no-show on Monday when he was expected to appear before the Parliamentary Public Accounts Committee (PAC) and explain the gross mismanagement of public funds amounting to US$400 million unearthed by the Auditor General’s report. PAC has been making efforts to interrogate Treasury officials</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/treasury-perm-sec-in-no-show-as-parliament-seeks-answers-over-mishandled-us400-million/\">Treasury perm sec in no show as Parliament seeks answers over mishandled US$400 million</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "13 May 2025"
        },
        {
            "title": "Kwekwe United fined US$3,500 by PSL",
            "url": "https://www.newzimbabwe.com/kwekwe-united-fined-us3500-by-psl/",
            "content": "By Sports Reporter\n\nKwekwe United has been fined US$3,500 for failing to fulfil a fixture against Herentals last month.\n\nThe league debutantes side did not show up for the matchday seven home fixture at Bata stadium as players were protesting over outstanding salaries and signing-on fees.\n\nOn the day, visiting side Herentals showed up at the match venue and were on the pitch during kick-off time.\n\nFollowing a hearing by PSLs Disciplinary Committee, Kwekwe United were found guilty; hence Herentals have been awarded 3 points.\n\nThe Premier Soccer League Disciplinary Committee has released the judgment in the matter involving Kwekwe United FC.\n\nThe Club was found guilty of failing to fulfil a scheduled Castle Lager PSL fixture and fined a sum of USS3,500, US$500 of which is suspended for the rest of the season on condition that the club is not convicted of a similar offence.\n\nThe effective fine of US$3,000 together with costs of hearing to be paid by 23 May 2025.\n\nIn addition, the unfulfilled fixture has been awarded to Herentals FC on a three-nil scoreline, read the PSL statement.\n\nKwekwe United is facing financial challenges. Last week, the club promised to improve going forward.\n\nIndeed, like many clubs in the league, we have faced financial challenges, but I can assure you that the club is working tirelessly behind the scenes to source funding and attract strategic partners who can assist in stabilising and strengthening our operations, read part of their statement.\n\nThe Blues are currently bottom of the log with 7 points out of eleven games.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/23100047/kwekwe.jpg",
            "description": "<p>By Sports Reporter Kwekwe United has been fined US$3,500 for failing to fulfil a fixture against Herentals last month. The league debutantes’ side did not show up for the matchday seven home fixture at  Bata stadium as players were protesting over outstanding salaries and signing-on fees. On the day, visiting side Herentals showed up at</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kwekwe-united-fined-us3500-by-psl/\">Kwekwe United fined US$3,500 by PSL</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "13 May 2025"
        },
        {
            "title": "First group of white South Africans lands in US under Trump refugee plan",
            "url": "https://www.newzimbabwe.com/first-group-of-white-south-africans-lands-in-us-under-trump-refugee-plan/",
            "content": "BBC\n\nA US-funded flight carrying the first group of 49 white South Africans to be granted refugee status has landed in Washington, after leaving Johannesburg on Sunday.\n\nRelations between South Africa and the US have been tense for months, after President Donald Trump said that members of the countrys Afrikaner minority were victims of racial discrimination.\n\nThis was dismissed by South Africas Foreign Minister Ronald Lamola, who said on Monday there is no persecution of white Afrikaner South Africans, adding that police reports debunk President Trumps assertion.\n\nSouth Africasays that any allegations of persecutionwould not meet the threshold required under domestic and international refugee law.\n\nThe BBC has contacted the United Nations refugee agency, UNHCR, which confirmed it was not involved in this resettlement scheme, nor was it asked to take part in any of the screening.\n\nGiven the Trump administrations hardline position on refugees, it is notable the process did not involve the UNHCR  showing how much the white Afrikaners have been fast-tracked and in a way that has not been done for others.\n\nDemocrat Senator Jeanne Shaheen described the resettlement as baffling given the indefinite suspension for thousands of legitimate asylum seekers from other countries.\n\nSenator Shaheen, who is also the ranking member of the Senate Foreign Relations Committee, said in her statement that last year, the UN found no South Africans were eligible for refugee status.\n\nAsked directly on Monday why Afrikaners refugee applications had been expedited compared to other groups, Trump claimed a genocide was taking place and that white farmers specifically were being targeted.\n\nFarmers are being killed, they happen to be white, but whether theyre white or black makes no difference to me, he said.\n\nThe US has criticised domestic South African policy, accusing the government of seizing land from white farmers without any compensation  something which the southern African nation says has not happened.\n\nOne of Trumps closest advisers, South African-born Elon Musk, has previously said there was a genocide of white people in South Africa and accused the government of passing racist ownership laws.\n\nThe claims of a genocide of white peoplehave been widely discredited.\n\nFigures from the South African police show that in 2024, 44 murders were recorded on farms and smaller plots of agricultural land, with eight of those killed being farmers.\n\nSouth Africa does not report on crime statistics broken down by race but a majority of the countrys farmers are white, while other people living on farms, such as workers, are mostly black.\n\nAfrikaner author Max du Preez told the BBCs Newsday radio programme that claims of persecution of white South Africans were a total absurdity and based on nothing.\n\nHe added that South Africans were stunned by the resettlement scheme and that it had more to do with internal politics in the US than South Africa.\n\nBilateral tensions between the US and South Africa have been strained for some time as President Trump tasked his administration with formulating plans to potentially resettle Afrikaners, a group with mostly Dutch ancestry, in the US.\n\nIn March,South Africas ambassador to the US, Ebrahim Rasool, was expelledafter accusing President Trump of using white victimhood as a dog whistle, leading to the US accusing Mr Rasool of race-baiting.\n\nThe US has also criticised South Africa for taking an aggressive position against Israel at the International Court of Justice (ICJ), where Pretoria has accused Prime Minister Benjamin Netanyahus government ofgenocide against people in Gaza a claim which the Israelis strongly reject.\n\nThe current group of white South African refugees comprises 49 people, who landed in Washington DC later on Monday, before continuing to Texas.\n\nWhite South Africans make up just 7.3% of the population, but own the vast majority of privately held farmland, according to a 2017 government report.\n\nIn JanuaryPresident Cyril Ramaphosa signed a controversial law which allows the government to seize privately owned land without compensation in certain circumstances, when it is deemed equitable and in the public interest.\n\nThere had been anger in South Africa over the slow pace of land reform in the three decades since the end of the racist apartheid system.\n\nPresident Trumps openness to accepting Afrikaner refugees comes as the US has engaged in a wider crackdown on migrants and asylum seekers from other countries.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/19195057/white-south-africans.webp",
            "description": "<p>BBC A US-funded flight carrying the first group of 49 white South Africans to be granted refugee status has landed in Washington, after leaving Johannesburg on Sunday. Relations between South Africa and the US have been tense for months, after President Donald Trump said that members of the country’s Afrikaner minority were victims of “racial</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/first-group-of-white-south-africans-lands-in-us-under-trump-refugee-plan/\">First group of white South Africans lands in US under Trump refugee plan</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "13 May 2025"
        },
        {
            "title": "In Pictures: UZ students protest, call on admin to address lecturers’ concerns",
            "url": "https://www.newzimbabwe.com/in-pictures-uz-students-protest-call-on-admin-to-address-lecturers-concerns/",
            "content": "University of Zimbabwe (UZ) students protested Monday on campus, demanding the return of their lecturers who are on an indefinite strike over poor salaries.\n\nThe students called on the administration to offer lecturers reasonable pay so they can resume teaching.\n\nPictures by Thandiwe Garusa\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/12181203/Zinasu-1.png",
            "description": "<p>University of Zimbabwe (UZ) students protested Monday on campus, demanding the return of their lecturers who are on an indefinite strike over poor salaries. The students called on the administration to offer lecturers reasonable pay so they can resume teaching. Pictures by Thandiwe Garusa  </p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-pictures-uz-students-protest-call-on-admin-to-address-lecturers-concerns/\">In Pictures: UZ students protest, call on admin to address lecturers’ concerns</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "13 May 2025"
        },
        {
            "title": "South Africa: Supreme Court of Appeal hears Zimbabwean permit case",
            "url": "https://www.newzimbabwe.com/south-africa-supreme-court-of-appeal-hears-zimbabwean-permit-case/",
            "content": "By Jan Bornman |GroundUp\n\nThe legal saga over the Zimbabwean Exemption Permit (ZEP) returns to court on Tuesday as the Supreme Court of Appeal (SCA) hears the Department of Home Affairs appeal against a ruling that temporarily protected ZEP holders from arrest and deportation.\n\nTheinterim interdict, granted in June 2023 in a case brought by the Zimbabwean Immigration Federation (ZIF), shielded all ZEP holders  about 178,000 people  while the legality of the permit systems termination was being challenged.\n\nThe validity of the ZEP was last yearextendedto November 2025.\n\nThe Department of Home Affairs is asking the SCA to set aside the interim relief granted to the ZIF, effectively reinstating the departments ability to enforce immigration laws against ZEP holders until the wider legal questions around the permits are resolved.\n\nIn its court papers, the Department of Home Affairs argues that the matter should be considered moot because theres already aseparate high court ruling, in a case brought by the Helen Suzman Foundation, that declared the ministers decision to end the ZEP system unlawful and set it aside. The department is also appealing that ruling.\n\nAccording to the department, the permits were always meant to be temporary and subject to the ministers discretion. It argues that requiring the minister to maintain the ZEPs until Zimbabwes economic conditions improve would amount to an indefinite obligation not supported by the law.\n\nIn response, the ZIF argues that the departments appeal fails to take into account the severe human consequences of terminating the ZEP system. These consequences go to the heart of constitutional rights and cannot simply be brushed aside.\n\nThe ZIF argues that it is common cause and undisputed that ZEP holders would likely be deported in the absence of an interdict preventing such deportation and that for ZEP holders that are married to South Africans there would be a breakup of families in violation of their rights to family life and dignity.\n\nThey contend that even without deportations, the sudden shift from lawful residency to undocumented status strips permit holders of basic protections. It places jobs, access to education and family stability at risk and opens people to the daily threat of arrest, harassment, or detention.\n\nZEP holders face irreversible harm, the ZIF argues. Many would not qualify for any other visa, despite having lived, worked, and built families and businesses in South Africa for over a decade.\n\nThese are not hypothetical concerns, they say. When the ZEP system was initially terminated, thousands of people were left scrambling to apply for exemptions they were unlikely to qualify for, with no realistic chance of their applications being finalised in time. That uncertainty continues to this day and remains a real and ongoing threat to livelihoods, safety, and dignity.\n\nThey claim the department relies on technical arguments to justify ignoring these impacts, but that doesnt excuse the abrupt and damaging way the policy was ended or the lack of meaningful alternatives for those affected.\n\nThe ZIF also rejects the departments claim that ZEP holders could have applied for other visas instead of relying on court protection. They argue that these alternatives were either unavailable, impractical, or too slow.\n\nThe ZEP scheme was created precisely because most permit holders did not qualify for mainstream visas and the department admitted as much in its own court filings, they argue.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/06/30214201/zep.webp",
            "description": "<p>By Jan Bornman  | GroundUp   The Supreme Court of Appeal will on Tuesday hear the Department of Home Affairs’ appeal against an interdict protecting ZEP holders. The interdict was granted in June 2023 in a case brought by the Zimbabwean Immigration Federation (ZIF). Home Affairs argues that the ZEP system was always meant to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africa-supreme-court-of-appeal-hears-zimbabwean-permit-case/\">South Africa: Supreme Court of Appeal hears Zimbabwean permit case</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "13 May 2025"
        },
        {
            "title": "University of Zimbabwe students arrested as lecturers’ strike sparks flash protests",
            "url": "https://www.newzimbabwe.com/university-of-zimbabwe-students-arrested-as-lecturers-strike-sparks-flash-protests/",
            "content": "By Darlington Gatsi\n\nSIX University of Zimbabwe students were arrested on Monday afternoon after staging a flash demonstration demanding an urgent redress of their lecturers grievances.\n\nThe lecturers have been on industrial action for over a month and are demanding an upward review of their salaries and improved working conditions.\n\nThe students are at loggerheads with the UZ authorities over the end-of-semester examinations, which are set to be conducted amid the ongoing industrial action.\n\nThe students were apprehended by UZ security, which thwarted the protest, and were then escorted to Avondale Police Station.\n\nZimbabwe National Students Union (ZINASU) leader Narshon Kohlo said the situation at UZ is untenable.\n\nWe are here protesting against the University of Zimbabwes Professor Paul Mapfumo and Munyaradzi Madambi, who are denying us our right to education. We paid full tuition fees, and we expect learning services in return.\n\nIn this block, we did not write exams because we did not have lectures. They are trying to act as if everything is normal when nothing is normal. It cannot be business as usual at the University of Zimbabwe until the lecturers are back, said Kohlo.\n\nLecturers are demanding that their salaries be pegged at US$2,250, arguing that this is on par with other regional higher education institutions.\n\nThey are also bemoaning incapacitation, which has forced them to use personal resources to conduct lessons.\n\nIn a show of defiance, the lecturers have withdrawn from attending meetings, invigilating and marking examinations.\n\nDespite this, UZ announced that examinations would proceed last week, sparking an uproar among students.\n\nKohlo said the government and UZ should address the wage dispute to restore normalcy.\n\nThe solution is very simple: pay our lecturers. Compensate them fairly. Pay them decent salaries and decent wages, he said.\n\nThe arrested students are: UZ ZINASU chairperson Narshon Kohlo, Tafadzwe Katsande, Blessing Mtis, Tawananyashe Hove, Nodesha Maingehama and Tariro Mtukura.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/12181302/Zinasu-7.png",
            "description": "<p>By Darlington Gatsi SIX University of Zimbabwe students were arrested on Monday afternoon after staging a flash demonstration demanding an urgent redress of their lecturers’ grievances. The lecturers have been on industrial action for over a month and are demanding an upward review of their salaries and improved working conditions. The students are at loggerheads</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/university-of-zimbabwe-students-arrested-as-lecturers-strike-sparks-flash-protests/\">University of Zimbabwe students arrested as lecturers’ strike sparks flash protests </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "13 May 2025"
        },
        {
            "title": "‘Time to end’ care worker recruitment from abroad, says UK home secretary as she pledges lower-skilled visa crackdown",
            "url": "https://www.newzimbabwe.com/time-to-end-care-worker-recruitment-from-abroad-says-uk-home-secretary-as-she-pledges-lower-skilled-visa-crackdown/",
            "content": "BBC\n\nTHE United Kingdom (UK) will no longer be recruiting care workers from overseas as part of a crackdown on visas for lower-skilled workers, the Home Secretary has told the BBC.\n\nYvette Cooper said it is time to end that care worker recruitment from abroad and rules will change this year  instead requiring firms to hire British nationals or extend visas of overseas workers already in the country.\n\nThe government plans to unveilchanges to visa and recruitment laws on Mondayin a bid to cut net migration, and says measures will cut up to 50,000 lower-skilled and care workers coming to the UK over the next year.\n\nShadow home secretary Chris Philp said the plans were too little and called for an annual cap on migration.\n\nSuccessive governments have tried unsuccessfully to reduce net migration, which is the number of people coming to the UK minus the number leaving.\n\nNet migration climbed to a record 906,000 in June 2023, and last year it stood at 728,000.\n\nThe Home Office has not yet officially confirmed what will be in its immigration White Paper, due early next week.\n\nSpeaking on the BBCs Sunday with Laura Kuenssberg, Cooper said the government was setting up plans for a substantial reduction in net migration but added targets would not be set, saying they undermined the credibility of anything that governments do.\n\nThe threshold for skilled visas is expected to be increased to graduate level, tightened from the current A-level measure.\n\nThere will also be a narrower list of exceptions to the rules for temporary shortage visas in some industries, Cooper said, but did not give examples.\n\nCurrently, roles considered to be in short supply in the UK like carpenters, graphic designers and pharmaceutical technicians can beplaced on the Immigration Salary List (ISL),allowing employers to hire overseas workers at discount  set at 80% of the market rate.\n\nCooper said the government expects those changes will lead to a reduction of up to 50,000 fewer lower skilled visas over the course of the next year.\n\nAs well as visa changes, the home secretary added there would be new requirements for training commitments to get people who are not working back into the labour market here in the UK.\n\nPhilp  who said he agreed with the plan to end care worker recruitment from abroad  told the same programme the Conservatives would push Parliament to vote on a yearly migration cap this week.\n\nWhen asked what the cap would be, he said were working on the detail to specify that number, but it would be a further reduction of significantly more than 50,000.\n\nHe argued that if Labour had stuck with Tory changes net migration would have dropped by about 400,000.\n\nCooper also said there would be some changes to rules around international students and graduates.\n\nWe will let them continue to come and to stay and to work afterwards, she added.\n\nWe are making some changes, particularly around the standards and the compliance for universities, because, again, weve had problems where some universities havent had proper standards in place.\n\nTheyve recruited people to come as international students who then havent completed their courses, have either overstayed or other problems with compliance of the system.\n\nThe government has already tightened rules around care sector worker after coming to power last July.\n\nApplications for Health and Care Worker visas peaked at 18,300 in August 2023, then collapsed to 1,700 by April this year following the ban on bringing dependants.\n\nAnd on 9 April, an additional restriction was added requiring care firms who want to recruit anew worker from overseas to provethey attempted to recruit a worker from within England first.\n\nBut the new rules will require care companies to recruit from domestic workers or a pool of over 10,000 care workers brought to the UK on visas for jobs that never materialised.\n\nAlongside this Cooper promised to bring in a new fair pay agreement for care workers to make care jobs more attractive to UK workers and reduce overseas demand.\n\nNadra Ahmed, the National Care Associations executive chairman, told the BBC the changes would a challenging scenario for care homes even worse.\n\nShe said providers always prefer to have a domestic workforce but said it was not available.\n\nResponding to the changes, the Liberal Democrats social care spokesperson Helen Morgan said the government was tinkering around the edges yet failing to properly tackle the crisis in our social care.\n\nLabour must step up and take proper action to address recruitment shortages including paying our care workers properly and rolling out a plan for career progression, she said.\n\nWhile Labour have been reviewing migration policy for months, many have suggested this weeks crackdown was triggered by Reform UKs surge in the local elections, where ittook the Runcorn and Helsby constituency off Labour and won control of 10 councils.\n\nReform leader Nigel Farage claimed this new legislation is only happening because Reform is leading in the polls.\n\nLabours plan was doomed to fail, he argued as immigration was not just about what numbers come in but who comes in and if they can assimilate.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/28072448/Nurse-UK.png",
            "description": "<p>BBC THE United Kingdom (UK) will no longer be recruiting care workers from overseas as part of a crackdown on visas for lower-skilled workers, the Home Secretary has told the BBC. Yvette Cooper said it is “time to end that care worker recruitment from abroad” and rules will change this year – instead requiring firms</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/time-to-end-care-worker-recruitment-from-abroad-says-uk-home-secretary-as-she-pledges-lower-skilled-visa-crackdown/\">‘Time to end’ care worker recruitment from abroad, says UK home secretary as she pledges lower-skilled visa crackdown</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "13 May 2025"
        }
    ]
}