{
    "news": [
        {
            "title": "Reckless commuter omnibus driver jailed, gets life ban from driving",
            "url": "https://www.newzimbabwe.com/reckless-commuter-omnibus-driver-jailed-gets-life-ban-from-driving/",
            "content": "By James Muonwa\n\nA commuter omnibus driver, who drove against oncoming traffic in Harare, has been sentenced to an effective two years imprisonment and a life ban from driving.\n\nThe accused person, Freedom Ruzvidzo, was facing a charge of recklessdriving when he appeared before the Harare Magistrates Court on Tuesday.\n\nThe court heard that recently, the offender was behind the steering wheel of a Toyota Hiace when he ignored road traffic rules at the intersection of Second Street and Upper East Road, entered a One Way lane and obstructed other motorists during rush hour.\n\nAlthough Ruzvidzos actions did not cause any accident resulting in injury or death, his stunt placed the public at great risk.\n\nThe presiding magistrate cancelled Ruzvidzos drivers licence and permanently banned him from driving vehicle classes 2, 4 and 5, which cover minibuses, light motor vehicles and all types of trucks.\n\nIn a statement following sentencing, the National Prosecuting Authority (NPA) said reckless driving will not be tolerated on the countrys roads.\n\nDriving against (oncoming) traffic endangers lives and can cause deadly accidents. Offenders will face harsh penalties, including imprisonment and lifetime driving bans.\n\nPublic safety comes first. Every reckless driver is a potential killer on our roads, the NPA noted.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/02/06125625/jail-e1675980742403.jpg",
            "description": "<p>By James Muonwa A commuter omnibus driver, who drove against oncoming traffic in Harare, has been sentenced to an effective two years’ imprisonment and a life ban from driving. The accused person, Freedom Ruzvidzo, was facing a charge of reckless driving when he appeared before the Harare Magistrates Court on Tuesday. The court heard that recently,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/reckless-commuter-omnibus-driver-jailed-gets-life-ban-from-driving/\">Reckless commuter omnibus driver jailed, gets life ban from driving </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:40",
            "date": "29 Aug 2025"
        },
        {
            "title": "Chinhoyi University of Technology records gender shift as more females than males graduate",
            "url": "https://www.newzimbabwe.com/chinhoyi-university-of-technology-records-gender-shift-as-more-females-than-males-graduate/",
            "content": "By James Muonwa\n\nCHINHOYI University of Technology (CUT) has achieved gender parity in the number of graduands churned out of the Class of 2025, amid a shift that witnessed more females than males graduating.\n\nDuring the universitys 21st graduation ceremony held on Thursday, a total of 3,130 graduands were capped by President Emmerson Mnangagwa, who is the Chancellor of all State universities.\n\nOf the graduating Class of 2025, there were 1,573 females and 1,557 males, marking a slight difference of 16.\n\nTraditionally, during previous graduation ceremonies, the number of male graduates surpassed that of females.\n\nSpeaking on the sidelines of the event held at CUT Grounds, womens rights lobbyist, Chioniso Gurupira, said the new trend was a positive sign of strides the country has made in empowering women and the girl-child.\n\nThe one thing that has probably struck some of us in the gender mainstreaming sector is the number of female graduands at this event. The women are slightly more than the men, which is a positive story of CUT having achieved gender parity, said Gurupira.\n\nGender parity refers to a situation where the number of females and males is roughly equal or balanced in a particular context, such as in education, the workforce, or leadership roles.\n\nIt implies equal representation, opportunities, and treatment of both genders.\n\nA female graduand, Jennifer Tinotenda Sanjobo, who graduated with a Bachelor of Science (BSc) in Crop Science, expressed joy at having successfully completed her degree in a previously male-dominated study area, which will enable her to contribute meaningfully to national development.\n\nI am excited to have graduated with a BSc in Crop Science. We were a few ladies in our cohort and l feel proud to be among the graduands, said Sanjobo.\n\nI am hoping to use my newly acquired education and expertise to help Zimbabwe fight climate change by coming up with seed varieties that can adapt and withstand the rigours of the phenomenon.\n\nIn a small way, I am optimistic my contribution to climate-proofing agriculture will bring about food security and national development, she added.\n\nWhile CUT has managed to bring an equilibrium between the number of graduates based on gender, sadly total number of graduands tumbled this year to 3,130 from the 2024 figure, which stood at 3,545. In 2023, a total of 3,480 graduated from the same university.\n\nAddressing guests, CUT Vice Chancellor, Professor David Simbi lamented the low uptake of science, technology, engineering and mathematics (STEM) courses, which are the varsitys anchor areas of study.\n\nOur understanding as a higher education institution of our role is using research, innovation, science and technology development to drive and develop the industrialisation and modernisation of Zimbabwe to achieve a middle economic status by 2030\n\nHowever, our human capital development remains side lobbed in that there are too few STEM students in our programmes, despite the importance we attach to the related programmes of study, said Simbi.\n\nThis is, however, not peculiar to Zimbabwe, and there are other routes that we can use to meet this deficit that other countries with similar problems have adopted.\n\nTo this end, Your Excellency and Chancellor, CUT will be seriously investigating the introduction of foundation programmes in science, technology and engineering as pre-university basic technology education.\n\nSimbi noted that the approach is a common trend in the United Kingdom, Singapore and Malaysia, among other countries.\n\nThe vice chancellor also lamented the high cost of laboratory equipment, which he, however, said could be dealt with by adopting reverse engineering.\n\nSimbi told graduands that the Heritage-Based Education 5.0 philosophy had prepared them for the future.\n\nHeritage-based education has prepared you for the future. To the private sector, these graduates are ready to take on any challenge for the good of the country. In broader contribution, heritage-based education has gained greater meaning in the nation and beyond, towards industrialisation and modernisation, Simbi said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/29064728/IMG_7531-scaled.jpg",
            "description": "<p>By James Muonwa CHINHOYI University of Technology (CUT) has achieved gender parity in the number of graduands churned out of the Class of 2025, amid a shift that witnessed more females than males graduating. During the university’s 21st graduation ceremony held on Thursday, a total of 3,130 graduands were capped by President Emmerson Mnangagwa, who</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chinhoyi-university-of-technology-records-gender-shift-as-more-females-than-males-graduate/\">Chinhoyi University of Technology records gender shift as more females than males graduate</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:40",
            "date": "29 Aug 2025"
        },
        {
            "title": "Nate Landman on life as an African NFL player: ‘People don’t believe me at first’",
            "url": "https://www.newzimbabwe.com/nate-landman-on-life-as-an-african-nfl-player-people-dont-believe-me-at-first/",
            "content": "The Guardian\n\nThe Rams linebacker spent the early part of his life in Zimbabwe. But he has kept his childhood memories alive as his football career has grown.\n\nFor Nate Landman, surprise has become routine. TheLos Angeles Ramslinebacker has lost count of the raised eyebrows, smirks, and awkward pauses when people learn where his story begins.\n\nThey dont believe me at first, Landman said. Ill show them Im covered in African tattoos, and some will say Im still lying until they look it up or someone will vouch for me.\n\nLandman isnt exaggerating  a white guy with a Californian accent isnt most peoples picture of what one of the NFLs few African players would look like. But born in Harare, Zimbabwes capital, in 1998, Landmans roots are intertwined with the countrys sporting tradition. His South African father, Shaun, was in Zimbabwe at the time playing international rugby. When an engineering consulting firm offered Shaun a position in California, the family seized the opportunity. When Nate was three, the Landmans had moved to Danville, California, bringing with them not just their belongings, but also a rich cultural identity.\n\nLandman is the only active NFL player with Zimbabwe roots. Stansly Maponga, also born in Zimbabwe, played from 2013 until 2015. The NFL doesnt have the influx of international players like the NBA. Foreign-born players comprise only 3% to 4% of the leagues numbers  Canada, Germany and Nigeria that have produced the most. The NFL is trying to change that, and created the International Player Pathway program as a way to increase the number of players born outside the United States.\n\nAs for Landman, as the years passed Harare became more of a childhood blur than a lived memory. But his family kept Zimbabwe alive in their home, particularly when it came to food.\n\nWe brought a lot of the Zimbabwean culture into our home, Landman said. Our home is still decorated as if we were still in Zimbabwe.\n\nAs his three siblings and parents took pride in their South African and Zimbabwean ties, Landman grew up between worlds: California suburbia on the outside, African traditions on the inside.\n\nAthleticism was never far from the conversation in the Landman household. Shaun had played at the University of Cape Town before representing Zimbabwe in rugby. Nates mother, too, was a competitive athlete.\n\nInspired by that legacy, Landman threw himself into sports. In high school, he excelled in rugby and baseball. But it was football that became his calling.\n\nAt the University of Colorado, Landmans relentless energy quickly made him a defensive cornerstone. Across five seasons, he developed a reputation as one of the better linebackers in the Pac-12 Conference. He earned first-team All-Pac-12 honors in 2019 and 2020 and added a second-team selection in 2021. His style of play  fast, physical, fearless  mirrored the competitive fire passed down from his father.\n\nBut the NFL is rarely a straight line.\n\nDespite his production at Colorado, Landmans name wasnt called during the 2022 NFL draft. Instead, he signed with the Atlanta Falcons as an undrafted free agent. He worked his way on to the roster, appearing in seven games as a special-teamer before being cut and placed on the practice squad later that season.\n\nIts tough being undrafted, Landman said. Its not an easy road. Its a road Im proud of because its made me the player I am today. I took advantage of the opportunities  Its a huge part of my story.\n\nPerseverance paid off the following season. Landman not only made the Falcons roster but started 14 of 16 games. He collected 110 tackles, seven tackles for loss, and owned the second-best run-stop rate in the NFL among qualified linebackers (12.6%).\n\nFor Landman, the achievement was about more than numbers. It was about validation.\n\nIt was about setting a goal, reaching it, and then setting another goal, he said. Becoming a starter in this league is something Im super proud of. Its something everyones striving to do. Its especially not easy for undrafted guys.\n\nIt was easy for Landman to sign a one-year contract this offseason with the Rams. The team was in need of his leadership at inside linebacker, and it helped that Landman had a strong relationship with Rams assistant defensive coach Jimmy Lake, with whom hed previously worked with in Atlanta under the same system.\n\nThese guys around me have allowed me to take a step up in my game, Landman said. Everyone [on defense] elevates each other, and thats the biggest thing that Ive noticed here.\n\nRams inside linebackers coach Greg Williams has noticed a few different intangibles that Landman has brought to the team.\n\nHe brings us something we havent had in a while, which is his communication and energy, said Williams, following the Rams preseason victory over the Cleveland Browns last Saturday. He understands the whole game from a run-game and a pass-game perspective. So, the fact that he communicates with the entire defense, hes the glue that brings it all together, which gives guys the freedom to play, and everybody loves it.\n\nWhether its the culture woven into his home life, the continent of Africa tattooed on the right side of his chest, or the determination that has carried him from an overlooked rookie to a starter in the NFL, Landman, who last visited his home country two years ago, continues to carry Zimbabwe with him onto the field.\n\nHard work may have built his career, but identity grounds it.\n\nHaving the support of my relatives who still live over there, he said, wearing tattoos, and having the Zimbabwe flag on the back of my helmet are all very important to me.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/28195953/nate-landman.png",
            "description": "<p>The Guardian The Rams linebacker spent the early part of his life in Zimbabwe. But he has kept his childhood memories alive as his football career has grown. For Nate Landman, surprise has become routine. The Los Angeles Rams linebacker has lost count of the raised eyebrows, smirks, and awkward pauses when people learn where his story</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nate-landman-on-life-as-an-african-nfl-player-people-dont-believe-me-at-first/\">Nate Landman on life as an African NFL player: ‘People don’t believe me at first’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:40",
            "date": "29 Aug 2025"
        },
        {
            "title": "FAO champions inclusive growth at Zimbabwe’s 13th Annual National Agribusiness Conference",
            "url": "https://www.newzimbabwe.com/fao-champions-inclusive-growth-at-zimbabwes-13th-annual-national-agribusiness-conference/",
            "content": "FAO\n\nAt the 13th Annual National Agribusiness Conference, the Food and Agriculture Organization of the United Nations (FAO) re-affirmed its role as a key technical partner in building resilient, market-driven horticultural value chains, supporting Zimbabwes Vision 2030 through infrastructure development, standards compliance, and climate-smart agriculture.\n\nThe conference held during the Zimbabwe Agricultural Show, convened senior government officials, agribusiness leaders, development partners, and farmers under the themeBuilding Resilient and Market-Driven Horticultural Value Chains.\n\nRepresenting the United Nations in Zimbabwe, FAO Subregional Coordinator for Southern Africa and Representative to Zimbabwe, Patrice Talla delivered remarks on behalf of UN Resident and Humanitarian Coordinator Edward Kallon, emphasizing the alignment of the conferences objectives with the Zimbabwe UN Sustainable Development Cooperation Framework.\n\nThe UN Cooperation Framework is our collective blueprint for supporting Zimbabwes development aspirations. Building resilient and market-driven horticultural value chains is not just an agricultural goal, it is a pathway to inclusive economic growth, food security, and climate resilience, said Mr. Edward Kallon.\n\nWe commend the Government of Zimbabwe for its leadership and re-affirm the UNs commitment. Our support to the Government and people of Zimbabwe will continue to be guided by the current Zimbabwe UN Cooperation Framework (2022-2026) aligned with the NDS-I, and in the next Cooperation Framework, whose roadmap is in progress for 2027-2030 to complement NDS-II. Working hand-in-hand with national stakeholders, we shall deliver for Zimbabwe on Vision 2030 to become upper middle-income society and the 2030 Agenda for Sustainable Development, added Mr. Kallon.\n\nHorticulture is emerging as a cornerstone of Zimbabwes export strategy, contributing over USD 120 million annually through high-value crops such as blueberries, citrus, macadamia, and cut flowers. With the government targeting a USD 2.5 billion horticulture industry by 2030, the sector is poised for rapid expansion. Stakeholders attending the ANAC acknowledged that unlocking this potential requires strategic partnerships, coordinated investment, compliance with international standards and access to finance complemented by robust market intelligence.\n\nFAOs interventions in Zimbabwe are directly addressing these needs by playing a central role in shaping resilient and market-responsive value chains. Through strategic investments in infrastructure, food safety, digital extension, and climate-smart practices, FAO is supporting producers to meet global standards and unlock export potential. FAOs commitment to inclusive financing and good agricultural practices underscores its leadership in transforming horticulture into a driver of sustainable growth and rural empowerment. FAO has also facilitated the establishment of a USD 6.2 million Seed Revolving Fund managed by AFC Land and Development Bank funded by the African Development Bank.\n\nFAO is proud to be the lead technical agency supporting agrifood systems transformation in Zimbabwe. FAOs mandate is rooted in empowering producers, especially women and youth, with the tools and knowledge to thrive in competitive markets. Through strategic partnerships and innovation, we are helping Zimbabwe build a horticulture sector that is resilient, inclusive, and globally recognized, said Talla.\n\nThe conference highlighted the importance of regional integration, with the African Continental Free Trade Area (AfCFTA) offering new opportunities for intra-African trade. FAOs upgrading of human health laboratories is enhancing pest and disease surveillance and food safety testing, critical components for accessing regional and international markets.\n\nAllow me to reaffirm Governments unwavering commitment to the agricultural sector. Together we are turning challenges into opportunities, policies into action, aspirations into reality. May this conference inspire new partnerships, practical solutions, and bold investments that will sustain Zimbabwes agricultural renaissance, said Honourable Vice President of Zimbabwe, Dr. CGDN Chiwenga in a keynote address read on his behalf by the Minister of Defence, Honourable Oppah Muchinguri-Kashiri.\n\nThe 13th ANAC concluded with a call for bold leadership, coordinated action, and sustained partnerships. FAO reaffirmed its commitment to walking alongside Zimbabwe on its journey toward a resilient, market-driven horticulture industry that uplifts rural livelihoods and strengthening the national agriculture economy.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/28192454/fao_src_anac_image_webcover-scaled.jpg",
            "description": "<p>FAO At the 13th Annual National Agribusiness Conference, the Food and Agriculture Organization of the United Nations (FAO) re-affirmed its role as a key technical partner in building resilient, market-driven horticultural value chains, supporting Zimbabwe’s Vision 2030 through infrastructure development, standards compliance, and climate-smart agriculture. The conference held during the Zimbabwe Agricultural Show, convened senior</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/fao-champions-inclusive-growth-at-zimbabwes-13th-annual-national-agribusiness-conference/\">FAO champions inclusive growth at Zimbabwe’s 13th Annual National Agribusiness Conference</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:40",
            "date": "29 Aug 2025"
        },
        {
            "title": "What inspired Bob Marley’s song “Zimbabwe”?",
            "url": "https://www.newzimbabwe.com/what-inspired-bob-marleys-song-zimbabwe/",
            "content": "Jamaicans.com\n\nOn April 17, 1980, reggae icon Bob Marley stepped onto the stage at Rufaro Stadium in Harare to perform at Zimbabwes independence celebration. His songZimbabwerang through the air as a newly free nation celebrated the end of colonial rule. But the story behind the song goes deepershaped by Marleys connection to Africa, the liberation struggle, and a few musical friends in Ethiopia.\n\nIn the late 1970s, Marley frequently visited Ethiopia, drawn by his Rastafarian beliefs and support for African unity. During one visit toAddis Ababa, he was introduced to a group of African musicians working for the United Nations. One of them was a Zimbabwean jazz musician and poet who had formed a band calledThe United Nations Jazz Band. They werent reggae artists, but Marley took interest in their talent and their roots.\n\nThe band and Marley developed a musical friendship. Though coming from different genres, they began to experiment with blending Marleys reggae style with traditional African rhythms. One day, Marley shared that he had been working on a song about Zimbabwes independence. He believed freedom for the country was near and wanted to create something special to support that moment.\n\nThe musicians helped shape the song, bringing in African influencesespecially Shona soundsand Marley welcomed their input. The result wasZimbabwe, a track filled with powerful lyrics like,Every man got a right to decide his own destiny.It was included in Marleys 1979 albumSurvival, which carried strong messages of resistance and African liberation.\n\nWhen Zimbabwes independence was officially declared in April 1980, Marley was invited to perform at the celebration. The new government couldnt afford to pay him, but Marley didnt hesitate. He paid for everything himself, including flying in his band and sound equipment fromLondon.\n\nThat night at Rufaro Stadium, 40,000 people gathered, including world leaders like Prince Charles and Indira Gandhi. As Marley performedZimbabwe, thousands more tried to enter the stadium, and police used tear gas to control the crowd. Still, Marley stayed on stage and kept singing. His commitment to the people never wavered. To make up for those who couldnt see the first concert, he performed again the following nightthis time for over 100,000 people.\n\nMarleys presence meant more than entertainment. He stood with Zimbabwe at a turning point in its history. His performance wasnt just a showit was a statement of unity, freedom, and African pride. His song had become the unofficial anthem of Zimbabwes struggle and victory.\n\nEven after Marleys death in 1981,Zimbabweremains one of his most powerful and politically significant songs. It symbolizes not only a nations independence but also the power of music to inspire and unite people across borders.\n\nFor Zimbabweans, Marleys gift was unforgettablea reggae anthem that echoed their journey, struggles, and hope for the future.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/07/03192334/photo-of-bob-marley-bob-marley-performing-live-on-stage-at-the-brighton-leisure-centre.webp",
            "description": "<p>Jamaicans.com On April 17, 1980, reggae icon Bob Marley stepped onto the stage at Rufaro Stadium in Harare to perform at Zimbabwe’s independence celebration. His song “Zimbabwe” rang through the air as a newly free nation celebrated the end of colonial rule. But the story behind the song goes deeper—shaped by Marley’s connection to Africa, the liberation</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/what-inspired-bob-marleys-song-zimbabwe/\">What inspired Bob Marley’s song “Zimbabwe”?</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:40",
            "date": "29 Aug 2025"
        },
        {
            "title": "Top official embroiled in Equatorial Guinea sex tape scandal jailed",
            "url": "https://www.newzimbabwe.com/top-official-embroiled-in-equatorial-guinea-sex-tape-scandal-jailed/",
            "content": "BBC\n\nA nephew of Equatorial Guineas President Teodoro Obiang Nguema, who was at the centre of a sex tape scandal last year, has been sentenced to eight years in prison for embezzlement.\n\nBaltasar Ebang Engonga, the former head of the National Financial Investigation Agency, diverted money for personal use, a court ruled.\n\nNicknamed Bello because of his good looks, the married Engonga gained notoriety last year, when he appeared in leaked videos having sex with different women  many of them wives and relatives of people close to the centre of power.\n\nThe leak occurred while he was in detention, accused of depositing a huge sum of embezzled money into secret accounts in the Cayman Islands.\n\nHe was found guilty along with five other officials who allegedly claimed the money as an allowance for travel  the amounts ranged from $9,000 (6,600) to $220,000.\n\nEngongas arrest last October and public humiliation was seen as an attempt to destroy any hope he had of becoming the next president of the oil-rich central African state.\n\nHis uncle is the worlds longest-serving president having been in power since 1979, and has appointed his son, Teodoro Obiang Mangue, as his vice-president.\n\nEngonga used to investigate crimes such as money laundering, but found himself at the infamous Black Beach prison in the capital, Malabo, after being accused of corruption.\n\nHis phones and computers were seized and a few days later the intimate videos started appearing online in their dozens.\n\nThe authenticity of the videos was never verified, but as the computer equipment was in the hands of the security forces, suspicion fell on someone there leaking it, perhaps to trash Engongas reputation.\n\nAs well as imposing a jail sentence, the tribunal fined Engonga $220,000, supreme court press director Hilario Mitogo was quoted by the AFP news agency as saying in a WhatsApp message to journalists.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/28193033/baltasar.webp",
            "description": "<p>BBC A nephew of Equatorial Guinea’s President Teodoro Obiang Nguema, who was at the centre of a sex tape scandal last year, has been sentenced to eight years in prison for embezzlement. Baltasar Ebang Engonga, the former head of the National Financial Investigation Agency, diverted money for personal use, a court ruled. Nicknamed “Bello” because</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/top-official-embroiled-in-equatorial-guinea-sex-tape-scandal-jailed/\">Top official embroiled in Equatorial Guinea sex tape scandal jailed</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:40",
            "date": "29 Aug 2025"
        },
        {
            "title": "Chevrons-Sri Lanka whiteball series kicks off",
            "url": "https://www.newzimbabwe.com/chevrons-sri-lanka-whiteball-series-kicks-off/",
            "content": "By Sports Reporter\n\nThe Zimbabwe senior mens cricket team will kick off their white-ball series battle against Sri Lanka on Friday at Harare Sports Club.\n\nThe series will see the two sides playing two ODI games before they face off in a three-match T20I series.\n\nFor Zimbabwe, the white-ball series is part of their preparation for the upcoming World Cup Qualifiers, which they will host in October, and team captain Craig Ervine is hoping to maximise the opportunity.\n\nHaving these early eyes leading into the T20s next week and then obviously the qualifiers.\n\nI think its a nice little transition for everybody to get into tonight, and we have to do our best come matchday, said Williams.\n\nThe Chevrons walk into Fridays match coming off a poor run in Test cricket against New Zealand earlier this month at Queens Sports Club in Bulawayo, where they lost 2-0.\n\nErvine, however, added that the team has shifted focus to the coming series and hopes are high that they will stage a positive performance.\n\nThe test period was obviously tough, playing against some really good oppositions and I think guys have self-reflected a lot over the last sort of 10 to 14 days.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/01/12030952/Craig-Ervine.png",
            "description": "<p>By Sports Reporter The Zimbabwe senior men’s cricket team will kick off their white-ball series battle against Sri Lanka on Friday at Harare Sports Club. The series will see the two sides playing two ODI games before they face off in a three-match T20I series. For Zimbabwe, the white-ball series is part of their preparation</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chevrons-sri-lanka-whiteball-series-kicks-off/\">Chevrons-Sri Lanka whiteball series kicks off</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:40",
            "date": "29 Aug 2025"
        }
    ]
}