{
    "news": [
        {
            "title": "Zimbabwe asks South Africa to back G-20 debt overhaul",
            "url": "https://www.newzimbabwe.com/zimbabwe-asks-south-africa-to-back-g-20-debt-overhaul/",
            "content": "Bloomberg\n\nZimbabwehas askedSouth Africato help garner support for its debt to be revamped under the Group of 20s Common Framework, a step that could restore its access to international capital markets for the first time in more than 25 years.\n\nSouth Africa has been approached by Zimbabwe to consider assisting the country in mobilizing international support for Zimbabwes planned application for debt treatment under the Common Framework, South Africas National Treasury said in an emailed response to Bloomberg questions.\n\nSouth Africa, led byCyril Ramaphosa, currently holds the G-20 presidency and will hand over the reins later this year toUSPresidentDonald Trump.\n\nThe framework was created in 2020 to help poor nations bring together a diverse set of creditors to restructure debts. Zambia, Ethiopia and Ghana have used the template, which has been criticized for being too slow.\n\nThe framework is being explored, according to the head of Zimbabwes Public Debt Management Office Andrew Bvumbe. We want to maximize the debt relief to the country, he said Wednesday by text message.\n\nIt has appealed to 10 nations to assist in raising$2.6 billionin bridge finance but is yet to receive any concrete commitments.\n\nSouth Africa has not been approached to consider providing bridge finance to Zimbabwe, the National Treasury said.\n\nAfricas largest economy is owed $24 million by its neighbor, according to data provided by the Zimbabwean Treasury.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/08111459/harare.jpeg",
            "description": "<p>Bloomberg Zimbabwe has asked South Africa to help garner support for its debt to be revamped under the Group of 20’s Common Framework. The framework, created in 2020, helps poor nations restructure debts by bringing together a diverse set of creditors. Zimbabwe has made efforts to restructure its $21 billion debt owed to multilateral lenders</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-asks-south-africa-to-back-g-20-debt-overhaul/\">Zimbabwe asks South Africa to back G-20 debt overhaul</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:42",
            "date": "19 Jun 2025"
        },
        {
            "title": "Rights doctors push for Commission of Inquiry into Zimbabwe’s collapsing public health sector",
            "url": "https://www.newzimbabwe.com/rights-doctors-push-for-commission-of-inquiry-into-zimbabwes-collapsing-public-health-sector/",
            "content": "By Mary Taruvinga\n\nThe Zimbabwe Association of Doctors for Human Rights (ZADHR) has urged President Emmerson Mnangagwa to institute a Commission of Inquiry on the state of the health sector.\n\nThis follows Mnangagwasvisits to Parirenyatwa and Sally MugabeHospitals on Monday.\n\nThere has been an uproar over thedilapidatedstateof public hospitals where there is a lack of basic medicines, malfunctioning equipmentand low morale among the healthcare professionals.\n\nDoctors said Mnangagwa has had an opportunity to have a first-hand account of the situation and should institute an inquiry in a bid to address the challenges.\n\nZADHR believes that the visit provided President Mnangagwa with an opportunity to appreciate, first-hand, the state of public health services delivery system in Zimbabwe, which is generally plagued by dilapidated infrastructure, shortages of drugs and consumables and demoralised human resources.\n\nZADHR also takes this opportunity to urge President Mnangagwa to institute a Commission of Inquiry on the state of the health sector, said Doctors in a statement.\n\nAccording to ZADHR, the Commission of Inquiry should be mandated to enquire into the situation of health service provision by government and its agencies with a view to ensuring service delivery that responds to the obligations created by the Constitution, which under section 76 guarantees the right to health care.\n\nIn such an enquiry, the Commission of Inquiry may need to scrutinise the current health financing mechanisms in Zimbabwe and the challenges and opportunities.\n\nZimbabwes performance in relation to the Abuja Declaration commitments on health financing and the amounts raised by government using specific health-related taxes such as the sugar tax since their inception, and their utilisation and utility, and\n\nThe current situation in public hospitals, with a focus on referral institutions, including staffing levels in relation to the staff establishment for these institutions and the poor remuneration of all medical practitioners and addressing the massive exodus in this critical sector.\n\nThe process must, therefore, be robust with full engagement of public health institutions, health workers, communities and other relevant stakeholders on the state of affairs.\n\nCitizens must also be allowed to give evidence of their actual experiences of the health sector, doctors said.\n\nRecently, nurses also issued a statement urging the government to immediately intervene as the situation has already gotten out of hand.\n\nNurses said they are working under impossible conditions.\n\nAs nurses, we are working under impossible conditions. We are forced to improvise daily just to preserve life. But we cannot continue like this. The system has failed, and the suffering is unbearable.\n\nWe call on the government of Zimbabwe to urgently prioritise the health sector. Equip hospitals. Support nurses. Save lives. This situation must be addressed without delay, nurses said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/30041701/Parirenyatwa-Hospital.jpg",
            "description": "<p>By Mary Taruvinga The Zimbabwe Association of Doctors for Human Rights (ZADHR) has urged President Emmerson Mnangagwa to institute a Commission of Inquiry on the state of the health sector. This follows Mnangagwa’s visits to Parirenyatwa and Sally Mugabe Hospitals on Monday. There has been an uproar over the dilapidated state of public hospitals where there is a lack of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rights-doctors-push-for-commission-of-inquiry-into-zimbabwes-collapsing-public-health-sector/\">Rights doctors push for Commission of Inquiry into Zimbabwe’s collapsing public health sector</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:42",
            "date": "19 Jun 2025"
        },
        {
            "title": "UZ using conciliation hearings to buy time – striking lecturers say as job action clocks day 66",
            "url": "https://www.newzimbabwe.com/uz-using-conciliation-hearings-to-buy-time-striking-lecturers-say-as-job-action-clocks-day-66/",
            "content": "By Staff Reporter\n\nThe Association of University Teachers (AUT) has accused the University of Zimbabwe (UZ) of stalling negotiations while profiting from the labour of adjunct staff filling the roles of striking lecturers.\n\nWith the UZ lecturers wage strike now entering its third month, lecturers remain resolute in their demand for salaries to be raised to US$2,250.\n\nIn a recent interview with NewZimbabwe.com, AUT spokesperson Professor Obvious Vengeyi said that no substantial offer has been made by the government, despite previous assurances.\n\nAs a response to the ongoing impasse, coalition meetings among various university unions have been convened to strategise next steps, reinforcing their commitment to a united front in this labour dispute.\n\nAll state universities unions including non-academics and academics, attended conciliation hearings yesterday 17 June 2025.\n\nThe proceedings were again adjourned to 08 July 2025. We feel that this is a strategy by the employer to endlessly buy time while we are working as their slaves for free. Its cruel.\n\nBut in principle, non-academics and academics are on the same page, there is no going back.\n\nThey have resolved to join AUT in the industrial job action. There is no going back, he said.\n\nStudents also said they are worried that the situation has remained unresolved for a long time.\n\nZinasu spokesperson for UZ Chapter, Darlington Chigwena, said their future has already been compromised as the review of UZ qualifications has gone down.\n\nHe said students will fight in the corner of their lecturers because they are excessively affected.\n\nThe return of our lecturers means that we are going to have credible and quality education.\n\nWe are together with lecturers, we are working hand in glove.\n\nAlso, as students, we are not only showing substantial solidarity to the lecturers because we are aware that if they are treated in a proper manner, it means that we are going to excel as students.\n\nWe are also aware that as students we are workers in transit so if the rights are being respected it means that our rights as future workers are also going to be respected so the picket which is going to happen on Monday, we are going to partake, we are goi g to participate as students, we are going to be there as many as the sand of the sea showing our solidarity with them making sure that justice prevails both for the lecturers and the students, he said.\n\nThe next picketing will be held on Monday.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/28030530/UZ-strike-10-scaled-e1748490385375.jpg",
            "description": "<p>By Staff Reporter The Association of University Teachers (AUT) has accused the University of Zimbabwe (UZ) of stalling negotiations while profiting from the labour of adjunct staff filling the roles of striking lecturers. With the UZ lecturers’ wage strike now entering its third month, lecturers remain resolute in their demand for salaries to be raised</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uz-using-conciliation-hearings-to-buy-time-striking-lecturers-say-as-job-action-clocks-day-66/\">UZ using conciliation hearings to buy time – striking lecturers say as job action clocks day 66</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:42",
            "date": "19 Jun 2025"
        },
        {
            "title": "Mining of critical minerals tramples grazing and water rights in Zimbabwe",
            "url": "https://www.newzimbabwe.com/mining-of-critical-minerals-tramples-grazing-and-water-rights-in-zimbabwe/",
            "content": "The rise in demand for lithium to meet the production of batteries for electric cars and batteries for household solar use has come with a myriad problems. A number of lithium mines are located in Zimbabwes communal areas. The Mandihongola mine in Gwanda, the Sandawana lithium mine in Mberengwa district and the Arcadia lithium mine in Goromonzi district are all located in communal areas.\n\nThe president has the power to expropriate any land for extractive activities in terms of section 324 of the present Mines and Minerals Act. Applying this law to the present lithium deposits classified as critical minerals is rather complicated because the state has transferred exclusive rights to Chinese-owned companies to mine critical minerals.\n\nIn some cases, the lithium rock in Gwanda district is also found in nearby settlements in communal areas such as Garanyemba. Five to eight generations of people have lived in these communal rural areas and their future is at risk. There is a high possibility that already scarce water and grazing will be under threat from the lithium mining activities.\n\nA number of indigenous rights holders are deprived of scarce grazing land to accommodate mining interests and there is zero or inadequate compensation for those who reside on this land.\n\nIn a clash of interests, international human rights law comes into the picture despite there being no explicit meaning of the right to land in international law. Rural district councils do have the power to manage the use of land and powers seemingly overriding the traditional chiefs and headmens powers over the land. It is unclear what role the Rural District Council plays in stopping any activities that might, in the long run, overstep the rights of indigenous people.\n\nThe state, through its agencies such as the Ministry of Mines and the Environmental Management Agency has not been clear on the negative effects of lithium mining.\n\nSeeing that communities are not benefiting from anything save for the manual jobs whose salaries only meet the bare minimum of peoples needs, it is important that grazing and water interests are clearly protected\n\nA balance needs to be struck between mining companies seeking rights to extract minerals and indigenous people on whose land the minerals are found.\n\nCommunities such as those of Mandihongola are raising concerns regarding mining on their land. The Chinese mining company undertaking activities of lithium extraction and processing, which is reported to be about 1000 tonnes a day, is using the scarce water sources and emitting the lithium processing residue into the dam from which the cattle drink. In a community where livestock are a source of livelihood and wealth, no balance of interests has been taken into account.\n\nThere are no official statements from the Environmental Management Agency that inspections of these lithium mines have been done to ensure communities grazing and water rights are protected. Neither have there been official statements by the minister of environment, climate and tourism.\n\nThe worrying silence on the relevant players in government is a deep concern as to whether the interests of the villagers are being taken into account. Perhaps only when disaster strikes will the relevant ministries and other state agencies take such concerns seriously.\n\nThe nation is battling with land degradation and water pollution from mercury and cyanide caused by artisanal miners and bigger mining companies processing gold, which is polluting water sources. Some streams and rivers feed dams that supply water for use by urban councils.\n\nLegislation is in place for the penalties that mining companies face should they cause pollution to sources of water. For instance, section 57(1) of the Environmental Management Act imposes a fine of up to US$5000 or imprisonment not exceeding five years for any recklessness polluting water sources and damaging the environment. Rural communities do not have the capacity to stop mining companies from doing as they please\n\nFurthermore, there are no clear plans for the rehabilitation of lithium mines.\n\nWe cannot afford to sit back and turn a blind eye to any mining activities on communal land where the rights and livelihoods of people are trampled on.\n\nHoitsimolimo Mutlokwa is a post doctoral researcher at the Centre for Labour Law in the Faculty of Law at the University of the Free State.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/18175746/37f2bd2a-cattledsc_5674-1920x1345-1.jpg",
            "description": "<p>By Hoitsimolimo Mutlokwa, Mail & Guardian The rise in demand for lithium to meet the production of batteries for electric cars and batteries for household solar use has come with a myriad problems. A number of lithium mines are located in Zimbabwe’s communal areas. The Mandihongola mine in Gwanda, the Sandawana lithium mine in Mberengwa district</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mining-of-critical-minerals-tramples-grazing-and-water-rights-in-zimbabwe/\">Mining of critical minerals tramples grazing and water rights in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:42",
            "date": "19 Jun 2025"
        },
        {
            "title": "Limpopo police foils attempt to smuggle stolen vehicle into Zimbabwe",
            "url": "https://www.newzimbabwe.com/limpopo-police-foils-attempt-to-smuggle-stolen-vehicle-into-zimbabwe/",
            "content": "The Citizen\n\nLIMPOPO  A 44-year-old man was arrested for fraud and possession of a suspected stolen vehicle at Beitbridge Port of Entry on Monday afternoon.\n\nThe suspect was apprehended at the Departure Vehicle Check Point at around 15:30 while allegedly attempting to smuggle a grey Hyundai H1 into Zimbabwe.\n\nAccording to the Limpopo police spokesperson Col Malesela Ledwaba, the suspect is said to have presented fraudulent documentation for the vehicle, which had been reported stolen in Pretoria on August 12, 2024.\n\nPolice immediately took the man into custody and he has been charged with possession of a suspected stolen vehicle and fraud. The vehicle has been seized for further investigation, Ledwaba said.\n\nThe provincial police commissioner, Lt Gen Thembi Hadebe commended the officers at the port for their vigilance and swift response.\n\nThe suspect is expected to appear in the Musina Magistrates Court soon while investigations continue.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/18174906/hyundai-stolen.jpg",
            "description": "<p>The Citizen LIMPOPO – A 44-year-old man was arrested for fraud and possession of a suspected stolen vehicle at Beitbridge Port of Entry on Monday afternoon. The suspect was apprehended at the Departure Vehicle Check Point at around 15:30 while allegedly attempting to smuggle a grey Hyundai H1 into Zimbabwe. According to the Limpopo police</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/limpopo-police-foils-attempt-to-smuggle-stolen-vehicle-into-zimbabwe/\">Limpopo police foils attempt to smuggle stolen vehicle into Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:42",
            "date": "19 Jun 2025"
        },
        {
            "title": "Detergents, edible oils sector agrees to pay 70% of salaries in US$",
            "url": "https://www.newzimbabwe.com/detergents-edible-oils-sector-agrees-to-pay-70-of-salaries-in-us/",
            "content": "By Alois Vinga\n\nTHE Detergents, Edible Oils and Fats Sector has reached a Collective Bargaining Agreement (CBA) which approved to pay workers 70% of their salaries in foreign currency.\n\nThe CBA covers the period commencing January to June 30 2025. The agreement should be read as one with clause 6 (Grading and Wages) of the Agreement published in Statutory Instrument 194 of 2018 in accordance with the provisions of the Labour Act as amended.\n\nThe US$/ZWL payment ratio has been adjusted from the current 55^ US$: 45% ZWG to 70:30 split starting May 1 2025. From January 2025 to April 2025the USD: ZWG split remains at US$55% and ZWG 45%. The USD 70%: ZWG 30% portions shall be paid in the currency split. The 30% ZWG portion shall be paid at the prevailing exchange rate as at the date of Payment, the CBA reads in part.\n\nHowever, the agreement did not alter monthly allowances, which include Transport allowance and Housing Allowance, which have remained stuck at US$44,88 per month and US$61,20 per month, respectively.\n\nThe concept of 70%:30% ZWG split shall apply to NEC levies and trade union dues, the CBA added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/10/16072658/cooking-oil.jpg",
            "description": "<p>By Alois Vinga THE Detergents, Edible Oils and Fats Sector has reached a Collective Bargaining Agreement (CBA) which approved to pay workers 70% of their salaries in foreign currency. The CBA covers the period commencing January to June 30 2025. The agreement should be read as one with clause 6 (Grading and Wages) of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/detergents-edible-oils-sector-agrees-to-pay-70-of-salaries-in-us/\">Detergents, edible oils sector agrees to pay 70% of salaries in US$</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:42",
            "date": "19 Jun 2025"
        },
        {
            "title": "Getbucks corners Magaya over US$400k debt, moves to liquidate his estate",
            "url": "https://www.newzimbabwe.com/getbucks-corners-magaya-over-us400k-debt-moves-to-liquidate-his-estate/",
            "content": "By Darlington Gatsi\n\nPROPHETIC Healing and Deliverance Ministries founder Walter Magaya is in hot soup following his failure to pay a US$420,140 debt owed to GetBucks Microfinance.\n\nGetBucks has approached the High Court seeking to liquidate his estate after the cleric allegedly frustrated efforts by the company to recover its money declaring he has nothing.\n\nLast year, the High Court granted an order against the self-proclaimed prophet, his wife Tendai and their firm Planet Africa (Private) Limited in which the two are directors for payment of US$420,140.72 together with interest to Getbucks.\n\nA writ of execution was subsequently issued resulting in the attachment of the principal debtors immovable property being a certain piece of land called the Remainder of Stand 166 of Prospect measuring 3, 2323 hectares held under Deed of Transfer number 407 6118 dated 27th July 2018 by the principal debtor Planet Africa (Private) Limited which was declared executable by the High Court and was due for sale on March 28 2025 as the debt security.\n\nIn the current application, GetBucks said efforts to execute the judgement have been unsuccessful as Magaya and wife have committed acts of insolvency.\n\nThe court has been told that a couple of days before the sale in execution, the respondent voluntarily resolved to place the principal debtor under Corporate Rescue which position frustrated the sale in execution of the immovable property.\n\nThere being no further assets of the 1st and 2nd Respondent and after frustration of all execution avenues to frustrate the judgment of this court and to render it a brutum fulmen, it follows that the two are insolvent and their estates should be liquidated.\n\nThe 1st and 2nd Respondents are generally unable to pay debts which are due and payable. Procedures have been abused to frustrate execution. Entities linked to the applicant have been used to frustrate genuine execution of court orders.\n\nThese include the PHD Ministries and The Walter Magaya Family Trust, saidGetBucks in the application.\n\nIt also said Magaya and his wife are popular figures in the society with Magaya being a prophet at PHD Ministries.\n\nThe two have presented themselves as individuals with nothing and have used entities as agents. They should show the court how they are settling personal obligations and sustaining themselves, reads the application.\n\nA prima facie case has been made entitling the applicant to be granted a provisional order pending confirmation for the liquidation process to promptly commence.\n\nGetBucks also prayed for costs on a higher scale.\n\nThis is classic abuse of proceedings to frustrate court orders and the creditor. Applicant has been put out of pocket unnecessarily by the 1st Respondent and have been forced to resort to this application. Costs on a punitive scale are warranted in cases of abuse of processes, reads the application.\n\nThe matter was set down for a virtual hearing, Wednesday.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/14120808/magaya.gif",
            "description": "<p>By Darlington Gatsi PROPHETIC Healing and Deliverance Ministries founder Walter Magaya is in hot soup following his failure to pay a US$420,140 debt owed to GetBucks Microfinance. GetBucks has approached the High Court seeking to liquidate his estate after the cleric allegedly frustrated efforts by the company to recover its money declaring he has nothing.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/getbucks-corners-magaya-over-us400k-debt-moves-to-liquidate-his-estate/\">Getbucks corners Magaya over US$400k debt, moves to liquidate his estate</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:42",
            "date": "19 Jun 2025"
        }
    ]
}