{
    "news": [
        {
            "title": "Zimbabwe says informal sector dominates 76% of the economy",
            "url": "https://www.newzimbabwe.com/zimbabwe-says-informal-sector-dominates-76-of-the-economy/",
            "content": "Bloomberg\n\nZimbabweestimates that more than three-quarters of economic activity takes place in the informal sector, depriving the government of much-needed tax revenue, according to the findings of its first economic census.\n\nWhile the high level of informalization has increasingly become a significant source of livelihoods, its contribution to government revenue remains minimal due to non-compliance with the formal tax system, the Zimbabwe National Statistics Agency said in a report released in the capital, Harare, on Wednesday.\n\nGrowing informalization is a critical risk to the economy as less than one quarter of formal businesses carry the tax burden, according to the Confederation of Zimbabwe Industries, the nations largest industry body.\n\nFormal businesses are being squeezed, MacDonald Mutengo, CZIs lead research officer, said at the event. Companies are not making profits, they are highly regulated.\n\nThe informal sector has flourished as formal jobs evaporated due to decades of economic mismanagement that led to repeated currency collapses and bouts of hyperinflation.\n\nThe census surveyed 204,798 businesses across a range of sectors, including financial services and construction. The wholesale and retail trade sector accounted for most economic activity, contributing 73%, followed by manufacturing at 8%.\n\nBulawayo province had the highest concentration of formal businesses at 40%, compared with less than 30% in other regions.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/19181244/Vendors-4.jpg",
            "description": "<p>Bloomberg Zimbabwe estimates that more than three-quarters of economic activity takes place in the informal sector, depriving the government of much-needed tax revenue, according to the findings of its first economic census. While the high level of informalization has “increasingly become a significant source of livelihoods, its contribution to government revenue remains minimal due to non-compliance</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-says-informal-sector-dominates-76-of-the-economy/\">Zimbabwe says informal sector dominates 76% of the economy</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:14",
            "date": "24 Jul 2025"
        },
        {
            "title": "This celebrity lifestyle kills you – Andy Muridzo announces retirement from music",
            "url": "https://www.newzimbabwe.com/this-celebrity-lifestyle-kills-you-andy-muridzo-announces-retirement-from-music/",
            "content": "By Tapiwa Svondo\n\nCONTEMPORARY musician Andy Muridzo has announced he will step away from the music scene after the release of his forthcoming album Chakanyuka, citing that the pressures of being a celebrity were taking a toll on him.\n\nChakanyuka will mark the end of Muridzos music career, which has spanned just over a decade and seen him become a household name with hits like Dherira and Chidhafudhunda.\n\nMuridzo took to Facebook, revealing that he felt music was not his true purpose.\n\nIm writing to inform you the family of Muridzo that CHAKANYUKA will be my last album. I never wanted to take music as my career, but one person I believe in most gave me the courage to move forward with my God given talent.\n\nI will forever love my fans and family, but after this forthcoming album, I will no longer take music as my career again: rather as using my talent and fame to journey into my true purpose, which is healing people spiritually.\n\nIm tired of this celebrity lifestyle; It kills you within. I tried being brave while being insulted by everyone, including people you call your own, he wrote.\n\nBaba Keketso who is not new to controversy, has once in a while, found himself receiving backlash for his love scandals.\n\nI sing from the bottom of my heart just to make you happy and well entertained, but when I try Im insulted and given names which dont suit me.\n\nI know a lot of my fans will not be happy to hear this, but I am tired of trying to prove myself to a nation that never appreciates.\n\nI love music with my life, but here I have become small. I will sing for my kids at home after this album. I think this is not what I was born to do. God help me locate my true purpose, he added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/23185732/andy.jpg",
            "description": "<p>By Tapiwa Svondo CONTEMPORARY musician Andy Muridzo has announced he will step away from the music scene after the release of his forthcoming album ‘Chakanyuka’, citing that the pressures of being a “celebrity” were taking a toll on him. ‘Chakanyuka’ will mark the end of Muridzo’s music career, which has spanned just over a decade</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/this-celebrity-lifestyle-kills-you-andy-muridzo-announces-retirement-from-music/\">This celebrity lifestyle kills you – Andy Muridzo announces retirement from music </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:14",
            "date": "24 Jul 2025"
        },
        {
            "title": "Top UN court says countries can sue each other over climate change",
            "url": "https://www.newzimbabwe.com/top-un-court-says-countries-can-sue-each-other-over-climate-change/",
            "content": "BBC\n\nA landmark decision by a top UN court has cleared the way for countries to sue each other over climate change, including over historic emissions of planet-warming gases.\n\nBut the judge at the International Court of Justice in the Hague, Netherlands on Wednesday said that untangling who caused which part of climate change could be difficult.\n\nThe ruling is non-binding but legal experts say it could have wide-ranging consequences.\n\nIt will be seen as a victory for countries that are very vulnerable to climate change, who came to court after feeling frustrated about lack of global progress in tackling the problem.\n\nThe unprecedented case at the International Court of Justice (ICJ) was the brainchild of a group of young law students from low-lying Pacific islands on the frontlines of climate change, who came up with the idea in 2019.\n\nOne of those students, Siosiua Veikune from Tonga, was in the Hague to hear the decision.\n\nIm lost for words. This is so exciting. Theres a ton of emotions rushing through us. This is a win we take proudly back home to our communities, he told BBC News.\n\nTonight Ill sleep easier. The ICJ has recognised what we have lived through  our suffering, our resilience and our right to our future, said Flora Vano, from the Pacific Island Vanuatu, which is considered the country most vulnerable to extreme weather globally.\n\nThis is a victory not just for us but for every frontline community fighting to be heard.\n\nThe ICJ is considered the worlds highest court and it has global jurisdiction. Lawyers have told BBC News that the opinion could be used as early as next week, including in national courts outside of the ICJ.\n\nCampaigners and climate lawyers hope the landmark decision will now pave the way for compensation from countries that have historically burned the most fossil fuels and are therefore the most responsible for global warming.\n\nMany poorer countries had backed the case out of frustration, claiming that developed nations are failing to keep existing promises to tackle the growing problem.\n\nBut developed countries, including the UK, argued that existing climate agreements, including the landmark UN Paris deal of 2015, are sufficient and no further legal obligations should be imposed.\n\nOn Wednesday the court rejected that argument.\n\nJudge Iwasawa Yuji also said that if countries do not develop the most ambitious possible plans to tackle climate change this would constitute a breach of their promises in the Paris Agreement.\n\nHe added that broader international law applies, which means that countries which are not signed up to the Paris Agreement  or want to leave, like the US  are still required to protect the environment, including the climate system.\n\nThe courts opinion is advisory, but previous ICJ decisions have been implemented by governments, including when the UK agreed to hand back the Chagos Islands to Mauritius last year.\n\nThe ruling is a watershed legal moment, said Joie Chowdhury, Senior Attorney at the Centre for International Environmental Law (CIEL).\n\nWith todays authoritative historic ruling, the International Court of Justice has broken with business-as-usual and delivered a historic affirmation: those suffering the impacts of climate devastation have a right to remedy for climate harm, including through compensation, she added.\n\nA spokesperson for the UKs Foreign, Commonwealth and Development Office said it was taking time to look at the opinion before commenting in detail, but added:\n\nTackling climate change is and will remain an urgent UK and global priority. Our position remains that this is best achieved through international commitment to the UNs existing climate treaties and mechanisms.\n\nThe court ruled that developing nations have a right to seek damages for the impacts of climate change such as destroyed buildings and infrastructure.\n\nIt added that where it is not possible to restore part of a country then its government may want to seek compensation.\n\nThis could be for a specific extreme weather event if it can be proved that climate change caused it, but the Judge said this would need to be determined on a case by case basis.\n\nThis is a huge win for climate vulnerable states. Its a huge win for Vanuatu, which led this case and is going to change the face of climate advocacy, said barrister Stephanie Robinson at Doughty Street Chambers, who represented the Marshall Islands.\n\nIt is not clear how much an individual country could have to pay in damages if any claim was successful.\n\nBut previous analysis published in Nature, estimated that between 2000 and 2019 there were $2.8 trillion losses from climate change  or $16 million per hour.\n\nDuring the evidence sessions in December, the court heard from dozens of Pacific Islanders who have been displaced as a result of rising sea level, caused by climate change.\n\nThe Marshall Islands highlighted that the costs for their island to adapt to climate change are $9 billion.\n\nThat is $9 billion the Marshall Islands does not have. Climate change is a problem they have not caused, but they are forced to consider relocating their capital, said Ms Robinson.\n\nAs well as compensation, the court also ruled that governments were responsible for the climate impact of companies operating in their countries.\n\nIt said specifically that subsidising the fossil fuel industry or approving new oil and gas licenses could be in breach of a countrys obligations.\n\nDeveloping countries are already exploring bringing new cases seeking compensation for historic contributions to climate change against richer, high emitting nations citing the ICJ opinion, according to lawyers the BBC spoke to.\n\nIf a country wants to bring a case back to the ICJ to make a ruling on compensation then it can only do so against countries which have agreed to its jurisdiction, which includes the likes of the UK, but not US or China.\n\nBut a case can be brought in any court globally, whether that be domestic or international, citing the ICJ opinion, explained Joie Chowdhury from CIEL.\n\nSo instead a country may choose to take their case not to the ICJ but a court where those countries are bound e.g. federal courts in the US.\n\nBut the question remains whether the ICJ opinion will be respected.\n\n[The ICJ] is an institution that is subject to geopolitics  and it relies on states adhering to its judgements, it doesnt have a police force, said Harj Narulla, a climate barrister at Doughty Street Chambers, which also represented the Solomon Islands.\n\nWhen asked about the decision, a White House spokesperson told BBC News:\n\nAs always, President Trump and the entire Administration is committed to putting America first and prioritising the interests of everyday Americans.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/23204139/court-climate-change.webp",
            "description": "<p>BBC A landmark decision by a top UN court has cleared the way for countries to sue each other over climate change, including over historic emissions of planet-warming gases. But the judge at the International Court of Justice in the Hague, Netherlands on Wednesday said that untangling who caused which part of climate change could</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/top-un-court-says-countries-can-sue-each-other-over-climate-change/\">Top UN court says countries can sue each other over climate change</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:14",
            "date": "24 Jul 2025"
        }
    ]
}