{
    "news": [
        {
            "title": "Schoolchildren swept away as heavy floods and snow hit South Africa",
            "url": "https://www.newzimbabwe.com/schoolchildren-swept-away-as-heavy-floods-and-snow-hit-south-africa/",
            "content": "BBC\n\nA minibus carrying schoolchildren has been swept away by heavy flooding in South Africa, a spokesperson for the Eastern Cape provincial government has told the BBC.\n\nKhuselwa Rantjie said it was unclear how many children were on the bus, but three had so far been found alive. Rescue efforts had been suspended as night had fallen and would resume on Wednesday, she added.\n\nIn a separate incident, the bodies of seven people carried away by flood water have been found in the provinces OR Tambo district.\n\nSouth Africa has been hit by heavy snow, rains and gale force winds that have claimed the lives of a further five people in a road accident, and have left nearly 500,000 homes without electricity.\n\nThe Eastern Cape  the birthplace of anti-apartheid icon Nelson Mandela  has been worst-affected by the icy conditions, along with KwaZulu-Natal province.\n\nThe bad weather has forced the closure of some major roads in the two provinces to avoid further casualties.\n\nThis is a devastating reminder of natures force. We urge everyone to exercise extra caution in areas prone to flooding, Eastern Cape premier Oscar Mabuyane said in a statement.\n\nFive people died when a minibus taxi overturned near the coastal city of East London, with the driver saying he had lost control as he was trying to avoid a fallen tree, Eastern Cape transport department spokesperson, Unathi Binqose, told the BBC.\n\nTwo people were injured in the accident, he added.\n\nState power utility Eskom said that almost 300,000 homes had been hit by electricity cuts in 14 towns and villages in Eastern Cape.\n\nA further 196,000 homes in 24 areas in KwaZulu-Natal were also experiencing power cuts, Eskom spokesperson Daphne Mokwena told the BBC.\n\nKwaZulu-Natal Transport Minister Siboniso Duma said that heavy snow had led to lorries being stuck on roads, causing huge congestion.\n\nGrader machines have been stationed on worst-affected roads to clear snow before it reached more than 30cm (12in) in depth.\n\nMeteorologist Lehlohonolo Thobela also warned of strong winds and heavy waves at sea, making navigation for ships difficult.\n\nBoth Eastern Cape and KwaZulu-Natal are along the coast.\n\nSouth Africa regularly receives snowfall during its winter months, from June through August, with temperatures diving below 0C (32F).\n\nThere is also regular flooding and scientists say that climate change is causing heavier rainfall in the region.\n\nFlash floods and overflowing rivers between 30 April and 2 Maycaused significant damage to about 4,500 homes, and left 18 people injured.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/10195937/SA-Snow.webp",
            "description": "<p>BBC A minibus carrying schoolchildren has been swept away by heavy flooding in South Africa, a spokesperson for the Eastern Cape provincial government has told the BBC. Khuselwa Rantjie said it was unclear how many children were on the bus, but three had so far been found alive. Rescue efforts had been suspended as night</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/schoolchildren-swept-away-as-heavy-floods-and-snow-hit-south-africa/\">Schoolchildren swept away as heavy floods and snow hit South Africa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "10 Jun 2025"
        },
        {
            "title": "‘Uthini wena Temu Ndlozi?’: McKenzie clashes with EFF’s Sihle Lonzi over illegal foreigners",
            "url": "https://www.newzimbabwe.com/uthini-wena-temu-ndlozi-mckenzie-clashes-with-effs-sihle-lonzi-over-illegal-foreigners/",
            "content": "TimesLive\n\nPA leader and sport, arts and culture minister Gayton McKenzie has responded to EFF student command leader Sihle Lonzis accusations that he has abandoned his cause to fight against illegal immigrants.\n\nLonzi claimed McKenzie has not proposed any legislation on the subject, despite his partys stance on the issue.\n\nThe PA does not care about illegal foreigners, Lonzi said. Never let them lie to you. Its leader McKenzie is now a minister. He has never proposed legislation on the subject, not even a private members bill as an MP. He is just enjoying blue lights.\n\nMcKenzie swiftly responded to Lonzis accusations, asking, Uthini wena Temu Ndlozi? (What are you saying Ndlozi from Temu?). Start by telling us, do you even care?\n\nLonzi, however, was unfazed and accused McKenzie of avoiding parliamentary committee meetings. You must stop running away from parliament committee meetings. I will take you to the cleaners.\n\nThe debate stems from social media users concerns about McKenzies perceived change of attitude towards illegal foreigners.\n\nHowever, McKenzie has always reaffirmed his stance against illegal immigration, saying his partys mission remains unchanged.\n\nI speak up forAbahambe[they must leave] in closed government meetings and PA rallies. I have and will never change my stance regarding the mass deportation of all illegal foreigners but to expect me to only speak about immigration when there is a home affairs minister is wrong.Abahambeis our mission as the PA. We have and will never change. We have taken a decision to fight from within the GNU.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/10182059/gayton-eff-lonzi.jpg",
            "description": "<p>TimesLive PA leader and sport, arts and culture minister Gayton McKenzie has responded to EFF student command leader Sihle Lonzi’s accusations that he has abandoned his cause to fight against illegal immigrants. Lonzi claimed McKenzie has not proposed any legislation on the subject, despite his party’s stance on the issue. “The PA does not care</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uthini-wena-temu-ndlozi-mckenzie-clashes-with-effs-sihle-lonzi-over-illegal-foreigners/\">‘Uthini wena Temu Ndlozi?’: McKenzie clashes with EFF’s Sihle Lonzi over illegal foreigners</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "10 Jun 2025"
        },
        {
            "title": "The work of cybercriminals – Chamisa claims X account hacked after cryptocurrency launch",
            "url": "https://www.newzimbabwe.com/the-work-of-cybercriminals-chamisa-claims-x-account-hacked-after-cryptocurrency-launch/",
            "content": "By Staff Reporter\n\nOPPOSITIONleader Nelson Chamisahas claimed hisX account was hackedafter he appeared to have launched a digital currency called God Is In It($GIT) and promoted it on his page.\n\nThe hackers gained access to Chamisas X account early on Tuesday, posting images and videos of Chamisa in a morning gown, endorsing the God Is In It digital currency.\n\nTo my fellow citizens, I wish to kindly inform you that my X (formerly Twitter) account has been hacked and compromised by cybercriminals, Chamisa posted on his WhatsApp channel moments later.\n\nOur cybersecurity team is working diligently with X support team to fix this problem, regain control and implement remedial measures. We will keep you updated on the status of the account recovery and any actions being taken.\n\nBy midday, Chamisas X account had removed all the unusual posts from his timeline and appeared to have regained control of the account.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/08/28082345/chamisa_.jpg",
            "description": "<p>By Staff Reporter OPPOSITION leader Nelson Chamisa has claimed his X account was hacked after he appeared to have launched a digital currency called “God Is In It ($GIT)” and promoted it on his page. The hackers gained access to Chamisa’s X account early on Tuesday, posting images and videos of Chamisa in a morning gown, endorsing the “God Is</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/the-work-of-cybercriminals-chamisa-claims-x-account-hacked-after-cryptocurrency-launch/\">The work of cybercriminals – Chamisa claims X account hacked after cryptocurrency launch</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "10 Jun 2025"
        },
        {
            "title": "‘Shielded from arrest’: What Supreme Court of Appeal ruling means for 180,000 Zimbabweans in South Africa",
            "url": "https://www.newzimbabwe.com/shielded-from-arrest-what-supreme-court-of-appeal-ruling-means-for-180000-zimbabweans-in-south-africa/",
            "content": "IOL\n\nThe Supreme Court of Appeal has dismissed with costs the Department of Home Affairs attempt to overturn an interim interdict, previously granted in favour of the Zimbabwe Immigration Federation, protectingnearly 200,000 Zimbabwean Exemption Permit (ZEP) holdersagainst arrest and deportation.\n\nAfter winning Part A of the court wrangle, the federation will be heading back to the court, for Part B, to argue before court that the Department of Home Affairs overreached in 2021, when the then home affairs minister Aaron Motsoaledi announced the termination of the ZEP.\n\nThe special permit dispensation has allowed 180,000 Zimbabwean nationals to live and work in South Africa since 2009.\n\nIn the federations view, the jurisdiction to terminate the ZEP lies with Parliament, not the minister.\n\nIOL had an interview with Vindren Magadzire, director of the Zimbabwe Immigration Federation who said his organisations case revolves around the termination of the ZEP programme by the minister of home affairs.\n\nVindren Magadzire, director of the Zimbabwe Immigration Federation Image:Supplied\n\nThe programme allowed approximately 180,000 Zimbabweans to live and work in South Africa. In 2021, the minister of home affairs announced plans to terminate the ZEP permits, sparking legal actions from the Zimbabwe Immigration Federation, Magadzire told IOL.\n\nThe Zimbabwe Immigration Federation was inspired to go through courts due to the South African minister of home affairs decision to terminate the permits. The decision would have significant implications for approximately 180,000 Zimbabweans living and working in South Africa under the ZEP permit program.\n\nMagadzire said his organisation is requesting the superior court to declare the termination of the ZEP permits unlawful, setting aside the termination decision, and protecting permit holders rights.\n\nIn Magadzires view, a lasting solution would be granting the ZEP holders permanent residence status in South Africa.\n\nThe latest development in the court case is that the Supreme Court of Appeal dismissed the minister of home affairs appeal. This decision upholds a Johannesburg High Court interdict that shields approximately 180,000 ZEP holders from arrest and deportation, said Magadzire.\n\nLast year,IOL reported thatthe High Court in Pretoria heard arguments from the Helen Suzman Foundation to enforce the courts order that the ZEP remains valid, while the minister of home affairs conducts a fair and rational inquiry into the impact of its termination.\n\nThe foundation turned to court in a bid to give ZEP holders a lifeline.\n\nWhen the minister first signalled his intention to appeal the courts June 2023 judgment, the foundation asked him to leave the ZEP in place until he exhausted the appeal process. The minister refused, Nicole Fritz, executive director of the foundation said at the time.\n\nThe court had held earlier that the ministers appeal had no prospects of success. Home Affairs then decided to turn to the Supreme Court of Appeal.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/06/30214201/zep.webp",
            "description": "<p>IOL The Supreme Court of Appeal has dismissed with costs the Department of Home Affairs’ attempt to overturn an interim interdict, previously granted in favour of the Zimbabwe Immigration Federation, protecting nearly 200,000 Zimbabwean Exemption Permit (ZEP) holders against arrest and deportation. After winning Part A of the court wrangle, the federation will be heading back</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/shielded-from-arrest-what-supreme-court-of-appeal-ruling-means-for-180000-zimbabweans-in-south-africa/\">‘Shielded from arrest’: What Supreme Court of Appeal ruling means for 180,000 Zimbabweans in South Africa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "10 Jun 2025"
        },
        {
            "title": "Local coach in Harare suspended after Raza files complaint alleging racial abuse",
            "url": "https://www.newzimbabwe.com/local-coach-in-harare-suspended-after-raza-files-complaint-alleging-racial-abuse/",
            "content": "\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/29131339/Sikandar-Raza-1.jpg",
            "description": "<p>ESPNCricinfo Sikandar Raza has lodged a complaint with the Harare Metropolitan Cricket Association (HMCA), accusing a local coach – Blessing Mafuwa – of racial abuse during a Vigne Cup game on June 1. Raza was playing for Old Hararians against Rainbow Cricket Club at the Old Hararians Sports Club when the alleged incident took place. ESPNcricinfo</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/local-coach-in-harare-suspended-after-raza-files-complaint-alleging-racial-abuse/\">Local coach in Harare suspended after Raza files complaint alleging racial abuse</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "10 Jun 2025"
        },
        {
            "title": "4,912 injuries, 76 fatalities recorded in workplaces in 2024",
            "url": "https://www.newzimbabwe.com/4912-injuries-76-fatalities-recorded-in-workplaces-in-2024/",
            "content": "By Alois Vinga\n\nTHE Zimbabwe Congress of Trade Unions (ZCTU) says a total 4 912 injuries and 76 fatalities were recorded in 2024, prompting calls for urgent combative measures.\n\nVarious factors, including human error, equipment malfunction, and environmental hazards, can contribute to workplace accidents.\n\nIn a speech read on behalf of the ZCTU President, Florence Taruvinga, to mark this years June 6 commemorations, the labour organ revealed that workplace injuries and fatalities rose significantly during the period.\n\nIn 2024, Zimbabwe experienced a concerning rise in occupational injuries and fatalities. It is reported that there were 4,912 injuries and 76 fatalities throughout the year. What about those accidents that went unreported? It is our demand that we cannot continue to suffer from workplace neglect as workers without the responsible authorities being brought to account for the injuries and deaths being experienced in the workplace, she said.\n\nTaruvinga said the mining industry has become synonymous with unsafe shafts, equipment failure, and weak regulations that are causing unnecessary deaths.\n\nIn Agriculture, she said, employees work without personal protective equipment and are exposed to chemicals, heat stress, and poor living conditions, while in the retail and commercial sectors, workers are exposed to long hours of work, job insecurity and poor ergonomics.\n\nTaruvinga said that in the informal sector, over 80% of workers operate with no safety laws, medical care, or recognisable rights, while the transport and manufacturing sectors have also not been spared, as workers work with very dangerous old and archaic machinery, poorly maintained and without proper safety nets.\n\nAs the voice of workers, we clearly pronounce that enough is enough. We demand the following: Full enforcement of OSH laws across all economic sectors, establishment of functional health and safety committees in every workplace and access to adequate PPE, occupational health training, and medicalservices for all workers, added Taruvinga.\n\nThe June 6 commemorations are held annually to reflect on the Kamandama Mine Disaster, in which 427 miners were killed in 1972 in a mine explosion. The accident, which was attributed to a methane gas explosion, forced the permanent closure of the mine.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/07/06173942/mine.webp",
            "description": "<p>By Alois Vinga THE Zimbabwe Congress of Trade Unions (ZCTU) says a total 4 912 injuries and 76 fatalities were recorded in 2024, prompting calls for urgent combative measures.    Various factors, including human error, equipment malfunction, and environmental hazards, can contribute to workplace accidents.   In a speech read on behalf of the ZCTU President, Florence</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/4912-injuries-76-fatalities-recorded-in-workplaces-in-2024/\">4,912 injuries, 76 fatalities recorded in workplaces in 2024  </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "10 Jun 2025"
        }
    ]
}