{
    "news": [
        {
            "title": "‘Even white Zimbabweans are returning’: Zanu-PF insists exiles are flocking back home",
            "url": "https://www.newzimbabwe.com/even-white-zimbabweans-are-returning-zanu-pf-insists-exiles-are-flocking-back-home/",
            "content": "IOL\n\nMany Zimbabweans who left the country at the peak of economic and political turmoil, and settled in numerous countries, including South Africa, are now investing back home, while others are returning to their ancestral nation.\n\nThese were the views expressed by Zanu PF national spokesperson, Christopher Mutsvangwa, who was recently in South Africa forthe 2025 Liberation Movements Summit hosted by the African National Congress (ANC) in Kempton Park.\n\nThe summit concluded on Monday and was hosted under the theme: Defending the liberation gains, advancing integrated socio-economic development, strengthening solidarity for a better Africa.\n\nSouthern African liberation movements, including the ANC, Peoples Movement for the Liberation of Angola (MPLA), Namibias ruling party, the South West Africa Peoples Organisation (Swapo); Mozambiques Frente de Libertao de Moambique (Frelimo); Zanu-PF, and Tanzanias ruling Chama Cha Mapinduzi (CCM) were represented at high level at the summit in Gauteng.\n\nMutsvangwa, in an interview withbroadcaster Newzroom Afrika, was asked for his views on the prevailing political and economic situation in Zimbabwe, which has resulted in the extensive migration of Zimbabweans into South Africa, estimated in the millions, sparking tensions in South African communities.\n\nIn his response, Mutsvangwa said Zimbabweans in South Africa are seeking greener pastures, but the situation back home has significantly improved.\n\nIt is the search for better pastures, that is natural. South Africa had the advantage of having comparative access to capital as a white apartheid state. In colonial times, capital into Africa followed white, and South Africa has the biggest white population on the African continent. All those Western countries gave South Africa a certain edge in access to capital.\n\nWe in Zimbabwe/Rhodesia were second in terms of our white population. We also had comparatively better access to capital than any other African country, and we had migration of labour from Mozambique, Malawi, and Zambia into Zimbabwe.\n\nThe former Zimbabwean ambassador to the Peoples Republic of China said people follow where they see an advantage in terms of development and capital.\n\nNow things have changed. We are now having capital in a flat global world where China can supply capital, India can supply capital, Riyadh can supply capital, so we now have an Africa that is going to global markets, getting capital. That discrepancy in access to capital, which was the case for the colonial era, is beginning to disappear.\n\nYou cannot believe it, there is now a seamless environment between life in Zimbabwe and life abroad. That is why our diaspora is coming back to Zimbabwe, putting a lot of money  our diaspora feels at home, they are now beginning to invest at home. For your information, the biggest diaspora migration is white.\n\nHe said the white Zimbabweans who had fled the country at the onset of majority rule in 1980 make up a good number of the people moving back into the landlocked Southern African nation ruled by President Emmerson Mnangagwa.\n\nSo the return of the white diaspora back to Zimbabwe is actually an indication that things are getting better in Zimbabwe. Remember we are operating the hardest currency in the world, the US dollar, and if you can make your economy succeed on the back of the US dollar, it means you are doing very well as a country, said theWar Veterans Association chairperson.\n\nSpeaking to IOL,Dr Alexander Rusero, head of the department of international relations and diplomacy at the Africa University situated in Mutare, Zimbabwe, said the landlocked country seemingly has its worst times behind it  economically and politically.\n\nI think in all fairness, Zimbabwe has had its bad tide and we are definitely past that in as much as the mess we were once in as a country is concerned. That explains why you hear an opposition voice. We are as good as not having an opposition in Zimbabwe, and if you want to look at Zimbabwes dynamics currently, just look at the balance of forces within Zanu-PF.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/16052318/InShot_20240415_165630255-scaled.jpg",
            "description": "<p>IOL Many Zimbabweans who left the country at the peak of economic and political turmoil, and settled in numerous countries, including South Africa, are now investing back home, while others are returning to their ancestral nation. These were the views expressed by Zanu PF national spokesperson, Christopher Mutsvangwa, who was recently in South Africa for the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/even-white-zimbabweans-are-returning-zanu-pf-insists-exiles-are-flocking-back-home/\">‘Even white Zimbabweans are returning’: Zanu-PF insists exiles are flocking back home</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:56",
            "date": "30 Jul 2025"
        },
        {
            "title": "Almost half of Zimbabwe’s youth population is idle –  Statistics Agency says",
            "url": "https://www.newzimbabwe.com/almost-half-of-zimbabwes-youth-population-is-idle-statistics-agency-says/",
            "content": "By Alois Vinga\n\nA total 49,2% of Zimbabwes youth population is Not in Education, Employment or Training (NEET), the Zimbabwe National Statistics Agency (Zimstat) data has revealed.\n\nThe stats agency data contained in the Second Quarter Labour Force Survey (QLFS) says 49, 2% of youths aged between 15 to 35 years fall under the NEET category. Females are the worst affected with 57, 4% compared to 40,4% men under the bracket.\n\nThe worst affected province during the period was Mashonaland Central with a rate of 58, 1% followed by Matabeleland North at 53, 8% and Matabeleland South at 52,4%. Bulawayo Province had the lowest rate at 38,5%.\n\nThe data shows that across the provinces, female youths are the worst affected after scoring much higher percentages than their male counterparts. Proportions of youth not in education, employment or training (NEET) for the age group 15-24 years, was 38.5 percent in Bulawayo province and 46.0 percent in Masvingo province.\n\nThe United NationsPopulationFund has since reported that Zimbabwe is likely to miss its opportunity to derive thedemographicdividend(DD) from its youthfulpopulation.\n\nDD  refers to the temporary economic benefits that can arise from a significant increase in that can arise from a significant increase in the ratio of working age adults as a result of rapid fertility decline. The firstdemographic dividendopened before 1990 and reached a peak in 2013 and is now in the diminishing returns phase.\n\nAccording to the report, the expanded Unemployment Rate for the country stood at 37,1% , with youth in the 15 to 24 age band being hardest hit at 58,2% and those between 15 to 35 standing at 46,1%.\n\nThe unemployment rate for Midlands province was 21.8 percent. Female unemployment rate for the province was 20.8 percent while the male unemployment rate was 23.3 percent.\n\nThe unemployment rate for persons with at least one form of functional disability was 23.8 percent.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/16221726/Youth-Unemployment.png",
            "description": "<p>By Alois Vinga A total 49,2% of Zimbabwe’s youth population is Not in Education, Employment or Training (NEET), the Zimbabwe National Statistics Agency (Zimstat) data has revealed. The stats agency data contained in the Second Quarter Labour Force Survey (QLFS) says 49, 2% of youths aged between 15 to 35 years fall under the NEET</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/almost-half-of-zimbabwes-youth-population-is-idle-statistics-agency-says/\">Almost half of Zimbabwe’s youth population is idle –  Statistics Agency says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:56",
            "date": "30 Jul 2025"
        },
        {
            "title": "Zimbabwe, UAE sign health cooperation deal",
            "url": "https://www.newzimbabwe.com/zimbabwe-uae-sign-health-cooperation-deal/",
            "content": "By Thandiwe Garusa\n\nZIMBABWE has signed a Memorandum of Understanding (MoU) with the United Arab Emirates (UAE) aimed at strengthening healthcare systems in both countries.\n\nThe cooperation covers a wide range of healthcare areas, including primary and specialist care, emergency preparedness, health financing, workforce development, and the use of technology to improve service delivery and health outcomes.\n\nTwo months back, the government also signed separate MoUs with China and Belarus to refurbish the biggest referral hospital, Parirenyatwa.\n\nSpeaking during a post-cabinet media briefing on Tuesday, Information Minister Jenfan Muswere said the MoU aims to strengthen healthcare systems and improve health outcomes in both countries through mutual cooperation based on respect, equality, and shared benefit.\n\nCabinet considered and approved the MoU between the Republic of Zimbabwe and the Government of United Arab Emirates on Cooperation in the field of health.\n\nThe MOU aims to establish a collaborative framework between the two countries to foster mutual growth, development, and enhancement of healthcare systems within their respective territories.\n\nThe scope of cooperation encompasses various healthcare domains, including Primary Care, which comprises collaborative efforts in reproductive, maternal, neonatal, child, and adolescent health, as well as immunisation programs.\n\nSecondary Care, which comprises specialist care and patient referral services, laboratory services, forensic pathology, and blood services, Muswere said.\n\nHe added: Health system resilience, whose key aspect is preparing for and responding to public health emergencies.\n\nHealth financing, which enables both countries to explore innovative funding models, share financial expertise, and optimise resource allocation to achieve better health outcomes.\n\nHuman resources, which focuses on developing and managing healthcare professionals; and health technology, which aims to leverage health technology to improve healthcare delivery, enhance patient care, and streamline healthcare services.\n\nPublic hospitals in Zimbabwe are struggling to efficiently serve patients due to shortages of basic medical supplies, rundown infrastructure, and poorly paid staff, which has led to massive brain drain and low morale.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/09054809/muswere.jpeg",
            "description": "<p>By Thandiwe Garusa ZIMBABWE has signed a Memorandum of Understanding (MoU) with the United Arab Emirates (UAE) aimed at strengthening healthcare systems in both countries. The cooperation covers a wide range of healthcare areas, including primary and specialist care, emergency preparedness, health financing, workforce development, and the use of technology to improve service delivery and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-uae-sign-health-cooperation-deal/\">Zimbabwe, UAE sign health cooperation deal</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:56",
            "date": "30 Jul 2025"
        },
        {
            "title": "Businessman granted direct access to Constitutional Court in legal fight with former Zupco chairperson",
            "url": "https://www.newzimbabwe.com/businessman-granted-direct-access-to-constitutional-court-in-legal-fight-with-former-zupco-chairperson/",
            "content": "By Mary Taruvinga\n\nThe Constitutional Court of Zimbabwe has granted direct access to businessman Jayesh Shah, the applicant, allowing him to challenge a prior decision made by the Supreme Court in a case he was ordered to pay US$130,000 to former Zupco chairperson Charles Nherera for malicious prosecution.\n\nIn the case, Shah aims to contest the Supreme Courts handling of his appeal against the above order relating to issues of malicious prosecution, arrest, and detention stemming from an ongoing legal battle with Nherera.\n\nThe complex legal saga traces back over two decades, originating from business dealings between Shahs company, Gift Investments (Private) Limited, and ZUPCO.\n\nThe conflict escalated following allegations of corruption, a bribery scandal that led to criminal charges against both parties, and ultimately a conviction for Nherera that was later overturned, resulting in a civil suit against Shah for wrongful prosecution, which claims damages totalling $400,000.\n\nNherera had claimed US$400,000 but the High Court ruled that the amount was too high.\n\nJustice Nicholas Mathonsi ordered Shah to compensate Nherera of US$130,000, which could be paid in local currency at the official exchange rate.\n\nUnhappy with the decision, Shah then approached the Supreme Court.\n\nThe Supreme Court previously upheld a decision awarding Nherera damages for malicious prosecution and arrest and Shah argues without sufficient evidence of how these damages were computed, raising eyebrows about the integrity of the legal process.\n\nShah, arguing that the Supreme Court decisions violated his rights to a fair hearing and equal protection under the law, sought direct access to the Constitutional Court.\n\nJustice Rita Makarau upheld his application, emphasising the importance of reviewing the Supreme Courts findings that were deemed binding on the trial courta decision that raised concerns of jurisdiction and independence when adjudicating the case.\n\nMakarau observed that the trial court appeared to surrender its authority, attributing overwhelming weight to the Supreme Courts acknowledgement of a prima facie case against Shah.\n\nIn summary, it appears to me that the trial court was conducted in a grossly irregular fashion, thereby robbing it of the fairness that is a prerequisite of a trial under the law.\n\nThe trial court wrongly and wrongfully surrendered its jurisdiction in the matter to the appeal court, again robbing the trial of the prerequisite that it must be before an independent and impartial judicial officer.\n\nThese irregularities could, and in my view, should have been reviewed by the court a quo. I venture to say that the irregularities would have been corrected had the correct law been applied, she said.\n\nThe Courts decision pointed out serious irregularities in the trial process, suggesting that the trial courts conduct signified a deprivation of Shahs constitutional rights.\n\nMakarau JCC noted, The effect and purpose of the decision a quo stand out clearly as validating the myriad of irregularities, highlighting a pronounced disconnect between the legal procedures and the guarantees afforded by the Constitution.\n\nFollowing the Courts decision, Shah is required to file a substantive application within ten days, where further examination of the contested findings will occur.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/29191723/concourt.jpg",
            "description": "<p>By Mary Taruvinga The Constitutional Court of Zimbabwe has granted direct access to businessman Jayesh Shah, the applicant, allowing him to challenge a prior decision made by the Supreme Court in a case he was ordered to pay US$130,000 to former Zupco chairperson Charles Nherera for malicious prosecution. In the case, Shah aims to contest</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/businessman-granted-direct-access-to-constitutional-court-in-legal-fight-with-former-zupco-chairperson/\">Businessman granted direct access to Constitutional Court in legal fight with former Zupco chairperson</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:56",
            "date": "30 Jul 2025"
        },
        {
            "title": "Ivory Coast President Ouattara, 83, in pole position for fourth term",
            "url": "https://www.newzimbabwe.com/ivory-coast-president-ouattara-83-in-pole-position-for-fourth-term/",
            "content": "Ivory Coast President Alassane Ouattaras decision toseek re-election in Octobermeans the worlds top cocoa-producing nation will again have to wait on his promise to pass the baton to a new generation of political leaders.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/29194357/alassane.jpg",
            "description": "<p>Reuters Ivory Coast President Alassane Ouattara’s decision to seek re-election in October means the world’s top cocoa-producing nation will again have to wait on his promise to pass the baton to a new generation of political leaders. But the 83-year-old former international banker is hoping a strong economy and a weak field of challengers will propel</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ivory-coast-president-ouattara-83-in-pole-position-for-fourth-term/\">Ivory Coast President Ouattara, 83, in pole position for fourth term</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:56",
            "date": "30 Jul 2025"
        },
        {
            "title": "Tigere decries mono-currency uncertainties",
            "url": "https://www.newzimbabwe.com/tigere-decries-mono-currency-uncertainties/",
            "content": "By Alois Vinga\n\nListed real estate investment trust (REIT) Tigere has raised concerns over looming mono-currency uncertainties, warning that the policy shift is threatening funding streams in the sector.\n\nThe concern stems from recent remarks by central bank officials suggesting that Zimbabwe could transition to an exclusive use of the local currency by 2030. Authorities have indicated that efforts are underway to build foreign reserves and ensure macroeconomic stability ahead of the potential currency shift.\n\nPresenting its financial results for the year ended, Tigere said the policy signals have already started impacting confidence within the sector.\n\nGiven continued uncertainty surrounding the 2030 migration to mono-currency, the real estate sector remains predominantly equity-financed, the company said.\n\nEquity financing refers to the process of raising capital by selling shares in a company to existing shareholders or new investors.\n\nCommenting on the mono-currency plans, the International Monetary Fund (IMF) mission stressed the importance of further strengthening the monetary and foreign exchange frameworks. IMF staff also underscored the need to complement such efforts with measures that enhance demand for the Zimbabwe Gold (ZiG) currency.\n\nDespite these challenges, Tigere reported a solid performance. Net Property Income stood at US$1,205,846, up 56.6% from the previous year, driven largely by the inclusion of Highland Park Phase 2 in FY24, which continues to demonstrate growth in income and customer traffic.\n\nThe funds profitability remained robust, despite intensified competition and a volatile currency environment. Total Dividend Per Unit (DPU) rose by 44.8% year-on-year to US0.0951 cents, while Earnings Per Unit (EPU) increased 25.8% to US0.0925 cents. This was achieved despite a 48.8% increase in the number of units in issue, supported by an 87.2% year-on-year rise in comprehensive income to US$990,155.\n\nCollection rates also improved to 87.3% in HY25, up from 81.2% in the comparable period, following the implementation of stricter rental collection policies.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/02/08061347/Tigere-REIT.jpeg",
            "description": "<p>By Alois Vinga Listed real estate investment trust (REIT) Tigere has raised concerns over looming mono-currency uncertainties, warning that the policy shift is threatening funding streams in the sector. The concern stems from recent remarks by central bank officials suggesting that Zimbabwe could transition to an exclusive use of the local currency by 2030. Authorities</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tigere-decries-mono-currency-uncertainties/\">Tigere decries mono-currency uncertainties</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:56",
            "date": "30 Jul 2025"
        },
        {
            "title": "It’s best to enjoy my last years of football at home –  Knowledge Musona on turning down overseas offers",
            "url": "https://www.newzimbabwe.com/its-best-to-enjoy-my-last-years-of-football-at-home-knowledge-musona-on-turning-down-overseas-offers/",
            "content": "By Sports Reporter\n\nWarriors forward Knowledge Musona has revealed he chose Scottland FC over foreign clubs as he wanted to spend the remaining years of his football career at home.\n\nMusona was unveiled on Monday at Rufaro stadium by Scottland, andwill makehis debut on Saturday when they play FC Platinum at MandavaStadium.\n\nThe strikerjoined Mabviravira as a free agent after parting ways with Al-Ohkhood in Saudi Arabia.\n\nThe Norton-born star was sought-after player by many clubs, including his former side Kaizer Chiefs in South Africa.\n\nMusona launched his professional football career in South Africa as a teenager in 2009 before moving to Europe, where he played for several clubs, including Bundesliga side Hoffenheim and RSC Anderletch in Belgium.\n\nCommenting on why he snubbed overseas offers for Scottland, the Smiling Assassin said,I have been playing international for the past 17 years and look, Im winding up my career, I thought its always best to go back home.\n\nIts also a good experience that I have never played in Zimbabwe before, so I thought its the best time to come back home and enjoy my last years of football here.\n\nFor the first time in his career, Musona will be playing at the same club as his young brother Walter.\n\nI have always wanted to play with him, and for the first time we did play in the national team, and it was a good feeling because I have always wanted him to be a great player.\n\nI want him to play better than I did, to achieve big things in his career.\n\nSo Inow have an opportunity to push him and help him to do big things and grow his career, he added.\n\nMusona recently came out of retirement and featured for the Warriors ahead of the 2025 AFCON Finals to be held in Morocco.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/28215548/musona-.jpg",
            "description": "<p>By Sports Reporter Warriors forward Knowledge Musona has revealed he chose Scottland FC over foreign clubs as he wanted to spend the remaining years of his football career at home. Musona was unveiled on Monday at Rufaro stadium by Scottland, and will make his debut on Saturday when they play FC Platinum at Mandava Stadium. The striker joined Mabviravira</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/its-best-to-enjoy-my-last-years-of-football-at-home-knowledge-musona-on-turning-down-overseas-offers/\">It’s best to enjoy my last years of football at home –  Knowledge Musona on turning down overseas offers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:56",
            "date": "30 Jul 2025"
        },
        {
            "title": "‘Pastor’ Walter Masocha jailed for ‘removing demons’ sex attacks",
            "url": "https://www.newzimbabwe.com/pastor-walter-masocha-jailed-for-removing-demons-sex-attacks/",
            "content": "BBC\n\nA church pastor who sexually assaulted a female churchgoer under the pretence of removing demons from her body has been jailed for 10 years.\n\nWalter Masocha, 61, groped the married woman at his home in Stirling, claiming he was a gift from god.\n\nThe University of Stirling professor also attempted to rape another woman during a campaign of abuse from 2006 to 2012.\n\nMasocha denied the attacks during the trial at the High Court in Livingston, but judge Susan Craig described his offending as appalling.\n\nShe imposed a non-harassment orders banning him from approaching or contacting his two victims.\n\nMasocha founded his own church in Scotland in 2007 soon after moving from Zimbabwe.\n\nHe built Agape for All Nations Church into an international religious organisation with more than 2,000 members and appointed himself as archbishop.\n\nOne of his victims said most people in the church saw him as a father figure and referred to him as Dad or Daddy.\n\nThe trial heard Masocha, an accountancy professor, had first targeted another of his victims, now aged 58, about 20 years ago at his home in Stirling.\n\nShe told the court how Masocha had ordered her to kiss his holy lips and attempted to justify putting his hand in her pants and groping her by claiming he was removing demons from her body.\n\nA 39-year-old woman told how she was 20 when Masocha began sexually abusing her after she went to stay with his family.\n\nShe said Masocha repeatedly sexually assaulted her during that period by forcing her to touch him and slapping her on the bottom as she walked upstairs.\n\nThe woman said he later tried to rape her after taking her into his bedroom before managing to escape.\n\nMasocha waspreviously found guilty in June 2015 of sexually assaulting a church deaconessand putting his hand down the trousers of a schoolgirl, telling her that he was trying to remove demons.\n\nThe convictions were laterquashed by the appeal courtafter judges ruled hed been the victim of a miscarriage of justice.\n\nHowever, new proceedings were launched by the Crown after two further women made statements to the police about his behaviour.\n\nJudge Craig said it was likely that Mascohas name would appear on the sex offenders register indefinitely.\n\nAdvocate depute, Michael McIntosh, said: Walter Masocha wasnt just a pastor and a preacher, he was a predator who thought that his power and position rendered him immune from suspicion.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/29103217/masocha.webp",
            "description": "<p>BBC A church pastor who sexually assaulted a female churchgoer under the pretence of “removing demons” from her body has been jailed for 10 years. Walter Masocha, 61, groped the married woman at his home in Stirling, claiming he was a “gift from god”. The University of Stirling professor also attempted to rape another woman</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pastor-walter-masocha-jailed-for-removing-demons-sex-attacks/\">‘Pastor’ Walter Masocha jailed for ‘removing demons’ sex attacks</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:56",
            "date": "30 Jul 2025"
        },
        {
            "title": "Tagwirei must be stopped, ‘a criminal can’t be president’ – Biti",
            "url": "https://www.newzimbabwe.com/tagwirei-must-be-stopped-a-criminal-cant-be-president-biti/",
            "content": "By Staff Reporter\n\nFormer Finance Minister Tendai Biti has launched a stinging attack on controversial business tycoon Kudakwashe Tagwirei, accusing him of looting and collapsing Zimbabwes economy.\n\nBiti insists that Tagwireimust be prevented from ascending to the countrys top job, citing his role in destroying Zimbabwes local currency in 2019 as just one example of his economic sabotage.\n\nThe beleaguered businessman was recently ousted from a Zanu-PF Central Committee meeting after his co-option into the partys key structure was foiled. Party spokesman Christopher Mutsvangwa later vowed to fight Tagwireis rise into the partys most senior and influential ranks.\n\nBiti, echoing Mutsvangwas sentiments that Tagwirei is buying his way up the party structure, was blunt about the need to thwart Tagwireis presidential ambitions.\n\nBiti accused Tagwirei of single-handedly collapsing Zimbabwes local currency in 2019 after being issued treasury bills worth US$360 million.\n\nHe alleges Tagwirei then flooded the market with this cash, causing the RTGS currency to plummet. This, Biti argues, is a prime example of how Tagwirei has undermined the nations financial stability through illicit means.\n\nPresident Emmerson Mnangagwa had once described the local currency as the strongest in the region, although his government later devalued it and announced the introduction of the ZiG currency last April.\n\nTagwirei, who owns numerous companies, some under his well-known Sakunda Holdings, is also accused of netting millions of dollars through his Fossil company, which constructed the Trabablas Interchange in Harare at US$114 million, more than double the regional market prices.\n\nSpeaking to a local online news publication (263Chat) on Monday, Biti took a swipe at Tagwirei, branding him a criminal and unfit to become Zimbabwes President in future.\n\nIt is crazy to think that this criminal actually has ambitions to be the next President of the Republic of Zimbabwe, Biti said.\n\nIt cant happen and should not happen. It should not be allowed to happen, he added.\n\nBiti also challenged Zanu-PF, calling it a laughing stock for allowing its values to be disregarded due to greed for money and top-of-the-range vehicles.\n\nI feel pity for Zanu-PF. Zanu-PF is being reduced to a commodity that can be bought by a few trinkets. A few motor vehicles, a few GD6s, what kind of country have we become? Biti queried.\n\nThis comes after Tagwirei himself doled out some top-of-the-range vehicles to Zanu-PFs Harare Provincial leadership in his bid to be co-opted into the partys Central Committee, a move that has come crashing down like a deck of cards.\n\nBiti said thousands of liberation struggle war heroes are turning in their graves, believing they would not have gone to war had they known the current state of Zanu-PF, which people with money are hijacking.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/25044732/Tendai-Biti.png",
            "description": "<p>By Staff Reporter Former Finance Minister Tendai Biti has launched a stinging attack on controversial business tycoon Kudakwashe Tagwirei, accusing him of looting and collapsing Zimbabwe’s economy. Biti insists that Tagwirei must be prevented from ascending to the country’s top job, citing his role in destroying Zimbabwe’s local currency in 2019 as just one example of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tagwirei-must-be-stopped-a-criminal-cant-be-president-biti/\">Tagwirei must be stopped, ‘a criminal can’t be president’ – Biti</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:56",
            "date": "30 Jul 2025"
        }
    ]
}