{
    "news": [
        {
            "title": "DA would have to support the budget to stay in GNU: Mashatile",
            "url": "https://www.newzimbabwe.com/da-would-have-to-support-the-budget-to-stay-in-gnu-mashatile/",
            "content": "SABC News\n\nSouth Africas Deputy President Paul Mashatile says for the Democratic Alliance (DA) to stay in the Government of National Unity (GNU), they would have to support the budget.\n\nHe was speaking to the media after delivering the keynote address at the Ahmed Kathrada Foundation Legacy Business Breakfast in Illovo, Johannesburg, Monday.\n\nTheANC National Working Committee is meeting todayto discuss the way forward for the GNU.\n\nTheDA following their Federal Executive meetingindicated that they would like to remain as a part of the GNU.\n\nThe ANCs biggest GNU partner,the DA, last week voted against the adoption of the budgettabled by Minister of Finance, Enoch Godongwana.\n\nMashatile says, They must vote for the budget, they must come to support it. Remember we are not done, we were just voting for the fiscal framework. The Appropriation Bill is coming. There are a lot of money Bills that are lined up. Coming. So now that they have not voted for the fiscal framework, it set the tone of what they will do with the Appropriation Bill, Division of Revenue Bill. Those things are still coming. We will work with those who go all the way with us. We need the budget to get South Africa working.\n\nVIDEO | Mashatile addresses the media after delivering the Ahmed Kathrada Foundation Business Breakfast:\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/07181259/Mashatile-1.jpg",
            "description": "<p>SABC News South Africa’s Deputy President Paul Mashatile says for the Democratic Alliance (DA) to stay in the Government of National Unity (GNU), they would have to support the budget. He was speaking to the media after delivering the keynote address at the Ahmed Kathrada Foundation Legacy Business Breakfast in Illovo, Johannesburg, Monday. The ANC National</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/da-would-have-to-support-the-budget-to-stay-in-gnu-mashatile/\">DA would have to support the budget to stay in GNU: Mashatile</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "07 Apr 2025"
        },
        {
            "title": "Highlanders appoints interim CEO",
            "url": "https://www.newzimbabwe.com/highlanders-appoints-interim-ceo/",
            "content": "By Sport Reporter\n\nHighlanders has appointed Kindman Ndlovu as Chief Executive Officer on an interim basis following the resignation of fraud-accused Brian Moyo, who resigned Saturday.\n\nNdlovus appointment was confirmed by the club on Monday afternoon.\n\nFollowing the resignation of Mr. Brian Moyo as Chief Executive Officer, Highlanders Football Club is pleased to announce the appointment of Mr. Kindman Ndlovu, a member of the Executive Committee, as Interim Chief Executive Officer.\n\nThe club has every confidence that Mr. Ndlovus leadership will ensure stability and continuity in the clubs operations, driving progress and success in the coming period, reads the clubs statement.\n\nNdlovus predecessor resigned four months into the office, facing fraud allegations in a deal involving Highlanders and Bulawayo Chiefs.\n\nMoyo reportedly generated a fake invoice of US$23,000 for Highlanders to pay Bulawayo Chiefs in a transaction involving two players, when the club was supposed to pay US$18,000 and pocketed US$5,000.\n\nThe new CEO is the fourth man to take the post since February 2024.\n\nHighlanders has assured all its stakeholders that it will take all necessary legal steps in dealing with Moyos fraud allegations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/07175815/Kindman-Ndlovu.jpg",
            "description": "<p>By Sport Reporter Highlanders has appointed Kindman Ndlovu as Chief Executive Officer on an interim basis following the resignation of fraud-accused Brian Moyo, who resigned Saturday. Ndlovu’s appointment was confirmed by the club on Monday afternoon. “Following the resignation of Mr. Brian Moyo as Chief Executive Officer, Highlanders Football Club is pleased to announce the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/highlanders-appoints-interim-ceo/\">Highlanders appoints interim CEO</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "07 Apr 2025"
        },
        {
            "title": "Journalist Blessed Mhlanga’s third bail bid hits a brick wall",
            "url": "https://www.newzimbabwe.com/journalist-blessed-mhlangas-third-bail-bid-hits-a-brick-wall/",
            "content": "By Staff Reporter\n\nAlpha Media Holdings (AMH) journalist Blessed Mhlanga will remain in jail after his third bail bid flopped on Monday.\n\nMhlanga was seeking bail before Harare magistrate Donald Ndirowei, citing changed circumstances.\n\nThrough his lawyer Chris Mhike, Mhlanga said a month had lapsed since he was arrested and there was no progress regarding investigations.\n\nMhike also told the court that Mhlanga has not interfered with witnesses, adding that his family is struggling without him since he is the breadwinner.\n\nBut the State crushed his submissions, arguing that investigations were complete and prosecution is ready for trial.\n\nThe presiding magistrate upheld the States arguments ruling that there were no new circumstances warranting his freedom.\n\nNdirowei also said Mhlanga was likely to abscond if granted bail.\n\nThere are no changed circumstances which warrant the court to revisit its initial ruling and grant bail to the accused, therefore, the application for bail is hereby dismissed, he ruled.\n\nMhlanga had been in jail for the past month following his arrest for allegedly publishing a press conference by Zanu PF war veteran Blessed Geza who is also President Emmerson Mnangagwas opponent.\n\nGeza is currently in hiding and being sought by the police over four criminal charges.\n\nMhlanga was denied bail when he first appeared before the magistrates court.\n\nHe filed an appeal, which was dismissed by High Court Judge Justice Gibson Mandaza.\n\nMhlanga then went back to the lower court with the present application, which found no favour with the court.\n\nAnesu Chirenje prosecuted.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26003108/InShot_20250225_165102005-scaled-e1741780334367.jpg",
            "description": "<p>By Staff Reporter Alpha Media Holdings (AMH) journalist Blessed Mhlanga will remain in jail after his third bail bid flopped on Monday. Mhlanga was seeking bail before Harare magistrate Donald Ndirowei, citing changed circumstances. Through his lawyer Chris Mhike, Mhlanga said a month had lapsed since he was arrested and there was no progress regarding</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/journalist-blessed-mhlangas-third-bail-bid-hits-a-brick-wall/\">Journalist Blessed Mhlanga’s third bail bid hits a brick wall</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "07 Apr 2025"
        },
        {
            "title": "Zimbabwe’s President Emmerson Mnangagwa suspends tariffs on US imports",
            "url": "https://www.newzimbabwe.com/zimbabwes-president-emmerson-mnangagwa-suspends-tariffs-on-us-imports/",
            "content": "AFP\n\nZimbabwes President said Saturday he would suspend all tariffs on goods imported from the United States, days after US President Donald Trump levied 18 percent tariffs against the southern African nation.\n\nThe mineral-rich countrys main trading partners are the United Arab Emirates, South Africa and China, and its limited exports to the US comprise mainly of tobacco and sugar.\n\nI will direct the Zimbabwean government to implement a suspension of all tariffs levied on goods originating from the United States, President Emmerson Mnangagwa said in a post on X.\n\nThis announcement was intended to facilitate the expansion of American imports within the Zimbabwean market, while simultaneously promoting the growth of Zimbabwean exports destined for the United States, he said.\n\nThe total goods trade between the two countries amounted to $111.6 million in 2024, according to US government data.\n\nThe relationship between Zimbabwe and the US has been marked by decades-long pressure campaigns against former ruler Robert Mugabe since the early 2000s.\n\nHarare has regularly blamed US sanctions for the disastrous economic crisis that has afflicted the country for more than two decades and has moved away from the West, strengthening economic ties with the UAE and China.\n\nWashington last year abolished the former sanctions programme but imposed targeted sanctions on Mnangagwa and other senior leaders in Zimbabwes government and ZANU-PF ruling party, citing rights abuses and corruption.\n\nMnangagwa at the time said the sanctions imposed by then President Joe Biden were illegal and unjustified.\n\nProminent journalist and activist Hopewell Chinono said Saturdays announcement of the suspension of tariffs on US goods was a knee-jerk reaction, suggesting it could be an effort by Mnangagwa to get the sanctions removed.\n\nActing unilaterally contradicts the principles of regional economic cooperation, especially with the Southern African Development Community (SADC), and risked sidelining the interests of Zimbabwes main trade partners, Chinono wrote on X.\n\nDoes Zimbabwe even export enough to the US to justify trying to appease Trumps administration in this way?, he asked.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/04043351/Mnangagwa.jpeg",
            "description": "<p>AFP Zimbabwe’s President said Saturday he would suspend all tariffs on goods imported from the United States, days after US President Donald Trump levied 18 percent tariffs against the southern African nation. The mineral-rich country’s main trading partners are the United Arab Emirates, South Africa and China, and its limited exports to the US comprise</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-president-emmerson-mnangagwa-suspends-tariffs-on-us-imports/\">Zimbabwe’s President Emmerson Mnangagwa suspends tariffs on US imports</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "07 Apr 2025"
        },
        {
            "title": "Geza never fought at war front, embarked on VIP limousine jaunts in Romania after lying he was Mugabe’s son— Zanu PF Commissar",
            "url": "https://www.newzimbabwe.com/geza-never-fought-at-war-front-embarked-on-vip-limousine-jaunts-in-romania-after-lying-he-was-mugabes-son-zanu-pf-commissar/",
            "content": "By James Muonwa\n\nZANU PF National Political Commissar, Munyaradzi Machacha has laid into combative war veteran Blessed Bombshell Runesu Geza, describing him as a dishonest and greedy character.\n\nGeza rose to prominence following a series of explosive interviews in which he demanded President Emmerson Mnangagwas resignation for presiding over corruption and general economic mismanagement. He was the face of the March 31 protest, which later morphed to a mass stay-away.\n\nZanu PF National Political Commissar Munyaradzi Machacha\n\nIn a video posted by Zanu PF apparatchiks on social media while addressing party members at an undisclosed location, Machacha reveals that he is related to Geza, who is his uncle and, therefore, speaks authoritatively of a person he has known for years.\n\nI acknowledge that Geza is my uncle. You heard him rant that l am his nephew, yes, its true. I am not speaking of a person that l am not familiar with. We were together at Chimoio during the war, said Machacha.\n\nHe went further to allege the staunch Mnangagwa critic never spent a single day at Chimoio Camp but engrossed himself in stealing from the logistics warehouse and reselling goods to villagers from nearby settlements.\n\nThere was a big hall which served as a logistics warehouse where clothes for guerilla fighters were stored. Bombshell would go there and steal jeans and shirts, which he would go and sell in the villages or exchange for beer or cigarettes.\n\nHe literally never spent a single day in camp. Each morning, he would go around villages and get chicken, beer cigarettes and Saraveji, claimed Machacha.\n\nHe further claimed that despite the corporal punishment Geza received, including flogging on the buttocks by security details at the camp, he was unrepentant.\n\nMachacha explained that following Gezas recruitment for training in Romania he displayed his dishonesty and penchant for finer things in life prompting him to misrepresent to Romanian authorities that he was nationalist Robert Mugabes son and was accorded Very Important Person (VIP) treatment.\n\nThe correct fact was that Gezas elder brother was married to Mugabes sister.\n\nHe would be chauffeured in limousines around Romania, said Machacha.\n\nUpon Independence in 1980, the commissar went on, Geza was enlisted into the army where he would beg to get promotion not based on merit.\n\nMachacha claimed at one time during the Mozambican military operation, Geza tricked FRELIMO soldiers whom he intoxicated before stripping their Scania trucks of their engines, which he smuggled into Zimbabwe.\n\nAmong other charges, Geza was accused of raiding white commercial farmers of their cattle during the land reform and grabbing abattoirs, where he would slaughter the stolen beasts for sale.\n\nAlso, during the Chiadzwa diamond rush, Geza was appointed Mbada Diamonds security officer and looted the mineral, Machacha said.\n\nThe commissar claims Gezas beef with President Mnangagwa stems from the formers disqualification from contesting the 2018 elections to represent Sanyati constituency because he had a pending rape case involving a local school girl.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/18200459/Screenshot-2025-03-18-at-22.03.06.png",
            "description": "<p>By James Muonwa ZANU PF National Political Commissar, Munyaradzi Machacha has laid into combative war veteran Blessed ‘Bombshell’ Runesu Geza, describing him as a dishonest and greedy character. Geza rose to prominence following a series of explosive interviews in which he demanded President Emmerson Mnangagwa’s resignation for presiding over corruption and general economic mismanagement. He</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/geza-never-fought-at-war-front-embarked-on-vip-limousine-jaunts-in-romania-after-lying-he-was-mugabes-son-zanu-pf-commissar/\">Geza never fought at war front, embarked on VIP limousine jaunts in Romania after lying he was Mugabe’s son— Zanu PF Commissar</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "07 Apr 2025"
        },
        {
            "title": "Baby killed in house inferno while mother goes for school run",
            "url": "https://www.newzimbabwe.com/baby-killed-in-house-inferno-while-mother-goes-for-school-run/",
            "content": "By Staff Reporter\n\nTRAGEDY struck a Nkayi family after a toddler was burnt beyond recognition after the house she was sleeping in caught fire.\n\nThe now deceased child, aged one-year-old, had been left unattended as her mother went on an errand to escort her other child to school.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident.\n\nThe ZRP is investigating the circumstances surrounding a tragic fire incident which resulted in the death of a baby girl (1year and 5 months) at a homestead in Village 3, Drommoland, Inyathi, Nkayi on April 4, 2025, said Nyathi.\n\nThe incident occurred when the house in which the baby was sleeping in caught fire. The cause of fire is yet to be established.\n\nThe mother had left the victim lying on the bed while accompanying the victims brother to school, he added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/06/08153433/Fire.png",
            "description": "<p>By Staff Reporter  TRAGEDY struck a Nkayi family after a toddler was burnt beyond recognition after the house she was sleeping in caught fire. The now deceased child, aged one-year-old, had been left unattended as her mother went on an errand to escort her other child to school. Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/baby-killed-in-house-inferno-while-mother-goes-for-school-run/\">Baby killed in house inferno while mother goes for school run</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "07 Apr 2025"
        },
        {
            "title": "Nees in England to lure UK-born Warriors prospects",
            "url": "https://www.newzimbabwe.com/nees-in-england-to-lure-uk-born-warriors-prospects/",
            "content": "By Sports Reporter\n\nWARRIORS coach Michael Nees is in England for a week-long visit during which he will engage United Kingdom-born players, who have potential to play for the senior mens national soccer team.\n\nNees is accompanied by England-based Zimbabwe Football Association (ZIFA) Global and Diaspora Committee Chairperson Marshall Gore.\n\nEstablished in February, the committee is mandated to work hand-in-hand with national team coaches and help them scout Zimbabwean talent in the diaspora.\n\nAs part of his top targets, Nees is expected to talk to Liverpool sensational teenager Trey Nyoni, who is born to Zimbabwean parents\n\nAged 17, Nyoni marked his English Premier League (EPL) debut for Liverpool last year under former manager Jurgen Klopp and has been a regular feature in the squad this season.\n\nBesides Nyoni, the gaffer is also expected to engage Shumirai Mheuka, who recently made his EPL debut for Chelsea.\n\nMheuka is son to former Zimbabwe Saints player Malcom Mheuka, who sometime back was quoted in the press saying he will not force his child to play for the Warriors, rather he will give him room to make a decision for himself.\n\nAlready Mheuka and Nyoni have managed to attain a few caps playing for England national team junior teams, although there is still room for them to transition to the Warriors since they have not attained more than three caps for England senior national team.\n\nNees is also rumoured to have shown interest in enlisting the services of Isaac Mabaya (Liverpool juniors), Lucien Mahovo (Norwhich City), Tivonge Rusehesha (Reading) Camron Mpofu (Manchester United juniors), among others.\n\nNees will also be assisted by Zimbabwes two captains based in England, Marvellous Nakamba, who plays for championship side Luton Town, and his vice Marshall Munetsi, who recently joined EPL side Wolverhampton Wanderers.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/20074304/Michael-Nees-and-Marshall-Munetsi.webp",
            "description": "<p>By Sports Reporter  WARRIORS coach Michael Nees is in England for a week-long visit during which he will engage United Kingdom-born players, who have potential to play for the senior men’s national soccer team. Nees is accompanied by England-based Zimbabwe Football Association (ZIFA) Global and Diaspora Committee Chairperson Marshall Gore. Established in February, the committee</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nees-in-england-to-lure-uk-born-warriors-prospects/\">Nees in England to lure UK-born Warriors prospects</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "07 Apr 2025"
        },
        {
            "title": "Legal Discussions with Vengai Madzima: Regulatory Sandbox for Fintech Start-Ups",
            "url": "https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-regulatory-sandbox-for-fintech-start-ups/",
            "content": "NewZimbabwe.com hasinvited Vengai Madzima, the Senior Partner atMadzima Chidyausiku Museta Legal Practitioners (MCM Legal), to discuss with us legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer.\n\nReporter: Welcome back Mr. Madzima. This week we want to discuss regulatory sandboxes for fintech start-ups in Zimbabwe. What is a regulatory sandbox, and why is it necessary for fintech start-ups in Zimbabwe?\n\nVM: Thank you.\n\nYour question is in 2 parts, I will start by explaining what a fintech is before I attempt to explain a regulatory sandbox for the fintech industry and why it is necessary for fintech start-ups in Zimbabwe.\n\nA fintech is a company that relies mainly, if not solely, on technology and cloud services to provide financial services to its customers. It is not limited by the need to have your traditional brick and mortar to be able to provide these services. Services that may be provided by such fintech solutions include payments, savings, investments, borrowing of finances and many others. The idea being to make it easier and accessible for the consumer to transact and benefit from such services.\n\nSandboxes, on the other hand, are controlled or isolated testing environments that allow innovators to test their new product or service without the burdensome requirement of complying with all applicable regulations affecting that particular product.\n\nAnd now to the why of your question. Complying with financial regulations may in some instances prove to be expensive for a start-up fintech company and the use of a sandbox allows the start up to speed up entry into the market, identify and hopefully mitigate, if not remedy, any risk that would have potentially bedevilled the start-up following a straight to market launch in the absence of a sandbox.\n\nReporter: What is the difference thenbetweena regulatory sandbox and an innovation hub?\n\nVM: Innovation hubs, in general terms, involve the sharing of ideas between innovators and or with their regulators, which may include guidance on regulations by the regulators as they work on providing solutions to the problems in that sector. Sandboxes allow for the actual experimentation of how the product will work in a live market without necessarily being subjected to the obligation of adhering to prevailing regulations for market entry.\n\nReporter:Is Zimbabwe conducive for a Fintech sandbox?\n\nVM: Well, these fintech sandboxes are a common trend in the world and particularly in Africa. Traditionally, Zimbabwe has proved to be adaptive to new methods of utilizing financial technology. The country remains conducive because the economy is heavily reliant on cash for transactions and a significant percentage of the population is unbanked and operating their businesses outside the formal financial channels, providing such sandboxes encourages more innovators to bring out products that may mop the unbanked liquidity into the formal market with the added benefit of including this unbanked demography into the beneficial financial services offered to the formalized market.\n\nReporter:In Zimbabwe, which laws regulate fintech sandboxes?\n\nVM: We have the Fintech Regulatory Guidelines of 2021 from the Reserve Bank of Zimbabwe, which, among other things, provide guidance and requirements for potential participants to test their products in a live environment while at the same time prioritizing consumer safety and protection.\n\nThe guidelines also encourage collaboration between the startup fintechs and the traditional financial sector, in which the innovative technology intends to improve by the launch of their product.\n\nWe also have the Securities and Exchange Commission of Zimbabwe Regulatory Sandbox guidelines of 2024 which are aimed at facilitating capital market fintech innovations.\n\nReporter: What are the real benefits of the sandbox and is it useful?\n\nVM: Besides the obvious benefit of reducing the cost to the innovator in the testing phase, which is about 24 months, it allows constant interaction between the innovator and the regulator, creating an environment where the regulator understands the operations of the fintech product. This will prove highly useful should there be a need to lobby for policy changes to accommodate disruptive technology.\n\nI am also personally of the view that the sandbox allows for easier fundraising as there will be a clear blueprint of how the product works, plus the common hurdle of regulatory approval will have been passed and consumer appetite tested.\n\nReporter: How is an innovator assured that the innovation will not be distributed to competitors during the application and testing periods?\n\nVM: The Reserve Bank guidelines on Fintech Regulatory sandbox provide that all information provided by the innovator will be treated as confidential and any disclosure to any third party will first require the approval of the innovator unless the disclosure has been ordered by a court order or under any law.\n\nReporter: Thank you, Mr. Madzima, we have run out of time.\n\nVM: Thank you.\n\nRELATED:\n\nYou can contact Vengai Madzima onvengai@mcmlegal.co.zwor at www.mcmlegal.co.zw\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/06192126/sandbox.jpg",
            "description": "<p>NewZimbabwe.com has invited Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal), to discuss with us legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer. Reporter: Welcome back Mr. Madzima. This week we want to discuss regulatory sandboxes</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-regulatory-sandbox-for-fintech-start-ups/\">Legal Discussions with Vengai Madzima: Regulatory Sandbox for Fintech Start-Ups   </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "07 Apr 2025"
        },
        {
            "title": "Drama as fans bay for CAPS United coach’s blood over poor league start",
            "url": "https://www.newzimbabwe.com/drama-as-fans-bay-for-caps-united-coachs-blood-over-poor-league-start/",
            "content": "By Sports Reporter\n\nCAPS United fans expressed their anger over coach Lloyd Chitembwes string of poor results, resulting in a protest following the sides Sunday defeat at the hands of Ngezi Platinum Stars F.C.\n\nChitembwe, who recorded his third defeat of the season in five games, has accepted the blame for the teams poor start.\n\nMakepeke were handed a 2-1 defeat by the Mhondoro-based side in a thrilling encounter, which saw both sides failing to convert chances.\n\nSundays result saw CAPS United dropping to position 16 on the log with four points, three ahead of bottom placed Triangle, who are on position 18.\n\nOther than a defeat at the hands of Ngezi, the Harare giants have also lost to Tel One (1-0) and Scottland (2-0).\n\nCAPS Uniteds four points were all collected against Green Fuel whom they drew with one all and a win over Triangle whom they beat 2-0.\n\nCommenting on the poor run, team coach Chitembwe said he largely takes blame for the teams current form.\n\nIt is the sole responsibility of a coach to make sure that the team wins, so it is my responsibility no one else.\n\nI am that kind of a person who does not shy away from that kind of a responsibility.\n\nSo, l am responsible for this because every decision that l make, are a reflection on the team, Chitembwe said.\n\nWith such a poor run, CAPS United fans sang in protest after the match calling for his ouster at the club.\n\nSo tense was the protest that fans had to block the Chitembwes car from driving out of the stadium, only for him to come and exchange words with some of the rioters, before police escorted him out of the venue.\n\nResponding on the fans behaviour towards him, the veteran gaffer said; The results are what matters, when they are not coming, people naturally react, and this is very normal.\n\nThere is nothing abnormal with that kind of a reaction and as a club we have to find a way to manage the situation.\n\nChitembwe is one of the three coaches, who have enjoyed more than five seasons with one club in the league, the other two being Norman Mapeza of FC Platinum and Joey Antipas of Chicken Inn.\n\nCAPS Uniteds next fixture will be a road trip to Bulawayo for a date against old rivals Highlanders this coming weekend.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/07/06174241/Lloyd-Chitembwe.jpg",
            "description": "<p>By Sports Reporter CAPS United fans expressed their anger over coach Lloyd Chitembwe’s string of poor results, resulting in a protest following the side’s Sunday defeat at the hands of Ngezi Platinum Stars F.C. Chitembwe, who recorded his third defeat of the season in five games, has accepted the blame for the team’s poor start.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/drama-as-fans-bay-for-caps-united-coachs-blood-over-poor-league-start/\">Drama as fans bay for CAPS United coach’s blood over poor league start</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "07 Apr 2025"
        },
        {
            "title": "Bed bug outbreak hits Harare’s Mbare flats; authorities to roll-out fumigation exercise",
            "url": "https://www.newzimbabwe.com/bed-bugs-outbreak-hits-harares-mbare-flats-authorities-to-roll-out-fumigation-exercise/",
            "content": "By Tapiwa Svondo\n\nTHE City of Harare (CoH) has confirmed an outbreak of bed bugs (locally known as tsikidzi) in Mbare, prompting an immediate response to address the infestation.\n\nIn a statement, CoH spokesperson Stanley Gama said council will start spraying the affected Matererini and Matapi Flats today.\n\nThe City of Harare Pest Control Section has already been on the ground to assess the situation with a view of mobilizing equipment and resources needed to attend to the bed bug.\n\nThe City teams will start spraying on Monday 7 April 2025 at Mbare Matererini and Matapi Flats. Residents in the areas mentioned should prepare and cooperate with our teams starting early morning, said Gama.\n\nFurthermore, the CoH said it is conducting awareness campaigns to residents of Mbare on how to prevent further outbreaks.\n\nThe teams will also be conducting awareness campaigns on factors that accelerate such infestations e.g overcrowding and how to prevent infestations even in these overcrowded areas. Community volunteers are going to be required for optimum spraying coverage.\n\nIt is, therefore, important for residents in and around Mbare Flats and other areas to be aware of the factors that lead to such infestations. Residents are also urged to help control the spreads through extensive community participation.\n\nSpraying alone will not solve this problem. Bed bugs hide in small crevices on beds, sofas, wardrobes, walls, e.t.c thus regular physical cleaning is required where chemicals cant reach, said Gama.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/07052122/bedbugs-what-to-know-2500x1300-1.jpg",
            "description": "<p>By Tapiwa Svondo  THE City of Harare (CoH) has confirmed an outbreak of bed bugs (locally known as tsikidzi) in Mbare, prompting an immediate response to address the infestation. In a statement, CoH spokesperson Stanley Gama said council will start spraying the affected Matererini and Matapi Flats today. “The City of Harare Pest Control Section</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/bed-bugs-outbreak-hits-harares-mbare-flats-authorities-to-roll-out-fumigation-exercise/\">Bed bug outbreak hits Harare’s Mbare flats; authorities to roll-out fumigation exercise </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "07 Apr 2025"
        }
    ]
}