{
    "news": [
        {
            "title": "Too many areas requiring urgent attention – presidential spokesperson says following Mnangagwa’s visit to public referral hospitals",
            "url": "https://www.newzimbabwe.com/too-many-areas-requiring-urgent-attention-presidential-spokesperson-says-following-mnangagwas-visit-to-public-referral-hospitals/",
            "content": "By Thandiwe Garusa\n\nPRESIDENT Emmerson Mnangagwas spokesperson George Charamba, has acknowledged the dire state of Zimbabwes public hospitals, highlighting infrastructure decay, policy gaps and systematic overload.\n\nCharamba was speaking following Mnangagwas visit to Zimbabwes main referral hospitals, Parirenyatwa and Sally Mugabe, on Monday. The visits follow public outcry over the dysfunctional state of public hospitals.\n\nMnangagwas government has long neglected general hospitals, which now face crumbling infrastructure, medicine shortages, costly patient care and poor wages that have led to low staff morale and a massive brain drain.\n\nOur role as Presidential staffers was to note areas requiring immediate, medium and long-term interventions, and they were just too many, in order to help shape effective health delivery policy.\n\nIt was clear from the visit that the whole health delivery hierarchy needed attention. Failures at basic primary levels like clinics, municipal clinics and district hospitals transmitted themselves all the way to referral hospitals, leading to a system which is creaking from an overload, disrepair and fresh investments.\n\nInterventions have got to be systemic, a lack which in fact explains the rise of top-notch private care-givers who are a ringing antipode to massive failures in the public health system, Charamba wrote on his X account.\n\nZimbabwes referral hospitals are overloaded and overwhelmed, as most primary care clinics are incapacitated and unable to handle even basic health issues.\n\nThe presidential spokesmanalso said Mnangagwa witnessed the Parirenyatwa Hospitals Mbuya NehandaMaternity Wing operating without curtains or heating, compromising patient privacy and comfort.\n\nMany wards do not have enough blankets, and most have broken windows.\n\nCharamba added thatthere are serious administrative inefficiencies across the Ministries of Finance, Local Government, and Health that urgently require a more hands-on approach.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/17060121/ed-hospital-scaled.jpeg",
            "description": "<p>By Thandiwe Garusa PRESIDENT Emmerson Mnangagwa’s spokesperson George Charamba, has acknowledged the dire state of Zimbabwe’s public hospitals, highlighting infrastructure decay, policy gaps and systematic overload. Charamba was speaking following Mnangagwa’s visit to Zimbabwe’s main referral hospitals, Parirenyatwa and Sally Mugabe, on Monday. The visits follow public outcry over the dysfunctional state of public hospitals.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/too-many-areas-requiring-urgent-attention-presidential-spokesperson-says-following-mnangagwas-visit-to-public-referral-hospitals/\">Too many areas requiring urgent attention – presidential spokesperson says following Mnangagwa’s visit to public referral hospitals</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "18 Jun 2025"
        },
        {
            "title": "After Harare City Council probe, government hints at Commission of Inquiry into Bulawayo’s operations",
            "url": "https://www.newzimbabwe.com/after-harare-city-council-probe-government-hints-at-commission-of-inquiry-into-bulawayos-operations/",
            "content": "By Darlington Gatsi\n\nAS the Commission of Inquiry probing the operations of the Harare City Council wrapped up and submitted its findings, the government has hinted that a similar approach could be replicated for other local authorities, with Bulawayo identified as being riddled with maladministration.\n\nThe Commission, which was chaired by retired judge Justice Maphios Cheda, on Tuesday submitted its report to President Emmerson Mnangagwa after a year-long investigation into the Harare City Council.\n\nThe Commission uncovered the shortcomings of the Harare City Council, which is dogged by corruption, resulting in poor service delivery in the capital.\n\nSpeaking after the presentation of the report at State House on Tuesday, the Minister of Local Government, Daniel Garwe, said local authorities are plagued by decay stemming from poor governance.\n\nThat is why the President has put in place a Commission of Inquiry, it is born out of the decay in the way our local authorities, especially our urban authorities, are being run. Harare City Council is number one, and Bulawayo City Council is number two going forward.\n\nI do not know yet, but we have made the recommendation that we need to have a thorough investigation of all our urban local authorities because there is a lot of decay, said Garwe.\n\nDuring the hearings, which were conducted over a period of nine months, the Jacob Mafume-led council was exposed for its extravagance, with officials taking home hefty perks.\n\nThis is despite the council bemoaning a shortage of funds in its operations, which has seen it failing to provide basics to residents.\n\nA clean-up is expected to be conducted at Town House once President Mnangagwa has reviewed the report and its recommendations.\n\nWith the findings remaining confidential for now, Garwe said his ministry now awaits further instructions from President Mnangagwa.\n\nThey have finished the report. The chairman and myself, as the Minister of Local Government, have come to present the report.\n\nThe details of the report cannot be disclosed today because the President has to go through the report, sit down, finalise it, and give us the way forward, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/11/11180630/Daniel-Garwe-Minister-of-National-Housing-and-Social-Ammenities.jpg",
            "description": "<p>By Darlington Gatsi AS the Commission of Inquiry probing the operations of the Harare City Council wrapped up and submitted its findings, the government has hinted that a similar approach could be replicated for other local authorities, with Bulawayo identified as being riddled with maladministration. The Commission, which was chaired by retired judge Justice Maphios</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/after-harare-city-council-probe-government-hints-at-commission-of-inquiry-into-bulawayos-operations/\">After Harare City Council probe, government hints at Commission of Inquiry into Bulawayo’s operations</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "18 Jun 2025"
        },
        {
            "title": "Mzembi remanded in custody to July 1; magistrate says former minister was not as sick as he wants court to believe",
            "url": "https://www.newzimbabwe.com/mzembi-remanded-in-custody-to-july-1-magistrate-says-former-minister-was-not-as-sick-as-he-wants-court-to-believe/",
            "content": "By Staff Reporter\n\nFormer Foreign Affairs Minister, Walter Mzembi, will languish in jail after Harare magistrate Donald Ndirowei revoked his bail on the grounds that he willfully skipped court for the past seven years.\n\nThe magistrate dismissed his application seeking cancellation of his three arrest warrants and remanded him in custody until July 1.\n\nNdirowei, in his ruling, said Mzembi failed to give a convincing explanation why he defaulted court.\n\nThere is a gap as to what transpired in his medical report since the attached medical reports should have worked if he availed himself in 2019, not 2025, the magistrate noted.\n\nNdirowei noted that after his discharge in 2024 in Zambia, Mzembi never made an effort to come and cancel his warrants.\n\nHe was not sick to the extent that he wants the court to believe; however, he was Saviour Kasukuweres campaigner for the 2023 elections, and he was active on his social media.\n\nThe accuseds submissions fall far short and the warrants of arrests are hereby confirmed, bail revoked, he is hereby committed to prison pending trial, he ruled.\n\nMzembi had said he was not in wilful default.\n\nHe told the court that he had been in and out of the hospital over the years, and he was out of the country, adding that he had undergone many operations to correct his ailment.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/05/10034227/Walter-Mzembi.jpg",
            "description": "<p>By Staff Reporter Former Foreign Affairs Minister, Walter Mzembi, will languish in jail after Harare magistrate Donald Ndirowei revoked his bail on the grounds that he willfully skipped court for the past seven years. The magistrate dismissed his application seeking cancellation of his three arrest warrants and remanded him in custody until July 1. Ndirowei,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mzembi-remanded-in-custody-to-july-1-magistrate-says-former-minister-was-not-as-sick-as-he-wants-court-to-believe/\">Mzembi remanded in custody to July 1; magistrate says former minister was not as sick as he wants court to believe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "18 Jun 2025"
        },
        {
            "title": "Explosion at fireworks factory in central China kills nine and injures 26",
            "url": "https://www.newzimbabwe.com/explosion-at-fireworks-factory-in-central-china-kills-nine-and-injures-26/",
            "content": "AFP\n\nAn explosion at a fireworks factory in central China killed nine people. It injured 26 others, state media said on Tuesday, as challenging on-site rescue work continued a day after the incident.\n\nThe blast occurred shortly before 8:30 am Monday at a factory in a village outside Changde, a city in Hunan province, state-run China National Radio (CNR) said.\n\nAs of 9:00 am on Tuesday, nine people were dead and 26 injured, CNR said, citing a rescue command centre.\n\nRescue work at the scene was ongoing, CNR reported, noting a complicated situation and the risk of additional explosions hampering response efforts.\n\nAdding to the challenge, the site was in a mountainous area with no large water source, it added.\n\nDuring more than 20 hours of uninterrupted and continuous rescue, the rescue team used remote-controlled water cannons to extinguish the fire, the report said.\n\nState news agency Xinhua also said Tuesday that the Ministry of Emergency Management had sent a working team to Hunan to oversee the rescue.\n\nEfforts must be made to ascertain the cause of the explosion as soon as possible and to hold those responsible accountable, the ministry said, according to Xinhua.\n\nIndustrial accidents are fairly common in China due to vague regulations and lax safety standards.\n\nLast month, an explosion at a chemical plant in the eastern province of Shandong killed at least five people.\n\nIn 2015, blasts at warehouses containing flammable chemicals in the port city of Tianjin killed more than 170 people and injured 700 others.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/17092806/Screenshot-2025-06-17-at-10.27.17.png",
            "description": "<p>AFP An explosion at a fireworks factory in central China killed nine people. It injured 26 others, state media said on Tuesday, as challenging on-site rescue work continued a day after the incident. The blast occurred shortly before 8:30 am Monday at a factory in a village outside Changde, a city in Hunan province, state-run</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/explosion-at-fireworks-factory-in-central-china-kills-nine-and-injures-26/\">Explosion at fireworks factory in central China kills nine and injures 26</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "18 Jun 2025"
        }
    ]
}