{
    "news": [
        {
            "title": "​Crypto Meets Culture: How Young Zimbabweans Engage with Global Sports​ via Betting Platforms",
            "url": "https://www.newzimbabwe.com/crypto-meets-culture-how-young-zimbabweans-engage-with-global-sports-via-betting-platforms/",
            "content": "In Zimbabwe, where the local currency often feels like a game of chance itself (due to crazy high inflation), young people turn to a different kind of gamble  one that involves football, phones, and digital coins. Online sports betting, especially on crypto-friendly platforms, is more than just a quick entertainment. For many young Zimbabweans, its a way to stay connected to global sports and experiment with crypto.\n\nOnline betting in Zimbabwe isnt happening behind desktops  its all happening on phones. With more young people owning smartphones and mobile data becoming more accessible, placing a bet is often just a few taps away. In fact, mobile betting made up over70% of all sports wagersin Zimbabwe by 2025.\n\nApps like Betway Zimbabwe and Premier Bet Zimbabwe offer the best mobile experience  users can bet live, cash out early, and follow games right from their screens. That convenience has drawn in the 18 to 35yearold crowd, especially in cities, although rural users are catching up quickly.\n\nZimbabweans dont exactly have the most stable banking system to rely on. So its no surprise that crypto has caught on, especially in places where bank transfers are slow, expensive, or just not happening. Many Zimbabweans started buying cryptocurrencies when their economy struggled, and several waves ofhyperinflation(up to 785%) made the local currency essentially worthless. The economy improved, but the habit of crypto trading remained.\n\nSo, manyonline betting platformsnow accept Bitcoin, Ethereum, or other cryptocurrencies, making it easier to deposit and withdraw without a middleman slowing things down.\n\nFor some young people, on the contrary, betting is actually their first experience using crypto. From there, some start using digital money to save, trade, or even shop online. Its not just bettingits an introduction to a different way of handling money.\n\nMoreover, crypto allows Zimbabweans to bet globally on major sports events, such as the FIFA World Cup and the NBA, among others. In fact, the betting industry in Zimbabwe has grown by 8.5% between 2023 and 2024 and continues to rise. Even though theres love for local football, its the big leagues that attract most attention. The English Premier League (EPL), National Basketball Association (NBA), and Ultimate Fighting Championship (UFC) are among the most popular choices. Its not just about placing betsits about following teams, staying up late for games, and knowing the stats better than the commentators on TV.\n\nBetting adds more excitement, and it also connects Zimbabweans to global sports in real time. WhatsApp groups buzz with predictions, TikTok videos break down weekend fixtures, and when someone wins big, youll hear about it.\n\nAt the end of the day, online betting in Zimbabwe is about more than winning money. Its how young people connect with global culture and experiment with digital tools. Its not a perfect systemthere are risks, and the crypto side of it can be murky. But for a generation raised on mobile tech and global sports, its one of the few spaces where finance, fun, and fandom all come together.\n\n",
            "image_url": null,
            "description": "<p>In Zimbabwe, where the local currency often feels like a game of chance itself (due to crazy high inflation), young people turn to a different kind of gamble — one that involves football, phones, and digital coins. Online sports betting, especially on crypto-friendly platforms, is more than just a quick entertainment. For many young Zimbabweans,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/crypto-meets-culture-how-young-zimbabweans-engage-with-global-sports-via-betting-platforms/\">​Crypto Meets Culture: How Young Zimbabweans Engage with Global Sports​ via Betting Platforms </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:37",
            "date": "25 Apr 2025"
        },
        {
            "title": "Mablanyo takes blame for Dynamos’ poor run",
            "url": "https://www.newzimbabwe.com/mablanyo-takes-blame-for-dynamos-poor-run/",
            "content": "By Sports Reporter\n\nDynamos coach Lloyd Mablanyo Chigowe has taken the blame for his teams current poor run inthe ongoing campaign.\n\nDembare have lost three consecutive games and are currently sitting in position 10 on the log with 6 points.\n\nAlready, pressure is mounting for the Harare giants, who have won a single match this season, a one-nil win against Simba Bhora last month.\n\nI try to take responsibility and shield the boys from pressure. What is happening is not ideal because it actually puts pressure on the technical team also.\n\nProbably the senior players also have to take responsibility, but we have held our discussions as agroup and we all agreed that we have not done justice to the team, said Mablanyo.\n\nDynamos will be hoping to redeem themselves on Sunday when they face struggling KwekweUnited.\n\nAlthough Kwekwe United seems to be a punching bag, Chigowe is worried about his strike force, which is failing to find the back of the net.\n\nDembare has only scored two goals in seven matches, a poor conversion rate which Mablanyobelieves needs to be worked on.\n\nIf you see the 1-0 margins we are losing, it shows you we have a crisis in front.\n\nWe are creating chances, and we are failing to convert.\n\nOne thing certain is we need to reinforce that area, but we are in a period where we cant register players and make amends.\n\nCastle Lager Premier Soccer League Match day 8\n\nFriday\n\nHerentals vs Green fuel (Rufaro)\n\nSaturday\n\nTel One vs. Highlanders (Ascot)\n\nBikita Minerals vs. Ngezi Platinum Stars (Gibbo)\n\nYadah vs. CAPS United (Rufaro)\n\nFC Platinum vs Triangle (Mandava)\n\nZPC Kariba vs. Scottland (Nyamhunga)\n\nSimba Bhora vs. MWOS FC (Wadzanayi)\n\nManica Diamonds vs Chicken Inn (Sakubva)\n\nSunday\n\nDynamos vs. Kwekwe United (Rufaro)\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/25065036/mablanyo.jpg",
            "description": "<p>By Sports Reporter Dynamos coach Lloyd “Mablanyo” Chigowe has taken the blame for his team’s current poor run in the ongoing campaign. Dembare have lost three consecutive games and are currently sitting in position 10 on the log with 6 points. Already, pressure is mounting for the Harare giants, who have won a single match this</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mablanyo-takes-blame-for-dynamos-poor-run/\">Mablanyo takes blame for Dynamos’ poor run</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:37",
            "date": "25 Apr 2025"
        },
        {
            "title": "Britain’s Lord Oates demands consequences for Zimbabwean govt over journalist Mhlanga’s continued detention",
            "url": "https://www.newzimbabwe.com/britains-lord-oates-demands-consequences-for-zimbabwean-govt-over-journalist-mhlangas-continued-detention/",
            "content": "By Leopold Munhende\n\nINCARCERATED journalist Blessed Mhlangas situation was discussed on Thursday in Britains House of Lords, with outspoken Liberal Democrats peer Lord Jonny Oates demanding consequences for the Zimbabwean government.\n\nMhlanga has now spent 60 days in pretrial detention for daring to interview a war veteran, Blessed Geza, seeking President Emmerson Mnangagwas immediate ouster.\n\nHe was arrested after broadcasting the interview and accused of transmitting data messages that incite violence or damage to property.\n\nOates, who once resided in Zimbabwe, demanded that the UK government makes it clear to Mnangagwa and the Zanu PF government that normal relations between the former colonial power and Zimbabwe will not resume as long as basic rights such as those of the media were continuously disrespected.\n\nAs we speak, the journalistBlessedMhlangahas been detained for 59 days and denied his constitutional right to bail. His crime is having the temerity to conduct an interview with a former war veteran who opposes President Mnangagwas desire to extend his term in office and has highlighted the criminal corruption of the regime and the Presidents family, said Oates.\n\nI hope the Government will continue to make clear that there will be no resumption of normal relations with Zimbabwe while the ZANU-PF regime continues to detain journalists, deny media freedom and defy democratic norms.\n\nIn a debate on media freedom in the House of Lords today, I raised the case of Zimbabwe journalist Blessed Mhlanga who has now been detained for 59 days for no other reason than reporting the truth.https://t.co/xjmYtz9Xf7\n\n Lord Jonny Oates (@jonny_oates)April 24, 2025\n\nZimbabwe and the UK have been in a cold-war since the early 2000s following a chaotic land redistribution programme that forcefully reclaimed landfrom white farmers and gave it to mainly Zanu PF members.\n\nDisregard for human rights over the past two decades has also worsened the relations.\n\nMnangagwa, who is at the centre of the current mess, promised re-engagement upon taking office via a 2017 coup that toppled late President Robert Mugabe but the West has not cosied up to his endeavours.\n\nAccused of grand corruption and shielding a circle of associates benefiting from Zimbabwes vast minerals, he now faces a faction from within his own party that wants him to resign and hand over power to his deputy, former ally and ex-army general Constantino Chiwenga.\n\nAlthough known to also wield an iron fist, Chiwenga is seen as the solution to Zimbabwes worsening corruption, poor economy and extreme poverty in various communities.\n\nOates challenged Parliamentarians to bring the fight for Mhlangas freedom to Mnangagwas wife Auxillia who is set to speak at a summit in London in June.\n\nAdded Oates: I note that the Presidents wife is due to speak at a summit in London in June.\n\nI hope that Members of our Parliament who are choosing to take part will challenge Zimbabwes First Lady on the continued detention ofBlessedMhlangaand the overall brutality of the regime she represents.\n\nMhlanga is a senior journalist at privately owned Alpha Media Holdings (AMH) and also hosts shows for its Heart and Soul TV.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26003108/InShot_20250225_165102005-scaled-e1741780334367.jpg",
            "description": "<p>By Leopold Munhende INCARCERATED journalist Blessed Mhlanga’s situation was discussed on Thursday in Britain’s House of Lords, with outspoken Liberal Democrats peer Lord Jonny Oates demanding consequences for the Zimbabwean government. Mhlanga has now spent 60 days in pretrial detention for daring to interview a war veteran, Blessed Geza, seeking President Emmerson Mnangagwa’s immediate ouster.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/britains-lord-oates-demands-consequences-for-zimbabwean-govt-over-journalist-mhlangas-continued-detention/\">Britain’s Lord Oates demands consequences for Zimbabwean govt over journalist Mhlanga’s continued detention</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:37",
            "date": "25 Apr 2025"
        },
        {
            "title": "Tobacco bales sold so far down by 16%",
            "url": "https://www.newzimbabwe.com/tobacco-bales-sold-so-far-down-by-16/",
            "content": "By Alois Vinga\n\nTHE quantity of tobacco sold so far has gone down by 16% when compared to the same period last year on the back of waning average prices, a trading update by the Tobacco Industry Marketing Board (TIMB) has revealed.\n\nThis years tobacco marketing season kicked off in March 2025 on the back of expectations of better yields in the current selling season.\n\nMarket data shows that bales sold so far totalled 1,148,330 compared to 1,379,535, signifying a minus 16,76% decline compared to the same period last year. On day 34, a total of 93,9 million kgs of tobacco was sold compared to 105 816 289 signifying a minus 11,8% decline.\n\nThe average price reached this year was US$3,42 per kg compared to US$3,58 per kg to signify a decrease of 4,57%. Rejected bales stood at 3,04% compared to 2,34%. The highest price fetched so far is standing at US$6,30 compared to US$6,99 to record a minus 9,87%\n\nThe continents top tobacco producer expects sales of the crop to rebound to 280 million kilograms this year after plummeting to 230.9 million kilograms in 2024 following an El Nino-induced drought.\n\nDespite lower production in 2024, tobacco was the second biggest export commodity for Zimbabwe last year, only behind gold, earning a record $1.3 billion.\n\nThe projected 2025 sales are still below the record high of 296 million kilograms registered in 2023.\n\nOver 80% of Zimbabwes tobacco is produced by small farmers.\n\nThe new season opened with prices ranging from US$1,59 per kilogram for the lowest tobacco grade to US$4,65 per kilogram for the highest.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/05/20225815/Tobacco-auction-floors.jpg",
            "description": "<p>By Alois Vinga THE quantity of tobacco sold so far has gone down by 16% when compared to the same period last year on the back of waning average prices, a trading update by the Tobacco Industry Marketing Board (TIMB) has revealed. This year’s tobacco marketing season kicked off in March 2025 on the back</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tobacco-bales-sold-so-far-down-by-16/\">Tobacco bales sold so far down by 16%</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:37",
            "date": "25 Apr 2025"
        },
        {
            "title": "Border official jailed for smuggling 96 tonnes of chrome",
            "url": "https://www.newzimbabwe.com/border-official-jailed-for-smuggling-96-tonnes-of-chrome/",
            "content": "By Staff Reporter\n\nA CUSTOMER services agent at Beitbridge Border Post was recently dragged to court for facilitating the illegal passage into South Africa of three haulage trucks loaded with a combined 96 tonnes of chrome.\n\nAccused person, Brian Zimbume, a customer service agent at Andalusia Investments Pvt Limited, trading as ZimBorders, was convicted of two counts of fraud and sentenced to 18 months imprisonment.\n\nOn his court appearance, Zimbume faced fraud charges, or violating provisions of the Customs and Excise Act for smuggling chrome shipments, potentially prejudicing the Zimbabwe Revenue Authority (ZIMRA) of income.\n\nAgreed facts were that in September 2024, offender deceived ZIMRA officials into giving him access to their scanning tablets under false pretences, claiming he wanted to fix system or network issues.\n\nInstead,the offender used the devices to illegally approve the release of three Scania haulage trucks carrying a total of 96 tonnes of chrome concentrate into South Africa without proper clearance.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/10/30160009/Beitbridge-Border-Post-Pic.jpg",
            "description": "<p>By Staff Reporter A CUSTOMER services agent at Beitbridge Border Post was recently dragged to court for facilitating the illegal passage into South Africa of three haulage trucks loaded with a combined 96 tonnes of chrome. Accused person, Brian Zimbume, a customer service agent at Andalusia Investments Pvt Limited, trading as ZimBorders, was convicted of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/border-official-jailed-for-smuggling-96-tonnes-of-chrome/\">Border official jailed for smuggling 96 tonnes of chrome </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:37",
            "date": "25 Apr 2025"
        },
        {
            "title": "Inmate sentenced to 22 years imprisonment after escaping from custody",
            "url": "https://www.newzimbabwe.com/inmate-sentenced-to-22-years-imprisonment-after-escaping-from-custody/",
            "content": "By Darlington Gatsi\n\nA daring inmate who escaped jail in a movie-style breakout last month has been handed a 22-year jail sentence by the Harare Magistrates Court.\n\nLuke Zinyengere and Tafadzwa Marondera had been in Remand Prison after being implicated in a US$720,000 heist at Quest Financial.\n\nThe duo escaped from prison armed with a revolver in a scheme allegedly assisted by Zimbabwe Prisons and Correctional Services (ZPCS) officer Donald Madzinga.\n\nZinyengere and Marondera escaped while being escorted to a prison truck after a court appearance.\n\nMarondera was sentenced to 10 years by Harare Magistrate Fadzai Mthombeni.\n\nHowever, it is Zinyengere who will endure more years behind bars after Magistrate Rwodzi handed him 10 years for the prison escape and an additional 12 years for robbery.\n\nIn delivering the judgment, Magistrate Rwodzi stated that the prison escape demonstrated the offenders resistance to rehabilitation.\n\nThe crime was committed in a well-planned and sophisticated manner. The circumstances of the two offences carry a maximum sentence. The only mitigating factor is that the accused is a family man and a first-time offender, but you started on the deep end.\n\nThe plan was executed in a movie-style fashion, and it traumatised many people, including court officials. You also traumatised the innocentmembers of the general public going about their businessand the owner of the car you robbed. The original crime you are facing should be considered, and in this case, there are several counts of armed robbery.\n\nI will settle for the highest penalty. Escaping from lawful custody shows that you cannot be rehabilitated in the near future. Society must be protected, and jailbreaking is not childs play, said Magistrate Rwodzi.\n\nZinyengere told the court that he had hatched the escape plan because he wanted to check on his business in Mozambique.\n\nI wanted to go and check on my business in Mozambique because I had delivered some phones, and as of now, Im not sure how it is going. As for stealing the vehicle, it was my means of transportation to escape from lawful custody.\n\nIm very sorrymy family is struggling. They have no food, and my siblings, whom I was taking care of, are also struggling because I was the sole breadwinner. I apologise to Tinashe Chiyamuro for robbing him of his motor vehicle, he told the court.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg",
            "description": "<p>By Darlington Gatsi A daring inmate who escaped jail in a movie-style breakout last month has been handed a 22-year jail sentence by the Harare Magistrates’ Court. Luke Zinyengere and Tafadzwa Marondera had been in Remand Prison after being implicated in a US$720,000 heist at Quest Financial. The duo escaped from prison armed with a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/inmate-sentenced-to-22-years-imprisonment-after-escaping-from-custody/\">Inmate sentenced to 22 years imprisonment after escaping from custody</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:37",
            "date": "25 Apr 2025"
        },
        {
            "title": "“We are shutting down all State Universities in Zimbabwe” – lecturers threaten more industrial action over poor salaries, give govt 10-day ultimatum",
            "url": "https://www.newzimbabwe.com/we-are-shutting-down-all-state-universities-in-zimbabwe-lecturers-threaten-more-industrial-action-over-poor-salaries-give-govt-10-day-ultimatum/",
            "content": "By Costa Nkomo\n\nThe University of Zimbabwe Association of University Teachers (AUT) has threatened to escalate industrial action to all 14 state universities within the next 10 days if the University of Zimbabwe (UZ) and the government continue to ignore their grievances regarding poor wages.\n\nThe AUT is demanding that the government and UZ reinstate lecturers salaries to the pre-October 2018 period, when a junior lecturer earned US$2,250 before the remuneration was slashed to US$230.\n\nSpeaking outside the UZ campus, during the first day of their protests, union legal advisor and senior labour law lecturer at UZ, Munyaradzi Gwisai, issued Higher and Tertiary Education Minister Fredrick Shava and the Treasury a ten-day ultimatum.\n\nUZ lecturer Munyaradzi Gwisai\n\nHe stated that if they fail to address lecturers welfare, they will extend industrial action to all 14 state universities.\n\nDr Shava, the choice is yours. You and Professor Mthuli Ncube and Permanent Secretary George Guvamatanga, the one who we hear is looting public funds, you must sit down and give UZ lecturers and staff what is their due.\n\nIf you do not, take it from us, this is going to be a struggle that is going to go to the entire fourteen state universities and this is going to happen in the next ten days, fumed Gwisai, to rousing cheers from the assembled protesters.\n\nGwisai insisted that the university must entirely cease its services and has pleaded with all lecturers to withdraw all forms of service, including examination marking, until the institution reviews their salaries.\n\nWe must ensure that not a single examination paper is marked from today onwards. We must ensure that not a single examination board sits from today going onwards, Gwisai exclaimed with ululations from the protesters.\n\nAUT spokesperson Professor Obvious Vengeyi told NewZimbabwe.com that the UZ administration is full of blue-ticking legends (referring to ignoring messages) who are refusing to engage with lecturers.\n\nHe further charged that the arrogance of the administration stinks and will only make the situation worse.\n\nWe must ensure that if you get a call from a dean, a departmental chairperson, who says to you, come to the lecture room, you just ignore it.\n\nThey are buying themselves top-of-the-range latest vehicles. They are arrogant. They dont talk to us. They are not engaging us. We wrote to them more than forty letters since 2018, and they only replied to two. They squander resources on their own, leaving lecturers suffering. We need dignity for the profession. How can you pay a professor US$230? Professor Vengeyi fumed.\n\nHe said the administration seems to be living on a different planet, completely disconnected from the realities faced by the lecturers.\n\nLast week, Professor Vengeyi and his colleagues were arrested at UZ for protesting against poor wages and were released after spending a night in police cells and paying US$15 fines.\n\nLast week, the High Court of Zimbabwe also interdicted the Zimbabwe Republic Police (ZRP) and the UZ from interfering with the protesting lecturers.\n\nThe UZ lecturers vowed to continue with the protest indefinitely until their demands are met.\n\nThe protests continue Friday outside the UZ premises.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/24103647/UZ-strike-1-scaled.png",
            "description": "<p>By Costa Nkomo The University of Zimbabwe Association of University Teachers (AUT) has threatened to escalate industrial action to all 14 state universities within the next 10 days if the University of Zimbabwe (UZ) and the government continue to ignore their grievances regarding poor wages. The AUT is demanding that the government and UZ reinstate</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/we-are-shutting-down-all-state-universities-in-zimbabwe-lecturers-threaten-more-industrial-action-over-poor-salaries-give-govt-10-day-ultimatum/\">“We are shutting down all State Universities in Zimbabwe” – lecturers threaten more industrial action over poor salaries, give govt 10-day ultimatum</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:37",
            "date": "25 Apr 2025"
        },
        {
            "title": "Zimbabwe on the brink: Analysts warn of political implosion and economic collapse",
            "url": "https://www.newzimbabwe.com/zimbabwe-on-the-brink-analysts-warn-of-political-implosion-and-economic-collapse/",
            "content": "The Citizen\n\nAs Zimbabwes socioeconomic crisis deepens, analysts warned this week that the country may be heading for an implosion.\n\nAccording to Harare-based human rights lawyer Thulani Mzala, the mineral and tobacco-rich middle-income country has been hit by multifaceted problems.\n\nThese include political repression, economic collapse and institutional decay, with President Emmerson Mnangagwa seeking to extend his rule to 2030.\n\nIn addition scores of human rights activists are in jail, medicines and bed linen are scarce in most hospitals, leading to dysfunctional health care and prisons are running out of food.\n\nDespite stability hinging on political parties, including the ruling Zanu-PF, commencing negotiations, Mzala said a collapse in the Zimbabwean opposition and the factionalism plaguing the governing party remained among the negative factors.\n\nAnother factor is the infighting within Zanu-PF, with Vice-President General Constantino Chiwenga, who led the military coup to oust former president Robert Mugabe, at loggerheads with Mnangagwa over the extension of his term of office to 2030.\n\nThere has been a document circulating that is expected to go to Cabinet for the approval of the extension of Mnangagwa term. The document will thereafter move to parliament, with MPs expected to vote in favour of extending the presidents term to 2030, said Mzala.\n\nHe described the Zimbabwean situation as very tense amid a standoff between Mnangagwa and expelled Zanu-PF central committee member Blessed Geza.\n\nGeza has been mobilising mass demonstrations and stayaways. He calls the president corrupt and says he is butchering the constitution in wanting to extend his term. No one knows what is going to happen due to Zanu-PF internal factionalism. Whether Chiwenga still has support in the military remains to be seen amid talk of a military takeover. But the president seems to be in control of the military.\n\nPolitical analysts Dale McKinley and Sandile Swana said Zimbabwe was far from the restoration of normality Said McKinley: Zimbabwe is in a deep, structural, political, economic and social crisis.\n\nAt the heart of it is Zanu-PF, which runs the government and the military that supports it, and is not interested in democracy.\n\nThey are interested in maintaining power at all costs, with the economic crisis going on for the past 20 years in varying degrees, irrespective of the removal of Mugabe.\n\nThe predatory elite use the state  a vampire state trying to suck out everything. It will take a social and political revolution in Zimbabwe to change the status quo  people rising up, combined with pressure from outside.\n\nSwana said: The crisis will continue for as long as Zanu-PF does not want to share power. The Zimbabwean intelligentsia do not recognise the continuing role of Zanu-PF and President Mnangagwa.\n\nNormality in Zimbabwe will come when Zimbabweans agree among themselves that Zanu-PF does not have the right to lead Zimbabwe.\n\nFor as long as the crisis exists, Zimbabweans will live in Botswana, South Africa and other neighbouring countries because the Zimbabwe economy is terrible.\n\nHe said the Southern Africa Development Community (SADC) leaders have been mutually protecting each other.\n\nThose like Zambian President Hakainde Hichilema, who criticised the arrangement with Zimbabwe, have been ridiculed by SADC members for likening Zimbabwe to the Titanic sinking.\n\nProf Zwelinzima Ndevu, a public leadership expert from the University of Stellenbosch, urged Zimbabweans to play a more active role in the countrys affairs.\n\nElections failed to produce the desired outcome, with a change in leadership not achieved. There is a need for an impact-driven grassroots movement to focus beyond politics on the general well-being of people.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/03005745/SONA-4-Mnangagwa.png",
            "description": "<p>The Citizen As Zimbabwe’s socioeconomic crisis deepens, analysts warned this week that the country may be heading for an implosion. According to Harare-based human rights lawyer Thulani Mzala, the mineral and tobacco-rich middle-income country has been hit by “multifaceted problems”. These include political repression, economic collapse and institutional decay, with President Emmerson Mnangagwa seeking to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-on-the-brink-analysts-warn-of-political-implosion-and-economic-collapse/\">Zimbabwe on the brink: Analysts warn of political implosion and economic collapse</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:37",
            "date": "25 Apr 2025"
        },
        {
            "title": "Tanzania bans South Africa and Malawi imports as trade row escalates",
            "url": "https://www.newzimbabwe.com/tanzania-bans-south-africa-and-malawi-imports-as-trade-row-escalates/",
            "content": "BBC\n\nA normally bustling border crossing between Tanzania and Malawi was noticeably quieter than usual on Thursday as a result of an escalating regional trade row.\n\nFrom midnight, Tanzania banned the entry of all agricultural imports from Malawi and South Africa in response to what it sees as restrictions on some of its exports.\n\nSouth Africa has for years prohibited the entry of bananas from Tanzania. Malawi last month blocked imports of flour, rice, ginger, bananas and maize from its northern neighbour.\n\nWe are taking this step to protect our business interests in business, we must all respect each other, Tanzanias Agriculture Minister Hussein Bashe said on Wednesday, confirming the ban.\n\nDiplomatic efforts to resolve the trade issues have so far failed but Bashe said fresh talks were ongoing.\n\nThe row comes at a time when Africa is supposed to be moving towards greater free trade through the establishment of acontinent-wide free-trade area, which began operating four years ago.\n\nSouth African exports of various fruits, including apples and grapes, to Tanzania will be hit. Meanwhile, landlocked Malawi, which has relied on Tanzanian ports to carry its exports such as tobacco, sugar and soybeans to the rest of the world, will have to reroute its goods.\n\nMalawis ban on the import of certain produce, announced in March, was designed as a temporary measure covering goods from all countries to protect local producers, according to the authorities in Lilongwe.\n\nIt is a strategic move to create an environment where local businesses can thrive without the immediate pressure of foreign competition, Malawis Trade Minister Vitumbiko Mumba said at the time.\n\nTanzanias agriculture minister said Malawis move had directly affected his countrys traders and described the restrictions as unfair and harmful.\n\nWhile confirming the import ban, Bashe assured Tanzanians that it would not threaten their food security.\n\nNo Tanzanian will die from a lack of South African grapes or apples, he said, adding that, we are taking these actions to protect Tanzanian interests.\n\nNeither South Africa nor Malawi have commented on Tanzanias move.\n\nAt the Kasumulu crossing, through which most Tanzania-Malawi trade passes, only a handful of lorries transporting cargo such as fuel were spotted on the Tanzanian side.\n\nOn a normal day, more than 15 lorries loaded with agricultural produce would cross the frontier, drivers told BBC.\n\nOn the Malawian side, many lorries that should be transporting bananas and tomatoes through Tanzania were parked and empty.\n\n[The drivers] are now trying to find alternative products to transport. Its been very difficult for them because they are used to carrying agricultural goods, and now they cant carry not just bananas and tomatoes, but even maize and potatoes, Happy Zulu, a business person, told BBC.\n\nTrade flows between Tanzania, Malawi and South Africa  all members of the Southern African Development Community (Sadc), a regional political, security and economic body  were already being affected last week.\n\nOn Saturday Basheposted a social media video showing a pile of rotten bananasin a truck stranded at the border with Malawi, saying it was hard for Tanzania to tolerate the trend.\n\nTonnes of tomatoes also spoiled at the border recently after lorries from Tanzania were denied entry into Malawi.\n\nMalawi has become an increasingly important market for Tanzanian goods in recent years, with exports trebling between 2018 and 2023, according to official Tanzanian figures.\n\nBut while Tanzania can seek alternative markets such as in Kenya, Namibia and South Sudan, landlocked Malawi may find it harder to get its goods out of the country.\n\nMuch of its exports go through the Tanzanian port of Dar es Salaam, as well as essential imports such as fuel and machinery.\n\nLosing access to Dar es Salaam would likely force Malawi to move shipments through the Mozambican ports of Beira and Nacala  options that may be more expensive.\n\nBashe argued the ban was not meant to provoke a trade war but to protect Tanzanias interests.\n\nTanzania will not continue to allow unequal market access to persist at the expense of its people, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/25055748/TANZANIA-bans-SA-Malawi-imports.webp",
            "description": "<p>BBC A normally bustling border crossing between Tanzania and Malawi was noticeably quieter than usual on Thursday as a result of an escalating regional trade row. From midnight, Tanzania banned the entry of all agricultural imports from Malawi and South Africa in response to what it sees as restrictions on some of its exports. South</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tanzania-bans-south-africa-and-malawi-imports-as-trade-row-escalates/\">Tanzania bans South Africa and Malawi imports as trade row escalates</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:37",
            "date": "25 Apr 2025"
        },
        {
            "title": "Professionals have been reduced to rag-tag beggars – Biti slams government over lecturers’ US$250 salary",
            "url": "https://www.newzimbabwe.com/professionals-have-been-reduced-to-rag-tag-beggars-biti-slams-government-over-lecturers-us250-salary/",
            "content": "By Darlington Gatsi\n\nFORMER Finance Minister Tendai Biti has castigated the government over the wage stalemate with University of Zimbabwe (UZ) lecturers, saying the once-noble professionals have been reduced to a mockery.\n\nUZ lecturers are at loggerheads with the institution and the Ministry of Higher and Tertiary Education over paltry salaries. The lecturers currently earn US$250 and are demanding an upward review to US$3,500.\n\nBiti said the status quo is a denigration of workers.\n\nEducation is a fundamental driver of dignity, development & upliftment. It is the ultimate equaliser. Teachers & lecturers are a national asset. That the Harare regime is paying US$250 to a university professor whilst billions are being looted by gangsters & cronies is an indictment.\n\nIn any normal country, it is a privilege to teach at a university. In Zimbabwe, our professionals have been reduced to rag-tag beggars whilst dropouts & convicts parade ill-gotten loot that they dish out like confetti. Teachers, doctors, nurses & all must be paid a decent living wage.\n\nThis regime has failedand failed in absolute terms. Its treatment of working people, its debasement of professionals, the collapse of public services, the corruption, the decaythese are daily narratives. We therefore restate the call for a new consensus. This one has failed! said Biti.\n\nBuoyed by a High Court judgment that granted them permission to picket without fear of arrest, UZ lecturers have downed tools and are protesting at the institution over poor remuneration.\n\nIn their initial letter to the UZ and government, the lecturers expressed frustration over the employers inaction in addressing their grievances.\n\nThe situation is further compounded by a lack of resources, leaving lecturers to use personal equipment.\n\nDespite prolonged engagement over 18 months, the employer and the minister have failed to meet AUTs demands or make any reasonable alternative offer, resulting in the issuance of a Certificate of No Settlement.\n\nThe dispute remains unresolved, and lecturers and their families are languishing in extreme poverty, with a net monthly salary of less than US$250 and ZiG 6,000a sum from which the employer harshly and unfairly expects employees to subsidise it by providing personal property as tools of work, including laptops, smartphones, data, and transport to and from work, read the letter.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/06045739/Tendai-Biti1.jpg",
            "description": "<p>By Darlington Gatsi FORMER Finance Minister Tendai Biti has castigated the government over the wage stalemate with University of Zimbabwe (UZ) lecturers, saying the once-noble professionals have been reduced to a mockery. UZ lecturers are at loggerheads with the institution and the Ministry of Higher and Tertiary Education over paltry salaries. The lecturers currently earn</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/professionals-have-been-reduced-to-rag-tag-beggars-biti-slams-government-over-lecturers-us250-salary/\">Professionals have been reduced to rag-tag beggars – Biti slams government over lecturers’ US$250 salary</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:37",
            "date": "25 Apr 2025"
        }
    ]
}