{
    "news": [
        {
            "title": "‘It’s coming home’ – the undignified row over the body of Zambia’s ex-president",
            "url": "https://www.newzimbabwe.com/its-coming-home-the-undignified-row-over-the-body-of-zambias-ex-president/",
            "content": "BBC\n\nIts coming home!  a phrase indelibly linked to English football fans  has now gained currency among some Zambians in the battle over what to do with the body of former President Edgar Lungu.\n\nThe 68-year-old died two months ago in South Africa where he was being treated for an undisclosed illness.\n\nIn the latest episode of what is now a full-blown saga, a Pretoria court ruled in the Zambian governments favour, saying that in the public interest, Lungus remains can be repatriated and given a state funeral, against the wishes of the family.\n\nThe decision triggered celebrations among some governing party supporters, who shared Facebook posts with the phrase: Its coming home, as if Zambia had won a trophy.\n\nAn undignified response, perhaps, but it has come to symbolise how divisive and partisan this has become.\n\nFor some, who are fed up with the row, the sorrow and grief that came with Lungus passing have faded into feelings of fatigue.\n\nBut despite a host of more pressing economic problems, public discussions continue to be dominated by the fallout from the death of the former president, who led the country for six years from 2015.\n\nThe seeds of the controversy were sown in the feud between Lungu and his successor  the man who soundly beat him in the 2021 election  Hakainde Hichilema. But it has now spiralled into a row laced with wild accusations of witchcraft.\n\nWhen the judge in South Africa made his ruling last week, the ensuing anger from Lungus older sister was telling.\n\nBertha Lungu burst into a fit of rage, crying uncontrollably as she hurled unsavoury words at Zambias Attorney General Mulilo Kabesha, who was also present in court.\n\nKabesha, Lungu is not your fathers son hes not Hakaindes son This is really painful. I dont want to go to Zambia, she cried as people, including her niece, Tasila Lungu, struggled to comfort her and cover her mouth.\n\nThe body has not yet been repatriated to Zambia because the Lungu family is appealing against the South African judges decision  a case that is due to be heard on Friday.\n\nThis was all supposed to have been settled in June, when the family initially agreed that there could be a state funeral in Zambia. But the plans were scuppered over a dispute about what role President Hichilema would play.\n\nLungus family said one of his dying wishes was that Hichilema should not go anywhere near his body.\n\nThe key to understanding the animosity was the more than 100 days that Hichilema, opposition leader at the time, spent in detention in 2017, awaiting trial on treason charges.\n\nHe was accused of endangering the life of then-President Lungu after his motorcade allegedly refused to give way to the one transporting the head of state.\n\nThe charges were only dropped after the intervention of the secretary general of the Commonwealth. This was one of several times that Hichilema was arrested while he was in the opposition.\n\nIn turn, the Lungus have alleged persecution under Hichilema. Tasila and the former presidents widow, Esther, continue to face corruptions charges, which they deny.\n\nLungus family have vowed that they are prepared to wait for the court process as long as it takes to ensure he receives a burial they consider dignified, even if it means stalling the process, according to their spokesperson Makebi Zulu.\n\nThey insist that while they were open to burying Lungu in Zambia, they want to honour his wishes that Hichilema should not attend the event.\n\nBut the authorities are adamant that the former president should be accorded a state funeral to be attended by his successor and given a proper send-off as a former president.\n\nThe government, through the attorney general, has even indicated Lungu may have to be buried without the familys involvement.\n\nIf they want to set a precedent, let them give us reasons why the current president should not go near the casket. And who has told them that he wants to be near the casket, anyway? he told the state broadcaster ZNBC.\n\nWe are ready as government to discuss with the family, we will never ignore the family unless the family just walks out but the family has a right to say: We are not coming, we are not part of it. Then we will proceed and bury without them.\n\nTraditionally, all ex-leaders have been accorded state funerals and buried at Embassy Park, which is specifically reserved for them.\n\nSishuwa Sishuwa, a Zambian historian and senior lecturer at South Africas Stellenbosch University, strongly disagrees with the idea that Lungu could be buried without his familys involvement.\n\nSuch reckless statements are culturally insensitive, undermine the governments claims that its actions are motivated by the desire to accord Lungu a dignified burial, and indicate that political considerations rather than public interest are the key drivers at play, he told the BBC.\n\nThe failure by Hichilema to rein in on the unruly conduct of his officials and supporters has fed public perception that the president approves of such conduct and consequently heightened divisions.\n\nHe argues that had Hichilema publicly indicated that he would stay away from the funeral, Lungu would have been buried long ago.\n\nDr Sishuwa says that the authorities determination to take the body of Lungu from the grieving family  in the name of giving him a dignified funeral  has not only worsened political divisions but has also fed the belief that the body may be wanted for occult reasons, in a country where thebelief in witchcraft is widespread.\n\nNevers Mumba, the leader of the Movement for Multiparty Democracy, which is in a political alliance with Hichilemas party, has defended the president.\n\nWhat drives [the president] is not obsession, but a deep, deep sense of duty. Hakainde Hichilema never gives up on anything he pursues as long as he believes he is doing the right thing, Mumba, who is also a pastor, wrote on his Facebook page.\n\nHe fights, with a clear conscience till the end, and he keeps on refining his methods until he gets it right.\n\nHow long this fight will go on for is not known, but several episodes of the saga are yet to be written.\n\nZambians may shrug and try to focus on other matters, but they will still get drawn into the debate about whether the body should come home.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/25163954/lungu-burial.webp",
            "description": "<p>BBC “It’s coming home!” – a phrase indelibly linked to English football fans – has now gained currency among some Zambians in the battle over what to do with the body of former President Edgar Lungu. The 68-year-old died two months ago in South Africa where he was being treated for an undisclosed illness. In</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/its-coming-home-the-undignified-row-over-the-body-of-zambias-ex-president/\">‘It’s coming home’ – the undignified row over the body of Zambia’s ex-president</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:32",
            "date": "15 Aug 2025"
        },
        {
            "title": "Harare City Council officials attending workshops to sleep in hotels – councillor says",
            "url": "https://www.newzimbabwe.com/harare-council-officials-attending-workshops-to-sleep-in-hotels-councillor-says/",
            "content": "By Darlington Gatsi\n\nHARARE City Council continues to be dogged by the extravagance of its top officials, with residents bearing the brunt of the senior executives excessive expenditures.\n\nDespite being cash-strapped, top City Council officials have been attending workshops in excessive numbers at the municipalitys expense.\n\nSpeaking at a recent Council meeting, Harare Councillor Denford Ngadziore bemoaned the extravagance, saying some officials attend workshops merely to sleep in hotels.\n\nAt one time, we had over 20 workshops or trips of Council. My issue is if you go and check attendance, it is showing it seems as if we might be at a position where we are spending more on trips and workshops that are not also having a direct benefit to the Council. For example, you see a report that has three councillors, officials 20. Some of the justifications.\n\nI have been previously attending those workshops, but most of the people during the workshops people will be in rooms, not even contributing to whatever that will be happening, said Ngadziore.\n\nThis is a slap in the face for residents, who are bearing the brunt of the City Councils poor service delivery, often attributed to a lack of funds, while officials attend numerous workshops.\n\nWorkshops have become a feeding trough for council officials, who are reportedly pocketing hefty allowances.\n\nThe City Councils extravagance also became a bone of contention at the Commission of Inquiry, which was investigating the local authoritys governance systems.\n\nIn response, Harare Mayor Jacob Mafume said workshops should be downsized to reduce the burden on the City Council.\n\nLet us look at some of the workshops so that we reduce the cost to the organisation. Let us look at the bottom line as far as that issue is concerned, said Mafume.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/08041101/town-house1.jpg",
            "description": "<p>By Darlington Gatsi HARARE City Council continues to be dogged by the extravagance of its top officials, with residents bearing the brunt of the senior executives’ excessive expenditures. Despite being cash-strapped, top City Council officials have been attending workshops in excessive numbers at the municipality’s expense. Speaking at a recent Council meeting, Harare Councillor Denford</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-council-officials-attending-workshops-to-sleep-in-hotels-councillor-says/\">Harare City Council officials attending workshops to sleep in hotels – councillor says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:32",
            "date": "15 Aug 2025"
        },
        {
            "title": "High Court refuses to hear Varakashi4ED leader’s divorce case, says Canadian Court has jurisdiction",
            "url": "https://www.newzimbabwe.com/high-court-refuses-to-hear-varakashi4ed-leaders-divorce-case-says-canadian-court-has-jurisdiction/",
            "content": "By Staff Reporter\n\nThe High Court has thrown out a divorce bid filed by the leader of Zanu PFs online brigade, Varakashi4ED, Jonas Musara, against his estranged wife living in Canada, ruling that local courts have no jurisdiction because the matter is already before a Canadian court.\n\nThe application was filed by Musara, who is going through a nasty separation with his wife, Winnet Paidamoyo Motsi, who is currently living abroad.\n\nJustice Fatima Maxwell upheld a special plea by Motsi, finding that this court will withhold its jurisdiction until the matter in Canada is finalised, and warning against the risk of conflicting judgments, which is contrary to the principles of justice and judicial comity.\n\nThe judge said the actor forum rei principle  that the court of the defendants domicile has jurisdiction  applied since Motsi is domiciled in Canada.\n\nThe Zimbabwean courts cannot assume jurisdiction simply because the Plaintiff is domiciled or resident in Zimbabwe, she ruled.\n\nMotsi had argued that her husband could not pursue a parallel divorce action in Zimbabwe while a similar case was pending before another court of competent jurisdiction in Canada.\n\nThe judge agreed, stressing that this is correct to prevent duplication and conflicting rulings.\n\nIf an action is already pending between parties it is open to the Defendant to take the objection of lis pendens whereupon the court in its discretion may stay the second action pending the decision of the first, she said.\n\nMusaras lawyer had urged the court to use its inherent jurisdiction to hear the case, arguing that his client was being denied access to the couples minor children.\n\nBut Justice Maxwell said those rights must be enforced in the Canadian proceedings.\n\nThat there is an access order being defied is not for these proceedings, she ruled. Plaintiff is legally represented and should be advised on what steps to take to enforce his rights granted by an order of Court.\n\nThe judge also noted that Musara was seeking to have custody of the children awarded to Motsi, making it more appropriate for the Canadian Court to deal with the issue of the maintenance of the minor children.\n\nDismissing the case, Justice Maxwell advised Musara that if Motsi is unnecessarily dragging the process there should be ways in which he can have that matter dismissed by the Canadian Court Once that is done, he can then properly approach this Court.\n\nThe special plea was upheld, effectively halting the Zimbabwe proceedings.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/13170431/jones-musara.jpg",
            "description": "<p>By Staff Reporter The High Court has thrown out a divorce bid filed by the leader of Zanu PF’s online brigade, Varakashi4ED, Jonas Musara, against his estranged wife living in Canada, ruling that local courts have no jurisdiction because the matter is already before a Canadian court. The application was filed by Musara, who is</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-refuses-to-hear-varakashi4ed-leaders-divorce-case-says-canadian-court-has-jurisdiction/\">High Court refuses to hear Varakashi4ED leader’s divorce case, says Canadian Court has jurisdiction</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:32",
            "date": "15 Aug 2025"
        }
    ]
}