{
    "news": [
        {
            "title": "Amnesty warns Tanzania General Elections won’t be free and fair",
            "url": "https://www.newzimbabwe.com/amnesty-warns-tanzania-general-elections-wont-be-free-and-fair/",
            "content": "Prime Africa\n\nAmnesty International has accused Tanzanian authorities of carrying outsystematic human rights violationsin the run-up to the countrys October 29 presidential election, which has already been marred by the exclusion of key opposition candidates.\n\nIn a new report released Monday, Amnesty detailed an alarming rise in abuses between January 2024 and October 2025, includingenforced disappearances, torture, and extrajudicial killings of opposition figures and activists.\n\nThe report, reviewed by AFP, is based on interviews with 43 individuals  among them victims, witnesses, family members, NGO workers, and lawyers  as well as verified images and social media publications.\n\nInitially lauded for reversing the repressive legacy of her predecessor, the late PresidentJohn Magufuli, current PresidentSamia Suluhu Hassanis now facing mounting criticism from human rights groups and opposition figures as she seeks a second term in office.\n\nAuthorities have ramped up their clampdown on civic space and the right to participate freely in elections through the passing of deeply flawed legislation,Tigere Chagutah, Amnestys Regional Director for East and Southern Africa\n\nOne of the most shocking cases documented by Amnesty involvesAli Mohamed Kibao, a senior official of the main opposition partyChadema, who was abducted in September 2024 and later found dead. Despite an official investigation, no progress has been reported.In a separate incident this month,Humphrey Hesron Polepole, Tanzanias former ambassador to Cuba and a vocal government critic, disappeared under mysterious circumstances. His whereabouts remain unknown.Chadema has beenbarredfrom participating in the upcoming polls after refusing to sign the governmentsElectoral Code of Conduct, which opposition parties say unfairly restricts their operations.Party leaderTundu Lissu, one of the countrys most prominent opposition voices, remains in detention on treason charges  an offense that carries the death penalty under Tanzanian law.Meanwhile,Luhaga Mpina, the presidential candidate for theAlliance for Change and Transparency (ACT Wazalendo), has also been disqualified from the race, effectively leaving President Hassan with little organized competition.Human rights observers warn that Tanzanias democratic backsliding could deepen political instability and erode hard-won freedoms in one of East Africas largest economies.\n\nOne of the most shocking cases documented by Amnesty involvesAli Mohamed Kibao, a senior official of the main opposition partyChadema, who was abducted in September 2024 and later found dead. Despite an official investigation, no progress has been reported.\n\nIn a separate incident this month,Humphrey Hesron Polepole, Tanzanias former ambassador to Cuba and a vocal government critic, disappeared under mysterious circumstances. His whereabouts remain unknown.\n\nChadema has beenbarredfrom participating in the upcoming polls after refusing to sign the governmentsElectoral Code of Conduct, which opposition parties say unfairly restricts their operations.\n\nParty leaderTundu Lissu, one of the countrys most prominent opposition voices, remains in detention on treason charges  an offense that carries the death penalty under Tanzanian law.\n\nMeanwhile,Luhaga Mpina, the presidential candidate for theAlliance for Change and Transparency (ACT Wazalendo), has also been disqualified from the race, effectively leaving President Hassan with little organized competition.\n\nHuman rights observers warn that Tanzanias democratic backsliding could deepen political instability and erode hard-won freedoms in one of East Africas largest economies.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/07022606/Tanzanias-president-Samia-Suluhu-Hassan.png",
            "description": "<p>Prime Africa Amnesty International has accused Tanzanian authorities of carrying out “systematic human rights violations” in the run-up to the country’s October 29 presidential election, which has already been marred by the exclusion of key opposition candidates. In a new report released Monday, Amnesty detailed an alarming rise in abuses between January 2024 and October 2025, including “enforced</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/amnesty-warns-tanzania-general-elections-wont-be-free-and-fair/\">Amnesty warns Tanzania General Elections won’t be free and fair</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:32",
            "date": "21 Oct 2025"
        },
        {
            "title": "Chinese firm rushes to extract over 60,000 metric tonnes of lithium ahead of ban",
            "url": "https://www.newzimbabwe.com/chinese-firm-rushes-to-extract-over-60000-metric-tonnes-of-lithium-ahead-of-ban/",
            "content": "Reuters\n\nChinas Zhejiang Huayou Cobalt plans to extract more than 60,000 metric tonnes of lithium sulphate during the first quarter of 2026 from its new $400 million plant in Zimbabwe, the company says.\n\nThis comes as Zimbabwe plans to ban lithium export and boost local processing by 2027.\n\nLithium sulphate is an intermediate product that can be refined into a battery-grade material such as lithium hydroxide or lithium carbonate used in battery manufacturing.\n\nWe will start the first production from the beginning of next year, Prospect Lithium Zimbabwe general manager Henry Zhu told reporters on Thursday.\n\nThe quantity of the lithium sulphate should be more than 60,000 metric tonnes, but it will depend on the configuration of the plant, because it is brand new, Zhu added.\n\nLocal operations\n\nThe newly completed plant at Huayouswholly owned Prospect Lithium Zimbabwes Arcadia minehas a capacity to exceed 50,000 metric tons of lithium sulphate annually, an executive said during a tour of the operation.\n\nZimbabwe, Africas top lithium producer, has been nudging miners to process the mineral in the country in order to help lift its economy.\n\nHuayou, which acquired Arcadia lithium mine for $422 million in 2022, commissioned a $300 million lithium concentrator in 2023.\n\nThe company, along with other Chinese metals firms, including Sinomine, Chengxin Lithium Group, Yahua Group, and Tsingshan Holding, dominates Zimbabwes lithium mining, producing concentrates and shipping them to their home country.\n\nThe southern African country willban the export of lithium concentratesfrom 2027 as it pushes for more local processing.\n\nSinomine has also announced plans to build a $500 million lithium sulphate plant at its Bikita mine in Zimbabwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/21050825/lithium.webp",
            "description": "<p>Reuters China’s Zhejiang Huayou Cobalt plans to extract more than 60,000 metric tonnes of lithium sulphate during the first quarter of 2026 from its new $400 million plant in Zimbabwe, the company says. This comes as Zimbabwe plans to ban lithium export and boost local processing by 2027. Lithium sulphate is an intermediate product that</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chinese-firm-rushes-to-extract-over-60000-metric-tonnes-of-lithium-ahead-of-ban/\">Chinese firm rushes to extract over 60,000 metric tonnes of lithium ahead of ban</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:32",
            "date": "21 Oct 2025"
        },
        {
            "title": "Namibia declares Mpox outbreak following confirmed case in Swakopmund",
            "url": "https://www.newzimbabwe.com/namibia-declares-mpox-outbreak-following-confirmed-case-in-swakopmund/",
            "content": "IOL\n\nThe Ministry of Health and Social Services (MoHSS) of Namibia has declared an outbreak of Mpox following the confirmation of the first case in Swakopmund, Erongo Region, on 18 October 2025.\n\nThe patient, who is being treated at the Swakopmund District Hospital, is stable and currently isolated, undergoing comprehensive medical care.\n\nThe preliminary investigation into the outbreak has indicated that this transmission may be linked to cross-border travel within the Southern African Development Community (SADC) region. In accordance with World Health Organisation (WHO) protocols, the detection of even a single confirmed case necessitates the declaration of an outbreak, prompting health authorities to launch an immediate response.\n\nThe MoHSS has assured the Namibian public that the countrys robust surveillance system is primed to identify and monitor individuals exhibiting signs of mpox. Additional cases are being actively sought, while health authorities in the Erongo region are closely monitoring the patients immediate contacts to prevent further spread of the virus.\n\nMpox is a zoonotic disease caused by an orthopox virus, resulting in smallpox-like symptoms in humans. This outbreak follows a concerning trend, as multiple countries within Africa, including the Democratic Republic of the Congo (DRC), Zambia, Malawi, and Tanzania, are reporting active mpox cases.\n\nMpox symptoms typically manifest after an incubation period ranging from 5 to 21 days and can include:\n\nThe rash often appears on the face, palms, and soles of the feet, and can also affect the mouth, genitals, and eyes. Symptoms generally last from two to four weeks, during which the infected individuals are capable of transmitting the virus to others.\n\nHuman-to-human transmission occurs primarily through direct contact with respiratory secretions, bodily fluids, or skin lesions of an infected person. The MoHSS outlines several potential avenues for transmission, including:\n\nAs mpox can affect anyone regardless of demographic, the MoHSS urges the public to take preventive measures. These include:\n\nIn light of this outbreak, the MoHSS has mobilised necessary resources to respond effectively, emphasising the importance of public cooperation. Citizens are encouraged to remain calm and to refrain from spreading unverified information, which could instigate unnecessary panic or stigma towards affected individuals and their families.\n\nAs Namibian health officials continue to monitor the situation closely, ongoing updates will be provided to keep the public informed. The health and well-being of all citizens remain a top priority for the government and health authorities.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/08/14052550/mpox.jpg",
            "description": "<p>IOL The Ministry of Health and Social Services (MoHSS) of Namibia has declared an outbreak of Mpox following the confirmation of the first case in Swakopmund, Erongo Region, on 18 October 2025. The patient, who is being treated at the Swakopmund District Hospital, is stable and currently isolated, undergoing comprehensive medical care. The preliminary investigation</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/namibia-declares-mpox-outbreak-following-confirmed-case-in-swakopmund/\">Namibia declares Mpox outbreak following confirmed case in Swakopmund</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:32",
            "date": "21 Oct 2025"
        },
        {
            "title": "Afrotellers founder Chivhanga wants Africans to reclaim ownership of their stories",
            "url": "https://www.newzimbabwe.com/afrotellers-founder-chivhanga-wants-africans-to-reclaim-ownership-of-their-stories/",
            "content": "The Citizen\n\nThere are usually grumbles about how Africa doesnt tell its stories enough, with the rest of the world being the narrators of whats happening on the continent.\n\nStorytelling is not just about remembering where we come from, its about shaping where we are going, said CEO of Thrive Afrika and Founder of Afrotellers, Willson Chivhanga.\n\nTo strengthen the ecosystem of African storytellers, The Afrotellers Conference returns to Johannesburg for its second edition this week.\n\nAcross the continent, we are seeing a new generation using stories to confront injustice, reframe history, and imagine futures rooted in dignity, said Chivhanga.\n\nThe three-day gathering is set to take place at the Market Theatre Precinct, Market Square, and the Wits University School of Arts from Thursday to Saturday.\n\nThe Afrotellers Conference is convened by social impact agency Thrive Afrika, in partnership with the Wits School of Arts and the Market Theatre Foundation.\n\nAccording to Chivhanga, the conference is a space for African storytellers to reclaim ownership of their narratives and speak about the continent, its people and its possibilities on their own terms.\n\nAfrotellers is a growing movement. It does not end when the doors close; rather its an ecosystem that connects communities through their stories, said the founder.\n\nThe first edition of the conference saw more than 130 participants from across Africa and the diaspora.\n\nAfrotellers has grown into a continental movement connecting artists, activists and thinkers through community storytelling hubs in Malawi, South Africa, Kenya, Ghana, Nigeria, DR Congo, Lesotho and Zimbabwe.\n\nFrom village gatherings to urban collectives, we are seeing a shared language of resistance, creativity and care emerging across Africa, Chivhanga said.\n\nThis years edition will build on the foundation that was laid in the previous year by exploring storytelling as infrastructure  shaping how Africans imagine themselves, relate to one another and influence how the continent is perceived globally.\n\nSome of the speakers for this years Afrotellers include playwright and scholar Dr Refiloe Lepere, Zimbabwean political organiser Gift Ostallos Siziba, visual activist Prof. Sir Zanele Muholi, Ugandan philanthropy leader Jackie Asiimwe, playwright and director Monageng Vice Motshabi and photographer Andrew Tshabangu.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/20203841/Chivanga-Afrotellers.jpg",
            "description": "<p>The Citizen The three-day Afrotellers Conference returns to Johannesburg for its second edition this week. There are usually grumbles about how Africa doesn’t tell its stories enough, with the rest of the world being the narrators of what’s happening on the continent. “Storytelling is not just about remembering where we come from, it’s about shaping</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/afrotellers-founder-chivhanga-wants-africans-to-reclaim-ownership-of-their-stories/\">Afrotellers founder Chivhanga wants Africans to reclaim ownership of their stories</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:32",
            "date": "21 Oct 2025"
        },
        {
            "title": "Kavango Resources in lucrative gold discovery",
            "url": "https://www.newzimbabwe.com/kavango-resources-in-lucrative-gold-discovery/",
            "content": "By Alois Vinga\n\nSouthern Africa-focused miner Kavango Resources has announced the discovery of a lucrative gold deposit at its Hillside Gold Project in Bulawayo, marking what the company describes as a breakthrough in its Zimbabwe operations.\n\nThe miner said its Nightshift Prospect has been confirmed as a gold deposit with significant upside potential, expected to deliver high ore and ounce yields per vertical metre. The company said the find aligns with its strategy to maximise gold production through modern, mechanised mining and processing methods.\n\nA preliminary JORC-compliant Mineral Resource Estimation has exceeded expectations, prompting Kavango to consider constructing an upgraded 300-tonne-per-day gold processing plant at the Bills Luck Gold Mine, up from the originally planned 200 tpd capacity.\n\nKavango Resources CEO Ben Turney described the discovery as a landmark achievement for the company.\n\nThis maiden JORC resource at Nightshift is a defining moment for Kavango. It proves that our gold development strategy in Zimbabwe is working and that our decision to focus on near-surface, fast-track production targets is delivering results, he said.\n\nTurney added that when the company began exploration at Hillside in mid-2023, its goal was to identify deposits that could fast-track gold production using advanced mining and processing methods.\n\nThis is a fantastic accomplishment by our team, who deserve all the praise for the hard work they have put into making this happen. Our initial drilling covered only about 15% of the known 700-metre strike, and just 50m vertical depth, because we were focused on defining a starter resource to underpin early cash flow and prove the concept.\n\nThe fact that the results have exceeded expectations at this stage gives us strong confidence in the greater potential of Nightshift. Given we encountered gold-bearing structures >200m vertical below surface during exploration, we are particularly excited for the underground mining possibilities here, added Turney.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/06/27102047/Kavango-Resources.webp",
            "description": "<p>By Alois Vinga Southern Africa-focused miner Kavango Resources has announced the discovery of a lucrative gold deposit at its Hillside Gold Project in Bulawayo, marking what the company describes as a breakthrough in its Zimbabwe operations. The miner said its Nightshift Prospect has been confirmed as a gold deposit with significant upside potential, expected to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kavango-resources-in-lucrative-gold-discovery/\">Kavango Resources in lucrative gold discovery</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:32",
            "date": "21 Oct 2025"
        }
    ]
}