{
    "news": [
        {
            "title": "Legal Discussions with Vengai Madzima: Zim Diaspora Property Showcase in Dallas, USA",
            "url": "https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-zim-diaspora-property-showcase-in-dallas-usa/",
            "content": "NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner atMadzima Chidyausiku Museta Legal Practitioners (MCM Legal)to discuss with us legal issues that affect Zimbabweans living in the diaspora. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer.\n\nReporter: Welcome to Dallas, Mr. Madzima. The Zim Diaspora Property Showcase for the United States and Canada has just ended. How do you rate the attendance and buy-infrom the diaspora here in the United States?\n\nVM: As a presenter and panelist at the showcase, I was impressed and pleasantly surprised by the attendance and buy-in from the diaspora market here in the United States of America. There is a hunger for this one-on-one interface with Zimbabwean businesses, specifically in the property sector, to discuss how best the Zimbabweans living in the diaspora can invest in Zimbabwe.\n\nIt may be limiting to just say it was Zimbabweans who attended, there were a few Americans who also attended to understand the property investment processes in Zimbabwe\n\nSome attendees at the conference were from as far as Washington DC, New York and the United Kingdom, which was a bit surprising because it means that the attendees from the United Kingdom flew over 10 hours to attend the event.\n\nReporter:What were your key takeaways from the event?\n\nVM: The first thing is that the market in the United States of America is hungry to invest at home, buy properties and start a general investment portfolio in Zimbabwe.\n\nThe unsaid reality is that the Zimbabwean community living in the United States is too far from home to consistently visit Zimbabwe, as the diaspora market in England, Europe, and Africa enjoys. The distance and cost of travel are significant.\n\nThe market, therefore, heavily relies on social media feedback for investment. Negative experiences by other diasporas have a significant impact on the investment mentality of all. Correctly so, as protective instincts are at the core of human existence.\n\nThe only issue is that some of these experiences contain half-truths, do not delve into the participation by the diaspora transacting party in the negligence through a failure to employ professionals in Zimbabwe to assist with any due diligence process before transacting.\n\nThis positive is what is mainly lacking from an information uptake by the community that I personally managed to interact with. Long and short, the hunger to invest and transfer ideas to Zimbabwe is there and ripe for harvesting.\n\nReporter: What do you think were the benefits for the diaspora community in the United States of America from the property showcase?\n\nVM: The attendees benefited from real-time, practical presentations from an esteemed panel that included Lawrence Nyazema the Group Chief Executive Officer for CBZ Holdings, Tendai Muzadzi General Manager at Datvest Asset Management, Patience Patongamwoyo the Managing Director for Seeff Zimbabwe, and Broadhaven Chief Executive Officer Munyaradzi Majoni whose presentations were eye-opening, informative and invaluable, even for some co-presenters like me who travelled to the showcase from Zimbabwe\n\nReporter: I thought your presentation was equally good!\n\nVM: Thank you.\n\nWhat was more key and beneficial to the attendee, in my view, was the product offering from the exhibitors. There were top developers from all over Zimbabwe, Borrowdale Valley Estate, West Prop, Velda Estates, Tapsington Estates in Marondera, Fairview Properties, CBZ Northgate Estates, and Kings City in Bulawayo.\n\nYour construction companies were also represented by Masimba Holdings and Broadhaven Construction to address the questions on construction issues. Top tier estate agencies including Seeff, Home Pros, Fine and Country and Remax.\n\nEven the public services commission was represented and offering asset management solutions.\n\nThis allowed the attendees to not only enjoy a full bouquet of services, a one-stop shop in essence, but face-to-face interactions with exhibitors representing all areas of real estate investment.\n\nOther areas of diaspora concern were also covered by various companies, including Nyaradzo and ZAMUSA.\n\nReporter: What do you think were the shortcomings of the event?\n\nVM: I honestly think that the organisers collectively underestimated the extent of the interest and geographical distances between different states in the USA. The showcase barely scratched the surface of the opportunities available for the diaspora market and Zimbabwean businesses in the real estate sector. If the showcase was to be hosted in different strategic states with varying concentrations of the Zimbabwe diaspora and Canada separately, the initiative may assist more people.\n\nReporter: Thank you, Mr. Madzima, we have run out of time.\n\nVM: Thank you.\n\nYou can contact Vengai Madzima onvengai@mcmlegal.co.zwor at www.mcmlegal.co.zw\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/28071749/vengai-dallas-e1745821166103.jpg",
            "description": "<p>NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal) to discuss with us legal issues that affect Zimbabweans living in the diaspora. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer. Reporter: Welcome to Dallas, Mr. Madzima. The Zim</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-zim-diaspora-property-showcase-in-dallas-usa/\">Legal Discussions with Vengai Madzima: Zim Diaspora Property Showcase in Dallas, USA   </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:49",
            "date": "28 Apr 2025"
        },
        {
            "title": "City of Harare says bed bugs infestation confined to Mbare, investigating other reported areas",
            "url": "https://www.newzimbabwe.com/city-of-harare-says-bed-bugs-infestation-confined-to-mbare-investigating-other-reported-areas/",
            "content": "By Staff Reporter\n\nCITY of Harare (CoH) has announced that recent reports of bed bugs (tsikidzi) infestations spreading to suburbs such as Mabvuku, Glen View, and Budiriro are pending investigations, confirming that the problem is currently confined to Mbare.\n\nNewZimbabwe.com last visited Mbare on 7 April when the CoH and other agencies provided fumigation chemicals to the residents of Mbare to spray in a bid to contain the outbreak.\n\nIn a statement, the CoH said it deployed a team to investigate claims circulating on social media that bed bugs have spread to various suburbs in Harare.\n\nFollowing the bed bugs infestation at Mbare Flats recently, the City Council has activated its Incident Management System to effectively respond to the bed bugs.\n\nThis includes the appointment of a team to lead the fight against the bed bugs. So far, the infestation is confined to Mbare although our teams have been dispatched to assess other areas reported on social media to have bed bugs.\n\nAn Incident Manager has been appointed and an Incident Action Plan developed. The Operations Section is being led by the Environmental Health Manager Mr Manyara reads the statement.\n\nThe local authority said it is open to collaborations to fight the blood-sucking insects.\n\nSo far, CoH has reported that over 60% of targeted rooms have already been fumigated.\n\nThe bed-bug: There are no known human diseases that are caused by the bed bugs, however they can be a constant nuisance to communities. Its difficult but not impossible to control them. They have a life cycle which includes eggs which are not susceptible to chemicals used thus several fumigation rounds will be conducted to ensure there is adequate control as the eggs subsequently hatch.\n\nCurrent Control Efforts; Integrated Pest Management in Mbare flats [spraying and mass education of the affected community members and their settings]. The Harare city council started round 1 and of the planned 3 rounds of fumigation on 7 April 2025 in Mbare Flats and 64% of 5,450 rooms targeted have been fumigated.\n\nA call has been made to partners and stakeholders to get in touch with the city health department to facilitate mobilisation and collation of response resources.\n\nSustainability: Council is in the process of urgently procuring the services of private fumigation companies to quickly get on the ground and sustain operations, reads the statement\n\nThe council has provided residents with preventive measures to help control and prevent future infestations.\n\nCouncil has been disseminating key messages for bed bugs prevention and control. These tips included urging residents to maintain cleanliness, reduce clutter in rooms and expose household items that can harbour bed bugs to the sunlight regularly for whole afternoon.\n\nRegularly clean/vacuum floors, bed frames, and surrounding areas frequently, especially in cracks and crevices. Apply a recommended pesticide when there is evidence of infestation.\n\nProper laundry practices; wash and dry all bed linens, including sheets, pillowcases, blankets, and mattress protectors, in hot water (at least 50C) and dry them.\n\nRegularly change and wash bedding to prevent bed bug infestations. Avoid or treat second-hand items. Avoid second-hand clothing or fumigate them before use to prevent introducing bed bugs into your living space.\n\nCommunity engagement and cooperation; Participate in fumigation efforts organised by the CoH and are community led; collaborate fumigation teams to ensure comprehensive coverage and prevent the spread of bed bugs between units. Ensure all rooms are open for fumigation teams to access rooms.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/07052122/bedbugs-what-to-know-2500x1300-1.jpg",
            "description": "<p>By Staff Reporter CITY of Harare (CoH) has announced that recent reports of bed bugs (tsikidzi) infestations spreading to suburbs such as Mabvuku, Glen View, and Budiriro are pending investigations, confirming that the problem is currently “confined to Mbare.” NewZimbabwe.com last visited Mbare on 7 April when the CoH and other agencies provided fumigation chemicals</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/city-of-harare-says-bed-bugs-infestation-confined-to-mbare-investigating-other-reported-areas/\">City of Harare says bed bugs infestation confined to Mbare, investigating other reported areas </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:49",
            "date": "28 Apr 2025"
        },
        {
            "title": "Money transfer agency teller in US$4,700 and ZAR600 theft",
            "url": "https://www.newzimbabwe.com/money-transfer-agency-teller-in-us4700-and-zar600-theft/",
            "content": "By Staff Reporter\n\nA TELLER employed by a reputable money transfer agency has been dragged to court for stealing US$4, 705 and ZAR600 from her employer.\n\nAccused person Christwish Machamacha (47), a teller employed by Zimsend trading as Hello Paisa, appeared at Chipinge Magistrates Court for theft or trust property.\n\nShe was sentenced to 24 months imprisonment of which nine months were suspended on condition of good behaviour and full restitution of the stolen cash. The remainder was commuted to 526 hours of community service.\n\nCircumstances were that between March 13 and April 15 this year, Machamacha was stationed at a Zimsend outlet at Gonye and Sons Supermarket in Chipinge. Her role as a teller involved receiving money from the company and disbursing it to local clients, who would have received international remittances.\n\nDuring that period, she was entrusted with a total of US$4,705 and ZAR600, intended strictly for disbursement to recipients. However, instead of processing payments to beneficiaries, Machamacha unlawfully converted the money to her personal use.\n\nOn April 15, 2025, the company carried out an internal audit, which revealed that the money she had been entrusted with was missing.\n\nInvestigations discovered that the offender had sent the funds to various recipients via Ecocash, in apparent personal dealings, including attempts to secure online loans an activity completely outside the scope of her responsibilities.\n\nRealising that the audit had exposed her shenanigans, Machamacha contacted an employee of Mukuru Chipinge, seeking help to cover the shortfall. She was given US$1,400 in cash, which she attempted to use to repay a portion of the stolen money. Despite this, a total of US$3,305 and ZAR600 remained unrecovered.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/09060426/chipinge-magistrates-1.jpg",
            "description": "<p>By Staff Reporter  A TELLER employed by a reputable money transfer agency has been dragged to court for stealing US$4, 705 and ZAR600 from her employer. Accused person Christwish Machamacha (47), a teller employed by Zimsend trading as Hello Paisa, appeared at Chipinge Magistrates Court for theft or trust property. She was sentenced to 24</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/money-transfer-agency-teller-in-us4700-and-zar600-theft/\">Money transfer agency teller in US$4,700 and ZAR600 theft </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:49",
            "date": "28 Apr 2025"
        },
        {
            "title": "Namibia lifts 2025 Barthes Rugby Trophy as Junior Sables fall to Kenya",
            "url": "https://www.newzimbabwe.com/namibia-lifts-2025-barthes-rugby-trophy-as-junior-sables-fall-to-kenya/",
            "content": "By Sports Reporter\n\nNAMIBIA was crowned the 2025 Barthes Rugby Trophy champions after beating Tunisia 81-7 at Old Hararians Sunday.\n\nThe Welwitchias ended their six-year Barthes Trophy drought since 2018 when they defended the inaugural championship which they won in 2017.\n\nNamibia has matched last years champions Kenya to be the only two nations to have won the trophy thrice in history.\n\nWith an unbeaten record throughout the campaign, Namibia opened their campaign with a convincing 22-41 win against hosts Zimbabwe, before beating Kenya 32-22 last Wednesday.\n\nMeanwhile, despite the home advantage, Zimbabwe mens Under 20 on the other end failed to beat rivals Kenya in their bid for a decent finish.\n\nThe Junior Sables lost 20-21in front of a huge home crowd at Old Hararians Sunday afternoon, hence finishing on third position while Kenya settled for second.\n\nThe Shaun De Souza-led side performed below expectations during the just-ended campaign, only managing a single victory against tournament underdogs Tunisia, thrashing them 78-21 last Wednesday.\n\n2025 Barthes Trophy Final Standings\n\n1. Namibia\n\n2. Kenya\n\n3. Zimbabwe\n\n4. Tunisia.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/27214737/FB_IMG_1745785668171.jpg",
            "description": "<p>By Sports Reporter NAMIBIA was crowned the 2025 Barthes Rugby Trophy champions after beating Tunisia 81-7 at Old Hararians Sunday. The Welwitchias ended their six-year Barthes Trophy drought since 2018 when they defended the inaugural championship which they won in 2017. Namibia has matched last year’s champions Kenya to be the only two nations to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/namibia-lifts-2025-barthes-rugby-trophy-as-junior-sables-fall-to-kenya/\">Namibia lifts 2025 Barthes Rugby Trophy as Junior Sables fall to Kenya</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:49",
            "date": "28 Apr 2025"
        },
        {
            "title": "South Africa will defend sovereignty, ANC chair says as tensions with US grow",
            "url": "https://www.newzimbabwe.com/south-africa-will-defend-sovereignty-anc-chair-says-as-tensions-with-us-grow/",
            "content": "By BBC News\n\nA SENIOR figure from South Africas ruling ANC party has defended his countrys sovereignty amid growing tensions with the US over race relations and a new land law.\n\nWe are a free country, were a sovereign country. Were not a province of the United States and that sovereignty will be defended, ANC National Chair Gwede Mantashe said on Sunday.\n\nUS President Donald Trump has hit out at South Africas new expropriation law, signing an executive order in February stating it was a means to which the government could seize ethnic minority Afrikaners agricultural property without compensation.\n\nPresident Cyril Ramaphosa says the law ensures public access to land in an equitable and just manner.\n\nWhats really driving Trumps fury with South Africa?\n\nThe expropriation law does allow the government to seize land without compensation, but only in certain circumstances.\n\nTrumps February order also opened the door for Afrikaaners to be admitted to the US as refugees, describing them as victims of unjust racial discrimination.\n\nBut standing in for Ramaphosa in a speech at South Africas Freedom Day celebration in the eastern province of Mpumalanga, Mantashe criticised South African citizens who have called on Trump to punish the country.\n\nNow they are told to go there and be refugees, they are refusing. They must go, he said.\n\nTensions have also played out publicly on Elon Musks X page, where he has described his countrys ownership laws as racist.\n\nCurrently white South Africans, who are a minority of the population, own most of the countrys private land and wealth, despite the racist system of apartheid ending decades ago.\n\nIn an effort to quell tensions which have rumbled on for months, South Africa appointed a special envoy to Washington earlier this month.\n\nMcebisi Jonas will be tasked with advancing the countrys diplomatic, trade and bilateral priorities, Ramaphosa said.\n\nThe move comes after Washington expelled South Africas ambassador, Ebrahim Rasool, after he accused Trump of dog whistle politics.\n\nLast month, officials from the all-white separatist town of Orania, founded by Afrikaaners after the end of apartheid, visited the US as part of efforts to gain recognition as an autonomous state.\n\nA South African foreign ministry spokesperson told Reuters at the time that Orania was not a country and was subject to South African laws.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/27210935/9bd7a36db2d447baa1d7e8837698ceca.jpg",
            "description": "<p>By BBC News A SENIOR figure from South Africa’s ruling ANC party has defended his country’s sovereignty amid growing tensions with the US over race relations and a new land law. “We are a free country, we’re a sovereign country. We’re not a province of the United States and that sovereignty will be defended,” ANC</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africa-will-defend-sovereignty-anc-chair-says-as-tensions-with-us-grow/\">South Africa will defend sovereignty, ANC chair says as tensions with US grow</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:49",
            "date": "28 Apr 2025"
        },
        {
            "title": "Childhood on the brink in Zimbabwe’s Midlands",
            "url": "https://www.newzimbabwe.com/childhood-on-the-brink-in-zimbabwes-midlands/",
            "content": "By Gamuchirai Masiyiwa, GPJ Zimbabwe\n\nThis story was originally published byGlobal Press Journal.\n\nZVISHAVANE, ZIMBABWE  Morning light slants through the window as Eneles Zhou inspects two of her children. Theyre wrapped in blankets. Despite Marchs typically warm days, in this home in the Midlands province, Zhous children struggle with temperatures their bodies cannot regulate.\n\nA mother of five, Zhou quickly coaxes flames to life and prepares porridge, timing it with the childrens medication schedule  folic acid to boost red blood cells, then hydroxyurea to prevent any complications. Over the years, this routine has become familiar.\n\nWhen her firstborn was diagnosed with sickle cell anemia, a hereditary disease, at 7 years old, Zhou had never heard of it. Doctors told her that 1 in 4 children might inherit it, and with two symptom-free, she clung to hope.\n\nBut by 2021, tests had confirmed that three of her children carry a severe form of the disease. Two others have a milder version.\n\nZimbabwes widespread failure to screen newborns means many families only discover the condition after irreversible damage has begun. Without early detection, children often suffer severe complications or die, even before the age of 5, says Dr.\n\nPatience Kuona, a pediatric hematologist whos spearheading a sickle cell research initiative.\n\nIn 2024, Zimbabwe launched its first pilot screening program, testing 550 newborns and revealing that the sickle cell trait affects between 3% and 12% of the population. The data is not yet published, says Kuona, the lead researcher.\n\nStill, the pilot  part of ongoing research by the Sickle Hemoglobinopathy Research in Zimbabwe and Zambia  marks only the beginning of a much longer journey for those with the disease.\n\nSpecialized care, especially for families outside major cities, remains a mirage. Essential medicines  folic acid, penicillin, hydroxyurea  are often unavailable in public health facilities. Advanced treatments such as bone marrow transplants and gene therapy are not available due to resource constraints. Specialized sickle cell disease clinics exist in five central hospitals, with limited provincial access.\n\nPain relief is there, but opioids are scarce in lower-level hospitals, Kuona says.\n\nSickle cell disease, the worlds most common inherited blood disorder, warps healthy cells into crescents. The sickle cells break down easily, leading to anemia. They can also clog small blood vessels, causing excruciating pain and organ damage.\n\nGlobally, 7.74 million people bear this genetic burden. Over half a million children were born with the disease in 2021. While Zimbabwes 12% prevalence rate appears modest compared to hot spots like Nigeria, Uganda and Democratic Republic of Congo, where rates soar to between 20% and 45%, the countrys fragile health care infrastructure magnifies suffering, turning what should be a manageable condition into a daily battle for survival.\n\nZhous case is especially challenging. Her five affected children are different ages  one adolescent, two teenagers and two preschoolers  and the complications worsen as children grow, with higher risks of infections, kidney problems, blood clots and stroke.\n\nZhous eldest, Panashe Sibanda, 20, has endured the worst. Despite six daily medications, he is constantly in pain. He struggles to sustain friendships. He cant join gatherings because pathogens infect him too easily. A simple cold triggers what he calls a pain crisis, which no over-the-counter painkiller can relieve.\n\nFor 1 in 3 people with sickle cell disease, pain is a near-daily companion. More than half grapple with pain most days.\n\nIve survived 61 near-death experiences since I was 13, Sibanda says.\n\nThe disease burdens families financially through frequent hospitalizations and work loss. Zhous husbands irregular carpentry work barely sustains them. Zhou doesnt work outside her home; her childrens disease requires full-time care.\n\nDuring her childrens playtime, Zhou remains alert. These arent carefree moments of childhood abandon; theyre carefully monitored sessions within the confines of their immaculate home. One dust mote could trigger an infection.\n\nI am always nervous, she says. Always anxious.\n\nGamuchirai Masiyiwa is a Global Press Journal reporter-in-residence based in Harare, Zimbabwe.\n\nGlobal Press Journal delivers bold, investigative and in-depth explanatory reporting on the worlds most urgent issues.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/27161743/02_gpjnews_zim_gm_sicklecell_d2_-1613-_l-jpg_web.jpeg",
            "description": "<p>By Gamuchirai Masiyiwa, GPJ Zimbabwe This story was originally published by Global Press Journal. ZVISHAVANE, ZIMBABWE — Morning light slants through the window as Eneles Zhou inspects two of her children. They’re wrapped in blankets. Despite March’s typically warm days, in this home in the Midlands province, Zhou’s children struggle with temperatures their bodies cannot</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/childhood-on-the-brink-in-zimbabwes-midlands/\">Childhood on the brink in Zimbabwe’s Midlands</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:49",
            "date": "28 Apr 2025"
        },
        {
            "title": "Zimbabwe trade fair exhibitors seek to expand cooperation with China",
            "url": "https://www.newzimbabwe.com/zimbabwe-trade-fair-exhibitors-seek-to-expand-cooperation-with-china/",
            "content": "By Xinhua\n\nA DIVERSE range of African exhibitors at this years Zimbabwe International Trade Fair (ZITF) have expressed a strong interest in expanding business partnerships with China, the worlds second-largest economy.\n\nZITF, Zimbabwes premier annual trade fair, featured more than 600 exhibitors, including foreign participants from 28 countries, showcasing their products and services at the six-day event, which concluded on Saturday.\n\nMary Mwalwanda Msukwa, managing director of Tilawe Products, a Malawian company that supplies agricultural products, shared her hopes of introducing and exporting Kilombero rice, a long-grain, aromatic white rice predominantly grown in Malawi, into China.\n\nThe Kilombero rice is very good, very flavored, very aromatic, so we want to penetrate the Chinese market because of that, because we know that we can find a lot of markets in China, she told Xinhua on Friday.\n\nTo market the variety in China, Msukwa plans to exhibit Kilombero rice and other products at the China-Africa Economic and Trade Expo in China, hoping to seize the opportunity to further develop business ties with Chinese companies.\n\nRachael Dube, sales manager from Samtric Supplies, a South African mining equipment supplier, expressed a similar desire to strengthen business relationships with Chinese firms.\n\nShe explained that the company already has experience working with Chinese mining companies and is now eager to expand this cooperation.\n\nAs Zimbabwe and China have strengthened their cooperation in mining, it also brings equipment suppliers like us more opportunities, and thats why we are here at the trade fair looking for more and more potential customers, she said.\n\nMalebo Matlala, another sales manager from a South African clothing company, shared that her company has been importing materials from China to produce safari-related products.\n\nWith the increasing number of Chinese tourists visiting Africa for safari trips, she sees this as an opportunity to promote the companys products, ranging from safari shoes to backpacks. We are also trying to find a Chinese manufacturer who can help us manufacture the products in China and tap into the Chinese market, she said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/27210635/711ffe4b89ec4aff80ac2f72393cf3cc.png",
            "description": "<p>By Xinhua A DIVERSE range of African exhibitors at this year’s Zimbabwe International Trade Fair (ZITF) have expressed a strong interest in expanding business partnerships with China, the world’s second-largest economy. ZITF, Zimbabwe’s premier annual trade fair, featured more than 600 exhibitors, including foreign participants from 28 countries, showcasing their products and services at the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-trade-fair-exhibitors-seek-to-expand-cooperation-with-china/\">Zimbabwe trade fair exhibitors seek to expand cooperation with China</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:49",
            "date": "28 Apr 2025"
        },
        {
            "title": "SA trio Justin Sammons, Charl Langeveldt and Rivash Gobind turn Zimbabwe cricket around",
            "url": "https://www.newzimbabwe.com/sa-trio-justin-sammons-charl-langeveldt-and-rivash-gobind-turn-zimbabwe-cricket-around/",
            "content": "By IOL\n\nIT was not too long ago when Justin Sammons had to step away from his post as batting coach of the Proteas side.\n\nHaving served under Mark Boucher, Sammons had to move on from the Proteas when Boucher resigned.\n\nNow, Sammons is the head coach of the Zimbabwe national team and works alongside former Proteas seam bowler Charl Langeveldt, whom he coached with when he was in the SA management staff as well.\n\nFormer South African domestic cricketer Rivash Gobind, despite being recently named Titans head coach, is also in the Zimbabwe national teams management staff.\n\nTogether, the trio have led Zimbabwe to some memorable victories, including the most recent, where Zimbabwe beat Bangladesh in the first of two Tests in Sylhet.\n\nSo, for us to now actually chase a score in the sub-continent, experience the pressures that one experiences in a fourth-innings chase, its huge in terms of the development and experience of the players.\n\nThe confidence, I think, is the biggest thing. Also, the knowledge for the group to know that what weve been doing is the right thing and were on the right track.\n\nSo, hopefully it pushes us to work harder and raise our intensity both in preparation and the games, and to continue to lift our game.\n\nItll also, from a general Zimbabwe Cricket point of view, I think its massive. It lets the world know that were here to compete. Were not just here to make up numbers.\n\nAfter the second Test in Bangladesh, Sammons will take his side to England for a one-off Test before hosting South Africa for two Tests in Zimbabwe in June.\n\nHeading into such big fixtures, Sammons believes that the victory against Bangladesh in the first Test sends the message that they are not pushovers.\n\nWe are not a pushover. We are definitely making improvements. We know were not the finished article. We are a long way from where we want to be.\n\nBut again, were on the right track, and its really about us staying the course, holding strong, keep doing the right things and the results will eventually look after themselves, said Sammons.\n\nIts going to be a really tough few months. Were going to Chittagong now, which will be in very difficult conditions. We will be completely different to what we experienced in Sylhet.\n\nThen we go to England, which again, is completely different conditions, a different ball in the Duke.\n\nAnd then back to Bulawayo for the two Tests against South Africa and then two against New Zealand.\n\nAll those experiences, all those varying conditions, varying opposition will again hold this team in good stead.\n\nBut yes, we look forward to really putting our best foot forward there and competing as much as we can.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/27203044/muzarabani-takes-nine-as-zimbabwe-celebrate-bangladesh-first-test-win.jpg",
            "description": "<p>By IOL IT was not too long ago when Justin Sammons had to step away from his post as batting coach of the Proteas side. Having served under Mark Boucher, Sammons had to move on from the Proteas when Boucher resigned. Now, Sammons is the head coach of the Zimbabwe national team and works alongside</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sa-trio-justin-sammons-charl-langeveldt-and-rivash-gobind-turn-zimbabwe-cricket-around/\">SA trio Justin Sammons, Charl Langeveldt and Rivash Gobind turn Zimbabwe cricket around</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:49",
            "date": "28 Apr 2025"
        },
        {
            "title": "Stay aways won’t work in fragile Zimbabwe: A replication of 2009-2013 GNU necessary— Political analyst",
            "url": "https://www.newzimbabwe.com/stay-aways-wont-work-in-fragile-zimbabwe-a-replication-of-2009-2013-gnu-necessary-political-analyst/",
            "content": "By Staff Reporter\n\nAt the end of March, Zimbabweans stayed away from their workplaces and businesses, turning urban areas into ghost towns.\n\nAccording to a political analyst, University of Zimbabwe lecturer and political analyst Eldred Masunungure, citizens did not protest in the streets as called for by Blessed Bombshell Geza, a war veteran fighting to remove the current administration led by President Emmerson Mnangagwa, accusing him of failure to run the country.\n\nProf Eldred Masunungure\n\nMasunungure, in a recent interview with NewZimbabwe.com, said the March 31 stay away did not happen because people are rational enough to know the dangers inherent in confronting the coercive arms of the state, which the leadership is ready to deploy as a first rather than last resort.\n\nProtests are banned in Zimbabwe.\n\nMasunungure said, people responded to Gezas call for an uprising by staying at home which is a form of protest in itself.\n\nHowever, last weeks call by Geza for an indefinite stayaway was ignored by many because it was unstrategic as it collided with the welfare and survival needs of the ordinary Zimbabweans, the vast majority of whom live through vending and other informal jobs.\n\nAs such, participating in an indefinite stay-away is suicidal, hence they defied the call. It is plain common sense, the UZ Professor explained.\n\nMasunungure highlighted that the other dimension to the failure of this stay-away has been the lack of an organisational vehicle.\n\nThe so-called Geza movement is essentially a solo effort by Geza himself and in politics, this is not sustainable.\n\nThe reality of present-day politics is that there is no organisational political home for those who are not inclined towards Zanu PF.\n\nHe further said there were many political orphans in Zimbabwe, especially after the collapse of the opposition political parties, the Movement for Democratic Change (MDC) and later, the Citizens Coalition for Change (CCC).\n\nThats the tragedy of Zimbabwes opposition politics today, the lack of a viable and trusted organisational vehicle to accommodate the multitudes of political orphans.\n\nThe answer to this is self-evident; the formation of a viable and sustainable political organisation with trusted and astute leadership, he stated.\n\nFor the past quarter century, Zimbabwe has been locked in a transition characterised by comprehensive fragility, such that there is fragile politics.\n\nA fragile economy, a fragile social order and fragile diplomatic relations.\n\nA defining feature of this type of fragility is the systemic uncertainty where hardly anyone, including those at the apex of the state, knows where the country is going.\n\nMasunungure described Zimbabwe as a country which is just muddling through.\n\nThe industrial-scale corruption, sky-high unemployment, high inflationary pressures and a volatile currency, social decay, the personalisation of the State and its resources via massive patronage, are all manifestations of this fragility, he added.\n\nHe suggested that, for Zimbabwe to come back to life, it requires a replication of the 2009-2013 Government of National Unity (GNU), which many Zimbabweans regard with nostalgia.\n\nHe, however, doubted if this would be achieved in a context where, effectively, there is a one-party regime and where other non-State actors like the civil society are subdued through various legal and extra-legal mechanisms.\n\nHe mentioned the combined effects of the Private Voluntary Organisation (PVO) Amendment Act and the carnage attendant on President Donald Trumps assault on USAID, which he believes is to drastically weaken civil society and its capacity to act as a source of countervailing power to the State.\n\nMasunungure pins his hopes on the progressive tendencies in the church to lead a national dialogue process resulting in a GNU-like solution.\n\nOf course, this will require the active input of the regional leadership, principally in the SADC, which is led by President Mnangagwa (chairperson).\n\nThe bottom line though, is that Zimbabwe is likely to be in this state of uncertainty, confusion and even chaos for the foreseeable future, said Masunungure.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/22111740/mbare-.jpeg",
            "description": "<p>By Staff Reporter At the end of March, Zimbabweans stayed away from their workplaces and businesses, turning urban areas into ghost towns. According to a political analyst, University of Zimbabwe lecturer and political analyst Eldred Masunungure, citizens did not protest in the streets as called for by Blessed ‘Bombshell’ Geza, a war veteran fighting to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/stay-aways-wont-work-in-fragile-zimbabwe-a-replication-of-2009-2013-gnu-necessary-political-analyst/\">Stay aways won’t work in fragile Zimbabwe: A replication of 2009-2013 GNU necessary— Political analyst</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:49",
            "date": "28 Apr 2025"
        },
        {
            "title": "Mom ashamed of six-year-old daughter’s disability strangles her to death",
            "url": "https://www.newzimbabwe.com/mom-ashamed-of-six-year-old-daughters-disability-strangles-her-to-death/",
            "content": "By Staff Reporter\n\nA HWANGE woman has been arrested for killing her six-year-old daughter, who was living with a disability.\n\nMelody Mwiinde (23) confessed to strangling her daughter inorder to end the embarrassment endured from mocking by community members over the minors disability.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident.\n\nOn April 25, 2025, police in Hwange arrested Melody Mwiinde (23) in connection with a case of murder which occurred on April 23, 2025, at Mujimba 9, Siabuwa.\n\nThe suspect allegedly killed her daughter (6) by hanging her with an electrical cable from a tree branch. The body was dumped in a disused hut, said Nyathi.\n\nThe suspect allegedly confessed that she killed the victim because people were mocking her for keeping a disabled child who had been disowned by her father, the police spokesman added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/09/12224313/Murder.jpg",
            "description": "<p>By Staff Reporter A HWANGE woman has been arrested for killing her six-year-old daughter, who was living with a disability. Melody Mwiinde (23) confessed to strangling her daughter inorder to end “the embarrassment” endured from mocking by community members over the minor’s disability. Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mom-ashamed-of-six-year-old-daughters-disability-strangles-her-to-death/\">Mom ashamed of six-year-old daughter’s disability strangles her to death </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:49",
            "date": "28 Apr 2025"
        }
    ]
}