{
    "news": [
        {
            "title": "Mudenda says culprit will ‘regret the day of their existence’ after generator failure causes power outage during Mnangagwa’s SONA",
            "url": "https://www.newzimbabwe.com/mudenda-says-culprit-will-regret-the-day-of-their-existence-after-generator-failure-causes-power-outage-during-mnangagwas-sona/",
            "content": "By Thandiwe Garusa\n\nThe Parliament Building was being powered by a generator with ZESA electricity on standby as per prior arrangements when President Emmerson Mnangagwas State of the Nation Address (SONA) was disrupted by a power outage,NewZimbabwe.comhas learnt.\n\nMnangagwa was concluding his SONA when the power outage occurred, forcing him to use a torchlight to finish his speech.\n\nSpeaker of Parliament Jacob Mudenda was visibly angered by the incident, saying, We shall go beyond what happened, trace the culprit, and deal with them accordingly. Those found wanting will regret the day of their existence.\n\nAccording to Parliament, the generator had been activated at midday, with ZESA engineers on site to monitor proceedings.\n\nHowever, the backup system reportedly developed a technical fault approximately two and a half hours into the address, causing the blackout while Mnangagwa was still delivering his speech.\n\nA letter from Acting Clerk of Parliament Nomasonto Sunga to Local Government Permanent Secretary John Bhasera, dated October 21, had requested a serviced, fully tested and fit generator for the SONA, citing previous blackouts during important sessions.\n\nThis is the second time a blackout has occurred at the Parliament Building in Mnangagwas presence, following a similar incident in November 2024 during Finance Minister Mthuli Ncubes 2025 National Budget presentation.\n\nWe request your ministrys coordination and oversight in ensuring uninterrupted power supply during the State of the Nation Address (SONA), which has been tentatively scheduled for 28 October 2025 at Parliament Building.\n\nIt is noted that there is an approved arrangement to run the event using the generator as the primary source of power, with ZETDC on standby, following previous power disruptions experienced during important sessions, Sunga wrote.\n\nIn view of this, the generator must be serviced, fully tested, and confirmed fit for uninterrupted operation during the event. ZETDC technical staff should be physically on standby throughout the proceedings to provide an immediate response if required.\n\nParliament also assured that it would promptly pay the company contracted to provide generator services and supply sufficient fuel to ensure smooth power supply throughout the event.\n\nParliament will ensure timely payment to the service provider contracted for the generator service, as well as the provision of adequate fuel to power the system throughout the duration of the event, added Sunga.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/28130416/ED-SONA-torch-1.jpeg",
            "description": "<p>By Thandiwe Garusa The Parliament Building was being powered by a generator with ZESA electricity on standby as per prior arrangements when President Emmerson Mnangagwa’s State of the Nation Address (SONA) was disrupted by a power outage, NewZimbabwe.com has learnt. Mnangagwa was concluding his SONA when the power outage occurred, forcing him to use a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mudenda-says-culprit-will-regret-the-day-of-their-existence-after-generator-failure-causes-power-outage-during-mnangagwas-sona/\">Mudenda says culprit will ‘regret the day of their existence’ after generator failure causes power outage during Mnangagwa’s SONA</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "28 Oct 2025"
        },
        {
            "title": "In Pictures: Power outage disrupts SONA, President Mnangagwa completes speech using torchlight",
            "url": "https://www.newzimbabwe.com/in-pictures-power-outage-disrupts-sona-president-mnangagwa-completes-speech-using-torchlight/",
            "content": "A power outage plunged parliament into darkness during President Emmerson Mnangagwas State of the Nation Address (SONA), forcing him to complete his speech using a torchlight.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/28130418/ED-SONA-torch.jpeg",
            "description": "<p>A power outage plunged parliament into darkness during President Emmerson Mnangagwa’s State of the Nation Address (SONA), forcing him to complete his speech using a torchlight. Below are some images captured during the address. Pictures by Thandiwe Garusa</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-pictures-power-outage-disrupts-sona-president-mnangagwa-completes-speech-using-torchlight/\">In Pictures: Power outage disrupts SONA, President Mnangagwa completes speech using torchlight</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "28 Oct 2025"
        },
        {
            "title": "Dawn arson, police raid scuttle Biti’s address on Mnangagwa’s term extension bid",
            "url": "https://www.newzimbabwe.com/dawn-arson-police-raid-scuttle-bitis-address-on-mnangagwas-term-extension-bid/",
            "content": "By Staff Reporter\n\nA planned address by opposition and civic society leaders at the Southern Africa Political Economy Series (SAPES) Trust was abruptly disrupted on Tuesday after Zimbabwe Republic Police (ZRP) anti-riot officers stormed the venue.\n\nOpposition figures Tendai Biti, Job Sikhala, and Jacob Ngarivhume were scheduled to speak on an alleged plot by ZANU PF to extend President Emmerson Mnangagwas term beyond 2028.\n\nIn the early hours of Tuesday, the SAPES Trust premises were reportedly petrol-bombed and a guard on duty was abducted, in what is believed to be a coordinated attempt to stop the discussion.\n\nSAPES Trust Director Ibbo Mandaza said there appeared to be a clear link between the arson attack and the subsequent police disruption.\n\nIt is not surprising at all. There is a correlation between what happened after midnight,the arson, the abduction of the security guard.\n\nIt was done by people who know the job of fear. They seem to have forgotten that we have endured such harassment for the past two years, said Mandaza.\n\nThe ruling party has endorsed a resolution seeking to extend Mnangagwas presidency to 2030, which would require amending Section 91(2) of the Constitution, which limits a president to two terms, and Section 328(7), which bars incumbents from benefiting from constitutional amendments.\n\nAccording to party insiders, ZANU PF intends to use its parliamentary majority to push through the proposed changes.\n\nSpeaking at the disrupted event, Biti condemned the attacks and reaffirmed the groups commitment to defending the Constitution.\n\nWe are very sorry to Dr. Mandaza over the arson, and to Gilbert Mbwende, whose house was also attacked.\n\nThis is a new initiative by concerned citizens to resist the mutilation of the Constitution. It is not a political effort, but a civic one, to defend the rule of law, Biti said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/28164119/biti-sikhala-sapes.jpg",
            "description": "<p>By Staff Reporter A planned address by opposition and civic society leaders at the Southern Africa Political Economy Series (SAPES) Trust was abruptly disrupted on Tuesday after Zimbabwe Republic Police (ZRP) anti-riot officers stormed the venue. Opposition figures Tendai Biti, Job Sikhala, and Jacob Ngarivhume were scheduled to speak on an alleged plot by ZANU</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dawn-arson-police-raid-scuttle-bitis-address-on-mnangagwas-term-extension-bid/\">Dawn arson, police raid scuttle Biti’s address on Mnangagwa’s term extension bid</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "28 Oct 2025"
        },
        {
            "title": "KZN launches major offensive against illegal trucking operations, Zimbabweans arrested",
            "url": "https://www.newzimbabwe.com/kzn-launches-major-offensive-against-illegal-trucking-operations-zimbabweans-arrested/",
            "content": "IOL\n\nKwaZulu-Natal MEC for Transport and Human Settlements, Siboniso Duma, has declared war on rogue elements in the provinces trucking industry, following a far-reaching enforcement operation that laid bare a web of exploitation, corruption, and unsafe practices along South Africas busiest freight routes.\n\nOver the weekend, Duma joined law enforcement agencies at the Mkhondeni Weighbridge in Pietermaritzburg, where his departments #NenzaniLaEzweni (What Are You Doing in This World?) campaign intensified its push to restore order on KZNs roads.\n\nThe operation saw 98 trucks stopped, 47 drivers interviewed, and several arrests made, including one of a Zimbabwean truck driver found driving under the influence of alcohol.\n\nUndoubtedly, he was on his way to cause a horrific accident that could have resulted in fatalities, Duma said, adding that the operations purpose was to clean our road networks as part of creating a safe and secure KwaZulu-Natal for citizens.\n\nAuthorities also arrested five foreign nationals for being in the country illegally or for presenting fraudulent documents, while another Zimbabwean driver was charged for transporting European tourists without a valid permit.\n\nA bus from Zimbabwe carrying foreign nationals was also impounded for inspection by a multi-agency team that included the RTI, SAPS Dog Unit, and Home Affairs Immigration officials.\n\nA KwaZulu-Natal Road Traffic Inspectorate (RTI) officer with some of the undocumented foreign national truck drivers who were arrested at a multi-displinary road traffic blitz at Mkhondeni, Pietermaritzburg over the weekend Image:KwaZulu-Natal Department of Transport\n\nIndustry in Crisis: Drivers Speak of Exploitation and Fear\n\nBehind the arrests, however, lies a deeper crisis within the provinces freight sector. Interviews with truck drivers, conducted during and after the operation, painted a grim picture of exploitation and labour violations that Duma described as human rights abuses in broad daylight.\n\nWe have uncovered exploitative practices, financial fraud and human rights violations involving certain players in the logistics and freight industry, he said.\n\nThey are behaving with impunity and must be held accountable for turning our road networks into killing fields.\n\nAccording to the MEC, drivers reported that:\n\n-They have no written contracts or employment protection.\n\n-Local drivers are being replaced by undocumented foreign nationals willing to work for less.\n\n-Bribes are paid to law enforcement officers to bypass inspections.\n\n-No payslips or overtime payments are issued, despite long hours on the road.\n\n-Many work without rest days or leave, are paid per load, and are not compensated for weekends or public holidays.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/27131537/KZN-transport-dept.jpg",
            "description": "<p>IOL KwaZulu-Natal MEC for Transport and Human Settlements, Siboniso Duma, has declared war on rogue elements in the province’s trucking industry, following a far-reaching enforcement operation that laid bare a web of exploitation, corruption, and unsafe practices along South Africa’s busiest freight routes. Over the weekend, Duma joined law enforcement agencies at the Mkhondeni Weighbridge</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kzn-launches-major-offensive-against-illegal-trucking-operations-zimbabweans-arrested/\">KZN launches major offensive against illegal trucking operations, Zimbabweans arrested</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "28 Oct 2025"
        },
        {
            "title": "Power outage disrupts SONA, President Mnangagwa completes speech using torchlight",
            "url": "https://www.newzimbabwe.com/power-outage-disrupts-sona-president-mnangagwa-completes-speech-using-torchlight/",
            "content": "By Mary Taruvinga\n\nPresident Emmerson Mnangagwa was on Tuesday forced to complete his State of the Nation Address (SONA) using a torchlightafter the New Parliament Building was plunged into darkness.\n\nThe unexpected blackout disrupted proceedings for several minutes, leaving the National Assembly in confusion.\n\nSome ruling party legislators shouted that the incident was an act of sabotage, while others murmured in disbelief.\n\nUnfazed, Mnangagwa continued reading his speech for nearly 10 minutes in the dark, earning applause from ZANU PF lawmakers for his composure.\n\nPower was restored shortly after Mnangagwa concluded his speech.\n\nIt was not immediately clear whether the power outage was caused by load-shedding or a technical fault.\n\nWe see it proper that we apologise to the President for the power outage. We shall go beyond and chase the culprit\n\nThe person who switched off electricity while the President was speaking will regret the day he was born, the Speaker of Parliament, Jacob Mudenda, said.\n\nThis is the second time such an incident has occurred during the Presidents address.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/28130418/ED-SONA-torch.jpeg",
            "description": "<p>By Mary Taruvinga President Emmerson Mnangagwa was on Tuesday forced to complete his State of the Nation Address (SONA) using a torchlight after the New Parliament Building was plunged into darkness. The unexpected blackout disrupted proceedings for several minutes, leaving the National Assembly in confusion. Some ruling party legislators shouted that the incident was an act</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/power-outage-disrupts-sona-president-mnangagwa-completes-speech-using-torchlight/\">Power outage disrupts SONA, President Mnangagwa completes speech using torchlight</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "28 Oct 2025"
        },
        {
            "title": "Kadewere likely to miss AFCON due to knee injury",
            "url": "https://www.newzimbabwe.com/kadewere-likely-to-miss-afcon-due-to-knee-injury/",
            "content": "By Sports Reporter\n\nWarriors striker Tino Kadewere is likely to miss the 2025 Africa Cup of Nations (AFCON) after sustaining a knee injury.\n\nKadeweres injury was confirmed by his Greek club, Aris Thessaloniki, in a statement released on Monday.\n\nAccording to the club, the 29-year-old Zimbabwe international will be sidelined for up to three months as he is set to undergo surgery.\n\nUnfortunately, the news is not good for Tino Kadewere. According to the MRI results, the 29-year-old Zimbabwe international striker, who was injured in training, suffered a torn medial meniscus in his right knee and will undergo immediate surgery, Aris Thessaloniki said.\n\nThe injury setback comes barely a week after Kadewere returned from a one-month layoff due to a separate injury.\n\nHe also missed Zimbabwes World Cup qualifiers against South Africa and Lesotho earlier this year.\n\nKadeweres absence would be a major blow for the Warriors, who are preparing for their return to the continental stage at AFCON 2025.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/28062700/Tino-Kadewere.webp",
            "description": "<p>By Sports Reporter Warriors striker Tino Kadewere is likely to miss the 2025 Africa Cup of Nations (AFCON) after sustaining a knee injury. Kadewere’s injury was confirmed by his Greek club, Aris Thessaloniki, in a statement released on Monday. According to the club, the 29-year-old Zimbabwe international will be sidelined for up to three months</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kadewere-likely-to-miss-afcon-due-to-knee-injury/\">Kadewere likely to miss AFCON due to knee injury</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "28 Oct 2025"
        },
        {
            "title": "When constitutions are trampled, democracy dies – regional labour body rejects ZANU PF plan to extend Mnangagwa’s term",
            "url": "https://www.newzimbabwe.com/when-constitutions-are-trampled-democracy-dies-regional-labour-body-rejects-zanu-pf-plan-to-extend-mnangagwas-term/",
            "content": "By Alois Vinga\n\nThe African Regional Organisation of the International Trade Union Confederation (ITUC-Africa), which represents over 18 million workers across the continent, has strongly rejected ZANU PFs plans to extend President Emmerson Mnangagwas term.\n\nThe ruling ZANU-PF party recently endorsed a proposal to delay the 2028 general elections, extending Mnangagwas term by two years to 2030. The resolution, adopted at the partys annual conference in Mutare, directed the ruling partys Legal Affairs Secretary to begin drafting the necessary constitutional amendments.\n\nMnangagwa is currently serving his second and final term, as is mandated by the constitution. While he has previously described himself as a constitutionalist, adding he will step down in 2028, he has done nothing to oppose his loyalists, who are pushing for him to hang onto power.\n\nIn a statement of solidarity with the Zimbabwe Congress of Trade Unions (ZCTU), ITUC-Africa Secretary General Joel Odigie said African workers have consistently upheld democracy and constitutionalism as the foundation of peace, justice, and shared prosperity.\n\nITUC-Africa Secretary General JoelOdigie\n\nWe join ZCTU in urging African citizens, civil society, and the labour movement to remain vigilant and steadfast in defending the integrity of their constitutions, said Odigie.\n\nSocieties that work are those governed by the rule of law, not the law of force. When constitutions are trampled, democracy dies and with it, the hopes of workers for decent work, social justice, and equitable development.\n\nOdigie called on African Union member states, regional economic communities, and global partners to reaffirm their commitment to constitutional rule and accountable democratic governance as essential pillars of Africas transformation agenda.\n\nThe continental labour leader also rejected military involvement in civil governance and condemned civilian coups, where leaders manipulate constitutions to unlawfully extend their stay in power.\n\nHe further criticised attempts to silence opposition voices, manipulate electoral systems, or stage sham elections designed to entrench authoritarian rule, saying such actions erode hard-won democratic gains.\n\nWe commend leaders across Africa who have resisted the temptation to alter term limits or manipulate constitutions for personal gain. These are true statespersons, guardians of constitutional democracy worthy of respect by future generations, Odigie said.\n\nHe added that leaders who dismantle constitutional order and weaken democratic institutions for the sake of political survival corrode governance, polarise societies, and expose their nations to instability, insecurity, and economic decline.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/03005736/SONA-1-Mnangagwa.png",
            "description": "<p>By Alois Vinga The African Regional Organisation of the International Trade Union Confederation (ITUC-Africa), which represents over 18 million workers across the continent, has strongly rejected ZANU PF’s plans to extend President Emmerson Mnangagwa’s term. The ruling ZANU-PF party recently endorsed a proposal to delay the 2028 general elections, extending Mnangagwa’s term by two years</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/when-constitutions-are-trampled-democracy-dies-regional-labour-body-rejects-zanu-pf-plan-to-extend-mnangagwas-term/\">When constitutions are trampled, democracy dies – regional labour body rejects ZANU PF plan to extend Mnangagwa’s term</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "28 Oct 2025"
        },
        {
            "title": "One Million Men March: Elderly protesters denied bail over Geza-led anti-government demonstrations",
            "url": "https://www.newzimbabwe.com/one-million-men-march-elderly-protesters-denied-bail-over-geza-led-anti-government-demonstrations/",
            "content": "By Mary Taruvinga\n\nA Harare magistrate has denied bail to ten elderly citizens accused of attempting to take part in a protest allegedly organised by fugitive war veteran Blessed Geza.\n\nThe group, aged between 48 and 75, is accused of mobilising for an unsanctioned demonstration dubbed the One Million Men March against President Emmerson Mnangagwa.\n\nMagistrate Caroline Kuhudzayi ruled that the accused were likely to regroup with others still at large and reoffend if released. She also found them to be flight risks given the gravity of the allegations.\n\nThe ten, Rose Chirenje (65), Nyarai Chigudu (52), Kenesia Jera (62), Edward Mandikutse (69), Dexter Jena (69), Hazvinei Machingura (69), Stephen Chagwiza (48), Jacob Masaraure (75), Mapengo Mapengo (57) and Joephrey Chigwerewe (70) were charged with participating in a gathering with intent to promote public violence, breaches of peace or bigotry under Section 37(1)(a)(i) of the Criminal Law (Codification and Reform) Act [Chapter 9:23].\n\nProsecutors allege that on October 17, the accused, acting on Gezas social media calls, gathered near Africa Unity Square in Harare, intending to join the protest against Mnangagwas government.\n\nAccording to police, the group was intercepted at the corner of George Silundika Avenue and Sam Nujoma Street while singing and dancing to a protest song with the lyrics, Zvigananda chera mwena nguva yakwana, chera mwena zvigananda, meaning Economic saboteurs, your time is up.\n\nDetectives from CID Law and Order said six suspects were arrested at the scene, while four others Chagwiza, Masaraure, Mapengo and Chigwerewe were later found hiding in a silver Toyota Probox parked at Corner Sixth Street and Kwame Nkrumah Avenue.\n\nInvestigators claim they recovered stones, boulders, and other missiles hidden near the protest site.\n\nIn opposing bail, Detective Sergeant Lovemore Chisi said releasing the accused could endanger public order.\n\nThe nature of the offence suggests a propensity for inciting or engaging in further public disorder, he said. Releasing the accused could reignite unrest or embolden others.\n\nChisi also warned that the accused might abscond from trial, given the lengthy custodial sentence they face if convicted, an argument upheld by the magistrate.\n\nPolice said investigations were ongoing and that several other suspects linked to the planned march remain at large.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/18200459/Screenshot-2025-03-18-at-22.03.06.png",
            "description": "<p>By Mary Taruvinga A Harare magistrate has denied bail to ten elderly citizens accused of attempting to take part in a protest allegedly organised by fugitive war veteran Blessed Geza. The group, aged between 48 and 75, is accused of mobilising for an unsanctioned demonstration dubbed the “One Million Men March” against President Emmerson Mnangagwa.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/one-million-men-march-elderly-protesters-denied-bail-over-geza-led-anti-government-demonstrations/\">One Million Men March: Elderly protesters denied bail over Geza-led anti-government demonstrations</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "28 Oct 2025"
        },
        {
            "title": "Gun used to kill Sanyati cop was also used in Mutangadura’s murder – ballistics exam reveals",
            "url": "https://www.newzimbabwe.com/gun-used-to-kill-sanyati-cop-was-also-used-in-mutangaduras-murder-ballistics-exam-reveals/",
            "content": "By Thandiwe Garusa\n\nA police ballistics examination has revealed that the firearm used to fatally shoot a police officer at Sanyati Police Station is the same gun used in the murder of Ruwa businessman Joseph Mutangadura.\n\nThe weapon was recovered following the arrest of Vengesai Jabulani Mutasa (41), who now faces multiple charges, including two counts of murder, attempted murder, and possession of an illegal firearm.\n\nNational police spokesperson Assistant Commissioner Paul Nyathi confirmed the findings, saying, The gun which killed the policeman is the same pistol which killed the businessman Mutangadura.\n\nMutangadura was murdered on the night of August 17, 2025, when seven armed robbers wearing balaclavas stormed his farmhouse. They attacked a security guard and the businessmans son before shooting him.\n\nSo far, police have arrested three suspects: Given Mandizadza (34), Phillip Mutasa (38), and Vengesai Jabulani Mutasa, while four other accomplices remain at large.\n\nVengesai Jabulani Mutasa\n\nVengesai initially shot Detective Constable Ngwenya of CID Homicide, who was part of a team trying to apprehend him for Mutangaduras murder, before fleeing arrest.\n\nHe later went to the police station on Sunday, where he found Constable Courage Muchechesi taking a statement from Abraham Mavayo, who was reporting an assault case.\n\nPolice said Vengesai confronted officers at the station, accusing homicide detectives of stealing US$1,000 from his home and demanding to see them.\n\nHe allegedly forced Constable Muchechesi and Mavayo to lie down while demanding money before shooting Muchechesi in the stomach.\n\nMuchechesi staggered out of the building, calling for help, and collapsed near the single quarters where he was later found dead by fellow officers.\n\nHe fled the station and was later arrested by residents from Sanyati, Kadoma, Chakari, and Patchway who had joined forces to track him down.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/18132443/Joseph-Mutangazi-Mutangadura-1280px-t-feat-750x375-1.webp",
            "description": "<p>By Thandiwe Garusa A police ballistics examination has revealed that the firearm used to fatally shoot a police officer at Sanyati Police Station is the same gun used in the murder of Ruwa businessman Joseph Mutangadura. The weapon was recovered following the arrest of Vengesai Jabulani Mutasa (41), who now faces multiple charges, including two</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/gun-used-to-kill-sanyati-cop-was-also-used-in-mutangaduras-murder-ballistics-exam-reveals/\">Gun used to kill Sanyati cop was also used in Mutangadura’s murder – ballistics exam reveals</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "28 Oct 2025"
        }
    ]
}