{
    "news": [
        {
            "title": "Electronic Know Your Customer (eKYC) Explained",
            "url": "https://www.newzimbabwe.com/electronic-know-your-customer-ekyc-explained/",
            "content": "As the rise of neobanks and digital-first services reshapes the financial landscape, traditional institutions are under pressure to modernize. But while face-to-face identity checks are straightforward, doing the same online is far more complex. How can businesses verify identities remotely, securely, and efficiently?\n\nThe answer lies in eKYCshort for electronic Know Your Customer. This digital approach to verifying customer identity is now a cornerstone of modern financial services, enabling fast, secure, and scalable customer onboarding.\n\neKYCis the digital counterpart of traditional KYC procedures. It allows companies to verify identities without requiring physical presence or paper-based documentation. By using biometric data, document scanning, and real-time analytics, eKYC systems authenticate users remotely, ensuring compliance and security while streamlining the user experience.\n\nWhile both eKYC and traditional KYC aim to prevent financial crime such as money laundering and terrorism financing, the key difference lies in how they operate. Traditional KYC relies on physical documents and in-person checks, whereaseKYC solutionsare fully automated, using facial recognition, liveness detection, and AI to validate identities.\n\nAdopted globally, eKYC technology has become especially prominent since 2022. Regulatory bodies, such as the Qatar Central Bank, have already established frameworks for eKYC verification, including allowing non-residents to onboard digitally with official approval.\n\nThe debate of eKYC vs KYC is really about automation and scale. Heres how they differ:\n\nAspect\n\nTraditional KYC\n\neKYC\n\nDocument Submission\n\nIn-person, physical documents\n\nOnline upload, real-time capture\n\nVerification Method\n\nManual inspection\n\nAutomated checks with AI and biometrics\n\nSpeed\n\nDays\n\nSeconds\n\nAccessibility\n\nLimited to branch hours\n\n24/7 global access\n\nCost\n\nHigh operational costs\n\nLower due to automation\n\nUltimately, eKYC solutions provide a faster, more efficient route to customer identity verificationespecially for remote and mobile-first environments.\n\nLets break down how a typical eKYC verification workflow works:\n\nIn a well-optimized flow, all these steps occur in secondsthanks to automated eKYC verification and seamless eKYC processes.\n\nAdopting eKYC technology offers organizations numerous advantages:\n\nThere are multiple eKYC types, depending on the channel and depth of verification:\n\nEach type offers a different balance of user convenience, speed, and regulatory compliance.\n\neKYC verification is being rapidly adopted across various sectors:\n\nExample: N26, a German neobank, uses automated eKYC solutions to autofill user data after scanning a document, expediting form completion.\n\nExample: Binance restricts unverified users to withdrawals only. Kraken mandates full eKYC verification to trade.\n\nAcross these industries, eKYC technology ensures security, compliance, and a frictionless customer experience.\n\nAs AI-generated photos and videos become more convincing, electronic Know Your Customer systems face rising fraud risks. A Regula study found over half of firms in Crypto and FinTech had encountered AI-driven spoofing.\n\nRegulations vary by region. For example, the Qatar Central Bank now mandates active liveness detectione.g., head movementson mobile apps and kiosks.\n\nRobust eKYC systems require high-performance servers, secure APIs, and advanced IDV tools. Companies must balance security with usability.\n\nFraudsters may exploit customer eKYC by mimicking reverification requests. Customers who recently completed verification are more likely to fall for scams.\n\nSolution: Launch fraud awareness hubs like Danske Banks support portal to educate users.\n\nThe shift toward digital banking and identity services makes eKYC more important than ever. With eKYC verification now a regulatory expectation in many countries, businesses that adopt this approach early will gain a competitive edge.\n\nWhether youre launching a neobank, enhancing a FinTech app, or optimizing compliance in crypto, investing in eKYC technology ensures secure and seamless customer onboarding. And as digital identity wallets and verifiable credentials evolve under initiatives like the EUs eIDAS update, eKYC solutions will only grow more robust and reusable.\n\nNow is the time to modernize your identity verification strategy. With partners like Regula, you can deploy advanced document verification, facial recognition, and liveness detection toolsready to support your transformation into the future of secure digital finance.\n\n",
            "image_url": null,
            "description": "<p>As the rise of neobanks and digital-first services reshapes the financial landscape, traditional institutions are under pressure to modernize. But while face-to-face identity checks are straightforward, doing the same online is far more complex. How can businesses verify identities remotely, securely, and efficiently? The answer lies in eKYC—short for electronic Know Your Customer. This digital</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/electronic-know-your-customer-ekyc-explained/\">Electronic Know Your Customer (eKYC) Explained</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "01 Jul 2025"
        },
        {
            "title": "Masakadza shines but Zimbabwe face monumental chase",
            "url": "https://www.newzimbabwe.com/masakadza-shines-but-zimbabwe-face-monumental-chase/",
            "content": "Zimbabwe Cricket\n\nWellington Masakadza claimed a career-best four-wicket haul, but Zimbabwe were left clinging to hope after South Africa set a towering fourth-innings target of 537 on day three of the first Test at Queens Sports Club in Bulawayo on Monday.\n\nWiaan Mulders commanding 147 formed the backbone of the visitors second-innings 369, building on their overnight score of 49 for one and a lead of 216.\n\nThe imposing total left Zimbabwe with the daunting task of pulling off the greatest chase in Test history.\n\nWith Blessing Muzarabani unavailable in the morning due to illness, the hosts turned to Tanaka Chivanga and Masakadza to spearhead the attack.\n\nThe day began promisingly for them when Tony de Zorzi, on 22 overnight, edged Chivanga to second slip, where Sean Williams held a sharp, low catch.\n\nMulder, calm and clinical, raced to his fifty with a string of crisp boundaries.\n\nHe then combined with David Bedingham for a brisk 72-run stand that extended South Africas lead beyond 300.\n\nMasakadza broke the partnership, tempting Bedingham, on 35, into a mistimed pull that found Williams at midwicket.\n\nSoon after, debutant Lhuan-dre Pretorius  fortunate to survive several chances in his first-innings hundred  was bowled for four by Vincent Masekesa, ripping one through the gate to clip the top of middle stump.\n\nMasekesa struck again moments later, removing Dewald Brevis for three as the big-hitters wild attempt to clear long-on missed entirely, and the leg-spinner knocked over his stumps to leave South Africa teetering at 155 for five.\n\nBut Mulder stood firm amid the wobble.\n\nHe brought up a well-earned hundred off 149 deliveries with a crisp back-foot drive.\n\nAt lunch, the visitors were 185 for five, leading by 352, with Mulder on 104 and Kyle Verreynne on five.\n\nAfter the break, the pair added 74 before Mulders enterprising stay came to an end.\n\nHe attempted to go aerial against Wessly Madhevere but picked out deep midwicket, where Takudzwanashe Kaitano took a fine catch.\n\nMulders 206-ball innings featured 17 boundaries and two sixes.\n\nMasakadza soon added Verreynne to his tally, drawing an edge off a sharply turning delivery that Ervine pouched at slip, reducing South Africa to 259 for seven.\n\nMaharaj and Corbin Bosch then piled on more frustration for Zimbabwe with a gritty 92-run partnership for the eighth wicket, pushing the lead beyond the 500-run mark.\n\nMuzarabani, now back in action, thought he had Bosch caught behind  only for a no-ball call to spoil the celebration.\n\nBut Bosch didnt last much longer as Masakadza bowled him for 36 after a missed slog-sweep.\n\nMasakadza then removed Maharaj, who danced down the track only to be deceived in flight and turn  the ball crashing into middle stump as South Africa fell to 352 for nine.\n\nMuzarabani wrapped up the innings by bowling Kwena Maphaka for eight, with Codi Yusuf unbeaten on the same score.\n\nMasakadza finished with four for 98, his career-best innings figures in Test cricket, while Masekesa and Chivanga chipped in with two wickets apiece.\n\nSet a colossal 537 for victory, Zimbabwe began cautiously in the final hour.\n\nOpeners Kaitano and Prince Masvaure looked solid  until the very last ball of the day.\n\nJust as the hosts seemed set to survive the session unscathed, Kaitano edged Bosch to second slip, ending a steady 32-run stand.\n\nThey closed on 32 for one, still needing 505 runs with nine wickets in hand.\n\nZimbabwe have passed 500 in an innings six times in Test cricket, most recently in December against Afghanistan at the same venue.\n\nBut their highest fourth-innings total is 331  made in a losing cause against New Zealand in 2001, also in Bulawayo.\n\nTheir most successful chase remains 174, achieved earlier this year against Bangladesh in Sylhet.\n\nThe next best, 162, came back in 1998 against Pakistan.\n\nThe world record fourth-innings chase is 418  set by the West Indies against Australia in 2003.\n\nWith history stacked high against them, Zimbabwe will need to bat with extraordinary discipline, determination and belief to salvage anything from this match.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/01015801/masakadza.jpg",
            "description": "<p>Zimbabwe Cricket South Africa – 418-9 declared and 369 all out in 82.5 overs (Wiaan Mulder 147, Keshav Maharaj 51, Corbin Bosch 36; Wellington Masakadza 4/98, Tanaka Chivanga 2/76, Vincent Masekesa 2/117) Zimbabwe – 251 and 32-1 in 18.2 overs (Takudzwanashe Kaitano 12, Prince Masvaure 5*; Corbin Bosch 1/1) Wellington Masakadza claimed a career-best four-wicket</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/masakadza-shines-but-zimbabwe-face-monumental-chase/\">Masakadza shines but Zimbabwe face monumental chase</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "01 Jul 2025"
        },
        {
            "title": "Train runs over lifeless man, another killed while lying on rail tracks",
            "url": "https://www.newzimbabwe.com/train-runs-over-lifeless-man-another-killed-while-lying-on-rail-tracks/",
            "content": "By Staff Reporter\n\nA NATIONAL Railways of Zimbabwe (NRZ) trainon Mondayran over a man who is believed to have already been dead.\n\nThe incident happened atOdzi Siding near the eastern border city of Mutare.\n\nThe NRZ confirmed the incident in a statement.\n\nA man was run over by a train early this morning at Odzi Siding near Mutare. The man was lying lifeless on the tracks and did not respond to the approaching trains sounding horn.\n\nThe train crew suspect the man was already dead by the time he was run over. The man had no identity particulars on him and the scene was attended by ZRP, reads the statement.\n\nIn a separate but similar incident, a man identified as Peter Vengesayi was run over by a train near Zvishavane, Midlands province.\n\nIn yet another tragic incident today, a man died after being run over by a train near Zvishavane.\n\nPeter Vengesayi of Village 1, Zeederburg under Chief Mafala was lying on the tracks when the incident occured. The NRZ extends its condolences to his family, said NRZ.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/10/17224403/National-Railways-of-Zimbabwe.jpg",
            "description": "<p>By Staff Reporter A NATIONAL Railways of Zimbabwe (NRZ) train on Monday ran over a man who is believed to have already been dead. The incident happened at Odzi Siding near the eastern border city of Mutare. The NRZ confirmed the incident in a statement. “A man was run over by a train early this morning at Odzi</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/train-runs-over-lifeless-man-another-killed-while-lying-on-rail-tracks/\">Train runs over lifeless man, another killed while lying on rail tracks</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "01 Jul 2025"
        },
        {
            "title": "EJWP backs gender policy to advance equality across Zimbabwe",
            "url": "https://www.newzimbabwe.com/ejwp-backs-gender-policy-to-advance-equality-across-zimbabwe/",
            "content": "By Alois Vinga\n\nTHE Economic Justice for Womens Project (EJWP) says the recently approved gender policy will go a long way inharnessinggender equality nationwide.\n\nCabinet recently adopted a new National Gender Policy (2025), which aims to promote gender equality and womens empowerment by addressing stereotypes and prejudices, institutionalising gender mainstreaming among other positives.\n\nIt provides a unified structure for monitoring gender equality and addresses systemic inequalities across various sectors of Zimbabwean society.\n\nSpeaking to NewZimbabwe.com this week, EJWP Executive Director, Margaret Mutsamvi, described the enactment of the blueprint as a giant step.\n\nThe recent Cabinets approval of the National Gender Policy (2025) is a significant milestone in Zimbabwes journey toward gender equality and womens empowerment. This development follows EJWPs submission of an urgent petition on 14 March 2025, calling for the renewal of the policy, which had lapsed in 2021  a gap that threatened to reverse hard-earned gains in gender equity, she said.\n\nThe CSO described the new policy as a foundation for a more inclusive, equitable and gender-responsive Zimbabwe, with clearly defined strategies to address systemic barriers across legal, economic, health, education, climate, and digital spheres.\n\nThe new policy, EJWP said, marks a shift from aspiration to action  offering a renewed national mandate to address entrenched gender disparities.\n\nAs EJWP, we remain deeply committed to supporting the full implementation of this policy, particularly around inclusive economic empowerment and accountability in public resource management. We will continue to monitor progress, engage with duty bearers, and amplify the voices of women, especially those in marginalised and economically excluded communities, added Mutsamvi.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/27052230/Margaret-Mutsamvi.jpg",
            "description": "<p>By Alois Vinga THE Economic Justice for Women’s Project (EJWP) says the recently approved gender policy will go a long way in harnessing gender equality nationwide. Cabinet recently adopted a new National Gender Policy (2025), which aims to promote gender equality and women’s empowerment by addressing stereotypes and prejudices, institutionalising gender mainstreaming among other positives. It provides</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ejwp-backs-gender-policy-to-advance-equality-across-zimbabwe/\">EJWP backs gender policy to advance equality across Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "01 Jul 2025"
        },
        {
            "title": "Zimbabwean farmers embrace AI and digital tools through FAO-led rural initiative",
            "url": "https://www.newzimbabwe.com/zimbabwean-farmers-embrace-ai-and-digital-tools-through-fao-led-rural-initiative/",
            "content": "TechAfricaNews\n\nThe Food and Agriculture Organization of the United Nations(FAO)is advancing agrifood systems through integration of effective digital technologies in Zimbabwe. Through the Fostering Digital Villages Initiative (FDiVi), FAO hosted a Digital Fair in the Masvingo province.\n\nThe digital fair brought together digital service providers, farmers, agri-entrepreneurs, and other stakeholders, creating a dynamic platform for knowledge exchange and real-time onboarding to digital agriculture solutions. The digital fair is part of the broader Fostering Digital Villages through innovative advisory and profitable market services project, which aims to transform agrifood systems in rural Malawi, Rwanda, and Zimbabwe using effective digital technologies, including artificial intelligence.\n\nThis project facilitates delivery of innovative agricultural extension services for increased productivity, enhanced market access, and advance inclusive rural transformation. It will also support local farmers, extension officers, agro-dealers, and processors, particularly the youth and women.\n\nPatrice Talla, FAO Subregional Coordinator for Southern Africa and Representative, Zimbabwe.\n\nThe digital fair held in the Bikita district is part of a series of the ongoing campaign by FAO targeting digital service providers, rural farmers, agri-entrepreneurs and other stakeholders to interact and integrate digital technologies in agriculture. The digital fair sparked renewed enthusiasm for digital transformation in agriculture among local communities.\n\nSpeaking during the digital fair, Bernard Hadzirambwi, the District Development Coordinator, praised the initiative and encouraged farmers to adopt digital technologies to enhance productivity and resilience.\n\nRural innovation thrives when communities connect and interact with digital technology.\n\nBernard Hadzirambwi, the District Development Coordinator, Zimbabwe.\n\nDuring the digital fair, our farmers explored AI-powered advisory tools, mobile market platforms, and digital extension services. I am truly encouraged by how quickly the community is embracing these innovations. Digital technologies are not just tools, they are enablers of climate-smart agriculture and inclusive rural development in our district.\n\nNobert Chiduza, District Agricultural Extension Officer in the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development, Zimbabwe.\n\nThe FDiVi is one of FAOs corporate initiatives and flagship programmes. It is an integrated development vision that enshrines digitalization at the core of rural transformation and prosperity, addressing on-farm and off-farm socio-economic elements.\n\nThe project is being implemented in the Mhondoro-Ngezi and Bikita districts where digital hubs will be equipped with digital tools and services including free internet, computers and digital literacy training materials.\n\nThe project supports local farmers, extension officers, agro-dealers, and processors through facilitating access to innovative agricultural extension services, improving market access, and promoting inclusive rural transformation.\n\nBefore the digital fair, I didnt know how much technology could change the way I farm. Now, Ive learned about AI tools that help me plan better, and I can connect directly with buyers through my phone. As a young farmer, this gives me confidence in exploring new opportunities posed through digital technologies.\n\nSheunesu Njeke, a 26-year-old farmer, Zimbabwe.\n\nGoing forward, FAO will integrate Digital Fairs in the annual District and Ward level Agriculture Shows. The project will continue to support digital innovators and entrepreneurs in breaking into the rural market and will also support farmers and other rural stakeholders to safely onboard onto digital platforms and services.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/01012204/farmers-FAO.png",
            "description": "<p>TechAfricaNews The Food and Agriculture Organization of the United Nations (FAO) is advancing agrifood systems through integration of effective digital technologies in Zimbabwe. Through the Fostering Digital Villages Initiative (FDiVi), FAO hosted a Digital Fair in the Masvingo province. The digital fair brought together digital service providers, farmers, agri-entrepreneurs, and other stakeholders, creating a dynamic platform</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-farmers-embrace-ai-and-digital-tools-through-fao-led-rural-initiative/\">Zimbabwean farmers embrace AI and digital tools through FAO-led rural initiative</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "01 Jul 2025"
        }
    ]
}