{
    "news": [
        {
            "title": "‘Pastor’ Walter Masocha jailed for ‘removing demons’ sex attacks",
            "url": "https://www.newzimbabwe.com/pastor-walter-masocha-jailed-for-removing-demons-sex-attacks/",
            "content": "BBC\n\nA church pastor who sexually assaulted a female churchgoer under the pretence of removing demons from her body has been jailed for 10 years.\n\nWalter Masocha, 61, groped the married woman at his home in Stirling, claiming he was a gift from god.\n\nThe University of Stirling professor also attempted to rape another woman during a campaign of abuse from 2006 to 2012.\n\nMasocha denied the attacks during the trial at the High Court in Livingston, but judge Susan Craig described his offending as appalling.\n\nShe imposed a non-harassment orders banning him from approaching or contacting his two victims.\n\nMasocha founded his own church in Scotland in 2007 soon after moving from Zimbabwe.\n\nHe built Agape for All Nations Church into an international religious organisation with more than 2,000 members and appointed himself as archbishop.\n\nOne of his victims said most people in the church saw him as a father figure and referred to him as Dad or Daddy.\n\nThe trial heard Masocha, an accountancy professor, had first targeted another of his victims, now aged 58, about 20 years ago at his home in Stirling.\n\nShe told the court how Masocha had ordered her to kiss his holy lips and attempted to justify putting his hand in her pants and groping her by claiming he was removing demons from her body.\n\nA 39-year-old woman told how she was 20 when Masocha began sexually abusing her after she went to stay with his family.\n\nShe said Masocha repeatedly sexually assaulted her during that period by forcing her to touch him and slapping her on the bottom as she walked upstairs.\n\nThe woman said he later tried to rape her after taking her into his bedroom before managing to escape.\n\nMasocha waspreviously found guilty in June 2015 of sexually assaulting a church deaconessand putting his hand down the trousers of a schoolgirl, telling her that he was trying to remove demons.\n\nThe convictions were laterquashed by the appeal courtafter judges ruled hed been the victim of a miscarriage of justice.\n\nHowever, new proceedings were launched by the Crown after two further women made statements to the police about his behaviour.\n\nJudge Craig said it was likely that Mascohas name would appear on the sex offenders register indefinitely.\n\nAdvocate depute, Michael McIntosh, said: Walter Masocha wasnt just a pastor and a preacher, he was a predator who thought that his power and position rendered him immune from suspicion.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/29103217/masocha.webp",
            "description": "<p>BBC A church pastor who sexually assaulted a female churchgoer under the pretence of “removing demons” from her body has been jailed for 10 years. Walter Masocha, 61, groped the married woman at his home in Stirling, claiming he was a “gift from god”. The University of Stirling professor also attempted to rape another woman</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pastor-walter-masocha-jailed-for-removing-demons-sex-attacks/\">‘Pastor’ Walter Masocha jailed for ‘removing demons’ sex attacks</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:51",
            "date": "29 Jul 2025"
        },
        {
            "title": "Tagwirei must be stopped, ‘a criminal can’t be president’ – Biti",
            "url": "https://www.newzimbabwe.com/tagwirei-must-be-stopped-a-criminal-cant-be-president-biti/",
            "content": "By Staff Reporter\n\nFormer Finance Minister Tendai Biti has launched a stinging attack on controversial business tycoon Kudakwashe Tagwirei, accusing him of looting and collapsing Zimbabwes economy.\n\nBiti insists that Tagwireimust be prevented from ascending to the countrys top job, citing his role in destroying Zimbabwes local currency in 2019 as just one example of his economic sabotage.\n\nThe beleaguered businessman was recently ousted from a Zanu-PF Central Committee meeting after his co-option into the partys key structure was foiled. Party spokesman Christopher Mutsvangwa later vowed to fight Tagwireis rise into the partys most senior and influential ranks.\n\nBiti, echoing Mutsvangwas sentiments that Tagwirei is buying his way up the party structure, was blunt about the need to thwart Tagwireis presidential ambitions.\n\nBiti accused Tagwirei of single-handedly collapsing Zimbabwes local currency in 2019 after being issued treasury bills worth US$360 million.\n\nHe alleges Tagwirei then flooded the market with this cash, causing the RTGS currency to plummet. This, Biti argues, is a prime example of how Tagwirei has undermined the nations financial stability through illicit means.\n\nPresident Emmerson Mnangagwa had once described the local currency as the strongest in the region, although his government later devalued it and announced the introduction of the ZiG currency last April.\n\nTagwirei, who owns numerous companies, some under his well-known Sakunda Holdings, is also accused of netting millions of dollars through his Fossil company, which constructed the Trabablas Interchange in Harare at US$114 million, more than double the regional market prices.\n\nSpeaking to a local online news publication (263Chat) on Monday, Biti took a swipe at Tagwirei, branding him a criminal and unfit to become Zimbabwes President in future.\n\nIt is crazy to think that this criminal actually has ambitions to be the next President of the Republic of Zimbabwe, Biti said.\n\nIt cant happen and should not happen. It should not be allowed to happen, he added.\n\nBiti also challenged Zanu-PF, calling it a laughing stock for allowing its values to be disregarded due to greed for money and top-of-the-range vehicles.\n\nI feel pity for Zanu-PF. Zanu-PF is being reduced to a commodity that can be bought by a few trinkets. A few motor vehicles, a few GD6s, what kind of country have we become? Biti queried.\n\nThis comes after Tagwirei himself doled out some top-of-the-range vehicles to Zanu-PFs Harare Provincial leadership in his bid to be co-opted into the partys Central Committee, a move that has come crashing down like a deck of cards.\n\nBiti said thousands of liberation struggle war heroes are turning in their graves, believing they would not have gone to war had they known the current state of Zanu-PF, which people with money are hijacking.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/25044732/Tendai-Biti.png",
            "description": "<p>By Staff Reporter Former Finance Minister Tendai Biti has launched a stinging attack on controversial business tycoon Kudakwashe Tagwirei, accusing him of looting and collapsing Zimbabwe’s economy. Biti insists that Tagwirei must be prevented from ascending to the country’s top job, citing his role in destroying Zimbabwe’s local currency in 2019 as just one example of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tagwirei-must-be-stopped-a-criminal-cant-be-president-biti/\">Tagwirei must be stopped, ‘a criminal can’t be president’ – Biti</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:51",
            "date": "29 Jul 2025"
        },
        {
            "title": "South African authorities begin auctioning Marry Mubaiwa’s seized property",
            "url": "https://www.newzimbabwe.com/south-african-authorities-begin-auctioning-marry-mubaiwas-seized-property/",
            "content": "By Mary Taruvinga\n\nSouth African authorities have started auctioning the property of Marry Mubaiwa, the ex-wife of Vice President Constantino Chiwenga to compensate victims of financial crimes she allegedly committed years ago, an official has announced.\n\nThe property in Pretoria is suspected to be linked to illicit activities.\n\nThe National Prosecuting Authority of Zimbabwe announced the development in a statement on Monday.\n\nIn a gesture against transactional financial crime, the South African High Court had declared Mubaiwas luxury immovable property located at ERF 191 Sterrewag, Extension 3, and two Land Rovers as assets that should be forfeited to the South African state in December 2022.\n\nThese assets had been placed under a preservation order since February 9 2022, due to their alleged connection to proceeds from crimes such as money laundering and illicit financial flows.\n\nThe High Court ordered that the said properties be placed under the custody of an auctioneer, with proceeds of the public sale to be directed towards compensating the victim(s) of the offence.\n\nOne of the forfeited vehicles was recently auctioned with the proceeds set to be transferred to the victim, announced the NPA.\n\nThe NPA also said this case is a landmark demonstration of the strength and efficacy of cross-border legal cooperation within the Southern African Development Community (SADC).\n\nThe outcome reflects the enduring partnership between the NPA of South Africa and its Zimbabwean counterpart in addressing transnational financial crimes and the recovery of proceeds of crime, reads the statement.\n\nDocuments show that South Africas NPA on October 14 2021, received a request for Mutual Legal Assistance (MLA) for Zimbabwe against Mubaiwa.\n\nZACC Commissioner Frank Muchengwa told South African authorities the anti-graft body had received information from a whistleblower that Mubaiwa had fraudulently exported funds to South Africa to buy some properties.\n\nIt is alleged that Mubaiwa instructed Memory Chakulinga, her relative and Managing Director of her two companies in SA, Falcon Project Pty and Bonnets Electrical Pty in Pretoria, to raise proforma invoices for the purchase of event tents and chairs and prepaid meters.\n\nMuchengwa said the invoices would then be referred to the Commercial Bank of Zimbabwe (CBZ) as if they specifically intended to purchase the goods, but the funds were allegedly diverted to purchase her personal properties.\n\nChakulinga states further that Mubaiwa is her aunt and she recalls Mubaiwa approaching her to assist in setting up a business in South Africa, as she indicated that she had won a tender in Zimbabwe. Chakulinga also allegedly said Mubaiwa had told her that she had the facility to get money from the Reserve Bank of Zimbabwe for funding the business, Muchengwa said.\n\nChakulinga allegedly offered assistance with a place to open a business at her premises.\n\nShe was then asked to do proforma invoices in the name of Tanor Investment for the supply of event hosting accessories, tents for R203 308 and the invoices had Mubaiwas Falcon Suppliers FNB bank accounts.\n\nCourt papers show that in December 2018, R203,308 was deposited into the account from CBZ and according to the narration, it was intended for the purchase of tents.\n\nAccording to Chakulinga, upon receipt in her account the funds, Mubaiwa instructed her to divert the funds towards purchase of Range Rover at Menlyn in Pretoria, reads court papers.\n\nChakulinga states that she paid R4 million to Range Rover Menlyn and she was told by Mubaiwa that the motor vehicle was to be taken to Zimbabwe but to her surprise, it was registered in South Africa under Marry Mubaiwa.\n\nIn May, according to Chakulinga, another R2 million was deposited into Bonnette Electrical FNB account and she was called by the bank to confirm the receipt of the funds.\n\nShe did what she had been instructed to do before but this time on the invoices indicated she was to buy electrical prepaid meters.\n\nChakulinga added that after the release of the funds, Mubaiwa ordered her to transfer R4 96 500 to the Martin Potgieter Trust Account at Standard Bank.\n\nAccording to Muchengwa, there was a financial flow from CBZ to FNB that was detected on the accounts.\n\nIt was established that one of the signatories at Mubaiwas East Town Commodities was Jeffery Jenje and he allegedly confirmed this.\n\nJenje also confirmed payments that were made and also that Mubaiwa indeed purchased two vehicles.\n\nProof of vehicle purchase was provided by Jacobus Hercules Du Preez.\n\nDu Preez said Mubaiwa bought two vehicles worth R1,6 million and R1,8 million, respectively.\n\nThe ongoing investigations also revealed that Mubaiwa bought a house by sourcing cash from individual companies to purchase on her behalf.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/29160904/Marry-Mubaiwa..png",
            "description": "<p>By Mary Taruvinga South African authorities have started auctioning the property of Marry Mubaiwa, the ex-wife of Vice President Constantino Chiwenga to compensate victims of financial crimes she allegedly committed years ago, an official has announced. The property in Pretoria is suspected to be linked to illicit activities. The National Prosecuting Authority of Zimbabwe announced</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-african-authorities-begin-auctioning-marry-mubaiwas-seized-property/\">South African authorities begin auctioning Marry Mubaiwa’s seized property</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:51",
            "date": "29 Jul 2025"
        },
        {
            "title": "Young Chevrons lose second Youth ODI tri-series match to Bangladesh",
            "url": "https://www.newzimbabwe.com/young-chevrons-lose-second-youth-odi-tri-series-match-to-bangladesh/",
            "content": "By Sports Reporter\n\nZimbabwe mens under-19 cricket team on Monday lost their second Youth ODI tri-series match to Bangladesh by 91 runs.\n\nThe defeat came on the back of a humiliating 273-run defeat on Friday to South Africa in the opening match of the series.\n\nHaving won the toss, Zimbabwe opted to bowl in the first innings, in which Bangladesh racked 278 runs.\n\nBangladeshs opening batsman Zawad Abrar was too hot to handle for Zimbabwe as he amassed 83 runs , recording the highest individual runs for his side.\n\nComing back to the second innings, Zimbabwe were poor with the bat, as they were bowled out with 183 runs in 42.2 overs.\n\nThe Young Chevrons best batsman of the day was Nathaniel Hlabangana, who managed 53 runs off 72 balls.\n\nZimbabwe had half of its batsmen posting less than ten runs: Simbarashe Mudzengerere (0) , Tatenda Chimugoro (1), Panashe Mazai (0), Shelton Mazvitorera (0) and Tatenda Banda (7).\n\nMondays result saw Zimbabwe maintaining its place at the bottom of the log table, while Bangladesh were propelled to go on top of the table with two wins from two matches, followed by South Africa with one win.\n\nThe Young Chevrons will be back in action on Tuesday when they play South Africa in a return fixture, which they will be hoping to turn the tables following a 278-run defeat in the first match last week.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/28223846/young-chevrons-bangladesh.jpg",
            "description": "<p>By Sports Reporter Zimbabwe men’s under-19 cricket team on Monday lost their second Youth ODI tri-series match to Bangladesh by 91 runs. The defeat came on the back of a humiliating 273-run defeat on Friday to South Africa in the opening match of the series. Having won the toss, Zimbabwe opted to bowl in the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/young-chevrons-lose-second-youth-odi-tri-series-match-to-bangladesh/\">Young Chevrons lose second Youth ODI tri-series match to Bangladesh</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:51",
            "date": "29 Jul 2025"
        },
        {
            "title": "Beyonce’s ‘Cowboy Carter’ becomes highest-grossing country tour ever",
            "url": "https://www.newzimbabwe.com/beyonces-cowboy-carter-becomes-highest-grossing-country-tour-ever/",
            "content": "Beyonces Cowboy Carter tour is now the highest-grossing country tour of all time with over $400 million in revenue, Live Nation said in a statement on Monday, citing a Billboard story.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/28223145/Beyonce-1200x799-1.jpg",
            "description": "<p>Reuters Beyonce’s “Cowboy Carter” tour is now the highest-grossing country tour of all time with over $400 million in revenue, Live Nation said in a statement on Monday, citing a Billboard story. The “Cuff It” singer has also become the highest-grossing Black artist of all time and the highest-grossing R&B artist of all time, Live</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/beyonces-cowboy-carter-becomes-highest-grossing-country-tour-ever/\">Beyonce’s ‘Cowboy Carter’ becomes highest-grossing country tour ever</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:51",
            "date": "29 Jul 2025"
        },
        {
            "title": "Elephants trample soldier to death near Beitbridge border post",
            "url": "https://www.newzimbabwe.com/elephants-trample-soldier-to-death-near-beitbridge-border-post/",
            "content": "SowetanLive\n\nA South African soldier on border patrol has been trampled to death by a herd of elephants in Limpopo near Zimbabwe.\n\nThe incident happened on Sunday night near the banks of the Limpopo River in Musina, about 300m from the SANDFs Madimbo operational base.\n\nPrivate Xavier Raynard was doing routine patrols on the Malala Drift road when he was killed.\n\nThe SANDF went to collect his remains on Monday.\n\nSANDF spokesperson Prince Tshabalala said Raynard, a member of the 10 Anti-Aircraft Regiment, who was deployed under Operation Corona,was found dead near the base.\n\nEarly indications suggest that he may have been fatally trampled by a herd of elephants while conducting routine patrols in the area. His service weapon was recovered at the scene.\n\nThe matter is under investigation by SANDF authorities in co-operation with environmental and wildlife officials to determine the exact circumstances surrounding the incident. A formal board of inquiry has been initiated, said Tshabalala.\n\nTshabalala said Raynards next of kin, from Kimberley, Northern Cape, have been formally notified, and psychosocial support is being provided to the family and his unit members.\n\nOperation Corona is a national border safeguarding initiative aimed at combating transnational crimes along the countrys borders.\n\nTshabalala said that soldiers deployed in these operations face harsh terrain, isolation and exposure to unpredictable natural conditions.\n\nLauren Liebenberg from the Vhembe Biosphere Reserve said:At this time of year, the crisis with the elephant populations that roam the Limpopo River Valley intensifies.When elephant hunting starts in the dry season they come across the Limpopo River [into SA] in huge numbers, she said, adding that the elephants neededa well-managed migration corridor.\n\nThe problem extends along the whole length of the 200km strip between Mapungubwe and Kruger National Park. We become a massive human-wildlife conflict zone.\n\nLiebenberg said a programme by the US Agency for International Development to manage the problem collapsed after the US administration cancelled it earlier this year.\n\nThrough the programme, they trained elephant herders and provided all sorts of defence interventions.\n\nDeaths still remain rare and at the extreme end of the human wildlife conflict interface, but the elephants do massive damage to crops, to infrastructure  especially fencing and water infrastructure, and to the natural vegetation in the nature reserves, said Liebenberg.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/28221348/raynard-.png",
            "description": "<p>SowetanLive A South African soldier on border patrol has been trampled to death by a herd of elephants in Limpopo near Zimbabwe. The incident happened on Sunday night near the banks of the Limpopo River in Musina, about 300m from the SANDF’s Madimbo operational base. Private Xavier Raynard was doing routine patrols on the Malala</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/elephants-trample-soldier-to-death-near-beitbridge-border-post/\">Elephants trample soldier to death near Beitbridge border post</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:51",
            "date": "29 Jul 2025"
        },
        {
            "title": "World Bank chief says Zimbabwe needs G20 help to exit debt trap",
            "url": "https://www.newzimbabwe.com/world-bank-chief-says-zimbabwe-needs-g20-help-to-exit-debt-trap/",
            "content": "Bloomberg\n\nZimbabwes best chance of exiting a 25-year debt default is to engage the Group of 20 nations to help formulate a solution and stop trying to work its way out of the quagmire itself, World Bank President Ajay Banga said.\n\nThe southern African country owes the World Bank and other creditors a total of $21 billion and has tried numerous unsuccessful strategies to restore its access to global capital markets. Those ranged from attempting to repay its debts using the proceeds of metal sales and recently approaching 10 nations for help to raise $2.6 billion to pay its arrears.\n\nAjay Banga. Image: Bloomberg\n\nTrying to figure it out on your own, youll be doing this for the next five years, Banga said in an interview in Maputo, Mozambiques capital. They need to figure out a way to reach out to the G20 and say, we raise our hand, wed like to be part of this process.\n\nZimbabwe first defaulted on repayments to the World Bank in 2000. Its debts to a host of multilateral institutions and bilateral lenders mounted amid a failed land-reform program and a quarter century of economic turmoil, shutting it out of international debt markets and limiting its ability to borrow even during the global pandemic and a recent devastating drought.\n\nThe government has asked the African Development Bank to advise on clearing its debt with the institutions outgoing president, Akinwumi Adesina, and former Mozambican President Joaquim Chissano asked to negotiate with creditors. It also hired Global Sovereign Advisory, a Paris-based consultancy, to help. The fact that Zimbabwean officials, including President Emmerson Mnangagwa, have been sanctioned by the US has complicated the process.\n\nWhile Belarus, Syria and Eritrea are also in arrears to the World Bank, Zimbabwes default is by far the longest. South Africa, which currently holds the G-20 presidency, last month said it has been approached by Zimbabwe to try and garner the groups support for a debt workout.\n\nZambia, Ghana and Ethiopia are among nations that have employed the G20s Common Framework, which was created in 2020 to help poor nations bring together a diverse set of creditors to restructure debts. While they have made progress in reaching deals, the process has been criticized for being too slow.\n\nZimbabwe isnt technically poor enough to be eligible to utilise the framework, yet Sri Lanka  a nation in a similar situation  approached the group in 2023 for help with dealing with its creditors.\n\nStart talking to the G20 and the Paris Club and whoever else has given them money and we can help, Banga said. We try and bring an understanding of what write down you need to take. It takes a while.\n\nZimbabwes Treasury didnt respond to a request for comment.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/08111459/harare.jpeg",
            "description": "<p>Bloomberg Zimbabwe’s best chance of exiting a 25-year debt default is to engage the Group of 20 nations to help formulate a solution and stop trying to work its way out of the quagmire itself, World Bank President Ajay Banga said. The southern African country owes the World Bank and other creditors a total of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/world-bank-chief-says-zimbabwe-needs-g20-help-to-exit-debt-trap/\">World Bank chief says Zimbabwe needs G20 help to exit debt trap</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:51",
            "date": "29 Jul 2025"
        },
        {
            "title": "Nigeria kidnappers kill 35 hostages even after ransom paid",
            "url": "https://www.newzimbabwe.com/nigeria-kidnappers-kill-35-hostages-even-after-ransom-paid/",
            "content": "BBC\n\nKidnappers in Nigeria have killed at least 35 people they abducted from a village in northern Zamfara state despite ransoms being paid for their release, a local official told the BBC.\n\nIn recent years, criminal gangs in the region, known in the country as bandits, have taken to kidnapping people as a means to raise money.\n\nIn this incident, 56 people were taken from Banga village, Kauran Namoda local government area in March. The gunmen then demanded a ransom of one million naira ($655; 485) per captive, media in Nigeria report.\n\nLocal government chairman Manniru Haidara Kaura said that most of those killed were young people who were slaughtered like rams.\n\nWhat happened was that the bandits demanded ransom money, and after some back-and-forth, they were given what they asked for. They then released 18 people, including 17 women and one young boy, on Saturday, Haidara added.\n\nOnly they [the gunmen] know why they killed them. They are senseless and heartless people. They forget that they are killing their own brothers, and we will all meet before Allah.\n\nSixteen of those released on Saturday are in the hospital receiving treatment, while the bodies of the 38 killed by the bandits are unlikely to be returned as in these cases corpses are rarely released.\n\nIn an attempt to curb the spiralling and lucrative kidnapping industry, a law was enacted in 2022 making it a crime to make ransom payments. It carries a jail sentence of at least 15 years, however no-one has ever been arrested on those charges.\n\nIt also made abduction punishable by death in cases where victims die.\n\nBut families often feel forced to pay to save their loved ones, citing the governments inability to ensure their safety.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/28220819/kidnapper.webp",
            "description": "<p>BBC Kidnappers in Nigeria have killed at least 35 people they abducted from a village in northern Zamfara state despite ransoms being paid for their release, a local official told the BBC. In recent years, criminal gangs in the region, known in the country as bandits, have taken to kidnapping people as a means to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nigeria-kidnappers-kill-35-hostages-even-after-ransom-paid/\">Nigeria kidnappers kill 35 hostages even after ransom paid</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:51",
            "date": "29 Jul 2025"
        }
    ]
}