{
    "news": [
        {
            "title": "Burial of Zambia’s ex-president in South Africa halted at last minute by court",
            "url": "https://www.newzimbabwe.com/burial-of-zambias-ex-president-in-south-africa-halted-at-last-minute-by-court/",
            "content": "A South African court has halted plans to bury former Zambian President Edgar Lungu at a private ceremony just as it was about to start.\n\nThe news was only announced to mourners in South Africa after a funeral mass had already finished.\n\nThis is the latest twist in a row between the government and Lungus family over his burial, after the family opted for a private ceremony in South Africa, rather than a full state funeral at home.\n\nThe Zambian government had filed an urgent case in the Pretoria High Court seeking to stop the burial planned by his family.\n\nThe court said that the funeral would not go ahead following an agreement between the parties however it appears that any funeral wont happen until August at the earliest.\n\nThe dispute follows a long-standing feud between Lungu and his successor, President Hakainde Hichilema, with Lungus family saying he had indicated that Hichilema should not attend his funeral.\n\nFollowing Lungus death in South Africa aged 68, the family wanted to be in charge of the funeral arrangements, including the repatriation of his body, but the Zambian authorities sought to take control.\n\nThe government and his family later agreed he would have a state funeral before relations broke down over the precise arrangements, prompting the family to opt for a burial in South Africa.\n\nPresident Hichilema has since argued that Lungu, as a former president, belongs to the nation of Zambia and should be buried in the country.\n\nNomsa Maseko / BBC Mourners were only told about the delay after the funeral mass had finished\n\nThe Pretoria court gave Zambian attorney general Mulilo D Kabesha until 4 July to submit his amended notice of motion in support of Lungus repatriation to Zambia. His family has until 11 July to file their opposing papers.\n\nThis matter will be heard as a special motion on the 4th of August 2025, the court said. The costs of the urgent application will be determined then.\n\nThe Zambian government argues that personal wishes should not override the greater public interest, citing the case of founding President Kenneth Kaunda.\n\nIn 2021, Kaundas family said he wanted to be laid to rest next to his wife and not at the site designated by the government.\n\nHowever, the government went ahead and buried Kaunda at Embassy Memorial Park in Lusaka.\n\nThe current row over Lungus burial underscores the tense relationship between him and his successor, which played out in life and continues even in death.\n\nWhen Lungu was president, Hichilema was locked up for over 100 days on treason charges after Hichilemas motorcade allegedly refused to give way for him.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/25163954/lungu-burial.webp",
            "description": "<p>BBC A South African court has halted plans to bury former Zambian President Edgar Lungu at a private ceremony just as it was about to start. The news was only announced to mourners in South Africa after a funeral mass had already finished. This is the latest twist in a row between the government and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/burial-of-zambias-ex-president-in-south-africa-halted-at-last-minute-by-court/\">Burial of Zambia’s ex-president in South Africa halted at last minute by court</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "25 Jun 2025"
        },
        {
            "title": "A decade later, govt finally gazettes Mines and Minerals Bill",
            "url": "https://www.newzimbabwe.com/a-decade-later-govt-finally-gazettes-mines-and-minerals-bill/",
            "content": "By Alois Vinga\n\nZIMBABWE finally gazetted the contentious Mines and Minerals Bill a decade later from its initial drafting, igniting hopes for attaining lasting solutions to mining-related problems bedevilling the nation.\n\nThe Bill, which has gone through several twists and turns since 2015, is seen as a signal marking the departure from the archaic colonial legislation last promulgated in 1961, leaving gaps which the mining companies have taken advantage of over the years.\n\nThe document was published on Wednesday in the Government Gazette under General Notice 1243A of 2025 by Clerk of Parliament, Kennedy Chokuda, in terms of Standing Order No.142 (1) of the National Assembly.\n\nHowever, this is not the first time the Mines and Minerals Bill has been gazetted as it has been tabled, debatedand shelved with some lapsing in Parliament or stalling before Presidential assent.\n\nAmong other issues, the Bill is expected to replace the Mines and Minerals Act (Chapter 21:05) of 1961, establish a Mining Affairs Board to guide decision-making processes, introduce clearer rules on mining title management, particularly in terms of cadaster and exploration rights.\n\nThe legislative piece, once passed, is also expected to strengthen environmental compliance and land rehabilitation obligations, improve governance through transparency and accountability mechanisms in the allocation of mining rights, define and protect community rights, including benefitsharing and land access protocols.\n\nIt will address concerns about exclusive prospecting orders (EPOs) and introduce frameworks that enable smallscale and artisanal miners to be formally recognized and supported and align the mining law with Zimbabwes Vision 2030 and other international obligations, particularly in the extractives sector.\n\nIt comes at an opportune time on the back of rapid environmental degradation, suspected under declarations and limited benefits for mining communities.\n\nSpeaking to NewZimbabwe.com shortly after the Bills gazetting, Silveira House director, Father Clemence Mutimutema hailed the development. The organisation has invested resources towards crafting of the legislation to address gaps in mining communities over the years,\n\nThis is a significant and encouraging step that demonstrates the governments commitment to addressing one of the most pressing challenges facing the nation. We sincerely hope that this time, the Bill will proceed to completion without any setbacks. As a faith-based organisation actively engaged in mining communities, we stand ready to support Parliament and the government in all efforts related to the Bill, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/07/06173942/mine.webp",
            "description": "<p>By Alois Vinga ZIMBABWE finally gazetted the contentious Mines and Minerals Bill a decade later from its initial drafting, igniting hopes for attaining lasting solutions to mining-related problems bedevilling the nation. The Bill, which has gone through several twists and turns since 2015, is seen as a signal marking the departure from the archaic colonial</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/a-decade-later-govt-finally-gazettes-mines-and-minerals-bill/\">A decade later, govt finally gazettes Mines and Minerals Bill</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "25 Jun 2025"
        },
        {
            "title": "The most outrageous stories! – Pokello reacts to Chombo’s death hoax",
            "url": "https://www.newzimbabwe.com/the-most-outrageous-stories-pokello-reacts-to-chombos-death-hoax/",
            "content": "By Tapiwa Svondo\n\nSocialite Pokello Nare has taken to Instagram, assuring that her stepfather, Ignatius Chombo, is alive following false reports of his death.\n\nSocial media platforms were Wednesday morning awash with rumours that the former cabinet minister had died at a local private hospital.\n\nIgnatius Chombo\n\nPokello addressed the rumours in an Instagram story.\n\nIt still baffles me what goes through the minds of individuals who wake up and create the most outrageous stories. My father is strong and in very good health, she wrote.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/25154212/pokello.jpeg",
            "description": "<p>By Tapiwa Svondo Socialite Pokello Nare has taken to Instagram, assuring that her stepfather, Ignatius Chombo, is alive following false reports of his death. Social media platforms were Wednesday morning awash with rumours that the former cabinet minister had died at a local private hospital. Pokello addressed the rumours in an Instagram story. “It still</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/the-most-outrageous-stories-pokello-reacts-to-chombos-death-hoax/\">The most outrageous stories! – Pokello reacts to Chombo’s death hoax</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "25 Jun 2025"
        },
        {
            "title": "Parliament: Opposition demands ministerial statement on usage of US$38 million sugar tax funds",
            "url": "https://www.newzimbabwe.com/parliament-opposition-demands-ministerial-statement-on-usage-of-us38-million-sugar-tax-funds/",
            "content": "By Anna Chibamu\n\nCitizens Coalition for Change (CCC) legislator, Thokozani Khupe has demanded a ministerial statement from the Ministry of Finance on the disbursement of the US$38 million collected through the sugar tax for the procurement of cancer treatment equipment.\n\nOn a point of national interest, Khupe who was diagnosed with cancer in 2011, told Speaker Jacob Mudenda that there are alarming cancer deaths countrywide and needed urgent attention from government.\n\nIt is with a heavy heart that I rise today to draw the attention of this August House to a matter of grave and urgent national importance, the escalating cancer crisis in our country.\n\nThe stark and painful reality is that more of our fellow citizens are succumbing to cancer now than ever before. The statistics are not just numbers. They are names, faces, families and futures tragically cut short, Khupe said.\n\nThis alarming rise in cancer-related deaths has compelled many of us to call upon the government to elevate cancer to a top-tier public health priority.\n\nIn recognition of the need for increased resources, a sugar tax was introduced. The proceeds from this tax were intended to be directed specifically toward the fight against cancer, to procure lifesaving equipment, essential medicines and to strengthen the overall cancer response infrastructure.\n\nKhupe revealed that some months ago, she posed a question regarding the disbursement of US$38 million from the sugar tax fund as announced by the Finance Minister.\n\nIn response, Khupe was informed that the procurement process for cancer equipment and medications had commenced.\n\nAccording to Khupe, who has been lobbying for prioritisation of cancer treatment in the country, a report by the state media had indicated the much-needed cancer equipment was to be purchased directly from China to reduce costs.\n\nGiven the magnitude of this public health emergency, I respectfully request that the Hon. Minister of Finance urgently deliver a ministerial statement to this House.\n\nThe statement should provide a comprehensive update on the current status of the sugar tax fund, specifically how much remains available beyond the US$38 million already disbursed.\n\nThe progress made in the procurement of modern, state-of-the-art cancer treatment equipment and essential medicines as well as measures being taken to ensure transparency, efficiency and value for money in the procurement process, said the MP.\n\nKhupe told Mudenda that the urgency of her request could not be overstated asdelays cost lives.\n\nWe are losing mothers, fathers, brothers, sisters  productive citizens whose potential contributions to society are being lost due to late diagnosis, inadequate treatment or lack of access to modern cancer care.\n\nLet us respond to this crisis with the seriousness, compassion and urgency it demands. The fight against cancer is not merely a medical issue. It is a moral imperative and a national priority, Khupe stated.\n\nThe Speaker commended Khupe and ordered Deputy Chief Whip Kambuzuma to make sure Ncube brings the ministerial statement to Parliament.\n\nThank you very much Hon. Dr. Khupe; deputy chief whip (Hurungwe West MP Chinjai Kambuzuma) can you take note of that statement and in liaison with the administration of Parliament, proceed to advise the Minister of Finance, Economic Development and Investment Promotion accordingly, Mudenda said.\n\nLast week, President Emmerson Mnangagwa made a surprise visit to Parirenyatwa Group of Hospitals and Sally Mugabe Hospital to assess the status of the countrys top referral health institutions.\n\nThe National Cancer Institute in Zimbabwe reported that cancer is a major cause of death, with over 7,500 new cases and over 2,500 deaths reported annually.\n\nIt also reported that cancer is predicted to surpass HIV and AIDS as the leading cause of death in the near future.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/10/01042821/Thokozani-Khupe.jpg",
            "description": "<p>By Anna Chibamu Citizens Coalition for Change (CCC) legislator, Thokozani Khupe has demanded a ministerial statement from the Ministry of Finance on the disbursement of the US$38 million collected through the sugar tax for the procurement of cancer treatment equipment. On a point of national interest, Khupe who was diagnosed with cancer in 2011, told</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/parliament-opposition-demands-ministerial-statement-on-usage-of-us38-million-sugar-tax-funds/\">Parliament: Opposition demands ministerial statement on usage of US$38 million sugar tax funds</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "25 Jun 2025"
        },
        {
            "title": "Zambia in last-minute court bid to stop ex-president’s burial in South Africa",
            "url": "https://www.newzimbabwe.com/zambia-in-last-minute-court-bid-to-stop-ex-presidents-burial-in-south-africa/",
            "content": "BBC\n\nThe Zambian government has filed an urgent case in a South African court seeking to stop the burial of former President Edgar Lungu, state media reports.\n\nThis is the latest twist in a row between the government and Lungus family over his burial, after the family opted for a private ceremony in South Africa, rather than a full state funeral at home.\n\nThe Zambian attorney general has requested the court to halt the burial, scheduled for Wednesday, until the dispute is resolved, state broadcaster ZNBC reports.\n\nLocal media quote the family as saying that the funeral would go ahead as planned, as they had not been served with court papers.\n\nThe dispute follows a long-standing feud between Lungu and his successor, President Hakainde Hichilema, with Lungu having indicated in his will that Hichilema should not attend his funeral.\n\nFollowing Lungus death, the family wanted to be in charge of the funeral arrangements, including the repatriation of the body from South Africa where he died, but the Zambian authorities sought to take control.\n\nThe government and his family later agreed he would have a state funeral before relations broke down over the precise arrangements, prompting the family to opt for a burial in South Africa.\n\nPresident Hichilema has since argued that Lungu, as a former president, belongs to the nation of Zambia and should be buried in the country.\n\nIn the court papers, the Zambian attorney general, Mulilo D Kabesha, reportedly contends that a state funeral is a formal public event with military honours, intended to honour a person of national significance.\n\nHe is suing the family, including former first lady Esther Lungu and four children, family lawyer Makebi Zulu and the funeral home where the body is being kept.\n\nHe argues that personal wishes should not override the greater public interest, citing the case of founding President Kenneth Kaunda.\n\nIn 2021, Kaundas family said he wanted to be laid to rest next to his wife and not at the site designated by the government.\n\nHowever, the government went ahead and buried Kaunda at Embassy Memorial Park in Lusaka.\n\nThe current row over Lungus burial underscores the tense relationship between him and his successor, which played out in life and continues even in death.\n\nWhen Lungu was president, Hichilema was locked up for over 100 days on treason charges after Hichilemas motorcade allegedly refused to give way for him.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/01/01182032/Edgar-Lungu.jpg",
            "description": "<p>BBC The Zambian government has filed an urgent case in a South African court seeking to stop the burial of former President Edgar Lungu, state media reports. This is the latest twist in a row between the government and Lungu’s family over his burial, after the family opted for a private ceremony in South Africa,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zambia-in-last-minute-court-bid-to-stop-ex-presidents-burial-in-south-africa/\">Zambia in last-minute court bid to stop ex-president’s burial in South Africa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "25 Jun 2025"
        },
        {
            "title": "Zimbabwe’s Economic Meltdown Sparks Online Gambling Craze",
            "url": "https://www.newzimbabwe.com/zimbabwes-economic-meltdown-sparks-online-gambling-craze/",
            "content": "Once seen as one of Africas most promising economies, Zimbabwe has undergone a dramatic andprolonged collapse. Decades of political instability, economic mismanagement, hyperinflation, and international isolation have left the country grappling with widespread poverty, high unemployment, and a deepening financial crisis. As traditional opportunities dry up and hardship intensifies, a new phenomenon is capturing the attention, and concern, of officials and citizens alike: a boom in illegal online gambling.\n\nWith growing desperation and few avenues for income, many Zimbabweans are turning to unregulated digital betting platforms in hopes of quick financial relief. This surge has caught the attention of the Lotteries and Gaming Board, which recently warned parliament about the rapid rise of these activities and the challenges in curbing them. From a lack of enforcement capacity to the borderless nature of the internet, authorities are struggling to keep up.\n\nWhen the economy tanks, people look for an escape; any kind of mental breather from the daily grind of survival. In Zimbabwe, where inflation continues to skyrocket and formal employment opportunities are drying up, that escape is increasingly being found in the glow of a smartphone screen. Online gambling has exploded in popularity, not just as a form of entertainment, but as a desperate attempt to flip small data bundles into big wins. Platforms offering easy access and low barriers to entry have become digital havens, especially for young Zimbabweans trying to cope with rising costs of living and financial uncertainty.\n\nOne of the key draws? Promos like thelatest no deposit bonus codes, which allow users to play without risking their own money upfront. These offers are hugely appealing in a country where every dollar is stretched thin. For many, its not about reckless betting, its about chasing the slimmest chance of relief, even if its only temporary.\n\nZimbabweseconomic crisisdidnt emerge out of nowhere. The country once had strong agriculture, manufacturing, and mining sectors, making its economy one of the most productive in Africa.\n\nBy the 1970s, its manufacturing output was second only to South Africa in the region. However, this prosperity was built on a system that primarily benefited a small white minority, while Black Zimbabweans were largely excluded from business ownership and access to financial resources.\n\nAfter gaining independence in 1980, the new government aimed to create a more inclusive economy. Still, the country remained overly dependent on agriculture and lacked a robust industrial foundation. Over time, a series of poor economic decisions, most notably, controversial land seizures in the early 2000s, triggered a sharp decline in food production and foreign investment. Inflation spiraled out of control, jobs vanished, and public services deteriorated.\n\nWidespread corruption and weak governance worsened the situation. Many skilled professionals emigrated, while those who stayed were often forced into informal work to survive. As a result, Zimbabwes formal economy has largely been replaced by street vending, small-scale trading, and other informal activities that offer limited security and little potential for long-term growth.\n\nToday, Zimbabwe is still struggling to recover. While the government has made efforts to attract investors and stabilize the economy, progress remains slow. As a result, more people are turning to gambling as a way to cope with financial stress and limited opportunities. With rising living costs and shrinking job prospects, the lure of quick money has become increasingly appealing.\n\nFor many, gambling offers a perceived lifeline, a chance to improve their lives, despite the slim odds of a substantial payout. For others, it serves as a temporary escape from the anxiety and hardship of daily life, providing a brief sense of relief in an otherwise bleak economic landscape. Moreover, gambling is no longer confined to physical locations. Online casinos have made it accessible 24/7, allowing people to place bets at any time. This convenience, however, comes with risk. In communities where poverty is widespread, gambling is becoming normalized. When opportunities are scarce, it can feel like one of the only ways to get ahead, even if it rarely leads to real improvement.\n\nGambling can be enjoyable for some, but it becomes dangerous when the excitement of winning turns into an addiction. What starts as casual play can quickly spiral into a harmful cycle of chasing losses, leading to serious financial, emotional, and mental health issues.\n\nIn economically strained countries like Zimbabwe, gambling has become normalised in poorer communities, where limited opportunities fuel the belief that betting is a viable way out of poverty. The growing presence of illegal gambling platforms only worsens this. These unregulated sites target vulnerable users with easy mobile access and false promises, offering no consumer protection and exposing people to fraud and addiction.\n\nUnchecked, illegal gambling can widen inequality, overwhelm health systems, and trap individuals in a cycle of false hope. Tackling this issue requires stronger regulation, better enforcement, public education, and investment in more secure and sustainable economic options.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/25102326/Screenshot-2025-06-25-at-11.21.25.png",
            "description": "<p>Once seen as one of Africa’s most promising economies, Zimbabwe has undergone a dramatic and prolonged collapse. Decades of political instability, economic mismanagement, hyperinflation, and international isolation have left the country grappling with widespread poverty, high unemployment, and a deepening financial crisis. As traditional opportunities dry up and hardship intensifies, a new phenomenon is capturing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-economic-meltdown-sparks-online-gambling-craze/\">Zimbabwe’s Economic Meltdown Sparks Online Gambling Craze </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "25 Jun 2025"
        },
        {
            "title": "Man jailed 20 years for sexually abusing five-year-old",
            "url": "https://www.newzimbabwe.com/man-jailed-20-years-for-sexually-abusing-five-year-old/",
            "content": "By Staff Reporter\n\nA 19-year-old Guruve man has been slapped with a 20-year jail term following his conviction for sexually abusing a five-year-old neighbour on three occasions.\n\nProsecutors proved that the victim, a girl attending ECD B, was repeatedly targeted by the offender.\n\nOn the first occasion, it was proved that the victim went to play at the offenders homestead.\n\nWhile playing, the offender lifted her onto a stool and inserted his finger into her privates.\n\nThe childs cries for help caused him to stop, and he attempted to pacify her by lifting and carrying her, the court heard.\n\nOnce the victim had stopped crying, the offender again lowered her onto the stool and continued to caress her privates.\n\nHe only stopped when he heard the childs mother calling for her.\n\nThe minor did not disclose the abuse to her mother at that time.\n\nOn another occasion, the complainant was sent by her mother to collect tomatoes from the offenders home.\n\nShe found him alone, sitting on a stool.\n\nHe lifted her onto the stool, removed her underwear, and again caressed her privates before inserting his finger.\n\nHe only stopped when he saw the childs mother approaching, said the state.\n\nAgain, the child remained silent, fearing her mothers reaction.\n\nThe abuse came to light on the 12th of April, 2025, when the complainant, while attending a church conference, confided in her grandmother.\n\nThe grandmother then informed the childs mother.\n\nA police report was filed, leading to the offenders arrest.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/09/22055656/arrested-handcuffed-e1667358262642.jpeg",
            "description": "<p>By Staff Reporter A 19-year-old Guruve man has been slapped with a 20-year jail term following his conviction for sexually abusing a five-year-old neighbour on three occasions. Prosecutors proved that the victim, a girl attending ECD B, was repeatedly targeted by the offender. On the first occasion, it was proved that the victim went to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-jailed-20-years-for-sexually-abusing-five-year-old/\">Man jailed 20 years for sexually abusing five-year-old</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "25 Jun 2025"
        },
        {
            "title": "Pambili Natural Resources seeks to raise C$1-mln for Zim venture",
            "url": "https://www.newzimbabwe.com/pambili-natural-resources-seeks-to-raise-c1-mln-for-zim-venture/",
            "content": "By Alois Vinga\n\nPAMBILI Natural Resources Corporation seeks to raise C$1 million whose proceeds will be injected towards the Zimbabwe unit.\n\nThe firm said it intends to raise the funds through a non-brokered private offering of stake of up to 20 million units on the TSX Venture Exchange.\n\nAccordingly, each unit is offered atC$0.05and comprises one common share and one common share purchase warrant with an exercise price ofC$0.10, exercisable for a period of one year from closing of the Offering.\n\nPambili said it intends to pay a finders fee of 5% of the Proceeds in Units. Other than being non-transferable, each Finders Warrant shall otherwise be on the same terms as the Warrants. The Units will be offered pursuant to available prospectus exemptions set out under applicable securities laws and instruments, including National Instrument 45-106  Prospectus Exemptions.\n\nThe participation by Insiders in the Offering will constitute a related party transaction within the meaning of Multilateral Instrument 61 101 Protection of Minority Security Holders in Special Transactions (MI 61-101). The Company intends to rely on exemptions from the formal valuation and minority shareholder approval requirements provided under subsections 5.5(a) and 5.7(a) of MI 61-101 on the basis that participation in the Offering by Insiders will not exceed 25% of the fair market value of the Companys market capitalization.\n\nThe Proceeds will provide general working capital for business development and will be allocated to: Continued development of the CompanysGolden ValleyA1 mining claim (GVM) near Bulawayo,Zimbabwe\n\nCompletion of due diligence at theLondon Wall(LW) project near Gwanda,Zimbabwe. Pambili owns an option to purchase LW (the Option) as previously announced onNov. 19, 2024. The due diligence at LW is expected to lead to pilot production ahead of potential acquisition of LW.\n\nPambili CEO Jon Harris\n\nPambili CEO, Jon Harris expressed optimism over the potential within the LW project.\n\nGiven current gold prices and good historic project fundamentals, we are excited about the potential at the London Wall. This financing will allow us to rehabilitate the historic East Shaft and complete the survey of the old development drives. Our aim is to commence pilot production as soon as possible to enable us to assess the mines commercial viability, he said.\n\nPambili Natural Resources Corporationis a natural resources exploration and development company currently developing gold projects inZimbabwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/25050239/pambili.jpg",
            "description": "<p>By Alois Vinga PAMBILI Natural Resources Corporation seeks to raise C$1 million whose proceeds will be injected towards the Zimbabwe unit. The firm said it intends to raise the funds through a non-brokered private offering of stake of up to 20 million units on the TSX Venture Exchange. Accordingly, each unit is offered at C$0.05 and comprises</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pambili-natural-resources-seeks-to-raise-c1-mln-for-zim-venture/\">Pambili Natural Resources seeks to raise C$1-mln for Zim venture</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "25 Jun 2025"
        }
    ]
}