{
    "news": [
        {
            "title": "‘An iconic figure in the struggle for democracy’ – Zimbabwean opposition mourns Raila Odinga",
            "url": "https://www.newzimbabwe.com/an-iconic-figure-in-the-struggle-for-democracy-zimbabwean-opposition-mourns-raila-odinga/",
            "content": "By Staff Reporter\n\nZimbabwes opposition has joined the rest of Africa in mourning the death of Kenyas former Prime Minister, Raila Odinga, describing him as an iconic figure in Africas pro-democracy movement.\n\nOdinga, a longtime ally of late MDC leader Morgan Tsvangirai, died Wednesday in India, where he was receiving medical treatment.\n\nThroughout his political career, Odinga stood in solidarity with Zimbabwes democratic struggle, often calling out the late President Robert Mugabe over his governments human rights record.\n\nPosting on his social media accounts, opposition leader Nelson Chamisa hailed Odinga as a towering figure in Africas fight for freedom and justice.\n\nSaddened to receive the tragic news of the passing of Mzee Raila Odinga this early morning. As many will remember, he was one of the iconic figures in the struggle for democracy and freedom in the fight for a better Africa, said Chamisa.\n\nCitizens Coalition for Change (CCC) Member of Parliament Gladys Hlatywayo described Odinga as a giant of African politics.\n\nSad news from Kenya. Former Prime Minister of Kenya Raila Odinga is nomore! My heartfelt condolences to his wife and the Odinga Family, the @TheODMparty and the people of Kenya. Africa has lost a giant in the fight for democracy. We thank you for the consciousness Baba, said Hlatywayo.\n\nHarare Mayor Jacob Mafume also paid tribute, praising Odingas leadership and selflessness.\n\nRaila Odinga is a hero in many respects. Whatever happened, he always led for the people and from the people. We got inspiration from his journey and courage. Loved his country and his people, always willing to compromise for the greater good.\n\nOdingas death has prompted an outpouring of grief across Africa, with political leaders and citizens alike celebrating his decades-long contribution to democracy and social justice.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/08/07054856/Raila-Odinga-and-Nelson-Chamisa.jpeg",
            "description": "<p>By Staff Reporter Zimbabwe’s opposition has joined the rest of Africa in mourning the death of Kenya’s former Prime Minister, Raila Odinga, describing him as an iconic figure in Africa’s pro-democracy movement. Odinga, a longtime ally of late MDC leader Morgan Tsvangirai, died Wednesday in India, where he was receiving medical treatment. Throughout his political</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/an-iconic-figure-in-the-struggle-for-democracy-zimbabwean-opposition-mourns-raila-odinga/\">‘An iconic figure in the struggle for democracy’ – Zimbabwean opposition mourns Raila Odinga</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:35",
            "date": "15 Oct 2025"
        },
        {
            "title": "Raila Odinga, who made five runs at Kenya Presidency, dies at 80",
            "url": "https://www.newzimbabwe.com/raila-odinga-who-made-five-runs-at-kenya-presidency-dies-at-80/",
            "content": "Bloomberg\n\nRaila Odinga, who was at the forefront of Kenyan politics for more than three decades and made five unsuccessful runs at the presidency, alleging that he was cheated of victory in every instance, has died. He was 80.\n\nOdinga passed away in India after suffering a heart attack, the Nairobi-based Star newspaper and other Kenyan media outlets reported.\n\nOdinga was the son of Jaramogi Oginga Odinga, who served as Kenyas first vice president in Jomo Kenyattas administration. Considered political royalty in the East African nation, he was wildly popular among his supporters who heeded his calls en masse to demonstrate when he complained about vote rigging.\n\nThe electoral disputes repeatedly triggered ethnic tensions and violence, most notably in 2008, when more than 1,100 people died and about 350,000 were forced to flee their homes. The United Nations and then-South African leader Thabo Mbeki mediated a truce that saw Odinga being appointed prime minister in a coalition government led by President Mwai Kibaki.\n\nOdinga narrowly lost his fifth bid for the presidency to William Ruto in 2022. While the nations highest court upheld the election outcome, Odinga said he had proof the results had been tampered with and called a series of protests against the outcome and rising living costs. Dozens of people died in the ensuing unrest.\n\nThe two men later agreed to work together and members of Odingas party were appointed to the cabinet and other government posts.\n\nRaila Amolo Odinga was born on Jan. 7, 1945, in the western Kenyan town of Maseno. Prior to going into politics, he studied engineering in Germany, lectured at the University of Nairobi and co-founded his own firm.\n\nHe was arrested in 1982 after being accused of participating in an attempted coup led by air force officers to oust President Daniel Arap Moi. He spent six years in prison without trial and was detained twice subsequent to his release. His final incarceration ended in 1991, the year Kenyas constitution was amended to allow multiparty politics.\n\nOdinga helped found the Forum for the Restoration of Democracy and was selected as a lawmaker for the Langata constituency in the capital, Nairobi, in the 1992 election.\n\nHe first stood for the presidency in 1997 as the National Development Partys candidate. Four years later, he merged his party with Mois Kenya African National Union, was elected as its secretary-general and appointed energy minister.\n\nOdinga parted ways with Kanu in 2002, after Moi backed Uhuru Kenyatta to succeed him as party leader, and teamed up with Kibaki, who had mounted a third presidential campaign. Their coalition, the National Rainbow Alliance, won the vote, ending almost four decades of uninterrupted Kanu rule.\n\nKibaki named Odinga as his minister of roads and public works, but the two fell out in 2004 when Odinga accused the president of reneging on a power-sharing deal.\n\nThe Orange Democratic Movement nominated Odinga as its presidential candidate in 2007. It won 99 parliamentary seats, while Kibakis Party of National Unity won just 43. Even so, the official results showed Kibaki won the presidential vote  an outcome that was tainted by allegations of rigging.\n\nThe widespread violence that ensued prevented Odinga from taking power and he had to settle for the post of prime minister, which he held for five years.\n\nOdinga lost the presidential vote to Uhuru Kenyatta in 2013 and again in 2017. The Supreme Court annulled the outcome of the latter contest, citing widespread irregularities. Odinga then boycotted the re-run, saying the conditions werent in place for a fair contest.\n\nThe two men later reconciled and Kenyatta backed Odingas 2022 presidential run, reneging on an undertaking to support Ruto, his then-deputy. Ruto prevailed in the first round, however, and the result stood despite the oppositions legal challenges and protests.\n\nIn February 2025, Odinga stood for election as head of the African Unions executive arm, but lost the contest to Mahamoud Ali Youssouf from Djibouti.\n\nOdinga married his wife Ida in 1973. They had four children.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/16220105/Raila-Odinga.jpeg",
            "description": "<p>Bloomberg Raila Odinga, who was at the forefront of Kenyan politics for more than three decades and made five unsuccessful runs at the presidency, alleging that he was cheated of victory in every instance, has died. He was 80. Odinga passed away in India after suffering a heart attack, the Nairobi-based Star newspaper and other</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/raila-odinga-who-made-five-runs-at-kenya-presidency-dies-at-80/\">Raila Odinga, who made five runs at Kenya Presidency, dies at 80</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:35",
            "date": "15 Oct 2025"
        },
        {
            "title": "Madagascar military says it has seized power as president moves to ‘safe place’",
            "url": "https://www.newzimbabwe.com/madagascar-military-says-it-has-seized-power-as-president-moves-to-safe-place/",
            "content": "BBC\n\nAn elite military unit says it has seized power in Madagascar from President Andry Rajoelina following weeks of youth-led protests in the Indian Ocean island.\n\nStanding outside the presidential palace on Tuesday, CAPSAT chief Col Michael Randrianirina said the military would form a government and hold elections within two years. He also suspended key democratic institutions, like the electoral commission.\n\nGen Z protesters will be part of the changes because the movement was created in the streets so we have to respect their demands, he added.\n\nTroops and protesters have been celebrating the apparent ousting of President Rajoelina, with thousands waving flags in the capital, Antananarivo.\n\nCAPSAT, or the Personnel Administration and Technical and Administrative Services Corps, is the most powerful military unit in Madagascar.\n\nThe unit supported Rajoelina when he came into power in 2009, but joined the protesters on Saturday.\n\nMadagascars constitutional court has named Col Randrianirina as the countrys new leader, even though a statement from the presidents office said he was still in charge and denounced what it described as an attempted coup detat.\n\nRajoelinas whereabouts are unknown, but he has said he is sheltering in a safe place following an alleged attempt on his life by military personnel and politicians. CAPSAT has denied any involvement in any such move.\n\nThere have been unconfirmed reports that the president was flown out of the country on a French military aircraft.\n\nAlso on Tuesday the US state department urged all sides to pursue a peaceful solution in line with the constitutional order.\n\nCol Randrianirina told the BBC that Madagascar was a country where chaos reigns right now.\n\nChaos because theres no president  hes gone abroad.\n\nThe unrest began just over two weeks ago, after a youth-led movement beganprotesting against chronic water and power cuts across the country.\n\nThe demonstrations soon escalated, to reflect wider dissatisfaction with Rajoelinas government over high unemployment, rampant corruption and the cost-of-living crisis.\n\nProtestors clashed with security forces resulting in the death of at least 22 people and more than 100 others injured, according to the UN, although the Malagasy government has dismissed those figures and described them as based on rumours and misinformation.\n\nPresident Rajoelina, an entrepreneur and former DJ, was once seen as a fresh start for Madagascar.\n\nThe baby-faced leader became president when he was just 34, earning the title of Africas youngest leader, and going on to govern for four years, before returning to power after the 2018 election.\n\nBut he fell out of favour following allegations of cronyism and corruption, which he denied.\n\nDespite the fact that power appears to have shifted away from him, he has continued to try to influence events.\n\nRajoelina attempted to dissolve the national assembly before the opposition could vote to strip him of his presidency for abandonment of post, but that did not work.\n\nLawmakers voted to impeach Rajoelina by 130 votes to one blank ballot on Tuesday. Even members of his party, Irmar, voted overwhelmingly to impeach him.\n\nRajoelina rejected the vote, calling it null and void.\n\nThe African Union (AU) has warned against soldiers meddling in Madagascars political affairs and rejected any attempt at unconstitutional changes of government.\n\nFrench President Emmanuel Macron called the situation greatly worrying.\n\nThe island has gone through a series of political upheavals in recent years.\n\nMadagascar is one of the poorest countries in the world, with 75% of its 30 million people living below the poverty line, according to the World Bank.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/15064752/madagascar-military.webp",
            "description": "<p>BBC An elite military unit says it has seized power in Madagascar from President Andry Rajoelina following weeks of youth-led protests in the Indian Ocean island. Standing outside the presidential palace on Tuesday, CAPSAT chief Col Michael Randrianirina said the military would form a government and hold elections within two years. He also suspended key</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/madagascar-military-says-it-has-seized-power-as-president-moves-to-safe-place/\">Madagascar military says it has seized power as president moves to ‘safe place’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:35",
            "date": "15 Oct 2025"
        },
        {
            "title": "Court dismisses ex-cop’s bid to have Police Commissioner General jailed",
            "url": "https://www.newzimbabwe.com/court-dismisses-ex-cops-bid-to-have-police-commissioner-general-jailed/",
            "content": "By Mary Taruvinga\n\nThe High Court has dismissed a contempt of court application filed by former police officer Tatenda Shiri, who sought to have top police officials, including Commissioner-General Stephen Mutamba, jailed for allegedly defying a reinstatement order.\n\nJustice Fatima Maxwell sitting at the Harare High Court ruled that Shiris application was without merit, finding that the police bosses could not be held in contempt because they lacked the authority to reinstate him, and because the order he relied on was under legal challenge.\n\nFirst and second respondents do not have the authority to reinstate the applicant. They cannot be committed to civil imprisonment for failing to do an act which is beyond their mandates, said the judge.\n\nShiri, who once served under the Zimbabwe Republic Police (ZRP), had been discharged after being convicted of violating the Police Act [Chapter 11:10].\n\nHe appealed his dismissal, arguing he was never given a fair hearing, and later won a default court order reinstating him to the force without loss of salary and benefits.\n\nHowever, despite the court order, the ZRP and the Police Service Commission allegedly failed to act, prompting Shiri to file for contempt, accusing the police leadership of being in wilful and mala fide defiance of a lawful order.\n\nThrough his lawyer Mugiya, Shiri argued that civil contempt is the wilful and mala fide refusal or failure to comply with a court order, insisting that the respondents were deliberately ignoring the judgment.\n\nBut the police, represented by F. Chimunoko from the Attorney Generals Office, opposed the bid, saidthe reinstatement order was a default judgment and had since been challenged through an application for rescission.\n\nIt is ill-advised for the applicant to seek to enforce an order which is being challenged, the police argued, warning that executing the order would impede justice if it is successfully rescinded.\n\nMaxwell agreed, noting that the pending rescission proceedings meant the police could not be said to have acted in bad faith.\n\nThe existence of a court case challenging the very order they are alleged to be in contempt of removes the mala fides. If their application for rescission fails and they still do not comply, then the respondents would indeed be acting wilfully and mala fide, he ruled.\n\nThe judge further said the contempt application was procedurally defective, as Shiri had failed to personally serve the respondents as required by law.\n\nShiri, who was dismissed following disciplinary proceedings within the police force, has been fighting to regain his job since last year.\n\nHis reinstatement order  granted in HCH 1269/24  remains suspended pending the outcome of the rescission applications filed by the ZRP and the Police Service Commission.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/22180446/Stephen-Mutamba.jpg",
            "description": "<p>By Mary Taruvinga The High Court has dismissed a contempt of court application filed by former police officer Tatenda Shiri, who sought to have top police officials, including Commissioner-General Stephen Mutamba, jailed for allegedly defying a reinstatement order. Justice Fatima Maxwell sitting at the Harare High Court ruled that Shiri’s application was “without merit,” finding</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/court-dismisses-ex-cops-bid-to-have-police-commissioner-general-jailed/\">Court dismisses ex-cop’s bid to have Police Commissioner General jailed</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:35",
            "date": "15 Oct 2025"
        },
        {
            "title": "Opposition calls for forensic audit after leak of US$3.2billion corruption dossier",
            "url": "https://www.newzimbabwe.com/opposition-calls-for-forensic-audit-after-leak-of-us3-2billion-corruption-dossier/",
            "content": "By Costa Nkomo\n\nCitizens Coalition for Change interim leader Jameson Timba has called for a forensic audit following the leak of a corruption dossier alleging that over US$3.2 billion has been looted by controversial business tycoons in Zimbabwe.\n\nThe dossier is believed to be the same document that Vice President Rtd Constantino Chiwenga presented at a recent Zanu-PF Politburo meeting in Harare.\n\nIt implicates controversial tenderpreneur Wicknell Chivayo, Kudakwashe Tagwirei, Delish Nguwaya, Scotland FC owner Pedzai Sakupwanya, and Paul Tungwarara. The document purportedly establishes how these cartels siphon cash from state coffers through fraud and corruption.\n\nIn a statement released Tuesday, Timba called for thorough forensic investigations into government contracts.\n\nAccordingly, I call for: An independent forensic audit of all public contracts linked to the named individuals. Full public accountability for the looting and abuse of state resources, Timba stated.\n\nTimbas call for forensic investigations follows Bikita South MP and then Chairperson of the Budget and Finance Parliamentary Portfolio Committee, Energy Mutodisallegations that Finance Ministry Permanent Secretary George Guvamatanga is demanding bribes worth millions of United States dollars from various government contractors, threatening to withhold payments if his demands are not met.\n\nMutodi further demanded that Parliament summon George Guvamatanga to clear his name, but later retracted his statements.\n\nTimba called for the immediate abandonment of the Agenda 2030, where President Emmerson Mnangagwas loyalists are pushing for him to remain in power until 2030.\n\nMnangagwa has repeatedly declined this offer and insisted he will leave office at the end of his term in 2028.\n\nTimba warned that this notion must be quashed without delay.\n\nAt the same time, the so-called 2030 Agenda to extend the Presidents term must be abandoned in its entirety. Any attempt to alter presidential term limits without a referendum is unconstitutional and illegitimate, he said.\n\nTimba argued that a government mired in corruption forfeits any right to request an extension of its term.\n\nA government under such clouds of corruption cannot seek more years in power. It must instead submit itself to the Constitution and the people.\n\nHe continued, This fight is not merely about term limits; it is about defending our Republic from state capture disguised as stability  and about reaffirming that in Zimbabwe, no one is above the law. Let those who hold power remember: the Constitution was written to protect the people, not to shield the powerful.\n\nAccording to government figures, Zimbabwe is losing US$2 billion annually due to corruption and illicit financial dealings.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/07/03042205/Jameson-Timba.jpg",
            "description": "<p>By Costa Nkomo Citizens Coalition for Change interim leader Jameson Timba has called for a forensic audit following the leak of a corruption dossier alleging that over US$3.2 billion has been looted by controversial business tycoons in Zimbabwe. The dossier is believed to be the same document that Vice President Rtd Constantino Chiwenga presented at</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/opposition-calls-for-forensic-audit-after-leak-of-us3-2billion-corruption-dossier/\">Opposition calls for forensic audit after leak of US$3.2billion corruption dossier</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:35",
            "date": "15 Oct 2025"
        },
        {
            "title": "Supreme Court upholds dismissal of ZIMRA officer fired for emailing pornographic content",
            "url": "https://www.newzimbabwe.com/supreme-court-upholds-dismissal-of-zimra-officer-fired-for-emailing-pornographic-content/",
            "content": "By Mary Taruvinga\n\nThe Supreme Court has upheld the dismissal of Zimbabwe Revenue Authority (ZIMRA) officer Stanford Sithole, who was fired for distributing pornographic material through his official work email, ending a legal battle that has dragged on for nearly a decade.\n\nIn a ruling delivered on October 7, 2025, Justice Alphius Chitakunye said the decision underscored the critical importance of maintaining professional standards in the workplace, reaffirming the courts stance on integrity within public institutions.\n\nSithole, stationed in Gweru, was dismissed in 2016 after an internal ZIMRA probe revealed he had sent 13 explicit emails from his work account, a clear breach of the authoritys IT policy, which bans misuse of company assets.\n\nA designated agent initially cleared him, citing insufficient evidence, a decision later upheld by the Labour Court, which noted the possibility of hacking.\n\nBut the Supreme Court overturned that finding, ruling that the burden was on Sithole to prove his account had been compromised.\n\nWhile hacking is difficult, it is not impossible. However, the evidence presented sufficiently pointed to the respondents responsibility for the emails in question, the court said.\n\nZIMRAs IT manager, Mazhindu, testified that investigators used secure forensic tools to trace the emails, explaining the system was difficult to alter or compromise.\n\nSithole had argued he was a victim of a management conspiracy over his involvement in a workers committee. But the judges dismissed that claim, stating, Allegations of bias must be backed by convincing evidence, not mere assertions.\n\nHe also suggested the emails could have been sent by others sharing his workstation. The court rejected that, noting ZIMRAs system required individual credentials for access, which Sithole admitted he had not shared.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/07024130/Supreme-Court.png",
            "description": "<p>By Mary Taruvinga The Supreme Court has upheld the dismissal of Zimbabwe Revenue Authority (ZIMRA) officer Stanford Sithole, who was fired for distributing pornographic material through his official work email, ending a legal battle that has dragged on for nearly a decade. In a ruling delivered on October 7, 2025, Justice Alphius Chitakunye said the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/supreme-court-upholds-dismissal-of-zimra-officer-fired-for-emailing-pornographic-content/\">Supreme Court upholds dismissal of ZIMRA officer fired for emailing pornographic content</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:35",
            "date": "15 Oct 2025"
        }
    ]
}