{
    "news": [
        {
            "title": "Striking UZ lecturers make fresh demands as students sit for exams",
            "url": "https://www.newzimbabwe.com/striking-uz-lecturers-make-fresh-demands-as-students-sit-for-exams/",
            "content": "By Darlington Gatsi\n\nSTRIKING lecturers have revised their demands, issuing an ultimatum to the University of Zimbabwe (UZ)to provide incentives to end their 70-day industrial action.\n\nThe lecturers have been on strike for three months, demanding an increase in their salaries. They are seeking wages of US$2,250, up from their current US$230.\n\nThe lecturers have refused to oversee ongoing examinations, instead picketing outside the university.\n\nThe Association of University Teachers (AUT) Obvious Vengeyi spokesperson stated that the revised demands give the government room to explore other avenues of addressing their grievances while negotiations for the US$2,250 continue.\n\nWe have put across our demand for salaries. We are demanding regional parity, which is the pre-October 2018 salary. We have added non-monetary incentives in case the government cannot provide the US$2,250 immediately.\n\nThis means we have also put in place a roadmap whereby, after every four months, we should be able to discuss a review so that within one year, we should reach regional parity. We have included non-monetary incentives, residential stands, commercial stands, and agricultural land. We have also added a demand for free education.\n\nLecturers here at the University of Zimbabwe were previously required to pay fees if they wished to further their education. We demand that all University of Zimbabwe employees be exempt from paying fees, said Vengeyi.\n\nWATCH | UZ lecturers strike continues, now on day 69\n\n\"Part-final students who are doing dissertations are now being told to bring whatever they have so they can be given marks,\" says AUT spokesperson Obvious Vengei.pic.twitter.com/KLg8rDO934\n\n NewZimbabwe.com (@NewZimbabweCom)June 23, 2025\n\nThe UZ has responded to the strike by suspending the lecturers and replacing them with temporary teachers to oversee examinations.\n\nThe government recently offered a 20 percent increase, a move rejected by the AUT.\n\nThe UZ has not made any response. They have not made any offer, which is why todays picketing emphasised the need for, and demand of, an offer from UZ.\n\nThe Ministry of Higher and Tertiary Education has made an offer of 20% across the board and 35% to the Vice-Chancellor, the very people responsible for this mess have been rewarded, which is quite unfair.\n\nSo, we have put forward our counter-demand in response to the ministrys offer. First and foremost, we reject this 20% as meaningless because if you give someone 20% of US$230, that is essentially nothing, said Vengeyi.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/28030530/UZ-strike-10-scaled-e1748490385375.jpg",
            "description": "<p>By Darlington Gatsi STRIKING lecturers have revised their demands, issuing an ultimatum to the University of Zimbabwe (UZ) to provide incentives to end their 70-day industrial action. The lecturers have been on strike for three months, demanding an increase in their salaries. They are seeking wages of US$2,250, up from their current US$230. The lecturers have</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/striking-uz-lecturers-make-fresh-demands-as-students-sit-for-exams/\">Striking UZ lecturers make fresh demands as students sit for exams </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:35",
            "date": "24 Jun 2025"
        },
        {
            "title": "IOC is in ‘best of hands’, says Bach as he hands over to Zimbabwe’s Coventry",
            "url": "https://www.newzimbabwe.com/ioc-is-in-best-of-hands-says-bach-as-he-hands-over-to-zimbabwes-coventry/",
            "content": "AFP\n\nKirsty Coventrybecamethe president of the International Olympic Committee (IOC), the most powerful person in sport, on Monday in a handover ceremony with her predecessor Thomas Bach.\n\nThe Zimbabwean is the first woman and African to head the body, and at 41, the youngest since Baron Pierre de Coubertin, who is credited with founding the modern-day Olympics.\n\nCoventry accepted the Olympic key from Bach, who like her, is an Olympic champion, winning a team fencing gold in 1976, and earning two swimming golds in 2004 and 2008.\n\nStepping down after a turbulent 12-yeartenure, Bach expressed his confidence that the Olympic movement was in the best of hands and Coventry would bring conviction, integrity and a dynamic perspective to the role.\n\nCoventry, who swept to a crushing first-round victory in the election in Greece in March, leans heavily on her family.\n\nAside from her parents, who were present at the ceremony in Lausanne, there is her husband Tyrone Seward, who was effectively her campaign manager, and two daughters, six-year-old Ella, who Bach addresses as princess, and Lily, just seven months old.\n\nElla saw this spider web in the garden and I pointed out how it is made, and how strong and resilient it is to bad weather and little critters, said Coventry.\n\nBut if one little bit breaks, it becomes weaker. That spider web is our movement, it is complex, beautiful and strong, but it only works if we remain together and united.\n\nCoventry said she could not believe how her life had evolved since she first dreamt of Olympic glory in 1992.\n\nHow lucky are we creating a platform for generations to come to reach their dreams, she said to a packed audience in a marquee in the Olympic House garden, which comprised IOC members, including those she defeated, and dignitaries.\n\nIt is amazing and incredible, indeed I cannot believe that from my dream in 1992 of going to the Olympic Games and winning a medal, I would be standing here with you to make dreams for more young children round the world.\n\nCoventry, who served in the Zimbabwean government as sports and arts minister from 2019 to this year, said the Olympic movement was much more than a multi-sport event platform.\n\nWe (IOC members) are guardians of this movement, which is also about inspiring and changing lives and bringing hope, she said.\n\nThese things are not to be taken lightly, and I will be working with each and every one of you to continue to change lives and be a beacon of hope in a divided world.\n\nI am really honoured to walk this journey with you.\n\nBach, who during his tenure had to grapple withRussian dopingand their invasions of the Crimea andUkraineas well as theCovid pandemic, said he was standing down filled with gratitude, joy and confidence in his successor.\n\nWith her election, it sends out a powerful message that the IOC continues to evolve, said the 71-year-old German, who was named honorary lifetime president in Greece in March.\n\nIt has its first female and African to hold this position, and the youngest president since Pierre de Coubertin. She represents the truly global and youthful spirit of our community.\n\nBach, who choked back tears at one point during his valedictory speech, was praised to the rafters by Coventry, who was widely seen as his preferred candidate of the seven vying for his post.\n\nAfter a warm embrace, she credited him with teaching her to listen to people and to respect them, and praised him for leading the movement with pure passion and purpose.\n\nYou have kept us united through the most turbulent times.\n\nYou left us with many legacies and hope, thank you from the bottom of my heart for leading us with passion and never wavering from our values.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/23214130/ioc-bach-kirsty.jpg",
            "description": "<p>AFP Kirsty Coventry became the president of the International Olympic Committee (IOC), the most powerful person in sport, on Monday in a handover ceremony with her predecessor Thomas Bach. The Zimbabwean is the first woman and African to head the body, and at 41, the youngest since Baron Pierre de Coubertin, who is credited with founding</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ioc-is-in-best-of-hands-says-bach-as-he-hands-over-to-zimbabwes-coventry/\">IOC is in ‘best of hands’, says Bach as he hands over to Zimbabwe’s Coventry</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:35",
            "date": "24 Jun 2025"
        },
        {
            "title": "Nadia Nakai not returning for season 4 of Netflix’s Young, Famous and African?",
            "url": "https://www.newzimbabwe.com/nadia-nakai-not-returning-for-season-4-of-netflixs-young-famous-and-african/",
            "content": "By Tapiwa Svondo\n\nRAPPER Nadai Nakai has hinted that she has not been recast and will not be returning for the fourth season of Netflix hit reality series Young, Famous and African.\n\nNadia who has been part of the show since it hit screens in 2022 revealed this in a Tik Tok video.\n\nBragga posted a video mouthing that was rude, captioned when YFA didnt ask you to come back for the new season because they would rather have drama than realness.\n\nThe reality series shot in Johannesburg, South African features African celebrities such as Zari, Diamond Platinumz, Naked DJ, Khanyi Mbau, Swanky Jerry and Annie Macaulay.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/20062705/Nadia-Nakai-opens-up-about-her-new-reality-show-Picture-X.webp",
            "description": "<p>By Tapiwa Svondo RAPPER Nadai Nakai has hinted that she has not been recast and will not be returning for the fourth season of Netflix hit reality series Young, Famous and African. Nadia who has been part of the show since it hit screens in 2022 revealed this in a Tik Tok video. Bragga posted</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nadia-nakai-not-returning-for-season-4-of-netflixs-young-famous-and-african/\">Nadia Nakai not returning for season 4 of Netflix’s Young, Famous and African?</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:35",
            "date": "24 Jun 2025"
        },
        {
            "title": "317 malaria deaths recorded during 2025 peak season",
            "url": "https://www.newzimbabwe.com/317-malaria-deaths-recorded-during-2025-peak-season/",
            "content": "By Mary Taruvinga\n\nZimbabwe recorded a surge in malaria deaths, killing 317 during the 2025 peak malaria transmission season compared to the same period last year, according to the Health Ministry.\n\nLast year, 51 died during the same period, which is from week one to week 23 of 2025.\n\nThe health ministry attributed the rise to increased rainfall amounts received this year.\n\nFrom week 1 to week 23 of 2025, the country recorded 126 cumulative malaria outbreaks, of which 121 have been successfully controlled, while five remain active.\n\nThe decline in cases is attributed to the end of the rainy season and the onset of winter, which limits mosquito breeding due to lower temperatures and drier conditions.\n\nHowever, the surge in outbreaks earlier in the year was fuelled by increased rainfall, fluctuating temperatures, and a rise in outdoor economic activities-such as artisanal mining, tobacco curing, market gardening, and cross-border trading that heightened exposure to mosquito bites.\n\nAs a result, cumulative malaria cases increased from 29,085 in 2024 to 111,998 in 2025. Malaria-related deaths also surged from 51 in 2024 to 317 in 2025. The increase in deaths is largely due to delays in accessing treatment, as many cases occurred in remote locations far from health facilities.\n\nAccording to the Ministry of Health, the majority of these were concentrated in just three provinces.\n\nHarare reported 685 cases and Bulawayo reported 67 cases, mainly due to complicated or referred cases.\n\nMalaria also continues to disproportionately affect rural communities in Mashonaland Central, Manicaland, and Mashonaland West.\n\nMeanwhile, government has urged all citizens, especially those in high-risk zones as well as artisanal miners, to take preventive measures such as wearing clothing that covers most of your body when outdoors between sunset and sunrise, use mosquito repellents, sleep in sprayed rooms in districts that receive Indoor Residual Spraying and sleep under an Insecticide Treated Net (ITN) every day. Seek treatment within 24 hours from the Village Health Worker or from the nearest health facility, to prevent progression to severe disease that can lead to death.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/04/23184924/Malaria-mosquito.jpg",
            "description": "<p>By Mary Taruvinga Zimbabwe recorded a surge in malaria deaths, killing 317 during the 2025 peak malaria transmission season compared to the same period last year, according to the Health Ministry. Last year, 51 died during the same period, which is from week one to week 23 of 2025. The health ministry attributed the rise</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/317-malaria-deaths-recorded-during-2025-peak-season/\">317 malaria deaths recorded during 2025 peak season</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:35",
            "date": "24 Jun 2025"
        },
        {
            "title": "African Sun says no going back on asset disposal",
            "url": "https://www.newzimbabwe.com/african-sun-says-no-going-back-on-asset-disposal/",
            "content": "By Alois Vinga\n\nLEADING hospitality group, African Sun Limited (ASL), says the ongoing disposal of non-core assets will unlock potential to rejuvenate activity in high-performing units.\n\nPresenting the 2024 annual report, ASL chief executive officer, Laurie Ward, said there is no going back with the disposal of giant outfits which are not reaping much.\n\nThe Groups strategy is centred on optimising our portfolio by focusing on a smaller, more profitable selection of hotels that prioritise quality and guest experiences. This vision will continue to gain momentum in 2025. Our approach involves divesting of non-core assets and concentrating resources on high-performing properties in prime locations, he said.\n\nBy streamlining operations and enhancing service standards, Laurie said the company aims to deliver consistent experiences that align with evolving guest expectations prompted by the strategy to allow for greater investment in innovative technologies and sustainability initiatives.\n\nIn keeping with this thrust, the Group has sold the Great Zimbabwe Hotel and earmarked Monomotapa Hotel and Caribbea Bay Resort for sale. These disposals will allow for the prioritisation of the refurbishment of the remaining properties within the portfolio, as well as allocating funds for the development of phase 2 of the Marlborough Sunset Views residential stands, said Ward.\n\nThe Hotels top three performers for the 2024 financial year were Elephant Hills Resort and Conference Centre, Holiday Inn Harare and Holiday Inn Bulawayo. These contributed 54% to the Groups total revenue for the year.\n\nThe hospitality portfolio achieved a combined annual occupancy of 59% for the period under review, a 7% improvement from the 55% achieved in 2023. This equated to almost 15,854 additional room nights sold during 2024.\n\nThe three branded InterContinental Hotels Group (IHG) hotels, namely, Holiday Inn Harare, Holiday Inn Bulawayo, and Holiday Inn Mutare, continue to meet all the requirements of the IHG brand standards, having all passed compliance audits in 2024. Additionally, the lease of both the Holiday Inn Harare and Holiday Inn Bulawayo properties were extended for a further 20-year period, added Ward.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/29192711/caribbea-bay.jpg",
            "description": "<p>By Alois Vinga LEADING hospitality group, African Sun Limited (ASL), says the ongoing disposal of non-core assets will unlock potential to rejuvenate activity in high-performing units. Presenting the 2024 annual report, ASL chief executive officer, Laurie Ward, said there is no going back with the disposal of giant outfits which are not reaping much. “The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/african-sun-says-no-going-back-on-asset-disposal/\">African Sun says no going back on asset disposal </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:35",
            "date": "24 Jun 2025"
        },
        {
            "title": "The truth behind Rovos Rail’s collision in Zimbabwe",
            "url": "https://www.newzimbabwe.com/the-truth-behind-rovos-rails-collision-in-zimbabwe/",
            "content": "Cape Town Etc\n\nThe luxury rail industry across Southern Africa held its breath earlier this year when a Rovos Rail train carrying 47 foreign tourists and 34 staff members collided with a freight train on the Bulawayo-Beitbridge line.\n\nNow, after months of investigation and reflection, the companys Chief Operating Officer Tiffany Vos-Thane has broken her silence about what went wrong that fateful morning,Cape {town} Etcreports.\n\nThis incident marked the first major accident in Rovos Rails 20 years of operation along this route, shaking confidence in Africas luxury rail sector.\n\nThe collision derailed several carriages during the Easter holiday journey to Victoria Falls, tragically claiming the life of one staff member weeks later due to medical complications.\n\nWhile no passengers were physically injured, the psychological impact on both guests and crew has been profound, with the company arranging ongoing trauma counselling for affected employees.\n\nAccording toVos-Thane, while final reports are still being compiled, preliminary findings point squarely to a tragic miscalculation by Bulawayo Beitbridge Railway (BBR) operators.\n\nSomebody made a mistake with the timing, which is just so unfortunate, Vos-Thane revealed in an emotional interview. This is particularly devastating considering we use this line twice weekly without incident. Losing a team member has left us grappling with difficult questions, though we must acknowledge this was an isolated failure in an otherwise reliable system.\n\nMeanwhile, the COO praised the extraordinary emergency response from Zimbabwean authorities, with medical teams and railway officials arriving within minutes. This rapid intervention likely prevented further casualties among the shaken passengers and crew.\n\nSurprisingly, the accident appears to have done little to dampen enthusiasm for Rovos Rails luxury experiences. The company reports receiving just one customer query about line safety since the incident, with demand remaining robust despite global economic uncertainties affecting the travel sector.\n\nA recent Tourism Update poll supports this resilience, with 73% of industry respondents affirming luxury travels enduring appeal. Vos-Thane attributes this to Southern Africas stringent rail safety regulations across all ten countries Rovos operates in, which require annual safety permits for all operators.\n\nAddressing concerns about regional rail infrastructure, the COO acknowledged challenges like loadshedding and cable theft causing delays, particularly on South Africas Pretoria-Cape Town route. However, she noted an 80% improvement in timings recently and expressed optimism about government moves toward rail privatisation.\n\nThe more private investment in our railways, the better the infrastructure becomes, Vos-Thane stated. While billions are needed for full rehabilitation, were seeing promising commitment from authorities.\n\nRather than expanding its fleet of 23 locomotives (including eight electric and four hybrids), Rovos Rail will focus on refurbishing existing carriages and elevating service standards. This quality-over-quantity approach aims to reinforce the brands premium positioning while implementing lessons from Aprils tragedy.\n\nThe company continues working closely with BBR to prevent future timing errors, though Vos-Thane stressed such incidents remain exceptionally rare in African luxury rail travel.\n\nFor now, the iconic trains keep rolling across the continents spectacular landscape, carrying travellers seeking unforgettable journeys through Southern Africas heart.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/23212619/rovos-rail.webp",
            "description": "<p>Cape Town Etc The luxury rail industry across Southern Africa held its breath earlier this year when a Rovos Rail train carrying 47 foreign tourists and 34 staff members collided with a freight train on the Bulawayo-Beitbridge line. Now, after months of investigation and reflection, the company’s Chief Operating Officer Tiffany Vos-Thane has broken her</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/the-truth-behind-rovos-rails-collision-in-zimbabwe/\">The truth behind Rovos Rail’s collision in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:35",
            "date": "24 Jun 2025"
        }
    ]
}