{
    "news": [
        {
            "title": "RBZ moves to rebrand ‘defiled’ ZWG notes",
            "url": "https://www.newzimbabwe.com/rbz-moves-to-rebrand-defiled-zwg-notes/",
            "content": "By Alois Vinga\n\nTHE Reserve Bank of Zimbabwe (RBZ) has unveiled plans to launch newly designed ZWG notes, effectively dumping the old defiled versions in a move set to trigger yet another wave of shock across the markets.\n\nIntroduced on April 5 2024, as the countrys lasting solution to currency problems, the ZWG has suffered major setbacks since its inception, including the 43% devaluation in September 2024, which left the local units gold-backed status in question.\n\nThe currency is still in short supply, with the rural economy having very limited access to the local unit despite being the most populous. Some regions have resorted to using the rand as a medium of exchange, especially for smaller denominations in transactions.\n\nIn the midst of another storm following the announcements that the country will adopt the ZWG as the sole currency in 2030, RBZ governor, Dr John Mushayavanhu, on Tuesday told a state-run publication that plans to launch a new version of ZWG notes were currently underway.\n\nThe Reserve Bank is working on the modernisation of the ZiG banknote series as advised in the recent mid-term Monetary Policy Statement. The new ZiG banknotes will be redesigned, including improved quality and durability for the convenience of the transacting public.\n\nIn this regard, the production process of the improved banknotes has progressed well and is at an advanced stage. The public will be advised of the expected roll-out at the appropriate time, he said.\n\nSceptics immediately took to social media platforms questioning the rationale behind the new designs, with many concluding it is a ploy to dump the failed first version.\n\nMarket watchers who anonymously spoke to our publication criticised the ghostly nature of RBZ announcements for creating more headaches than solutions.\n\nThey are of the view that the RBZ must accompany its policy announcements with finer details to avoid market speculation.\n\nOn his part, Mushayavanhu said the new notes must not be misconstrued as a new currency but just a normal routine in line with global best practices.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171606/mushayavanhu-zig-3.jpg",
            "description": "<p>By Alois Vinga THE Reserve Bank of Zimbabwe (RBZ) has unveiled plans to launch newly designed ZWG notes, effectively dumping the old ‘defiled’ versions in a move set to trigger yet another wave of shock across the markets. Introduced on April 5 2024, as the country’s lasting solution to currency problems, the ZWG has suffered</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rbz-moves-to-rebrand-defiled-zwg-notes/\">RBZ moves to rebrand ‘defiled’ ZWG notes</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "27 Aug 2025"
        },
        {
            "title": "Zimbabwe urges African nations to prioritise sustainable health financing as donor support declines",
            "url": "https://www.newzimbabwe.com/zimbabwe-urges-african-nations-to-prioritise-sustainable-health-financing-as-donor-support-declines/",
            "content": "By Thandiwe Garusa\n\nZIMBABWE has called on African nations to prioritise sustainable health financing following recent withdrawals of donor funding across the region.\n\nHealth Minister Douglas Mombeshora said this at the ongoing 75th World Health Organisation Regional Committee for Africa meeting in Zambia.\n\nMombeshora, who acknowledged that Zimbabwes struggling healthcare system has for too long depended heavily on donor support, which made it more fragile after funding withdrawals urged long-term resilience rather than short-term dependency, saying this was key to building strong national health systems.\n\nZimbabwes message is clear: sustainable health financing is the cornerstone of strong national health institutions.\n\nWe must move away from dependence and toward resilience from short-term cycles to long-term stability.\n\nLet us work together as a region to mobilise domestic resources, innovate in our financing approaches, and deepen partnerships with the private sector.\n\nIn doing so, Africas health systems will not only survive, but thrive delivering tangible results for our people, Mombeshora said.\n\nAs a way to boost domestic health financing in Zimbabwe, Mombeshora said the nation increased its health budget allocation from 9.4% to 13% and introduced new levies on airtime, sugar, fast foods and other products.\n\nHe also added that the government is rolling out a National Health Insurance scheme to protect citizens from catastrophic medical costs.\n\nZimbabwes government has long neglected general hospitals, which now face crumbling infrastructure, medicine shortages, costly patient care and poor wages that have led to low staff morale and a massive brain drain.\n\nMombeshora also added that the government is strengthening primary healthcare, investing in human resources, upgrading infrastructure, and promoting community engagement.\n\nMeanwhile, Botswana has declared a public health emergency, with President Duma Boko saying the national medical supply chain has collapsed due to depleted government coffers and steep cuts in aid from the United States.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/19201620/mombeshora.jpeg",
            "description": "<p>By Thandiwe Garusa ZIMBABWE has called on African nations to prioritise sustainable health financing following recent withdrawals of donor funding across the region. Health Minister Douglas Mombeshora said this at the ongoing 75th World Health Organisation Regional Committee for Africa meeting in Zambia. Mombeshora, who acknowledged that Zimbabwe’s struggling healthcare system has for too long</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-urges-african-nations-to-prioritise-sustainable-health-financing-as-donor-support-declines/\">Zimbabwe urges African nations to prioritise sustainable health financing as donor support declines</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "27 Aug 2025"
        },
        {
            "title": "Taylor Swift and Travis Kelce announce engagement on social media",
            "url": "https://www.newzimbabwe.com/taylor-swift-and-travis-kelce-announce-engagement-on-social-media/",
            "content": "The Guardian\n\nTaylor Swiftand Travis Kelce sent shock waves through social media on Tuesday with a joint postannouncing their engagementafter a two-year courtship.\n\nThe 35-year-old pop star and 35-year-old tight end for theKansas City Chiefswrote: Your English teacher and your gym teacher are getting married with a firecracker emoji on Instagram, alongside a series of images of themselves in a lush, floral setting.\n\nKelce, who is seen in the photos on bended knee, proposed with a ring made by New York City-based designer Kindred Lubeck of Artifex Fine Jewelry, according toPeople.\n\nIn the immediate aftermath of the engagement announcement, fans could type in Swift name on Google and see celebratory confetti.\n\nThe high-profile pair have been together since July 2023. They started dating while Swift was in the throes of her now world-famous Eras tour. At a Kansas City stop, Kelce attempted to give Swift his number on a friendship bracelet, a ubiquitous accessory on the tour. When that failed, he spoke openly about his affection for the singer on his podcast, New Heights.\n\nI was disappointed that she doesnt talk before or after her shows because she has to save her voice for the 44 songs she sings, Kelcetoldhis brother, Jason Kelce, on the podcast at the time.\n\nIf youre up onTaylor Swiftconcerts, there are friendship bracelets and I had received a bunch of them, but I wanted to give Taylor Swift one with my number on it.\n\nThe pair got in touch after that proclamation and began dating shortly thereafter. They in effect hard-launched their relationship in September 2023 when Swift appeared at Arrowhead Stadium to watch Kelce  and the Kansas City Chiefs   play the Chicago Bears.\n\nSince then, they have made headlines routinely. In one blockbuster instance, fans went wild after seeing Swift and Kelce kissing on the field after hisSuper Bowl LVIIIwin in 2024  Kelces third  with the Kansas City Chiefs in a victory against the San Francisco 49ers.\n\nIn front of thousands of screaming fans, Swift tweaked a song in her Eras Tour shows,  Karma, to be about Kelce: Karma is the guy in the Chiefs, coming straight home to me. She also featured him in a 2024 performance in London during the The Tortured Poets Department set of the show.\n\nThe pair also, very recently, appeared on New Heights together to announce Swifts upcoming 12th album, The Life of a Showgirl, which many (correctly!) suspected would be a precursor to an engagement.\n\nThat episode has since broken the record for the most concurrent views for a podcast on YouTube,Guinness World Records announced on Tuesday. About 1.3 million people simultaneously tuned in to the podcast episode when it first aired on YouTube on 13 August. By Tuesday, the podcast episode had 20m views on YouTube.\n\nFans of both Swift and Kelce have been waiting for an engagement announcement for virtually their entire relationship, but rumoursheated up last monthwhen photos of Kelceslock-screenmade the rounds on social media and beyond. The screen appeared to show a photo of the duo with Swift flashing an outstretched hand.\n\nThe NFL shared well wishes to the couple in a congratulationpostwhile Brittany Mahomes showed her support in an Instagram story, calling the pair two of the most genuine people.\n\nThe engagement is particularly notable for longtime Swifties, who have grown up with Swift and watched her dating journey over the years. Many of her songs have been about her past paramours, which include the likes of Joe Alwyn, Matty Healy, Tom Hiddleston, Joe Jonas, Taylor Lautner, Jake Gyllenhaal and John Mayer.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/26202756/swift-kelce.png",
            "description": "<p>The Guardian Taylor Swift and Travis Kelce sent shock waves through social media on Tuesday with a joint post announcing their engagement after a two-year courtship. The 35-year-old pop star and 35-year-old tight end for the Kansas City Chiefs wrote: “Your English teacher and your gym teacher are getting married” with a firecracker emoji on Instagram, alongside a series of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/taylor-swift-and-travis-kelce-announce-engagement-on-social-media/\">Taylor Swift and Travis Kelce announce engagement on social media</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "27 Aug 2025"
        },
        {
            "title": "Woman burnt to ashes in her sleep after wooden cabin caught fire",
            "url": "https://www.newzimbabwe.com/woman-burnt-to-ashes-in-her-sleep-after-wooden-cabin-caught-fire/",
            "content": "By Staff Reporter\n\nRESIDENTS of Harares Eastview suburb are reeling from the tragic death of a woman burnt beyond recognition after the wooden cabin she was sleeping in caught fire.\n\nThe cause of the inferno could not be immediately established at the time of publishing.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the tragedy.\n\nThe ZRP confirms a tragic fire incident which occurred on August 25, 2025 at around 2200 hours in Eastview, Harare, said Nyathi.\n\nThe victim, Sanisai Kandowe (47) lost her life when a wooden cabin she was sleeping in caught fire. The body was burnt to ashes.\n\nPolice said investigations are underway to determine the cause of the blaze.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/26202338/cabin.jpg",
            "description": "<p>By Staff Reporter RESIDENTS of Harare’s Eastview suburb are reeling from the tragic death of a woman burnt beyond recognition after the wooden cabin she was sleeping in caught fire. The cause of the inferno could not be immediately established at the time of publishing. Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/woman-burnt-to-ashes-in-her-sleep-after-wooden-cabin-caught-fire/\">Woman burnt to ashes in her sleep after wooden cabin caught fire </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "27 Aug 2025"
        },
        {
            "title": "I have always been a ZANU PF person – prodigal son Tsenengamu seeks readmission into ruling party",
            "url": "https://www.newzimbabwe.com/i-have-always-been-zanu-pf-person-prodigal-son-tsenengamu-seeks-readmission-into-ruling-party/",
            "content": "By Darlington Gatsi\n\nFormer youth leader Godfrey Tsenengamu is retracing his footsteps to ZANU-PF, applying for readmission into the ruling party five years after his expulsion.\n\nTsenengamu was expelled from ZANU-PF in 2020 for his wayward behaviour after he called out senior party leaders involved in corruption.\n\nThe outspoken politician, together with Lewis Matutu, named controversial businessman Kudakwashe Tagwirei as part of a corrupt cartel that was sabotaging the economy at the time.\n\nInterestingly, Tagwirei, who was at the centre of Tsenengamus criticism, has risen within the ZANU PF ranks, securing a seat in the influential Central Committee.\n\nTsenengamu said he never willingly left ZANU PF.\n\nRemember, I have always been a ZANU PF person except for the moments I was expelled from the Party. I have never volunteered to come out of ZANU PF of my own will, and that must tell everyone concerned why I am seeking to go back to ZANU PF.\n\nI have always believed in this party, its ideology and its aims and objectives, Tsenengamu told NewZimbabwe.com.\n\nOutside ZANU-PF, Tsenengamu formed his own party, the Front for Economic Emancipation in Zimbabwe (FEEZ), as he sought to challenge the ruling party.\n\nAhead of the 2023 election, Tsenengamu and his party backed former ZANU-PF Commissar Saviour Kasukuwere, with the latter being subsequently ejected from the presidential race.\n\nThe firebrand politician has never held back in his criticism of ZANU PF officials who have been implicated in corruption.\n\nTsenengamu says his seeking readmission is not a stamp of approval for certain operations within ZANU PF.\n\nBy seeking to rejoin ZANU PF, that does not mean that I agree to everything everyone does within the party, but there is no point in giving up on the organisation you also worked to grow. Differences will always be there even in institutions like families and churches, and ZANU PF is no exception, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/11160418/Tsenengamu-.png",
            "description": "<p>By Darlington Gatsi Former youth leader Godfrey Tsenengamu is retracing his footsteps to ZANU-PF, applying for readmission into the ruling party five years after his expulsion. Tsenengamu was expelled from ZANU-PF in 2020 for his “wayward behaviour” after he called out senior party leaders involved in corruption. The outspoken politician, together with Lewis Matutu, named</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/i-have-always-been-zanu-pf-person-prodigal-son-tsenengamu-seeks-readmission-into-ruling-party/\">I have always been a ZANU PF person – prodigal son Tsenengamu seeks readmission into ruling party</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "27 Aug 2025"
        },
        {
            "title": "ConCourt denies Edgar Lungu’s family leave to appeal ruling on his burial site",
            "url": "https://www.newzimbabwe.com/concourt-denies-edgar-lungus-family-leave-to-appeal-ruling-on-his-burial-site/",
            "content": "EWN\n\nJOHANNESBURG  The Constitutional Court has denied the family of former Zambian president Edgar Lungu leave to appeal in the battle to determine where his remains should be buried.\n\nThe family approached the apex court after the high court ruled in the Zambian governments favour, ordering that Lungus remains be repatriated to Lusaka.\n\nThe family is adamant on having him laid to rest in South Africa to avoid the involvement of the current president, Hakainde Hichilema, in the funeral.\n\nLungu died in June while receiving medical attention in Johannesburg.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/25163954/lungu-burial.webp",
            "description": "<p>EWN JOHANNESBURG – The Constitutional Court has denied the family of former Zambian president Edgar Lungu leave to appeal in the battle to determine where his remains should be buried. The family approached the apex court after the high court ruled in the Zambian government’s favour, ordering that Lungu’s remains be repatriated to Lusaka. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/concourt-denies-edgar-lungus-family-leave-to-appeal-ruling-on-his-burial-site/\">ConCourt denies Edgar Lungu’s family leave to appeal ruling on his burial site</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "27 Aug 2025"
        },
        {
            "title": "Botswana declares public health emergency over medicine shortage",
            "url": "https://www.newzimbabwe.com/botswana-declares-public-health-emergency-over-medicine-shortage/",
            "content": "Botswana has declared a public health emergency, with President Duma Boko saying the national medical supply chain collapsed due to depleted government coffers and steep cuts in aid from the United States.\n\nThe announcement came on Monday after the Ministry of Health and Wellness warned earlier this month that the system was severely strained with $75m owed to private health facilities and suppliers.\n\nIt cited shortages of medicines for a range of illnesses, including hypertension, cancer, diabetes, tuberculosis, asthma, mental and sexual health, and stated that elective surgeries were postponed.\n\nThe Health Ministry also said there were shortages of dressings and sutures.\n\nThe medical supply chain, as run by central medical stores, has failed, President Boko said in a televised address on Monday. This failure has led to a severe disruption to health supplies countrywide.\n\nThe Ministry of Finance had earlier approved 250 million pula ($18.7m) in emergency funding for procurement, said Boko, adding that the military would oversee the distribution of emergency medicines, with the first shipments dispatching immediately from the capital, Gaborone, with priority given to deprived rural areas.\n\nThe current prices [for medicine] often are inflated five to 10 times. Under the current economic conditions, this scenario is not sustainable, Boko added.\n\nThe crisis is also linked to a shrinking national budget caused by the ongoing downturn in the global diamond market.\n\nBotswana, with a population of 2.5 million, is one of the worlds largest diamond producers. Its vast diamond reserves, discovered just after independence from Britain in 1966, make up about 80 percent of the countrys foreign earnings.\n\nBut sales have weakened in recent years, pushing a cash-strapped government to suspend certain ministerial purchases last month.\n\nSweeping cuts in aid from the US under President Donald Trump have further strained the economy. Before the cuts, the US funded a third of BotswanasHIV response, according to UNAIDS, and provided $12m through The Global Fund to fight malaria and tuberculosis.\n\nThe United Nations agency for children (UNICEF) said urgent action was needed to address the deepening medical crisis in the country, adding that one in five children was underweight in a western district near the Namibian border.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/03054357/Duma-Boko-announced-Botswana-6th-president-1536x1024-1.jpeg",
            "description": "<p>Botswana has declared a public health emergency, with President Duma Boko saying the national medical supply chain collapsed due to depleted government coffers and steep cuts in aid from the United States. The announcement came on Monday after the Ministry of Health and Wellness warned earlier this month that the system was “severely strained” with</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/botswana-declares-public-health-emergency-over-medicine-shortage/\">Botswana declares public health emergency over medicine shortage</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "27 Aug 2025"
        }
    ]
}