{
    "news": [
        {
            "title": "Wheelbarrows as ambulances, drink cans as scalpels: The desperation of giving birth in Epworth",
            "url": "https://www.newzimbabwe.com/wheelbarrows-as-ambulances-drink-cans-as-scalpels-the-desperation-of-giving-birth-in-epworth/",
            "content": "By Thandiwe Garusa\n\nAN empty drink can has become a makeshift surgical tool in the poverty-stricken community of Epworth where a traditional birth attendant, Tapiwa Vhinya, uses it to cut umbilical cords during home deliveries.\n\nWith no access to surgical blades, cord clamps, sterile strings or tapes, she improvises with whatever is at hand, tying cords with ordinary draw threads. It is a dangerous practice, yet one many women turn to because hospital births are beyond their reach.\n\nLocals call Vhinya (34) Ambuya Va52, a nickname she has earned from the 52 babies shehas deliveredin Epworth, a high-density suburb about 12 kilometres southeast of Zimbabwes capital, Harare, since she started in 2019.\n\nIn an interview with NewZimbabwe.com, the traditional birth attendant said she has delivered most of these children with her bare hands, as neither she nor the expectant mother have access to surgical gloves.\n\nWe live in a poor community where most people are unemployed and can barely afford to put food on the table, so most of these women are turned back home from the local (Epworth clinic) as they cannot afford it.\n\nI have delivered most of these babies, touching blood with my bare hands as I do not have access to gloves.\n\nI use empty drink cans to cut the umbilical cord and draw threads to tie the babys cord after cutting it and that is the biggest challenge I have been facing since I started, Vhinya said.\n\nEpworths traditional birth attendant Tapiwa Vhinya\n\nAt the local clinic, women are required to bring their own delivery supplies: ten pairs of gloves, surgical blades, cord clamps, linen savers, cotton, methylated spirit, and other essentials.\n\nIn addition, before admission, expectant mothers must pay a registration fee of US$45 for a normal delivery, along with an extra US$40 to cover the cost of an ambulance should complications require transfer to a larger hospital.Without the supplies or the fees, women are simply turned away.\n\nSeveral women who spoke to this publication said these steep costs and requirements are what force them into the hands of traditional midwives, despite the dangers of home deliveries.\n\nMary David (19), a young mother whose 11-month-old baby was delivered by Vhinya, recalled her ordeal:They wanted a lot of money that I did not have, I did not even have enough preparation for the child, even food to eat here at home so hospital delivery was not an option.\n\nCorruption and mistrust of nurses\n\nSome women who spoke to NewZimbabwe.com raised serious corruption allegations against nurses from the local hospital, saying they demand bribes for you to get help with ill treatment meted out to those who refuse to pay.\n\nRuvimbo Nyakawuru (27), who also had two of her babies with Vhinyas assistance, said she wanted to avoid ill treatment by nurses.\n\nRuvimbo Nyakawuru (27) had two of her babies with Vhinyas assistance.\n\nI gave birth to my first child in a hospital and after that experience, I vowed to never go back there again.\n\nIf you do not pay the nurse a little something for  a drink, even when you are in pain and require attention, they will ignore you and speak to you rudely, in my case, they even told me thatkana usingade kubhadhara hameno hako, mwana wacho ndewako akafa hameno(if you do not want to pay, we do not care, the child is yours).\n\nI saw women giving birth on their own whilst in hospital, Nyakawuru said.\n\nRuvimbo Nyakawuru (27), had two of her babies with Vhinyas assistance.\n\nNoster Chitiva (49) also weighed in, saying the women are treated according to how they look and how much they have paid.\n\nThe nurses treat their patients according to how you look, if you have given them some money for drinks and it is totally different for those who would have paid something.\n\nIf you do not have the money, you suffer, she added.\n\nThis has led to some women deliberately avoiding going to the clinic, even when they can afford it, citing ill treatment by nurses.\n\nFor Freddie Zenda (46), his wife was initially helped by Vhinya to deliver their second-born child as it was an emergency, but their decision to use her services for their third child was intentional.\n\nWhen my wife went into labour the first time, things were really tight and I did not have money for maternity registration at the clinic, so we settled for Ambuya Va52.\n\nHowever, for the second baby, we simply chose her because of the good care we had received the first time as compared to what we had to go through at the clinic during the birth of our first child.\n\nBirths in wheelbarrows\n\nTransport remains one of the biggest barriers for women seeking safe deliveries.\n\nIn some cases, expectant mothers in labour are pushed in wheelbarrows for as far as three kilometres because their families cannot afford to hire cars or ambulances.\n\nSamuel Chigwesa, a father of three, recalled how his wife went into emergency labour even after the family had managed to raise the hospital registration fee.I had managed to raise the required money for hospital delivery, however, my wife got into an emergency labour and I did not have time and money to hire a car and the available option was carrying her to the hospital in a wheelbarrow and she ended up giving birth as we were about to leave.\n\nMost people here cannot afford to hire a car and they end up having to be carried to the hospital in a wheelbarrow, which can take up to an hour, he said.\n\nThe clinic is about 3 kilometres away from Epworth Ward 1.\n\nChigwesa added that in many cases, women give birth on the way, unable to reach the hospital in time, making the journey both painful and dangerous for mothers and their newborns.\n\nMost of these women give birth before they even get to the hospital, Chigwesa added.\n\nWhile home deliveries are common in communities like Epworth, they often come with serious complications.\n\nVhinya said one of the most difficult cases she faced was delivering a baby who had long died inside the mothers womb, suspected to be due to high blood pressure.\n\nThe child came out in pieces; it had long died inside and turned black in colour. It was a scary experience.\n\nThe mother never went for antenatal visits at the hospital; she was just living like nothing was happening and these are some of the challenges we face, she said.\n\nIn another case, Vhinya described delivering a baby in an abnormal position, with one leg emerging first, a situation that would normally require an emergency caesarean section.\n\nIt was a very difficult childbirth, but we managed, she added.\n\nBesides the childbirth process, these women also struggle to obtain documentation for their babies.\n\nIf you give birth at home, getting to have a birth record or baby card will be the worst nightmare as the officials will give you a difficult time, another Epworth resident added.\n\nA child health card\n\nIsheanesu Chirisa, the Women and Law in Southern Africa (WLSA) National Director, said poor maternal healthcare in Zimbabwe requires government action to remove financial barriers, improve access, and integrate traditional birth attendants with skilled medical care.\n\nPoor maternal health care remains a huge stumbling block for most women in Zimbabwe, particularly in marginalised communities.\n\nTo ensure that women in marginalised communities like Epworth have access to safe maternal healthcare, strategies by the government should focus on removing financial barriers, improving health system accessibility, and adaptability, including investing in integrating traditional attendants with skilled healthcare, Chirisa said.\n\nThe situation in Epworth mirrors the reality of home births across many Zimbabwean communities, highlighting the broader crisis of access to healthcare as a fundamental human right.\n\nZimbabwes Constitution enshrines this right: Section 76 guarantees every citizen access to basic healthcare services, including reproductive health, while Section 81 provides special protection for children, affirming their entitlement to healthcare.\n\nBeyond its national laws, Zimbabwe is also bound by international commitments. As a signatory to treaties such as the International Covenant on Economic, Social and Cultural Rights (ICESCR) and the Convention on the Elimination of All Forms of Discrimination Against Women (CEDAW), the state carries an obligation to ensure equitable, non-discriminatory access to maternal health services.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/29181947/Tapiwa-Vhinya-demonstrates-how-she-uses-a-draw-thread-and-empty-can-for-childbirth.png",
            "description": "<p>By Thandiwe Garusa AN empty drink can has become a makeshift surgical tool in the poverty-stricken community of Epworth where a traditional birth attendant, Tapiwa Vhinya, uses it to cut umbilical cords during home deliveries. With no access to surgical blades, cord clamps, sterile strings or tapes, she improvises with whatever is at hand, tying</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/wheelbarrows-as-ambulances-drink-cans-as-scalpels-the-desperation-of-giving-birth-in-epworth/\">Wheelbarrows as ambulances, drink cans as scalpels: The desperation of giving birth in Epworth</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:31",
            "date": "30 Sep 2025"
        },
        {
            "title": "Zimbabwe to host IATF permanent secretariat",
            "url": "https://www.newzimbabwe.com/zimbabwe-to-host-iatf-permanent-secretariat/",
            "content": "APA News\n\nThe Intra-African Trade Fair (IATF) is set to become a permanent institution headquartered in Harare, Zimbabwe, following its formal transition into the newly established Intra-African Trade Fair Company (IATFCO).\n\nThe move, announced during IATF2025 in Algiers, marks a major milestone in Africas push for economic integration under the African Continental Free Trade Area (AfCFTA).\n\nThe decision to base the headquarters in Zimbabwe followed a competitive bidding process involving Burkina Faso, Cameroon, Malawi, Zambia, South Africa and Zimbabwe.\n\nFormer Nigerian President Olusegun Obasanjo, chairperson of the IATF Advisory Council, said Zimbabwe was selected for its strong conferencing infrastructure, air connectivity, accommodation capacity and commitment to land provision for future expansion.\n\nThis opens a new chapter for IATF as it continues powering growth in intra-African trade and playing its role as the most important trade and investment gathering on the continent, Obasanjo said.\n\nBacked by an initial capitalisation of $28 million approved by the African Export-Import Bank (Afreximbank), IATFCO will serve as the institutional anchor for the biennial trade fair, which has grown into the continents largest marketplace for intra-African commerce.\n\nAfreximbank president Benedict Oramah hailed the development as a huge milestone, urging African governments, corporations and financial institutions to support the institution during its formative phase.\n\nIATF is co-convened by Afreximbank, the African Union Commission and the AfCFTA Secretariat.\n\nIt provides a platform for businesses to showcase goods and services, forge partnerships and tap into AfCFTAs single market of over 1.4 billion people and a combined gross domestic product exceeding $3.5 trillion.\n\nThe 2025 edition of the fair, held from 4 to 10 September in Algiers, attracted over 112,000 visitors from 132 countries, hosted 2,148 exhibitors and generated $48.3 billion in trade and investment deals.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/08111459/harare.jpeg",
            "description": "<p>APA News The Intra-African Trade Fair (IATF) is set to become a permanent institution headquartered in Harare, Zimbabwe, following its formal transition into the newly established Intra-African Trade Fair Company (IATFCO). The move, announced during IATF2025 in Algiers, marks a major milestone in Africa’s push for economic integration under the African Continental Free Trade Area</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-to-host-iatf-permanent-secretariat/\">Zimbabwe to host IATF permanent secretariat</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:31",
            "date": "30 Sep 2025"
        },
        {
            "title": "Seychelles to hold presidential run-off after vote fails to produce clear winner",
            "url": "https://www.newzimbabwe.com/seychelles-to-hold-presidential-run-off-after-vote-fails-to-produce-clear-winner/",
            "content": "BBC\n\nSeychelles is set to hold a rerun of its presidential elections between the two main contenders, after no outright winner was announced.\n\nOpposition leader Patrick Herminie received 48.8% of the vote against the incumbent President Wavel Ramkalawan who garnered 46.4%, the electoral commission announced.\n\nAccording to the electoral rules, a candidate must obtain more than 50% of the vote to be declared the winner, and a run-off election has subsequently been scheduled for next week.\n\nSeychelles is Africas smallest country, a 115-island archipelago in the Indian Ocean with a population of just over 120,000.\n\nThere were eight presidential hopefuls in last weeks election.\n\nRamkalawan is seeking a second term, with his Linyon Demokratik Seselwa (LDS) party campaigning on economic recovery, social development and environmental sustainability.\n\nHis main challenger Herminie is from the United Seychelles party, which dominated the countrys political landscape from 1977 until 2020, when it lost its majority to Ramkalawans party.\n\nUnited Seychelles has regained control of the National Assembly, taking 19 out of 35 seats in the parliamentary elections held alongside the presidential vote.\n\nWe are ready for a second round. We start campaigning tomorrow, Herminie said in a televised address.\n\nPublic disquiet over the sovereignty and ecological stewardship of Assumption Island, one of the archipelagos most eco-sensitive territories, surfaced in recent days as an electoral touchpoint, following the islands leasing to a foreign hotel developer.\n\nThe issue may energise decisive backing from the six trailing presidential candidates and their supporters ahead of the run-off ballot slated for 9-11 October.\n\nSeychelles is renown for luxury and environmental tourism and is Africas wealthiest country in terms of average income per person, according to the World Bank.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/29192227/seychelles-vote.webp",
            "description": "<p>BBC Seychelles is set to hold a rerun of its presidential elections between the two main contenders, after no outright winner was announced. Opposition leader Patrick Herminie received 48.8% of the vote against the incumbent President Wavel Ramkalawan who garnered 46.4%, the electoral commission announced. According to the electoral rules, a candidate must obtain more</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/seychelles-to-hold-presidential-run-off-after-vote-fails-to-produce-clear-winner/\">Seychelles to hold presidential run-off after vote fails to produce clear winner</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:31",
            "date": "30 Sep 2025"
        },
        {
            "title": "ZWG inflation rate slips to a negative 0,2%",
            "url": "https://www.newzimbabwe.com/zwg-inflation-rate-slips-to-a-negative-02/",
            "content": "By Alois Vinga\n\nThe Zimbabwe Gold (ZWG) currency recorded a marginal decline in inflation last month, with the month-on-month rate easing to 0.2%, raising hopes that annual inflation,still in double digits,will continue to recede through year-end, the Zimbabwe National Statistics Agency (Zimstat) reported Monday.\n\nAccording to the latest data, the ZWG has maintained notable stability against the US dollar since September 2024, when it last registered a major dip.\n\nThe ZWG month-on-month inflation rate was 0.2% in September 2025, shedding 0.6 percentage points from the August 2025 rate of 0.4%. This means that prices, as measured by the all-items ZWG Consumer Price Index (CPI), decreased by an average of 0.2% between August and September 2025, Zimstat said.\n\nFood and Non-Alcoholic Beverages recorded a month-on-month inflation rate of 0.2% in September, up from 0.1% in August. In contrast, non-food inflation fell to 0.5%, down from 0.6% in the previous month.\n\nYear-on-year, however, inflation remains elevated. The ZWG year-on-year inflation rate for September 2025 was 82.7%, meaning prices increased by an average of 82.7% compared to September 2024, Zimstat added.\n\nThe Reserve Bank of Zimbabwe (RBZ) has continued to pursue a tight monetary policy to safeguard the ZiG currency introduced in April 2024. This has included maintaining a high policy rate to curb speculative borrowing and anchor both inflation and exchange rate expectations.\n\nMeanwhile, Zimstat reported that US dollar inflation remained steady, with the September 2025 month-on-month rate unchanged at 0%, while year-on-year inflation stood at 13.4%.\n\nOn the poverty benchmarks, the Food Poverty Line (FPL) for one person in September was ZWG 877.03, while the Total Consumption Poverty Line (TCPL) stood at ZWG 1,292.80,the minimum needed per person to cover both food and non-food requirements.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/02115157/zig.webp",
            "description": "<p>By Alois Vinga The Zimbabwe Gold (ZWG) currency recorded a marginal decline in inflation last month, with the month-on-month rate easing to –0.2%, raising hopes that annual inflation, still in double digits, will continue to recede through year-end, the Zimbabwe National Statistics Agency (Zimstat) reported Monday. According to the latest data, the ZWG has maintained notable stability</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zwg-inflation-rate-slips-to-a-negative-02/\">ZWG inflation rate slips to a negative 0,2%</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:31",
            "date": "30 Sep 2025"
        },
        {
            "title": "China opens world’s highest bridge, breaking its own record",
            "url": "https://www.newzimbabwe.com/china-opens-worlds-highest-bridge-breaking-its-own-record/",
            "content": "NBC News\n\nThe worlds highest bridge opened inChinaon Sunday, taking the crown from another bridge in the same province.\n\nThe Huajiang Grand Canyon Bridge soars about 2,050 feet above a river and gorge in the southern Chinese province ofGuizhou.It is more than twice as high as the Royal Gorge Bridge, which is suspended 956 feet above the Arkansas River in Colorado and is the highest in the United States.\n\nAccording to Chinese state media, the new Guizhou bridge also sets a record as the worlds longest bridge in a mountainous region, spanning 4,600 feet across.\n\nHailed as Chinas latest infrastructure miracle, the bridge is designed to spur tourism and economic growth in one of the countrys least developed regions.\n\nThe mega project, constructed over three years and eight months, will cut travel time between the two sides of the canyon from two hours to two minutes and connect major tourist spots, officials said.\n\nTian Hongrui, a technician for the Huajiang Grand Canyon Bridge, said he felt proud to have left a mark.\n\nLeaving now is bittersweet, but this isnt the end, Tian told state-run broadcaster CCTV News. Its the start of a new chapter.\n\nThe bridge has a high-speed glass elevator that can send visitors to a coffee spot 2,600 feet above the river. Visitors can also try bungee jumping or a 1,900-foot-high glass walkway.\n\nThe province of Guizhou, which is home to about 40 million people, has undergone an infrastructure campaign in recent decades as part of theChinese governments war on poverty. It now has more than 32,000 bridges that are either completed or under construction, compared with about 2,900 in the 1980s.\n\nGuizhou is also home to what is now the worlds second-highest bridge, Duge Bridge, which opened in 2016.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/29192519/china-bridge.png",
            "description": "<p>NBC News The world’s highest bridge opened in China on Sunday, taking the crown from another bridge in the same province. The Huajiang Grand Canyon Bridge soars about 2,050 feet above a river and gorge in the southern Chinese province of Guizhou. It is more than twice as high as the Royal Gorge Bridge, which is suspended 956</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/china-opens-worlds-highest-bridge-breaking-its-own-record/\">China opens world’s highest bridge, breaking its own record</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:31",
            "date": "30 Sep 2025"
        }
    ]
}