{
    "news": [
        {
            "title": "Zimbabwe calls for sustainable domestic financing to curb tuberculosis",
            "url": "https://www.newzimbabwe.com/zimbabwe-calls-for-sustainable-domestic-financing-to-curb-tuberculosis/",
            "content": "Xinhua\n\nZimbabwean authorities on Wednesday called for sustainable domestic financing to fight against tuberculosis (TB) as external funding declined.\n\nOwen Mugurungi, director of AIDS and TB programs in the Ministry of Health and Child Care, said at a conference in the Zimbabwean capital of Harare that the reduction in global donor funding posed a direct threat to the countrys TB response, and the country needs to explore sustainable domestic financing to respond to the infectious disease.\n\nWe can not build a resilient TB response on unpredictable and external funding alone, Mugurungi said, adding that the situation underscores the urgent need for sustainable financing and domestic investment.\n\nHe noted that Zimbabwe faces a high burden of TB/HIV co-infection and a persistent challenge of drug-resistant TB.\n\nAccording to him, the ministry estimated that approximately 15,000 TB cases were missed last year, and the gap represents the single greatest challenge in the fight against the disease.\n\nOur national TB response is at a crossroads. We have the strategy, we have the evidence, and we have the dedicated workforce. What we need now is the collective will to convert our commitments into concrete action. We must find the missing cases, secure the necessary resources and embrace the innovations that will allow us to end TB in Zimbabwe, Mugurungi said.\n\nSpeaking at the same event, Zimbabwean Health and Child Care Minister Douglas Mombeshora commended Zimbabwe for progress in the fight against the infectious disease.\n\nOur TB response has made real progress. But as we celebrate progress, we must also be honest about the road ahead. TB remains a serious public health challenge and the shifting landscape of global health financing is creating uncertainty for critical programs, he added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/30064847/Tuberculosis.jpg",
            "description": "<p>Xinhua Zimbabwean authorities on Wednesday called for sustainable domestic financing to fight against tuberculosis (TB) as external funding declined. Owen Mugurungi, director of AIDS and TB programs in the Ministry of Health and Child Care, said at a conference in the Zimbabwean capital of Harare that the reduction in global donor funding posed a direct</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-calls-for-sustainable-domestic-financing-to-curb-tuberculosis/\">Zimbabwe calls for sustainable domestic financing to curb tuberculosis</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "30 Oct 2025"
        },
        {
            "title": "Rasta the artist: ‘If it’s a calling, you can’t hide it’",
            "url": "https://www.newzimbabwe.com/rasta-the-artist-if-its-a-calling-you-cant-hide-it/",
            "content": "TshisaLive\n\nThe controversial but proudly passionate painter, real name Lebani Sirenje, told TshisaLIVE art has been in his blood long before his portraits started trending across Mzansis timelines.\n\nCatching up with him at eMedia Studios in Hyde Park, Johannesburg, Rasta laughed as he looked back at his humble beginnings in Bulawayo, Zimbabwe.\n\nI was born in Killarney Suburbs, but my bread was buttered in Pumula East and toasted here in eGoli, he joked.\n\nRasta said his artistic spark came from his late grandmother, Gogo Mahlanga Mayisa, who sold fabrics.\n\nShe used to buy fabrics from Plumtree and Id sketch for her, he recalled. She always said Id make it in art. I wish she was here to see this.\n\nAfter studying art at Magwegwe High School, Rasta followed his dreams to South Africa. He hustled in restaurants and construction before art came knocking again.\n\nIf its a calling, you cant hide it, he said. I had to slow down everything else when art started shouting my name.\n\nKnown for his often debated portraits of Mzansis late icons, Rasta said painting faces is his way of telling stories.\n\nPortraits show your journey and story, he said. Art is entertainment on its own. If youre not criticised, youre not working.\n\nHes dreaming of exhibitions to honour legends such as Vuyo Mokoena, Lundi Tyamara, Riky Rick, HHP and ProKid, with proceeds going to their families.\n\nHes also made his mark on screen, appearing inDiepCity, Black DoorandGomoraand starring in a viral Chicken Licken ad.\n\nThat ad was a movie. If adverts had awards, that one wouldve scooped it, he laughed.\n\nThrough the fame, criticism and memes, Rasta remains grounded and grateful.\n\nIve been threatened not to paint, but this is my God-given talent, he said.\n\nIm a soldier. I pray, I paint and I bring bread home.\n\nAnd to his critics? Rasta smiles and keeps sketching.\n\nIm an art believer. As long as I have paint, Ill keep telling our stories.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/30064353/rasta-scandal-etv.jpg",
            "description": "<p>TshisaLive Love him or roast him, Rasta the artist stays winning. The controversial but proudly passionate painter, real name Lebani Sirenje, told TshisaLIVE art has been in his blood long before his portraits started trending across Mzansi’s timelines. Catching up with him at eMedia Studios in Hyde Park, Johannesburg, Rasta laughed as he looked back</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rasta-the-artist-if-its-a-calling-you-cant-hide-it/\">Rasta the artist: ‘If it’s a calling, you can’t hide it’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "30 Oct 2025"
        },
        {
            "title": "Chevrons lose opening T20 match to Afghanistan",
            "url": "https://www.newzimbabwe.com/chevrons-lose-opening-t20-match-to-afghanistan/",
            "content": "By Sports Reporter\n\nZimbabwes senior mens cricket team staged a disappointing performance against Afghanistan on Wednesday losing by 53 runs in the opening game of the three-match series played at Harare Sports Club.\n\nThe defeat came on the back of a convincing one-off Test match win against the same opponents at the same venue.\n\nThe Chevrons poor performance with the bat was the biggest setback as they failed to chase Afghanistans 180 runs posted in the first innings.\n\nZimbabwes best bowler during the first innings was Sikandar Raza, who took 3 wickets, as Afghanistans batters ran riot against his teammates, only to lose 6 wickets in 20 overs.\n\nRaza could not complete a top performance in the match as he was one of the least performers in the second innings, managing only one run.\n\nThe Chevrons captain was one of the four top-order batsmen who failed to post more than two runs, the other three being Brandon Taylor, Ryan Burl, and Tadiwanashe Marumani, who were all dismissed with zero runs.\n\nZimbabwes highest scorer in the match was Tinotenda Maphosa, who posted 32 runs, eight more runs than Brian Bennett, who was the second-highest scorer with 24.\n\nAltogether, the Chevrons were bowled out for 127 runs in 16.1 overs, thus losing the match by 53 runs.\n\nThe two sides will play their second T20 match on Friday, the 31st of October, before completing the series on Sunday, the 2nd of November, at the same venue.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/30063616/chevrons-afghan.jpg",
            "description": "<p>By Sports Reporter Zimbabwe’s senior men’s cricket team staged a disappointing performance against Afghanistan on Wednesday losing by 53 runs in the opening game of the three-match series played at Harare Sports Club. The defeat came on the back of a convincing one-off Test match win against the same opponents at the same venue. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chevrons-lose-opening-t20-match-to-afghanistan/\">Chevrons lose opening T20 match to Afghanistan</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "30 Oct 2025"
        },
        {
            "title": "Herentals fined US$5,000, club officials slapped with three-season ban for assaulting fan, police officer",
            "url": "https://www.newzimbabwe.com/herentals-fined-us5000-club-officials-slapped-with-three-season-ban-for-assaulting-fan-police-officer/",
            "content": "By Sports Reporter\n\nThe Premier Soccer League (PSL) has banned two Herentals Football Club officials from all football activities for three seasons following an assault incident during a match against CAPS United last month.\n\nThe two officials, Paradzai Afa and Tairos Ngoma, were found guilty of assaulting a fan in the VVIP seating area at Rufaro Stadium and later attacking a police officer upon arrest.\n\nThe Premier Soccer League (PSL) Disciplinary Committee issued a judgment in the matter involving Herentals Football Club and their security officials, Paradzai Afa and Tairos Ngoma, following incidents of assault and disorderly conduct during a Castle Lager Premier Soccer League match against CAPS United FC played at Rufaro Stadium on 13 September 2025.\n\nHerentals FC pleaded guilty to breaching the PSL Rules and Regulations after one of their security officials assaulted a football fan in the VVIP area, while another assaulted a police officer following an arrest for violence after the match, read part of the PSL statement.\n\nIn addition to the bans, Herentals FC has been fined US$5,000 and ordered to play its next three home matches behind closed doors, starting this weekend.\n\nConsequently, the Disciplinary Committee ordered that Herentals FC be fined US$5,000. In addition, Paradzai Afa and Tairos Ngoma have been banned from performing any official club duties during PSL matches for three (3) seasons.\n\nThe club will also be required to play its next three home matches behind closed doors, with only accredited personnel permitted to attend, further stated the PSL.\n\nThe sanctions against Herentals come shortly after Yadah FC board member Spencer Muvadi was suspended for two years from football activities following a separate player assault incident in August.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/09203147/Innocent-Benza-Herentals-1024x683-1.webp",
            "description": "<p>By Sports Reporter The Premier Soccer League (PSL) has banned two Herentals Football Club officials from all football activities for three seasons following an assault incident during a match against CAPS United last month. The two officials, Paradzai Afa and Tairos Ngoma, were found guilty of assaulting a fan in the VVIP seating area at</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/herentals-fined-us5000-club-officials-slapped-with-three-season-ban-for-assaulting-fan-police-officer/\">Herentals fined US$5,000, club officials slapped with three-season ban for assaulting fan, police officer</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "30 Oct 2025"
        },
        {
            "title": "Mnangagwa is panicking – says Sikhala, vows to spearhead resistance against ZANU PF’s 2030 agenda",
            "url": "https://www.newzimbabwe.com/mnangagwa-is-panicking-says-sikhala-vows-to-spearhead-resistance-against-zanu-pfs-2030-agenda/",
            "content": "By Darlington Gatsi\n\nDESPITE law enforcement officers foiling the launch of a campaign against the extension of President Emmerson Mnangagwas term, opposition leaders remain resolute in their stance against the amendment of the constitution by ZANU-PF.\n\nZimbabwe Republic Police officers stormed the SAPES Trust on Tuesday morning, clamping down on a scheduled address by Tendai Biti, Job Sikhala, Munyaradzi Gwisai, and Jacob Ngarivhume.\n\nThe opposition figures have initiated a resistance against ZANU-PFs plot to extend President Mnangagwas tenure to 2030, beyond its expiry in 2028.\n\nThe launch, however, suffered a major setback when a conference room at the SAPES Trust was petrolbombed by suspected state agents.\n\nSikhala said the move would not deter the opposition from fighting the extension of President Mnangagwas hold on office.\n\nIt shows the state of national panic as we are speaking here, you can see the riot police officers are now approaching here, demonstrating that the dictatorship is in panic. Zimbabweans do not panic, we are going to announce the next course of action after this, said Sikhala.\n\nThe recently adopted resolution by the ruling party at its just-ended conference in Mutare, to set legal wheels in motion for President Mnangagwa to stay beyond 2028, has ignited political tensions.\n\nWithin ZANU-PF, a clique backing Vice President Constantino Chiwenga is opposing the move to amend the constitution, rooting for the former army general to succeed Mnangagwa.\n\nWorld Council of Churches (WCC) programmes director, Kenneth Mtata, said the move to extend Mnangagwas term will have ripple effects on the countrys position in the global community.\n\nThe proposal to extend the presidential term will hurt Zimbabwe at many levels. Here are five main reasons\n\nFirst, it will undermine all the hard work of international re-engagement pursued since 2017. It will signal to global partners that Zimbabwe cannot be trusted to honour its own constitutional and democratic commitments.\n\nSecond, it will jeopardise the ongoing debt restructuring efforts. Third, this extension will discourage investment. Recently, Forbes magazine is said to have identified Zimbabwe as one of the most attractive tourist destinations. Investors would be wary of systems that change rules to suit political convenience. Policy inconsistency and instability will scare away the very capital needed for national economic recovery.\n\nFourth, the term extension will shatter the fragile social trust that had begun to form after years of political violence. Coercive force and intimidation would likely return to our national life in order to enforce such an unpopular measure. This will reopen old wounds and further divide communities once again.\n\nFifth, this decision will remove any chances of the President leaving a positive legacy. He will be classified with all those leaders remembered for clinging to power, rather than those honoured for serving with integrity and stepping aside with dignity, said Mtata.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/02001450/Job-Sikhala.png",
            "description": "<p>By Darlington Gatsi DESPITE law enforcement officers foiling the launch of a campaign against the extension of President Emmerson Mnangagwa’s term, opposition leaders remain resolute in their stance against the amendment of the constitution by ZANU-PF. Zimbabwe Republic Police officers stormed the SAPES Trust on Tuesday morning, clamping down on a scheduled address by Tendai</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-is-panicking-says-sikhala-vows-to-spearhead-resistance-against-zanu-pfs-2030-agenda/\">Mnangagwa is panicking – says Sikhala, vows to spearhead resistance against ZANU PF’s 2030 agenda</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "30 Oct 2025"
        },
        {
            "title": "Compensation relief for ex-Wenela workers affected by silicosis, TB",
            "url": "https://www.newzimbabwe.com/compensation-relief-for-ex-wenela-workers-affected-by-silicosis-tb/",
            "content": "By Darlington Gatsi\n\nZIMBABWEANS who suffered medical conditions as a result of working in South African mines can now claim compensation after the government signed a Memorandum of Understanding (MoU) with the Tshiamiso Trust to facilitate payments to the victims.\n\nThousands of Zimbabweans recruited by the Witwatersrand Native Labour Association (Wenela) worked as mineworkers in South Africa, both before and after independence. During that time, they contracted occupational diseases such as tuberculosis and silicosis.\n\nThe MoU enables the Tshiamiso Trust to facilitate compensation for former Wenela workers who were employed in the neighbouring country between March 12 1965, and December 10 2019.\n\nTshiamiso Trust Chief Executive Officer, Munyadziwa Kwinda, said the agreement is a turning point for the majority of the former mineworkers and their dependants who have had to endure a long wait.\n\nWe are honoured to mark this moment in partnership with the Government of Zimbabwe and NSSA. Thousands of Zimbabwean ex-mineworkers have been waiting for Tshiamiso Trust services to commence so that they can access compensation that they may qualify for.\n\nTodays agreement means they can now lodge their claims and complete the medical assessments required to determine their eligibility for compensation. This is about restoring dignity and delivering on the promise made to the men and families who built the mining industry, said Kwinda.\n\nProspective claimants, however, must meet certain criteria, including providing proof that they suffered from a work-related illness.\n\nDependants of the deceased can claim after providing proof of relationship and a death certificate indicating the cause of death.\n\nThe National Social Security Authority (NSSA), which partnered with Tshiamiso on behalf of the government, said the compensation will bring relief to the former mineworkers and their dependants.\n\nZimbabwe is home to many who spent their working lives in South Africas mines and returned home with illnesses that changed their futures. Through this collaboration, we are ensuring that those who qualify can now access the compensation due to them, closer to where they live.\n\nNSSA remains committed to working with regional partners like Tshiamiso Trust to expand social security and strengthen cross-border protection for our workers, said NSSA Chief Executive Officer Charles Shava.\n\nThe Tshiamiso Trust has already paid R2.4 billion to 25,000 beneficiaries in Lesotho, South Africa, Mozambique, Eswatini, and Botswana.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/01054408/MINERS.webp",
            "description": "<p>By Darlington Gatsi ZIMBABWEANS who suffered medical conditions as a result of working in South African mines can now claim compensation after the government signed a Memorandum of Understanding (MoU) with the Tshiamiso Trust to facilitate payments to the victims. Thousands of Zimbabweans recruited by the Witwatersrand Native Labour Association (Wenela) worked as mineworkers in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/compensation-relief-for-ex-wenela-workers-affected-by-silicosis-tb/\">Compensation relief for ex-Wenela workers affected by silicosis, TB</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "30 Oct 2025"
        },
        {
            "title": "Zimbabwe agrees to give Zambia more water at Kariba after it exhausted its allocation",
            "url": "https://www.newzimbabwe.com/zimbabwe-agrees-to-give-zambia-more-water-at-kariba-after-it-exhausted-its-allocation/",
            "content": "ZIMBABWE has agreed to allow ZESCO to use more water from the Kariba Dam in order to generate additional electricity after the utility exhausted its 2025 water allocation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/04140213/Kariba-Dam.jpeg",
            "description": "<p>Kalemba ZIMBABWE has agreed to allow ZESCO to use more water from the Kariba Dam in order to generate additional electricity after the utility exhausted its 2025 water allocation. This follows Energy Minister Makozo Chikote’s request to Zimbabwe to increase ZESCO’s 2025 water allocation for the Kariba North Bank Power Station, after the company had</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-agrees-to-give-zambia-more-water-at-kariba-after-it-exhausted-its-allocation/\">Zimbabwe agrees to give Zambia more water at Kariba after it exhausted its allocation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "30 Oct 2025"
        },
        {
            "title": "Zimbabwe harvests 578,000 tonnes of wheat, surpassing national demand",
            "url": "https://www.newzimbabwe.com/zimbabwe-harvests-578000-tonnes-of-wheat-surpassing-national-demand/",
            "content": "Milling MEA\n\nZIMBABWEhas recorded its highest-ever wheat output, harvesting 578,059 metric tonnes during the 2025 winter season, a milestone that not only exceeds last years record but also surpasses the countrys annual wheat requirement.\n\nLands, Agriculture, Fisheries, Water and Rural Development Minister Anxious Masuka announced the achievement, describing it as a confirmation of Zimbabwes strengthened agricultural capacity and food self-sufficiency.\n\nThe country now joinsEthiopiaas one of only two African nations to have achieved full wheat self-sufficiency.\n\nFrom a modest volume of 94,685 metric tonnes in 2019, to 562,091 metric tonnes in 2024, Zimbabwe is only one of two jurisdictions on the African continent that have become wheat self-sufficient, said Masuka.\n\nHe added that this years production already surpasses our national annual requirement, estimated at 360,000 metric tonnes.\n\nMasuka noted that production continues to rise steadily, supported by expanded irrigation, input support, and government-backed mechanisation programmes.\n\nThe 2025 season saw 122,566 hectares planted to wheat, of which an additional 12,023 hectares were still to be harvested by early November. This marks a 511% increase from 2019 levels, a remarkable turnaround in just six years.\n\nThe expansion aligns with Zimbabwes broader strategy to reduce dependence on imports, especially following the global grain price spikes triggered by theRussiaUkraineconflict.\n\nWheatis the countrys second most important cereal after maize, and domestic self-sufficiency is seen as critical to stabilising food prices and strengthening food security.\n\nFocus on export opportunities and market stability\n\nWith domestic needs fully met, Zimbabwe is now seeking export opportunities within the region, particularly in neighboring countries that continue to face wheat shortages.\n\nHowever, Masuka emphasized that local supply remains secure and that the government has taken measures to stabilise pricing and ensure smooth distribution.\n\nThe government has released 6,518 metric tonnes to millers in recent weeks to stabilise supply and pricing levels of wheat products, he said, noting that the Agricultural Marketing Authority (AMA) continues to coordinate marketing and distribution to maintain market balance.\n\nDespite the surplus, Zimbabwe will continue importing limited volumes of high-gluten wheat, which is preferred by some millers for specific bread formulations.\n\nCertain millers have indicated that their mills and bread styles require high gluten content wheat not achievable in locally produced wheat, Masuka explained.\n\nAccording to him, as per current policy, such wheat will continue to be imported under existing arrangements, without any additional costs.\n\nThe government is urging registered millers and industry players to collaborate closely with authorities under the AMA framework to ensure a consistent balance between production, demand, and market stability.\n\nZimbabwes wheat success story reflects years of deliberate investment in irrigation infrastructure, farmer training, and private-sector partnerships.\n\nAccording to the Food and Agriculture Organization (FAO), sub-SaharanAfricastill imports over 80% of its wheat consumption, underscoring Zimbabwes rare achievement in the region.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/02/17093132/60d3955786e36.image_.jpg",
            "description": "<p>Milling MEA ZIMBABWE has recorded its highest-ever wheat output, harvesting 578,059 metric tonnes during the 2025 winter season, a milestone that not only exceeds last year’s record but also surpasses the country’s annual wheat requirement. Lands, Agriculture, Fisheries, Water and Rural Development Minister Anxious Masuka announced the achievement, describing it as a confirmation of Zimbabwe’s strengthened</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-harvests-578000-tonnes-of-wheat-surpassing-national-demand/\">Zimbabwe harvests 578,000 tonnes of wheat, surpassing national demand</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "30 Oct 2025"
        }
    ]
}