{
    "news": [
        {
            "title": "Mufakose residents forced to vacate homes as raw sewage floods yards",
            "url": "https://www.newzimbabwe.com/mufakose-residents-forced-to-vacate-homes-as-raw-sewage-floods-yards/",
            "content": "By Darlington Gatsi\n\nFRUSTRATED Mufakose residents have vacated their homes as the City Council fails to address incessant sewer blockages in the suburb, posing serious health challenges.\n\nMufakose residents have endured sewer blockages for over a month, with the Harare City Council showing reluctance to address the dire situation.\n\nCombined Harare Residents Association (CHRA) blasted the lackadaisical approach by the city fathers in addressing the plight of Mufakose residents.\n\nThe City of Harare has been reluctant to resolve the issue, and the residents continue to be affected since registering their first complaint with the Mufakose District office a month ago.\n\nThe situation is dire to the extent that some residents have since vacated their houses following the flow and flooding of their houses with raw sewerage.\n\nUnfortunately, residents have now resorted to open defecation in bushes as an alternative, since their toilets and bathrooms are no longer accessible due to sewer flooding and gushing from toilets, said CHRA in a statement.\n\nThis comes amid reports that Harare City Council employees are on strike, having declared incapacitation following the deaths of colleagues.\n\nHarare residents have been made to endure the city fathers failure to deliver services to the capitals populace.\n\nThe CHRA said the situation is a ticking time bomb that might cause disease outbreaks in the high-density area of Mufakose.\n\nFormal and informal complaints have been made to the local City of Harare District Officer but have yielded no result in addressing the sewerage bursts/blockages.\n\nWe are of the view that the following rights provided in Chapter 4 of the Constitution of Zimbabwe are being infringed or being violated;\n\nSection 73(1) Right to an environment that is not harmful to health or wellbeing; the magnitude of the sewerage bursts are exposing residents to waterborne diseases, and so far residents who reside in Nondo Street have been complaining of stomach pains and diarrhoea and the epicentre of the diarrhoea cases is Nondo Street.\n\nHouses are no longer habitable and at No 18 and 16 Nondo Street residents have evacuated from their houses, and the houses are no longer occupied due to the flooding of the sewer in the houses and yards. In addition, the stench coming out from the sewer is choking, read the statement further.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/16215440/mufakose.jpeg",
            "description": "<p> By Darlington Gatsi FRUSTRATED Mufakose residents have vacated their homes as the City Council fails to address incessant sewer blockages in the suburb, posing serious health challenges. Mufakose residents have endured sewer blockages for over a month, with the Harare City Council showing reluctance to address the dire situation. Combined Harare Residents Association (CHRA) blasted</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mufakose-residents-forced-to-vacate-homes-as-raw-sewage-floods-yards/\">Mufakose residents forced to vacate homes as raw sewage floods yards</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:29",
            "date": "17 Sep 2025"
        },
        {
            "title": "Blue Ribbon stops operations at Bulawayo plant due to grain shortage",
            "url": "https://www.newzimbabwe.com/blue-ribbon-stops-operations-at-bulawayo-plant-due-to-grain-shortage/",
            "content": "By Staff Reporter\n\nOne of Zimbabwes largest milling companies, Blue Ribbon Foods, has halted operations at its Bulawayo plant due to an acute shortage of grain.\n\nThe shutdown was confirmed on Monday during a tour of the plant with Blue Ribbon Sales Coordinator for Matabeleland North, Nqabutho Mkhize, revealing that the company ran out of grain in April this year.\n\nGrain Millers Association of Zimbabwe (GMAZ) Southern Region Chairperson David Moyo painted a bleak picture of dwindling local maize supplies.\n\nAt the beginning, we were able to buy from local farmers and the maize was there.\n\nBut now, it is hard to fill a 30-tonne truck. Sometimes you get three or two 50kg bags a day. It takes a week to fill a truck, said Masuka.\n\nIn response to appeals from millers the government recently lifted the ban on maize imports.\n\nHowever, a new statutory instrument introduced to govern imports has created further complications.\n\nThe regulation imposes a levy on the price difference between imported maize (US$300/tonne from South Africa) and the local producer price (US$200/tonne), payable to the Agricultural Marketing Authority (AMA).\n\nMoyo says this measure is making it financially unviable for millers to import the maize they desperately need to keep their plants operational.\n\nThe statutory instrument is unfair and costly. Eventually, the burden will be passed on to the consumer, Moyo said.\n\nWe are simply asking the government to allow millers to import maize freely, without these added levies, as was previously the case.\n\nHe further emphasised that deregulating the maize import framework would allow market forces to determine prices, ultimately lowering the cost of mealie meal for consumers.\n\nThe private sector is here to complement the government. We are partners in ensuring that no Zimbabwean goes hungry in line with the Presidents own promise that no one will be left behind, Moyo said.\n\nThe continued closure of key milling plants like Blue Ribbon in Bulawayo not only threatens food security in urban areas but also risks job losses and rising mealie meal prices at a time when most households are already battling inflation and economic hardship.\n\nMillers are now calling on the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development to urgently review the statutory instrument and allow for flexible, cost-effective maize importation to stabilise the milling industry.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/16221910/blue-ribbon.jpg",
            "description": "<p>By Staff Reporter One of Zimbabwe’s largest milling companies, Blue Ribbon Foods, has halted operations at its Bulawayo plant due to an acute shortage of grain. The shutdown was confirmed on Monday during a tour of the plant with Blue Ribbon Sales Coordinator for Matabeleland North, Nqabutho Mkhize, revealing that the company ran out of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/blue-ribbon-stops-operations-at-bulawayo-plant-due-to-grain-shortage/\">Blue Ribbon stops operations at Bulawayo plant due to grain shortage</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:29",
            "date": "17 Sep 2025"
        },
        {
            "title": "Zimbabwean households are more food secure, citizens living better lives – government",
            "url": "https://www.newzimbabwe.com/zimbabwean-households-are-more-food-secure-citizens-living-better-lives-government/",
            "content": "By James Muonwa\n\nSTRATEGIC interventions by the government have improved food security and the quality of life for citizens, a survey has established.\n\nAccording to findings of the 2025 Zimbabwe Livelihoods Assessment Committee (ZimLAC) Reports, nutrition has improved both in urban andrural areas.\n\nIn a post-Cabinet media briefing held in Harare this Tuesday, Information, Publicity and Broadcasting Services Minister Jenfan Muswere said Cabinet had considered the reports on Urban Livelihoods, Rural Livelihoods and Rural Nutrition, which were compiled following nationwide assessments conducted between February 19 and March 2 and May 21 to June 9, 2025.\n\nHe said the annual surveys were meant to provide up-to-date information on living conditions across the country, informing policy formulation and strengthening government schemes.\n\nGovernments strong interventions have resulted in improved food security, with the State being the main source of social support in the aftermath of an erratic start to the 2024/2025 summer rainfall season, Muswere said.\n\nHe said the Second Republics milestones are anchored on the framework of national and international strategies such as the National Development Strategy 1 (2021-2025), the Food and Nutrition Security Policy, the Sustainable Development Goals (SDGs), and the Zero Hunger Strategy.\n\nOn nutrition, the proportion of households consuming globally acceptable diets jumped in 2025, signalling an overall improvement in living standards, Muswere noted.\n\nChild health indicators also improved, with Vitamin A supplementation for children aged 6 to 59 months surpassing the 90% national threshold.\n\nHowever, the report raised concern over rising lifestyle-related health challenges, with 35% of adults aged 18 to 59 years classified as overweight or obese.\n\nMuswere pointed out the need to heighten awareness, early disease screening, and implementation of appropriate mitigatory measures.\n\nThe rollout of the Pfumvudza/Intwasa climate-proofing strategy increased from 47% in 2023 to 54% in 2025, reflecting growing resilience in rural households.\n\nMuswere said the government will continue to strengthen social protection programmes targeting vulnerable groups such as widows, child-headed families and persons with disabilities.\n\nThe able-bodied will be encouraged to undertake public works that create community assets while benefiting from Government support schemes, the minister added.\n\nHe further noted that the sustained delivery of social protection, coupled with improved food security and nutrition, had improved social stability, health, education and overall community well-being across Zimbabwe.\n\nIn the education sector, Treasury disbursed ZiG 40 million to cover arrears under the Basic Education Assistance Module (BEAM) dating back to 2023.\n\nGovernment, Muswere added, would continue to prioritise BEAM payments to safeguard access to education for vulnerable learners.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/09054809/muswere.jpeg",
            "description": "<p>By James Muonwa STRATEGIC interventions by the government have improved food security and the quality of life for citizens, a survey has established. According to findings of the 2025 Zimbabwe Livelihoods Assessment Committee (ZimLAC) Reports, nutrition has improved both in urban and rural areas. In a post-Cabinet media briefing held in Harare this Tuesday, Information, Publicity</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-households-are-more-food-secure-citizens-living-better-lives-government/\">Zimbabwean households are more food secure, citizens living better lives – government</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:29",
            "date": "17 Sep 2025"
        },
        {
            "title": "ZPC staff in US$3.9 million property theft scandal, accomplice on the run",
            "url": "https://www.newzimbabwe.com/zpc-staff-in-us3-9-million-property-theft-scandal-accomplice-on-the-run/",
            "content": "By Mary Taruvinga\n\nTwo senior Zimbabwe Power Company (ZPC) employees have appeared in court in Hwange facing charges of stealing company property worth US$3,896,000 in what the state has described as a serious act of economic sabotage.\n\nStores Officer Tawanda Mhaka and Loss Control Assistant Ruth Chiyani were arrested on September 11, 2025, after CCTV footage allegedly captured them facilitating the illegal loading of 15 electric motors, 48 tonnes of brass pipes, and a metal container at the Turbine Hall in August.\n\nAccording to the state, the goods were transported in haulage trucks hired by their alleged accomplice, Hardlife Zimwenje, who remains at large.\n\nOn the 22nd and 23rd of August 2025, a truck was captured on CCTV at the Turbine Hall loading stolen goods without proper documentation. The footage clearly shows the accused overseeing the movement of property valued at nearly US$4 million, the court heard.\n\nProsecutors said Chiyani, whose role was to ensure security compliance, failed to provide invoices to justify the movement of the items, while Mhaka allegedly instructed a boilermaker to cut an electric motor and a storage container to make them easier to load.\n\nThe state argued that the pair abused their trusted positions within ZPC.\n\nThis case serves as a clear example of the accountability required of those entrusted with national assets. Economic sabotage will be thoroughly investigated and those responsible will face serious consequences, said the National Prosecuting Authority.\n\nBoth Mhaka and Chiyani were remanded in custody to September 26, with prosecutors stressing that the evidence against them, including CCTV footage and signed removal authority documents,is overwhelming.\n\nMeanwhile, police said a manhunt is underway for Zimwenje, who allegedly orchestrated the transportation of the stolen property.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/08/26060453/Hwange-Court-e1598418323467.jpg",
            "description": "<p>By Mary Taruvinga Two senior Zimbabwe Power Company (ZPC) employees have appeared in court in Hwange facing charges of stealing company property worth US$3,896,000 in what the state has described as a serious act of economic sabotage. Stores Officer Tawanda Mhaka and Loss Control Assistant Ruth Chiyani were arrested on September 11, 2025, after CCTV</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zpc-staff-in-us3-9-million-property-theft-scandal-accomplice-on-the-run/\">ZPC staff in US$3.9 million property theft scandal, accomplice on the run</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:29",
            "date": "17 Sep 2025"
        },
        {
            "title": "Zanu PF leads human rights abuses for fifth month running – report",
            "url": "https://www.newzimbabwe.com/zanu-pf-leads-human-rights-abuses-for-fifth-month-running-report/",
            "content": "By Costa Nkomo\n\nHuman rights advocacy group, the Zimbabwe Peace Project (ZPP), has once again singled out Zanu PF as a violent political party and the leading perpetrator of human rights violations in Zimbabwe, marking the fifth consecutive month the partyhas perpetrated widespread abuses.\n\nIn August alone, the ZPP recorded 121 violations against which affected more than 3000 citizens, with Zanu PF accounting for 1,376 victims across the country.\n\nAccording to the ZPPs August report, Zanu PF party leaders and ordinary members were both responsible for the violations.\n\nThe majority of perpetrators were affiliated with the ruling ZANU PF party, accounting for 44.4% of documented violations. Within this group, party leaders (26.1%) and ordinary members (18.3%) were the main actors, the report states.\n\nZPPs July report on human rights violations found that Zanu PF violated the rights of more than 2,200 citizens, with party leaders implicated in 22 per cent of the 10,000 human rights violations recorded across the country.\n\nThe ZPP argues that these violations reveal the deep and often hidden harm inflicted upon individuals and communities.\n\nVictims were subjected to threats of violence, assaults, inhuman treatment and forced displacements, each leaving long-lasting scars on dignity, security, and social cohesion, the report highlights.\n\nThe report points to a worrying pattern of rights abuses by Zanu PF, which has long been labelled a violent party before, during, and after election periods, throughout the year.\n\nOther perpetrators of human rights violations included the government of Zimbabwe, the police, and the military, although these were implicated in fewer incidents in August.\n\nGovernment officials contributed 7%, school authorities 3.1%, religious leaders 1.2%, Citizens Coalition for Change leaders 1.2%, and the Zimbabwe National Army 0.4% were also implicated. In 0.8% of cases, perpetrators could not be linked to any known group, the report further states.\n\nHuman rights violations remain a blight on Zimbabwes quest for democracy 45 years after the country gained independence from Britain.\n\nAs the United Nations General Assembly approaches, with Zimbabwe vying for a seat on the Security Council, its human rights record could jeopardise this ambition.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/08/13225415/11643982.jpg",
            "description": "<p>By Costa Nkomo Human rights advocacy group, the Zimbabwe Peace Project (ZPP), has once again singled out Zanu PF as a violent political party and the leading perpetrator of human rights violations in Zimbabwe, marking the fifth consecutive month the party has perpetrated widespread abuses. In August alone, the ZPP recorded 121 violations against which affected</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-leads-human-rights-abuses-for-fifth-month-running-report/\">Zanu PF leads human rights abuses for fifth month running – report</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:29",
            "date": "17 Sep 2025"
        },
        {
            "title": "Industry welcomes cutback on repetitive licensing fees",
            "url": "https://www.newzimbabwe.com/industry-welcomes-cutback-on-repetitive-licensing-fees/",
            "content": "By Alois Vinga\n\nThe Confederation of Zimbabwe Industries (CZI) has applauded the governments decision to reduce and eliminate several repetitive licensing fees, a move it says will significantly improve the ease of doing business.\n\nFinanceMinister Mthuli Ncube last week announced a package of reforms aimed at lowering compliance costs, particularly within the agricultural value chain.\n\nUnder the new measures, the US$500 registration fee for small-scale farmers has been scrapped, while the annual dairy processor registration fee of US$350 has been replaced with a one-off US$50 charge. Feed manufacturing registration fees have been cut from US$250 to US$20, and livestock movement clearance fees have been halved from US$10 to US$5 per herd.\n\nOther changes include a reduction of the livestock genetics import permit from US$100 to US$20, and a cut to the meat export registration fee from US$500 to US$100. The food handler certificate fee has been abolished, while Environmental Impact Assessment (EIA) costs have been capped at 0.05 percent, with a ceiling of US$100,000.\n\nCZI described the reforms as one of the most significant in recent years. According to the industry body, a total of 96 regulations affecting livestock farming, dairy production, processing, and stockfeed manufacturing were reviewed. Of these, 34 were eliminated, and 40 percent were reduced by at least half.\n\nFor dairy farming, nine regulations were eliminated and seven more were cut significantly. In livestock farming, 45 percent of regulations were scrapped, immediately lifting a huge burden on producers, CZI said.\n\nThe review found that compliance costs in some areas had been reduced by up to 99 percent. The Zimbabwe National Water Authority (ZINWA) accounted for the highest number of eliminated regulations at 10, followed by local authorities with eight and the Environmental Management Agency (EMA) with seven. At least 12 high-cost regulationspreviously charging over US$400 eachwere scrapped, while turnover-based levies were capped to avoid penalising larger firms.\n\nRemoving disproportionate charges was critical. The size of a company does not automatically translate into higher enforcement costs, and the new system finally reflects that reality, added CZI.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/03/14204722/Mthuli-Ncube.jpg",
            "description": "<p>By Alois Vinga The Confederation of Zimbabwe Industries (CZI) has applauded the government’s decision to reduce and eliminate several repetitive licensing fees, a move it says will significantly improve the ease of doing business. Finance Minister Mthuli Ncube last week announced a package of reforms aimed at lowering compliance costs, particularly within the agricultural value chain.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/industry-welcomes-cutback-on-repetitive-licensing-fees/\">Industry welcomes cutback on repetitive licensing fees </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:29",
            "date": "17 Sep 2025"
        },
        {
            "title": "Zanu PF youths killed in car crash en route to Mnangagwa’s birthday bash",
            "url": "https://www.newzimbabwe.com/zanu-pf-youths-killed-in-car-crash-en-route-to-mnangagwas-birthday-bash/",
            "content": "By Staff Reporter\n\nTWO Zanu PF youths, who were en route to President Emmerson Mnangagwas 83rd birthday bash in Zvishavane, died on Monday after their vehicle was involved in a head-on collision with a bus.\n\nThe fatal crash claimed the lives of two female party activists, who were aboard the double-cab vehicle belonging to Zanu PF Youth League Mashonaland West Chairman Tapiwa Masenda, who was not in the car.\n\nOne of the victims was Masendas personal assistant.\n\nNational police spokesperson, Commissioner Paul Nyathi confirmed the road traffic accident.\n\nThe ZRP confirms a fatal road traffic accident which occurred on September 15, 2025 at around 1230 hours at the 100 kilometre peg along Gweru-Zvishavane Road.\n\nTwo people were killed while two others were injured when a Toyota Hilux vehicle with three passengers on board was involved in a head-on collision with a bus carrying eight passengers, said Nyathi.\n\nThe bodies of the victims were taken to Zvishavane District Hospital mortuary for post-mortem, while the injured were admitted to the same hospital.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/16213612/zanu-accident.jpeg",
            "description": "<p>By Staff Reporter TWO Zanu PF youths, who were en route to President Emmerson Mnangagwa’s 83rd birthday bash in Zvishavane, died on Monday after their vehicle was involved in a head-on collision with a bus. The fatal crash claimed the lives of two female party activists, who were aboard the double-cab vehicle belonging to Zanu</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-youths-killed-in-car-crash-en-route-to-mnangagwas-birthday-bash/\">Zanu PF youths killed in car crash en route to Mnangagwa’s birthday bash </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:29",
            "date": "17 Sep 2025"
        },
        {
            "title": "Malawi counts votes after presidential election amid economic crisis",
            "url": "https://www.newzimbabwe.com/malawi-counts-votes-after-presidential-election-amid-economic-crisis/",
            "content": "Al Jazeera\n\nCounting is under way inMalawiafter a presidential election that comes as the southeast African nation faces its worst economic crisis in decades, with soaring inflation, food shortages and the mounting impacts of climate change.\n\nSeventeen candidates are running for president, but the race is widely viewed as a contest between incumbent Lazarus Chakwera, 70, and his predecessor Peter Mutharika, 85.\n\nThe rivals have met twice at the ballot box: first in 2014, when Mutharika won, and again in 2020, when Chakwera triumphed in a rerun with 59 percent after the original vote was annulled for irregularities.\n\nLong lines formed outside polling stations on Tuesday morning, before the turnout fell sharply later in the day. By mid-afternoon, the electoral commission reported only 51 percent turnout, compared with 64 percent in 2020.\n\nBoth Chakwera, an evangelical pastor, and Mutharika, a former law professor, face allegations of cronyism and corruption.\n\nHowever, analysts say none of the other candidates, including former President Joyce Banda, the only woman in the race, has been able to break the dominance of the two frontrunners.\n\nChakwera is seeking a second term on the promise to fix the economy and restore confidence in government. Mutharika has campaigned on his record of infrastructure investment, though his time in office was also marked by corruption scandals.\n\nIt comes as Malawis 21.6 million people are grappling with inflation above 27 percent, foreign currency shortages, and chronic fuel disruptions. The economy is heavily dependent on agriculture, especially tobacco, but has been battered by the climate crisis.\n\nIn 2023, Cyclone Freddy killed more than 1,200 people in Malawi and devastated farmland, while recurring droughts have worsened food insecurity. The World Bank says 70 percent of Malawians live on less than $2.15 a day.\n\nAlongside the presidential vote, Malawians also elected members of parliament and local councillors across 35 local governments.\n\nIf no candidate wins more than 50 percent of the vote, a run-off will be held within 60 days. Provisional results from Tuesdays first round are expected by Thursday.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/16212811/malawi-vote-count.webp",
            "description": "<p>Al Jazeera Counting is under way in Malawi after a presidential election that comes as the southeast African nation faces its worst economic crisis in decades, with soaring inflation, food shortages and the mounting impacts of climate change. Seventeen candidates are running for president, but the race is widely viewed as a contest between incumbent Lazarus Chakwera,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/malawi-counts-votes-after-presidential-election-amid-economic-crisis/\">Malawi counts votes after presidential election amid economic crisis</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:29",
            "date": "17 Sep 2025"
        }
    ]
}