{
    "news": [
        {
            "title": "Musicians4ED: Winky D’s producer leads Mnangagwa’s 2030 choir",
            "url": "https://www.newzimbabwe.com/musicians4ed-winky-ds-producer-leads-mnangagwas-2030-choir/",
            "content": "By Staff Reporter\n\nMUSIC producer Nicky Genius, famed for producing several songs for dancehall star Winky D, has become the latest artist to be roped in to lead a chorus for the extension of President Emmerson Mnangagwas term.\n\nNicky Genius has been frequenting ZANU PF events, performing before the partys officials, Kudakwashe Tagwirei and Taurai Kandishaya.\n\nAt a recent ZANU PF event, the music producer led the chorus endorsing the extension of President Mnangagwas tenure beyond its expiry in 2028.\n\nSo guys, 2030 baba varipo pachigaro. Pamberi na Va Mnangagwa. 2030 vanenge vachiripo (2030 President Mnangagwa will be reigning), sang Nicky Genius.\n\nIronically, Nicky Genius produced several of Winky Ds social commentary songs that castigate corruption by the elite at the expense of the poor.\n\nHowever, the producer appears to have joined the bandwagon of artists who have declared support for the ruling party.\n\nNicky Genius has become the latest musician to be drawn into supporting ZANU PF after several artists recently coalesced under the Musicians 4ED, an organisation seeking to endorse President Mnangagwa.\n\nZANU PFs affiliates, which had been dormant since the 2023 elections, have resurfaced as factionalism over the extension of President Mnangagwas term rears its ugly head.\n\nAccording to observers, celebrities have been jostling to support ZANU PF for the lavish gifts that are being thrown around by the partys benefactors, such as Wicknell Chivayo, Tagwirei and Paul Tungwarara.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/18042336/nicky-genius.jpg",
            "description": "<p>By Staff Reporter MUSIC producer Nicky Genius, famed for producing several songs for dancehall star Winky D, has become the latest artist to be roped in to lead a chorus for the extension of President Emmerson Mnangagwa’s term. Nicky Genius has been frequenting ZANU PF events, performing before the party’s officials, Kudakwashe Tagwirei and Taurai</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/musicians4ed-winky-ds-producer-leads-mnangagwas-2030-choir/\">Musicians4ED: Winky D’s producer leads Mnangagwa’s 2030 choir</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "18 Nov 2025"
        },
        {
            "title": "Brendan Galloway injury update as Plymouth Argyle defender set to get all clear",
            "url": "https://www.newzimbabwe.com/brendan-galloway-injury-update-as-plymouth-argyle-defender-set-to-get-all-clear/",
            "content": "Plymouth Live\n\nPlymouth Argyle defender Brendan Galloway is expected to be available for the important League One away game against Port Vale on Saturday despite not being involved for Zimbabwe in a friendly international against Qatar on Monday.\n\nThe 27-year-old suffered a minor facial injury playing for his country in a 3-1 defeat by Algeria in another friendly international last Thursday, which was played in Saudi Arabia.\n\nGalloway started the match at the Prince Abdullah Al-Faisal Stadium in Jeddah but was substituted in the 84th minute as he made his seventh appearance for Zimbabwe.\n\nGalloway will be assessed by Argyles medical department on his return to Home Park from international duty later this week.\n\nThe friendly internationals against Algeria and Qatar, under newly-appointed head coach Mario Marinica, are Zimbabwes final games before they compete at the 2025 Africa Cup of Nations in Morocco at the end of December.\n\nZimbabwe have been drawn in Group B and will play games against Egypt on December 22, South Africa on December 26 and Angola on December 29.\n\nWith Galloway expected to be included in the Warriors squad for the tournament, he is likely to miss a few matches for Argyle over the Christmas and New Year period.\n\nArgyle are bottom of League One and did not have a game at the weekend because of international call-ups, including that of Galloway, while Port Vale moved up one position to 22nd after a 0-0 draw at home to Wycombe Wanderers.\n\nPilgrims boss Tom Cleverley was among the crowd at Vale Park as he took the opportunity to get a first-hand glimpse of Darren Moores Valiants.\n\nIt was a result which moved the Staffordshire side a point clear of the Pilgrims, but they have now played one more match than them.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/18042712/Brendan-Galloway.png",
            "description": "<p>Plymouth Live Plymouth Argyle defender Brendan Galloway is expected to be available for the important League One away game against Port Vale on Saturday despite not being involved for Zimbabwe in a friendly international against Qatar on Monday. The 27-year-old suffered a minor facial injury playing for his country in a 3-1 defeat by Algeria</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/brendan-galloway-injury-update-as-plymouth-argyle-defender-set-to-get-all-clear/\">Brendan Galloway injury update as Plymouth Argyle defender set to get all clear</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "18 Nov 2025"
        },
        {
            "title": "Tagwirei bankrolled Zanu PF’s 2013 campaign, reveals former Minister Shamu – says controversial tycoon ‘not new’ to the ruling party",
            "url": "https://www.newzimbabwe.com/tagwirei-bankrolled-zanu-pfs-2013-campaign-reveals-former-minister-shamu-says-controversial-tycoon-not-new-to-the-ruling-party/",
            "content": "By Leopold Munhende\n\nFormer Zanu PF political commissar Webster Shamu has revealed that businessman Kudakwashe Tagwirei played a major role in the ruling partys 2013 election victory by financing its campaign.\n\nShamu, famed for his vaMugabe iCremora praise-singing, made the remarks at a Provincial Coordinating Committee (PCC) meeting in Chinhoyi over the weekend.\n\nHe said Tagwirei, who was recently co-opted into Zanu PFs influential Central Committee, quietly provided key resources that helped secure the partys win.\n\nFormer Minister Webster Shamu\n\nI did not get to know Tagwirei today; many of us have known him for years.\n\nFor the first time in public, I will tell you that Tagwirei financed our 2013 election campaign. He gave us resources, ensured we had fuel, and provided everything we needed.\n\nWe did not say this in newspapers because he is a quiet, disciplined, and humble leader, said Shamu.\n\nZanu PF went on to claim 61.88% of the presidential vote in 2013 and secured 196 of the 270 contested parliamentary seats.\n\nTagwirei has recently taken an increasingly visible role in the ruling partys affairs and is widely viewed as a potential successor to President Emmerson Mnangagwa in 2028 or 2030, depending on whether Mnangagwas second-term extension push succeeds.\n\nHis main rival remains Vice President Constantino Chiwenga, whose presidential ambitions have long been known.\n\nWhile Chiwenga has kept a low profile, Tagwirei has been a prominent guest at party events, reportedly donating more than US$500,000.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/15160729/tagwirei.jpeg",
            "description": "<p>By Leopold Munhende Former Zanu PF political commissar Webster Shamu has revealed that businessman Kudakwashe Tagwirei played a major role in the ruling party’s 2013 election victory by financing its campaign. Shamu, famed for his “vaMugabe iCremora” praise-singing, made the remarks at a Provincial Coordinating Committee (PCC) meeting in Chinhoyi over the weekend. He said</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tagwirei-bankrolled-zanu-pfs-2013-campaign-reveals-former-minister-shamu-says-controversial-tycoon-not-new-to-the-ruling-party/\">Tagwirei bankrolled Zanu PF’s 2013 campaign, reveals former Minister Shamu – says controversial tycoon ‘not new’ to the ruling party</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "18 Nov 2025"
        },
        {
            "title": "Cash-strapped Zimbabweans cut back on cigarettes – BAT",
            "url": "https://www.newzimbabwe.com/cash-strapped-zimbabweans-cut-back-on-cigarettes-bat/",
            "content": "By Alois Vinga\n\nBritish American Tobacco (BAT) Zimbabwe says cigarette consumption has dropped by 7%, a decline it attributes to reduced disposable incomes owing to macroeconomic challenges.\n\nWhile the exact annual number of cigarettes smoked in Zimbabwe is not publicly available, market forecasts suggest national consumption could reach 531.4 million sticks by 2030.\n\nIn its trading update for the nine months ended September 30, 2025, BAT chairperson Lovemore Manatsa said tightening consumer spending was beginning to weigh on volumes.\n\nBAT chairperson Lovemore Manatsa\n\nSales volumes declined by 7% to 593 million sticks, and consequently cigarette revenue fell 22% to US$21 million compared to the same period last year. This was due to stretched consumer spending, a challenging macroeconomic environment, and a shift in pricing strategy from ZWG to US dollars, said Manatsa.\n\nDespite the volume and revenue drops, profitability recovered significantly. Profit before tax rose to US$11 million, a turnaround from a US$3 million loss recorded during the same period last year,a 491% year-on-year growth. The improvement was largely driven by reduced foreign-exchange losses and lower inflationary impacts.\n\nOperating costs also fell sharply to US$10 million, a 66% decline from the prior year, reflecting lower forex losses, easing inflation pressures, and the implementation of cost-management initiatives.\n\nThe company noted that enhanced distribution efficiency, closer engagements with traders, and performance-focused trade programmes helped support volume delivery. BAT described the external environment as dynamic but relatively stable, bolstered by steady inflation and a more stable exchange rate driven by ongoing monetary policy interventions.\n\nHowever, Manatsa warned that challenges persist, including liquidity constraints, high borrowing costs, and frequent power outages that continue to disrupt industrial productivity.\n\nLooking ahead, the Company remains focused on reinforcing the strength and sustainability of the business by driving volume recovery through increased focus on the value segment, improving product availability across all markets and channels, and enhancing operational efficiency by optimising supply-chain processes and reducing our cost to serve in order to protect profitability, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/18040956/smoking.jpg",
            "description": "<p>By Alois Vinga British American Tobacco (BAT) Zimbabwe says cigarette consumption has dropped by 7%, a decline it attributes to reduced disposable incomes owing to macroeconomic challenges. While the exact annual number of cigarettes smoked in Zimbabwe is not publicly available, market forecasts suggest national consumption could reach 531.4 million sticks by 2030. In its</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cash-strapped-zimbabweans-cut-back-on-cigarettes-bat/\">Cash-strapped Zimbabweans cut back on cigarettes – BAT</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "18 Nov 2025"
        },
        {
            "title": "Warriors beat Qatar to end winless run",
            "url": "https://www.newzimbabwe.com/warriors-beat-qatar-to-end-winless-run/",
            "content": "By Sports Reporter\n\nThe Warriors long winless run finally came to an end on Monday evening after securing a 2-1 victory over Qatar in an international friendly played at Abdullah bin Nasser bin Khalifa Stadium.\n\nThe match marked the second outing for new Romanian coach Marian Marinica, who opened his tenure with a 3-1 defeat to Algeria last week.\n\nMarinica fielded a completely changed side from the one that started against Algeria on Thursday.\n\nZimbabwe fell behind early in the 9th minute when Qatars Muhamed Gouda unleashed a powerful strike that left goalkeeper Elvis Chipezeze with no chance.\n\nHowever, the Warriors responded in the 23rd minute through Munashe Garananga, who headed home from a corner kick.\n\nZimbabwe nearly doubled their lead in the 33rd minute, but Msendami failed to hit the target despite being well placed.\n\nWith the teams level at the break, Marinica made two changes at the start of the second half, introducing Gerald Takwara and Bill Antonio for Teenage Hadebe and Sean Fusire.\n\nHis substitutions paid off in the 74th minute when Bill Antonio scored the winner.\n\nMondays victory is Zimbabwes first win of the year in all competitions and provides a timely boost as the team prepares for the 2025 AFCON.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/17190927/warriors-qatar.jpg",
            "description": "<p>By Sports Reporter The Warriors’ long winless run finally came to an end on Monday evening after securing a 2-1 victory over Qatar in an international friendly played at Abdullah bin Nasser bin Khalifa Stadium. The match marked the second outing for new Romanian coach Marian Marinica, who opened his tenure with a 3-1 defeat</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/warriors-beat-qatar-to-end-winless-run/\">Warriors beat Qatar to end winless run</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "18 Nov 2025"
        }
    ]
}