{
    "news": [
        {
            "title": "Mzembi’s appeal trashed, High Court rules ex-minister “took the court for granted”",
            "url": "https://www.newzimbabwe.com/mzembis-appeal-trashed-high-court-rules-ex-minister-took-the-court-for-granted/",
            "content": "By Mary Taruvinga\n\nThe High Court has dismissed former cabinet minister Walter Mzembis bid for bail pending trial, ruling that his seven-year absence from court showed a wilful disregard for the law and made him an untrustworthy candidate for release.\n\nJustice Maxwell Dembure, handing down judgment in Harare, said the ex-minister  facing charges of theft of trust property involving over US$1 million in public assets  failed to prove any exceptional circumstances justifying his freedom.\n\nIt is common cause that the appellant was on outstanding warrants of arrest for almost seven years, Justice Dembure said. There was nothing to show that he was incapacitated or bedridden for all these years until June 2025. Clearly, the evidence was not convincing.\n\nMzembi, who fled the country in 2018 after being granted temporary release of his passport for medical treatment in South Africa, only resurfaced in June 2025. He argued that his cancer treatment explained his absence and that changed circumstances, including the withdrawal of charges against his co-accused, warranted his release on bail.\n\nBut the judge was unmoved, stressing that the existence of new facts does not automatically result in the applicant being granted bail.\n\nDembure found that Mzembis conduct had caused the prolonged delay in bringing the case to trial: His long absence from the jurisdiction of the court clearly caused the delay in the finalisation of his case. Having made his bed, he must lie on it.\n\nThe court also rejected arguments based on property title deeds tendered as surety. Those averments do not plead the issue of title deeds as a ground for bail on changed circumstances, ruled Dembure.\n\nIf the court was convinced that, despite the long default, he could be trusted with his liberty, it would have accepted them earlier. It did not.\n\nConcluding, the judge said there was no basis to interfere with the magistrates original decision to revoke Mzembis bail.\n\nThe appeal is completely without merit. It must fail, he ruled.\n\nMzembi will remain in custody pending trial.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/05/10034227/Walter-Mzembi.jpg",
            "description": "<p>By Mary Taruvinga The High Court has dismissed former cabinet minister Walter Mzembi’s bid for bail pending trial, ruling that his seven-year absence from court showed a wilful disregard for the law and made him an untrustworthy candidate for release. Justice Maxwell Dembure, handing down judgment in Harare, said the ex-minister — facing charges of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mzembis-appeal-trashed-high-court-rules-ex-minister-took-the-court-for-granted/\">Mzembi’s appeal trashed, High Court rules ex-minister “took the court for granted”</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:32",
            "date": "26 Aug 2025"
        },
        {
            "title": "High Court slaps Chinese miner with ban in mine dispute",
            "url": "https://www.newzimbabwe.com/high-court-slaps-chinese-miner-with-ban-in-mine-dispute/",
            "content": "By Mary Taruvinga\n\nThe Chinhoyi High Court has barred Beijing Broadtec Investments (Pvt) Ltd from carrying out any mining operations at the contested Mukovo 12 Mine in Mashonaland West Province, blasting the Chinese firms conduct as unlawful and a threat to the late Josphat Mutiziras estate.\n\nJustice Philda Muzofa, granting a provisional order, interdicted the company together with its employees and/or agents and/or assignees from mining or interfering with the estates rights, pending the outcome of an appeal lodged with the Minister of Mines.\n\nThe applicant has been on the mining location for over five years and has obviously heavily invested in the mining entity, Muzofa said.\n\nEven if there are no mining rights since they were suspended, in my view, the applicant still has the residual rights to protect its interests in the property.\n\nThe executor of the estate, Elmon Mutizira, approached the court after Beijing Broadtec allegedly violently invaded Mukovo 12 on June 27, evicted workers, vandalised equipment, and deployed guards at the site.\n\nJustice Muzofa tore into the miners defence that its presence at Mukovo 12 was merely for security purposes, stressing that the company had no lawful rights to protect under its EPO (Exclusive Prospecting Order).\n\nIf the 1st respondent is a law-abiding citizen, why would it resist such an order to prohibit activities at Mukovo 12? the judge asked. It has no mining rights to protect and no right to post security at Mukovo 12.\n\nThe court also dismissed Broadtecs attempt to block the application on the dirty hands doctrine after accusing Mutizira of trying to sneak out of mine dumps. There are no dirty hands to speak of, Justice Muzofa ruled. It is incomprehensible that 1st respondent insisted that the applicant must not be heard until it purged its contempt, yet there was nothing to purge.\n\nFinding the balance of convenience tilted in favour of the estate, Muzofa ruled that without the interdict, the applicant stands to lose his equipment to vandalism. If the 1st respondent continues to conduct mining activitiesthe applicant stands to lose the value of minerals.\n\nThe order effectively freezes all activity at Mukovo 12 until the Minister of Mines determines Mutiziras pending appeal.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/13181521/high-court-of-zimbabwe-3.jpg",
            "description": "<p>By Mary Taruvinga The Chinhoyi High Court has barred Beijing Broadtec Investments (Pvt) Ltd from carrying out any mining operations at the contested Mukovo 12 Mine in Mashonaland West Province, blasting the Chinese firm’s conduct as unlawful and a threat to the late Josphat Mutizira’s estate. Justice Philda Muzofa, granting a provisional order, interdicted the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-slaps-chinese-miner-with-ban-in-mine-dispute/\">High Court slaps Chinese miner with ban in mine dispute</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:32",
            "date": "26 Aug 2025"
        },
        {
            "title": "Over 500 Rwandan refugees return from DRC amid peace process",
            "url": "https://www.newzimbabwe.com/over-500-rwandan-refugees-return-from-drc-amid-peace-process/",
            "content": "TRT Global\n\nOver 500 Rwandan refugees returned to the country on Monday from the Democratic Republic of the Congo.\n\nSome 533 returnees, the majority of whom were women and children, were transported to a transit centre in western Rwandas Rusizi district before being reintegrated into communities, the Ministry of Emergency Management of Rwanda said in a statement on X.\n\nThis is the first group of refugees to be repatriated under an agreementsigned last month between Rwanda, DRC, and the UN High Commissioner for Refugees (UNHCR) to respect refugees right to voluntary repatriation to their countries of origin.\n\nThe returnees have been living in a temporary camp in Goma, eastern DRC, which is currently controlled by M23 rebels.\n\nIn a post on X, Rwandan Foreign Minister Olivier Nduhungirehe said its good to note that Rwandan refugees continue to return home despite the noise made by some Western spoilers.\n\nLast month,Rwanda and DRC committed to enabling the safe and voluntary return of refugeesin view of recent diplomatic efforts, notably the Washington-brokered peace agreement between Kinshasa and Kigali, as well as the declaration of principles signed on July 19 in Doha between the Congolese government and the M23 rebels.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/25201345/rwanda-refugee.webp",
            "description": "<p>TRT Global Over 500 Rwandan refugees returned to the country on Monday from the Democratic Republic of the Congo. Some 533 returnees, the majority of whom were women and children, were transported to a transit centre in western Rwanda’s Rusizi district before being reintegrated into communities, the Ministry of Emergency Management of Rwanda said in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/over-500-rwandan-refugees-return-from-drc-amid-peace-process/\">Over 500 Rwandan refugees return from DRC amid peace process</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:32",
            "date": "26 Aug 2025"
        },
        {
            "title": "Police intercept stolen R700,000 Mercedes-Benz in Limpopo, en route to Zimbabwe",
            "url": "https://www.newzimbabwe.com/police-intercept-stolen-r700000-mercedes-benz-in-limpopo-en-route-to-zimbabwe/",
            "content": "IOL\n\nA member of the South African Police Service (SAPS) was injured in a shootout during a high-risk joint anti-smuggling operation conducted in Limpopo, where a stolen Mercedes-Benz was recovered.\n\nPolice officers in Limpopo arrested two suspects while recovering the luxury vehicle along the N1 in Botlokwa.\n\nProvincial police spokesperson, Brigadier Hlulani Mashaba, said the operation was launched after intelligence was received regarding two vehicles  a Mercedes-Benz C200 and an Audi A3  stolen during a business robbery in Boksburg, Gauteng.\n\nThe vehicles were stolen on 12 August.\n\nInformation indicated that the suspects intended to smuggle the vehicles into Zimbabwe through the Beitbridge border post, said Mashaba.\n\nA tactical team was deployed and intercepted the vehicles near Botlokwa in the Capricorn District. As police attempted to stop them, the occupants of the Audi opened fire, sparking a shootout in which one police officer was wounded.\n\nMashaba said despite coming under attack, the joint law enforcement team displayed bravery and professionalism, continuing with the operation under life-threatening conditions.\n\nThe Audi managed to flee and evade police, but the Mercedes-Benz was cornered.\n\nTwo suspects  a 25-year-old South African male and a 48-year-old foreign national  were arrested on the scene. The recovered Mercedes-Benz is valued at approximately R700,000, said Mashaba.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/25115959/Screenshot-2025-08-25-at-12.59.37.png",
            "description": "<p>IOL A member of the South African Police Service (SAPS) was injured in a shootout during a high-risk joint anti-smuggling operation conducted in Limpopo, where a stolen Mercedes-Benz was recovered. Police officers in Limpopo arrested two suspects while recovering the luxury vehicle along the N1 in Botlokwa. Provincial police spokesperson, Brigadier Hlulani Mashaba, said the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/police-intercept-stolen-r700000-mercedes-benz-in-limpopo-en-route-to-zimbabwe/\">Police intercept stolen R700,000 Mercedes-Benz in Limpopo, en route to Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:32",
            "date": "26 Aug 2025"
        },
        {
            "title": "Man jailed 20 years for raping 90-year-old woman",
            "url": "https://www.newzimbabwe.com/man-jailed-20-years-for-raping-90-year-old-woman/",
            "content": "By Staff Reporter\n\nA ZVISHAVANE man has been sentenced to an effective 20-year jail term for raping a 90-year-old womanfrom the village.\n\nThe accused person, aged 50, of Bankwe in Mberengwa, appeared at Zvishavane Magistrates Court, where he was convicted of rape and slapped with 20 years imprisonment.\n\nCourt heard that on June 11, 202,5 at around 9pm, the victim was sleeping in her bedroom when the offender knocked and identified himself as the victims grandson.\n\nAfter sensing danger, the elderly woman refused to open the door, prompting him to forcibly enter the complainants bedroom.\n\nWhilst inside the room, the attacker pushed the woman to the ground before rapingher amid screams for help to no avail.\n\nIt was further heard that the following morning, the victim reported her ordeal to her other neighbour, who accompanied her to lodge a police report, leading to the accused persons arrest.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/02/06125625/jail-e1675980742403.jpg",
            "description": "<p>By Staff Reporter A ZVISHAVANE man has been sentenced to an effective 20-year jail term for raping a 90-year-old woman from the village. The accused person, aged 50, of Bankwe in Mberengwa, appeared at Zvishavane Magistrates’ Court, where he was convicted of rape and slapped with 20 years imprisonment. Court heard that on June 11, 202,5</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-jailed-20-years-for-raping-90-year-old-woman/\">Man jailed 20 years for raping 90-year-old woman</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:32",
            "date": "26 Aug 2025"
        },
        {
            "title": "MacG and Robot Boi make waves with their cameos on ‘Shaka iLembe’",
            "url": "https://www.newzimbabwe.com/macg-and-robot-boi-make-waves-with-their-cameos-on-shaka-ilembe/",
            "content": "TimesLive\n\nThe latest episode of Mzansi MagicsShaka iLembehas fans buzzing with excitement after Mac G and Robot Boi made their unexpected cameos on the show.\n\nThe two stars took to their timeline to reflect on their experiences.\n\nQWAAAAAABE.Liyabonga iLobot Madoda, Robot Boi, who did a monologue in Zulu, captioned the post showcasing images from the set of the hit show.\n\nMacG also recounted his experience on the latest episode ofPodcast and Chill.\n\nThe podcaster revealed that they shot their scenes from 9am to 5pm under the scorching hot sun while wearing g-strings.\n\nHe went on to say that with this having been his acting debut, he had new-found respect for thespians.\n\nWe shot the whole day. The sun was crazy. We were standing in the sun the whole day, he said.The energy was different. Its a different atmosphere, you feel like youre back in those days. I felt Zulu by the end of the day. When I got there, I had a fade. It took an hour for them to put [faux] hair on. That was a hard day of work.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/25202222/shaka-ilembe-macg-robotboi.jpg",
            "description": "<p>TimesLive The latest episode of Mzansi Magic’s Shaka iLembe has fans buzzing with excitement after Mac G and Robot Boi made their unexpected cameos on the show. The two stars took to their timeline to reflect on their experiences. “‘QWAAAAAABE’. Liyabonga iLobot Madoda,” Robot Boi, who did a monologue in Zulu, captioned the post showcasing images from the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/macg-and-robot-boi-make-waves-with-their-cameos-on-shaka-ilembe/\">MacG and Robot Boi make waves with their cameos on ‘Shaka iLembe’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:32",
            "date": "26 Aug 2025"
        },
        {
            "title": "Zimbabwe brings back maize import ban after bumper harvest",
            "url": "https://www.newzimbabwe.com/zimbabwe-brings-back-maize-import-ban-after-bumper-harvest/",
            "content": "Reuters\n\nZimbabwe has brought back a ban on maize imports to boost local farmers, and has grown enough of its own this year to supply its millers after a bumper harvest, a senior agriculture ministry official said on Monday.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/06/20235158/Maize.jpg",
            "description": "<p>Reuters Zimbabwe has brought back a ban on maize imports to boost local farmers, and has grown enough of its own this year to supply its millers after a bumper harvest, a senior agriculture ministry official said on Monday. Improved rainfall boosted output and reversed a sharp decline last year when an El Nino-induced drought forced the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-brings-back-maize-import-ban-after-bumper-harvest/\">Zimbabwe brings back maize import ban after bumper harvest</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:32",
            "date": "26 Aug 2025"
        }
    ]
}