{
    "news": [
        {
            "title": "Government ministries to access 2025 National Budget allocations after Mnangagwa signs two Bills into law",
            "url": "https://www.newzimbabwe.com/government-ministries-to-access-2025-national-budget-allocations-after-mnangagwa-signs-two-bills-into-law/",
            "content": "By Anna Chibamu\n\nPRESIDENT Emmerson Mnangagwa has assented to two Bills paving way for government ministries to access their 2025 National Budget allocations approved by Parliament.\n\nThrough a notice in an Extraordinary Government Gazette last week, Treasury said the Finance and the Appropriation bills were now law.\n\nThe Appropriation Act authorises most of governments spending for the year while other legislation such as the Finance Act, among others, can also be used to justify expenditure.\n\nA total of ZiG276.4 billion National Budget was presented to Parliament last November but was yet to be disbursed awaiting due process, which includes the assenting of Bills by the President.\n\nThe allocated budget can now find its way into the line Ministries, Departments and Agencies (MDAs) after applications for the funds are submitted to the Finance ministry.\n\nSport, Recreation, Arts and Culture ministry acting secretary Euginea Chidhakwa told Sport Portfolio committee acting chairperson (then) Farai Jere (now chairperson of the Sport portfolio committee) that her ministry got a salaries allocation without anything for programmes to the tune of ZiG908.8 million.\n\nThe government is hoping to increase its income/revenue base through a raft of taxes that were introduced by Finance Minister Mthuli Ncube last November.\n\nThe informal sector is now heavily taxed after going for decades without paying taxes to the government.\n\nThose into sport betting will now pay a 10 percent tax of their winnings deducted when they are paid out and sent to the Zimbabwe Revenue Authority (ZIMRA) by the betting house, which will themselves pay three percent of their gross monthly income.\n\nA half percent surcharge is now being charged on the sale value of less healthy fast foods that include burgers, pizza, chips, chicken and doughnuts among others that will be announced in regulations to be published later.\n\nA 20 percent surcharge now applies on the sale value of non-renewable plastic carrier bags whether manufactured locally or imported.\n\nSome of the taxes were heavily criticised by Members of Parliament and the public.\n\nNcube, presenting his budget said, The year 2024 has been an extraordinary year, presenting both challenges and opportunities. The challenges have impacted on the economy, peoples lives and progress towards achieving the nations Vision 2030 of becoming an upper middle-income society.\n\nThe economy has, however, shown remarkable resilience, reflecting governments successful implementation of strategic reforms and policies since 2018.\n\nDuring National Budget debates in Parliament, most lawmakers were concerned about the mining and agriculture sectors, saying the expansion of the two meant employment creation (with a double digit) and economic growth.\n\nLands, Agriculture, Fisheries, Water and Rural Development was allocated ZiG22,9 billion.\n\nAlso, the issue of mining royalties and taxes took a centre stage as legislators felt government was not realising many dividends from the mining industry.\n\nWe need more exploration allocations and indicate some new mining areas to boost revenue for the country, said an MP during one of the Bills debates at New Parliament Building in Mt Hampden last year.\n\nMines ministry was allocated ZiG764.8 million.\n\nThe Primary and Secondary Education ministry got the highest vote pegged at ZiG46,7 billion. The portfolio has faced problems whereby the Better Education Assistance Module (BEAM) programme has not been funded adequately in the past decade.\n\nLast year, BEAM beneficiaries reportedly failed to sit for their Ordinary and Advanced Level ZIMSEC exams for non-payment of fees due to late disbursements.\n\nHealth and Child Care was allocated a mere ZiG28,8 billion but considering challenges being faced by public health institutions in the country, the allocated funds by Parliament are not adequate for the year.\n\nZimbabwe health sector is supported by donor funds but still, even councils are failing to buy baby cards for the newly born babies as well as syringes.\n\nFinance ministry got ZiG28,7 billion while the Ministry of Defence was allocated ZiG18,05 billion.\n\nThe Public Service ministry was allocated a mere ZiG10,7 billion although the portfolio has a huge burden to cater for the vulnerable groups, which includes the pensioners and orphans.\n\nTransport and Infrastructure Development was allocated ZiG5,4 billion while the Parliament of Zimbabwe got ZiG2,7 billion.\n\nThe 2025 Budget comprises ZiG234 688 015 000 in expected revenues charged to the Consolidated Revenue Fund and ZiG6 248 797 000 in retention funds that are meant for specific purposes as provided for by the Public Finance Management Act.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/24150858/Mthuli-Ncube-2-e1669302783839.png",
            "description": "<p>By Anna Chibamu PRESIDENT Emmerson Mnangagwa has assented to two Bills paving way for government ministries to access their 2025 National Budget allocations approved by Parliament. Through a notice in an Extraordinary Government Gazette last week, Treasury said the Finance and the Appropriation bills were now law. The Appropriation Act authorises most of government’s spending</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/government-ministries-to-access-2025-national-budget-allocations-after-mnangagwa-signs-two-bills-into-law/\">Government ministries to access 2025 National Budget allocations after Mnangagwa signs two Bills into law </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "05 Jan 2025"
        },
        {
            "title": "Presidential spokesman George Charamba dismissal rumours gain traction",
            "url": "https://www.newzimbabwe.com/presidential-spokesman-george-charamba-dismissal-rumours-gain-traction/",
            "content": "By Staff Reporter\n\nUNCONFIRMED reports emerging from various sources indicate President Emmerson Mnangagwa has fired his spokesperson, George Charamba.\n\nCharamba, who is Deputy Chief Secretary responsible for Presidential Communications, has lately gained notoriety for his acerbic tongue, which has seen Zimbabwean social media users clamouring for his dismissal on grounds of fanning toxicity.\n\nMnangagwa, through his Chief Secretary Martin Rushwaya, last Thursday announced the reassignment of ministers July Moyo to the Energy Ministty and Edgar Moyo, marking the beginning of changes to his team of top aides and military henchmen.\n\nCharamba is strongly rumoured to have been relieved of duties, news that seems to have found worthy takers on social media.\n\nThe top aide is said to have been forcibly retired and is now at his farm after the Mnangagwa family, including wife Auxillia and sons, convinced the 82-year-old Zanu PF leader to remove him.\n\nOnce late President Robert Mugabes spokesperson, Charamba had morphed into an unpopular opinion leader, who has in the past lashed out at foreign leaders in undiplomatic fashion.\n\nCharamba has in the past laid into former US Ambassador to Zimbabwe Brian Nichols, Zambian President Hakainde Hichilema, former Botswana President Ian Khama, the US and British governments.\n\nHe is on record lashing out at respected world group of global leaders The Elders.\n\nThe Elders then comprised of late US President Jimmy Carter, former United Nations secretary-general Kofi Annan and Graca Machel.\n\nIm told George Charamba was actually fired and this would be the first time that Mnangagwa has listened to the masses, if its true.\n\nCharamba had become an old-fashioned speech writer, full of toxin, in a modern world which appreciates political correctness, tweeted popular character Majaira Jairos.\n\nHis comments were further strengthened by exiled former Cabinet minister Saviour Kasukuwere who spent the day mocking Charamba.\n\nCharamba himself, an active user of X, did not make anything easier as he spent the day offline.\n\nCharamba, Mhofu Maswerasei. Paita Shumba panze! Musabuda pazhe, said Kasukuwere.\n\nCharamba has been known not to shy away from publicly threatening human rights defenders with arrest or killings. His latest victim was Fadzayi Mahere, a former Member of Parliament (MP) whom he said needed some time behind bars, in an argument, so as to raise her literacy level.\n\nIf the suspense and uncertainty as to whether or not failED Mnangagwa has fired his uncouth spokesperson George Charamba is killing us like so, imagine what it must be doing to the evil disloyal fool himself, said Tich Ray.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/04/08124858/George-Charamba.jpg",
            "description": "<p>By Staff Reporter UNCONFIRMED reports emerging from various sources indicate President Emmerson Mnangagwa has fired his spokesperson, George Charamba. Charamba, who is Deputy Chief Secretary responsible for Presidential Communications, has lately gained notoriety for his acerbic tongue, which has seen Zimbabwean social media users clamouring for his dismissal on grounds of fanning toxicity. Mnangagwa, through</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/presidential-spokesman-george-charamba-dismissal-rumours-gain-traction/\">Presidential spokesman George Charamba dismissal rumours gain traction </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "05 Jan 2025"
        },
        {
            "title": "Woman filmed in viral video brutally assaulting stepdaughter arrested for murder",
            "url": "https://www.newzimbabwe.com/woman-filmed-in-viral-video-brutally-assaulting-stepdaughter-arrested-for-murder/",
            "content": "By Tapiwa Svondo\n\nTHE Zimbabwe Republic Police (ZRP) has confirmed the arrest of 20-year-old Memory Moyana for the brutal assault of her stepdaughter, a minor, in a toilet at Chizhanje, Mabvuku, Zimbabwe.\n\nThe arrest follows the circulation of a disturbing video on social media showing the violent incident.\n\nIn a statement, the ZRP national spokesperson, Commissioner Paul Nyathi said Moyana tried to conceal the crime claiming her stepdaughter died following an attack by evil spirits.\n\nPreliminary investigations by the police reveal that the suspect, who was the victims stepmother, attempted to cover up the heinous crime by claiming that the minor had been attacked by evil spirits.\n\nAs a result, the baby was taken to a self-proclaimed prophet in Ruwa, where she tragically died.\n\nMoyanas husband is also in trouble after he tried to secretly bury his deceased daughter.\n\nThe suspect and her husband, Talent Muchato (26) tried to secretly bury the victim at Mutinhima village, Nyazura on December 17, 2024. A concerned citizen later made a report to the police, said Nyathi.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/30024446/Paul-Nyathi-1.jpeg",
            "description": "<p>By Tapiwa Svondo  THE Zimbabwe Republic Police (ZRP) has confirmed the arrest of 20-year-old Memory Moyana for the brutal assault of her stepdaughter, a minor, in a toilet at Chizhanje, Mabvuku, Zimbabwe. The arrest follows the circulation of a disturbing video on social media showing the violent incident. In a statement, the ZRP national spokesperson,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/woman-filmed-in-viral-video-brutally-assaulting-stepdaughter-arrested-for-murder/\">Woman filmed in viral video brutally assaulting stepdaughter arrested for murder </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "05 Jan 2025"
        },
        {
            "title": "Jail pirate taxi drivers and operators- say stakeholders as three killed, 10 injured after overloaded vehicle carrying Apostolic sect members collides with truck",
            "url": "https://www.newzimbabwe.com/call-to-jail-pirate-taxi-drivers-and-operators-three-killed-10-injured-as-overloaded-vehicle-carrying-apostolic-sect-members-collides-with-truck/",
            "content": "By James Muonwa l Mashonaland West Correspondent\n\nTHREE people perished while 10 others were injured when an illegal taxi ferrying members of an Apostolic sect going for a New Year crossover gathering side-swiped a truck.\n\nThe unfortunate incident, which occurred between Chinhoyi and Lions Den on New Years Eve, has left families without breadwinners and survivors nursing various degrees of wounds.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the accident involving the illegal taxi commonly known as go-faster or mushikashika in vernacular.\n\nThe ZRP confirms a fatal road traffic accident which occurred on December 31, 2024, at around 2000 hours at the 136 kilometre peg along Harare -Chirundu road.\n\nThree people were killed while 10 others were injured when an Isuzu KB 250 vehicle with no passengers on board side swiped with a Toyota Probox vehicle with 13 passengers on board, Nyathi said.\n\nBodies of the victims were taken to Chinhoyi Provincial Hospital mortuary for postmortem while the injured were admitted at the same facility.\n\nREACTIONS TO RECENT FATALITIES\n\nSocial media users reacted to news of the accident and heaped blame on police for allowing pirate taxis to make the countrys roads a traffic jungle.\n\nA user @AlderleyNyonga2 questioned how a light motor vehicle, a Toyota Probox with a carrying capacity of an average of seven people, was allowed to have 13 passengers and pass through a police checkpoint.\n\nAnother commentator, Amen Mapiya said cops manning roadblocks should be strict and arrest all errant drivers flouting road rules and regulations.\n\nWhats the reason for manning roadblock, why allowing such a car to pass through? Thats a good reason to tow away that car and the driver to pay a heavy fine.\n\nWe hope further investigations will be conducted and bring the officers on that roadblock to book for allowing such a car to pass, said Mapiya.\n\nJerry Maguranyanga said for years he took pride in ZRP as a top policing organisation in Africa but the level of corruption is becoming more apparent.\n\nCarlos Mufiri concurred with Mapuranga, noting the graft was increasingly contributing to road carnage.\n\nZRP is very toxic. All the police officers at roadblocks along the above-mentioned road knew about the 13 passengers in the car but the driver just paid his way, said Mufiri.\n\nThirteen passengers, you are not working you guys. What are the reasons for your roadblocks?\n\nStakeholders interviewed by NewZimbabwe.com in Mashonaland West province called on government to ban pirate taxis plying various routes and introduce regulated conventional buses.\n\nThere are pirates that ply the Chinhoyi-Chegutu route while others transit between the provincial capital and Harare, Karoi, Mhangura and other outlying areas such as Kenzamba, Makonde district.\n\nWHAT HAS GIVEN RISE TO PIRATE TAXIS\n\nSince September last year, 13,886 motorists have been arrested nationwide for operating pirate taxis, an indicator of how rampant pirates are in Zimbabwe.\n\nUnregistered taxis have been part of Zimbabwes transportation system for years, but they have increased since the coronavirus pandemic as other legal means of transport fell away, according to the Ministry of Transport and Infrastructural Development.\n\nIn 2020, to enforce lockdown measures and discourage people from leaving their homes, the government outlawed the countrys most dependable means of transport: licensed and privately owned omnibuses, minivan taxis  locally known as kombis  and smaller cabs. Only public buses, which are few and unreliable, were allowed to operate.\n\nThe ban was lifted in December 2022 but several private operators that had disposed of their vehicles struggled to get back into business. As a result, pirate taxis still dominate the public transportation sector.\n\nDespite various public awareness campaigns to educate passengers on the dangers of using illegal taxis, illegal taxis continue to thrive.\n\nThe demographic and geographical growth of Zimbabwean cities has put pressure on public transportation services, according to research from the Harare-based nonprofit Zimbabwe Coalition on Debt and Development (ZIMCODD).\n\nZimbabwes population has increased by 16.2% and now stands at 15.1 million people, up from the 13 million in the 2012 census.\n\nWhen there is population growth, our cities then also expand, says Cynthia Huni, an urban planning expert.\n\nYou see new suburbs being opened, and when that happens you have to create new roads and transport systems.\n\nWhile the lack of reliable public transport has created new opportunities for an informal market, Passenger Association of Zimbabwe (PAZ) president, Tafadzwa Goliati believes the influx of pirate taxis also stems from the countrys economic hardships characterised by high unemployment.\n\nThere is general poverty and joblessness in this country and people are not earning much to survive, so they find alternatives to make ends meet  and pirate taxis is one of those means, Goliati says.\n\nADVOCACY FOR JAILING OF MUSHIKASHIKA DRIVERS, OPERATORS\n\nJust like commuter omnibuses were outlawed for causing road traffic accidents, some stakeholders are also calling on the government to deal harshly with mushikashika and jail those who operate them.\n\nLast September, government implemented the radius-based restrictions for commuter omnibuses from 120 km to 60 km, a move aimed at improving road safety on the countrys major roads.This applied to commuter omnibuses with a seating capacity of 26 passengers and below.\n\nTransport and Infrastructural Development Minister Felix Mhona said the move was aimed at mitigating against road traffic accidents involving kombis.\n\nThe minister argued that high-capacity buses had greater leg space and baggage space for long-distance travellers than kombis, which makes buses more ideal for long-distance journeys.\n\nA member of Women Coalition of Zimbabwe (WiCOZ), Mary-Anne Mutsambi said besides being sexually violated in crammed pirate taxis, the speeding vessels put the lives of breadwinners at high risk of leaving their children orphaned.\n\nI am personally advocating for a total ban on mushikashika and incarceration of drivers and owners. Pirate taxis have become death traps, and we are needlessly losing lives and limbs daily.\n\nThe pirates are notorious for overloading passengers like sardines, speeding, hailing insults and profanities as well as flouting road rules and regulations with abandon recklessness at the expense of passengers lives and wellbeing, therefore imprisonment of drivers and operators is the only way to make our roads safer and saner, said Mutsambi.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/06/09173547/accident-honda-fit-banket.jpg",
            "description": "<p>By James Muonwa l Mashonaland West Correspondent  THREE people perished while 10 others were injured when an illegal taxi ferrying members of an Apostolic sect going for a New Year crossover gathering side-swiped a truck. The unfortunate incident, which occurred between Chinhoyi and Lion’s Den on New Year’s Eve, has left families without breadwinners and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/call-to-jail-pirate-taxi-drivers-and-operators-three-killed-10-injured-as-overloaded-vehicle-carrying-apostolic-sect-members-collides-with-truck/\">Jail pirate taxi drivers and operators- say stakeholders as three killed, 10 injured after overloaded vehicle carrying Apostolic sect members collides with truck </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "05 Jan 2025"
        },
        {
            "title": "Persons with albinism face severe health crisis in Zimbabwe as lack of access to care claims another life",
            "url": "https://www.newzimbabwe.com/persons-with-albinism-face-severe-health-crisis-in-zimbabwe-as-lack-of-access-to-care-claims-another-life/",
            "content": "By Thandiwe Garusa\n\nPERSONS with albinism in Zimbabwe continue to die as they face severe lack of access to critical healthcare and resources, an activist has said.\n\nMarvellous Tshuma, activist for people living with albinism and co-founder of Noble Hands Zimbabwe Trust, a charity organisation that deals with people with disabilities, orphans and widows narrated how Chipo Chigova (35) from the rural areas of Gweru died after a long battle with skin cancer.\n\nAccording to Tshuma, the late Chigova was a mother of seven in a polygamous family and she worked at Romac Farm for most of her life doing demanding piece jobs such as cutting firewood and weeding fields.\n\nChigova has also left behind a 9-month-old baby.\n\nShe never had access to sunscreen or sufficient information about skin cancer.\n\nAccess to sunscreen lotions and other skin care needs was a huge challenge that she depended on Vaseline (petroleum jelly) or nothing at all.\n\nWe reached out to her in 2023 through the Albinism Konnect and tried to get her treated unfortunately that time she was pregnant, and treatment was halted.\n\nIn 2024, when she gave birth, we again pushed for treatment, but the cancer had advanced, and she was now in a palliative state.\n\nShe stopped breastfeeding at three months. From time-to-time we were now sending food, medication and lotions but it was not enough, cancer kept growing.\n\nThe current drought made things worse for them, that even in her state she would try to go for piece jobs until around June 2024 when she was now bedridden.\n\nShe endured extreme pain during her last days. Because she didnt get sunscreen, early screening and treatment we lost her, an emotional Tshuma said.\n\nThe activist also bemoaned neglect from the government and called for the establishment of regular skin cancer screenings, at least twice a year.\n\nShe is also lobbying for hospitals and clinics to have at least one staffer professionally trained in albinism-related health issues.\n\nl am traumatised because of what l see in the countryside, brothers and sisters dying without treatment. The fundraisers we do are only a drop in the ocean.\n\nThe Government of Zimbabwe has abdicated its duty especially to my community of persons with albinism.\n\nWe need regular skin screening at least two times a year. Hospitals and clinics must have at least one health professional knowledgeable about albinism and skin cancer for early referrals, she added.\n\nChigovas passing shows the harsh reality for many in rural Zimbabwe, where treatable and preventable illnesses often lead to death because of neglect.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/04043431/IMG-20250104-WA0000.jpg",
            "description": "<p>By Thandiwe Garusa PERSONS with albinism in Zimbabwe continue to die as they face severe lack of access to critical healthcare and resources, an activist has said. Marvellous Tshuma, activist for people living with albinism and co-founder of Noble Hands Zimbabwe Trust, a charity organisation that deals with people with disabilities, orphans and widows narrated</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/persons-with-albinism-face-severe-health-crisis-in-zimbabwe-as-lack-of-access-to-care-claims-another-life/\">Persons with albinism face severe health crisis in Zimbabwe as lack of access to care claims another life</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "05 Jan 2025"
        },
        {
            "title": "Scandal ridden Zimbabwean referees left out of CHAN tournament",
            "url": "https://www.newzimbabwe.com/scandal-ridden-zimbabwean-referees-left-out-of-chan-tournament/",
            "content": "By Staff Reporter\n\nTAINTED Zimbabwean referees have been left out of the Confederation of African Footballs (CAF) list of officials for the upcoming CHAN finals in Kenya, Uganda and Tanzania.\n\nThe tournament kicks off on the first of February, with the final set for the 28th of that month.\n\nOnce a continental powerhouse in terms of refereeing, Zimbabwe has collapsed on the perking order over the years.\n\nA total of 65 referees was shared by CAF this Friday, with officials from lowly-ranked countries making it ahead of Zimbabweans.\n\nSocial media users blamed their absence on poor officiating in the Castle Lager premiership, where cases of match manipulation were raised.\n\nA number of questionable calls by centre referees and linesmen alike were topical in the past season, at times leading to abandonment of matches as was the case between Simba Bhora and Highlanders prematurely ended Chibuku Super Cup at Wadzanai Stadium.\n\nBy week five, the ZIFA referees committee had suspended five officials for dubious officiating.\n\nOf course we are punishing them for their misconduct, our referees make a lot of mistakes.\n\nFor your own information we are in week five and we have played 45 matches in the league and of those we have three or four matches in which we felt referees influenced the outcome of the game, said referees boss Norman Matemera after being quizzed on what they were doing to rein in faltering officials.\n\nA FIFA ban that froze out Zimbabwe from international competitions did not do referees any favour too, as they were also scrapped off the global bodys panel.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/09/24004511/referee.jpg",
            "description": "<p>By Staff Reporter TAINTED Zimbabwean referees have been left out of the Confederation of African Football’s (CAF) list of officials for the upcoming CHAN finals in Kenya, Uganda and Tanzania. The tournament kicks off on the first of February, with the final set for the 28th of that month. Once a continental powerhouse in terms</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/scandal-ridden-zimbabwean-referees-left-out-of-chan-tournament/\">Scandal ridden Zimbabwean referees left out of CHAN tournament</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "05 Jan 2025"
        },
        {
            "title": "Controversial Gift Banda files appeal against ZIFA at Court of Arbitration for Sport",
            "url": "https://www.newzimbabwe.com/controversial-gift-banda-files-appeal-against-zifa-at-court-of-arbitration-for-sport/",
            "content": "By Sport Reporter\n\nCONTROVERSIAL Bulawayo-based businessman Gift Banda has appealed at the Court of Arbitration for Sport (CAS) over his suspension to run for office in the upcoming Zimbabwe Football Association (ZIFA) elections slated for January 25.\n\nBanda was one of the candidates who had submitted names to contest for the vice presidency, only to fail the integrity test, which was the final grading for anyone who wanted to contest in the upcoming polls.\n\nBanda becomes the second disqualified candidate to file an appeal at CAS, the first one being former Warriors striker Benjani Mwaruwari.\n\nI can confirm to you that Gift Banda has also appealed at CAS because we have received a written notification from the international legal board.\n\nSo, we now have two disqualified candidates who have appealed at the present moment, the other one being Benjani Mwaruwari, said an inside source at ZIFA.\n\nBandas bid to run for the upcoming elections has been marred with controversy. Last month, he was arrested on allegations of submitting forged Ordinary Level certificates at ZIFA as part of his documents.\n\nBanda is seeking a return at ZIFA after serving as the organisations substantive president when Zimbabwe was serving a FIFA ban.\n\nMeanwhile, former Norton Member of Parliament Temba Mliswa has also threatened to appeal and challenge his disqualification to run for office in the upcoming elections.\n\nMliswa revealed this via his X account but at the present moment NewZimbabwe.com can confirm that he is het to submit his papers at CAS.\n\nBesides Mliswa, close sources have also revealed that another aspiring ZIFA presidential candidate prophet Walter Magaya is also set to take the same legal route against ZIFA following his disqualification.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/10165645/ZIFA-acting-President-Gift-Banda.jpg",
            "description": "<p>By Sport Reporter CONTROVERSIAL Bulawayo-based businessman Gift Banda has appealed at the Court of Arbitration for Sport (CAS) over his suspension to run for office in the upcoming Zimbabwe Football Association (ZIFA) elections slated for January 25. Banda was one of the candidates who had submitted names to contest for the vice presidency, only to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/controversial-gift-banda-files-appeal-against-zifa-at-court-of-arbitration-for-sport/\">Controversial Gift Banda files appeal against ZIFA at Court of Arbitration for Sport</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "05 Jan 2025"
        },
        {
            "title": "Mnangagwa in mini-Cabinet reshuffle, appoints new CIO Director-General",
            "url": "https://www.newzimbabwe.com/mnangagwa-in-mini-cabinet-reshuffle-appoints-new-cio-director-general/",
            "content": "By Tapiwa Svondo\n\nPRESIDENT Emmerson Dambudzo Mnangagwa has announced the reassignment of two key ministers and the appointment of a new Director-General of the Presidents Department, effective immediately.\n\nIn a statement by the Chief Secretary to the President and Cabinet, Martin Rushwaya, former Public Service Minister July Moyo has been reassigned to the Minister of Energy and Power Development portfolio, while Edgar Moyo was switched to Moyos former post, with immediate effect.\n\nIn terms of Subsection 1 of Section 104 of the Constitution of Zimbabwe, His Excellency the President, Cde. Dr. Emmerson Dambudzo Mnangagwa has reassigned the under-listed Ministers as follows:\n\nHon. J.G. Moyo, M.P. Minister of Energy and Power Development.\n\nHon. E. Moyo, M.P. Minister of Public Service, Labour and Social Welfare.\n\nThe re-assignments are with immediate effect, said Rushwaya\n\nJuly Moyo has been reassigned to Energy portfolio\n\nAdditionally, Mnangagwa also appointed Zimbabwe National Parks and Wildlife Authority (ZimParks) Director-General Fulton Mangwanya as the new as the new Director-General of the Central Intelligence Organisation (CIO) also known as the Presidents Department. He replaced Isaac Moyo.\n\nIn terms of Section 226(1) of the Constitution of Zimbabwe, His Excellency the President, Cde. Dr. Emmerson Dambudzo Mnangagwa has appointed Dr. Fulton Mangwanya as the Director General, Presidents Department. The appointment is with immediate effect, said Rushwaya.\n\nIn his latest interview with State media, the 82-year-old Zanu PF leader, who is reportedly planning to run for a third presidential term, hinted on ringing changes to his team of Cabinet ministers amid reports the redeployments will extend to the securocrats sector.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/03005745/SONA-4-Mnangagwa.png",
            "description": "<p>By Tapiwa Svondo  PRESIDENT Emmerson Dambudzo Mnangagwa has announced the reassignment of two key ministers and the appointment of a new Director-General of the President’s Department, effective immediately. In a statement by the Chief Secretary to the President and Cabinet, Martin Rushwaya, former Public Service Minister July Moyo has been reassigned to the Minister of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-in-mini-cabinet-reshuffle-appoints-new-cio-director-general/\">Mnangagwa in mini-Cabinet reshuffle, appoints new CIO Director-General</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "05 Jan 2025"
        },
        {
            "title": "New Police Commissioner-General Mutamba officially takes over command",
            "url": "https://www.newzimbabwe.com/new-police-commissioner-general-mutamba-officially-takes-over-command/",
            "content": "By Anna Chibamu\n\nTHE new Commissioner-General of Police, Stephen Mutamba this Friday officially took over the reins of the countrys police service at a colourful ceremony held in Harare.\n\nMutamba replaced Godwin Matanga, who was retired on January 1, 2025.\n\nPresident Mnangagwa, for unknown reasons, recently retired Matanga and elevated his deputy to assume overall leadership at Police General Headquarters (PGHQ).\n\nSpeaking during a handover-and-takeover event at Mkushi Depot (formerly Morris Depot) in Harare this Friday, Matanga dispelled rumour that he wanted to cling on to his lofty post citing irregularities in his retirement procedure.\n\nMatanga said he was properly served with notice of his retirement by Mnangagwas office, quashing rumour that he had reported for duty after his dismissal from the service.\n\nMay l take this opportunity to clarify an incorrect position that has been peddled in the media recently pertaining to my retirement.\n\nLadies and gentlemen, listen carefully, I was properly served by the President of the Republic of Zimbabwe, His Excellency Cde Dr. E.D. Mnangagwa at a time when my retirement was due, he explained.\n\nHis utterances cleared the air after social media reported the outgoing police chief had dramatically reported for duty, claiming he was not properly dismissed.\n\nThe outgoing police chief said he was delighted to address officers and officials witnessing the change of guard.\n\nFor me personally, it is a boundless moment of delight as I bid farewell to longstanding colleagues to an organisation that I served over a long period of time.\n\nAlas, the day will certainly come when we have to separate from the organisation that we have so much and equally drew a lot of friendships, experiences and livelihoods\n\nAllow me, therefore, to express my heartfelt gratitude to His Excellency the President of the Republic of Zimbabwe Cde Emmerson Dambudzo Mnangagwa for according me the privilege to serve the nation in the Office of the Commissioner General Police.\n\nHe added: I am grateful for his guidance and indeed the security infrastructure for their enduring support during my tenure. More importantly, my sincere gratitude goes to the general public of Zimbabwe, my regional peers and the regional police chiefs and the media for the support they rendered to my tenure.\n\nI am, however, confident that a new broom sweeps clean, and my successor will be able to ride on my achievements that we have made and tackle existing challenges head on.\n\nI am comforted to pass the baton to Cde Stephen Mutamba whom l have been with in the trenches for so many years and have known his capacity to steer the ship going forward.\n\nMatanga thanked all the deputy Commissioner Generals and junior ranking cops for their unwavering support during his tenure.\n\nI wish to also thank all senior officers and junior officers and members of the police service who shared and advanced the vision of the organisation through the provision of quality police service to the people of our great nation, he added.\n\nI am so content with the contribution and service l gave to the country in pursuit of national goals and aspirations.\n\nIn attendance at the historic handover-and-takeover ceremony was Home Affairs Minister Kazembe Kazembe, State Security Minister Lovemore Matuke, CIO boss Isaac Moyo, Army Commander Anselem Sanyatwe and Air Marshall Jacob Nzvede.\n\nPrior to the Friday event, an organisation claiming to represent children of war veterans, COZWA, made sensational allegations that Matanga reported at his Harare offices in full police uniform arguing he was yet to receive official communication of his marching orders.\n\nCOZWA proceeded to make sensational claims that the polices Support Unit, Alpha Troop had been put on standby to forcibly remove him from office.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/03163853/IMG-20250103-WA0023.jpg",
            "description": "<p>By Anna Chibamu THE new Commissioner-General of Police, Stephen Mutamba this Friday officially took over the reins of the country’s police service at a colourful ceremony held in Harare. Mutamba replaced Godwin Matanga, who was retired on January 1, 2025. President Mnangagwa, for unknown reasons, recently retired Matanga and elevated his deputy to assume overall</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/new-police-commissioner-general-mutamba-officially-takes-over-command/\">New Police Commissioner-General Mutamba officially takes over command</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "05 Jan 2025"
        },
        {
            "title": "Man arrested at Beitbridge border, driving ‘stolen’ luxury BMW into Zimbabwe",
            "url": "https://www.newzimbabwe.com/man-arrested-at-beitbridge-border-driving-stolen-luxury-bmw-into-zimbabwe/",
            "content": "By IOL\n\nA 40-year-old foreign national is expected to appear in court after he allegedly tried to drive a luxury BMW across the border into Zimbabwe on New Years Eve.\n\nPolice said officers were on duty at the Beitbridge Port of Entry when they spotted a man driving a black BMW G70, 7 Series, valued at over R2 million. The man wanted to drive over into Zimbabwe.\n\nThe man had a South African passport. Preliminary investigation reveals that the vehicle is wanted by one of the banks in South Africa. The driver alleged that the real owner will be flying to South Africa on January 1, said police spokesperson, Lieutenant Colonel Stephen Thakeng.\n\nHe said the man was arrested and charged for possession of a suspected stolen vehicle and providing the SAPS with fraudulent documents.\n\nThe vehicle was seized. He will appear on January 3 in the Musina Magistrates Court.\n\nLimpopo police commissioner, Lieutenant General Thembi Hadebe applauded the members who were vigilant to ensure that the suspect was brought to book to face the full might of the law.\n\nShe added that its the results of more boots on the ground during festive season.\n\nMeanwhile, Deputy Minister of Police, Polly Boshielo, MEC for Community Safety and Transport, Violet Mathye, Vhembe District Executive Mayor, councillor Freda Nkondo and commissioner Hadebe, led the annual Safer Festive Season Operational-Inspection Tour at Musina and Beitbridge Port of Entry.\n\nThe visit was part of efforts to fight cross-border crimes.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/03111610/The-black-BMW-G70-7-Series-of-2023-worth-over-R2-million-seized-by-police-at-the-South-Africa-Zimbabwean-border.webp",
            "description": "<p>By IOL  A 40-year-old foreign national is expected to appear in court after he allegedly tried to drive a luxury BMW across the border into Zimbabwe on New Year’s Eve. Police said officers were on duty at the Beitbridge Port of Entry when they spotted a man driving a black BMW G70, 7 Series, valued</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-arrested-at-beitbridge-border-driving-stolen-luxury-bmw-into-zimbabwe/\">Man arrested at Beitbridge border, driving ‘stolen’ luxury BMW into Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "05 Jan 2025"
        }
    ]
}