{
    "news": [
        {
            "title": "Young Chevrons lose second Youth ODI tri-series match to Bangladesh",
            "url": "https://www.newzimbabwe.com/young-chevrons-lose-second-youth-odi-tri-series-match-to-bangladesh/",
            "content": "By Sports Reporter\n\nZimbabwe mens under-19 cricket team on Monday lost their second Youth ODI tri-series match to Bangladesh by 91 runs.\n\nThe defeat came on the back of a humiliating 273-run defeat on Friday to South Africa in the opening match of the series.\n\nHaving won the toss, Zimbabwe opted to bowl in the first innings, in which Bangladesh racked 278 runs.\n\nBangladeshs opening batsman Zawad Abrar was too hot to handle for Zimbabwe as he amassed 83 runs , recording the highest individual runs for his side.\n\nComing back to the second innings, Zimbabwe were poor with the bat, as they were bowled out with 183 runs in 42.2 overs.\n\nThe Young Chevrons best batsman of the day was Nathaniel Hlabangana, who managed 53 runs off 72 balls.\n\nZimbabwe had half of its batsmen posting less than ten runs: Simbarashe Mudzengerere (0) , Tatenda Chimugoro (1), Panashe Mazai (0), Shelton Mazvitorera (0) and Tatenda Banda (7).\n\nMondays result saw Zimbabwe maintaining its place at the bottom of the log table, while Bangladesh were propelled to go on top of the table with two wins from two matches, followed by South Africa with one win.\n\nThe Young Chevrons will be back in action on Tuesday when they play South Africa in a return fixture, which they will be hoping to turn the tables following a 278-run defeat in the first match last week.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/28223846/young-chevrons-bangladesh.jpg",
            "description": "<p>By Sports Reporter Zimbabwe men’s under-19 cricket team on Monday lost their second Youth ODI tri-series match to Bangladesh by 91 runs. The defeat came on the back of a humiliating 273-run defeat on Friday to South Africa in the opening match of the series. Having won the toss, Zimbabwe opted to bowl in the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/young-chevrons-lose-second-youth-odi-tri-series-match-to-bangladesh/\">Young Chevrons lose second Youth ODI tri-series match to Bangladesh</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "07:01",
            "date": "29 Jul 2025"
        },
        {
            "title": "Elephants trample soldier to death near Beitbridge border post",
            "url": "https://www.newzimbabwe.com/elephants-trample-soldier-to-death-near-beitbridge-border-post/",
            "content": "SowetanLive\n\nA South African soldier on border patrol has been trampled to death by a herd of elephants in Limpopo near Zimbabwe.\n\nThe incident happened on Sunday night near the banks of the Limpopo River in Musina, about 300m from the SANDFs Madimbo operational base.\n\nPrivate Xavier Raynard was doing routine patrols on the Malala Drift road when he was killed.\n\nThe SANDF went to collect his remains on Monday.\n\nSANDF spokesperson Prince Tshabalala said Raynard, a member of the 10 Anti-Aircraft Regiment, who was deployed under Operation Corona,was found dead near the base.\n\nEarly indications suggest that he may have been fatally trampled by a herd of elephants while conducting routine patrols in the area. His service weapon was recovered at the scene.\n\nThe matter is under investigation by SANDF authorities in co-operation with environmental and wildlife officials to determine the exact circumstances surrounding the incident. A formal board of inquiry has been initiated, said Tshabalala.\n\nTshabalala said Raynards next of kin, from Kimberley, Northern Cape, have been formally notified, and psychosocial support is being provided to the family and his unit members.\n\nOperation Corona is a national border safeguarding initiative aimed at combating transnational crimes along the countrys borders.\n\nTshabalala said that soldiers deployed in these operations face harsh terrain, isolation and exposure to unpredictable natural conditions.\n\nLauren Liebenberg from the Vhembe Biosphere Reserve said:At this time of year, the crisis with the elephant populations that roam the Limpopo River Valley intensifies.When elephant hunting starts in the dry season they come across the Limpopo River [into SA] in huge numbers, she said, adding that the elephants neededa well-managed migration corridor.\n\nThe problem extends along the whole length of the 200km strip between Mapungubwe and Kruger National Park. We become a massive human-wildlife conflict zone.\n\nLiebenberg said a programme by the US Agency for International Development to manage the problem collapsed after the US administration cancelled it earlier this year.\n\nThrough the programme, they trained elephant herders and provided all sorts of defence interventions.\n\nDeaths still remain rare and at the extreme end of the human wildlife conflict interface, but the elephants do massive damage to crops, to infrastructure  especially fencing and water infrastructure, and to the natural vegetation in the nature reserves, said Liebenberg.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/28221348/raynard-.png",
            "description": "<p>SowetanLive A South African soldier on border patrol has been trampled to death by a herd of elephants in Limpopo near Zimbabwe. The incident happened on Sunday night near the banks of the Limpopo River in Musina, about 300m from the SANDF’s Madimbo operational base. Private Xavier Raynard was doing routine patrols on the Malala</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/elephants-trample-soldier-to-death-near-beitbridge-border-post/\">Elephants trample soldier to death near Beitbridge border post</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "07:01",
            "date": "29 Jul 2025"
        },
        {
            "title": "World Bank chief says Zimbabwe needs G20 help to exit debt trap",
            "url": "https://www.newzimbabwe.com/world-bank-chief-says-zimbabwe-needs-g20-help-to-exit-debt-trap/",
            "content": "Bloomberg\n\nZimbabwes best chance of exiting a 25-year debt default is to engage the Group of 20 nations to help formulate a solution and stop trying to work its way out of the quagmire itself, World Bank President Ajay Banga said.\n\nThe southern African country owes the World Bank and other creditors a total of $21 billion and has tried numerous unsuccessful strategies to restore its access to global capital markets. Those ranged from attempting to repay its debts using the proceeds of metal sales and recently approaching 10 nations for help to raise $2.6 billion to pay its arrears.\n\nAjay Banga. Image: Bloomberg\n\nTrying to figure it out on your own, youll be doing this for the next five years, Banga said in an interview in Maputo, Mozambiques capital. They need to figure out a way to reach out to the G20 and say, we raise our hand, wed like to be part of this process.\n\nZimbabwe first defaulted on repayments to the World Bank in 2000. Its debts to a host of multilateral institutions and bilateral lenders mounted amid a failed land-reform program and a quarter century of economic turmoil, shutting it out of international debt markets and limiting its ability to borrow even during the global pandemic and a recent devastating drought.\n\nThe government has asked the African Development Bank to advise on clearing its debt with the institutions outgoing president, Akinwumi Adesina, and former Mozambican President Joaquim Chissano asked to negotiate with creditors. It also hired Global Sovereign Advisory, a Paris-based consultancy, to help. The fact that Zimbabwean officials, including President Emmerson Mnangagwa, have been sanctioned by the US has complicated the process.\n\nWhile Belarus, Syria and Eritrea are also in arrears to the World Bank, Zimbabwes default is by far the longest. South Africa, which currently holds the G-20 presidency, last month said it has been approached by Zimbabwe to try and garner the groups support for a debt workout.\n\nZambia, Ghana and Ethiopia are among nations that have employed the G20s Common Framework, which was created in 2020 to help poor nations bring together a diverse set of creditors to restructure debts. While they have made progress in reaching deals, the process has been criticized for being too slow.\n\nZimbabwe isnt technically poor enough to be eligible to utilise the framework, yet Sri Lanka  a nation in a similar situation  approached the group in 2023 for help with dealing with its creditors.\n\nStart talking to the G20 and the Paris Club and whoever else has given them money and we can help, Banga said. We try and bring an understanding of what write down you need to take. It takes a while.\n\nZimbabwes Treasury didnt respond to a request for comment.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/08111459/harare.jpeg",
            "description": "<p>Bloomberg Zimbabwe’s best chance of exiting a 25-year debt default is to engage the Group of 20 nations to help formulate a solution and stop trying to work its way out of the quagmire itself, World Bank President Ajay Banga said. The southern African country owes the World Bank and other creditors a total of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/world-bank-chief-says-zimbabwe-needs-g20-help-to-exit-debt-trap/\">World Bank chief says Zimbabwe needs G20 help to exit debt trap</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "07:01",
            "date": "29 Jul 2025"
        },
        {
            "title": "Mnangagwa declares Glenview Area 8 Home Industry inferno a national disaster, refurbishment to start in September",
            "url": "https://www.newzimbabwe.com/mnangagwa-declares-glenview-area-8-home-industry-inferno-a-national-disaster-refurbishment-to-start-in-september/",
            "content": "By Staff Reporter\n\nPRESIDENT Emmerson Mnangagwa has declared the Glen View Area 8 complex fire, which destroyed goods worth over US$100,000 a national disaster.\n\nThis was revealed by Local Government Minister, Daniel Garwe, on Monday, adding that the government was now moving in to assist the affected traders.\n\nOnce the President has declared a state of disaster the department of Civil Protection under the Ministry of Local Government will move in and mobilise resources and assist those that have been affected, we are now working with the City of Harare, Ministry of Women Affairs and the affected traders so that we have a comprehensive list of those that were affected so that we come up with a way of assisting them, he said.\n\nGarwe added that refurbishment of the complex will start in September, targeting completion by April 2026.\n\nWe are hoping that before Indepence (April 18) next year, beginnning of March or beginning of April we will be able to invite the President to come and commission a transformed Glew View area 8 with properly laid out areas with different shops because we cant have one roof covering over 5 hectares so we want to have different shops, a road network, electricity, water and sewer reticlutaionn properly done.\n\nThis is not the first time a fire has happened at the home industry, and this is now the 10th fire to break out at the complex since 2015.\n\nCity of Harare SMEs Committee Chairperson, Councillor Denford Ngadziore, said preliminary investigations suggest the fire was started by security guards who lit a fire to keep warm near easily flammable materials.\n\nSpeaking during a visit to the site on Monday, Small and Medium Enterprises (SMEs) Minister Monica Mutsvangwa said authorities are working together to assist affected families and find lasting solutions to the recurring fires.\n\nThere is no them and us, we must all unite to end this problem at GlenView 8.\n\nWe have a committee which involves the Local Ministry, Civil Protection Unit, City Council, SMEs ministry and other relevant authorities working on assessments of the damage and finding solutions and how we can help the families that have been affected, Mutsvangwa said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/27095435/DsbQMjIWwAAcLd2_1.jpeg",
            "description": "<p>By Staff Reporter PRESIDENT Emmerson Mnangagwa has declared the  Glen View Area 8 complex fire, which destroyed goods worth over US$100,000 a national disaster. This was revealed by Local Government Minister, Daniel Garwe, on Monday, adding that the government was now moving in to assist the affected traders. “Once the President has declared a state</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-declares-glenview-area-8-home-industry-inferno-a-national-disaster-refurbishment-to-start-in-september/\">Mnangagwa declares Glenview Area 8 Home Industry inferno a national disaster, refurbishment to start in September</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "07:01",
            "date": "29 Jul 2025"
        }
    ]
}