{
    "news": [
        {
            "title": "Maswanhise voted Motherwell Player of the Month",
            "url": "https://www.newzimbabwe.com/maswanhise-voted-motherwell-player-of-the-month/",
            "content": "By Sports Reporter\n\nWarriors forward Tawanda Maswanhise has been voted Motherwell FCs Player of the Month for July, following an impressive run in the Premier Sports Cup.\n\nThe 22-year-old netted four goals in as many games, helping the Scottish side reach the Round of 16, where they will face St Johnstone.\n\nThank you for voting me for the Player of the Month. Thank you for the support, and hopefully many more Player of the Months for me and others, Maswanhise said after receiving the award.\n\nHe edged out fellow nominees Lukas Fadinger, Apostolos Stamatelopoulos, and Callum Slattery to clinch the honour.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/30155431/t.-maswanhise.jpeg",
            "description": "<p>By Sports Reporter Warriors forward Tawanda Maswanhise has been voted Motherwell FC’s Player of the Month for July, following an impressive run in the Premier Sports Cup. The 22-year-old netted four goals in as many games, helping the Scottish side reach the Round of 16, where they will face St Johnstone. “Thank you for voting</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/maswanhise-voted-motherwell-player-of-the-month/\">Maswanhise voted Motherwell Player of the Month</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:11",
            "date": "30 Jul 2025"
        },
        {
            "title": "Rangers injured following elephant attacks in Sengwa Chirisa Safaris",
            "url": "https://www.newzimbabwe.com/rangers-injured-following-elephant-attacks-in-sengwa-chirisa-safaris/",
            "content": "By Staff Reporter\n\nTwo Zimbabwe Parks and Wildlife Management Authority (ZimParks) rangers sustained critical injuries after they were attacked by elephants in Sengwa Chirisa Safaris Tuesday afternoon, according to officials.\n\nZimParks spokesperson Tinashe Farawo said the two have since been airlifted to Harare for urgent medical attention.\n\nOne of the rangers suffered a broken arm while fleeing, whilst the other was gored, sustaining abdominal wounds and fractures to his arm and leg.\n\nThe incident occurred after the duo was deployed to investigate a reported case of a snared buffalo that was perceived to be a potential danger to the community.\n\nOn the way, they encountered a herd of elephants with calves which charged at them, forcing them to flee in different directions, Farawo said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/12/10153528/unnamed-2.jpg",
            "description": "<p>By Staff Reporter Two Zimbabwe Parks and Wildlife Management Authority  (ZimParks) rangers sustained critical injuries after they were attacked by elephants in Sengwa Chirisa Safaris Tuesday afternoon, according to officials. ZimParks spokesperson Tinashe Farawo said the two have since been airlifted to Harare “for urgent medical attention.” One of the rangers suffered a broken arm</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rangers-injured-following-elephant-attacks-in-sengwa-chirisa-safaris/\">Rangers injured following elephant attacks in Sengwa Chirisa Safaris</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:11",
            "date": "30 Jul 2025"
        },
        {
            "title": "Mnangagwa orders US$5 million disbursement to speed up delayed Gwayi Shangani dam project",
            "url": "https://www.newzimbabwe.com/mnangagwa-orders-us5-million-disbursement-to-speed-up-delayed-gwayi-shangani-dam-project/",
            "content": "By Staff Reporter\n\nPRESIDENT Emmerson Mnangagwa has directed the Ministry of Finance to release US$5 million every month to speed up work on the long-stalled Gwayi-Shangani Dam project.\n\nTwo months back, the treasury had not disbursed enough funds withconstruction of the dam set to be completed this year.\n\nAccording to Lands Deputy Minister, Vangelis Haritatos, the Treasury was releasing funds in drips and drops which cannot make any significant changes.\n\nThe Gwayi-Shangani project, which is supposed to be a permanent fix to Bulawayos water shortages, has faced delays and failed to meet several deadlines since work started in 2004.\n\nThe most recent deadline, which was set by the government, was for the dam to be completed by the 2023/2024 summer cropping season, which it also missed.\n\nIn a statement posted on the social media platform X under his pseudonym Jamwanda, the Deputy Chief Secretary forPresidential Communications, George Charamba said US$10 million has already been disbursed.\n\nPresident ED Mnangagwa has ordered the finance ministry to ensure a monthly disbursement of US$5 million towards completion of the stalled Gwayi-Shangani dam.\n\nSo far US$10m has been released, ensuring some four meters of the all concrete wall are done, he wrote.\n\nIn 2018, Mnangagwa toured the Gwayi-Shangani dam and pledged to do everything in his power to ensure the project is completed by the end of 2019 and to date, it has not been completed.\n\nLast year, the government allocated ZiG1,2 billion in the national 2025 budget to complete Lake Gwayi-Shangani and Kunzvi Dam which is now at 72% completion.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/29182454/gwayi.webp",
            "description": "<p>By Staff Reporter PRESIDENT Emmerson Mnangagwa has directed the Ministry of Finance to release US$5 million every month to speed up work on the long-stalled Gwayi-Shangani Dam project. Two months back, the treasury had not disbursed enough funds with construction of the dam set to be completed this year. According to  Lands Deputy Minister, Vangelis Haritatos,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-orders-us5-million-disbursement-to-speed-up-delayed-gwayi-shangani-dam-project/\">Mnangagwa orders US$5 million disbursement to speed up delayed Gwayi Shangani dam project</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:11",
            "date": "30 Jul 2025"
        },
        {
            "title": "Zimbabwe, UAE sign health cooperation deal",
            "url": "https://www.newzimbabwe.com/zimbabwe-uae-sign-health-cooperation-deal/",
            "content": "By Thandiwe Garusa\n\nZIMBABWE has signed a Memorandum of Understanding (MoU) with the United Arab Emirates (UAE) aimed at strengthening healthcare systems in both countries.\n\nThe cooperation covers a wide range of healthcare areas, including primary and specialist care, emergency preparedness, health financing, workforce development, and the use of technology to improve service delivery and health outcomes.\n\nTwo months back, the government also signed separate MoUs with China and Belarus to refurbish the biggest referral hospital, Parirenyatwa.\n\nSpeaking during a post-cabinet media briefing on Tuesday, Information Minister Jenfan Muswere said the MoU aims to strengthen healthcare systems and improve health outcomes in both countries through mutual cooperation based on respect, equality, and shared benefit.\n\nCabinet considered and approved the MoU between the Republic of Zimbabwe and the Government of United Arab Emirates on Cooperation in the field of health.\n\nThe MOU aims to establish a collaborative framework between the two countries to foster mutual growth, development, and enhancement of healthcare systems within their respective territories.\n\nThe scope of cooperation encompasses various healthcare domains, including Primary Care, which comprises collaborative efforts in reproductive, maternal, neonatal, child, and adolescent health, as well as immunisation programs.\n\nSecondary Care, which comprises specialist care and patient referral services, laboratory services, forensic pathology, and blood services, Muswere said.\n\nHe added: Health system resilience, whose key aspect is preparing for and responding to public health emergencies.\n\nHealth financing, which enables both countries to explore innovative funding models, share financial expertise, and optimise resource allocation to achieve better health outcomes.\n\nHuman resources, which focuses on developing and managing healthcare professionals; and health technology, which aims to leverage health technology to improve healthcare delivery, enhance patient care, and streamline healthcare services.\n\nPublic hospitals in Zimbabwe are struggling to efficiently serve patients due to shortages of basic medical supplies, rundown infrastructure, and poorly paid staff, which has led to massive brain drain and low morale.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/09054809/muswere.jpeg",
            "description": "<p>By Thandiwe Garusa ZIMBABWE has signed a Memorandum of Understanding (MoU) with the United Arab Emirates (UAE) aimed at strengthening healthcare systems in both countries. The cooperation covers a wide range of healthcare areas, including primary and specialist care, emergency preparedness, health financing, workforce development, and the use of technology to improve service delivery and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-uae-sign-health-cooperation-deal/\">Zimbabwe, UAE sign health cooperation deal</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:11",
            "date": "30 Jul 2025"
        }
    ]
}