{
    "news": [
        {
            "title": "Destiny TV launches ‘My Hustle’ – a celebration of young hustlers turning struggle to success",
            "url": "https://www.newzimbabwe.com/destiny-tv-launches-my-hustle-a-celebration-of-young-hustlers-turning-struggle-to-success/",
            "content": "By Staff Reporter\n\nIN light of the tough economic environment, which has pushed the majority of young people into unemployment,Destiny TVhas curated a television programme that celebrates young entrepreneurs.\n\nMy Hustle, a vibrant programme, has been added to the growing list of shows that Destiny TV is offering on its YouTube channel.\n\nThe programme shines a light on young people who are starting their own businesses.\n\nIt adopts the street lingo hustle, which reflects the daily lives of young people striving to make a living through small to medium enterprises.\n\nProgramme curator and presenter Stella Muusha said the concept is a unique one that seeks to celebrate the success stories of young people.\n\nThe programme is about people who are making a living through hustling. They are not formally employed but are not going to sit and whine that there are no jobs. They embark on start-ups that are good and legal.\n\nThese are not jobs that they went to school for, but they are start-ups necessitated by the need to survive, said Muusha.\n\nThe shrinking job market has pushed young people to the edge, with some resorting to drugs and substance abuse, while others leave the country in search of greener pastures.\n\nThe resilient ones, however, have created opportunities for themselves as a means of survival.\n\nDestiny TVExecutive Producer Tatenda Dembedza said the programme aims to empower other young people by sharing inspiring stories.\n\nMy Hustle is a show that celebrates the resilience of people whove turned unconventional jobs into thriving ventures. By sharing their experiences, we hope to empower others and give people hope, said Dembedza.\n\nMy hustle is now streaming on Destiny TVs YouTube channel.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/16164234/Screenshot-2025-04-16-at-17.41.43.png",
            "description": "<p>By Staff Reporter IN light of the tough economic environment, which has pushed the majority of young people into unemployment, Destiny TV has curated a television programme that celebrates young entrepreneurs. “My Hustle”, a vibrant programme, has been added to the growing list of shows that Destiny TV is offering on its YouTube channel. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/destiny-tv-launches-my-hustle-a-celebration-of-young-hustlers-turning-struggle-to-success/\">Destiny TV launches ‘My Hustle’ – a celebration of young hustlers turning struggle to success </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:38",
            "date": "16 Apr 2025"
        },
        {
            "title": "Mudenda commends partners for continued support as they sign MoU with Parliament",
            "url": "https://www.newzimbabwe.com/mudenda-commends-partners-for-continued-support-as-they-sign-mou-with-parliament/",
            "content": "By Anna Chibamu\n\nPARLIAMENT Speaker Jacob Mudenda has commended the United Nations Childrens Fund (UNICEF),theZimbabwe Institute,Zimbabwe WomenLawyersAssociation (ZWLA)and Veritas for thesupport rendered to the legislative assembly over the years.\n\nSpeaking during a signing ceremony of a Memorandum of Understanding (MoU) this Tuesday at the New Parliament Building in Mt Hampden, Mudenda said,On behalf of the Parliament of Zimbabwe, I extend my deepest gratitude to UNICEF Zimbabwe, the Zimbabwe Institute, the Zimbabwe Women Lawyers Association (ZWLA), and VERITAS for your continued partnership and invaluable contributions.\n\nThis is a celebration of the unity of purpose and the beginning of a renewed journey of cooperation. As we gather to witness the signing of the Memoranda of Understanding between the Parliament of Zimbabwe and four esteemed partners, namely UNICEF Zimbabwe, Zimbabwe Institute, Zimbabwe Women Lawyers Association (ZWLA), and Veritas, we affirm our shared commitment to building a democratic, inclusive, and accountable parliamentary ecosystem for Zimbabwe, Mudenda said.\n\nThe purpose of theMoUis to establish a formal partnership between the Parliament of Zimbabwe andthe organisationsprovidinga platform for the identification of potential areas of collaboration by both parties\n\nThe speaker highlighted thatthe occasion markeda deliberate step forward in realising the parliamentary institutional strategic vision to be a strong, independent, people-driven, and world-class parliament.\n\nThis vision is not aspirational rhetoric. It is a practical and actionable roadmap that guides our parliamentary oversight, lawmaking and representation responsibilities.\n\nHowever, achieving such an ambitious vision requires strategic and prudent partnerships with enriching institutions that bring diverse expertise, critical insights, and shared passion for transformative governance. The four institutions we are partnering with today exemplify the seminal calibre of our collaboration, he added.\n\nThe signing ceremony of the MoU on cooperation comes barely a few months after the US revised its funding to the global organisations, reducing it by 85%.\n\nAddressing theUNICEF Zimbabwedelegation led by its representative in the country, Etona Ekole, Mudenda said theenduring relationship with UNICEF Zimbabwe continuedto be a model of effective partnership.\n\nUNICEF has played a pivotal role in enhancing the impact of key parliamentary portfolio committees, especially those of primary and secondary education and health and child care.\n\nTheir support has enabled parliament to shape policies that safeguard and advance the rights of children in Zimbabwe.\n\nNotably, during the COVID-19pandemic, UNICEFs technical support was instrumental in facilitating parliaments transition to digital operations, thereby ensuring continued parliamentary processes in the face of the disruptive COVID-19 pandemic. This contribution not only upheld our constitutional duties but also reinforced democratic alliance,\n\nWe deeply value UNICEFs palpable partnership and technical expertise,he added.\n\nOn the Zimbabwe Institute, Mudenda said Parliament wasequally proud to affirmitsstrategic collaboration with the Zimbabwe Institute,Ironers of Weatherfront. Renowned for its policy and capacity building for term, the Institute has been consistent and is a valued partner of parliament.\n\nThe Institute has fostered inclusive dialogue and democratic innovation in the search for political tolerance in our body, polity. Its consistent support in building the institutional capacity of honourable members and parliamentary staff has significantly strengthened our parliamentary tripartite roles of oversight, lawmaking, and representation.\n\nAdded Mudenda: As far as the Zimbabwe Women Lawyers Association is concerned, we also take this opportunity to celebrate the formal renewal of our partnership\n\nZWLA has remained a steadfast advocate for gender justice and a vital supporter of the Zimbabwe Womens Parliamentary Caucus. ZWLA technical assistance in legislative drafting and gender mainstreaming has been transformative and invaluable.\n\nHe commended that ZWLAsrole in enacting the Marriages Act in the 9th Parliament,a law that helped to create a refreshing tapestry of marriage rights, which elevated the status of women in marriage.\n\nAs for VERITAS,Mudenda highlighted that completing this distinguished qualitative course is VERITAS beacon of transparency, accountability, and legal interpretive clarity.\n\nThe Zimbabwe government has received tremendous donor support over the years, but recently, the UK, Netherlands and the United States (US) governments drastically cut aid to Zimbabwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/06/13200646/Jacob-Mudenda-.jpg",
            "description": "<p>By Anna Chibamu PARLIAMENT Speaker Jacob Mudenda has commended the United Nations Children’s Fund (UNICEF), the Zimbabwe Institute, Zimbabwe Women Lawyers Association (ZWLA) and Veritas for the support rendered to the legislative assembly over the years. Speaking during a signing ceremony of a Memorandum of Understanding (MoU) this Tuesday at the New Parliament Building in Mt Hampden, Mudenda said, “On behalf of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mudenda-commends-partners-for-continued-support-as-they-sign-mou-with-parliament/\">Mudenda commends partners for continued support as they sign MoU with Parliament</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:38",
            "date": "16 Apr 2025"
        },
        {
            "title": "University Zimbabwe (UZ) lecturers arrested over salary protest",
            "url": "https://www.newzimbabwe.com/university-zimbabwe-uz-lecturers-arrested-over-salary-protest/",
            "content": "By Darlington Gatsi\n\nTHREE University of Zimbabwe (UZ) lecturers have been arrested by the Zimbabwe Republic Police (ZRP) after staging a protest at the institution over poor remuneration.\n\nWednesday morning, UZ lecturers went on strike over low wages, which they argue have lost purchasing power amid the countrys deteriorating economic climate.\n\nWhile picketing at the university, police arrested leaders of the Association of University Teachers (AUT).\n\nAUT president Philemon Chamburuka told NewZimbabwe.com that they were angered by the arrests of their members.\n\nThe status quo is that the strike is ongoing. As of now, we are encouraging our members not to report for duty. We are not intimidated. We are infuriated by the arrests of our colleagues, said Chamburuka.\n\nUZ lecturers are discontent with their monthly wages of US$250 and ZiG 6,000. Their plight is further worsened by a lack of working tools, forcing them to use their own equipment to carry out their duties.\n\nThe AUT is demanding a monthly salary of US$2,500 for its members, arguing that this is in line with wages at other learning institutions in the region.\n\nIn a letter addressed to the university and copied to the Ministry of Higher and Tertiary Education, the AUT said it was fed up with the governments failure to address workers grievances.\n\nDespite prolonged engagement over 18 months, the employer and the minister have failed to meet AUTs demands or make any reasonable alternative offer, resulting in the issuance of a Certificate of No Settlement.\n\nThe dispute remains unresolved, and lecturers and their families are languishing in extreme poverty, with a net monthly salary of less than US$250 and ZiG 6,000  a sum from which the employer harshly and unfairly expects employees to subsidise it by providing personal property as tools of work, including laptops, smartphones, data, and transport to and from work.\n\nThe AUT, as a registered trade union, and the employees intend to exercise their rights under Section 104(2) of the Labour Act, as read with Section 65(3) of the Constitution of Zimbabwe, to embark on collective job action, including a strike, for the effective resolution of the dispute, read the letter.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/12142202/UZ-1.png",
            "description": "<p>By Darlington Gatsi THREE University of Zimbabwe (UZ) lecturers have been arrested by the Zimbabwe Republic Police (ZRP) after staging a protest at the institution over poor remuneration. Wednesday morning, UZ lecturers went on strike over low wages, which they argue have lost purchasing power amid the country’s deteriorating economic climate. While picketing at the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/university-zimbabwe-uz-lecturers-arrested-over-salary-protest/\">University Zimbabwe (UZ) lecturers arrested over salary protest</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:38",
            "date": "16 Apr 2025"
        },
        {
            "title": "Chitembwe not going anywhere – CAPS United president to supporters",
            "url": "https://www.newzimbabwe.com/chitembwe-not-going-anywhere-caps-united-president-to-supporters/",
            "content": "By Sports Reporter\n\nCAPS Uniteds president Farai Jere, has told the teams supporters that coach Lloyd Chitembwe will not leave the club despite mounting pressure to sack him.\n\nMakepekepe has recorded one of the worst league starts in history, winning only one match out of the six they have played.\n\nThe Green Machine is currently occupying second-from-last position (17) on the log, with 4 points, three ahead of bottom-placed Triangle.\n\nThe clubs fans recently protested after their 2-1 home defeat to Ngezi Platinum Stars, calling for the coach to be sacked.\n\nPressure for Chitembwes dismissalincreasedon Sunday when the side lost 1-0 to old rivals Highlanders at Barbourfields, forcing Jere to comment on the matter on Tuesday.\n\nLloyd Chitembwe is not going anywhere. We have all seen his achievements, we need his experience.\n\nI have brought in a number of coaches who are in the league, your Luke Masomere, Moses Chunga, Darlington Dodo and others, but they have failed.\n\nSo we have walked that route and we know the result, so I know all these things, said Jere.\n\nChitembwe is one of the four coaches in the top-flight league who have been with one club for over three seasons, the other three being Norman Mapeza (FC Platinum), Takesure Chiragwi (Ngezi Platinum Stars and Joey Antipas (Chicken Inn).\n\nChitembwe guided CAPS United to win the league championship in 2016 as head coach before a successful stint in the CAF Champions League, which saw the side make it to the group stages.\n\nJere has always fought in Chitembwes corner. Last year, he told the media that as long as he is the club president, the latter will be the teams head coach.\n\nAdded Jere, We need to beef up our technical team. After the departure of Tostao Kwashi and Mr Matongorere, we were caught napping.\n\nFootball has changed, it has become too scientific, and that is why you see that big teams have up to a 15-member technical team.\n\nSo we have a problem with our technical team, we need to add, not subtract, he added.\n\nCAPS United last won a major silverware in 2016, and finishing the ongoing season without one will make it a decade of trophy dry spell.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/01/30025241/Lloyd-Chitembwe.jpg",
            "description": "<p>By Sports Reporter CAPS United’s president Farai Jere, has told the team’s supporters that coach Lloyd Chitembwe will not leave the club despite mounting pressure to sack him. Makepekepe has recorded one of the worst league starts in history, winning only one match out of the six they have played. The Green Machine is currently</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chitembwe-not-going-anywhere-caps-united-president-to-supporters/\">Chitembwe not going anywhere – CAPS United president to supporters</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:38",
            "date": "16 Apr 2025"
        },
        {
            "title": "Govt’s ban on vendors fueled human rights abuses – report",
            "url": "https://www.newzimbabwe.com/govts-ban-on-vendors-fueled-human-rights-abuses-report/",
            "content": "By Tapiwa Svondo\n\nThe recent ban on illegal vending by the government and local councils led to widespread human rights violations and economic distress, the latest Zimbabwe Peace Project (ZPP) report has revealed.\n\nAccording to ZPP, implementation of the ban triggered violent confrontations between vendors and the police.\n\nIn Chegutu, Masvingo, Mutare, Chinhoyi and Chipinge, law enforcement operations involved indiscriminate beatings, property destruction, and the unlawful confiscation of goods.\n\nVendors, most of whom are unemployed citizens, including graduates and former formal workers, rely heavily on informal trade for daily survival. The restricted trading hours, compounded by abrupt and violent crackdowns by both municipal and national police, have devastated their ability to earn a living, leading to serious violations of economic and social rights.\n\nOn March 26 in Chegutu, riot police descended on vendors late at night, brutally assaulting both men and women and arresting informal traders and taxi drivers. Witnesses reported terrifying scenes of people being beaten in public places. In Masvingo CBD, a woman selling vegetables collapsed after her entire stock was taken, lamenting that her grandchildren would go without food and that she would fail to pay rent  an illustration of how deeply this crackdown affects basic human dignity and the right to livelihood.\n\nViolent encounters between police and informal traders intensified, with council police in Harare and other areas such as Chinhoyi and Mutare being attacked by desperate vendors. In one case, ZRP officers in Chegutu West beat a taxi driver and damaged his vehicle, provoking a crowd to retaliate by throwing stones, said the report.\n\nDespite vendors facing violent encounters with the local authorities, in Chipinge, the municipal police are reportedly demanding US$30 bribes to release the vendors confiscated wares.\n\nIn Chipinge, council security reportedly demands bribes of USD 30 to return confiscated goods-further evidence of corruption and exploitation of the vulnerable. The impact on human rights is grave.\n\nThe right to work, to livelihood, to be free from inhuman and degrading treatment, and the right to due process are all being systematically violated. The brutal suppression of informal traders undermines constitutional guarantees and places already marginalised citizens in even more precarious conditions, reads the report.\n\nZPP urged the government to address the situation by providing vending spaces.\n\nThese incidents not only reflect growing public frustration but also expose the dangers of militarised, heavy-handed policing in civilian economic spaces. Moreover, these operations have no accompanying plan to provide alternative livelihoods or spaces for vending.\n\nAuthorities have failed to construct adequate marketplaces despite repeated vendor requests, choosing instead to criminalise survival strategies.\n\nInstead of addressing the root causes of economic hardship, authorities are weaponising poverty, turning low enforcement into instruments of fear and repression. The policing strategy, rather than protecting communities, is fueling social unrest and deepening the crisis of legitimacy faced by local and national institutions.\n\nZPP therefore urges the government and local authorities to ensure there is a sustainable dialogue between informal traders on one hand and law enforcement on the other hand, informed by a rights-based approach that respects human dignity, fosters inclusive economic participation, and restores public trust, added the report.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/02/28044227/food-vendor.jpeg",
            "description": "<p>By Tapiwa Svondo The recent ban on illegal vending by the government and local councils led to widespread human rights violations and economic distress, the latest Zimbabwe Peace Project (ZPP) report has revealed. According to ZPP, implementation of the ban triggered violent confrontations between vendors and the police. In Chegutu, Masvingo, Mutare, Chinhoyi and Chipinge,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govts-ban-on-vendors-fueled-human-rights-abuses-report/\">Govt’s ban on vendors fueled human rights abuses – report</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:38",
            "date": "16 Apr 2025"
        },
        {
            "title": "Caledonia’s first quarter gold output surges",
            "url": "https://www.newzimbabwe.com/caledonias-first-quarter-gold-output-surges/",
            "content": "By Alois Vinga\n\nAIM-listed Caledonia Mining Corporation (CMC) has recorded a significant increase in gold output during the first quarter of the year 2025.\n\nA quarterly gold production report shows that output reached 18,671 ounces, exceeding 17,050 ounces produced in the first quarter of 2024 (Q1 2024). The new first quarter production record surpassed the previous high of 18,515 ounces set in the first quarter of 2022.\n\nTonnes milled for the quarter were 201,755 tonnes, 23,793 tonnes (13.4%) above expectation.The surface stockpile increased significantly to approximately 15,000 tonnes as run-of-mine production exceeded milling capacity.\n\nCommenting on the results, Mark Learmonth, Chief Executive Officer, expressed delight over the positive performance.\n\nIm delighted to report that production in Q1 2025 has set a new record for production in a first quarter at Blanket, with over 18,500 ounces produced  a particularly strong performance given that the first quarter is traditionally our weakest.\n\nThis achievement reflects continued operational improvements and the dedication of our team on the ground. The significant increase in both tonnes milled and the surface stockpile provide a strong foundation for the remainder of the year.\n\nThe performance was an excellent start and with a strong gold price we are well positioned to generate healthy cash flows and to continue investing in our growth projects, he added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/04025045/Caledonias-chief-executive-officer-Mark-Learmonth.jpeg",
            "description": "<p>By Alois Vinga AIM-listed Caledonia Mining Corporation (CMC) has recorded a significant increase in gold output during the first quarter of the year 2025. A quarterly gold production report shows that output reached 18,671 ounces, exceeding 17,050 ounces produced in the first quarter of 2024 (“Q1 2024”). The new first quarter production record surpassed the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/caledonias-first-quarter-gold-output-surges/\">Caledonia’s first quarter gold output surges</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:38",
            "date": "16 Apr 2025"
        },
        {
            "title": "Genesis Mangombe on the verge of joining Triangle",
            "url": "https://www.newzimbabwe.com/genesis-mangombe-on-the-verge-of-joining-triangle/",
            "content": "By Sport Reporter\n\nFormer Dynamos and Scottland FC coach Genesis Mangombe is set to be appointed as the new Triangle Coach, New Zimbabwe.com has learnt.\n\nMangombe is set to sign the deal on Tuesday following his arrival in the country on Monday from Tanzania, where he was now leading Tabora United.\n\nThe 42-year-old gaffer comes in as a replacement for Luke Masomere, who was sacked by the club on Monday following a streak of poor results.\n\nTriangle had a dry run under Masomere, who only picked a point in a 2-2 draw against Highlanders, losing the other five matches to Scottland, Tel One, CAPS United, Ngezi Platinum and Bikita Minerals.\n\nGenesis Mangombe will be marking his return to the Zimbabwe Premier Soccer League since parting ways with Dynamos in August last year.\n\nNicknamed Kaka, Mangombe boasts of being the first coach to win the Chibuku Super Cup with the\n\nHarare giants Dynamos FC in 2023.\n\nThe former Yadah gaffer also won the Northern Region Division One League championship with Scottland last year.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/16060800/Genesis-Mangombe.jpg",
            "description": "<p>By Sport Reporter Former Dynamos and Scottland FC coach Genesis Mangombe is set to be appointed as the new Triangle Coach, New Zimbabwe.com has learnt. Mangombe is set to sign the deal on Tuesday following his arrival in the country on Monday from Tanzania, where he was now leading Tabora United. The 42-year-old gaffer comes</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/genesis-mangombe-on-the-verge-of-joining-triangle/\">Genesis Mangombe on the verge of joining Triangle</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:38",
            "date": "16 Apr 2025"
        },
        {
            "title": "Nigerians fear savings lost as investment app freezes them out",
            "url": "https://www.newzimbabwe.com/nigerians-fear-savings-lost-as-investment-app-freezes-them-out/",
            "content": "BBC\n\nAngry Nigerians are turning to social media to describe how they have been locked out of their accounts on the digital financial platform, CBEX.\n\nPeople have posted videos of themselves crying, saying that they could not withdraw their investments and worried that their money had gone.\n\nSome furious customers ransacked a CBEX office in the south-west city of Ibadan, carting off chairs, air-conditioners and a solar panel. CBEX has not yet publicly commented.\n\nThe company had promised that investors would double their money every month. Nigeria is currently facing straitened economic times and many are desperate to find a way to boost their income.\n\nOne investor, identified as Ola, told BBC Pidgin that he feared he had lost 450,000 naira ($280; 210).\n\nI was ready to withdraw all my investment just last week but my friend told me to be patient and wait  and now it has crashed, Ola said.\n\nMany others have shared similar stories online, with one person talking about losing $16,000.\n\nThe problem was first noticed over the weekend, but the anger boiled over when Monday came and people were still not able to access their money.\n\nSome investors who made complaints on the private messaging service Telegram received responses from CBEX.\n\nThey were told that the problem was the result of a hack and things will be resolved soon.\n\nNigerias Securities and Exchange Commission (Sec), which regulates the investment secotr, has not yet responded to a BBC request for comment. But Sec has previously warned citizens about the risks surrounding unregulated digital platforms and potential Ponzi schemes\n\nFor some, the situation brings back painful memories from 2016 when another popular financial scheme, called MMM, froze its transactions, leaving many investors heartbroken.\n\nMembers were supposed to receive a 30% return on their investment in just 30 days. It launched in Nigeria in November 2015 and according to its founders, had up to three million members before it collapsed.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/16060147/nigeria-naira.webp",
            "description": "<p>BBC Angry Nigerians are turning to social media to describe how they have been locked out of their accounts on the digital financial platform, CBEX. People have posted videos of themselves crying, saying that they could not withdraw their investments and worried that their money had gone. Some furious customers ransacked a CBEX office in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nigerians-fear-savings-lost-as-investment-app-freezes-them-out/\">Nigerians fear savings lost as investment app freezes them out</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:38",
            "date": "16 Apr 2025"
        },
        {
            "title": "Inside Melinda Gates’ memoir: The impact of Jeffrey Epstein on her marriage",
            "url": "https://www.newzimbabwe.com/inside-melinda-gates-memoir-the-impact-of-jeffrey-epstein-on-her-marriage/",
            "content": "IOL\n\nMelinda Gates realised her marriage to Bill Gates was in jeopardy in 2019 after revelations about her then-husbands association with Jeffrey Epstein.\n\nMelinda, 60, details the period in her new memoir, The Next Day, describing how she began suffering nightmares and quickly came to understand they were connected to the unravelling state of her relationship.\n\nAt the time, scrutiny was mounting over Bills reported ties to Epstein, a convicted sex offender who died in jail in 2019 while awaiting trial on sex trafficking and federal conspiracy charges. The couple divorced in 2021 after 27 years of marriage.\n\nShe says in her autobiography: That October, things had reached a fever pitch when The New York Times published a deeply disturbing article that raised serious questions about Bills conduct  questions that suggested he had betrayed not only our marriage but also my values.\n\nAccording to The New York Times, Bill, 69, met Epstein on numerous occasions, including one visit that reportedly lasted for hours.\n\nIn an email to colleagues in 2011 after their first meeting, Bill wrote: His lifestyle is very different and kind of intriguing although it would not work for me.\n\nIn an interview with The Wall Street Journal earlier this year, Bill acknowledged his regret over associating with Epstein, saying: In retrospect, I was foolish to spend any time with him. I think I was quite stupid. I thought it would help me with global health philanthropy. In fact, it failed to do that. It was just a huge mistake.\n\nAccording to The Wall Street Journal, Epstein allegedly used knowledge of an affair between Bill and Russian bridge player Mila Antonova to pressure him into joining a multibillion-dollar charitable fund with JPMorgan Chase in 2017.\n\nMelinda previously addressed her concerns about Bills relationship with Epstein in a 2022 interview, saying: I did not like that he had meetings with Jeffrey Epstein, no. I made that clear to him.\n\nShe added that she met Epstein only once, saying: I wanted to see who he was. I regretted it the second I walked in the door. He was abhorrent. He was evil personified. My heart breaks for these women.\n\nIn The Next Day, Melinda also writes ending her marriage was one of the most difficult decisions of her life.\n\nShe says in the book: Leaving my marriage was one of the hardest and most important things Ive ever done.\n\nMelinda and Bill have three adult children  Jennifer, 28, Rory, 25, and Phoebe, 22  and she is now in a relationship with entrepreneur Philip Vaughn, while Bill is dating Paula Hurd.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/16055813/Melinda-Gates-opens-up-about-the-turmoil-in-her-marriage-to-Bill-Gates-revealing-how-Jeffrey-Epstein-s-association-with-her-husband-led-to-nightmares-and-ultimately-their-divorce.webp",
            "description": "<p>IOL Melinda Gates realised her marriage to Bill Gates was in jeopardy in 2019 after revelations about her then-husband’s association with Jeffrey Epstein. Melinda, 60, details the period in her new memoir, ‘The Next Day’, describing how she began suffering nightmares and quickly came to understand they were connected to the unravelling state of her</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/inside-melinda-gates-memoir-the-impact-of-jeffrey-epstein-on-her-marriage/\">Inside Melinda Gates’ memoir: The impact of Jeffrey Epstein on her marriage</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:38",
            "date": "16 Apr 2025"
        },
        {
            "title": "Rustler busted with 11 stolen cattle",
            "url": "https://www.newzimbabwe.com/rustler-busted-with-11-stolen-cattle/",
            "content": "By Staff Reporter\n\nPOLICE in Mashonaland West have arrested a cattle rustler, who was found in possession of 11 stolen beasts.\n\nZimbabwe Republic Police (ZRP) provincial spokesperson, Inspector Ian Kohwera confirmed the recovery of the stolen animals.\n\nI confirm the recovery of 11 stolen cattle at Farm 56 Msengezi, Selous. On April 10, 2025, police recovered 11 cattle which were stolen from Mildred Patsika aged 80 years by her nephew Alexender Mhalasi (52), said Kohwera.\n\nCircumstances are that sometime between February and December 2024, the complainant entrusted her nephew, Mhalasi to look after her 11 cattle since she was not feeling well.\n\nThe complainants health deteriorated and she relocated to Kwekwe for further treatment. It was during this period that her nephew sold all 11 cattle and invested the money in his mining activities.\n\nHowever, the complainant recovered from illness and returned to Selous, where she later learnt from the accuseds wife, Emma Gutu, that all the beasts were sold on the pretext that the money was being channelled to her medical expenses.\n\nA report of stocktheft was made on April 10, 2025, at ZRP Dombwe Base, Selous. Police attended the scene and pursued the accused who had driven off towards the Saruwe area to evade arrest, further said Kohwera.\n\nInformation was sent to Saruwe Police Station, who laid a roadblock but somehow the accused evaded the checkpoint.\n\nMore information came that accused was seen driving towards Kadoma en route to Empress Mine. Working on the information, police swiftly reacted and arrested Mhalasi at Waverly, Kadoma.\n\nPolice interviewed the suspect and he led to the recovery of all the 11 cattle in the Msengezi area where they were sold.\n\nThe provincial spokesperson urged members of the public to ensure that whenever they want to buy stock, they must undertake a proper verification process.\n\nPolice must be involved in the clearing to ensure that the stock is not stolen.\n\nZRP continues to warn all cattle rustlers that the full wrath of the law will soon catch up with them since police officers are doing their best to bust syndicates, said Kohwera.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/02/06230308/Cattle.png",
            "description": "<p>By Staff Reporter POLICE in Mashonaland West have arrested a cattle rustler, who was found in possession of 11 stolen beasts. Zimbabwe Republic Police (ZRP) provincial spokesperson, Inspector Ian Kohwera confirmed the recovery of the stolen animals. “I confirm the recovery of 11 stolen cattle at Farm 56 Msengezi, Selous. On April 10, 2025, police</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rustler-busted-with-11-stolen-cattle/\">Rustler busted with 11 stolen cattle </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:38",
            "date": "16 Apr 2025"
        }
    ]
}