{
    "news": [
        {
            "title": "Zimbabwe on track for 6% growth as economy recovers from drought",
            "url": "https://www.newzimbabwe.com/zimbabwe-on-track-for-6-growth-as-economy-recovers-from-drought/",
            "content": "Reuters\n\nZimbabwe is on track to achieve a forecasted 6% economic growth in 2025 helped by good agricultural output and strong commodity prices, Finance Minister Mthuli Ncube said on Thursday.\n\nThe Southern African countrys economy has shown signs of recovery in the first half of the year following a severe drought and currency turbulence in 2024 that pushedGDP growth down to 2%.\n\nGiven the positive economic developments during the period January to June, we are confident that the projected economic growth of 6% alluded to in the 2025 National Budget is achievable, Ncube told parliament in a mid-year budget review.\n\nAll sectors of the economy are expected to record positive growth in 2025, mainly on account of a favourable agriculture season, improved electricity generation, stable exchange rate and inflation rate, he said.\n\nHe did not give an update on the budget deficit, which was seen at 0.4% of gross domestic product in 2025 during the budget forecast last November.\n\nZimbabwes fiscal position remains under strain from grain imports, drought relief spending and the public sector wage bill. While the government has collected more revenue than in the same period last year, analysts say containing the deficit may prove difficult without new fiscal measures.\n\nThe local currency, the ZiG, launched in April 2024 to replace the Zimbabwe dollar, has largely remained stable against the U.S. dollar but is still overshadowed by widespread use of the dollar in everyday transactions.\n\nNcube reiterated the governments commitment to the gold-backed unit and said the currency had benefited from tight monetary and fiscal policies.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/19181244/Vendors-4.jpg",
            "description": "<p>Reuters Zimbabwe is on track to achieve a forecasted 6% economic growth in 2025 helped by good agricultural output and strong commodity prices, Finance Minister Mthuli Ncube said on Thursday. The Southern African country’s economy has shown signs of recovery in the first half of the year following a severe drought and currency turbulence in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-on-track-for-6-growth-as-economy-recovers-from-drought/\">Zimbabwe on track for 6% growth as economy recovers from drought</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:16",
            "date": "01 Aug 2025"
        },
        {
            "title": "Sinking Dynamos finally registers Denver Mukamba",
            "url": "https://www.newzimbabwe.com/sinking-dynamos-finally-registers-denver-mukamba/",
            "content": "By Sports Reporter\n\nDynamos on Thursday finally registered midfielder Denver Mukamba after a one-month trial.\n\nMukamba becomes the fifth player to be registered by the fading giants, who are currently second from bottom on the log.\n\nMukamba is marking his return to Dynamos since his departure in 2023.\n\nHe last featured for Scottland FC in the Northern Region Division One League last season and was currently unattached to any club this year.\n\nMeanwhile, former Yadah FC coach Thomas Ruzive has been appointed assistant coach at Dynamos.\n\nRuzive will be working with incoming coach Kelvin Kaindu, who is expected to start training the side next week Monday, once his work permit is done.\n\nAccording to inside sources, Ruzive will lead the technical team on Saturday when Dynamos hosts MWOS at RufaroStadium.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/07/25043049/Denver-Mukamba.jpg",
            "description": "<p>By Sports Reporter Dynamos on Thursday finally registered midfielder Denver Mukamba after a one-month trial. Mukamba becomes the fifth player to be registered by the fading giants, who are currently second from bottom on the log. Mukamba is marking his return to Dynamos since his departure in 2023. He last featured for Scottland FC in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sinking-dynamos-finally-registers-denver-mukamba/\">Sinking Dynamos finally registers Denver Mukamba</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:16",
            "date": "01 Aug 2025"
        },
        {
            "title": "‘Like a sci-fi movie’: US baby born from 30-year-old frozen embryo breaks record",
            "url": "https://www.newzimbabwe.com/like-a-sci-fi-movie-us-baby-born-from-30-year-old-frozen-embryo-breaks-record/",
            "content": "BBC\n\nA baby boy has been born to an Ohio couple from an embryo that was frozen for more than 30 years, reportedly setting a new world record.\n\nLindsey, 35, and Tim Pierce, 34, welcomed their son, Thaddeus Daniel Pierce, on Saturday. Ms Pierce toldMIT Technology Reviewher family thought its like something from a sci-fi movie.\n\nIt is believed to be longest that an embryo has been frozen before resulting in a successful live birth. The previous record-holder wasa pair of twins who were born in 2022 from embryos frozen in 1992.\n\nThe Pierces had tried to have a child for seven years before they decided to adopt the embryo Linda Archerd, 62, made with her then-husband in 1994 through IVF.\n\nAt the time, Ms Archerd initially created four embryos. One become her now-30-year-old daughter, and the other three were left in storage.\n\nDespite separating from her husband, she did not want to get rid of the embryos, donate them for research or give them to another family anonymously.\n\nShe said it was important that she was involved with the baby, as they would be related to her adult daughter.\n\nMs Archerd paid thousands of dollars a year for storage until she found a Christian embryo adoption agency, Nightlight Christian Adoptions, which runs a programme known as Snowflakes. Many of these agencies consider their programmes to be saving lives.\n\nThe programme used by Ms Archerd allows donors to choose a couple, meaning they can state religious, racial and nationality preferences.\n\nMs Archerds preference was for a married Caucasian, Christian couple living in the US, as she didnt want to go out of the country, she told MIT Technology Review.\n\nShe ultimately matched with the Pierces.\n\nThe IVF clinic in Tennessee at which the couple underwent the procedure, Rejoice Fertility, said its aim was to transfer any embryo it received, no matter the age or conditions.\n\nMs Pierce said she and her husband did not set out to break any records, but just wanted to have a baby.\n\nMs Archerd told MIT Technology Review she had not met the baby in person yet, but could already see a resemblance with her daughter.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/31194934/embryo.webp",
            "description": "<p>BBC A baby boy has been born to an Ohio couple from an embryo that was frozen for more than 30 years, reportedly setting a new world record. Lindsey, 35, and Tim Pierce, 34, welcomed their son, Thaddeus Daniel Pierce, on Saturday. Ms Pierce told MIT Technology Review her family thought “it’s like something from a sci-fi</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/like-a-sci-fi-movie-us-baby-born-from-30-year-old-frozen-embryo-breaks-record/\">‘Like a sci-fi movie’: US baby born from 30-year-old frozen embryo breaks record</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:16",
            "date": "01 Aug 2025"
        },
        {
            "title": "Polokwane Mayor defends merit-based appointment of Zimbabwean engineer Kennedy Chihota amid public backlash",
            "url": "https://www.newzimbabwe.com/polokwane-mayor-defends-merit-based-appointment-of-zimbabwean-engineer-kennedy-chihota-amid-public-backlash/",
            "content": "CentralNewsZA\n\nPolokwane Mayor John Mpe defends merit-based appointment of Zimbabwean engineer Kennedy Chihota amid public backlash, insisting the decision prioritises skills to tackle water challenges rather than politics or nationality.\n\nIn a media briefing held at Peter Mokaba Stadium on Thursday, Mayor John Mpe addressed growing criticism over the recent council approval of Kennedy Chihota, a Zimbabwean national, as the new Director of Water and Sanitation at Polokwane Municipality. Mpe stressed that the choice was driven by Chihotas strong qualifications and experience, which he believes will help fix long-standing water shortages and infrastructure issues in the city.\n\nChihota is a professionally registered engineer (ECSA) and holds: a Bachelors Degree in Civil Engineering (University of Zimbabwe), Mpe said, highlighting the engineers academic background. He added that Chihota also has Four Masters Degrees in: Water Resources Engineering & Management (University of Zimbabwe), Business Administration (University of Zimbabwe), Property Development (University of the Witwatersrand), and Engineering (University of Stellenbosch).\n\nThis defence comes after widespread public outcry on social media and in local communities, where some residents accused the municipality of favouring foreign nationals over South Africans amid high unemployment rates. The appointment has sparked debates about job opportunities for locals, especially in a province like Limpopo where water access remains a daily struggle for many.\n\nChihotas Qualifications and Experience Under the Spotlight\n\nMpe went into detail about why Chihota stood out during the selection process. He described the new director as a seasoned professional with over 20 years in water systems management, mostly in South African municipalities. He brings experience from: University of Limpopo (Senior Lecturer), Capricorn District Municipality (PMU Manager, Water Services Manager, and Senior Manager for Infrastructure), City of Cape Town, Johannesburg Water, and City of Ekurhuleni, Managing Director at Ekurhuleni Water Care Company, the mayor explained. Mpe made it clear that with such a track record, the municipality is not experimenting but executing on its plans to improve services.\n\nChihotas role is seen as key in dealing with Polokwanes water backlogs, which have left some areas without reliable supply for years. The city has faced ongoing problems like ageing pipes, leaks, and unequal distribution, made worse by rapid urban growth. Residents in townships often rely on communal taps or tankers, while rural parts battle droughts. Mpe argued that Chihotas expertise in water resources and infrastructure will speed up fixes, including upgrades to dams, treatment plants, and distribution networks. Supporters on social media have echoed this, with one user praising him as a seasoned engineer who has spent 20 years serving mostly municipality water systems, hoping for flowing taps of clean water.\n\nHowever, critics question if local talent was overlooked. Opposition parties like the Economic Freedom Fighters (EFF) and Democratic Alliance (DA) have called for transparency in the hiring process, pointing to thousands of unemployed South African engineers. They argue that while merit matters, the government should prioritise citizens in public jobs to fight poverty and build skills at home.\n\nBacklash Linked to Broader Allegations of Favouritism\n\nThe controversy around Chihotas appointment has been fuelled by recent claims that Polokwane Municipality awards tenders to foreign nationals, which Mpe confirmed but defended as merit-based. Just days before, explosive allegations surfaced about a R56 million tender for water infrastructure reportedly given to a company owned by the municipal manager Thuso Nemugumonis alleged Zimbabwean boyfriend. The deal, worth R56,309,901.35, involved supply and maintenance work, but opposition groups labelled it as nepotism and corruption. Mpe has denied any wrongdoing, calling the claims a smear campaign aimed at damaging the municipalitys image.\n\nSocial media has been ablaze with mixed views. Some posts slam the hire as spitting on the faces of voters, with one user noting qualified South African youth are overlooked while foreigners get top posts. Others defend it, saying, Zimbabweans are doing great and serving our communities well. The backlash has hints of xenophobia, with calls to put South Africans first amid economic hardships. Community groups worry this could strain relations with migrant workers who contribute to Limpopos economy in farming and services.\n\nNew Chief Operations Officer Appointed to Strengthen Leadership\n\nIn the same council meeting, Polokwane also named Babalwa Mosomane as the new Chief Operations Officer (COO), a move Mpe hailed as another step to boost efficiency. Mosomane brings a wealth of auditing and management skills to the role. She holds Postgraduate Diplomas in Forensic Auditing and Internal Auditing from UNISA, along with B-Tech and National Diplomas in Internal Auditing from Nelson Mandela Metropolitan University. Her other qualifications include the Municipal Finance Management Programme and Programme in Management Development from Wits Business School.\n\nMosomane is a certified internal audit practitioner, certified ethics practitioner, and a qualified quality assessor, accredited by the relevant professional bodies. Mpe said her expertise will help tighten controls on spending and fight corruption, especially after recent tender troubles. Her appointment has received less criticism, with many seeing it as a positive for good governance in the municipality.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/31195725/KENNEDY-CHIHOTA.webp",
            "description": "<p>CentralNewsZA Polokwane Mayor John Mpe defends merit-based appointment of Zimbabwean engineer Kennedy Chihota amid public backlash, insisting the decision prioritises skills to tackle water challenges rather than politics or nationality. In a media briefing held at Peter Mokaba Stadium on Thursday, Mayor John Mpe addressed growing criticism over the recent council approval of Kennedy Chihota,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/polokwane-mayor-defends-merit-based-appointment-of-zimbabwean-engineer-kennedy-chihota-amid-public-backlash/\">Polokwane Mayor defends merit-based appointment of Zimbabwean engineer Kennedy Chihota amid public backlash</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:16",
            "date": "01 Aug 2025"
        }
    ]
}