{
    "news": [
        {
            "title": "NMBZ draws down Afreximbank’s US$50 million loan facility",
            "url": "https://www.newzimbabwe.com/nmbz-draws-down-afreximbanks-us50-million-loan-facility/",
            "content": "By Alois Vinga\n\nNMBZ Bank has begun drawing down Afreximbanks US$50 million loan facility, with the mining and construction sectors emerging as the biggest beneficiaries after absorbing 50% of the funds.\n\nPresenting a trading update for the third quarter ended September 30, 2025, NMBZ company secretary Violet Mutandwa said the facility has significantly supported key economic sectors through improved access to offshore credit lines.\n\nNMBZ company secretary Violet Mutandwa\n\nDuring the quarter under review, the bank started drawing down on the US$50 million Afreximbank line with over US$25 million already disbursed to the mining and construction sectors. The Bank finalised a US$15 million Agrobond which was privately placed with a European Fund and will go towards supporting the agriculture sector, she said.\n\nDuring the period under review, the Group generated operating income of ZWG1.3 billion for the nine months to September 30, 2025.\n\nIn terms of the Groups core business, net interest income rose by 63% compared to the same period in 2024, driven by increased loans and advances to productive sectors and support for consumer needs. Core income streams remain resilient, supported by strong growth in loans and deposits, while management continues to prioritise revenue diversification and cost optimisation.\n\nThe Group incurred operating expenditure of ZWG1.1 billion, a 70% increase from the prior year. This variance primarily reflects the impact of strategic business reengineering initiatives undertaken during the year, including restructuring and staff rationalisation to align operations with the Groups strategic vision.\n\nTotal assets increased to ZWG9.2 billion, up 27% from ZWG7.3 billion recorded on December 31, 2024. The growth was anchored by an expansion in loans and advances, which stood at ZWG4.2 billion at the end of the quarter.\n\nThe domestic economy is projected to grow by 6.6% in 2025 in line with earlier projections in light of the sustained macroeconomic stability, record-high gold prices, growing remittances and a 12.8% rebound in agriculture following the 2024 El Nino.\n\nIn light of the above, the Group will continue to focus on supporting key sectors of the economy through its core business, Mutandwa added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/07/03034559/NMB-Bank.png",
            "description": "<p>By Alois Vinga NMBZ Bank has begun drawing down Afreximbank’s US$50 million loan facility, with the mining and construction sectors emerging as the biggest beneficiaries after absorbing 50% of the funds. Presenting a trading update for the third quarter ended September 30, 2025, NMBZ company secretary Violet Mutandwa said the facility has significantly supported key</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nmbz-draws-down-afreximbanks-us50-million-loan-facility/\">NMBZ draws down Afreximbank’s US$50 million loan facility</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:32",
            "date": "20 Nov 2025"
        },
        {
            "title": "South Africa to lead global PGM supply rebound next year after dragged output",
            "url": "https://www.newzimbabwe.com/south-africa-to-lead-global-pgm-supply-rebound-next-year-after-dragged-output/",
            "content": "IOL\n\nLower production from platinum group metals mines in South Africa muzzled global PGM supply in the third quarter although gains from the worlds biggest producers of the metal, including Zimbabwe, where Valterra, Impala Platinum and Sibanye-Stillwater operate, are expected to lift up supply by 2% next year.\n\nThe World Platinum Investment Council said on Wednesday that global PGM supplywas flatin the third quarter year on year weighed on by lower South African mineproduction.\n\nThis was after refined volumes fromValterra(formerly Anglo American Platinum) fell inSouth Africa.\n\nThis was reflective of a significant destocking of semi-finished inventory in Q324.\n\nImplats own refined production was, however, little changed year-on-year, although scheduled processing maintenance led to a further build in already elevated work-in-progress stocks.\n\nSouth African production contracted 2% year-on-year to 1 028 koz, said WIPC in a quarterly report.\n\nNonetheless, following the unusually high rainfall and flooding that disrupted South African mining operations earlier this year, as well as theprocessing constraints that curtailed refined volumes,PGMsupply is expected to recover over the latter half of the year.\n\nThe completionof maintenance at Implats South African smelters should allow some destocking of excess inventory that had been deferredearlier in the year, partly due to disruptions to water, power and hydrogen supply to the refineries, further noted WIPC.\n\nAlthough South African mine production is forecast to contract 5% to 3,945 koz, mine supply for PGM from the country is projected to rise by 2% year-on-year in 2026, with gains from South Africa and Zimbabwe partially offset by a modest decline from North America and Russia.\n\nOutput from major South African producers is expected to rise, with improved processing availability anticipated to support a modestincrease in output from Implats, aided by the drawdown of excess semi-finished inventory.\n\nInvestor sentiment in South African platinum miners and future pricing prospects has brightened with the commoditys recent good run in prices providing favourable momentum among fund managers.\n\nLong dogged by suppressed investor sentiment due to low prices and uncertainty that demand could be subdued due to popularity and uptake of electric vehicles, platinum group metals have been on a rebound in the past few weeks.\n\nThis is despite the World Platinum Investment Council saying earlier this year that full-year output will still be 6% lower than last year, since South African producers will not benefit from the large drawdown of work-in-process inventory that occurred last year.\n\nBesides the inclination towards platinum, the South African fund managers have exhibited lowpositioninginhealthcare,offshore,telecomandcash. Thebiggest fallswere recorded forheavyindustrialsand cash, according to Bank of America analysts.\n\nZimbabweanPGMproduction slipped 10% to 119 koz, largely reflecting significant destocking of semi-processed material at Unki, owned by Valterra.\n\nOutput from Zimplats,Zimbabweslargest producer, edged lower owing to furnace repairs.\n\nThus, PGM supply from Zimbabwe is expected to contract by 4% year-on-year to 493 koz, retreating from the record level achieved in 2024.\n\nThe decline primarily reflects the absence of a drawdown of semi-finished stock that boosted last years volumes, said WIPC.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/20044527/gold-platinum.jpg",
            "description": "<p>IOL Lower production from platinum group metals mines in South Africa muzzled global PGM supply in the third quarter although gains from the world’s biggest producers of the metal, including Zimbabwe, where Valterra, Impala Platinum and Sibanye-Stillwater operate, are expected to lift up supply by 2% next year. The World Platinum Investment Council said on</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africa-to-lead-global-pgm-supply-rebound-next-year-after-dragged-output/\">South Africa to lead global PGM supply rebound next year after dragged output</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:32",
            "date": "20 Nov 2025"
        },
        {
            "title": "Nakamba relishing AFCON after captaining Zimbabwe to first win in over a year",
            "url": "https://www.newzimbabwe.com/nakamba-relishing-afcon-after-captaining-zimbabwe-to-first-win-in-over-a-year/",
            "content": "Luton Town\n\nLutonmidfielder Marvelous Nakamba captainedZimbabweto their first win in over 12 months as they defeatedQatar2-1 in a friendly in Doha on Monday night.\n\nThe Warriors, who currently sit 129th in the FIFA rankings, went into the contest against their 52nd-placed hosts, having not triumphed in their 11 previous matches, as they suffered three defeats in their World Cup qualifiers to Benin, Rwanda and Lesotho, drawing the other three group stage fixtures against Benin, Nigeria and South Africa as they finished bottom in the table.\n\nZimbabwe also lost two out of three friendlies to Burkina Faso and Algeria, with a 1-1 draw against Nigeria, as last year, they were beaten by Cameroon and drew with Kenya in the Africa Cup of Nations qualifying matches, meaning their last victory was a 3-1 success over Namibia on October 14, a match in which Nakamba was an unused substitute.\n\nThe former Aston Villa midfielder played five games in that time, as having been overlooked for the 3-1 friendly defeat against Algeria on Thursday, returned to the starting line-up against Qatar to win his 32nd cap. The hosts, under recently appointed manager Romanian Marian Marinica, who replaced Michael Nees a few weeks ago, fell behind when Mohamed Gouda scored on just nine minutes.\n\nHowever, Munashe Garananga equalised midway through the first half, with Belgian Pro League club Mechelen winger Bill Antonio grabbing a winner on 74 minutes to seal a long-awaited triumph. Writing on Instagram, then looking ahead to the Africa Cup of Nations which sees Zimbabwe take on Angola, Egypt and South Africa in Group B, the competition starting on December 21, with the first game against Egypt on Saturday, December 22, Nakamba believes the victory was a huge momentum going into the tournament.\n\nHe said: A BIG THANK YOU to all Zimbabweans who were rallying behind us back from home, all over the world and those in Qatar, Saudi Arabia who came out in numbers to support us during the international friendly matches. Without you, we feel incomplete. Thank you to the ZIFA leadership, led by the Zifa president Nqobile Magwizi for organising such kind of international friendlies matches. Thank you to the Minister of Tourism, Honourable Barbara Rwodzi, who took time to visit the team in camp and to watch us play against Algeria in Saudi Arabia on Thursday, even though we disappointingly lost that match 3-1.\n\nLastly, I want to thank the corporate world and all football stakeholders, we dearly need your support in everything we do, kindly chip in, help and support us. The victory against Qatar brings confidence and renewed zeal within the squad, especially with just a few weeks left before the prestigious AFCON tournament. As players, we always play with our hearts out, I believe with your support and if we all pull in one direction, we will get it right. This is the moment we need your support the most. Thank you, Zimbabweans.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/11/04153736/nAKAMBA.jpg",
            "description": "<p>Luton Town Luton midfielder Marvelous Nakamba captained Zimbabwe to their first win in over 12 months as they defeated Qatar 2-1 in a friendly in Doha on Monday night. The Warriors, who currently sit 129th in the FIFA rankings, went into the contest against their 52nd-placed hosts, having not triumphed in their 11 previous matches, as they suffered three defeats</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nakamba-relishing-afcon-after-captaining-zimbabwe-to-first-win-in-over-a-year/\">Nakamba relishing AFCON after captaining Zimbabwe to first win in over a year</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:32",
            "date": "20 Nov 2025"
        },
        {
            "title": "Senator raises alarm over destructive mining by foreign investors as communities are displaced without compensation",
            "url": "https://www.newzimbabwe.com/senator-raises-alarm-over-destructive-mining-by-foreign-investors-as-communities-are-displaced-without-compensation/",
            "content": "By Anna Chibamu\n\nMining activities in several communities have taken a disturbing turn, with foreign investors accused of displacing villagers, disrupting livelihoods, and failing to compensate affected families or rehabilitate damaged land, Mashonaland East Senator Chief Chikwaka has warned.\n\nSpeaking in the Senate recently, Goromonzis Chief Chikwaka said that while Zimbabwe remains open for business, some foreign miners were wreaking havoc in the communities where they operate.\n\nWhat is government policy regarding the allocation of licences where you find miners displacing local communities? This is affecting peoples livelihoods. You would find that people are just relocated without improving their livelihoods.\n\nWhat is the government policy in terms of people who are being displaced by mining activities, where you find, them being relocated to areas which are not conducive? he said.\n\nHis concerns come just two months after President Emmerson Mnangagwa directed Parliament to expedite the long-overdue Mines and Minerals Bill to address ongoing disputes between miners, farmers, and communities.\n\nResponding to the issue, Mines and Mining Development Deputy Minister responsible for Oil and Gas Research and other Strategic Minerals Exploration, Caleb Makwiranzou, acknowledged the challenges.\n\nThe Deputy Minister said, Before giving permission to miners, we require a report, which is called the Environmental Impact Assessment (EIA), which is a report, which looks at the community which is going to be affected, and where they are going to be relocated. If they going to receive houses where they are going to be relocated, then after getting that report, that is where we allow mining companies to go ahead.\n\nMakwiranzou also highlighted provisions in the new law.\n\nI want to inform this House that the new law [H. B. 1, 2025] allows that if someone has their field or their farm and there is a need for mining to be done in that field, that person is given the first option. The person is asked whether they allow the miners, and then they can discuss with whoever wants to mine if there is an allocation of shares. The person can then be given shares.\n\nOn the other hand, if that person is to be relocated, it should be consensual. They must give consent because the previous law was causing disputes where there was conflict between the Minerals Act and the Agricultural Act, said Makwiranzou.\n\nHowever, Chief Chikwaka argued that, in reality, no environmental impact assessments were being conducted before mining begins.\n\nThere is no Environmental Impact Assessment, which is being done. You would find that miners are just coming into the community. They start drilling in peoples fields. They start mining and excavating in peoples fields and leave such fields open.\n\nThey do not cover the pits and the original farmer cannot farm on his land because there are pits. There is a need for consultation with stakeholders, Chief Chikwaka said.\n\nMakwiranzou stressed that operating without an EIA is illegal, adding that government would send inspectors to the affected communities and block the mining activities.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/26023525/Chinese-Mining-Operations.png",
            "description": "<p>By Anna Chibamu Mining activities in several communities have taken a disturbing turn, with foreign investors accused of displacing villagers, disrupting livelihoods, and failing to compensate affected families or rehabilitate damaged land, Mashonaland East Senator Chief Chikwaka has warned. Speaking in the Senate recently, Goromonzi’s Chief Chikwaka said that while Zimbabwe remains open for business,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/senator-raises-alarm-over-destructive-mining-by-foreign-investors-as-communities-are-displaced-without-compensation/\">Senator raises alarm over destructive mining by foreign investors as communities are displaced without compensation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:32",
            "date": "20 Nov 2025"
        },
        {
            "title": "Zimbabwe needs $5–6 billion in reserves to shift to single-currency regime: Central Bank",
            "url": "https://www.newzimbabwe.com/zimbabwe-needs-5-6-billion-in-reserves-to-shift-to-single-currency-regime-central-bank/",
            "content": "Channel Africa\n\nZimbabwe will need up to $6 billion in reserves to fully transition to a mono-currency system by 2030, according to the countrys monetary authorities.\n\nSpeaking in an interview with Channel Africa on Tuesday, Persistence Gwanyanya explained that although current reserves stand at $980 million, this remains far below what is required for the Zimbabwe Gold (ZiG) to operate as the countrys sole currency.\n\nThe present reserve level provides more than four times cover for reserve money, far above the minimum one-to-one backing required, but still insufficient for a mono-currency environment.\n\nOfficials stressed thatZimbabwes domestic currency must be fully backed by foreign currency reserves and precious mineralsto ensure stability and convertibility.\n\nWe need reserves that provide between three and six months of import cover for a mono-currency regime.To achieve that, Zimbabwe would require between 5 and 6 billiondollars.At the pace we are accumulating reserves, we are confident we can reach those levels, Gwanyanya said.\n\nMonetary authorities emphasised that while reserves are essential, macroeconomic stability is the decisive factor.\n\nWe need durable stability, price stability, and exchange-ratestabilityto restore trust in the currency. Stability for beyond one year is crucial for the market to accept a mono-currency arrangement,  he said.\n\nThe Reserve Bank attributes the increase to several factors, including:\n\nGold reserves currently stand at around 3.5 tonnes, and the authorities say the country has benefited from the global gold price rally.\n\nZimbabwe also continues to accumulate reserves through the foreign-currency surrender system, in which exporters convert part of their earnings into local currency.\n\nAt the rate we are accumulating these reserves, it is quite encouraging. Our exports are increasing, and this is what funds reserve accumulation.\n\nHowever, they cautioned that beyond building reserves, confidence in the ZiG and broader economic performance will determine the success of the 2030 single-currency target.\n\nOur economy has been performing to expectations, and in some cases exceeding expectations, despite external shocks. But stability remains the foundation for trust in the currency, Gwanyanya said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/02/23165932/Reserve-Bank-of-Zimbabwe.jpeg",
            "description": "<p>Channel Africa Zimbabwe will need up to $6 billion in reserves to fully transition to a mono-currency system by 2030, according to the country’s monetary authorities. Speaking in an interview with Channel Africa on Tuesday, Persistence Gwanyanya explained that although current reserves stand at $980 million, this remains far below what is required for the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-needs-5-6-billion-in-reserves-to-shift-to-single-currency-regime-central-bank/\">Zimbabwe needs $5–6 billion in reserves to shift to single-currency regime: Central Bank</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:32",
            "date": "20 Nov 2025"
        },
        {
            "title": "Ex-CIO boss Tapfumaneyi takes over as Army Commander as Matatu is named new ZDF Commander",
            "url": "https://www.newzimbabwe.com/ex-cio-boss-tapfumaneyi-takes-over-as-army-commander-as-matatu-is-named-new-zdf-commander/",
            "content": "By Staff Reporter\n\nPresident Emmerson Mnangagwa has appointed Lt. General Emmanuel Matatu as the new Zimbabwe Defence Forces (ZDF) Commander following the retirement of General Philip Valerio Sibanda.\n\nMatatu, who was appointed Zimbabwe National Army (ZNA) Commander in March this year, will be replaced by former Deputy Director General of the Central Intelligence Organisation (CIO), Asher Walter Tapfumaneyi.\n\nTapfumaneyi had been named ZNA Chief of Staff in May.\n\nHis Excellency, the President of the Republic of Zimbabwe and Commander-in-Chief of the Zimbabwe Defence Forces, Cde Dr Emmerson Dambudzo Mnangagwa, acting in terms of section 216(2 of the Constitution of Zimbabwe as read with sections 7(1) and 8(2 of the Defence Act [Chapter 11:02], promoted Lieutenant Genera Emmanuel Matatu to the rank of General and appointed him Commander of the Zimbabwe Defence Forces with effect from 21 November 2025.\n\nThe appointment follows the retirement of outgoing Commander of the Zimbabwe Defence Forces, General Philip Valerio Sibanda, Rushwaya said\n\nSibanda is expected to take up a role in the ruling Zanu PF politburo.\n\nIn 2023, Mnangagwa briefly appointed him to the partys politburo before reversing the decision following a backlash from civil society. His appointment was scheduled for review at the end of his army tenure.\n\nWith tensions reportedly deepening over Mnangagwas succession, analysts view the elevation of his close allies to key military positions as a move to consolidate and secure his political interests.\n\nThe military played a pivotal role in the 2017 coup that propelled Mnangagwa to power, making control of the security sector crucial in maintaining his hold on the state.\n\nTapfumaneyi was placed under US sanctions in 2024 for his alleged role in disrupting the 2023 general elections through the Forever Association of Zimbabwe (FAZ), which was accused of intimidating voters at polling stations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/27184152/matatu.jpeg",
            "description": "<p>By Staff Reporter President Emmerson Mnangagwa has appointed Lt. General Emmanuel Matatu as the new Zimbabwe Defence Forces (ZDF) Commander following the retirement of General Philip Valerio Sibanda. Matatu, who was appointed Zimbabwe National Army (ZNA) Commander in March this year, will be replaced by former Deputy Director General of the Central Intelligence Organisation (CIO),</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ex-cio-boss-tapfumaneyi-takes-over-as-army-commander-as-matatu-is-named-new-zdf-commander/\">Ex-CIO boss Tapfumaneyi takes over as Army Commander as Matatu is named new ZDF Commander</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:32",
            "date": "20 Nov 2025"
        },
        {
            "title": "Zimbabwe’s inflation drops, but debt management remains key",
            "url": "https://www.newzimbabwe.com/zimbabwes-inflation-drops-but-debt-management-remains-key/",
            "content": "Forbes Africa\n\nThe Zimbabwe Gold (ZiG) experiment seems to be proving its worth with the nation set to see a major boost by the end of 2025.\n\nZimbabwes economy hasbeenimpactedbysevere inflation since the early 2000s, but officialsmaybebreathing a sigh of relieffollowinga recentConfederation of Zimbabwe Industries (CZI) report, which showed inflation to have droppedfrom82.7% in September to 32.7% in October.\n\nThe future appears brighter with inflation projected to fall to between 15% and 20% by the end of the year, marking a significant recovery from 2020, when inflation soared past 500%,amid the pandemic.\n\nIntroduced by the Reserve Bank of Zimbabwe (RBZ) in April 2024, the rising valuation ofZiG, pegged to foreign currency and precious metals, primarily gold, has beenaleading protagonist behind Zimbabwes economic resurgence.\n\nAccording to theInternational Monetary Fund, the nations current GDP is $53.31 billionup $13.35 billion from 2020.\n\nHowever, despitetheimpactof theZiG, expertsseem to becautiousofa recurring theme of volatility.\n\nThe outlook for the ZiG has improved over the near term, supported by elevated gold prices. However, it still has a long way to go before it becomes the sole legal tender for Zimbabwe, says Lyle Begbie, an economist at Oxford Economics Africa.\n\nZimbabwes history of hyperinflation and failed monetary experiments means itremainshighly dollarized. The U.S.dollar is the main medium of exchange, while the share ofZiGin monetary aggregates is small at around 17%. Prices are rarely quoted inZiG, and salaries and goods and services transactions are typically either fully or partially paid in U.S.dollars.\n\nWhile stabilizing inflation is undoubtedly positive, the landlocked nationwill need to remain steadfastregardingother challenges,before unlocking national sovereignty. Zimbabwes public debt, which reached $23.2 billion in 2024 (72.9% of GDP),per the World Bank,remainsa discouraging barrier to foreign investment.\n\nZimbabwes debt arrearssubstantially weighon its economic growth outlook, Begbie explains, before adding, Due to these arrears, the country cannot access concessional funding from multilateralorganizations, andis excluded from obtaining any sort of debt relief.\n\nThe World Bank has placed Zimbabwe in non-accrual status since 2000. Whilemassivedebtrisks stallingmomentum, addressing inflationwillput thatsummitwithin reach.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/02115157/zig.webp",
            "description": "<p>Forbes Africa The Zimbabwe Gold (ZiG) experiment seems to be proving its worth with the nation set to see a major boost by the end of 2025. Zimbabwe’s economy has been impacted by severe inflation since the early 2000s, but officials may be breathing a sigh of relief following a recent Confederation of Zimbabwe Industries (CZI) report, which showed inflation to have dropped from 82.7% in September</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-inflation-drops-but-debt-management-remains-key/\">Zimbabwe’s inflation drops, but debt management remains key</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:32",
            "date": "20 Nov 2025"
        }
    ]
}