{
    "news": [
        {
            "title": "In Pictures: Heavy police presence in Harare amid Geza’s planned anti-govt protests",
            "url": "https://www.newzimbabwe.com/in-pictures-heavy-police-presence-in-harare-amid-gezas-planned-anti-govt-protests/",
            "content": "There was a heavy police presence in Harares central business district on Friday amid calls for nationwide protests by former ZANU PF Central Committee member and war veteran Blessed Geza.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/17145003/geza-police-5.jpg",
            "description": "<p>There was a heavy police presence in Harare’s central business district on Friday amid calls for nationwide protests by former ZANU PF Central Committee member and war veteran Blessed Geza. Dozens of armed police officers were deployed across the city, with roadblocks mounted at key intersections. Africa Unity Square and Robert Mugabe Square, both traditional gathering</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-pictures-heavy-police-presence-in-harare-amid-gezas-planned-anti-govt-protests/\">In Pictures: Heavy police presence in Harare amid Geza’s planned anti-govt protests</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "17 Oct 2025"
        },
        {
            "title": "Man (40) convicted for bestiality with goat, courts worried over rise in cases of “weird sexual desires”",
            "url": "https://www.newzimbabwe.com/man-40-convicted-for-bestiality-with-goat-courts-worried-over-rise-in-weird-desires/",
            "content": "By Staff Reporter\n\nA KWEKWE magistrate has convicted a 40-year-old man for bestiality with a she goat.\n\nThe offender, Stephen Musongwe, was sentenced to six months imprisonment when he appeared at Kwekwe Magistrates Court this week. Three months of the sentence were conditionally set aside while the remainder was commuted to 105 hours of community service.\n\nThe court heard that on August 14, 2025, at around 9am at a homestead in Semchengwe village, Redcliff, the offender, a labourer formerly employed by the goats owner, proceeded to the goat pen.\n\nIt was further heard that upon arrival at the pen, Musongwe pinned the she goat before engaging in the dastardly sexual act on the animal. He was busted by the livestock owner, prompting him to flee the scene, but he had already been positively identified.\n\nA report was made to the police, leading to Musongwes arrest.\n\nIn a statement following sentencing, the National Prosecuting Authority of Zimbabwe (NPAZ) expressed worry over the rising trend of bestiality.\n\nCase of bestiality have been on the increase lately and it is the duty of the law to protect our animals from individuals with weird sexual desires, noted the NPAZ.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/04/16182340/Goat.jpg",
            "description": "<p>By Staff Reporter A KWEKWE magistrate has convicted a 40-year-old man for bestiality with a she goat. The offender, Stephen Musongwe, was sentenced to six months’ imprisonment when he appeared at Kwekwe Magistrates Court this week. Three months of the sentence were conditionally set aside while the remainder was commuted to 105 hours of community</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-40-convicted-for-bestiality-with-goat-courts-worried-over-rise-in-weird-desires/\">Man (40) convicted for bestiality with goat, courts worried over rise in cases of “weird sexual desires”</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "17 Oct 2025"
        },
        {
            "title": "IMF lauds Zimbabwe’s economic progress, but says arrears block lending",
            "url": "https://www.newzimbabwe.com/imf-lauds-zimbabwes-economic-progress-but-says-arrears-block-lending/",
            "content": "Reuters\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/08111459/harare.jpeg",
            "description": "<p>Reuters The International Monetary Fund said on Thursday it remains unable to lend to Zimbabwe due to the country’s outstanding arrears, but praised recent economic reforms as discussions progress on a potential staff-monitored program. “Zimbabwe’s ability to borrow financially from us is constrained by the fact that they have arrears through the African Development Bank,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/imf-lauds-zimbabwes-economic-progress-but-says-arrears-block-lending/\">IMF lauds Zimbabwe’s economic progress, but says arrears block lending</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "17 Oct 2025"
        },
        {
            "title": "Million Man March: Despite Mnangagwa’s pushback, Geza vows to spoil ZANU PF’s conference",
            "url": "https://www.newzimbabwe.com/million-man-march-despite-mnangagwas-pushback-geza-vows-to-spoil-zanu-pfs-conference/",
            "content": "By Darlington Gatsi\n\nFugitive war veteran Blessed Geza has vowed to disrupt Zanu PFs National Peoples Conference currently underway in Mutare, by leading nationwide protests against President Emmerson Mnangagwa, whom he accuses of presiding over a corrupt administration.\n\nThis marks the third time this year that Geza has called for mass demonstrations, saying his latest action is meant to express public outrage over alleged state capture and corruption.\n\nGezas latest statement comes amid escalating tensions within the ruling party, following Mnangagwas recent clash with Vice President Constantino Chiwenga in the Politburo over a corruption dossier implicating several well-connected businessmen.\n\nGeza accuses Mnangagwa and businessmen Kudakwashe Tagwirei, Wicknell Chivayo, and Pedzai Scott Sakupwanya of being central to deep-rooted corruption within both government and Zanu PF structures.\n\nHis remarks mirror allegations contained in Chiwengas corruption dossier, which was recently tabled before the Zanu PF Politburo but subsequently dismissed by the party.\n\nThe planned October 17 Million Man March coincides with the Zanu PF conference in Mutare, which observers say is expected to be tense as factional divisions between Mnangagwa and Chiwenga camps continue to widen.\n\nIt is now time for accountability, for the reclamation of our country and for the restoration of the peoples dignity and from Friday 17 October 2025, the people of Zimbabwe shall rise against State Capture and High Corruption being perpetrated by President Emerson Mnangagwa and his Zvigananda led by Kudakwashe Tagwirei, Wicknell Chivhayo, Scott Sakupwanya, Delish Nguwaya, said Geza further.\n\nHowever, it remains uncertain whether the public will heed Gezas call, as the Zimbabwe Republic Police (ZRP) has already warned citizens against participating in any unsanctioned demonstrations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/12055423/geza_vid_2.jpg",
            "description": "<p>By Darlington Gatsi Fugitive war veteran Blessed Geza has vowed to disrupt Zanu PF’s National People’s Conference currently underway in Mutare, by leading nationwide protests against President Emmerson Mnangagwa, whom he accuses of presiding over a corrupt administration. This marks the third time this year that Geza has called for mass demonstrations, saying his latest</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/million-man-march-despite-mnangagwas-pushback-geza-vows-to-spoil-zanu-pfs-conference/\">Million Man March: Despite Mnangagwa’s pushback, Geza vows to spoil ZANU PF’s conference</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "17 Oct 2025"
        },
        {
            "title": "Munetsi raises alarm over fake agents preying on African footballers",
            "url": "https://www.newzimbabwe.com/munetsi-raises-alarm-over-fake-agents-preying-on-african-footballers/",
            "content": "By Sports Reporter\n\nWarriors vice captain Marshall Munetsi has expressed deep concern over the growing number of African footballers falling victim to fake agents, warning that the scam is robbing many young players of their dreams and hard-earned money.\n\nThe Wolverhampton Wanderers midfielder said the trend is on the rise, with con artists exploiting the ambitions of players seeking opportunities in Europe.\n\nMunetsi, a member of the FIFPro Global Player Council, said he has long been advocating for awareness on the issue, describing it as a crisis that requires urgent attention.\n\nIts more than a crisis in Africa, a person might create a social media account, come to Europe, watch a game take a picture [with a player], then put that picture on their profile and write theyre a football agent.\n\nA lot of people then end up paying money to that agent with promises of going to Europe, he said.\n\nThe midfielder revealed that he has personally encountered victims of these scams during his time in France, including established players who were deceived by fake agents.\n\nI had three guys who came to France when I was at Reims asking for accommodation because an agent had promised them some trials in Europe, and then they were just stuck at the airport when they got there and nobody was there.\n\nI am talking about guys who are playing for top teams in Africa that were also scammed. Its a big problem that needs to get real attention, said Munetsi.\n\nWhile there are no official statistics on the number of players defrauded by bogus agents, FIFPro has intensified awareness campaigns across Africa to help players identify legitimate representation and avoid exploitation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/10070129/munetsi-debut.webp",
            "description": "<p>By Sports Reporter Warriors vice captain Marshall Munetsi has expressed deep concern over the growing number of African footballers falling victim to fake agents, warning that the scam is robbing many young players of their dreams and hard-earned money. The Wolverhampton Wanderers midfielder said the trend is on the rise, with con artists exploiting the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/munetsi-raises-alarm-over-fake-agents-preying-on-african-footballers/\">Munetsi raises alarm over fake agents preying on African footballers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "17 Oct 2025"
        },
        {
            "title": "South Africa’s defence committees decry ‘non-existent’ Beitbridge border post security",
            "url": "https://www.newzimbabwe.com/south-africas-defence-committees-decry-non-existent-beitbridge-border-post-security/",
            "content": "IOL\n\nIn a stark assessment, the South African Joint Standing Committee on Defence (JSCOD) and the Portfolio Committee on Defence and Military Veterans (PCDMV) have expressed grave concern over border security, warning that the countrys frontiers are operating with minimal control and are vulnerable to illegal crossings.\n\nThis follows a recent oversight visit to Limpopo, where MPs inspected the Beitbridge border post and other high-risk areas to evaluate existing security measures.\n\nMalusi Gigaba, chairperson of the JSCOD, criticised government inaction on long-standing concerns.\n\nThe SANDF is severely underfunded. We should have 22 companies patrolling our borders, but currently there are only 15. Even these face critical shortages of personnel, vehicles and modern surveillance tools like drones, he said.\n\nThis admission paints a bleak picture of a defence force stretched thin across vast and often inhospitable border terrain.\n\nThe SANDF highlighted further challenges, citing insufficient manpower to monitor the borders shared with Zimbabwe, Botswana and Mozambique. Soldiers are required to patrol hundreds of kilometres with limited resources, and the presence of informal settlements near the Limpopo River has complicated matters, with some residents allegedly assisting illegal crossings.\n\nDakota Legoete, chair of the PCDMV, was equally candid.\n\nIf we are being honest, we dont have functioning borders  and that puts the safety of our country at risk, he said. His comments were echoed by Mr Phiroane Phala, co-chair of the JSCOD, who emphasised the need to balance diplomatic relations with neighbouring countries and the imperative of national security. We cannot allow people to enter and leave the country without control, he said.\n\nCommittee members witnessed the dilapidated state of border fences and identified several areas where illegal crossings are rampant. Soldiers stationed in these zones shared their frustrations over the lack of numbers and support, saying they are unable to effectively monitor the largely unregulated movement of people.\n\nIn response, the committees have pledged to strengthen their oversight efforts.\n\nThey are advocating for increased funding, improved coordination between departments and modernised border infrastructure. They also plan to engage key stakeholders  including the Border Management Authority, the SANDF, the SAPS and SARS  to develop a more unified response to the crisis, with particular focus on the Beitbridge border post.\n\nThe visit comes at a pivotal moment in South Africas border control strategy, underlining the urgency of interdepartmental cooperation and renewed investment in national security infrastructure.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/03/11030946/Border-jumper.jpg",
            "description": "<p>IOL In a stark assessment, the South African Joint Standing Committee on Defence (JSCOD) and the Portfolio Committee on Defence and Military Veterans (PCDMV) have expressed grave concern over border security, warning that the country’s frontiers are operating with minimal control and are vulnerable to illegal crossings. This follows a recent oversight visit to Limpopo,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africas-defence-committees-decry-non-existent-beitbridge-border-post-security/\">South Africa’s defence committees decry ‘non-existent’ Beitbridge border post security</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "17 Oct 2025"
        },
        {
            "title": "Police warns against participation in Geza’s October 17 protests",
            "url": "https://www.newzimbabwe.com/police-warns-against-participation-in-gezas-october-17-protests/",
            "content": "By Thandiwe Garusa\n\nTHEZimbabwe Republic Police (ZRP) has warned that any attempts to engage in illegal demonstrations or gatheringson Fridaywill be met with the full wrath of the law.\n\nThis follows war veteran and ex-Zanu PF committee member Blessed Gezas call for nationwide protests against President Emmerson Mnangagwa and his allies, accusing them of corruption.\n\nIn a statement Thursday, policespokespersonCommissionerPaul Nyathisaid comprehensive security measures havebeen put in place nationwideto ensure peace and stability.\n\nThe Zimbabwe Republic Police assures all Zimbabweans and visitors that comprehensive security measures have been put in place to ensure peace, law and order prevails before, during and after October 17.\n\nThe public is urged not to be misled or intimidated by rumours, misinformation, or threats circulating on social media platforms.\n\nActs of violence, threats, vandalism, or incitement to commit crime will be severely dealt with in line with the countrys laws\n\nAny attempts to engage in unlawful demonstrations, gatherings, or processions will be met with the full wrath of the law, Nyathi said.\n\nHe further urged the public to go about their daily activities without fear, adding that all essential services, including schools, businesses, public transport, and government offices will continue to operate as normal.\n\nMembers of the public are implored to go about their daily activitieswithoutfear.All essential services, including schools, businesses, public transport and government institutions,willcontinue to operate as usual, headded.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/19204352/Paul-Nyathi-3.png",
            "description": "<p>By Thandiwe Garusa THE Zimbabwe Republic Police (ZRP) has warned that any attempts to engage in illegal demonstrations or gatherings on Friday will be met with “the full wrath of the law”. This follows war veteran and ex-Zanu PF committee member Blessed Geza’s call for nationwide protests against President Emmerson Mnangagwa and his allies, accusing them of corruption.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/police-warns-against-participation-in-gezas-october-17-protests/\">Police warns against participation in Geza’s October 17 protests</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "17 Oct 2025"
        }
    ]
}