{
    "news": [
        {
            "title": "UK: Umguza council showcases investment opportunities to diasporans",
            "url": "https://www.newzimbabwe.com/uk-umguza-council-showcases-investment-opportunities-to-diasporans/",
            "content": "By UK correspondent\n\nOFFICIALS from Umguza rural district council recently showcased investment opportunities in the region to Diasporans in the United Kingdom at an event organised by the Zimbabwe Diaspora Organisation (ZIDO).\n\nCEO Collen Moyo led a team which included executive officer administration, Vusa Sikhosana, as well as environment and natural resources officer Linda Maphosa, at the event which was hosted by Diaspora Insurance at the companys global headquarters in Birmingham.\n\nScores of diasporans attended the presentation which was part of the annual UK-Zimbabwe Business Expo organised by ZIDO.\n\nDiaspora InsuranceCEO, Jeff Madzingo, reiterated the companys enduring commitment to supporting African diasporas worldwide, adding that the companys facilities in Birmingham were a home-away-from-home for the global African community.\n\nMeanwhile, the Umguza CEO and his team highlighted opportunities in real estate including the upmarket Kingsbury gated community, servicing and development and thousands of stands in Ntabazinduna and Nyamandlovu.\n\nOpportunities also exist in horticultural processing for export, water purification as well as the development of a shopping mall.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/17171748/Umguza-two-officials_.png",
            "description": "<p>By UK correspondent OFFICIALS from Umguza rural district council recently showcased investment opportunities in the region to Diasporans in the United Kingdom at an event organised by the Zimbabwe Diaspora Organisation (ZIDO). CEO Collen Moyo led a team which included executive officer administration, Vusa Sikhosana, as well as environment and natural resources officer Linda Maphosa,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uk-umguza-council-showcases-investment-opportunities-to-diasporans/\">UK: Umguza council showcases investment opportunities to diasporans</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:36",
            "date": "17 Oct 2025"
        },
        {
            "title": "Million Man March: Mnangagwa unleashes security forces to thwart Geza protests",
            "url": "https://www.newzimbabwe.com/million-man-march-mnangagwa-unleashes-security-forces-to-thwart-geza-protests/",
            "content": "By Staff Reporter\n\nGovernment has deployed heavy security across Harare in a bid to thwart planned protests led by fugitive war veteran Blessed Geza, who is calling for President Emmerson Mnangagwas resignation.\n\nThe Zimbabwe Republic Police (ZRP) anti-riot unit has flooded the Central Business District (CBD), creating a tense atmosphere as authorities move to pre-empt the demonstrations, dubbed the Million Man March.\n\nAfrica Unity Square, which had been designated as the main protest site, has been cordoned off and heavily patrolled by police officers.\n\nArmoured tankers have been rolled onto the streets, and pedestrians are being denied entry into Africa Unity Square. ZRP officers are stationed at key intersections, including Cameroon, Jason Moyo, Rezende and Robert Mugabe streets.\n\nFurther down the city, Robert Mugabe Square has also been sealed off by anti-riot units, with driving school operators ordered to vacate the area, adding to the uneasy atmosphere.\n\nPolice have also released horses from stables, in what observers described as a show of force and panic by the authorities.\n\nIn a statement issued Thursday, the ZRP warned that any attempts to stage protests would be met with firm resistance.\n\nActs of violence, threats, vandalism, or incitement to commit crime will be severely dealt with in line with the countrys laws.\n\nAny attempts to engage in unlawful demonstrations, gatherings, or processions will be met with the full wrath of the law, read the statement from ZRP.\n\nGeza has called for nationwide demonstrations to express public anger over what he terms state capture and grand corruption by a clique of powerful businessmen allegedly protected by Mnangagwas administration.\n\nHe has also spoken out against Zanu PFs push to extend Mnangagwas rule beyond the constitutionally mandated two terms, which expire in 2028.\n\nThe protests coincide with the ruling partys National Peoples Conference currently underway in Mutare, which has been overshadowed by factional tensions between Mnangagwa and his deputy, Constantino Chiwenga.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/17125252/1001110320.jpg",
            "description": "<p>By Staff Reporter Government has deployed heavy security across Harare in a bid to thwart planned protests led by fugitive war veteran Blessed Geza, who is calling for President Emmerson Mnangagwa’s resignation. The Zimbabwe Republic Police (ZRP) anti-riot unit has flooded the Central Business District (CBD), creating a tense atmosphere as authorities move to pre-empt</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/million-man-march-mnangagwa-unleashes-security-forces-to-thwart-geza-protests/\">Million Man March: Mnangagwa unleashes security forces to thwart Geza protests </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:36",
            "date": "17 Oct 2025"
        },
        {
            "title": "Man (40) convicted for bestiality with goat, courts worried over rise in cases of “weird sexual desires”",
            "url": "https://www.newzimbabwe.com/man-40-convicted-for-bestiality-with-goat-courts-worried-over-rise-in-weird-desires/",
            "content": "By Staff Reporter\n\nA KWEKWE magistrate has convicted a 40-year-old man for bestiality with a she goat.\n\nThe offender, Stephen Musongwe, was sentenced to six months imprisonment when he appeared at Kwekwe Magistrates Court this week. Three months of the sentence were conditionally set aside while the remainder was commuted to 105 hours of community service.\n\nThe court heard that on August 14, 2025, at around 9am at a homestead in Semchengwe village, Redcliff, the offender, a labourer formerly employed by the goats owner, proceeded to the goat pen.\n\nIt was further heard that upon arrival at the pen, Musongwe pinned the she goat before engaging in the dastardly sexual act on the animal. He was busted by the livestock owner, prompting him to flee the scene, but he had already been positively identified.\n\nA report was made to the police, leading to Musongwes arrest.\n\nIn a statement following sentencing, the National Prosecuting Authority of Zimbabwe (NPAZ) expressed worry over the rising trend of bestiality.\n\nCase of bestiality have been on the increase lately and it is the duty of the law to protect our animals from individuals with weird sexual desires, noted the NPAZ.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/04/16182340/Goat.jpg",
            "description": "<p>By Staff Reporter A KWEKWE magistrate has convicted a 40-year-old man for bestiality with a she goat. The offender, Stephen Musongwe, was sentenced to six months’ imprisonment when he appeared at Kwekwe Magistrates Court this week. Three months of the sentence were conditionally set aside while the remainder was commuted to 105 hours of community</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-40-convicted-for-bestiality-with-goat-courts-worried-over-rise-in-weird-desires/\">Man (40) convicted for bestiality with goat, courts worried over rise in cases of “weird sexual desires”</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:36",
            "date": "17 Oct 2025"
        },
        {
            "title": "IMF lauds Zimbabwe’s economic progress, but says arrears block lending",
            "url": "https://www.newzimbabwe.com/imf-lauds-zimbabwes-economic-progress-but-says-arrears-block-lending/",
            "content": "Reuters\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/08111459/harare.jpeg",
            "description": "<p>Reuters The International Monetary Fund said on Thursday it remains unable to lend to Zimbabwe due to the country’s outstanding arrears, but praised recent economic reforms as discussions progress on a potential staff-monitored program. “Zimbabwe’s ability to borrow financially from us is constrained by the fact that they have arrears through the African Development Bank,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/imf-lauds-zimbabwes-economic-progress-but-says-arrears-block-lending/\">IMF lauds Zimbabwe’s economic progress, but says arrears block lending</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:36",
            "date": "17 Oct 2025"
        },
        {
            "title": "Million Man March: Despite Mnangagwa’s pushback, Geza vows to spoil ZANU PF’s conference",
            "url": "https://www.newzimbabwe.com/million-man-march-despite-mnangagwas-pushback-geza-vows-to-spoil-zanu-pfs-conference/",
            "content": "By Darlington Gatsi\n\nFugitive war veteran Blessed Geza has vowed to disrupt Zanu PFs National Peoples Conference currently underway in Mutare, by leading nationwide protests against President Emmerson Mnangagwa, whom he accuses of presiding over a corrupt administration.\n\nThis marks the third time this year that Geza has called for mass demonstrations, saying his latest action is meant to express public outrage over alleged state capture and corruption.\n\nGezas latest statement comes amid escalating tensions within the ruling party, following Mnangagwas recent clash with Vice President Constantino Chiwenga in the Politburo over a corruption dossier implicating several well-connected businessmen.\n\nGeza accuses Mnangagwa and businessmen Kudakwashe Tagwirei, Wicknell Chivayo, and Pedzai Scott Sakupwanya of being central to deep-rooted corruption within both government and Zanu PF structures.\n\nHis remarks mirror allegations contained in Chiwengas corruption dossier, which was recently tabled before the Zanu PF Politburo but subsequently dismissed by the party.\n\nThe planned October 17 Million Man March coincides with the Zanu PF conference in Mutare, which observers say is expected to be tense as factional divisions between Mnangagwa and Chiwenga camps continue to widen.\n\nIt is now time for accountability, for the reclamation of our country and for the restoration of the peoples dignity and from Friday 17 October 2025, the people of Zimbabwe shall rise against State Capture and High Corruption being perpetrated by President Emerson Mnangagwa and his Zvigananda led by Kudakwashe Tagwirei, Wicknell Chivhayo, Scott Sakupwanya, Delish Nguwaya, said Geza further.\n\nHowever, it remains uncertain whether the public will heed Gezas call, as the Zimbabwe Republic Police (ZRP) has already warned citizens against participating in any unsanctioned demonstrations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/12055423/geza_vid_2.jpg",
            "description": "<p>By Darlington Gatsi Fugitive war veteran Blessed Geza has vowed to disrupt Zanu PF’s National People’s Conference currently underway in Mutare, by leading nationwide protests against President Emmerson Mnangagwa, whom he accuses of presiding over a corrupt administration. This marks the third time this year that Geza has called for mass demonstrations, saying his latest</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/million-man-march-despite-mnangagwas-pushback-geza-vows-to-spoil-zanu-pfs-conference/\">Million Man March: Despite Mnangagwa’s pushback, Geza vows to spoil ZANU PF’s conference</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:36",
            "date": "17 Oct 2025"
        },
        {
            "title": "Zanu PF risks implosion if factional tensions are mismanaged – analyst warns",
            "url": "https://www.newzimbabwe.com/zanu-pf-risks-implosion-if-factional-tensions-are-mismanaged-analyst-warns/",
            "content": "By Anna Chibamu\n\nThe Zanu PF political landscape is increasingly volatile, and if current tensions are not carefully managed, the party could face an implosion that threatens its key structures and processes, a political analyst has warned.\n\nIn an interview withNewZimbabwe.com, political analyst Eldred Masunungure said the outcome of the ruling partys ongoing succession battle will hinge on who holds the strategic cards within the power structure.\n\nMasunungure cautioned that delegates attending the ongoing Zanu PF National Peoples Conference in Mutare must address internal divisions decisively to prevent a full-blown crisis.\n\nThe long and short of it is that the Zanu PF pot is overboiling and if not managed well, it may very well explode.\n\nIt is therefore incumbent upon the National Peoples Conference managers to sharpen their conflict resolution skills to abate a dangerous fallout, Masunungure said.\n\nThe conference, currently underway in Mutare is expected to deliberate on key issues including the ailing economy, corruption, and the 2030 agenda. However, the gathering has been overshadowed by factional wars between camps aligned to President Emmerson Mnangagwa and his deputy Constantino Chiwenga.\n\nDuring a Politburo meeting on Tuesday, Chiwenga reportedly questioned why Mnangagwa had not taken action against individuals named in a corruption dossier he presented earlier. Those implicated include controversial businessmen Wicknell Chivayo, Kudakwashe Tagwirei, and gold dealer Pedzai Sakupwanya, who are accused of stealing millions from state coffers.\n\nThe dossier has triggered a fierce backlash from Mnangagwas loyalists, including Zanu PF Secretary for Legal Affairs Ziyambi Ziyambi and party spokesperson Christopher Mutsvangwa, both of whom have publicly attacked the Vice President.\n\nIn response to the dossier, Ziyambi described Chiwenga as ignorant and accused him of treason, while Mutsvangwa slammed the VP for turning the presidium into a kangaroo court.\n\nCommenting on the power struggle, Masunungure said the decisive factor will be which camp is able to outmanoeuvre the other.\n\nThe critical factor depends on who is capable of outmanoeuvring the other or, to use Donald Trumps language, who has the cards?.\n\nFrom the vantage point of an outsider looking in, it appears like the incumbent Mnangagwa has most of the strategic cards courtesy of the power of incumbency, both in the party and the state.\n\nChiwengas military base has been significantly eroded and cannot be relied on to mount another military-assisted transition. The balance of evidence suggests that Mnangagwa will emerge the winner, on account of the manipulation of incumbency.\n\nRecent changes within Zanu PF have further fuelled speculation of a deliberate purge of Chiwengas allies.\n\nMnangagwa recently removed Obert Mpofu from the influential Secretary General post, reassigning him to the ICT department, and replaced him with Jacob Mudenda.\n\nWithin days, he also dismissed Zanu PF Director General Ezekiel Zabanyana, a move widely seen as an effort to weaken Chiwengas internal support base.\n\nMasunungure warned that the escalating factionalism could spill beyond the party, affecting national governance.\n\nThe fallout will most probably infect the state, its key organs and processes. More broadly, it will further deepen and widen the already worrying societal polarisation.\n\nZanu PF is expected to hold its elective congress in 2027, where the partys succession question may be resolved. Some of the resolutions from the Mutare conference are expected to be implemented in the lead-up to that crucial event.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/07/22195935/F1o4Bw1WwAEXt93.jpg",
            "description": "<p>By Anna Chibamu The Zanu PF political landscape is increasingly volatile, and if current tensions are not carefully managed, the party could face an implosion that threatens its key structures and processes, a political analyst has warned. In an interview with NewZimbabwe.com, political analyst Eldred Masunungure said the outcome of the ruling party’s ongoing succession</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-risks-implosion-if-factional-tensions-are-mismanaged-analyst-warns/\">Zanu PF risks implosion if factional tensions are mismanaged – analyst warns</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:36",
            "date": "17 Oct 2025"
        }
    ]
}