{
    "news": [
        {
            "title": "Warriors midfielder Andy Rinomhota back at Reading FC",
            "url": "https://www.newzimbabwe.com/warriors-midfielder-andy-rinomhota-back-at-reading-fc/",
            "content": "By Sports Reporter\n\nAfter spending five months without a club, Warriors midfielder Andy Rinomhota has rejoinedEnglish League One side Reading FC.\n\nRinomhota re-signed for Reading as a free agent following the expiry of his contract with Championship outfit Cardiff City earlier this year.\n\nThe 28-year-old midfielder has agreed to an eight-month deal that will keep him at the club until the end of the current season.\n\nRinomhota is no stranger to the Royals, having come through the clubs development ranks and representing Reading from 2015 to 2022. During that period, he made 138 senior appearances and scored four goals before departing for Cardiff in June 2022.\n\nWelcoming the player back, Reading head coach Leam Richardson said he was confident Rinomhotas experience and commitment would strengthen the squad.\n\nIve worked with Andy before and know exactly what hell bring to the team: energy, honesty, and a real desire to win. He is a great professional who knows this club and what it means to represent Reading. Im delighted to have him back, and Im sure the fans will be too, Richardson said.\n\nRinomhota is expected to make his second debut for Reading on November 22, when club football resumes after the international break.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/12192641/andy.jpeg",
            "description": "<p>By Sports Reporter After spending five months without a club, Warriors midfielder Andy Rinomhota has rejoined English League One side Reading FC. Rinomhota re-signed for Reading as a free agent following the expiry of his contract with Championship outfit Cardiff City earlier this year. The 28-year-old midfielder has agreed to an eight-month deal that will keep</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/warriors-midfielder-andy-rinomhota-back-at-reading-fc/\">Warriors midfielder Andy Rinomhota back at Reading FC</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:14",
            "date": "13 Nov 2025"
        },
        {
            "title": "‘It’s their loss’: South African leader hits back at Trump’s decision to skip G20 summit",
            "url": "https://www.newzimbabwe.com/its-their-loss-south-african-leader-hits-back-at-trumps-decision-to-skip-g20-summit/",
            "content": "BBC\n\nSouth Africas President Cyril Ramaphosa says boycott politics doesnt work as he hit back at US President Donald Trumps decision to skip the G20 leaders summit in Johannesburg later this month.\n\nTrump has said that no US official would attend the gathering over widely discredited claims that white people are being persecuted in South Africa.\n\nSpeaking outside parliament, Ramaphosa said the USs absence is their loss and that the boycott would not prevent the meeting from going ahead, according to the AFP news agency.\n\nHe added that the US was giving up the very important role that they should be playing as the biggest economy in the world.\n\nThe G20 summit is taking place between 22-23 November but in a post on social media, Trump said it was a total disgrace that South Africa was hosting it.\n\nHe had earlier said South Africa should not be in the G20 at all, and that he would send Vice-President JD Vance, instead of attending himself.\n\nThen over the weekend, he doubled down on his claims that Afrikaners [people who are descended from Dutch settlers, and also French and German immigrants] are being killed and slaughtered, and their land and farms are being illegally confiscated.\n\nNo US government official will attend as long as these human rights abuses continue, he added.\n\nTrump has previously said that while he is trying to restrict the number of refugees the US accepts,Afrikaners would be welcome.\n\nRamaphosa said boycotting never achieves anything of great impact, because decisions will be taken that will move the various issues ahead, AFP reports.\n\nSouth Africa is the current chair of the G20 grouping of the worlds largest economies.\n\nThe forthcoming summit will mark the first time it takes place on African soil.\n\nEvery year, a different member state holds the G20 presidency and sets the agenda for the leaders summit, where they discuss the major economic issues of the day  with the US due to take over from South Africa.\n\nTrump is not the only leader set to skip the G20. Hi close ally, Argentinian President Javier Milei, has also indicated he will not attend but will instead send his Foreign Minister Pablo Quirno, AFP reports.\n\nSouth Africas government has said that claims of a white genocide are widely discredited and unsupported by reliable evidence.\n\nIt also says that no white farmers have seen their land confiscated without compensation.\n\n",
            "image_url": "https://www.newzimbabwe.com/wp-content/uploads/2019/01/Cryril-Ramaphosa.jpg",
            "description": "<p>BBC South Africa’s President Cyril Ramaphosa says “boycott politics doesn’t work” as he hit back at US President Donald Trump’s decision to skip the G20 leaders’ summit in Johannesburg later this month. Trump has said that no US official would attend the gathering over widely discredited claims that white people are being persecuted in South</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/its-their-loss-south-african-leader-hits-back-at-trumps-decision-to-skip-g20-summit/\">‘It’s their loss’: South African leader hits back at Trump’s decision to skip G20 summit</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:14",
            "date": "13 Nov 2025"
        },
        {
            "title": "Minnesota: At 90, art specialist Rex Mhiripiri is selling the gallery he thinks of as ‘a gift from God’",
            "url": "https://www.newzimbabwe.com/minnesota-at-90-art-specialist-rex-mhiripiri-is-selling-the-gallery-he-thinks-of-as-a-gift-from-god/",
            "content": "Minnesota Star Tribune\n\nWhen gallery owner Rex Mhiripiri saw a gas station at 90th Street and Penn Avenue S. in Bloomington, he didnt see just gasoline. He saw the future home of his huge two-story Mhiripiri Gallery.\n\nThat was nearly 20 years ago. At 90, hes still working six days a week, answering every phone call, whether its local, spam or from his native Zimbabwe. And hes painting. Always painting.\n\nIts a gift from God, Mhiripiri said of his gallery.\n\nBefore the Bloomington spot, he was in Butler Square, two other downtown Minneapolis locations and then in Edina.\n\nMhiripiri is one of a handful of Twin Cities gallerists in business since the 1980s, and the only local dealer specializing in African art and specifically Shona stone sculpture from Zimbabwe. Last month, he put the building and all the artwork in it up for sale.\n\nThe asking price? $4 million.\n\nThe spacious gallery is filled with Zimbabwe stone sculptures made of springstone, serpentine, opal stone and other stones. They depict families, pregnant women, mothers, daughters, sons and many animals.\n\nAfrican masks and Mhiripiris paintings of elephants, other animals and landscapes cover the walls. Prices range from $15 to $150,000.\n\nInternationally acclaimed Zimbabwe artists Colleen Madamombe, Bernard Matemera and Henry Munyaradzi still show their works with him. A stack of catalogs from Matemeras 1997 show in Paris is still in the gallery.\n\nHe keeps photographs of artwork and artists and trips to Zimbabwe in piles and wooden boxes.\n\nMhiripiri, who still works six days a week, always has seen himself as the familys provider.\n\nI work to protect my wife from want [for anything], he said. We had seven children, and she was a stay-at-home mom. Its my job to make sure that she has everything that she needs.\n\nSome years, the gallery grosses more than $1 million. A client just flew in from Washington, D.C., and bought $250,000 worth of work.\n\nRenowned Twin Cities painter and public artist Ta-coumba T. Aiken, 72, met Mhiripiri in the mid-1980s.\n\nHe had a store and he had a gallery and he was working on his paintings there in the gallery, and actually doing the work  not just showing work, Aiken said. Thats rare.\n\nAiken loved Mhiripiris elephant paintings with scenery. He felt they were just amazing, and not like anything that I saw anywhere else, he said. And by that time, I had seen a lot of art.\n\nAt the time, Aiken was studying Black modernist painter Los Mailou Jones, one of the first African American artists to put African art into her work. Aiken began tracking other African American artists who did the same.\n\nBut Rex didnt care about that sort of thing, he was like, Im just painting, Im doing my work, he said.\n\nAiken bought some of Mhiripiris artworks, and Mhiripiri sold some of Aikens paintings, and they gifted works to each other.\n\nUnlike most gallerists who work on commission, Mhiripiri buys everything outright and sells it.\n\nFormer University of Minnesota professor Roderick Ferguson started collecting from Mhiripiri in 2009.\n\nPeople probably dont know how much of a gem Rex is in terms of the art world and the African art world within the U.S., said Ferguson, 53, chair of the Womens, Gender and Sexuality Studies Department at Yale University.\n\nMhiripiri sold him an 18th-century gun used in the slave trade and manacles used in the Congo during King Leopolds era, to name a few. As a scholar, Ferguson finds these artifacts irresistible.\n\nSteve Wadsworth, 59, founder of 4 Seasons Construction Inc., randomly stopped into Mhiripiri Gallery about 12 years ago. He and Rex became fast friends.\n\nAt the end of Wadsworths driveway, theres a statue from Mhiripiri Gallery of an adult holding four kids.\n\nAnybody who comes to our house knows that family comes first, Wadsworth said. Over the years, hes bought about 30 paintings and sculptures from Mhiripiri.\n\nRex and Julie Mhiripiri have helped build wells in Zimbabwe and put four kids that werent their own through college.\n\nWhen Wadsworth buys art from Mhiripiri, Mhiripiri donates a certain percentage of that to help people in Zimbabwe.\n\nThat makes me feel good, Wadsworth said. I dont have a connection to help people like that.\n\nMhiripiris journey to Minnesota wasnt at all linear. Born in 1935, in Wedza, Rhodesia, (now near Harare, Zimbabwe) Mhiripiri felt stifled by life under the white-run British Commonwealth. There were few career opportunities for Black people.\n\nIn 1958, after being told not to come back to teachers college in Rhodesia, he moved to Tanganyika (now Tanzania), then through Uganda to Kenya. He worked as a salesman for Mobil Oil Co. and later the Kenyan government.\n\nIn 1966 he came to the United States on a State Department scholarship, starting at the University of Rochester in upstate New York before transferring to the University of Minnesota. There he met his wife, Julie, of Albert Lea, who is white.\n\nThey eloped to Kenya in the early 1970s. But with Rhodesia at war, they decided to return to Minnesota.\n\nAfter struggles with alcohol, Mhiripiri got sober at a Christian rehab in Montreal. At 40, he became a committed follower of Jesus.\n\nBut it wasnt until the mid-1980s that he met a missionary who had traveled to Zimbabwe. That man introduced him to Shona stone sculpture  and thats when it clicked. He needed to go back to Zimbabwe and buy art.\n\nIn 1995, thanks to the generosity of a few interested collectors, he and Julie traveled to Zimbabwe for five weeks. He shipped back 81 crates of stone sculpture weighing about 24 tons. They returned every few years, building relationships with artists and importing stone sculpture. His last trip was in 2022.\n\nWhen its slow at the gallery, Mhiripiri paints in his studio on the second floor, often crafting his signature elephant.\n\nOn a quiet Tuesday afternoon in October, he wore loose-fitting jeans, a blue polo shirt and a smock with the 1992 Super Bowl XXVI in Minneapolis printed across it.\n\nHe used a palette knife, smoothing chunks of purple paint onto a canvas. A Christian rock radio station blasted over the speakers.\n\nMhiripiri wonders about the future of the gallery.\n\nIf God gave me this thing  and I believe he did  then God will help me to get rid of it, he said.\n\nWhere:9001 Penn Av. S., Bloomington\n\nWhen:10 a.m.-6 p.m. Mon.-Sat.\n\nCost:Free\n\nInfo:952-285-9684 orshonasculpturemhiripir.com\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/12194955/rex-mhiripiri.jpg",
            "description": "<p>Minnesota Star Tribune When gallery owner Rex Mhiripiri saw a gas station at 90th Street and Penn Avenue S. in Bloomington, he didn’t see just gasoline. He saw the future home of his huge two-story Mhiripiri Gallery. That was nearly 20 years ago. At 90, he’s still working six days a week, answering every phone</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/minnesota-at-90-art-specialist-rex-mhiripiri-is-selling-the-gallery-he-thinks-of-as-a-gift-from-god/\">Minnesota: At 90, art specialist Rex Mhiripiri is selling the gallery he thinks of as ‘a gift from God’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:14",
            "date": "13 Nov 2025"
        },
        {
            "title": "Magaya pursues removal from remand at the High Court",
            "url": "https://www.newzimbabwe.com/magaya-pursues-removal-from-remand-at-the-high-court/",
            "content": "By Mary Taruvinga\n\nProphetic Healing and Deliverance (PHD) Ministries founder Walter Magaya has approached the High Court seeking a review of a magistrates decision to place him on remand, arguing that his detention was unconstitutional and a grave miscarriage of justice.\n\nIn his application filed through Rubaya and Chatambudza Legal Practitioners, Magaya cited Harare regional magistrate Marewanazvo Gofa and the Prosecutor-General of Zimbabwe as respondents, accusing the lower court of acting without jurisdiction after he was detained beyond the 48-hour constitutional limit before being brought to court.\n\nThe 1st Respondents decision to entertain an application for placement of Applicant on remand is so manifestly irrational and grossly outrageous in its defiance of logic that no sensible court would arrive at it, Magaya said in his founding affidavit.\n\nHe argued that under Section 50(3) of the Constitution, any person detained beyond 48 hours must be released immediately and not subjected to further remand proceedings. Must means must, he stressed. The phrase must be released immediately is not merely directory but peremptory, creating a constitutional obligation that admits of no judicial discretion.\n\nMagaya is facing five counts of rape and 13 counts of fraud.\n\nHe said the State had conceded in court that he was detained beyond the lawful time limit, yet Magistrate Gofa still proceeded to place him on remand. This breach is not a matter of conjecture, he said. It is factual and borne out by the express and unequivocal concession of the State Counsel for the 2nd Respondent.\n\nHe described his arrest on November 1 as deeply troubling, claiming that a large contingent of heavily armed police officers descended upon me while I was engaged in prayer.\n\nMagaya accused the magistrate of brazenly subverting the Constitution by ruling that his remedy lay in suing for damages rather than being released, warning that such reasoning takes the criminal justice system back to the Lancaster House Constitution.\n\nBy transforming this clear constitutional command into a mere precursor to civil litigation, the 1st Respondent effectively rewrote the peoples will as expressed in the Constitution, he said. If unchecked, this arbitrary erosion of liberty will metastasise emboldening law enforcement agents to regard themselves as a law unto their own.\n\nThe cleric also attacked the magistrates reliance on the Agripa Mloyi v The State precedent, arguing it was wholly inapposite and that she ignored the more relevant Panganai Davison Madondo v The State judgment.\n\nMagaya further accused the Zimbabwe Gender Commission of manufacturing allegations against him through a public advert that solicited rape complaints. The subsequently complainants only emerged after this public invitation, he claimed.\n\nIn his draft order, Magaya seeks to have the magistrates ruling of November 4, 2025, set aside and for him to be removed from remand on all charges of rape and fraud.\n\nHe argues that the High Courts intervention is necessary to prevent continuing violations of his constitutional rights. The principle that you cannot put something on nothing, it will collapse, applies with equal force here, Magaya submitted.\n\nHe is represented by Admire Rubaya, Everson Chatambudza and Advocate Sylvester Hashiti.\n\nThe matter is yet to be heard.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/14120808/magaya.gif",
            "description": "<p>By Mary Taruvinga Prophetic Healing and Deliverance (PHD) Ministries founder Walter Magaya has approached the High Court seeking a review of a magistrate’s decision to place him on remand, arguing that his detention was unconstitutional and “a grave miscarriage of justice.” In his application filed through Rubaya and Chatambudza Legal Practitioners, Magaya cited Harare regional</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/magaya-pursues-removal-from-remand-at-the-high-court/\">Magaya pursues removal from remand at the High Court </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:14",
            "date": "13 Nov 2025"
        },
        {
            "title": "South Africa starts clinical trials on first locally developed oral cholera vaccine",
            "url": "https://www.newzimbabwe.com/south-africa-starts-clinical-trials-on-first-locally-developed-oral-cholera-vaccine/",
            "content": "AfricaNews\n\nResearchers and scientists in South Africa on Tuesday launched clinical trials on the first domestically manufactured vaccine in over 50 years.\n\nThe oral cholera vaccine is being developed by the Cape Town-based pharmaceutical firm Biovac.\n\nIt is currently undergoing trials to determine its safety in adults and will be followed by trials to compare it to existing cholera vaccines that are already in the market.\n\nThe South African government has described the clinical trials as amilestone in Africas ability to produce vaccines for itself.\n\nVaccines made in South Africa usually rely on active pharmaceutical ingredients imported from abroad.\n\nIf our vaccine works, well be the second producer of the oral cholera vaccine at a global level, and we can help support global distribution and help support places where there are outbreaks,said Professor Glenda Gray, the chief scientific officer at the South African Medical Research Council.\n\nSouth Africas health minister Aaron Motsoaledi said the vaccine could be approved and ready for use in Africa by 2028, depending on the results of the clinical trials.\n\nThe ability to manufacture a life-saving vaccine from start to finish right here at home strengthens our national capacity to respond swiftly to potential outbreaks and enhances Africas self-reliance in vaccine production,he said.\n\nSouth Africa often experiences cholera outbreaks due to cross-border movements. Other causes includes a lack of clean water in communities such as Hammanskraal, in the capital Pretoria, where provision of clean water remains a major problem.\n\nShadrack Makutu, 37, a resident from Limpopo province, is one of the first participants in the clinical trial. He has previously experienced an outbreak in his village of Bushbuckridge.\n\nBeing part of this study group is not going to benefit me, myself only, its still going to benefiteach and everyone around the African continent,he said.\n\nA cholera outbreak in 2023 led to the death of 47 people and over 1,400 reported cases, but neighbouring countries likeMalawi, Mozambique and Zimbabwe have experienced far higher cases and deaths.\n\nThe World Health Organization estimates thatas many as 4 million people around the world are affected by cholera every year, with between 21,000 and 143,000 people dying from it annually.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/12194240/oral-vaccine-cholera.jpg",
            "description": "<p>AfricaNews Researchers and scientists in South Africa on Tuesday launched clinical trials on the first domestically manufactured vaccine in over 50 years. The oral cholera vaccine is being developed by the Cape Town-based pharmaceutical firm Biovac. It is currently undergoing trials to determine its safety in adults and will be followed by trials to compare</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africa-starts-clinical-trials-on-first-locally-developed-oral-cholera-vaccine/\">South Africa starts clinical trials on first locally developed oral cholera vaccine</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:14",
            "date": "13 Nov 2025"
        },
        {
            "title": "Dangote returns to Zimbabwe after a decade, says he sees transparency now – pledges US$1 billion investment",
            "url": "https://www.newzimbabwe.com/dangote-returns-to-zimbabwe-after-a-decade-says-he-sees-transparency-now-pledges-us1-billion-investment/",
            "content": "By Alois Vinga\n\nAfricas richest man, Aliko Dangote, has announced plans to invest over US$1 billion in Zimbabwe, saying he is confident in the countrys renewed transparency and improved business climate,a sharp contrast to his first experience in 2015 when proposed deals collapsed amid bureaucracy and corruption.\n\nDuring his 2015 visit, the Dangote Group founder and CEO met then-President Robert Mugabe and expressed interest in developing the Sengwa coal fields and constructing a 2,800MW coal-fired power plant. However, the projects failed to take off after frustrations over red tape and alleged demands for kickbacks from officials.\n\nAt the time, investors were not allowed to charge for electricity in foreign currency, and Dangotes proposal hinged on cost-reflective tariffs in U.S. dollars. The situation has since changed, with the government now permitting independent power producers to set tariffs and repatriate profits.\n\nFollowing a meeting with President Emmerson Mnangagwa on Wednesday, Dangote announced that his conglomerate would roll out new projects in cement production, power generation, and a fuel pipeline.\n\nThe government views the planned investment as part of its broader effort to industrialise the economy, add value to local resources and create employment.\n\nDangote Industries Limited, one of Africas largest conglomerates, operates across multiple sectors, including cement, sugar, oil refining, and fertilizer production. Its expansion into southern Africa could position Zimbabwe as a strategic link in a regional oil and fertilizer supply network connected through Namibias Walvis Bay.\n\nAsked why he decided to return after nearly a decade, Dangote said:There is a lot of change between that time when we came and right now,its solid. There is a lot of transparency. When you look at what His Excellency President Emmerson Mnangagwa has done in terms of turning the economy around, that is what gave us the confidence to say, This is the right time to come and invest. Its like someone has passed an exam,people have to give him a good mark.\n\nHe confirmed that an agreement had been signed between Zimbabwe and the Dangote Group covering several sectors:\n\nSome of our investments will be in cement manufacturing, power generation, and the supply of petroleum products. We are also in the business of producing petroleum; we have one of the largest refineries in the world, he said.\n\nDangote added that while the investment package is broad, further details on specific figures and timelines would be shared as implementation progresses.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/12152026/dangote_mthuli.jpg",
            "description": "<p>By Alois Vinga Africa’s richest man, Aliko Dangote, has announced plans to invest over US$1 billion in Zimbabwe, saying he is confident in the country’s renewed transparency and improved business climate, a sharp contrast to his first experience in 2015 when proposed deals collapsed amid bureaucracy and corruption. During his 2015 visit, the Dangote Group founder</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dangote-returns-to-zimbabwe-after-a-decade-says-he-sees-transparency-now-pledges-us1-billion-investment/\">Dangote returns to Zimbabwe after a decade, says he sees transparency now – pledges US$1 billion investment</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:14",
            "date": "13 Nov 2025"
        }
    ]
}