{
    "news": [
        {
            "title": "Zimbabwe hopes to service external debt",
            "url": "https://www.newzimbabwe.com/zimbabwe-hopes-to-service-external-debt/",
            "content": "Bloomberg\n\nZimbabwe, locked out of international capital markets since defaulting in 1999, expects its stronger economy to help it pay back external creditors, without saying when this would begin.\n\nFinance Minister Mthuli Ncube told reporters in the capital, Harare, on Tuesday that the countrys debt as a percentage of gross domestic product has declined to 46% from around 60% thanks to better growth.\n\nYou can be assured that given this larger GDP base this creates more opportunity and capacity for us to start servicing our external debt, he said, without providing a time-frame.\n\nThe economy has grown to a point where it can allow us to begin servicing our debts sustainably.\n\nZimbabwe wants to restructure its $21 billion debt, of which around $12.3 billion is owed to external creditors including the World Bank, African Development Bank and the European Investment Bank.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/08111459/harare.jpeg",
            "description": "<p>Bloomberg Zimbabwe, locked out of international capital markets since defaulting in 1999, expects its stronger economy to help it pay back external creditors, without saying when this would begin. Finance Minister Mthuli Ncube told reporters in the capital, Harare, on Tuesday that the country’s debt as a percentage of gross domestic product has declined to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-hopes-to-service-external-debt/\">Zimbabwe hopes to service external debt</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:36",
            "date": "09 Jul 2025"
        },
        {
            "title": "Another profit-making scheme! – Harare residents slam government’s prepaid water meters plan amid ongoing crisis",
            "url": "https://www.newzimbabwe.com/another-profit-making-scheme-harare-residents-slam-governments-prepaid-water-meters-plan-amid-ongoing-crisis/",
            "content": "By Thandiwe Garusa\n\nHARARE residents are opposing the governments plan to roll out prepaid water meters, arguing the move will not solve the citys ongoing water shortages, poor water quality and widespread leakages.\n\nThe government announced plans to install prepaid water meters across the country, starting with the capital city, Harare, to improve water management and responsible use.\n\nIn a statement Tuesday, Harare Residents Trust (HRT) accused local authorities of failing to establish a transparent and accountable water management system and argued that this will be another profit-making scheme at the expense of residents.\n\nPrepaid water meters will never help improve the quantity of water delivered to the residents, nor will they address the quality of the water supplied.\n\nGiven the deliberate failure by the local authorities, especially the City of Harare (CoH), to secure a functional, transparent and accountable enterprise resources planning system, it is prudent to initially invest in plugging the leakages and illegal water connections along the water distribution network to reduce non-revenue water.\n\nThe private companies being brought in by the national government to provide the prepaid water meters and be involved in the whole water value chain are interested in profit and not improving service delivery, HRT said.\n\nThe residents trust also accused the government and CoH of quietly signing the deal under a Build-Operate-Transfer model without involving the most affected stakeholders, which are the taxpayers.\n\nThe water infrastructure contract was given to a Hangzhou Liaison Technology Company and Helcraw Electrical Company without going to tender and the contents of the contracts remain unknown to the public.\n\nHelcraw is owned by Zanu PF legislatorfor Murehwa West constituency,Farai Jere.\n\nMeanwhile,HRT urged parliamentary committees to hold public hearings so Zimbabweans can share their views on the water meter policy.\n\nHarare has faced a growing water crisis for years, with daily water supply going downa mix of poor maintenance, pollution and leaking pipes.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/08222232/prepaidwatermeters-825x510-1.jpg",
            "description": "<p>By Thandiwe Garusa HARARE residents are opposing the government’s plan to roll out prepaid water meters, arguing the move will not solve the city’s ongoing water shortages, poor water quality and widespread leakages. The government announced plans to install prepaid water meters across the country, starting with the capital city, Harare, to improve water management</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/another-profit-making-scheme-harare-residents-slam-governments-prepaid-water-meters-plan-amid-ongoing-crisis/\">Another profit-making scheme! – Harare residents slam government’s prepaid water meters plan amid ongoing crisis</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:36",
            "date": "09 Jul 2025"
        },
        {
            "title": "UZ suspends students for demonstrating in support of striking lecturers",
            "url": "https://www.newzimbabwe.com/uz-suspends-students-for-demonstrating-in-support-of-striking-lecturers/",
            "content": "By Thandiwe Garusa\n\nTHE University of Zimbabwe (UZ) administration has suspended six students for holding a demonstration on campus in support of their striking lecturers in May.\n\nThe six students, Narshon Kohlo, Blessing Mtisi, Nodesha Maingehama, Tafadzwa Katsande, Tawana Hove and Tariro Mtukura are members of Zimbabwe National Students Union (ZINASU), UZ Chapter.\n\nThey staged a flash protest at the UZ campus where they demanded an urgent resolution to the grievances of their lecturers, who have been on strike since April 16.\n\nIn separate letters seen by NewZimbabwe.com which were written to the six students by UZ Vice Chancellor Professor Paul Mapfumo, the suspensions are with immediate effect.\n\nAccordingly and in light o the seriousnes of the allegantions detailed above, i have found it necessary to, interms of section 8(3)(e) of the Univerity of Zimbabwe act [Chapter 25:16,(the Act), suspend you, with immediate effect, from your studies at the University of Zimbabwe indefinitely, pending diciplinary hearing against you.\n\nAccordingly, you are barred, forthwith, from entering the University of Zimbabwe Campus and any other University premises. You are required to surrender your student ID card to the Director, Asset Protection Services, the letters read.\n\nThe suspended students will attend a disciplinary committee hearing to answer to thecharges next week.\n\nTwo weeks ago, the UZ administration also fired four leaders of the ongoing lecturers industrial action after having been initially suspended and undergoing a hearing for using the campus great hall without approval from authorities.\n\nThe lecturers are demanding a salary increase to at least US$2,250 from their current US$250 as well as improved working conditions.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/12181302/Zinasu-7.png",
            "description": "<p>By Thandiwe Garusa THE University of Zimbabwe (UZ) administration has suspended six students for holding a demonstration on campus in support of their striking lecturers in May. The six students, Narshon Kohlo, Blessing Mtisi, Nodesha Maingehama, Tafadzwa Katsande, Tawana Hove and Tariro Mtukura are members of Zimbabwe National Students Union (ZINASU), UZ Chapter. They staged</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uz-suspends-students-for-demonstrating-in-support-of-striking-lecturers/\">UZ suspends students for demonstrating in support of striking lecturers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:36",
            "date": "09 Jul 2025"
        },
        {
            "title": "Moxon resigns from Meikles Board",
            "url": "https://www.newzimbabwe.com/moxon-resigns-from-meikles-board/",
            "content": "By Alois Vinga\n\nLong-serving Meikles Limited chairman, John Moxon, has resigned from his role but will proceed as director of the property subsidiary.\n\nIn a statement, the groups company secretary, Batanai Peresuh said the resignation came into effect in February 2025.The development follows several months of internal squabbles between Moxon and fellow board members.\n\nLast year, Mashonaland Turf Club, a minority shareholder in Meikles Limited, filed an application with the High Court of Zimbabwes Commercial Division, seeking Moxons ouster from the board.\n\nSome of the shareholders and board members questioned a plan, led by Moxon and CEO Malcom Mycroft to sell the companys 50% stake in the Victoria Falls Hotel business, saying this was being done without the approval of the board, and without the involvement of African Sun, which co-runs the hotel with Meikles.\n\nMarket watchers are now speculating that Moxon could have finally succumbed to pressure and opted out of the management board.\n\nMeanwhile, Fayaz King  a distinguished Zimbabwean business leader with over thirty years of executive experience spanning telecommunications, information technology, the digital economy, and innovation has since been appointed as acting chairman of the Board, effective 3 July 2025.\n\nThroughout his career, he has demonstrated a proven ability to drive operational excellence, spearhead strategic initiatives, and optimise business processes to enhance efficiency and profitability. King has successfully led cross-functional teams, championed innovation, and delivered transformative technology solutions across diverse sectors and regions, Meikles Limited added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/12/01041859/John-Moxon.jpg",
            "description": "<p>By Alois Vinga Long-serving Meikles Limited chairman, John Moxon, has resigned from his role but will proceed as director of the property subsidiary. In a statement, the group’s company secretary, Batanai Peresuh said the resignation came into effect in February 2025. The development follows several months of internal squabbles between Moxon and fellow board members. Last</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/moxon-resigns-from-meikles-board/\">Moxon resigns from Meikles Board </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:36",
            "date": "09 Jul 2025"
        },
        {
            "title": "Scottland signs Malawian striker",
            "url": "https://www.newzimbabwe.com/scottland-signs-malawian-striker/",
            "content": "By Sports Reporter\n\nScottland FC has signed a new striker, Kudha Muyaba, from Malawi.\n\nThe 31-year-old striker joins Mabviravira as a free agent on a two-year contract.\n\nMuyaba was previously with South African lower division side Venda Football Academy before his contract expired in June.\n\nHe has also played for Polokwane City and Richards Bay in South Africa.\n\nMuyaba comes in as a replacement for Namibian forward Sydney Urikhob, who has been released by the Mabvuku-based side.\n\nScottland FC is doing all possible to strengthen its strike-force. Last week, the club secured the signature of Warriors striker Terrence Dzvukamanja, who was playing for SuperSportUnited in South Africa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/08222538/WhatsApp-Image-2025-07-08-at-21.49.06.jpeg",
            "description": "<p>By Sports Reporter Scottland FC has signed a new striker, Kudha Muyaba, from Malawi. The 31-year-old striker joins Mabviravira as a free agent on a two-year contract. Muyaba was previously with South African lower division side Venda Football Academy before his contract expired in June. He has also played for Polokwane City and Richards Bay</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/scottland-signs-malawian-striker/\">Scottland signs Malawian striker</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:36",
            "date": "09 Jul 2025"
        },
        {
            "title": "Minister urges men to adopt stress management techniques",
            "url": "https://www.newzimbabwe.com/minister-urges-men-to-adopt-stress-management-techniques/",
            "content": "By Anna Chibamu\n\nPublic Service Deputy Minister Mercy Dinha has called on men to seek medical care and adopt stress management techniques.\n\nDinha was addressing public sector employees at the Harare Gardens during a belated Fathers Day commemoration.\n\nMen often face challenges which include financial stress, societal expectations, and balancing work and family life, leading to stress-related problems.\n\nWe gather to celebrate the contributions and achievements of men in the public sector.\n\nAs we celebrate men today, we recognise the important roles you play in your families, in your communities, and the nation.\n\nWe acknowledge your hard work, dedication to the countrys development, and your resilience. As a government, we also recognise the various roles you play, the different hats you wear, the responsibilities you carry, and the sacrifices you make, Dinha said.\n\nThe deputy minister stated that her ministry recognised the vital role played by men in shaping their families.\n\nWe acknowledge your never-ending love, your guidance, and your support. You are the pillars of strength that provide stability and security for your families and the nation at large, added the deputy minister.\n\nHowever, because of their roles nature as fathers and employees of the public service, Dinha pointed out that financial stability was crucial for mens well-being.\n\nMens health is a critical issue that contributes to productivity in the organisation.\n\nStress can have devastating effects on mens mental health.\n\nI encourage you to practice stress management techniques such as exercise, being mindful and social support.\n\nI also encourage you to always prioritise your health, seek medical care when needed, and adopt healthy habits despite your busy schedules.\n\nAdded Dinha, To the nation, I call upon us to support men in their roles. Let us celebrate the selfless love, dedication of men and continue to build a society that values and supports men at the workplace and in our homes, she said, urging all men to prioritise their well-being and seek support when needed.\n\nDue to the economic hardships in Zimbabwe, most men are struggling to cope with the day-to-day provision of family needs and many of them have been affected.\n\nSpeaking at the same occasion, Mens Clinic International Marketing manager Philip Jonhera said research had shown that men have poor health-seeking behaviour, hence they should focus on medical check-ups focusing especially prostate cancer which is affecting young men in their thirties.\n\nThere is your spiritual health, there is your physical health, and there is your mental health, if you do not balance all three sections, I wont balance the diet, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/08220526/mercy-dinha.gif",
            "description": "<p>By Anna Chibamu Public Service Deputy Minister Mercy Dinha has called on men to seek medical care and adopt stress management techniques. Dinha was addressing public sector employees at the Harare Gardens during a belated Father’s Day commemoration. Men often face challenges which include financial stress, societal expectations, and balancing work and family life, leading</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/minister-urges-men-to-adopt-stress-management-techniques/\">Minister urges men to adopt stress management techniques</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:36",
            "date": "09 Jul 2025"
        }
    ]
}