{
    "news": [
        {
            "title": "Zanu PF MP faces scrutiny over Housing Cooperative scandals",
            "url": "https://www.newzimbabwe.com/zanu-pf-mp-faces-scrutiny-over-housing-cooperative-scandals/",
            "content": "By Pauline Chateuka\n\nThe Harare South lawmaker, Trymore Kanopula, has been implicated in corrupt deals in his constituency.\n\nThe Zanu PF legislatorwho is popularly known as TKis being accused of participating in questionable dealings linked to the Simon Muzenda Housing Cooperative.\n\nReports of the alleged involvement of Kanopula in the disputes emerged after disgruntled residents approached our news crew following the publication of other controversial land deals in rural Seke involving the Manyame Rural District Council and another ruling Zanu PF lawmaker, Innocent Benza.\n\nFormed in 2012, Simon Muzenda Housing Cooperative aimed to develop 400 stands and provide essential infrastructure such as schools, clinics, and recreational spaces in the constituency.\n\nHowever, poor governance, lack of transparency, and persistent internal conflicts have significantly derailed progress.\n\nSubsequently, over 600 stands, including those reserved for public utilities, were sold by cooperative members under opaque circumstances, with revenue being diverted to individuals.\n\nStands belonging to an unnamed private land developer were also sold without consent, exacerbating ownership disputes.\n\nHousing cooperatives such as Simon Muzenda have over the last two decades attracted thousands of desperate home seekers, drawn by promises of affordable housing and stands.\n\nHome-seekers have reported stalled development, lack of transparency and financial irregularities, sparking widespread anger and distrust.\n\nSources in Harare South alleged that Kanopula exploited his political influence to collaborate with the cooperatives leadership in illegal land sales and transfers.\n\nThese reportedly include re-allocating land earmarked for essential amenities such as schools and clinics for residential purposes and selling small pieces of land on wetlands to prospective homeowners.\n\nWhile Kanopula, who was elected on a Zanu PF ticket in 2023, is expected to ensure his community gets secure shelter, residents who received the shady residential stands are still without title deeds and can be booted out any time.\n\nOne source, who preferred to remain anonymous, said: The leadership, including Kanopula, has thwarted mechanisms for transparency. General meetings are suspended, and no one is held accountable. We dont even know where our money is going.\n\nThere has been an outcry over the reported misuse of cooperative funds.\n\nSimon Muzenda Housing Cooperative members were asked to pay $30 each to regularise land use and verify state land allocations.\n\nThis amounted to over $6,000, which reportedly vanished without a trace, according to cooperative members.\n\nKanopula is alleged to have been involved in the misappropriation of these funds, though he denies any wrongdoing.\n\nI dont know anything about that. If anyone thinks they were duped, they should report it to the police and stop mentioning my name.\n\nAs the member of parliament, I do politics. l dont deal with small cooperatives and l will sue people and make money for playing with my name, Kanopula said in an interview.\n\nCooperative funds ate not being deposited into the agreed bank account, it was established.\n\nThe money was pocketed by those in charge. Kanopula and others are taking advantage of peoples trust, and the cooperative has become a cash cow for a few individuals, said another source who had requested an interview with this publication.\n\nBut the co-operative managers insist they are carrying out their work above board.\n\nGilbert Manatsa, a committee member at the Simon Muzenda Housing Cooperative, maintained that funds were used appropriately and that development projects were progressing.\n\nWe havent received any complaints from our members. These are baseless accusations from people who dont want to see us succeed, Manatsa said.\n\nDominic Mufanochiya, the cooperative chair,dismissed the allegations as baseless and accused their elected secretary, Alec Chingwaru, for spreading malicious reports after being suspended for alleged misconduct.\n\nEverything is in order. This is all Chingwarus doing because we suspended him, said Mufanechiya.\n\nAt the moment, no one can claim to be a member because the co-operative doesnt have an approved register. Those claiming misuse of funds are spreading lies to tarnish our reputation, added Mufanochiya.\n\nBut a 2023 audit supported by the Small and Medium Enterprises forced the production of a member register and fresh elections, contradicting Mufanochiyas claim.\n\nThe letter from the Ministry notifying members of the audit\n\nChingwaru dismissed the allegation against him.\n\nTheir assertion that the cooperative is operating without membership is both baseless and dishonest.\n\nFollowing an audit, a provisional register was established, and an inaugural meeting was held in June 2024, attended by members who had each paid $30 in contributions.\n\nThese funds were later misappropriated by Manatsa and Mufanochiya.\n\nTheir claim of a lack of membership not only contradicts the facts but is also an egregious attempt to deflect accountability for their actions, he said.\n\nChingwaru implicated the area legislator.\n\nTheir reliance on political interference is evident. In court filings, they openly acknowledged being directed by MP Hon. Trymore Kanopula to file for an interdict against me.\n\nThe matter is now before the High Court, and while I will not delve into its specifics as it is sub judice, I am confident that the judiciary will address these baseless allegations appropriately, he said.\n\nEvery action I took was within my mandate to ensure transparency and proper governance within the cooperative.\n\nThis is not the first time Kanopulas name has been linked to scandal.\n\nDuring the 2023 election campaign, he reportedly promised residents that cooperatives would help them secure title deeds under President Mnangagwas housing scheme.\n\nThese promises are yet to materialize, further fueling discontent.\n\nIn September 2023, Kanopula was embroiled in a dispute with Pungwe-Chimurenga Housing Cooperative (Eyrecourt) where the cooperative accused him of converting land meant for commercial, clinic, and school purposes into residential stands for personal gain.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/15105956/WhatsApp-Image-2025-01-15-at-12.49.59.jpeg",
            "description": "<p>By Pauline Chateuka The Harare South lawmaker, Trymore Kanopula, has been implicated in corrupt deals in his constituency. The Zanu PF legislator—who is popularly known as TK—is being accused of participating in questionable dealings linked to the Simon Muzenda Housing Cooperative. Reports of the alleged involvement of Kanopula in the disputes emerged after disgruntled residents</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-mp-faces-scrutiny-over-housing-cooperative-scandals/\">Zanu PF MP faces scrutiny over Housing Cooperative scandals  </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "15 Jan 2025"
        },
        {
            "title": "Lewis Machipisa: Pioneering Zimbabwean journalist remembered as a “good soul who touched many lives”",
            "url": "https://www.newzimbabwe.com/lewis-machipisa-pioneering-zimbabwean-journalist-remembered-as-a-good-soul-who-touched-many-lives/",
            "content": "Lewis Lew Machipisa, a veteran Zimbabwean journalist who spent nearly two decades at the BBC World Service and was known for his warm personality and dedication to African journalism, died in his sleep at his home in Catford, Southeast London, on January 7, 2025. He was 52.\n\nHis passing was announced by family and colleagues at the BBC, where he had worked as a producer for flagship programs Network Africa and Focus on Africa until 2020. He is survived by his three children, Dudu, Dumi, and Chikomborero.\n\nMachipisas journey in journalism began at Harare Polytechnics School of Journalism in 1991. He started his career as a correspondent for Inter Press Service in Harare in 1993, before joining the BBC World Services Zimbabwe bureau. In the early 2000s, amid political tensions in Zimbabwe, he relocated to London, joining many other journalists leaving the country at that time.\n\nLewis was then a keen correspondent, keeping the continent and indeed the rest of the world informed by reporting on and explaining a range of issues in late President Robert Mugabes Zimbabwe, said Josephine Hazeley, former BBC Africa Deputy Editor.\n\nHis reporting on the controversial seizure of white-owned farms in Zimbabwe ultimately forced him to leave his homeland, but it exemplified his commitment to telling important African stories. He later covered the historic birth of South Sudan as a nation, spending a year there and forming deep connections with both the countrys leadership and its citizens.\n\nLewis wasnt just a good friend; he was a brilliant journalist and creative. He had this knack for giving every story he touched that extra spark, said Rachael Akidi, former BBC Focus on Africa Editor. Whether it was reporting on the seizure of white-owned farms in Zimbabwe or covering the birth of a new nation in South Sudan, his work always stood out.\n\nColleagues remember Machipisa, affectionately known as Machipee or Chimurenga, for his infectious smile and ability to bring levity to the newsroom. Bola Mosuro, a former colleague, recalled: Working a night shift or having a long production day never felt tedious if you knew it was with Lewis. Instead, youd be in good spirits knowing he was editing or was part of the team that youd be spending long hours with.\n\nStanley Kwenda, a Zimbabwean journalist who worked with him at BBC Focus on Africa said he had lost a mentor.\n\nHe took me under his wing. Taught me how to be a BBC type. His influence wasnt just limited to our professional relationship. He was a social teacher and helped me settle in London when the citys lights were too bright for me, said Kwenda.\n\nHis impact extended beyond the newsroom. In Londons Zimbabwean diaspora community, he was instrumental in facilitating access for high-level Zimbabwean officials and musicians to the BBC and other global media platforms. He was known for his generosity of spirit and willingness to help others, often without seeking recognition.\n\nAudrey Brown, Focus on Africa Lead Presenter, remembered him for both his lightheartedness and professionalism: We loved him for his sense of mischief, his refusal to take himself too seriously. But we knew the one thing he did not joke about was his commitment to being a journalist worthy of the trust our listeners placed in us as a collective.\n\nDespite his professional success, Machipisa remained humble and approachable. As Akidi noted: He lived in the moment  even impulsive at times. He never took himself too seriously During one of our chats during the pandemic, he shared how humour was his way of dealing with lifes curveballs. It made sense because he carried a lot, but he carried it lightly.\n\nJosephine Hazeley remembers him as a very laid-back colleague who did his best. When caught on a good day at BBC Africa, Lewis was a delight to work with!\n\nHis connection with BBC African Service listeners was particularly special, built on his natural warmth and storytelling ability. He had an extraordinary talent for making instant connections with people from all walks of life, treating everyone he met with the same genuine interest and respect.\n\nIn the words of his colleagues, Machipisa will be remembered as, a good soul who touched many lives with his generous spirit. Lew leaves behind a legacy of professional excellence and personal kindness that touched countless lives across Africa and beyond.\n\nTo contribute to Lews chema, please visit https://gofund.me/71899b96.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/15094046/WhatsApp-Image-2025-01-14-at-17.13.18.jpeg",
            "description": "<p>Lewis “Lew” Machipisa, a veteran Zimbabwean journalist who spent nearly two decades at the BBC World Service and was known for his warm personality and dedication to African journalism, died in his sleep at his home in Catford, Southeast London, on January 7, 2025. He was 52. His passing was announced by family and colleagues</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/lewis-machipisa-pioneering-zimbabwean-journalist-remembered-as-a-good-soul-who-touched-many-lives/\">Lewis Machipisa: Pioneering Zimbabwean journalist remembered as a “good soul who touched many lives”  </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "15 Jan 2025"
        },
        {
            "title": "Social media react to Nadia Nakai getting cosy with Cassper in front of his wife",
            "url": "https://www.newzimbabwe.com/social-media-react-to-nadia-nakai-getting-cosy-with-cassper-in-front-of-his-wife/",
            "content": "SAHipHopMag\n\nSocial Media React To Nadia Nakai Getting Cosy With Cassper In Front Of His Wife. Social media has been buzzing since a viral video showed rapper Nadia Nakai getting particularly cosy with her former boss, Cassper Nyovest, at a popular nightclub.\n\nThe moment, which occurred under the watchful eye of Casspers wife, Pulane, has ignited heated debates about boundaries, relationships, and respect within the South African hip-hop community.\n\nCassper Nyovest and Nadia Nakaishare a storied professional history, having worked together under Family Tree Records, the label Cassper owns. Nadia eventually left the label and later on dated the late rapper AKA, a longstanding rival of Casspers. The public feud between AKA and Cassper defined much of South African hip-hop in its prime, making Nadia and AKAs romance a hot topic in the entertainment world.\n\nWith AKAs tragic death still fresh in the minds of many, fans have been quick to scrutinize Nadias recent interactions with Cassper. In the now-viral clip, Casspers wife Pulane can be seen sitting nearby, appearing visibly uncomfortable with Nadias behaviour.\n\nIn the video clip, Nadia Nakai is seen embracingCassperwhile performing her hit song Naa Meaan. Amid this unconventional display, Nadia further stirred the moment by saying, Shout out to Pulane in the building, a comment that some perceived as subtly disrespectful to Casspers wife.\n\nPulanes expression throughout the interaction became a focal point, with fans rallying to her defence.This is so disrespectful to Casspers wife. People might not like her but at the end of the day Cassper decided to marry her.\n\nHis (Cassper) body language says a lot, its also kinda tricky now that his married, do you sit your lady friends down and implement boundaries or keep quiet and dont make it a thing??One X user wrote.\n\nThe incident has triggered a wave of reactions online, with some defending Nadia and others slamming her behaviour as inappropriate. A faction of fans reminded critics that Cassper and Nadia were once close colleagues, suggesting that their interaction may have been harmless. However, others highlighted the optics of the situation, noting that Pulanes apparent discomfort made the moment seem disrespectful.\n\nThis is so disrespectful to Casspers wife. People might not like her but at the end of the day Cassper decided to marry her.\n\nNadia is a savage Im afraidLol, she knew what she was doing! Afetsa are shout out to Puleng in the buildingggg coz she noticed Puleng was fuming.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/15090114/Nadia-Cassper-660x400-1.jpg",
            "description": "<p>SAHipHopMag Social Media React To Nadia Nakai Getting Cosy With Cassper In Front Of His Wife. Social media has been buzzing since a viral video showed rapper Nadia Nakai getting particularly cosy with her former boss, Cassper Nyovest, at a popular nightclub. The moment, which occurred under the watchful eye of Cassper’s wife, Pulane, has</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/social-media-react-to-nadia-nakai-getting-cosy-with-cassper-in-front-of-his-wife/\">Social media react to Nadia Nakai getting cosy with Cassper in front of his wife</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "15 Jan 2025"
        },
        {
            "title": "SADC Chairman Mnangagwa snubs Chapo’s inauguration amid bloodshed in Mozambique",
            "url": "https://www.newzimbabwe.com/sadc-chairman-mnangagwa-snubs-chapos-inauguration-amid-bloodshed-in-mozambique/",
            "content": "By Staff Reporter\n\nPRESIDENT Emmerson Mnangagwa has conveniently dispatched Defence Minister, Oppah Muchinguri-Kashiri, for Mozambique where she will represent him at the inauguration of President-elect Daniel Chapo this Wednesday.\n\nThe ceremony takes place at the Independence Square in the capital city Maputo before Members of the National Assembly, amongother attendees.\n\nMnangagwa, who is on his annual leave but has curiously been carrying out official duties including Cabinet appointments, has avoided the embarrassment, as Southern African Development Community (SADC) chairman, of attending the controversial installation of Chapo.\n\nThe 82-year-old Zanu PF leader finds himself in an invidious position after he prematurely endorsed Chapo and his Frelimo partys victory even before Mozambiques electoral body had done so, a move that attracted widespread criticism from various stakeholders.\n\nAccording to State media, Muchinguri-Kashiri is expected to be part of the Heads of State and Government witnessing the inauguration, which comes amidst bloody protests in the neighbouring country in the aftermath of a disputed outcome of the October 2024 elections.\n\nAlso from Zimbabwe, Pan African Parliament president, Chief Fortune Charumbira, is in Maputo, Mozambique, for the 49-year-old President-elects crowning event.\n\nThe atmosphere in Maputo is reportedly tense ahead of the event.\n\nThe streets of Maputo are eerily deserted on the eve of Daniel Chapos inauguration as Mozambiques 5th President. This calm is not by chance; opposition leader Venncio Mondlane has called for a stay-at-home protest to overshadow the preparations for the swearing-in ceremony, wrote a social media user, before attaching pictures of empty streets.\n\nHowever, this silence is also a product of fear. Security forces, including UIR and SERNIC, have been patrolling neighbourhoods, using tear gas and live ammunition to deter people from gathering or leaving their homes.\n\nIn the citys outskirts, an atmosphere of terror and intimidation looms, leaving communities trapped in fear, the commentator further said.\n\nMozambiques main opposition leader, Venancio Mondlane returned from exile last Thursday as security forces fired tear gas at hundreds of his supporters, who gathered near the main international airport to welcome him home.\n\nHe had left the country in October following a disputed election that has sparked months of violent protests and thrown the country into turmoil.\n\nEmerging from the airport with a Bible in hand, Mondlane prayed and took an oath, mimicking a presidential swearing-in ceremony. He declared himself the legitimately elected president, rejecting the official results that favoured Frelimos candidate, Chapo.\n\nMondlane stated that he is ready for dialogue with the government saying his return was to stop the killings of his supporters.\n\nMondlane said he left Mozambique fearing for his life after two senior members of his opposition party were killed in their car by unknown gunmen in a late-night shooting in the aftermath of the election.\n\nMore than 100 people have been killed by security forces since Mozambique erupted in protests that Mondlane called for after the long-ruling Frelimo party was declared the winner of the October 9 election.\n\nMondlane and other opposition candidates accused the ruling party of rigging the election and international observers reported irregularities in the vote and the alteration of some results.\n\nChapo garnered nearly 70 percent of the vote against his closest challenger, Mondlane who got 20 percent. He succeeded Felipe Nyusi who served two terms in office. Both belong to the ruling Frelimo party.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/03005736/SONA-1-Mnangagwa.png",
            "description": "<p>By Staff Reporter PRESIDENT Emmerson Mnangagwa has conveniently dispatched Defence Minister, Oppah Muchinguri-Kashiri, for Mozambique where she will represent him at the inauguration of President-elect Daniel Chapo this Wednesday. The ceremony takes place at the Independence Square in the capital city Maputo before Members of the National Assembly, among other attendees. Mnangagwa, who is on his</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sadc-chairman-mnangagwa-snubs-chapos-inauguration-amid-bloodshed-in-mozambique/\">SADC Chairman Mnangagwa snubs Chapo’s inauguration amid bloodshed in Mozambique</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "15 Jan 2025"
        },
        {
            "title": "Mutilated body found with missing head, genitals in suspected ritual killing",
            "url": "https://www.newzimbabwe.com/mutilated-body-found-with-missing-head-genitals-in-suspected-ritual-killing/",
            "content": "By Staff Reporter\n\nPOLICE in Mashonaland Central are investigating a suspected ritual murder after the body of a 27-year-old Bindura man was discovered with some of its parts missing.\n\nThe now deceased was identified as Garikayi Junior Kamwendo, whose decomposing corpse was found with its head and genitals removed.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the gory incident.\n\nThe ZRP is investigating circumstances surrounding a case of murder in which the body of Garikayi Junior Kamwendo (27) was found lying lifeless in a bushy area between Brockdale and Woodbrooke Suburbs, Bindura on January 13, 2025.\n\nThe body of the victim was found in an advanced state of decomposition with the head and genitals missing, said Nyathi.\n\nFollowing the discovery by a passerby, police attended the scene and conveyed the mutilated body to Bindura Hospital mortuary for post-mortem.\n\nZRP is appealing to anyone with information that might unravel the mysterious death to report at any nearest police station.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/03/19053332/police-carrying-coffin.webp",
            "description": "<p>By Staff Reporter POLICE in Mashonaland Central are investigating a suspected ritual murder after the body of a 27-year-old Bindura man was discovered with some of its parts missing. The now deceased was identified as Garikayi Junior Kamwendo, whose decomposing corpse was found with its head and genitals removed. Zimbabwe Republic Police (ZRP) national spokesperson,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mutilated-body-found-with-missing-head-genitals-in-suspected-ritual-killing/\">Mutilated body found with missing head, genitals in suspected ritual killing </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "15 Jan 2025"
        },
        {
            "title": "Poor infrastructure in host nations sees CAF postponing 2024 CHAN tournament",
            "url": "https://www.newzimbabwe.com/poor-infrastructure-in-host-nations-sees-caf-postponing-2024-chan-tournament/",
            "content": "By Sport Reporter\n\nTHE Confederation of African Football (CAF) has postponed the 2024 Total Energies CAF African Nations Championships (CHAN) tournament to August due to poor infrastructure in the three co-hosting nations  Kenya, Uganda and Tanzania.\n\nInitially, the 19-team tournament was supposed to be played from the 1st to 28th of February.\n\nHowever, an assessment by the CAF team of inspectors in the respective three nations revealed that they are not ready to host the event due to poor infrastructure, which includes stadiums, training facilities, and hospitals.\n\nAs part of a mitigation plan, CAF has now postponed the tournament to August so as to give the three nations a chance to improve the infrastructure.\n\nIn a statement, CAF President Dr Patrice Motsepe assured that the 2024 tournament would go on in August once the three countries have upgraded their facilities, as work is in progress.\n\nl am impressed with the ongoing construction and renovations of the football infrastructure and facilities in Kenya, Tanzania and Uganda.\n\nI am confident that the stadiums, training fields, hotels, hospitals and other infrastructure and facilities will be at the requisite CAF standards for hosting, in August 2025, a very successful TotalEnergies African Nations Championship (CHAN) Kenya, Tanzania, Uganda 2024, said Motsepe.\n\nOf the three nations, Kenya is already hosting its international football games in foreign lands due to a lack of CAF-approved stadiums in the country.\n\nThe 2025 CHAN tournament will be a test event for the three nations, which are also set to host the 2027 AFCON finals.\n\nMeanwhile, the draw for the postponed tournament will be held on Wednesday 15 January in Nairobi, Kenya.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/15075337/chan.jpg",
            "description": "<p>By Sport Reporter THE  Confederation of African Football (CAF) has postponed the 2024 Total Energies CAF African Nations Championships (CHAN) tournament to August due to poor infrastructure in the three co-hosting nations – Kenya, Uganda and Tanzania. Initially, the 19-team tournament was supposed to be played from the 1st to 28th of February. However, an</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/poor-infrastructure-in-host-nations-sees-caf-postponing-2024-chan-tournament/\">Poor infrastructure in host nations sees CAF postponing 2024 CHAN tournament</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "15 Jan 2025"
        },
        {
            "title": "‘ED2030’ campaign is Zimbabweans’ idea, not MPs – says Zanu PF chief whip",
            "url": "https://www.newzimbabwe.com/ed2030-campaign-is-zimbabweans-idea-not-mps-zanu-pf-chief-whip/",
            "content": "By Staff Reporter\n\nTHE ED2030 campaign is Zimbabweans idea and not President Emmerson Mnangagwas or legislators, Zanu PF chief whip Pupurai Togarepi has claimed.\n\nIn an interview with NewZimbabwe.com after the MPs Precabe Farm visit last Sunday, Togarepi said the visit had nothing to do with extending Mnangagwas tenure.\n\nAbout 34 opposition MPs visited President Mnangagwas farm over the weekend where politician Jealousy Mawarire claims they pocketed US$5,000.\n\nThe visit was widely viewed as part of a ploy to extend EDs tenure when his term ends after self-styled CCC Secretary General Sengezo Tshabangu said they were prepared to support the deferment of elections for Mnangagwa.\n\nHis supporters brought the idea and you all remember that at the Zanu PF conference in Bulawayo late last year, a resolution was made to the effect that the party members want their leader to continue at the helm of the country beyond 2028.\n\nThis is not an agenda by the MPs who have come to this farm but by Zimbabweans themselves. This idea cannot be stopped by anyone or myself. It is coming from the people of Zimbabwe and MPs are representatives of the people in all 10 provinces, Togarepi said.\n\nMnangagwa is currently serving his second and final term which will end in 2028 but there are sections of his supporters pushing for him to stay beyond that. He has however dismissed the notion saying he will abide by the constitution and step down when its time.\n\nHe added, As a democracy, we are allowed to say what we want so this agenda is not for MPs, but the people of Zimbabwe. Who can stop what we have seen here? Look at the development that we see is what people want beyond 2028.\n\nThe truth is that people may trouble themselves on this issue, debarking the wrong tree but the openness that we have witnessed here has made us wiser than before. We have realised that this criticism from the opposition is crucial for us the ruling party to do the right thing. We want that constructive criticism in order to build the nation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/08/14051611/zdf-mnangagwa-5.jpeg",
            "description": "<p>By Staff Reporter THE “ED2030” campaign is Zimbabweans’ idea and not President Emmerson Mnangagwa’s or legislators, Zanu PF chief whip Pupurai Togarepi has claimed. In an interview with NewZimbabwe.com after the MPs Precabe Farm visit last Sunday, Togarepi said the visit had nothing to do with extending Mnangagwa’s tenure. About 34 opposition MPs visited President</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ed2030-campaign-is-zimbabweans-idea-not-mps-zanu-pf-chief-whip/\">‘ED2030’ campaign is Zimbabweans’ idea, not MPs – says Zanu PF chief whip   </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "15 Jan 2025"
        },
        {
            "title": "Odinga talks African development after meeting Mnangagwa, says foreigners only concerned with money",
            "url": "https://www.newzimbabwe.com/odinga-talks-african-development-after-meeting-mnangagwa-says-foreigners-only-concerned-with-money/",
            "content": "By Staff Reporter\n\nFORMER Kenyan Prime Minister Raila Odinga has bemoaned how Africa continues to wallow in abject poverty despite vast natural resources it boasts of.\n\nSpeaking after meeting President Emmerson Mnangagwa at State House, Monday, Odinga said a blueprint towards the continents development had to be crafted.\n\nOdinga, who has put forward his name for election to the African Union Commissions (AUC) chairmanship, was in Zimbabwe as part of his campaign.\n\nElections are set for February this year.\n\nAs you know I announced my candidature for chair of the AU and as part of that I have been visiting African countries, said Odinga.\n\nMnangagwa is the country chair of SADC so it was important that I visit Harare.\n\nOdinga will be touring the rest of the southern Africa region on his campaign trail.\n\nAfrica has a bright future (but) we must have a clear roadmap and blueprint on how to develop it, he said.\n\nForeigners only come to Africa to make money so Africa will be developed by Africans themselves.\n\nWe have 55 states in Africa and are looking towards how these can be integrated so that they benefit from its resources.\n\nIt is the richest continent on the planet but the paradox is that Africans are the poorest in terms of living standards.\n\nDespite African countries having become fertile ground for foreign investment, very little has been realised by communities as most still survive in squalid conditions, without potable water, proper sewer systems or respectable road networks.\n\nChinese, European and American investments have failed to rid it of its dark continent tag.\n\nThe AUC is the AUs secretariat and undertakes the day-to-day activities of the Union. It should not be confused with the AU, itself headed by Mohamed Ould Cheikh Mohamed Ahmed Ould Ghazouani, the ninth President of Mauritania.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/14141942/odinga-mnangagwa.jpeg",
            "description": "<p>By Staff Reporter FORMER Kenyan Prime Minister Raila Odinga has bemoaned how Africa continues to wallow in abject poverty despite vast natural resources it boasts of. Speaking after meeting President Emmerson Mnangagwa at State House, Monday, Odinga said a blueprint towards the continent’s development had to be crafted. Odinga, who has put forward his name</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/odinga-talks-african-development-after-meeting-mnangagwa-says-foreigners-only-concerned-with-money/\">Odinga talks African development after meeting Mnangagwa, says foreigners only concerned with money</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "15 Jan 2025"
        },
        {
            "title": "Man steals goat, sells the meat to owner",
            "url": "https://www.newzimbabwe.com/man-steals-goat-sells-the-meat-to-owner/",
            "content": "By Staff Reporter\n\nA Hwange man who stole a goat from his neighbour before he slaughtered it and sold the meat to its owner has been jailed for six months.\n\nThe convict is Shylock Zulu (28) from Mashala Village.\n\nHe was charged with stock theft and was convicted after a full trial.\n\nProsecutors proved that on January 8 this year, Zulu stole a goat belonging to a fellow villager Thabani Sibanda.\n\nThe accused person slaughtered the said goat and proceeded to Sibandas homestead where he sold the meat to the complainant for US$15 purporting it to be bush buck meat.\n\nThe complainant became suspicious that the meat could be from his goat which went missing, the court heard.\n\nInvestigations led to Zulus arrest.\n\nZulu however escaped a custodial sentence after half of the sentence was suspended on condition he does not commit a similar offence in the next 5 years.\n\nThe remaining three months were suspended on condition accused restitutes complainant ZWG$1057.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/04/16182340/Goat.jpg",
            "description": "<p>By Staff Reporter A Hwange man who stole a goat from his neighbour before he slaughtered it and sold the meat to its owner has been jailed for six months. The convict is Shylock Zulu (28) from Mashala Village. He was charged with stock theft and was convicted after a full trial. Prosecutors proved that</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-steals-goat-sells-the-meat-to-owner/\">Man steals goat, sells the meat to owner</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "15 Jan 2025"
        },
        {
            "title": "Young Warriors captain Tadiwa Chakuchichi on Cape Town City’s radar",
            "url": "https://www.newzimbabwe.com/young-warriors-captain-tadiwa-chakuchichi-on-cape-town-citys-radar/",
            "content": "By Darlington Gatsi\n\nYOUNG Warriors captain Tadiwa Chakuchichi is reportedly on the radar of Betway Premiership club Cape Town City with the South African side showing strong interest in securing the services of the talented midfielder.\n\nChakuchichi, who led the Young Warriors to the quarterfinals of the COSAFA tournament last year, is highly regarded by Cape Town City.\n\nAccording to South African sports publication iDiski Times, Chakuchichi will travel to South Africa for a trial assessment with the club.\n\nChakuchichis stoke continues to rise since captaining the Zimbabwe under-15 team at the COSAFA schools tournament held in Harare in 2023.\n\nLast year, the Legends Academy player was spotted at English Premiership Club Everton as part of a development program.\n\nShould Chakuchichi sign for Cape Town City, he will follow in the footsteps of Legends Academy alumni Douglas Mapfumo who switched to the side in 2021 before moving to Polokwane City.\n\nMeanwhile, Zimbabwean star Nokutenda Mangezi is nearing a loan move away from Betway Premiershipteam Supersport United.\n\nMangezi joined the Pretoria-based club last year from Real Betis Academy has been struggling in his debut season in the South African top flight and has not yet scored.\n\nThe arrival of experienced striker Samir Nukovic at Supersport has further increased competition for places and Mangezi may find himself lower the pecking order at Matsatsantsa.\n\nAccording to South African online sports publication, Kick Off, Supersport is considering loaning Mangezi to Pretoria Callies for more game time.\n\nMangezis current deal is set to expire in June but has an option for another extension should Supersport United trigger the renewal clause.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/14141326/FB_IMG_1736860856092.jpg",
            "description": "<p>By Darlington Gatsi YOUNG Warriors captain Tadiwa Chakuchichi is reportedly on the radar of Betway Premiership club Cape Town City with the South African side showing strong interest in securing the services of the talented midfielder. Chakuchichi, who led the Young Warriors to the quarterfinals of the COSAFA tournament last year, is highly regarded by</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/young-warriors-captain-tadiwa-chakuchichi-on-cape-town-citys-radar/\">Young Warriors captain Tadiwa Chakuchichi on Cape Town City’s radar </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "15 Jan 2025"
        }
    ]
}