{
    "news": [
        {
            "title": "JUST IN: Job Sikhala arrested in South Africa over suspected attempt to smuggle explosives into Zimbabwe",
            "url": "https://www.newzimbabwe.com/just-in-job-sikhala-arrested-in-south-africa-over-suspected-attempt-to-smuggle-explosives-into-zimbabwe/",
            "content": "By Kingston Ndabatei\n\nOPPOSITION leader Job Sikhala has been arrested in South Africa after allegedly attempting to smuggle a considerable amount of explosives into Zimbabwe.\n\nThe firebrand Sikhala, who was arrested by the South African Police Service (SAPS) is currently detained at Pretoria Central.\n\nJob Sikhala has been arrested after being caught with explosives on his way to Zimbabwe, said a source who declined to be named.\n\nNo further details were shared.\n\nIn images shared with with NewZimbabwe.com, Sikhala can be seen wearing his famous Mandela shirt, handcuffed and seated on a ramp.\n\nMore details to follow\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/07110153/IMG-20251107-WA0027.jpg",
            "description": "<p>By Kingston Ndabatei OPPOSITION leader Job Sikhala has been arrested in South Africa after allegedly attempting to smuggle a considerable amount of explosives into Zimbabwe. The firebrand Sikhala, who was arrested by the South African Police Service (SAPS) is currently detained at Pretoria Central. “Job Sikhala has been arrested after being caught with explosives on</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/just-in-job-sikhala-arrested-in-south-africa-over-suspected-attempt-to-smuggle-explosives-into-zimbabwe/\">JUST IN: Job Sikhala arrested in South Africa over suspected attempt to smuggle explosives into Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:30",
            "date": "07 Nov 2025"
        },
        {
            "title": "Mutapa Fund injects US$40 million to revive struggling parastatals",
            "url": "https://www.newzimbabwe.com/mutapa-fund-injects-us40-million-to-revive-struggling-parastatals/",
            "content": "By Alois Vinga\n\nThe Mutapa Investment Fund (MIF) has disbursed US$40 million to revive struggling state-owned enterprises (SOEs) across Zimbabwe as part of its ongoing efforts to restore the viability of key public entities.\n\nFormerly known as the Sovereign Wealth Fund of Zimbabwe, the MIF was established under the Sovereign Wealth Fund Act (Chapter 22:20) to manage national resources and support government-backed projects. The fund draws its capital from balance-of-payments surpluses, foreign currency operations, privatisation proceeds, fiscal savings, and natural resource revenues.\n\nIn an update this week, Mutapa Fund CEO Dr. John Mangudya said the latest funding marks significant progress in efforts to restructure and strengthen the performance of critical SOEs.\n\nThis funding is designed to enhance the performance of parastatals and align them with the national economic agenda, said Dr. Mangudya. Among the entities benefiting from this support are the Cold Storage Company (CSC), which recently emerged from corporate rescue, ZUPCO, Silo Foods, and the National Railways of Zimbabwe (NRZ), among others.\n\nSince its inception, the Mutapa Fund has played a central role in revitalising distressed parastatals, particularly by steering the CSC out of corporate rescue and improving governance and operational efficiency across several other enterprises.\n\nThe fund manages a diversified portfolio of state-owned companies, grouped into key economic clusters, including mineral resources, energy and trading, ICT, transport and logistics, agriculture and industry, financial services, and real estate.\n\nThrough these targeted investments, the Mutapa Investment Fund continues to anchor Zimbabwes broader strategy for state enterprise reform, economic stability, and sustainable growth.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/02/21044343/Mangudya-2.jpg",
            "description": "<p>By Alois Vinga The Mutapa Investment Fund (MIF) has disbursed US$40 million to revive struggling state-owned enterprises (SOEs) across Zimbabwe as part of its ongoing efforts to restore the viability of key public entities. Formerly known as the Sovereign Wealth Fund of Zimbabwe, the MIF was established under the Sovereign Wealth Fund Act (Chapter 22:20)</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mutapa-fund-injects-us40-million-to-revive-struggling-parastatals/\">Mutapa Fund injects US$40 million to revive struggling parastatals</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:30",
            "date": "07 Nov 2025"
        },
        {
            "title": "Diaspora community to converge for third edition of Zimbabwe Diaspora Homecoming Celebration & Business Summit",
            "url": "https://www.newzimbabwe.com/diaspora-community-to-converge-for-third-edition-of-zimbabwe-diaspora-homecoming-celebration-business-summit/",
            "content": "By Staff Reporter\n\nZimbabweans abroad set to converge for the third edition of the Zimbabwe Diaspora Homecoming Celebration and Business Summit, a premier platform aimed at promoting investment opportunities with the local and international markets, scheduled for December 19 at the Hyatt Regency, Harare.\n\nRunning under the theme Coming Home to Build, the event is organised by the Zimbabweans in Diaspora Organisation (ZIDO), renowned for hosting the annual Zimbabwe Business Expos in the United Kingdom and South Africa.\n\nThe Harare summit seeks to connect Zimbabweans in the diaspora with opportunities to invest, collaborate, and contribute to national development. It will feature exhibitions, investment sessions, expert panel discussions, and will conclude with an awards gala celebrating outstanding achievers in the diaspora.\n\nDescribed as a premier diaspora engagement platform, the event has become an important avenue for companies and organisations seeking to expand into both the local and diaspora markets.\n\nThe organisers said the summit will bring together prospective investors while recognising individuals making notable contributions to the countrys progress.\n\nThe 3rd Edition of the Zimbabwe Diaspora Celebration & Business Summit is more than a gathering; it is a national initiative celebrating the indispensable role of Zimbabweans abroad in driving economic transformation.\n\nAccording to the Reserve Bank of Zimbabwe, the diaspora community remitted an impressive US$2.2 billion in 2024, up from US$1.873 billion in 2023. This growth underscores the diasporas unwavering commitment to Zimbabwes socio-economic progress, said ZIDO chaiperson Blessed Kapesa.\n\nAn estimated 300 in-person participants and thousands of online viewers from around the world are expected to take part in the event.\n\nWith an expected attendance of at least 300 in-person participants and thousands of online viewers worldwide, the summit is strategically scheduled during the festive season, when many Zimbabweans in the diaspora return home.\n\nThis hybrid platform will enable participants to showcase their products, services, and investment opportunities to a global audience, amplifying visibility and engagement, he added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/06114145/zido.jpg",
            "description": "<p>By Staff Reporter Zimbabweans abroad set to converge for the third edition of the Zimbabwe Diaspora Homecoming Celebration and Business Summit, a premier platform aimed at promoting investment opportunities with the local and international markets, scheduled for December 19 at the Hyatt Regency, Harare. Running under the theme “Coming Home to Build,” the event is</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/diaspora-community-to-converge-for-third-edition-of-zimbabwe-diaspora-homecoming-celebration-business-summit/\">Diaspora community to converge for third edition of Zimbabwe Diaspora Homecoming Celebration & Business Summit</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:30",
            "date": "07 Nov 2025"
        },
        {
            "title": "Man arrested after attempting to disarm soldier at State House while demanding to see Mnangagwa",
            "url": "https://www.newzimbabwe.com/man-arrested-after-attempting-to-disarm-soldier-at-state-house-while-demanding-to-see-mnangagwa/",
            "content": "By Mary Taruvinga\n\nA Harare man, Moses Ruvheneko, was on Thursday remanded in custody following his court appearance on charges of attempting to disarm a security officer guarding Zimbabwe House, the official residence of President Emmerson Mnangagwa.\n\nRuvheneko, of no fixed abode, is facing two charges, criminal trespass and disorderly conduct in a public place in violation of the Criminal Law (Codification and Reform) Act [Chapter 9:23].\n\nRuvheneko appeared before Harare magistrate Ruth Moyo, who ordered that he undergo a mental examination.\n\nProsecutors told the court that on November 4, 2025, at around 3pm, Ruvheneko unlawfully walked along Chancellor Road, where pedestrians are prohibited opposite Zimbabwe House. He reportedly approached a security officer manning the main gate and suddenly attempted to snatch his SKS rifle while shouting, Where is ED? I want to see ED.\n\nA scuffle ensued as the guard wrestled with Ruvheneko before another officer, Private Mupfumira, intervened to subdue him. During the struggle, the accused was injured on his left hand by the bayonet attached to the firearm.\n\nThe accused was arrested while in the process of committing the offence, and there are eyewitnesses who will testify linking him to the crime, the State told the court.\n\nHe was later taken to Five Avenue Police Station, where a report was filed. The State opposed bail, arguing that Ruvheneko has no known address or relatives and may interfere with witnesses if released.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/01/07033353/Emmerson-Mnangagwa.png",
            "description": "<p>By Mary Taruvinga A Harare man, Moses Ruvheneko, was on Thursday remanded in custody following his court appearance on charges of attempting to disarm a security officer guarding Zimbabwe House, the official residence of President Emmerson Mnangagwa. Ruvheneko, of no fixed abode, is facing two charges, criminal trespass and disorderly conduct in a public place</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-arrested-after-attempting-to-disarm-soldier-at-state-house-while-demanding-to-see-mnangagwa/\">Man arrested after attempting to disarm soldier at State House while demanding to see Mnangagwa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:30",
            "date": "07 Nov 2025"
        },
        {
            "title": "Zimbabwean man, British woman stand accused of murdering 37–year–old model found dying in the street",
            "url": "https://www.newzimbabwe.com/zimbabwean-man-british-woman-stand-accused-of-murdering-37-year-old-model-found-dying-in-the-street/",
            "content": "Daily Mail\n\nA British woman accused of murdering a 37yearold model sobbed uncontrollably as she appeared in the dock.\n\nNatalie Chadwick, 27, struggled to confirm her name, age and address while in court, charged with killing Luke Harden.\n\nShe is accused of one count of murder with co-defendant Bhekisani Matabiswana, a Zimbabwean national known locally as Nick.\n\nMr Harden was found on a pavement and despite receiving treatment from paramedics at the scene, including CPR, died of his injuries.\n\nMatabiswana, 26, and Chadwick only spoke to confirm their details during the fiveminute hearing at Blackburn Magistrates Court on Wednesday.\n\nMr Hardens family and girlfriend were sat in the public gallery, supported by police officers. Members of Chadwicks family sat just yards away.\n\nChadwick  wearing a grey hoodie and tracksuit bottoms  had to be helped to the cells by security staff as she was led away.\n\nMatabiswana  wearing a blue Lonsdale hoodie  bowed his head.\n\nMr Harden was found on Newchurch Road in Bacup, Lancashire on Saturday at 12.35am.\n\nPolice are asking for dashcam and doorbell footage of the area on Saturday between 11:45pm to 12:35am\n\nChadwick and Matabiswana, both from Bacup, are set to appear at Preston Crown Court on Friday.\n\nLancashire Police previously said its thoughts were with Mr Hardens family, who are being supported by specially trained officers.\n\nHis family have been updated on the latest developments into the police investigation.\n\nIn a tribute, his family said: There are no words to describe how devastated we all are.\n\nWe wish our Luke could see the outpouring of love from everyone who knows him.\n\nHe is and will always be special to us all, as a son, brother, grandson, nephew, cousin, uncle, boyfriend and friend.\n\nTributes poured in from the community for the 37yearold, describing him as someone who would light up the room with his smile\n\nYou will be forever in our hearts and minds, and we are comforted knowing we can shut our eyes and your beautiful face will always be smiling back at us.\n\nRest in peace, our gorgeous Luke, until we will meet again.\n\nBefore Mr Harden was officially named, tributes also poured in on social media from the community.\n\nOne said: Cant believe the news. You were the life and soul of the party. You had a lot of time for everyone and I had a lot of time for you. Rest in peace Duke.\n\nAnother added: Been a tough one to process this morning and still quite hasnt sunk in. Duke would literally light a room up with that smile of his. Thinking of all his family and close friends at this sad time.\n\nThe charity Mr Harden supported through DJing, The Ginger Heart Foundation also paid its respects.\n\nHe helped plan an anniversary event in memory of Shaun Taylor, who took his own life in 2021 after a night out with friends.\n\nDetectives are continuing their investigation and appealing for eyewitnesses who were drinking at Rosemount Working Mens Club on Friday night.\n\nA spokesperson said: We are deeply saddened by the tragic loss of Luke. He kept in touch with us regularly and played a huge part in helping to plan our first anniversary event in memory of Shaun.\n\nLuke brought excitement, creativity, and a real zest for life to everything he did. He and a wonderful team of friends dedicated their time and energy to making that event truly special for the whole community.\n\nThe charity said Mr Harden brought laughter, love and an unforgettable spirit to the event.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/06114936/blackburn.webp",
            "description": "<p>Daily Mail A British woman accused of murdering a 37–year–old model sobbed uncontrollably as she appeared in the dock. Natalie Chadwick, 27, struggled to confirm her name, age and address while in court, charged with killing Luke Harden. She is accused of one count of murder with co-defendant Bhekisani Matabiswana, a Zimbabwean national known locally</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-man-british-woman-stand-accused-of-murdering-37-year-old-model-found-dying-in-the-street/\">Zimbabwean man, British woman stand accused of murdering 37–year–old model found dying in the street</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:30",
            "date": "07 Nov 2025"
        },
        {
            "title": "Top Ibhetshu LikaZulu official resigns after once-vibrant pressure group goes to bed with Zanu PF",
            "url": "https://www.newzimbabwe.com/top-ibhetshu-likazulu-official-resigns-after-once-vibrant-pressure-group-goes-to-bed-with-zanu-pf/",
            "content": "By Leopold Munhende\n\nGIFFORD Sibanda, the Ibhetshu LikaZulu spokesperson, has resigned from the once vibrant pressure group following revelations that Secretary General Mbuso Fuzwayo is now working hand in glove with Zanu PF to ensure President Emmerson Mnangagwas ambitions for a term extension are realised.\n\nThe group, which in the past was declared a public enemy with some of its members arrested and locked up for standing up to the Zanu PF government, is the second applicant in a Constitutional Court application veiled as an attempt to stop Mnangagwas 2030 plan.\n\nSengezo Tshabangus lawyer, Nqobile Sithole and Method Ndlovu are representing Fuzwayo and Ibhetshu LikaZulu.\n\nAccording to reports, Sibandas resignation emanates from knowledge that Fuzwayo has been tasked to challenge the illegal attempts to have Mnangagwa hang on, and lose.\n\nThis will thereby open avenues for Zanu PFs resolution to extend his second term actionably without any legal hindrances and possible challenges.\n\nThis, however, remains unconfirmed as Fuzwayos number was not going through when NewZimbabwe.com sought to get his comment on the allegations. His WhatsApp number was also not receiving messages.\n\nIt is with a heavy heart that I tender my resignation from Ibhetshu LikaZulu, effective immediately, reads Sibandas letter to Fuzwayo.\n\nThis decision comes after deep reflection on the current direction and approach the organisation has taken in the struggle against Zanu PF.\n\nUnfortunately, I find that this route diverges from my own beliefs, principles, and the foundational values that Ibhetshu LikaZulu has long stood for.\n\nThis is not an easy decision. Ibhetshu LikaZulu has been a home of conscience and courage  a movement that stood firmly with the oppressed and gave voice to the voiceless.\n\nSibanda and Fuzwayo had been comrades in arms for years, in the trenches against first late President Robert Mugabe and his harsh Zanu PF regime to the current.\n\nA resolution by Zanu PF last year mandated the partys secretary for justice to initiate the process that will extend Mnangagwas second and final term, which is supposed to end in 2028. The party wants it lengthened to 2030.\n\nThe involvement of exiled former minister in Mugabes government, Jonathan Moyo, has raised the stakes as he is a known strategist and thinker.\n\nThe resolution, which has threatened to split the revolutionary institution and riddled it with factional fights, was reinforced at its recent Peoples Conference hosted in Mutare.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/22205448/Mbuso-Fuzwayo.jpg",
            "description": "<p>By Leopold Munhende GIFFORD Sibanda, the Ibhetshu LikaZulu spokesperson, has resigned from the once vibrant pressure group following revelations that Secretary General Mbuso Fuzwayo is now working hand in glove with Zanu PF to ensure President Emmerson Mnangagwa’s ambitions for a term extension are realised. The group, which in the past was declared a public</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/top-ibhetshu-likazulu-official-resigns-after-once-vibrant-pressure-group-goes-to-bed-with-zanu-pf/\">Top Ibhetshu LikaZulu official resigns after once-vibrant pressure group goes to bed with Zanu PF</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:30",
            "date": "07 Nov 2025"
        },
        {
            "title": "Robert Mugabe Jnr issued with arrest warrant",
            "url": "https://www.newzimbabwe.com/robert-mugabe-jnr-issued-with-arrest-warrant/",
            "content": "By Mary Taruvinga\n\nRobert Tinotenda Mugabe, son of the late former President Robert Mugabe, has been issued with a warrant of arrest after failing to appear in court for his routine remand.\n\nHarare magistrate Lisa Mutendereki issued the warrant after Mugabes name was called three times with no response.\n\nMugabe who is out on bail, was arrested last month for unlawful possession of dagga. He was nabbed during a police traffic blitz after driving against a one-way street along Second Street Extension in Harare.\n\nProsecutors allege police recovered two sachets of dagga, a pack of rizla, and a dagga crusher from his sling bag. The drugs, weighing two grams and valued at US$30, were verified at Harare Main Post.\n\nMugabe is represented by lawyer Ashiel Mugiya.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/02155751/robert-jnr-mugabe.webp",
            "description": "<p>By Mary Taruvinga Robert Tinotenda Mugabe, son of the late former President Robert Mugabe, has been issued with a warrant of arrest after failing to appear in court for his routine remand. Harare magistrate Lisa Mutendereki issued the warrant after Mugabe’s name was called three times with no response. Mugabe who is out on bail,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/robert-mugabe-jnr-issued-with-arrest-warrant/\">Robert Mugabe Jnr issued with arrest warrant</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:30",
            "date": "07 Nov 2025"
        }
    ]
}