{
    "news": [
        {
            "title": "Arise, Sir David – Beckham receives knighthood",
            "url": "https://www.newzimbabwe.com/arise-sir-david-beckham-receives-knighthood/",
            "content": "BBC\n\nFormer England captain Sir David Beckham has been formally knighted for his services to football and British society.\n\nThe 50-year-old, who wasnamed on King Charles Birthday Honours listearlier this year, was knighted by the King during a ceremony in Berkshire on Tuesday.\n\nI couldnt be prouder, said Beckham. People know how patriotic I am  I love my country.\n\nIve always said how important the monarchy is to my family.\n\nIm lucky enough to have travelled around the world and all people want to talk to me about is our monarchy. It makes me proud.\n\nBeckham was joined by his wife Victoria and his parents Sandra and David at Windsor Castle.\n\nVictoria, who received an OBE in 2017 for services to the fashion industry, designed and made the suit that her husband wore at the castle.\n\n[King Charles] was quite impressed with my suit, said Beckham.\n\nHes the most elegantly dressed man that I know, so he inspired quite a few of my looks over the years and he definitely inspired this look.\n\nIt was something that my wife made me.\n\nI looked at old pictures of him when he was quite young in morning suits and I was like OK, thats what I want to wear  so I gave it to my wife and she did it.\n\nBeckham played 115 times for his country and captained the Three Lions for six years between 2000 and 2006.\n\nThe former Manchester United and Real Madrid midfielder featured in three World Cups for England, as well as two European Championships.\n\nBeckham emerged from Uniteds academy in 1992 and spent 11 years in the first team before joining Real in 2003 in a 25m deal.\n\nHe played for four years in the Spanish capital before joining Major League Soccer team LA Galaxy. He had two loan spells at AC Milan during his time in Los Angeles, before finishing his career at Paris St-Germain in 2013.\n\nBut Beckhams impact extends far beyond the pitch.\n\nBorn in east London, he played a role in securing the 2012 Olympics for London.\n\nHe has worked with humanitarian aid organisation Unicef since 2005 and had a fund named in his honour in 2015 to mark a decade-long partnership between the two.\n\nBeckham, who was awarded an OBE by Elizabeth II in 2003,queued for more than 12 hoursto see the Queen lying in state following her death in 2022.\n\nIts special to be here, to celebrate and to hear the different stories that people have, Beckham said afterwards.\n\nBeckham became an ambassador for the Kings Foundation in 2024, supporting King Charles education programme and efforts to ensure young people have a greater understanding of nature.\n\nHe part-owns League Two side Salford City alongside former United and England team-mate Gary Neville, and is also co-owner of MLS side Inter Miami.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/04174008/beckham.webp",
            "description": "<p>BBC Former England captain Sir David Beckham has been formally knighted for his services to football and British society. The 50-year-old, who was named on King Charles’ Birthday Honours list earlier this year, was knighted by the King during a ceremony in Berkshire on Tuesday. “I couldn’t be prouder,” said Beckham. “People know how patriotic I am</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/arise-sir-david-beckham-receives-knighthood/\">Arise, Sir David – Beckham receives knighthood</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "04 Nov 2025"
        },
        {
            "title": "Sean Williams in rehab for drug addiction, dropped by Zimbabwe Cricket",
            "url": "https://www.newzimbabwe.com/sean-williams-in-rehab-for-drug-addiction-dropped-by-zimbabwe-cricket/",
            "content": "By Sports Reporter\n\nVeteran Zimbabwean batter Sean Williams has checked into a rehabilitation centre after admitting to a drug addiction.\n\nWilliams, one of the countrys most experienced cricketers, recently withdrew from the squadon the eve of the ICC Mens T20 World Cup Africa Qualifier 2025 in Harareciting personal reasons.\n\nFollowing an internal investigation into his sudden withdrawal, Zimbabwe Cricket (ZC) said Williams confessed to struggling with a drug addiction and voluntarily checked into rehab.\n\nIn a statement, ZC said Williams contract will not be renewed after its expiry in December 2025 because of his unprofessionalism.\n\nDuring an internal investigation to understand the reasons for his unavailability, Williams disclosed that he has been struggling with drug addiction and has voluntarily entered rehabilitation.\n\nZC expects all contracted players to uphold the highest standards of professionalism, discipline, and compliance with team protocols and anti-doping regulations, read part of ZCs statement.\n\nAfter careful consideration, ZC has concluded that Williams will no longer be considered for national selection. Consequently, it is not feasible to continue his national contract beyond its expiry on 31 December 2025.\n\nWilliams, who made his international debut in 2005, has been one of Zimbabwes most consistent performers across formats and previously captained the national side.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/31042232/Zimbabwe-batter-Sean-Williams.jpg",
            "description": "<p>By Sports Reporter Veteran Zimbabwean batter Sean Williams has checked into a rehabilitation centre after admitting to a drug addiction. Williams, one of the country’s most experienced cricketers, recently withdrew from the squad on the eve of the ICC Men’s T20 World Cup Africa Qualifier 2025 in Harare citing personal reasons. Following an internal investigation into his</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sean-williams-in-rehab-for-drug-addiction-dropped-by-zimbabwe-cricket/\">Sean Williams in rehab for drug addiction, dropped by Zimbabwe Cricket</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "04 Nov 2025"
        },
        {
            "title": "Operation Dudula’s conduct in schools and hospitals ruled unlawful",
            "url": "https://www.newzimbabwe.com/operation-dudulas-conduct-in-schools-and-hospitals-ruled-unlawful/",
            "content": "JOHANNESBURG Operation Dudulas has no right or power to prevent undocumented foreign national from accessing public healthcare and schools according to a ruling by the High Court in Johannesburg on Tuesday.\n\nThe Socio-Economic Rights Institute of South Africa brought the case to court on behalf of various groups.\n\nThe case calls the actions of the movement: harassment, intimidation, and targeting migrants.\n\nThe court ruled in SERIs favour, saying Operation Dudulas actions are unlawful and xenophobic.\n\nThe High Court in Johannesburg has interdicted them from blocking clinics and schools.\n\nSERIs litigation director,Nkosinathi Sithole said, This is an exciting moment, not only for our clients but for the South African constitution.\n\nConsidering what we have been seeing is dastardly criminal conduct by Operation Dudula of blocking people from facilities, including healthcare facilities, education, demanding identity documents of people in public: all of that has been declared unlawful and have been interdicted from doing so.\n\nThe court did not only talk about Operation Dudula, it spoke about the state as well. This includes the Minister of Police and the Minister of Home Affairs, to say that they too must make sure that they are not complacent in these acts of Operation Dudula.\n\nSithole said, the state cannot simply enter peoples homes and start doing raids. They need to have a search warrant, they need to have arrest warrants. In public, they need to have a clear, reasonable suspicion that someone is an undocumented foreign national before they can ask for such identity documents.\n\nOperation Dudula members outside the court said they would not be changing their stance and would do what needs to be done on the streets.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/10045549/Operation-Dudula-leader-Zandile-Dabula.jpeg",
            "description": "<p>JOHANNESBURG – Operation Dudula‘s has no right or power to prevent undocumented foreign national from accessing public healthcare and schools according to a ruling by the High Court in Johannesburg on Tuesday. The Socio-Economic Rights Institute of South Africa brought the case to court on behalf of various groups. The case calls the actions of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/operation-dudulas-conduct-in-schools-and-hospitals-ruled-unlawful/\">Operation Dudula’s conduct in schools and hospitals ruled unlawful</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "04 Nov 2025"
        },
        {
            "title": "Magaya’s wife granted US$500 bail in fraud case",
            "url": "https://www.newzimbabwe.com/magayas-wife-granted-us500-bail-in-fraud-case/",
            "content": "By Mary Taruvinga\n\nProphetic Healing and Deliverance (PHD) Ministries founder Walter Magayas wife, Tendai, has been granted US$500 bail by Harare magistrate Marewanazvo Gofa in a case she is accused of fraud.\n\nThe magistrate ruled that the State had failed to present compelling reasons to justify keeping her in custody.\n\nShe is jointly charged with her husband, Walter Magaya, and their company Planet Africa, represented by Tendai Chinguwa. The trio is accused of defrauding members of the public and congregants of PHD Ministries through a bogus housing and investment scheme.\n\nAccording to the State, the alleged scam saw the ministry and its associated companies receiving over US$50,000, R195,000, and ZW$1,000 from victims, none of which has been recovered.\n\nIn her ruling, Magistrate Gofa said that although Tendai Magaya faces a serious charge, this alone could not justify denying her bail.\n\nIn casu, the court finds that the submissions by the accused are plausible, Gofa said. The accused person is not a flight risk. If the State started investigating her in 2023, it shows she has been aware and could have fled to the UK, South Africa, or any other country, but she did not. Denying her bail given this would be tantamount to a travesty of justice; it defies common sense.\n\nThe magistrate added that any fears raised by the State could be adequately addressed through bail conditions.\n\nGofa described her as a good candidate for bail, noting that she has a fixed address and has not shown any intention to abscond. She was ordered to deposit US$500, surrender her passport, report once every two weeks at Waterfalls Police Station, reside at her current address, and not interfere with witnesses.\n\nShe was remanded to November 18, the same date as her husband, Walter Magaya.\n\nProsecutors allege that sometime in 2016, the accused misrepresented that they had acquired land in several areas across the country, including Chishawasha, Norton, Westgate, Mutare, Bulawayo, Kwekwe, Arcturus, Ruwa, Manyame, and Nyatsime, for housing, farming, bee-keeping, and mining projects meant to benefit church members and the public.\n\nDuring a church service that was also broadcast live on Yadah Television, it is alleged that they announced that God had instructed them to help members acquire residential stands and houses, claiming the projects would be managed through Planet Africa and Yadah Connect.\n\nPamphlets featuring Bible verses and images of the purported land and houses were distributed to lure followers.\n\nThe State further alleges that congregants were invited to buy stands and invest in various ventures, including mining and farming projects, with promises of a 50% return after six months. Many members reportedly paid thousands of dollars to the companies and signed memoranda of understanding falsely indicating that the firms had been allocated land by the Ministry of Local Government.\n\nIn 2017, after complaints began surfacing, the accused allegedly sought to restore confidence by entering into a one-season farming contract with former Reserve Bank of Zimbabwe governor Dr Gideon Gono at New Donnington Farm in Norton. They reportedly took congregants to the property, falsely claiming ownership and that it was ready for stand allocations, even though the farm belonged to Dr Gono and was not for sale.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/04104529/tendai-magaya-.jpg",
            "description": "<p>By Mary Taruvinga Prophetic Healing and Deliverance (PHD) Ministries founder Walter Magaya’s wife, Tendai, has been granted US$500 bail by Harare magistrate Marewanazvo Gofa in a case she is accused of fraud. The magistrate ruled that the State had failed to present compelling reasons to justify keeping her in custody. She is jointly charged with</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/magayas-wife-granted-us500-bail-in-fraud-case/\">Magaya’s wife granted US$500 bail in fraud case</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "04 Nov 2025"
        },
        {
            "title": "Magaya to remain in custody, magistrate rules overdetention does not warrant release",
            "url": "https://www.newzimbabwe.com/magaya-to-remain-in-custody-magistrate-rules-overdetention-does-not-warrant-release/",
            "content": "By Mary Taruvinga\n\nProphetic Healing and Deliverance Ministries founder Walter Magaya will remain behind bars after Harare magistrate Marewanazvo Gofa dismissed his application for immediate release.\n\nHe had filed his application together with his wife Tendai and employee Tendai Chinguwa.\n\nThe trio had argued they were unlawfully brought before the court after being detained beyond the 48-hour limit stipulated under Section 50 of the Constitution.\n\nGofa, however, ruled that while the three were indeed overdetained, the violation did not warrant their release.\n\nAll applicants were overdetained but such overdetention has no effect on their release. Accordingly, all accused have appeared before the courts they have remedies before other courts as alluded to by the state. Accordingly, application for immediate release of the accused due to overdetention is hereby dismissed, she ruled.\n\nThe magistrate said the trio could seek redress in the Constitutional Court, adding that the court was guided by the 2015 Mloyi and Madondo case.\n\nIn practice courts are guided by most recent case laws, she said, siding with the States position that the accuseds remedy lay elsewhere.\n\nGofa further ruled that no bail application would be entertained in relation to the rape case Magaya is facing. He was remanded in custody to November 13.\n\nHis lawyer, Admire Rubaya, said they would not seek bail for the separate fraud case at the magistrates court but would approach the High Court instead.\n\nMeanwhile, the defence team is now pursuing a bail application for Magayas wife, Tendai.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/14120808/magaya.gif",
            "description": "<p>By Mary Taruvinga Prophetic Healing and Deliverance Ministries founder Walter Magaya will remain behind bars after Harare magistrate Marewanazvo Gofa dismissed his application for immediate release. He had filed his application together with his wife Tendai and employee Tendai Chinguwa. The trio had argued they were unlawfully brought before the court after being detained beyond</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/magaya-to-remain-in-custody-magistrate-rules-overdetention-does-not-warrant-release/\">Magaya to remain in custody, magistrate rules overdetention does not warrant release</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "04 Nov 2025"
        },
        {
            "title": "CZI tips businesses to align prices with deflationary trends",
            "url": "https://www.newzimbabwe.com/czi-tips-businesses-to-align-prices-with-deflationary-trends/",
            "content": "By Alois Vinga\n\nThe Confederation of Zimbabwe Industries (CZI) has urged businesses to adapt to the emerging reality of sustained inflation decline and adjust their prices in line with the current deflationary trends.\n\nZimbabwes annual inflation, measured in the Zimbabwe Gold (ZiG) currency, fell sharply to 32.7% in October from 82.7% in September 2025, with analysts projecting a further drop to between 15% and 20% by December 2025.\n\nQuoting Ben Bernanke, former Chair of the U.S. Federal Reserve, CZI noted that deflationary patterns are not artificially induced but stem from underlying economic realities.\n\nThe sources of deflation are not a mystery. Deflation is in almost all cases a side effect of a collapse of aggregate demand a drop in spending so severe that producers must cut prices on an ongoing basis in order to find buyers, the industry lobby group said in its report.\n\nCZI highlighted that ZiG month-on-month inflation has been on a downward trajectory for three consecutive months, dropping to -0.4% in October 2025 from -0.2% in September 2025, the lowest inflation rate recorded so far this year.\n\nHowever, the organisation cautioned that local traders may remain hesitant to reduce prices due to historical fears of economic volatility. It warned that price stickiness, the resistance of market prices to decrease despite changes in the broader economy, could negatively impact market efficiency if left unchecked.\n\nDeflation, the CZI explained, means that goods and services are becoming cheaper in ZiG terms, which benefits consumers in the short term by increasing their purchasing power.\n\nIt also means that consumers who kept ZiG balances in their bank accounts are now able to purchase slightly more goods than what they could have bought in August 2025. If this momentum is maintained, it could significantly enhance confidence in the ZiG, said the CZI.\n\nThe industry body added that the steep fall in inflation largely reflects the fading effects of the September 2024 devaluation, which had sharply driven up the Consumer Price Index (CPI). With month-on-month inflation now well contained, CZI expects further easing in the coming months.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/02115157/zig.webp",
            "description": "<p>By Alois Vinga The Confederation of Zimbabwe Industries (CZI) has urged businesses to adapt to the emerging reality of sustained inflation decline and adjust their prices in line with the current deflationary trends. Zimbabwe’s annual inflation, measured in the Zimbabwe Gold (ZiG) currency, fell sharply to 32.7% in October from 82.7% in September 2025, with</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/czi-tips-businesses-to-align-prices-with-deflationary-trends/\">CZI tips businesses to align prices with deflationary trends</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "04 Nov 2025"
        },
        {
            "title": "South Africa outscore Zimbabwe in final, earn spot in WBSC U-23 Baseball World Cup 2026",
            "url": "https://www.newzimbabwe.com/south-africa-outscore-zimbabwe-in-final-earn-spot-in-wbsc-u-23-baseball-world-cup-2026/",
            "content": "The winners dominated the two-way round-robin against Zimbabwe and Benin and outscored Zimbabwe in the African Championship Game, becoming the 11th team to earn a spot in the WBSC U-23 Baseball World Cup 2026. Australia and Guam will compete for the 12th and final spot.\n\nWorld No. 26 South Africa defeated No. 77 Zimbabwe in the final, 21-1, to win the U-23 African Championship on home soil at the Boksburg Cardinals facility in Gauteng and claim Africas spot in theWBSC U-23 Baseball World Cup 2026.\n\nSouth Africa dominated the three-team and two-way round-robin, completing their campaign undefeated. Zimbabwe won their two games against Benin, one of the most recent baseball programmes to develop on the continent.\n\nIt is encouraging to see South Africa working alongside our international counterparts to further the development of baseball across Africa, commented South Africa Baseball Union President Marc Moreay. The WBSC Africa Championships have once again demonstrated the value of cooperation in advancing the sport on the continent.\n\nDAY 1\n\nZimbabwe-Benin 12-4South Africa-Benin 24-0 (5 innings)\n\nDAY 2\n\nSouth Africa-Zimbabwe 15-1South Africa-Benin 23-1\n\nDAY 3\n\nZimbabwe-Benin 12-5South Africa-Zimbabwe 19-4\n\nNicaragua will host the VI WBSC U-23 Baseball World Cup fromNovember 6 to 15, 2026. The WBSC U-23 Baseball World Cup is an evolution of the U-21 Baseball World Cup, hosted by the Chinese Taipei Baseball Association (CTBA) in 2014 in Taichung.\n\nThe Local Organising Committee has proposed three venues  Soberana National Stadium in Managua, the brand-new Roberto Clemente Stadium in Masaya, and Rigoberto Lpez Prez Stadium in Len  to host the tournament. The venues will be confirmed at a later stage.\n\nTen other teams have already qualified.\n\nNo. 16 Nicaragua have earned an automatic berth as the host nation.\n\nNo. 17 Great Britain and No. 15 Czechia secured Europes two tickets by finishing first and second, respectively, at theEuropean Championshipheld in Czechia this past August.\n\nNo. 1 Japan, No. 2 Chinese Taipei and No. 4 Korea qualified through theXXXI BFA Asian Championshipin September.\n\nIn October,No. 8 Panama, No. 7 Puerto Rico and No. 9 Cubaearned three of the four WBSC Americas spots in the North, Central America and Caribbean Qualifier, and World No. 5 Venezuela won theWBSC Americas Qualifier for the South America regionheld in Lima, Peru.\n\nThe winner of the WBSC Oceania Qualifier, a best-of-five series between Australia and Guam scheduled from November 6 to 9 at the Blacktown International Sportspark near Sydney, will complete the set of 12 participants.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/04030016/zim-SA-baseball.jpg",
            "description": "<p>WBSC The winners dominated the two-way round-robin against Zimbabwe and Benin and outscored Zimbabwe in the African Championship Game, becoming the 11th team to earn a spot in the WBSC U-23 Baseball World Cup 2026. Australia and Guam will compete for the 12th and final spot. World No. 26 South Africa defeated No. 77 Zimbabwe</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africa-outscore-zimbabwe-in-final-earn-spot-in-wbsc-u-23-baseball-world-cup-2026/\">South Africa outscore Zimbabwe in final, earn spot in WBSC U-23 Baseball World Cup 2026</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "04 Nov 2025"
        },
        {
            "title": "UN says 90% of cases in journalists’ murder cases go unresolved",
            "url": "https://www.newzimbabwe.com/un-says-90-of-cases-in-journalists-murder-cases-go-unresolved/",
            "content": "By Alois Vinga\n\nTHE UN High Commissioner for Human Rights, Volker Trk, says that worldwide 90% of cases involving the murder of journalists have gone unresolved amid calls for member states to put in place watertight measures to protect media practitioners.\n\nWhile Zimbabwe has recorded improvements in recent years, as shown by the countrys leap ten places up the Reporters Without Borders 2024 World Press Freedom Index, local journalists still face different types of persecution, including arbitrary arrests, harassment and intimidation prompted by a blend of a hostile legal framework.\n\nJournalists Blessed Mhlanga and Faith Zaba, both from Alpha Media Holdings (AMH), were recently arrested and detained in 2025 on charges of transmitting data messages inciting violence and undermining the authority of or insulting the President, respectively.\n\nAnother UNESCO 2025 report revealed that 63% of women journalists in Zimbabwe have experienced technology-facilitated gender-based violence (TFGBV), including hate speech and cyber harassment, contributing to self-censorship.\n\nOver the past decade, more than one thousand journalists have been killed, in both peacetime and war. In Gaza alone, my Office has documented the killing of 252 journalists since 7 October 2023. And in nearly nine out of ten cases, those who kill journalists around the world have not been brought to justice. This culture of impunity fuels further attacks and undermines freedom of expression, civic space, and ultimately, peace, Trk said.\n\nThe UN High Commissioner made the remarks in a video message to mark the International Day to End Impunity for Crimes against Journalists, which is commemorated annually on November 2.\n\nHe said journalists who expose injustice and give voice to the voiceless are human rights defenders, yet, across the globe, governments, corporations and criminals threaten, harass and detain them as well as subjecting them to arbitrary detention, to transnational repression, and even murder.\n\nThe UN official said the emergence of new journalisms have been weaponised to amplify abuse, distort reality, and intensify harm including deepfake sexual images, AI-generated defamatory content, and the amplification of misogynistic hate speech through algorithmic tools and bots.\n\nWomen journalists are targeted not only for their reporting, but also because of their gender. They face harassment, sexual violence, and coordinated online attacks designed to silence their voices and strengthen patriarchal norms. Nearly three in four women journalists report that they have been subjected to online violence. This may lead them to self-censor, to leave their jobs, or to live in fear, said Trk.\n\nThe UN official said his office is working to address these challenges by monitoring, documenting and reporting violations against journalists, including online, and advocating with States and technology companies guided by the dimensions of GBV online.\n\nStates have a legal obligation to prevent, investigate, and punish all attacks against journalists  including those that take place online. Technology companies also have responsibilities to respect human rights and to pursue accountability for people who use their platforms and products to perpetrate abuses.\n\nTo end impunity for crimes against journalists, we need stronger, more determined political will, better legal frameworks, and accountability mechanisms that respond to todays digital world, added Trk.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/04022728/Volker-Turk.jpg",
            "description": "<p>By Alois Vinga THE UN High Commissioner for Human Rights, Volker Türk, says that worldwide 90% of cases involving the murder of journalists have gone unresolved amid calls for member states to put in place watertight measures to protect media practitioners. While Zimbabwe has recorded improvements in recent years, as shown by the country’s leap</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/un-says-90-of-cases-in-journalists-murder-cases-go-unresolved/\">UN says 90% of cases in journalists’ murder cases go unresolved</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "04 Nov 2025"
        }
    ]
}