{
    "news": [
        {
            "title": "Former prosecutor jailed for soliciting US$200 bribe",
            "url": "https://www.newzimbabwe.com/former-prosecutor-jailed-for-soliciting-us200-bribe/",
            "content": "By Staff Reporter\n\nA FORMER public prosecutor has been jailed for demanding and receiving a US$200 bribe from an accused persons relative in order to facilitate a lenient sentence.\n\nBhekimpilo Moyo (35), who was stationed at Tredgold Magistrates Court, was sentenced to five years imprisonment for bribery, of which two years were suspended. He will therefore effectively serve three years behind bars.\n\nCourt heard Moyo solicited and received US$200 from complainant Betty House as an inducement to secure a non-custodial sentence for her brother, Bothwell House, who was facing a charge of malicious damage to property.\n\nIt was further averred that on July 10, 2024, Moyo later demanded an additional US$250, prompting the complainant to report him, leading to his immediate arrest.\n\nIn a statement following Moyos sentencing, the National Prospecting Authority of Zimbabwe (NPAZ) will not tolerate criminality or bribery within its ranks.\n\nMembers of the public are encouraged to report all members of the NPAZ of the justice system who solicit bribes, reads the NPAZ statement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg",
            "description": "<p>By Staff Reporter A FORMER public prosecutor has been jailed for demanding and receiving a US$200 bribe from an accused person’s relative in order to facilitate a lenient sentence. Bhekimpilo Moyo (35), who was stationed at Tredgold Magistrates Court, was sentenced to five years imprisonment for bribery, of which two years were suspended. He will</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/former-prosecutor-jailed-for-soliciting-us200-bribe/\">Former prosecutor jailed for soliciting US$200 bribe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "18 Jun 2025"
        },
        {
            "title": "Kwekwe farmer fined over threatening calls to miner",
            "url": "https://www.newzimbabwe.com/kwekwe-farmer-fined-over-threatening-calls-to-miner/",
            "content": "By Staff Reporter\n\nA KWEKWE farm owner has landed himself in trouble for making threatening phone calls to a minerwho invaded his property to prospect for minerals.\n\nMoses Mapanzure (54) of Mbizo, Kwekwe, appeared at Kwekwe Magistrates Court for contravening section 88 of the Postal and Telecommunications Act.\n\nThe prosecutor told the court that on March 19, 2025, at around mid-morning, complainant George Rusike, the proprietor of Donzic Mine in Kwekwe, received a call from the offender using his Econet line.\n\nDuring the ensuing conversation, Mapanzure shouted obscenities and threatened the complainant, demanding that he and his workers cease all mining activities at his farm.\n\nThe accused person further threatened to assault anyone caught working at the mine and to destroy the mines structures.\n\nMapanzure was fined US$150 or 30 days imprisonment in default of payment.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/29060624/kwekwe-mag.jpg",
            "description": "<p>By Staff Reporter A KWEKWE farm owner has landed himself in trouble for making threatening phone calls to a miner who invaded his property to prospect for minerals. Moses Mapanzure (54) of Mbizo, Kwekwe, appeared at Kwekwe Magistrates Court for contravening section 88 of the Postal and Telecommunications Act. The prosecutor told the court that on</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kwekwe-farmer-fined-over-threatening-calls-to-miner/\">Kwekwe farmer fined over threatening calls to miner  </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "18 Jun 2025"
        },
        {
            "title": "‘Zimbabwe gold-backed currency stable’ but investor doubts persist",
            "url": "https://www.newzimbabwe.com/zimbabwe-gold-backed-currency-stable-but-investor-doubts-persist/",
            "content": "Reuters\n\nZimbabwes gold-backed currency now has more than 100% reserve cover and is stable, according to the central bank, but doubts over its credibility remain, underscored by a persistent premium in the parallel market.\n\nThe Reserve Bank of Zimbabwe on Monday kept its benchmark rate unchanged at 35%, citing a stable exchange rate as one of the reasons, and reported total reserves of $701 million. The bank said the portion of transactions carried out using the Zimbabwe Gold (ZiG) currency surged to 43% in May from 26% in April 2024, the month it was introduced.\n\nDecades of economic instability and currency devaluations mean most people still use the United States Dollar for most purchases. But the authorities are hoping the ZiGs gold backing will give Zimbabweans the confidence to adopt it for everyday transactions.\n\nZiG is our national currency, and as the central bank, we are committed to ensuring its success by maintaining all the fundamental characteristics of sound money, including its function as a reliable store of value, Reserve Bank Governor John Mushayavanhu wrote in response to Reuters questions.\n\nThe Reserve Bank has learned from previous currency failures that maintaining optimum money supply and ensuring monetary stability is vital, he added.\n\nDespite the banks assurances, the gap between the official exchange rate and parallel market rate remains about 20%.\n\nThe rate has been stable for more than three months, said Black-Market Trader Pearson Tambudze, attributing the stability to a scarcity of the local currency rather than restored confidence.There isnt a lot of ZiG in the market, he said.\n\nThe International Monetary Fund has welcomed the ZiGs stability but is urging Zimbabwe to adopt tighter money-growth limits, a more transparent foreign exchange market and to make progress on clearing an estimated $12.2 billion in external arrears.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/02115157/zig.webp",
            "description": "<p>Reuters Zimbabwe’s gold-backed currency now has more than 100% reserve cover and is stable, according to the central bank, but doubts over its credibility remain, underscored by a persistent premium in the parallel market. The Reserve Bank of Zimbabwe on Monday kept its benchmark rate unchanged at 35%, citing a stable exchange rate as one</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-gold-backed-currency-stable-but-investor-doubts-persist/\">‘Zimbabwe gold-backed currency stable’ but investor doubts persist</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "18 Jun 2025"
        },
        {
            "title": "There is enough ZWG supply – RBZ says as traders flag banknotes shortages",
            "url": "https://www.newzimbabwe.com/there-is-enough-zwg-supply-rbz-says-as-traders-flag-banknotes-shortages/",
            "content": "By Alois Vinga\n\nThe Reserve Bank of Zimbabwe (RBZ) says adequate stocks of ZWG notes are available to meet the current trade demands across the key economic sectors.\n\nThe announcements come at a time when the majority of citizens outside the capital of Harare have never felt the texture of the ZWG notes. In provinces such as Bulawayo and the Midlands, up to Beitbridge, traders have resorted to the use of US$ and the South African Rand as change due to the scarcity of ZWG notes.\n\nEven in Harare, citizens continue to struggle to access the local unit in hard cash for transactional purposes. As a result, the ZWG accessibility problems, which characterised the local unit since its launch on April 5 2024 have persisted for more than a year, prompting analysts to blame such a tight grip for the eroding confidence in the currency.\n\nIn a recent statement, RBZ governor Dr John Mushayavanhu said he had noted concerns coming from the transacting public relating to the availability of ZWG cash and its usage, particularly from areas outside Harare.\n\nThe RBZ wishes to advise that usage of the local currency, ZWG, has improved significantly in the economy. Precisely, the proportion of local currency settlements on the National Payment System from ZWG7,86 billion in April 2024 to ZWG56,8 billion (43%) as at May 30 2025. In tandem, the Reserve Bank has been disbursing adequate cash to banks in line with demand.\n\nAs at June 12 2025, the total ZWG deposits in the economy amounted to about ZWG16 billion, of which over ZWG207 million was cash held by banks, which meets optimal requirements and is sufficient to support daily deposits and withdrawals by the public, he said.\n\nMushayavanhu said the central bank is currently working with banking institutions to ensure the wider availability and distribution of ZWG cash through banking halls and Automated Teller Machines (ATMs).\n\nThe prevailing currency and exchange rate stability , coupled with measures being taken by the government to increase the usage of ZWG in the economy is expected to result in increased usage of the local currency in both electronic and physical form, he added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171609/mushayavanhu-zig-4.jpg",
            "description": "<p>By Alois Vinga The Reserve Bank of Zimbabwe (RBZ) says adequate stocks of ZWG notes are available to meet the current trade demands across the key economic sectors. The announcements come at a time when the majority of citizens outside the capital of Harare have never felt the texture of the ZWG notes. In provinces</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/there-is-enough-zwg-supply-rbz-says-as-traders-flag-banknotes-shortages/\">There is enough ZWG supply – RBZ says as traders flag banknotes shortages</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "18 Jun 2025"
        },
        {
            "title": "After Harare City Council probe, government hints at Commission of Inquiry into Bulawayo’s operations",
            "url": "https://www.newzimbabwe.com/after-harare-city-council-probe-government-hints-at-commission-of-inquiry-into-bulawayos-operations/",
            "content": "By Darlington Gatsi\n\nAS the Commission of Inquiry probing the operations of the Harare City Council wrapped up and submitted its findings, the government has hinted that a similar approach could be replicated for other local authorities, with Bulawayo identified as being riddled with maladministration.\n\nThe Commission, which was chaired by retired judge Justice Maphios Cheda, on Tuesday submitted its report to President Emmerson Mnangagwa after a year-long investigation into the Harare City Council.\n\nThe Commission uncovered the shortcomings of the Harare City Council, which is dogged by corruption, resulting in poor service delivery in the capital.\n\nSpeaking after the presentation of the report at State House on Tuesday, the Minister of Local Government, Daniel Garwe, said local authorities are plagued by decay stemming from poor governance.\n\nThat is why the President has put in place a Commission of Inquiry, it is born out of the decay in the way our local authorities, especially our urban authorities, are being run. Harare City Council is number one, and Bulawayo City Council is number two going forward.\n\nI do not know yet, but we have made the recommendation that we need to have a thorough investigation of all our urban local authorities because there is a lot of decay, said Garwe.\n\nDuring the hearings, which were conducted over a period of nine months, the Jacob Mafume-led council was exposed for its extravagance, with officials taking home hefty perks.\n\nThis is despite the council bemoaning a shortage of funds in its operations, which has seen it failing to provide basics to residents.\n\nA clean-up is expected to be conducted at Town House once President Mnangagwa has reviewed the report and its recommendations.\n\nWith the findings remaining confidential for now, Garwe said his ministry now awaits further instructions from President Mnangagwa.\n\nThey have finished the report. The chairman and myself, as the Minister of Local Government, have come to present the report.\n\nThe details of the report cannot be disclosed today because the President has to go through the report, sit down, finalise it, and give us the way forward, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/11/11180630/Daniel-Garwe-Minister-of-National-Housing-and-Social-Ammenities.jpg",
            "description": "<p>By Darlington Gatsi AS the Commission of Inquiry probing the operations of the Harare City Council wrapped up and submitted its findings, the government has hinted that a similar approach could be replicated for other local authorities, with Bulawayo identified as being riddled with maladministration. The Commission, which was chaired by retired judge Justice Maphios</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/after-harare-city-council-probe-government-hints-at-commission-of-inquiry-into-bulawayos-operations/\">After Harare City Council probe, government hints at Commission of Inquiry into Bulawayo’s operations</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "18 Jun 2025"
        },
        {
            "title": "Zimbabwe embraces smart city technology to tame traffic offences",
            "url": "https://www.newzimbabwe.com/zimbabwe-embraces-smart-city-technology-to-tame-traffic-offences/",
            "content": "By Darlington Gatsi\n\nTHE government has approved the implementation of the Smart City concept, which aims to curb traffic offences and reduce road accidents.\n\nThe Smart City initiative will be rolled out by telecommunications company TelOne.\n\nThe system will incorporate Artificial Intelligence (AI), including components such as cameras with automatic number plate and facial recognition capabilities.\n\nSpeaking at a post-Cabinet media briefing,Tuesday, the Minister of Information said the home-grown system would address traffic violations using modern technology.\n\nThe government is set to accelerate the implementation of a Home-Grown Smart Traffic Management System, after Cabinet approved the rollout of a proof of concept in 2020, which was subsequently utilised during the COVID-19 period and thereafter.\n\nThis is meant to address unwarranted traffic congestion, road accidents, and traffic law violations. This innovative system utilises advanced technologies such as the Internet of Things (IoT), Artificial Intelligence (AI), and big data analytics to enhance traffic flow, road safety, and transparency, said Muswere.\n\nZimbabwe has lagged behind in addressing traffic violations, with offenders often escaping punishment due to an archaic ticketing system.\n\nHowever, given Zimbabwes ongoing power and internet challenges, there is scepticism over the feasibility of the systems success in the country.\n\nMuswere added that the system would be implemented in phases, starting with Harare and Bulawayo.\n\nThe Home-Grown Traffic Management System will be rolled out in phases, commencing with Harare and Bulawayo, followed by other major towns. To support effective implementation, several key enablers will be monitored, including a robust project governance framework, reliable power sources, stable internet connectivity, and strategic system integration with supporting platforms and institutions.\n\nSpecialised courts will assist in expediting justice delivery as the system operates. This localised approach is expected to foster knowledge transfer, skills development, and national pride while promoting self-reliance and sustainability, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/09054809/muswere.jpeg",
            "description": "<p>By Darlington Gatsi THE government has approved the implementation of the Smart City concept, which aims to curb traffic offences and reduce road accidents. The Smart City initiative will be rolled out by telecommunications company TelOne. The system will incorporate Artificial Intelligence (AI), including components such as cameras with automatic number plate and facial recognition</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-embraces-smart-city-technology-to-tame-traffic-offences/\">Zimbabwe embraces smart city technology to tame traffic offences</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "18 Jun 2025"
        },
        {
            "title": "Uganda leader signs new law allowing military trials for civilians",
            "url": "https://www.newzimbabwe.com/uganda-leader-signs-new-law-allowing-military-trials-for-civilians/",
            "content": "BBC\n\nUgandas President Yoweri Museveni has signed into law an amendment that will allow, once again, civilians to be tried in a military court under certain circumstances.\n\nA previous law permitting such trials was ruled unconstitutional by the Supreme Court in January.\n\nBefore that ruling,civilians could be taken to a military tribunal if they had been found with military equipmentlike guns or army uniforms. Activists had complained that the law was used to persecute government critics.\n\nParliamentarians passed the amendment last month amid a heavy police presence and a boycott by opposition lawmakers, who argued that it violated the ruling by the countrys highest court.\n\nIn January, the judges said that the military courts were neither impartial nor competent to exercise judicial functions, the International Society for Human Rights reported at the time.\n\nThe amendment appears to try and address some of the issues.\n\nIt says that those presiding over the tribunals should have relevant legal qualifications and training. It also says that while performing their legal functions they should be independent and impartial.\n\nBut civilians can still be transferred if found with military hardware.\n\nThe law will deal decisively with armed violent criminals, deter the formation of militant political groups that seek to subvert democratic processes, and ensure national security is bound on a firm foundational base. If it aint broke, dont fix it!, army spokespersonCol Chris Magezi wrote on X after the bill was passed by MPs.\n\nBut opposition leader Bobi Wine said the law would be used against him and others.\n\nAll of us in the opposition are being targeted by the act, he told the AFP news agency.\n\nThe Uganda Law Society, a professional body that represents the countrys lawyers, has said it will challenge the constitutionality of the amendment.\n\nFor years, activists had argued that the military courts were being used by the government to silence dissidents, with people alleging that evidence had been planted.\n\nIf you are a political opponent then they will find a way of getting you under the military court and then you know your fate is sealed once there, justice will never visit your door, human rights lawyer Gawaya Tegulle told the BBCs Focus on Africa podcast in February.\n\nHe added that people can spend years in detention on remand as the courts await decisions from senior military figures, which may never come, and those who are tried and found guilty face harsher penalties than in civilian courts.\n\nA recent high-profile case followed Novembers arrest of long-time leading opposition figure Kizza Besigye. He was picked up in neighbouring Kenya, taken across the border and then charged in a military court with possession of pistols and attempting to purchase weapons abroad, which he denied.\n\nThose charges were dropped, and replaced with others, when his case was transferred to a civilian court following the Supreme Court ruling.\n\nMuseveni, who has been in power since 1986,described the verdict as the wrong decision, adding that the country is not governed by the judges. It is governed by the people.\n\nHe hadpreviously defended the use of military courtssaying that they dealt with the rampant activities of criminals and terrorists that were using guns to kill people indiscriminately.\n\nHe said that civilian courts were too busy to handle these gun-wielding criminals quickly.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/03/15204718/Yoweri-Museveni-1.webp",
            "description": "<p>BBC Uganda’s President Yoweri Museveni has signed into law an amendment that will allow, once again, civilians to be tried in a military court under certain circumstances. A previous law permitting such trials was ruled unconstitutional by the Supreme Court in January. Before that ruling, civilians could be taken to a military tribunal if they had</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uganda-leader-signs-new-law-allowing-military-trials-for-civilians/\">Uganda leader signs new law allowing military trials for civilians</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "18 Jun 2025"
        },
        {
            "title": "AMH journalist Blessed Mhlanga’s trial in false start again",
            "url": "https://www.newzimbabwe.com/amh-journalist-blessed-mhlangas-trial-in-false-start-again/",
            "content": "By Staff Reporter\n\nThe trial of Alpha Media Holdings (AMH) journalist Blessed Mhlanga, accused of transmitting data messages inciting violence, failed to start again on Tuesday after the presiding magistrate failed to show up due to poor health.\n\nMagistrate Learnmore Mapiye is presiding over the hearing with Mhlanga now jointly charged with his employer, Heart & Soul TV (HSTv), a subsidiary of AMH.\n\nTrial is now expected to begin on July 17.\n\nMhlanga and his employer are being charged under Section 164 of the Criminal Law (Codification and Reform) Act, but were arrested separately.\n\nThe journalist was arrested in February this year and spent 72 days in pretrial detention.\n\nHe was granted US$500 bail by High Court Judge Justice Gibson Mandaza on his third freedom bid.\n\nMhlanga landed in the dock after HSTV published a press conference by Zanu PF war veteran Blessed Geza, who was calling for President Emmerson Mnangagwas resignation. Geza is currently in hiding.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26061950/Blessed-Mhlanga.png",
            "description": "<p>By Staff Reporter The trial of Alpha Media Holdings (AMH) journalist Blessed Mhlanga, accused of transmitting data messages inciting violence, failed to start again on Tuesday after the presiding magistrate failed to show up due to poor health. Magistrate Learnmore Mapiye is presiding over the hearing with Mhlanga now jointly charged with his employer, Heart</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/amh-journalist-blessed-mhlangas-trial-in-false-start-again/\">AMH journalist Blessed Mhlanga’s trial in false start again</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "18 Jun 2025"
        }
    ]
}