{
    "news": [
        {
            "title": "Zimbabwe harvests 578,000 tonnes of wheat, surpassing national demand",
            "url": "https://www.newzimbabwe.com/zimbabwe-harvests-578000-tonnes-of-wheat-surpassing-national-demand/",
            "content": "Milling MEA\n\nZIMBABWEhas recorded its highest-ever wheat output, harvesting 578,059 metric tonnes during the 2025 winter season, a milestone that not only exceeds last years record but also surpasses the countrys annual wheat requirement.\n\nLands, Agriculture, Fisheries, Water and Rural Development Minister Anxious Masuka announced the achievement, describing it as a confirmation of Zimbabwes strengthened agricultural capacity and food self-sufficiency.\n\nThe country now joinsEthiopiaas one of only two African nations to have achieved full wheat self-sufficiency.\n\nFrom a modest volume of 94,685 metric tonnes in 2019, to 562,091 metric tonnes in 2024, Zimbabwe is only one of two jurisdictions on the African continent that have become wheat self-sufficient, said Masuka.\n\nHe added that this years production already surpasses our national annual requirement, estimated at 360,000 metric tonnes.\n\nMasuka noted that production continues to rise steadily, supported by expanded irrigation, input support, and government-backed mechanisation programmes.\n\nThe 2025 season saw 122,566 hectares planted to wheat, of which an additional 12,023 hectares were still to be harvested by early November. This marks a 511% increase from 2019 levels, a remarkable turnaround in just six years.\n\nThe expansion aligns with Zimbabwes broader strategy to reduce dependence on imports, especially following the global grain price spikes triggered by theRussiaUkraineconflict.\n\nWheatis the countrys second most important cereal after maize, and domestic self-sufficiency is seen as critical to stabilising food prices and strengthening food security.\n\nFocus on export opportunities and market stability\n\nWith domestic needs fully met, Zimbabwe is now seeking export opportunities within the region, particularly in neighboring countries that continue to face wheat shortages.\n\nHowever, Masuka emphasized that local supply remains secure and that the government has taken measures to stabilise pricing and ensure smooth distribution.\n\nThe government has released 6,518 metric tonnes to millers in recent weeks to stabilise supply and pricing levels of wheat products, he said, noting that the Agricultural Marketing Authority (AMA) continues to coordinate marketing and distribution to maintain market balance.\n\nDespite the surplus, Zimbabwe will continue importing limited volumes of high-gluten wheat, which is preferred by some millers for specific bread formulations.\n\nCertain millers have indicated that their mills and bread styles require high gluten content wheat not achievable in locally produced wheat, Masuka explained.\n\nAccording to him, as per current policy, such wheat will continue to be imported under existing arrangements, without any additional costs.\n\nThe government is urging registered millers and industry players to collaborate closely with authorities under the AMA framework to ensure a consistent balance between production, demand, and market stability.\n\nZimbabwes wheat success story reflects years of deliberate investment in irrigation infrastructure, farmer training, and private-sector partnerships.\n\nAccording to the Food and Agriculture Organization (FAO), sub-SaharanAfricastill imports over 80% of its wheat consumption, underscoring Zimbabwes rare achievement in the region.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/02/17093132/60d3955786e36.image_.jpg",
            "description": "<p>Milling MEA ZIMBABWE has recorded its highest-ever wheat output, harvesting 578,059 metric tonnes during the 2025 winter season, a milestone that not only exceeds last year’s record but also surpasses the country’s annual wheat requirement. Lands, Agriculture, Fisheries, Water and Rural Development Minister Anxious Masuka announced the achievement, describing it as a confirmation of Zimbabwe’s strengthened</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-harvests-578000-tonnes-of-wheat-surpassing-national-demand/\">Zimbabwe harvests 578,000 tonnes of wheat, surpassing national demand</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "30 Oct 2025"
        },
        {
            "title": "Businessman Fabris told to live with lawyer’s negligence as court slams bid to overturn US$500,000 default judgment",
            "url": "https://www.newzimbabwe.com/businessman-fabris-told-to-live-with-lawyers-negligence-as-court-slams-bid-to-overturn-us500000-default-judgment/",
            "content": "By Mary Taruvinga\n\nThe High Court has dismissed businessman Luka Ignatius Fabriss bid to overturn a US$500,000 default judgment granted in favour of Tendai Mashamhanda, ruling that Fabris must face the consequences of his lawyers negligence.\n\nJustice Jacob Manzunzu threw out Fabriss application for rescission of judgment, which sought to undo the ruling granted after he failed to respond to Mashamhandas lawsuit over an unpaid loan, describing his explanation as unreasonable and his defence as devoid of bona fides.\n\nThe applicant cannot entirely put the blame on his erstwhile legal practitioner because he too had a lackadaisical approach towards the case, said Justice Manzunzu.\n\nHe went into a deep slumber only to be awakened by the execution in September 2024.\n\nFabris had borrowed US$500,000 from Mashamhanda in December 2021, agreeing to repay the sum by February 2022 with 1% monthly interest. When he defaulted, Mashamhanda sued and obtained a default judgment in May 2024 after Fabris and his lawyer ignored several letters and court notices.\n\nThe businessman argued that his former lawyer, Alex Mambosasa, failed to file a plea because he was in South Africa and had left the parties to negotiate an out-of-court settlement. But the court found that documents had been both emailed and hand-delivered to the lawyers office, which confirmed receipt, making the excuse untenable.\n\nNo reason is given to suggest he was not in wilful default, said Justice Manzunzu. With the advent of the IECMS system, absence from the country can no longer be an excuse for failure to file a plea. Technology allows a lawyer in South Africa to file court documents from that location.\n\nThe judge emphasised that there was a limit to how far courts could sympathise with litigants blaming their lawyers negligence.\n\nTime has come when our courts should be slow in sympathising with litigants who fail to comply with the rules due to lack of diligence by their legal representatives, he ruled. Applicant made his choice of a legal representative and he must stand by his choice.\n\nJustice Manzunzu also questioned Fabriss claim that he had a solid defence, noting that his earlier correspondence with Mashamhanda contained admissions of liability and proposals to settle the debt through shares in his mining company, Hotburn Minerals (Pvt) Ltd.\n\nThis is incongruent with a party who denies liability, the judge said. The applicants conduct shows wilfulness and absence of prospects of success.\n\nFinding the rescission application to be a mere delaying tactic, the judge ordered Fabris to pay costs on a higher scale, citing the respondents unnecessary expenses caused by Fabriss negligence.\n\nThe respondent has been put out of pocket by the applicants conduct, he said. The circumstances of this case warrant the granting of costs on a higher scale.\n\nThe ruling means the default judgment stands, and Mashamhanda may proceed with execution to recover the US$500,000 loan plus interest and legal costs from Fabris.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/23060127/high-court.jpg",
            "description": "<p>By Mary Taruvinga The High Court has dismissed businessman Luka Ignatius Fabris’s bid to overturn a US$500,000 default judgment granted in favour of Tendai Mashamhanda, ruling that Fabris must face the consequences of his lawyer’s negligence. Justice Jacob Manzunzu threw out Fabris’s application for rescission of judgment, which sought to undo the ruling granted after</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/businessman-fabris-told-to-live-with-lawyers-negligence-as-court-slams-bid-to-overturn-us500000-default-judgment/\">Businessman Fabris told to live with lawyer’s negligence as court slams bid to overturn US$500,000 default judgment</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "30 Oct 2025"
        },
        {
            "title": "‘Zimbabwe is not a papacy’: Zanu PF insists Vice President Chiwenga is not anointed successor",
            "url": "https://www.newzimbabwe.com/zimbabwe-is-not-a-papacy-zanu-pf-insists-vice-president-chiwenga-is-not-anointed-successor/",
            "content": "By Jonisayi Maromo, IOL\n\nZimbabwes ruling ZanuPF has publicly dismissed assertions thatthe push to extend President Emmerson Mnangagwas termis a covert move to sideline or signal no confidence in Vice President Constantino Chiwenga.\n\nZanuPF national spokesperson and former ambassador to China, Christopher Hatikure Mutsvangwa, insisted that Chiwenga is not entitled to replace Mnangagwa automatically and that any suggestion of anointment is misplaced.\n\nIt is not that we do not want him (Chiwenga). He can declare his candidacy. There is no provision in the Zimbabwean constitution that the vice president is the automatic leader of the country afterwards. We go to elections, and people vote in Zimbabwe for the leadership. So he needs to be voted.\n\nThis is not a papacy. This is not cardinals in Rome, sitting in a cabal, deciding that this is going to be the person succeeding the pope. This is a democratic country, and people go to elections. If he wants, he can declare his candidacy for elections in the party or outside the party and do the test of the vote. This effort of someone being anointed for whatever reason, it is totally against the tenets of democratic governance, Mutsvangwa told SABC News.\n\nMutsvangwa said Chiwenga is not the only politician aspiring for higher office in Zimbabwe.\n\nWhy this particular preoccupation with this particular person, except that there are some people who feel that he should be anointed as the leader of Zimbabwe. This is not a papacy. This is a democratic, constitutionally-run country, Mutsvangwa insisted.\n\nMnangagwa has previously said he is a constitutionalist and would step down in 2028.\n\nThe resolution has drawn a mixed response. Opposition activists and civil society figures have warned the move risks entrenching authoritarian tendencies. Some analysts say the extension could be framed domestically as necessary for continuity while simultaneously raising concerns among donors and regional partners about democratic backsliding.\n\nZimbabweans in the diaspora  including those living in South Africa  have also voiced unease. In interviews with IOL, some critics argued the extension reveals ZanuPFs reluctance to allow a generational leadership change, while supporters countered that stability and economic recovery require continuity at the top.\n\nLast week,former Zanu PF bigwig and cabinet minister Saviour Kasukuwererubbished the former liberation movements bold plans to extend Mnangagwas term of office to 2030, warning that the move will end badly for both the president and Zimbabwe.\n\nSpeaking to IOL, Kasukuwere said:He (Mnangagwa) is dreaming and he has set himself up for a gigantic failure. Greediness knows no boundaries, and this will lead to a huge disaster for the country.\n\nZanu PF has emboldened its move to push through the proposal allowing Mnangagwa to remain in powerbeyond his current constitutional term, which ends in 2028. The party recently adopted a resolution at its annual conference backing the extension to align with the governments so-called Vision 2030 development agenda.\n\nKasukuwere, once a senior figure in the Zanu PF government led by Robert Mugabe before going into exile during the 2017 military intervention, became one of the most prominent former insiders to condemn the partys Mnangagwa plan publicly.\n\nThe political debate in South Africa is further complicated by rising antiimmigrant sentiment and calls by some local groups for Zimbabwean migrants to return home. Observers warn that prolonged political uncertainty in Harare could exacerbate tensions in host communities across the region.\n\nIf ZanuPF moves ahead, the party would refer the resolution to parliament  where, with its twothirds majority, it could initiate the constitutional amendment process. That would likely trigger legal and political challenges from opposition parties and civil society, and could prompt increased scrutiny from regional bodies such as SADC and the AU.\n\nWhether Mnangagwas extension will be presented as a caretaker continuity measure or a hard political move to shape succession remains the central political question for the months ahead.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/13054207/Chiwenga-Mnangagwa.png",
            "description": "<p>By Jonisayi Maromo, IOL Zimbabwe’s ruling Zanu‑PF has publicly dismissed assertions that the push to extend President Emmerson Mnangagwa’s term is a covert move to sideline or signal no confidence in Vice President Constantino Chiwenga. Zanu‑PF national spokesperson and former ambassador to China, Christopher Hatikure Mutsvangwa, insisted that Chiwenga is not entitled to replace Mnangagwa automatically and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-is-not-a-papacy-zanu-pf-insists-vice-president-chiwenga-is-not-anointed-successor/\">‘Zimbabwe is not a papacy’: Zanu PF insists Vice President Chiwenga is not anointed successor</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "30 Oct 2025"
        },
        {
            "title": "Nigerian Nobel laureate Wole Soyinka says US revoked his visa",
            "url": "https://www.newzimbabwe.com/nigerian-nobel-laureate-wole-soyinka-says-us-revoked-his-visa/",
            "content": "BBC\n\nNigerian Nobel laureate Wole Soyinka has said the US revoked his visa and banned him from the country.\n\nThe 91-year-old author, who won the Nobel Prize for literature in 1986, said the US consulate asked him to bring in his passport so his visa could be cancelled in person as new unspecified information had come to light.\n\nSoyinka called the invitation a rather curious love letter from an embassy in a news conference held on Tuesday and told organisations hoping to invite him to the US not to waste their time.\n\nThe US embassy in Nigeria has said it cannot comment on individual cases.\n\nThe Nobel laureate has previously held permanent residency in the US but renounced it in 2016, tearing up his green card in protest of President Donald Trumps election.\n\nThe green card is a permanent residence permit for the US  prized by many African immigrants to the US.\n\nSoyinka affirmed on Tuesday that he no longer had his green card  and jokingly added that it had fallen between the fingers of a pair of scissors and it got cut into a couple of pieces.\n\nThe famed author has had regular teaching engagements at US universities for the past 30 years.\n\nI have no visa. I am banned, he said on Tuesday.\n\nSoyinka has long been critical of the Trump administrations radical stance on immigration and linked the visa revocation to his outspoken criticism.\n\nHe said his recent comparison of Trump to Ugandas dictator  Idi Amin in white face  may have contributed to the current situation.\n\nWhen I called Donald Trump Idi Amin, I thought I was paying him a compliment, Soyinka said, hes been behaving like a dictator.\n\nIdi Amin was a Ugandan military officer and dictator who ruled the country from 1971 to 1979, infamous for his brutal regime and widespread human rights abuses.\n\nWhen asked if he would consider going back to the US, Soyinka said: How old am I?\n\nIn July, the US State Department announced sweeping changes to its non-immigrant visa policy for citizens of Nigeria and several other African countries.\n\nAccording to the policy, nearly all non-immigrant and non-diplomatic visas issued to Nigerians and nationals of Cameroon, Ethiopia and Ghana would now be single-entry and valid for only three months, rolling back the up to five-year, multiple-entry visas they had enjoyed previously.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/29122653/wole-soyinka.webp",
            "description": "<p>BBC Nigerian Nobel laureate Wole Soyinka has said the US revoked his visa and banned him from the country. The 91-year-old author, who won the Nobel Prize for literature in 1986, said the US consulate asked him to bring in his passport so his visa could be cancelled in person as new unspecified information had</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nigerian-nobel-laureate-wole-soyinka-says-us-revoked-his-visa/\">Nigerian Nobel laureate Wole Soyinka says US revoked his visa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "30 Oct 2025"
        },
        {
            "title": "ZETDC Managing Director suspended over power outage during Mnangagwa’s SONA",
            "url": "https://www.newzimbabwe.com/zetdc-managing-director-suspended-over-power-outage-during-mnangagwas-sona/",
            "content": "By Thandiwe Garusa\n\nThe Zimbabwe Electricity Supply Authority (ZESA) has suspended Zimbabwe Electricity Transmission and Distribution Company (ZETDC) acting Managing Director Abel Gurupira pending investigations into recent power failures that occurred during key events, including President Emmerson Mnangagwas State of the Nation Address (SONA) in Parliament on Tuesday.\n\nGurupiras suspension follows the embarrassing incident in which Mnangagwa was forced to complete his SONA using torchlight after an unexpected blackout plunged the new Parliament Building into darkness.\n\nPower was restored approximately ten minutes later, just after Mnangagwa had concluded his address.\n\nFollowing the incident, Speaker of Parliament Jacob Mudenda hinted at possible sabotage, warning that the culprit will regret the day they were born.\n\nParliament later issued a statement explaining that during the event, the building was running on generator power, with ZESA electricity on standby. However, a circuit breaker supplying the load tripped, resulting in the blackout.\n\nIn an internal memo seen by this publication, ZESA Group Chief Executive Officer Cletus Nyachowe informed Gurupira of his immediate suspension pending a full investigation.\n\nI am hereby suspending you from duty pending investigations, following a spate of power outages prior to the commencement of the ZANU PF Conference in Mutare and during the State of the Nation Address in Parliament on the 28th of October 2025, Nyachowe wrote.\n\nThe correspondence stated that Gurupira would remain on full pay and benefits during the suspension period.\n\nDuring the period of suspension, you are not to communicate with any ZESA Holdings Group staff, Nyachowe added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/16170029/ZETDC-Gurupira.jpeg",
            "description": "<p>By Thandiwe Garusa The Zimbabwe Electricity Supply Authority (ZESA) has suspended Zimbabwe Electricity Transmission and Distribution Company (ZETDC) acting Managing Director Abel Gurupira pending investigations into recent power failures that occurred during key events, including President Emmerson Mnangagwa’s State of the Nation Address (SONA) in Parliament on Tuesday. Gurupira’s suspension follows the embarrassing incident in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zetdc-managing-director-suspended-over-power-outage-during-mnangagwas-sona/\">ZETDC Managing Director suspended over power outage during Mnangagwa’s SONA</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "30 Oct 2025"
        }
    ]
}