{
    "news": [
        {
            "title": "Maswanhise on target as Motherwell secures Premier Sports Cup semi-finals spot",
            "url": "https://www.newzimbabwe.com/maswanhise-on-target-as-motherwell-secures-premier-sports-cup-semi-finals-spot/",
            "content": "By Sports Reporter\n\nWarriors midfielder Tawanda Maswanhise was on target as his side Motherwell cruised past Dundee with a 2-0 victory in the Scottish Premier Sports Cup quarter-final match played on Wednesday evening.\n\nThe win saw Motherwell book their place in the semi-finals, ending Dundees run in the tournament.\n\nMaswanhise opened the scoring in the 42nd minute, slotting home a low cross from Emmanuel Longelo to hand his side a 1-0 lead at halftime.\n\nThe Zimbabwean forward nearly doubled the advantage in the 57th minute after capitalising on a defensive error, but his weak effort failed to trouble the Dundee goalkeeper.\n\nMotherwell eventually sealed the result in the 77th minute through Elliot Watt, who struck from 20 yards to make it 2-0.\n\nMaswanhise has been a revelation for Motherwell this season, with the Zimbabwean international now boasting nine goals in all competitions as the club celebrates a long-awaited return to the semi-finals.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/14164801/tawanda-maswanhise.jpeg",
            "description": "<p>By Sports Reporter Warriors midfielder Tawanda Maswanhise was on target as his side Motherwell cruised past Dundee with a 2-0 victory in the Scottish Premier Sports Cup quarter-final match played on Wednesday evening. The win saw Motherwell book their place in the semi-finals, ending Dundee’s run in the tournament. Maswanhise opened the scoring in the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/maswanhise-on-target-as-motherwell-secures-premier-sports-cup-semi-finals-spot/\">Maswanhise on target as Motherwell secures Premier Sports Cup semi-finals spot</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:34",
            "date": "31 Oct 2025"
        },
        {
            "title": "Mliswa takes aim at Chiwenga’s wife – accuses her of sabotaging Mnangagwa, says she should quit army position",
            "url": "https://www.newzimbabwe.com/mliswa-takes-aim-at-chiwengas-wife-accuses-her-of-sabotaging-mnangagwa-says-she-should-quit-army-position/",
            "content": "By Darlington Gatsi\n\nDEPUTY President Constantino Chiwengas wife, Minoyothabo Baloyi, has been drawn into the ZANU PF succession fight, with Temba Mliswa accusing her of using her military position to sabotage President Emmerson Mnangagwa.\n\nMliswa, who has made Chiwenga the centre of his attacks, has now taken aim at Miniyothabo, whom he accuses of misusing her position in the army to further her husbands ambitions.\n\nThe problem that we have which I must say to the nation, is that we also have the wife of the Vice President, who is part of the intelligence of the army which is MID. That being the case, she certainly has the interests of her husband. We know the interests. We know how eager he is to become the president of the country; in so doing, she will serve the interests of her husband and not the country, said Mliswa.\n\nMliswas tirade against her follows an embarrassing power outage at the new Parliament Building, which forced President Emmerson Mnangagwa to complete his State of the Nation Address (SONA) using torchlight.\n\nMliswa says the hiccup was not a coincidence but sabotage against Mnangagwa.\n\nThe former Norton legislator accuses Miniyothabo of establishing a parallel structure within the military ranks.\n\nShe is running a parallel structure and it is important that the President knows. My expos of my passport and my boarding card, which was done on social media by Ali Naka, came through her. She has been doing that. What is also important is that the commander of MID certainly does not tolerate her. In not tolerating her, she is able to run a parallel structure. You can not have a parallel structure from a security perspective, he said.\n\nDespite being a colonel in the army, Miniyothabo has become a darling of the public and has never publicly declared any political ambitions.\n\nThe attack by Mliswa also comes as factionalism is deepening in ZANU PF over the succession of Mnangagwa, whose term of office expires in 2028. His loyalists are campaigning for an extended term of office by two years, until 2030.\n\nAdded Mliswa,I had already suggested and proposed that she can not be in office, being the wife of the Vice President, because she is already compromised. When people see her, they see the Vice President. How do you expect them not to take instructions from her? If you do not take instructions from her, you are fired. Why is it taking so long to retire her?\n\nThis is very important and for as long as this is not attended to, these issues will continue. There is a parallel structure which is being run from a security perspective.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/08/14051524/zdf-chiwengas.jpeg",
            "description": "<p>By Darlington Gatsi DEPUTY President Constantino Chiwenga’s wife, Minoyothabo Baloyi, has been drawn into the ZANU PF succession fight, with Temba Mliswa accusing her of using her military position to sabotage President Emmerson Mnangagwa. Mliswa, who has made Chiwenga the centre of his attacks, has now taken aim at Miniyothabo, whom he accuses of misusing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mliswa-takes-aim-at-chiwengas-wife-accuses-her-of-sabotaging-mnangagwa-says-she-should-quit-army-position/\">Mliswa takes aim at Chiwenga’s wife – accuses her of sabotaging Mnangagwa, says she should quit army position</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:34",
            "date": "31 Oct 2025"
        },
        {
            "title": "ZIFA to announce new Warriors Coach as over 300 apply for post",
            "url": "https://www.newzimbabwe.com/zifa-to-announce-new-warriors-coach-as-over-300-apply-for-post/",
            "content": "By Sports Reporter\n\nThe Zimbabwe Football Association (ZIFA) is set to announce the new Warriors head coach on Monday following an overwhelming response to the vacancy, which attracted more than 300 applications from both local and international coaches.\n\nZIFA president Nqobile Magwizi revealed the announcement date during an interview with SuperSports Soccer Africa on Thursday night, saying the process was now at an advanced stage.\n\nThe process of appointing the Warriors coach is at an advanced stage. We will announce by Monday at the latest; it should be Tuesday, said Magwizi.\n\nThe post became vacant after Michael Nees was dismissed due to a string of poor results, leaving the national team without a coach just two weeks before the November FIFA international break.\n\nSources say the online application portal, which closed Thursday, drew a stampede of interest, with over 300 curriculum vitae submitted. Among the notable applicants is former Tottenham Hotspur, Newcastle United, and Ghana national team manager Chris Hughton, who is said to be among the frontrunners.\n\nZIFA has set a minimum requirement of a CAF or UEFA Pro License, effectively ruling out local coaches, none of whom currently hold such qualifications.\n\nThe new coach will immediately begin preparations for the Warriors upcoming friendly matches against Algeria on November 13 in Saudi Arabia, and Qatar four days later as part of the build-up to the Africa Cup of Nations (AFCON) scheduled for December 2025.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/10051510/NQOBILE-Magwizi.jpg",
            "description": "<p>By Sports Reporter The Zimbabwe Football Association (ZIFA) is set to announce the new Warriors head coach on Monday following an overwhelming response to the vacancy, which attracted more than 300 applications from both local and international coaches. ZIFA president Nqobile Magwizi revealed the announcement date during an interview with SuperSport’s Soccer Africa on Thursday</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zifa-to-announce-new-warriors-coach-as-over-300-apply-for-post/\">ZIFA to announce new Warriors Coach as over 300 apply for post</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:34",
            "date": "31 Oct 2025"
        }
    ]
}