{
    "news": [
        {
            "title": "Former clinic accountant jailed nine years for fraud and money laundering",
            "url": "https://www.newzimbabwe.com/former-clinic-accountant-jailed-nine-years-for-fraud-and-money-laundering/",
            "content": "By Mary Taruvinga\n\nThe Harare Magistrates Court has convicted and jailed for nine years a former Highview Clinic accountant on charges of fraud and money laundering.\n\nAfter a full trial, Tonderai Shayimana (30) was found guilty of siphoning funds meant for the medical institution into his personal accounts after a full trial.\n\nIn sentencing, the magistrate imposed a nine-year jail term, of which six years were suspended.\n\nThree were scrapped on condition of good behaviour and another three on condition of restitution.\n\nShayimana will serve an effective three-year prison term for fraud.\n\nOn the money laundering charge, he was handed a five-year sentence wholly suspended.\n\nMagistrates heard that between August 2023 and March 2024, Shayimana created and used fake company email accounts to mislead medical aid societies, fraudulently instructing them to divert payments due to the clinic into his First Capital Bank account and Ecobank Nostro account.\n\nProsecutors revealed that he pocketed ZWL$15,362,415, ZIG$95,409 and US$123,739, which he later converted into personal assets.\n\nThe offender deliberately abused his position of trust and orchestrated a sophisticated scheme to deprive the clinic and medical societies of large sums of money, the court noted.\n\nWith the proceeds of crime, Shayimana purchased a residential stand in Budiriro for US$6,500, developed it into a seven-roomed house complete with a durawall, security cameras and solar system, and also bought a Nissan NV200 vehicle. Both the house and the vehicle have since been forfeited to the State.\n\nThe court said deterrent penalties in cases of insider fraud would serve justice.\n\nConvicted white-collar criminals will face stiff penalties and ill-got wealth will be forfeited, the National Prosecuting Authority said, commenting on the conviction.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/28155839/Harare-Magistrates-Court.jpg",
            "description": "<p>By Mary Taruvinga The Harare Magistrates’ Court has convicted and jailed for nine years a former Highview Clinic accountant on charges of fraud and money laundering. After a full trial, Tonderai Shayimana (30) was found guilty of siphoning funds meant for the medical institution into his personal accounts after a full trial. In sentencing, the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/former-clinic-accountant-jailed-nine-years-for-fraud-and-money-laundering/\">Former clinic accountant jailed nine years for fraud and money laundering</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "21 Aug 2025"
        },
        {
            "title": "Beven Capital Ponzi scheme fugitive arrested in UAE after years on the run, extradited to Zimbabwe over $100,000 fraud",
            "url": "https://www.newzimbabwe.com/beven-capital-ponzi-scheme-fugitive-arrested-in-uae-after-years-on-the-run-extradited-to-zimbabwe-over-100000-fraud/",
            "content": "By Mary Taruvinga\n\nA Zimbabwean man accused of masterminding the notorious Beven Capital Ponzi scheme has been extradited from the United Arab Emirates (UAE) and is now facing multiple charges of fraud, theft by deception, and impersonation in Harare.\n\nShepherd Chibaya (36), identified as one of the founders of the collapsed investment scam, was arrested in the UAE after years on the run and handed over to local authorities through Interpol cooperation.\n\nHe has since been remanded in custody pending trial.\n\nAccording to prosecutors, Beven Capital lured unsuspecting investors with promises of 50% returns in just six weeks, only for the schemes operators to vanish with millions.\n\nInstead of helping victims recover their money, Chibaya allegedly re-emerged to exploit them further by posing as a medical doctor at Parirenyatwa and Parktown Hospitals and pretending to have insider access to the schemes management. Authorities say he even became chairman of the defrauded investors group by leveraging these lies.\n\nIn one of the most elaborate scams, between 2020 and 2021, Chibaya allegedly defrauded a female investor of US$98,000, concocting stories about taxes, bribes and legal fees.\n\nHe is accused of faking his own arrest, impersonating a police officer, and later pretending to be dead to avoid detection.\n\nA stolen Samsung S20 cellphone was also traced back to him.\n\nOther counts include defrauding a complainant of US$850 in 2021 under the guise of tax fees and swindling another investor of US$2,000 after promising to help recover a US$30,000 investment while posing on duty as a doctor.\n\nA third investor lost US$2,000 after being promised recovery of his US$30,000 investment, with the accused again pretending to be on duty as a doctor when collecting cash, the court.\n\nAfter years on the run, the accused person was tracked down by Interpol in the UAE and handed over to Zimbabwean authorities. He has since been remanded in custody pending trial.\n\nIf convicted, Chibaya faces lengthy prison time.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/05/30184728/Fraud.jpg",
            "description": "<p>By Mary Taruvinga A Zimbabwean man accused of masterminding the notorious Beven Capital Ponzi scheme has been extradited from the United Arab Emirates (UAE) and is now facing multiple charges of fraud, theft by deception, and impersonation in Harare. Shepherd Chibaya (36), identified as one of the founders of the collapsed investment scam, was arrested</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/beven-capital-ponzi-scheme-fugitive-arrested-in-uae-after-years-on-the-run-extradited-to-zimbabwe-over-100000-fraud/\">Beven Capital Ponzi scheme fugitive arrested in UAE after years on the run, extradited to Zimbabwe over $100,000 fraud</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "21 Aug 2025"
        },
        {
            "title": "Police intercept Land Cruiser with 15.7kg gold stash after a tip-off",
            "url": "https://www.newzimbabwe.com/police-intercept-land-cruiser-with-15-7kg-gold-stash-after-a-tip-off/",
            "content": "By Mary Taruvinga\n\nPolice have intercepted a massive gold smuggling operation after receiving a tip-off that led to the recovery of 15,7 kilogrammes of gold worth over US$1,5 million hidden in a Toyota Prado Land Cruiser.\n\nIn a dramatic operation, detectives from the CID Minerals, Flora and Fauna Unit on August 19 tracked down the vehicle, leading to the arrest of three suspects.\n\nThe Zimbabwe Republic Police confirms the arrest of three suspects following the recovery of 15,7 kilogrammes of gold valued at US$1 568 860.00, Nyathi said in a statement.\n\nThe recovered gold has since been surrendered to Fidelity Gold Refinery in Msasa as investigations into the smuggling syndicate intensify.\n\nAuthorities have not yet released the names of the arrested suspects, citing ongoing investigations.\n\nThe latest bust follows heightened scrutiny of gold smuggling networks that have long plagued Zimbabwes mining sector, with law enforcement under pressure to plug leakages.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/07/18124726/Gold-Smuggling.png",
            "description": "<p>By Mary Taruvinga Police have intercepted a massive gold smuggling operation after receiving a tip-off that led to the recovery of 15,7 kilogrammes of gold worth over US$1,5 million hidden in a Toyota Prado Land Cruiser. In a dramatic operation, detectives from the CID Minerals, Flora and Fauna Unit on August 19 tracked down the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/police-intercept-land-cruiser-with-15-7kg-gold-stash-after-a-tip-off/\">Police intercept Land Cruiser with 15.7kg gold stash after a tip-off</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "21 Aug 2025"
        },
        {
            "title": "Zimbabwe Agricultural Show sees significant growth ahead of 115th edition",
            "url": "https://www.newzimbabwe.com/zimbabwe-agricultural-show-sees-significant-growth-ahead-of-115th-edition/",
            "content": "By Alois Vinga\n\nThe Zimbabwe Agricultural Show (ZAS) is set to make a big splash with a surge in both exhibitors and exciting new events, as it gears up for its 115th edition.\n\nIn a press briefing, ZAS CEO Rufaro Gunundu shared that 85% of exhibitors have already set up their stands, with 505 confirmed participantsup from 480 during the same period last year.\n\nThis growth is further reflected in the space occupied: a total of 79,500 square meters have been secured, surpassing last years 72,363 square meters, thanks to increased investments in Zimbabwes agricultural sector.\n\nIn a significant addition this year, ZAS will host its inaugural Golf Tournament this Friday at the Royal Harare Golf Club.\n\nThe event aims to raise funds for agricultural development programs. Gunundu emphasised that the tournament is not just a game, but a platform to support the next generation of agribusiness leaders.\n\nProceeds will benefit two key initiatives: the ZAS Master Farmer Training Programme, designed to equip farmers with critical skills and boost their confidence, and the ZAS Scholarship Programme, which offers financial assistance to students pursuing diplomas in agriculture, horticulture, and animal science, he said.\n\nIn addition to the tournament, attendees will be treated to a thrilling performance by the international Backsplit Performance Bikers, known for their high-energy, precision biking displays.\n\nGunundu described the event as a unique mix of sport and agricultural advocacy, promising an unforgettable experience while highlighting the bright future of Zimbabwes agricultural community.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/02161844/ZAS-6.png",
            "description": "<p>By Alois Vinga The Zimbabwe Agricultural Show (ZAS) is set to make a big splash with a surge in both exhibitors and exciting new events, as it gears up for its 115th edition. In a press briefing, ZAS CEO Rufaro Gunundu shared that 85% of exhibitors have already set up their stands, with 505 confirmed</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-agricultural-show-sees-significant-growth-ahead-of-115th-edition/\">Zimbabwe Agricultural Show sees significant growth ahead of 115th edition</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "21 Aug 2025"
        },
        {
            "title": "Boy (16) arrested for raping 85-year-old woman",
            "url": "https://www.newzimbabwe.com/boy-16-arrested-for-raping-85-year-old-woman/",
            "content": "By Staff Reporter\n\nPOLICE in Mashonaland West province have confirmed the arrest of a teenager for allegedly raping an octogenarian from his village.\n\nThe incident happened on Sunday in Gomwe village, Zvimba district.\n\nZimbabwe Republic Police (ZRP) Mashonaland West provincial spokesperson, Inspector Ian Kohwera, confirmed the incident.\n\nZRP Kutama have arrested a 16-year-old male suspect (name withheld), in connection with a case of rape which occurred on August 17, 2025 at around 1700 hours at Gomwe village, Chief Zvimba, said Kohwera.\n\nThe complainant is a female adult aged (85) and also resides in Gomwe village, Chief Zvimba. The accused went to the complainants homestead selling onions and offered an exchange of a bundle of onions for 5kg of maize.\n\nWhile the complainant was preparing the order, the suspect suddenly dragged her into her bedroom, pushed her on the floor and raped her once, said the police spokesperson.\n\nThe victim reportedly informed her son, who in turn reported the case at ZRP Kutama, leading to the accused persons arrest.\n\nMembers of the general public were urged to avoid leaving the elderly alone at their homes to avoid such unfortunate incidents.\n\nEfforts must be made to ensure that there is someone monitoring them constantly both day and night, said Kohwera.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/10/09115004/handcuffs.jpg",
            "description": "<p>By Staff Reporter POLICE in Mashonaland West province have confirmed the arrest of a teenager for allegedly raping an octogenarian from his village. The incident happened on Sunday in Gomwe village, Zvimba district. Zimbabwe Republic Police (ZRP) Mashonaland West provincial spokesperson, Inspector Ian Kohwera, confirmed the incident. “ZRP Kutama have arrested a 16-year-old male suspect</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/boy-16-arrested-for-raping-85-year-old-woman/\">Boy (16) arrested for raping 85-year-old woman</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "21 Aug 2025"
        }
    ]
}