{
    "news": [
        {
            "title": "ZACC arrests three Rusape town council officials",
            "url": "https://www.newzimbabwe.com/zacc-arrests-three-rusape-town-council-officials/",
            "content": "By Staff Reporter\n\nThe Zimbabwe Anti-Corruption Commission (ZACC) has arrested three officials from Rusape Town Council on allegations of criminal abuse of duty as public officers.\n\nThe three are Togarepi Nerwande, Director of Human Capital & Administration and Acting Town Secretary; Morris Tekwa, Director of Housing, Health and Community Services; and Arnold Mandizvidza Kutoka, former Council Engineer.\n\nThe trio is charged with violating Section 174 of the Criminal Law (Codification and Reform) Act [Chapter 9:23] after unlawfully reviving and processing a rejected application from Texas Energy Pvt Ltd for a solar power plant in Tsanzaguru.\n\nIn 2018, Texas Energy Pvt Ltd proposed developing a solar power plant in Tsanzaguru, Rusape, but the Ministry of Local Government rejected the proposal due to insufficient land and existing residential zoning.\n\nBetween September and December 2022, the accused unlawfully revived and reprocessed the previously rejected application without adhering to required legal procedures.\n\nOn 28 December 2022, Togarepi Nerwande illegally signed a 99-year lease with Texas Energy, misrepresenting the land as open space suitable for development, despite its designation for residential use.\n\nThe accused deliberately bypassed statutory procedures, including public notification and ministerial approval required for land-use changes, reads ZACCs statement.\n\nThe three appeared at the Mutare Magistrate Court on Tuesday for their initial remand.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/09/22055656/arrested-handcuffed-e1667358262642.jpeg",
            "description": "<p>By Staff Reporter The Zimbabwe Anti-Corruption Commission (ZACC) has arrested three officials from Rusape Town Council on allegations of criminal abuse of duty as public officers. The three are Togarepi Nerwande, Director of Human Capital & Administration and Acting Town Secretary; Morris Tekwa, Director of Housing, Health and Community Services; and Arnold Mandizvidza Kutoka, former</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zacc-arrests-three-rusape-town-council-officials/\">ZACC arrests three Rusape town council officials</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:41",
            "date": "10 Jun 2025"
        },
        {
            "title": "‘Uthini wena Temu Ndlozi?’: McKenzie clashes with EFF’s Sihle Lonzi over illegal foreigners",
            "url": "https://www.newzimbabwe.com/uthini-wena-temu-ndlozi-mckenzie-clashes-with-effs-sihle-lonzi-over-illegal-foreigners/",
            "content": "TimesLive\n\nPA leader and sport, arts and culture minister Gayton McKenzie has responded to EFF student command leader Sihle Lonzis accusations that he has abandoned his cause to fight against illegal immigrants.\n\nLonzi claimed McKenzie has not proposed any legislation on the subject, despite his partys stance on the issue.\n\nThe PA does not care about illegal foreigners, Lonzi said. Never let them lie to you. Its leader McKenzie is now a minister. He has never proposed legislation on the subject, not even a private members bill as an MP. He is just enjoying blue lights.\n\nMcKenzie swiftly responded to Lonzis accusations, asking, Uthini wena Temu Ndlozi? (What are you saying Ndlozi from Temu?). Start by telling us, do you even care?\n\nLonzi, however, was unfazed and accused McKenzie of avoiding parliamentary committee meetings. You must stop running away from parliament committee meetings. I will take you to the cleaners.\n\nThe debate stems from social media users concerns about McKenzies perceived change of attitude towards illegal foreigners.\n\nHowever, McKenzie has always reaffirmed his stance against illegal immigration, saying his partys mission remains unchanged.\n\nI speak up forAbahambe[they must leave] in closed government meetings and PA rallies. I have and will never change my stance regarding the mass deportation of all illegal foreigners but to expect me to only speak about immigration when there is a home affairs minister is wrong.Abahambeis our mission as the PA. We have and will never change. We have taken a decision to fight from within the GNU.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/10182059/gayton-eff-lonzi.jpg",
            "description": "<p>TimesLive PA leader and sport, arts and culture minister Gayton McKenzie has responded to EFF student command leader Sihle Lonzi’s accusations that he has abandoned his cause to fight against illegal immigrants. Lonzi claimed McKenzie has not proposed any legislation on the subject, despite his party’s stance on the issue. “The PA does not care</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uthini-wena-temu-ndlozi-mckenzie-clashes-with-effs-sihle-lonzi-over-illegal-foreigners/\">‘Uthini wena Temu Ndlozi?’: McKenzie clashes with EFF’s Sihle Lonzi over illegal foreigners</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:41",
            "date": "10 Jun 2025"
        },
        {
            "title": "Tensions rise as memorial for former Zambian president Lungu takes place in South Africa amid ongoing dispute with government",
            "url": "https://www.newzimbabwe.com/tensions-rise-as-memorial-for-former-zambian-president-lungu-takes-place-in-south-africa-amid-ongoing-dispute-with-government/",
            "content": "The Star\n\nA memorial service for Zambias former President Edgar Chagwa Lungu is being held Tuesday at the Cathedral in Pretoria, South Africa, under a cloud of political tension and unresolved conflict between his family and the Zambian government.\n\nMourners, including members of the Patriotic Front (PF), Lungus former ruling party, filled the cathedral as emotional tributes were paid to the late statesman.\n\nHowever, the atmosphere was not one of peace.\n\nInstead, it reflected the deepening rift over Lungus legacy, his cause of death, and the governments controversial handling of his passing.\n\nThe 68-year-old former president died last Thursday in a South African hospital, where he had been undergoing treatment for an undisclosed illness.\n\nSince his death, speculation and accusations have surfaced, with some PF leaders claiming Lungu may have been poisoned  a charge the Zambian government has not addressed publicly.\n\nAccording to hospital sources, government officials allegedly tried to repatriate Lungus body to Zambia without the familys consent.\n\nMedical staff say they were intimidated and threatened, prompting outrage from PF leaders and human rights groups alike.\n\nSpeaking at a media roundtable in Sandton, Johannesburg, PF Secretary General Mangani Nakacinda condemned the governments actions, calling them a calculated political manoeuvre to seize control of the narrative. Nakacinda added,\n\nThis is no longer just about mourning a former president  it is about defending his dignity and our democracy.\n\nOne of the most contentious issues is the Zambian governments reported insistence on taking full control of Lungus funeral arrangements.\n\nThe Lungu family, backed by PF allies, has resisted this, citing concerns about trust and transparency. So far, the standoff has stalled any official state funeral plans.\n\nAdding to the pain and confusion, two of Lungus children were allegedly denied permission to leave Zambia to attend their fathers memorial in South Africa. Family representatives say the travel ban is another example of the administrations deliberate cruelty.\n\nInside Zambia, the situation is increasingly volatile. PF members have vowed to fight until the end to expose what they claim is a campaign to erase Lungus political legacy and prevent scrutiny into the events leading to his death.\n\nMeanwhile, the government appears determined to maintain authority over the funeral process, citing protocol and national interest.\n\nThe late presidents political comeback in 2023 had reignited tensions in the country. After years of relative silence, Lungu announced his intention to run in the 2026 elections, challenging the ruling United Party for National Development (UPND) and its leader, President Hakainde Hichilema.\n\nIn response, the Constitutional Court ruled him ineligible, sparking legal and political protests.Shortly after, Lungu was stripped of all state benefits, including security and medical support, further isolating him.\n\nPF leaders claim these actions left him vulnerable, even hindering access to vital medical treatment in the months before his death.\n\nAs his body remains in South Africa and legal negotiations continue behind the scenes, todays memorial has become more than a moment of remembrance  it is a flashpoint in a deepening national crisis.\n\nThe treatment of former President Lungu is a reflection of the state of our democracy, said Brian Mundubile, a senior PF figure.\n\nThis is about justice, truth, and respect  not just for him, but for all Zambians.With the cause of Lungus death still unconfirmed and calls for an independent investigation growing louder, todays service may not be the end of mourning but the beginning of a prolonged battle for answers.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/01/01182032/Edgar-Lungu.jpg",
            "description": "<p>The Star A memorial service for Zambia’s former President Edgar Chagwa Lungu is being held Tuesday at the Cathedral in Pretoria, South Africa, under a cloud of political tension and unresolved conflict between his family and the Zambian government. Mourners, including members of the Patriotic Front (PF), Lungu’s former ruling party, filled the cathedral as</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tensions-rise-as-memorial-for-former-zambian-president-lungu-takes-place-in-south-africa-amid-ongoing-dispute-with-government/\">Tensions rise as memorial for former Zambian president Lungu takes place in South Africa amid ongoing dispute with government</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:41",
            "date": "10 Jun 2025"
        },
        {
            "title": "‘Shielded from arrest’: What Supreme Court of Appeal ruling means for 180,000 Zimbabweans in South Africa",
            "url": "https://www.newzimbabwe.com/shielded-from-arrest-what-supreme-court-of-appeal-ruling-means-for-180000-zimbabweans-in-south-africa/",
            "content": "IOL\n\nThe Supreme Court of Appeal has dismissed with costs the Department of Home Affairs attempt to overturn an interim interdict, previously granted in favour of the Zimbabwe Immigration Federation, protectingnearly 200,000 Zimbabwean Exemption Permit (ZEP) holdersagainst arrest and deportation.\n\nAfter winning Part A of the court wrangle, the federation will be heading back to the court, for Part B, to argue before court that the Department of Home Affairs overreached in 2021, when the then home affairs minister Aaron Motsoaledi announced the termination of the ZEP.\n\nThe special permit dispensation has allowed 180,000 Zimbabwean nationals to live and work in South Africa since 2009.\n\nIn the federations view, the jurisdiction to terminate the ZEP lies with Parliament, not the minister.\n\nIOL had an interview with Vindren Magadzire, director of the Zimbabwe Immigration Federation who said his organisations case revolves around the termination of the ZEP programme by the minister of home affairs.\n\nVindren Magadzire, director of the Zimbabwe Immigration Federation Image:Supplied\n\nThe programme allowed approximately 180,000 Zimbabweans to live and work in South Africa. In 2021, the minister of home affairs announced plans to terminate the ZEP permits, sparking legal actions from the Zimbabwe Immigration Federation, Magadzire told IOL.\n\nThe Zimbabwe Immigration Federation was inspired to go through courts due to the South African minister of home affairs decision to terminate the permits. The decision would have significant implications for approximately 180,000 Zimbabweans living and working in South Africa under the ZEP permit program.\n\nMagadzire said his organisation is requesting the superior court to declare the termination of the ZEP permits unlawful, setting aside the termination decision, and protecting permit holders rights.\n\nIn Magadzires view, a lasting solution would be granting the ZEP holders permanent residence status in South Africa.\n\nThe latest development in the court case is that the Supreme Court of Appeal dismissed the minister of home affairs appeal. This decision upholds a Johannesburg High Court interdict that shields approximately 180,000 ZEP holders from arrest and deportation, said Magadzire.\n\nLast year,IOL reported thatthe High Court in Pretoria heard arguments from the Helen Suzman Foundation to enforce the courts order that the ZEP remains valid, while the minister of home affairs conducts a fair and rational inquiry into the impact of its termination.\n\nThe foundation turned to court in a bid to give ZEP holders a lifeline.\n\nWhen the minister first signalled his intention to appeal the courts June 2023 judgment, the foundation asked him to leave the ZEP in place until he exhausted the appeal process. The minister refused, Nicole Fritz, executive director of the foundation said at the time.\n\nThe court had held earlier that the ministers appeal had no prospects of success. Home Affairs then decided to turn to the Supreme Court of Appeal.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/06/30214201/zep.webp",
            "description": "<p>IOL The Supreme Court of Appeal has dismissed with costs the Department of Home Affairs’ attempt to overturn an interim interdict, previously granted in favour of the Zimbabwe Immigration Federation, protecting nearly 200,000 Zimbabwean Exemption Permit (ZEP) holders against arrest and deportation. After winning Part A of the court wrangle, the federation will be heading back</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/shielded-from-arrest-what-supreme-court-of-appeal-ruling-means-for-180000-zimbabweans-in-south-africa/\">‘Shielded from arrest’: What Supreme Court of Appeal ruling means for 180,000 Zimbabweans in South Africa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:41",
            "date": "10 Jun 2025"
        },
        {
            "title": "Local coach in Harare suspended after Raza files complaint alleging racial abuse",
            "url": "https://www.newzimbabwe.com/local-coach-in-harare-suspended-after-raza-files-complaint-alleging-racial-abuse/",
            "content": "\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/29131339/Sikandar-Raza-1.jpg",
            "description": "<p>ESPNCricinfo Sikandar Raza has lodged a complaint with the Harare Metropolitan Cricket Association (HMCA), accusing a local coach – Blessing Mafuwa – of racial abuse during a Vigne Cup game on June 1. Raza was playing for Old Hararians against Rainbow Cricket Club at the Old Hararians Sports Club when the alleged incident took place. ESPNcricinfo</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/local-coach-in-harare-suspended-after-raza-files-complaint-alleging-racial-abuse/\">Local coach in Harare suspended after Raza files complaint alleging racial abuse</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:41",
            "date": "10 Jun 2025"
        },
        {
            "title": "Why are Zimbabwe Police Chasing Off Some of the Economy’s Biggest Players?",
            "url": "https://www.newzimbabwe.com/why-are-zimbabwe-police-chasing-off-some-of-the-economys-biggest-players/",
            "content": "ByLindaMujuruandGamuchiraiMasiyiwa,GPJZimbabwe\n\nThis story was originally published byGlobalPressJournal.\n\nHARARE, ZIMBABWE  The vendors rarely see it coming. The municipal police, some in plainclothes and others in uniform, move through the crowd silent and unnoticed. When they finally strike, panic erupts. Vendors scatter, trampling their goods and grabbing what they can. A few are arrested. Their wares are seized and tossed into the back of a police truck.\n\nThey have no mercy at all. Once they take your stock, youll never get it back, says Saul Nhema, an informal vendor who has been selling vegetables for three months after losing his job as a construction worker.\n\nOn the day of this interview, the municipal police had already raided these informal vendors selling along Park Street in Harares central business district twice. As Global Press Journal reporters interviewed Nhema, they struck again. He grabbed his stock and fled in the middle of the interview.\n\nThe Harare City Council has for years waged such crackdowns on vendors, often destroying goods and deploying heavy police forces. Local government insists these crackdowns are necessary to enforce city bylaws, citing vending from illegal spots, littering and health concerns.\n\nYet the scale and intensity of recent operations, backed by expanding police presence and significant public spending, have raised questions. Critics argue that the government is wasting scarce resources targeting informal vendors all while it struggles to provide city residents with basic services, such as cleanwater.\n\nIn 2024, the councils revenue stood at just US$3 million. But policing costs for these crackdowns exceeded US$24 million, eight times the councils income.\n\nIn 2025, the council escalated its crackdown by creating a specialized police unit to target vendors, further deepening the financial strain with a slight budget increase  and pushing the total to around 12 times its income, which is projected to fall to just US$2 million.\n\nAs the councils income dwindles, the central government shoulders much of the financial burden.\n\nZvikomborero Guvheya serves customers while Saul Nhema arranges vegetables at their vending posts along a Harare sidewalk. Informal vendors like Guvheya and Nhema play a vital role in Zimbabwes struggling economy but face frequent raids, bribe demands and constant threats from municipal police crackdowns.        Photo Credit: Gamuchirai Masiyiwa, GPJ Zimbabwe\n\nZvikomborero Guvheya serves customers while Saul Nhema arranges vegetables at their vending posts along a Harare sidewalk. Informal vendors like Guvheya and Nhema play a vital role in Zimbabwes struggling economy but face frequent raids, bribe demands and constant threats from municipal police crackdowns.        Photo Credit: Gamuchirai Masiyiwa, GPJ Zimbabwe\n\nGlobal Press Journal made numerous requests for an interview with the mayor. He did not respond.\n\nThe additional cost of the special police unit is hard to justify, given the potential benefits of supporting informal vendors, says Reuben Akili, director of the Combined Harare Residents Association.\n\nIf we examine the funds allocated for enforcement covering salaries, fuel and operational costs, those resources could have been redirected toward rehabilitating markets or public restrooms in the city, Akili says.\n\nThe informal sector already sustains over 80% of Zimbabwes population and contributes nearly 72% to the countrys gross domestic product. Street vendors dominate the sector in many African countries, accounting for over 85% of jobs, many held by women.\n\nIn Zimbabwe, the vendors are becoming increasingly critical, as the countrys currency crisis forces many retail shops to shut down.\n\nDespite this central role in many economies across the continent, vendors face common struggles. Many work in hostile, unregulated spaces, and they are routinely evicted under the pretext of urban order or dismissed as a threat to the health of formal economies.\n\nA special municipal police unit to push out this critical population in Harare will only inflate the citys workforce, which ultimately burdens taxpayers, Akili says. Instead, he says the council should build infrastructure where vendors can comfortably work.\n\nAn aerial view shows a municipal police truck carrying goods confiscated from vendors. Vendors who are arrested during crackdowns often lose their stock permanently, with little recourse to reclaim their goods.Photo credit: Gamuchirai Masiyiwa, GPJ Zimbabwe\n\nThere are some designated spaces within the central business district, but many vendors shun these, citing the high cost of renting stalls and a lack of foot traffic, which limits their ability to attract customers. Additionally, these spaces require a formal business license, which costs between US$400 and US$800 per year. In an economy that has struggled for decades, this cost is prohibitive for many.\n\nThe council must strike a balance between tackling these issues without undermining the livelihoods of those who depend on the informal economy, says Samuel Wadzai, director of Vendors Initiative for Social and Economic Transformation, a nonprofit that represents vendors.\n\nRaids havent been effective, he says, not even when a former minister of local government requested deployment of the army to push out vendors.\n\nDespite this central role in many economies across the continent, vendors face common struggles. Many work in hostile, unregulated spaces, and they are routinely evicted under the pretext of urban order or dismissed as a threat to the health of formal economies.\n\nDid that result in any significant change in terms of the challenges that we are seeing? I think its a big no, Wadzai says.\n\nAt times, vendors resort to bribing officers to avoid the disruption of evictions. Jesman Guvheya has worked as an informal vendor for two years. The widowed mother of five says the police sometimes demand US$1 a day from each vendor.\n\nBut there can be three or four groups that move at different times per day and you may end up paying 4 US dollars to avoid being raided, she says.\n\nAnd that bribe is never a guarantee one will trade without interruption. The police could swoop in and confiscate everything, even after a vendor has paid the bribe. Sometimes we are left with little stock that we will have secured elsewhere, she says, preparing to flee from police she has just spotted.\n\nAlthough Guvheya escaped arrest that day, her son, also a street vendor, wasnt as fortunate. The council police apprehended him, and she had to follow the truck to pay a bribe so he could be freed.\n\nLinda Mujuruis a Global Press Journal reporter-in-residence based in Harare, Zimbabwe.\n\nGamuchirai Masiyiwais a Global Press Journal reporter-in-residence based in Harare, Zimbabwe.\n\nGlobal Press Journal delivers bold, investigative and in-depth explanatory reporting on the worlds most urgent issues.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/09170953/01_gpjnews_zim_lm_vendors_-53-_l.jpeg",
            "description": "<p>By Linda Mujuru and Gamuchirai Masiyiwa, GPJ Zimbabwe   This story was originally published by Global Press Journal.     HARARE, ZIMBABWE — The vendors rarely see it coming. The municipal police, some in plainclothes and others in uniform, move through the crowd silent and unnoticed. When they finally strike, panic erupts. Vendors scatter, trampling their goods and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/why-are-zimbabwe-police-chasing-off-some-of-the-economys-biggest-players/\">Why are Zimbabwe Police Chasing Off Some of the Economy’s Biggest Players?</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:41",
            "date": "10 Jun 2025"
        }
    ]
}