{
    "news": [
        {
            "title": "Schoolchildren swept away as heavy floods and snow hit South Africa",
            "url": "https://www.newzimbabwe.com/schoolchildren-swept-away-as-heavy-floods-and-snow-hit-south-africa/",
            "content": "BBC\n\nA minibus carrying schoolchildren has been swept away by heavy flooding in South Africa, a spokesperson for the Eastern Cape provincial government has told the BBC.\n\nKhuselwa Rantjie said it was unclear how many children were on the bus, but three had so far been found alive. Rescue efforts had been suspended as night had fallen and would resume on Wednesday, she added.\n\nIn a separate incident, the bodies of seven people carried away by flood water have been found in the provinces OR Tambo district.\n\nSouth Africa has been hit by heavy snow, rains and gale force winds that have claimed the lives of a further five people in a road accident, and have left nearly 500,000 homes without electricity.\n\nThe Eastern Cape  the birthplace of anti-apartheid icon Nelson Mandela  has been worst-affected by the icy conditions, along with KwaZulu-Natal province.\n\nThe bad weather has forced the closure of some major roads in the two provinces to avoid further casualties.\n\nThis is a devastating reminder of natures force. We urge everyone to exercise extra caution in areas prone to flooding, Eastern Cape premier Oscar Mabuyane said in a statement.\n\nFive people died when a minibus taxi overturned near the coastal city of East London, with the driver saying he had lost control as he was trying to avoid a fallen tree, Eastern Cape transport department spokesperson, Unathi Binqose, told the BBC.\n\nTwo people were injured in the accident, he added.\n\nState power utility Eskom said that almost 300,000 homes had been hit by electricity cuts in 14 towns and villages in Eastern Cape.\n\nA further 196,000 homes in 24 areas in KwaZulu-Natal were also experiencing power cuts, Eskom spokesperson Daphne Mokwena told the BBC.\n\nKwaZulu-Natal Transport Minister Siboniso Duma said that heavy snow had led to lorries being stuck on roads, causing huge congestion.\n\nGrader machines have been stationed on worst-affected roads to clear snow before it reached more than 30cm (12in) in depth.\n\nMeteorologist Lehlohonolo Thobela also warned of strong winds and heavy waves at sea, making navigation for ships difficult.\n\nBoth Eastern Cape and KwaZulu-Natal are along the coast.\n\nSouth Africa regularly receives snowfall during its winter months, from June through August, with temperatures diving below 0C (32F).\n\nThere is also regular flooding and scientists say that climate change is causing heavier rainfall in the region.\n\nFlash floods and overflowing rivers between 30 April and 2 Maycaused significant damage to about 4,500 homes, and left 18 people injured.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/10195937/SA-Snow.webp",
            "description": "<p>BBC A minibus carrying schoolchildren has been swept away by heavy flooding in South Africa, a spokesperson for the Eastern Cape provincial government has told the BBC. Khuselwa Rantjie said it was unclear how many children were on the bus, but three had so far been found alive. Rescue efforts had been suspended as night</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/schoolchildren-swept-away-as-heavy-floods-and-snow-hit-south-africa/\">Schoolchildren swept away as heavy floods and snow hit South Africa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:29",
            "date": "10 Jun 2025"
        },
        {
            "title": "ZACC arrests three Rusape town council officials",
            "url": "https://www.newzimbabwe.com/zacc-arrests-three-rusape-town-council-officials/",
            "content": "By Staff Reporter\n\nThe Zimbabwe Anti-Corruption Commission (ZACC) has arrested three officials from Rusape Town Council on allegations of criminal abuse of duty as public officers.\n\nThe three are Togarepi Nerwande, Director of Human Capital & Administration and Acting Town Secretary; Morris Tekwa, Director of Housing, Health and Community Services; and Arnold Mandizvidza Kutoka, former Council Engineer.\n\nThe trio is charged with violating Section 174 of the Criminal Law (Codification and Reform) Act [Chapter 9:23] after unlawfully reviving and processing a rejected application from Texas Energy Pvt Ltd for a solar power plant in Tsanzaguru.\n\nIn 2018, Texas Energy Pvt Ltd proposed developing a solar power plant in Tsanzaguru, Rusape, but the Ministry of Local Government rejected the proposal due to insufficient land and existing residential zoning.\n\nBetween September and December 2022, the accused unlawfully revived and reprocessed the previously rejected application without adhering to required legal procedures.\n\nOn 28 December 2022, Togarepi Nerwande illegally signed a 99-year lease with Texas Energy, misrepresenting the land as open space suitable for development, despite its designation for residential use.\n\nThe accused deliberately bypassed statutory procedures, including public notification and ministerial approval required for land-use changes, reads ZACCs statement.\n\nThe three appeared at the Mutare Magistrate Court on Tuesday for their initial remand.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/09/22055656/arrested-handcuffed-e1667358262642.jpeg",
            "description": "<p>By Staff Reporter The Zimbabwe Anti-Corruption Commission (ZACC) has arrested three officials from Rusape Town Council on allegations of criminal abuse of duty as public officers. The three are Togarepi Nerwande, Director of Human Capital & Administration and Acting Town Secretary; Morris Tekwa, Director of Housing, Health and Community Services; and Arnold Mandizvidza Kutoka, former</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zacc-arrests-three-rusape-town-council-officials/\">ZACC arrests three Rusape town council officials</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:29",
            "date": "10 Jun 2025"
        },
        {
            "title": "Harare City Council under siege – residents say as government directs parcelling of land to Chiyangwa",
            "url": "https://www.newzimbabwe.com/harare-city-council-under-siege-residents-say-as-government-directs-parcelling-of-land-to-chiyangwa/",
            "content": "By Darlington Gatsi\n\nGOVERNMENTS directive to Harare City Council to award ZANU PF member and businessman Philip Chiyangwa land as compensation is unlawful, residents have said.\n\nThe Ministry of Local Government and Public Works recently instructed the Harare City Council (HCC) to allocate land to Pinnacle Holdings, owned by Chiyangwa, as compensation for property acquired by the government from the company.\n\nCombined Harare Residents Association (CHRA) director Reuben Akili said the directive violates the Constitution by interfering in local authority affairs, undermining the devolution agenda.\n\nThe government has abundant state land across Zimbabwe, including Harare, which it could use to compensate Pinnacle. The directive given to the local authority is a direct attack on Section 276 of the Constitution, which enshrines devolution.\n\nIn fact, this entire land issue is an assault on devolution as provided for in Chapter 14 of the Constitution, particularly Sections 274 and 276. Local authorities must retain autonomy in decision-making, Akili told NewZimbabwe.com.\n\nGovernment has been at loggerheads with Pinnacle Holdings over the land in Harare South which the latter claims ownership of.\n\nThe directive awaits approval from the local authority through a council resolution, which would facilitate the land transfer to Pinnacle Holdings.\n\nAkili further argued that the HCC should not be entangled in the dispute between the government and Pinnacle Holdings, as the council was not party to the original agreement.\n\nIt would be prudent for the local authority, particularly the councillors, to be guided by Chapter 14 of the Constitution on devolution.\n\nThe councillors must recognise that they cannot transfer any land to Pinnacle Holdings, which has no existing agreement with the City of Harare. In fact, Pinnacle Holdings has no locus standi in this matter, Akili said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/04/17022748/PHILIP-CHIYANGWA-THREE.jpg",
            "description": "<p> By Darlington Gatsi  GOVERNMENT’S directive to Harare City Council to award ZANU PF member and businessman Philip Chiyangwa land as compensation is unlawful, residents have said.    The Ministry of Local Government and Public Works recently instructed the Harare City Council (HCC) to allocate land to Pinnacle Holdings, owned by Chiyangwa, as compensation for property acquired</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-city-council-under-siege-residents-say-as-government-directs-parcelling-of-land-to-chiyangwa/\">Harare City Council under siege – residents say as government directs parcelling of land to Chiyangwa  </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:29",
            "date": "10 Jun 2025"
        },
        {
            "title": "Local coach in Harare suspended after Raza files complaint alleging racial abuse",
            "url": "https://www.newzimbabwe.com/local-coach-in-harare-suspended-after-raza-files-complaint-alleging-racial-abuse/",
            "content": "\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/29131339/Sikandar-Raza-1.jpg",
            "description": "<p>ESPNCricinfo Sikandar Raza has lodged a complaint with the Harare Metropolitan Cricket Association (HMCA), accusing a local coach – Blessing Mafuwa – of racial abuse during a Vigne Cup game on June 1. Raza was playing for Old Hararians against Rainbow Cricket Club at the Old Hararians Sports Club when the alleged incident took place. ESPNcricinfo</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/local-coach-in-harare-suspended-after-raza-files-complaint-alleging-racial-abuse/\">Local coach in Harare suspended after Raza files complaint alleging racial abuse</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:29",
            "date": "10 Jun 2025"
        },
        {
            "title": "4,912 injuries, 76 fatalities recorded in workplaces in 2024",
            "url": "https://www.newzimbabwe.com/4912-injuries-76-fatalities-recorded-in-workplaces-in-2024/",
            "content": "By Alois Vinga\n\nTHE Zimbabwe Congress of Trade Unions (ZCTU) says a total 4 912 injuries and 76 fatalities were recorded in 2024, prompting calls for urgent combative measures.\n\nVarious factors, including human error, equipment malfunction, and environmental hazards, can contribute to workplace accidents.\n\nIn a speech read on behalf of the ZCTU President, Florence Taruvinga, to mark this years June 6 commemorations, the labour organ revealed that workplace injuries and fatalities rose significantly during the period.\n\nIn 2024, Zimbabwe experienced a concerning rise in occupational injuries and fatalities. It is reported that there were 4,912 injuries and 76 fatalities throughout the year. What about those accidents that went unreported? It is our demand that we cannot continue to suffer from workplace neglect as workers without the responsible authorities being brought to account for the injuries and deaths being experienced in the workplace, she said.\n\nTaruvinga said the mining industry has become synonymous with unsafe shafts, equipment failure, and weak regulations that are causing unnecessary deaths.\n\nIn Agriculture, she said, employees work without personal protective equipment and are exposed to chemicals, heat stress, and poor living conditions, while in the retail and commercial sectors, workers are exposed to long hours of work, job insecurity and poor ergonomics.\n\nTaruvinga said that in the informal sector, over 80% of workers operate with no safety laws, medical care, or recognisable rights, while the transport and manufacturing sectors have also not been spared, as workers work with very dangerous old and archaic machinery, poorly maintained and without proper safety nets.\n\nAs the voice of workers, we clearly pronounce that enough is enough. We demand the following: Full enforcement of OSH laws across all economic sectors, establishment of functional health and safety committees in every workplace and access to adequate PPE, occupational health training, and medicalservices for all workers, added Taruvinga.\n\nThe June 6 commemorations are held annually to reflect on the Kamandama Mine Disaster, in which 427 miners were killed in 1972 in a mine explosion. The accident, which was attributed to a methane gas explosion, forced the permanent closure of the mine.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/07/06173942/mine.webp",
            "description": "<p>By Alois Vinga THE Zimbabwe Congress of Trade Unions (ZCTU) says a total 4 912 injuries and 76 fatalities were recorded in 2024, prompting calls for urgent combative measures.    Various factors, including human error, equipment malfunction, and environmental hazards, can contribute to workplace accidents.   In a speech read on behalf of the ZCTU President, Florence</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/4912-injuries-76-fatalities-recorded-in-workplaces-in-2024/\">4,912 injuries, 76 fatalities recorded in workplaces in 2024  </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:29",
            "date": "10 Jun 2025"
        }
    ]
}