{
    "news": [
        {
            "title": "Harare City Council under siege – residents say as government directs parcelling of land to Chiyangwa",
            "url": "https://www.newzimbabwe.com/harare-city-council-under-siege-residents-say-as-government-directs-parcelling-of-land-to-chiyangwa/",
            "content": "By Darlington Gatsi\n\nGOVERNMENTS directive to Harare City Council to award ZANU PF member and businessman Philip Chiyangwa land as compensation is unlawful, residents have said.\n\nThe Ministry of Local Government and Public Works recently instructed the Harare City Council (HCC) to allocate land to Pinnacle Holdings, owned by Chiyangwa, as compensation for property acquired by the government from the company.\n\nCombined Harare Residents Association (CHRA) director Reuben Akili said the directive violates the Constitution by interfering in local authority affairs, undermining the devolution agenda.\n\nThe government has abundant state land across Zimbabwe, including Harare, which it could use to compensate Pinnacle. The directive given to the local authority is a direct attack on Section 276 of the Constitution, which enshrines devolution.\n\nIn fact, this entire land issue is an assault on devolution as provided for in Chapter 14 of the Constitution, particularly Sections 274 and 276. Local authorities must retain autonomy in decision-making, Akili told NewZimbabwe.com.\n\nGovernment has been at loggerheads with Pinnacle Holdings over the land in Harare South which the latter claims ownership of.\n\nThe directive awaits approval from the local authority through a council resolution, which would facilitate the land transfer to Pinnacle Holdings.\n\nAkili further argued that the HCC should not be entangled in the dispute between the government and Pinnacle Holdings, as the council was not party to the original agreement.\n\nIt would be prudent for the local authority, particularly the councillors, to be guided by Chapter 14 of the Constitution on devolution.\n\nThe councillors must recognise that they cannot transfer any land to Pinnacle Holdings, which has no existing agreement with the City of Harare. In fact, Pinnacle Holdings has no locus standi in this matter, Akili said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/04/17022748/PHILIP-CHIYANGWA-THREE.jpg",
            "description": "<p> By Darlington Gatsi  GOVERNMENT’S directive to Harare City Council to award ZANU PF member and businessman Philip Chiyangwa land as compensation is unlawful, residents have said.    The Ministry of Local Government and Public Works recently instructed the Harare City Council (HCC) to allocate land to Pinnacle Holdings, owned by Chiyangwa, as compensation for property acquired</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-city-council-under-siege-residents-say-as-government-directs-parcelling-of-land-to-chiyangwa/\">Harare City Council under siege – residents say as government directs parcelling of land to Chiyangwa  </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "10 Jun 2025"
        },
        {
            "title": "‘Shielded from arrest’: What Supreme Court of Appeal ruling means for 180,000 Zimbabweans in South Africa",
            "url": "https://www.newzimbabwe.com/shielded-from-arrest-what-supreme-court-of-appeal-ruling-means-for-180000-zimbabweans-in-south-africa/",
            "content": "IOL\n\nThe Supreme Court of Appeal has dismissed with costs the Department of Home Affairs attempt to overturn an interim interdict, previously granted in favour of the Zimbabwe Immigration Federation, protectingnearly 200,000 Zimbabwean Exemption Permit (ZEP) holdersagainst arrest and deportation.\n\nAfter winning Part A of the court wrangle, the federation will be heading back to the court, for Part B, to argue before court that the Department of Home Affairs overreached in 2021, when the then home affairs minister Aaron Motsoaledi announced the termination of the ZEP.\n\nThe special permit dispensation has allowed 180,000 Zimbabwean nationals to live and work in South Africa since 2009.\n\nIn the federations view, the jurisdiction to terminate the ZEP lies with Parliament, not the minister.\n\nIOL had an interview with Vindren Magadzire, director of the Zimbabwe Immigration Federation who said his organisations case revolves around the termination of the ZEP programme by the minister of home affairs.\n\nVindren Magadzire, director of the Zimbabwe Immigration Federation Image:Supplied\n\nThe programme allowed approximately 180,000 Zimbabweans to live and work in South Africa. In 2021, the minister of home affairs announced plans to terminate the ZEP permits, sparking legal actions from the Zimbabwe Immigration Federation, Magadzire told IOL.\n\nThe Zimbabwe Immigration Federation was inspired to go through courts due to the South African minister of home affairs decision to terminate the permits. The decision would have significant implications for approximately 180,000 Zimbabweans living and working in South Africa under the ZEP permit program.\n\nMagadzire said his organisation is requesting the superior court to declare the termination of the ZEP permits unlawful, setting aside the termination decision, and protecting permit holders rights.\n\nIn Magadzires view, a lasting solution would be granting the ZEP holders permanent residence status in South Africa.\n\nThe latest development in the court case is that the Supreme Court of Appeal dismissed the minister of home affairs appeal. This decision upholds a Johannesburg High Court interdict that shields approximately 180,000 ZEP holders from arrest and deportation, said Magadzire.\n\nLast year,IOL reported thatthe High Court in Pretoria heard arguments from the Helen Suzman Foundation to enforce the courts order that the ZEP remains valid, while the minister of home affairs conducts a fair and rational inquiry into the impact of its termination.\n\nThe foundation turned to court in a bid to give ZEP holders a lifeline.\n\nWhen the minister first signalled his intention to appeal the courts June 2023 judgment, the foundation asked him to leave the ZEP in place until he exhausted the appeal process. The minister refused, Nicole Fritz, executive director of the foundation said at the time.\n\nThe court had held earlier that the ministers appeal had no prospects of success. Home Affairs then decided to turn to the Supreme Court of Appeal.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/06/30214201/zep.webp",
            "description": "<p>IOL The Supreme Court of Appeal has dismissed with costs the Department of Home Affairs’ attempt to overturn an interim interdict, previously granted in favour of the Zimbabwe Immigration Federation, protecting nearly 200,000 Zimbabwean Exemption Permit (ZEP) holders against arrest and deportation. After winning Part A of the court wrangle, the federation will be heading back</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/shielded-from-arrest-what-supreme-court-of-appeal-ruling-means-for-180000-zimbabweans-in-south-africa/\">‘Shielded from arrest’: What Supreme Court of Appeal ruling means for 180,000 Zimbabweans in South Africa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "10 Jun 2025"
        },
        {
            "title": "Local coach in Harare suspended after Raza files complaint alleging racial abuse",
            "url": "https://www.newzimbabwe.com/local-coach-in-harare-suspended-after-raza-files-complaint-alleging-racial-abuse/",
            "content": "\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/29131339/Sikandar-Raza-1.jpg",
            "description": "<p>ESPNCricinfo Sikandar Raza has lodged a complaint with the Harare Metropolitan Cricket Association (HMCA), accusing a local coach – Blessing Mafuwa – of racial abuse during a Vigne Cup game on June 1. Raza was playing for Old Hararians against Rainbow Cricket Club at the Old Hararians Sports Club when the alleged incident took place. ESPNcricinfo</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/local-coach-in-harare-suspended-after-raza-files-complaint-alleging-racial-abuse/\">Local coach in Harare suspended after Raza files complaint alleging racial abuse</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "10 Jun 2025"
        },
        {
            "title": "4,912 injuries, 76 fatalities recorded in workplaces in 2024",
            "url": "https://www.newzimbabwe.com/4912-injuries-76-fatalities-recorded-in-workplaces-in-2024/",
            "content": "By Alois Vinga\n\nTHE Zimbabwe Congress of Trade Unions (ZCTU) says a total 4 912 injuries and 76 fatalities were recorded in 2024, prompting calls for urgent combative measures.\n\nVarious factors, including human error, equipment malfunction, and environmental hazards, can contribute to workplace accidents.\n\nIn a speech read on behalf of the ZCTU President, Florence Taruvinga, to mark this years June 6 commemorations, the labour organ revealed that workplace injuries and fatalities rose significantly during the period.\n\nIn 2024, Zimbabwe experienced a concerning rise in occupational injuries and fatalities. It is reported that there were 4,912 injuries and 76 fatalities throughout the year. What about those accidents that went unreported? It is our demand that we cannot continue to suffer from workplace neglect as workers without the responsible authorities being brought to account for the injuries and deaths being experienced in the workplace, she said.\n\nTaruvinga said the mining industry has become synonymous with unsafe shafts, equipment failure, and weak regulations that are causing unnecessary deaths.\n\nIn Agriculture, she said, employees work without personal protective equipment and are exposed to chemicals, heat stress, and poor living conditions, while in the retail and commercial sectors, workers are exposed to long hours of work, job insecurity and poor ergonomics.\n\nTaruvinga said that in the informal sector, over 80% of workers operate with no safety laws, medical care, or recognisable rights, while the transport and manufacturing sectors have also not been spared, as workers work with very dangerous old and archaic machinery, poorly maintained and without proper safety nets.\n\nAs the voice of workers, we clearly pronounce that enough is enough. We demand the following: Full enforcement of OSH laws across all economic sectors, establishment of functional health and safety committees in every workplace and access to adequate PPE, occupational health training, and medicalservices for all workers, added Taruvinga.\n\nThe June 6 commemorations are held annually to reflect on the Kamandama Mine Disaster, in which 427 miners were killed in 1972 in a mine explosion. The accident, which was attributed to a methane gas explosion, forced the permanent closure of the mine.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/07/06173942/mine.webp",
            "description": "<p>By Alois Vinga THE Zimbabwe Congress of Trade Unions (ZCTU) says a total 4 912 injuries and 76 fatalities were recorded in 2024, prompting calls for urgent combative measures.    Various factors, including human error, equipment malfunction, and environmental hazards, can contribute to workplace accidents.   In a speech read on behalf of the ZCTU President, Florence</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/4912-injuries-76-fatalities-recorded-in-workplaces-in-2024/\">4,912 injuries, 76 fatalities recorded in workplaces in 2024  </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "10 Jun 2025"
        },
        {
            "title": "Smith to retire from Kavango Resources",
            "url": "https://www.newzimbabwe.com/smith-to-retire-from-kavango-resources/",
            "content": "By Alois Vinga\n\nKAVANGO Resources Plcboard chairman David Smith has indicated the intention to retire at the end of June 2025.\n\nHe steps down after a long and illustrious career, devoting considerable experience which raised the groups flag.\n\nThe company has also announced the appointment of Peter Wynter Bee as Non-Executive Chairman of the Board. Peter, who is currently the Non-Executive Deputy Chairman, will assume the position when David steps down.\n\nPeter is an experienced lawyer who has focused on financing and managing mining companies. He has raised capital for the development of mining projects since 1990.\n\nSuccessful projects include the development of a gold mine in Zambia, a copper mine in Zimbabwe and the Skorpion zinc mine in Namibia prior to its takeover by Anglo-American. He recently retired from Mexico Resources plc, where he was the founder and executive chairman, the company said in a statement.\n\nKavango also announced the appointment of Gautam Dalal, who will join the Company as a non-executive director, the effective date is expected to be 1 July 2025. The Company welcomes Gautam Dalal to the Board. Gautam Dalal joins the Company as a non-executive director.\n\nGautam is a chartered accountant with over 30 years of experience with KPMG London, where he was a partner from 1990 to 2010. From 1993 to 1997 he was responsible for the commencement of KPMGs business in India where he was based.\n\nGautam returned to India in 2000 as Chairman and Chief Executive Officer of KPMGs Indian operations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/09181535/smith-david.jpeg",
            "description": "<p>By Alois Vinga KAVANGO Resources Plc board chairman David Smith has indicated the intention to retire at the end of June 2025.  He steps down after a long and illustrious career, devoting considerable experience which raised the group’s flag.  The company has also announced the appointment of Peter Wynter Bee as Non-Executive Chairman of the Board.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/smith-to-retire-from-kavango-resources/\">Smith to retire from Kavango Resources </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "10 Jun 2025"
        },
        {
            "title": "Trump travel ban barring citizens from 12 countries takes effect",
            "url": "https://www.newzimbabwe.com/trump-travel-ban-barring-citizens-from-12-countries-takes-effect/",
            "content": "BBC\n\nPresident Donald Trumps sweeping new travel ban which bars citizens of 12 countries from entering the United States came into effect at 00:00 ET (05:00 BST) on Monday.\n\nThe order, which Trump signed last week, restricts the nationals of Afghanistan, Myanmar, Chad, Congo-Brazzaville, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen from entering the US.\n\nNationals from a further seven countries  Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela  will face partial travel restrictions.\n\nThe US president saidthe listcould be revised if material improvements were made, while other countries could be added as threats emerge around the world.\n\nIt is the second time Trump has ordered a ban on travel from certain countries. He signed a similar order in 2017 during his first term in office.\n\nThe White House said these common sense restrictions would protect Americans from dangerous foreign actors.\n\nThere are a number of people from affected countries who may still be able to enter the US due to a number of exceptions. The order does not apply to:\n\nIn a video posted to his Truth Social website last week, Trump said the recent attack in Boulder, Colorado underscored the extreme dangers posed by foreign nationals who had not been properly vetted.\n\nTwelve people were injured in Colorado on 1 June when a man attacked a group gathering in support of Israeli hostages. The FBI called it a suspected terror attack and said the suspect had used a makeshift flamethrower, Molotov cocktails and other incendiary devices.\n\nThe man accused of carrying out the attack was identified as an Egyptian national, but Egypt has not been included on the list of banned countries.\n\nTrumps latest order, which is likely to face legal challenges, drew a swift response, at home and abroad.\n\nChad retaliated by suspending all visas to US citizens while Somalia promised to work with the US to address security issues.\n\nThe African Union, which represents all countries on the continent, called on the US to engage in constructive dialogue with the countries concerned.\n\nIn the US, Democrats were quick to condemn the move.\n\nThis ban, expanded from Trumps Muslim ban in his first term, will only further isolate us on the world stage, Congresswoman Pramila Jayapal wrote on social media.\n\nBut others support the ban.\n\nCongressman Clay Higgins of Louisiana told the BBC that travel to the US was a privilege, not a right.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/09201449/TRUMP-D.webp",
            "description": "<p>BBC President Donald Trump’s sweeping new travel ban which bars citizens of 12 countries from entering the United States came into effect at 00:00 ET (05:00 BST) on Monday. The order, which Trump signed last week, restricts the nationals of Afghanistan, Myanmar, Chad, Congo-Brazzaville, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen from</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/trump-travel-ban-barring-citizens-from-12-countries-takes-effect/\">Trump travel ban barring citizens from 12 countries takes effect</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "10 Jun 2025"
        },
        {
            "title": "Rwanda pulls out of regional bloc over DR Congo row",
            "url": "https://www.newzimbabwe.com/rwanda-pulls-out-of-regional-bloc-over-dr-congo-row/",
            "content": "BBC\n\nRwanda says it is pulling out of a central African regional bloc after a diplomatic row over its involvement in the conflict in the east of the Democratic Republic of Congo.\n\nThe country was supposed to take up the chairman role of the Economic Community of Central African States (Eccas), which rotates between its 11 members.\n\nBut it was prevented from doing so at a meeting on Saturday in Equatorial Guinea.\n\nAnnouncing its decision to leave Eccas, Rwanda said its right to take up the chairmanship was deliberately ignored in order to impose the DRCs diktat.\n\nAs a result, it saw no justification for remaining in an organisation whose current functioning runs counter to its founding principles and intended purpose.\n\nThe row comes as efforts to end the fighting in eastern DR Congo continue. Following US mediation, Rwanda and DR Congo are working on a draft peace plan that is expected to be signed later this month.\n\nAccording to a statement from the Congolese presidency, the Eccas leaders at the summit acknowledged the aggression against the Democratic Republic of Congo by Rwanda and ordered the aggressor country to withdraw its troops from Congolese soil.\n\nIt added that until the dispute was resolved, it was decided that Equatorial Guinea would remain in the chairman role to the detriment of Rwanda.\n\nIn comments directed at Rwanda, Congolese government spokesman Patrick Muyaya said that one cannot continually and voluntarily violate the principles that underpin our regional institutions and claim to want to preside over them.\n\nHe added that the Eccas decision should inspire other regional organisations to adopt a firmer stance against Rwanda.\n\nRwanda has been accused of supporting M23 rebels in the east of DR Congo. The group has made major advances at the beginning of the year, taking the key regional cities of Goma and Bukavu.\n\nDR Congos government, the US and France have identified Rwanda as backing the M23.\n\nLast year, a UN experts report said that up to 4,000 Rwandan troops were fighting alongside the rebels.\n\nBut Rwanda has denied the accusations, saying instead that its troops were deployed along its border to prevent the conflict spilling over into its territory.\n\nRwanda has once before, in 2007, left Eccas, whose mission is to foster co-operation and strengthen regional integration in central Africa. It rejoined several years later.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/10/06140411/Rwanda-Forces-e1633525499622.jpg",
            "description": "<p>BBC Rwanda says it is pulling out of a central African regional bloc after a diplomatic row over its involvement in the conflict in the east of the Democratic Republic of Congo. The country was supposed to take up the chairman role of the Economic Community of Central African States (Eccas), which rotates between its</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rwanda-pulls-out-of-regional-bloc-over-dr-congo-row/\">Rwanda pulls out of regional bloc over DR Congo row</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "10 Jun 2025"
        },
        {
            "title": "Warriors ready to take on Niger",
            "url": "https://www.newzimbabwe.com/warriors-ready-to-take-on-niger/",
            "content": "By Sport Reporter\n\nAfter losing 2-0 to Burkina Faso on Friday last week, Zimbabwe senior mens team will be hoping to redeem themselves on Tuesday in a friendly match against Niger.\n\nScheduled to be played at Stade Pre Jgo stadium, Tuesdays match will complete the Warriors fixtures for the June FIFA international break, which started last week.\n\nZimbabwe faced criticism from fans after a poor performance against Burkina Faso on Friday, although team coach Michael Nees said the friendly was all about giving a chance to new players and trying new combinations.\n\nNees dropped key players like captain Marvellous Nakamba, his vice Marshall Munetsi and Knowledge Musona for the two friendlies.\n\nFor the German tactician, the two friendly matches against Burkina Faso and Niger are an opportunity to develop other players.\n\nEvery match is played to win, but we must also not forget development and the bigger picture, which is AFCON.\n\nIm quite confident that the boys tomorrow will be a new team and they will give everything to try and win that game, said Warriors coach Michael Nees ahead of Niger clash.\n\nNew players that Michael Nees called up for the two friendlies are Belgium-based Bill Antonio, German-based Jonah Fabisch, Tel Ones Tawanda Macheke and goalkeeper Elvis Chipezeze.\n\nNiger is currently ranked on position 122, that is six places below Zimbabwe who are on 116.\n\nTuesdays meeting will be the first between the two nations, and for Zimbabwe, this will also serve as preparations to the 2025 AFCON finals scheduled for December.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/17045132/Michael-Nees.jpg",
            "description": "<p>By Sport Reporter After losing 2-0 to Burkina Faso on Friday last week, Zimbabwe senior men’s team will be hoping to redeem themselves on Tuesday in a friendly match against Niger.  Scheduled to be played at Stade Père Jégo stadium, Tuesday’s match will complete the Warriors’ fixtures for the June FIFA international break, which started</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/warriors-ready-to-take-on-niger/\">Warriors ready to take on Niger </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "10 Jun 2025"
        }
    ]
}