{
    "news": [
        {
            "title": "Polytechnic student in trouble for forging exam results",
            "url": "https://www.newzimbabwe.com/polytechnic-student-in-trouble-for-forging-exam-results/",
            "content": "By Staff Reporter\n\nA KWEKWE Polytechnic student has been dragged to court for falsifying examination results in a bid to get a place for industrial attachment.\n\nThe accused person, Nickson Munesu Madhumbe (21), appeared at Kwekwe Magistrates Court facing a fraud charge.\n\nThe Automotive Engineering learner was convicted on his own guilty plea and slapped with 210 hours of community service.\n\nThe State case was that the accused person submitted a forged Higher Examinations Council (HEXCO) statement of results to Kwekwe Polytechnic in an attempt to register for On Job Educational Training (OJET).\n\nIt was further averred that Madhumbe failed three modules, and instead of rewriting the exam, he connived with the colleges chief security officer, Chancemore Sibanda, to falsify the results. The accused person paid US$400 to Sibanda, who is now on the run.\n\nThe court heard that in April 2024, Madhumbe received a forged HEXCO statement of results bearing distinctions in the failed subjects.\n\nUpon submitting his OJET application, examination staff noticed inconsistencies in the font size of his results sheet. A check in the National Examinations Management Information System (NEMIS) exposed the fraud.\n\nProsecutors told the court that Madhumbe was confronted, and he admitted that he obtained the fake results from Sibanda.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/10164555/kwekwe-poly.jpg",
            "description": "<p>By Staff Reporter A KWEKWE Polytechnic student has been dragged to court for falsifying examination results in a bid to get a place for industrial attachment. The accused person, Nickson Munesu Madhumbe (21), appeared at Kwekwe Magistrates Court facing a fraud charge. The Automotive Engineering learner was convicted on his own guilty plea and slapped</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/polytechnic-student-in-trouble-for-forging-exam-results/\">Polytechnic student in trouble for forging exam results</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "10 Mar 2025"
        },
        {
            "title": "Thomas Markle serves up shade: ‘Meghan’s cooking show is anything but authentic’",
            "url": "https://www.newzimbabwe.com/thomas-markle-serves-up-shade-meghans-cooking-show-is-anything-but-authentic/",
            "content": "IOL\n\nMeghan Markles newNetflixlifestyle show, With Love, Meghan, which recently premiered, didnt have the outcome she probably hoped for.\n\nBut as we know, she hasnt exactly been a fan favourite and has been dragged for many reasons.\n\nWith Love, Meghan is a lifestyle series where the Duchess gets real about life, love, and personal growth. She shares her own experiences along with tips on wellness, cooking, and relationships.\n\nWhile some praised her for the show, others accused her of being a wannabeMartha Stewart.\n\nAnother person on the critique seat is her father, who has also voiced his disappointment over his daughters latest series, calling it inauthentic and out of touch with reality.\n\nHe particularly took issue with her decision to distance herself from the Markle name and her claims about growing up as a latchkey kid, according to the Daily Mail.\n\nThomas, who relocated to the Philippines earlier this year, has not watched the entire show but has seen clips online. Based on what he has seen, he feels Meghan appears overly rehearsed.\n\nYou have to be authentic to hold peoples attention, he said. Unfortunately, Meghan has never been authentic. She has to think about everything. Shes not spontaneous. Everything she says is pre-planned and rehearsed.\n\nThe formerHollywoodlighting director also dismissed Meghans claims that she grew up eating TV dinners and fast food, insisting that he provided a comfortable life for her.\n\nWe occasionally ate TV dinners, which family doesnt? But I was working two jobs, so money was never an issue. We would eat out at least three times a week and order in the rest of the time, he said.\n\nHe recalled frequently taking Meghan to high-end restaurants in Hollywood.\n\nThomas also criticised Meghans cooking style in the show, calling her approach impractical for ordinary viewers.\n\nMeghan should make affordable food and show people how to stretch their food budget, he said, pointing out that she frequently uses expensive ingredients like edible flowers and elaborate fruit platters.\n\nI dont think most people these days can afford to go out and spend $90 (R1 644) on fruit. Shes out of touch with normal people, he said.\n\nSending kids off to school with edible flowers on their food is silly. Kids dont like them, and if you put edible flowers in a kids lunchbox, they would probably get teased at school.\n\nDaddy dearest isnt happy or proud of his daughter in her moment.Thomas has been estranged from Meghan since her 2018 wedding to Prince Harry, which he missed due to health issues.\n\nDespite their fallout, he still recalls their last shared meal fondly  a reminder of a relationship that seems far from mending.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/10164138/Thomas-Markle-criticised-Meghan-s-cooking-style-in-the-show-calling-her-approach-impractical-for-ordinary-viewers.webp",
            "description": "<p>IOL Meghan Markle’s new Netflix lifestyle show, “With Love, Meghan”, which recently premiered, didn’t have the outcome she probably hoped for. But as we know, she hasn’t exactly been a fan favourite and has been dragged for many reasons. “With Love, Meghan” is a lifestyle series where the Duchess gets real about life, love, and personal</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/thomas-markle-serves-up-shade-meghans-cooking-show-is-anything-but-authentic/\">Thomas Markle serves up shade: ‘Meghan’s cooking show is anything but authentic’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "10 Mar 2025"
        },
        {
            "title": "It’s not that bad – govt in damage control mode over deplorable Bulawayo-Vic Falls highway",
            "url": "https://www.newzimbabwe.com/its-not-that-bad-govt-in-damage-control-mode-over-deplorable-bulawayo-vic-falls-highway/",
            "content": "By Thandiwe Garusa\n\nTHE government is in damage control mode following a viral picture of three people posing in a huge pothole, believed to be along the Bulawayo-Victoria Falls highway, which has been in a deplorable state for years.\n\nThe highways terrible state is despite it leading to the majestic Victoria Falls, one of the seven natural wonders of the world and Zimbabwes most visited tourist destination.\n\nFor years, motorists have raised concerns over the highways poor condition, which has made road travel increasingly difficult.\n\nThere are countless videos and pictures online from different motorists showing the highways deplorable state.\n\nIt has come to our attention that a social media post is circulating, showing three people posing in a pothole on a road claimed to be part of the Bulawayo-Victoria Falls Highway.\n\nWhile we acknowledge that certain sections of the highway are in dire need of rehabilitation, the images in the post do not correspond to any section of the Bulawayo-Victoria Falls Highway.\n\nThe sections requiring urgent attention are currently being addressed through a collaborative effort between the Department of Roads and Bitumen World. Work is already underway, with teams camped in Hwange, Halfway, and Insiza to ensure the road is rehabilitated efficiently, the statement reads.\n\nLast year, the government announced a partnership with Bitumen World to rebuild the heavily damaged Beitbridge-Victoria Falls Highway under a build, operate, and transfer model.\n\nBitumen will fund, construct, and manage the road for profit before eventually transferring it to public ownership.\n\nMeanwhile, opposition politician Gift Ostallos Siziba posted a video on his social media accounts showing the roads bad condition, with potholes widely blamed for causing accidents.\n\nHe accused authorities of neglecting the road despite its critical role in tourism.\n\nYesterday, I witnessed this shocking reality firsthand on my way to Victoria Falls. The road leading to one of the worlds most iconic tourist attractions is in a deplorable state of disrepair.\n\nThe number of potholes has reached catastrophic levels, causing trucks to lose their axles and leading to an alarming increase in accidents. This critical route, which should be a showcase for Zimbabwes tourism industry, has been grossly neglected by the regime in Harare, Siziba wrote.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/10160703/20250310_161805.jpg",
            "description": "<p>By Thandiwe Garusa THE government is in damage control mode following a viral picture of three people posing in a huge pothole, believed to be along the Bulawayo-Victoria Falls highway, which has been in a deplorable state for years. The highway’s terrible state is despite it leading to the majestic Victoria Falls, one of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/its-not-that-bad-govt-in-damage-control-mode-over-deplorable-bulawayo-vic-falls-highway/\">It’s not that bad – govt in damage control mode over deplorable Bulawayo-Vic Falls highway</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "10 Mar 2025"
        },
        {
            "title": "AMH journalist worried about his family – lawyer says as Mhlanga clocks two weeks in detention",
            "url": "https://www.newzimbabwe.com/amh-journalist-worried-about-his-family-lawyer-says-as-mhlanga-clocks-two-weeks-in-detention/",
            "content": "By Staff Reporter\n\nThe lawyer representing Alpha Media Holdings (AMH) journalist, Blessed Mhlanga, who is in jail on allegations of publishing messages inciting public violence, has said the prominent reporter is unhappy and worried about his family.\n\nChris Mhike was addressing journalists after Mhlangas bail appeal was postponed by High Court judge Gibson Mandaza on Monday.\n\nMhike, however, said Mhlanga is strong and urges colleagues to do the same.\n\nHe is being strong. He encourages you, members of the press, to remain resolute, strong and brave in the face of adversity.\n\nHe is of course, very unhappy to be in detention over a matter as far as we are concerned, that does not warrant detention.\n\nHe worries about his family because he is a breadwinner and his day-to-day activities are disrupted without the liberty that he deserves. His studies have been disrupted, so he remains strong but obviously, his present situation is not ideal, Mhike said.\n\nMhlanga was arrested two weeks ago following interviews he allegedly had with Blessed Geza, a war veteran and a staunch opponent of the Mnangagwa 2030 agenda.\n\nGeza is currently being sought by the police to answer to incitement, undermining the authority of the President and theft charges.\n\nMagistrate Farai Gwitima denied Mhlanga bail, arguing that granting him bail would likely interfere with investigations.\n\nThe magistrate also said Mhlanga was likely to re-offend.\n\nAggrieved, the journalist filed an appeal, which was set for hearing on Monday.\n\nThe matter could not be heard after the state asked to have the matter transferred to the anti-corruption court.\n\nThe request was, however, turned down.\n\nOn Monday, the state promised to respond to the submissions by Mhlanga in his appeal before day end this Tuesday.\n\nAdded Mhike, The state is yet to furnish us with their response to the bail appeal.\n\nIt is our hope that by Wednesday, that response would have been furnished to us.\n\nThere was an undertaking by the state that by the end of tomorrow, they would have responded to the bail appeal.\n\nIt is our hope that our appeal will prevail and Blessed will be released.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26003108/InShot_20250225_165102005-scaled.jpg",
            "description": "<p>By Staff Reporter The lawyer representing Alpha Media Holdings (AMH) journalist, Blessed Mhlanga, who is in jail on allegations of publishing messages inciting public violence, has said the prominent reporter is unhappy and worried about his family. Chris Mhike was addressing journalists after Mhlanga’s bail appeal was postponed by High Court judge Gibson Mandaza on</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/amh-journalist-worried-about-his-family-lawyer-says-as-mhlanga-clocks-two-weeks-in-detention/\">AMH journalist worried about his family – lawyer says as Mhlanga clocks two weeks in detention</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "10 Mar 2025"
        },
        {
            "title": "Release your private sector, let it invest in Zimbabwe – says July Moyo as US announces u-turn policy on coal",
            "url": "https://www.newzimbabwe.com/release-your-private-sector-let-it-invest-in-zimbabwe-says-july-moyo-as-us-announces-u-turn-policy-on-coal/",
            "content": "By Staff Reporter\n\nENERGY Minister July Moyo has urged America to allow its private sector to invest in Zimbabwes massive coal fields following the Western countrys policy change regarding energy and the use of coal.\n\nFormerly a campaigner for the substitution of fossil fuels in power production and other facets, America pulled out of the Paris Agreement and is on the hunt for coal sources.\n\nThe u-turn is as a result of President Donald Trumps shift in foreign policy.\n\nSpeaking at the recently held Powering Africa Summit held in Washington DC, Moyo assured America that companies that would invest in Zimbabwes coal sector would have their investments guaranteed.\n\nOurplea, again to the United States as Zimbabwe is; release your private sector so that they can invest directly into Zimbabwe. We have created an environment where they will earn money because their investment will be guaranteed, said Moyo.\n\nUS Energy Secretary Chris Wright explained the dramatic change in policy as being advised by global needs and challenges that far outweigh climate change concerns.\n\nWright highlighted that previous energy policies that discouraged the use of fossil fuels had also inhibited the growth of African economies.\n\nWe want to partner with Africa in technology, capital investment and energy infrastructure. You decide what works for your people and we will work with you to make it happen, he said.\n\nMoyo, who was accompanied by Finance Minister Mthuli Ncube, said American investment was welcome in power generation but extraction of coalbed methane gas which is abundant in Hwange and Chiredzi areas.\n\nHe added: We are an agricultural country, we want our fertilisers, so any investment in that coalbed methane gas, we could end up doing our fertilisers, which we are importing right now, and as a country that believes very strongly in agriculture, that would be a good investment.\n\nZimbabwe and the US have not seen eye to eye for over two decades. Although there has been investment in the country, it has been minimal as compared to countries such as South Africa which, up until recently, had successfully cosied up to America.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/04/10034901/July-Moyo.jpg",
            "description": "<p>By Staff Reporter ENERGY Minister July Moyo has urged America to allow its private sector to invest in Zimbabwe’s massive coal fields following the Western country’s policy change regarding energy and the use of coal. Formerly a campaigner for the substitution of fossil fuels in power production and other facets, America pulled out of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/release-your-private-sector-let-it-invest-in-zimbabwe-says-july-moyo-as-us-announces-u-turn-policy-on-coal/\">Release your private sector, let it invest in Zimbabwe – says July Moyo as US announces u-turn policy on coal</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "10 Mar 2025"
        },
        {
            "title": "Zimbabwe’s Central Bank confident of gold-backed ZiG currency’s long-term stability",
            "url": "https://www.newzimbabwe.com/zimbabwes-central-bank-confident-of-gold-backed-zig-currencys-long-term-stability/",
            "content": "By Staff Reporter\n\nTHE Reserve Bank of Zimbabwe (RBZ) is still pinning its hopes on the strength of the local gold-backed Zimbabwe Gold (ZiG) currency to compete against major currencies, including the United States dollar.\n\nSpeaking during a Tourism Business Council of Zimbabwe (TBCZ) indaba recently, RBZ Governor John Mushayavanhu put up a spirited defence against detractors of the ZiG claiming robust monetary policy measures introduced by the bank were ensuring the ZiG remains bouyant.\n\nThe ZiG to USD rate is firming up, Mushayavanhu said.\n\nThe governor claimed this as a clear indication that confidence in the local currency remains the primary mandate of the apex bank.\n\nZimbabwe introduced the currency in April last year after a whirlwind battle with exchange rate volatility and runaway inflation.\n\nPart of the raft of measures adopted by RBZ is the tight monetary policy stance, scaffolded by a relatively high-interest rate regime to discourage speculative borrowing.\n\nThe RBZ governor said the central bank was working to ensure durable ZiG stability and to make the currency the pillar of the economy.\n\nMushayavanhu highlighted that de-dollarisation remained on track to meet the 2030 target of returning to a domestic mono-currency regime.\n\nAuthorities, business leaders and economists admit that the US dollar-denominated currency regime is not sustainable, given the overly strong currency, which suppresses the competitiveness of local goods and services on the global market.\n\nThe limited supply of US dollars also limits the central banks capacity to use its monetary policy tools to influence economic dynamics in the country.\n\nAmong the measures to enhance confidence and performance of the ZiG, the apex bank said economic agents were free to charge prices not fixed to the official exchange rate.\n\nThe market is free to price their goods and services at whatever USD to ZiG rate they prefer without being limited to using the official RBZ exchange rate, Mushayavanhu told delegates.\n\nThis effectively means the pricing system is liberal, allowing companies to use exchange rates that reflect market dynamics.\n\nThe governor noted that the Financial Intelligence Unit (FIU) would not penalise businesses for not using pricing models fixed to the official exchange rate, for as long as the pricing is with reasonable margins.\n\nMushayavanhu emphasised that economic agents attempting to manipulate the market by using untenable exchange rates would soon price themselves out of competition.\n\nThe governor revealed that some fuel traders had already approached the RBZ, offering to sell fuel in ZiG to finance their local obligations.\n\nOver time, the governor said, the fuel dealers would voluntarily sell the commodity in the domestic currency.\n\nWe do not want to go back to long queues and fuel shortages, he noted, signalling that policy decisions will be made with economic stability in mind.\n\nMushayavanhu also shot down suggestions for preferential treatment to forex access for capital projects.\n\nRBZ Deputy Governor Innocent Matshe said the realistic exchange rate, based on economic fundamentals, should be US$1/ZiG22, a level that authorities expect the market to accept.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171609/mushayavanhu-zig-4.jpg",
            "description": "<p>By Staff Reporter  THE Reserve Bank of Zimbabwe (RBZ) is still pinning its hopes on the strength of the local gold-backed Zimbabwe Gold (ZiG) currency to compete against major currencies, including the United States dollar. Speaking during a Tourism Business Council of Zimbabwe (TBCZ) indaba recently, RBZ Governor John Mushayavanhu put up a spirited defence</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-central-bank-confident-of-gold-backed-zig-currencys-long-term-stability/\">Zimbabwe’s Central Bank confident of gold-backed ZiG currency’s long-term stability</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "10 Mar 2025"
        },
        {
            "title": "Scottland F.C maintains a perfect start with a win over CAPS United",
            "url": "https://www.newzimbabwe.com/scottland-f-c-maintains-a-perfect-start-with-a-win-over-caps-united/",
            "content": "By Darlington Gatsi\n\nSCOTTLAND FC are the only side to have maintained a perfect record in the Castle Lager Premier Soccer League after overcoming Harare giants CAPS United 2-0.\n\nSecond-half goals by Tymon Machope and Namibian Sadney Urikhob were enough to hand Scottland their second victory of the season.\n\nThe newly promoted side missed numerous chances in the first half that could have put them ahead but failed to capitalise on them.\n\nFor CAPS United, new signings Kundai Benyu and Tanaka Shandirwa gave the Scottland midfield a run for their money, combining well in search of an opener.\n\nAfter the restart, Musona and Khama Billiat combined to set up Tymon Machope, who sent Scottland ahead.\n\nMusona could have doubled Scottlands lead, but Harmon Nare pulled off a save to deny the Mabvuku side.\n\nMoments later, Jayden Bakare squandered an opportunity to bring CAPS United back into the game.\n\nUrikhob put the cherry on top by slotting the ball into the net in injury time, with Scottland walking out of Rufaro with a win.\n\nScottland coach Tonderai Ndiraya said there were improvements from the first game, in which they needed an own goal to beat Triangle.\n\nWe were playing a very good team, a big team for that matter, and coming away with a result means youre doing something right. If you recall, I said these boys needed recovery, and we saw a completely different performance today compared to the Triangle game.\n\nThis is only the second game of the league, and you put up a performance like thiswhat more can you ask from the team? said Ndiraya.\n\nCAPS United appeared to have resigned to defeat in the second half, creating fewer meaningful opportunities.\n\nMidfielder Phineas Bamusi finishing the match was a mystery, with the veteran contributing little.\n\nHowever, Lloyd Chitembwe bemoaned errors that led to Scottlands goals.\n\nDecent performances from both teams. I think we could have been better in terms of the output, which is the result. As far as the goals we conceded, we could have done much better to avoid that. The two goals were due to defensive errors, said Chitembwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/04190715/scottland.jpg",
            "description": "<p>By Darlington Gatsi SCOTTLAND FC are the only side to have maintained a perfect record in the Castle Lager Premier Soccer League after overcoming Harare giants CAPS United 2-0. Second-half goals by Tymon Machope and Namibian Sadney Urikhob were enough to hand Scottland their second victory of the season. The newly promoted side missed numerous</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/scottland-f-c-maintains-a-perfect-start-with-a-win-over-caps-united/\">Scottland F.C maintains a perfect start with a win over CAPS United</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "10 Mar 2025"
        },
        {
            "title": "Vitor Pereira explains why he substituted Marshall Munetsi at half-time in Wolves draw vs Everton",
            "url": "https://www.newzimbabwe.com/vitor-pereira-explains-why-he-substituted-marshall-munetsi-at-half-time-in-wolves-draw-vs-everton/",
            "content": "By Molineux News\n\nMANAGER Vitor Pereira has now explained why he substituted midfielder Marshall Munetsi at half-time during Wolves draw against Everton.\n\nWolves signed Munetsi from Stade Reims on transfer deadline day and was one of three new players to come through the doors at Molineux.\n\nThe 28-year-old has since become influential as an attacking midfielder, coming close to scoring on numerous occasions but finally breaking his duck on Saturday night.\n\nMunetsi scored his first goal against Everton, calmly slotting his chance past Jordan Pickford after being found superbly by Jean-Ricner Bellegarde.\n\nBut the midfielders night was sadly cut short when Vitor Pereira substituted him at half-time, and the Portuguese tactician has now explained why.\n\nMarshall Munetsi felt something against Everton\n\nWolves fans have experienced their fair share of injury troubles in recent times, so when Munetsi was taken off for Pablo Sarabia at the interval, they feared the worst.\n\nFortunately, in Pereiras assessment of the Zimbabwe international at full-time, it didnt sound like a serious problem, claiming he just felt something and didnt want to risk him in the second half.\n\nHe deserved the goal but it was a pity he felt something in the first half and we cannot take risks with him, Pereira said via BBC Sport.\n\nThe Wolves manager also praised Munetsi, highlighting his spirit as a positive and predicting to build on his first strike at Molineux.\n\nHe has the spirit that I like in a player, Pereira added.\n\nHe did everything to help the team and he will definitely score more goals.\n\nWolves travel to Southampton in the Premier League next weekend, and hopefully, Pereiras No.5 is fully recovered to start at St Marys.\n\nMunetsi is exactly what Wolves needed\n\nA goal-scoring midfielder is hard to come by in the transfer market without paying the premium. But Wolves paid just 16 million for Munetsi, and that is already looking like a bargain.\n\nPhysically, hes so powerful and capable of winning battles against his opponents, while his movement and ability to sniff out chances are commendable attributes.\n\nFor most of his Wolves career so far, hes spurned some golden chances, but tonight he showed composure in the box to score and long may it continue.\n\nAlthough Wolves have been reliant on Cunha, its refreshing to see others step up to the plate, as Munetsi is easily someone who could hit double figures for goals in a season.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/10045508/GettyImages-2203472372-750x500-1.webp",
            "description": "<p>By Molineux News MANAGER Vitor Pereira has now explained why he substituted midfielder Marshall Munetsi at half-time during Wolves’ draw against Everton. Wolves signed Munetsi from Stade Reims on transfer deadline day and was one of three new players to come through the doors at Molineux. The 28-year-old has since become influential as an attacking</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/vitor-pereira-explains-why-he-substituted-marshall-munetsi-at-half-time-in-wolves-draw-vs-everton/\">Vitor Pereira explains why he substituted Marshall Munetsi at half-time in Wolves draw vs Everton</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "10 Mar 2025"
        },
        {
            "title": "Legal Discussions with Vengai Madzima: Civil Partnerships in Zimbabwe",
            "url": "https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-civil-partnerships-in-zimbabwe/",
            "content": "NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal) to discuss with us legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer.\n\nReporter: Welcome back Mr. Madzima, this week we want to discuss on the law of civil partnerships, without beating around the bush, is this law crafted to protect small houses?\n\nVM: (laughs)A very direct question but it reflects the general perception of many. The intention and purpose of the law is however far removed from that perspective.\n\nIn Zimbabwe people normally live together as husband and wife under the following marriage regimes, as a couple under a civil marriage, that is a marriage registered under the Marriages Act Chapter 5:11 which was formerly and is still commonly known by many as Chapter 37, a qualified civil marriage which is potentially polygamous and is solemnized by a Minister of religion, normally for the Islamic religion. There is also the registered or unregistered customary marriage, which involves the payment of lobola and is also potentially polygamous.\n\nHowever, there are many couples who live together and have lived together for years as husband and wife and have not formalized their union under any of the categories I stated. Those are ultimately the people the law was put in place to protect.\n\nIt is really a question of equity and justice more than anything else.\n\nReporter: Am not completely convinced, however, please explain to us what a civil partnership is?\n\nVM: In Zimbabwe, firstly, a civil partnership is a relationship between a man and woman , this is important as some countries extend the definition to include people of the same sex in a relationship.\n\nThe man and woman must be above the age of 18, meaning that they are able to contract a marriage in Zimbabwe. They should also have lived together as a couple under a genuine domestic basis. A variety of circumstances are considered here, but in summary, it must be established that they were living together as husband and wife but for the actual formal solemnizing of their relationship under the categories I mentioned earlier.\n\nThe couple cannot be of the same bloodline, that is brother and sister, first or second cousins. There are exceptions in law to first and second cousins, which exceptions include, whether or not the couple knew that they were relatedet ceterabut that is a discussion for another day.\n\nReporter:So how does one prove that they qualify as a civil partnership, what is the criteria?\n\nVM: Well, the law has left this to the courts to interpret what qualifies as a civil partnership for purposes of enjoying the rights that follow. There is no set criteria that states that this or that is what is necessary to prove before it can be considered as a civil partnership. We can say that the law is developing in that area.\n\nEach case is dealt with according to its own circumstances.\n\nThey are however issues the courts will consider in varying circumstances, issues like how long the relationship lasted, the nature and extent of their living in together or common residence, the degree or extent of their financial dependence or interdependence. The couple may have also bought property togetheret cetera. The relationship has to be of a sexual nature off -course.\n\nReporter: So in terms of explanation for qualification, small houses will have marriage rights should that relationship come to an end?\n\nVM: I suppose we have come back to the question we started on.\n\nThe law does recognize that some civil partnerships may include what you are terming as small houses and some rights do follow dissolution of civil partnership.\n\nA court that is ceased with the task of dissolving the civil partnership where there is to be distribution of assets or there are such claims will pay due regard and not ignore the rights of the other spouse who is not party to this dissolution. Long and short, the assets that belong to the spouse, if proved to be the assets of the spouse, will not form a part of civil partnership property if I can loosely call it that.\n\nReporter: So does the claim by a small house dissolving a civil partnership not expose the married person to the crime of bigamy?\n\nVM: I will repeat that the law on civil partnerships is not limited to the issue of small houses. It is for people who live together in a domestic sexual relationship.\n\nTo your question, the dissolution of a civil partnership where one partner has a spouse under a civil marriage, the law has specifically excluded the crime of bigamy, so no, the married person will not be exposed to the crime of bigamy.\n\nReporter: Does this law extend to the question of inheritance for people under civil partnerships when one dies?\n\nVM: The Marriages Act of 2022 does not specifically include the word inheritance and the laws that protect spouses on the death of a spouse do not automatically apply. It goes back to the point that the civil partnership may have to be proved to the satisfaction of the court to qualify for inheritance or a claim on the estate of the deceased.\n\nReporter: Thank you, Mr. Madzima we have run out of time.\n\nVM: Thank you.\n\nYou can contact Vengai Madzima onvengai@mcmlegal.co.zwor at www.mcmlegal.co.zw.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/09183617/Screenshot-2025-03-09-203607.png",
            "description": "<p>NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal) to discuss with us legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer. Reporter: Welcome back Mr. Madzima, this week we want to discuss on</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-civil-partnerships-in-zimbabwe/\">Legal Discussions with Vengai Madzima: Civil Partnerships in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "10 Mar 2025"
        },
        {
            "title": "Warriors coach to name 2026 World Cup Qualifiers squad",
            "url": "https://www.newzimbabwe.com/warriors-coach-to-name-2026-world-cup-qualifiers-squad/",
            "content": "By Sports Reporter\n\nZIMBABWE national senior mens soccer team, the Warriors coach, Michael Nees, is expected to announce his squad for the coming 2026 World Cup Qualifiers games this Wednesday, NewZimbabwe.com has learnt.\n\nZimbabwe is the only team in Group C, which is yet to release a provisional squad for the upcoming 2026 World Cup Qualifiers scheduled to be played next week.\n\nThe Warriors will host Benin at Moses Mabhidha Stadium March 20 before travelling to Nigeria for a clash against the Super Eagles five days later.\n\nAlready Benin and Nigeria have released their provisional squads for the coming qualifiers but the Warriors fans remain in mystery on who will feature for the national team this time around.\n\nThe coach will finally announce his squad for the coming two games on Wednesday via a press conference.\n\nHe should have done so last week but a number of issues and changes led to this delay.\n\nAmongst the key issues is injured players who had been drafted in the squad. So, the coach had to look for alternative options, a source at ZIFA told NewZimbabwe.com.\n\nA number of players are not available for the coming two fixtures due to injury set backs.\n\nAmongst the players that have been ruled out is Warriors captain Marvellous Nakamba, who plays for Luton Town in the English Championship League.\n\nNakamba suffered a culf muscle injury that will see him out of action for six weeks.\n\nOther than missing Nakamba, Nees will also miss the services of veteran goalkeeper Washington Arubi, who plays for Marumo Gallants in South Africa.\n\nArubis unavailability was confirmed by his club upon his call for international early this week.\n\nThe veteran goalie played a critical role in Nees AFCON Quualifiers campaign last year, as he conceded only four goals in six matches.\n\nAdding on to Nees injury list is England-based defender Brandon Galloway is also out for the rest of the season as confirmed by his club Plymouth Arglye.\n\nZimbabwe is yet to win a match in the ongoing World Cup Qualifiers campaign, at the present moment they are seating bottom in the group with two points out of the four games they have played.\n\nThe upcoming two fixtures will be the first for Warriors coach in the campaign since his appointment in July last year.\n\nZimbabwe started its campaign under former Highlanders coach Baltermir Brito, who managed two points against Rwanda and Nigeria.\n\nThe team was then led by Manica Diamonds coach Jairos Tapera for the other two games against Lesotho and South Africa which they lost.\n\n2026 World Cup Qualifiers Group C Standings\n\n1)Rwanda = 7points2)South Africa = 7 points3)Benin = 7 points4)Lesotho = 5 points5)Nigeria = 3 points6)Zimbabwe = 2 points\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/17045132/Michael-Nees.jpg",
            "description": "<p>By Sports Reporter ZIMBABWE national senior men’s soccer team, the Warriors coach, Michael Nees, is expected to announce his squad for the coming 2026 World Cup Qualifiers games this Wednesday, NewZimbabwe.com has learnt. Zimbabwe is the only team in Group C, which is yet to release a provisional squad for the upcoming 2026 World Cup</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/warriors-coach-to-name-2026-world-cup-qualifiers-squad/\">Warriors coach to name 2026 World Cup Qualifiers squad</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "10 Mar 2025"
        }
    ]
}