{
    "news": [
        {
            "title": "In Pictures: City of Harare’s blitz leaves small business owners stranded",
            "url": "https://www.newzimbabwe.com/in-pictures-city-of-harares-blitz-leaves-small-business-owners-stranded/",
            "content": "Scores of small business owners in Harare were left stranded after the City Council shut down shops and trading spaces in a blitz enforcing municipal bylaws. Authorities say the operation is aimed at restoring order in the capital.\n\nPictures by Thandiwe Garusa\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/02162525/Tuckshops-3.png",
            "description": "<p>Scores of small business owners in Harare were left stranded after the City Council shut down shops and trading spaces in a blitz enforcing municipal bylaws. Authorities say the operation is aimed at restoring order in the capital. Pictures by Thandiwe Garusa</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-pictures-city-of-harares-blitz-leaves-small-business-owners-stranded/\">In Pictures: City of Harare’s blitz leaves small business owners stranded</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "02 Oct 2025"
        },
        {
            "title": "Chevrons qualify for 2026 T20 World Cup",
            "url": "https://www.newzimbabwe.com/chevrons-qualify-for-2026-t20-world-cup/",
            "content": "By Sports Reporter\n\nThe Zimbabwe senior mens cricket team sealed qualification for the 2026 ICC T20 World Cup on Thursday after defeating Kenya by seven wickets in the semi-finals of the Africa Qualifiers at Harare Sports Club.\n\nThe Chevrons join Namibia, who booked their ticket with a 63-run win over Tanzania in the other semi-final clash.\n\nZimbabwes qualification marks their return to the prestigious global tournament after missing out on last years edition.\n\nWith the pressure of qualification lifted, Zimbabwes batting line-up delivered with ease, chasing down Kenyas target of 122 runs in comfortable fashion.\n\nTournament standout Brian Bennett was once again the star performer, smashing 51 runs off just 25 balls, the fastest innings by a Zimbabwean batsman this year.\n\nZimbabwe and Namibia will now meet in the Africa Qualifiers final on Saturday at Harare Sports Club.\n\nThe 2026 T20 World Cup will be co-hosted by Sri Lanka and India. Seventeen of the 20 slots have already been filled, with the remaining three to be decided at the Asia-Pacific Qualifiers in Oman next week.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/02164146/chevrons.jpeg",
            "description": "<p>By Sports Reporter The Zimbabwe senior men’s cricket team sealed qualification for the 2026 ICC T20 World Cup on Thursday after defeating Kenya by seven wickets in the semi-finals of the Africa Qualifiers at Harare Sports Club. The Chevrons join Namibia, who booked their ticket with a 63-run win over Tanzania in the other semi-final</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chevrons-qualify-for-2026-t20-world-cup/\">Chevrons qualify for 2026 T20 World Cup</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "02 Oct 2025"
        },
        {
            "title": "In Pictures: Shoko Festival marks 15 Years with “The Legacy XV” edition",
            "url": "https://www.newzimbabwe.com/in-pictures-shoko-festival-marks-15-years-with-the-legacy-xv-edition/",
            "content": "Shoko Festival marked its 15th anniversary with a landmark edition themedThe Legacy XV, bringing together international collaborations and local talent. The three-day urban culture celebration ran from September 25 to 27 in Harare and Chitungwiza.\n\nPictures by Shoko Festival\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/02114014/IMG_0633.jpg",
            "description": "<p>Shoko Festival marked its 15th anniversary with a landmark edition themed “The Legacy XV”, bringing together international collaborations and local talent. The three-day urban culture celebration ran from September 25 to 27 in Harare and Chitungwiza. Pictures by Shoko Festival</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-pictures-shoko-festival-marks-15-years-with-the-legacy-xv-edition/\">In Pictures: Shoko Festival marks 15 Years with “The Legacy XV” edition</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "02 Oct 2025"
        },
        {
            "title": "Cardi B claims Nicki Minaj is on drugs, bipolar, and her husband takes her credit card",
            "url": "https://www.newzimbabwe.com/cardi-b-claims-nicki-minaj-is-on-drugs-bipolar-and-her-husband-takes-her-credit-card/",
            "content": "Complex\n\nAs the fiery beef betweenNicki MinajandCardi Brages on, the two rappers continue to fire off inflammatory accusations against each other.\n\nIn the latest installment of the saga, Cardi accuses Minaj of being on drugs. Quiet as kept the truth is you BEEN diagnosed with schizophrenia and bipolar for almost 9 years and you also on heavy drugs COCAINE..PERCS.. AND XANAX!!! the Bodak Yellow rapper alleges. You dont listen to nobody around you.. the only person that have the power is Kenneth Petty but you know what happens wit that Amex when you sedated.\n\nCardi is referring to Minajs husband,Kenneth Petty,claiming he takes away her credit card.\n\nCardi B on X\n\nThe rapper also warned Minaj to keep her child out of the arguments, while doubling down on her claim that Minajs son, Papa Bear, is developmentally disabled. Im letting you know again.. stop playing with my kid btch.. you just mad cuz your son fav color is 5.. GET TF ON YOU CRACKHEAD, she wrote on X.\n\nCardi B on X\n\nMinaj fired back, writing, tucking a DL man raw & got pregnant wit another monkey. You said oh well, he all our baby daddies now, referring to Stefon Diggs allegedly fathering a child with another woman. Your husband said he NEVER LIKED YOU. Your pussy on YUCK. HUBBY told PEE YEARS ago how UGLY you look always swollen & botched in the face from surgery. So guess what? Zoo TAKE MY MONEY!!!!! YASSSSS ZADDY. OWWWWW. Its BOTH OUR MONEY NEOW ZADDY.\n\nNicki Minaj on X\n\nShe also brought up Quavo, the former Migos member alongside Cardis ex-husband, Offset. Quavo was it worth it dummy? No career, takeoff gone. Remember you told me u were the Beyonc of the group? I laughed so hard inside. Anyway. Pay offset his alimony Barney B.\n\nOn Monday (Sept. 29), their feud resurfaced following the release of Cardis latest album,Am I The Drama?Since then, the two have exchanged devastating blows, with the conflict escalating from petty remarks about album sales to accusations of drug use, assault, and more.\n\nMinaj took aim at Cardis youngest, tweeting, Kulture vulture you ugly too, and Cardi countered with, Your son nonverbal cuz you fucked him up wit them drugs.\n\nThe feud entered its third day with no end in sight, and Minajs 2026 album could add further fuel to the fire. Of course, we rounded up all the wild and viciousinsults on social media between the two here.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/02061053/cardinicki_yaqumh.webp",
            "description": "<p>Complex As the fiery beef between Nicki Minaj and Cardi B rages on, the two rappers continue to fire off inflammatory accusations against each other. In the latest installment of the saga, Cardi accuses Minaj of being on drugs. “Quiet as kept the truth is you BEEN diagnosed with schizophrenia and bipolar for almost 9 years and you also</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cardi-b-claims-nicki-minaj-is-on-drugs-bipolar-and-her-husband-takes-her-credit-card/\">Cardi B claims Nicki Minaj is on drugs, bipolar, and her husband takes her credit card</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "02 Oct 2025"
        }
    ]
}