{
    "news": [
        {
            "title": "Trump ambushes South African president by playing video alleging ‘genocide’ in South Africa",
            "url": "https://www.newzimbabwe.com/trump-ambushes-south-african-president-by-playing-video-alleging-genocide-in-south-africa/",
            "content": "Sky News\n\nDonald Trump has ambushed South Africas president during a White House meeting by playing a video purportedly showing evidence of a genocide of white people in the African country.\n\nThe US president, who was hosting leader Cyril Ramaphosa in the Oval Office, said the footage showed the graves of thousands of white farmers.\n\nAfter an initial friendly chat where Trump complimented South African golfers in the room, a montage of clips was played as Mr Ramaphosa sat quietly and mostly expressionless. He later said: Id like to know where that is because this [the videos] Ive never seen.\n\nThe lights were dimmed in the Oval Office as the videos were shown, including of South African officials allegedly calling for violence against white farmers.\n\nThe scene in the heart of the White House administration was reminiscent of Mr Trumps ambush of Ukraines Volodymyr Zelenskyy last February.\n\nSouth Africa has rejected the allegation that white people are disproportionately targeted by crime.\n\nThe clips include one of a communist politician playing a controversial anti-apartheid song that includes lyrics about killing a farmer.\n\nTrump accused South Africa of failing to address the killing of white farmers. People are fleeing South Africa for their own safety, the US president said. Their land is being confiscated and in many cases theyre being killed.\n\nAlluding to people in the videos, Trump said: These are people that are officials and theyre saying kill the white farmer and take their land.\n\nThe US president then displayed printed copies of news articles that he said showed white South Africans who had been killed, saying death, death as he flipped through them.\n\nHe added of one article: Heres burial sites all over the place, these are all white farmers that are being buried.\n\nSouth African leader rejects allegations\n\nRamaphosa pushed back against Trumps accusations, by responding: What you saw, the speeches that were being made, that is not government policy. We have a multi-party democracy in South Africa that allows people to express themselves, political parties to adhere to various policies.\n\nAnd in many cases or in some cases, those policies do not go along with government policy.\n\nOur government policy is completely, completely against what he [a person in the video montage] was saying. Even in the parliament. And they are a small minority party which is allowed to exist in terms of our constitution.\n\nRamaphosa also said of the behaviour alleged by Mr Trump: We are completely opposed to that.\n\nRamaphosa said there was crime in South Africa, and the majority of victims were black. Mr Trump cut him off and said: The farmers are not black. The South African president responded: These are concerns we are willing to talk to you about.\n\nExperts in South Africa have said there is no evidence of white people being targeted, although farmers of all races are victims of violent home invasions in a country that suffers from a very high crime rate.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/21194112/skynews-donald-trump-cyril-ramaphosa_6923546.jpg",
            "description": "<p>Sky News Donald Trump has ambushed South Africa’s president during a White House meeting by playing a video purportedly showing evidence of a “genocide” of white people in the African country. The US president, who was hosting leader Cyril Ramaphosa in the Oval Office, said the footage showed the graves of thousands of white farmers.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/trump-ambushes-south-african-president-by-playing-video-alleging-genocide-in-south-africa/\">Trump ambushes South African president by playing video alleging ‘genocide’ in South Africa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "21 May 2025"
        },
        {
            "title": "Warriors drawn against South Africa at 2025 COSAFA Cup tournament",
            "url": "https://www.newzimbabwe.com/warriors-drawn-against-south-africa-at-2025-cosafa-cup-tournament/",
            "content": "BySports Reporter\n\nZimbabwe senior mens national team has been drawn in the same pool as host South Africa at the 2025 COSAFA Cup tournament.\n\nThe prestigious Southern Africa football tournament will see 14 teams battling out this year.\n\nThe competitors are Zimbabwe, South Africa, Mozambique, Botswana, Namibia, Mauritius, Lesotho, Eswatini, Madagascar, Comoros, Malawi, Angola and guest nation Morocco.\n\nThis years tournament will kick off on June 4 and will run for ten days up to June 14.\n\nZimbabwe was drawn in pool A together with Mozambique, Mauritius and hosts South Africa, while pool B consist of Namibia, Angola, Malawi and Lesotho.\n\nPool C will see Madagascar, Eswatini and invitational side Morocco in action, while Pool D has Zambia, Comoros and Botswana.\n\nThe Warriors will be hoping for a better performance this year following last seasons poor show, which saw them fail to progress beyond the group stages.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/20185711/warriors-.webp",
            "description": "<p>By Sports Reporter Zimbabwe senior men’s national team has been drawn in the same pool as host South Africa at the 2025 COSAFA Cup tournament. The prestigious Southern Africa football tournament will see 14 teams battling out this year. The competitors are Zimbabwe, South Africa, Mozambique, Botswana, Namibia, Mauritius, Lesotho, Eswatini, Madagascar, Comoros, Malawi, Angola and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/warriors-drawn-against-south-africa-at-2025-cosafa-cup-tournament/\">Warriors drawn against South Africa at 2025 COSAFA Cup tournament</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "21 May 2025"
        },
        {
            "title": "CCC MP Chidziva acquitted of rape",
            "url": "https://www.newzimbabwe.com/ccc-mp-chidziva-acquitted-of-rape/",
            "content": "By Staff Reporter\n\nOpposition lawmaker for Glenview South, Happymore Chidziva who was accused of raping his wifes 16 year old relative has been acquitted.\n\nChidziva, also known as Bvondo, was accused of sexually abusing the minor on three occasions, twice at a local hotel and at a lodge in Waterfalls.\n\nProsecutors alleged that the legislator sweet-talked the girl into believing that he would secure employment for her before raping her.\n\nAt one time, heallegedly told the girl that he would secure employment for her abroad and change her life.\n\nHowever, Harare Magistrate Letwin Rwodzi cleared Chidziva of wrongdoing after a full trial, ruling that the prosecution failed to prove its case.\n\nThe magistrate also said the state failed to prove that Chidziva ever tried to secure employment for the minor.\n\nThe NPA was alleging that sometime in April 2024, Chidziva called the complainant and asked her to meet at Zanu PF Headquarters traffic lights, where he picked her up.\n\nIt was alleged that the MP told the girl that his car had broken down and drove her to a hotel in Harare CBD, where he asked her for sex.\n\nThe girl allegedly refused and told Chidziva that she was not ready.\n\nThe state alleged that Chidziva however took the girl to a room where he raped her without protection before giving her US$25.\n\nThe prosecution said after the alleged rape, the MP hired a taxi before he disembarked at a service station along Willowvale Road while the complainant proceeded to Glen View.\n\nThe following morning the accused person sent a message instructing her to buy some morning-after pills with the money he gave her, and her cousin was holding her phone and she saw the message, the MPs trial was told.\n\nThe complainant then told her cousin that she slept with the accused person and he was telling her to buy morning-after pills.\n\nIt was alleged that sometime in July 2024, the complainant told her aunt that Chidziva had found a job for her in Marimba as a domestic worker.\n\nOn that same day, it was alleged that Chidziva took the girl to a guesthouse in Waterfalls where he raped heragain.\n\nAfter the abuse, the teen did not return home but went to stay in Ushewokunze with her friend and her parents.\n\nIt was further alleged that on August 9, 2024, around 5PM, the MP called the teenager whilst she was in town and asked her to meet him at Cresta Lodge in Masasa.\n\nThe complainant then hired a taxi to Cresta Lodge, where she met the accused person. They then went into a room and the accused person then went out and returned at around midnight.\n\nThe accused person asked her to have sexual intercourse with him, and she refused and told him that she was tired.\n\nProsecutors alleged Chidziva then pleaded with the teen, promising her a job outside Zimbabwe and she complied.\n\nThe 16-year-old then returned to Ushewokunze, where she was chased away by her friends mother because she had not slept at home the previous night.\n\nThe court heard that she then went and stayed with her cousin in Budiriro 1, but her aunt had already filed a missing persons report at Budiriro Police Station.\n\nShe later presented herself to the police, where she narrated her ordeal leading to Chidzivas arrest.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/08/31061449/Happymore-Bvondo-Chidziva.webp",
            "description": "<p>By Staff Reporter Opposition lawmaker for Glenview South, Happymore Chidziva who was accused of raping his wife’s 16 year old relative has been acquitted. Chidziva, also known as Bvondo, was accused of sexually abusing the minor on three occasions, twice at a local hotel and at a lodge in Waterfalls. Prosecutors alleged that the legislator</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ccc-mp-chidziva-acquitted-of-rape/\">CCC MP Chidziva acquitted of rape</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "21 May 2025"
        },
        {
            "title": "More nights in jail for South African man who was driving stolen Toyota Corolla to Zimbabwe",
            "url": "https://www.newzimbabwe.com/more-nights-in-jail-for-south-african-man-who-was-driving-stolen-toyota-corolla-to-zimbabwe/",
            "content": "IOL\n\nA 31-year-old man has appeared before the Polokwane Magistrates Court in Limpopo after he was arrested when police intercepted another stolenToyota Corolla Crosssport utility vehicle which was apparently being driven towards the Beitbridge port of entry.\n\nProvincial police spokesperson in Limpopo, Brigadier Hlulani Mashaba, told IOL that Mikael Mlambo was remanded in custody, and the court postponed the matter to Monday next week.\n\nMashaba said the matter was postponed for profiling of the arrested man. Police have since established that Mlambo is a South African national.\n\nEarlier,IOL reported that thegrey SUV that was driven by Mlambo in Limpopo was reported stolen earlier this month, around Pretoria Central.\n\nProvincial police spokesperson in Limpopo, Brigadier Hlulani Mashaba said the grey SUV was reported stolen earlier this month, around Pretoria central. Image: SAPS\n\nOn Friday, 16 May 2025, members of provincial Flying Squad were busy conducting routine patrol duties when they received intelligence information about a grey Toyota Corolla Cross SUV vehicle that was reported stolen this month, said Mashaba.\n\nThe vehicle was allegedly travelling at high speed along the N1 South public road and was destined to be smuggled to Zimbabwe.\n\nThe police immediately commenced an intensive search for the stolen vehicle until it was positively spotted driving outside Polokwane.\n\nPolice officers attempted to stop the speeding vehicle, but the driver refused to yield.\n\nA car chase ensued until the vehicle was intercepted at Nirvana robots. It was searched and police suddenly discovered a damaged tracking device removed from the vehicle, said Mashaba.\n\nThe 31-year-old man driving the stolen vehicle could not produce authentic documentation proving ownership, and he was immediately placed under arrest.\n\nThe arrested driver was charged for possession of a suspected stolen motor vehicle.\n\nProvincial police spokesperson in Limpopo, Brigadier Hlulani Mashaba said the grey SUV was reported stolen earlier this month, around Pretoria central. Image: SAPS\n\nMeanwhile, provincial commissioner of police in Limpopo, Lieutenant General Thembi Hadebe has saluted the law enforcement team which intercepted and recovered the vehicle.\n\nShe urged the team to continue in their concerted efforts to combat cross border crimes.\n\nEarlier on Tuesday,IOL reported that police in Limpopo announced a significant breakthrough with the recovery of two vehicles, a Toyota Corolla Cross and a Toyota Hilux GD-6valued at approximately R1.4 million, which were destined to be smuggled out of South Africa.\n\nMashaba said the two vehicles were meant to be driven across the Beitbridge port of entry, into the neighbouring Zimbabwe on Sunday.\n\nIn a co-ordinated anti-smuggling operation involving SAPS Anti-Smuggling Team, Tshimollo Security and Investigation, and Reflex Anti-Hijacking Security, the officers intercepted a Toyota Hilux GD-6 double cab on the R101 near Polokwane weighbridge. During the stop, one male suspect fled into nearby bushes, while two female suspects attempted to escape but were apprehended after a foot chase, said Mashaba.\n\nThe women aged 19 and 20 were arrested, and are facing charges of possession of a suspected stolen motor vehicle.\n\nA man escaped on foot, evading arrest while two women aged 19 and 20 were arrested for possession of a Toyota Hilux GD-6 double cab bakkie. Image: SAPS\n\nPreliminary investigations confirmed that the vehicle was stolen on 16 May 2025 in the Garsfontein policing area in Pretoria East, Gauteng.\n\nIn a separate but related intelligence-driven operation, Mashaba said officers intercepted a Toyota Corolla Cross at Mokopane CBD on the R101 road, which was also en route to the Beitbridge port of entry.\n\nInvestigations revealed that this vehicle had been reported stolen at the Wierdabrug (City of Tshwane) policing area on Friday. The driver, a 34-year-old undocumented foreign national, was arrested, said Mashaba.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/21052738/Screenshot-2025-05-21-at-06.26.54.png",
            "description": "<p>IOL A 31-year-old man has appeared before the Polokwane Magistrate’s Court in Limpopo after he was arrested when police intercepted another stolen Toyota Corolla Cross sport utility vehicle which was apparently being driven towards the Beitbridge port of entry. Provincial police spokesperson in Limpopo, Brigadier Hlulani Mashaba, told IOL that Mikael Mlambo was remanded in custody,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/more-nights-in-jail-for-south-african-man-who-was-driving-stolen-toyota-corolla-to-zimbabwe/\">More nights in jail for South African man who was driving stolen Toyota Corolla to Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "21 May 2025"
        },
        {
            "title": "Parliament: Private sector practising modern slavery, hiring interns for cheap labour",
            "url": "https://www.newzimbabwe.com/parliament-private-sector-practising-modern-slavery-hiring-interns-for-cheap-labour/",
            "content": "By Anna Chibamu\n\nTHE private sector has been accused of practising modern slavery, with companies employing mostly interns and underpaying them to save on costs.\n\nMarondera Central MP Caston Matewu raised this issue on a point of national interest in Parliament this Tuesday, describing the situation as new day modern slavery.\n\nMatewu told Speaker Jacob Mudenda that the private sector, particularly in the hospitality and tourism industry, was not rewarding interns.\n\nThe legislator alleged that most private companies have interns constituting 70% of their staff, and this is done to cut costs.\n\nMy point of national interest arises from the new day modern slavery, which is happening in the private sector.\n\nYou find that especially in the hospitality and tourism industry, most of the institutions are employing at least 70% interns who are not paid.\n\nSome who are given less than US$50 but have to work 12-hour shifts, and most of these institutions are doing this to save costs, Matewu said.\n\nNow that has two impacts, this means that those in such industries and qualified do not have jobs and that brings our unemployment rate high.\n\nIt is also slavery to those who are being made to work on the basis that they are being trained, yet they are actually covering for the profits of these institutions.\n\nMatewu called upon Parliament to come up with laws that help deal with the challenge.\n\nI think this August House must come up with policies and solutions to ensure that we curb this scourge that is going on in the private sector, Matewu told the Speaker.\n\nIn his response, Mudenda urged the MP to bring the matter as a motion to allow the responsible ministry to come up with answers and solutions.\n\nWhy do you not come up with a motion to address the issue in detail so that it covers the responsible ministry to respond accordingly? Mudenda said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/21043603/Caston-Matewu.webp",
            "description": "<p>By Anna Chibamu THE private sector has been accused of practising “modern slavery”, with companies employing mostly interns and underpaying them to save on costs. Marondera Central MP Caston Matewu raised this issue on a point of national interest in Parliament this Tuesday, describing the situation as “new day modern slavery”. Matewu told Speaker Jacob</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/parliament-private-sector-practising-modern-slavery-hiring-interns-for-cheap-labour/\">Parliament: Private sector practising modern slavery, hiring interns for cheap labour</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "21 May 2025"
        },
        {
            "title": "Chikafa bounces back at CAPS United as team manager",
            "url": "https://www.newzimbabwe.com/chikafa-bounces-back-at-caps-united-as-team-manager/",
            "content": "By Sports Reporter\n\nCAPS United has appointed Limited Chikafa as the new team manager.\n\nChikafas appointment marks his return to the club, which he previously served as a player.\n\nThe CAPS United legend played for the famous 2004 and 2005 back-to-back championship-winning side, which was led by Charles Mhlauri.\n\nHis latest appointment marks his reunion with new gaffer Ian Bakala, whom he played with back then at CAPS United.\n\nChikafa joins CAPS United from financially struggling Kwekwe United, which is currently stuck at the bottom of the log.\n\nThe new development is part of CAPS United club president Farai Jeres mission to return all former players as technical team members.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/21051041/chikafa-caps.jpeg",
            "description": "<p>By Sports Reporter CAPS United has appointed Limited Chikafa as the new team manager. Chikafa’s appointment marks his return to the club, which he previously served as a player. The CAPS United legend played for the famous 2004 and 2005 back-to-back championship-winning side, which was led by Charles Mhlauri. His latest appointment marks his reunion</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chikafa-bounces-back-at-caps-united-as-team-manager/\">Chikafa bounces back at CAPS United as team manager</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "21 May 2025"
        },
        {
            "title": "Rights lawyers petition High Court over “vague, badly drafted” PVO Act",
            "url": "https://www.newzimbabwe.com/rights-lawyers-petition-high-court-over-vague-badly-drafted-pvo-act/",
            "content": "By Mary Taruvinga\n\nThe Zimbabwe Lawyers for Human Rights (ZLHR) has filed an application at the High Court seeking an order to declare some repressive provisions of the Private Voluntary Organisations (PVO) Amendment Act as unconstitutional and set them aside.\n\nThe ZLHR said some of the provisions criminalise legitimate critical development and human rights work and over-regulate PVOs.\n\nThe PVO Amendment Act, which was enacted and published in the Government Gazette on 11 April 2025, according to the application, constitutes a fundamental encroachment of rights of members of their organisation, which is an independent universitas established by law.\n\nZLHR opines that the impugned amendments contained in the PVO Amendment Act constitute unconstitutional over-regulation, over-legislation and criminalisation of innocent important charitable, developmental and human rights work.\n\nThe provisions of the PVO Amendment Act, ZLHR argues, overreach by violating the freedom of assembly and association guaranteed under section 58(1) of the Constitution, the freedom of expression under section 61 of the Constitution, the right to administrative justice guaranteed under section 68(1) and (2) of the Constitution, the right to a fair hearing under section 69(1), (2) and (3) of the Constitution and section 71 of the Constitution, which provides for property rights. ZLHR further argues that the impugned provisions of the PVO Amendment Act were vague and badly drafted and contained arbitrary powers and over-regulation of PVOs, said ZLHR.\n\nZLHR also said the PVO Amendment Act has the effect of concentrating arbitrary powers in the Minister of Public Service, Labour and Social Welfare and the Registrars office and contains excessive executive interference in the internal affairs of PVOs.\n\nIt said the impugned provisions of the PVO Amendment Act have the net effect of effectively allowing the Executive to run PVOs and to deregister those that authorities dislike on very nebulous grounds.\n\nTo this end ZLHR is seeking a High Court order of constitutional invalidity, declaring section 4, section 5 as read with section 9(5), section 6, section 13A, section 14, and section 21, of the Private Voluntary Organisations Act (as amended by the PVO Amendment Act) to be ultra vires the Constitution and to be set aside.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/21073523/pvo.jpg",
            "description": "<p>By Mary Taruvinga The Zimbabwe Lawyers for Human Rights (ZLHR) has filed an application at the High Court seeking an order to declare some “repressive” provisions of the Private Voluntary Organisations (PVO) Amendment Act as unconstitutional and set them aside. The ZLHR said some of the provisions criminalise legitimate critical development and human rights work</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rights-lawyers-petition-high-court-over-vague-badly-drafted-pvo-act/\">Rights lawyers petition High Court over “vague, badly drafted” PVO Act</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "21 May 2025"
        }
    ]
}