{
    "news": [
        {
            "title": "UZ students protest against replacement of striking lecturers",
            "url": "https://www.newzimbabwe.com/uz-students-protest-against-replacement-of-striking-lecturers/",
            "content": "By Thandiwe Garusa\n\nUNIVERSITY of Zimbabwe (UZ) students are standing in solidarity with their striking lecturers, vowing to resist any attempts to bring in replacement staff.\n\nThe lecturers have been on an indefinite strike against poor salaries, which began on 16 April.\n\nThey held their third demonstration at UZ, Tuesday, where they vowed to press on with the industrial action until their demands are met.\n\nDelivering a solidarity speech Tuesday during the striking lecturers third demonstration, Zimbabwe National Students Union (ZINASU) representative Darlington Chingwena said their education had been stolen, accusing university authorities of threatening their future by neglecting the plight of academic staff.\n\nOur education was stolen from us and we are going to fight and demand our right to education.\n\nWe are not going to tolerate the hiring of scabs to teach us, our future was robbed, our future is at stake, we are going to pursue and recover our education and no one is going to stop or threaten us because we are even prepared to die for this thing, Chingwena said.\n\nUZ lecturers are demanding a return to their pre-2018 salaries when a junior lecturer earned US$2,250.Currently, they earn US$230.\n\nAbout a week ago, the university announced plans to replace striking lecturers with temporary staff earning just US$5.50 per hour, 40% of which will be paid in local ZWG currency.\n\nThe students vowed they will not accept the replacement of their lecturers with scab lecturers.\n\nThe idea of scabs is going to be met with fire and fury like what the world has never seen before, the students are ready, and we are not going to surrender until the right thing is done, Chingwena said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/28030519/UZ-strike-9-scaled.jpg",
            "description": "<p>By Thandiwe Garusa UNIVERSITY of Zimbabwe (UZ) students are standing in solidarity with their striking lecturers, vowing to resist any attempts to bring in replacement staff. The lecturers have been on an indefinite strike against poor salaries, which began on 16 April. They held their third demonstration at UZ, Tuesday, where they vowed to press</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uz-students-protest-against-replacement-of-striking-lecturers/\">UZ students protest against replacement of striking lecturers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "28 May 2025"
        },
        {
            "title": "UZ on the brink of collapse – striking lecturers say as students face uncertain future",
            "url": "https://www.newzimbabwe.com/uz-on-the-brink-of-collapse-striking-lecturers-say-as-students-face-uncertain-future/",
            "content": "By Darlington Gatsi\n\nVaforomani by the late System Tazvida blared from the public announcement system at the University of Zimbabwe, encapsulating the struggles of the lecturers on Tuesday morning.\n\nThe yesteryear song, a hard-hitting social commentary, challenges those in authority to acknowledge the plight of the working class by improving their conditions.\n\nThese sentiments mirror the grievances of University of Zimbabwe (UZ) lecturers, who have now spent 42 days on strike, marked by picketing at the institution.\n\nUZ lecturer and renowned author Memory Chirere told NewZimbabwe.com that their current salaries have left them at the mercy of poverty.\n\nOur strike is for the demand of a better salary. An ordinary lecturer is getting less than US$229 a month, which is far too little compared to what we used to receive before 2018. We cannot pay our bills, feed our families, or send our children to school, said Chirere.\n\nThe lecturers, under the Association of University Teachers (AUT), have been locked in a dispute with UZ, demanding that their grievances be addressed.\n\nHowever, the university has remained mum, threatening to abandon academic processes as lecturers remain resolute.\n\nChirere warned that if the situation remains unresolved, UZ risks cancelling graduation due to the ongoing impasse.\n\nWhat this means is, since we have been out for over a month, there will not be exams for the students because they have not been taught. It also means there may well be no graduation this year.\n\nThe exams for Block Two have not been processed. The teaching for Block Three has not taken place, and the teaching for Block Four has not taken place. The university is still at a standstill, said Chirere.\n\nLecturers are demanding salaries of US$2,500, which they argue are in line with other higher education institutions in Southern Africa.\n\nAn AUT spokesperson told NewZimbabwe.com that their situation is worsened by the lack of essential teaching tools, forcing them to use personal equipment.\n\nThe issues are quite numerous. At UZ, from time immemorial, this has been a huge challengeworse under the current vice-chancellor. We have now adopted Education 5.0, which requires a big chunk of online teaching and adapting to global trends.\n\nThey have not provided tools of the trade. For example, we do not have computers issued for work. There are no smartphones, and we do not have data.\n\nThe other issue is the working environment itself. UZ administration is dictatorial. There is no platform for engagement, said Obvious Vengeyi, the AUT spokesperson.\n\nIn response, UZ has taken a heavy-handed approach, suspending striking lecturers and reportedly recruiting replacement staff at US$3 per hour.\n\nAccording to AUT, the newly hired staff are insufficient to cater to the overwhelming number of students enrolled at the institution.\n\nChirere expressed concern over the continued silence from UZ leadership, led by Vice-Chancellor Paul Mapfumo.\n\nWhat worries us is that there seems to be no response from the responsible authorities within the University of Zimbabwe about our plight, said Chirere.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/27161450/UZ-strike-4-scaled.jpg",
            "description": "<p>By Darlington Gatsi “Vaforomani” by the late System Tazvida blared from the public announcement system at the University of Zimbabwe, encapsulating the struggles of the lecturers on Tuesday morning. The yesteryear song, a hard-hitting social commentary, challenges those in authority to acknowledge the plight of the working class by improving their conditions. These sentiments mirror</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uz-on-the-brink-of-collapse-striking-lecturers-say-as-students-face-uncertain-future/\">UZ on the brink of collapse – striking lecturers say as students face uncertain future </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "28 May 2025"
        },
        {
            "title": "In Pictures: UZ lecturers stage third demonstration",
            "url": "https://www.newzimbabwe.com/in-pictures-uz-lecturers-stage-third-demonstration/",
            "content": "Below are some images from the University of Zimbabwe, where lecturers staged their third demonstration against poor salaries. The industrial action began on April 16.\n\nPictures by Thandiwe Garusa\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/28030530/UZ-strike-10-scaled.jpg",
            "description": "<p>Below are some images from the University of Zimbabwe, where lecturers staged their third demonstration against poor salaries. The industrial action began on April 16. Pictures by Thandiwe Garusa </p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-pictures-uz-lecturers-stage-third-demonstration/\">In Pictures: UZ lecturers stage third demonstration</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "28 May 2025"
        },
        {
            "title": "Tagwirei-led Land Tenure Committee a coterie of looters – Mawarire",
            "url": "https://www.newzimbabwe.com/tagwirei-led-land-tenure-committee-a-coterie-of-looters-mawarire/",
            "content": "By Staff Reporter\n\nLATE President Robert Mugabes spokesperson Jealousy Mawarire has come out in support of a constitutional court application by disgruntled war veterans who are challenging the legality of President Emmerson Mnangagwas Lands Tenure Implementation Committee.\n\nThe Committee, led by businessman Kudakwashe Tagwirei, seeks to establish freehold on agricultural land despite clear constitutional provisions placing its ownership in the State.\n\nAccording to war veterans, the committee has been demanding payments of an unclear nature from beneficiaries of the countrys Land Reform Programme, with some being ordered to pay as much as US$1.5 million.\n\nWar veterans want the committee declared unlawful and for it to let all land issues be dealt with by the constitutionally mandated Land Commission.\n\nSpeaking on SABCs Channel Africa, in support of the court application, Mawarire described the committee as a quartet of looters and Mnangagwas land barons.\n\nThe Presidents attempt to introduce freehold land ownership is a huge departure from the provisions of the constitution and the overarching objective of the liberation struggle, which was to deal with private ownership of land, said Mawarire.\n\nWe have a President who does not respect the constitution for which he was sworn in to uphold.\n\nIn the event that the President has abrogated his responsibilities and has actually, in this case, started to behave like a land baron, then the war veterans are duty-bound to step in and offer those checks and balances that the opposition can no longer do.\n\nThey have launched a constitutional court application in order to put a stop to this madness that is being presided over by the President and his coterie of looters.\n\nIf you look at the whole scheme, this is a parallel structure formed by the President outside the provision of the constitution.\n\nSection 296, Section 297 and Section 72 of the Zimbabwean constitution confirm State ownership of all agricultural land, confirm the role of the Land Commission and further cancel all existing title deeds for it.\n\nMawarire, who has been very vocal, not just about the land issue but Mnangagwas attempts to unconstitutionally stay in power beyond his two terms up to 2030, said the fact that war veterans were now confronting Zanu PF themselves indicated an absence of opposition politicians.\n\nAfter close to two decades of keeping Zanu PF on its toes, the MDC, now led by Douglas Mwonzora, is a shell of its former glory. The Citizens Coalition for Change (CCC), once headed by Nelson Chamisa, was hijacked by self-styled secretary general Sengezo Tshabangu and has since been singing in favour of Mnangagwas term extension.\n\nChamisa withdrew from the party and announced a sabbatical.\n\nIt is actually an indication that we no longer have opposition politics in the country, that is why you find war veterans have stepped in to provide checks and balances.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/03/17054811/Kuda-Tagwirei.jpg",
            "description": "<p>By Staff Reporter LATE President Robert Mugabe’s spokesperson Jealousy Mawarire has come out in support of a constitutional court application by disgruntled war veterans who are challenging the legality of President Emmerson Mnangagwa’s Lands Tenure Implementation Committee. The Committee, led by businessman Kudakwashe Tagwirei, seeks to establish freehold on agricultural land despite clear constitutional provisions</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tagwirei-led-land-tenure-committee-a-coterie-of-looters-mawarire/\">Tagwirei-led Land Tenure Committee a coterie of looters – Mawarire</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "28 May 2025"
        }
    ]
}