{
    "news": [
        {
            "title": "Warriors fall to Rwanda as winless streak continues",
            "url": "https://www.newzimbabwe.com/warriors-fall-to-rwanda-as-winless-streak-continues/",
            "content": "By Sports Reporter\n\nRwandas Gilbert Mugishas 40th-minute strike was all the team needed to secure a 1-0 win over Zimbabwe in a Group C Africa 2026 World Cup Qualifier at Orlando Stadium on Tuesday afternoon.\n\nZimbabwe produced a lacklustre first-half performance, failing to create any meaningful chances or register a single shot on target.\n\nThe Warriors improved slightly in the second half following the introduction of Tymon Machope and Bill Antonio, who replaced Tawanda Maswanhise and Prosper Padera at the restart.\n\nTheir golden opportunity came in the 72nd minute when Machope pulled a pass back for Tawanda Chirewa, who failed to convert despite the Rwandan goalkeeper being out of position.\n\nThe result piles more pressure on Warriors coach Michael Nees, who was heavily criticised after Fridays defeat to Benin.\n\nZimbabwe remains the only winless side in Group C, and Tuesdays loss all but ended their hopes of qualifying for the 2026 World Cup.\n\nOf the eight matches played so far, the Warriors have collected just four points out of a possible 24. Since 2010, Zimbabwe has managed only two wins in 29 World Cup Qualifier fixtures.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/09163821/IMG-20250909-WA0057.jpg",
            "description": "<p>By Sports Reporter Rwanda’s Gilbert Mugisha’s 40th-minute strike was all the team needed to secure a 1-0 win over Zimbabwe in a Group C Africa 2026 World Cup Qualifier at Orlando Stadium on Tuesday afternoon. Zimbabwe produced a lacklustre first-half performance, failing to create any meaningful chances or register a single shot on target. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/warriors-fall-to-rwanda-as-winless-streak-continues/\">Warriors fall to Rwanda as winless streak continues</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "09 Sep 2025"
        },
        {
            "title": "Cassper Nyovest embarks on weight loss journey after social media criticism",
            "url": "https://www.newzimbabwe.com/cassper-nyovest-embarks-on-weight-loss-journey-after-social-media-criticism/",
            "content": "TshisaLive\n\nCassper Nyovest is on a mission to shed weight after he faced hurtful comments following his performance at the Scorpion Kings with Friends Live concert on August 29.\n\nAfter facing backlash from trolls, the rapper said for the next three months before his #FillUpToyotaStadium concert he is on a weight loss journey.\n\nI was doing cardio all week. This time its a bit more fun because Im playing tennis. Next week Ill start weight training. The comments at the weekend were harsh. It hurt my feelings a bit but sometimes thats what you need, a little push, he said.\n\nIt is a projection, about how you feel about yourself. Body shaming and all of that. You dont know what Im going through. Im going to turn the lemons into lemonade.\n\nThis is not the first time Cassper has undergone a weight loss journey before his Fill Up concerts.\n\nIn 2022 Cassper did it before his Fill Up Mmabatho concert in Mahikeng.\n\nI cant explain how proud I am of myself. This was by far the hardest weight loss journey for me because I have done this three times and I now knew what it would take for me to get back in shape. To be honest, mentally I didnt feel like I was as strong as I once was and I was demoralised.\n\nIts supposed to get easier by the day but it got harder and harder. I just kept waking up and going. Lost touch with a lot of relationships and people because I zoned into this goal and I had no time for anyone but myself.\n\nLooking at these pictures now Im in awe of myself. I owe it to myself never to let myself go like that again. Big shout out to my training and nutrition team. Shout out to Fight Club for always having their doors open for me at any time I wanted to train. We four weeks out Boys! Lets put on a show! Im back!\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/09051311/nyovest.jpg",
            "description": "<p>TshisaLive Cassper Nyovest is on a mission to shed weight after he faced hurtful comments following his performance at the Scorpion Kings with Friends Live concert on August 29. After facing backlash from trolls, the rapper said for the next three months before his #FillUpToyotaStadium concert he is on a weight loss journey. “I was</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cassper-nyovest-embarks-on-weight-loss-journey-after-social-media-criticism/\">Cassper Nyovest embarks on weight loss journey after social media criticism</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "09 Sep 2025"
        },
        {
            "title": "Zimbabweans seeking  non-immigrant visas to apply in South Africa as suspension continues – U.S Embassy announces",
            "url": "https://www.newzimbabwe.com/zimbabweans-seeking-non-immigrant-visas-to-apply-in-south-africa-as-suspension-continues-u-s-embassy-announces/",
            "content": "By Thandiwe Garusa\n\nZIMBABWEANS seeking non-immigrant visas can now apply only in South Africa, the United States Embassy in Harare has announced.\n\nLast month, the U.S Embassy announced suspension of all routine immigrant and non-immigrant visa services, except for most diplomatic and official visas in Harare.\n\nThe embassy later extended the validity of visas for Zimbabwean applicants working as crew members on ships or airlines to 24 months with multiple entry, with an option of applying outside Zimbabwe due to the pause on immigrant and non-immigrant visa services.\n\nIn a statement Monday, the U.S embassy said the pause remains in effect and Zimbabweans seeking non-immigrant visas can only apply in Johannesburg, while non-residents must use embassies in their countries of habitual residence.\n\nThe pause on visa services in Zimbabwe remains in effect.\n\nZimbabwean residents applying for non-immigrant visas may only apply at the U.S. Consulate General in Johannesburg.\n\nIf you are not a resident of Zimbabwe, you must apply at a U.S. embassy or consulate in your country of habitual residence, the statement reads.\n\nThe authorities also warned of possible long wait times, stricter qualification hurdles for applicants who schedule non-immigrant visa interviews at a U.S. embassy or consulate outside their country of nationality.\n\nApplicants who schedule non-immigrant visa interviews at a U.S. embassy or consulate outside their country of nationality or residence may face greater difficulty qualifying for the visa. Visa application fees are nonrefundable.\n\nMeanwhile, those applying for visas were recently directed to adjust the privacy settings of their personal social media accounts to public to facilitate vetting necessary to establish their identity and admissibility.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/20182253/embassy.jpg",
            "description": "<p>By Thandiwe Garusa ZIMBABWEANS seeking non-immigrant visas can now apply only in South Africa, the United States Embassy in Harare has announced. Last month, the U.S Embassy announced suspension of all routine immigrant and non-immigrant visa services, except for most diplomatic and official visas in Harare. The embassy later extended the validity of visas for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabweans-seeking-non-immigrant-visas-to-apply-in-south-africa-as-suspension-continues-u-s-embassy-announces/\">Zimbabweans seeking  non-immigrant visas to apply in South Africa as suspension continues – U.S Embassy announces</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "09 Sep 2025"
        },
        {
            "title": "Judge rejects father’s bid to reclaim house from son",
            "url": "https://www.newzimbabwe.com/judge-rejects-fathers-bid-to-reclaim-house-from-son/",
            "content": "By Mary Taruvinga\n\nThe High Court has dismissed a fathers attempt to revoke a property registered in his sons name, saying the case reflected evidence of a broken family.\n\nOnias Gotore dragged his son, Pride Gotore, to court in a bitter property dispute, seeking to reclaim a house in Chegutu that he said he had purchased and donated to him.\n\nJustice Philda Muzofa, sitting in Chinhoyi, noted the unusual family feud: It is never easy for a father to drag his son to courts; this is just evidence of a broken family. Something must have gone seriously wrong.\n\nOnias argued the property was a donation that could be revoked because Pride had become disrespectful and violent towards him, and had even tried to sell it against his wishes.\n\nBut the court ruled there was never a valid donation. There was never an intention to gratuitously and without obligation give the 1st respondent the property, Justice Muzofa said. There were strings attached. The applicant intended to continue to derive a benefit from the property.\n\nThe judge stressed that while Onias funded the purchase, the house was always registered in Prides name. The evidence before the Court strongly shows that the applicant purchased the property for the 1st respondent and he had strings attached, the judge said.\n\nDismissing the claim with costs, the judge concluded: Revocation can only be made where there is a valid donation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/13181521/high-court-of-zimbabwe-3.jpg",
            "description": "<p>By Mary Taruvinga The High Court has dismissed a father’s attempt to revoke a property registered in his son’s name, saying the case reflected “evidence of a broken family.” Onias Gotore dragged his son, Pride Gotore, to court in a bitter property dispute, seeking to reclaim a house in Chegutu that he said he had</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/judge-rejects-fathers-bid-to-reclaim-house-from-son/\">Judge rejects father’s bid to reclaim house from son</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "09 Sep 2025"
        },
        {
            "title": "Motorist loses US$10,000 and pistol to attendant at Harare car wash",
            "url": "https://www.newzimbabwe.com/motorist-loses-us10000-and-pistol-to-attendant-at-harare-car-wash/",
            "content": "By Staff Reporter\n\nA HARARE motorist was left counting his losses after a car wash attendant stole a bag containing US$10,000 cash and a pistol from his vehicle.\n\nThe offender, 20-year-old Albert Chimukuyu appeared at the Harare Magistrates Court, where he was convicted of theft from his clients car at a Mabelreign washing bay in March.\n\nChimukuyu was slapped with 13 months imprisonment, of which five months were conditionally suspended. He will, therefore, serve an effective eight months behind bars.\n\nCourt heard that on March 21, 2025, the complainant left the money and firearm inside his Mercedes-Benz before handing it over to the offender for cleaning.\n\nInstead of performing his duties, Chimukuyu fled with the bag containing the valuables.\n\nIt was further heard that following a tip-off, police detectives arrested the offender at Pamuzinda Lodge, Claudia in Harare and recovered US$1,850 in his trousers pocket. The stolen pistol and bag were later recovered during a follow-up search.\n\nOf the stolen cash, only US$3,450 was recovered.\n\nIn a statement following sentencing, the National Prosecuting Authority of Zimbabwe (NPAZ) urged motorists to avoid leaving large sums of money and firearms unattended in vehicles, even when dealing with trusted service providers.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/09045858/Car-wash_.png",
            "description": "<p>By Staff Reporter A HARARE motorist was left counting his losses after a car wash attendant stole a bag containing US$10,000 cash and a pistol from his vehicle. The offender, 20-year-old Albert Chimukuyu appeared at the Harare Magistrates Court, where he was convicted of theft from his client’s car at a Mabelreign washing bay in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/motorist-loses-us10000-and-pistol-to-attendant-at-harare-car-wash/\">Motorist loses US$10,000 and pistol to attendant at Harare car wash</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "09 Sep 2025"
        }
    ]
}