{
    "news": [
        {
            "title": "Beven Capital Ponzi scheme fugitive arrested in UAE after years on the run, extradited to Zimbabwe over $100,000 fraud",
            "url": "https://www.newzimbabwe.com/beven-capital-ponzi-scheme-fugitive-arrested-in-uae-after-years-on-the-run-extradited-to-zimbabwe-over-100000-fraud/",
            "content": "By Mary Taruvinga\n\nA Zimbabwean man accused of masterminding the notorious Beven Capital Ponzi scheme has been extradited from the United Arab Emirates (UAE) and is now facing multiple charges of fraud, theft by deception, and impersonation in Harare.\n\nShepherd Chibaya (36), identified as one of the founders of the collapsed investment scam, was arrested in the UAE after years on the run and handed over to local authorities through Interpol cooperation.\n\nHe has since been remanded in custody pending trial.\n\nAccording to prosecutors, Beven Capital lured unsuspecting investors with promises of 50% returns in just six weeks, only for the schemes operators to vanish with millions.\n\nInstead of helping victims recover their money, Chibaya allegedly re-emerged to exploit them further by posing as a medical doctor at Parirenyatwa and Parktown Hospitals and pretending to have insider access to the schemes management. Authorities say he even became chairman of the defrauded investors group by leveraging these lies.\n\nIn one of the most elaborate scams, between 2020 and 2021, Chibaya allegedly defrauded a female investor of US$98,000, concocting stories about taxes, bribes and legal fees.\n\nHe is accused of faking his own arrest, impersonating a police officer, and later pretending to be dead to avoid detection.\n\nA stolen Samsung S20 cellphone was also traced back to him.\n\nOther counts include defrauding a complainant of US$850 in 2021 under the guise of tax fees and swindling another investor of US$2,000 after promising to help recover a US$30,000 investment while posing on duty as a doctor.\n\nA third investor lost US$2,000 after being promised recovery of his US$30,000 investment, with the accused again pretending to be on duty as a doctor when collecting cash, the court.\n\nAfter years on the run, the accused person was tracked down by Interpol in the UAE and handed over to Zimbabwean authorities. He has since been remanded in custody pending trial.\n\nIf convicted, Chibaya faces lengthy prison time.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/05/30184728/Fraud.jpg",
            "description": "<p>By Mary Taruvinga A Zimbabwean man accused of masterminding the notorious Beven Capital Ponzi scheme has been extradited from the United Arab Emirates (UAE) and is now facing multiple charges of fraud, theft by deception, and impersonation in Harare. Shepherd Chibaya (36), identified as one of the founders of the collapsed investment scam, was arrested</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/beven-capital-ponzi-scheme-fugitive-arrested-in-uae-after-years-on-the-run-extradited-to-zimbabwe-over-100000-fraud/\">Beven Capital Ponzi scheme fugitive arrested in UAE after years on the run, extradited to Zimbabwe over $100,000 fraud</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:38",
            "date": "21 Aug 2025"
        },
        {
            "title": "Police intercept Land Cruiser with 15.7kg gold stash after a tip-off",
            "url": "https://www.newzimbabwe.com/police-intercept-land-cruiser-with-15-7kg-gold-stash-after-a-tip-off/",
            "content": "By Mary Taruvinga\n\nPolice have intercepted a massive gold smuggling operation after receiving a tip-off that led to the recovery of 15,7 kilogrammes of gold worth over US$1,5 million hidden in a Toyota Prado Land Cruiser.\n\nIn a dramatic operation, detectives from the CID Minerals, Flora and Fauna Unit on August 19 tracked down the vehicle, leading to the arrest of three suspects.\n\nThe Zimbabwe Republic Police confirms the arrest of three suspects following the recovery of 15,7 kilogrammes of gold valued at US$1 568 860.00, Nyathi said in a statement.\n\nThe recovered gold has since been surrendered to Fidelity Gold Refinery in Msasa as investigations into the smuggling syndicate intensify.\n\nAuthorities have not yet released the names of the arrested suspects, citing ongoing investigations.\n\nThe latest bust follows heightened scrutiny of gold smuggling networks that have long plagued Zimbabwes mining sector, with law enforcement under pressure to plug leakages.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/07/18124726/Gold-Smuggling.png",
            "description": "<p>By Mary Taruvinga Police have intercepted a massive gold smuggling operation after receiving a tip-off that led to the recovery of 15,7 kilogrammes of gold worth over US$1,5 million hidden in a Toyota Prado Land Cruiser. In a dramatic operation, detectives from the CID Minerals, Flora and Fauna Unit on August 19 tracked down the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/police-intercept-land-cruiser-with-15-7kg-gold-stash-after-a-tip-off/\">Police intercept Land Cruiser with 15.7kg gold stash after a tip-off</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:38",
            "date": "21 Aug 2025"
        },
        {
            "title": "Mental patient kills four elderly persons, child in brutal village attack",
            "url": "https://www.newzimbabwe.com/mental-patient-kills-four-elderly-persons-child-in-brutal-village-attack/",
            "content": "By Mary Taruvinga\n\nTragedy struck in a village in Madlambuzi, Matebeleland South Province, when a suspected mental patient went on a violent rampage, killing five people  among them a 101-year-old and a six-year-old girl  and injuring two others.\n\nThe Zimbabwe Republic Police confirmed the arrest of Phamani Sibanda (43) in connection with the murderscommitted on Wednesday.\n\nThe suspect ran amok, became violent and attacked seven people with a Mopani log, a blunt object and an unknown sharp object while moving aggressively around the village. He was targeting anyone whom he was coming across with, police spokesperson Paul Nyathi said in a statement.\n\nFive people died instantly.\n\nThey were identified as Elliot Khupe (101), Butho Tshuma (97), Constance Sibanda (66), Tiffan Surprise Ndlovu (6), and Catra Matsika (72).\n\nTwo female survivors, aged 90 and 41, were rushed to Madlambuzi Clinic and Plumtree District Hospital for treatment.\n\nThe police urged families to take greater care in monitoring individuals with mental health conditions.\n\nThe Zimbabwe Republic Police implores the public to quickly refer mental patients to medical institutions for treatment and to monitor their medical process and general behaviour in order to curb violent tendencies, Nyathi added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/04/07040958/Crime-and-Murder.jpg",
            "description": "<p>By Mary Taruvinga Tragedy struck in a village in Madlambuzi, Matebeleland South Province, when a suspected mental patient went on a violent rampage, killing five people — among them a 101-year-old and a six-year-old girl — and injuring two others. The Zimbabwe Republic Police confirmed the arrest of Phamani Sibanda (43) in connection with the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mental-patient-kills-four-elderly-persons-child-in-brutal-village-attack/\">Mental patient kills four elderly persons, child in brutal village attack</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:38",
            "date": "21 Aug 2025"
        },
        {
            "title": "Dynamos suspends Marriot’s son for disrupting players’ training",
            "url": "https://www.newzimbabwe.com/dynamos-suspends-marriots-son-for-disrupting-players-training/",
            "content": "By Sports Reporter\n\nDynamos FC has suspended technical staff member Harry Lusengo for disturbing the team players at the training ground.\n\nLusengo, who is the son of Dynamos board chair Bernad Marriot, blocked the team bus from leaving the training ground on Thursday afternoon, forcing players to use public transport.\n\nFollowing the unfortunate disturbances caused by a member of the technical support staff, Harry Lusengo at the teams training ground today, the club management would like to assure all its valued stakeholders that the situation has now been brought under control.\n\nThe incident, which was uncalled for and inappropriate, has seen the club taking the necessary measures to rein in the individual who has, with immediate effect, been suspended from conducting any business related to the team, reads part of Dynamos statement.\n\nDembare went on to encourage team players to remain focused ahead of Sundays match against Greenfuel.\n\nFurther, the Dynamos management would like to assure the stakeholders and general public that concrete measures havebeen put in place to avoid a repeat of such an incident.\n\nThe club would also like to reassure everyone concerned with Dynamos that the players and coaches remain focused and all is set for our crucial Castle Lager Premier Soccer Lager home tie against GreenFuel at Rufaro Stadium (kick-off 3 pm) on Sunday, further read the statement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/21170339/Harry-Lusengo.jpg",
            "description": "<p>By Sports Reporter Dynamos FC has suspended technical staff member Harry Lusengo for disturbing the team players at the training ground. Lusengo, who is the son of Dynamos board chair Bernad Marriot, blocked the team bus from leaving the training ground on Thursday afternoon, forcing players to use public transport. “Following the unfortunate disturbances caused</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dynamos-suspends-marriots-son-for-disrupting-players-training/\">Dynamos suspends Marriot’s son for disrupting players’ training</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:38",
            "date": "21 Aug 2025"
        },
        {
            "title": "Human rights defenders acquitted after year-long trial",
            "url": "https://www.newzimbabwe.com/human-rights-defenders-acquitted-after-year-long-trial/",
            "content": "By Mary Taruvinga\n\nHuman rights activists Robson Chere, Namatai Kwekweza and Samuel Gwenzi, who were arrested after being dragged off a plane last year, are finally free following their acquittal by a Harare magistrate.\n\nThe three walked out of court free after being on trial for over a year, facing disorderly conduct charges.\n\nThey were jointly tried together with others who were arrested on the same charge, who included Vusumuzi Moyo, Phillies Pikitayi, Dephine Gutsa, Simbarashe Blackson, Emmanuel Sitima and Last Chinody, who were also acquitted.\n\nKwekweza (26), Chere (41) and Gwenzi (40) were minutes from taking off on a Fastjet flight to Victoria Falls when they were ordered off a plane at the Robert Gabriel Mugabe International Airport.\n\nPolice accused them of having taken part in an illegal protest outside the Harare Magistrates Court a month earlier, on June 27, in solidarity with over 70 Citizens Coalition for Change activists who were appearing in court.\n\nKwekwezas lawyers successfully argued that she was not in the country on June 27 and accused authorities of arresting the activists as part of an operation driven by paranoia to thwart potential protests during the SADC summit, which Zimbabwe hosted on August 17.\n\nSince 25 July 2024, we have been in and out of courts answering to trumped-up charges which were simply meant to break and discourage us from demanding a just and democratic Zimbabwe. We are finally free after a whole year of persecution. It only strengthened our resolve, Sitima said after the acquittal.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/21055042/chere-namatai-gwenzi.jpeg",
            "description": "<p>By Mary Taruvinga Human rights activists Robson Chere, Namatai Kwekweza and Samuel Gwenzi, who were arrested after being dragged off a plane last year, are finally free following their acquittal by a Harare magistrate. The three walked out of court free after being on trial for over a year, facing disorderly conduct charges. They were</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/human-rights-defenders-acquitted-after-year-long-trial/\">Human rights defenders acquitted after year-long trial</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:38",
            "date": "21 Aug 2025"
        },
        {
            "title": "High Court upholds detention of DRC refugee pending identity verification",
            "url": "https://www.newzimbabwe.com/high-court-upholds-detention-of-drc-refugee-pending-identity-verification/",
            "content": "By Mary Taruvinga\n\nThe High Court has thrown out an urgent bid by a Congolese national seeking immediate release from Harare Remand Prison, ruling that his detention is lawful under the countrys immigration laws.\n\nBenoit Ombeni Mupenzi, who claims to be a refugee in Zimbabwe, had argued that his incarceration was unlawful as he had not been informed of the reasons for his arrest nor shown a valid warrant.\n\nHe told the court that his liberty was being arbitrarily restrained, causing irreparable harm and insisted he was unaware of any offence committed.\n\nSitting at the Harare High Court, Justice Fatima Maxwell held that authorities were acting within the law.\n\nCiting section 8(1) of the Immigration Act [Chapter 4:02], the judge said, The detention of the applicant is in terms of a law which remains in our statute books. Until and unless section 8 of the Immigration Act is declared unconstitutional and such declaration is confirmed by the Constitutional Court, the courts hands are tied.\n\nThe provision gives immigration authorities up to 14 days to verify an individuals identity, nationality and antecedents.\n\nThe Chief Immigration Officer opposed Mupenzis release, stating that his nationality was still under investigation and that none of the documents he presented substantiated his claim to refugee status.\n\nApplicants identity and nationality status have been questioned by the countrys security apparatus, the court was told.\n\nThe judge acknowledged Mupenzis complaint over not being given reasons for his detention, but made it clear that release was not the remedy. Whilst applicant might have a genuine grievance that he was not furnished with reasons for the arrest and detention forthwith, I am not persuaded that the remedy for that is his immediate release, she said.\n\nThere was no order regarding costs.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/29045845/harare-remand.jpg",
            "description": "<p>By Mary Taruvinga The High Court has thrown out an urgent bid by a Congolese national seeking immediate release from Harare Remand Prison, ruling that his detention is lawful under the country’s immigration laws. Benoit Ombeni Mupenzi, who claims to be a refugee in Zimbabwe, had argued that his incarceration was unlawful as he had</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-upholds-detention-of-drc-refugee-pending-identity-verification/\">High Court upholds detention of DRC refugee pending identity verification</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:38",
            "date": "21 Aug 2025"
        },
        {
            "title": "Delayed govt payments force Bitumen World to cut jobs",
            "url": "https://www.newzimbabwe.com/delayed-govt-payments-force-bitumen-world-to-cut-jobs/",
            "content": "By Alois Vinga\n\nDELAYED payments to government contractors have left one of the countrys top construction companies, Bitumen World (BW), with no choice but to cut down jobs.\n\nProblems bedevilling the construction sector are not new, following endless pleading for authorities to consider timely payments for work done in fulfilment of the governments agenda to revamp the countrys infrastructure.\n\nMarket watchers believe the government is withholding the payments, especially in the local ZWG currency, in a bid to curtail parallel market activities, which trigger depreciation. Just recently, mineral exporting companies revealed that the central bank has not been paying their 30% export surrender in local currency.\n\nThe latest decision by Bitumen Worlddemonstrates the authorities appetite to uphold currency stability even at the cost of other critical economic imperatives.\n\nThe Zimbabwean government, one of the companys largest debtors, is experiencing significant challenges in making timely payments to its contractors. The government is facing delays in settling arrears, affecting various projects, including road rehabilitation and dam construction.\n\nWhile efforts are underway to establish payment plans and small payments have been received, these financial constraints have contributed to the companys decision to realign its operations to remain resilient in a challenging fiscal environment, said the company.\n\nThe company said this necessary transition reflects a committed effort to adapt to the current economic challenges, including operating under cash flow pressures caused by delayed payments from clients.\n\nBW said it recognises and deeply values the dedication and professionalism of all its employees and is committed to handling the process with respect, transparency, and dignity, offering support to those affected through severance packages and transition assistance.\n\nBW CEO, Andre Zietsman, said the decision has been very tough but had to be made due to limited options at hand.\n\nOver recent months, we have engaged in extensive discussions and evaluations to guide Bitumen World through this difficult period. While the decision to restructure was not made lightly, it is essential for ensuring our long-term viability and ability to continue contributing meaningfully to infrastructure development in Zimbabwe and beyond, he said.\n\nHe said the employees who have worked tirelessly to restore the countrys infrastructure glory will, unfortunately, suffer heavy blows when they see their jobs going down the drain.\n\nThe tragedy of these layoffs is that they impact the very people who built this prestigious brand  a brand that was wholly created by Zimbabweans, said Zietsman.\n\nThe company committed to handling the process with respect, transparency, and dignity, offering support to those affected through severance packages and transition assistance.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/20210647/bitumen-world-.jpeg",
            "description": "<p>By Alois Vinga DELAYED payments to government contractors have left one of the country’s top construction companies, Bitumen World (BW), with no choice but to cut down jobs. Problems bedevilling the construction sector are not new, following endless pleading for authorities to consider timely payments for work done in fulfilment of the government’s agenda to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/delayed-govt-payments-force-bitumen-world-to-cut-jobs/\">Delayed govt payments force Bitumen World to cut jobs</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:38",
            "date": "21 Aug 2025"
        }
    ]
}