{
    "news": [
        {
            "title": "Sikandar Raza becomes ICC World’s No. 1 ODI all-rounder",
            "url": "https://www.newzimbabwe.com/sikandar-raza-becomes-icc-worlds-no-1-odi-all-rounder/",
            "content": "CricTracker\n\nZimbabwes star player Sikandar Raza has become the top-ranked all-rounder in the ICC Mens ODI Player Rankings for the first time in his career after a fine show in the two-match series against Sri Lanka in Harare.\n\nThe 39-year-old scored 92 and 59 not out in the two matches and took one wicket in the series to overtake the Afghanistan pair of Azmatullah Omarzai and Mohammad Nabi, who are now placed second and third, respectively. Razas previous best was the second position that he attained in December 2023.\n\nRazas aggregate of 151 runs also lifted him nine places to 22nd position in the batting rankings, which is two places off his career-best 24th position reached in June 2023. He has also gained one spot to reach 38th position among bowlers.\n\nSri Lanka opener Pathum Nissanka, who topped the aggregate with 198 runs to be named the Player of the Series, has moved up seven places to 13th position while Janith Liyanage (up 13 places to 29th) of Sri Lanka and Sean Williams of Zimbabwe (up three places to 47th) are others to move up the batting rankings after the series.\n\nScotland batter George Munsey is up three places to 34th after a match-winning 84 not out against Canada in the ICC Mens Cricket World Cup League 2 while South Africas Tony de Zorzi has moved from 67th to 64th.\n\nThe ODI bowling rankings see South Africa spinner Keshav Maharaj shake off Sri Lanka spinner Maheesh Theekshana to take the sole No. 1 position after a match-winning haul of four for 22 in the first ODI against England in Leeds with Jofra Archer (up six places to 19th) and Lungi Ngidi (up five places to joint-23rd) among the others to move up the bowling rankings after the match.\n\nAsitha Fernando has advanced six places to 31st while Dilshan Madushankas match-winning four for 62 in the first Harare ODI, that included a hat-trick, has lifted him from 60th to 52nd position.\n\nThe ICC Mens T20I Player Rankings see Afghanistan batters Ibrahim Zadran and Sediqullah Atal make huge progress after helping beat Pakistan in a tri-series match in Sharjah with scores of 65 and 64, respectively. Zadran is up 12 places to 20th while Atal has rocketed 346 places to 127th position.\n\nPakistan batters Hasan Nawaz (up two places to joint-31st) is among those to gain in the batting rankings while Sufiyan Muqeem (up 11 places to 22nd), Shaheen Afridi (up eight places to 26th and Mohammad Nawaz (up 15 places to 43rd) are among those to move up the bowling rankings.\n\nRazas upward movement may have resulted in Nabi slipping to third position in the ODI all-rounders list, but he has moved up one spot to second position among T20I all-rounders.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/25140222/SIKANDAR-RAZA.jpg",
            "description": "<p>CricTracker Zimbabwe’s star player Sikandar Raza has become the top-ranked all-rounder in the ICC Men’s ODI Player Rankings for the first time in his career after a fine show in the two-match series against Sri Lanka in Harare. The 39-year-old scored 92 and 59 not out in the two matches and took one wicket in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sikandar-raza-becomes-icc-worlds-no-1-odi-all-rounder/\">Sikandar Raza becomes ICC World’s No. 1 ODI all-rounder</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:32",
            "date": "03 Sep 2025"
        },
        {
            "title": "14 foreigners arrested in Highlands cocaine bust",
            "url": "https://www.newzimbabwe.com/14-foreigners-arrested-in-highlands-cocaine-bust/",
            "content": "By Staff Reporter\n\nPolice have arrested 14 foreign nationals in a drug raid at a Highlands lodge following a tip-off.\n\nAccording to police spokesperson Commissioner Paul Nyathi, a separate operation at Beitbridge Border Post uncovered a dagga smuggling syndicate.\n\nOn September 2, 2025, detectives from CID Drugs and Narcotics, Harare, swooped on a lodge along Knightsbridge Road, Highlands, acting on a tip-off.\n\nThe suspects were caught red-handed sniffing cocaine from a wooden tray, said in a statement.\n\nPolice recovered two sachets of cocaine, one sachet of crystal meth, one sachet containing a mixture of cocaine and crystal meth.\n\nNyathi confirmed all 14 suspects were arrested for abuse and dealing in dangerous drugs.\n\nIn a separate incident a day earlier, on September 1, 2025, police at the Beitbridge Border Post arrested Last Chiyangwa (44), a bus conductor, after a suitcase stuffed with 24 cobs of dagga was discovered in the luggage compartment of a cross-border bus.\n\nFurther investigations led detectives to Harare, where they arrested Studymore Marimo (44) after he received the smuggled suitcase.\n\nPolice said the seized drugs and exhibits are being held pending court proceedings.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/03/06225836/Cocaine.jpg",
            "description": "<p>By Staff Reporter Police have arrested 14 foreign nationals in a drug raid at a Highlands lodge following a tip-off. According to police spokesperson Commissioner Paul Nyathi, a separate operation at Beitbridge Border Post uncovered a dagga smuggling syndicate. On September 2, 2025, detectives from CID Drugs and Narcotics, Harare, swooped on a lodge along</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/14-foreigners-arrested-in-highlands-cocaine-bust/\">14 foreigners arrested in Highlands cocaine bust </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:32",
            "date": "03 Sep 2025"
        },
        {
            "title": "Miscommunication from unauthorised office! – presidential spokesperson dismisses ban on tinted vehicle windows",
            "url": "https://www.newzimbabwe.com/miscommunication-from-unauthorised-office-presidential-spokesperson-dismisses-ban-on-tinted-vehicle-windows/",
            "content": "By Leopold Munhende\n\nPRESIDENTIAL Spokesperson George Charamba has dismissed Provincial Affairs and Devolution Secretary Tafadzwa Mugutis decision to ban the tinting of windows on private and public vehicles.\n\nThe ban, announced on Tuesday this week, was said to be a response to drug use and transportation by vehicles that had tinted windows and also a rape that occurred at Harares Rezende Rank where a grade seven pupil was locked and violated inside a tinted commuter omnibus.\n\nPosting on Twitter, formerly X, using his Dhonzamusoro account, Charamba said Mugutis office did not have the authority he sought to imply it had.\n\nKINDLY NOTE: There is no basis in fact or law to the accompanying announcement attributed to Muguti. Kindly ignore this miscommunication from an unauthorised office and officer! said Charamba in a tweet that was accompanied by a video of Muguti passing his declaration.\n\nKINDLY NOTE: There is no basis in fact or law to the accompanying announcement attributed to Secretary Muguti. Kindly ignore this mis-communication from an unauthorized office and Officer!pic.twitter.com/78O2P5Lw2t\n\n dhonzamusoro007 (@dhonzamusoro007)September 3, 2025\n\nThe confusion was not explained, while Charamba maintained that he was correcting an anomaly and fixing the negative.\n\nAll provinces will enforce a complete ban on private vehicles and public transporters having tinted windows on their vehicles, except for government VIP, security vehicles and all those manufactured with standard shades of tint, Muguti had announced.\n\nThis follows an increase in crime in transportation vehicles, especially Mushikashika, armed robbers and other criminals and also the recent rape of a grade seven girl in an omnibus.\n\nSo we will not be allowing any commuter omnibus to have tint.\n\nMuguti had gone to the extent of ordering police officers to rip it off dissenting drivers vehicles or have them impounded for failure to comply.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/15192357/George-Charamba.jpeg",
            "description": "<p>By Leopold Munhende PRESIDENTIAL Spokesperson George Charamba has dismissed Provincial Affairs and Devolution Secretary Tafadzwa Muguti’s decision to ban the tinting of windows on private and public vehicles. The ban, announced on Tuesday this week, was said to be a response to drug use and transportation by vehicles that had tinted windows and also a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/miscommunication-from-unauthorised-office-presidential-spokesperson-dismisses-ban-on-tinted-vehicle-windows/\">Miscommunication from unauthorised office! – presidential spokesperson dismisses ban on tinted vehicle windows</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:32",
            "date": "03 Sep 2025"
        },
        {
            "title": "Chimedza settling in well at Portugal’s AC Marinhense",
            "url": "https://www.newzimbabwe.com/chimedza-settling-in-well-at-portugals-ac-marinhense/",
            "content": "By Sports Reporter\n\nZimbabwe international Colbert Junior Chimedza says he is settling in well at his new club, AC Marinhense, in Portugals lower division.\n\nThe 20-year-old midfielder joined Marinhense last month on a one-year loan deal from Portuguese top-flight side Gil Vicente. Since his arrival, he has featured in every match his new team has played.\n\nHis latest outing came over the weekend when he helped Marinhense advance to the second round of the Taa de Portugal knockout tournament.\n\nIts always difficult to adapt to a new environment, but Im happy with how Im settling in here. My teammates and coaches have welcomed me warmly, Chimedza said.\n\nIve played at least four competitive games so far, and in our last cup match, I was pleased to contribute to the teams progress to the next stage.\n\nChimedza signed for Gil Vicente earlier this year but was unable to feature due to delays in the clearance of his international papers. As a result, he was loaned out to gain game time and experience.\n\nThe former MK Dons player hopes his spell at Marinhense will prepare him for a return to his parent club.\n\nMy focus is on working hard and contributing to Marinhenses success. At the end of the season, my target is to return to Gil Vicente and cement my place in the team, he added.\n\nBorn in Harare, Chimedza moved to England at the age of 14 after being scouted by English League Two side MK Dons, where he developed before moving to Portugal this year.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/03050419/14445524_cobert_chimedza_20250409121725.jpg",
            "description": "<p>By Sports Reporter Zimbabwe international Colbert Junior Chimedza says he is settling in well at his new club, AC Marinhense, in Portugal’s lower division. The 20-year-old midfielder joined Marinhense last month on a one-year loan deal from Portuguese top-flight side Gil Vicente. Since his arrival, he has featured in every match his new team has</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chimedza-settling-in-well-at-portugals-ac-marinhense/\">Chimedza settling in well at Portugal’s AC Marinhense</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:32",
            "date": "03 Sep 2025"
        },
        {
            "title": "Ipswich man Blessing Mudzinge jailed for defrauding Barclays, Lloyds £500,000",
            "url": "https://www.newzimbabwe.com/ipswich-man-blessing-mudzinge-jailed-for-defrauding-barclays-lloyds-500000/",
            "content": "Ipswich Star\n\nA fraudster who was involved in a sophisticated 500,000 scam during which bank customers details were used to transfer money out of their accounts has been jailed.\n\nSentencing 41-year-old Ipswich man Blessing Mudzinge, Judge Martyn Levettsaid he was a leading figure in conspiracies to defraud Barclays of 475,918 and Lloyds of 15,000 through account takeover frauds over a period of 26 months.\n\nThe judge told Mudzinge atIpswich Crown Courton Monday: You provided scripts to be used when speaking on line or phone to banking staff and you provided guidance to others.\n\nTo conceal proceeds, you arranged for them to be laundered through mule accounts you persuaded others to allow you to use and through those accounts you either withdrew cash or wanted accounts linked to cryptocurrency accounts for quick and easy dissipation.\n\nJudge Levett said data breaches of personal identity information were increasing in prevalence and the court had heard that there was a growing number of similar types of fraud cases where the offender, usually from an organised crime group, is able to open false bank accounts using collected and harvested personal information gathered from multiple sources such as utility bills, intercepted mail, unsolicited invitations to buy goods on-line with credit cards and open source information about companies on the internet or from CompaniesHouse, and other accessible sources.\n\nHe added: In this digital age where more information is being requested by call handlers to ensure verification of customer bank account details to confirm that an account exists and that it belongs to the right customer, a fraudster with a plausible charming personality is able to engage with a call handler to get as much information from them as they would need to make up a profile for a false bank account purporting to be notionally a genuine customer.\n\nThese false bank accounts have become colourfully known Frankenstein accountsbecause, like the legendary monster, the account is composed from parts of other identities which have been stitched together into a fraudulent composite, making and giving the outward appearance of a genuine account.\n\nAndrew Herd, prosecuting at Ipswich Crown Court, saidthe losses were covered by the banksand not individual account holders, which included a number of businesses.\n\nThe court heard that Mudzinge had made multiple calls to the banks pretending to be a company director and asking for personal details on accounts to be changed so he could access them and transfer money out of them.\n\nThere were a number of unexplained deposits of more than 100,000 into Mudzinges personal accounts but these were now empty.\n\nMudzinge, of Skylark Lane, Ipswich, admitted two offences of conspiracy to commit fraud by false representation between October 2022 and December last year, entering into a money laundering arrangement and possession of articles for use in fraud.\n\nHe was jailed for 57 months and two weeks.\n\nSteven Ball, for Mudzinge, who has 67 previous convictions, said his client was concerned that he had been left to carry the can for unknown people who had benefited from the fraud in much more of a way than he had.\n\nThe prosecution dont suggest he was the beneficiary of all the money, said Mr Ball.\n\nHe had become involved in the fraud after amassing debts of 12,500 and since being remanded in custody hed been a model prisoner.\n\nA hearing under the Proceeds of Crime Act will take place in February.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/03043721/mudzinge-b.png",
            "description": "<p>Ipswich Star A fraudster who was involved in a “sophisticated” £500,000 scam during which bank customers’ details were used to transfer money out of their accounts has been jailed. Sentencing 41-year-old Ipswich man Blessing Mudzinge, Judge Martyn Levett said he was a leading figure in conspiracies to defraud Barclays of £475,918 and Lloyds of £15,000 through</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ipswich-man-blessing-mudzinge-jailed-for-defrauding-barclays-lloyds-500000/\">Ipswich man Blessing Mudzinge jailed for defrauding Barclays, Lloyds £500,000</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:32",
            "date": "03 Sep 2025"
        }
    ]
}