{
    "news": [
        {
            "title": "Not an isolated case – nurses association slams govt for neglecting bedridden nurse injured on duty seven years ago",
            "url": "https://www.newzimbabwe.com/not-an-isolated-case-nurses-association-slams-govt-for-neglecting-bedridden-nurse-injured-on-duty-seven-years-ago/",
            "content": "By Thandiwe Garusa\n\nTHE Zimbabwe Nurses Association (ZINA) has strongly condemned the governments neglect of a Bikita nurse, Progress Muzuva, who was severely injured while on duty seven years ago, calling her case a tragic example of systemic abandonment of front-line health workers.\n\nShe has since been denied compensation, medical support, and justice by the government for which she worked.\n\nIn a statement Tuesday, ZINA president Enock Dongo said Muzuvas case is not an isolated incident and demanded an investigation into the matter.\n\nZINA demands a full investigation into how this matter was handled from the district authorities all the way up to head office.\n\nThose responsible for this neglect must be held accountable. What happened to Nurse Muzuva is not an isolated incident; this is just a drop in the ocean.\n\nAcross Zimbabwe, many nurses are injured while carrying out their duties, some in ambulance accidents while escorting patients, others while lifting immobile patients in wards, Dongo said.\n\nAccording to the nurses association, many health workers get injured on duty and receive no support, treatment, nor compensation.\n\nMany are left to suffer silently in their homes, unable to afford care with the meagre salaries they earn.\n\nThis culture of abandonment is pushing nurses out of the public service and out of the country to search for greener pastures elsewhere.\n\nWe ask again: Who will care for the carers? If the system fails to protect those who risk their lives for patients, then it has failed entirely.\n\nZINA calls on all relevant stakeholders to intervene urgently in Muzuvas case. She must receive immediate medical assistance, financial support, and justice. Her case should set a precedent for change, Dongo added.\n\nMuzuva told this publication that since 2018, the Health Ministry has been refusing to help her from the district level up to the ministers office.\n\nMuzuva was attacked by a violent maternity patientwhom she was escorting to Silveira Hospital in Masvingo for emergency care.\n\nThe violent patient wanted to kill herself and her newborn baby in what medical experts say could have been a case of severe postpartum psychosis.\n\nMuzuva saved the patient and her newly born baby but injured her spine and leg in the process.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/04042411/Screenshot_20250804-051338_2.jpg",
            "description": "<p>By Thandiwe Garusa THE Zimbabwe Nurses Association (ZINA) has strongly condemned the government’s neglect of a Bikita nurse, Progress Muzuva, who was severely injured while on duty seven years ago, calling her case a tragic example of systemic abandonment of front-line health workers. She has since been denied compensation, medical support, and justice by the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/not-an-isolated-case-nurses-association-slams-govt-for-neglecting-bedridden-nurse-injured-on-duty-seven-years-ago/\">Not an isolated case – nurses association slams govt for neglecting bedridden nurse injured on duty seven years ago</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:51",
            "date": "06 Aug 2025"
        },
        {
            "title": "‘Abducted’ Mbalenhle declines to open criminal case – say police",
            "url": "https://www.newzimbabwe.com/abducted-mbalenhle-declines-to-open-criminal-case-say-police/",
            "content": "Sowetan Live\n\nThe Gauteng woman, who was allegedly abducted for three days while on her way to church before she was miraculouslydumped by her captors at a petrol station, has declined to open a criminal case with the police.\n\nMbalenhle Nkomos family said they will no longer give Sowetan interviews on the matter.\n\nGauteng police spokesperson Col Mavela Masondo told Sowetan on Tuesday that Nkomo, 34, has declined to press kidnapping charges after being found bound inside her vehicle at a Johannesburg petrol station on Sunday afternoon.\n\nThe victim came to the police station and stated that she doesnt want to open a criminal case and provided her reasons. Her car was given back to her, Masondo said, without elaborating why the police released a car used in committing of an alleged crime.\n\nThe victim came to the police station and stated that she doesnt want to open a criminal case and provided her reasons. Her car was given back to her.\n\nCol Mavela Masondo\n\nNkomos husband, Sandile Nkomo, had opened a case of a missing person with the police on August 2 after his wife did not return home from an all-night prayer service at a church in Newtown.\n\nSandile had told Sowetan that Nkomo was intercepted along the M2 by gun-wielding men before she reached the church. She told her family that the abductors allegedly drove with her from Gauteng to Ladysmith, KZN, and came back with her after they allegedly realised they had taken the wrong person.\n\nNkomos reappearance became a talking point on social media, with some users raising suspicion about her story.\n\nMasondo said the case of a missing person has since been closed.\n\nSowetan contacted Nkomo, who expressed frustration with how the media has been covering the story.\n\nI have noticed how you craft your articles to suit your narrative on this matter. I will be giving all that information to other media houses that will relay it the way I say it. I will not be commenting further on this matter, thanks. People would rather see a #Justice4Mbalenhle post than one where she was released untouched.\n\nNkomo, a beautician by trade, has since removed her social media accounts.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/06045339/mbalenhle.png",
            "description": "<p>Sowetan Live The Gauteng woman, who was allegedly abducted for three days while on her way to church before she was miraculously dumped by her captors at a petrol station, has declined to open a criminal case with the police. Mbalenhle Nkomo’s family said they will no longer give Sowetan interviews on the matter. Gauteng police</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/abducted-mbalenhle-declines-to-open-criminal-case-say-police/\">‘Abducted’ Mbalenhle declines to open criminal case – say police</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:51",
            "date": "06 Aug 2025"
        },
        {
            "title": "A sculpture garden boosts environmental action in Harare",
            "url": "https://www.newzimbabwe.com/a-sculpture-garden-boosts-environmental-action-in-harare/",
            "content": "By Tawanda Mupatsi| DW\n\nZimbabwes capital Harare is facing flooding, heatwaves and declining biodiversity. How does a stone sculpture park help encourage environmental conservation?\n\nIn Harare, Zimbabwes capital, the Chapungu Sculpture Garden offers a unique fusion of art and environmentalconservation. The park is a sanctuary where sculptors carve stone works of art inspired byanimalsand other natural forms. It, in turn is designed to protectnature. Indigenous native species have been planted there to help preserve them. Artist and park manager Nicholas Kadzungura explains that they are threatened bydeforestation. The garden, founded in 1970 and named after the sacred Bateleur Eagle, serves as both a creative hub and a living classroom, where visitors learn aboutZimbabwes rich ecological and cultural heritage.\n\nMany sculptures in the park reflect Zimbabwes environmental challenges. Friend of the Rhino, a piece by the late Joseph Ndandarika, which encourages empathy and the protection ofendangered species. With only around 600 black rhinos left in Zimbabwe, the message is pressing. Marcey Mushore, the parks director, explains how animistic Shona traditions guide conservation efforts. The park also acts as agreen lungfor Hararesurban sprawl. Some 2.4 million people live in its metropolitan area and pollution and disappearing green spaces are a problem.\n\nChapungus artists are committed to sharing ancestral knowledge through sculpture workshops and educational programs. Kadzungura stresses that Zimbabwes traditional stone art is not just decorativeit carries lessons about coexistence with nature. Asclimate changeand urban development threaten the countrys wetlands andbiodiversity, the parks mission is becoming more vital. Chapungu inspires action by blending creativity, tradition, and environmental stewardship.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/05181947/sculpture-garden.jpeg",
            "description": "<p>By Tawanda Mupatsi | DW Zimbabwe’s capital Harare is facing flooding, heatwaves and declining biodiversity. How does a stone sculpture park help encourage environmental conservation? In Harare, Zimbabwe’s capital, the Chapungu Sculpture Garden offers a unique fusion of art and environmental conservation. The park is a sanctuary where sculptors carve stone works of art inspired by animals and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/a-sculpture-garden-boosts-environmental-action-in-harare/\">A sculpture garden boosts environmental action in Harare</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:51",
            "date": "06 Aug 2025"
        },
        {
            "title": "Afreximbank to fund study for 1-GW floating solar project in Zimbabwe",
            "url": "https://www.newzimbabwe.com/afreximbank-to-fund-study-for-1-gw-floating-solar-project-in-zimbabwe/",
            "content": "African Export-Import Bank, or Afreximbank, has signed a heads of terms agreement to provide USD 4.4 million (EUR 3.80m) to support a 1-GW hybrid floating solar project on Lake Kariba in Zimbabwe.\n\nThe financing facility will be extended to Green Hybrid Power Private Limited to fund the bankability and feasibility studies for the project and the procurement of transaction advisers. It is expected to unlock an estimated USD 350 million in investment.\n\nThe plan is to build the solar park in two phases, starting with the installation of 500 MW of power-generating capacity. The pilot stage will supply electricity to the Intensive Energy Users Group, a consortium of large industrial and mining companies, under a 20-year take-or-pay power purchase agreement (PPA).\n\nThe agreement was signed during the 32nd Annual Meetings of Afreximbank (AAM2025). It was one of four project preparation deals inked at the event, which are collectively expected to catalyse around USD1 billion in investments.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/05182552/afreximbank-to-fund-study-for-1-gw-floating-solar-project-in-zimbabwe-1279691-1754396766.webp",
            "description": "<p>Renewables Now African Export-Import Bank, or Afreximbank, has signed a heads of terms agreement to provide USD 4.4 million (EUR 3.80m) to support a 1-GW hybrid floating solar project on Lake Kariba in Zimbabwe. The financing facility will be extended to Green Hybrid Power Private Limited to fund the bankability and feasibility studies for the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/afreximbank-to-fund-study-for-1-gw-floating-solar-project-in-zimbabwe/\">Afreximbank to fund study for 1-GW floating solar project in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:51",
            "date": "06 Aug 2025"
        },
        {
            "title": "South Africa’s Public Protector dismisses claims of talks with ZHRC on healthcare access for Zimbabweans",
            "url": "https://www.newzimbabwe.com/south-africas-public-protector-dismisses-claims-of-talks-with-zhrc-on-healthcare-access-for-zimbabweans/",
            "content": "By Thandiwe Garusa\n\nPublic Protector South Africa (PPSA) has denied ever holding discussions with the Zimbabwe Human Rights Commission (ZHRC) regarding the denial of healthcare access to Zimbabwean nationals.\n\nThere have been reports of anti-migrant groups in South Africa blocking foreign nationals from accessing public health facilities, citing that they strain the neighbouring countrys already stretched public resources.\n\nAmong these groups is Operation Dudula in Gauteng, which has been actively preventing undocumented immigrants from accessing healthcare.\n\nIn an interview on Monday, ZHRC Chairperson Jessie Majome told South African broadcaster Newzroom Afrika that she recently had discussions with PPSA to resolve the issue of healthcare denial for Zimbabweans.\n\nMajomesinterview triggered a public uproar from South Africans condemning the PPSA for allowing Zimbabweans to fight for rights in a foreign country instead of fighting for the same healthcare access in their country.\n\nHowever, in a statement Tuesday, PPSAspokesperson Ndili Msokidenied Majomes claims, saying there was never any discussion around healthcare issues specifically affecting Zimbabwean nationals.\n\nThe PPSA said that when it hosted a ZHRC delegation last year, the discussions focused on institutional strengthening, corruption, and service delivery challenges in both countries but did not address migrant access to healthcare.\n\nFollowing numerous media inquiries, the PPSA wishes to clarify that it has no record of a complaint lodged by the ZHRC in relation to the denial of Zimbabwean nationals access to healthcare services in South Africa.\n\nAt no point did the discussions then, nor recently, focus on the denial of Zimbabwean nationals access to healthcare services in South Africa.\n\nRather, the discussions were about, among other things, the state of the healthcare systems in both countries.\n\nAccordingly, the PPSA also referred to its own investigation into the state of the healthcare system in South Africa as a guide for the ZHRC to conduct similar investigations in its own country,Msoki said.\n\nThe PPSA also emphasised that it has not received any complaint of that nature.\n\nSouth African authorities have for long expressed concern over the strain placed on public services by Zimbabwean nationals fleeing a collapsed economy back home.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/09194917/march-movement.webp",
            "description": "<p>By Thandiwe Garusa Public Protector South Africa (PPSA) has denied ever holding discussions with the Zimbabwe Human Rights Commission (ZHRC) regarding the denial of healthcare access to Zimbabwean nationals. There have been reports of anti-migrant groups in South Africa blocking foreign nationals from accessing public health facilities, citing that they strain the neighbouring country’s already</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africas-public-protector-dismisses-claims-of-talks-with-zhrc-on-healthcare-access-for-zimbabweans/\">South Africa’s Public Protector dismisses claims of talks with ZHRC on healthcare access for Zimbabweans</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:51",
            "date": "06 Aug 2025"
        },
        {
            "title": "Maid convicted for ill-treating employer’s daughter",
            "url": "https://www.newzimbabwe.com/maid-convicted-for-ill-treating-employers-daughter/",
            "content": "By Staff Reporter\n\nA 21-year-old house helper from Chipinge has been jailed 12 months following her conviction for ill-treating a minor girl she was taking care of.\n\nTafadzwa Mtisi, however, escaped a custodial sentence after four months of her sentence was suspended on condition of good behaviour.\n\nFurther eight months were suspended on condition that she perform 350 hrs of community service.\n\nMtisi was residing at Muchakagara Village, Chief Musikavanhu, Chipinge, where she was working as a maid.\n\nThe victim is a grade five student at China Primary School and is aged 10.\n\nMtisi was charged with illtreatment of a minor when she appeared before Magistrate Mangoni.\n\nThe court heard that on July 31 2025 and at around 19:00 hours, Mtisi confronted the complainant, accusing her of spreading rumours that she was not feeding them at home.\n\nComplainant remained quiet, and the accused person then took a wooden log and hit the complainant several times on her buttocks.\n\nComplainant sustained bruises on her buttocks and swollen body, the court heard.\n\nThe matter came to light when the complainants class teacher realised that she had sitting difficulties.\n\nShe was questioned and she revealed the abuse.\n\nThe case was then reported at ZRP Chipinge Rural and the complaint was sent to Chipinge District Hospital for medical examination.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/11/28190845/domestic-worker.jpg",
            "description": "<p>By Staff Reporter A 21-year-old house helper from Chipinge has been jailed 12 months following her conviction for ill-treating a minor girl she was taking care of. Tafadzwa Mtisi, however, escaped a custodial sentence after four months of her sentence was suspended on condition of good behaviour. Further eight months were suspended on condition that</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/maid-convicted-for-ill-treating-employers-daughter/\">Maid convicted for ill-treating employer’s daughter</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:51",
            "date": "06 Aug 2025"
        },
        {
            "title": "Chinese national in trouble over illicit financial transfer",
            "url": "https://www.newzimbabwe.com/chinese-national-in-trouble-over-illicit-financial-transfer/",
            "content": "By Mary Taruvinga\n\nA Chinese national has landed in hot water after allegedly transferring US$880,000 to China without approval from the Reserve Bank of Zimbabwe.\n\nSun Limin (52) was arraigned before a Harare magistrate, charged with contravening the Exchange Control and Money Laundering Acts.\n\nLimin was granted US$500 bail and ordered to report every Friday to the police until her matter is finalised.\n\nAccording to the state, the Chinese national was arrested at her business premises located at 19 Basma, Graniteside.\n\nShe is accused of violating the Exchange Control Act [Chapter 22:05], by allegedly transferring US$880,000 to China without the Reserve Bank of Zimbabwes approval between January and January 2025.\n\nUnder the Money Laundering and Proceeds of Crime Act [Chapter 9:24], she is alleged to have concealed the true nature and source of the funds, which authorities believe are proceeds of crime, the state.\n\nProsecutors allege that investigations have confirmed bills of entry for the goods which were imported from China via Forbes Border Post.\n\nThe state also says it has secured witness testimonies from clearing agents and documents proving transactions.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/28155839/Harare-Magistrates-Court.jpg",
            "description": "<p>By Mary Taruvinga A Chinese national has landed in hot water after allegedly transferring US$880,000 to China without approval from the Reserve Bank of Zimbabwe. Sun Limin (52) was arraigned before a Harare magistrate, charged with contravening the Exchange Control and Money Laundering Acts. Limin was granted US$500 bail and ordered to report every Friday</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chinese-national-in-trouble-over-illicit-financial-transfer/\">Chinese national in trouble over illicit financial transfer</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:51",
            "date": "06 Aug 2025"
        }
    ]
}