{
    "news": [
        {
            "title": "Zimbabwe’s export of minerals used in battery production surges 30%",
            "url": "https://www.newzimbabwe.com/zimbabwes-export-of-minerals-used-in-battery-production-surges-30/",
            "content": "Reuters\n\nPrices of lithium  used in batteries to power renewable energy technologies  have tumbled nearly 90% over the past two years, mainly due to oversupply, but producers remain positive about the metals long-term prospects amid a global push towards cleaner energy sources and electric vehicles.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/05/24130533/Lithium-Mining.jpeg",
            "description": "<p>Reuters  Zimbabwe’s exports of spodumene concentrate, a lithium-bearing mineral essential for battery production, surged 30% in the first half of 2025 despite weak global lithium prices, official statistics show. Africa’s top lithium producer exported 586,197 metric tons of spodumene concentrate between January and June, compared to 451,824 metric tons during the same period last year,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-export-of-minerals-used-in-battery-production-surges-30/\">Zimbabwe’s export of minerals used in battery production surges 30%</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:50",
            "date": "22 Jul 2025"
        },
        {
            "title": "We will survive relegation – Chaminuka backs Dynamos’ flops",
            "url": "https://www.newzimbabwe.com/we-will-survive-relegation-chaminuka-backs-dynamos-flops/",
            "content": "By Darlington Gatsi\n\nDYNAMOS coach Saul Chaminuka has chosen to put on a brave face as the fallen Harare giants continue to sink deeper into crisis.\n\nMediocrity continues to reign at Dynamos after they failed to secure a win at Wadzanayi Stadium, falling 1-0 to defending Castle Lager Premier Soccer League (PSL) champions Simba Bhora.\n\nThe defeat marked their ninth loss of the season, having managed just two wins in 20 matches, laying bare the troubles at the once dominant force of Zimbabwean football.\n\nConsequently, this paints a grim picture for Dynamos, with the reality of relegation becoming increasingly evident.\n\nChaminuka, who has won just once since taking over in May, remains confident his side will avoid the drop.\n\nThere are still plenty of games to play. If you look at the teams, we are not very far away. Maybe five or six teams are in the 25 [points], what we need is to win twice on the trot and we are out of the relegation zone, said Chaminuka.\n\nDynamos are currently eight points from safety, having amassed only 15 points, with their abandoned match against FC Platinum yet to be resolved.\n\nThe beleaguered giants situation is further compounded by a poor transfer system, which has seen the club fail to reinforce the squad with quality players.\n\nSuch are the low standards at Dynamos that past their prime players, Denver Mukamba and Ocean Mushure, who last played professional football a combined 19 months ago, are now training with the team.\n\nSo dire is the situation that defender Shadreck Nyahwa is the clubs top scorer this season with just two goals, prompting the administration to trial unknown players from Ghana in a desperate bid to salvage their campaign.\n\nChaminuka, however, insists his flops can turn things around.\n\nWe are capable of winning the matches. If games are handled well, we will win games. We are going to win games and we are going to survive, said Chaminuka.\n\nDynamos next challenge is against another struggling side, Manica Diamonds, on Wednesday at Rufaro Stadium, where they have claimed both of their victories this season.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/11073111/Saul-Chaminuka.webp",
            "description": "<p>By Darlington Gatsi DYNAMOS coach Saul Chaminuka has chosen to put on a brave face as the fallen Harare giants continue to sink deeper into crisis. Mediocrity continues to reign at Dynamos after they failed to secure a win at Wadzanayi Stadium, falling 1-0 to defending Castle Lager Premier Soccer League (PSL) champions Simba Bhora.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/we-will-survive-relegation-chaminuka-backs-dynamos-flops/\">We will survive relegation – Chaminuka backs Dynamos’ flops </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:50",
            "date": "22 Jul 2025"
        },
        {
            "title": "Uganda green lights military trials for civilians despite court ruling",
            "url": "https://www.newzimbabwe.com/uganda-green-lights-military-trials-for-civilians-despite-court-ruling/",
            "content": "By Nakisanze Segawa and Apophia Agiresaasi, GPJ Uganda\n\nThis story was originally published byGlobal Press Journal\n\nIn January, Eron Kiiza, a human rights lawyer, represented opposition leader and four-time presidential candidate Kizza Besigye in military court. Soldiers blocked his entry and directed him to sit in a different section. Kiiza refused. They forcibly removed him, and minutes later, he was arrested and placed next to Besigye  as a defendant, facing charges of treason. He was convicted of contempt of court and sentenced to nine months in prison.\n\nThere was no trial, says Kiiza, who is out of prison on bail.\n\nThe same month, Ugandas Supreme Court ruled thattrying civilians in military court  a practice on the rise in recent years  is unconstitutional. There are anywhere from a few hundred civilians, according to government numbers, to a few thousand civilians, according to lawyers, who are currently in military custody.\n\nPresident Yoweri Museveni said on social media that the January ruling is wrong, adding that trying civilians in the military court was a way to protect Ugandans from what he called criminals armed with guns.\n\nIn June, Ugandas Parliament passed a law allowing the practice, a move critics are calling an act of revenge after the January ruling. They worry the law will stifle political opposition and stoke fear ahead of the January 2026 general elections.\n\nColonel Chris Magezi, acting spokesperson for the Uganda Peoples Defence Forces, said on television in May that the judiciary is overwhelmed, so trying some cases that threaten national security in military courts is essential. He pointed to a 2023 disarmament in Karamoja, where armed residents were attacking neighbors and conducting raids across the border with Kenya.\n\nTheres an urgent security problem to deal with in Karamoja that should hold, he said. In civil courts, when they are released, they go back to the community and commit crimes again.\n\nThe lawallows the court-martial of civilians in cases of suspected treason, as well as cattle rustling, murder, aggravated robbery and more. But critics say the law opens the door to widespread civilian arrests.\n\nNkunyingi Muwada, a member of Parliament for Kyadondo East, says the bill is Musevenis attempt to dismantle the court system and create a new system within the military courts to remand opposition politicians and activists.\n\nIts obvious that this bill is in preparation of 2026 election, Muwada says, adding that Museveni wants the political realm to remain a one-man show.Sarah Bireete, executive director for Centre for Constitutional Governance, a regional constitutional watchdog, says the bills hurried passage didnt allow for public participation.\n\nThe clerk to Parliament sent an advert one day before the bill was tabled, she says. We were required to analyze the bill and file in a matter of hours. We submitted memorandum hoping to be invited to the committee. We were never invited.\n\nOpposition supporters from the 2021 general electionshave been in court since then.\n\nThe regime wants this same court in place for the same purpose, Bireete says.\n\nCivilians are concerned that the law makes them vulnerable. Namukasa Khadija, a Wakiso resident, says shes debating whether to participate in the upcoming elections.\n\nI saw the arrest, the brutality against opposition supporters, especially Bobi Wine supporters, by the armed forces in the last 2021 elections, she says. I saw the brutality against journalists in the recent Kawempe North election, and I dont know if I am ready to attend any political rally in the 2026 elections because I dont think it will be safe.\n\nOthers, though, are confident the law will promote national security.\n\nAnthony Akol, a member of Parliament for Kilak North, says the bill will protect Ugandans from armed robberies and those who use military attire to commit crimes.\n\nThe law is good, he says, but the problem is that citizens of Uganda dont trust this government.\n\nHe, like Magezi, points to Karamoja.\n\nSome who have guns and use them to rob people and others put on army uniform and try to steal from people, he says. I have no problem if such a person is arrested.\n\nKiiza, the human rights lawyer, says the bills main purpose is to deny Ugandans involvement in what should be a fair, democratic election.\n\nPolitical activists and opposition supporters will be arrested and remanded to prison without trial, he says. This only happened because the military started to engage in politics.\n\nNakisanze Segawais a Reporter-in-Residence based in Kampala, Uganda. She specializes in reporting on LGBTQ+ issues. Born in Luweero and raised in Ugandas capital, she holds a degree in Mass Communications from Muteesa I Royal University. Known for her powerful photography and deep community access, her 2015 story about school policies that forced Black girls to keep their hair shortwhile girls of other races could grow theirs longprovoked widespread social media outcry and led to a policy change.\n\nApophia Agiresaasiis a Reporter-in-Residence based in Kampala, Uganda. She has been covering human rights and global health stories for over a decade. In 2020, she was part of the team honored with the Media Hero of the Year Award by the Stevie Awards for their coverage of the COVID-19 pandemic. Apophia holds a bachelors degree in Literature and a masters degree in Population and Reproductive Health from Makerere University.\n\nNakisanze Segawa, GPJ,translatedsome interviews from Luganda.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/21124711/GPJNews_Uganda_CivilLiberties_NS_AA_CourtMartial_Illustration-1.png",
            "description": "<p>By Nakisanze Segawa and Apophia Agiresaasi, GPJ Uganda This story was originally published by Global Press Journal In January, Eron Kiiza, a human rights lawyer, represented opposition leader and four-time presidential candidate Kizza Besigye in military court. Soldiers blocked his entry and directed him to sit in a different section. Kiiza refused. They forcibly removed</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uganda-green-lights-military-trials-for-civilians-despite-court-ruling/\">Uganda green lights military trials for civilians despite court ruling</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:50",
            "date": "22 Jul 2025"
        }
    ]
}