{
    "news": [
        {
            "title": "PSL summons Ngezi Platinum Stars, Chiragwi for assaulting player",
            "url": "https://www.newzimbabwe.com/psl-summons-ngezi-platinum-stars-chiragwi-for-assaulting-player/",
            "content": "By Sports Reporter\n\nThe Premier Soccer League (PSL) has summoned Ngezi Platinum Stars coach Takesure Chiragwi to appear before a disciplinary hearing after he slappedmidfielder McDonald Makuwe during a match against Dynamos.\n\nThe incident, which occurred as Chiragwi protested his red card, went viral on social media, prompting widespread criticism. The coach has since apologised and stepped down from his role as Warriors assistant coach.\n\nIn a statement, the PSL said both Chiragwi and Ngezi Platinum Stars had been called to appear before its Disciplinary Committee over misconduct during the Castle Lager Premier Soccer League match played at Rufaro Stadium on October 4, 2025.\n\nTakesure Chiragwis charges include violent and disorderly conduct, as well as improper behaviour likely to bring the game into disrepute. Ngezi Platinum Stars FC faces charges of disturbing the normal proceedings of a match and improper conduct exhibited by its technical team and players, the PSL said.\n\nLast week, Makuwe released a statement defending Chiragwi, stating that the coachs hand had accidentally come in contact with his face.\n\nChiragwi becomes only the second football official to face PSL disciplinary action over violent conduct towards a player. Earlier this year, Yadah FC board member Spencer Muvadi was found guilty of assaulting goalkeeper Godknows Gurure and received a one-year suspension from all football activities.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/05054452/takesure-chiragwi.jpeg",
            "description": "<p>By Sports Reporter The Premier Soccer League (PSL) has summoned Ngezi Platinum Stars coach Takesure Chiragwi to appear before a disciplinary hearing after he slapped midfielder McDonald Makuwe during a match against Dynamos. The incident, which occurred as Chiragwi protested his red card, went viral on social media, prompting widespread criticism. The coach has since apologised</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/psl-summons-ngezi-platinum-stars-chiragwi-for-assaulting-player/\">PSL summons Ngezi Platinum Stars, Chiragwi for assaulting player</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "13 Oct 2025"
        },
        {
            "title": "Walter Musanhu sues Dynamos legend Murape Murape for defamation",
            "url": "https://www.newzimbabwe.com/walter-musanhu-sues-dynamos-legend-murape-murape-for-defamation/",
            "content": "By Leopold Munhende\n\nFORMER Motor Action defender and Zimbabwe Youth International Walter Ringers Musanhu has sued Dynamos legend Murape Murape for defamation of character.\n\nMurape, a former Dynamos captain and one of the clubs most capped players, accused Musanhu of incest and homosexuality.\n\nAccording to a letter sent to Murape by Musanhus lawyers, James Majatame Attorneys, he uttered the statements on a WhatsApp group named Former Footballers.\n\nMusanhu is demanding that Murape retract his statements on the same platform, publish apologies in publicly owned papers, The Herald and The Sunday Mail, for five consecutive weeks and refrain from making contact with him.\n\nThese allegations are false, malicious, and wholly unsubstantiated, reads the letter.\n\nYour statements are factually incorrect in their entirety and were clearly intended to tarnish our clients reputation.\n\nTo aggravate the matter, you subsequently sent our client direct messages via WhatsApp, again referring to him as mainini.\n\nSuch conduct constitutes cyberbullying and harassment and is a criminal offence under section 164B of the Cyber and Data Protection Act.\n\nMusanhu owns JADEL FA, a Beijing, China-based academy with branches in Zimbabwe. Over the past few years, it has taken junior footballers from the country to China and other parts of the world for tournaments.\n\nMurape works at Real Viedo Academy, a well-funded junior football initiative that is partnered with Spanish La Liga side Real Viedo.\n\nThe two are products of Dynamos once vibrant junior policy.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/01/23121813/Murape-Murape-e1674476400929.png",
            "description": "<p>By Leopold Munhende FORMER Motor Action defender and Zimbabwe Youth International Walter “Ringers” Musanhu has sued Dynamos legend Murape Murape for defamation of character. Murape, a former Dynamos captain and one of the club’s most capped players, accused Musanhu of incest and homosexuality. According to a letter sent to Murape by Musanhu’s lawyers, James Majatame</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/walter-musanhu-sues-dynamos-legend-murape-murape-for-defamation/\">Walter Musanhu sues Dynamos legend Murape Murape for defamation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "13 Oct 2025"
        },
        {
            "title": "Chiwenga’s explosive Politburo dossier leaked, warns Mnangagwa that current conditions led to November 2017 coup",
            "url": "https://www.newzimbabwe.com/chiwengas-explosive-politburo-dossier-leaked-warns-mnangagwa-that-current-conditions-led-to-november-2017-coup/",
            "content": "By Leopold Munhende\n\nTHE explosive dossier presented by Vice President Constantino Chiwenga to Zanu PFs powerful Politburo on September 17 this year has been leaked.\n\nDetailing grand corruption by President Emmerson Mnangagwas monied allies, Chiwengas dossier warned prevailing conditions were exactly what led to their decision to oust late President Robert Mugabe in a November 2017 coup.\n\nThe dossier names businessman Kudakwashe Tagwirei, shadowy Wicknell Chivayo, questionable Delish Nguwaya and Scottland FC owner Pedzisayi Scott Sakupwanya as some of the corrupt individuals who have been milking Zimbabwes coffers.\n\nComrade President, we undertook Operation Restore Legacy with a sacred mandate: to reclaim our nation from the jaws of corruption and to restore the dignity, prosperity, and sovereignty of Zimbabwe for its people, said Chiwenga.\n\nComrade President, in November 2017, we took a bold and necessary step to remove former President Robert Mugabe from power, because he sought to manipulate our Constitution for personal gain.\n\nHe allowed certain individuals and family to seize his executive authority and abuse it, he ignored the suffering of the people while a corrupt elite looted with impunity, he turned ZANU-PF into a personal fiefdom, disregarding its founding values.\n\nDuring November 2017, we risked everything our lives, our freedom, our futures to restore and defend our legacy, the Party and the Constitution.\n\nToday, history is repeating itself in the most shameful way Comrade President. Why we find ourselves in this situation is both shocking and shameful.\n\nComrade President, on several occasions and even abroad, you have informed the nation that you are a Constitutionalist and yet it is now clear for anyone to see that the so-called 2030 Agenda to extend your term of office is real and alive, and this has now taken us back to the ills that led us to November 2017.\n\nMoreover, the drivers of this so-called 2030 Agenda have now made corruption, looting of our state coffers and bribery of our structures the cornerstone of their contribution to this campaign, and this is now destroying our Party and violating our Constitution.\n\nChiwenga claimed Tagwirei, Nguwaya, Sakupwanya and Chivayo had siphoned over US$3.2 billion from the state in shadowy deals that include the sale of party shares in Tagwireis Kuvimba and Great Dyke Investment, Nguwayas Geo-Pomona initiative, Chivayos Zimbabwe Electoral Commission (ZEC) scandal and gold purchases by Sakupwanya.\n\nMnangagwa, whose supporters are demanding that he illegally extend his second term to 2030, is said to favour Tagwirei as his successor instead of Chiwenga.\n\nChiwenga is eyeing the top post, having expected to take over in 2023.\n\nAdded Chiwenga: The reality which is clearly emerging is that this 2030 Agenda is being funded and driven by known criminals who have brazenly looted our state coffers with impunity and are now using these resources whose capture and control of our Party is unprecedented and deeply worrying.\n\nKudakwashe Tagwirei, Wicknell Chivhayo, Scott Sakupwanya, and Delish Nguwaya, amongst others, structure and in the process destroy our Party.\n\nChiwenga demanded their immediate arrests, twice telling Mnangagwa that the time for inaction had long passed.\n\nComrade President, tirikuti vanhu ava, Kudakwashe Tagwirei, Wicknell Chivhayo, Scott Sakupwanya, and Delish Nguwaya, and their associates, ngavasungwe, immediately for these unprecedented crimes they have committed, he said.\n\nComrade President, the time for silence and inaction is over, and we cannot allow these criminals who have stolen from our Government coffers and our Party to start using the same resources to bribe fellow comrades and our structures to get their support, defend and protect them.\n\nThe time for silence and inaction is over, Comrade President. We, as the Partys Presidium, have serious issues to immediately deal with that will define our future, and we must immediately prioritise cleaning our house, reclaim our State and our Party from the capture by Kudakwashe Tagwirei, Wicknell Chivhayo, Scott Sakupwanya, and Delish Nguwaya and their associates.\n\nThe leaking of Chiwengas dossier indicates a turning point in Zanu PFs worsening factional fights.\n\nDespite being an obvious escalation of the battle for power between Chiwenga and Mnangagwa, it is the first time private confrontations between the two have been made public.\n\nTheir relationship is reportedly now similar to the one Mnangagwa had with his predecessor, Mugabe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/13054207/Chiwenga-Mnangagwa.png",
            "description": "<p>By Leopold Munhende THE explosive dossier presented by Vice President Constantino Chiwenga to Zanu PF’s powerful Politburo on September 17 this year has been leaked. Detailing grand corruption by President Emmerson Mnangagwa’s monied allies, Chiwenga’s dossier warned prevailing conditions were exactly what led to their decision to oust late President Robert Mugabe in a November</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chiwengas-explosive-politburo-dossier-leaked-warns-mnangagwa-that-current-conditions-led-to-november-2017-coup/\">Chiwenga’s explosive Politburo dossier leaked, warns Mnangagwa that current conditions led to November 2017 coup</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "13 Oct 2025"
        },
        {
            "title": "Zimbabwe targets airport upgrades to enhance connectivity",
            "url": "https://www.newzimbabwe.com/zimbabwe-targets-airport-upgrades-to-enhance-connectivity/",
            "content": "By Xinhua\n\nZIMBABWE aims to rehabilitate and modernize its airports to enhance air transport infrastructure, boost tourism, and attract investment, Transport and Infrastructural Development Minister Felix Mhona said Wednesday.\n\nKariba airport\n\nSpeaking at the Africa Infrastructure and Built Environment Conference and Expo (AfriConfex) in Bulawayo, Zimbabwes second-largest city, Mhona said the governments key projects include the expansion of the Charles Prince Airport in Harare, the countrys capital, and the construction of the Mutare Airport in Manicaland Province and the Kariba International Airport in Mashonaland West Province.\n\nMhona said the ongoing upgrades to the countrys airports are already yielding positive results, with the aviation sector registering steady growth.\n\nThe rehabilitation and upgrading of the airport infrastructure has gone a long way in improving the countrys image, as well as attracting new airlines, given the increased passenger handling capacity, Mhona said.\n\nThe Zimbabwean government will continue investing in sustainable solutions to bridge gaps in air transport infrastructure, noting that inadequate facilities limit market access and livelihood opportunities.\n\nZimbabwe has seen significant airport expansions in recent years, most notably the completion in 2023 of a new terminal building at the Robert Gabriel Mugabe International Airport in Harare, which significantly increased passenger capacity.\n\nAfriConfex is Zimbabwes largest construction and infrastructure gathering, bringing together local and international experts in engineering, transport, and urban development to discuss sustainable infrastructure growth across the continent.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/05/16192007/Felix-Mhona-e1760323422657.jpg",
            "description": "<p>By Xinhua ZIMBABWE aims to rehabilitate and modernize its airports to enhance air transport infrastructure, boost tourism, and attract investment, Transport and Infrastructural Development Minister Felix Mhona said Wednesday. Speaking at the Africa Infrastructure and Built Environment Conference and Expo (AfriConfex) in Bulawayo, Zimbabwe’s second-largest city, Mhona said the government’s key projects include the expansion</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-targets-airport-upgrades-to-enhance-connectivity/\">Zimbabwe targets airport upgrades to enhance connectivity</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "13 Oct 2025"
        },
        {
            "title": "‘An enemy is trying to hurt me’— says content creator Ritzmacleish responding to leaked nude video",
            "url": "https://www.newzimbabwe.com/an-enemy-is-trying-to-hurt-me-says-content-creator-ritzmacleish-responding-to-leaked-nude-video/",
            "content": "By Staff Reporter\n\nPOPULAR Zimbabwean content creator, Michelle Moyo, known online as Ritzmacleish, has issued a defence after her nude video, reportedly dating back to 2021, was recently leaked and went viral across social media platforms.\n\nMoyo, a mother of two, confirmed the videos age on her Facebook page and claimed the leak is a deliberate act of sabotage intended to ruin her budding career.Moyo, who is actively building her brand, insisted that the malicious timing is clear, noting the video was initially posted years ago without gaining traction.People in Zimbabwe rejoice when you are failing, the moment you try to rise up thats when they do their best to bring you down. Im trying very hard to build my brand, a brand that everyone will want to work with, yet my enemy is doing everything they can to destroy me.The video that is currently circulating on the internet is from around 2021. The enemy had posted it before, but it didnt circulate because I wasnt famous back then. Those who have been following me for a long time know that it was posted a long time ago, said MoyoThe content creator revealed that she tried contacting the source who posted the now leaked video on Telegram but was met with demands for unaffordable amounts of money.She indicated that she doesnt share explicit content for fame, differentiating herself from other content creators.I am not a person who looks for fame by trending in that way. I see a lot of people making over $5000 USD on a monthly basis posting those kinds of videos. If I were a person who wanted that, I would just do it and make money, not try to hide and deny things.I dont share pictures without clothes. I value my morals greatly. I am a mother of two beautiful kids; I try by all means to be a mother with dignity, said MoyoMoyo pleaded with the public to show support for the positive work she does, rather than participating in her destruction.The way you are pushing this is destroying me. I wish you would try to push the good things I do instead. I have a lot of movies and dramas on YouTube, but I never see you sharing the links so that my work can be successful.Let us be people who enjoy doing good in the community; lets not have a bad spirit of destruction. I am not a sex worker (pfambi), but I am a woman who believed in marriage, tried to enter into a union, but it failed, she said.\n\nMoyo, a mother of two, confirmed the videos age on her Facebook page and claimed the leak is a deliberate act of sabotage intended to ruin her budding career.\n\nMoyo, who is actively building her brand, insisted that the malicious timing is clear, noting the video was initially posted years ago without gaining traction.People in Zimbabwe rejoice when you are failing, the moment you try to rise up thats when they do their best to bring you down. Im trying very hard to build my brand, a brand that everyone will want to work with, yet my enemy is doing everything they can to destroy me.The video that is currently circulating on the internet is from around 2021. The enemy had posted it before, but it didnt circulate because I wasnt famous back then. Those who have been following me for a long time know that it was posted a long time ago, said MoyoThe content creator revealed that she tried contacting the source who posted the now leaked video on Telegram but was met with demands for unaffordable amounts of money.She indicated that she doesnt share explicit content for fame, differentiating herself from other content creators.I am not a person who looks for fame by trending in that way. I see a lot of people making over $5000 USD on a monthly basis posting those kinds of videos. If I were a person who wanted that, I would just do it and make money, not try to hide and deny things.I dont share pictures without clothes. I value my morals greatly. I am a mother of two beautiful kids; I try by all means to be a mother with dignity, said MoyoMoyo pleaded with the public to show support for the positive work she does, rather than participating in her destruction.The way you are pushing this is destroying me. I wish you would try to push the good things I do instead. I have a lot of movies and dramas on YouTube, but I never see you sharing the links so that my work can be successful.Let us be people who enjoy doing good in the community; lets not have a bad spirit of destruction. I am not a sex worker (pfambi), but I am a woman who believed in marriage, tried to enter into a union, but it failed, she said.\n\nMoyo, who is actively building her brand, insisted that the malicious timing is clear, noting the video was initially posted years ago without gaining traction.\n\nPeople in Zimbabwe rejoice when you are failing, the moment you try to rise up thats when they do their best to bring you down. Im trying very hard to build my brand, a brand that everyone will want to work with, yet my enemy is doing everything they can to destroy me.The video that is currently circulating on the internet is from around 2021. The enemy had posted it before, but it didnt circulate because I wasnt famous back then. Those who have been following me for a long time know that it was posted a long time ago, said MoyoThe content creator revealed that she tried contacting the source who posted the now leaked video on Telegram but was met with demands for unaffordable amounts of money.She indicated that she doesnt share explicit content for fame, differentiating herself from other content creators.I am not a person who looks for fame by trending in that way. I see a lot of people making over $5000 USD on a monthly basis posting those kinds of videos. If I were a person who wanted that, I would just do it and make money, not try to hide and deny things.I dont share pictures without clothes. I value my morals greatly. I am a mother of two beautiful kids; I try by all means to be a mother with dignity, said MoyoMoyo pleaded with the public to show support for the positive work she does, rather than participating in her destruction.The way you are pushing this is destroying me. I wish you would try to push the good things I do instead. I have a lot of movies and dramas on YouTube, but I never see you sharing the links so that my work can be successful.Let us be people who enjoy doing good in the community; lets not have a bad spirit of destruction. I am not a sex worker (pfambi), but I am a woman who believed in marriage, tried to enter into a union, but it failed, she said.\n\nPeople in Zimbabwe rejoice when you are failing, the moment you try to rise up thats when they do their best to bring you down. Im trying very hard to build my brand, a brand that everyone will want to work with, yet my enemy is doing everything they can to destroy me.\n\nThe video that is currently circulating on the internet is from around 2021. The enemy had posted it before, but it didnt circulate because I wasnt famous back then. Those who have been following me for a long time know that it was posted a long time ago, said MoyoThe content creator revealed that she tried contacting the source who posted the now leaked video on Telegram but was met with demands for unaffordable amounts of money.She indicated that she doesnt share explicit content for fame, differentiating herself from other content creators.I am not a person who looks for fame by trending in that way. I see a lot of people making over $5000 USD on a monthly basis posting those kinds of videos. If I were a person who wanted that, I would just do it and make money, not try to hide and deny things.I dont share pictures without clothes. I value my morals greatly. I am a mother of two beautiful kids; I try by all means to be a mother with dignity, said MoyoMoyo pleaded with the public to show support for the positive work she does, rather than participating in her destruction.The way you are pushing this is destroying me. I wish you would try to push the good things I do instead. I have a lot of movies and dramas on YouTube, but I never see you sharing the links so that my work can be successful.Let us be people who enjoy doing good in the community; lets not have a bad spirit of destruction. I am not a sex worker (pfambi), but I am a woman who believed in marriage, tried to enter into a union, but it failed, she said.\n\nThe video that is currently circulating on the internet is from around 2021. The enemy had posted it before, but it didnt circulate because I wasnt famous back then. Those who have been following me for a long time know that it was posted a long time ago, said Moyo\n\nThe content creator revealed that she tried contacting the source who posted the now leaked video on Telegram but was met with demands for unaffordable amounts of money.She indicated that she doesnt share explicit content for fame, differentiating herself from other content creators.I am not a person who looks for fame by trending in that way. I see a lot of people making over $5000 USD on a monthly basis posting those kinds of videos. If I were a person who wanted that, I would just do it and make money, not try to hide and deny things.I dont share pictures without clothes. I value my morals greatly. I am a mother of two beautiful kids; I try by all means to be a mother with dignity, said MoyoMoyo pleaded with the public to show support for the positive work she does, rather than participating in her destruction.The way you are pushing this is destroying me. I wish you would try to push the good things I do instead. I have a lot of movies and dramas on YouTube, but I never see you sharing the links so that my work can be successful.Let us be people who enjoy doing good in the community; lets not have a bad spirit of destruction. I am not a sex worker (pfambi), but I am a woman who believed in marriage, tried to enter into a union, but it failed, she said.\n\nThe content creator revealed that she tried contacting the source who posted the now leaked video on Telegram but was met with demands for unaffordable amounts of money.\n\nShe indicated that she doesnt share explicit content for fame, differentiating herself from other content creators.I am not a person who looks for fame by trending in that way. I see a lot of people making over $5000 USD on a monthly basis posting those kinds of videos. If I were a person who wanted that, I would just do it and make money, not try to hide and deny things.I dont share pictures without clothes. I value my morals greatly. I am a mother of two beautiful kids; I try by all means to be a mother with dignity, said MoyoMoyo pleaded with the public to show support for the positive work she does, rather than participating in her destruction.The way you are pushing this is destroying me. I wish you would try to push the good things I do instead. I have a lot of movies and dramas on YouTube, but I never see you sharing the links so that my work can be successful.Let us be people who enjoy doing good in the community; lets not have a bad spirit of destruction. I am not a sex worker (pfambi), but I am a woman who believed in marriage, tried to enter into a union, but it failed, she said.\n\nShe indicated that she doesnt share explicit content for fame, differentiating herself from other content creators.\n\nI am not a person who looks for fame by trending in that way. I see a lot of people making over $5000 USD on a monthly basis posting those kinds of videos. If I were a person who wanted that, I would just do it and make money, not try to hide and deny things.I dont share pictures without clothes. I value my morals greatly. I am a mother of two beautiful kids; I try by all means to be a mother with dignity, said MoyoMoyo pleaded with the public to show support for the positive work she does, rather than participating in her destruction.The way you are pushing this is destroying me. I wish you would try to push the good things I do instead. I have a lot of movies and dramas on YouTube, but I never see you sharing the links so that my work can be successful.Let us be people who enjoy doing good in the community; lets not have a bad spirit of destruction. I am not a sex worker (pfambi), but I am a woman who believed in marriage, tried to enter into a union, but it failed, she said.\n\nI am not a person who looks for fame by trending in that way. I see a lot of people making over $5000 USD on a monthly basis posting those kinds of videos. If I were a person who wanted that, I would just do it and make money, not try to hide and deny things.\n\nI dont share pictures without clothes. I value my morals greatly. I am a mother of two beautiful kids; I try by all means to be a mother with dignity, said MoyoMoyo pleaded with the public to show support for the positive work she does, rather than participating in her destruction.The way you are pushing this is destroying me. I wish you would try to push the good things I do instead. I have a lot of movies and dramas on YouTube, but I never see you sharing the links so that my work can be successful.Let us be people who enjoy doing good in the community; lets not have a bad spirit of destruction. I am not a sex worker (pfambi), but I am a woman who believed in marriage, tried to enter into a union, but it failed, she said.\n\nI dont share pictures without clothes. I value my morals greatly. I am a mother of two beautiful kids; I try by all means to be a mother with dignity, said Moyo\n\nMoyo pleaded with the public to show support for the positive work she does, rather than participating in her destruction.The way you are pushing this is destroying me. I wish you would try to push the good things I do instead. I have a lot of movies and dramas on YouTube, but I never see you sharing the links so that my work can be successful.Let us be people who enjoy doing good in the community; lets not have a bad spirit of destruction. I am not a sex worker (pfambi), but I am a woman who believed in marriage, tried to enter into a union, but it failed, she said.\n\nMoyo pleaded with the public to show support for the positive work she does, rather than participating in her destruction.\n\nThe way you are pushing this is destroying me. I wish you would try to push the good things I do instead. I have a lot of movies and dramas on YouTube, but I never see you sharing the links so that my work can be successful.Let us be people who enjoy doing good in the community; lets not have a bad spirit of destruction. I am not a sex worker (pfambi), but I am a woman who believed in marriage, tried to enter into a union, but it failed, she said.\n\nThe way you are pushing this is destroying me. I wish you would try to push the good things I do instead. I have a lot of movies and dramas on YouTube, but I never see you sharing the links so that my work can be successful.\n\nLet us be people who enjoy doing good in the community; lets not have a bad spirit of destruction. I am not a sex worker (pfambi), but I am a woman who believed in marriage, tried to enter into a union, but it failed, she said.\n\nLet us be people who enjoy doing good in the community; lets not have a bad spirit of destruction. I am not a sex worker (pfambi), but I am a woman who believed in marriage, tried to enter into a union, but it failed, she said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/13032709/1019101-e1760322465699.jpg",
            "description": "<p>By Staff Reporter  POPULAR Zimbabwean content creator, Michelle Moyo, known online as Ritzmacleish, has issued a defence after her nude video, reportedly dating back to 2021, was recently leaked and went viral across social media platforms. Moyo, a mother of two, confirmed the video’s age on her Facebook page and claimed the leak is a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/an-enemy-is-trying-to-hurt-me-says-content-creator-ritzmacleish-responding-to-leaked-nude-video/\">‘An enemy is trying to hurt me’— says content creator Ritzmacleish responding to leaked nude video</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "13 Oct 2025"
        },
        {
            "title": "Harare’s major road closed for rehabilitation exercise",
            "url": "https://www.newzimbabwe.com/harares-major-road-closed-for-rehabilitation-exercise/",
            "content": "By Alois Vinga\n\nTHE Ministry of Transport and Infrastructure Development (MoTID) has ordered a five-day long closure of one of Harares strategic roads, Glenara Road, to pave the way for rehabilitation works.\n\nThe countrys road rehabilitation is driven by the Emergency Road Rehabilitation Programme (ERRP), initiated after a 2021 state of national disaster declaration due to poor road conditions. This programme focuses on repairing a significant portion of the road network, aiming to improve safety, stimulate economic activity, and connect communities to essential services like health, education, and markets.\n\nTo date, major road uplifts have been undertaken along the countrys major highways to revamp the countrys roads infrastructure.\n\nIn a statement, the MoTID announced that Glenara Road will not be accessible due to ongoing works.\n\nThe MoTID wishes to notify the motoring public and residents of the temporary partial closure of a section of Glenara Road to facilitate essential road rehabilitation works.\n\nAs part of the governments ongoing road infrastructure rehabilitation programme, this project aims to enhance road safety drainage and travel conditions for all users, said the ministry in a statement.\n\nThe affected section of Genara Road is between Service Station and Samora Machel Avenue will be partially closed to through traffic.\n\nMotorists travelling from ED Mnangagwa Road were advised to follow the designated detour, which proceeds via Glen Roy, turns onto Sloane Street, continues on Montgomery Road, then onto Rhodesville Avenue and finally rejoins Glenara Road via Samora Machel Avenue.\n\nProperties within the construction zone will remain accessible, with traffic management personnel on site to assist residents and businesses. To ensure the safety of all motorists and construction personnel and facilitate a smooth flow of traffic, the ministry strongly advises the public to obey all posted traffic signs and instruction from officials, drive with caution and at reduced speeds through the affected area, and allow for extra travel time to their schedules, the ministry added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/05162122/Road-Construction.jpg",
            "description": "<p>By Alois Vinga THE Ministry of Transport and Infrastructure Development (MoTID) has ordered a five-day long closure of one of Harare’s strategic roads, Glenara Road, to pave the way for rehabilitation works. The country’s road rehabilitation is driven by the Emergency Road Rehabilitation Programme (ERRP), initiated after a 2021 state of national disaster declaration due</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harares-major-road-closed-for-rehabilitation-exercise/\">Harare’s major road closed for rehabilitation exercise</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "13 Oct 2025"
        }
    ]
}