{
    "news": [
        {
            "title": "Tanzanian jailed 15 years for drug trafficking in Zimbabwe",
            "url": "https://www.newzimbabwe.com/tanzanian-jailed-15-years-for-drug-trafficking-in-zimbabwe/",
            "content": "By Staff Reporter\n\nA TANZANIANhas been sentenced to an effective 15 years imprisonment following his conviction by a Zimbabwean court for drug trafficking.\n\nThe offender, Sleiman Amour (44), appeared at the Bulawayo High Court for unlawful possession of methamphetamine.\n\nThe State case was that on October 23, 2025, police officers manning a roadblock at the 18km peg along Bulawayo-Plumtree road stopped a South African-registered Mann truck heading towards Plumtree.\n\nIt was further heard that the police requested the Tanzanian driver to produce a temporary import permit and he failed, forcing the cops to search the vehicle. As this was happening, Amour, who was a passenger in the truck, led officers to the loading box where there were lunch boxes wrapped in foil and loaded among bags of beans. He opened one of the boxes and started eating spaghetti in a bid to divert their attention.\n\nSome of the officers conducted a further search, leading to the discovery of more boxes containing methamphetamine hidden in a specially designed compartment on the roof of the truck.\n\nSensing danger, the driver and another passenger fled the scene, but the offender was arrested before he could escape. The truck was subsequently seized and forfeited to the State.\n\nIn a statement following sentencing, the National Prosecuting Authority of Zimbabwe (NPAZ) said drug misuse and trafficking in harmful substances were destroying lives and communities across the country hence the need for stiffer sentences against peddlers.\n\nCases like this highlight the serious consequences of choosing the drug trade over honest living. Let this be a warning to all, the law is watching and the courts are taking a firm stance, the NPAZ noted.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg",
            "description": "<p>By Staff Reporter A TANZANIAN has been sentenced to an effective 15 years’ imprisonment following his conviction by a Zimbabwean court for drug trafficking. The offender, Sleiman Amour (44), appeared at the Bulawayo High Court for unlawful possession of methamphetamine. The State case was that on October 23, 2025, police officers manning a roadblock at the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tanzanian-jailed-15-years-for-drug-trafficking-in-zimbabwe/\">Tanzanian jailed 15 years for drug trafficking in Zimbabwe </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:29",
            "date": "05 Nov 2025"
        },
        {
            "title": "‘One of us’: Ugandan pride in New York mayor with roots in their country",
            "url": "https://www.newzimbabwe.com/one-of-us-ugandan-pride-in-new-york-mayor-with-roots-in-their-country/",
            "content": "BBC\n\nMany Ugandans are expressing their pride in the newly elected mayor of New York, Zohran Mamdani, who was born in Uganda and retains dual nationality.\n\nSome have described him as one of their own, saying he inspires them.\n\nA journalist who mentored him during his teenage internship at one of Ugandas leading newspapers told the BBC that there was a lot of excitement in Uganda about Mamdanis rise especially because of his young age. Uganda has the second-lowest median age worldwide of just 16.2, according to the CIA World Factbook.\n\nZohran, 34, is the son of Prof Mahmood Mamdani, a prominent Ugandan academic, while his mother, Mira Nair, is an acclaimed filmmaker.\n\nJournalist Angelo Izama told the BBCs Newsday programme that the younger Mamdani was initially shy while they worked together, but was absolutely determined to get things done.\n\nHe says Zohran is very fond of Kampala, Ugandas capital, which he often mentions.\n\nMahmood Mamdani was raised in Uganda and worked for more than a decade at Makerere University, the countrys main and oldest university. He met his wife in Kampala while she was researching Mississippi Masala, a film about the expulsion of Asians from Uganda under Idi Amin.\n\nProf Mamdani is known for his anti-colonialist scholarship, which examines the legacy of colonialism in Africa and its impact on governance, identity and justice.\n\nMakerere University professor Okello Ogwang says he feels great about Zohrans success, describing him as the son of a colleague. This is somebody from home.\n\nWe have one of us there, he told the BBC.\n\nIt gives me hope that the children we are raising are the hope of this world. As a continent we are missing out on the greatest resource we have  the youth.\n\nWhile many Ugandans had not heard of Zohran until his election, a student at the university said people were very happy, saying it proved that anyone could rise above their background.\n\nIt gives morale, especially to us as youths, said Abno Collins Kuloba. Wherever you have grown up, be it poor or rich, you can become something big, like what [Mamdani] has done.\n\nAnother student, Chemtai Zamzam, said she was happy, for herself and Ugandans. She said Mamdani was an inspiration to her as a young person, as it shows we can become anything we want as long as we put faith and determination.\n\nThe new mayor is also being celebrated elsewhere in the continent.\n\nAbdul Mohamed, an Ethiopian who is a former senior UN and African Union official, describes Mahmood Mamdani as a distinguished scholar of African politics, a man who interrogated power and justice.\n\nHe says having known Zohran since infancy, he sees him as having inherited his fathers commitment to pan-Africanism, his parents courage to think freely, and their belief that one can belong everywhere.\n\nHe says Zohrans rise is symbolic and practical especially to young Africans, asking them to draw from him lessons in politics.\n\nI think through him, [the] power and beauty of multi-ethnic, multi-religious identity found its voice. And Africa is by and large a multi-ethnic and a multi-religious society, he says.\n\nHe adds that as Zohran has demonstrated, young people need to organise and build political action and avoid despair and avoid pure anger.\n\nUganda is holding elections next year, with 81-year-old President Yoweri Museveni seeking another term after almost 40 years in power.\n\nThe Mamdani family also spent at around three years in Cape Town, South Africa, after Mahmood was appointed the Chair of African Studies at the University of Cape Town in the 1990s.\n\nSome South Africans have also been taking pride in his historic election.\n\nHailing his victory as as a remarkable achievement, the imam of Cape Towns Claremont Road Mosque, Rashied Omar, said that Zohrans formative years were shaped, in small part, in our congregation.\n\nHe said that Zohran began his Islamic education at the mosque, and started his schooling at St Georges Grammar.\n\nIt is inspiring to see how Zohrans early South African experiences, though modest, made a lasting impression on his political consciousness and helped shape his creative, community-based approach to politics, Dr Omar said.\n\nAs South African social justice activists, we can now learn from Zohrans example, how to practise progressive politics that resonates with new generations and builds bridges across race, class, and faith, he added.\n\nThe Economic Freedom Fighters (EFF), the fourth-biggest party in South Africa which champions left-wing economic policies, also hailed Zohrans victory as historic.\n\nHis election represents not only a transformative moment for the people of New York but also a powerful signal to the world that progressive justice-driven leadership is rising even in the heart of the global capitalist order, the party said in a statement.\n\nIn Nigeria, a Christian pastor who is a supporter of President Bola Tinubu also welcomed Zohrans victory.\n\nPastor Okezie J Atai said on X that Nigeria cannot be threatenedby US President Donald Trump, whose threats could not subdue the 34-year-old Zohran.\n\nLast week,Trump threatened to take military action to tackle Islamist insurgents in Nigeria, accusing the government of failing to protect Christians.\n\nGovernment officials responded by saying that jihadists were not targeting members of a particular religion and that they had killed people from all faiths, or none.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/05180408/mamdani.webp",
            "description": "<p>BBC Many Ugandans are expressing their pride in the newly elected mayor of New York, Zohran Mamdani, who was born in Uganda and retains dual nationality. Some have described him as one of “their own”, saying he inspires them. A journalist who mentored him during his teenage internship at one of Uganda’s leading newspapers told</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/one-of-us-ugandan-pride-in-new-york-mayor-with-roots-in-their-country/\">‘One of us’: Ugandan pride in New York mayor with roots in their country</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:29",
            "date": "05 Nov 2025"
        },
        {
            "title": "Back to the future: Why defending Zimbabwe’s Constitution is defending the country",
            "url": "https://www.newzimbabwe.com/back-to-the-future-why-defending-zimbabwes-constitution-is-defending-the-country/",
            "content": "By Chofamba Sithole\n\nWhen Nelson Chamisa recently declared on X that there is no constitution to protect or defend and that we must instead defend and protect our country, his words struck a chord with many Zimbabweans disillusioned by the state of our politics. But they also risk leading us astray at a moment when clarity and focus are essential.\n\nTo suggest that there is no constitution to defend is to surrender the very ground upon which the democratic struggle was built. Our constitution is not some detached piece of paperit is the living embodiment of the peoples will, painstakingly won through generations of struggle. To abandon it is to abandon Zimbabwe itself.\n\nWe have been here before. In the late 1990s, Zimbabwe was gripped by a similar sense of national crisis. Corruption, authoritarianism, and economic decline had hollowed out public confidence in the state. Recognising the depth of the malaise, a broad coalition of social movementsfrom labour unions to churches, students, womens groups, and civic activistsconcluded that the countrys salvation lay in a new constitutional order.\n\nOut of this awakening came the National Constitutional Assembly (NCA), spearheaded by the Zimbabwe Congress of Trade Unions under the leadership of Gibson Sibanda and Morgan Tsvangirai. The NCAs mission was clear: to mobilise citizens to write a people-driven constitution that would redefine the relationship between state and citizen.\n\nAlarmed by this groundswell, Robert Mugabes government rushed to produce its own draft through a state-appointed commission. But when this elite-driven constitution was put to a referendum in February 2000, the people rejected it. For the first time in history, Mugabe tasted defeat at the ballot box, because Zimbabweans demanded a constitution of the people, not for the rulers.\n\nThat dream was finally realised in 2013, when, during the inclusive government, the Movement for Democratic Change (MDC) and ZANU-PF agreed to a consultative process that produced a new, progressive, and people-endorsed constitution. Adopted by an overwhelming majority, it became Zimbabwes first truly democratic social contract.\n\nBut from the very beginning, the ruling elite treated this document not as a national covenant but as an inconvenience. After Emmerson Mnangagwa became President following the November 2017 military coup, he led efforts to butcher the new constitution, most notably the presidential running mate clause, to ensure continuity of Big Man, presidential dominance.\n\nNow Mnangagwa seeks, further, to drive a chariot and horses through the same constitution he once swore to uphold. His reported ambition to amend or suspend key provisions to entrench a preferred succession plan amounts to nothing less than a constitutional coup. With a co-opted and compliant parliament, the regime hopes to legalise illegality and codify authoritarianism.\n\nWhat is at stake, therefore, is not simply a factional battle within ZANU-PF between Mnangagwa and his deputy, General Constantino Chiwenga. It is a national crisis that cuts to the very foundations of the Republic. The fight over the constitution is the fight over the soul of Zimbabwe.\n\nIt is in this context that Advocate Nelson Chamisas assertion that there is no constitution to defend may be seen as problematic. The constitution defines who we are, what we aspire to become, and what powers the state may or may not exercise over us.\n\nTo claim that the constitution is in tatters and therefore unworthy of defense is to concede defeat to those who have been tearing it apart. The constitutions fragility is not a reason to abandon it; it is the reason we must defend it all the more vigorously.\n\nThe 2013 Constitution remains a democratising document, a peoples shield against tyranny. It provides the legal, moral, and political framework through which citizens can resist authoritarian excesses. It tells us not just what Zimbabwe is, but what Zimbabwe ought to be.\n\nWithout it, talk of defending the country becomes abstract rhetoric. What country are we defending, if not the one defined by a constitution born of the peoples struggle? What rules guide that defence? What limits restrain it? If the fight for Zimbabwe is undefined, it risks descending into chaos or co-option.\n\nZimbabwe stands today at another historic crossroads. The constitution is under siege. The institutions meant to uphold it have been captured. The opposition has been divided and, in some cases, clearly paid off. Yet this very moment demands that all democratic forces  political, civic, and social  reclaim their original mission: to defend the constitution as the ultimate expression of the peoples sovereignty.\n\nThe answer to authoritarian manipulation is not to discard the constitution but to rally around it. That was the lesson of 1999. It remains the challenge of 2025.\n\nIf the constitution falls, the Republic falls with it.\n\nSo yes, Zimbabwe must be defended, but to defend Zimbabwe is to defend its constitution. The two are one and the same.\n\nHistory has given Nelson Chamisa a through-pass in the penalty box. The question is, will he shoot for the goal by galvanising Zimbabweans to save their constitution, hence their nation?\n\nChofamba Sithole is a veteran Zimbabwean journalist and political commentator.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/05121529/chofamba.jpg",
            "description": "<p>By Chofamba Sithole When Nelson Chamisa recently declared on X that “there is no constitution to protect or defend” and that “we must instead defend and protect our country,” his words struck a chord with many Zimbabweans disillusioned by the state of our politics. But they also risk leading us astray at a moment when</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/back-to-the-future-why-defending-zimbabwes-constitution-is-defending-the-country/\">Back to the future: Why defending Zimbabwe’s Constitution is defending the country</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:29",
            "date": "05 Nov 2025"
        },
        {
            "title": "Zimbabwe set for normal to above-normal rainfall",
            "url": "https://www.newzimbabwe.com/zimbabwe-set-for-normal-to-above-normal-rainfall/",
            "content": "By Anna Chibamu\n\nThe Meteorological Services Department (MSD) has forecast a normal to above-normal rainfall season across most parts of Zimbabwe for the 20252026 farming period.\n\nMSD director Rebecca Manzou announced the first seasonal forecast for November, December, and January during a stakeholder briefing in Harare on Tuesday. She said collaborative work between the MSD and its regional partners indicated generally favourable rainfall patterns across the country.\n\nIn general, from November to January, the northern part of the country is normal to above normal rainfall, said Manzou.\n\nThe bulk of the country,which includes Manicaland, Masvingo, most of Mashonaland East, Harare Metropolitan, much of Midlands, the southern parts of Mashonaland Central and West, the south-eastern part of Mashonaland North, Bulawayo Metropolitan, and the bulk of Matabeleland South,has an increased chance of above normal rainfall.\n\nShe added, Also, from November to January, in the northern and western parts of the country, there is an increased chance of normal to above normal rainfall. So, we are at a good place as a country.\n\nFor the period December 2025 to February 2026, Manzou said rainfall is expected to remain within the normal to above-normal range, with the same trend likely to continue from January to March.\n\nHowever, she cautioned that rainfall patterns may vary from month to month, with nearer forecasts being more accurate.\n\nNovember will have normal to below normal rainfall. So, we are already in November and, in general, we are not talking of site-specific forecasts.\n\nFor December, rainfall distribution in the southern parts of the country will be higher compared to the northern parts.\n\nJanuary is expected to have a normal to above normal; February, normal to above normal it is a cumulative rainfall pattern, she explained.\n\nManzou urged farmers to seek advice from Agritex officers in their respective areas and avoid planting before the onset of effective rains.\n\nThe MSD is also monitoring temperature trends for the season. Despite recent hot weather, the conditions donot qualify as a heatwave.\n\nAccording to the MSD, temperatures for November to December are expected to be warmer than normal, while December will likely experience cooler-than-normal conditions.\n\nIt is now cooler, except in the extreme north, where it is still very uncomfortable (hot), Manzou said.\n\nFrom January to February 2026, temperatures are projected to remain cooler than normal across the country.\n\nManzou reminded stakeholders that the forecast issued was for total cumulative rainfall amounts, expressed relative to long-term averages, and that the MSD also issues daily, three-day, and 10-day forecasts for more precise weather guidance.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/05061210/rain.jpg",
            "description": "<p>By Anna Chibamu The Meteorological Services Department (MSD) has forecast a normal to above-normal rainfall season across most parts of Zimbabwe for the 2025–2026 farming period. MSD director Rebecca Manzou announced the first seasonal forecast for November, December, and January during a stakeholder briefing in Harare on Tuesday. She said collaborative work between the MSD</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-set-for-normal-to-above-normal-rainfall/\">Zimbabwe set for normal to above-normal rainfall</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:29",
            "date": "05 Nov 2025"
        },
        {
            "title": "TN Cybertech launches aggressive rebranding exercise",
            "url": "https://www.newzimbabwe.com/tn-cybertech-launches-aggressive-rebranding-exercise/",
            "content": "By Alois Vinga\n\nTN Cybertech Investments Limited (TNCI) has launched an aggressive rebranding exercise, which is set to be rolled out across the group as the year progresses.\n\nPresenting the groups half-years performance for the period ended August 31 2025, TNCI GCEO, James Mushore, said the group is undertaking an extensive rebranding program which has so far started off with selected bank branches such as the Borrowdale Platinum Branch.\n\nIn the second half of the financial year, this initiative will extend to our agent network, kiosks, digital platforms, products and remaining branches. At the heart of this transformation are the Banks core values encapsulated in the acronym IDIFOH  Innovation, Dignity, Industry, Faith, Originality and Humility  which form the foundation of our brand identity and customer promise, said Mushore.\n\nDuring the period, digital bank revenue reached ZWG 179 million, representing a 40% increase compared to the same period in the prior year on the back of a performance driven by strong growth in mobile banking and POS channels, the latter rising 89% year-on-year.\n\nTreasury and funded income segments also performed strongly, with interest-earning assets up 32% and net interest income up 235%. In the second half of the year, the bank expects to deepen partnerships with corporates in the mining, agriculture and manufacturing sectors to further strengthen its loan book and funded income base.\n\nTNCI intends to build on the Reserve Bank of Zimbabwes National Payment System Report on digital banking which stated that transaction volumes grew by 6% during the first half of 2025, while ATM and POS volumes rose by 8% and 13% respectively.\n\nBuilding on this momentum, the Bank deployed smart ATMs in Bulawayo and Harares CBD and expanded its POS network to enhance service delivery for both corporates and SMEs. The Bank continues to digitalise its agent-banking model, ensuring that infrastructure growth matches its expanding footprint, Mushore said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/05180109/nyambirai.jpg",
            "description": "<p>By Alois Vinga TN Cybertech Investments Limited (TNCI) has launched an aggressive rebranding exercise, which is set to be rolled out across the group as the year progresses. Presenting the group’s half-year’s performance for the period ended August 31 2025, TNCI GCEO, James Mushore, said the group is undertaking an extensive rebranding program which has</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tn-cybertech-launches-aggressive-rebranding-exercise/\">TN Cybertech launches aggressive rebranding exercise</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:29",
            "date": "05 Nov 2025"
        },
        {
            "title": "ZIFA appoints Marian Marinica new Warriors head coach",
            "url": "https://www.newzimbabwe.com/zifa-appoints-marian-marinica-new-warriors-head-coach/",
            "content": "By Sports Reporter\n\nZIFA has appointed Marian MarioMarinica as the new head coach of the Zimbabwe Senior Mens National Football Team, the Warriors, on a one-year contract.\n\nMarinica is a Romanian national who has previously managed Malawi and Liberia.\n\nThe 60-year-old gaffer is a UEFA Pro License holder with over 25 years of experience in the game.\n\nIn a statement, ZIFA said Marinica was given a one-year contract andwill becommencing duty this month.\n\nZimbabwe Football Association (ZIFA) is pleased to announce the appointment of Marian (Mario) Marinica as the new Head Coach of the Zimbabwe Senior Mens National Football Team, the Warriors, on a one-year contract.\n\nThroughout his distinguished career, Marinica has worked with several prestigious clubs and national teams, including Arsenal FC, Chelsea FC, Internazionale Milano, AS Monaco, Liverpool FC, and Tottenham Hotspur, as well as the national teams of Paraguay, Mauritius, Malawi, and Liberia.\n\nUnder his leadership, Malawi reached the Round of 16 at the 2022 Africa Cup of Nations, their best-ever finish, while Liberia became the highest climber in the FIFA Rankings in June 2024, reads thestatementon Marinicas appointment.\n\nHe comes in toreplaceMichael Nees, who was fired last month following a string ofpoor results.\n\nMarinicas first assignment will be the upcoming friendly matches against Qatar and Algeria.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/05043256/marion-coach.jpeg",
            "description": "<p>By Sports Reporter ZIFA has appointed Marian ‘Mario’ Marinica as the new head coach of the Zimbabwe Senior Men’s National Football Team, the Warriors, on a one-year contract. Marinica is a Romanian national who has previously managed Malawi and Liberia. The 60-year-old gaffer is a UEFA Pro License holder with over 25 years of experience in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zifa-appoints-marian-marinica-new-warriors-head-coach/\">ZIFA appoints Marian Marinica new Warriors head coach</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:29",
            "date": "05 Nov 2025"
        }
    ]
}