{
    "news": [
        {
            "title": "Zimbabwe’s gold coins sell for record $3,000 as bullion surges",
            "url": "https://www.newzimbabwe.com/zimbabwes-gold-coins-sell-for-record-3000-as-bullion-surges/",
            "content": "Bloomberg\n\nZimbabwes gold coins sold above $3 000 for the first time since they were introduced almost three years ago as the price of bullion surged.\n\nThe 22-carat Mosi-Oa-Tunya gold coins, named after Victoria Falls, a popular tourist destination in southern Africa, were priced at $3 018.38, according to data on the Reserve Bank of Zimbabwes website Monday. Spot gold rose to a record $2 911.72 an ounce after US President Donald Trump said he plans to impose 25% tariffs on steel and aluminium imports.\n\nThe coins have been snapped up by institutional investors and ordinary citizens seeking a store of value against high inflation and frequent currency crises.\n\nThe bulk of the coins were bought using the Zimbabwean dollar, which was replaced by the ZiG in April, after it lost 80% of its value against the greenback in just under four months.\n\nGovernor John Mushayavanhu said in July the central bank would stop minting the coins to boost its gold reserves used to back the ZiG. At the end of January, the southern African nation held about 2.67 tons of gold, the governor said.\n\nHolders of the gold coins can still redeem them at the central bank.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/07/21142401/gold-coins.webp",
            "description": "<p>Bloomberg Zimbabwe’s gold coins sold above $3 000 for the first time since they were introduced almost three years ago as the price of bullion surged. The 22-carat “Mosi-Oa-Tunya” gold coins, named after Victoria Falls, a popular tourist destination in southern Africa, were priced at $3 018.38, according to data on the Reserve Bank of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-gold-coins-sell-for-record-3000-as-bullion-surges/\">Zimbabwe’s gold coins sell for record $3,000 as bullion surges</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:24",
            "date": "11 Feb 2025"
        },
        {
            "title": "Zuma orders daughter to apologise for online rant against MK Party secretary-general Shivambu",
            "url": "https://www.newzimbabwe.com/zuma-orders-daughter-to-apologise-for-online-rant-against-mk-party-secretary-general-shivambu/",
            "content": "News24\n\nIn his capacity as MK Party (MKP) leader, Jacob Zuma has demanded an apology from Duduzile Zuma-Sambudla  his daughter  after she posted remarks on social media about the partys secretary-general, Floyd Shivambu.\n\nShe has since been told to issue a public apology or face disciplinary action.\n\nIn a series of X posts, Zuma-Sambudla lashed out at Shivambu, describing him as useless and the worst thing that happened to MK, drawing the wrath of the party in the process.\n\nIn a party statement, MKP said it acknowledges the recent public posts on X made by MK member, Commander Duduzile Zuma.\n\nThese posts are insulting towards the secretary-general of uMkhonto weSizwe Party, constituting a direct violation of the partys disciplinary code of conduct. Such actions are unacceptable, divisive, denigrating, and offensive. They undermine the principles of unity, respect, and discipline that are fundamental to the values of uMkhonto weSizwe Party, it stated.\n\nIt said Zuma issued a directive demanding that Zuma-Sambudla issue an unconditional public apology to the secretary-general, the president, members, supporters of uMkhonto weSizwe, and all the people of South Africa.\n\nIt also ordered that she extend formal apologies to all structures she serves in or leads, including the Southern Caucus of the Pan-African Parliament.\n\nThese apologies must be made immediately. Following this, an internal disciplinary process will be initiated in accordance with the uMkhonto weSizwe Party constitution, code of conduct and all relevant prescripts, the party said.\n\nFailure to comply with this directive will result in immediate consequences, including the summary termination of Commander Duduzile Zumas membership in uMkhonto weSizwe Party and her recall from all party responsibilities.\n\nShivambu retweeted the party statement, but issued no response in his personal capacity.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/30053914/DUDUZILE-ZUMA.webp",
            "description": "<p>News24 In his capacity as MK Party (MKP) leader, Jacob Zuma has demanded an apology from Duduzile Zuma-Sambudla – his daughter – after she posted remarks on social media about the party’s secretary-general, Floyd Shivambu. She has since been told to issue a public apology or face disciplinary action. In a series of X posts,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zuma-orders-daughter-to-apologise-for-online-rant-against-mk-party-secretary-general-shivambu/\">Zuma orders daughter to apologise for online rant against MK Party secretary-general Shivambu</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:24",
            "date": "11 Feb 2025"
        },
        {
            "title": "Super Bowl Halftime Show dancer gets NFL lifetime ban for displaying Palestinian flag during performance",
            "url": "https://www.newzimbabwe.com/super-bowl-halftime-show-dancer-gets-nfl-lifetime-ban-for-displaying-palestinian-flag-during-performance/",
            "content": "The Algemeiner\n\nA dancer in Kendrick Lamars Super Bowl LIX Halftime Show has been banned for life from all National Football League stadiums and events for waving a combined Palestinian-Sudanese flag with the words Gaza and Sudan during the rappers performance on Sunday night at Caesars Superdome in New Orleans.\n\nThe NFL said the African American protester, who has not been identified, concealed the flag and unveiled it without prior knowledge by the shows production team.\n\nWe commend security for quickly detaining the individual who displayed the flag, the NFL said in a released statement. He was a part of the 400-member field cast. The individual hid the item on his person and unveiled it late in the show. No one involved with the production was aware of the individuals intent. The league added that the individual will banned for life from all NFL stadiums and events.\n\nToward the end of Lamars performance  after his track Not Like Us and right before his final song TV Off  the dancer waved the flag while standing on top of a car used as a prop in the performance. The car, a Buick Grand National GNX, inspired the name of Lamars latest album, GNX, and it was a key prop in the rappers halftime show performance.\n\nSudan and Gaza were written on the white sections of the flag held by the protester. A heart was drawn next to Sudan and a solidarity fist was depicted next to the word Gaza. The dancer, who wore a black ensemble matching the other dancers on stage, alsojumped off the carand fled the stage while still displaying the flag. He waved it while standing on the ground near other dancers before security personnel tackled and detained him. He was then removed from the field and escorted from the stadium. New Orleans police toldUSA Todaythat as of Monday, the performer has not been formally arrested or charged.\n\nThe incident took place a day after three more Israeli hostages were freed from Hamas captivity in Gaza, as part of a ceasefire agreement in the war between the terrorist organization and Israel, and while a civil war rages on in Sudan.\n\nThe New Orleans Police Department said it continues to work with NFL and the halftime production team to ascertain any affiliation the individual may have had with the halftime show.\n\nThe entertainment company behind the halftime show, Roc Nation, said in a statement that the act by the individual was neither planned nor part of the production and was never in any rehearsal.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/11094437/superbowl-.jpg",
            "description": "<p>The Algemeiner A dancer in Kendrick Lamar’s Super Bowl LIX Halftime Show has been banned for life from all National Football League stadiums and events for waving a combined Palestinian-Sudanese flag with the words “Gaza” and “Sudan” during the rapper’s performance on Sunday night at Caesars Superdome in New Orleans. The NFL said the African</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/super-bowl-halftime-show-dancer-gets-nfl-lifetime-ban-for-displaying-palestinian-flag-during-performance/\">Super Bowl Halftime Show dancer gets NFL lifetime ban for displaying Palestinian flag during performance</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:24",
            "date": "11 Feb 2025"
        },
        {
            "title": "Mbuyiseni Ndlozi resigns from EFF, announces ambition to join civil society",
            "url": "https://www.newzimbabwe.com/mbuyiseni-ndlozi-resigns-from-eff-announces-ambition-to-join-civil-society/",
            "content": "TimesLive\n\nFormer EFF MP Mbuyiseni Ndlozi has announced his decision to leave the EFF and politics.\n\nThis comes months after speculation about his fallout with party leader Julius Malema.\n\nIn an interview with the SABC, Ndlozi expressed his desire to contribute to academia, leveraging on his educational background.\n\nI have taken a decision to step away from party politics, he said.\n\nI have left the EFF. I have left party politics. I have handed over my resignation as a member and it is because where I want to go and contribute, I cant hold a single party membership.\n\nIn January the EFF announced Ndlozi had resigned from parliament.\n\nIm passionate about the upliftment of the levels of discourse in the country but most importantly I think the terrain of struggle that has been neglected over the years is the civil society space. Im interested in it because it is where you are able to cultivate and agitate the notions of freedom, where liberation is about the people, community development, research, advocacy.\n\nIts time somebody did for the people of this country what AfriForum is doing for the Afrikaners.\n\nNdlozis resignation from the EFF follows that of prominent members, including former deputy leader Floyd Shivambu, who left last year to join Jacob Zumas MK Party.\n\nNdlozi confirmed he was suspended after he was charged by the EFF on allegations of being part of the MK Partys infiltration strategy and not informing the leadership about Shivambus intention to leave the party.\n\nHe said he couldnt attend the conference of the EFF due to a dispute over his suspension, after being served with a suspension notice six weeks before the elective conference in December.\n\nHe said the suspension was unconventional in that it didnt rely on the code of conduct of the EFF.\n\nI was told to stay at home, cease my participation in parliament and the rest of the activities of the EFF. It was important for me because they said the investigation was still ongoing and when the investigation was finished I would be given an opportunity to respond to the allegations.\n\nI think we can agree these are dangerous and serious allegations. Later, the leadership argued the report would only be ready after conference and the matter has been referred to the leadership after the conference. It seemed fair for me to wait to clear my name so I did not function with a dark cloud over my head or a gun in my face.\n\nHe also confirmed he knew about Shivambus departure but believed it wasnt his place to inform the leadership.\n\nI knew about the departure of Floyd. He came to tell me of his consideration and I told him he would have to take the leadership into [his] confidence, and he did.\n\nThe idea that I should have run behind his back and informed other people or the leadership suggested Im an informant, a gossiper or a wedge driver. I am none of those.\n\nIt was Floyds decision; he had to communicate it. It was not my decision, he had to communicate it and he did.\n\nHe made it clear he never intended to join Zumas party.\n\nI never planned to join the MK Party, I still dont. I never worked with anybody in the MK Party in relation to some conspiracy about my departure. Whatever information they say they have was based largely on lies.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/11054437/mbuyiseni.jpg",
            "description": "<p>TimesLive Former EFF MP Mbuyiseni Ndlozi has announced his decision to leave the EFF and politics. This comes months after speculation about his fallout with party leader Julius Malema. In an interview with the SABC, Ndlozi expressed his desire to contribute to academia, leveraging on his educational background. “I have taken a decision to step</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mbuyiseni-ndlozi-resigns-from-eff-announces-ambition-to-join-civil-society/\">Mbuyiseni Ndlozi resigns from EFF, announces ambition to join civil society</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:24",
            "date": "11 Feb 2025"
        },
        {
            "title": "Sables to host United Arab Emirates ahead of Rugby Africa Cup",
            "url": "https://www.newzimbabwe.com/sables-to-host-united-arab-emirates-ahead-of-rugby-africa-cup/",
            "content": "By Sport Reporter\n\nZimbabwe senior mens rugby team is set to host the United Arab Emirates this year as part of its preparations for the Rugby Africa Cup.\n\nSables match against UAE willbe played on May24in Harare.\n\nZimbabwe will use the match as part of its preparations for the Rugby Africa Cup, where they will be hoping to defend the title.\n\nWinners of this years Rugby Africa Cup will automatically qualify for the 2027 World Cup.\n\nWe are going to play United Arab Emirates here on the 24th of May.\n\nThis is one of the many test games that our team will play ahead of Rugby Africa Cup.\n\nThis year, Africa Cup comes with a ticket to the World Cup. Hence, we have to up our preparations, said Zimbabwe Rugby Union president Losson Mtongwiza.\n\nSables had a successful tour inUnited Arab Emirates in November last year, beating the host to record their first victory outside the African continent.\n\nOther than playing UAE, the president added that they have lined up several games as part of preparations for Rugby Africa Cup.\n\nWe are also going to play Zambia, then Botswana and from there we will play one of the elite clubs in South Africa.\n\nThese are part of the games we have confirmed, but still, we are working to secure more, Mtongwiza added.\n\nZimbabwe mens rugby team had a good 2024 season, which saw them winning the Rugby Africa Cup to end a 12-year jinx.\n\nHowever, the greater task is awaiting this year, which is for them to qualify for the World Cup and mark their return since 1991.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/26074443/Losson-Pic2-1-696x1149-1-e1724150059820.jpg",
            "description": "<p>By Sport Reporter Zimbabwe senior men’s rugby team is set to host the United Arab Emirates this year as part of its preparations for the Rugby Africa Cup. Sables’ match against UAE will be played on May 24 in Harare. Zimbabwe will use the match as part of its preparations for the Rugby Africa Cup, where they will</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sables-to-host-united-arab-emirates-ahead-of-rugby-africa-cup/\">Sables to host United Arab Emirates ahead of Rugby Africa Cup</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:24",
            "date": "11 Feb 2025"
        },
        {
            "title": "Double-digit US$ inflation figure a cause for concern- Industry says",
            "url": "https://www.newzimbabwe.com/double-digit-us-inflation-figure-a-cause-for-concern-industry-says/",
            "content": "By Alois Vinga\n\nA double-digit US$ inflation rate is cause for concern considering the economy is already highly dollarized, industry lobby group Confederation of Zimbabwe Industries (CZI) has said.\n\nZimbabweis battling to maintain sustainable inflation rates with a series of measures being implemented time and again to achieve the goal.\n\nLast year, the Reserve Bank of Zimbabwe (RBZ) introduced the ZWG currency  a minerals and foreign currency backed local unit and presented it as the lasting solution to decades-old currency problems.\n\nSix months after its introduction,the ZWG sufferedmassive depreciation against the greenback on the alternative market. The central bank was forced to swallow the bitter pill after intervening by unilaterallydeclaring a 43% devaluation rate in a bid to align with realistic market trends.\n\nHowever, inflationary rates published by the Zimbabwe National Statistics Agency (Zimstat) last month indicated that the countrys safe-haven, the US$ endured severe inflation blows after the year-on-year US$ inflation rate for January 2025 jumped to 14.6%, thereby gaining 12,1% from a rate of 2,5% in December 2024.\n\nAgainst the background, double-digit USD inflation under a highly dollarized environment is a cause for concern, as prices are generally expected to be stable in USD terms, the industry grouping inflation tracker said.\n\nRecords show that US$ inflation rate has been stable since January 2021 with current trends departing from the years long gains.\n\nIn Zimbabwe, US$ inflation is normally a response to ZWG inflation, as retailers adjust their prices in line with ZWG prices to avoid being accused by the RBZs Financial Intelligence Unit (FIU) for using the parallel market rates, the CZI analysis said.\n\nThe US$ month-on-month inflation began the year at a higher rate of about 11,5% for January 2025, which is an all-time high rate over the past four years.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/23052419/us-dollar.jpg",
            "description": "<p>By Alois Vinga A double-digit US$ inflation rate is cause for concern considering the economy is already highly dollarized, industry lobby group Confederation of Zimbabwe Industries (CZI) has said. Zimbabwe is battling to maintain sustainable inflation rates with a series of measures being implemented time and again to achieve the goal. Last year, the Reserve Bank</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/double-digit-us-inflation-figure-a-cause-for-concern-industry-says/\">Double-digit US$ inflation figure a cause for concern- Industry says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:24",
            "date": "11 Feb 2025"
        },
        {
            "title": "After ignoring council regulations in property renovations, Mafume’s Belvedere hostel now faces demolition",
            "url": "https://www.newzimbabwe.com/after-ignoring-council-regulations-in-property-renovations-mafumes-belvedere-hostel-now-faces-demolition/",
            "content": "By Staff Reporter\n\nHaving presided over the City of Harares demolition of homes in Belvedere last year, insisting they bypassed due process, Harare Mayor Jacob Mafume is about to find the boot on the other foot.\n\nA City of Harare inspector, David Wadarwa, Monday told the Commission of Inquiry, led by retired Judge Justice Maphios Cheda, that he will recommend the demolition  of unauthorised renovations to Mafumes own Belvedere property. It could be a classic case of hoist by his own petard.\n\nMafume, it seems, has transformed his residential pad into a hostel, a commercial venture that blatantly ignores council rules. He has admitted the foul play  neglecting to apply for a change of use permit.\n\nDuring his commission testimony, Wadarwa appeared like a rabbit caught in the headlights, completely floundering when quizzed about his inspection of Mafumes property.\n\nThe commission grilled Wadarwa relentlessly, demanding an explanation for how he greenlighted the inspection on a building that did not match the plans.\n\nWhy were you signing for developments which are not in accordance with the plan? lead evidence Tapiwa Fresh Godzi pressed.\n\nWadarwa replied, To me, its normal that I sign and then recommend that changes are made.\n\nWhen pushed further, he stammered, It was an error on my part, Sir. An error repeated six times, apparently, each one carefully signed off on  queried Justice Cheda.\n\nWadarwa claims he was pressured by his boss and dashed through the process, forging dates as he signed off on all six approvals in a single day. The commission then inquired about Wadarwas remedy to his mistakes.\n\nI will advise the owner of the property to demolish the alterations made to his property and revert to the original approved plan. I will write a letter to my seniors informing them about this, he said.\n\nMafume, despite admitting to bending the rules, is clinging to the hope of regularisation  relying on a loophole in the by-laws.\n\nBut City of Harare Urban Planning Acting Director Samuel Nyabeza said it is not possible. He branded the inspection signatures on Mafumes property plan as highly suspicious, noting the impossibility of such frequent inspections.\n\nNyabeza also insisted that Mafume must rectify his error by returning the property to its original residential status.\n\nMafume is understood to have jetted out of the country but will be back next week to face the commission.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/05173756/mafume-and-home.png",
            "description": "<p>By Staff Reporter Having presided over the City of Harare’s demolition of homes in Belvedere last year, insisting they bypassed due process, Harare Mayor Jacob Mafume is about to find the boot on the other foot. A City of Harare inspector, David Wadarwa, Monday told the Commission of Inquiry, led by retired Judge Justice Maphios</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/after-ignoring-council-regulations-in-property-renovations-mafumes-belvedere-hostel-now-faces-demolition/\">After ignoring council regulations in property renovations, Mafume’s Belvedere hostel now faces demolition</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:24",
            "date": "11 Feb 2025"
        },
        {
            "title": "Harare losing US$10 million a year due to opaque billing system – says Mayor Mafume, last council audit done six years ago",
            "url": "https://www.newzimbabwe.com/harare-losing-us10-million-a-year-due-to-opaque-billing-system-says-mayor-mafume-last-council-audit-done-six-years-ago/",
            "content": "By Darlington Gatsi\n\nHARARE Mayor Jacob Mafume has shockingly revealed that the City Council is losing more than US$10 million due to leakages, exacerbated by the lack of a functional Enterprise Resource Planning (ERP) system, depriving the municipality of much-needed revenue.\n\nMafume made these revelations at the ongoing Commission of Inquiry, which is investigating the operations of Harare City Council since 2017.\n\nIn recent years, Harare City Council has been operating using an opaque billing system, which has created opportunities for corruption and embezzlement by senior officials.\n\nThe Auditor General has repeatedly flagged the financial mismanagement at Harare City Council, with more than US$200 million unaccounted for, raising suspicions of corruption within the municipality.\n\nHowever, Mafume suggested that the amount identified by the Auditor General might be lower than the actual losses incurred by the council.\n\nI am unable to provide exact figures because management has ensured that no audits have been conducted at the Council from 2019 to date. However, we have anecdotal evidence. Millions are paid out, duplicate payments are made, and some ratepayers fees are waived.\n\nWe could be looking at losses of around US$10 million per year. The City Council has been haemorrhaging funds, said Mafume.\n\nFollowing the withdrawal of Quill Associates, which had been supplying the City Council with a billing system, the municipality implemented SAGE, a system riddled with inefficiencies.\n\nThis has resulted in the City Council being unable to account for a significant amount of money, which Parliament in 2022 suggested could amount to billions.\n\nHarare City Council has failed to audit its accounts for over five years, raising serious concerns about corporate governance at the Town House.\n\nAccording to Mafume, top officials at the City Council have formed a corruption cartel, profiting from the chaos.\n\nLast year Mafume revealed that as a result of the lack of ERP, more than 100,000 households are not in the system of the Council, shortchanging the local government.\n\nMafume also claimed that the Harare City Council Executive has been obstructing his efforts to implement a functional ERP system.\n\nI have tried everything to get an ERP system installed at the Council. I end up being accused of interference, but I have done everything humanly possible to get an ERP in place. We cannot function without an ERP.\n\nThis is a deliberate act by our procurement department and management. They do not want an ERP system implemented, said Mafume\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/06142935/mafume-mayor.jpg",
            "description": "<p>By Darlington Gatsi HARARE Mayor Jacob Mafume has shockingly revealed that the City Council is losing more than US$10 million due to leakages, exacerbated by the lack of a functional Enterprise Resource Planning (ERP) system, depriving the municipality of much-needed revenue. Mafume made these revelations at the ongoing Commission of Inquiry, which is investigating the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-losing-us10-million-a-year-due-to-opaque-billing-system-says-mayor-mafume-last-council-audit-done-six-years-ago/\">Harare losing US$10 million a year due to opaque billing system – says Mayor Mafume, last council audit done six years ago</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:24",
            "date": "11 Feb 2025"
        },
        {
            "title": "Zimbabwe mandates companies to report in local currency amid forex struggle",
            "url": "https://www.newzimbabwe.com/zimbabwe-mandates-companies-to-report-in-local-currency-amid-forex-struggle/",
            "content": "IOL\n\nZimbabwes central bank has issued a new directive for listed companies to report their financial results in the countrys struggling local currency, and also reduced the portion of proceeds that exporters retain in foreign currency.\n\nStretched for foreign exchange resources and struggling to entrench usage of the Zimbabwe Gold (ZiG) local unit of exchange, the administration of President Emerson Mnangagwa has been scrambling for ways to contain company closures, de-stocking by retailers and decimation of the formal economy.\n\nThis has resulted in new monetary measures announced by the Reserve Bank of Zimbabwe governor, John Mushayavanhu, including a requirement that companies listed on the Zimbabwe Stock Exchange report their financials in the ZiG currency.\n\nWith the economy highly dollarised, most Zimbabwe listed companies had started to report their financials in US dollars, mirroring the currency of transactions processed by their businesses.\n\nGiven the need to ensure comparability of financial statements, the Reserve Bank, following consultations with the Public Accountants and Auditors Board (PAAB), requires that all entities adopt a common presentation currency, ZiG, for reporting purposes, with immediate effect, including for the 2024 audited financial statements, Mushavanhu said last week.\n\nAlthough listed companies such as Delta Corporation have noted that more than 70% of transactions were in US dollars, Mushayavanhu said the requirement to report financials in local currency was consistent with the increase in the number and value of transactions settled in ZiG.\n\nZimbabwe introduced the ZiG currency in April last year.\n\nApart from this, the Zimbabwean central bank has reduced the portion of earnings that exporters can retain in foreign currency. Zimbabwean exporters and other businesses argue that all their inputs and working capital is in US dollars.\n\nThe Horticultural Development Council said lowering of the forex retention threshold from 70% to 75% presents significant challenges for the horticulture sector that relies heavily on foreign currency earnings to sustain production.\n\nUnder the forex retention policy, exporters in Zimbabwe get 75% of their earnings in foreign currency while 25% is paid out in the local currency equivalent at the official exchange rate that often trails the thriving parallel exchange rate.\n\nThe horticulture industry operates within tight cost margins, with most inputssuch as power, fuel, seed, fertilisers, packaging, and freightdenominated in US dollars, said Linda Nielsen, CEO of HDC.\n\nThe reduction in forex retention means exporters will have less hard currency to meet these critical expenses, placing strain on cash flow and investment in the sector.\n\nZimbabwean retailers have been among the most affected by the countrys currency uncertainty, with many wholesale and retail companies folding up, rationalising operations and destocking.\n\nThe Confederation of Zimbabwe Retailers said over the weekend that the reduction of the foreign currency retention threshold posed challenges for the retail and wholesale sector in terms of supply chain stability and pricing.\n\nExporters, who also supply goods to local formal retailers and wholesalers, rely heavily on foreign currency for key inputs in their various fields, said Denford Mutashu, head of the Zimbabwe retailers grouping.\n\nWith reduced forex retention, these exporters may struggle to meet their USD-denominated expenses, leading to higher production costs and possibly further dollarising supply chains.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/13154056/Harare-Car-Supermarkets.png",
            "description": "<p>IOL Zimbabwe’s central bank has issued a new directive for listed companies to report their financial results in the country’s struggling local currency, and also reduced the portion of proceeds that exporters retain in foreign currency. Stretched for foreign exchange resources and struggling to entrench usage of the Zimbabwe Gold (ZiG) local unit of exchange,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-mandates-companies-to-report-in-local-currency-amid-forex-struggle/\">Zimbabwe mandates companies to report in local currency amid forex struggle</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:24",
            "date": "11 Feb 2025"
        },
        {
            "title": "I am happily married and seek no companionship from Mahere – Chirambwe responds to sexual harassment claims",
            "url": "https://www.newzimbabwe.com/i-am-happily-married-and-seek-no-companionship-from-mahere-chirambwe-responds-to-sexual-harassment-claims/",
            "content": "By Leopold Munhende\n\nLEGAL practitioner Joshua Chirambwe has dismissed sexual harassment allegations raised against him by colleague Fadzayi Mahere, saying he is happily married and does not desire any companionship with the former legislator.\n\nMahere last week wrote to the Law Society of Zimbabwe (LSZ) complaining about lustful messages posted by Chirambwe in a WhatsApp group they are both in called Zim Advocates.\n\nYou see, there is this woman I adore beyond words-let us say I am rather fond of Fadzi, read the first message highlighted by Mahere in her letter.\n\nThe second read: There is another lady in this group, whose elegance could give royalty a run for their money. Her character? Sweet enough to make sugar but how can I approach them?\n\nMahere sought Chirambwes response to the allegations.\n\nIn a four-page response, however, Chirambwe ripped into Mahere and questioned why she had not first raised her concerns personally as the two share a building, parking lot and lift.\n\nPerplexing, farcical and absurdity were words used to describe her actions which Chirambwe also claimed wasted the LSZs time.\n\nI am blissfully united in matrimony with my dearest Mukudzei, a woman of remarkable accomplishments and graceshe exemplifies excellence in her professional endeavors, reads Chirambwes response.\n\nBeyond her corporate achievements, she is a dedicated legal practitioner who, by choice, has embraced the role of nurturing our two cherished children, Beyonce and Chloe. In light of my union with my beloved wife, Mukudzei, I perceive no cause to seek companionship of another woman.\n\nLike Viola in Twelfth Night, Act 1, scene 5; but, verily, I possess no desire nor affection for Fadzai Mahere, forsooth, mine heart is pledged unto my fair wife, with whom I share a bounty of love and devotion even in the wake of this complaint, as a man bound by marriages sacred vow.\n\nWe are both occupants of distinguished spaces within the esteemed Tanganyika Houseour professional proximity is further underscored by our mutual utilisation of the same parking facilities, wherein our vehicles are often stationed adjacent to one another, and our frequent and amicable interactions in the lift, where salutations are customarily exchanged.\n\nGiven this proximity, one might reasonably surmise that had Mahere harboured any concerns, she would have availed herself of the professional courtesy of addressing them directly with me prior to taking recourse with the regulatory body which has more important issues to deal with.\n\nA self-styled prophet aptly named Prophet Advocate, Chirambwe said he could not be expected to explain a dream he never had nor respond to a ghost story without verifying its existence.\n\nAdded the letter: I have never, under any circumstances or in any WhatsApp exchange anywhere in this world, made any reference to Fadzai Mahere.\n\nBefore one responds to a ghost story, they must verify if the ghost even exists. I cannot be expected to explain a dream that I never had, hence a causal link must be established.\n\nMahere is arguably one of the most well-known women in Zimbabwean politics having spoken on behalf of what was at one point the countrys biggest opposition political party, the Citizens Coalition for Change (CCC).\n\nShe has also spoken on various international fora on the Zimbabwean situation.\n\nShe is a former Member of Parliament (MP) who stepped down from her Mt. Pleasant seat after the capture of CCC by self-proclaimed Secretary General Sengezo Tshabangu.\n\nI am a paragon of unwavering resolve, a man of riches and unbounded courage, unshaken by the presence of any individual, whether they be living or the departed, such that had I harboured any intention to proffer my affections towards her, I would have approached her directly unencumbered by any apprehension, given our approximate parking arrangements and frequent cordial exchanges in the lift.\n\nEven in this instance, such an overture cannot, in and of itself, constitute sexual harassment. As a legal practitioner, she is well aware that any expression of interest by a man is inherently subject to her discretion to either say [1] YES, or [2] NO, continued the heavily verbose letter.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/28044431/Fadzai-Mahere-1.png",
            "description": "<p>By Leopold Munhende LEGAL practitioner Joshua Chirambwe has dismissed sexual harassment allegations raised against him by colleague Fadzayi Mahere, saying he is happily married and does not desire any ‘companionship’ with the former legislator. Mahere last week wrote to the Law Society of Zimbabwe (LSZ) complaining about ‘lustful’ messages posted by Chirambwe in a WhatsApp</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/i-am-happily-married-and-seek-no-companionship-from-mahere-chirambwe-responds-to-sexual-harassment-claims/\">I am happily married and seek no companionship from Mahere – Chirambwe responds to sexual harassment claims</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:24",
            "date": "11 Feb 2025"
        }
    ]
}