{
    "news": [
        {
            "title": "Media lobby groups demand release of detained Zimbabwe Independent editor, condemn attack on press freedom",
            "url": "https://www.newzimbabwe.com/media-lobby-groups-demand-release-of-detained-zimbabwe-independent-editor-condemn-attack-on-press-freedom/",
            "content": "By Thandiwe Garusa\n\nWOMEN journalists rights advocacy group Gender and Media Connect (GMC) has called on authorities to release jailed news editor Faith Zaba.\n\nZaba, who is an editor at the privately owned weekly newspaper Zimbabwe Independent, was arrested on Tuesday on charges of undermining the authority of the President.\n\nThe charges stem from a satirical article published by her newspaper last week, which questioned Zimbabwes leadership role within the Southern African Development Community (SADC).\n\nShe appeared at the Harare Magistrates court on Wednesday, where she was remanded in custody after her bail application was postponed to Thursday.\n\nGMC National Director Patience Zirima said Zabas arrest sends a chilling message to journalists, especially women and threatens press freedom and gender equality in media leadership.\n\nGMC calls for the immediate and unconditional release of Faith Zaba.\n\nHer arrest is particularly significant given her status as one of the few women editors in the country.\n\nWomen journalists already face unique challenges and risks in their professional work, and the targeting of a prominent female editor for exercising her professional duties represents a serious setback for womens rights and media freedom, Zirima said.\n\nThe GMC also called for all charges against Zaba to be dropped and urged the government of Zimbabwe and its agencies to commit to respecting constitutional rights to freedom of expression and freedom of the media.\n\nMeanwhile, Media Alliance of Zimbabwe National Coordinator Nigel Nyamutumbu also expressed disappointment at the ongoing disregard for media freedom, warning of a shrinking democratic space.\n\nThis represents a shrinking democratic space. It reflects how press freedom is increasingly being disrespected, which is deeply concerning.\n\nEven with the repeal of repressive legislation, journalists continue to be arrested and their safety compromised.\n\nInstead of making progress, we are taking steps backwards in respecting free expression and democracy in Zimbabwe.\n\nPress freedom is under attack, and we need as much solidarity as possible, Nyamutumbu said.\n\nZabas arrest comes soon after another journalist from Alpha Media Holdings, Blessed Mhlanga, was arrested and spent three months in pre-trial detention for interviewing a war veteran, Blessed Geza, who had called for President Emmerson Mnangagwas immediate ouster.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/02115828/ZABA-FAITH.png",
            "description": "<p>By Thandiwe Garusa WOMEN journalists’ rights advocacy group Gender and Media Connect (GMC) has called on authorities to release jailed news editor Faith Zaba. Zaba, who is an editor at the privately owned weekly newspaper Zimbabwe Independent, was arrested on Tuesday on charges of undermining the authority of the President. The charges stem from a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/media-lobby-groups-demand-release-of-detained-zimbabwe-independent-editor-condemn-attack-on-press-freedom/\">Media lobby groups demand release of detained Zimbabwe Independent editor, condemn attack on press freedom</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:48",
            "date": "03 Jul 2025"
        },
        {
            "title": "CNRG raps Chinese miner over grave rights abuses",
            "url": "https://www.newzimbabwe.com/cnrg-raps-chinese-miner-over-grave-rights-abuses/",
            "content": "By Alois Vinga\n\nTHE Centre for Natural Resource Governance (CNRG) is pleading with the government to urgently rein in the operations of a Magunje-based Chinese miner over a web of human rightsviolations.\n\nThe CSO alleged that China-based West International Holdings, in partnership with Labenmon Investments, following documented human rights abuses, forced displacements, and environmental destruction linked to the Magunje cement and mining projects, has presided over gross human rights abuses.\n\nCNRG said the two companies are jointly investing US$1 billion to construct a cement plant in Magunje, Mashonaland West, with a production capacity of 900,000 tons of cement per year, and 1.8 million tons of clinker, supported by a 100MW captive power plant. The investment is also expected to generate 5,000 jobs.\n\nHowever, the promise of economic opportunity is being undermined by allegations of land grabs, community exclusion, and rights violations in the host area.\n\nFollowing growing distress calls from the community, CNRG visited the area and documented overwhelming evidence of land dispossession, intimidation, pollution, and labour exploitation in the name of clean energy and development, said CNRG.\n\nPart of the findings wasthat families were uprooted from their ancestral land without compensation after the companies took advantage of fraudulent consultation exercises.\n\nThe organisation reported that eight villagers from Kapere, including the Headman, were arrested for protecting their land and have been repeatedly appearing in Karoi Magistrate Court, despite the absence of the complainants.\n\nCNRG staff were also threatened by armed Zimbabwe National Army personnel at a mining site in Kemapondo village.\n\nMagunje Dam, a vital source of water for thousands of residents, is allegedly being polluted by effluent discharge from the cement plant, leading to the destruction of farmlands and gardens following fires ignited by the company during a land-clearing exercise.\n\nThe mining rights-based organisation said workers employed by the companies are operating under unsafe conditions, political discrimination, lack of contracts and low wages that are pegged below the National Employment Council (NEC) agreed rates.\n\nWe demand that the Ministry of Mines and Mining Development: Halts illegal operations and ensure accountability, protect community rights and interests, stop all threats against communities and ensure inclusive decision making, CNRG added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/26175829/Farai-Maguwu.jpg",
            "description": "<p>By Alois Vinga THE Centre for Natural Resource Governance (CNRG) is pleading with the government to urgently rein in the operations of a Magunje-based Chinese miner over a web of human rights violations. The CSO alleged that China-based West International Holdings, in partnership with Labenmon Investments, following documented human rights abuses, forced displacements, and environmental destruction</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cnrg-raps-chinese-miner-over-grave-rights-abuses/\">CNRG raps Chinese miner over grave rights abuses</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:48",
            "date": "03 Jul 2025"
        },
        {
            "title": "How Zimbabwe’s richest man Strive Masiyiwa’s and Nvidia’s first ‘AI Factory’ in Africa will roll out",
            "url": "https://www.newzimbabwe.com/how-zimbabwes-richest-man-strive-masiyiwas-and-nvidias-first-ai-factory-in-africa-will-roll-out/",
            "content": "Forbes Africa\n\nAfrica is set to have its own first artificial intelligence (AI) factory, spearheaded by telecoms billionaire Strive Masiyiwas firm, Cassava Technologies, and American tech giant Nvidia, and as per reports, this month sees the deployment of the graphics processing units (GPUs) in South Africa as the first recipient.\n\nNvidia is led by Jensen Huangthe tenth-richest person in the world whose net worth is $137.4 billion, according toForbes live tracker.\n\nLimited access to modern tools has hindered Africas AI development, a fact that Masiyiwas AI factory aims to address. Collaborating with Nvidia gives us the advanced computing capabilities needed to drive Africas AI innovation while strengthening the continents digital independence, Masiyiwa stated in a press release.\n\nNvidia will reportedly implement thousands of GPUs, which power its high-performance supercomputers, and intertwine its AI software using NVIDIA Cloud Partner reference architectures.\n\nCassava president Hardy Pemhiwa revealed that 3,000 Nvidia GPUs would be embedded into their South African facility in June before installing 9,000 more across Kenya, Nigeria, Morocco, and Egypt over the next three to four years. Masiyiwa,Bloombergreports, is prepared to invest up to $720 million in the project.\n\nThe future comes from young people building apps and solutions, small businesses every day across this continent using AI, Masiyiwa said at the Global AI Summit on Africa 2025 in Kigali in April where he was a co-chair. They are the digital natives, and we just have given them the ability to do what they do best.\n\nAfrica has the unprecedented opportunity of becoming a global tech leader, boasting ample resources, worldwide investment, and the biggest (and youngest) untapped market in the world.\n\nAround 600 million Africans still lack reliable access to electricity, a figure that experts believe will subside thanks to the continents push for renewable energy and growing access to mobile internet services, such as Starlink.\n\nFintechs and AI startups are abundant from Nairobi to Accra, but the continents limited tech infrastructure and low digital literacy rates continue to squeeze its known potential of leading the AI revolution.\n\nThe Future of Jobs Report 2025by the World Economic Forum identified a critical skills gap in Africa, with over 60% of companies believing it to be one of the most significant barriers to business transfer formation by 2030.\n\nNew, cutting-edge technology now beckons for the continent; Nvidia-powered AI factories are set to seemingly streamline AI development through an optimized ecosystem supporting algorithm development, model experimentation, and data pipelines.\n\nAkin to a startup incubator, but on a mass, online scale, the proposed AI factory is designed to foster innovation and accelerate African AI development by connecting local businesses, governments, and researchers to high-performance AI infrastructure while alleviating them from the financial burdensome Nvidia-built GPUs cost thousands of dollarsof investing in hardware.\n\nBuilding digital infrastructure for the AI economy is a priority if Africa is to take full advantage of the fourth industrial revolution, added Masiyiwa in the press statement.\n\nOur AI Factory provides the infrastructure for this innovation to scale, empowering African businesses, startups, and researchers with access to cutting-edge AI infrastructure to turn their bold ideas into real-world breakthroughsand now, they dont have to look beyond Africa to get it.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/07/22062820/Strive-Masiyiwa.jpg",
            "description": "<p>Forbes Africa Africa is set to have its own first artificial intelligence (AI) factory, spearheaded by telecoms billionaire Strive Masiyiwa’s firm, Cassava Technologies, and American tech giant Nvidia, and as per reports, this month sees the deployment of the graphics processing units (GPUs) in South Africa as the first recipient. Nvidia is led by Jensen</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/how-zimbabwes-richest-man-strive-masiyiwas-and-nvidias-first-ai-factory-in-africa-will-roll-out/\">How Zimbabwe’s richest man Strive Masiyiwa’s and Nvidia’s first ‘AI Factory’ in Africa will roll out</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:48",
            "date": "03 Jul 2025"
        },
        {
            "title": "Over 9,000 illegal transport operators arrested in six months",
            "url": "https://www.newzimbabwe.com/over-9000-illegal-transport-operators-arrested-in-six-months/",
            "content": "By Anna Chibamu\n\nOVER 9000 illegal transport operators, popularly known as mushika-shika, have been arrested and fined since the beginning of the year, a government official has reported.\n\nHome Affairs Permanent Secretary Ambassador Tayerera Faranisi told a Transport Parliamentary Portfolio committee last week that since January this year, 9,289 mushika-shika operators were arrested and fined.\n\nThere is an ongoing operation targeting mushika-shika operators.\n\nAs of the latest update, 9,289 mushika-shika operators have been nabbed and fined since January 01, 2025, Faranisi said.\n\nResponding to questions relating to the chaos being caused by these illegal transport operators and finding solutions to end road carnage, Committee members touched on challenges resulting from the mushika-shika presence on the countrys roads.\n\nPolice Deputy Commissioner General (DCG) Operations Leny Ncube accused the public vehicle operators of being corrupt.\n\nThere is the issue where it appears people are now budgeting to deal with our police officers.\n\nWithout trying to defend our members, we have better police officers. We also have corrupt members of the community.\n\nWe cannot run away from that as the bus crew people are making money from the bus operators using the system to pay the police, Ncube told this committee.\n\nIt is just a corrupt system. Unless you are talking of a vehicle owner who is coming forth and saying, I was a victim of this, corruption is all over.\n\nEveryone is surviving through this corruption. Bus crews, you name them, they are surviving through the money. They report they were paid police officers.\n\nNcube explained that there was a need for the whole country to vigorously campaign against corruption.\n\nCorruption is running in our nerves because police cannot corrupt themselves alone. Someone is giving them money.\n\nSomeone is enticing them because the person doesnt want to pay the necessary dues to the government. Maybe you define it as $20, but the person is not willing to pay that $20. And its enticing the police officer to pay $30.\n\nSo its corruption across the world. We cannot run away from that because we are guilty of charging our members sometimes.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/04193446/Mushikashika.png",
            "description": "<p>By Anna Chibamu OVER 9000 illegal transport operators, popularly known as “mushika-shika”, have been arrested and fined since the beginning of the year, a government official has reported. Home Affairs Permanent Secretary Ambassador Tayerera Faranisi told a Transport Parliamentary Portfolio committee last week that since January this year, 9,289 mushika-shika operators were arrested and fined.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/over-9000-illegal-transport-operators-arrested-in-six-months/\">Over 9,000 illegal transport operators arrested in six months</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:48",
            "date": "03 Jul 2025"
        },
        {
            "title": "Can Trump strip Musk and Mamdani of their US citizenship?",
            "url": "https://www.newzimbabwe.com/can-trump-strip-musk-and-mamdani-of-their-us-citizenship/",
            "content": "Al Jazeera\n\nUS President Donald Trump and officials from his administration have hinted that they might consider revoking the US citizenship ofZohran Mamdani, New York Citys Democratic mayoral candidate.\n\nSeparately, Trump said former aideElon Muskwould have to close up shop and head back home to South Africa amid a row over histax breaks and Trumps narrowly passed spending bill.\n\nBut would the Trump administration have the power to revoke the citizenship of Mamdani and Musk, both foreign-born, naturalised citizens of the US?\n\nMamdani, 33, was born in the Ugandan capital, Kampala, to ethnically Indian parents. He moved to New York at the age of seven and became a naturalised US citizen in 2018.\n\nMusk was born in 1971 in Pretoria, South Africa to a Canadian mother and South African father. At the age of 17, he moved to Canada of where he is also a citizen. In 1992, he moved to the US to study at the University of Pennsylvania. He became a naturalised US citizen in 2002, according to a biography of him written in 2023 by journalist Walter Isaacson.\n\nIn October 2024, the Washington Post reported that Musk began his career in the US without the proper work authorisation, but Musk has denied this. I was in fact allowed to work in the US, Musk wrote in an X post on the same day the report was published. I was on a J-1 visa that transitioned to an H1-B, Musk wrote in another post. A J-1 visa is a temporary visa for foreign students, while an H-1B is a temporary work visa.\n\nTo become naturalised as a US citizen, an individual needs to be above the age of 18 and to have lived continuously in the US as a green card holder for five years, or three years if they are married to a US citizen.\n\nAndy Ogles, a Republican Tennessee representative, wrote to Attorney General Pam Bondi on June 26, asking for the Department of Justice to probe whether Mamdani, who identifies as ademocratic socialist, should be subject to denaturalisation proceedings.\n\nPosting a copy of the letter to Bondi on his X page, Ogles wrote: Zohran little muhammad Mamdani is an antisemitic, socialist, communist who will destroy the great City of New York. He needs to be DEPORTED. Which is why I am calling for him to be subject to denaturalization proceedings.\n\nOgles said that the investigation should be conducted on the grounds that Mamdani may have procured US citizenship through willful misrepresentation or concealment of material support for terrorism.\n\nThe Tennessee Republican cited reports, including an article published in the New York Post, stating that Mamdani expressed solidarity with individuals convicted of terrorism-related offenses prior to becoming a US citizen. Ogles said that Mamdani rapped Free the Holy Land Five / My guys.\n\nThe Holy Land Foundation was convicted in 2008 for providing material support to Hamas, a designated foreign terrorist organization. Publicly praising the Foundations convicted leadership as my guys raises serious concerns about whether Mr. Mamdani held affiliations or sympathies he failed to disclose during the naturalization process, Ogles wrote in his letter to Bondi.\n\nMoreover, Mr. Mamdani has recently refused opportunities to reject the pro-terrorist rallying cry to globalize the intifada a call to expand violent attacks on civilians to the United States and around the world, Ogles wrote.\n\nMamdani has also pledged to stop masked Immigration and Customs Enforcement (ICE) agents from deporting our neighbours. When Trump was asked about this on Tuesday at a news conference, he said that if Mamdani prevents ICE agents from conducting deportation operations, Well, then, well have to arrest him.\n\nWe dont need a communist in this country, but if we have one, Im going to be watching over him very carefully on behalf of the nation, Trump said, adding, well send him money, well send him all the things he needs to run the government.\n\nTrump continued, citing claims that Mamdani is in the US illegally, saying, Were going to look at everything. The president also voiced support for the current New York mayor, Eric Adams, who is also a member of the Democratic Party.\n\nMamdani posted a statement on his X account in response to Trumps comments on Tuesday.\n\nThe President of the United States just threatened to have me arrested, stripped of my citizenship, put in a detention camp and deported. Not because I have broken any law but because I will refuse to let ICE terrorize our city, Mamdani wrote in his statement.\n\nMamdani also called Trumps praise of Adams unsurprising, adding: At the very moment when MAGA Republicans are attempting to destroy the social safety net, kick millions of New Yorkers off of healthcare and enrich their billionaire donors at the expense of working families, it is a scandal that Eric Adams echoes this Presidents division, distraction and hate. Voters will resoundingly reject it in November.\n\nWhile the billionaire owner of Tesla and SpaceX was once a key aide to Trump and a major donor to his presidential campaign last year, Trumps Big Beautiful Bill has created a public rift between Trump and Musk.\n\nMusk has repeatedly decried the bill online and has threatened to forma new political partyas a response to the bill passing.\n\nMusk stands to be affected by the finance bill that the Senate narrowly passed on Tuesday, as it ends tax credits worth up to $7,500 for purchases of electric vehicles (EVs) from September 30. This could significantly reduce consumer demand for EVs in the US.\n\nIn a Truth Social post on Monday, Trump wrote, Without subsidies, Elon would probably have to close up shop and head back home to South Africa. No more Rocket launches, Satellites, or Electric Car Production, and our Country would save a FORTUNE.\n\nPerhaps we should have DOGE take a good, hard, look at this? BIG MONEY TO BE SAVED!!! Trump added, in reference to theDepartment of Government Efficiency, an advisory body aimed at boosting government efficiency and upgrading information technology, that Musk formed and led at the start of Trumps second administration, before leaving on May 30.\n\nOn Tuesday, when reporters asked Trump if he was going to deport Musk, he said, Well have to take a look. We might have to put DOGE on Elon.\n\nUnder certain circumstances, US citizens by naturalisation can lose their status as citizens. This process is also called denaturalisation.\n\nThis can happen if naturalised citizens commit certain crimes, including terrorism, war crimes, human rights violations, sex crimes or naturalisation fraud, meaning they obtained their citizenship through fraud, misrepresentation or illegal procurement.\n\nOn June 11, the Justice Department issued a memo stating that it would prioritise denaturalisation by instituting civil proceedings for people if they either illegally procured naturalization or procured naturalization by concealment of a material fact or by willful misrepresentation.\n\nThe memo added: The Civil Division shall prioritize and maximally pursue denaturalization proceedings in all cases permitted by law and supported by the evidence.\n\nA naturalised citizen can also lose their citizenship if they commit an act of treason against the US, or run for public office or join the military of a foreign country.\n\nMost recently, the Justice Department announced on June 13 that UK citizen Elliott Duke, a convicted collector and distributor of child sexual abuse material, had been denaturalised. In a news release, the Justice Department said Duke enlisted in the US Army in 2012 and began receiving and sending child sex abuse material online while serving in Germany. Duke did not list this crime in his naturalisation application in 2013. He was convicted of receipt and possession of child pornography in 2014.\n\nIt is not likely, according to experts.\n\nDenaturalisation is limited to cases where the government can prove material fraud in their original applications, said Michael Kagan, professor of law at University of Nevada, Las Vegas.\n\nIt is rare and unlikely for either Musk or Mamdani. This appears to be irresponsible rhetoric designed to intimidate political opponents.\n\nThe US has revoked the citizenship of naturalised citizens on different occasions over the past few decades.\n\nCases of denaturalisation were more frequent during the first half of the 20th century while the two world wars and, later, the Cold War with the Soviet Union were ongoing. Between 1926 and the mid-1940s, hundreds of people were denaturalised every year, according to political scientist Patrick Weil, author of The Sovereign Citizen, published in 2017.\n\nThe US government frequently tried to denaturalise citizens during the two Red Scare periods of 1917 to 1920 and 1947 to 1957, when the fear of communism was particularly high in the US. During this time, it was also very hard to obtain US citizenship by naturalisation.\n\nPeople who were denaturalised at the time included communists and Nazi sympathisers. Two famous cases were:\n\nIn 1967, the trend for denaturalisation slowed down when the US Supreme Court ruled that a US citizen could not be involuntarily deprived of their citizenship unless they met the specific criteria of having obtained naturalisation by fraud or of having committed serious offences.\n\nThe ruling came at the end of a case involving Beys Afroyim, who was born in Poland and became a naturalised US citizen in 1926. The US government tried to revoke his citizenship because Afroyim had voted in an Israeli legislative election in 1951.\n\nIn ruling this, the Supreme Court repealed a US federal law which said that US citizens could lose their citizenship if they vote in a foreign election.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/05210734/musk-trump.webp",
            "description": "<p>Al Jazeera US President Donald Trump and officials from his administration have hinted that they might consider revoking the US citizenship of Zohran Mamdani, New York City’s Democratic mayoral candidate. Separately, Trump said former aide Elon Musk would have to “close up shop and head back home to South Africa” amid a row over his tax breaks and Trump’s</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/can-trump-strip-musk-and-mamdani-of-their-us-citizenship/\">Can Trump strip Musk and Mamdani of their US citizenship?</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:48",
            "date": "03 Jul 2025"
        },
        {
            "title": "A ploy to push me out – Kwekwe United president dismisses claims he has stepped down",
            "url": "https://www.newzimbabwe.com/a-ploy-to-push-me-out-kwekwe-united-president-dismisses-claims-he-has-stepped-down/",
            "content": "By Sports reporter\n\nKwekwe United club president Phil Makekera has dismissed claims that he has stepped down and is selling the cash-strapped Castle Lager Premier Soccer League franchise.\n\nMakekera said the rumour is simply a ploy topush him out oftheclub.\n\nI will not just walk away from my project unless someone buys me out.\n\nI am selling shares in the team, and I remain as of today 100% shareholder, and I know there are people who want to force me out, he told NewZimbabwe.com.\n\nReports were that the Kwekwe United boss had onWednesday morning notified membersofthe clubs executive group that he was stepping down as president so as to create time for his family.\n\nSince promotion from the Central Region Division One League, Kwekwe United has been facing financial challenges which have seen players protesting for outstanding signing-on fees and salaries.\n\nIn April, the club failed to fulfil a home match against Herentals after the players did not show up in protest over unpaid salaries.\n\nKwekwe United is facing possible relegation as they are sitting bottom of the log with only 8 points from 18 games.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/02171854/Phil-Makekera-e1751473150113.webp",
            "description": "<p>By Sports reporter Kwekwe United club president Phil Makekera has dismissed claims that he has stepped down and is selling the cash-strapped Castle Lager Premier Soccer League franchise. Makekera said the rumour is simply a ploy to push him out of the club. “I will not just walk away from my project unless someone buys me out. “I</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/a-ploy-to-push-me-out-kwekwe-united-president-dismisses-claims-he-has-stepped-down/\">A ploy to push me out – Kwekwe United president dismisses claims he has stepped down</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:48",
            "date": "03 Jul 2025"
        },
        {
            "title": "JSC cancels Chitepo Ideology workshop for judges after uproar from lawyers, activists",
            "url": "https://www.newzimbabwe.com/jsc-cancels-chitepo-ideology-workshop-for-judges-after-uproar-from-lawyers-activists/",
            "content": "By Staff Reporter\n\nThe Judicial Service Commission (JSC) has suspended a planned training programme for judges led by Zanu PFs Herbert Chitepo School of Ideology following strong backlash from lawyers and civil society groups, who criticised the move as an attempt to indoctrinate the judiciary.\n\nThe training was being organised by the Presidency and was to feature the principal of Zanu PFs Herbert Chitepo School of Ideology, Ishmael Mada, the CIO director, Fulton Mangwanya, and President Mnangagwas chief secretary, Martin Rushwaya.\n\nIn a memorandum dated 2 July 2025 from the Judiciary Service Commission, Chief Secretary Walter Chikwana announced that the training seminar has been cancelled to allow for the development of content that will ensure the judiciary maintains its independence.\n\nFollowing the initial consultations and continued discussions with OPC on the implementation framework, I wish to inform you that a decision has been taken to cancel the IRBM training with the view of coming up with a programme content administered by the judiciary and suitable to the requirement for Judicial Independence, Chikwana stated.\n\nEarlier, in a statement, the Zimbabwe Catholic Lawyers Guild described the compulsory training of judges on the Chitepo School of Ideology as stripping away the last remaining integrity of the judiciary, after years of it being perceived as a captured institution.\n\nSubjecting judges who must at all times be independent and be seen to be independent to an ideology of one party to the exclusion of others not only compromises the judiciary but attacks its independence and impartiality.\n\nWe note that this is all happening at a time when public confidence in the judiciary is low, given the widely held public perception that the Judiciary is captured by the Executive.\n\nRenowned lawyer Thabani Mpofu has been rallying fellow lawyers and activists to stage a demonstration at the High Court of Zimbabwe tomorrow in protest against the compulsory training of judges.\n\nMpofu on Tuesday posted on his X account, mobilising lawyers and other officers of the court to protest against the erosion of judicial independence, stating that even if Chitepo were alive, he would not have approved the training programme named after him.\n\nAs legal professionals, we must uphold the integrity of the judiciary and ensure its independence. Any attempt to impose partisan ideology on judges through training programmes conducted by the Herbert Chitepo School of Ideology would undermine the rule of law and erode public trust.\n\nI mean, not even Chitepo himself would abase himself to the point of receiving training from this school named after him. We stand in defence of judicial independence, honouring the legacy of those who fought for justice and fairness. In Chitepos name; lets collectively rage against this unnecessary attack on judicial independence, Mpofu said.\n\nThe Chitepo School of Ideology has stirred controversy in the country; last year, there was uproar over Local Government Minister Daniel Garwes invitation to all councillors, including those from the opposition, to attend the workshop in Harare.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/04/05165803/Zimbabwe-judges-wigs.jpg",
            "description": "<p>By Staff Reporter The Judicial Service Commission (JSC) has suspended a planned training programme for judges led by Zanu PF’s Herbert Chitepo School of Ideology following strong backlash from lawyers and civil society groups, who criticised the move as an attempt to indoctrinate the judiciary. The training was being organised by the Presidency and was</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/jsc-cancels-chitepo-ideology-workshop-for-judges-after-uproar-from-lawyers-activists/\">JSC cancels Chitepo Ideology workshop for judges after uproar from lawyers, activists</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:48",
            "date": "03 Jul 2025"
        }
    ]
}