{
    "news": [
        {
            "title": "Another Mzansi Express bus, heading to Zimbabwe, involved in Limpopo fatal crash",
            "url": "https://www.newzimbabwe.com/another-mzansi-express-bus-heading-to-zimbabwe-involved-in-limpopo-fatal-crash/",
            "content": "IOL\n\nSeveral people were injured when a Mzansi Express bus traveling from Gauteng to Zimbabwe was involved in a horrific accident in Musina, in the early hours of Tuesday.\n\nSpokesperson for the Limpopo Department of Transport and Community Safety, Tidimalo Chuene, told IOL that the crash happened at around 2 am on Tuesday morning.\n\nIn the early hours of today, 8 July 2025, at 1:58 am, a serious bus accident occurred on the N1 North in Musina next to Baobab Truck Stop in the Vhembe District. It is reported that a truck lost control and collided with a light delivery vehicle and a bus, said Chuene.\n\nSadly, the driver (of the bus) who is male, was deceased at the scene. Four bus passengers sustained moderate injuries while four other passengers, and one passenger from the light delivery motor vehicle suffered minor injuries.\n\nChuene told IOL that the possible cause of the accident appears to be reckless driving.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/08121738/Screenshot-2025-07-08-at-13.16.41.png",
            "description": "<p>IOL Several people were injured when a Mzansi Express bus traveling from Gauteng to Zimbabwe was involved in a horrific accident in Musina, in the early hours of Tuesday. Spokesperson for the Limpopo Department of Transport and Community Safety, Tidimalo Chuene, told IOL that the crash happened at around 2 am on Tuesday morning. “In</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/another-mzansi-express-bus-heading-to-zimbabwe-involved-in-limpopo-fatal-crash/\">Another Mzansi Express bus, heading to Zimbabwe, involved in Limpopo fatal crash</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:36",
            "date": "08 Jul 2025"
        },
        {
            "title": "Self-proclaimed prophet jailed 12 years for having sexual relations with minors",
            "url": "https://www.newzimbabwe.com/self-proclaimed-prophet-jailed-12-years-for-having-sexual-relations-with-minors/",
            "content": "By Staff Reporter\n\nA 28-year-old Chipinge self-proclaimed prophet has been jailed for 12 years following his conviction for impregnating two minor girls.\n\nThe offender was arraigned before the Chipinge Regional Court, facing two counts of having sexual relations with underage girls.\n\nHe was jailed for six years for each count. Two years were suspended on condition of good behaviour.\n\nHe will serve the remaining 10 years running concurrently.\n\nProsecutorsproved that on an unknown date in October 2024, at Chimiro village, Chipinge, the offender had sexual intercourse with a 13-year-old female juvenile who is a Form One student.\n\nThe victim was advised to visit the prophet for prayers regarding her move to Marondera, and she went to the offenders homestead, where he was alone.\n\nHe invited her to his bedroom where he expressed his romantic interests and they had sexual relations, the court heard.\n\nThe matter came to light on May 26, 2025, when the victims mother noticed that the victim was pregnant.\n\nA police report was made, and a medical examination confirmed that the victim was eight months pregnant.\n\nOn the second count, it was also proved that between February and May 2025, in Chipinge, the offender unlawfully had sexual intercourse with a 15-year-old girl who is a Form Two student, with her consent, knowing she was under 18 years old.\n\nShe later eloped with him and they resided together in May 2025.\n\nThe matter came to light after the victim, in the first count, reported her case to the police.\n\nThe victim was medically examined, confirming that she was four months pregnant.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg",
            "description": "<p>By Staff Reporter A 28-year-old Chipinge self-proclaimed prophet has been jailed for 12 years following his conviction for impregnating two minor girls. The offender was arraigned before the Chipinge Regional Court, facing two counts of having sexual relations with underage girls. He was jailed for six years for each count. Two years were suspended on</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/self-proclaimed-prophet-jailed-12-years-for-having-sexual-relations-with-minors/\">Self-proclaimed prophet jailed 12 years for having sexual relations with minors</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:36",
            "date": "08 Jul 2025"
        },
        {
            "title": "Alcohol and colonialism: the curious story of the Bulawayo beer gardens",
            "url": "https://www.newzimbabwe.com/alcohol-and-colonialism-the-curious-story-of-the-bulawayo-beer-gardens/",
            "content": "The Conversation\n\nKontuthu Ziyathunqa  Smoke Rising  was what they used to callBulawayowhen the city was the industrial powerhouse of Zimbabwe. Now, many of its factories lie dormant or derelict. The daily torrent of workers flowing eastward at dawn, and back out to the high-density western suburbs at dusk, has diminished to a trickle.\n\nBut there is an intriguing industrial-era institution that lives on in most of the older western suburbs (formerly called townships). It is the municipal beer hall or beer garden, built in thecolonial daysfor the racially segregated African worker communities. There are dozens of these halls and garden complexes, still serving customers and emitting muffled sounds of merriment to this day.\n\nLike other urban areas in Rhodesia (colonial Zimbabwe), Bulawayo was informally segregated from its inception, and more formally segregated after the second world war. Under British rule (1893-1965) and then independent white minority rule (1965-1980), municipal drinking amenities were built in the townships to maintain control of African drinking and sociality. At the same time, they raised much-needed revenue for township welfare and recreational services.\n\nI researched the history of these beer halls and gardens as part of my PhD project on the development of the segregated African townships in late colonial Bulawayo. As myhistorical accountshows, they played a key role in the contested township development process.\n\nBulawayos oldest and most famous beer hall, MaKhumalo, also known as Big Bhawa, was built more than a century ago, in 1913. It still stands at the heart of the historicMakokobaneighbourhood. Its enormous, but austere, and in the early days it was oppressively managed. Drinkers would describe feeling like prisoners there.\n\nThe more picturesque beer gardens began to emerge in the 1950s, reflecting the developmental idealism ofHugh Ashton. The Lesotho-born anthropologist was educated at the Universities of Oxford, London and Cape Town, and took up the new directorship of African administration in Bulawayo in 1949.\n\nHe was tuned into new anthropological ideas about social change, as well as developmental ideas spreading through postwar colonial administrations  about stabilising and detribalising African workers to create a more passive and productive urban working class. He saw a reformed municipal beer system as a key tool for achieving these goals.\n\nAshton wanted to make the beer system more legitimate and the venues more community-building. He proposed constructing beer garden complexes with trees, rocks, games facilities, food stalls and events like traditional dancing. So the atmosphere would be convivial and respectable, but also controllable, enticing all classes and boosting profits to fund better social services. As we shall see, this strategy was full of contradictions\n\nMaKhumalo, MaMkhwananzi, MaNdlovu, MaSilela. These beer garden names, emblazoned on the beer dispensaries that stick up above the ramparts of each garden complex,referencedthe role that women traditionally played in beer brewing in southern Africa. This helped authenticate the councils home brew.\n\nBut the reality was that the beer was now produced in a massive industrial brewery managed by a Polish man. It was delivered in trucks and stored in steel tanks at the tops of the dispensary buildings, to be piped down into the plastic mugs of thirsty punters at small bar windows below. (It was also sold in plastic calabashes and cardboard cartons.)\n\nAnd the beer garden bureaucracy, which offered a rare opportunity for African men to attain higher-grade public sector jobs, became increasingly complex and strictly audited.\n\nAs the townships rapidly expanded, with beer gardens dotted about them, sales of the councils traditional beer  the quality of which Ashton and his staff obsessed over  went up and up.\n\nExtensive beer advertising in the councils free magazine mixed symbols of tradition (beer as food) with symbols of modern middle-classness.\n\nThe systems success relied on the Bulawayo council having a monopoly on the sale of so-called native beer. This traditional brew is typically made by malting, mashing, boiling and then fermenting sorghum, millet or maize grains. Racialised Rhodesian liquor laws restricted African access to European beers, wines and spirits (although restrictions eased from the late 1950s).\n\nSo, the beer hall or garden was the only public venue where Africans could legally drink (apart from a tiny elite, for whom a few exclusive cocktail lounges were built). The council cracked down harshly on liquor offences like home brewing.\n\nThis beer monopoly system was quite prevalent in southern and eastern Africa, though rarely at the scale to which it grew in Bulawayo. Nearly everywhere, the system caused resentment among African townspeople, and so it became politically charged.\n\nIn several colonies, beer halls became sites of protest, or were boycotted (mostfamouslyin South Africa). And they usually faced stiff competition from illicit drinking dens known as shebeens.\n\nIn Bulawayo, the more the city council improved its beer system after the second world war, the more contradictory the system became. It actively encouraged mass consumption of traditional beer, so that funds could be raised for modern health, housing and welfare services in the townships. Ashton himself was painfully aware of the contradictions.\n\nIn his guest introduction to a 1974 ethnographicmonographon Bulawayos beer gardens, he wrote:\n\nThe ambivalence of my position is obvious. How can one maintain a healthy community and a healthy profit at one and the same time? I can almost hear the critical reader questioning my morality and even my sanity. And why not? I have often done so myself.\n\nMany citizen groups  both African and European  questioned the system too. They called it illogical, if not immoral; even some government ministers said it had gone too far. And when some beer gardens were constructed close to European residential areas, to cater for African domestic workers, many Europeans reacted with fear and fury.\n\nAs Zimbabweans struggle for independence took off in the 1960s, African residents increasingly associated the beer halls and gardens with state neglect, repression, or pacification. They periodically boycotted or vandalised them. Nevertheless, with few alternative options, attendance rates remained high: MaKhumalo recorded 50,000 visitors on one Sunday in 1970.\n\nAfter Zimbabwe gained independence in 1980, the township beer gardens remained in municipal hands. They continued to be popular, even though racial desegregation had finally given township residents access to other social spaces across the city.\n\nThe colonial-era municipal beers continued to be produced, with Ngwebu (The Royal Brew) becoming a patriotic beverage for theNdebele the citys majority ethnic group.\n\nBut with the deindustrialisation of Bulawayo since the late 1990s, tens of thousands of blue collar workers have moved to greener pastures, mostly South Africa. The old drinking rhythm of the citys workforce has changed, and for the young, the beer gardens hold little allure. Increasingly, they have been leased out to private individuals to run.\n\nNevertheless, there is always a daily trickle of regulars to the beer gardens, where mugs and calabashes are passed around among friends or burial society members. Some punters play darts or pool. And there are always some who sit alone, ruminating  perhaps in the company of ghosts from the past.The beer gardens of Bulawayo embody the moral and practical contradictions of late colonial development  and the ways in which such systems and infrastructures may live on, but change meaning, in the post-colony.\n\nResearch Associate, School of Environment, Education and Development, University of Manchester\n\nThis article is republished fromThe Conversationunder a Creative Commons license.Read the original articlehere.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/08104203/beer-garden.jpeg",
            "description": "<p>The Conversation Kontuthu Ziyathunqa – Smoke Rising – was what they used to call Bulawayo when the city was the industrial powerhouse of Zimbabwe. Now, many of its factories lie dormant or derelict. The daily torrent of workers flowing eastward at dawn, and back out to the high-density western suburbs at dusk, has diminished to a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/alcohol-and-colonialism-the-curious-story-of-the-bulawayo-beer-gardens/\">Alcohol and colonialism: the curious story of the Bulawayo beer gardens</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:36",
            "date": "08 Jul 2025"
        },
        {
            "title": "Mai TT apologises to businesswoman Jere amid US$100,000 lawsuit",
            "url": "https://www.newzimbabwe.com/mai-tt-apologises-to-businesswoman-jere-amid-us100000-lawsuit/",
            "content": "By Staff Reporter\n\nComedienne Mai TT, has, in a shocking twist, publicly apologised to businesswoman Shingirayi Ziwange Jere, who slapped her with a US$100,000 defamation lawsuit.\n\nShingirayi is the wife of CAPS United owner and Zanu PF legislator, Farai Jere.\n\nThis marks a notable departure from the socialites past approach to public disputes, where she rarely apologises.\n\nI would like to offer my deepest and most sincere apology to Hon. Farai Jere and his wife, Mrs. Shingi Ziwange-Jere, for the posts made on social media regarding you. I regret the hurt and distress caused and take full responsibility for my actions.\n\nIt was never my intention to bring harm or disrespect. I acknowledge the damage done. Please accept this apology with genuine remorse, said Mai TT in a Facebook post.\n\nThe lawsuit followed Mai TTs Facebook posts on June 9, where she accused Jere of threatening her, orchestrating assaults, and manipulating the justice system.\n\nThe businesswoman represented by lawyer Admire Rubaya labelled the claims unfounded, fabricated and portrayed her as a criminal queenpin.\n\nIn addition to the lawsuit, Jere lodged a criminal complaint under Zimbabwes Cyber and Data Protection Act, citing cyberbullying, harassment, and spreading false information.\n\nBefore the public apology, Mai TT said she had accepted that certain conflicts cannot be won.\n\nI have never created a fake account or utilised a ghost account to attack anyone, as I believe in expressing myself directly and honestly. However, when I respond to someone who has initially attacked me, I am often perceived as being in the wrong.\n\nI am willing to accept that there are certain conflicts that cannot be won. I often wonder what I have done to provoke such behaviour, but I recognise that some individuals will fabricate reasons to criticise me.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/08103324/WhatsApp-Image-2025-07-08-at-11.32.46.jpeg",
            "description": "<p>By Staff Reporter Comedienne Mai TT, has, in a shocking twist, publicly apologised to businesswoman Shingirayi Ziwange Jere, who slapped her with a US$100,000 defamation lawsuit. Shingirayi is the wife of CAPS United owner and Zanu PF legislator, Farai Jere. This marks a notable departure from the socialite’s past approach to public disputes, where she</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mai-tt-apologises-to-businesswoman-jere-amid-us100000-lawsuit/\">Mai TT apologises to businesswoman Jere amid US$100,000 lawsuit</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:36",
            "date": "08 Jul 2025"
        },
        {
            "title": "Sables coach predicts competitive Rugby Africa Cup, as Zimbabwe eyes title defense",
            "url": "https://www.newzimbabwe.com/sables-coach-predicts-competitive-rugby-africa-cup-as-zimbabwe-eyes-title-defense/",
            "content": "By Sports Reporter\n\nZimbabwe senior mens rugby team coach Piet Benade believesthat this years Rugby Africa Cup will be more challenging as his side defends itstitle.\n\nThe Rugby Africa Cup kickedoffTuesday at Nelson Mandela Stadium in Ugandawithdefending champions Zimbabweopeningits campaign against North African side Morocco.\n\nAlthough Benade boasts of continuity as he has managed to retain the bulk of players who won last years Rugby Africa Cup edition, the Sables gaffer is not undermining his competitors efforts.\n\nMany teams have invested in players and new staff so there is definitely going to be an increased level of competitiveness in this edition with the prize being the World Cup qualification, said Benade.\n\nThis years Rugby Africa Cup comes with an automatic ticket to the 2027 Rugby World Cup, and Benade has all that in mind.\n\nThe target is to take it game by game and hopefully we do enough to really challenge each opponent.\n\nWhile the vision is there for qualification to the global showpiece, we need to take a number of steps and overcome tough opponents to get there, he added.\n\nZimbabwe last qualified for the Rugby World Cup in 1991, and hopes are high that the current crop of players can break the jinx.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/29051559/Sables-7.png",
            "description": "<p>By Sports Reporter Zimbabwe senior men’s rugby team coach Piet Benade believes that this year’s Rugby Africa Cup will be more challenging as his side defends its title. The Rugby Africa Cup kicked off Tuesday at Nelson Mandela Stadium in Uganda with defending champions Zimbabwe opening its campaign against North African side Morocco. Although Benade boasts of continuity as he has managed to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sables-coach-predicts-competitive-rugby-africa-cup-as-zimbabwe-eyes-title-defense/\">Sables coach predicts competitive Rugby Africa Cup, as Zimbabwe eyes title defense</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:36",
            "date": "08 Jul 2025"
        },
        {
            "title": "Legal Discussions with Vengai Madzima: Zim Diaspora Property Showcase in Birmingham, United Kingdom",
            "url": "https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-zim-diaspora-property-showcase-in-birmingham-united-kingdom/",
            "content": "NewZimbabwe.com hasinvited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal) to discuss with us legal issues that affect Zimbabweans living in the diaspora. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer.\n\nReporter: Welcome back Mr. Madzima, we understand that theZimDiaspora Property Showcase is backinthe UK and will be held in Birmingham, UK on 12thJuly, 2025. What can the diaspora market expect?\n\nVM: Yes, I am glad that the Zim Diaspora Property Showcase is back in the UK and will be held in Birmingham on Saturday, 12thJuly, 2025 at the Hilton Metropole between 10am to 5pm.\n\nThanks again to its organisers, Seeff Zimbabwe, this showcase is unique in that it allows real estate and complementary businesses operating in Zimbabwe to engage and discuss with the market in the Diaspora. What is key to latch on to is that these businesses were already offering services to the diaspora market.\n\nThe difference now is that the Zimbabwe-based businesses and the diaspora market can operate from a position of mutual understanding and benefit. The aim is to create a symbiotic and not parasitic relationship between the businesses and their markets.\n\nThe event will showcase businesses in the Zimbabwe real estate industry, including complementary businesses like construction companies, money transfer agents, building equipment suppliers and mortgage providers to engage with their market, tinkering with their payment options to suit specific markets.\n\nReporter:What can the UK community expect from the event?\n\nVM: The community in the United Kingdom can expect that the 15 or more companies attending the event from Zimbabwe will showcase exciting deals and real estate products for the UK market.\n\nOur first showcase in July last year in Birmingham opened the business attendees eyes to the unique needs of this particular market. The diaspora property showcase in Texas, USA assisted the Zimbabwe businesses to understand the general needs of the diaspora community in their quest to invest and have properties in Zimbabwe.\n\nI say this so that the attendees understand that the participants this year have a more developed idea of how to tailor their products for this unique market to allow for more people to own properties, while also considering their unique economic and social obligations in their host countries. A commercialquid pro quo.\n\nReporter: What can we expect from your presentation on legal issues affecting property investments?\n\nVM: I suppose I represent one of the complementary businesses, as no property transaction in Zimbabwe can be done without the assistance of a lawyer and if somehow it is done without one, in more cases than not, a lawyer will get involved at a later stage to mitigate the mess.\n\nMy presentation at the conference will be aimed at clarifying or simplifying to the UK diaspora community the Zimbabwe legal and regulatory framework for real estate investment. My presentation will cover the investment process, including other ancillary social and commercial issues that may affect such investment.\n\nThe overarching objective is to ensure that potential investors at the conference are able to invest safely and wisely in Zimbabwe. To the foreign investors, my presentation will include issues related to the repatriation of capital and profits on disinvestment.\n\nReporter: The main concern for the diaspora is that they are not duped of their hard-earned money, will your presentation also look at what to do not to be duped?\n\nVM: That will be the crux of my presentation to mitigate that possibility so that attendees do not fall victim to fraudsters.\n\nOur property development sector is growing and the natural thing in any growing industry is that unscrupulous people view it as an opportunity for quick gains. The carrot normally being unrealistic deals that offer quick and commercially ridiculous gains.\n\nIt has been my experience that real estate investments should be made with a sober mindset having completed the necessary due diligence required. It is your classic aphorism, all that glitters is not gold.\n\nReporter: Are there any other presenters?\n\nVM: Yes, we have heads of banks and banking departments presenting at the conference offering mortgages and other financial products, Real Estate directors and agents, property developers, alternative energy players and many more attending and presenting at the conference.\n\nReporter: Thank you, Mr. Madzima. We have to end here due to time constraints.\n\nVM: Thank you.\n\nYou can contact Vengai Madzima onvengai@mcmlegal.co.zwor www.mcmlegal.co.zw.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/07145305/mcm.png",
            "description": "<p>NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal) to discuss with us legal issues that affect Zimbabweans living in the diaspora. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer. Reporter: Welcome back Mr. Madzima, we understand that</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-zim-diaspora-property-showcase-in-birmingham-united-kingdom/\">Legal Discussions with Vengai Madzima: Zim Diaspora Property Showcase in Birmingham, United Kingdom</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:36",
            "date": "08 Jul 2025"
        },
        {
            "title": "Zimbabwean consumer sector poised for improvement amid rising costs, tax pressures",
            "url": "https://www.newzimbabwe.com/zimbabwean-consumer-sector-poised-for-improvement-amid-rising-costs-tax-pressures/",
            "content": "By Business Report\n\nAn uplift in volumes has been projected for Zimbabwean consumer companies despite rising cost structures, a volatile policy and monetary environment as well as higher taxation, say analysts at IH Securities.\n\nHippo Valley, Tongaat Huletts Zimbabwe-listed unit, reported a 44% downturn in revenues to $191.59 million this monthalthough the gross profit for the year to end March rose 2% to$66.87m.\n\nAnother Zimbabwean consumer company, Star Africa Corporation that also trades in sugar, however, raised revenues by 22% over the same period.\n\nNonetheless, analysts at IH Securities on Friday said in the securities and advisory firms latest research note on Zimbabwes consumer sector that they anticipate an uplift to volumes for consumer-facing companies this year owing to a likely recovery in consumer spend.\n\nHowever, this was against the backdrop of general cost structures continuing to be on the rise corresponding to a volatile policy environment and the crystallization of costs in United States dollars.\n\nOn the demand side, private consumption growth, which had slowed down from 4.8% in 2023 to 2.5% in 2024, is expected to have a rosier year with household spending rebounding by 6.6% in 2025, said the report.\n\nAfter an improved rainy season and prices for minerals such as gold firming up, Zimbabwean consumer firms are well placed for stronger consumer spending.\n\nCompanies expected to benefit from this include beer and soft drinks manufacturer, Delta Corporation, which has cited stiffer competition in some beverage categories.\n\nZimbabwean consumer discretionary spend however remains subdued, with data from Zimstats recently showing average earnings of 55% of the employed population at less than $100.\n\nMoreover, Zimbabwean companies have to absorb some of the legislation-linked costs of production, such as sugar taxes and fast-food taxes, to support volumes.\n\nIH Securities is thus skewed towards consumer-facing stocks thatexhibit the ability to generate a significant portion of revenue in US dollar, have good management practices, and are also consistent in paying dividends.\n\nCompanies offering defensive staples such as National Foods  in which Tiger Brands has an interest  were displaying volume growth, said the analysts.National Foods maize division recordeda significant volume growth of 58% in May over the comparative nine-month period, largely attributable to the market dynamics.\n\nDairy company, Dairibord, saw consolidated volume growth of 14% for itsfirst quarter ended 31 March 2025.\n\nOn the retail front, the past two years have been challenging for formal operators on account of several issues. As per leading retailers, a key impediment to viability has been S.I 81A of 2024, an exchange control act that mandated the selling of goods and services at the official exchange rate, noted the report.\n\nIt further though stated that Zimbabwesoperating environment for companiesremained challenging overall, citing key issues such as elevated production costs as well as sporadic operating liquidity squeezes in light of the tightening of monetary conditions.\n\nIt mentioned emerging cost pressures including the governments recent increase of 19.1% to the diesel levy as further worsening costs for companies.\n\nHeadwinds in Zimbabwe had already affected Hippo Valley, which has had to rightsize its workforce with 1 000 workers expected to be let go by August.\n\nOK Zimbabwe, another prominent retailer battling headwinds, is now undertaking a $30m rights issue to stabilize the company. The retailer has also announced further closures of stores, pointing to a 2025 year that remains volatile and fragile, but with a possibility of better performances by consumer companies.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/22160602/OK-Zimbabwe.jpg",
            "description": "<p>By Business Report An uplift in volumes has been projected for Zimbabwean consumer companies despite rising cost structures, a volatile policy and monetary environment as well as higher taxation, say analysts at IH Securities. Hippo Valley, Tongaat Hulett’s Zimbabwe-listed unit, reported a 44% downturn in revenues to $191.59 million this month although the gross profit for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-consumer-sector-poised-for-improvement-amid-rising-costs-tax-pressures/\">Zimbabwean consumer sector poised for improvement amid rising costs, tax pressures</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:36",
            "date": "08 Jul 2025"
        },
        {
            "title": "UK: Zimbabwean Embassy ensuring justice is pursued after murder of Dr Fortune Gomo in Dundee",
            "url": "https://www.newzimbabwe.com/uk-zimbabwean-embassy-ensuring-justice-is-pursued-after-murder-of-dr-fortune-gomo-in-dundee/",
            "content": "By Darlington Gatsi\n\nIN the aftermath of the tragic murder of Zimbabwean national Dr. Fortune Faith Gomo in Scotland, the Zimbabwean Embassy in the United Kingdom has pledged to assist the bereaved family, adding that it will ensure justice is served.\n\nDr. Gomo was fatally stabbed in Dundee on Saturday, 5 July 2025, in full view of her 10-year-old child, and was pronounced dead at the scene.\n\nA 20-year-old man, Kyler Rattray, has since been arrested in connection with the murder.\n\nThe Embassy confirmed the tragic death of Dr. Gomo, who was a respected scientist at the University of Dundee and an employee of Scottish Water.\n\nThe Embassy confirmed the tragic passing of Gomo who was a scientist at the University of Dundee.\n\nThe Embassy of the Republic of Zimbabwe in the United Kingdom is deeply saddened to confirm the untimely passing of Dr. Fortune Faith Gomo, a Zimbabwean national who was fatally stabbed in Dundee, Scotland, on 5 July 2025.\n\nDr. Gomo, a respected Hydro Nation PhD scholar at the University of Dundee and employee of Scottish Water, was attacked while walking with her 10-year-old daughter. Emergency services responded to the scene, but despite their best efforts, Dr. Gomo sadly succumbed to her injuries. The local authorities have confirmed the arrest of a 20-year-old male suspect, who remains in custody.\n\nDr. Gomo was a dedicated scholar, a beloved mother, and a rising expert in her field. Her death is a devastating loss to her family, the Zimbabwean community in the diaspora, and the broader academic and professional community in Scotland, read the statement.\n\nDr. Gomo had recently begun working at Scottish Water as a senior service planner.\n\nThe Embassy has dispatched Officials to Dundee to: Engage with Scottish authorities on the ongoing investigation; Provide support and assistance to the minor child and immediate family; Liaise with the next of kin on burial arrangements; Ensure that Zimbabwean citizens are treated with dignity and that justice is pursued diligently.\n\nThe Embassy is also in contact with media representatives and will be providing verified updates in due course, read the statement further.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/06095328/1751787728513.jpg",
            "description": "<p>By Darlington Gatsi IN the aftermath of the tragic murder of Zimbabwean national Dr. Fortune Faith Gomo in Scotland, the Zimbabwean Embassy in the United Kingdom has pledged to assist the bereaved family, adding that it will ensure justice is served. Dr. Gomo was fatally stabbed in Dundee on Saturday, 5 July 2025, in full</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uk-zimbabwean-embassy-ensuring-justice-is-pursued-after-murder-of-dr-fortune-gomo-in-dundee/\">UK: Zimbabwean Embassy ensuring justice is pursued after murder of Dr Fortune Gomo in Dundee</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:36",
            "date": "08 Jul 2025"
        },
        {
            "title": "LONDON: Diaspora Insurance CEO wins UK Africa business award",
            "url": "https://www.newzimbabwe.com/london-diaspora-insurance-ceo-wins-uk-africa-business-award/",
            "content": "By Gilbert Nyambabvu\n\nDIASPORA InsuranceCEO, Jeff Madzingo, was last week recognised and honoured as one of the leading African entrepreneurs and business leaders in the United Kingdom.\n\nMadzingo won the Financial Services Excellence Award at a glittering gala dinner in London hosted by theAfrican Business Chamberand attended by diplomats, entrepreneurs and business executives.\n\nIn his keynote address, Rwandas High Commissioner to the United Kingdom, H.E. Johnston Busingye,\n\nRwandas High Commissioner to the United Kingdom, H.E. Johnston Busingye\n\nchallenged Africans to commit ourselves to making a difference.\n\nThe Africa we want is within reach, but getting there requires governments that match policy with implementation, businesses that take bold steps, and partners who are willing to build lasting and productive relationships.\n\nMeanwhile, founded 14 years ago,Diaspora Insurancehas enjoyed phenomenal growth, developing into a multi-million-dollar business from its global headquarters in Birmingham.\n\nFrom covering just two countries when it was founded, the company now covers 20 African nationalities not just in the UK and Europe but right across the world.\n\nWhen we started, we did say we can only call ourselves a civilised people when we are able to create common solutions for our common good, said Madzingo.\n\nWe were coming from a background where every time there is a bereavement, it comes with a begging bowl, and we needed to arrest that challenge.\n\nDiaspora Insurancechanged the traditional services-based approach to funeral insurance, introducing products more suited to the unique needs of African diasporas.\n\nThe companysfuneral cash planprovides immediate cash intervention to ensure families are not subjected to the double trauma and indignity of grieving and begging at the same time.\n\nMadzingo also shared insights on challenges which face African entrepreneurs in the UK, including poor access to capital, lack of professional support and limited networks, limited experience in top executive roles.\n\nOther drawbacks include a consumer rather than producer mindset that we come with as African entrepreneurs, said Madzingo, adding that we also tend to focus on businesses that are very difficult to scale up.\n\nAwards host, theAfrican Business Chamber (AfBC), is a global organisation dedicated to representing and supporting African businesses, investors, and entrepreneurs as they grow and thrive in the global economy.\n\nChamber CEO Eugene Nizeyimana said the organisation was eight years ago to enhance our representation in the UK economy, enhance our voice, and establish businesses that create jobs and wealth.\n\nSecondly, we want to drive investment between the UK and Africa, make sure that all of us, as we live in the UK we also contribute back, engage back and invest back in Africa.\n\nTop 100 Business Leader of the Year:Said ADREN\n\nBusiness Excellence Award:Edward Obi Chartered FCIPD, MIRP, TechIOSH\n\nEntrepreneur of the Year:Cody Gapare (CMgr MCMI MBA)\n\nStartup and New Business of the Year Award:Michaelle Kubwimana\n\nTechnology and Innovation Excellence Award:Olusola (Sola) Idowu\n\nHealthcare Excellence Award:Professor Rotimi Jaiyesimi\n\nCreative Industry Excellence Award:Juliana Olayinka\n\nFinancial Services Excellence Award:Jeff Madzingo\n\nProfessional Services Excellence Award:Leslie Owusu\n\nWomen in Business (WIB) Excellence Award:Fungai Ndemera\n\nInternational Trade Excellence Award:Veronica Bolton Smith\n\nSocial Enterprise Excellence Award:Leah Chikamba-Mulando\n\nDiaspora Excellence Award:Jabo Butera\n\nBusiness of the Year Award:Bank Of Africa UK\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/08071952/Jeff-Madzingo.png",
            "description": "<p>By Gilbert Nyambabvu DIASPORA Insurance CEO, Jeff Madzingo, was last week recognised and honoured as one of the leading African entrepreneurs and business leaders in the United Kingdom. Madzingo won the Financial Services Excellence Award at a glittering gala dinner in London hosted by the African Business Chamber and attended by diplomats, entrepreneurs and business</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/london-diaspora-insurance-ceo-wins-uk-africa-business-award/\">LONDON: Diaspora Insurance CEO wins UK Africa business award</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:36",
            "date": "08 Jul 2025"
        }
    ]
}