{
    "news": [
        {
            "title": "In Pictures: ZESA Executive Chairman Gata buried at National Heroes Acre",
            "url": "https://www.newzimbabwe.com/in-pictures-zesa-executive-chairman-gata-buried-at-national-heroes-acre/",
            "content": "THE late ZESA Holdings Executive Chairman, Sydney Gata, has been laid to rest at the National Heroes Acre.\n\nBelow are some images from the shrine where President Emmerson Mnangagwa presided over the burial.\n\nPictures by Thandiwe Garusa\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/09192202/InShot_20250709_152344277.jpg",
            "description": "<p>THE late ZESA Holdings Executive Chairman, Sydney Gata, has been laid to rest at the National Heroes Acre. Below are some images from the shrine where President Emmerson Mnangagwa presided over the burial. Pictures by Thandiwe Garusa</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-pictures-zesa-executive-chairman-gata-buried-at-national-heroes-acre/\">In Pictures: ZESA Executive Chairman Gata buried at National Heroes Acre</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:32",
            "date": "09 Jul 2025"
        },
        {
            "title": "Zimbabwe hopes to service external debt",
            "url": "https://www.newzimbabwe.com/zimbabwe-hopes-to-service-external-debt/",
            "content": "Bloomberg\n\nZimbabwe, locked out of international capital markets since defaulting in 1999, expects its stronger economy to help it pay back external creditors, without saying when this would begin.\n\nFinance Minister Mthuli Ncube told reporters in the capital, Harare, on Tuesday that the countrys debt as a percentage of gross domestic product has declined to 46% from around 60% thanks to better growth.\n\nYou can be assured that given this larger GDP base this creates more opportunity and capacity for us to start servicing our external debt, he said, without providing a time-frame.\n\nThe economy has grown to a point where it can allow us to begin servicing our debts sustainably.\n\nZimbabwe wants to restructure its $21 billion debt, of which around $12.3 billion is owed to external creditors including the World Bank, African Development Bank and the European Investment Bank.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/08111459/harare.jpeg",
            "description": "<p>Bloomberg Zimbabwe, locked out of international capital markets since defaulting in 1999, expects its stronger economy to help it pay back external creditors, without saying when this would begin. Finance Minister Mthuli Ncube told reporters in the capital, Harare, on Tuesday that the country’s debt as a percentage of gross domestic product has declined to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-hopes-to-service-external-debt/\">Zimbabwe hopes to service external debt</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:32",
            "date": "09 Jul 2025"
        },
        {
            "title": "UZ suspends students for demonstrating in support of striking lecturers",
            "url": "https://www.newzimbabwe.com/uz-suspends-students-for-demonstrating-in-support-of-striking-lecturers/",
            "content": "By Thandiwe Garusa\n\nTHE University of Zimbabwe (UZ) administration has suspended six students for holding a demonstration on campus in support of their striking lecturers in May.\n\nThe six students, Narshon Kohlo, Blessing Mtisi, Nodesha Maingehama, Tafadzwa Katsande, Tawana Hove and Tariro Mtukura are members of Zimbabwe National Students Union (ZINASU), UZ Chapter.\n\nThey staged a flash protest at the UZ campus where they demanded an urgent resolution to the grievances of their lecturers, who have been on strike since April 16.\n\nIn separate letters seen by NewZimbabwe.com which were written to the six students by UZ Vice Chancellor Professor Paul Mapfumo, the suspensions are with immediate effect.\n\nAccordingly and in light o the seriousnes of the allegantions detailed above, i have found it necessary to, interms of section 8(3)(e) of the Univerity of Zimbabwe act [Chapter 25:16,(the Act), suspend you, with immediate effect, from your studies at the University of Zimbabwe indefinitely, pending diciplinary hearing against you.\n\nAccordingly, you are barred, forthwith, from entering the University of Zimbabwe Campus and any other University premises. You are required to surrender your student ID card to the Director, Asset Protection Services, the letters read.\n\nThe suspended students will attend a disciplinary committee hearing to answer to thecharges next week.\n\nTwo weeks ago, the UZ administration also fired four leaders of the ongoing lecturers industrial action after having been initially suspended and undergoing a hearing for using the campus great hall without approval from authorities.\n\nThe lecturers are demanding a salary increase to at least US$2,250 from their current US$250 as well as improved working conditions.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/12181302/Zinasu-7.png",
            "description": "<p>By Thandiwe Garusa THE University of Zimbabwe (UZ) administration has suspended six students for holding a demonstration on campus in support of their striking lecturers in May. The six students, Narshon Kohlo, Blessing Mtisi, Nodesha Maingehama, Tafadzwa Katsande, Tawana Hove and Tariro Mtukura are members of Zimbabwe National Students Union (ZINASU), UZ Chapter. They staged</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uz-suspends-students-for-demonstrating-in-support-of-striking-lecturers/\">UZ suspends students for demonstrating in support of striking lecturers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:32",
            "date": "09 Jul 2025"
        },
        {
            "title": "More resources needed for innovation hubs – Parliamentarians",
            "url": "https://www.newzimbabwe.com/more-resources-needed-for-innovation-hubs-parliamentarians/",
            "content": "By Anna Chibamu\n\nLEGISLATORS have urged the government to put more resources towards the development of innovation hubs.\n\nTouring University Innovation Hubs and industrial sites in Masvingo and Bulawayo last week, the Public Accounts Committee (PAC) said it was impressed by the level of innovation in universities in areas visited so far but highlighted there was a shortage of resources to expand.\n\nThe legislators toured the Universitys Innovation Hubs and Industrial sites on a fact finding mission in regards with the Report on Utilisation of COVID-19 funds towards production of Personal Protective Equipment and Sanitizers under the Ministry of Higher and Tertiary Education.\n\nAfter a tour of the National University of Science and Technology (NUST) in Bulawayo, PAC chairperson, Chalton Hwende commended all the Universities that were visited by the Parliamentarians over the week.\n\nAs a committee, we visited the University of Zimbabwe (UZ), Harare Institute of Technology (HIT), Chinhoyi University of Technology in Chinhoyi (CUT), Midlands State University (MSU) in Gweru and Great Zimbabwe University (GZU) in Masvingo and the National University of Science and Technology ( NUST).\n\nAs a committee, we are quite impressed with the work being done in all the Innovation Hubs that we visited. We are on a mission to check whether there was value for money over the money that the government invested during the COVID-19 era.\n\nAs you are aware, when COVID hit us, we were not prepared, so government released money to various institutions of higher learning for the purposes of producing masks and sanitisers and other stuff that were related to the COVID-19 situation that was prevailing at that particular time.\n\nAfter that, the Auditor General is mandated by the Constitution of Zimbabwe to do a value for money audit just to see whether the resources that were deployed were used properly and whether there was value for money.\n\nSo I must confirm that indeed, from what we have seen, there was value for money. For example, here they received about ZWL$3 million and they managed to grow that ZWL$3 million by 47 times.\n\nHe added, We urge the government to put more resources towards innovation hubs so that we can reduce our import bill as a country, and we will be pointing out those areas in our report when we table the report in Parliament sometime.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/08223325/innovation-hub-scaled.jpg",
            "description": "<p>By Anna Chibamu LEGISLATORS have urged the government to put more resources towards the development of innovation hubs. Touring University Innovation Hubs and industrial sites in Masvingo and Bulawayo last week, the Public Accounts Committee (PAC) said it was impressed by the level of innovation in universities in areas visited so far but highlighted there</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/more-resources-needed-for-innovation-hubs-parliamentarians/\">More resources needed for innovation hubs – Parliamentarians</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:32",
            "date": "09 Jul 2025"
        },
        {
            "title": "Questionable alliance as Mnangagwa’s ally Tungwarara takes over City Sports Centre",
            "url": "https://www.newzimbabwe.com/questionable-alliance-as-mnangagwas-ally-tungwarara-takes-over-city-sports-centre/",
            "content": "By Darlington Gatsi\n\nPRESIDENT Emmerson Mnangagwas special advisor, Paul Tungwarara, will oversee the renovations of the Harare City Council-owned City Sports Centre following years of deterioration and neglect by the municipality.\n\nTungwarara, through his company, Prevail Group, has been awarded the contract to refurbish the council-owned facility, though details of the deal remain unclear.\n\nAddressing the media recently, Harare Mayor Jacob Mafume revealed that the deal was endorsed by President Mnangagwa, with Prevail Group selected to lead the renovations of the City Sports Centre.\n\nWe are going to be assisted in renewing the City Sports Centre which was being turned into the City Church Centre. It is not the City Church Centre. It is the City Sports Centre and it is going to remain that. The City Sports Centre will remain a quintessentially sports facility where people play indoor games and we are going to make it better.\n\nWhen we went to the meeting, the President directed that Prevail Group of Companies assist the Council to renew and modernise that facility and we are going to do exactly that.\n\nThese are the kind of partnerships that we require so that we develop modern facilities that are in keeping with modern day standards and that will make our children grow and live in Harare, said Mafume.\n\nThe deal to revamp the City Sports Centre by Tungwararas company follows a similarly controversial agreement between the council and Geo Pomona, which has taken over refuse collection in the capital.\n\nHarare City Council is also partnering with ZANU PF Member of Parliament Pedzai Scott Sakupwanya for a sports ground he is constructing in Mabvuku and has proposed a lease agreement for Rufaro Stadium.\n\nDespite previously opposing partnerships with private entities, Mafume appears to have softened his stance by endorsing the Geo Pomona and Prevail Group deals.\n\nMafume said partnerships with private players are crucial for the development of the Citys facilities.\n\nA city is build by the Citizens in it. Citizens in it are the cooperates, churches, individuals, NGOs and everybody. We want to encourage people to come and work with us and be in partnership. When we partner with someone there is no way they can put the land in their pocket, said Mafume.\n\nThe City Sports Centre reflects the dire state of council-owned facilities, which have deteriorated due to municipal neglect.\n\nIn 2022, Mafume blocked a proposed deal by businessman Kudakwashe Tagwirei to renovate Rufaro Stadium but has since failed to revive the iconic Mbare structure.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/08215221/tungwarar.jpeg",
            "description": "<p>By Darlington Gatsi PRESIDENT Emmerson Mnangagwa’s special advisor, Paul Tungwarara, will oversee the renovations of the Harare City Council-owned City Sports Centre following years of deterioration and neglect by the municipality. Tungwarara, through his company, Prevail Group, has been awarded the contract to refurbish the council-owned facility, though details of the deal remain unclear. Addressing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/questionable-alliance-as-mnangagwas-ally-tungwarara-takes-over-city-sports-centre/\">Questionable alliance as Mnangagwa’s ally Tungwarara takes over City Sports Centre </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:32",
            "date": "09 Jul 2025"
        }
    ]
}