{
    "news": [
        {
            "title": "NoViolet Bulawayo wins the best of 25 years of the Caine Prize. Why she deserves it",
            "url": "https://www.newzimbabwe.com/noviolet-bulawayo-wins-the-best-of-25-years-of-the-caine-prize-why-she-deserves-it/",
            "content": "The Conversation\n\nZimbabwean writerNoViolet Bulawayohas beenhonouredas Africas best short story writer after winning theBest of Caine Award. The special recognition marks 25 years of the annualCaine Prize for African Writing.\n\nAn esteemed panel of judges unanimously selected Bulawayo as the standout winner of the 25 stories awarded the prize so far. Her short story,Hitting Budapest, won the prize in 2011. She has gone on to publish two acclaimed novels,We Need New NamesandGlory. Both were shortlisted for the Booker Prize.\n\nFor me as ascholarof African literary cultures, Bulawayos recognition by the judges feels like a generational milestone. Hitting Budapest follows a band of children wandering in a decaying urban landscape in search of food. Their journey, told through a fractured, childlike voice, captures both the immediacy of play and the stark realities of deprivation.\n\nThe storys unsettling blend of innocence and brutality provoked livelydebatewhen it appeared. It raised questions about the aesthetics of the African literature the prize sought to celebrate. About whether its power lived in its inventive narration and perspective, or whether it leaned too easily into global appetites for African suffering and spectacle.\n\nBut there was never any doubt about Bulawayos singular talent. Shes today known for her virtuoso ability with language and her sharp eye for the textures of African life.\n\nNoViolet Bulawayo, the pen name of Elizabeth Tshele, was born in 1981 in Tsholotsho, Zimbabwe. She grew up in the city of Bulawayo, from which she takes part of her literary name. NoViolet is in honour of her late mother, Violet. She later moved to the US, where she studied and began her writing career.\n\nIn 2013, her debut novel We Need New Names announced her arrival as a major talent. Its sharp social observation, childlike candour, and lyrical experimentation made it both accessible and unsettling. Her Caine Prize story makes up the first chapter of this book.\n\nA decade later,Gloryconfirmed her daring imagination. Set in an allegorical animal kingdom, it transforms Zimbabwes turbulent politics into a fable of authoritarianism and resistance. Its inventive form  mixing satire, oral traditions, and digital-age idioms  reimagines how the novel can respond to todays African realities.\n\nTogether, these works have marked Bulawayo as a defining voice of her generation. She isnt afraid to stretch the form of the African novel while capturing the hopes and contradictions of our times.\n\nSince its inauguration in 2000, theCaine Prize for African Writinghas set itself a lofty goal: to identify and celebrate a new generation of African writers.\n\nWhen the first-ever prize was awarded to acclaimed Sudanese writerLeila Aboulelathat year, it signalled a shift: the new African writers were not just beholden to writing back to colonial history, they wrote from the urgency of their own moment.\n\nManypast Caine winnershave gone on to make enduring contributions to African literature.Binyavanga Wainaina,Helon Habila,Yvonne Adhiambo Owuor,Brian Chikwava,Mary Watson, among others. Their work shows how the prize has provided a platform for innovative writing that unsettles conventions and shifts the contours of the field.\n\nOn average more than 200 entries are received each year, and significantly, more women than men have won the prize. This is notable compared to the heavily male-dominatedAfrican Writers Seriesgeneration of the 1960s. These included literary powerhouses LikeChinua Achebe,Wole SoyinkaandNgg wa Thiongo.\n\nUnlike many other prizes, the Caine made a decision early on to accept entries frominternet publications. This proved prescient. Online platforms have inspired a boom in short stories. The art form has links with age-old traditions of storytelling in Africa and seems particularly suited to the pace of contemporary living.\n\nBeyond the award, the Caine Prize has hosted annual writing workshops in various African cities, helping to nurture local literary communities. Its award ceremonies have been accompanied by efforts to ensure the stories remain accessible to African readers.\n\nToday, more than a dozen African co-publishers distribute the Caine Prize anthologies. These books include each years shortlisted stories and workshop entries.\n\nFor much of its history, the Caine Prize has championed the African short story written in English, by writers based either on the continent or abroad. This has not been without controversy, especiallydebatesabout who counts as an African writer, and why the prize is based in the UK rather than Africa.\n\nIf anything, the prize has forced readers to think harder about who belongs to an African literary community, and who gets left out when boundaries are drawn too tightly. The true currency of prizes is recognition, and in this sense the Caine has often exceeded expectations by bringing visibility to writers who might not otherwise have reached global audiences.\n\nControversies endure. The prizes location in Europe, its emphasis on the short story form, andits rolein shaping global perceptions of African literature all remain points of contention.\n\nEven with that noise in the background, the Caine Prize remains the only freestanding and consistent award dedicated solely to African writing. That distinction alone has made it the preeminent platform for new African voices in the 2000s.\n\nBulawayos crowning as the best of the lot underscores both the continuity and the evolution of the prize. All the winners embody or react against African political and social contexts, at the same time addressing issues of race, identity, sexuality and historical injustices.\n\nThe Caine Prize has been an imperfect but vital incentive for a new generation of African writers and their often politically charged perspectives. It has sparked robust discourse, created opportunities, and amplified voices that might have been overlooked. It has become a cultural institution to be reckoned with and arguably the most influential global event for African literature.\n\nAnd in celebrating NoViolet Bulawayo at its 25-year mark, it affirms what many already knew: she is a generational talent, one whose work will resonate far beyond the prize itself.\n\nAssistant Professor, Harvard University\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/02061520/noviolet-bulawayo.png",
            "description": "<p>The Conversation Zimbabwean writer NoViolet Bulawayo has been honoured as Africa’s best short story writer after winning the Best of Caine Award. The special recognition marks 25 years of the annual Caine Prize for African Writing. An esteemed panel of judges unanimously selected Bulawayo as the standout winner of the 25 stories awarded the prize so far. Her short story, Hitting Budapest,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/noviolet-bulawayo-wins-the-best-of-25-years-of-the-caine-prize-why-she-deserves-it/\">NoViolet Bulawayo wins the best of 25 years of the Caine Prize. Why she deserves it</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:30",
            "date": "02 Oct 2025"
        },
        {
            "title": "Farmers embrace indigenous seeds to strengthen food security in Zimbabwe",
            "url": "https://www.newzimbabwe.com/farmers-embrace-indigenous-seeds-to-strengthen-food-security-in-zimbabwe/",
            "content": "Xinhua\n\nLinda Hungwe, a 52-year-old farmer from Masvingo Province in southeastern Zimbabwe, believes that the key to maintaining food security is to adopt indigenous seed varieties that are well-adapted to the local environment.\n\nSeed symbolizes the beginning of life, and when I control the choice of the seed I grow, I take charge of my destiny, Hungwe told Xinhua during the National Good Seed and Food Festival recently held in Harare, the countrys capital, an annual event to promote indigenous seeds, traditional foods, and sustainable agricultural practices.\n\nDuring the festival, Hungwe and other farmers showcased various indigenous seeds, exchanged seeds, and shared knowledge on Zimbabwes culinary culture.\n\nThe farmer said she grows indigenous crops such as pearl millet, finger millet, round nuts, and cowpeas, which are more drought-tolerant, better adapted to local soil, and more resilient to pests.\n\nIn Zimbabwe, recurrent droughts have diminished crop yields for farmers dependent on rain-fed agriculture, prompting them to adopt drought-tolerant indigenous crops.\n\nFarmer-led seed systems are important because, as a farmer, I know the qualities of the seed, my soil, its shortcomings and needs, she said, adding that indigenous seeds can be grown organically, which reduces reliance on expensive external inputs such as fertilizers and pesticides.\n\nChristopher Chinyoka, another farmer from Masvingo Province, said seed exchange among farmers is a long-standing tradition that ensures food security by maintaining locally adapted crops.\n\nSeed exchanges have been carried on from our ancestors; its a culture that creates a bond between people. We had seeds that had gone extinct, but now they have been revived, thanks to seed exchanges. If my crop fails due to drought or other reasons, I can always get the seed from other farmers, he said.\n\nA farmer shows her agricultural products at a seed and food festival in Harare, Zimbabwe, Sept. 20, 2025.(Xinhua/Tafara Mugwara)\n\nChinyoka added that smallholder farmers should not be at the periphery of food production, but rather be at the forefront to effectively safeguard food security.\n\nArchbold Sasa, a lecturer in the Department of Crop Science at the Marondera University of Agricultural Sciences and Technology in Zimbabwe, said smallholder farmers are key to promoting food security and resilience.\n\nSmallholder farmers play a crucial role in storing some seed varieties because they keep producing them from time to time, so that we dont lose that genetic material as a country. Its sort of a seed bank, he said. Some crops are being neglected, and people are not producing them anymore, but we tend to find those seeds in smallholder farmers.\n\nIn addition to indigenous grains, farmers are encouraged to adopt indigenous vegetables, including blackjack, pigweed, okra, and pumpkin leaves, due to their high nutritional value and adaptation to local climates.\n\nWe are doing seed exchange from one district to another so that people will have a diversity of these indigenous vegetables to promote their nutrition, resulting in improved health, said Sasa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/02060658/indigenous-seeds-.png",
            "description": "<p>Xinhua Linda Hungwe, a 52-year-old farmer from Masvingo Province in southeastern Zimbabwe, believes that the key to maintaining food security is to adopt indigenous seed varieties that are well-adapted to the local environment. “Seed symbolizes the beginning of life, and when I control the choice of the seed I grow, I take charge of my</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/farmers-embrace-indigenous-seeds-to-strengthen-food-security-in-zimbabwe/\">Farmers embrace indigenous seeds to strengthen food security in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:30",
            "date": "02 Oct 2025"
        },
        {
            "title": "UNIFREIGHT Africa reports 231% revenue growth in first half of 2025",
            "url": "https://www.newzimbabwe.com/unifreight-africa-reports-231-revenue-growth-in-first-half-of-2025/",
            "content": "By Alois Vinga\n\nUNIFREIGHT Africa has posted strong revenue and profit growth for the six months to 30 June 2025, buoyed by expanding cross-border operations and increased trade flows along the Beira corridor.\n\nGroup revenue surged 231.6% year-on-year to ZWG545.5 million, up from ZWG164.5 million in the same period last year. EBITDA rose 139.9% to ZWG100.9 million, while profit before tax increased 154% to ZWG51.6 million. Net profit after tax more than doubled to ZWG202.4 million from ZWG90.4 million, aided by a ZWG150.7 million income tax credit.\n\nDespite the topline growth, margins came under pressure. The EBITDA margin slipped to 18.5% from 25.6%, while the net profit margin declined to 37.1% from 54.9%, largely due to higher operating costs and the one-off tax credit. Operating expenses rose 237% year-on-year.\n\nOn the balance sheet, total assets fell 10.3% to ZWG1.35 billion, mainly reflecting a reduction in vehicles and equipment. Retained earnings grew 66.3% to ZWG507.7 million, while borrowings eased 3% to ZWG144.8 million. However, finance costs spiked nearly 395% in the wake of elevated interest rates.\n\nLiquidity also weakened during the period. Cash holdings dropped 65.5% to ZWG14.5 million, with operating activities posting a net outflow of ZWG5.8 million compared to an inflow of ZWG57.5 million last year. Financing outflows of ZWG32.6 million were recorded, linked to debt repayments, leases, and fleet investment.\n\nBasic earnings per share rose 153.6% to 194.53 cents, while headline EPS more than doubled to 194.43 cents.\n\nManagement said the performance reflects the benefits of its regional growth strategy but cautioned that cost pressures and working capital constraints remain significant challenges as the company prepares for fleet expansion ahead of the 2026 tobacco season.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/03015012/Unifreight-Africa-which-operates-well-known-logistics-brands-including-Swift-Skynet-and-Bulwark-has-not-been-immune-to-these-challenges-Picture-Supplied.webp",
            "description": "<p>By Alois Vinga UNIFREIGHT Africa has posted strong revenue and profit growth for the six months to 30 June 2025, buoyed by expanding cross-border operations and increased trade flows along the Beira corridor. Group revenue surged 231.6% year-on-year to ZWG545.5 million, up from ZWG164.5 million in the same period last year. EBITDA rose 139.9% to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/unifreight-africa-reports-231-revenue-growth-in-first-half-of-2025/\">UNIFREIGHT Africa reports 231% revenue growth in first half of 2025</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:30",
            "date": "02 Oct 2025"
        },
        {
            "title": "Spitzkop land feud finally resolved after nine years",
            "url": "https://www.newzimbabwe.com/spitzkop-land-feud-finally-resolved-after-nine-years/",
            "content": "By Mary Taruvinga\n\nA nine-year land dispute between the Greater Spitzkop Residents Association and property developer Vevhu Resources has finally been resolved, paving the way for long-delayed development.\n\nThe Supreme Court recently dismissed the residents final appeal, effectively ending a protracted legal battle that saw 16 cases filed, all decided in favour of the developer.\n\nVevhu Resources Chief Executive Officer, Anthony Dube, confirmed that civil works will begin next week and assured residents that no one will be left homeless.\n\nWe have had a challenge in Lot 14 where we had a lot of people who came in and settled not by the Act of Vevhu Resources and over the years trying to develop the place has been very difficult, Dube said.\n\nHe explained that delays were also caused by shifting government regulations, including a requirement to allocate 40% of the land to flats, which conflicted with how residents had already settled.\n\nSo it became a bottleneck to try and deal with the occupants to say we need to move certain people to make for the apartments which was government regulation which was gazetted by government through cabinet, he added.\n\nDespite the setbacks, Dube said the company had opted for a compromise.\n\nSo what we have done is that we told people that we will try and adopt the old plan which conforms to how people are already settled, he said.\n\nAccording to Dube, only a third of residents will be affected, but they will remain within Spitzkop Lot 14.\n\nWith the adoption of the old plan it means we are now able to accommodate everyone who has been settled here, he said.\n\nThe original layout plan for Lot 14 Spitzkop provides for 3,595 stands, including shops, schools, and recreational facilities. Over the years, however, some residents had occupied land earmarked for public institutions, sparking resistance whenever development was attempted.\n\nLocal councillor Tafadzwa Kambarami welcomed the resolution, calling it a win for both residents and progress.\n\nWe are happy that the developer understood our concerns despite us having lost court cases. What we want is development and residents have to comply. Everyone is happy because there will be no evictions. We want sanity. We want development and Im happy that residents have accepted what the developer has brought on the table. Development should start right away, he said.\n\nWith the long-standing dispute now settled, construction in Spitzkop is finally set to move forward.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/07024130/Supreme-Court.png",
            "description": "<p>By Mary Taruvinga A nine-year land dispute between the Greater Spitzkop Residents Association and property developer Vevhu Resources has finally been resolved, paving the way for long-delayed development. The Supreme Court recently dismissed the residents’ final appeal, effectively ending a protracted legal battle that saw 16 cases filed, all decided in favour of the developer.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/spitzkop-land-feud-finally-resolved-after-nine-years/\">Spitzkop land feud finally resolved after nine years</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:30",
            "date": "02 Oct 2025"
        },
        {
            "title": "International Day of Non-Violence: Day irrelevant under Zimbabwe’s repressive climate",
            "url": "https://www.newzimbabwe.com/international-day-of-non-violence-day-irrelevant-under-zimbabwes-repressive-climate/",
            "content": "By Staff Reporter\n\nA human rights defender has dismissed the International Day of Non-Violence as meaningless in Zimbabwe, arguing that violence remains a tool to silence dissenting voices.\n\nOctober 2 marks the International Day of Non-Violence, observed annually on the birthday of Mahatma Gandhi, the late leader of Indias independence movement and champion of the philosophy.\n\nBut Tawanda Matangambiri told NewZimbabwe.com the global commemoration holds little weight in Zimbabwe, where state and political actors routinely deploy violence to stifle alternative views.\n\nHuman Rights Defender Tawanda Matangambiri\n\nViolence, Matangambiri says, is threatening the enjoyment of a democratic and peaceful society.\n\nActivists are jailed for expressing themselves. Our democracy is in intensive care. In this situation, many people feel they cannot breathe and yearn for ways to raise their voices without resorting to violence, said Matangambiri.\n\nHe quoted the words of United Nations (UN) Secretary-General Antnio Guterres, In these dangerous and divided times, let us find the strength to follow his lead, end the suffering, advance diplomacy, heal divisions, and create a just, sustainable and peaceful world for all.\n\nZimbabweans, Matangambiri added, must observe the ideals of this commemoration.\n\nThis day is dedicated to promoting the message of non-violence, with an emphasis on education and raising public awareness. Mahatma Gandhi and Martin Luther King Jr are two good examples of non-violent practitioners, who led non-violent protests such as Gandhis Salt March and Kings Birmingham Bus Boycott, respectively, against colonial Britain and the segregation era America.\n\nLocally, in Zimbabwe, we have found a number of cases where opposition members and political activists have been incarcerated, physically harassed, abducted, tortured and even killed for expressing themselves.\n\nThe pre-election environment has been one of the most violent times in Zimbabwe, having posed many obstacles for the political opposition. Zanu PF supporters have engaged in widespread harassment, threats, acts of violence, preventing opposition parties from staging rallies, mobilising, campaigning, and associating with supporters across the country, said Matangambiri.\n\nRegrettably, instead of preserving peace, the Zimbabwe Republic Police (ZRP) has allegedly been complicit in fanning divisions and violence, he further noted.\n\nThe police in Zimbabwe have selectively used the Maintenance of Peace and Order Act of 2019 to deny the opposition permission to hold meetings and campaign rallies, while allowing Zanu PF to meet without hindrance.\n\nMatangambiri argued that President Emmerson Mnangagwas regime had captured the government, the police, the army, courts and other public institutions, which are being weaponised to silence critics.\n\nHe feels there is a need for maturity across the political divide.\n\nZimbabwe does not need another liberation struggle to realise the sanctity of human dignity and the respect for fundamental human rights. It needs all of us to mature in the advancement of the values of peace, human rights, and democracy.\n\nWithout government commitment to respecting democratic values, and citizen commitment to democratic participation, the ideals of non-violence lose their value as the society slides into authoritarianism.\n\nOur last hope as Zimbabweans is to unite and stage a non-violent revolution against tyranny. Let us be instruments of peace and non-violence. In the words of Mahatma Gandhi There are many causes that I am prepared to die for but no causes that I am prepared to kill for, Matangambiri told NewZimbabwe.com.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/02053440/international-day-of-non-violence.png",
            "description": "<p>By Staff Reporter A human rights defender has dismissed the International Day of Non-Violence as meaningless in Zimbabwe, arguing that violence remains a tool to silence dissenting voices. October 2 marks the International Day of Non-Violence, observed annually on the birthday of Mahatma Gandhi, the late leader of India’s independence movement and champion of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/international-day-of-non-violence-day-irrelevant-under-zimbabwes-repressive-climate/\">International Day of Non-Violence: Day irrelevant under Zimbabwe’s repressive climate</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:30",
            "date": "02 Oct 2025"
        },
        {
            "title": "“You are offside!” – Chinamasa tells Advocate Mpofu his critique of Mnangagwa’s politburo reshuffle lacks merit",
            "url": "https://www.newzimbabwe.com/you-are-offside-chinamasa-tells-advocate-mpofu-his-critique-of-mnangagwas-politburo-reshuffle-lacks-merit/",
            "content": "By Staff Reporter\n\nNewly appointed Zanu PF Treasurer General Patrick Chinamasa has dismissed Advocate Thabani Mpofus recent criticism of President Emmerson Mnangagwas Politburo reshuffle as baseless and without substance, labelling it a misleading interpretation.\n\nMnangagwa made changes to the Politburo structure last month in a move that political analysts believe is strategically aimed at curtailing his deputy, Retired General Constantino Chiwengas, aspirations to succeed him.\n\nAmong the changes, Mnangagwa demoted Obert Mpofu from the influential position of Secretary General to the less prominent role of Secretary for Information Communication Technology (ICT).\n\nMpofu is reported to be an ally of Vice President Constantino Chiwenga and is alleged to have had knowledge of the source of the corruption dossier Chiwenga tabled in the last Zanu PF Politburo meeting in Harare.\n\nThe dossier allegedly named controversial business tycoons Kudakwashe Tagwirei, Wicknell Chivayo, Paul Tungwarara and Delish Nguwaya.\n\nJacob Mudenda, Speaker of the National Assembly, replaced Mpofu as Secretary-General, while Chinamasa himself was shifted from Legal Affairs Secretary to the role of Treasurer General of the party.\n\nAdvocate Mpofu subsequently took to social media, alleging that Mnangagwa had violated the partys constitution with the changes he had made.\n\nThe letter from Chris Mutsvangwa purporting to announce changes to the ZANU PF Politburo is invalid. It claims the decision to relieve Obert Mpofu of his office as ZANU PF Secretary-General was taken under Article 9, sections 65 and 67, Mpofu, the lawyer, stated.\n\nHowever, Chinamasa responded to Mpofus claims yesterday blow by blow.\n\nThis claim is a classic case of mala fides interpretation. The relevant provisions of the Zanu-PF Constitution clearly stipulate the President and First Secretarys authority over the Politburo, Chinamasa wrote on X (formerly Twitter) on Wednesday.\n\nHe said: Article 9, Section 65 (2022 Constitution) explicitly states:\n\nThe Politburo shall be appointed by the President and First Secretary under Section 67\n\nSection 67 reinforces this by stating that:\n\nImmediately after the election of the President and First Secretary and Members of the Central Committee, the President and First Secretary of the Party shall appoint from the newly elected Central Committee, two (2) Vice-Presidents and Second Secretaries, the National Chairman, the Heads of Departments of the Politburo, the Committee Members of the Politburo and the Deputies to the Heads of Departments.\n\nThis language is categorical and unambiguous. The authority vests in the President and First Secretary  not in any collective, committee, or ancillary structure. Thus, any personnel changes announced are lawfully anchored in the Presidents prerogative. To argue otherwise is to deliberately distort the plain meaning of the text.\n\nAdvocate Mpofu also argued that Article 9 of the Zanu-PF Constitution does not empower Mnangagwa to reassign office holders outside of the partys elective congress.\n\nArticle 9 concerns Politburo functions generally and does not confer authority for the First Secretary to reassign office-holders, Mpofu, the lawyer, contended.\n\nIn response, Chinamasa urged Mpofu to have a look at himself and understand the Zanu-PFs Constitution in its entirety.\n\nThis assertion demonstrates either wilful blindness or a blatant disregard of the Constitutions architecture.\n\nWhile Article 9 indeed outlines the functions of the Politburo, Section 65 therein is not a functional clause  it is a structural clause explicitly tying the Politburos composition to Presidential appointment powers. It must be read in pari materia with Section 67, which sets out the scope of such appointments.\n\nChinamasa further dismissed Mpofus interpretation of the Zanu-PF Constitution, arguing that it misrepresented the powers bestowed upon the President and First Secretary. He stated that Mpofus arguments were a bit of a reach, and that Mpofu was getting ahead of himself.\n\nChinamasa pointed out that the Constitution explicitly allows for the reassignment and removal of department heads, and that Mpofus reading of Sections 65 and 67 pertained to the Politburo itself, rather than subordinate roles.\n\nHe accused Mpofu of missing the mark completely, saying that Mpofus arguments have no real basis in the documented and agreed-upon Constitution.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/02/06230246/Chinamasa-1.jpg",
            "description": "<p>By Staff Reporter Newly appointed Zanu PF Treasurer General Patrick Chinamasa has dismissed Advocate Thabani Mpofu’s recent criticism of President Emmerson Mnangagwa’s Politburo reshuffle as baseless and without substance, labelling it a misleading interpretation. Mnangagwa made changes to the Politburo structure last month in a move that political analysts believe is strategically aimed at curtailing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/you-are-offside-chinamasa-tells-advocate-mpofu-his-critique-of-mnangagwas-politburo-reshuffle-lacks-merit/\">“You are offside!” – Chinamasa tells Advocate Mpofu his critique of Mnangagwa’s politburo reshuffle lacks merit</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:30",
            "date": "02 Oct 2025"
        },
        {
            "title": "Parliament petitioned over Civil Registry’s standoff with workers",
            "url": "https://www.newzimbabwe.com/parliament-petitioned-over-civil-registrys-standoff-with-workers/",
            "content": "By Darlington Gatsi\n\nPARLIAMENT has been petitioned to intervene in the impasse between the Civil Registry Department and its workers over the non-payment of allowances for more than two years.\n\nIn the build-up to the 2023 general elections, Civil Registry workers were involved in a blitz to register eligible citizens and acquire documentation.\n\nTwo years after the mobile exercise, they are yet to receive their allowances, despite the government having allocated the funds.\n\nIn May 2025, some workers received part-payments of the allowance from the department, with the remainder still outstanding.\n\nThe workers had been promised US$120 per day, which amounted to US$3,600 for the three months the blitz was conducted.\n\nIn a petition to Parliament, initiated by Linda Masarira, the Civil Registry Department is accused of bias, prioritising workers in Harare and Bulawayo in settling the allowances.\n\nOfficial Treasury correspondence and Civil Registry records reveal that USD 1.1 million is available for this purpose, yet due to administrative bias and discriminatory practices, allowances remain unpaid.\n\nThere has been grossly unequal distribution of allowances. Harare and Bulawayo were prioritised and received full payments, while other provinces were sidelined, despite staff performing the same national duty under the same conditions, read the petition.\n\nThe petition asserts that the non-payment of the allowances is a violation of the labour laws and practices.\n\nSection 65 of the Constitution of Zimbabwe, guarantees the right to fair labour practices and remuneration. Labour Act [Chapter 28:01], requiring employers (including the State) to ensure prompt and full payment of wages and entitlements, read the petition.\n\nLast month, it was reported that the Civil Registry Department sought permission from the Treasury to divert funds for the procurement of vehicles for top officials.\n\nThis angered workers who have been at loggerheads with the department, demanding their dues.\n\nThe petition calls on Parliament to summon Henry Machiri to appear before the National Assembly and demands his resignation.\n\nSummon the Registrar-General, Mr. H.T. Machiri, and the Minister of Finance to explain the discriminatory payment practices, poor governance, and unfair labour treatment of staff.\n\nInstitute an inquiry into the governance of the Civil Registry Department to ensure transparency, accountability, and ethical conduct in the management of public resources.\n\nRecommend the retirement or redeployment of Registrar-General Machiri, whose tenure has been characterised by bias, mismanagement, and gross incompetence, read the petition further.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/12/06170513/makombe-1.png",
            "description": "<p>By Darlington Gatsi PARLIAMENT has been petitioned to intervene in the impasse between the Civil Registry Department and its workers over the non-payment of allowances for more than two years. In the build-up to the 2023 general elections, Civil Registry workers were involved in a blitz to register eligible citizens and acquire documentation. Two years</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/parliament-petitioned-over-civil-registrys-standoff-with-workers/\">Parliament petitioned over Civil Registry’s standoff with workers </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:30",
            "date": "02 Oct 2025"
        }
    ]
}