{
    "news": [
        {
            "title": "Harare residents call for probe into approval of illegal Vainona building; say they will not bear costs for council’s gross incompetence",
            "url": "https://www.newzimbabwe.com/harare-residents-call-for-probe-into-approval-of-illegal-vainona-building-say-they-will-not-bear-costs-for-councils-gross-incompetence/",
            "content": "By Darlington Gatsi\n\nHARARE residents have called for heads to roll at the City Council following revelations that senior officials corruptly approved the construction of a double-storey building in Vainona despite glaring irregularities.\n\nThe double-storey building, situated at the corner of Alpes and Grant roads, is one of many construction projects that the City of Harare improperly approved.\n\nThe building, which is nearing completion, is set for demolition after it emerged at the Commission of Inquiry probing the operations of the City Council that it violated by-laws.\n\nThis will set the stage for a potential legal tussle between the City of Harare and the owner, as the structure is almost complete.\n\nIn a statement, the Combined Harare Residents Association (CHRA) said the City Council should institute a special committee to probe the approval of plans of this nature.\n\nThe Combined Harare Residents Association is urgently calling for the Harare City Council to conduct a Special Council Meeting to constitute an Investigation Committee to interrogate the error that was made in approving the construction of a double-storey building by the local authority on an illegal piece of land in Vainona, and take disciplinary measures, including the dismissal of all employees found liable for this costly decision.\n\nIn terms of Section 100(1)(a) of the Urban Councils Act [29:15], the Harare City Council is empowered to set up a Special Committee to conduct investigations, especially on pertinent issues of this nature. Considering the magnitude of this issue and the oversight function of the council as provided in the Urban Councils Act [29:15], turning a blind eye on this matter will make elected representatives (councillors) accomplices, read the statement.\n\nWith the Council realising that it erred in approving the plan, residents will bear the brunt of paying the compensation costs as the building faces demolition. The double-storey building infringes on the frontage line and extends onto Alpes Road.\n\nCHRA said residents cannot shoulder the consequences of the City of Harares rushed approval.\n\nWe affirm that residents and ratepayers of Harare cannot bear the consequences and cost of this gross incompetence and maladministration within the City of Harares planning division without disciplinary measures being taken, read the statement.\n\nThe Harare City Council has come under intense scrutiny after overseeing the approval of questionable plans.\n\nAuthorities at Town House have conceded that certain plans were approved without due diligence.\n\nCHRA said the Vainona building is not an isolated case, as many approved projects violate the council bylaws.\n\nThe Vainona case is similar to other construction activities that have been approved by the local authority in Ecologically Sensitive Areas (wetlands) gazetted by the Government of Zimbabwe across the city.\n\nWe suspect that there were some underhand dealings relating to this matter, hence we call on the local authority to conduct an urgent investigation, read the statement further.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/17052343/vainona-building.jpeg",
            "description": "<p>By Darlington Gatsi HARARE residents have called for heads to roll at the City Council following revelations that senior officials corruptly approved the construction of a double-storey building in Vainona despite glaring irregularities. The double-storey building, situated at the corner of Alpes and Grant roads, is one of many construction projects that the City of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-residents-call-for-probe-into-approval-of-illegal-vainona-building-say-they-will-not-bear-costs-for-councils-gross-incompetence/\">Harare residents call for probe into approval of illegal Vainona building; say they will not bear costs for council’s gross incompetence</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "17 Apr 2025"
        },
        {
            "title": "In landmark ruling, UK’s top court says legal definition of woman refers to biological sex",
            "url": "https://www.newzimbabwe.com/in-landmark-ruling-uks-top-court-says-legal-definition-of-woman-refers-to-biological-sex/",
            "content": "Reuters\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/17050203/Screenshot-2025-04-17-at-06.01.37.png",
            "description": "<p>Reuters Britain’s highest court ruled on Wednesday that only biological and not trans women meet the definition of a woman under equality laws, a landmark decision greeted with concern by trans supporters but welcomed by the government as bringing clarity. The much anticipated ruling centred on whether a trans woman with a gender recognition certificate</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-landmark-ruling-uks-top-court-says-legal-definition-of-woman-refers-to-biological-sex/\">In landmark ruling, UK’s top court says legal definition of woman refers to biological sex</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "17 Apr 2025"
        },
        {
            "title": "Love Triangle turns Deadly: Zimbabwean man killed in brutal bakkie attack in Sandton",
            "url": "https://www.newzimbabwe.com/love-triangle-turns-deadly-zimbabwean-man-killed-in-brutal-bakkie-attack-in-sandton/",
            "content": "IOL\n\nJoburg-based activist Moreboys Munetsi has intervened to assist the family of a Zimbabwean man, Emmanuel Mahamba, who was brutally murdered in a horrific incident which has sent shockwaves in South Africa.\n\nIn a video, widely shared on social media, Mahamba is seen seated on the road while a Ford Ranger runs over him repeatedly. He died at the scene.\n\nGauteng police said they were still searching for the motorist implicated in the brutal death of a man following a heated dispute.\n\nMunetsi, a lawyer by profession, said he was providing legal support to the victims family.\n\nFor now I am giving the family legal support. At the same time, we were encouraging the Zimbabwean community in Joburg to raise funeral money through contributions. The funeral contributions are coming from the Zimbabwean community, Munetsi told IOL.\n\nMunetsi is popular among the South African and Zimbabwean communities in Gauteng as an anti-crime and social cohesion activist.\n\nHe is also a successful businessman who runs an international company, Greathope Insurance.\n\nSpeaking about the incident, Munetsi said: The body of Emmanuel has been repatriated already for burial in Zimbabwe.\n\nEmmanuels murder has attracted international news headlines, with many social media users questioning why the alleged killer has not been arrested.\n\nThe incident unfolded on April 5, 2025, in Rivonia, Sandton, and culminated in a tragic and violent confrontation that ended in Mahamba being run over by a Ford Ranger bakkie multiple times.\n\nOn his Facebook page, which has more than 144,000 followers, Munetsi held a live conversation with Ntombi, the woman who was involved in a relationship with Mahamba, while she lived with her other romantic partner.\n\nThe Ugandan man, who has two children with Ntombi, allegedly murdered Emmanuel in the bakkie attack.\n\nI agree that I once dated Emmanuel in January, and we broke up in February. Yes, we were in a relationship. We broke up because some Ugandans recorded a video of me when I was with the guy (Emmanuel). My baby daddy is a Ugandan. So I broke up with Emmanuel for my safety, for my kids and also for the sake of Emmanuel. I stopped talking to Emmanuel.\n\nNtombi said on the fateful day, Emmanuel and some Ugandan men who lived at the same house with, came over to her work premises. Ntombis baby daddy was already at the business premises, where motorbike parts are sold.\n\nLater on, I heard some noise, people fighting. When I went outside, I asked Emmanuel what he was doing, but he did not even respond to me; he only looked at me. He was holding a stone, and he threw it away. He picked it again and hit the vehicles (wind) screen. That is when my baby daddy got angry, went to Emmanuel and beat him, she said.\n\nSUSPECT WANTED FOR MURDER\n\nPolice are looking for a suspect who was driving a black Ford Ranger Double cab wiyh registration number KV10WLGP in Sandton, Rivonia next to Mzanzi building anyone with information can contact the police on 08600 10111.pic.twitter.com/HC2fq60B80\n\nIn the video, Ntombi can be seen screaming, frantically trying to stop the Ford Ranger driver.\n\nNarrating how she fell in love with the deceased man, Ntombi said she met Emmanuel at Rivonia, Sandton, as he used to come to the shop that she works at, buying motorbike parts.\n\nShe said when she met Emmanuel this year, she was still involved with the Ugandan man although the relationship was experiencing some difficulties. Ntombi was living with the Ugandan man when she started dating Emmanuel.\n\nI had to date Emmanuel, she told Munetsi in the Facebook live session.\n\nNtombi has two children with the Ugandan man and the two have been in a relationship for around three years.\n\nThe Ugandan men who came to the premises with Emmanuel, according to Ntombi, had previously recorded a video of her and Emmanuel and they had also informed Ntombis other boyfriend, the Ugandan man who drives a Ford Ranger.\n\nEmmanuel had not told me that he was staying (at a house) with Ugandans. I was at Emmanuels place and I went out, they recorded the video and sent it to my boyfriend, the baby daddy. In the video, I was walking while holding hands with Emmanuel. I then told Emmanuel that we had to end our relationship, she said.\n\nNtombi said she was confronted angrily by her baby daddy over her romantic relationship with Emmanuel. She said the Ugandan man was very angry, and she decided to end things with Emmanuel.\n\nPolice spokesperson, Colonel Dimakatso Nevhuhulwi, said police received a complaint regarding the incident and upon arrival, they found a man lying on the side of the road with injuries all over his body.\n\nThe paramedics declared him dead on the scene. According to information at hand, the victim reportedly argued with the shop owner and allegedly hit the shop owners vehicle with a brick, breaking the windscreen. The shop owner reportedly came out and drove over his body several times before fleeing the scene, said Nevhuhulwi.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/17045656/A-woman-only-identified-as-Ntombi-has-narrated-how-her-baby-daddy-a-Ugandan-national-who-is-on-the-run-brutally-murdered-her-former-boyfriend-Zimbabwean-national-Emmanuel-Mahamba.webp",
            "description": "<p>IOL Joburg-based activist Moreboys Munetsi has intervened to assist the family of a Zimbabwean man, Emmanuel Mahamba, who was brutally murdered in a horrific incident which has sent shockwaves in South Africa. In a video, widely shared on social media, Mahamba is seen seated on the road while a Ford Ranger runs over him repeatedly.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/love-triangle-turns-deadly-zimbabwean-man-killed-in-brutal-bakkie-attack-in-sandton/\">Love Triangle turns Deadly: Zimbabwean man killed in brutal bakkie attack in Sandton</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "17 Apr 2025"
        },
        {
            "title": "South African hospital faces legal action for refusing liver transplant to Zimbabwean teen",
            "url": "https://www.newzimbabwe.com/south-african-hospital-faces-legal-action-for-refusing-liver-transplant-to-zimbabwean-teen/",
            "content": "Insider Chronicle\n\nBureaucratic red tape is standing between 15-year-old Vanessa Mafu and the liver transplant that could save her life.\n\nDiagnosed with autoimmune hepatitis that has progressed to liver cirrhosis, the teenager urgently requires a transplant. But because she is the child of Zimbabwean parents living in South Africa without formal immigration papers, doctors at Charlotte Maxeke Johannesburg Academic Hospital have reportedly told her she does not qualify to receive a liver from a deceased South African donor.\n\nNow, her mother, Vuyelwa Ncube, is turning to the courts in a desperate bid to save her daughter. An urgent application has been filed in the Johannesburg High Court, naming the hospital, the ministers of health and home affairs, the Gauteng MEC for health, and a treating doctor as respondents.\n\nIn her affidavit, Ncube said a doctor told her Vanessa cannot undergo a liver transplant until sheNcubeproduces a valid visa or permit. This application is urgent and cannot wait to be heard on the ordinary roll because my daughter is extremely unwell, she stated. Her condition is so dire and exigent that the matter cannot wait.\n\nVanessa was diagnosed in December 2024 and has been in and out of hospital since then, with her health rapidly declining. Last month, Ncube was informed about the types of transplants availableeither from a deceased donor or a living relative. But despite her daughters deteriorating condition, she was not provided with any legal justification for the exclusion of non-South African children from access to deceased donor transplants.\n\nIt is significantly more difficult for my daughter to successfully get a liver transplant from a living person, said Ncube. My daughter has a reasonable apprehension of imminent death because she has been denied a liver transplant from a deceased donor.\n\nThe familys legal team is asking the court to stop what they describe as discriminatory and unconstitutional practices in South Africas public healthcare system. Human rights lawyer Advocate Simba Chitando, who is representing the family, did not mince words.\n\nThis matter is urgent because it is a life-saving procedure, but it is also one of the most cruel, inhuman, and blatantly xenophobic acts perpetuated by the state against a child, said Chitando. South Africa has lost its moral, legal, and pan-African compass.\n\nChitando says the case is about more than one childs lifeits about systemic discrimination. My clients remain defiant under the circumstances, and the legal team Im leading will do everything in our power to save this beautiful Zimbabwean girls life.\n\nThe hospital and government officials named in the application have not responded to media queries, despite several attempts for comment this week.\n\nMeanwhile, the cost of undergoing a transplant privately remains far out of reach. A liver transplant at the Wits Donald Gordon Medical Centre under the non-standard service category is priced at just under R1.75 millionan impossible figure for the Mafu family.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/17045530/charlotte-maxeke-hosp.webp",
            "description": "<p>Insider Chronicle Bureaucratic red tape is standing between 15-year-old Vanessa Mafu and the liver transplant that could save her life. Diagnosed with autoimmune hepatitis that has progressed to liver cirrhosis, the teenager urgently requires a transplant. But because she is the child of Zimbabwean parents living in South Africa without formal immigration papers, doctors at</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-african-hospital-faces-legal-action-for-refusing-liver-transplant-to-zimbabwean-teen/\">South African hospital faces legal action for refusing liver transplant to Zimbabwean teen</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "17 Apr 2025"
        },
        {
            "title": "Destiny TV launches ‘My Hustle’ – a celebration of young hustlers turning struggle to success",
            "url": "https://www.newzimbabwe.com/destiny-tv-launches-my-hustle-a-celebration-of-young-hustlers-turning-struggle-to-success/",
            "content": "By Staff Reporter\n\nIN light of the tough economic environment, which has pushed the majority of young people into unemployment,Destiny TVhas curated a television programme that celebrates young entrepreneurs.\n\nMy Hustle, a vibrant programme, has been added to the growing list of shows that Destiny TV is offering on its YouTube channel.\n\nThe programme shines a light on young people who are starting their own businesses.\n\nIt adopts the street lingo hustle, which reflects the daily lives of young people striving to make a living through small to medium enterprises.\n\nProgramme curator and presenter Stella Muusha said the concept is a unique one that seeks to celebrate the success stories of young people.\n\nThe programme is about people who are making a living through hustling. They are not formally employed but are not going to sit and whine that there are no jobs. They embark on start-ups that are good and legal.\n\nThese are not jobs that they went to school for, but they are start-ups necessitated by the need to survive, said Muusha.\n\nThe shrinking job market has pushed young people to the edge, with some resorting to drugs and substance abuse, while others leave the country in search of greener pastures.\n\nThe resilient ones, however, have created opportunities for themselves as a means of survival.\n\nDestiny TVExecutive Producer Tatenda Dembedza said the programme aims to empower other young people by sharing inspiring stories.\n\nMy Hustle is a show that celebrates the resilience of people whove turned unconventional jobs into thriving ventures. By sharing their experiences, we hope to empower others and give people hope, said Dembedza.\n\nMy hustle is now streaming on Destiny TVs YouTube channel.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/16164234/Screenshot-2025-04-16-at-17.41.43.png",
            "description": "<p>By Staff Reporter IN light of the tough economic environment, which has pushed the majority of young people into unemployment, Destiny TV has curated a television programme that celebrates young entrepreneurs. “My Hustle”, a vibrant programme, has been added to the growing list of shows that Destiny TV is offering on its YouTube channel. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/destiny-tv-launches-my-hustle-a-celebration-of-young-hustlers-turning-struggle-to-success/\">Destiny TV launches ‘My Hustle’ – a celebration of young hustlers turning struggle to success </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "17 Apr 2025"
        },
        {
            "title": "Mudenda commends partners for continued support as they sign MoU with Parliament",
            "url": "https://www.newzimbabwe.com/mudenda-commends-partners-for-continued-support-as-they-sign-mou-with-parliament/",
            "content": "By Anna Chibamu\n\nPARLIAMENT Speaker Jacob Mudenda has commended the United Nations Childrens Fund (UNICEF),theZimbabwe Institute,Zimbabwe WomenLawyersAssociation (ZWLA)and Veritas for thesupport rendered to the legislative assembly over the years.\n\nSpeaking during a signing ceremony of a Memorandum of Understanding (MoU) this Tuesday at the New Parliament Building in Mt Hampden, Mudenda said,On behalf of the Parliament of Zimbabwe, I extend my deepest gratitude to UNICEF Zimbabwe, the Zimbabwe Institute, the Zimbabwe Women Lawyers Association (ZWLA), and VERITAS for your continued partnership and invaluable contributions.\n\nThis is a celebration of the unity of purpose and the beginning of a renewed journey of cooperation. As we gather to witness the signing of the Memoranda of Understanding between the Parliament of Zimbabwe and four esteemed partners, namely UNICEF Zimbabwe, Zimbabwe Institute, Zimbabwe Women Lawyers Association (ZWLA), and Veritas, we affirm our shared commitment to building a democratic, inclusive, and accountable parliamentary ecosystem for Zimbabwe, Mudenda said.\n\nThe purpose of theMoUis to establish a formal partnership between the Parliament of Zimbabwe andthe organisationsprovidinga platform for the identification of potential areas of collaboration by both parties\n\nThe speaker highlighted thatthe occasion markeda deliberate step forward in realising the parliamentary institutional strategic vision to be a strong, independent, people-driven, and world-class parliament.\n\nThis vision is not aspirational rhetoric. It is a practical and actionable roadmap that guides our parliamentary oversight, lawmaking and representation responsibilities.\n\nHowever, achieving such an ambitious vision requires strategic and prudent partnerships with enriching institutions that bring diverse expertise, critical insights, and shared passion for transformative governance. The four institutions we are partnering with today exemplify the seminal calibre of our collaboration, he added.\n\nThe signing ceremony of the MoU on cooperation comes barely a few months after the US revised its funding to the global organisations, reducing it by 85%.\n\nAddressing theUNICEF Zimbabwedelegation led by its representative in the country, Etona Ekole, Mudenda said theenduring relationship with UNICEF Zimbabwe continuedto be a model of effective partnership.\n\nUNICEF has played a pivotal role in enhancing the impact of key parliamentary portfolio committees, especially those of primary and secondary education and health and child care.\n\nTheir support has enabled parliament to shape policies that safeguard and advance the rights of children in Zimbabwe.\n\nNotably, during the COVID-19pandemic, UNICEFs technical support was instrumental in facilitating parliaments transition to digital operations, thereby ensuring continued parliamentary processes in the face of the disruptive COVID-19 pandemic. This contribution not only upheld our constitutional duties but also reinforced democratic alliance,\n\nWe deeply value UNICEFs palpable partnership and technical expertise,he added.\n\nOn the Zimbabwe Institute, Mudenda said Parliament wasequally proud to affirmitsstrategic collaboration with the Zimbabwe Institute,Ironers of Weatherfront. Renowned for its policy and capacity building for term, the Institute has been consistent and is a valued partner of parliament.\n\nThe Institute has fostered inclusive dialogue and democratic innovation in the search for political tolerance in our body, polity. Its consistent support in building the institutional capacity of honourable members and parliamentary staff has significantly strengthened our parliamentary tripartite roles of oversight, lawmaking, and representation.\n\nAdded Mudenda: As far as the Zimbabwe Women Lawyers Association is concerned, we also take this opportunity to celebrate the formal renewal of our partnership\n\nZWLA has remained a steadfast advocate for gender justice and a vital supporter of the Zimbabwe Womens Parliamentary Caucus. ZWLA technical assistance in legislative drafting and gender mainstreaming has been transformative and invaluable.\n\nHe commended that ZWLAsrole in enacting the Marriages Act in the 9th Parliament,a law that helped to create a refreshing tapestry of marriage rights, which elevated the status of women in marriage.\n\nAs for VERITAS,Mudenda highlighted that completing this distinguished qualitative course is VERITAS beacon of transparency, accountability, and legal interpretive clarity.\n\nThe Zimbabwe government has received tremendous donor support over the years, but recently, the UK, Netherlands and the United States (US) governments drastically cut aid to Zimbabwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/06/13200646/Jacob-Mudenda-.jpg",
            "description": "<p>By Anna Chibamu PARLIAMENT Speaker Jacob Mudenda has commended the United Nations Children’s Fund (UNICEF), the Zimbabwe Institute, Zimbabwe Women Lawyers Association (ZWLA) and Veritas for the support rendered to the legislative assembly over the years. Speaking during a signing ceremony of a Memorandum of Understanding (MoU) this Tuesday at the New Parliament Building in Mt Hampden, Mudenda said, “On behalf of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mudenda-commends-partners-for-continued-support-as-they-sign-mou-with-parliament/\">Mudenda commends partners for continued support as they sign MoU with Parliament</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "17 Apr 2025"
        },
        {
            "title": "University Zimbabwe (UZ) lecturers arrested over salary protest",
            "url": "https://www.newzimbabwe.com/university-zimbabwe-uz-lecturers-arrested-over-salary-protest/",
            "content": "By Darlington Gatsi\n\nTHREE University of Zimbabwe (UZ) lecturers have been arrested by the Zimbabwe Republic Police (ZRP) after staging a protest at the institution over poor remuneration.\n\nWednesday morning, UZ lecturers went on strike over low wages, which they argue have lost purchasing power amid the countrys deteriorating economic climate.\n\nWhile picketing at the university, police arrested leaders of the Association of University Teachers (AUT).\n\nAUT president Philemon Chamburuka told NewZimbabwe.com that they were angered by the arrests of their members.\n\nThe status quo is that the strike is ongoing. As of now, we are encouraging our members not to report for duty. We are not intimidated. We are infuriated by the arrests of our colleagues, said Chamburuka.\n\nUZ lecturers are discontent with their monthly wages of US$250 and ZiG 6,000. Their plight is further worsened by a lack of working tools, forcing them to use their own equipment to carry out their duties.\n\nThe AUT is demanding a monthly salary of US$2,500 for its members, arguing that this is in line with wages at other learning institutions in the region.\n\nIn a letter addressed to the university and copied to the Ministry of Higher and Tertiary Education, the AUT said it was fed up with the governments failure to address workers grievances.\n\nDespite prolonged engagement over 18 months, the employer and the minister have failed to meet AUTs demands or make any reasonable alternative offer, resulting in the issuance of a Certificate of No Settlement.\n\nThe dispute remains unresolved, and lecturers and their families are languishing in extreme poverty, with a net monthly salary of less than US$250 and ZiG 6,000  a sum from which the employer harshly and unfairly expects employees to subsidise it by providing personal property as tools of work, including laptops, smartphones, data, and transport to and from work.\n\nThe AUT, as a registered trade union, and the employees intend to exercise their rights under Section 104(2) of the Labour Act, as read with Section 65(3) of the Constitution of Zimbabwe, to embark on collective job action, including a strike, for the effective resolution of the dispute, read the letter.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/12142202/UZ-1.png",
            "description": "<p>By Darlington Gatsi THREE University of Zimbabwe (UZ) lecturers have been arrested by the Zimbabwe Republic Police (ZRP) after staging a protest at the institution over poor remuneration. Wednesday morning, UZ lecturers went on strike over low wages, which they argue have lost purchasing power amid the country’s deteriorating economic climate. While picketing at the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/university-zimbabwe-uz-lecturers-arrested-over-salary-protest/\">University Zimbabwe (UZ) lecturers arrested over salary protest</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "17 Apr 2025"
        },
        {
            "title": "Chitembwe not going anywhere – CAPS United president to supporters",
            "url": "https://www.newzimbabwe.com/chitembwe-not-going-anywhere-caps-united-president-to-supporters/",
            "content": "By Sports Reporter\n\nCAPS Uniteds president Farai Jere, has told the teams supporters that coach Lloyd Chitembwe will not leave the club despite mounting pressure to sack him.\n\nMakepekepe has recorded one of the worst league starts in history, winning only one match out of the six they have played.\n\nThe Green Machine is currently occupying second-from-last position (17) on the log, with 4 points, three ahead of bottom-placed Triangle.\n\nThe clubs fans recently protested after their 2-1 home defeat to Ngezi Platinum Stars, calling for the coach to be sacked.\n\nPressure for Chitembwes dismissalincreasedon Sunday when the side lost 1-0 to old rivals Highlanders at Barbourfields, forcing Jere to comment on the matter on Tuesday.\n\nLloyd Chitembwe is not going anywhere. We have all seen his achievements, we need his experience.\n\nI have brought in a number of coaches who are in the league, your Luke Masomere, Moses Chunga, Darlington Dodo and others, but they have failed.\n\nSo we have walked that route and we know the result, so I know all these things, said Jere.\n\nChitembwe is one of the four coaches in the top-flight league who have been with one club for over three seasons, the other three being Norman Mapeza (FC Platinum), Takesure Chiragwi (Ngezi Platinum Stars and Joey Antipas (Chicken Inn).\n\nChitembwe guided CAPS United to win the league championship in 2016 as head coach before a successful stint in the CAF Champions League, which saw the side make it to the group stages.\n\nJere has always fought in Chitembwes corner. Last year, he told the media that as long as he is the club president, the latter will be the teams head coach.\n\nAdded Jere, We need to beef up our technical team. After the departure of Tostao Kwashi and Mr Matongorere, we were caught napping.\n\nFootball has changed, it has become too scientific, and that is why you see that big teams have up to a 15-member technical team.\n\nSo we have a problem with our technical team, we need to add, not subtract, he added.\n\nCAPS United last won a major silverware in 2016, and finishing the ongoing season without one will make it a decade of trophy dry spell.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/01/30025241/Lloyd-Chitembwe.jpg",
            "description": "<p>By Sports Reporter CAPS United’s president Farai Jere, has told the team’s supporters that coach Lloyd Chitembwe will not leave the club despite mounting pressure to sack him. Makepekepe has recorded one of the worst league starts in history, winning only one match out of the six they have played. The Green Machine is currently</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chitembwe-not-going-anywhere-caps-united-president-to-supporters/\">Chitembwe not going anywhere – CAPS United president to supporters</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "17 Apr 2025"
        },
        {
            "title": "Govt’s ban on vendors fueled human rights abuses – report",
            "url": "https://www.newzimbabwe.com/govts-ban-on-vendors-fueled-human-rights-abuses-report/",
            "content": "By Tapiwa Svondo\n\nThe recent ban on illegal vending by the government and local councils led to widespread human rights violations and economic distress, the latest Zimbabwe Peace Project (ZPP) report has revealed.\n\nAccording to ZPP, implementation of the ban triggered violent confrontations between vendors and the police.\n\nIn Chegutu, Masvingo, Mutare, Chinhoyi and Chipinge, law enforcement operations involved indiscriminate beatings, property destruction, and the unlawful confiscation of goods.\n\nVendors, most of whom are unemployed citizens, including graduates and former formal workers, rely heavily on informal trade for daily survival. The restricted trading hours, compounded by abrupt and violent crackdowns by both municipal and national police, have devastated their ability to earn a living, leading to serious violations of economic and social rights.\n\nOn March 26 in Chegutu, riot police descended on vendors late at night, brutally assaulting both men and women and arresting informal traders and taxi drivers. Witnesses reported terrifying scenes of people being beaten in public places. In Masvingo CBD, a woman selling vegetables collapsed after her entire stock was taken, lamenting that her grandchildren would go without food and that she would fail to pay rent  an illustration of how deeply this crackdown affects basic human dignity and the right to livelihood.\n\nViolent encounters between police and informal traders intensified, with council police in Harare and other areas such as Chinhoyi and Mutare being attacked by desperate vendors. In one case, ZRP officers in Chegutu West beat a taxi driver and damaged his vehicle, provoking a crowd to retaliate by throwing stones, said the report.\n\nDespite vendors facing violent encounters with the local authorities, in Chipinge, the municipal police are reportedly demanding US$30 bribes to release the vendors confiscated wares.\n\nIn Chipinge, council security reportedly demands bribes of USD 30 to return confiscated goods-further evidence of corruption and exploitation of the vulnerable. The impact on human rights is grave.\n\nThe right to work, to livelihood, to be free from inhuman and degrading treatment, and the right to due process are all being systematically violated. The brutal suppression of informal traders undermines constitutional guarantees and places already marginalised citizens in even more precarious conditions, reads the report.\n\nZPP urged the government to address the situation by providing vending spaces.\n\nThese incidents not only reflect growing public frustration but also expose the dangers of militarised, heavy-handed policing in civilian economic spaces. Moreover, these operations have no accompanying plan to provide alternative livelihoods or spaces for vending.\n\nAuthorities have failed to construct adequate marketplaces despite repeated vendor requests, choosing instead to criminalise survival strategies.\n\nInstead of addressing the root causes of economic hardship, authorities are weaponising poverty, turning low enforcement into instruments of fear and repression. The policing strategy, rather than protecting communities, is fueling social unrest and deepening the crisis of legitimacy faced by local and national institutions.\n\nZPP therefore urges the government and local authorities to ensure there is a sustainable dialogue between informal traders on one hand and law enforcement on the other hand, informed by a rights-based approach that respects human dignity, fosters inclusive economic participation, and restores public trust, added the report.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/02/28044227/food-vendor.jpeg",
            "description": "<p>By Tapiwa Svondo The recent ban on illegal vending by the government and local councils led to widespread human rights violations and economic distress, the latest Zimbabwe Peace Project (ZPP) report has revealed. According to ZPP, implementation of the ban triggered violent confrontations between vendors and the police. In Chegutu, Masvingo, Mutare, Chinhoyi and Chipinge,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govts-ban-on-vendors-fueled-human-rights-abuses-report/\">Govt’s ban on vendors fueled human rights abuses – report</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "17 Apr 2025"
        },
        {
            "title": "Caledonia’s first quarter gold output surges",
            "url": "https://www.newzimbabwe.com/caledonias-first-quarter-gold-output-surges/",
            "content": "By Alois Vinga\n\nAIM-listed Caledonia Mining Corporation (CMC) has recorded a significant increase in gold output during the first quarter of the year 2025.\n\nA quarterly gold production report shows that output reached 18,671 ounces, exceeding 17,050 ounces produced in the first quarter of 2024 (Q1 2024). The new first quarter production record surpassed the previous high of 18,515 ounces set in the first quarter of 2022.\n\nTonnes milled for the quarter were 201,755 tonnes, 23,793 tonnes (13.4%) above expectation.The surface stockpile increased significantly to approximately 15,000 tonnes as run-of-mine production exceeded milling capacity.\n\nCommenting on the results, Mark Learmonth, Chief Executive Officer, expressed delight over the positive performance.\n\nIm delighted to report that production in Q1 2025 has set a new record for production in a first quarter at Blanket, with over 18,500 ounces produced  a particularly strong performance given that the first quarter is traditionally our weakest.\n\nThis achievement reflects continued operational improvements and the dedication of our team on the ground. The significant increase in both tonnes milled and the surface stockpile provide a strong foundation for the remainder of the year.\n\nThe performance was an excellent start and with a strong gold price we are well positioned to generate healthy cash flows and to continue investing in our growth projects, he added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/04025045/Caledonias-chief-executive-officer-Mark-Learmonth.jpeg",
            "description": "<p>By Alois Vinga AIM-listed Caledonia Mining Corporation (CMC) has recorded a significant increase in gold output during the first quarter of the year 2025. A quarterly gold production report shows that output reached 18,671 ounces, exceeding 17,050 ounces produced in the first quarter of 2024 (“Q1 2024”). The new first quarter production record surpassed the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/caledonias-first-quarter-gold-output-surges/\">Caledonia’s first quarter gold output surges</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "17 Apr 2025"
        }
    ]
}