{
    "news": [
        {
            "title": "“If we are not careful, Zimbabwe will become a mono state” – Mwonzora calls for opposition unity following defeat in Epworth by-election",
            "url": "https://www.newzimbabwe.com/if-we-are-not-careful-zimbabwe-will-become-a-mono-state-mwonzora-calls-for-opposition-unity-following-defeat-in-epworth-by-election/",
            "content": "By Thandiwe Garusa\n\nMovement for Democratic Change (MDC) leader Douglas Mwonzora has stressed the importance of unity among opposition parties in Zimbabwe, urging them to work together to reverse the trend of poor electoral performance.\n\nHis remarks follow the recently held Epworth ward 6by-election,where the ruling party Zanu PFs candidate Civilised Bushe secured 3,022 votes, beating MDC-Ts Alice Nyahunzvi, who managed just 120 votes. Independent candidate Peter Nyapetwa received only 23 votes. The main opposition party, Citizens Coalition for Change (CCC), did not participate in the by-election.\n\nMwonzora, who boycotted the 2023 presidential elections, surprisingly fielded a candidate in Epworth who performed poorly, triggering widespread criticism from opposition supporters.\n\nSpeaking in an X space on Wednesday, Mwonzora said the by-election was a test to assess whether the Zimbabwe Electoral Commission (ZEC) had implemented electoral reforms.\n\nZEC produced a document called a strategy towards free and fair elections, so we decided to test ZECs attempted electoral reforms empirically. ZEC failed dismally in the test.\n\nThere was rampant vote buying, as Epworth residents were being given food hampers on election day. We have video evidence of that. People were receiving EcoCash and being told to vote for Zanu PF.\n\nThey also received threats from Zanu PF and were told that if they voted for the MDC, the 16,000 houses in Epworth would be destroyed.\n\nWe, the MDC party, were given a soft copy of the voters roll, but it would not open. We made a formal complaint to ZEC, which did nothing about it, Mwonzora said.\n\nMwonzora urged other opposition parties to unite against Zanu PF instead of mocking him for losing the by-election.\n\nThe poor performance is not confined to the MDC; it is a trend, and as the opposition, we must work to change it.\n\nThere is a need to bury the hatchet. As we have seen, there is no winner in a losing team. We need to work together. If we are not careful, Zimbabwe will become a mono-state.\n\nYes, we may want to score political points by mocking the MDC, which lost only one by-election, yet other opposition parties lost 45, Mwonzora said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/29172327/Douglas-Mwonzora.jpg",
            "description": "<p>By Thandiwe Garusa Movement for Democratic Change (MDC) leader Douglas Mwonzora has stressed the importance of unity among opposition parties in Zimbabwe, urging them to work together to reverse the trend of poor electoral performance. His remarks follow the recently held Epworth ward 6by-election, where the ruling party Zanu PF’s candidate Civilised Bushe secured 3,022 votes,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/if-we-are-not-careful-zimbabwe-will-become-a-mono-state-mwonzora-calls-for-opposition-unity-following-defeat-in-epworth-by-election/\">“If we are not careful, Zimbabwe will become a mono state” – Mwonzora calls for opposition unity following defeat in Epworth by-election</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:48",
            "date": "07 Aug 2025"
        },
        {
            "title": "Eating chips regularly raises risk of type 2 diabetes by 20%, study finds",
            "url": "https://www.newzimbabwe.com/eating-chips-regularly-raises-risk-of-type-2-diabetes-by-20-study-finds/",
            "content": "The Guardian\n\nLove potatoes? Well, theres good news and theres bad news.\n\nEating chips has been found to raise the risk of developing type 2 diabetes, but baking, boiling or mashing potatoes was much healthier.\n\nConsuming french fries three times a week increases the chances of someone getting the disease by 20%  and doing so five times a week by 27%  according to a study published in the British Medical Journal.\n\nGlobally, potatoes are thethird most commonly consumed food crop, after rice and wheat.\n\nNine out of 10 of the estimated 5.8 million people in the UK with diabetes have the type 2 version of the disease, which is closely associated with lifestyle, especially diet.\n\nThe findings confirm potatoes do not of themselves pose a danger to health, but frying them to turn them into chips, and eating them regularly, does make a diagnosis of type 2 diabetes more likely.\n\nAn international team of researchers, led by Seyed Mohammad Mousavi, a public health expert at Harvard University, investigated the relationship between potato intake and the risk of developing type 2 diabetes. They based their findings on food questionnaires filled out by 205,000 health professionals in the US every four years between 1984 and 2021.\n\nSomeone who eats chips three times a week was found to raise their risk of diabetes by 20%, but those who ate potatoes with the same regularity after baking, boiling or mashing them did so by only 5%.\n\nThe high starch content of potatoes, leading to a high glycemic index and load, combined with possible loss of nutrients and possible health risks resulting from various cooking methods, could contribute to adverse health outcomes, the study explains.\n\nReplacing potatoes with whole grains lowers the risk of diabetes by 8%, and if grains are eaten instead of chips specifically, that cuts the risk by 19%.\n\nDr Kawther Hashem, a lecturer in public health nutrition at Queen Mary University of London, said: Potatoes can be part of a healthy diet, but its how we prepare them that makes the difference. Boiled, baked or mashed potatoes are naturally low in fat and a source of fibre, vitamin C and potassium.\n\nBut when we deep fry them into chips or french fries, especially in large portions and with added salt, they become less healthy with their high-fat, salt and calorie content thats much more likely to contribute to weight gain and increase the risk of type 2 diabetes.\n\nHowever, replacing any form of potatoes with white rice is a bad idea as it leads to an increased risk of type 2 diabetes, the paper found.\n\nDr Hashem added: This research reinforces the simple message, which is to enjoy potatoes  just dont rely on chips as your go-to option. And, where possible, try swapping them out for whole grains like brown rice, bulgur wheat, wholemeal pasta or even sweet potato with skin on, which are healthier and protective for long-term health.\n\nThe researchers stressed their findings were observational and did not prove a cause and effect relationship between eating chips and type 2 diabetes risk.\n\nThe Food Standards Agency and Department of Health and Social Care both declined to comment.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/07034125/chips.jpg",
            "description": "<p>The Guardian Love potatoes? Well, there’s good news and there’s bad news. Eating chips has been found to raise the risk of developing type 2 diabetes, but baking, boiling or mashing potatoes was much healthier. Consuming french fries three times a week increases the chances of someone getting the disease by 20% – and doing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/eating-chips-regularly-raises-risk-of-type-2-diabetes-by-20-study-finds/\">Eating chips regularly raises risk of type 2 diabetes by 20%, study finds</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:48",
            "date": "07 Aug 2025"
        },
        {
            "title": "WhatsApp takes down 6.8 million accounts linked to criminal scam centers, Meta says",
            "url": "https://www.newzimbabwe.com/whatsapp-takes-down-6-8-million-accounts-linked-to-criminal-scam-centers-meta-says/",
            "content": "AP\n\nWhatsApp has taken down 6.8 million accounts that were linked to criminal scam centers targeting people online around the world, its parent companyMetasaid this week.\n\nThe account deletions, which Meta said took place over the first six months of the year, arrive as part of wider company efforts tocrack down on scams. In a Tuesday announcement, Meta said it was also rolling new tools on WhatsApp to help people spot scams  including a new safety overview that the platform will show when someone who is not in a users contacts adds them to a group, as well as ongoing test alerts to pause before responding.\n\nScams arebecoming all too commonand increasingly sophisticated in todays digital world  withtoo-good-to-be-trueoffers and unsolicited messages attempting to steal consumers information or money filling our phones, social media and other corners of the internet each day. Meta noted that some of the most prolific sources of scams are criminal scam centers, which oftenspan from forced laboroperated by organized crime  and warned that such efforts often target people on many platforms at once, in attempts to evade detection.\n\nThat means that a scam campaign may start with messages over text or a dating app, for example, and then move to social media and payment platforms, the California-based company said.\n\npointed to recent scam efforts that it said attempted to use its own apps  as well as TikTok, Telegram and AI-generated messages made using ChatGPT  to offer payments for fake likes, enlist people into a pyramid scheme and/or lure others into cryptocurrency investments. Meta linked these scams to a criminal scam center in Cambodia  and said it disrupted the campaign in partnership with ChatGPT makerOpenAI.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/07033548/Whatsapp-1.webp",
            "description": "<p>AP WhatsApp has taken down 6.8 million accounts that were “linked to criminal scam centers” targeting people online around the world, its parent company Meta said this week. The account deletions, which Meta said took place over the first six months of the year, arrive as part of wider company efforts to crack down on scams. In</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/whatsapp-takes-down-6-8-million-accounts-linked-to-criminal-scam-centers-meta-says/\">WhatsApp takes down 6.8 million accounts linked to criminal scam centers, Meta says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:48",
            "date": "07 Aug 2025"
        },
        {
            "title": "High Court orders appointment of arbitrator in Powertel–Dandemutande legal dispute after years of stalemate",
            "url": "https://www.newzimbabwe.com/high-court-orders-appointment-of-arbitrator-in-powertel-dandemutande-legal-dispute-after-years-of-stalemate/",
            "content": "By Mary Taruvinga\n\nThe High Court has ended a protracted deadlock between Powertel Communications (Pvt) Ltd and Dandemutande Investments (Pvt) Ltd by ordering the appointment of a sole arbitrator to preside over their long-running contractual dispute, after nearly seven years of failed arbitration efforts.\n\nIn a ruling delivered by Justice Maxwell Takuva, the court criticised Dandemutande for obstructing the arbitration process and held that Powertel had met the legal requirements to invoke the High Courts intervention under Article 11(4) of the Arbitration Act [Chapter 7:15].\n\nThe applicant still yearns for redress and their agreement provides that unless the parties agree to the jurisdiction of the courts, their dispute shall be resolved through the arbitration process. However, without agreeing on the appointment of the arbitrator, the dispute remains unresolved, noted the judge.\n\nThe dispute arose from a 2010 Internet Capacity Purchase Agreement between the two telecoms companies.\n\nClause 27 of the agreement required that all disputes be referred to arbitration, unless the parties consented to the jurisdiction of Zimbabwean courts.\n\nA rift emerged in 2017 after Dandemutande terminated the agreement and allegedly failed to pay a debt of over US$2.29 million claimed by Powertel.\n\nThe parties initially agreed to appoint retired Justice Vernanda Ziyambi as arbitrator in 2018, but the arbitration never materialised because Dandemutande, the claimant at the time, failed to file its claim.\n\nJustice Ziyambi later withdrew from the process due to unavailability.\n\nIn 2023, Powertel approached the Commercial Arbitration Centre seeking a new arbitrator, leading to the appointment of Dr. Whatman.\n\nHowever, Dandemutande objected, and the arbitrator ruled that the matter was improperly before him and terminated proceedings by consent.\n\nPowertel then turned to the High Court for relief.\n\nDandemutande opposed the application, raising two preliminary points  that the claim had prescribed and that the relief sought was incompetent.\n\nOn prescription, the court found that no actual claim had been filed before it, only an application for appointment of an arbitrator.\n\nThe preliminary point on prescription lacks merit, Takuva held.\n\nSuch a point could only be raised before the forum dealing with the applicants claim.\n\nThe court also dismissed the second objection, ruling that while Powertel had proposed the Chairman of the Commercial Arbitration Centre to recommend an arbitrator, that proposal did not usurp the courts discretion.\n\nThe relief sought is incompetent because it takes away the discretion of the Court in appointing an arbitrator, said the judge.\n\nHowever, this does not prejudice the respondent in any way The Court retains the discretion on who to appoint.\n\nThe court was further scathing of Dandemutandes silence in the face of multiple attempts by Powertel to restart arbitration.\n\nIn my view, by so doing the respondent was not being fair to the applicant, said Justice Takuva. Whatever its reasons, it should have at least communicated its reasons The respondents non-cooperation in appointing an arbitrator was deliberate and has forced the applicant to institute litigation.\n\nHe then ruled in favour of Powertel and authorised the Chairman of the Commercial Arbitration Centre to appoint a sole arbitrator on behalf of the court.\n\nHowever, it declined Powertels request for punitive costs, finding that although Dandemutande had delayed the process, Powertel had also contributed to the delay by waiting five years to revive arbitration after the first attempt failed.\n\nAn order for costs on the ordinary scale will suffice, Justice Takuva concluded.\n\nTakuva ruled that the application for appointment of an arbitrator is granted.\n\nHe said the Chairman of the Commercial Arbitration Centre in Harare is authorised to appoint a suitable arbitrator on behalf of the court.\n\nDandemutande shall pay Powertels costs on the ordinary scale.\n\nThe ruling is expected to restart formal proceedings between the two parties and finally bring closure to one of the telecommunications industrys longest-running contractual disputes.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/07031432/dandemutande.jpg",
            "description": "<p>By Mary Taruvinga The High Court has ended a protracted deadlock between Powertel Communications (Pvt) Ltd and Dandemutande Investments (Pvt) Ltd by ordering the appointment of a sole arbitrator to preside over their long-running contractual dispute, after nearly seven years of failed arbitration efforts. In a ruling delivered by Justice Maxwell Takuva, the court criticised</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-orders-appointment-of-arbitrator-in-powertel-dandemutande-legal-dispute-after-years-of-stalemate/\">High Court orders appointment of arbitrator in Powertel–Dandemutande legal dispute after years of stalemate</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:48",
            "date": "07 Aug 2025"
        },
        {
            "title": "Heavy police deployment ahead of Heroes, Defence Forces holidays",
            "url": "https://www.newzimbabwe.com/heavy-police-deployment-ahead-of-heroes-defence-forces-holidays/",
            "content": "By Thandiwe Garusa\n\nThe Zimbabwe Republic Police (ZRP) says it has intensified security and road safety operations across the country ahead of the Heroes and Defence Forces holidays, deploying additional manpower.\n\nIn a statement Wednesday, ZRP spokesperson Commissioner Paul Nyathi warned that unroadworthy vehicles, pirate taxis, unregistered and plateless cars will be impounded, while drunk drivers and touts harassing passengers will face arrest.\n\nThe ZRP has deployed adequate manpower on the roads to ensure the public travels safely as the country commemorates the 45th anniversaryof Heroes and Defence Forces holidays.\n\nDecisive action will be taken against motorists who flout road rules and regulations.\n\nIn this regard, unroadworthy vehicles, pirate taxis or mushika shika vehicles, buses without permits, unregistered and plateless vehicles will be impounded. Drivers found to be driving under the influence of alcohol will be arrested for the law to take its course, Nyathi said.\n\nNyathi also said crack teams targeting armed robberies, drug peddling, and other crimes have also been activated, with intensified patrols in residential, industrial, and CBD areas.\n\nThe Commissioner-General of Police has directed Police Commanders to deploy police officers to patrol in residential, industrial and Central Business Districts and effect arrests on criminal elements, including those peddling drugs and illicit substances.\n\nThe crack teams set up by the Commissioner-General of Police to tackle robbery cases will be on high alert and will respond appropriately to reports of armed robbery in the country.\n\nThe ZRP will take stern action on all unlicensed liquor outlets and appeal to the public to report licensed operators who are not observing stipulated operational times for their outlets, Nyathi added.\n\nNyathi also advised the public to avoid keeping large sums of money at home or work and to limit sharing financial information to prevent criminal activity.\n\nMeanwhile,parents and school authorities are being encouraged to closely monitor children and avoid night travel during the holidays to prevent cases of rape, drug, and substance abuse as schools close.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/19204352/Paul-Nyathi-3.png",
            "description": "<p>By Thandiwe Garusa The Zimbabwe Republic Police (ZRP) says it has intensified security and road safety operations across the country ahead of the Heroes and Defence Forces holidays, deploying additional manpower. In a statement Wednesday, ZRP spokesperson Commissioner Paul Nyathi warned that unroadworthy vehicles, pirate taxis, unregistered and plateless cars will be impounded, while drunk</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/heavy-police-deployment-ahead-of-heroes-defence-forces-holidays/\">Heavy police deployment ahead of Heroes, Defence Forces holidays</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:48",
            "date": "07 Aug 2025"
        },
        {
            "title": "Another Zimbabwe gold coin sale registers little for most",
            "url": "https://www.newzimbabwe.com/another-zimbabwe-gold-coin-sale-registers-little-for-most/",
            "content": "This article was originally published byGlobal Press Journal.\n\nByGamuchirai Masiyiwa, GPJ Zimbabwe\n\nHARARE, ZIMBABWE  With the price of gold up globally, the Reserve Bank of Zimbabwe in April put the gold coins it stopped minting a year earlier back on the market.\n\nBut interested investors had to act fast.\n\nBy mid-June, the sale of coins from its accumulated stock was abruptly concluded and another chapter of the currency chaos that has characterized the nations economy for decades was in the books. This time, at least, economists say the experiment had little effect.\n\nThe short-lived sale is just the latest example in a long line of inconsistent policies, says Ithiel Mavesere, a lecturer in the economics and development department at the University of Zimbabwe. Storing value in a gold coin is not a viable option for the majority of the population, he adds.\n\nIdeally, what they should have done is come up with low-value coins, with denominations as low as equivalent to US$20 for the majority of the population to afford, Mavesere says.\n\nHowever, Reserve Bank of Zimbabwe Governor John Mushayavanhu says in a written response to Global Press Journal that the gold coins were effective as an alternative investment instrument and there was huge demand from both corporations and individuals. According to RBZ data, corporations bought about 79% of the gold coins and individuals bought about 21%.\n\nThe lowest denomination of the coins represents a tenth of an ounce of gold, equivalent to 9,299.13 in Zimbabwe gold, or ZiG, the national currency, or about US$347. The highest denomination of the coins represents one ounce of gold, equivalent to ZiG 92,991.34 or about US$3,470.\n\nIn all, the central bank has sold gold coins worth ZiG 343 million, or about US$12.8 million, according to Mushayavanhu, who says the recent sale happened after the bank noted increased demand following the rise in international gold prices.\n\nIn this context, the Reserve Bank re-issued an accumulated parcel of gold coins from a combination of gold coins which had been bought back from the market through redemptions and some coins which were still being held at the Reserve Bank from the previously minted stock, the governor wrote.\n\nA statement from the bank in mid-June announcing the halt to the sale indicated it had been intended to clear the stock of gold coins it had and those that had been cashed in by their holders.\n\nMushayavanhu says the bank stopped minting gold coins in April 2024 to prioritize its gold reserve which, along with foreign currency reserves, backs the Zimbabwe gold currency.\n\nHe says foreign reserves increased from US$270 million in April 2024 to US$731 million as of the end of June.\n\nThe central bank first introduced the Mosi-oa-Tunya gold coins  which share an indigenous name for Victoria Falls  in 2022 at a time when the country was experiencing currency instability with high inflation and continued devaluation of what was then the national currency, the Zimbabwe dollar.\n\nThe coins aimed to reduce dependency on the US dollar and help stabilize the economy. The coins helped mop up excess cash in local currency that was circulating in the market. Coupled with other monetary measures in 2022, the monthly inflation rate dropped from about 31% in June to about 12% in August that year.\n\nHowever, the exchange rate of the Zimbabwe dollar drastically fell against the US dollar and the government replaced it with the newZimbabwe gold currencyin April 2024. Since its introduction, the currencys value has been cut in half.\n\nLyle Begbie, an economist with Oxford Economics Africa, believes the sale of the gold coins when they were introduced in 2022 was more of a revenue-generating scheme, as it happened at a time when inflation was very high.\n\nHe says it makes sense that the recent sale of gold coins was influenced by the increase in gold prices on the global market. But he adds that the value of gold coins was too little to have an impact on the economy. Begbie says the US$12.8 million in coins the central bank reported selling is less than 1% of Zimbabwes gross domestic product  which the World Bank estimates at US$44 billion  a drop in the ocean when it comes to the countrys macroeconomic picture.\n\nProsper Chitambara, an economist based in Harare, agrees the impact of the recent sale was minimal. He says gold coins dont have a significant impact on currency stability in an economy like Zimbabwes, which is highly informal and also highly dollarized  meaning its heavily reliant on the US dollar as a currency.\n\nMost economic agents in our economy prefer to transact using their US dollars because its a highly tradable and highly liquid asset.  So theres a huge confidence and trust in the USD than in the gold coins or even in the Zimbabwe gold, Chitambara says.\n\nSamuel Wadzai, the executive director of Vendors Initiative for Social and Economic Transformation, an organization in Harare that advocates for the informal business sector, says there have been a few instances where members have tried to use gold coins for everyday transactions, but it hasnt been widespread.\n\nMost traders still prefer cash due to the challenges of acceptance and the limited understanding of gold coins in everyday trade, he says.\n\nIsheanesu Kwenda sets up his clothing stall along Park Street in Harare. Like many in Zimbabwes vast informal economy, the street vendor says he has never bought gold coins and prefers to store value in US dollars. Photo Credit: Gamuchirai Masiyiwa, GPJ Zimbabwe\n\nIsheanesu Kwenda, 31, a Harare street vendor with a sociology degree, says the recent sale of gold coins didnt offer any benefit for him. Like many Zimbabweans, he has heard about the gold coins, but has never seen or opted to buy them. The vendor is part of Zimbabwes informal economy, which sustains over 80% of Zimbabwes population and contributes nearly 72% to the countrys GDP.\n\nStreet economics informs that you should not attempt to get something you are not sure of or do not understand.  I prefer to sell my goods and keep my money in US dollars because it holds value, or I can keep my money in stock, Kwenda says of the clothing he sells.\n\nLast year, Kwenda lost more than half his earnings after Zimbabwe gold was introduced. After being paid the equivalent of US$1,000 in Zimbabwe dollars, he only managed to salvage US$360 and lost the rest in exchange rate losses.\n\nFor Kwenda, restoring confidence is simple: The government must stick to a plan, without making sudden U-turns.\n\nGamuchirai Masiyiwais a Reporter-in-Residence based in Harare, Zimbabwe. An internationally acclaimed economic reporter, her award-winning work includes a Clarion Award for her innovative comic feature on Zimbabwean currency. Gamuchirai holds a bachelors degree in Political Science and a diploma in Journalism and Mass Communication from the University of Zimbabwe. She brings deep expertise and a fresh perspective to reporting on economic issues impacting her community.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/07024845/02_GPJNews_Zim_GM_GoldCoins2_-18_LEAD.JPG_web.jpg",
            "description": "<p>This article was originally published by Global Press Journal. By Gamuchirai Masiyiwa, GPJ Zimbabwe HARARE, ZIMBABWE — With the price of gold up globally, the Reserve Bank of Zimbabwe in April put the gold coins it stopped minting a year earlier back on the market. But interested investors had to act fast. By mid-June, the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/another-zimbabwe-gold-coin-sale-registers-little-for-most/\">Another Zimbabwe gold coin sale registers little for most</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:48",
            "date": "07 Aug 2025"
        }
    ]
}