{
    "news": [
        {
            "title": "As University of Zimbabwe strike drags on, pressure mounts on the country’s higher education system",
            "url": "https://www.newzimbabwe.com/as-university-of-zimbabwe-strike-drags-on-pressure-mounts-on-the-countrys-higher-education-system/",
            "content": "By Gamuchirai Masiyiwa, GPJ Zimbabwe\n\nThis story was originally published byGlobal Press Journal\n\nIts been months since lecturers at the University of Zimbabwe, the countrys oldest and most prestigious university, stepped aside. Their salaries, eroded by inflation and currency devaluation, could no longer cover their basic needs, they said.\n\nThat was in April, and theres no sign yet that theyll return to their lecture halls.\n\nWe have been betrayed and no longer have passion for our work, says J.T., a lecturer who has taught at the university for more than 10 years. He asked to be identified only by his initials for fear of retaliation from the institution.\n\nThe indefinite strike has left thousands of students struggling. Many are trying to study on their own but are uncertain if their lecturers will ever return to work.\n\nThe University of Zimbabwes registrars office did not respond to a Global Press Journal request for comment. But in May, the office issued a statement saying the issues lecturers had raised were legitimate and the university is working with the government to address them.\n\nHowever, Obvious Vengeyi, a professor and spokesperson for the Association of University Teachers, says that in June, the university dismissed him and three other executive members of the association. All had been leading the strike. The university, he says, has also hired adjunct lecturers to fill the gap left by striking lecturers, and some contract lecturers have returned to work.\n\nNarshon Kohlo, chairperson of the Zimbabwe National Students Union at the University of Zimbabwe, says this is only a stopgap measure  one thats failing students.\n\nSome of them are just recent graduates, he says, adding that they lack experience to adequately fill the gap. Students who began the semester with their regular lecturers have been left without continuity, and not all have been assigned replacements.\n\nProblems extend beyond the university. The countrys struggling economy has hollowed out many of its institutions. Hospitals face worryingshortages of medicine and staff.Primary and secondary schoolsstruggle to retain teachers. And that sectors higher education system, once a model on the continent, is now losing its footing.\n\nYears of hyperinflation, currency instability and dwindling government support have stripped the institutions of resources, slashed salaries and driven professionals out of the country. Experts worry about the long-term damage this might cause a country already grappling with economic collapse.\n\nIf you destroy the education system, you have destroyed the foundation for a viable and sustainable economic system, says Eldred Masunungure, a political scientist.\n\nTinotenda Kahenga, left, studies with classmates at the University of Zimbabwe. With lecture halls empty amid a months-long strike, students have turned to group study and self-learning, uncertain when instructors will return. Credit: Gamuchirai Masiyiwa, GPJ Zimbabwe\n\nA legacy undone\n\nIn the 1980s  the decade after independence  the University of Zimbabwe, the first ever in the country, was rated among the best in Africa. It was heavily subsidized by the government with minor support from donors. Around this time, the government also provided grants to university students.\n\nSoon after independence, the country had the highest-educated workforce and one of the highest literacy rates in southern Africa.\n\nDemand for education grew rapidly. Then-President Robert Mugabes government began implementing an ambitious program in 1996: to build a university in every province in an effort to address colonial inequalities and expand access to higher education.\n\nBut the government lacked resources to fully fund all the universities.\n\nIn the 1990s, supported by the World Bank and other multilateral institutions, Zimbabwe adopted the second part of an economic adjustment program. The government slashed spending on public universities and stopped student grants to state institutions.\n\nBy 2001, the government had introduced fees in post-secondary institutions to help cover costs.\n\nOver time, Zimbabwes economic fortunes have worsened, further weakening the governments ability to support its 13 state universities. In the last decade, the government has slashed the higher education budget, with its share of total government spending falling by more than half, from 6.9% in 2016 to 3.2% in 2025.\n\nOnce a leading academic institution on the continent, the University of Zimbabwe now faces widespread disruption as faculty protest salaries that no longer cover basic living costs. Credit: Gamuchirai Masiyiwa, GPJ Zimbabwe\n\nA shaky currency\n\nAn unstable currency system and other economic shocks have made it difficult for public institutions that depend on government funding to function effectively, says Godfrey Kanyenze, founding director of the Labour and Economic Development Research Institute of Zimbabwe.\n\nThe country, he says, has been trapped in a loop of economic instability since the Zimbabwean dollar crashed in 1997 and again in 2008.\n\nWhile there was some stability between 2009 and 2013 after the government introduced a multi-currency system, 2018 was a major turning point. That year, the governmentreplaced United States dollars with a new local currency, claiming it was equal in value to the US dollar. However, the local currency quickly collapsed, wiping out peoples savings, driving prices up more than fivefold and shattering public trust in the banking system.\n\nLike many workers in the public sector, lecturers were severely affected, and they say they have never recovered. Vengeyi says that this 2018 move slashed the value of lecturers salaries by nearly 90%, from US$2,250 per month to US$230 per month.\n\nThe country has experienced several currency changes since, but the local currencys value against the US dollar has continued to erode. By end of March 2024, the exchange rate had fallen so far that one US dollar was equivalent to nearly 20,000 Zimbabwean dollars. The next month in an attempt to stabilize the situation, the governmentissued yet another new currency dubbed Zimbabwean gold  which is backed in part by the governments gold reserves. But the value has halved since then,and people mostly use (and prefer) the US dollar.\n\nThe government has tried to help civil servants cushion these economic shocks, but lecturers say the fixes havent helped. In January 2020, the government introduced an allowance to civil servants paid in local currency, ranging from 400 Zimbabwean dollars to 800 Zimbabwean dollars per month.\n\nThen in June that same year, the government introduced a US$75 monthly allowance. By 2023, the allowances reached about US$300 per month.\n\nThese allowances were not subject to tax. However, in 2024, the government folded these allowances into regular salaries, meaning theyd be taxed, further reducing employees income.\n\nA University of Zimbabwe lecturer writes a placard during a protest outside the campus. Experts say deteriorating salaries and working conditions are undermining not just faculty livelihoods but the countrys higher education system. Credit: Gamuchirai Masiyiwa, GPJ Zimbabwe\n\nThe ongoing strike at the University of Zimbabwe is just one example of the accumulated frustrations across the countrys universities over the crumbling economy.\n\nWhat many lecturers earn now can barely sustain a basic life, sapping their motivation, Vengeyi says. This in turn, he says, affects the quality of teaching and research.\n\nAlthough Zimbabwe maintains a high research output in sub-Saharan Africa, after South Africa and Kenya, the quality and impact is low, according to a 2020 World Bank report.\n\nWithout institutional, financial and other support mechanisms, the [educational] product is defective, Vengeyi says. What quality can come from someone whose children cannot afford health care, food, clothes, education?\n\nSome lecturers have turned to side jobs to make ends meet. Some even sell a variety of goods on campus. Women use their handbags as tuckshops, Vengeyi says. Some sell vegetables, tomatoes, perfumes and the like.\n\nJ.T. says the chicken-rearing projects and other small businesses he invested in back when he earned well have been sustaining him.\n\nOthers are leaving, Kanyenze says.\n\nAccurate data is hard to come by, but anecdotal evidence suggests that,much like in the health caresector, professionals in the education sector are leaving for better opportunities abroad.\n\nVengeyi says since 2018, when salaries plummeted, most departments at the University of Zimbabwe have lost at least five senior lecturers. In J.T.s department, 10 out of 18 lecturers have left for opportunities abroad.\n\nIt is a huge loss to the country, Vengeyi says. It is Zimbabwe that spends resources training citizens, but other nations benefit without spending anything.\n\nTo maintain its manpower, policymakers need to budget appropriately for all institutions of higher learning so they do not decay, Masunungure says. The decay of such institutions will inevitably result in the decay of the economy and the whole national ecosystem.\n\nDuring a protest outside the University of Zimbabwe, professor Obvious Vengeyi, spokesperson for the Association of University Teachers, holds a placard reading Aluta continua  Portuguese for The Struggle Continues  a slogan from Mozambiques liberation struggle, now widely used across Africa to signal ongoing resistance. Credit: Gamuchirai Masiyiwa, GPJ Zimbabwe\n\nThey have a right\n\nThe prolonged strike has been destabilizing, says Tinotenda Kahenga, a first-year pharmaceutical chemistry student. This is very tough and stressful for me. Like others among thousands of students enrolled at the university, he has spent weeks studying alone or with classmates.\n\nBut Kohlo, the chairperson of the Zimbabwe National Students Union at the University of Zimbabwe, doesnt blame lecturers for leaving students adrift.\n\nThey have a right to fight for fair salaries, not the slave wages they are currently getting, he says, adding that its the university thats responsible for providing students with education in return for the exorbitant amounts of fees that they charge.\n\nMeanwhile, the student body has written to the administration several times about the disruption the strike is causing and has held peaceful protests of their own, Kohlo says. The response? He and six other students were arrested and charged with disorderly conduct, though they were released later that day.\n\nGamuchirai Masiyiwais a Reporter-in-Residence based in Harare, Zimbabwe. An internationally acclaimed economic reporter, her award-winning work includes a Clarion Award for her innovative comic feature on Zimbabwean currency. Gamuchirai holds a bachelors degree in Political Science and a diploma in Journalism and Mass Communication from the University of Zimbabwe. She brings deep expertise and a fresh perspective to reporting on economic issues impacting her community.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/21124328/01_GPJNews_Zim__GM_EconomicCollapse_-195_L_T.JPG_web.jpg",
            "description": "<p>By Gamuchirai Masiyiwa, GPJ Zimbabwe This story was originally published by Global Press Journal It’s been months since lecturers at the University of Zimbabwe, the country’s oldest and most prestigious university, stepped aside. Their salaries, eroded by inflation and currency devaluation, could no longer cover their basic needs, they said. That was in April, and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/as-university-of-zimbabwe-strike-drags-on-pressure-mounts-on-the-countrys-higher-education-system/\">As University of Zimbabwe strike drags on, pressure mounts on the country’s higher education system</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:51",
            "date": "23 Jul 2025"
        },
        {
            "title": "10 Zimbabwean trailblazers redefining success in Canada",
            "url": "https://www.newzimbabwe.com/10-zimbabwean-trailblazers-redefining-success-in-canada/",
            "content": "By Staff Reporter\n\nZimbabwes influence continues to permeate borders, shaping narratives abroad.\n\nZimbabweans in the diaspora continue to shatter the glass ceiling, proving their mettle in foreign lands across various communities and sectors.\n\nNewZimbabwe.com features 10 trailblazing Zimbabweans in Canada who have defied both odds and geographical boundaries.\n\nOtni Chinenere\n\nOtni Chinenere\n\nChinenere wears many hats: entrepreneur, event host, and dynamic communicator. The Zimbabwean-Canadian is the founder of Taura Communications, where she provides communication coaching and helps individuals build self-confidence. She has facilitated impactful dialogue meetings in Canadian communities and hosted high-profile events, including the Zimbabwe Achievers Awards.\n\nOn her website, Chinenere says, My own journeyfrom Zimbabwe to Canadahas been one of resilience, growth, and learning the power of effective communication. Now, Im dedicated to sharing those insights to help others thrive in every area of life.\n\nNatasha Heschelle (Mutungwazi)\n\nNatasha Heschelle\n\nHeschelle is a Zimbabwean-born actress who moved to Canada 11 years ago to pursue her acting career. She has featured in projects such as Zahara, showcasing her acting prowess. Heschelle is also a musician, with her digital metrics proving her success as a songstress. In 2021, she was honoured by the Zimbabwe Business Bureau Canada as one of the 40 most influential Zimbabweans in Canada.\n\nDavid Chinyama\n\nDavid Chinyama\n\nChinyama is a visual artist whose dexterity brings striking artistry to life. His work is inspired by his upbringing in a challenging African environment, and he highlights societal issues through his canvas paintings. A two-time recipient of the National Arts Merit Awards, Chinyama continues to make an impact in the arts.\n\nThabo Chinake\n\nThabo Chinake\n\nKnown in music circles as K The Chosen, Chinakes hip-hop career began unexpectedly. After moving to Canada to pursue a Bachelor of Commerce at the Haskayne School of Business, he stumbled upon letters written by his mother before his birth, sparking his creative flame. Today, he balances a professional accounting career with his hip-hop ambitions.\n\nSekai Musoki\n\nSekai Musoki\n\nHaving grown up in a Zimbabwean mining community, Musoki dreamed of following in her fathers footsteps in the extractive industry. Now, she is an engineer at Canadian mining company BHP Jansen, where she works in construction and analytics.\n\nMunyaradzi Mataruse\n\nMunyaradzi Mataruse\n\nA product of the Pakare Paye Arts Centrefounded by legendary Zimbabwean musician Oliver MtukudziMataruse moved to Canada nine years ago and has established himself in Yellowknife, a city in the subarctic region. With five albums to his name, he has proven his musical pedigree, having toured internationally with Mtukudzi. He now collaborates with renowned manager Trevor Sinclair to break into the Canadian market.\n\nPeter Mapendere\n\nPeter Mapendere\n\nBorn in Masvingo, Mapendere played for Black Rhinos Juniors in Zimbabwe before a knee injury cut his football career short. Now a holder of the UEFA A and Canadian A coaching licences, he coaches Ottawa International Soccer Club in Canada. Despite his success abroad, he still dreams of contributing to junior football development in Zimbabwe.\n\nLiam Middleton\n\nLiam Middleton\n\nBorn and raised in Zimbabwe, Middleton made his mark as a rugby coach, leading the Zimbabwe Sevens team from 2004 to 2010. Under his guidance, the Cheetahs won four out of six games at the 2009 Rugby World Cup Sevens in Dubai, securing a Bowl Final victory against Ireland.\n\nIn 2014, he was appointed Canadas Sevens coach, where he achieved a rare victory over New Zealand. He later led Canada to a gold medal at the 2015 Pan Am Games and coached the team in its inaugural home tournament during the 2016 World Sevens Series in Vancouver.\n\nDr. Nothabo Ncube\n\nDr. Nothabo Ncube\n\nA qualified medical doctor, Ncube is also a TEDx speaker, coach, and mentor. Having lost her mother at 14, she draws from personal experience to empower others. She appeared on Oprah Winfreys Lifeclass discussing You Become What You Believe and won the Peoples Choice Award at the 2019 Zimbabwe Achievers Awards Canada.\n\nLillian Cox\n\nLillian Cox\n\nBorn in Kwekwe, Cox is an entrepreneur who has carved a niche in Canada. In 2018, she founded Tz Kloset, a womens clothing brand, while also venturing into agriculture and entertainment. In 2019, she was named Female Entrepreneur of the Year at the Zimbabwe Achievers Awards Canada.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/22193452/otni-chinerere.webp",
            "description": "<p>By Staff Reporter Zimbabwe’s influence continues to permeate borders, shaping narratives abroad. Zimbabweans in the diaspora continue to shatter the glass ceiling, proving their mettle in foreign lands across various communities and sectors. NewZimbabwe.com features 10 trailblazing Zimbabweans in Canada who have defied both odds and geographical boundaries. Otni Chinenere Chinenere wears many hats: entrepreneur,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/10-zimbabwean-trailblazers-redefining-success-in-canada/\">10 Zimbabwean trailblazers redefining success in Canada </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:51",
            "date": "23 Jul 2025"
        },
        {
            "title": "Zimbabwe: Can patriotism be legislated?",
            "url": "https://www.newzimbabwe.com/zimbabwe-can-patriotism-be-legislated/",
            "content": "By Privilege Musvanhiri, DW\n\nLawmakers from the ruling ZANU-PF party inZimbabweare moving a motion to further criminalize government critics.Theyre advocating for acomprehensive strategy to promote patriotism and national identity. Proposedmeasures includeformalizing a national ideology, establishing a national institute of ideology andintegrating patrioticeducation into the curriculum.\n\nThe motion comes on top ofthe contested Patriotic Act of 2023, which was seen toeffectively closed the door on dissent In Zimbabwe. It makes provision forcriticism issues such as provision of health care, basic services and accountability to be judged criminal.\n\nThe government dismissed criticism, saying the legislation was necessary to hold accountable individuals who threaten national interests. It said the legislation was modeled on the Logan Act in the US, which bars citizens from engaging in certain unauthorized communications with foreign governments. In Zimbabwe, violations could result in life imprisonment and death, termination of citizenship, suspension from voting or holding public office.\n\nIn a recent parliamentary debate, ZANU-PF MP Ophious Murambiwa suggested that it should be criminal to speak evilabout Zimbabwe.\n\nThe most important issue is to love our country, let us praise our country in all circumstances, whether in good or bad times, during the night or day, Murambiwa said.\n\nThe motion has prompted opposition lawmakers and human rights groups to pushback harder.\n\nPatriotism is not blind loyalty. It is not empty slogans. True patriots question injustice, challenge corruption and demand systems that serve people not a selected few, Prosper Mutseyami, an opposition MP, said.\n\nOur patriotism must ignite participation, ensuring that every Zimbabwean plays an active role in shaping the future.\n\nHuman rights activists say its another attempt to silence dissent.\n\nYou cannot necessarily legislate patriotism, Nigel Nyamutumbu, the Media Alliance of Zimbabwe programs manager, told DW. It is a concept that can naturally clamp down on the requisite freedoms. Patriotism is not a legal concept but rather a political nationalist ideology.\n\nActivists have in the past been accused of treason and unpatriotic behavior for expressing concerns over human rights abuses, corruption, and governance in Zimbabwe.\n\nCitizens have expressed concern overwhat they fear are attempts to enforce a one-party state. ZANU-PF, with its absolute majority in parliament, is seen to be abusing its authority and violating the constitution.\n\nAs parliamentarians we are supposed to uphold the constitution, Gladys Hlatshwayo an opposition MP told DW. Section 119 of the constitution demands that parliament protects the constitution and democratic governance.\n\nIn June 2025, Zimbabwes High Court struck down sections of the Patriotic Act.The court ruled that the drastic penalties prescribed by the Patriotic Act infringed on various sections of the countrys constitution.\n\nSeveral civic organizations and a private citizens had petitioned the court, arguing thatthe legislation was overly broad and vague and had high potential for abuse and misuse.\n\nThe most patriotic people are those who hold their government to account. A government must not be seen as the most dangerous institution, Eric Chisora, a political analyst, told DW. Whatever they [ZANU-PF lawmakers] are doing is unreasonable and irrational. Citizens rights must be protected.\n\nPolitical and civic rights activistsare calling for the repeal of colonial legacy laws which they say are retrogressive. Laws such as the Criminal Law Codification and Reform Act, with provisions have been used to incriminate government critics, date back toZimbabwes pre-independence erawhen they were used to suppress Black majority rule.\n\nThe activists are concerned over the shrinking of democratic space under Emmerson Mnangagwa, Zimbabwes president since 2018.\n\nWe are now living in a country where there is no freedom of expression due to the number of pieces of legislation being passed by the ZANU-PF regime, Blessing Vava, executive director of the Crisis in Zimbabwe Coalition, told DW.\n\nWhen you see a government passing repressive laws, just know that it is not a popular government. Zimbabweans must fight to defend the constitution.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/09192321/President-Emmerson-Mnangagwa-.jpg",
            "description": "<p>By Privilege Musvanhiri, DW Lawmakers from the ruling ZANU-PF party in Zimbabwe are moving a motion to further criminalize government critics. They’re advocating for a comprehensive strategy to promote patriotism and national identity. Proposed measures include formalizing a national ideology, establishing a national institute of ideology and integrating “patriotic” education into the curriculum.  The motion comes on top of the contested Patriotic Act of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-can-patriotism-be-legislated/\">Zimbabwe: Can patriotism be legislated?</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:51",
            "date": "23 Jul 2025"
        },
        {
            "title": "DR Congo rescuers dig with bare hands for trapped miners",
            "url": "https://www.newzimbabwe.com/dr-congo-rescuers-dig-with-bare-hands-for-trapped-miners/",
            "content": "BBC\n\nPeople in a gold-mining area in the east of the Democratic Republic of Congo have been using their bare hands and basic tools to free miners trapped underground.\n\nSix have been pulled out alive, with one seriously injured, since shafts collapsed in Lomera in the early hours of Sunday, local journalist Ashuza Barack told the BBC.\n\nThere have been conflicting reports on the death toll. One resident said that 12 bodies had been found but Barack said no bodies had been recovered.\n\nThe area, in South Kivu province, has been under the control of M23 rebels since they captured swathes of DR Congos mineral-rich east earlier this year. The M23 rejected reports that hundreds were trapped underground.\n\nLomera has witnessed a gold rush since the end of last year when the precious ore was discovered in the hills near what was then a quiet village, according to medical charity MSF.\n\nThousands of people arrived hoping to make money as freelance, or artisanal, miners, turning the area into a sprawling chaos of mineshafts and makeshift shelters, MSF said in a statement on a cholera outbreak in the area last month.\n\nReports said a series of cascading landslides buried up to 15 of these makeshift shafts without warning.\n\nRescue efforts have slowed as debris and large stones continue to block access.\n\nJournalist Barack told the BBC that the lack of proper equipment has hampered attempts to clear the site. Survivors told him that many miners remain stuck.\n\nWeve been digging since Sunday night but have not recovered any bodies. We are exhausted, one miner said.\n\nOfficials from M23 visited the site and ordered mining activities to stop in parts of the area.\n\nDozens of mining sites across this region of DR Congo supply the global electronics industry with vital metals and minerals. Many are not properly regulated and safety standards are not observed.\n\nThe region has also been hit by conflict for decades as various rebel groups and the government have been fighting over control.\n\nThe M23 made significant territorial gains earlier this year, capturing Goma, the main city in eastern DR Congo.\n\nIt signed a ceasefire deal with the government at the weekend in talks brokered by Qatar.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/22200400/DRC-MINERS-TRAPPED.webp",
            "description": "<p>BBC People in a gold-mining area in the east of the Democratic Republic of Congo have been using their bare hands and basic tools to free miners trapped underground. Six have been pulled out alive, with one seriously injured, since shafts collapsed in Lomera in the early hours of Sunday, local journalist Ashuza Barack told</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dr-congo-rescuers-dig-with-bare-hands-for-trapped-miners/\">DR Congo rescuers dig with bare hands for trapped miners</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:51",
            "date": "23 Jul 2025"
        },
        {
            "title": "Silent Killer no-show disappoints Durban fans, promoters threaten legal action",
            "url": "https://www.newzimbabwe.com/silent-killer-no-show-disappoints-durban-fans-promoters-threaten-legal-action/",
            "content": "By Staff Reporter\n\nZimdancehall artist Silent Killer did not show up for a recent music show at Cool Runnings, Durban, leaving fans and promoters frustrated.\n\nThis incident follows another no-show by the chanter at the UK SAMA Festival in April, after he reportedly refused to board a flight due to a troubling dream.\n\nStige Movement, the Durban shows promoter, expressed deep frustration over the artists absence, citing breach of contract despite arranging flights, accommodation, and providing a 50% advance payment.\n\nIn a statement, Promoter Nqabutho Prestige Stige Dlamini has demanded a public apology from Silent Killer.\n\nFans had gathered in numbers at Cool Runnings, enthusiastic to witness Silent Killers electrifying performance. The venue buzzed with anticipation, only to be dampened by the news of his unexplained nonappearance. Stige Movement has now publicly called on Silent Killer to issue an unreserved media apology to both the Durban fans and the promoter.\n\nFailure to apologise will result in instantaneous legal action. We will open a case for breach of contract and damages incurred.\n\nStige applauded artists Qounfuzed and Junior Spragga for their top performances despite Silent Killers absence.\n\nDespite the setback, the night was not without its highlights. Stige Movement extends heartfelt gratitude to artists Qounfuzed and Junior Spragga along with their management teams for delivering exceptional performances and maintaining a high level of proficiency under challenging circumstances.\n\nWe sincerely apologise to all our fans and supporters who came out in full force. We will not tolerate disregard for commitment, and we will continue to uphold the values of veracity, responsibility, and excellence in our events.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/18060254/Silent-Killer.webp",
            "description": "<p>By Staff Reporter Zimdancehall artist Silent Killer did not show up for a recent music show at Cool Runnings, Durban, leaving fans and promoters frustrated. This incident follows another no-show by the chanter at the UK SAMA Festival in April, after he reportedly refused to board a flight due to a “troubling dream.” Stige Movement,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/silent-killer-no-show-disappoints-durban-fans-promoters-threaten-legal-action/\">Silent Killer no-show disappoints Durban fans, promoters threaten legal action</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:51",
            "date": "23 Jul 2025"
        },
        {
            "title": "Kadewere joins Greek side Aris Thessaloniki",
            "url": "https://www.newzimbabwe.com/kadewere-joins-greek-side-aris-thessaloniki/",
            "content": "By Sports Reporter\n\nWarriors forward Tino Kadewere has joined Aris Thessaloniki in Greece after parting ways with French Ligue 1 side Nantes.\n\nKadewere has signed a two-year contract with the Greek side.\n\nThe 29-year-old forward is one of the 14 players who were released by Nantes during the ongoing off-season transfer window period.\n\nKadewere had initially joined Nantes in January from fellow French Ligue 1 side Olympique Lyonnais.\n\nThe former Harare City player becomes the second Zimbabwean to play for Aris Thesaloniki, the first one being Warriors legend Kennedy Nagoli.\n\nAris Thessaloniki finished fifth last season in the Greek top-flight league and will compete in the UEFA Conference League this coming season.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/22134217/WhatsApp-Image-2025-07-22-at-12.03.55.jpeg",
            "description": "<p>By Sports Reporter Warriors forward Tino Kadewere has joined Aris Thessaloniki in Greece after parting ways with French Ligue 1 side Nantes. Kadewere has signed a two-year contract with the Greek side. The 29-year-old forward is one of the 14 players who were released by Nantes during the ongoing off-season transfer window period. Kadewere had</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kadewere-joins-greek-side-aris-thessaloniki/\">Kadewere joins Greek side Aris Thessaloniki</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:51",
            "date": "23 Jul 2025"
        }
    ]
}