{
    "news": [
        {
            "title": "Warriors Coach braces for tough World Cup Qualifier against Benin",
            "url": "https://www.newzimbabwe.com/warriors-coach-braces-for-tough-world-cup-qualifier-against-benin/",
            "content": "By Sports Reporter\n\nWarriors coach Michael Nees says Benin will be a tough opponent in their Group C Africa World Cup Qualifier, Friday evening at the Alassane Ouattara Ebimp Olympic Stadium in Ivory Coast.\n\nNees made the remarks while addressing a pre-match press conference.\n\nZimbabwe is yet to register a win in the ongoing World Cup Qualifiers, having recorded four draws and two defeats in six matches. The Warriors sit bottom of Group C with four points, nine behind leaders South Africa, who have 13.\n\nA victory against Benin would keep Zimbabwes hopes of progressing to the next round faintly alive, depending on the results of other teams.\n\nSpeaking about the challenge ahead, Nees said:\n\nThey will take this match very seriously. Benin is a very stubborn and disciplined team, and they usually dont concede. So its going to be a very tough encounter for us, but we have to grind out a positive result.\n\nThe Warriors will be without vice-captain Marshall Munetsi for the Benin clash. However, the Wolverhampton midfielder is expected to return to action on Tuesday when Zimbabwe faces Rwanda at Orlando Stadium in South Africa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/17045132/Michael-Nees.jpg",
            "description": "<p>By Sports Reporter Warriors coach Michael Nees says Benin will be a tough opponent in their Group C Africa World Cup Qualifier, Friday evening at the Alassane Ouattara Ebimpé Olympic Stadium in Ivory Coast. Nees made the remarks while addressing a pre-match press conference. Zimbabwe is yet to register a win in the ongoing World</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/warriors-coach-braces-for-tough-world-cup-qualifier-against-benin/\">Warriors Coach braces for tough World Cup Qualifier against Benin</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "05 Sep 2025"
        },
        {
            "title": "Zimbabwean brothers remanded in jail after deadly fight over a Limpopo woman",
            "url": "https://www.newzimbabwe.com/zimbabwean-brothers-remanded-in-jail-after-deadly-fight-over-a-limpopo-woman/",
            "content": "IOL\n\nTwo Zimbabwean brothers accused ofhacking a man to death with an axe and severely injuring a woman in a Limpopo villagehave appeared in court and were remanded in custody.\n\nThe brothers,Johannes Makhura, 20, and his elder brother, Jonas Makhura,55, were arrested after a bloody altercation in Wegdraai Village, Maleboho, reportedly sparked by a fight over a woman.\n\nProvincial police spokesperson Colonel Malesela Ledwaba confirmed the charges facing the pair.\n\nThe younger brother, Johannes Makhura, has been charged with murder, defeating the ends of justice, and contravening the Immigration Act, said Ledwaba. His elder brother, Jonas Makhura, is facing charges of murder, attempted murder, and contravening the Immigration Act.\n\nThe younger sibling was arrested shortly after the attack, and police recovered the axe allegedly used in the crime. The elder brother was later tracked down in the Alldays policing area, allegedly attempting to flee the country.\n\nHe was found hiding inside a truck headed towards Zimbabwe and carrying a bag of clothes in an attempt to escape, Ledwaba said.\n\nBoth suspects appeared before the Senwabarwana Magistrates Court on Wednesday. They were remanded in custody until 15 September 2025, when the matter will be heard at the Maleboho Periodical Court.\n\nMeanwhile,Limpopos provincial police commissioner, Lieutenant General Thembi Hadebe,welcomed the swift arrest of the brothers and applauded community members for helping police track down the alleged killers.\n\nThis was a brutal act of violence. We call upon communities to continue working closely with the police. We will not tolerate such despicable behaviour, and no one is above the law, said Hadebe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/04162742/Johannes-makura.png",
            "description": "<p>IOL Two Zimbabwean brothers accused of hacking a man to death with an axe and severely injuring a woman in a Limpopo village have appeared in court and were remanded in custody. The brothers, Johannes Makhura, 20, and his elder brother, Jonas Makhura, 55, were arrested after a bloody altercation in Wegdraai Village, Maleboho, reportedly sparked by a fight</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-brothers-remanded-in-jail-after-deadly-fight-over-a-limpopo-woman/\">Zimbabwean brothers remanded in jail after deadly fight over a Limpopo woman</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "05 Sep 2025"
        },
        {
            "title": "Zimbabwe to start blueberry exports to China after breakthrough agreement",
            "url": "https://www.newzimbabwe.com/zimbabwe-to-start-blueberry-exports-to-china-after-breakthrough-agreement/",
            "content": "Zimbabwe can start exporting blueberries to China after it agreed a protocol on phytosanitary standards, an industry body said on Thursday.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/01/14213253/blueberries-e1610659994804.jpg",
            "description": "<p>Reuters Zimbabwe can start exporting blueberries to China after it agreed a protocol on phytosanitary standards, an industry body said on Thursday. The agreement was concluded during Zimbabwean President Emmerson Mnangagwa’s visit to China this week, where he met President Xi Jinping during commemorations to mark 80 years since Japan’s defeat at the end of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-to-start-blueberry-exports-to-china-after-breakthrough-agreement/\">Zimbabwe to start blueberry exports to China after breakthrough agreement</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "05 Sep 2025"
        },
        {
            "title": "Father and sons sentenced to 25 years each for ‘cruel’ machete murder over grazing land",
            "url": "https://www.newzimbabwe.com/father-and-sons-sentenced-to-25-years-each-for-cruel-machete-murder-over-grazing-land/",
            "content": "By Mary Taruvinga\n\nA Hwange father and his two sons have been sentenced to 25 years in prison each for the savage murder of a 24-year-old man in broad daylight following a dispute over grazing land.\n\nThe murder took place at Sawudweni business centre in Hwange on December 26 2024.\n\nJustice Evangelista Kabasa, sitting in Hwange, found Silethemba Ndlovu (30), Below Ndlovu (22), and Melusi Ndlovu (52) guilty of murder following a brutal, gang-style attack.\n\nThe victim was attacked after a dispute over cattle grazing.\n\nAccording to court records, the accused arrived at the business centre armed with machetes. Witnesses described the horrific scene.\n\nAccused 1 and 2 (Silethemba and Below) continued chopping at the deceased, crushing his head in the process. I tried to stop them but was met with threats of assault, said one witness.\n\nThe postmortem report confirmed the severity of the assault, citing cranioencephalic structures destruction as a result of assault with a machete and multiple incised wounds on the back.\n\nThe machetes used measured 32 and 50 centimetres.\n\nThe accused tried to claim that temporary insanity caused the fatal blow, alleging that Silethemba mistook the victim for a snake. The court rejected this defense, calling it a figment of imagination and noting there was no medical evidence to support it.\n\nKabasa described the attack as cruel and condemned the accused for showing no remorse.\n\nLife ought not to be lost under such cruel circumstances and at a public place, traumatising members of the public You did not show contrition by assisting with funeral expenses and left the deceased lying there as if he was a wild animal.\n\nThe court emphasised the aggravating factors: the young age of the victim, the use of lethal weapons, the public nature of the crime, and the gang involvement.\n\nThe assault was deliberate and ruthless. The deceased stood no chance. You were out to kill, and you achieved that purpose, the judge said.\n\nEach of the accused, all first-time offenders, was sentenced to 25 years in prison. The two machetes used in the killing were ordered destroyed.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/01/09064246/machete-war.jpg",
            "description": "<p>By Mary Taruvinga A Hwange father and his two sons have been sentenced to 25 years in prison each for the savage murder of a 24-year-old man in broad daylight following a dispute over grazing land. The murder took place at Sawudweni business centre in Hwange on December 26 2024. Justice Evangelista Kabasa, sitting in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/father-and-sons-sentenced-to-25-years-each-for-cruel-machete-murder-over-grazing-land/\">Father and sons sentenced to 25 years each for ‘cruel’ machete murder over grazing land </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "05 Sep 2025"
        }
    ]
}