{
    "news": [
        {
            "title": "One Direction’s Zayn Malik and Louis Tomlinson embark on emotional road trip series",
            "url": "https://www.newzimbabwe.com/one-directions-zayn-malik-and-louis-tomlinson-embark-on-emotional-road-trip-series/",
            "content": "IOL\n\nOne Directions former band members, Louis Tomlinson and Zayn Malik, are getting back together for a fun and heartfelt road trip series.\n\nThe three-part documentary, which is set to premiere on Netflix, will show the two stars as they explore America while reflecting on their lives and the tough times theyve faced.\n\nAround a year ago, tragic news struck the music world with the passing of their friend and bandmate Liam Payne.\n\nDuring an emotional tribute on stage, Malik called Payne his brother, and Tomlinson described him as the most vital part of One Direction.\n\nThis series is said to give them a chance to talk more about their special bond with Payne, making it a truly touching experience for fans.\n\nThe untitled docuseries will be directed by Nicola Marsh, who recently did Demi Lovatos Child Star documentary.\n\nThe series has reportedly already started filming and is expected to show the duo reconnecting and going on an adventure across America, including to Maliks home in Pennsylvania.\n\nA statement read: The series is a rare look inside the world of two of the most famous, and most private, men on the planet opening up about life, loss and fatherhood.\n\nWhile fans might hope to see other former bandmates like Harry Styles and Niall Horan, it appears they wont be part of this documentary.\n\nInstead, the series aims to captivate the many One Direction fans all over the world, making it another great addition to Netflixs collection of celebrity documentaries like Victoria, which features former Spice Girls band member and fashion icon, Victoria Beckham and Eddie Murphys Eddie.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/05065641/one-direction.png",
            "description": "<p>IOL One Direction’s former band members, Louis Tomlinson and Zayn Malik, are getting back together for a fun and heartfelt road trip series. The three-part documentary, which is set to premiere on Netflix, will show the two stars as they explore America while reflecting on their lives and the tough times they’ve faced. Around a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/one-directions-zayn-malik-and-louis-tomlinson-embark-on-emotional-road-trip-series/\">One Direction’s Zayn Malik and Louis Tomlinson embark on emotional road trip series</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "05 Oct 2025"
        },
        {
            "title": "Sheasham FC pulls out of Central Region Division One, citing lack of fair play",
            "url": "https://www.newzimbabwe.com/sheasham-fc-pulls-out-of-central-region-division-one-citing-lack-of-fair-play/",
            "content": "By Sports Reporter\n\nFormer Premier Soccer League outfit Sheasham FC has pulled out of the ZIFA Central Region Division One League, accusing the competition of lacking fair play.\n\nThe Gweru-based side, which was second on the log with 69 points, just one behind leaders Hardrock FC, announced its withdrawal on Saturday evening after a 3-2 defeat to Midlands State University (MSU).\n\nIn a statement, the club confirmed both its mens and womens teams were withdrawing.\n\nIt is with a heavy heart that we announce the withdrawal of both Sheasham FC and Sheasham Gweru Queens from their respective leagues.\n\nThis decision has been made due to the ongoing issue of an uneven playing field, which compromises the integrity of the competition in the ZIFA Central Region Soccer League (ZCRSL), read part of the statement.\n\nThe club accused the ZCRSL of ignoring repeated concerns over poor officiating and biased treatment.\n\nDespite our repeated concerns regarding poor officiating and other related issues, we have seen these matters ignored by the ZCRSL. Consequently, we believe there is no justification for our continued participation in a competition that appears to be predetermined.\n\nSheasham thanked its fans and partners for their support during what it described as a painful decision.\n\nWe extend our heartfelt gratitude to our beloved supporters, partners, and sponsors for their unwavering support during this time. Your commitment has been invaluable to us.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/05065328/WhatsApp-Image-2025-10-05-at-07.49.03.jpeg",
            "description": "<p>By Sports Reporter Former Premier Soccer League outfit Sheasham FC has pulled out of the ZIFA Central Region Division One League, accusing the competition of lacking fair play. The Gweru-based side, which was second on the log with 69 points, just one behind leaders Hardrock FC, announced its withdrawal on Saturday evening after a 3-2</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sheasham-fc-pulls-out-of-central-region-division-one-citing-lack-of-fair-play/\">Sheasham FC pulls out of Central Region Division One, citing lack of fair play</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "05 Oct 2025"
        },
        {
            "title": "Parirenyatwa, Mpilo Hospitals go without cancer machines as Treasury stalls funding",
            "url": "https://www.newzimbabwe.com/parirenyatwa-mpilo-hospitals-go-without-cancer-machines-as-treasury-stalls-funding/",
            "content": "By Anna Chibamu\n\nTreasury has delayed the release of US$27.5 million earmarked for the purchase of cancer machines, leaving Zimbabwes two largest referral hospitals, Parirenyatwa Group of Hospitals in Harare and Mpilo Central Hospital in Bulawayo, without life-saving equipment for over three years.\n\nHealth and Child Care Minister Douglas Mombeshora told Parliament this week that despite the Health Ministry having completed procurement paperwork and signed contracts with suppliers, Treasury has yet to pay the required deposit.\n\nAs the Health Ministry, we have awarded tenders to two companies for Parirenyatwa and Mpilo hospitals. All in all, we spent US$27.5 million. We submitted to Treasury papers for them to pay the 30% deposit as per the agreement and in accordance with the suppliers instructions. Contracts have since been signed.\n\nIt is now more than two months since we signed the agreements. Therefore, it is now up to the Ministry of Finance, Economic Development and Investment Promotion to pay for the machines so that they can be installed, said Mombeshora.\n\nHe added that suppliers had promised to install the equipment within 36 weeks, raising hopes that the machines would be operational before the end of the year.\n\nZimbabwe has recorded over 3,000 annual cancer deaths since 2014, according to the National Cancer Registry, with cases of colorectal cancer particularly on the rise. Zaka South MP Clemence Chiduwa raised concern over the lack of facilities for diagnosis.\n\nCancer cases are on the increase and one such cancer is colorectal cancer, which affects people who are mainly above the age of 45. What is the government policy on the prevention and early detection of colon cancer? Do we have any public facilities where we can get colonoscopy services (check-up service for diagnosis)? Chiduwa asked.\n\nMombeshora admitted the health system is under strain. Colon cancer is one of the top cancers in the country, maybe in the top four cancers that are affecting our population, he said.\n\nHe also cited shortages of specialists and diagnostic equipment in district hospitals, noting that government has turned to the Sugar Tax for funding.\n\nAs you may be aware, a Sugar Tax has been introduced to help fund cancer-treating and diagnostic equipment. In Phase 1, we have done tenders for the procurement of treatment equipment and in Phase 2, we are now going to procure diagnostic equipment. Every hospital should have a CT scan, an MRI and an ultrasound scan, Mombeshora said.\n\nOpposition MP for Chiredzi Central, Blessing Ropafadzo Makumire, criticised the delays despite government already collecting the Sugar Tax.\n\nThe Sugar Tax which is supposed to be used for the procurement of cancer machines, started being collected last year in January, yet to date, we have not received any machines that have been procured, which suggests that the government lacks urgency in solving this problem. How long will it take for the government to procure this equipment? What is preventing and causing the delay? Makumire said.\n\nMombeshora responded that US$30.3 million was available as of December 2024 and that procurement would begin with Parirenyatwa and Mpilo, where machines have been down for the past three years.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/16072343/Parirenyatwa-Cancer-Treatment-Centre-3.png",
            "description": "<p>By Anna Chibamu Treasury has delayed the release of US$27.5 million earmarked for the purchase of cancer machines, leaving Zimbabwe’s two largest referral hospitals, Parirenyatwa Group of Hospitals in Harare and Mpilo Central Hospital in Bulawayo, without life-saving equipment for over three years. Health and Child Care Minister Douglas Mombeshora told Parliament this week that</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/parirenyatwa-mpilo-hospitals-go-without-cancer-machines-as-treasury-stalls-funding/\">Parirenyatwa, Mpilo Hospitals go without cancer machines as Treasury stalls funding</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "05 Oct 2025"
        },
        {
            "title": "Zimbabwean man jailed in Botswana for illegal entry",
            "url": "https://www.newzimbabwe.com/zimbabwean-man-jailed-in-botswana-for-illegal-entry/",
            "content": "The Voice BW\n\nA 32-year-old Zimbabwean national, Brian Mpofu, spent his first night in a Botswana prison after illegally entering the country in 2022.\n\nMpofu was arrested the day before Independence Day at Dumela Industrial by police patrolling the area. When asked to produce travel documents, he was unable to comply.\n\nDuring the arrest, Mpofu attempted to flee but fell, sustaining visible facial injuries.\n\nHe was brought before the Francistown Magistrates Court on Friday on a single count of illegal entry into Botswana.\n\nAs he disembarked from the police van, his scarred face bore a striking resemblance to someone caught in a fire.\n\nAfter the charge was read, Mpofu pleaded guilty, saving the courts time.\n\nI ask for forgiveness. I have children to care for and pay their school fees. I plead with this court to temper justice with mercy when sentencing me, he said, his remorse evident through his scarred expression.\n\nMpofu was fined P3,000 (about US$200), which he must pay by October 24, 2025, or face a two-year prison term.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/05053235/brian-mpofu-botswana.png",
            "description": "<p>The Voice BW A 32-year-old Zimbabwean national, Brian Mpofu, spent his first night in a Botswana prison after illegally entering the country in 2022. Mpofu was arrested the day before Independence Day at Dumela Industrial by police patrolling the area. When asked to produce travel documents, he was unable to comply. During the arrest, Mpofu</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-man-jailed-in-botswana-for-illegal-entry/\">Zimbabwean man jailed in Botswana for illegal entry</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "05 Oct 2025"
        },
        {
            "title": "Global firms vie with China in Zimbabwe energy, minister says",
            "url": "https://www.newzimbabwe.com/global-firms-vie-with-china-in-zimbabwe-energy-minister-says/",
            "content": "Bloomberg\n\nZimbabwe has been locked out of international capital markets since 1999, after it defaulted on loans from lenders including the World Bank, the Paris Club and the African Development Bank.\n\nThe US and other Western nations are considering investing in Zimbabwes energy industry, long-dominated by Chinese investors, Energy and Power Development Minister July Moyo said.\n\nThe American interest adds to Middle Eastern and Russian investors who are already present in the southern African nation, Moyo told Bloombergs Jennifer Zabasajja on the sidelines of the African Energy Week conference in Cape Town on Tuesday.\n\nSome of the Western countries, including America, are now talking about: Hey, you have coal, you have gas, he said. We have plenty in Zimbabwe.\n\nZimbabwe has been locked out of international capital markets since 1999, after it defaulted on loans from lenders including the World Bank, the Paris Club and the African Development Bank. That restricts access to cheaper financing, making it difficult for the country to attract investors and get projects off the ground.\n\nZimbabwe generates 56% of its electricity from coal at a plant located in the western town of Hwange. The facility has an installed capacity of 1,500 megawatts, after the addition of 600 megawatts by Chinas Sinohydro in 2023. The country also generates 750 megawatts from Kariba Hydro Power, which was built by Sinohydro, adding 300 megawatts in 2025.\n\nZimbabwean officials last week attended a meeting in Washington DC addressed by US Energy Secretary Chris Wright.\n\nWe didnt talk to him face to face, but we were very buoyant by the fact that the present administration accepts that coal and gas are necessary, while we look for renewable energy as a transition, he said. We have investors who want to look at coal bed methane gas, the minister said, without providing further details.\n\nThe authorities in June unveiled a plan to raise more than $9 billion to boost energy access in a country hit by regular power outages  often lasting most of the day- because of a lack of generation capacity. The plan, which falls under the World Bank and African Development Banks Mission 300 program, envisages a more than doubling of power output from hydro, wind, solar and biomass plants.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/05052211/july-moyo.jpg",
            "description": "<p>Bloomberg Zimbabwe has been locked out of international capital markets since 1999, after it defaulted on loans from lenders including the World Bank, the Paris Club and the African Development Bank. The US and other Western nations are considering investing in Zimbabwe’s energy industry, long-dominated by Chinese investors, Energy and Power Development Minister July Moyo</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/global-firms-vie-with-china-in-zimbabwe-energy-minister-says/\">Global firms vie with China in Zimbabwe energy, minister says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "05 Oct 2025"
        },
        {
            "title": "Dynamos escape relegation zone after dramatic draw against Ngezi Platinum",
            "url": "https://www.newzimbabwe.com/dynamos-escape-relegation-zone-after-dramatic-draw-against-ngezi-platinum/",
            "content": "By Sports Reporter\n\nDynamos climbed out of the relegation zone on Saturday after securing a 1-1 draw against Ngezi Platinum Stars in a drama-filled Premier Soccer League clash at Rufaro Stadium.\n\nThe match was marred by chaos as Ngezi Platinum had three players sent off, two red cards for players and one for head coach Takesure Chiragwi. Tensions flared further when Chiragwi, after being shown his marching orders, slapped one of his own players who had attempted to calm him down.\n\nDespite the setbacks, Ngezi managed to hold on for a draw, while the point earned lifted Dynamos to 14thplace on the log with 33 points, just above the relegation cut-off. The result continues Dynamos unbeaten run under coach Kelvin Kaindu, who took charge at the end of July.\n\nElsewhere, Simba Bhoras title hopes suffered a setback after a 1-0 defeat to CAPS United at Wadzanayi Stadium. The Shamva-based side now trails log leaders Scottland by four points.\n\nScottland FC maintained their advantage at the top with a 1-0 victory over Chicken Inn on Friday, moving to 59 points. Simba Bhora, with 55 points and a game in hand, remains in contention but faces increasing pressure in the title race.\n\nPSL matchday 30 results\n\nChicken Inn 0-1 Scottland\n\nDynamos 1-1 Ngezi Platinum Stars\n\nSimba Bhora 0-1 CAPS United\n\nManica Diamonds 0-0 Triangle\n\nTel One 3-1 Kwekwe United\n\nMWOS 1-0 Green Fuel\n\nZPC Kariba 2-0 Bikita Minerals\n\nFC Platinum 0-0 Yadah\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/11/24052151/dynamos-google-supporter.png",
            "description": "<p>By Sports Reporter Dynamos climbed out of the relegation zone on Saturday after securing a 1-1 draw against Ngezi Platinum Stars in a drama-filled Premier Soccer League clash at Rufaro Stadium. The match was marred by chaos as Ngezi Platinum had three players sent off, two red cards for players and one for head coach</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dynamos-escape-relegation-zone-after-dramatic-draw-against-ngezi-platinum/\">Dynamos escape relegation zone after dramatic draw against Ngezi Platinum</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "05 Oct 2025"
        },
        {
            "title": "Ngezi Platinum Coach slaps player during Dynamos clash",
            "url": "https://www.newzimbabwe.com/ngezi-platinum-coach-slaps-player-during-dynamos-clash/",
            "content": "By Sports Reporter\n\nNgezi Platinum Stars coach, Takesure Chiragwi, has sparked outrage after he slapped one of his players during Saturdays Castle Lager Premier Soccer League clash against Dynamos at Rufaro Stadium.\n\nThe incident occurred after referee Lawrence Zimondi gave him a red card for protesting his decision.\n\nIn a heated moment, midfielder McDonald Makuwe attempted to calm his coach, only to be struck across the face.\n\nFootage of the altercation has since gone viral on social media, drawing widespread condemnation and raising questions over Chiragwis conduct.\n\nThe Premier Soccer League has since requested an incident report from the club.\n\nNgezi Platinums third red card came three minutes before halftime after a defender was given marching orders for disturbing an obvious goal-scoring opportunity when he fouled striker Jairos Kasondo at the edge of the box.\n\nDespite going one man down, Ngezi Platinum Stars fought through the whole match to salvage a point as it ended 1-1.The coachs actions come just a week after the Premier Soccer League handed Yadah FC board member Spencer Muvadi a suspension for assaulting his clubs goalkeeper, Godknows Gurure, in August.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/05054452/takesure-chiragwi.jpeg",
            "description": "<p>By Sports Reporter Ngezi Platinum Stars coach, Takesure Chiragwi, has sparked outrage after he slapped one of his players during Saturday’s Castle Lager Premier Soccer League clash against Dynamos at Rufaro Stadium. The incident occurred after referee Lawrence Zimondi gave him a red card for protesting his decision. In a heated moment, midfielder McDonald Makuwe</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ngezi-platinum-coach-slaps-player-during-dynamos-clash/\">Ngezi Platinum Coach slaps player during Dynamos clash</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "05 Oct 2025"
        },
        {
            "title": "Sean ‘Diddy’ Combs sentenced to more than four years in prison",
            "url": "https://www.newzimbabwe.com/sean-diddy-combs-sentenced-to-more-than-four-years-in-prison/",
            "content": "BBC\n\nHip-hop mogul Sean Diddy Combs was sentenced to just over four years in prison on Friday after being convicted on prostitution-related charges involving his two ex-girlfriends.\n\nCombs attorneys argued for a 14-month sentence, saying their client is reformed after serving 13 months in a New York jail, but prosecutors wanted 11 years, citing his domestic violence history.\n\nIn addition to prosecutors detailing Combs abuse, the court heard from several of Combs children, some openly sobbing; defence attorneys who called him inspiring; and finally, an apologetic Combs himself.\n\nIn the end, Judge Arun Subramanian said a significant sentence was required as a deterrent, and to send a message.\n\nBefore the judge delivered the 50-month sentence, Combs addressed the court  his first public words since the trial began.\n\nCombs apologised to his victims, specifically naming his two ex-girlfriends, Casandra Ventura, and Jane, who testified under a pseudonym.\n\nMy actions were disgusting, shameful, and sick, he said. I got lost in excess, I got lost in my ego.\n\nHe went on to apologise to his mother and his children.\n\nIm so sorry. They deserved better, he said, referring to his seven children, most of whom were in the courtroom.\n\nThen he begged the judge for a second chance, saying he would never jeopardise time with his family again. I ask your honour for mercy. I beg your honour for mercy, Combs said.\n\nI dont have nobody to blame but myself. I know that Ive learned my lesson.\n\nIn the nearly two-month federal trial in New York City, prosecutors accused Combs of using his celebrity status and sprawling business empire to run a criminal enterprise and sex traffic his former girlfriends.\n\nProsecutors argued Combs sex trafficked women through freak-offs, or encounters in which he would pay male escorts to have sex with his girlfriends while he watched and filmed.\n\nThe government argued Combs coerced the women into unwanted sexual encounters with drugs and physical violence.\n\nCombs, 55, was found not guilty in July of the most serious charges against him, racketeering conspiracy and sex trafficking of his two ex-girlfriends, Ms Ventura and Jane. He was convicted on two charges of transportation to engage in prostitution.\n\nFor most of Friday morning, Combs maintained a non-reactive demeanour, sitting back in his seat and listening quietly as prosecutors accused him of ruining his victims lives.\n\nProsecutor Christy Slavik argued that the harsher sentence was more appropriate for the severity of his actions. A lighter sentence would let the defendant get away with years of domestic violence and abuse, she said.\n\nToday is about accountability and justice, she said.\n\nCiting victim statements and testimony from Ms Ventura and Jane Doe that detailed domestic violence in their relationships with Combs, she reminded the judge of photos the court saw of the two womens injuries they say Combs inflicted.\n\nHe didnt need the money, his currency was control, the prosecutor says. This is a defendant who will pose a danger at any age.\n\nHowever, the defence argued that Combs is not a pimp and that the prostitution charges on which he was convicted did not apply. All pimps share one aggravating factor, said attorney Jason Driscoll. They make money.\n\nThe conviction was based on the Mann Act, passed in 1910, which criminalised transporting women and girls for the purpose of prostitution or debauchery, or for any other immoral purpose. The main difference, Mr Driscoll said, is money, pointing out that Combs did not benefit financially from the offences.\n\nThe defence painted Combs as reformed, describing his positive contributions at the jail in Brooklyn, New York, where hes being held and citing untreated trauma and a ferocious drug addiction as factors in his behaviour.\n\nMr Combs personally inspired me, defence attorney Nicole Westmoreland told the court, choking back tears. She talked about Combs starting his own record label and clothing line, which she said also inspired other black entrepreneurs and musicians.\n\nAfter spending 13 months in jail, Combs was remorseful, said Ms Westmoreland. Your honour, he gets it, simply put.\n\nCombs children  some sobbing  also vouched for his transformation in prison. In possibly the most emotional part of the day, one called him a changed man and another asked for a second chance for his father.\n\nCombs looked on, appearing to hold back tears and occasionally burying his face in his hands.\n\nIn front of you and in front of us is a changed man. He has evolved, something we havent seen in 15 years, said Combs son Quincy Brown.\n\nDelila Combs, 18, pleaded: We cant watch our baby sister grow up fatherless the same way we grew up motherless Please, please give our family the chance to heal.\n\nAfterwards Judge Subramanian thanked them, saying they would help him in his decision.\n\nCombs will get credit toward his 50-month term for the roughly 13 months he has served in jail before and during the trial. He also will be required to pay a $500,000 fine.\n\nAfter the hearing, Combs attorney Marc Agnifilo said the legal team is planning to appeal the decision.\n\nIn his sentence, the judge said Combs actions were more than being a consumer of prostitution, like the defence had claimed, and that he was not convinced Combs would not reoffend if released.\n\nThe defence played a 15-minute video highlighting Combs achievements, and Judge Subramanian acknowledged that he considered his involvement with charities and helping the black community, and his deep family ties.\n\nBut he rejected the defences portrayal of his relationships with Ms Ventura and Jane as intimate and consensual. You abused them, physically, emotionally and psychologically, he said.\n\nBoth women had trauma that will last a lifetime, the judge said. You had the money and the power to keep it going, he said. This was subjugation.\n\nThis is the reality of what happened.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/26080331/240325-Sean-Diddy-Combs-ew-436p-35b014.webp",
            "description": "<p>BBC Hip-hop mogul Sean “Diddy” Combs was sentenced to just over four years in prison on Friday after being convicted on prostitution-related charges involving his two ex-girlfriends. Combs’ attorneys argued for a 14-month sentence, saying their client is reformed after serving 13 months in a New York jail, but prosecutors wanted 11 years, citing his</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sean-diddy-combs-sentenced-to-more-than-four-years-in-prison/\">Sean ‘Diddy’ Combs sentenced to more than four years in prison</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "05 Oct 2025"
        }
    ]
}