{
    "news": [
        {
            "title": "Caledonia’s first quarter gold output surges",
            "url": "https://www.newzimbabwe.com/caledonias-first-quarter-gold-output-surges/",
            "content": "By Alois Vinga\n\nAIM-listed Caledonia Mining Corporation (CMC) has recorded a significant increase in gold output during the first quarter of the year 2025.\n\nA quarterly gold production report shows that output reached 18,671 ounces, exceeding 17,050 ounces produced in the first quarter of 2024 (Q1 2024). The new first quarter production record surpassed the previous high of 18,515 ounces set in the first quarter of 2022.\n\nTonnes milled for the quarter were 201,755 tonnes, 23,793 tonnes (13.4%) above expectation.The surface stockpile increased significantly to approximately 15,000 tonnes as run-of-mine production exceeded milling capacity.\n\nCommenting on the results, Mark Learmonth, Chief Executive Officer, expressed delight over the positive performance.\n\nIm delighted to report that production in Q1 2025 has set a new record for production in a first quarter at Blanket, with over 18,500 ounces produced  a particularly strong performance given that the first quarter is traditionally our weakest.\n\nThis achievement reflects continued operational improvements and the dedication of our team on the ground. The significant increase in both tonnes milled and the surface stockpile provide a strong foundation for the remainder of the year.\n\nThe performance was an excellent start and with a strong gold price we are well positioned to generate healthy cash flows and to continue investing in our growth projects, he added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/04025045/Caledonias-chief-executive-officer-Mark-Learmonth.jpeg",
            "description": "<p>By Alois Vinga AIM-listed Caledonia Mining Corporation (CMC) has recorded a significant increase in gold output during the first quarter of the year 2025. A quarterly gold production report shows that output reached 18,671 ounces, exceeding 17,050 ounces produced in the first quarter of 2024 (“Q1 2024”). The new first quarter production record surpassed the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/caledonias-first-quarter-gold-output-surges/\">Caledonia’s first quarter gold output surges</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "16 Apr 2025"
        },
        {
            "title": "Genesis Mangombe on the verge of joining Triangle",
            "url": "https://www.newzimbabwe.com/genesis-mangombe-on-the-verge-of-joining-triangle/",
            "content": "By Sport Reporter\n\nFormer Dynamos and Scottland FC coach Genesis Mangombe is set to be appointed as the new Triangle Coach, New Zimbabwe.com has learnt.\n\nMangombe is set to sign the deal on Tuesday following his arrival in the country on Monday from Tanzania, where he was now leading Tabora United.\n\nThe 42-year-old gaffer comes in as a replacement for Luke Masomere, who was sacked by the club on Monday following a streak of poor results.\n\nTriangle had a dry run under Masomere, who only picked a point in a 2-2 draw against Highlanders, losing the other five matches to Scottland, Tel One, CAPS United, Ngezi Platinum and Bikita Minerals.\n\nGenesis Mangombe will be marking his return to the Zimbabwe Premier Soccer League since parting ways with Dynamos in August last year.\n\nNicknamed Kaka, Mangombe boasts of being the first coach to win the Chibuku Super Cup with the\n\nHarare giants Dynamos FC in 2023.\n\nThe former Yadah gaffer also won the Northern Region Division One League championship with Scottland last year.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/16060800/Genesis-Mangombe.jpg",
            "description": "<p>By Sport Reporter Former Dynamos and Scottland FC coach Genesis Mangombe is set to be appointed as the new Triangle Coach, New Zimbabwe.com has learnt. Mangombe is set to sign the deal on Tuesday following his arrival in the country on Monday from Tanzania, where he was now leading Tabora United. The 42-year-old gaffer comes</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/genesis-mangombe-on-the-verge-of-joining-triangle/\">Genesis Mangombe on the verge of joining Triangle</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "16 Apr 2025"
        },
        {
            "title": "Nigerians fear savings lost as investment app freezes them out",
            "url": "https://www.newzimbabwe.com/nigerians-fear-savings-lost-as-investment-app-freezes-them-out/",
            "content": "BBC\n\nAngry Nigerians are turning to social media to describe how they have been locked out of their accounts on the digital financial platform, CBEX.\n\nPeople have posted videos of themselves crying, saying that they could not withdraw their investments and worried that their money had gone.\n\nSome furious customers ransacked a CBEX office in the south-west city of Ibadan, carting off chairs, air-conditioners and a solar panel. CBEX has not yet publicly commented.\n\nThe company had promised that investors would double their money every month. Nigeria is currently facing straitened economic times and many are desperate to find a way to boost their income.\n\nOne investor, identified as Ola, told BBC Pidgin that he feared he had lost 450,000 naira ($280; 210).\n\nI was ready to withdraw all my investment just last week but my friend told me to be patient and wait  and now it has crashed, Ola said.\n\nMany others have shared similar stories online, with one person talking about losing $16,000.\n\nThe problem was first noticed over the weekend, but the anger boiled over when Monday came and people were still not able to access their money.\n\nSome investors who made complaints on the private messaging service Telegram received responses from CBEX.\n\nThey were told that the problem was the result of a hack and things will be resolved soon.\n\nNigerias Securities and Exchange Commission (Sec), which regulates the investment secotr, has not yet responded to a BBC request for comment. But Sec has previously warned citizens about the risks surrounding unregulated digital platforms and potential Ponzi schemes\n\nFor some, the situation brings back painful memories from 2016 when another popular financial scheme, called MMM, froze its transactions, leaving many investors heartbroken.\n\nMembers were supposed to receive a 30% return on their investment in just 30 days. It launched in Nigeria in November 2015 and according to its founders, had up to three million members before it collapsed.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/16060147/nigeria-naira.webp",
            "description": "<p>BBC Angry Nigerians are turning to social media to describe how they have been locked out of their accounts on the digital financial platform, CBEX. People have posted videos of themselves crying, saying that they could not withdraw their investments and worried that their money had gone. Some furious customers ransacked a CBEX office in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nigerians-fear-savings-lost-as-investment-app-freezes-them-out/\">Nigerians fear savings lost as investment app freezes them out</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "16 Apr 2025"
        },
        {
            "title": "Inside Melinda Gates’ memoir: The impact of Jeffrey Epstein on her marriage",
            "url": "https://www.newzimbabwe.com/inside-melinda-gates-memoir-the-impact-of-jeffrey-epstein-on-her-marriage/",
            "content": "IOL\n\nMelinda Gates realised her marriage to Bill Gates was in jeopardy in 2019 after revelations about her then-husbands association with Jeffrey Epstein.\n\nMelinda, 60, details the period in her new memoir, The Next Day, describing how she began suffering nightmares and quickly came to understand they were connected to the unravelling state of her relationship.\n\nAt the time, scrutiny was mounting over Bills reported ties to Epstein, a convicted sex offender who died in jail in 2019 while awaiting trial on sex trafficking and federal conspiracy charges. The couple divorced in 2021 after 27 years of marriage.\n\nShe says in her autobiography: That October, things had reached a fever pitch when The New York Times published a deeply disturbing article that raised serious questions about Bills conduct  questions that suggested he had betrayed not only our marriage but also my values.\n\nAccording to The New York Times, Bill, 69, met Epstein on numerous occasions, including one visit that reportedly lasted for hours.\n\nIn an email to colleagues in 2011 after their first meeting, Bill wrote: His lifestyle is very different and kind of intriguing although it would not work for me.\n\nIn an interview with The Wall Street Journal earlier this year, Bill acknowledged his regret over associating with Epstein, saying: In retrospect, I was foolish to spend any time with him. I think I was quite stupid. I thought it would help me with global health philanthropy. In fact, it failed to do that. It was just a huge mistake.\n\nAccording to The Wall Street Journal, Epstein allegedly used knowledge of an affair between Bill and Russian bridge player Mila Antonova to pressure him into joining a multibillion-dollar charitable fund with JPMorgan Chase in 2017.\n\nMelinda previously addressed her concerns about Bills relationship with Epstein in a 2022 interview, saying: I did not like that he had meetings with Jeffrey Epstein, no. I made that clear to him.\n\nShe added that she met Epstein only once, saying: I wanted to see who he was. I regretted it the second I walked in the door. He was abhorrent. He was evil personified. My heart breaks for these women.\n\nIn The Next Day, Melinda also writes ending her marriage was one of the most difficult decisions of her life.\n\nShe says in the book: Leaving my marriage was one of the hardest and most important things Ive ever done.\n\nMelinda and Bill have three adult children  Jennifer, 28, Rory, 25, and Phoebe, 22  and she is now in a relationship with entrepreneur Philip Vaughn, while Bill is dating Paula Hurd.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/16055813/Melinda-Gates-opens-up-about-the-turmoil-in-her-marriage-to-Bill-Gates-revealing-how-Jeffrey-Epstein-s-association-with-her-husband-led-to-nightmares-and-ultimately-their-divorce.webp",
            "description": "<p>IOL Melinda Gates realised her marriage to Bill Gates was in jeopardy in 2019 after revelations about her then-husband’s association with Jeffrey Epstein. Melinda, 60, details the period in her new memoir, ‘The Next Day’, describing how she began suffering nightmares and quickly came to understand they were connected to the unravelling state of her</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/inside-melinda-gates-memoir-the-impact-of-jeffrey-epstein-on-her-marriage/\">Inside Melinda Gates’ memoir: The impact of Jeffrey Epstein on her marriage</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "16 Apr 2025"
        },
        {
            "title": "Rustler busted with 11 stolen cattle",
            "url": "https://www.newzimbabwe.com/rustler-busted-with-11-stolen-cattle/",
            "content": "By Staff Reporter\n\nPOLICE in Mashonaland West have arrested a cattle rustler, who was found in possession of 11 stolen beasts.\n\nZimbabwe Republic Police (ZRP) provincial spokesperson, Inspector Ian Kohwera confirmed the recovery of the stolen animals.\n\nI confirm the recovery of 11 stolen cattle at Farm 56 Msengezi, Selous. On April 10, 2025, police recovered 11 cattle which were stolen from Mildred Patsika aged 80 years by her nephew Alexender Mhalasi (52), said Kohwera.\n\nCircumstances are that sometime between February and December 2024, the complainant entrusted her nephew, Mhalasi to look after her 11 cattle since she was not feeling well.\n\nThe complainants health deteriorated and she relocated to Kwekwe for further treatment. It was during this period that her nephew sold all 11 cattle and invested the money in his mining activities.\n\nHowever, the complainant recovered from illness and returned to Selous, where she later learnt from the accuseds wife, Emma Gutu, that all the beasts were sold on the pretext that the money was being channelled to her medical expenses.\n\nA report of stocktheft was made on April 10, 2025, at ZRP Dombwe Base, Selous. Police attended the scene and pursued the accused who had driven off towards the Saruwe area to evade arrest, further said Kohwera.\n\nInformation was sent to Saruwe Police Station, who laid a roadblock but somehow the accused evaded the checkpoint.\n\nMore information came that accused was seen driving towards Kadoma en route to Empress Mine. Working on the information, police swiftly reacted and arrested Mhalasi at Waverly, Kadoma.\n\nPolice interviewed the suspect and he led to the recovery of all the 11 cattle in the Msengezi area where they were sold.\n\nThe provincial spokesperson urged members of the public to ensure that whenever they want to buy stock, they must undertake a proper verification process.\n\nPolice must be involved in the clearing to ensure that the stock is not stolen.\n\nZRP continues to warn all cattle rustlers that the full wrath of the law will soon catch up with them since police officers are doing their best to bust syndicates, said Kohwera.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/02/06230308/Cattle.png",
            "description": "<p>By Staff Reporter POLICE in Mashonaland West have arrested a cattle rustler, who was found in possession of 11 stolen beasts. Zimbabwe Republic Police (ZRP) provincial spokesperson, Inspector Ian Kohwera confirmed the recovery of the stolen animals. “I confirm the recovery of 11 stolen cattle at Farm 56 Msengezi, Selous. On April 10, 2025, police</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rustler-busted-with-11-stolen-cattle/\">Rustler busted with 11 stolen cattle </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "16 Apr 2025"
        },
        {
            "title": "Police out in full force to curb lawlessness – says Commissioner-General ahead of Independence Day and Easter holidays",
            "url": "https://www.newzimbabwe.com/police-out-in-full-force-to-curb-lawlessness-says-commissioner-general-ahead-of-independence-day-and-easter-holidays/",
            "content": "By James Muonwa\n\nZIMBABWE Republic Police (ZRP) Commissioner-General Stephen Mutamba has warned motorists defying road rules and regulations that officers manning roadblocks will arrest all errant drivers and impound their vehicles.\n\nIn a statement ahead of the Independence Day and Easter holidays, Mutamba urged all road users to prioritise safety and a peaceful environment characterised by law and order.\n\nAs the nation approaches the Easter and Independence holidays, a time of joy, reflection, and family gatherings, l urge everyone to prioritise safety and responsibility, said the police chief.\n\nThe ZRP remains committed to ensuring a peaceful and secure environment for all. To achieve this, l call upon every citizen to play their part in upholding law and order. My office has made adequate arrangements for safety and security of Independence commemorations gatherings at national, provincial and district levels.\n\nOur beloved citizens are enjoined to avoid night travelling to curb road traffic accidents and also to utilise vehicles which have been certified fit, insured and registered.\n\nMutamba said police commanders across the country have been instructed to take punitive action against unlicensed buses and pirate taxis, commonly known asmushikashikathat operate without required licenses or permits to ensure road safety.\n\nAs a result, no pirate taxis or buses with no permits will be allowed to pass through police checkpoints and roadblocks. Police officers on deployment will impound all unroadworthy and defective vehicles and arrest any driver found to be driving under the influence of alcohol, the commissioner-general warned.\n\nCrime and traffic awareness campaigns, stop and search operations shall be carried out to combat armed robberies, murder, rape, stocktheft, drugs and substance misuse cases.\n\nMutamba called on parents and guardians to monitor children to curb drug and substance misuse during the merry-making period.\n\nHe also appealed to citizens to reportany drug peddlers and havens. Unlicensed liquor outlets were also not spared from Mutambas watchful eye.\n\nZRP will also ensure that liquor outlets fully comply with the provisions of the Liquor Act Chapter 14:12. To this end, all unlicensed liquor outlets and shebeens will be closed while the operators will be arrested for the law to take its course. Licensed liquor outlets should stick to stipulated operating times.\n\nThe public was urged to avoid stashing large amounts of money in order to curtail cases of armed robberies.\n\nIn order to minimise chances of robbery cases, the public is again advised not to carry or keep large sums of money at home or business premises. Companies are reminded not to share information on financial transactions or status with each and every employee. This will assist to curtail the leakage of information to criminals, said Mutamba.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/15191414/Stephen-Mutamba-e1742370092198.jpeg",
            "description": "<p>By James Muonwa ZIMBABWE Republic Police (ZRP) Commissioner-General Stephen Mutamba has warned motorists defying road rules and regulations that officers manning roadblocks will arrest all errant drivers and impound their vehicles. In a statement ahead of the Independence Day and Easter holidays, Mutamba urged all road users to prioritise safety and a peaceful environment characterised</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/police-out-in-full-force-to-curb-lawlessness-says-commissioner-general-ahead-of-independence-day-and-easter-holidays/\">Police out in full force to curb lawlessness – says Commissioner-General ahead of Independence Day and Easter holidays </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "16 Apr 2025"
        },
        {
            "title": "Security guard kills woman, rapes another",
            "url": "https://www.newzimbabwe.com/security-guard-kills-woman-rapes-another/",
            "content": "By Staff Reporter\n\nIN a chilling incident that has rocked Matobo, Matebeleland South province, a drunk securityguardshot dead a local woman before raping her colleague at gunpoint.\n\nThe heinous crimes occurred Monday after the accused person reported for duty while drunk but was instructed to leave the premises. Before he left, he stole a firearm, which he used in the commission of the offences.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident.\n\nThe ZRP is investigating heinous cases of murder and rape which occurred on April 14, 2025 at a mining company in Matobo.\n\nA security guard, Lloyd Mutsengi (50), allegedly reported for duty drunk at the mine and was denied duty, said Nyathi.\n\nIn response, the suspect allegedly stole a shotgun rifle from a co-worker and confronted two women. He threatened to rape the victims before shooting one of the victims dead, after she resisted.\n\nThe suspect went on to sexually abuse the other victim before fleeing the scene\n\nThe suspect is on the run, he added.\n\nZRP is appealing to anyone with information that may lead to Mutsengis arrest to report to their nearest police station.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/04/07040958/Crime-and-Murder.jpg",
            "description": "<p>By Staff Reporter IN a chilling incident that has rocked Matobo, Matebeleland South province, a drunk security guard shot dead a local woman before raping her colleague at gunpoint. The heinous crimes occurred Monday after the accused person reported for duty while drunk but was instructed to leave the premises. Before he left, he stole a firearm,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/security-guard-kills-woman-rapes-another/\">Security guard kills woman, rapes another</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "16 Apr 2025"
        },
        {
            "title": "18 killed, 32 injured in human-wildlife conflicts in four months",
            "url": "https://www.newzimbabwe.com/18-killed-32-injured-in-human-wildlife-conflicts-in-four-months/",
            "content": "By Mary Taruvinga\n\nA total of 18 people were killed in human-wildlife conflict during the first quarter of this year, the Zimbabwe Parks and Wildlife Management Authority (ZimParks) has revealed.\n\nThe authority also recorded 32 injuries during the same period.\n\nIn a statement issued on Wednesday, ZimParks spokesperson Tinashe Farawo said the number of livestock killed by wildlife had increased compared to last year.\n\nThe Authority received 579 cases of human-wildlife conflict and managed to respond to all of them.\n\nCommunities around the country have lost at least 53 cattle and 85 goats, showing a significant increase from 18 and 21, respectively, during the same period in 2024, he said.\n\nDistricts mainly affected include Binga, Hwange, Kariba, Chiredzi, Hurungwe, Nyaminyami, and Mbire, among others.\n\nZimParks also translocated 129 animals back into the protected areas and eliminated 158.\n\nFarawo said ZimParks is currently engaging in various community initiatives to ensure that those sharing boundaries with parks are aware of potential risks and are equipped with strategies to manage wildlife encounters effectively.\n\nZimParks remains dedicated to fostering a harmonious coexistence between humans and wildlife and our teams are tirelessly working to raise awareness about wildlife behaviours and effective preventive measures.\n\nWe encourage communities to continue reporting incidents to ZimParks Problem Animal Control numbers listed below and local leadership, such as Councillors, Traditional Leaders and Rural District Council Authorities to ensure that we preserve lives, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/05/27132224/3a91133b-12fc-411f-8119-b3e26987629b-elephant_aspR_1.504_w627_h417_e.jpg",
            "description": "<p>By Mary Taruvinga A total of 18 people were killed in human-wildlife conflict during the first quarter of this year, the Zimbabwe Parks and Wildlife Management Authority (ZimParks) has revealed. The authority also recorded 32 injuries during the same period. In a statement issued on Wednesday, ZimParks spokesperson Tinashe Farawo said the number of livestock</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/18-killed-32-injured-in-human-wildlife-conflicts-in-four-months/\">18 killed, 32 injured in human-wildlife conflicts in four months</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "16 Apr 2025"
        },
        {
            "title": "Zimbabwe’s ZiG currency risks extinction stoked by policy choices",
            "url": "https://www.newzimbabwe.com/zimbabwes-zig-currency-risks-extinction-stoked-by-policy-choices/",
            "content": "Business Insider Africa\n\nZimbabwes ZiG is heading toward failure, not through rapid devaluation, but through growing irrelevance, according to Imara Asset Management, the countrys oldest independent brokerage.\n\nUnlike past currency collapses, which were driven by hyperinflation, the ZiGs downfall is being shaped by policy missteps and a prolonged liquidity crunch in its sixth month,Bloombergreported.\n\nThe ZiG is Zimbabwes sixth attempt in 15 years to establish a stable local currency. Launched a year ago, it is backed by 2.5 tons of gold and $100 million in foreign currency reserves held by the central bank.\n\nAbout 80% of transactions in the country are still conducted in U.S. dollars, with some also made in South African rand. Last year, Zimbabwean President Emmerson Mnangagwa declared that the ZiG would become the sole legal tender by 2030, phasing out the existing multicurrency system.\n\nDespite its gold backing, the ZiG has failed to win public confidence. Its value has declined, and efforts by authorities to encourage widespread adoption have largely fallen flat.\n\nPersistence Gwanyanya, a member of the Reserve Bank of Zimbabwes monetary policy committee, pushed back against the Imara report, stating that the liquidity issues are limited to the parallel market, and not the formal banking system.\n\nIts not extinction of ZiG, but unwinding of US dollar positions into the local currency thats next and will help release credit into the economy,Gwanyanya said.\n\nStill, Imara argues that the central banks strategy, particularly its decision to raise interest rates to support the ZiG and fight inflation, is backfiring by encouraging more people to rely on the U.S. dollar.\n\nThe Imara executives emphasized that monetary policy alone wont solve Zimbabwes economic challenges. They urged the government to focus on boosting revenues and curbing deficit spending.\n\nIn a blunt conclusion, they said: It would be better simply to scrap [the ZiG] and move on.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171606/mushayavanhu-zig-3.jpg",
            "description": "<p>Business Insider Africa Zimbabwe’s local currency, the ZiG, is at risk of failure due to policy missteps and prolonged liquidity crunch. The currency, backed by gold and foreign currency reserves, has failed to gain public confidence. Authorities’ efforts to encourage widespread adoption of the ZiG have largely been ineffective. Zimbabwe’s ZiG is heading toward failure,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-zig-currency-risks-extinction-stoked-by-policy-choices/\">Zimbabwe’s ZiG currency risks extinction stoked by policy choices</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "16 Apr 2025"
        },
        {
            "title": "Afrikaner business delegation welcomed in Harare, as Zimbabwe warms to Washington",
            "url": "https://www.newzimbabwe.com/afrikaner-business-delegation-welcomed-in-harare-as-zimbabwe-warms-to-washington/",
            "content": "MoneyWeb\n\nA delegation from the Afrikaner business community received a warm welcome from Zimbabwean President Emmerson Mnangagwa last week in Harares State House, according to a Zanu-PF official contacted by Moneyweb.\n\nAfrikaners are African,reportedTimesLive after the meeting, which was intended to rebuild regional integration and overcome past hostilities.\n\nThey are African. They live here. They built their lives and businesses here, and they must be part of Africas future, Zanu-PF spokesman Christopher Mutsvangwa is reported as saying.\n\nAfrikaners, like all Africans, have a duty to reinvest in the continent and contribute to its growth.\n\nMnangagwa said it is time to focus on rebuilding Zimbabwe, and that required acknowledging past challenges while working together for a united future.\n\nCapital knows no race, and we are calling on all who identify with this continent to invest in it.\n\nShifting political winds\n\nThe meeting comes the same week that Zimbabwe started compensating dispossessed white farmers with an initial payment of $3.1 million (R58 million) out of a total of $3.5 billion (R66 billion) agreed under the governments 2020 Global Compensation Deed (GCD) pledge.\n\nThis is an agreement to compensate nearly 4 000 former farm owners for the seizure of their farms under the Fast Track Land Reform Programme initiated under former president Robert Mugabe nearly 20 years ago. Payments will be made for improvements to the land, not the land itself.\n\nIn another sign of the shifting political winds in the region, Zimbabwe became the first African country to suspend all tariffs on goods originating in the US, just three days after the US imposed 18% tariffs on exports from Zimbabwe.\n\nIn the spirit of constructing a mutually beneficial and positive relationship with the United States of America, under the leadership of President Trump, I will direct the Zimbabwean government to implement a suspension of all tariffs levied on goods originating from the United States, wrote Mnangagwa on X.\n\nThis measure is intended to facilitate the expansion of American imports within the Zimbabwean market, while simultaneously promoting the growth of Zimbabwean exports destined for the United States.\n\nThis action underscores our commitment to a framework of equitable trade and enhanced bilateral cooperation.\n\nThe dropping of tariffs on US goods and paying out dispossessed white farmers is part of a charm offensive by Harare to unlock international financing and re-engage with international financial institutions like the International Monetary Fund and the World Bank.\n\nMixed reactions in Zimbabwe\n\nThe outreach to the Afrikaner business community, with representatives from sectors such as agriculture and energy, has drawn mixed reactions in Zimbabwe.\n\nSome, such as political analyst Alex Rungunda, see this as a rhetorical departure for Zanu-PF, which historically adopted a confrontational stance on land and race. However, it may also be a sign of desperation, he says, as the country urgently needs capital and goodwill.\n\nWar veterans and land reform activists were less accommodating of the softening stance on historical injustices.\n\nOn Zimbabwes dropping of tariffs on US goods, journalist Hopewell Chinono says the move is more political than economic. Perhaps the president believes this could serve as a sweetener for his removal from the Global Magnitsky Human Rights Accountability Act sanctions. A long shot though! hewroteon X.\n\nZimbabwe did not coordinate the move with its regional partners, whereas the EU will put forward its response to tariffs as a bloc.\n\nEconomically, it does not make much sense for Mnangagwa to prioritise appeasing the United States in this way  especially through unilateral concessions or alignments, given Zimbabwes trade realities and regional context, says Chinono.\n\nANC uncomfortable with all this\n\nAdvocate Simba Chitando, chair of the Zanu-PF Sandton branch, speaking in his private capacity, says many members of the ANC are uncomfortable with the bridges Zanu-PF is building with the West and with white farmers, which will lead to rapid economic growth.\n\nThey dont want Harare to reach its potential, because they believe Pretoria would be weaker, and black South Africans poorer than black Zimbabweans, he said.\n\nA fear that is at the root of xenophobia, and tensions between the two people.\n\nHowever, the world can no longer ignore the fact that Zimbabwe is on the rise while South Africa is on the decline.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/08111459/harare.jpeg",
            "description": "<p>MoneyWeb A delegation from the Afrikaner business community received a warm welcome from Zimbabwean President Emmerson Mnangagwa last week in Harare’s State House, according to a Zanu-PF official contacted by Moneyweb. “Afrikaners are African,” reported TimesLive after the meeting, which was intended to rebuild regional integration and overcome past hostilities. “They are African. They live here.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/afrikaner-business-delegation-welcomed-in-harare-as-zimbabwe-warms-to-washington/\">Afrikaner business delegation welcomed in Harare, as Zimbabwe warms to Washington</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "16 Apr 2025"
        }
    ]
}