{
    "news": [
        {
            "title": "In default for 25 years, Zimbabwe struggles to feed its citizens",
            "url": "https://www.newzimbabwe.com/in-default-for-25-years-zimbabwe-struggles-to-feed-its-citizens/",
            "content": "Bloomberg\n\nWe couldnt harvest anything from our field. Even the melons failed to grow, Bekezela Dube, a 32-year-old mother of four, told United Nations Assistant Secretary-General for Climate, Reena Ghelani, on a visit to the remote rural area of Maphisa.After more than two decades of economic turmoil, many Zimbabweans cant affordimported food. And fatigue has set in among humanitarian donors.\n\nThat leaves multilateral lenders and development finance institutions as the countrys best hope for feeding roughly half its population. Yet unlike other countries including neighboring Zambia, which has already received $1 billionfrom the World Bankand the International Monetary Fund to replenish its food supplies and hydropower-dependent energy system Zimbabwe is locked out of adding to its debt.\n\nZimbabwes creditors include the World Bank, the African Development Bank, the European Investment Bank and the Paris Club, all of which have declined to provide emergency funds. The IMF said it is bound by rules that preclude it from making loans to a country already in default to related organizations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/13044443/maize-drought.jpeg",
            "description": "<p>Bloomberg  Over the last quarter century, Zimbabwe has failed to pay $21 billion in debt. Now, as the country struggles with the impact of a once-in-a-generation drought, ordinary Zimbabweans are paying the price. A prolonged hot and dry spell caused by the El Niño weather phenomenon has ravaged southern Africa, withering crops and leaving 26</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-default-for-25-years-zimbabwe-struggles-to-feed-its-citizens/\">In default for 25 years, Zimbabwe struggles to feed its citizens</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "13 Feb 2025"
        },
        {
            "title": "U.S funding cuts threaten HIV prevention efforts in Zimbabwe as truck-stop clinics suspend operations – Parliament urges govt to look for alternative support models",
            "url": "https://www.newzimbabwe.com/u-s-funding-cuts-threaten-hiv-prevention-efforts-in-zimbabwe-as-truck-stop-clinics-suspend-operations-parliament-urges-govt-to-look-for-alternative-support-models/",
            "content": "By Thandiwe Garusa\n\nTHE temporary closure of truck-stop clinics across Zimbabwe, following a recent cessation of USAID funding has raised alarm over a potential surge in HIV cases among high-risk populations, particularly long-distance truck drivers and sex workers.\n\nThese clinics have played a vital role in providing HIV prevention, testing, and treatment services in border towns and high-traffic areas.\n\nHowever, they have been temporarily closed due to the implementation of U.S. President Donald Trumps America First policy.\n\nSpeaking in a parliamentary session Tuesday, Member of Parliament for Hwange West Vusumuzi Moyo urged the Ministry of Health to take immediate action and look for alternative funding sources to ensure vulnerable communities continue to receive the necessary support in the fight against HIV/AIDS.\n\nWithout funding for laboratory tests, HIV counselling and antiretroviral medications, many truck drivers and sex workers who rely on these clinics may not have access to crucial HIV-related healthcare services. In turn, this could result in an increase in undiagnosed HIV cases and the lack of consistency of the ART adherence, both of which contribute to higher transmission rates, he said.\n\nWith funding cuts, the sustainability of these services is at risk and the impact could be felt in high HIV prevalence, decreased access to care and return to higher transmission rates.\n\nTo mitigate these effects, it is essential to explore and implore the Ministry of Health to seek alternative funding models and to strengthen our local healthcare system to ensure that the vulnerable population continues to receive the support they need in the fight against HIV/AIDS.\n\nMeanwhile, Population Solutions for Health (PSH) New Start Centres have temporarily halted services for patients on ART and those seeking PrEP refills.\n\nApproximately 1.2 million Zimbabweans benefit from the U.S Presidents Emergency Plan for AIDS Relief (PEPFAR), and over 1,600 public hospitals and clinics have received training and technical support from the US government.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/12194913/truck-stop-clinic.webp",
            "description": "<p>By Thandiwe Garusa THE temporary closure of truck-stop clinics across Zimbabwe, following a recent cessation of USAID funding has raised alarm over a potential surge in HIV cases among high-risk populations, particularly long-distance truck drivers and sex workers. These clinics have played a vital role in providing HIV prevention, testing, and treatment services in border</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/u-s-funding-cuts-threaten-hiv-prevention-efforts-in-zimbabwe-as-truck-stop-clinics-suspend-operations-parliament-urges-govt-to-look-for-alternative-support-models/\">U.S funding cuts threaten HIV prevention efforts in Zimbabwe as truck-stop clinics suspend operations – Parliament urges govt to look for alternative support models</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "13 Feb 2025"
        },
        {
            "title": "ZB US$2,7 million heist suspect challenges money laundering allegations",
            "url": "https://www.newzimbabwe.com/zb-us27-million-heist-suspect-challenges-money-laundering-allegations/",
            "content": "By Staff Reporter\n\nDenis Madondo, one of the suspects in the US$2,7 million ZB heist has challenged the State for prosecuting him on money laundering charges yet he was acquitted of robbing the bank.\n\nHe argued that it was illogical for the State to prosecute him over the same money involved in a case he had been cleared of wrongdoing.\n\nMadondo said this when his trial commenced before Harare magistrate Taurai Manuwere.\n\nIn the present case, the State alleges that Madondo went on a spending spree using the robberyloot.\n\nThe state alleges that he bought a Mercedes Benz worth US$9,000 and that he was found in possession of US$62,500.\n\nProsecutors said he failed to explain his source of funds.\n\nMadondo denied the allegations.\n\nHe said the facts being relied on by the State were the same as those in the robbery case which he was acquitted of.\n\nThis time around, the property is included as an exhibit in the present case of money laundering where it is suspected again that it was acquired through the commission of an unknown crime.\n\nThus, insofar as the US$62,500.00 cash is concerned, the alleged act in both offences against me remains the same as that of possessing cash suspected to have been acquired through commission of a crime.\n\nThe foregoing facts clearly indicate that, if the money laundering trial is to be allowed, I would be tried for an offence in respect of an act for which I previously have been acquitted on the merits, the act being my conduct of having in my possession the US$62,500 cash and the silver E320 Mercedes suspected to have been acquired through commission of crime, Madondo argued.\n\nMadondo was arrested together with Tendai Zuze, Never Mwamuka and Shadreck Njowa for the alleged offence where US$2,7 million which was meant to be delivered to several ZB bank branches in Chinhoyi vanished.\n\nZuze was acquitted last year by the High Court on the basis that the States evidence to link him to the crime was insufficient.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/09/16054829/ZB-BANK-1.jpg",
            "description": "<p>By Staff Reporter Denis Madondo, one of the suspects in the US$2,7 million ZB heist has challenged the State for prosecuting him on money laundering charges yet he was acquitted of robbing the bank. He argued that it was illogical for the State to prosecute him over the same money involved in a case he</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zb-us27-million-heist-suspect-challenges-money-laundering-allegations/\">ZB US$2,7 million heist suspect challenges money laundering allegations </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "13 Feb 2025"
        },
        {
            "title": "Zimbabwe isn’t yet ready for a sole currency, finance chief says",
            "url": "https://www.newzimbabwe.com/zimbabwe-isnt-yet-ready-for-a-sole-currency-finance-chief-says/",
            "content": "Bloomberg\n\nZimbabwes Finance Minister Mthuli Ncube said the southern African nation needs to regain access to credit lines before it can adopt the ZiG as its sole currency.\n\nWe need a few things in place before the nation can have a mono currency, including making progress on restructuring $21 billion in debt, Ncube said. The nation has been locked out of capital markets since 1999 after defaulting on its debt.\n\nClearing the arrears would allow us to access balance of payments support, in terms of credit lines to support Zimbabwes reserve position, deal with demand by importers and defend the currency, Ncube said.\n\nThe ZiG, short for Zimbabwe Gold, was introduced in April to replace the dollar as the nations main transacting currency, after several previous attempts failed.\n\nThe new currency has faced setbacks including a 43% devaluation in September and calls for it to be abandoned.\n\nTo support the currency the central bank has spent more than $400 million and significantly tightened liquidity.\n\nAn International Monetary Fund team is in the country until February 13 to determine whether to place Zimbabwe on a so-called staff-monitored program, a crucial to for the nation to secure a debt overhaul.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/03/14204722/Mthuli-Ncube.jpg",
            "description": "<p>Bloomberg Zimbabwe’s Finance Minister Mthuli Ncube said the southern African nation needs to regain access to credit lines before it can adopt the ZiG as its sole currency. “We need a few things in place” before the nation can have a mono currency, including making progress on restructuring $21 billion in debt, Ncube said. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-isnt-yet-ready-for-a-sole-currency-finance-chief-says/\">Zimbabwe isn’t yet ready for a sole currency, finance chief says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "13 Feb 2025"
        },
        {
            "title": "Kalisto Pasuwa appointed Malawi head coach",
            "url": "https://www.newzimbabwe.com/kalisto-pasuwa-appointed-malawi-head-coach/",
            "content": "By Sport Reporter\n\nCelebrated Zimbabwean football coach Kalisto Pasuwa has been appointed the head coach for Malawis mens football team.\n\nNicknamed Manabundu, Pasuwa has signed a two-year contract which will see him leading The Flames until 2027.\n\nThe former Dynamos coachs substantive appointment comes after he led the side from November last year onaninterim basis.\n\nThe Football Association of Malawi (FAM) has today unveiled former FCB Nyasa Big Bullets Coach Kalisto Pasuwa as the new Malawi Mens Senior National Team Head Coach.\n\nThe Zimbabwean will be in charge of the Flames for two years, the football association said in a statement.\n\nPasuwa enjoyed a huge success as the head coach for Malawi football giants Nyasa Big Bullets.\n\nAt Nyasa, he won four consecutive league titles and several silverware before parting ways with the side in December 2024.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/12135744/Kalisto-Pasuwa.webp",
            "description": "<p>By Sport Reporter Celebrated Zimbabwean football coach Kalisto Pasuwa has been appointed the head coach for Malawi’s men’s football team. Nicknamed Manabundu, Pasuwa has signed a two-year contract which will see him leading The Flames until 2027. The former Dynamos coach’s substantive appointment comes after he led the side from November last year on an interim basis.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kalisto-pasuwa-appointed-malawi-head-coach/\">Kalisto Pasuwa appointed Malawi head coach</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "13 Feb 2025"
        },
        {
            "title": "Zanu PF factional war: Police hunt for Geza; say he faces theft, incitement of public violence, insulting President charges",
            "url": "https://www.newzimbabwe.com/zanu-pf-factional-war-police-hunt-for-geza-say-he-faces-theft-incitement-of-public-violence-insulting-president-charges/",
            "content": "By Costa Nkomo\n\nThe Zimbabwe Republic Police (ZRP) has said it wants to question Blessed Runesu Geza, the outspoken war veteran opposing the 2030 agenda who faces four counts of criminal charges.\n\nThe charges include vehicle theft, undermining President Emmerson Mnangagwa, and inciting public violence.\n\nGeza, known as Bombshell, has been something of a thorn in the Presidents side.\n\nThis development follows a series of press conferences held by Geza and a group of Zanu PF war veterans, where they called for Mnangagwas resignation. They accuse the Zanu-PF leader of overseeing rampant corruption and nepotism, and of plotting to extend his term beyond the constitutionally mandated limit.\n\nGeza also turned his fire on the First Lady, Auxilia Mnangagwa, accusing her of wasting state resources on what he deems unnecessary tours around the country.\n\nConstitutional experts such as Professor Lovemore Madhuku have long maintained that such a term extension is legally impossible.\n\nWhile Mnangagwa himself has publicly pledged to step down at the end of his term in 2028, critics warn that this is simply his modus operandi  giving the impression of heading one way while veering sharply in another.\n\nThey point to his continued silence on the matter, failing to quash those who advocate for a term extension, as further evidence.\n\nMnangagwas term concludes in 2028, yet some of his allies and party members persist in calling for him to remain in power until 2030.\n\nGeza, a Zanu-PF Central Committee member, delivered his most recent press conference on Monday, urging Zimbabweans to prepare for a national shutdown as calls for Mnangagwas resignation grow louder, the tide is turning with the public.\n\nWe implore you to resign peacefully. If you dont resign in peace, people will use the constitution to exercise their right to push you out of office, Geza said.\n\nGeza also warned the police that if they dared to beat or shoot demonstrators protesting against Mnangagwa, the public would hold them accountable in their own neighbourhoods.\n\nIn response, police spokesperson Commissioner Paul Nyathi issued a statement on Wednesday, asserting that Geza faces charges of insulting Mnangagwa and inciting public violence.\n\nTheft allegations as defined in Section 113 of the Criminal Law Codification and Reform Act, Chapter 9: 23. The suspect stole and disposed of three vehicles belonging to a complainant without his consent.\n\nHe is also facing two counts of contravening Section 33 (2) (a) (ii) of the Criminal Law Codification and Reform Act, Chapter 9: 23, Undermining the Authority of or insulting the President,' Nyathis statement reads.\n\nCommissioner Nyathi further stated that Geza had incited the public to commit violence, violating the Criminal Code and Reform Act.\n\nOne count of contravening Section 187 of the Criminal Law Codification and Reform Act, Chapter 9:23, Incitement to commit public violence, Nyathi said.\n\nNyathi also cautioned that anyone found harbouring Geza or assisting him in evading police questioning would be equally liable for arrest and prosecution.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/12134842/geza.jpg",
            "description": "<p>By Costa Nkomo The Zimbabwe Republic Police (ZRP) has said it wants to question Blessed Runesu Geza, the outspoken war veteran opposing the “2030 agenda”  who faces four counts of criminal charges. The charges include vehicle theft, undermining President Emmerson Mnangagwa, and inciting public violence. Geza, known as Bombshell, has been something of a thorn</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-factional-war-police-hunt-for-geza-say-he-faces-theft-incitement-of-public-violence-insulting-president-charges/\">Zanu PF factional war: Police hunt for Geza; say he faces theft, incitement of public violence, insulting President charges</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "13 Feb 2025"
        },
        {
            "title": "We will need to be a lot better – Sables Coach on Africa Cup Draw",
            "url": "https://www.newzimbabwe.com/we-will-need-to-be-a-lot-better-sables-coach-on-africa-cup-draw/",
            "content": "By Sport Reporter\n\nZimbabwe senior mens rugby team coach Piet Benade has welcomed the 2025 Africa Cup draw, although he feels there is a need to work hard ahead of the tournament.\n\nThis years Africa Cup will be played from the 20th to the 28th of July in Uganda.\n\nAfter winning the 2024 edition, the Sables will be one of the teams to watch at this years edition.\n\nThis years Rugby Africa Cup will see the winner automatically qualifying for the 2027 Rugby World Cup to be played in Australia.\n\nZimbabwe, Namibia, Ivory Coast, Kenya, Morroco, Senegal, Algeria and Uganda will be battling for the ticket to Australia.\n\nZimbabwe will open its campaign against Morroco before playing the winner between Kenya and Uganda in the semi-finals.\n\nThe Sables, however, avoided tournament favourites Namibia and they will only meet in the final provided both sides make it all the way.\n\nWe knew as top seed we would be playing the side being promoted in the Africa Cup Quarter Final.\n\nThis is sometimes tricky as its a team that has recently been successful and just spent time together preparing for the playoff, said Sables head coach Benade.\n\nIf we get through Morocco we will be up against the winners of Kenya vs Uganda.\n\nSo that will be a massive semi-final considering the match will be in Uganda and even Kenya will enjoy a lot of support.\n\nZimbabwe Rugby Union is already setting sight to the Rugby Africa and NewZimbabwe.com has it on good authority that as part of preparations, two test matches against Zambia and Botswana have been confirmed.\n\nThis will add to the other big fixture against United Arab Emirates which has been scheduled for May 24.\n\nBenade added, I think everyone will be up a few levels and working hard to get their best players onto the field and then getting their preparation right.\n\nWe put in a huge amount of work in last year and got the rewards but we know we will need to be alot better to cope with the new challenges that will be coming our way.\n\nZimbabwe last featured at a rugby World Cup in 1991 and all eyes will be on the current crop of players to break the jinx.\n\nZimbabwe v Morocco\n\nUganda v Kenya\n\nNamibia v Senegal\n\nAlgeria v Cote d Ivoire\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/29051559/Sables-7.png",
            "description": "<p>By Sport Reporter Zimbabwe senior men’s rugby team coach Piet Benade has welcomed the 2025 Africa Cup draw, although he feels there is a need to work hard ahead of the tournament. This year’s Africa Cup will be played from the 20th to the 28th of July in Uganda. After winning the 2024 edition, the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/we-will-need-to-be-a-lot-better-sables-coach-on-africa-cup-draw/\">We will need to be a lot better – Sables Coach on Africa Cup Draw</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "13 Feb 2025"
        },
        {
            "title": "Jub Jub raises hell by exposing infidelity in churches in the new season of ‘Uyajola 9/9’",
            "url": "https://www.newzimbabwe.com/jub-jub-raises-hell-by-exposing-infidelity-in-churches-in-the-new-season-of-uyajola-9-9/",
            "content": "IOL\n\nThe show Uyajola 9/9 is known for revealing the secrets and scandals of South Africans to the public.\n\nHosted byrapperand TV personality Jub Jub, the show has become popular for exposing infidelity in relationships, often sending ripples through the local community.\n\nBut now, Jub Jub has decided to raise the stakes by taking the drama into religious spaces.\n\nIn a recent video going viral,Jub Jubmade a bold proclamation: Everyone cheats, even at church. So now we cannot go in because of church? We are within!\n\nThe idea of exposing pastors  trusted figures in religious communities  has sparked mixed reactions.\n\nFor those who might be unfamiliar with the show, Uyajola 9/9 is South Africas answer to the Cheaters franchise, with a distinctly local twist.\n\nIn each episode, Jub Jub and his team track down people suspected of cheating, confronting them with evidence.\n\nThe show has become known for its intense confrontations, high drama, and unpredictable outcomes, sometimes tearing families apart, other times resolving long-standing issues.\n\nNow, it seems the show is turning a critical eye toward the very institutions that are meant to guide and support moral values  churches.\n\nBy targeting pastors and religious figures, Jub Jub is challenging the belief that these spaces are beyond reproach when it comes tocheating.\n\nThe implications of exposing cheating in religious settings are complex. On one hand, its understandable why some viewers might see this as a necessary step towards transparency.\n\nIf pastors, who are often viewed as role models are coveting with thy neighbour, it raises concerns about their integrity and teachings.\n\nFor those in the congregation, the revelation could be a shock but also a wake-up call about the flaws that exist even in the most revered of spaces.\n\nHowever, theres also a more sensitive side to consider.\n\nThe church is often considered a sanctuary for people to find solace, guidance and community. By airing these personal conflicts on national TV, Uyajola 9/9 might risk eroding the trust people place in their religious leaders.\n\nSome viewers may feel that the show is exploiting sacred spaces for entertainment rather than truly serving the greater good.\n\nUyajola 9/9 is stirring up an important conversation  one about loyalty, accountability and the blurred lines between public and private life.\n\nShould religious leaders be held to a higher standard? Is it right to expose personal matters in such a public way? Or is this a wake-up call that theres no one immune to the temptations of infidelity, even in the holiest of spaces?\n\nSo many questions!\n\nJub Jub says he is also coming for cheating pastors in the next season of Uyajola99.pic.twitter.com/kyUbDcCFcr\n\n@nathit00th commented: Chief we are busy dealing with bigger issues in our country at the moment. we are repositioning south africa in the world and wena you are coming with petty issues of cheaters please dude chill. we will give you attention next year.\n\n@ModiegiLakes commented: They really need to just shut it. No longer relevant this uyajola 99 nonsense.\n\nWhile @r_motlatso wrote: Hes lying, last time he was promoting season 2 of this stupid show, he said hell be exposing celebrities who cheat. This show must be cancelled, and if you support  youre just as much as an idiot.\n\nSjoe, these people are not having it.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/12052103/jub-jub.webp",
            "description": "<p>IOL The show “Uyajola 9/9” is known for revealing the secrets and scandals of South Africans to the public. Hosted by rapper and TV personality Jub Jub, the show has become popular for exposing infidelity in relationships, often sending ripples through the local community. But now, Jub Jub has decided to raise the stakes by taking</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/jub-jub-raises-hell-by-exposing-infidelity-in-churches-in-the-new-season-of-uyajola-9-9/\">Jub Jub raises hell by exposing infidelity in churches in the new season of ‘Uyajola 9/9’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "13 Feb 2025"
        },
        {
            "title": "Three Zimbabweans arrested in Limpopo’s illegal gold processing operation",
            "url": "https://www.newzimbabwe.com/three-zimbabweans-arrested-in-limpopos-illegal-gold-processing-operation/",
            "content": "IOL\n\nFour suspects, three Zimbabwean and one Mozambican, were arrested following the discovery of an illegal gold processing laboratory along the R71 near Tarentaalrand in the Letsitele policing area under Mopani District in Limpopo.\n\nWith the amount ofillegal gold miningin South Africa, minerals are sold illicitly before they are processed in various ways through laboratories run by alleged criminals connected in an intricate network to illegal mining kingpins.\n\nSouth African Police Service (SAPS) spokesperson, Colonel Malesela Ledwaba said the suspects who were identified as: Jonh Vondo, 39, Hardlife Manjoko, 35, Biggie Chimwero, 36, from Zimbabwe and Samuel Almeida Mashaba, 46, Mozambican appeared at Ritavi Magistrates Court on Monday, February 10.\n\nThey are facing charges of illegal processing of gold-bearing materials. They were remanded in custody until February 18 for formal bail Mashaba also faces charges of contravening the Immigration Act, said Ledwaba.\n\nLedwaba further stated that the arrests were made as a result of a well-coordinated, intelligence-driven operation by the Mopani District Vala Umgodi Task Team, which was assisted by Tactical Joint Operational Centre (TACJOC) Detectives and Airwing Drone Pilots.\n\nAdditionally, two of these suspects are alleged to be the primarykingpins driving the illicit miningactivities in the area.\n\nDuring the operation, police seized various items believed to have been used in the illegal processing of minerals, including containers with carbon ashes (presumed to be precious minerals), gas bottles, sulfuric acids and oxygen cylinders, Ledwaba added.\n\nFurthermore, two cars: a red Haval and a white Mercedes-Benz with Gauteng registration plates, thought to be owned by the two alleged kingpins, were confiscated by law enforcement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/12043715/Discovery-of-illegal-gold-processing-laboratory-leads-to-arrest-of-four-suspects.webp",
            "description": "<p>IOL Four suspects, three Zimbabwean and one Mozambican, were arrested following the discovery of an illegal gold processing laboratory along the R71 near Tarentaalrand in the Letsitele policing area under Mopani District in Limpopo. With the amount of illegal gold mining in South Africa, minerals are sold illicitly before they are processed in various ways through</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/three-zimbabweans-arrested-in-limpopos-illegal-gold-processing-operation/\">Three Zimbabweans arrested in Limpopo’s illegal gold processing operation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "13 Feb 2025"
        },
        {
            "title": "Rebels attack DR Congo army ending lull in fighting",
            "url": "https://www.newzimbabwe.com/rebels-attack-dr-congo-army-ending-lull-in-fighting/",
            "content": "BBC\n\nThe Rwandan-backed M23 rebels have attacked Congolese government forces in the South Kivu province, breaking a two-day lull in fighting.\n\nHeavy shelling began on Tuesday morning, three days after a summit of East and Southern African leaders called for an immediate and unconditional ceasefire.\n\nThe rebels have seized vast swathes of land in the eastern DR Congo, including the major city of Goma.\n\nThey are now pushing towards Bukavu, the capital of South Kivu  another key city in the region.\n\nAround 2,900 people have been killed since early January as a result of the hostilities, the latest UN figures suggest.\n\nApproximately 700,000 others are estimated to have been forced from their homes and thousands more injured.\n\nTuesdays fighting erupted near Ihusi, a locality around 70km (43 miles) from Bukavu and 40km from the South Kivus airport, security sources told news agency AFP.\n\nA spokesperson for the Congo River Alliance (known by its French acronym AFC), an alliance of rebel groups including the M23, suggested its fighters could take their battle to Bukavu.\n\nLawrence Kanyuka responded to the arrests by the Congolese authorities of 84 army personnel for crimes such as killing civilians near Bukavu, saying: If these crimes persist, we will take full responsibility to eradicate the threat at its source and protect our people.\n\nMeanwhile, reports say that hundreds and thousands of refugees, who have fled the ongoing fighting, were being forced to return home by the M23.\n\nThe M23 has denied this allegation, but French broadcaster RFI reported that several large camps for displaced people have been dismantled and their inhabitants made to trek back to their villages in conflict zones.\n\nOcha, the UNs humanitarian agency, said the M23 had given displaced people in Goma 72 hours to return to home.\n\nMr Kanyuka said such reports were propaganda and that displaced people were returning voluntarily. The M23 does not compel anyone to return without firm security guarantees, he said.\n\nThe M23, which is made up of ethnic Tutsis, say they are fighting for minority rights, while DR Congos government says the rebels are seeking control of the eastern regions vast mineral wealth.\n\nDR Congo and the UN accused Rwandas Tutsi-dominated government of backing the M23  an allegation which Kigali has persistently denied.\n\nBut recently, the official response has shifted, with government spokespeople stating that fighting near its border is a security threat.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/16020044/DRC-Rebels.png",
            "description": "<p>BBC The Rwandan-backed M23 rebels have attacked Congolese government forces in the South Kivu province, breaking a two-day lull in fighting. Heavy shelling began on Tuesday morning, three days after a summit of East and Southern African leaders called for an immediate and unconditional ceasefire. The rebels have seized vast swathes of land in the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rebels-attack-dr-congo-army-ending-lull-in-fighting/\">Rebels attack DR Congo army ending lull in fighting</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "13 Feb 2025"
        }
    ]
}