{
    "news": [
        {
            "title": "Jailed AMH journalist sues Justice and Information ministers",
            "url": "https://www.newzimbabwe.com/jailed-amh-journalist-sues-justice-and-information-ministers/",
            "content": "By Staff Reporter\n\nALPHA Media Holdings (AMH) journalist Blessed Mhlanga has sued Justice and Information ministers as well as the Attorney General (AG) over his arrest arguing that it was unconstitutional.\n\nMhlanga is accused of transmitting information containing inciting messages following a press conference held by the former Zanu PF Central Committee member, Blessed Geza.\n\nHe faces allegations of contravening section 164 of the Criminal Law (Codification and Reform) Act [Chapter 9:23], that is Transmission of data message inciting violence or damage to property.\n\nThe senior journalist has been behind bars since his arrest on February 24, 2025, having been denied bail by both the magistrates court on two occasions, and the High Court.\n\nIn the present application Mhlanga complains about the section under which he was charged and feels that it is in contradiction with the Constitution.\n\nThe section violates freedom of expression and freedom of the media as well as section 62 of the Constitution, Access to Information.\n\nSection 61 of the Constitution states that every person has the right to freedom of expression, which includes freedom to seek, receive and communicate ideas and other information, freedom of artistic expression and scientific research a d creativity and academic freedom.\n\nEvery person is entitled to freedom of the media which includes the protection of the confidentiality of Journalists sources on information, reads part of the application.\n\nMhlanga also denied allegations being levelled against him.\n\nTo be clear, this is not an appeal against the proceedings of the lower court. This is a stand-alone challenge on the constitutionality of the controversial statutory provision.\n\nIt is on account of my doubt about the constitutionality of s 164 of the Criminal Code that I petition this honourable court for direct access.\n\nIt appears most prudent and effective for me to raise the constitutional questions that form the basis of this application through the direct access to the Constitutional Court route, as opposed to other options available at law.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26003108/InShot_20250225_165102005-scaled-e1741780334367.jpg",
            "description": "<p>By Staff Reporter ALPHA Media Holdings (AMH) journalist Blessed Mhlanga has sued Justice and Information ministers as well as the Attorney General (AG) over his arrest arguing that it was unconstitutional. Mhlanga is accused of transmitting information containing inciting messages following a press conference held by the former Zanu PF Central Committee member, Blessed Geza.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/jailed-amh-journalist-sues-justice-and-information-ministers/\">Jailed AMH journalist sues Justice and Information ministers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "13 Apr 2025"
        },
        {
            "title": "Man accidentally stones baby to death during fight with girlfriend",
            "url": "https://www.newzimbabwe.com/man-accidentally-stones-baby-to-death-during-fight-with-girlfriend/",
            "content": "By Staff Reporter\n\nA MASVINGO man will forever regret the day he tried to pelt his lover with a stone but missed the target and hit a baby strapped on her back.\n\nThe murder suspect was identified as 52-year-old Douglas Gwizangwe.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident.\n\nPolice in Masvingo arrested Douglas Gwizangwe (52) in connection with a case of murder which occurred on April 9, 2025, at Munangari Village, Shongamiti, Chivi, said Nyathi.\n\nThe suspect hit the victim with a stone on the eye during a fight with his ex-girlfriend, who was carrying the victim on her back.\n\nThe suspect had allegedly intended to hit his ex-girlfriend with the stone but missed her.\n\nThe victim succumbed to the injuries upon admission at Chiredzi Hospital.\n\nMeanwhile, police in Shurugwi are appealing for information which may lead to the arrest of Jimson Pikai Chimba Hlawu, who is being sought in connection with a case of murder in which an artisanal miner died after being stabbed multiple times all over the body with a sharp object at Ash 16 Gold Mine April 10, 2025.\n\nZRP appealed to anyone with information to report at any nearest police station.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/30024446/Paul-Nyathi-1.jpeg",
            "description": "<p>By Staff Reporter  A MASVINGO man will forever regret the day he tried to pelt his lover with a stone but missed the target and hit a baby strapped on her back. The murder suspect was identified as 52-year-old Douglas Gwizangwe. Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident. “Police in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-accidentally-stones-baby-to-death-during-fight-with-girlfriend/\">Man accidentally stones baby to death during fight with girlfriend </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "13 Apr 2025"
        },
        {
            "title": "At least 100 people killed in attacks on famine-hit camps in Sudan’s Darfur, UN official says",
            "url": "https://www.newzimbabwe.com/at-least-100-people-killed-in-attacks-on-famine-hit-camps-in-sudans-darfur-un-official-says/",
            "content": "By Associated Press\n\nSUDANS notorious paramilitary group launched a two-day attack on famine-hit camps for displaced people that left more than 100 dead, including 20 children and nine aid workers, in the Darfur region, a U.N. official said Saturday.\n\nThe Rapid Support Forces and allied militias launched an offensive on the Zamzam and Abu Shorouk camps and the nearby city of el-Fasher, the provincial capital of North Darfur province, on Friday, said U.N. Resident and Humanitarian Coordinator in Sudan Clementine Nkweta-Salami.\n\nEl-Fasher is under the control of the military, which has fought the RSF since Sudan descended into civil war two years ago, killing more than than 24,000 people, according to the United Nations, though activists say the number is likely far higher.\n\nThe camps were attacked again on Saturday, Nkweta-Salami said in a statement. She said that nine aid workers were killed while operating one of the very few remaining health posts still operational in Zamzam camp.\n\nThis represents yet another deadly and unacceptable escalation in a series of brutal attacks on displaced people and aid workers in Sudan since the onset of this conflict nearly two years ago, she said.\n\nNkweta-Salami didnt identify the aid workers but Sudans Doctors Union said in a statement that six medical workers with the Relief International were killed when their hospital in Zamzam came under attack on Friday.\n\nThey include Dr. Mahmoud Babaker Idris, a physician at the hospital, and Adam Babaker Abdallah, head of the group in the region, the union said.It blamed the RSF for this criminal and barbaric act.\n\nThe offensive forced about 2,400 people to flee the camps and el-Fasher, according to the General Coordination for Displaced Persons and Refugees, a local group in Darfur.\n\nZamzam and Abu Shouk shelter more than 700,000 people who have been forced to flee their homes across Darfur during past bouts of fighting in the region, Nkweta-Salami said.\n\nLate last month, the Sudanese military regained control over Khartoum, a major symbolic victory in the war. But the RSF still controls most of Darfur and some other areas.\n\nThe two camps are among five areas in Sudan where famine was detected by the Integrated Food Security Phase Classification, IPC, a global hunger monitoring group.\n\nThe war has created the worlds largest humanitarian crisis, with about 25 million people  half of Sudans population  facing extreme hunger.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/13063122/15sudan-darfur-add-fzpb-mediumSquareAt3X.jpg",
            "description": "<p>By Associated Press SUDAN’S notorious paramilitary group launched a two-day attack on famine-hit camps for displaced people that left more than 100 dead, including 20 children and nine aid workers, in the Darfur region, a U.N. official said Saturday. The Rapid Support Forces and allied militias launched an offensive on the Zamzam and Abu Shorouk</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/at-least-100-people-killed-in-attacks-on-famine-hit-camps-in-sudans-darfur-un-official-says/\">At least 100 people killed in attacks on famine-hit camps in Sudan’s Darfur, UN official says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "13 Apr 2025"
        },
        {
            "title": "Tyla turns heads on magazine cover and hints at a rap revolution",
            "url": "https://www.newzimbabwe.com/tyla-turns-heads-on-magazine-cover-and-hints-at-a-rap-revolution/",
            "content": "By IOL\n\nANOTHER day, another slay, and this time, Tyla is front and centre on the April cover of Nylon magazine, continuing her reign as one of the most stylish stars on the planet.\n\nAt just 23, the South African singer is not only delivering bangers on stage but serving fashion fantasy in every editorial shoot. This latest spread is no different: bold looks, sharp silhouettes, and that effortless cool only she can pull off.\n\nTylas feature comes hot off the heels of an impressive list of magazine covers. In just over a year, shes graced the pages of British Vogue, Elle US, Billboard, Cosmopolitan, BeatRoute, T Magazine from The New York Times, and Dazed.\n\nEach shoot has spotlighted her meteoric rise from Johannesburg girl to global It-girl, never shying away from showcasing her roots.\n\nNylon magazine is considered a cool-girl staple in the fashion and pop culture world not necessarily massive like Vogue or Elle, but highly influential among Gen Z and millennial readers.\n\nIn her interview, Tyla opens up about the whirlwind of fame and how her family is riding the wave alongside her. She shared a funny moment when a fan DMd her with a photo, not of her, but of her mum.\n\nThey ask me for pictures, too, Tyla, her mother told her. Fame, it seems, runs in the family now. But its not all glitz and red carpets.\n\nTyla is taking her artistry seriously and isnt afraid to shake things up.\n\nOne day, youre going to get that Tyla rap song, she teased, hinting that theres much more to her than catchy Amapiano hooks and glossy visuals.\n\nShes taking her time with her next album, wanting to showcase a fuller picture of who she is beyond what people expect.\n\nIm excited to show people that Im more diverse than they think. I want to take my time with my artistry and give whatever feels right for that moment.\n\nWhen asked where shed take fans to understand her music better, she didnt hesitate: the CBD in Johannesburg. Its the chaos, the culture, the sound of taxis, shouting, and local music blaring from every corner that inspired her growing up, and that energy still pulses through her dance tracks.\n\nYou can hear our music playing loud. You can hear our accents, people shouting, taxis driving crazy. I would take people there because that feels like how my dance music feels, I think, she said.\n\nOn the topic of representation, Tyla shared her dreams of seeing African music  pure and unfiltered  become just as global as pop.\n\nI would love to see an African artist even if the artist isnt born and raised on the continent make African music without pop influences, just true African music. I would love to see that be as global as pop music is one day, she said.\n\nNot watered down, not reshaped to fit a Western mould. And even if shes not the one to push it all the way, shes rooted in who she is.\n\nIm an African girl, and Im always going to be, she added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/13061904/In-her-latest-feature-Tyla-opens-up-about-her-Joburg-roots-her-love-for-fashion-and-why-she-s-ready-to-explore-rap-in-her-next-album.webp",
            "description": "<p>By IOL ANOTHER day, another slay, and this time, Tyla is front and centre on the April cover of “Nylon” magazine, continuing her reign as one of the most stylish stars on the planet. At just 23, the South African singer is not only delivering bangers on stage but serving fashion fantasy in every editorial</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tyla-turns-heads-on-magazine-cover-and-hints-at-a-rap-revolution/\">Tyla turns heads on magazine cover and hints at a rap revolution</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "13 Apr 2025"
        },
        {
            "title": "Zimbabwe-China tobacco expo to be held in third quarter",
            "url": "https://www.newzimbabwe.com/zimbabwe-china-tobacco-expo-to-be-held-in-third-quarter/",
            "content": "By Xinhua\n\nZIMBABWE will hold the first Zimbabwe-China tobacco expo in the third quarter of this year to promote the countrys tobacco, the countrys industry regulatory body, the Tobacco Industry and Marketing Board (TIMB), announced Friday.\n\nThe expo will be held in the capital, Harare, by the TIMB in partnership with the Asia-Europe and Africa Joint Trade and Investment Promotion Association, an international non-governmental organization.\n\nIt is expected to bring together tobacco industry players across all the value chains, such as farmers, merchants, government representatives, and cigarette manufacturers, among other players, to advance cooperation in the tobacco sector.\n\nSpeaking after the signing of a memorandum of understanding between the TIMB and the Tianjin representative office of the association in Harare, Emmanuel Matsvaire, acting chief executive officer of the TIMB, said the expo will bring solutions to challenges facing the local tobacco industry and open up new markets for Zimbabwe.\n\nOur farmers, through the value chain, have some challenges that probably have a solution that is available in China. What we want to do is to bridge the gap between what the farmers are looking for and what the Chinese can offer as a solution, from planting right up to the cigarette production, he said.\n\nThe expo is also expected to unlock opportunities for the local tobacco industry in international markets, as well as bring new technologies, he said.\n\nChina remains a major buyer of Zimbabwes tobacco, consuming about 100 million kg of the countrys tobacco crop each year, said Matsvaire.\n\nThe Chinese ordinarily would account for a third of the total tobacco that will be purchased from this country. We are expecting a crop size of about 280 million kg of tobacco at the end of this year, he said.\n\nHe noted that China Tobacco, through its local subsidiary, Tianze Tobacco Company, has been pivotal in supporting the local tobacco industry through contract farming since the advent of Zimbabwes land reform program of the early 2000s.\n\nLu Zhaofeng, executive president of the association, said the vision of this expo is to promote international trade in the tobacco business between China and Zimbabwe.\n\nThrough this expo, we want to get suppliers of facilities, equipment, and packaging industries to come here to have a look at the local requirements, she said.\n\nTobacco, primarily cultivated by small-scale farmers, is Zimbabwes leading agricultural export and one of the countrys top foreign currency earners.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/02/06230321/Tobacco-Zimbabwe-e1586276848286.jpg",
            "description": "<p>By Xinhua ZIMBABWE will hold the first Zimbabwe-China tobacco expo in the third quarter of this year to promote the country’s tobacco, the country’s industry regulatory body, the Tobacco Industry and Marketing Board (TIMB), announced Friday. The expo will be held in the capital, Harare, by the TIMB in partnership with the Asia-Europe and Africa</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-china-tobacco-expo-to-be-held-in-third-quarter/\">Zimbabwe-China tobacco expo to be held in third quarter </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "13 Apr 2025"
        },
        {
            "title": "Zimbabwean avocado gains traction among Chinese importers",
            "url": "https://www.newzimbabwe.com/zimbabwean-avocado-gains-traction-among-chinese-importers/",
            "content": "By Xinhua\n\nCHINESE importers have positively reviewed the quality and output of Zimbabwean avocados and are committed to helping local farmers tap into the Chinese market, a Chinese trade specialist has said.\n\nSpeaking to Xinhua late Friday in Harare, Zimbabwes capital, Lu Zhaofeng, executive president of the Asia-Europe and Africa Joint Trade and Investment Promotion Association, an international non-governmental organization, expressed optimism that the rising demand from China would drive Zimbabwes avocado exports.\n\nLu, who led a group of Chinese importers to review the avocado industry in Zimbabwe this week, said the avocados excellent quality and high yield have bolstered Chinese buyers confidence that it would make a strong showing and gain a foothold in the Chinese market.\n\nZimbabwe boasts a variety of avocado types, and their flesh is so smooth and delicate. It is a sure bet that Chinese consumers will like them, Lu said.\n\nShe told Xinhua that during this trip, Chinese importers learned more about Zimbabwes avocado industry and the countrys willingness to boost the agricultural sector.\n\nIn September last year, a trade protocol on the export of Zimbabwean avocados was inked during Zimbabwean President Emmerson Mnangagwas state visit to China, which brought joy to Zimbabwean farmers who have always been eager to expand their overseas markets.\n\nNoting that Zimbabwes avocado industry still faces multiple challenges such as climate change, inadequate irrigation and poor transportation, Lu said Chinese importers are willing to provide the much-needed technology and equipment to help local farmers boost their output.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/01/18155817/Avocado.jpg",
            "description": "<p>By Xinhua CHINESE importers have positively reviewed the quality and output of Zimbabwean avocados and are committed to helping local farmers tap into the Chinese market, a Chinese trade specialist has said. Speaking to Xinhua late Friday in Harare, Zimbabwe’s capital, Lu Zhaofeng, executive president of the Asia-Europe and Africa Joint Trade and Investment Promotion</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-avocado-gains-traction-among-chinese-importers/\">Zimbabwean avocado gains traction among Chinese importers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "13 Apr 2025"
        },
        {
            "title": "Ngezi Platinum Stars suffer first defeat of the season",
            "url": "https://www.newzimbabwe.com/ngezi-platinum-stars-suffer-first-defeat-of-the-season/",
            "content": "By Sports Reporter\n\nNGEZI Platinum Stars were Saturday afternoon handed a 2-1 defeat by TelOne F.C to record their first loss of the season.\n\nThe Mhondoro-based side, however, maintained their stay on top of the log with 13 points, two ahead of MWOS who is travelling to Wadzanayi for a date against Herentals F.C.\n\nMadamburo was enjoying its best start in the Premier Soccer League (PSL) football history after picking one draw and four wins in its first five games.\n\nSpeaking after Saturdays match, Ngezi Platinum Stars coach Takesure Chiragwi saluted his boys performance despite ending on the losing end.\n\nOn the road they are some games that are difficult for you, and we have lost but we have to pick ourselves going forward because its a marathon.\n\nI think we have to applaud ourselves despite the result. We played well and our performance can guarantee us a positive result in our next game, he said.\n\nSaturdays result saw TelOne bouncing back to winning ways after losing to Simba Bhora last week.TelOnes seond goal came from their inform striker Washington Navaya, who is now leading the top goalscorers chart with five goals.\n\nNavaya was last month voted the leagues Player of The Month, earning praises from team coach Herbert Maruwa.\n\nWe needed to respond after last weeks defeat and l am happy, we did that.\n\nOf course, our players did what we wanted, Washington Navaya scoring for us again is good, l am happy that he is doing his job.\n\nUsually, he is remaining behind to do some extras and its good to have such kind of players, said Maruwa.\n\nMeanwhile, Manica Diamonds were handed a heavy 4-1 defeat by Simba Bhora at Wadzanayi Stadium while Triangle went down 2-1 to Bikita Minerals at Gibbo Stadium.\n\nAt Rufaro Stadium, Yadah Stars managed to hold money bags Scottland F.C to a 1-1 draw as FC Platinum settled for a 0-0 draw against Green Fuel.\n\nCastle Lager Premier Soccer League Matchday 5 fixtures\n\nHighlanders vs CAPS United (Barboufields Stadium)\n\nHerentals vs MWOS FC (Wadzanayi Stadium).\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/08/05212406/Ngezi-Platinum.jpg",
            "description": "<p>By Sports Reporter NGEZI Platinum Stars were Saturday afternoon handed a 2-1 defeat by TelOne F.C to record their first loss of the season. The Mhondoro-based side, however, maintained their stay on top of the log with 13 points, two ahead of MWOS who is travelling to Wadzanayi for a date against Herentals F.C. Madamburo</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ngezi-platinum-stars-suffer-first-defeat-of-the-season/\">Ngezi Platinum Stars suffer first defeat of the season</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "13 Apr 2025"
        },
        {
            "title": "Zimbabwe ready to host Under 20 Rugby Africa Barthes Trophy tournament",
            "url": "https://www.newzimbabwe.com/zimbabwe-ready-to-host-under-20-rugby-africa-barthes-trophy-tournament/",
            "content": "By Sports Reporter\n\nZIMBABWE Rugby Union (ZRU) president Losson Mtongwiza says his union is ready to host the mens Under 20 Rugby Africa Barthes Trophy tournament, which is scheduled to kick off April 19.\n\nThe event will feature four nations namely, Kenya, Namibia, Tunisia and host Zimbabwe.\n\nScheduled to run for nine days, the tournament will have all its games played at Old Hararians Sports Club, a shift from Harare Sports Club, where it was hosted last year.\n\nZimbabwe was retained as the host for the prestigious tournament after winning the bid ahead of Kenya, who hosted in 2022 and 2023.\n\nWe are very ready for it. We are looking forward to hosting Kenya, Namibia, Tunisia.\n\nThis is the top four in as far as the Under-20s are concerned, and we are looking forward to going back to winning ways, said Mtongwiza.\n\nDespite hosting the Barthes Trophy successfully last year, ZRU was, however, in the spotlight for poor players welfare during the tourney.\n\nThe Junior Sables did not receive allowances from the union, on top of that they were booked in sub-par accommodation.\n\nHowever, the new ZRU president Mtongwiza has given assurance of an improved players welfare this time around.\n\nThe players have been working hard and the technical team has been with them for the past six to eight months.\n\nObviously we are very satisfied with their preparations, we value our players, they are our triple VIPs.\n\nWe have been doing our best to try and support them, obviously to remunerate them and to encourage them to go out and win.\n\nSo, it will be exactly the same for these Under-20s, he added\n\nZimbabwe lost to Kenya in last years Barthes Trophy final hence failing to retain the trophy they had defended for two years after winning the tournament in 2022 and 2023.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/27175857/rugby-africa.jpg",
            "description": "<p>By Sports Reporter ZIMBABWE Rugby Union (ZRU) president Losson Mtongwiza says his union is ready to host the men’s Under 20 Rugby Africa Barthes Trophy tournament, which is scheduled to kick off April 19. The event will feature four nations namely, Kenya, Namibia, Tunisia and host Zimbabwe. Scheduled to run for nine days, the tournament</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-ready-to-host-under-20-rugby-africa-barthes-trophy-tournament/\">Zimbabwe ready to host Under 20 Rugby Africa Barthes Trophy tournament </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "13 Apr 2025"
        },
        {
            "title": "Zimbabwe’s governance ‘off course’– says EU, withdraws funding over controversial PVO Act",
            "url": "https://www.newzimbabwe.com/zimbabwes-governance-off-course-says-eu-withdraws-funding-over-controversial-pvo-act/",
            "content": "By Costa Nkomo\n\nPRESIDENT Emmerson Mnangagwas decision to sign the Private Voluntary Organisations (PVO) Bill into law has elicited a sharp rebuke from the European Union (EU), effectively shutting the door on future good governance funding.\n\nThis latest development comes as Zimbabwe appears determined to chart its own course, regardless of international concerns about human rights and transparency.\n\nThe timing of Mnangagwas signature  just hours before the commissioning of Mbares revamped informal traders market  did not go unnoticed, drawing criticism for what some view as disregard for the concerns of civil society.\n\nJobst von Kirchmann, the EU Ambassador to Zimbabwe, delivered a blunt assessment, stating that Mnangagwas insincerity had forced the bloc to withdraw its support for the good governance framework.\n\nThe situation, according to the EU, has reached a tipping point.\n\nThe PVO Act is disappointing and ill-considered, sidelining the views of diplomats and civil society organisations, von Kirchmann stated.\n\nZimbabwe has over USD 21 billion in debt and arrears with bilateral and multilateral creditors. Several years ago, the Government of Zimbabwe initiated a commendable arrears clearance and debt resolution process to address this situation.\n\nIt is disappointing to see that Zimbabwe has not upheld its own commitments under this process, particularly regarding the expansion of civic space.\n\nThe enactment of the PVO Amendment Bill, without concluding consultations to address the concerns of civil society organisations, has further reinforced negative trends in governance.\n\nAs a consequence, the European Union has decided to discontinue its planned targeted 2025 funding in support of the governments good governance initiatives under the structured dialogue framework, he said.\n\nHe added: The EU remains engaged and ready to reconsider its position should the government demonstrate a genuine commitment to meeting the governance targets outlined in the process.\n\nThe new law grants authorities sweeping powers to monitor and control the operations of private voluntary organisations, casting a long shadow over Zimbabwes civic space and raising serious questions about the future of independent advocacy.\n\nMnangagwa signed the controversial PVO Amendment Bill into law, ushering in sweeping changes to Zimbabwes regulatory framework for civic groups and non-governmental organisations.\n\nThe law, gazetted last Friday as Act No. 1 of 2025, amends five major pieces of legislation, including the PVO Act [Chapter 17:05], the Money Laundering and Proceeds of Crime Act, and the Criminal Law (Codification and Reform) Act. It is now officially enforceable.\n\nAccording to the gazetted text, the new Act gives authorities extensive powers to monitor and control the operations of PVOs, including the ability to scrutinise their ownership structures, funding sources, and affiliations.\n\nIt introduces strict definitions of beneficial owner and controller, potentially holding individuals criminally liable  including with imprisonment terms of up to 35 years  for offences related to illicit financing or misrepresentation.\n\nThe law also empowers the government to deregister organisations, seize assets, or dissolve entities found to be in breach of the new provisions, a move described by critics as a chilling effect on freedom of association.\n\nThe Act establishes a PVOs Board, comprised of representatives from civil society and multiple ministries, to oversee regulation of the sector.\n\nThis board, while ostensibly designed to provide oversight, is viewed by some quarters as a tool for entrench government control.\n\nAgainst intense criticism, even from the United Nations, government officials have defended the amendments as necessary to prevent the financing of terrorism and money laundering.\n\nHuman rights groups, however, argue that the legislation opens the door to the systematic suppression of dissent, potentially stifling organisations that challenge State policies or expose official corruption.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/13053656/Photo-de-Jobst-von-Kirchmann-juin-2021-1.jpg",
            "description": "<p>By Costa Nkomo PRESIDENT Emmerson Mnangagwa’s decision to sign the Private Voluntary Organisations (PVO) Bill into law has elicited a sharp rebuke from the European Union (EU), effectively shutting the door on future good governance funding. This latest development comes as Zimbabwe appears determined to chart its own course, regardless of international concerns about human</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-governance-off-course-says-eu-withdraws-funding-over-controversial-pvo-act/\">Zimbabwe’s governance ‘off course’– says EU, withdraws funding over controversial PVO Act</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "13 Apr 2025"
        },
        {
            "title": "‘Don’t exploit traders’— Mnangagwa says amid controversy surrounding user fees at new Mbare Musika Market Hub",
            "url": "https://www.newzimbabwe.com/dont-exploit-traders-mnangagwa-says-amid-controversy-surrounding-user-fees-at-new-mbare-musika-market-hub/",
            "content": "UNCERTAINTY hangs over traders at the new Mbare Musika Market Hub, as responsible government officials remain evasive on the fees users will be expected to pay for stalls at the newly constructed facility.\n\nThe lack of transparency has fuelled anxieties among stakeholders amid rumour that traders would be expected to pay extortionate rentals.\n\nAlso, concerns are mounting over the allocation of trading spaces, with allegations emerging that Zanu PF is favouring its own members, potentially sidelining the very traders, who suffered losses in the devastating fire that ravaged the old market last October.\n\nThe suggestion of preferential treatment has sparked outrage and accusations of political opportunism.\n\nSpeaking at the official opening of the new market in Mbare Friday, President Emmerson Mnangagwa called on the Local Government minister to exercise fairness when setting rental rates for the traders.\n\nHis plea for moderation hinted at underlying tensions and a need to address the growing unease among those most affected.\n\nMnangagwa formally opened the first phase of the Mbare Musika Traders Market project, a development that promises to accommodate up to 1,700 traders.\n\nWe have built this facility to provide you with a conducive environment in which to conduct your businesses. The Minister of Local Government must not exploit traders, Mnangagwa stated emphatically.\n\nHe added, It is incumbent upon you, the traders, to act responsibly as you conduct your businesses within this facility.\n\nDespite the Presidents directive, Garwe remained cagey, dismissing social media reports of exorbitant rental fees but offering no concrete details.\n\nDo not give credence to the lies propagated on social media. Rentals will be very affordable. This facility is for you, a statement met with cheers tinged with scepticism.\n\nGarwe also announced that Masimba Holdings, the company awarded the US$200,000 contract to construct the new trading site, would be granted further contracts for phases two and three of the project, bypassing standard competitive tendering processes under the guise of an ongoing emergency.\n\nThis decision has raised eyebrows, with critics questioning the probity of awarding further lucrative contracts without due process.\n\nAdding fuel to the fire, Women Affairs and Small and Medium Enterprise Minister Monica Mutsvangwa openly acknowledged the governments primary motive behind the market development: to increase revenue collection through rental income.\n\nThis will enable us to collect more taxes from people. The Minister of Finance, Professor Mthuli Ncube, is in agreement. We are appealing to local authorities to continue making land available for the construction of trading markets, so that we can bolster our economy, Mutsvangwa stated bluntly.\n\nWhen pressed for specifics regarding rental charges, Mutsvangwa echoed Garwes evasiveness.\n\nThe City of Harare, Masimba Holdings, and the Local Government Ministry will convene to determine the rates for traders. We do not want to burden our people with excessive fees. You heard what the President said, she offered, deflecting the responsibility onto a future, unspecified meeting.\n\nThe newly constructed Mbare Musika Market Hub\n\nIn contrast to the ministers ambiguous pronouncements, Harare Mayor Jacob Mafume revealed to Newzimbabwe.com that traders would be expected to shell out US$30 per week for access to the facility.\n\nEach trader will pay US$30 per week. This is the agreement reached with our partners: the government and Masimba Holdings. We believe that US$30 per week represents a fair price, he said, albeit providing the clarity conspicuously absent from the governments messaging.\n\nThe new traders market was constructed through a partnership involving the Government of Zimbabwe, the City of Harare, and Masimba Holdings, acting as a technical partner.\n\nThe project was initiated in response to the devastating fire that swept through the market on the night of 8 October 2024, destroying traders goods valued at an estimated US$20 million and affecting more than 4,000 individuals.\n\nIn what many perceived as a callous remark then, Garwe suggested that the disaster, which left countless traders destitute, was something of a silver lining, presenting the government with an opportunity to build a facility designed for efficient revenue collection.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/12055505/GoPs4jrW4AAyPcD.jpeg",
            "description": "<p>By Costa Nkomo UNCERTAINTY hangs over traders at the new Mbare Musika Market Hub, as responsible government officials remain evasive on the fees users will be expected to pay for stalls at the newly constructed facility. The lack of transparency has fuelled anxieties among stakeholders amid rumour that traders would be expected to pay extortionate</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dont-exploit-traders-mnangagwa-says-amid-controversy-surrounding-user-fees-at-new-mbare-musika-market-hub/\">‘Don’t exploit traders’— Mnangagwa says amid controversy surrounding user fees at new Mbare Musika Market Hub</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "13 Apr 2025"
        }
    ]
}