{
    "news": [
        {
            "title": "Black smoke signals no pope elected in first conclave vote",
            "url": "https://www.newzimbabwe.com/black-smoke-signals-no-pope-elected-in-first-conclave-vote/",
            "content": "Black smoke billowed from the chimney of the Sistine Chapel on Wednesday evening, signalling an inconclusive first vote by cardinals locked in the Sistine Chapel in aconclave to elect a new popeto guide the Roman Catholic Church.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/07203408/sistine-chapel.webp",
            "description": "<p>Reuters Black smoke billowed from the chimney of the Sistine Chapel on Wednesday evening, signalling an inconclusive first vote by cardinals locked in the Sistine Chapel in a conclave to elect a new pope to guide the Roman Catholic Church. Thousands of faithful gathered in St. Peter’s Square waiting for smoke to pour from a narrow</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/black-smoke-signals-no-pope-elected-in-first-conclave-vote/\">Black smoke signals no pope elected in first conclave vote</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "07 May 2025"
        },
        {
            "title": "Duo accused of raping socialite granted bail",
            "url": "https://www.newzimbabwe.com/duo-accused-of-raping-socialite-granted-bail/",
            "content": "By Staff Reporter\n\nTwo Harare men who landed in the dock on allegations of raping a Harare socialite have been granted US$200 bail each by magistrate Marehwanazvo Gofa.\n\nThe magistrate said the two, Blessing Dube (27) from Chitungwiza and Martin Charlie (25) from Manresa, were not a flight risk.\n\nThey will be back in court on June 5 as they await their trial.\n\nThe two deny the allegations and argue that it was transactional sex which went wrong after the parties failed to agree on the fee for the services.\n\nIt is alleged that on April 9 2025, Dube contacted Masendeke, inviting her for a business meeting, but they failed to meet on the day in question.\n\nOn April 30 2025, Masendeke allegedly received a WhatsApp message from Charlie, and they met at Megawatt along Samora Machel, and he drove to number 11 Frank Johnson Eastlea for a business meeting.\n\nThe second accused (Charlie) went into the building pretending to go and see his boss and he came back in a few minutes. The first accused (Dube) came with a certain lady called Sbahle and they entered the car.\n\nThe second accused drove to town, where Sbahle dropped off and then drove to Eastlea where he parked at number 15 Frank Johnson Avenue, Harare.\n\nThe first accused went into the building, and the second accused told the complainant to go inside the room where the meeting was supposed to be held.\n\nThe complainant was shocked to see a bed, and when she turned back, she saw the second accused locking the door and the first accused entered the room using the other door, locked it and started to laugh.\n\nThe complainant cried for help but was silenced by the first accused who told her not to anger the second accused and ordered her to remove her clothes, reads court papers.\n\nThe court heard that Charlie pushed her onto the bed and undressed her and Dube forced her to suck his manhood.\n\nThe two allegedly took turns to rape her whilst forcing themselves on her mouth.\n\nAfter the act, the complainant went to the bathroom where the second accused was, and he again had sexual intercourse with her once without her consent.\n\nThe first accused also had sexual intercourse with her for the second time without her consent, the State alleges further.\n\nThe court heard that the accused persons booked an InDrive taxi for the complainant, and she went home which is when she filed a police report.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/28155839/Harare-Magistrates-Court.jpg",
            "description": "<p>By Staff Reporter Two Harare men who landed in the dock on allegations of raping a Harare socialite have been granted US$200 bail each by magistrate Marehwanazvo Gofa. The magistrate said the two, Blessing Dube (27) from Chitungwiza and Martin Charlie (25) from Manresa, were not a flight risk. They will be back in court</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/duo-accused-of-raping-socialite-granted-bail/\">Duo accused of raping socialite granted bail </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "07 May 2025"
        },
        {
            "title": "International gang sentenced for smuggling thousands of ants in Kenya",
            "url": "https://www.newzimbabwe.com/international-gang-sentenced-for-smuggling-thousands-of-ants-in-kenya/",
            "content": "BBC\n\nA Kenyan court has sentenced four men to one year in prison or pay a fine of $7,700 (5,800) for trying to smuggle thousands of live ants out of the country.\n\nThe four suspects  two Belgians, a Vietnamese and a Kenyan  were arrested last month with 5,000 ants at a guest house in the western town of Naivasha.\n\nThey had pleaded guilty to the charges and told the court that they were collecting the highly sought-after ants as a hobby and didnt think it was illegal.\n\nBut delivering the sentence on Wednesday, the court said the particular species of ants collected was valuable and they had thousands of them  not just a few.\n\nIt is believed that the ants were intended for exotic pet markets in Europe and Asia.\n\nThe contraband included giant African harvester ants, which are valued by some UK dealers at up to 170 ($220) each.\n\nBelgian nationals Lornoy David and Seppe Lodewijckx, both 19, Vietnamese national Duh Hung Nguyen and Kenyan Dennis Nganga, were handed similar terms after the magistrate considered their mitigation arguments.\n\nThe Belgians were found with 5,000 ants, while Nguyen and Nganga had 300.\n\nThe Kenya Wildlife Service (KWS), which is more used to protecting larger creatures, such as lions and elephants, has described this as a landmark case.\n\nThe case showed a disturbing shift in trafficking patterns  from iconic mammals to lesser-known species that are vital to ecological balance, the KWS said last month when the four were arrested.\n\nThe Belgian teens had entered Kenya on a tourist visa and were staying in Naivasha, a town popular with tourists for its animal parks and lakes.\n\nThe KWS said the demand for rare insect species was growing.\n\nIn Kenya, the ants are protected by international bio-diversity treaties and their trade is highly regulated.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/07121558/ants-gang.webp",
            "description": "<p>BBC A Kenyan court has sentenced four men to one year in prison or pay a fine of $7,700 (£5,800) for trying to smuggle thousands of live ants out of the country. The four suspects – two Belgians, a Vietnamese and a Kenyan – were arrested last month with 5,000 ants at a guest house</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/international-gang-sentenced-for-smuggling-thousands-of-ants-in-kenya/\">International gang sentenced for smuggling thousands of ants in Kenya</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "07 May 2025"
        },
        {
            "title": "UK: Boy, 13, dies after jumping into canal",
            "url": "https://www.newzimbabwe.com/uk-boy-13-dies-after-jumping-into-canal/",
            "content": "MetroUK\n\nA boy who died after jumping into a canal in Exeter has been named as Delvin Musakwa, 13, from Exeter.\n\nThe alarm was raised after the boy, 13, didnt resurface after plunging into the waterway on Clapperbrook Lane East Monday afternoon.\n\nThe emergency services arrived at the scene at about 4.35pm, after he failed to surface after jumping into the water, the police said.\n\nHe was pulled from the water and rushed to the hospital in a serious condition, where he later died.\n\nHis next of kin have been informed of the death, which is not being treated as suspicious.\n\nOne eyewitness said he saw all the emergency services race past Marsh Barton and the air ambulance above.\n\nActing Superintendent Chris Conway, of Devon and Cornwall Police, said: This is an awful and tragic incident, and we offer our condolences to the family, who are being supported by specialist officers.\n\nWe would ask that the privacy of the family is respected as they come to terms with their devastating loss.\n\nPeople reacted to the news of the boys death, with one saying it is an unbelievably sad situation.\n\nOne man who said he knew the boy said it is heartbreaking to hear, he was the most happiest kid I know.\n\nAnother wrote: So very sad.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/07120703/delvin.webp",
            "description": "<p>MetroUK A boy who died after jumping into a canal in Exeter has been named as Delvin Musakwa, 13, from Exeter. The alarm was raised after the boy, 13, didn’t resurface after plunging into the waterway on Clapperbrook Lane East Monday afternoon. The emergency services arrived at the scene at about 4.35pm, after he ‘failed</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uk-boy-13-dies-after-jumping-into-canal/\">UK: Boy, 13, dies after jumping into canal</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "07 May 2025"
        },
        {
            "title": "Health Professions Authority raise concerns over illegal rehabilitation centres",
            "url": "https://www.newzimbabwe.com/health-professions-authority-raise-concerns-over-illegal-rehabilitation-centres/",
            "content": "By Staff Reporter\n\nThe Health Professions Authority (HPA) of Zimbabwe has expressed its concern over medical rehabilitation facilities operating across the country without registration and licensing.\n\nIn a statement, the HPA Secretary General, Clotilda Chimbwanda, said these illegal rehab centres lack numerous standards to run a facility which poses a risk to the patients.\n\nThe HPA, mandated by the Health Professions Act [Chapter 27:19], is the regulatory body responsible for ensuring that all health institutions and health professionals in Zimbabwe adhere to the highest standards of care. The HPA manual clearly stipulates the requirements for the registration and licensing of health facilities, including those providing medical rehabilitation services.\n\nIt has come to the attention of the HPA that numerous facilities are operating without the requisite registration, offering services such as substance abuse rehabilitation, mental health rehabilitation, physiotherapy and occupational therapy and other forms of rehabilitative care.\n\nThese illegal facilities often lack qualified personnel, appropriate infrastructure, and adherence to established medical protocols. This poses serious risks to patients, including substandard care, abuse and neglect, spread of infectious diseases, administration of harmful or unproven treatment and lack of recourse, said Chimbwanda.\n\nZimbabwe has in recent years seen a sharp rise in drug and substance abuse, especially among youths, with the high unemployment rate and economic situation being identified as chief among the causes.\n\nHPA has engaged with the law enforcement agencies to clamp down on these illegal centres, which are violating the HPA Act.\n\nHPA wishes to emphasize that operating an unregistered health facility is a violation of the Health Professions Act [Chapter 27:19]. The Authority is working in collaboration with law enforcement agencies to identify and close down these illegal facilities and bring the perpetrators to justice. HPA urges the public to verify the registration status of any medical rehabilitation centre before seeking treatment or admitting a loved one, said Chimbwanda\n\nThe HPA has listed down the legal registered health facilities and encouraged members of the public to report any other bogus institutions to the law enforcement agencies.\n\nBelow is the list of registered admitting rehabilitation centres in Zimbabwe:\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/24043759/Drug-Abuse-Zimbabwe.png",
            "description": "<p>By Staff Reporter The Health Professions Authority (HPA) of Zimbabwe has expressed its concern over medical rehabilitation facilities operating across the country without registration and licensing. In a statement, the HPA Secretary General, Clotilda Chimbwanda, said these illegal rehab centres lack numerous standards to run a facility which poses a risk to the patients. “The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/health-professions-authority-raise-concerns-over-illegal-rehabilitation-centres/\">Health Professions Authority raise concerns over illegal rehabilitation centres</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "07 May 2025"
        },
        {
            "title": "African Sun tables aggressive refurbishment initiatives",
            "url": "https://www.newzimbabwe.com/african-sun-tables-aggressive-refurbishment-initiatives/",
            "content": "By Alois Vinga\n\nTOP hospitality group, African Sun Limited (ASL) has tabled an aggressive refurbishment initiative which will further enhance the brands competitiveness on the global front.\n\nPresenting the groups performance for the period ended December 31 2024, ASL board chairperson Lloyd Mhishi said that in the year ahead, a number of refurbishment initiatives will be implemented.\n\nThe group achieved notable progress in its refurbishment initiatives during the year, which primarily included the completion of public area renovations at Hwange Safari Lodge. Plans for 2025 include commencing the refurbishments of Holiday Inn Harare, Elephant Hills Resort, Troutbeck Timeshare Lodges and the second phase of renovations at The Victoria Falls Hotel, he said.\n\nOn the downside, Mhishi said these refurbishments will prompt reduced rooms inventory for the group for the 2025 financial year underscoring that such strategic capital investments aim to enhance guest experiences and grow the portfolios market share.\n\nDespite the mixed fortunes in the economic environment, which saw the 43% devaluation of the ZWG currency triggering exchange rate losses, the group achieved positive volume growth across all its segments.\n\nRevenue from continuing operations at US$ 53,98 million increased by 15% compared to the prior year, supported by growth in occupancy and stronger Average Daily Rates which increased by 3% to US$ 119, compared to US$ 115 in the prior year.\n\nContinuing operations revenue was further bolstered by the Real Estate segments contribution of US$ 3.02 million, primarily driven by residential stand sales. Revenue from the Groups discontinued operations, which consists of the Great Zimbabwe Hotel, Monomotapa Hotel, and Sun Leisure Tours, amounted to USD 8.24 million.\n\nTotal Group revenue, including discontinued operations, amounted to US$ 62.22 million, representing a 14% growth from the prior year.\n\nAs we move into 2025, we remain optimistic about the recovery of the tourism sector, building on the progress made in the local market and the ongoing rebound of international travel. The UN Tourism Organization forecasts a 5% growth in international tourist arrivals, driven by the full recovery of the Asia and Pacific markets and robust growth across most other regions, added Mhishi.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/06070051/Mhishi.jpg",
            "description": "<p>By Alois Vinga TOP hospitality group, African Sun Limited (ASL) has tabled an aggressive refurbishment initiative which will further enhance the brand’s competitiveness on the global front. Presenting the group’s performance for the period ended December 31 2024, ASL board chairperson Lloyd Mhishi said that in the year ahead, a number of refurbishment initiatives will</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/african-sun-tables-aggressive-refurbishment-initiatives/\">African Sun tables aggressive refurbishment initiatives</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "07 May 2025"
        },
        {
            "title": "‘Don’t pay bills for services not delivered’— says govt, sets minimum standards for councils",
            "url": "https://www.newzimbabwe.com/dont-pay-bills-for-services-not-delivered-says-govt-sets-minimum-standards-for-councils/",
            "content": "By Staff Reporter\n\nLOCAL authorities will now be required to provide residents and ratepayers with services that conform to set minimum standards.\n\nThis follows the approval and adoption by Cabinet of the Minimum Service Delivery Standards Framework, which prioritises water supply, sanitation, solid waste management, roads and public lighting, corporate governance, public health, environmental issues and housing and community services.\n\nSpeaking during a post-cabinet briefing in Harare on Tuesday, Information, Publicity and Broadcasting Services Minister, Jenfan Muswere, revealed that the benchmarks had been approved by cabinet, which is chaired by President Emmerson Mnangagwa.\n\nCabinet considered and approved the Minimum Service Delivery Standards for Local Authorities Framework. The nation will recall that in 2023, His Excellency the President, Cde Dr ED Mnangagwa officially launched the Blueprint on A call to Action. No Compromise to Service Delivery: First stage of interventions to modernise the operations of local authorities towards Vision 2030.\n\nLocal authorities were directed to develop roadmaps towards the attainment of the Vision. On its part, the Government of Zimbabwe developed minimum service delivery standards to guide local authorities in the implementation of their roadmaps, said Muswere.\n\nThe objectives for developing minimum service delivery standards include defining the minimum levels of services that local authorities should provide, and the nature of service recipients should expect in terms of quantity, quality, time and cost.\n\nOther objectives are to determine the minimum cost for the provision of services, to provide uniformity and consistency in the provision of services at local level, and to provide a basis upon which feedback on the level of satisfaction against the standards will be evaluated.\n\nEach area has performance indicators, benchmarks and performance standards. The data will be submitted online, with a real-time dashboard system being implemented to track, monitor and evaluate progress.\n\nThe performance of local authorities, both urban and rural, will be based on assessments set in the minimum service delivery standards framework, he said.\n\nMuswere added that residents and ratepayers must demand from local authorities services commensurate with what they are billed. He said residents must ignore bills for services that would not have been delivered.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/09054809/muswere.jpeg",
            "description": "<p>By Staff Reporter LOCAL authorities will now be required to provide residents and ratepayers with services that conform to set minimum standards. This follows the approval and adoption by Cabinet of the Minimum Service Delivery Standards Framework, which prioritises water supply, sanitation, solid waste management, roads and public lighting, corporate governance, public health, environmental issues</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dont-pay-bills-for-services-not-delivered-says-govt-sets-minimum-standards-for-councils/\">‘Don’t pay bills for services not delivered’— says govt, sets minimum standards for councils</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "07 May 2025"
        },
        {
            "title": "Chinhoyi Deputy Mayor jailed for double-dipping in housing stands allocation schemes",
            "url": "https://www.newzimbabwe.com/chinhoyi-deputy-mayor-jailed-for-double-dipping-in-housing-stands-allocation-schemes/",
            "content": "By Staff Reporter\n\nCHINHOYI Deputy Mayor, Chipo Mlotshwa, has been jailed for 36 months for lying that she had not earlier benefited from a council stands discount facility.\n\nThe misrepresentation resulted in her getting two subsidised stands.\n\nThe Ward 14 councillor was spared a custodial sentence after Regional Magistrate Vakayi Chikwekwe ordered her to perform 840 hours of community service at Alaska Primary School or serve 24 months in prison.\n\nA further 12 months were set aside on condition of good behaviour.\n\nProsecutor Marceline Mudzongo told the court that on July 23, 2019, Mlotshwa misrepresented to the Municipality of Chinhoyi that she had not benefited from the councils discount facility on stands sold to councillors.\n\nOn the basis of the lies, Mlotshwa was allocated a stand measuring 2,504.6 square metres and valued at ZWL$17,270.70 or USD$17,270.70, in Mapako, Chinhoyi.\n\nShe was granted a 40 percent discount and paid ZWL10,362.42 for the land. Chinhoyi Municipality suffered a prejudice of ZWL6,908.28 or US$6,908.28.\n\nAn investigation later unearthed that the deputy mayor had been allocated another discounted stand on June 29, 2011.\n\nThis was contrary to the Ministry of Local Governments Circular Number 12, which stipulates councillors allowances and perks. According to the circular, a councillor is only eligible for one residential stand in their lifetime.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/07085350/IMG-20250506-WA0011.jpg",
            "description": "<p>By Staff Reporter CHINHOYI Deputy Mayor, Chipo Mlotshwa, has been jailed for 36 months for lying that she had not earlier benefited from a council stands discount facility. The misrepresentation resulted in her getting two subsidised stands. The Ward 14 councillor was spared a custodial sentence after Regional Magistrate Vakayi Chikwekwe ordered her to perform</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chinhoyi-deputy-mayor-jailed-for-double-dipping-in-housing-stands-allocation-schemes/\">Chinhoyi Deputy Mayor jailed for double-dipping in housing stands allocation schemes</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "07 May 2025"
        },
        {
            "title": "Takesure Chinyama bounces back at Dynamos as strikers coach",
            "url": "https://www.newzimbabwe.com/takesure-chinyama-bounces-back-at-dynamos-as-strikers-coach/",
            "content": "By Sports Reporter\n\nFormer Dynamos striker Takesure Chinyama has bounced back at the club as striker coach.\n\nThis was revealed by the club on Tuesday morning via a statement.\n\nChinyama will work under the current technical team led by Lloyd Mablanyo Chigowe.\n\nDynamos Football Club is committed to continuous improvement and addressing the challenges the Club is currently facing in the league.\n\nAs part of a strategic step-by-step approach to enhance our technical department, the club is pleased to announce the appointment of Takesure Chinyama as the new Strikers Development Coach/Assistant Coach, read part of Dynamos statement.\n\nChinyama played for Dembare in 2012 before leaving mid-season to join South African giants Orlando Pirates.\n\nHe then returned to the club in 2015 before making another move to Poland the following year.\n\nHis appointment is part of Dembares move to ease the clubs goal drought.\n\nTakesure Chinyama, a prolific striker during his playing days, played for Dynamos FC among other clubs locally, then Poland and South Africa with a career spanning almost two decades.\n\nChinyama, a holder of UEFA B License, transitioned into coaching after an illustrious career.\n\nHis expertise and experience will be a valuable addition to the team as we work towards turning around our performances.\n\nThis appointment is part of the clubs broader plan to reinforce the technical setup while maintaining stability within the squad.\n\nDembare has only managed to score two goals in 10 games, making themselves the lowest scoring team in the league at the present moment.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/07041056/Takesure-Chinyama.webp",
            "description": "<p>By Sports Reporter Former Dynamos striker Takesure Chinyama has bounced back at the club as striker coach. This was revealed by the club on Tuesday morning via a statement. Chinyama will work under the current technical team led by Lloyd “Mablanyo” Chigowe. “Dynamos Football Club is committed to continuous improvement and addressing the challenges the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/takesure-chinyama-bounces-back-at-dynamos-as-strikers-coach/\">Takesure Chinyama bounces back at Dynamos as strikers coach</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "07 May 2025"
        },
        {
            "title": "Conservation under threat as Mines Ministry continues to entertain applications to mine in protected areas – ZimParks",
            "url": "https://www.newzimbabwe.com/conservation-under-threat-as-mines-ministry-continues-to-entertain-applications-to-mine-in-protected-areas-zimparks/",
            "content": "By Anna Chibamu\n\nCONSERVATION is under serious threat from mining activities in protected areas countrywide, puttingwild animals at risk of extinction, a Zimbabwe Parks and Wildlife ManagementAuthority (ZimParks) official has said.\n\nGiving oral evidence to the Tourism and Hospitality Industry Parliamentary Portfolio Committee this Monday, ZimParks Corporate Secretary Nyasha Mutyambizi said the Mines ministry continued to accept applications for mining purposes in the restricted areas meant for conservation and tourism.\n\nMutyambizi said tourists were no longer keen to visitZimbabwe due to the rampant mining activities in tourist attraction areas.\n\nAccording to the World Wildlife Fund (WWF), Zimbabwe has the second largest elephant population and third largest total numbers of rhinos in Southern Africa (excluding South Africa) and the third largest individual black rhino population in the world.\n\nOur international market of tourists is now questioning how conservation and mining coexist.\n\nThey are asking: Why should we come to Zimbabwe when your laws do not protect animals?\n\nBecause there are people who are very passionate about animals, and they believe that as a government, as an authority, we should be able to stop mining in areas such as Matopos National Park, Mutyambizi said.\n\nMost people believe that the richest mining deposits are within these areas.\n\nEverybody wants to come and mine in these areas and this is putting a lot of pressure on the department as we struggle to conserve the areas.\n\nEven though the government has put in place some cabinet resolutions, ZimParks has had two or three mining in the proxy state.\n\nWe are constantly surprised to continue seeing applications going through our colleagues at Ministry of Mines.\n\nLast week, we had some public hearings with the Mines Board where there was such a request.\n\nAnd despite everybody being optimistic, we could still hear them requesting to explore 16 hectares. The Mines Ministryand the client were saying, okay, we will not do the 16 hectares, allow us to do one hectare, she told the Parly committee.\n\nShe continued: We do not understand why these applications are being entertained with a similar problem for Matopos, one of our flagships.\n\nWe received hundreds of complaints and petitions from all over the world, from embassies, but we seem not to really have that much value for conservation.\n\nBut we know that conservation, if we look after our animals, if we look after our areas, we have the potential to generate more money. Conservation preserves the environment and generations will continue to come and see these areas.\n\nMutyambizi, however, highlighted that there was conflicting legislation on mining and conservation in Zimbabwe, making it difficult to take full control of the protected areas.\n\nWe do have a serious problem but as ZimParks, all we can do is to try and use our own legislation, but we have got conflicting legislation that is also coming into our areas.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26171635/Hwange-National-Park_11.jpg",
            "description": "<p>By Anna Chibamu CONSERVATION is under serious threat from mining activities in protected areas countrywide, putting wild animals at risk of extinction, a Zimbabwe Parks and Wildlife Management Authority (ZimParks) official has said. Giving oral evidence to the Tourism and Hospitality Industry Parliamentary Portfolio Committee this Monday, ZimParks Corporate Secretary Nyasha Mutyambizi said the Mines ministry continued</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/conservation-under-threat-as-mines-ministry-continues-to-entertain-applications-to-mine-in-protected-areas-zimparks/\">Conservation under threat as Mines Ministry continues to entertain applications to mine in protected areas – ZimParks </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "07 May 2025"
        }
    ]
}