{
    "news": [
        {
            "title": "Auditor General’s Report: Over half a billion US dollars paid by Treasury unaccounted for",
            "url": "https://www.newzimbabwe.com/auditor-generals-report-over-half-a-billion-us-dollars-paid-by-treasury-unaccounted-for/",
            "content": "By Costa Nkomo\n\nThe latest Auditor Generals Report has once again raised flagrant breaches of Public Finance Management regulations, revealing that, as of June 2025, a staggering sum exceeding half a billion United States dollars paid by the Treasury to service providers on behalf of Ministries, Departments and Agencies (MDAs) in 2024 remains unaccounted for.\n\nThis substantial shortfall undermines fiscal transparency and accountability, principles crucial for sound governance.\n\nA key finding highlights a failure by MDAs to properly upload payment information onto the Public Finance Management System (PFMS). This omission creates a loophole that could facilitate embezzlement and corruption.\n\nThe report reads: Direct payments amounting to US$1,986,391,797 were made to service providers on behalf of the MDAs by Treasury during the 2024 financial year. However, MDAs accounted for US$1,388,673,713, leaving a balance of US$597,718,082 as at June 18, 2025. In some instances, the payments were not uploaded onto the PFMS. MDAs expenditure was understated by the direct payments.\n\nThis discrepancy represents a significant material misstatement of public accounts.\n\nThe failure to reconcile these payments points to a serious breakdown in internal controls, increasing the risk of fraudulent activity and illicit enrichment.\n\nThe report further details a five-month period of opacity during the currency transition from ZWL to ZWG between April and August 2024. MDAs reportedly operated outside the PFMS during this period, resulting in a vacuum of financial oversight.\n\nThere was a downtime of the Public Financial Management Systems (PFMS) during the country changeover of currency from ZWL$ to Zimbabwe Gold (ZWG) for almost five (5) months (April to August 2024). During that time most MDAs operated outside the PFMS.\n\nThe financial information that would have been processed outside the system was not uploaded onto the system in some cases. Such information would misstate expenditure figures.\n\nThis prolonged systems downtime created a black box scenario, leaving the door open for potentially unlawful financial transactions and making it incredibly difficult to trace the flow of public funds.\n\nMoreover, the Auditor Generals Report casts a spotlight on the widespread abuse of fuel allocations, noting a concerning increase in such incidents compared to 2023.\n\nPoor record-keeping practices and inadequate internal controls were identified as primary contributing factors.\n\nCases of loss of fuel were on the increase. These were attributed to control weaknesses in fuel management, ranging from non-maintenance of fuel registers, inconsistent fuel recordings, non-performance of fuel reconciliations, absence of segregation of duties and weak supervisory checks. In this report, seven (7) MDAs had issues with fuel management. Measures around fuel management should be enhanced, the report added.\n\nThe lack of robust fuel management procedures indicates a serious disregard for public assets, exposing them to potential misappropriation and wastage.\n\nSuch inefficiencies have a detrimental impact on service delivery and overall economic performance.\n\nSection 298 of the Constitution of Zimbabwe enshrines the principles of transparency and accountability within public finance management.\n\nThese findings from the Auditor Generals Report underscore the urgent need for enhanced oversight, stronger internal controls, and the rigorous enforcement of financial regulations to safeguard public funds and promote responsible fiscal governance.\n\nThe scale of the irregularities demands immediate and decisive action to hold those responsible to account and to prevent future occurrences.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/17144600/rheah-kujinga.jpg",
            "description": "<p>By Costa Nkomo The latest Auditor General’s Report has once again raised flagrant breaches of Public Finance Management regulations, revealing that, as of June 2025, a staggering sum exceeding half a billion United States dollars paid by the Treasury to service providers on behalf of Ministries, Departments and Agencies (MDAs) in 2024 remains unaccounted for.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/auditor-generals-report-over-half-a-billion-us-dollars-paid-by-treasury-unaccounted-for/\">Auditor General’s Report: Over half a billion US dollars paid by Treasury unaccounted for</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:12",
            "date": "06 Aug 2025"
        },
        {
            "title": "Zimbabwe Under-17 men’s team learns COSAFA Cup opponents",
            "url": "https://www.newzimbabwe.com/zimbabwe-under-17-mens-team-learns-cosafa-cup-opponents/",
            "content": "By Sports Reporter\n\nZimbabwe has learned its opponents for the 2025 COSAFA Under-17 Mens Championship, set to take place from September 11 to 20.\n\nTournament hosts, Zimbabwe have been placed in Group Aalongside Mozambique, Comoros,and Eswatini.\n\nGroup Bfeatures South Africa, Madagascar, Malawi,and defending champions Zambia, while Group Ccomprises Angola, Botswana, Mauritius,and Lesotho.\n\nThis years edition of the tournament will also serve as the regional qualifier for the 2026 Under-17 Africa Cup of Nations (AFCON)for the Southern African countries.\n\nThe top three teams from the tournament will book their places at next years Under-17 mens AFCON, which will also be an Under-17 World Cup Qualifier for Africa.\n\nMeanwhile, the Zimbabwe Football Association (ZIFA) has confirmed that matches will be played at Heart Stadiumin Harareand Ngoni Stadiumin Norton, the home ground of MWOS FC.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/05062138/cosafa.jpeg",
            "description": "<p>By Sports Reporter Zimbabwe has learned its opponents for the 2025 COSAFA Under-17 Men’s Championship, set to take place from September 11 to 20. Tournament hosts, Zimbabwe have been placed in Group A alongside Mozambique, Comoros, and Eswatini. Group B features South Africa, Madagascar, Malawi, and defending champions Zambia, while Group C comprises Angola, Botswana, Mauritius, and Lesotho. This year’s edition</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-under-17-mens-team-learns-cosafa-cup-opponents/\">Zimbabwe Under-17 men’s team learns COSAFA Cup opponents</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:12",
            "date": "06 Aug 2025"
        },
        {
            "title": "‘Abducted’ Mbalenhle declines to open criminal case – say police",
            "url": "https://www.newzimbabwe.com/abducted-mbalenhle-declines-to-open-criminal-case-say-police/",
            "content": "Sowetan Live\n\nThe Gauteng woman, who was allegedly abducted for three days while on her way to church before she was miraculouslydumped by her captors at a petrol station, has declined to open a criminal case with the police.\n\nMbalenhle Nkomos family said they will no longer give Sowetan interviews on the matter.\n\nGauteng police spokesperson Col Mavela Masondo told Sowetan on Tuesday that Nkomo, 34, has declined to press kidnapping charges after being found bound inside her vehicle at a Johannesburg petrol station on Sunday afternoon.\n\nThe victim came to the police station and stated that she doesnt want to open a criminal case and provided her reasons. Her car was given back to her, Masondo said, without elaborating why the police released a car used in committing of an alleged crime.\n\nThe victim came to the police station and stated that she doesnt want to open a criminal case and provided her reasons. Her car was given back to her.\n\nCol Mavela Masondo\n\nNkomos husband, Sandile Nkomo, had opened a case of a missing person with the police on August 2 after his wife did not return home from an all-night prayer service at a church in Newtown.\n\nSandile had told Sowetan that Nkomo was intercepted along the M2 by gun-wielding men before she reached the church. She told her family that the abductors allegedly drove with her from Gauteng to Ladysmith, KZN, and came back with her after they allegedly realised they had taken the wrong person.\n\nNkomos reappearance became a talking point on social media, with some users raising suspicion about her story.\n\nMasondo said the case of a missing person has since been closed.\n\nSowetan contacted Nkomo, who expressed frustration with how the media has been covering the story.\n\nI have noticed how you craft your articles to suit your narrative on this matter. I will be giving all that information to other media houses that will relay it the way I say it. I will not be commenting further on this matter, thanks. People would rather see a #Justice4Mbalenhle post than one where she was released untouched.\n\nNkomo, a beautician by trade, has since removed her social media accounts.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/06045339/mbalenhle.png",
            "description": "<p>Sowetan Live The Gauteng woman, who was allegedly abducted for three days while on her way to church before she was miraculously dumped by her captors at a petrol station, has declined to open a criminal case with the police. Mbalenhle Nkomo’s family said they will no longer give Sowetan interviews on the matter. Gauteng police</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/abducted-mbalenhle-declines-to-open-criminal-case-say-police/\">‘Abducted’ Mbalenhle declines to open criminal case – say police</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:12",
            "date": "06 Aug 2025"
        },
        {
            "title": "Zimbabwe platinum miners owed millions in unpaid export earnings",
            "url": "https://www.newzimbabwe.com/zimbabwe-platinum-miners-owed-millions-in-unpaid-export-earnings/",
            "content": "Zimbabwes platinum miners are owed millions of dollars in unpaid exports income under the governments foreign currency retention rules, the mining chamber has said, hurting operations in a sector battling torecoverfrom a price collapse.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171542/david-mnangagwa-2.jpg",
            "description": "<p>Reuters Zimbabwe’s platinum miners are owed millions of dollars in unpaid exports income under the government’s foreign currency retention rules, the mining chamber has said, hurting operations in a sector battling to recover from a price collapse. The southern African country requires all exporters to retain only 70% of their proceeds in foreign currency, with the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-platinum-miners-owed-millions-in-unpaid-export-earnings/\">Zimbabwe platinum miners owed millions in unpaid export earnings</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:12",
            "date": "06 Aug 2025"
        },
        {
            "title": "A sculpture garden boosts environmental action in Harare",
            "url": "https://www.newzimbabwe.com/a-sculpture-garden-boosts-environmental-action-in-harare/",
            "content": "By Tawanda Mupatsi| DW\n\nZimbabwes capital Harare is facing flooding, heatwaves and declining biodiversity. How does a stone sculpture park help encourage environmental conservation?\n\nIn Harare, Zimbabwes capital, the Chapungu Sculpture Garden offers a unique fusion of art and environmentalconservation. The park is a sanctuary where sculptors carve stone works of art inspired byanimalsand other natural forms. It, in turn is designed to protectnature. Indigenous native species have been planted there to help preserve them. Artist and park manager Nicholas Kadzungura explains that they are threatened bydeforestation. The garden, founded in 1970 and named after the sacred Bateleur Eagle, serves as both a creative hub and a living classroom, where visitors learn aboutZimbabwes rich ecological and cultural heritage.\n\nMany sculptures in the park reflect Zimbabwes environmental challenges. Friend of the Rhino, a piece by the late Joseph Ndandarika, which encourages empathy and the protection ofendangered species. With only around 600 black rhinos left in Zimbabwe, the message is pressing. Marcey Mushore, the parks director, explains how animistic Shona traditions guide conservation efforts. The park also acts as agreen lungfor Hararesurban sprawl. Some 2.4 million people live in its metropolitan area and pollution and disappearing green spaces are a problem.\n\nChapungus artists are committed to sharing ancestral knowledge through sculpture workshops and educational programs. Kadzungura stresses that Zimbabwes traditional stone art is not just decorativeit carries lessons about coexistence with nature. Asclimate changeand urban development threaten the countrys wetlands andbiodiversity, the parks mission is becoming more vital. Chapungu inspires action by blending creativity, tradition, and environmental stewardship.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/05181947/sculpture-garden.jpeg",
            "description": "<p>By Tawanda Mupatsi | DW Zimbabwe’s capital Harare is facing flooding, heatwaves and declining biodiversity. How does a stone sculpture park help encourage environmental conservation? In Harare, Zimbabwe’s capital, the Chapungu Sculpture Garden offers a unique fusion of art and environmental conservation. The park is a sanctuary where sculptors carve stone works of art inspired by animals and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/a-sculpture-garden-boosts-environmental-action-in-harare/\">A sculpture garden boosts environmental action in Harare</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:12",
            "date": "06 Aug 2025"
        },
        {
            "title": "Afreximbank to fund study for 1-GW floating solar project in Zimbabwe",
            "url": "https://www.newzimbabwe.com/afreximbank-to-fund-study-for-1-gw-floating-solar-project-in-zimbabwe/",
            "content": "African Export-Import Bank, or Afreximbank, has signed a heads of terms agreement to provide USD 4.4 million (EUR 3.80m) to support a 1-GW hybrid floating solar project on Lake Kariba in Zimbabwe.\n\nThe financing facility will be extended to Green Hybrid Power Private Limited to fund the bankability and feasibility studies for the project and the procurement of transaction advisers. It is expected to unlock an estimated USD 350 million in investment.\n\nThe plan is to build the solar park in two phases, starting with the installation of 500 MW of power-generating capacity. The pilot stage will supply electricity to the Intensive Energy Users Group, a consortium of large industrial and mining companies, under a 20-year take-or-pay power purchase agreement (PPA).\n\nThe agreement was signed during the 32nd Annual Meetings of Afreximbank (AAM2025). It was one of four project preparation deals inked at the event, which are collectively expected to catalyse around USD1 billion in investments.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/05182552/afreximbank-to-fund-study-for-1-gw-floating-solar-project-in-zimbabwe-1279691-1754396766.webp",
            "description": "<p>Renewables Now African Export-Import Bank, or Afreximbank, has signed a heads of terms agreement to provide USD 4.4 million (EUR 3.80m) to support a 1-GW hybrid floating solar project on Lake Kariba in Zimbabwe. The financing facility will be extended to Green Hybrid Power Private Limited to fund the bankability and feasibility studies for the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/afreximbank-to-fund-study-for-1-gw-floating-solar-project-in-zimbabwe/\">Afreximbank to fund study for 1-GW floating solar project in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:12",
            "date": "06 Aug 2025"
        },
        {
            "title": "Labour Court orders Fidelity Life to pay former employee over US$271,000 in back pay and damages",
            "url": "https://www.newzimbabwe.com/labour-court-orders-fidelity-life-to-pay-former-employee-over-us271000-in-back-pay-and-damages/",
            "content": "By Mary Taruvinga\n\nThe Labour Court of Zimbabwe has ordered Fidelity Life Assurance and its sister company, Fidelity Funeral Assurance, to pay former employee Nickson Busu a staggering US$271,727.81 in back pay and damages, ending a protracted labour dispute that has spanned more than a decade.\n\nHanding down judgment on 31 July 2025, Justice Makamure ruled that Busu, who was dismissed from employment in July 2013, is entitled to 107 months of unpaid salary, fuel allowances, and 12 months salary as damages in lieu of reinstatement.\n\nWhat this means is that the applicant is entitled to his back pay and benefits.\n\nThese will therefore be granted as prayed.\n\nThe applicant is said to be in his sixties. This appears not to have been disputed by the respondent.\n\nThe chances of him securing alternative employment continue to diminish.\n\nRespondent, on the other hand, simply indicted that the applicant should not get more than 6 months worth of damages. Respondent did not suggest at what rate such damages should be calculated. After assessing the record, including the submissions, it is my considered view that the applicant is entitled to 12 months salary as damages in lieu of reinstatement.\n\nThe applicant is therefore entitled to the following according to his claim, ruled the judge.\n\nBusu, represented by labour lawyer Caleb Mucheche, claimed US$294,396.85 based on a gross monthly salary of US$1,192.00 as reflected in his April 2013 payslip.\n\nFidelity Life had offered damages equivalent to just six months salary, but the court rejected this.\n\nThe case was remitted to the Labour Court for quantification of damages by the Supreme Court under SC597/24, which had earlier confirmed Busus unlawful dismissal and ordered compensation in line with the Labour Act.\n\nBusu argued that he had made reasonable but unsuccessful efforts to secure alternative employment due to age and poor health.\n\nWhile he did not provide specific medical details, the court acknowledged that, at over 60 years old, his chances of re-employment were continuing to diminish.\n\nJustice Makamure cited precedent from Ambali v Bata Shoe Co Ltd 1999(1) ZLR 417 (S), emphasising that although dismissed employees have a duty to mitigate losses by seeking alternative work, employers cannot use that obligation to evade fair compensation.\n\nThe principle that it is the duty of the employer to prove that an employee made efforts to look for employment should not stop a dismissed employee from ensuring that they mitigate their loss, said the judge.\n\nThe breakdown of the court award includes 107 months salary of US$233,348.81, fuel allowance (150 litres/month for 107 months): US$24,075.00 and 12 months salary in lieu of reinstatement: US$14,304.00\n\nThe court ordered Fidelity Life Assurance and Fidelity Funeral Assurance to pay the amount or its equivalent in Zimbabwean dollars using the prevailing official exchange rate on the date of payment.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/13050811/labour-court.jpeg",
            "description": "<p>By Mary Taruvinga The Labour Court of Zimbabwe has ordered Fidelity Life Assurance and its sister company, Fidelity Funeral Assurance, to pay former employee Nickson Busu a staggering US$271,727.81 in back pay and damages, ending a protracted labour dispute that has spanned more than a decade. Handing down judgment on 31 July 2025, Justice Makamure</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/labour-court-orders-fidelity-life-to-pay-former-employee-over-us271000-in-back-pay-and-damages/\">Labour Court orders Fidelity Life to pay former employee over US$271,000 in back pay and damages</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:12",
            "date": "06 Aug 2025"
        }
    ]
}