{
    "news": [
        {
            "title": "SADC schedules another extra-ordinary summit in Harare to discuss security crisis in DRC",
            "url": "https://www.newzimbabwe.com/sadc-schedules-another-extra-ordinary-summit-in-harare-to-discuss-security-crisis-in-drc/",
            "content": "By Thandiwe Garusa\n\nTHE Southern African Development Committee (SADC) is set to hold another extraordinary summit in Harare, Thursday to discuss the security situation in the Democratic Republic of Congo (DRC).\n\nThis comes after President Emmerson Mnangagwa who is also the SADC chairman vowed to take action against those responsible for attacks on UN and SADC peacekeepers in eastern DRC.\n\nAtleast 13 soldiers with peacekeeping forces in DRC were killed in clashes with the March 23 Movement (M23) rebels andover 400,000 people displacedsince the beginning of the year.\n\nThe M23, one of around 100 armed groups fighting for control in the mineral-rich region, briefly seized Goma in 2012 and reemerged in late 2021 with alleged support from Rwanda, according to the Congolese government and UN experts.\n\nThe Southern African Development Community (SADC) will convene an Extraordinary Summit of Heads of State and Government on 30thof January 2025 in Harare, Republic of Zimbabwe, to discuss the security situation in the eastern part of the Democratic Republic of Congo.\n\nThe Summit will be chaired by His Excellency Dr. Emmerson Dambudzo Mnangagwa, President of the Republic of Zimbabwe, and Chairperson of SADC.\n\nThe Summit follows the outcome of the Extraordinary Summit of the SADC Organ Troika plus the DRC and Troop Contributing Countries (TCCs) to the SADC Mission in the DRC (SAMIDRC), which was held on 28th January 2025 and was chaired by Her Excellency Dr. Samia Suluhu Hassan, the President of the United Republic of Tanzania and Chairperson of the SADC Organ on Politics Defence and Security Cooperation.\n\nThe Extraordinary Summit will be preceded by the meetings of the SADC Standing Committee of Senior Officials and the SADC Council of Ministers, the SADC Secretariat said in a statement Wednesday.\n\nMeanwhile, SADC recently held another extraordinary summit in November 2024 to discuss Mozambique and Botswana elections after having hosted the 44th SADC summit in August 2024 where Mnangagwa assumed the regional blocs rotational chairmanship.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/26042227/mnangagwa-sadc.jpg",
            "description": "<p>By Thandiwe Garusa THE Southern African Development Committee (SADC) is set to hold another extraordinary summit in Harare, Thursday to discuss the security situation in the  Democratic Republic of Congo (DRC). This comes after President Emmerson Mnangagwa who is also the SADC chairman vowed to take action against those responsible for attacks on UN and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sadc-schedules-another-extra-ordinary-summit-in-harare-to-discuss-security-crisis-in-drc/\">SADC schedules another extra-ordinary summit in Harare to discuss security crisis in DRC </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:27",
            "date": "30 Jan 2025"
        },
        {
            "title": "Three inmates slapped with a 20-year jail term each for sodomy",
            "url": "https://www.newzimbabwe.com/three-inmates-slapped-with-a-20-year-jail-term-each-for-sodomy/",
            "content": "By Staff Reporter\n\nThree inmates who took turns to sexually abuse their colleague overnight in a cell at Harare Remand Prison have been jailed for 20 years each by Harare magistrate Loice Mukunyadze.\n\nThe three are Kingswell Ngwerume (32), Kudakwashe Mazorodze (35) and Lazurus Chinobhururuka (40).\n\nThey were convicted of aggravated indecent assault after a full trial.\n\nThe State proved that on August 11 last year, the inmates were locked up for the night.\n\nMazorodze then instructed the complainant to enter Cell C2, where there were nine other inmates, including Ngwerume and Chinobhururuka.\n\nThe court heardthat the victim was awakened around midnight by Ngwerumes caresses.\n\nProsecutors also proved that Ngwerume sucked the complainants manhood.\n\nThe complainant declined Ngwerumes advances.\n\nThis infuriated Ngwerume who started assaulting the victim with the assistance of Chinobhururuka and Mazorodze.\n\nChinobhururuka allegedly forced the complainant to ingest an unidentified drink, which made him feel dizzy and powerless, said the state.\n\nThe three allegedly went on to remove the victims undergarments before taking turns to sodomise him several times.\n\nAfter the abuse, the three went back to their respective places.\n\nThe matter was reported to a prison officer who opened the cell the following morning and the victim was taken to hospital for a medical report.\n\nMunyaradzi Muza appeared for the State.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/28155839/Harare-Magistrates-Court.jpg",
            "description": "<p>By Staff Reporter Three inmates who took turns to sexually abuse their colleague overnight in a cell at Harare Remand Prison have been jailed for 20 years each by Harare magistrate Loice Mukunyadze. The three are Kingswell Ngwerume (32), Kudakwashe Mazorodze (35) and Lazurus Chinobhururuka (40). They were convicted of aggravated indecent assault after a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/three-inmates-slapped-with-a-20-year-jail-term-each-for-sodomy/\">Three inmates slapped with a 20-year jail term each for sodomy</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:27",
            "date": "30 Jan 2025"
        },
        {
            "title": "Invictus Energy promises to deliver on Mutapa Fund’s US$5 million stake",
            "url": "https://www.newzimbabwe.com/invictus-energy-promises-to-deliver-on-mutapa-funds-us5-million-stake/",
            "content": "By Alois Vinga\n\nInvictus Energy, the company spearheading an ambitious oil and gas project in northern Zimbabwe says the Mutapa Investment Fund (MIF) recent US$5 million capital injection into the project will go a long way in turning around the countrys fortunes.\n\nLast year, Invictus offered 151,515,152 shares worth US$10 million in a private placement out of which the MIF opted to underwrite US$5 million worth of the share issue while a private equity fund, Mangwana Capital injected another US$5 million to acquire the total shares on offer.\n\nMIF will represent the governments stake in the gas project on the back of yet another ongoing discussion on a Petroleum Production Sharing Agreement outlining how dividends will be spread between the concern and the government.\n\nAccording to the arrangement, the countrys Sovereign Wealth Fund will be granted a 10% back-in-right within six months of a final investment decision being made to go ahead with any commercial development. A back-in-right contract allows the government to take shares in the operation.\n\nIn a report for the quarter ended December 31 2024 published this week, Invictus Energy announced said the investments by the two local firms were successfully completed during the period.\n\nTranche One of the placement partially underwritten by MIF was successfully completed in August 2024 while Tranche Two of the US$10 million Institutional Placement managed by Mangwana Capital was completed on December 31 2024.\n\nInvictus Energy Managing Director Scott Macmillan said, The completion of this strategic capital raise is a testament to the strong investor confidence in our Cabora Bassa Project and its potential to drive transformative growth in Zimbabwes energy landscape. We are grateful for the enduring and overwhelming local and institutional support.\n\nWith the capital secured, we are equipped to accelerate the next phase of our exploration and development activities at the Cabora Bassa Project. We remain committed to delivering long-term value for our shareholders and contributing to Zimbabwes energy independence and economic growth.\n\nThe company also believes that this strategic investment is historic for both Invictus and investors in Zimbabwe, who can now hold and trade securities in the Company through its secondary listing on the Victoria Falls Stock Exchange.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/01/17103217/Invictus-Managing-Director-Scott-Macmillan.jpg",
            "description": "<p>By Alois Vinga Invictus Energy, the company spearheading an ambitious oil and gas project in northern Zimbabwe says the Mutapa Investment Fund (MIF) recent US$5 million capital injection into the project will go a long way in turning around the country’s fortunes. Last year, Invictus offered 151,515,152 shares worth US$10 million in a private placement</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/invictus-energy-promises-to-deliver-on-mutapa-funds-us5-million-stake/\">Invictus Energy promises to deliver on Mutapa Fund’s US$5 million stake</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:27",
            "date": "30 Jan 2025"
        },
        {
            "title": "Govt resolves Women’s University impasse with Council for Social Workers over training programs",
            "url": "https://www.newzimbabwe.com/govt-resolves-womens-university-impasse-with-council-for-social-workers-over-training-programs/",
            "content": "By Alois Vinga\n\nMINISTER July Moyo managed to resolve the impasse between the Womens University of Africa (WUA)and the Council for Social Workers in Zimbabwe (CSWZ)over gaps in the institutions training programs.\n\nThe tiff between the WUA and the CSWZ has been raging for years following the latters 2021 decision to ban all social work programs run by the Zimbabwe Ezekiel Guti University (ZEGU) and the WUA.\n\nThe CSW argued that the said universities were failing to adhere to several regulatory laws and policies which include the Zimbabwe Minimum Standards for Social Work Training and the Social Workers Act.\n\nIn 2021, the then Labour and Public Service Minister Paul Mavima had to intervene in the impasse after retracting the bans arguing that due processes were not met.\n\nLast year, the Higher and Tertiary Education Ministry also moved in and quizzed where CSW was deriving powers to ban training programs although the former and the Zimbabwe Council for Higher Education (ZIMCHE) are legally vested with such authority.\n\nThe events come on the back of an outcry by stakeholders demanding the trimming of power exercised by voluntary professional associations taking advantage of their groupings to thwart training by upcoming institutions in a bid to perpetuate monopoly in various professional spheres.\n\nHowever, in a statement, Minister Moyo said he managed to resolve the impasse just before he left the Public Service, Labour and Social Welfare Ministry.\n\nFollowing a series of engagements with the Council of Social Workers, Zimbabwe Council for Higher Education and the Womens University in Africa.I am pleased to announce a significant development that reflects our commitment to upholding the standards of education and professional practice in our nation.\n\nAfter diligent discussions and negotiations, I have resolved the ongoing impasse between the Womens University of Africa and the Council of Social Workers in Zimbabwe, he said.\n\nHe said the Council of Social Workers had previously raised concerns regarding gaps identified in the WUAs Social Work Training Program which were taken seriously.\n\nMoyo commended WUA for its proactive approach to addressing the issues highlighted by the Zimbabwe Council for Higher Education (ZIMCHE) and the Council for Social Workers.\n\nHe said in response to the identified gaps, WUA has presented a comprehensive implementation plan that effectively addressed the recommendations made.\n\nThis resolution underscores our collective commitment to fostering a robust social work profession that is equipped to serve the needs of our communities effectively.\n\nI would like to take this opportunity to thank all parties involved for their dedication and cooperation throughout this process. I am confident that this renewed partnership will enhance the quality of education and professional practice in social work, ultimately benefiting our society as a whole, added Moyo.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/04/10034901/July-Moyo.jpg",
            "description": "<p>By Alois Vinga MINISTER July Moyo managed to resolve the impasse between the Women’s University of Africa (WUA) and the Council for Social Workers in Zimbabwe (CSWZ) over gaps in the institution’s training programs. The tiff between the WUA and the CSWZ has been raging for years following the latter’s 2021 decision to ban all social work</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-resolves-womens-university-impasse-with-council-for-social-workers-over-training-programs/\">Govt resolves Women’s University impasse with Council for Social Workers over training programs</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:27",
            "date": "30 Jan 2025"
        },
        {
            "title": "UNISA says Magaya is not a graduate or alumnus and was never awarded any PhD; threatens to sue him for bringing the university into disrepute",
            "url": "https://www.newzimbabwe.com/unisa-says-magaya-is-not-a-graduate-or-alumnus-and-was-never-awarded-any-phd-threatens-to-sue-him-for-bringing-the-university-into-disrepute/",
            "content": "By Staff Reporter\n\nTHE University of South Africa (UNISA) has said Prophet Walter Magaya did not graduate from the institution and was never awarded any honorary doctorate as boasted by the cleric over the past eight years.\n\nWith this being Magayas second run-in with the institution, it has since threatened to sue.\n\nZimbabweans have, since 2017, been made to believe that UNISA awarded Magaya with an honorary doctorate at a glitzy event in South Africa on November 18.\n\nRELATED:Magayas fraud exposed; UNISA says diploma submitted to High Court is fake\n\nA letter published by UNISA trashed that, a day after the same institution dismissed as fake another one of Magayas diplomas. Investigations by Zimbabwean journalist Maynard Manyowa, of UK-based Dug Up, exposed the fraud.\n\nA copy of the diploma was shared online in the run-up to ZIFA elections as Magaya unsuccessfully sought to fight the football bodys decision to bar him from contesting on grounds he did not have an ordinary level qualification or anything equivalent.\n\nMagaya, who heads the Prophetic Healing and Deliverance (PHD) Ministries presented the fake diploma at the High Court earlier this month.\n\nThe university came across a video clip in the social media domain, wherein Mr Magaya claims to have received an honorary doctorate from UNISA, reads the academic institutions letter dated January 29, 2025.\n\nThe university has never conferred any honorary doctorate on Mr Magaya and strongly condemns this false claim.\n\nWe believe that conduct of this nature damages and brings our brand into disrepute and we reserve the right to take appropriate corrective action. Relevant authorities within the university have therefore been requested to take the necessary legal action in this regard.\n\nAccording to state-controlled broadcaster ZBC, hundreds gathered to watch as Magaya was conferred with the PhD at UNISAs Miriam Makeba Hall in Pretoria.\n\nAt the time, Magaya said he hoped the acknowledgement would be a lesson to Zimbabwes citizens.\n\nIt gives a small lesson to the citizens that one must receive their flowers while they are still alive, Magaya said.\n\nMagaya has not responded to the scandal.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/14120808/magaya.gif",
            "description": "<p>By Staff Reporter THE University of South Africa (UNISA) has said Prophet Walter Magaya did not graduate from the institution and was never awarded any honorary doctorate as boasted by the cleric over the past eight years. With this being Magaya’s second run-in with the institution, it has since threatened to sue. Zimbabweans have, since</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/unisa-says-magaya-is-not-a-graduate-or-alumnus-and-was-never-awarded-any-phd-threatens-to-sue-him-for-bringing-the-university-into-disrepute/\">UNISA says Magaya is not a graduate or alumnus and was never awarded any PhD; threatens to sue him for bringing the university into disrepute</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:27",
            "date": "30 Jan 2025"
        },
        {
            "title": "US issues new waiver for humanitarian aid amid freeze",
            "url": "https://www.newzimbabwe.com/us-issues-new-waiver-for-humanitarian-aid-amid-freeze/",
            "content": "U.S. Secretary of State Marco Rubio issued a waiver on Tuesday for life-saving humanitarian assistance during a 90-day pause in foreign aid while Washington undertakes a review, according to a State Department memo seen by Reuters.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/05/09203359/Donald-Trump.png",
            "description": "<p>Reuters U.S. Secretary of State Marco Rubio issued a waiver on Tuesday for life-saving humanitarian assistance during a 90-day pause in foreign aid while Washington undertakes a review, according to a State Department memo seen by Reuters. Just hours after taking office a week ago, U.S. President Donald Trump announced the pause so foreign aid contributions could</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-issues-new-waiver-for-humanitarian-aid-amid-freeze/\">US issues new waiver for humanitarian aid amid freeze</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:27",
            "date": "30 Jan 2025"
        },
        {
            "title": "Zanu PF faction fights in Mnangagwa’s corner as 2030 agenda faces resistance from war vets",
            "url": "https://www.newzimbabwe.com/zanu-pf-faction-fights-in-mnangagwas-corner-as-2030-agenda-faces-resistance-from-war-vets/",
            "content": "By Staff Reporter\n\nA ZANU PF faction has reacted angrily to recent press statements by war veterans denouncing machinations by President Emmerson Mnangagwas hangers-on to perpetuate his stay in office beyond 2028.\n\nSince Mnangagwa seemingly declined overtures to extend his incumbency courtesy of a Zanu PF National Peoples Conference 2024 resolution now dubbed Resolution #1 arguing he is a constitutionalist, his loyalists have led the 2030 agenda begging him to remain in office.\n\nA coterie of war veterans led by Zanu PF Central Committee member, Blessed Runesu Geza popularly known as Bombshell for his acerbic tongue, was first to savage Mnangagwa calling him a failed leader, who must step down or face unspecified action.\n\nGezas Harare presser was followed by yet another one by Zimbabwe National Liberation War Veterans Association (ZNLWVA) organising secretary, Ben Ncube, who said ex-combatants are at variance with the 82-year-old Zanu PF leaders ill-conceived plan to amend the Constitution in order to extend his self-serving rule beyond his 2028 second term constitutional limit.\n\nThe temerity of the two cliques of rogue war veterans tempted political observers to conclude they were mercenaries for Vice President Constantino Chiwenga, who is the frontrunner to succeed Mnangagwa whose second and final term expires in 2028.\n\nRELATED:Mnangagwa is a failure and must go now, his 2030 agenda is illegal and treacherous  say war veterans miffed by rampant corruption\n\nHowever, in a lengthy address beamed on State television, ZBC, Tuesday night Information Minister, Jenfan Muswere singled out Geza for attack describing his vitriol as unwarranted and a display of hypocrisy.\n\nMuswere said government was not amused by the bitterness, indisciplined and reactionary and unmerited polemic sentiment shared by the war veterans seeking to undermine Mnangagwa.\n\nWe are concerned about the extent to which these individuals, while purporting to be members of the ruling party (and) bona fide members of the war veterans fraternity, are not using legal and relevant structures to discuss their grievances.\n\nIt is unfortunate that these individuals have also played to the whims of demonising the President for reasons best known to them.\n\nWhat is surprising is that such individuals, including Cde Blessed Geza, was one of the lead proponents of Resolution Number 1 of the 21st National Peoples Conference, which underscores the need for the President to remain in office until 2030. Cde Geza was among the conference delegates who lobbied for that resolution to be passed.\n\nTherefore, it is surprising that today he is turning his back on a resolution he helped create. It is unfortunate that the bitterness he suffered from the 2018 primary election defeat is now causing him to go as far as rewriting the history of the President, said Muswere.\n\nThe lnformation minister claims Gezas statement was surprising, especially considering that the Second Republic respects war veterans.\n\nThis sense of self-contradiction and hypocrisy goes against the principles of basic honesty we expect from senior citizens and genuine war veterans.\n\nThis charade is very disappointing considering the magnitude of economic transformation that Zimbabwe has enjoyed under the leadership of the President His Excellency Cde Dr Emmerson Dambudzo Mnangagwa.\n\nSection 84 of the Constitution of Zimbabwe obliges all State institutions and progressive Zimbabweans to recognise Rights of Veterans of the Liberation Struggle.\n\nThese architects of our national liberation include those who fought in the War of Liberation; the virtuous gallant Sons and Daughters of the Soil who assisted the fighters in the war of liberation; and anti-colonial visionaries who were imprisoned, detained and restricted for political reasons during the liberation struggle. Through their unflinching resolve, independent Zimbabwe was born.\n\nPursuant to this clear constitutional position, the Second Republic, under the revolutionary leadership of the President of the Republic of Zimbabwe, His Excellency Cde Dr E.D. Mnangagwa has championed a deliberate welfare support for the veterans of the liberation struggle, said Muswere.\n\nWar veterans, Muswere added, were recognised by establishing a stand-alone ministry to cater for their welfare. Zanu PF has also set up a parallel wing of ex-freedom fighters.\n\nThis, Muswere claimed, was to ensure the total inclusion and participation of veterans of the liberation struggle in the economy.\n\nThe actualisation of this constitutional recognition of this important class of distinguished patriots has been facilitated by the establishment of a standalone ministry which caters for the socio-economic needs of veterans of the liberation struggle.\n\nFor the first time, four decades after the attainment of Zimbabwes independence, the Second Republic strengthened the constitutional recognition of the veterans of the liberation struggle by ensuring that the ruling Zanu PF now has a stand-alone War Veterans Wing, said Muswere, adding Mnangagwa had championed over 8,000 developmental projects since assuming office in 2017.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/03005736/SONA-1-Mnangagwa.png",
            "description": "<p>By  Staff Reporter A ZANU PF faction has reacted angrily to recent press statements by war veterans denouncing machinations by President Emmerson Mnangagwa’s hangers-on to perpetuate his stay in office beyond 2028. Since Mnangagwa seemingly declined overtures to extend his incumbency courtesy of a Zanu PF National People’s Conference 2024 resolution now dubbed ‘Resolution #1’</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-faction-fights-in-mnangagwas-corner-as-2030-agenda-faces-resistance-from-war-vets/\">Zanu PF faction fights in Mnangagwa’s corner as 2030 agenda faces resistance from war vets</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:27",
            "date": "30 Jan 2025"
        },
        {
            "title": "US$40,000 robbery suspect’s mom, dad jailed for hiding stolen money in fridge",
            "url": "https://www.newzimbabwe.com/us40000-robbery-suspects-mom-dad-jailed-for-hiding-stolen-money-in-fridge/",
            "content": "By Staff Reporter\n\nTHE parents of a fugitive suspect have been convicted and jailed for concealing stolen money linked to a US$40,000 robbery committed by their son in Kwekwe.\n\nJohn Tuhwe (51) and his wife, Gciniso Ndlovu (43), appeared at Kwekwe Magistrates Court this week facing charges of concealing proceeds of crime.\n\nFollowing a full trial, the pair were found guilty and sentenced to six months imprisonment each.\n\nProsecutors proved beyond reasonable doubt that Tuhwe and Ndlovu, parents of Calvin Tuhwe who is still at large, received and stashed US$680 inside a wardrobe. Further, they wrapped US$5,200 in a plastic bag containing meat and put it in a fridge compartment.\n\nThe court heard that Calvin and his gang had on May 15, 2024, broken into an unnamed complainants house and stole the cash.\n\nThe fugitive suspect shared the loot with his parents before fleeing to an unknown destination.\n\nThe court found both parents blameworthy for knowingly assisting in concealing the whereabouts of stolen funds.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/29060624/kwekwe-mag.jpg",
            "description": "<p>By Staff Reporter THE parents of a fugitive suspect have been convicted and jailed for concealing stolen money linked to a US$40,000 robbery committed by their son in Kwekwe. John Tuhwe (51) and his wife, Gciniso Ndlovu (43), appeared at Kwekwe Magistrates Court this week facing charges of concealing proceeds of crime. Following a full</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us40000-robbery-suspects-mom-dad-jailed-for-hiding-stolen-money-in-fridge/\">US$40,000 robbery suspect’s mom, dad jailed for hiding stolen money in fridge</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:27",
            "date": "30 Jan 2025"
        },
        {
            "title": "Govt allows Zunaid Moti’s African Chrome Fields to import 14 million litres of diesel duty-free",
            "url": "https://www.newzimbabwe.com/govt-allows-zunaid-motis-african-chrome-fields-to-import-14-million-litres-of-diesel-duty-free/",
            "content": "By Alois Vinga\n\nFINANCE and Investment Promotion Minister, Mthuli Ncube has extended South African wheeler-dealer Zunaid Motis African Chrome Fields national project status, allowing it to import 13,95 million litres of diesel duty-free up to December 2026.\n\nThe company was granted the national project status a decade ago, meaning it can procure fuel and machinery duty-free, a decision which raised eyebrows. Back then it could import 12 million litres duty-free and the extension to 2026 allows it an additional 1.95 million litres.\n\nMoti made headlines in 2023 after an independent investigation exposed a US$120 million chrome scandal involving President Emmerson Mnangagwa, his deputy Constantino Chiwenga and local tycoon Kuda Tagwireyi.\n\nAccording to the investigation by the Sentry organisation, the deal was struck on November 17, 2017, during the week-long coup that brought President Mnangagwa and Vice President Chiwenga to power. The Sentry is an investigative and policy organization that seeks to disable multinational predatory networks that benefit from violent conflict, repression, and kleptocracy.\n\nThe report made revelations that Moti paid $3 million to firms linked to Mnangagwa and Chiwenga following the signing of the chrome deal.\n\nKnown for his addiction to fast cars and cigars, Moti, dabbled in property development and private jets, but his main business in Zimbabwe was processing chrome.1 In 2014 he bought 70% of African Chrome Fields (ACF) and in 2015 applied for national project status which was granted that same year.\n\nRELATED:\n\nThe notice on the duty waiver was rubber-stamped by the Finance and Investment Promotion Minister, Mthuli Ncube under the countrys Customs regulations.\n\nIt is hereby notified that the Minister of Finance, Economic Development and Investment Promotion has in terms of Section 235 as read with Section 120 of the Customs and Excise Act made the following regulations.\n\nThe Customs and Excise Suspension Regulations, 2003, published in SI 257 of 2003 are amended in section 9 BB as follows- in subsection 2 by the deletion of the words 1stJanuary 2023 to 21stJanuary 2024 and substitution with the words 1stJanuary 2025 to 21stJanuary 2026; approved beneficiary of power generation projects eligible for suspension of duty, read SI6 of 2025.\n\nThe development comes at a time when the Civil Society has castigated some Chrome miners for leaving behind a trail of destruction after tapping into the countrys underneath.\n\nZimbabwe is home to some 19% of global chrome ore reserves  the second largest in the world. Its chrome store is also of a higher grade than other international sources, with an exceptional chrome-to-iron ratio of 2:1.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/09/22135546/zunaid-moti-mnangagwa.jpeg",
            "description": "<p>By Alois Vinga FINANCE and Investment Promotion Minister, Mthuli Ncube has extended South African wheeler-dealer Zunaid Moti’s African Chrome Fields national project status, allowing it to import 13,95 million litres of diesel duty-free up to December 2026. The company was granted the national project status a decade ago, meaning it can procure fuel and machinery</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-allows-zunaid-motis-african-chrome-fields-to-import-14-million-litres-of-diesel-duty-free/\">Govt allows Zunaid Moti’s African Chrome Fields to import 14 million litres of diesel duty-free</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:27",
            "date": "30 Jan 2025"
        },
        {
            "title": "Volatile exchange rates push monthly inflation to 11,5%",
            "url": "https://www.newzimbabwe.com/volatile-exchange-rates-push-monthly-inflation-to-115/",
            "content": "By Alois Vinga\n\nBOTH legal currencies, the Zimbabwe Gold (ZWG) and the US$ succumbed to significant inflationary pressures in January 2025, signifying the fact that the local economy remains in deep-seated problems.\n\nData released by the Zimbabwe National Statistic Agency (Zimstat) Tuesday shows that the Weighted month-on-month inflation rate was 11,5% in January 2025, gaining 10.5 percentage points on the December 2024 rate of 1.1 percent.\n\nThe US$ month-on-month inflation rate was 11.5%t in January 2025, gaining 10,9% on the December 2024 rate of 0,6%.On the other hand, the ZWG month-on-month inflation rate was 10,5% in January 2025, gaining 6,8% on the December 2024 rate of 3,7%, said Zimstat.\n\nThe statistics agency said the year-on-year inflation rate (annual percentage change) for January 2025 as measured by the all-items USD Consumer Price Index (CPI), was 14,6 %.\n\nFor January 2025, the Weighted CPI for Food and Non-Alcoholic Beverages contributed mostly to the month-on-month change in index (inflation rate) by a magnitude of 4.7%, followed by Housing, Water, Electricity, Gas & Other Fuels with a magnitude of 3.9%.\n\nExperts attribute the current surge of month-on-month inflation to exchange rate volatility which has seen formal retailers adjusting US$ prices to cover the gap created by the formal exchange rate which is lagging behind the widely used parallel market rates.\n\nCurrently, the formal exchange rate stand at US$1:ZWG26 as opposed to about US$1:ZWG38 obtaining on the parallel market.\n\nTo make matters worse, formal retailers do not always stick to the exact parallel market rate as they peg it much higher to hedge against uncertainties.\n\nZimstat believes government spending could have a positive impact as it meant more money would be poured into various projects, which would stimulate economic growth in the months ahead.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/02115157/zig.webp",
            "description": "<p>By Alois Vinga BOTH legal currencies, the Zimbabwe Gold (ZWG) and the US$ succumbed to significant inflationary pressures in January 2025, signifying the fact that the local economy remains in deep-seated problems. Data released by the Zimbabwe National Statistic Agency (Zimstat) Tuesday shows that the Weighted month-on-month inflation rate was 11,5%  in January 2025, gaining</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/volatile-exchange-rates-push-monthly-inflation-to-115/\">Volatile exchange rates push monthly inflation to 11,5%</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:27",
            "date": "30 Jan 2025"
        }
    ]
}