{
    "news": [
        {
            "title": "SAPES Trust firebombed, guard abducted ahead of National Press Conference challenging Mnangagwa’s term extension",
            "url": "https://www.newzimbabwe.com/sapes-trust-firebombed-guard-abducted-ahead-of-national-press-conference-challenging-mnangagwas-term-extension/",
            "content": "By Staff Reporter\n\nThe Southern Africa Political Economy Series (SAPES) Trusts premises were gutted by fire in a suspected arson attack and a security guard on duty was allegedly abducted by unknown assailants around midnight.\n\nSAPES Trust Director, Ibbo Mandaza, said the attack targeted the seminar room, which is regularly used as a venue for meetings and press conferences.\n\nSAPES Trust is scheduled to host a National Press Conference this morning against ZANU PFs Agenda 2030, which Mandaza says will go ahead despite the setback.\n\nSAPES Trust Director Ibbo Mandaza\n\nThis is to announce that theres been another arson attack (the first was in August 2023 ahead of the elections) at SAPES Trust at midnight, with the PanAfrika Restaurant on fire and the security staff overtaken by a group of armed attackers.\n\nThis is hardly a coincidence: thereis the National Press Conference against the 2030 Agenda scheduled for 11 am at SAPES Trust today 28 October.\n\nIt was an organised attack at 12:40 am today: the main target was the SAPES Trust Seminar Room, the usual venue for meetings, which has been left gutted to the ground by fire; and then they abducted the guard on duty after locking up the gate with two padlocks, Mandaza said on his X account on Tuesday.\n\nThe attack follows a fierce debate on X and public forums regarding the constitutional procedures that must be followed to amend the Constitution to allow Mnangagwa to rule until 2030, beyond his term limit ending in 2028.\n\nTop Harare lawyer, Thabani Mpofu, condemned the attack, describing itas an act of cowardice.\n\nThis is just not right. This cowardly act must be condemned in the strongest terms possible. How can we live in a country that fears words? Mpofu wrote on his X account on Tuesday morning.\n\nWriting on his X account on Tuesday morning, self-exiled former Cabinet Minister, Saviour Kasukuwere, said the bombing of SAPES Trust is a shameful act.\n\nThis is shameful. A leopard cannot change its spots! We have to choose hope over fear.\n\nAlthough Mnangagwa styles himself as a constitutionalist and has declined to plan for running beyond 2028, he has done little to stop those who are canvassing support for him to continue in power until 2030.\n\nThe calls for Mnangagwa to continue beyond 2028 have caused fissures within his ruling party, Zanu PF.\n\nAnalysts have warned that the succession battle in Zanu PF could cause chaos and violence in the country, as they believe that the calls for Mnangagwa to go beyond 2028 are purely a strategy to frustrate his deputy, Rtd Constantino Chiwenga, who is widely expected to take over.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/28062421/sapes.jpeg",
            "description": "<p>By Staff Reporter The Southern Africa Political Economy Series (SAPES) Trust’s premises were gutted by fire in a suspected arson attack and a security guard on duty was allegedly abducted by unknown assailants around midnight. SAPES Trust Director, Ibbo Mandaza, said the attack targeted the seminar room, which is regularly used as a venue for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sapes-trust-firebombed-guard-abducted-ahead-of-national-press-conference-challenging-mnangagwas-term-extension/\">SAPES Trust firebombed, guard abducted ahead of National Press Conference challenging Mnangagwa’s term extension</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:47",
            "date": "28 Oct 2025"
        },
        {
            "title": "CZI says RBZ on track to meet 2025 inflation target",
            "url": "https://www.newzimbabwe.com/czi-says-rbz-on-track-to-meet-2025-inflation-target/",
            "content": "By Alois Vinga\n\nThe Confederation of Zimbabwe Industries (CZI) says the annual inflation target set by the Reserve Bank of Zimbabwe (RBZ) remains within reach, citing consistency in the implementation of inflation containment measures.\n\nAccording to the Zimbabwe National Statistics Agency (Zimstat), the Zimbabwe Gold (ZWG) currency has maintained notable stability against the US dollar since September 2024, when it last experienced a major dip.\n\nZimstat data shows that month-on-month inflation stood at -0.2% in September 2025, down by 0.6 percentage points from 0.4% in August 2025.\n\nIn its latest inflation tracker, CZI expressed optimism that the RBZ will meet its 2025 inflation target by year-end.\n\nIf ZiG month-on-month inflation continues to grow by less than 1% in the next four months to December 2025, annual inflation is projected to be less than 20% in December 2025, CZI said.\n\nThis implies that the 2025 Midterm Monetary Policy Statement (MPS) targets, of keeping annual ZiG inflation below 30% and month-on-month inflation between 1% and 3%, are likely to be achieved.\n\nThe industry body noted that between July and late August 2025, the ZiG appreciated on both the official and parallel markets. Despite this, the parallel market premium remained relatively constant at around 27%, indicating some degree of exchange rate convergence.\n\nCZI added that the still-high annual inflation rate largely reflects the September 2024 devaluation of the ZiG, and that inflation pressures are expected to ease further in October 2025, provided no new shocks emerge.\n\nAfter rising in July 2025, month-on-month inflation eased to 0.4% in August 2025, a development CZI attributed to the effectiveness of the current tight monetary policy stance in stabilising prices, albeit under constrained liquidity conditions.\n\nIn the long term, monetary policy will need to gradually ease liquidity conditions as stability becomes more sustainable, CZI said.\n\nKeeping inflation below 1% enhances price stability and broadens the use of the ZiG beyond a transaction currency. Businesses that previously preferred USD-only transactions are now slowly encouraging ZiG payments to meet some of their monthly obligations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171617/rbz-.jpg",
            "description": "<p>By Alois Vinga The Confederation of Zimbabwe Industries (CZI) says the annual inflation target set by the Reserve Bank of Zimbabwe (RBZ) remains within reach, citing consistency in the implementation of inflation containment measures. According to the Zimbabwe National Statistics Agency (Zimstat), the Zimbabwe Gold (ZWG) currency has maintained notable stability against the US dollar</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/czi-says-rbz-on-track-to-meet-2025-inflation-target/\">CZI says RBZ on track to meet 2025 inflation target</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:47",
            "date": "28 Oct 2025"
        },
        {
            "title": "ZIFA’s hunt for new Warriors coach begins",
            "url": "https://www.newzimbabwe.com/zifas-hunt-for-new-warriors-coach-begins/",
            "content": "By Sports Reporter\n\nThe Zimbabwe Football Association (ZIFA) has begun its hunt for a new Warriors coach, following the sacking of German tactician Michael Nees last week.\n\nCalls for applications for the vacant post were advertised by ZIFA on Monday, with a CAF Pro license being the minimum requirement.\n\nSources at ZIFA told New Zimbabwe.com that the association is not planning to settle for a local coach, but prefer one Europe.\n\nWith less than two months before the 2025 AFCON finals start, ZIFA is expected to complete the recruitment process next week to give the incoming coach time to prepare for the continental tournament.\n\nIn the last seven years, the association has hired seven coaches, among them five locals and two foreigners.\n\nNees was fired for posting poor results, as he only managed two wins in the 14 games he was in charge.\n\nHe however, helped Zimbabwe qualify for the upcoming AFCON finals, which was a part of his goals.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/20185711/warriors-.webp",
            "description": "<p>By Sports Reporter The Zimbabwe Football Association (ZIFA) has begun its hunt for a new Warriors coach, following the sacking of German tactician Michael Nees last week. Calls for applications for the vacant post were advertised by ZIFA on Monday, with a CAF Pro license being the minimum requirement. Sources at ZIFA told New Zimbabwe.com</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zifas-hunt-for-new-warriors-coach-begins/\">ZIFA’s hunt for new Warriors coach begins</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:47",
            "date": "28 Oct 2025"
        },
        {
            "title": "Cameroon’s 92-year-old President Paul Biya re-elected to eighth term, opposition reports gunfire",
            "url": "https://www.newzimbabwe.com/cameroons-92-year-old-president-paul-biya-re-elected-to-eighth-term-opposition-reports-gunfire/",
            "content": "Cameroons PresidentPaul Biyawas re-elected to an eighth term with 53.66% of the vote, official results showed on Monday, raising the prospect of confrontations with supporters of the main opposition candidate who has claimed victory.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/10/23000209/Paul-Biya.jpg",
            "description": "<p>Reuters Cameroon’s President Paul Biya was re-elected to an eighth term with 53.66% of the vote, official results showed on Monday, raising the prospect of confrontations with supporters of the main opposition candidate who has claimed victory. After the results were announced by the Constitutional Council, opposition challenger Issa Tchiroma Bakary wrote on Facebook that gunfire</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cameroons-92-year-old-president-paul-biya-re-elected-to-eighth-term-opposition-reports-gunfire/\">Cameroon’s 92-year-old President Paul Biya re-elected to eighth term, opposition reports gunfire</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:47",
            "date": "28 Oct 2025"
        },
        {
            "title": "A coronation not a contest – Tanzania’s first female president faces little opposition",
            "url": "https://www.newzimbabwe.com/a-coronation-not-a-contest-tanzanias-first-female-president-faces-little-opposition/",
            "content": "BBC\n\nWith no heavyweightopposition candidates cleared to compete in Wednesdays election, many Tanzanians feel the vote is less like a contest and more like a coronation for President Samia Suluhu Hassan, as she faces her first presidential election.\n\nThe 65-year-old became the East African nations first female head of state after the death in 2021 of sitting President John Magufuli. He was admired on the one hand for his no-nonsense drive to stamp out corruption but criticised on the other for his authoritarian clampdown on dissent and controversial attitude towards the Covid pandemic.\n\nPresident Samia, who had been vice-president, seemed like a breath of fresh air  and with her warmer and friendlier style, she initiated reforms that seemed to represent a radical departure from her predecessors policies.\n\nHer four Rs policy  reconciliation, resilience, reform and rebuilding  reopened Tanzania to foreign investors, restored donor relations and mollified the International Monetary Fund (IMF) and World Bank.\n\nShe made a difference, the lost relationship between Tanzania and international organisations such as World Bank was restored, political analyst Mohammed Issa told the BBC.\n\nBut over the last two years or so, the political space has drastically shrunk  and the targeting of government critics and opposition voices is said to be more ruthless now than it ever was under Magufuli, with regular abductions and killings now reported.\n\nSamia came in with a conciliatory tone, but now she has become bold and makes tough decisions that many did not expect from her, said Mr Issa.\n\nShe is now widely blamed for some things like abductions, killings, repression of opposition and other issues on security.\n\nThis is reflected in reports by Freedom House, a US-based democracy and human rights advocacy group, which ranked Tanzania as partly free in 2020 and not free last year.\n\nThe government has not commented on the allegations.\n\nSamias CCM has won every election since the reintroduction of multi-party democracy in 1992, but the campaigns are usually vibrant with robust debate between the rival parties.\n\nWhile the electoral commission has cleared 17 presidential candidates to stand this time, the main opposition party, Chadema, is barred with its leader, Tundu Lissu, currentlyon trial for treason.\n\nHe had been calling for electoral reforms before his arrest in April  and the party is now urging its supporters to boycott the poll.\n\nHis deputy, John Heche,was also arrested last week and told the BBC just before his detention that President Samias so-called reforms were hollow: Yes, rallies were allowed again, but today Chadema cant do its mandate because the promises were fake.\n\nMeanwhile, presidential hopeful Luhana Mpina, from the second largest opposition party, ACT Wazalendo, has also been disqualified  twice.\n\nHe had managed to get his candidacy reinstated by the High Court after he was barred over a procedural issue  but when the Attorney General appealed last month, the electoral commission decided to uphold the disqualification.\n\nThis leaves smaller opposition parties like Chaumma and CUF in the race, but in reality there is no chance of them stopping Samia winning her first personal mandate.\n\nThe ruling partys control, exclusion of the opposition and institutional bias undermine electoral credibility. Limited civic space and low voter engagement further weaken inclusiveness, said political analyst Nicodemus Minde in a recent report for the Institute for Security Studies (ISS) think-tank.\n\nThis has left some would-be voters, like Dar es Salaam resident Godfrey Lusana, despondent.\n\nWe do not have an election without a strong opposition. The electoral system is not independent. We already know who will win. I cant waste time to vote, he told the BBC. If the electoral commission was really independent, I would have voted.\n\nThe islanders elect their own regional president and incumbent Hussein Mwinyi of the CCM is seeking another term, but faces stiff competition from ACT-Wazalendos Othman Masoud  who has been serving as his deputy in a unity administration.\n\nOn the campaign trail on the mainland, President Samia has capitalised on the initial praise she received for her motherly approach  seeking to govern through dialogue rather than decree.\n\nThis earned her the nickname Mama Samia  and at her rallies she has been promising to bring widespread development through better infrastructure, health and education.\n\nMany women, especially those in rural communities, see her as a stabilising force.\n\nShe brings dignity, we young women look up to her. We feel her presence as the president and that gives us confidence that we can be reliable to our communities now and in the future, first-time voter Queen Castoric from the northern city of Tanga told the BBC.\n\nBut some women in urban areas, like Celina Ponsiana, who will also be casting her ballot for the first time in Dar es Salaam, are more equivocal: Leadership isnt only about tone.\n\nI believe the president has a task to do, first on unemployment. She has been supporting some but many still need help, she said.\n\nAnother young woman in Morogoro, near Dar es Salaam, said she supported the president but refused to give her name to the BBC in case she faced a backlash from her contemporaries.\n\nSamia made us believe women can lead. I would love to say more, but many youth dont talk positively about her, she said.\n\nYoung people make up the majority of Tanzanias 37.7 million people registered voters  and there is anger from some over the presidents silence on issues like the shocking abductions.\n\nAnd while some give credit to President Samia for stabilising the economy, in some quarters there is even nostalgia for Magufuli given the rising reports of corruption.\n\nHer tougher approach of late may come down to several issues.\n\nIn a traditionally male-dominated society, she has faced problems asserting her authority. At recent rallies she has been reminding voters who is boss: Dont forget I am chief of the defence forces.\n\nShe may also feel undermined by colleagues. Within the CCM, there was some opposition to the fact that she became the partys presidential candidate unchallenged.\n\nThere is also a suggestion that she has in fact become the pawn of a powerful network of business tycoons and other influential CCM backers, known colloquially as Mtandao, according to Mr Minde in his ISS report.\n\nInternal [CCM] party democracy has been stifled through an orchestrated move to make President Samia the sole candidate. While this has deepened divisions within the party, a faade of unity is being presented to the public, he said.\n\nIt is believed that Magufuli refused to take orders from the Mtandao, preferring to stick to his own anti-corruption agenda.\n\nMr Minde warns that this has all contributed to a prevailing sense of fear in the East African nation. With the self-censorship of the media and the shrinking of political discourse, public debate has retreated to private conversations and social media.\n\nAnalysts warn that such detachment, especially among young people, could hollow out Tanzanias democracy further  and create problems down the road for President Samia should there not be a big turnout and if protests kick off.\n\nFor Tito Magoti, a lawyer and young political activist, the demands remain simple.\n\nWe want a free Tanzania where anyone has the freedom to speak, he told the BBC.\n\nThe freedom of movement and the freedom to do anything they wish.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/07022606/Tanzanias-president-Samia-Suluhu-Hassan.png",
            "description": "<p>BBC With no heavyweight opposition candidates cleared to compete in Wednesday’s election, many Tanzanians feel the vote is less like a contest and more like a coronation for President Samia Suluhu Hassan, as she faces her first presidential election. The 65-year-old became the East African nation’s first female head of state after the death in 2021</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/a-coronation-not-a-contest-tanzanias-first-female-president-faces-little-opposition/\">A coronation not a contest – Tanzania’s first female president faces little opposition</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:47",
            "date": "28 Oct 2025"
        },
        {
            "title": "High Court boots out former Duly’s manager’s car claim — says Labour Court has exclusive jurisdiction",
            "url": "https://www.newzimbabwe.com/high-court-boots-out-former-dulys-managers-car-claim-says-labour-court-has-exclusive-jurisdiction/",
            "content": "By Mary Taruvinga\n\nThe High Court has struck off a claim by retired Duly Holdings Limited administrator, Theresa Ruredzo, who was demanding a Ford Everest vehicle as part of her terminal benefits, ruling that the matter belongs in the Labour Court, not the High Court.\n\nJustice Munangati-Manongwa upheld a special plea filed by the vehicle dealer, agreeing that Ruredzos case, though framed as a contractual dispute, was fundamentally rooted in her former employment and thus a labour matter.\n\nIt is evident that the plaintiffs claim, despite its contractual framing, fundamentally relates to the employment relationship and the associated terminal benefits, ruled the judge.\n\nHence, the Labour Court possesses exclusive jurisdiction to resolve such disputes.\n\nRuredzo, who worked for 31 years and two months at Duly Holdings, rising from clerk typist to national administration manager, retired in November 2017. She told the court that the company failed to pay her full terminal benefits and later agreed to compensate her with a Ford Everest to be delivered within five years  a promise she said was never fulfilled.\n\nHer lawyer argued that the case was purely contractual since the agreement to deliver the vehicle was made after her retirement, and therefore outside the Labour Courts reach. He cited previous judgments suggesting that post-employment contracts do not qualify as labour disputes.\n\nBut Duly Holdings countered that Ruredzos demand amounted to a claim for unpaid terminal benefits, squarely falling under labour law. The company argued that the 2013 Constitution and subsequent amendments to the Labour Act gave the Labour Court exclusive jurisdiction over such employment-related claims.\n\nThe plaintiff has brought her claim before the wrong court, the defence argued, relying on a string of Supreme Court decisions affirming that even cleverly framed contractual claims cannot escape the Labour Courts authority.\n\nJustice Priscilla Munangati-Manongwa agreed, noting that while Ruredzo tried to repackage her claim as a private contract, the car in question was undeniably part of her terminal benefits.\n\nThe agreement for the delivery of the Ford Everest motor vehicle is intrinsically linked to the employment relationship between the plaintiff and the defendant, the judge said. This brings the claim squarely within the jurisdiction of the Labour Court.\n\nThe court upheld Duly Holdings special plea and ordered Ruredzo to pay costs.\n\nRuredzos long-running fight for her promised Ford Everest is now likely to continue before the Labour Court, the only forum legally empowered to decide whether Duly Holdings must finally deliver the vehicle.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/13181521/high-court-of-zimbabwe-3-e1760934227524.jpg",
            "description": "<p>By Mary Taruvinga The High Court has struck off a claim by retired Duly Holdings Limited administrator, Theresa Ruredzo, who was demanding a Ford Everest vehicle as part of her terminal benefits, ruling that the matter belongs in the Labour Court, not the High Court. Justice Munangati-Manongwa upheld a special plea filed by the vehicle</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-boots-out-former-dulys-managers-car-claim-says-labour-court-has-exclusive-jurisdiction/\">High Court boots out former Duly’s manager’s car claim — says Labour Court has exclusive jurisdiction</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:47",
            "date": "28 Oct 2025"
        }
    ]
}