{
    "news": [
        {
            "title": "Controversial business tycoon Tagwirei funded the military in 2017 coup that toppled Mugabe – Ziyambi reveals",
            "url": "https://www.newzimbabwe.com/controversial-business-tycoon-tagwirei-funded-the-military-in-2017-coup-that-toppled-mugabe-ziyambi-reveals/",
            "content": "By Darlington Gatsi\n\nZANU PFs Secretary for Legal Affairs, Ziyambi Ziyambi, has exposed how controversial businessman Kudakwashe Tagwirei played a role in toppling longtime ruler Robert Mugabe by financially assisting the military in the November 2017 coup.\n\nZiyambi revealed in a recent ZANU PF politburo meeting that, at the request of the then Commander of the Defence Forces, Constantino Chiwenga, Tagwirei provided US$1.6 million, supplied fuel and catered for the soldiers basic provisions.\n\nThis was in response to a dossier submitted to the politburo by Chiwenga, in which he accuses a clique of businessmen, including Tagwirei, of capturing the ruling party and using it as a conduit for corruption.\n\nThere is no denying that Operation Restore Legacy had significant backing. A considerable amount of resources was invested to guarantee its success. It is unlikely that an operation of this scale could have achieved its goals without substantial financial support.\n\nFor the record Mr Kudakwashe Tagwirei put in a total of 5 million litres of fuel, food and other provisions for soldiers as requested by the then CDF, General Chiwenga. Furthermore, he put in one million litres of fuel and US$1.6 million to the Party.\n\nTherefore, the success of Operation Restore Legacy cannot be attributed to a few individuals. Any such assertions are aimed at distorting the historical narrative for personal and political gain, said Ziyambi.\n\nTagwirei, who is a benefactor of ZANU PF, has recently been accused of using his proximity to President Emmerson Mnangagwa to acquire government tenders.\n\nThe controversial entrepreneur has also been the subject of attacks by former ZANU PF member and fugitive Blessed Geza, who has accused him of capturing the state and perpetuating corruption.\n\nTagwirei has remained mum on the allegations of corruption.\n\nZiyambi said the removal of Mugabe was a collective effort, warning a clique backing Chiwenga to desist from claiming heroism.\n\nIt is denied that only a few individuals, particularly the writers of this document, sacrificed their lives for the attainment of Operation Restore Legacy. Zimbabweans from all walks of life rose and participated in and supported Operation Restore Legacy.\n\nLet us acknowledge the collective effort that made Operation Restore Legacy possible and desist from claiming heroism for work done by many, said Ziyambi.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/15160729/tagwirei.jpeg",
            "description": "<p>By Darlington Gatsi ZANU PF’s Secretary for Legal Affairs, Ziyambi Ziyambi, has exposed how controversial businessman Kudakwashe Tagwirei played a role in toppling longtime ruler Robert Mugabe by financially assisting the military in the November 2017 coup. Ziyambi revealed in a recent ZANU PF politburo meeting that, at the request of the then Commander of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/controversial-business-tycoon-tagwirei-funded-the-military-in-2017-coup-that-toppled-mugabe-ziyambi-reveals/\">Controversial business tycoon Tagwirei funded the military in 2017 coup that toppled Mugabe – Ziyambi reveals </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "16 Oct 2025"
        },
        {
            "title": "An ancient tradition is helping girls in Zimbabwe fight child marriages",
            "url": "https://www.newzimbabwe.com/an-ancient-tradition-is-helping-girls-in-zimbabwe-fight-child-marriages/",
            "content": "AP\n\nInside a white tent with a wooden fireplace in the middle, about two dozen African girls slipped off their shoes, sat on mattresses and prepared to pour their hearts out.\n\nThey held hands and their chants of its so nice to be here echoed through the tent before they set about discussing sexuality, child marriage, teen pregnancy, gender bias, education, economic empowerment and the law. Nothing was off limits.\n\nThe girls hangout in rural northeasternZimbabweis a revival of Nhanga, the local term for girls bedroom, an ancient traditional space once used to prepare adolescent girls for marriage. Across rural Zimbabwe, girls are now reinventing the centuries-old practice as a peer-led movement to resist child marriage, which is rife in the southern African nation.\n\nThis is a safe space, every girl feels free, said 18-year-old Anita Razo, who joined at 14 and now mentors younger girls.\n\nIn traditional homesteads, a round thatched hut served as Nhanga, a female-only room where girls were taught obedience, how to please husbands and moral education. It reinforced patriarchal expectations.\n\nToday, the practice is being flipped. The new Nhanga is a cultural innovation dealing with modern problems, and where girls candidly tackle subjects still sensitive in many conservative homes, said Nokutenda Magama, a programs officer with Rozaria Memorial Trust, a nonprofit that works to empower rural girls and women and is behind the Nhanga revival.\n\nSessions include practical skills like poultry raising, farming and soap making.\n\nThe trust organizes gatherings by age group, from girls as young as five to women over 35, ensuring an age-appropriate curriculum and mentorship across generations. Elders, including senior government officials, are sometimes invited.\n\nThe reinvention comes against worrying statistics. One in three girls in Zimbabwe marries before 18, according to the United Nations Childrens Fund, calling it a national emergency demanding urgent action. Its a similar situation across East and southern Africa. Child marriage rates soar to above 40% in central and West Africa, with Niger, at 76%, the highest globally, according to UNICEF.\n\nZimbabwe and many other African countrieshave outlawed child marriage, evenoverturning laws prohibiting abortion for girls under 18, but poverty, lethargic enforcement and cultural and religious customs keep it alive.\n\nFor Samantha Chidodo, the revival offered a path back. Now 26 and a final-year law student, she was forced into an abusive marriage at 17 to a man nearly a decade older.\n\nAll I wanted was to play and think of my future. Suddenly I had to be a mother and wife, she said at a camp that blended tent sessions with a girls and goals soccer tournament.\n\nI didnt even know what to do. I would be dead asleep, oblivious that I needed to breastfeed. A woman next door would take the crying baby, feed him and return him to the sleeping teen mother, she recalled.\n\nAfter two years, she walked away, enduring stigma as neighbors warned others not to associate with her. With support from Rozaria Memorial Trust, she returned to school and became one of the modern Nhanga pioneers.\n\nInitially we were only about 20 girls. Almost 90% of us did well, some went to college, others started projects. The community began to see our power, and encouraged their children to join, she said. Nhanga is now seen as cool.\n\nToday, more than 200 girls in her village participate. Many schools across Zimbabwe have adopted the model, which has spread to Zambia and Sierra Leone and reached African Union and United Nations forums.\n\nBecause child marriage is often rooted in culture and religion, girls sought the backing of chiefs and village heads  custodians of local customs.\n\nXmas Savanhu, a local village headman, said leaders now enforce rules against early marriage. Offenders must pay a cow as a fine held in trust by the chief for the girls education. This ensures she can return to school without financial worries, he said, noting that culprits are also reported to police. Chiefs also partner with NGOs to help young mothers resume their studies.\n\nDespite progress, poverty and entrenched attitudes persist, said Enet Tini, a teacher and girls mentor whose school adopted the model.\n\nShe welcomeda government policy allowing girls to return to school after giving birth, but noted parents are often reluctant. The gap that we have lies with the adults. They view pregnancy or child marriage as indiscipline so they think the girls should be punished, she said, highlighting the importance of girls-ledinitiatives to change attitudes among themselvesand the community.\n\nNyaradzai Gumbonzvanda, deputy executive director at U.N. Women and founder of the Rozaria Memorial Trust, called child marriage essentially rape and sexual exploitation and a worldwide problem, but much higher in Africa, where laws alone cannot end it.\n\nLaws are important  but it is critically essential to reach to the girls themselves, to do the shift in the social norms in our communities, said Gumbonzvanda, who started Rozaria Memorial Trust in 2007 in honor of her late mother, who was married at 13.\n\nHer message that solutions must involve girls themselves alongside policymakers and traditional leaders resonates with Razo, the young mentor.\n\nIf we can pressure each other into behaving badly, then we can also influence each other to act positively, Razo said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/15155724/child-marriages.jpg",
            "description": "<p>AP Inside a white tent with a wooden fireplace in the middle, about two dozen African girls slipped off their shoes, sat on mattresses and prepared to pour their hearts out. They held hands and their chants of “it’s so nice to be here” echoed through the tent before they set about discussing sexuality, child</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/an-ancient-tradition-is-helping-girls-in-zimbabwe-fight-child-marriages/\">An ancient tradition is helping girls in Zimbabwe fight child marriages</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "16 Oct 2025"
        },
        {
            "title": "‘An iconic figure in the struggle for democracy’ – Zimbabwean opposition mourns Raila Odinga",
            "url": "https://www.newzimbabwe.com/an-iconic-figure-in-the-struggle-for-democracy-zimbabwean-opposition-mourns-raila-odinga/",
            "content": "By Staff Reporter\n\nZimbabwes opposition has joined the rest of Africa in mourning the death of Kenyas former Prime Minister, Raila Odinga, describing him as an iconic figure in Africas pro-democracy movement.\n\nOdinga, a longtime ally of late MDC leader Morgan Tsvangirai, died Wednesday in India, where he was receiving medical treatment.\n\nThroughout his political career, Odinga stood in solidarity with Zimbabwes democratic struggle, often calling out the late President Robert Mugabe over his governments human rights record.\n\nPosting on his social media accounts, opposition leader Nelson Chamisa hailed Odinga as a towering figure in Africas fight for freedom and justice.\n\nSaddened to receive the tragic news of the passing of Mzee Raila Odinga this early morning. As many will remember, he was one of the iconic figures in the struggle for democracy and freedom in the fight for a better Africa, said Chamisa.\n\nCitizens Coalition for Change (CCC) Member of Parliament Gladys Hlatywayo described Odinga as a giant of African politics.\n\nSad news from Kenya. Former Prime Minister of Kenya Raila Odinga is nomore! My heartfelt condolences to his wife and the Odinga Family, the @TheODMparty and the people of Kenya. Africa has lost a giant in the fight for democracy. We thank you for the consciousness Baba, said Hlatywayo.\n\nHarare Mayor Jacob Mafume also paid tribute, praising Odingas leadership and selflessness.\n\nRaila Odinga is a hero in many respects. Whatever happened, he always led for the people and from the people. We got inspiration from his journey and courage. Loved his country and his people, always willing to compromise for the greater good.\n\nOdingas death has prompted an outpouring of grief across Africa, with political leaders and citizens alike celebrating his decades-long contribution to democracy and social justice.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/08/07054856/Raila-Odinga-and-Nelson-Chamisa.jpeg",
            "description": "<p>By Staff Reporter Zimbabwe’s opposition has joined the rest of Africa in mourning the death of Kenya’s former Prime Minister, Raila Odinga, describing him as an iconic figure in Africa’s pro-democracy movement. Odinga, a longtime ally of late MDC leader Morgan Tsvangirai, died Wednesday in India, where he was receiving medical treatment. Throughout his political</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/an-iconic-figure-in-the-struggle-for-democracy-zimbabwean-opposition-mourns-raila-odinga/\">‘An iconic figure in the struggle for democracy’ – Zimbabwean opposition mourns Raila Odinga</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "16 Oct 2025"
        },
        {
            "title": "Raila Odinga, who made five runs at Kenya Presidency, dies at 80",
            "url": "https://www.newzimbabwe.com/raila-odinga-who-made-five-runs-at-kenya-presidency-dies-at-80/",
            "content": "Bloomberg\n\nRaila Odinga, who was at the forefront of Kenyan politics for more than three decades and made five unsuccessful runs at the presidency, alleging that he was cheated of victory in every instance, has died. He was 80.\n\nOdinga passed away in India after suffering a heart attack, the Nairobi-based Star newspaper and other Kenyan media outlets reported.\n\nOdinga was the son of Jaramogi Oginga Odinga, who served as Kenyas first vice president in Jomo Kenyattas administration. Considered political royalty in the East African nation, he was wildly popular among his supporters who heeded his calls en masse to demonstrate when he complained about vote rigging.\n\nThe electoral disputes repeatedly triggered ethnic tensions and violence, most notably in 2008, when more than 1,100 people died and about 350,000 were forced to flee their homes. The United Nations and then-South African leader Thabo Mbeki mediated a truce that saw Odinga being appointed prime minister in a coalition government led by President Mwai Kibaki.\n\nOdinga narrowly lost his fifth bid for the presidency to William Ruto in 2022. While the nations highest court upheld the election outcome, Odinga said he had proof the results had been tampered with and called a series of protests against the outcome and rising living costs. Dozens of people died in the ensuing unrest.\n\nThe two men later agreed to work together and members of Odingas party were appointed to the cabinet and other government posts.\n\nRaila Amolo Odinga was born on Jan. 7, 1945, in the western Kenyan town of Maseno. Prior to going into politics, he studied engineering in Germany, lectured at the University of Nairobi and co-founded his own firm.\n\nHe was arrested in 1982 after being accused of participating in an attempted coup led by air force officers to oust President Daniel Arap Moi. He spent six years in prison without trial and was detained twice subsequent to his release. His final incarceration ended in 1991, the year Kenyas constitution was amended to allow multiparty politics.\n\nOdinga helped found the Forum for the Restoration of Democracy and was selected as a lawmaker for the Langata constituency in the capital, Nairobi, in the 1992 election.\n\nHe first stood for the presidency in 1997 as the National Development Partys candidate. Four years later, he merged his party with Mois Kenya African National Union, was elected as its secretary-general and appointed energy minister.\n\nOdinga parted ways with Kanu in 2002, after Moi backed Uhuru Kenyatta to succeed him as party leader, and teamed up with Kibaki, who had mounted a third presidential campaign. Their coalition, the National Rainbow Alliance, won the vote, ending almost four decades of uninterrupted Kanu rule.\n\nKibaki named Odinga as his minister of roads and public works, but the two fell out in 2004 when Odinga accused the president of reneging on a power-sharing deal.\n\nThe Orange Democratic Movement nominated Odinga as its presidential candidate in 2007. It won 99 parliamentary seats, while Kibakis Party of National Unity won just 43. Even so, the official results showed Kibaki won the presidential vote  an outcome that was tainted by allegations of rigging.\n\nThe widespread violence that ensued prevented Odinga from taking power and he had to settle for the post of prime minister, which he held for five years.\n\nOdinga lost the presidential vote to Uhuru Kenyatta in 2013 and again in 2017. The Supreme Court annulled the outcome of the latter contest, citing widespread irregularities. Odinga then boycotted the re-run, saying the conditions werent in place for a fair contest.\n\nThe two men later reconciled and Kenyatta backed Odingas 2022 presidential run, reneging on an undertaking to support Ruto, his then-deputy. Ruto prevailed in the first round, however, and the result stood despite the oppositions legal challenges and protests.\n\nIn February 2025, Odinga stood for election as head of the African Unions executive arm, but lost the contest to Mahamoud Ali Youssouf from Djibouti.\n\nOdinga married his wife Ida in 1973. They had four children.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/16220105/Raila-Odinga.jpeg",
            "description": "<p>Bloomberg Raila Odinga, who was at the forefront of Kenyan politics for more than three decades and made five unsuccessful runs at the presidency, alleging that he was cheated of victory in every instance, has died. He was 80. Odinga passed away in India after suffering a heart attack, the Nairobi-based Star newspaper and other</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/raila-odinga-who-made-five-runs-at-kenya-presidency-dies-at-80/\">Raila Odinga, who made five runs at Kenya Presidency, dies at 80</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "16 Oct 2025"
        },
        {
            "title": "Madagascar military says it has seized power as president moves to ‘safe place’",
            "url": "https://www.newzimbabwe.com/madagascar-military-says-it-has-seized-power-as-president-moves-to-safe-place/",
            "content": "BBC\n\nAn elite military unit says it has seized power in Madagascar from President Andry Rajoelina following weeks of youth-led protests in the Indian Ocean island.\n\nStanding outside the presidential palace on Tuesday, CAPSAT chief Col Michael Randrianirina said the military would form a government and hold elections within two years. He also suspended key democratic institutions, like the electoral commission.\n\nGen Z protesters will be part of the changes because the movement was created in the streets so we have to respect their demands, he added.\n\nTroops and protesters have been celebrating the apparent ousting of President Rajoelina, with thousands waving flags in the capital, Antananarivo.\n\nCAPSAT, or the Personnel Administration and Technical and Administrative Services Corps, is the most powerful military unit in Madagascar.\n\nThe unit supported Rajoelina when he came into power in 2009, but joined the protesters on Saturday.\n\nMadagascars constitutional court has named Col Randrianirina as the countrys new leader, even though a statement from the presidents office said he was still in charge and denounced what it described as an attempted coup detat.\n\nRajoelinas whereabouts are unknown, but he has said he is sheltering in a safe place following an alleged attempt on his life by military personnel and politicians. CAPSAT has denied any involvement in any such move.\n\nThere have been unconfirmed reports that the president was flown out of the country on a French military aircraft.\n\nAlso on Tuesday the US state department urged all sides to pursue a peaceful solution in line with the constitutional order.\n\nCol Randrianirina told the BBC that Madagascar was a country where chaos reigns right now.\n\nChaos because theres no president  hes gone abroad.\n\nThe unrest began just over two weeks ago, after a youth-led movement beganprotesting against chronic water and power cuts across the country.\n\nThe demonstrations soon escalated, to reflect wider dissatisfaction with Rajoelinas government over high unemployment, rampant corruption and the cost-of-living crisis.\n\nProtestors clashed with security forces resulting in the death of at least 22 people and more than 100 others injured, according to the UN, although the Malagasy government has dismissed those figures and described them as based on rumours and misinformation.\n\nPresident Rajoelina, an entrepreneur and former DJ, was once seen as a fresh start for Madagascar.\n\nThe baby-faced leader became president when he was just 34, earning the title of Africas youngest leader, and going on to govern for four years, before returning to power after the 2018 election.\n\nBut he fell out of favour following allegations of cronyism and corruption, which he denied.\n\nDespite the fact that power appears to have shifted away from him, he has continued to try to influence events.\n\nRajoelina attempted to dissolve the national assembly before the opposition could vote to strip him of his presidency for abandonment of post, but that did not work.\n\nLawmakers voted to impeach Rajoelina by 130 votes to one blank ballot on Tuesday. Even members of his party, Irmar, voted overwhelmingly to impeach him.\n\nRajoelina rejected the vote, calling it null and void.\n\nThe African Union (AU) has warned against soldiers meddling in Madagascars political affairs and rejected any attempt at unconstitutional changes of government.\n\nFrench President Emmanuel Macron called the situation greatly worrying.\n\nThe island has gone through a series of political upheavals in recent years.\n\nMadagascar is one of the poorest countries in the world, with 75% of its 30 million people living below the poverty line, according to the World Bank.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/15064752/madagascar-military.webp",
            "description": "<p>BBC An elite military unit says it has seized power in Madagascar from President Andry Rajoelina following weeks of youth-led protests in the Indian Ocean island. Standing outside the presidential palace on Tuesday, CAPSAT chief Col Michael Randrianirina said the military would form a government and hold elections within two years. He also suspended key</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/madagascar-military-says-it-has-seized-power-as-president-moves-to-safe-place/\">Madagascar military says it has seized power as president moves to ‘safe place’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "16 Oct 2025"
        },
        {
            "title": "In Zimbabwe, youth champions are taking the fight to cervical cancer",
            "url": "https://www.newzimbabwe.com/in-zimbabwe-youth-champions-are-taking-the-fight-to-cervical-cancer/",
            "content": "By Enos Denhere\n\nThe fight against cervical cancer in Zimbabwe is gaining new energy, not from doctors in white coats or policymakers in offices, but from teenagers and young adults armed with smartphones, friend networks and a desire to save lives.\n\nWe realised that when health workers visit schools, children listen but often forget. When peers explain, the message sticks. These ambassadors know the slang, they know the platforms and they know the fears.\n\n Sister Shelly Majira, Kuwadzana Polyclinic\n\nCervical cancer is the most common cancer among women in the country, accounting for almost a third of all female cancer diagnoses, and its the single deadliest cancer in Zimbabweans of any sex. Its also preventable with a dose of the human papillomavirus (HPV) vaccine  and thats a fact these young health ambassadors are trying to spotlight in WhatsApp groups and through community campaigns. Their work is reshaping health conversations, tackling stigma and ensuring that prevention is a priority for future generations.\n\nTapiwanashe Nyezana, 25, a youth health ambassador at Kuwadzana Polyclinic in the capital, Harare, speaks passionately about the importance of vaccinating young girls before they reach adulthood. I want to see children grow up healthy and capable of fulfilling their dreams. Good health is the foundation of a successful life, which motivated me to take on this role. I believe that young girls deserve the opportunity to be protected from cervical cancer through vaccination before they reach adulthood, she said.\n\nTapiwanashe Nyezana outside Kuwadzana Polyclinic. Credit: Enos Denhere\n\nIn Zimbabwe, the HPV vaccine became available free-of-charge to girls aged 1014, in line with World Health Organization guidance, in 2018, but achieving optimal coverage has proved challenging.\n\nOur campaigns always emphasise the benefits of vaccines and aim to help our communities overcome fear and misconceptions. We urge young girls and their parents to act promptly and ensure children have access to vaccines, because cervical cancer is preventable through vaccination, Nyezana said.\n\nBarbra Mangwiro, a vendor near Kuwadzana Polyclinic, previously believed vaccines had negative side-effects  after hearing deceptive rumours that they served hidden agendas. However, after receiving vaccine education from young health ambassadors and nurses, her perspective shifted.\n\nI used to think vaccines were harmful, but after learning about their importance, I allowed my children to be vaccinated at school when the Ministry of Health rolled out its vaccination programmes, she said. I encourage mothers to make sure their children, particularly girls, are vaccinated at an early age against cervical cancer because vaccines are important.\n\nBarbra Mangwiro a parent and a vendor near Kuwadzana Polyclinic. Credit: Enos Denhere\n\nWHO established the ambitious 90-70-90 goals for 2030 as part of its Global Strategy to expedite the eradication of cervical cancer as a public health issue in November 2020. Those targets stipulate that by the time they are 15 years old, 90% of girls should have received all recommended HPV vaccinations; by the time they are 35, and again 45 years old, 70% of women should have had a high-performance cervical cancer test; and 90% of women who have been diagnosed with cervical cancer or precancer should receive the proper care and treatment. WHO created the Elimination Planning Tool (EPT) to assist countries in meeting these goals based on the unique health needs of their populations.\n\nIn Zimbabwe youth ambassadors play a crucial role in translating this elimination strategy to the local level, according to the Permanent Secretary at the Ministry of Health and Child Care, Dr Aspect Maunganidze. Youth campaigners spread accurate information, address myths, and encourage early protection for girls aged 1014 years.\n\nLocal clinics are critical in our primary health care service delivery, and training youth advocates is fully aligned with our national HPV vaccination strategy, which aims to raise awareness, improve acceptance, and increase coverage.\n\nTheir efforts are essential as we work toward the elimination of cervical cancer as a public health problem, Dr Maunganidze said.\n\nDr. Aspect Maunganidze, Permanent Secretary, Ministry of Health and Child Care. Credit: Enos Denhere\n\nThat project received a boost recently, when the Ministry recently approved a single-dose HPV vaccination schedule, following WHO recommendations. Dr Maunganidze explained, The single-dose schedule is equally effective as the two-dose schedule, easier to deliver, and improves coverage by reducing missed doses.\n\nIn Kuwadzana, a high-density suburb of Harare, health workers are tapping into the power of peer influence to boost HPV vaccination among young girls. According to Sister Shelly Majira of Kuwadzana Polyclinic, the suburb has a population of 103,198, which includes 34,778 children under the age of 15. Among them, 10,630 are girls aged 10 to 14  the target group for the HPV vaccine in Zimbabwe.\n\nSister Shelly Majira explains HPV at Kuwadzana Polyclinic. Credit: Enos Denhere\n\nTo reach this group more effectively, the clinic partners with NGOs likeZvandiri, which runs a peer-counselling initiative aimed at kids and young people living with HIV, through a programme of youth health ambassadors. These young peer educators are trained in basic health communication, myth-busting and digital advocacy. Sister Majira, who supervises the ambassadors, emphasises the value of empowering youth to lead.\n\nWe realised that when health workers visit schools, children listen but often forget. When peers explain, the message sticks. These ambassadors know the slang, they know the platforms and they know the fears, she explained.\n\nSister Majira notes that one of the major barriers to vaccination is parental misconceptions. Many parents mistakenly believe that the HPV vaccine is intended for family planning. This perception contributes to low walk-in numbers at clinics.\n\nFrom January to May, only seven to 17 girls per month came for HPV vaccination at the clinic. However, when we engaged in school outreach programs, we saw a remarkable increase118 vaccinated in June and 357 in July. This shows that vigorous outreach, supported by our youth ambassadors, is key to reaching more children, she said.\n\nMonica Mutuma, one of the youth health ambassadors, explained that their work focuses on engaging young girls, and educating them about the importance of early vaccination to protect against cervical cancer. We share information on staying protected, fight against misinformation, and encourage vaccination while its still early.\n\nI can confidently say that around 70% of people we interact with are welcoming us, which shows we are making headway against misinformation.\n\n Monica Mutuma, youth health ambassador\n\nHowever, the final decision usually rests with the parents. Some of them used to believe the vaccine is for family planning or that it could cause infertility, she said.\n\nDespite encountering challenges  including a shortage of resources for creating flyers and accessing tools for data collection  Mutuma is optimistic about the impact of peer-led education. We are grateful to Sister Majira and her team for equipping us with the knowledge and skills to respond to questions during our outreaches and at the clinic. I can confidently say that around 70% of people we interact with are welcoming us, which shows we are making headway against misinformation, she added.\n\nPushing back against misinformation means making strides towards a safer future. In July, ten-year-old Keila Mazarura came home and told her mother, Ido Togaresei, about an HPV vaccination session that would be taking place at the school. In times past, Togaresei said, misconceptions would have caused her to forbid her child from receiving the jab. But lately its grown easier to access the facts. I permitted her to get the dose, Togaresei toldVaccinesWork.She was so happy about it, because it is her health that matters.\n\nThis article was originally published onVaccines Work.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/15064454/youth_health_ambassadors.jpg",
            "description": "<p>By Enos Denhere The fight against cervical cancer in Zimbabwe is gaining new energy, not from doctors in white coats or policymakers in offices, but from teenagers and young adults armed with smartphones, friend networks and a desire to save lives. We realised that when health workers visit schools, children listen but often forget. When</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-zimbabwe-youth-champions-are-taking-the-fight-to-cervical-cancer/\">In Zimbabwe, youth champions are taking the fight to cervical cancer</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "16 Oct 2025"
        },
        {
            "title": "Overcrowding, dilapidation, inhumane conditions plague Zimbabwe’s prisons – Parliamentary Report",
            "url": "https://www.newzimbabwe.com/overcrowding-dilapidation-inhumane-conditions-plague-zimbabwes-prisons-parliamentary-report/",
            "content": "By Anna Chibamu\n\nA joint parliamentary report has laid bare conditions in Zimbabwes prisons, exposing chronic overcrowding, dilapidated facilities, inadequate basics, and inhuman treatment of inmates as the most critical challenges facing the Zimbabwe Prisons and Correctional Service (ZPCS).\n\nThe Justice, Legal and Parliamentary Affairs Committee and the Thematic Committee on Human Rights found that most correctional facilities are operating at between 200% and 300% above capacity, with some holding more than triple their intended numbers.\n\nGwanda Prison was holding 210 inmates against a capacity of only 60, representing a staggering 350% overcrowding whilst Chikurubi Maximum Security Prison had 2,689 inmates crammed into facilities designed for 1,114 and Binga Prison had 78 inmates with the holding capacity of 45.\n\nSimilarly, Harare Remand Prison was overcrowded by over 50%, with 1,361 inmates held in a facility meant for 900. Bindura Prison reported 443 inmates versus its capacity of 393, and Marondera stood at 730 inmates for a space meant to accommodate only 358, read part of the report.\n\nThe report revealed that most prison infrastructure remains in a dire state, with many facilities constructed during the colonial era as far back as 1910 and never adequately maintained or expanded to accommodate the growing inmate population. This has led to cramped, unsanitary, and poorly ventilated conditions.\n\nOvercrowding has led to serious human rights and health implications, including inmates sleeping in cramped, poorly ventilated, and leaking cells, strained sanitation systems, insufficient bedding and increased risk of disease transmission, and limited access to healthcare.\n\nWhile commending government for improvements in food and nutrition,noting that inmates are now served three meals a day,the committee highlighted severe shortages of clothing and bedding, which compromise dignity and health, particularly during the winterseason.\n\nAt some prisons, the Committee found inmates wearing torn or worn-out clothes, with some relying on donations from relatives. Additionally, blankets were in critically short supply. Inmates were permitted to bring their own blankets due to a mismatch between inmate numbers and available bedding.\n\nThe report also described the state of prison healthcare as severely under-resourced, undermining the constitutional right of inmates to basic medical care.\n\nAll prisons, including Harare Remand, Hurungwe, Khami, Marondera, Chikurubi, Chipinge, and Gwanda, reported frequent shortages of medication, especially for chronic conditions such as hypertension, diabetes, and mental health disorders. In several instances, inmates were entirely dependent on relatives for the supply of essential medicines, with facilities like Khami and Chikurubi reporting dangerously low supplies.\n\nPsychiatric inmates were said to be particularly affected by the unavailability of medication, worsening their vulnerability.\n\nDespite the challenges, the committee noted that rehabilitation and reintegration efforts are gaining momentum within the ZPCS, with many prisons introducing vocational and academic training programmes,signalling a shift from a punitive to a correctional model.\n\nHowever, lack of digital infrastructure continues to hamper access to justice, with many inmates unable to follow up on appeals or trials due to lack of printing facilities and systemic failure of individuals held on remand for extended periods without trial.\n\nDuring a visit to Harare Remand Prison, the committee also witnessed instances of inhuman treatment of inmates.\n\nInmates were seen sitting on a wet floor, which had recently been cleaned, while Class D inmates, committee members were informed that some inmates had recently been beaten following the escape of two inmates from the prison.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/14185956/chikurubhi.jpg",
            "description": "<p>By Anna Chibamu A joint parliamentary report has laid bare conditions in Zimbabwe’s prisons, exposing chronic overcrowding, dilapidated facilities, inadequate basics, and inhuman treatment of inmates as the most critical challenges facing the Zimbabwe Prisons and Correctional Service (ZPCS). The Justice, Legal and Parliamentary Affairs Committee and the Thematic Committee on Human Rights found that</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/overcrowding-dilapidation-inhumane-conditions-plague-zimbabwes-prisons-parliamentary-report/\">Overcrowding, dilapidation, inhumane conditions plague Zimbabwe’s prisons – Parliamentary Report</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "16 Oct 2025"
        }
    ]
}