{
    "news": [
        {
            "title": "Mnangagwa orders US$5 million disbursement to speed up delayed Gwayi Shangani dam project",
            "url": "https://www.newzimbabwe.com/mnangagwa-orders-us5-million-disbursement-to-speed-up-delayed-gwayi-shangani-dam-project/",
            "content": "By Staff Reporter\n\nPRESIDENT Emmerson Mnangagwa has directed the Ministry of Finance to release US$5 million every month to speed up work on the long-stalled Gwayi-Shangani Dam project.\n\nTwo months back, the treasury had not disbursed enough funds withconstruction of the dam set to be completed this year.\n\nAccording to Lands Deputy Minister, Vangelis Haritatos, the Treasury was releasing funds in drips and drops which cannot make any significant changes.\n\nThe Gwayi-Shangani project, which is supposed to be a permanent fix to Bulawayos water shortages, has faced delays and failed to meet several deadlines since work started in 2004.\n\nThe most recent deadline, which was set by the government, was for the dam to be completed by the 2023/2024 summer cropping season, which it also missed.\n\nIn a statement posted on the social media platform X under his pseudonym Jamwanda, the Deputy Chief Secretary forPresidential Communications, George Charamba said US$10 million has already been disbursed.\n\nPresident ED Mnangagwa has ordered the finance ministry to ensure a monthly disbursement of US$5 million towards completion of the stalled Gwayi-Shangani dam.\n\nSo far US$10m has been released, ensuring some four meters of the all concrete wall are done, he wrote.\n\nIn 2018, Mnangagwa toured the Gwayi-Shangani dam and pledged to do everything in his power to ensure the project is completed by the end of 2019 and to date, it has not been completed.\n\nLast year, the government allocated ZiG1,2 billion in the national 2025 budget to complete Lake Gwayi-Shangani and Kunzvi Dam which is now at 72% completion.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/29182454/gwayi.webp",
            "description": "<p>By Staff Reporter PRESIDENT Emmerson Mnangagwa has directed the Ministry of Finance to release US$5 million every month to speed up work on the long-stalled Gwayi-Shangani Dam project. Two months back, the treasury had not disbursed enough funds with construction of the dam set to be completed this year. According to  Lands Deputy Minister, Vangelis Haritatos,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-orders-us5-million-disbursement-to-speed-up-delayed-gwayi-shangani-dam-project/\">Mnangagwa orders US$5 million disbursement to speed up delayed Gwayi Shangani dam project</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:50",
            "date": "30 Jul 2025"
        },
        {
            "title": "Zimbabwe, UAE sign health cooperation deal",
            "url": "https://www.newzimbabwe.com/zimbabwe-uae-sign-health-cooperation-deal/",
            "content": "By Thandiwe Garusa\n\nZIMBABWE has signed a Memorandum of Understanding (MoU) with the United Arab Emirates (UAE) aimed at strengthening healthcare systems in both countries.\n\nThe cooperation covers a wide range of healthcare areas, including primary and specialist care, emergency preparedness, health financing, workforce development, and the use of technology to improve service delivery and health outcomes.\n\nTwo months back, the government also signed separate MoUs with China and Belarus to refurbish the biggest referral hospital, Parirenyatwa.\n\nSpeaking during a post-cabinet media briefing on Tuesday, Information Minister Jenfan Muswere said the MoU aims to strengthen healthcare systems and improve health outcomes in both countries through mutual cooperation based on respect, equality, and shared benefit.\n\nCabinet considered and approved the MoU between the Republic of Zimbabwe and the Government of United Arab Emirates on Cooperation in the field of health.\n\nThe MOU aims to establish a collaborative framework between the two countries to foster mutual growth, development, and enhancement of healthcare systems within their respective territories.\n\nThe scope of cooperation encompasses various healthcare domains, including Primary Care, which comprises collaborative efforts in reproductive, maternal, neonatal, child, and adolescent health, as well as immunisation programs.\n\nSecondary Care, which comprises specialist care and patient referral services, laboratory services, forensic pathology, and blood services, Muswere said.\n\nHe added: Health system resilience, whose key aspect is preparing for and responding to public health emergencies.\n\nHealth financing, which enables both countries to explore innovative funding models, share financial expertise, and optimise resource allocation to achieve better health outcomes.\n\nHuman resources, which focuses on developing and managing healthcare professionals; and health technology, which aims to leverage health technology to improve healthcare delivery, enhance patient care, and streamline healthcare services.\n\nPublic hospitals in Zimbabwe are struggling to efficiently serve patients due to shortages of basic medical supplies, rundown infrastructure, and poorly paid staff, which has led to massive brain drain and low morale.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/09054809/muswere.jpeg",
            "description": "<p>By Thandiwe Garusa ZIMBABWE has signed a Memorandum of Understanding (MoU) with the United Arab Emirates (UAE) aimed at strengthening healthcare systems in both countries. The cooperation covers a wide range of healthcare areas, including primary and specialist care, emergency preparedness, health financing, workforce development, and the use of technology to improve service delivery and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-uae-sign-health-cooperation-deal/\">Zimbabwe, UAE sign health cooperation deal</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:50",
            "date": "30 Jul 2025"
        },
        {
            "title": "‘Pastor’ Walter Masocha jailed for ‘removing demons’ sex attacks",
            "url": "https://www.newzimbabwe.com/pastor-walter-masocha-jailed-for-removing-demons-sex-attacks/",
            "content": "BBC\n\nA church pastor who sexually assaulted a female churchgoer under the pretence of removing demons from her body has been jailed for 10 years.\n\nWalter Masocha, 61, groped the married woman at his home in Stirling, claiming he was a gift from god.\n\nThe University of Stirling professor also attempted to rape another woman during a campaign of abuse from 2006 to 2012.\n\nMasocha denied the attacks during the trial at the High Court in Livingston, but judge Susan Craig described his offending as appalling.\n\nShe imposed a non-harassment orders banning him from approaching or contacting his two victims.\n\nMasocha founded his own church in Scotland in 2007 soon after moving from Zimbabwe.\n\nHe built Agape for All Nations Church into an international religious organisation with more than 2,000 members and appointed himself as archbishop.\n\nOne of his victims said most people in the church saw him as a father figure and referred to him as Dad or Daddy.\n\nThe trial heard Masocha, an accountancy professor, had first targeted another of his victims, now aged 58, about 20 years ago at his home in Stirling.\n\nShe told the court how Masocha had ordered her to kiss his holy lips and attempted to justify putting his hand in her pants and groping her by claiming he was removing demons from her body.\n\nA 39-year-old woman told how she was 20 when Masocha began sexually abusing her after she went to stay with his family.\n\nShe said Masocha repeatedly sexually assaulted her during that period by forcing her to touch him and slapping her on the bottom as she walked upstairs.\n\nThe woman said he later tried to rape her after taking her into his bedroom before managing to escape.\n\nMasocha waspreviously found guilty in June 2015 of sexually assaulting a church deaconessand putting his hand down the trousers of a schoolgirl, telling her that he was trying to remove demons.\n\nThe convictions were laterquashed by the appeal courtafter judges ruled hed been the victim of a miscarriage of justice.\n\nHowever, new proceedings were launched by the Crown after two further women made statements to the police about his behaviour.\n\nJudge Craig said it was likely that Mascohas name would appear on the sex offenders register indefinitely.\n\nAdvocate depute, Michael McIntosh, said: Walter Masocha wasnt just a pastor and a preacher, he was a predator who thought that his power and position rendered him immune from suspicion.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/29103217/masocha.webp",
            "description": "<p>BBC A church pastor who sexually assaulted a female churchgoer under the pretence of “removing demons” from her body has been jailed for 10 years. Walter Masocha, 61, groped the married woman at his home in Stirling, claiming he was a “gift from god”. The University of Stirling professor also attempted to rape another woman</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pastor-walter-masocha-jailed-for-removing-demons-sex-attacks/\">‘Pastor’ Walter Masocha jailed for ‘removing demons’ sex attacks</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:50",
            "date": "30 Jul 2025"
        },
        {
            "title": "Tagwirei must be stopped, ‘a criminal can’t be president’ – Biti",
            "url": "https://www.newzimbabwe.com/tagwirei-must-be-stopped-a-criminal-cant-be-president-biti/",
            "content": "By Staff Reporter\n\nFormer Finance Minister Tendai Biti has launched a stinging attack on controversial business tycoon Kudakwashe Tagwirei, accusing him of looting and collapsing Zimbabwes economy.\n\nBiti insists that Tagwireimust be prevented from ascending to the countrys top job, citing his role in destroying Zimbabwes local currency in 2019 as just one example of his economic sabotage.\n\nThe beleaguered businessman was recently ousted from a Zanu-PF Central Committee meeting after his co-option into the partys key structure was foiled. Party spokesman Christopher Mutsvangwa later vowed to fight Tagwireis rise into the partys most senior and influential ranks.\n\nBiti, echoing Mutsvangwas sentiments that Tagwirei is buying his way up the party structure, was blunt about the need to thwart Tagwireis presidential ambitions.\n\nBiti accused Tagwirei of single-handedly collapsing Zimbabwes local currency in 2019 after being issued treasury bills worth US$360 million.\n\nHe alleges Tagwirei then flooded the market with this cash, causing the RTGS currency to plummet. This, Biti argues, is a prime example of how Tagwirei has undermined the nations financial stability through illicit means.\n\nPresident Emmerson Mnangagwa had once described the local currency as the strongest in the region, although his government later devalued it and announced the introduction of the ZiG currency last April.\n\nTagwirei, who owns numerous companies, some under his well-known Sakunda Holdings, is also accused of netting millions of dollars through his Fossil company, which constructed the Trabablas Interchange in Harare at US$114 million, more than double the regional market prices.\n\nSpeaking to a local online news publication (263Chat) on Monday, Biti took a swipe at Tagwirei, branding him a criminal and unfit to become Zimbabwes President in future.\n\nIt is crazy to think that this criminal actually has ambitions to be the next President of the Republic of Zimbabwe, Biti said.\n\nIt cant happen and should not happen. It should not be allowed to happen, he added.\n\nBiti also challenged Zanu-PF, calling it a laughing stock for allowing its values to be disregarded due to greed for money and top-of-the-range vehicles.\n\nI feel pity for Zanu-PF. Zanu-PF is being reduced to a commodity that can be bought by a few trinkets. A few motor vehicles, a few GD6s, what kind of country have we become? Biti queried.\n\nThis comes after Tagwirei himself doled out some top-of-the-range vehicles to Zanu-PFs Harare Provincial leadership in his bid to be co-opted into the partys Central Committee, a move that has come crashing down like a deck of cards.\n\nBiti said thousands of liberation struggle war heroes are turning in their graves, believing they would not have gone to war had they known the current state of Zanu-PF, which people with money are hijacking.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/25044732/Tendai-Biti.png",
            "description": "<p>By Staff Reporter Former Finance Minister Tendai Biti has launched a stinging attack on controversial business tycoon Kudakwashe Tagwirei, accusing him of looting and collapsing Zimbabwe’s economy. Biti insists that Tagwirei must be prevented from ascending to the country’s top job, citing his role in destroying Zimbabwe’s local currency in 2019 as just one example of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tagwirei-must-be-stopped-a-criminal-cant-be-president-biti/\">Tagwirei must be stopped, ‘a criminal can’t be president’ – Biti</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:50",
            "date": "30 Jul 2025"
        }
    ]
}