{
    "news": [
        {
            "title": "Zimbabwean student dies eight days after attack in India",
            "url": "https://www.newzimbabwe.com/zimbabwean-student-dies-eight-days-after-attack-in-india/",
            "content": "Times of India\n\nBathinda: After battling for life for eight days at AIIMS Bathinda, Zimbabwean student Ziweya Leeroy passed away on Thursday.\n\nZiweya (22) was attacked on August 13, a day after he had an altercation with Guru Kashi University security guard Dilpreet Singh.\n\nHe was pursuing BSc Radiology and Imaging Technology (RIT) and joined Guru Kash University, Talwandi Sabo, in 2023.\n\nPolice have arrested seven accused and added section 103 BNS (murder) in the already registered case at Talwandi Sabo police station.\n\nTalwandi Sabo police station ASI Des Raj, in his complaint, stated that during initial investigations, it was found that Ziweya Leeroy had an altercation with security guard Dilpreet Singh on Aug 12. Owing to it, Dilpreet, along with Lovepreet, Mangu, and Manpreet Singh, attacked Leeroy when he went out of the university on Aug 13.\n\nLeeroy, with serious head injuries, was admitted to AIIMS Bathinda, and a case under Sections 109 (attempt to murder), 126 (2) wrongful restraint, 115 (2) voluntarily causing hurt, 190 (unlawful assembly), and 191 (3) BNS rioting committed with a deadly weapon was registered against security guard Dilpreet Singh, Lovepreet Singh, Mangu Singh, Manpreet Singh, and others.\n\nBathinda SSP Amneet Kondal said, Seven persons have been arrested, and efforts are being made to arrest two more persons, who are suspected to be associated with the attack. The section pertaining to murder has been added to the already registered case. Further investigations are being made.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/21171314/leeroy-.jpg",
            "description": "<p>Times of India Bathinda: After battling for life for eight days at AIIMS Bathinda, Zimbabwean student Ziweya Leeroy passed away on Thursday. Ziweya (22) was attacked on August 13, a day after he had an altercation with Guru Kashi University security guard Dilpreet Singh. He was pursuing BSc Radiology and Imaging Technology (RIT) and joined</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-student-dies-eight-days-after-attack-in-india/\">Zimbabwean student dies eight days after attack in India</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:39",
            "date": "22 Aug 2025"
        },
        {
            "title": "ZimParks successfully relocates 74 wildlife to revive Matusadona",
            "url": "https://www.newzimbabwe.com/zimparks-successfully-relocates-74-wildlife-to-revive-matusadona/",
            "content": "By Mary Taruvinga\n\nThe Zimbabwe Parks and Wildlife Management Authority (ZimParks), working with the Matusadona Conservation Trust, has successfully translocated 74 large herbivores to restore biodiversity in Matusadona National Park.\n\nThe month-long operation,completed in July 2025, according to ZimParks spokesperson Tinashe Farawosaw the relocation of 50 African buffalo and 10 common eland from Tsetse Island on Lake Kariba, along with 14 sable antelope from the Sibilobilo Safari Area on the Zambezi River.\n\nThis marks an important milestone in ongoing conservation efforts within Matusadona National Park, Farawo said.\n\nThese operations represent a significant step in the ongoing restoration of one of Zimbabwes most important conservation areas.\n\nFarawo said feasibility assessments were carried out beforehand to ensure the sustainability of the species and the long-term health of the parks ecosystem.\n\nHe said the translocations are expected to revive graze and browse dynamics, strengthen prey bases, and enhance ecosystem resilience across the Sebungwe region.\n\nThe translocations will help restore the ecological balance of the park, while supporting the broader restoration of the Sebungwe Region in the years to come, he said.\n\nThe initiative also received strong backing from the Nyaminyami community, whose newly ratified Land Use Plan, approved by the Minister of Local Government on July 29, was hailed as exceptional conservation leadership reinforcing long-term wildlife protection goals.\n\nDemonstrating world-class collaboration, the translocations were carried out with the expertise of African Wildlife Management and Conservation (AWMC), Wildlife Management Services International (WMSI), and Matusadonas Conservation and Veterinarian Unit.\n\nFunding was provided by both local and international donors, including the Global Wildlife Fund.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/14144612/MATUSADONHA.jpg",
            "description": "<p>By Mary Taruvinga The Zimbabwe Parks and Wildlife Management Authority (ZimParks), working with the Matusadona Conservation Trust, has successfully translocated 74 large herbivores to restore biodiversity in Matusadona National Park. The month-long operation, completed in July 2025, according to ZimParks spokesperson Tinashe Farawosaw the relocation of 50 African buffalo and 10 common eland from Tsetse Island</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimparks-successfully-relocates-74-wildlife-to-revive-matusadona/\">ZimParks successfully relocates 74 wildlife to revive Matusadona</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:39",
            "date": "22 Aug 2025"
        },
        {
            "title": "WFP donates vehicles to Public Service Ministry for social protection services",
            "url": "https://www.newzimbabwe.com/wfp-donates-vehicles-to-public-service-ministry-for-social-protection-services/",
            "content": "By Anna Chibamu\n\nTHE World Food Programme (WFP) has donated vehicles to the Public Service Ministry to enhance the delivery of essential social protection and assistance services in communities across Zimbabwe.\n\nThe vehicles include five Toyota Prados and four Land Cruisers valued at a total of US$229,905.\n\nSpeaking during the handover ceremony attended by the Public Service minister Edgar Moyo in Harare this Thursday, WFP country director Barbra Clemens said she hoped the vehicles will make a difference to those in need.\n\nIt is my great honour to be here today for this important handover ceremony.\n\nOn behalf of the World Food Programme, I am delighted to officially present nine vehicles (five Toyota Prados and four Land Cruisers) valued at USD229,905 to the Ministry of Public Service, Labour and Social Welfare.\n\nThis is more than just a set of keys; it is a symbol of our strong and enduring partnership with the government of Zimbabwe.\n\nThese vehicles will help strengthen the ministrys ability to reach communities across the country, to deliver essential social protection and assistance services, and to respond effectively to the needs of vulnerable households, Clemens said.\n\nClemens said the need for food assistance and social protection had grown in Zimbabwe.\n\nToday, that dual responsibility remains as pressing as ever. The demand for social protection, food assistance, and resilience-building continues to grow and central to delivering these services is reliable mobility, ensuring that officials and teams can reach every corner of the country quickly, safely, and effectively.\n\nThese nine vehicles are therefore an investment in delivery capacity. They will support the ministry in monitoring programmes, reaching vulnerable communities, and ensuring that national social protection and food assistance systems are stronger, faster, and more responsive. In this way, becoming tools of service and impact, added Clemens.\n\nIn addition to the vehicles, WFP also donated digital media equipment to aid the ministrys communications work as documenting progress, sharing stories, and enhancing visibility were equally vital in strengthening accountability and mobilising support.\n\nAs he received the keys to one of the vehicles for a test drive, Moyo said, It is with great pleasure that we gather here to receive yet another post from the World Food Programme in the form of vehicles.\n\nThe minister remains grateful for the support that the World Food Programme continues to render in this commitment to the people of Zimbabwe in ensuring food security goals are met.\n\nWe continue to make a difference in the delivery of social protection services in the ministry, Moyo said.\n\nHe commended WFP for the provision of support to the government and empowering its staff in the districts where it is present.\n\nIt has been noted that in all the districts that you have provided support, the staff are more empowered in claim distribution, supply chain management and logistical arrangements.\n\nThe ministry desires that you continue to spread this knowledge across the other districts we have not yet implemented. As we jointly implement the food deficit mitigation strategy, we insist on assistance.\n\nMoyo highlighted, We noted gaps, and I am glad that we are here today to pluck one of those gaps through motorisation of the department. You have helped me accept the main variables, which will go a long way to support our social protection programs and facilitate program implementation, enabling the ministry to meet its targets as we look forward to completing the implementation of NTS1 and getting NTS2 towards vision 2030.\n\nSaid Moyo: We rest assured that the ministry will ensure that these variables are put to good use and managed according to government policies and regulations. Priorities shall be given to the hard-to-reach areas, considering terrain in a bid to leave no one and no place behind. May I, on behalf of the Government of Zimbabwe, take this opportunity to thank the World Food Programme for its continued support.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/21192323/wfp-edgar.jpeg",
            "description": "<p>By Anna Chibamu THE World Food Programme (WFP) has donated vehicles to the Public Service Ministry to enhance the delivery of essential social protection and assistance services in communities across Zimbabwe. The vehicles include five Toyota Prados and four Land Cruisers valued at a total of US$229,905. Speaking during the handover ceremony attended by the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/wfp-donates-vehicles-to-public-service-ministry-for-social-protection-services/\">WFP donates vehicles to Public Service Ministry for social protection services</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:39",
            "date": "22 Aug 2025"
        },
        {
            "title": "Four Zim referees selected for September World Cup Qualifiers",
            "url": "https://www.newzimbabwe.com/four-zim-referees-selected-for-september-world-cup-qualifiers/",
            "content": "By Sports Reporter\n\nFour Zimbabwean referees have been selected to officiate during the upcoming 2026 World Cup Qualifiers in September.\n\nThe four selected referees are Brighton Chimene, Luckson Mhara, Edgar Rumeck, and Lawrence Zimhondi.\n\nCenter referee Brighton Chimene and the trio will take charge of the match between the Democratic Republic of Congo and South Sudan on the 5th of September at the National Stadium in Juba.\n\nLuckson Mhara and Edgar Rumeck will serve as assistant referees, while Lawrence Zimhondi will be the fourth match official.\n\nThe quartets appointment is a testament to how well Zimbabwean match officials are performing on the international stage.\n\nChimene is currently officiating at the ongoing CHAN tournament, making him the only Zimbabwean referee at the games.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/16052432/Brighton-Chimenes.jpg",
            "description": "<p>By Sports Reporter Four Zimbabwean referees have been selected to officiate during the upcoming 2026 World Cup Qualifiers in September. The four selected referees are Brighton Chimene, Luckson Mhara, Edgar Rumeck, and Lawrence Zimhondi. Center referee Brighton Chimene and the trio will take charge of the match between the Democratic Republic of Congo and South</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/four-zim-referees-selected-for-september-world-cup-qualifiers/\">Four Zim referees selected for September World Cup Qualifiers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:39",
            "date": "22 Aug 2025"
        },
        {
            "title": "Former clinic accountant jailed nine years for fraud and money laundering",
            "url": "https://www.newzimbabwe.com/former-clinic-accountant-jailed-nine-years-for-fraud-and-money-laundering/",
            "content": "By Mary Taruvinga\n\nThe Harare Magistrates Court has convicted and jailed for nine years a former Highview Clinic accountant on charges of fraud and money laundering.\n\nAfter a full trial, Tonderai Shayimana (30) was found guilty of siphoning funds meant for the medical institution into his personal accounts after a full trial.\n\nIn sentencing, the magistrate imposed a nine-year jail term, of which six years were suspended.\n\nThree were scrapped on condition of good behaviour and another three on condition of restitution.\n\nShayimana will serve an effective three-year prison term for fraud.\n\nOn the money laundering charge, he was handed a five-year sentence wholly suspended.\n\nMagistrates heard that between August 2023 and March 2024, Shayimana created and used fake company email accounts to mislead medical aid societies, fraudulently instructing them to divert payments due to the clinic into his First Capital Bank account and Ecobank Nostro account.\n\nProsecutors revealed that he pocketed ZWL$15,362,415, ZIG$95,409 and US$123,739, which he later converted into personal assets.\n\nThe offender deliberately abused his position of trust and orchestrated a sophisticated scheme to deprive the clinic and medical societies of large sums of money, the court noted.\n\nWith the proceeds of crime, Shayimana purchased a residential stand in Budiriro for US$6,500, developed it into a seven-roomed house complete with a durawall, security cameras and solar system, and also bought a Nissan NV200 vehicle. Both the house and the vehicle have since been forfeited to the State.\n\nThe court said deterrent penalties in cases of insider fraud would serve justice.\n\nConvicted white-collar criminals will face stiff penalties and ill-got wealth will be forfeited, the National Prosecuting Authority said, commenting on the conviction.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/28155839/Harare-Magistrates-Court.jpg",
            "description": "<p>By Mary Taruvinga The Harare Magistrates’ Court has convicted and jailed for nine years a former Highview Clinic accountant on charges of fraud and money laundering. After a full trial, Tonderai Shayimana (30) was found guilty of siphoning funds meant for the medical institution into his personal accounts after a full trial. In sentencing, the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/former-clinic-accountant-jailed-nine-years-for-fraud-and-money-laundering/\">Former clinic accountant jailed nine years for fraud and money laundering</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:39",
            "date": "22 Aug 2025"
        },
        {
            "title": "Beven Capital Ponzi scheme fugitive arrested in UAE after years on the run, extradited to Zimbabwe over $100,000 fraud",
            "url": "https://www.newzimbabwe.com/beven-capital-ponzi-scheme-fugitive-arrested-in-uae-after-years-on-the-run-extradited-to-zimbabwe-over-100000-fraud/",
            "content": "By Mary Taruvinga\n\nA Zimbabwean man accused of masterminding the notorious Beven Capital Ponzi scheme has been extradited from the United Arab Emirates (UAE) and is now facing multiple charges of fraud, theft by deception, and impersonation in Harare.\n\nShepherd Chibaya (36), identified as one of the founders of the collapsed investment scam, was arrested in the UAE after years on the run and handed over to local authorities through Interpol cooperation.\n\nHe has since been remanded in custody pending trial.\n\nAccording to prosecutors, Beven Capital lured unsuspecting investors with promises of 50% returns in just six weeks, only for the schemes operators to vanish with millions.\n\nInstead of helping victims recover their money, Chibaya allegedly re-emerged to exploit them further by posing as a medical doctor at Parirenyatwa and Parktown Hospitals and pretending to have insider access to the schemes management. Authorities say he even became chairman of the defrauded investors group by leveraging these lies.\n\nIn one of the most elaborate scams, between 2020 and 2021, Chibaya allegedly defrauded a female investor of US$98,000, concocting stories about taxes, bribes and legal fees.\n\nHe is accused of faking his own arrest, impersonating a police officer, and later pretending to be dead to avoid detection.\n\nA stolen Samsung S20 cellphone was also traced back to him.\n\nOther counts include defrauding a complainant of US$850 in 2021 under the guise of tax fees and swindling another investor of US$2,000 after promising to help recover a US$30,000 investment while posing on duty as a doctor.\n\nA third investor lost US$2,000 after being promised recovery of his US$30,000 investment, with the accused again pretending to be on duty as a doctor when collecting cash, the court.\n\nAfter years on the run, the accused person was tracked down by Interpol in the UAE and handed over to Zimbabwean authorities. He has since been remanded in custody pending trial.\n\nIf convicted, Chibaya faces lengthy prison time.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/05/30184728/Fraud.jpg",
            "description": "<p>By Mary Taruvinga A Zimbabwean man accused of masterminding the notorious Beven Capital Ponzi scheme has been extradited from the United Arab Emirates (UAE) and is now facing multiple charges of fraud, theft by deception, and impersonation in Harare. Shepherd Chibaya (36), identified as one of the founders of the collapsed investment scam, was arrested</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/beven-capital-ponzi-scheme-fugitive-arrested-in-uae-after-years-on-the-run-extradited-to-zimbabwe-over-100000-fraud/\">Beven Capital Ponzi scheme fugitive arrested in UAE after years on the run, extradited to Zimbabwe over $100,000 fraud</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:39",
            "date": "22 Aug 2025"
        }
    ]
}