{
    "news": [
        {
            "title": "Pair arrested for possession of 22kgs dagga, cough syrups",
            "url": "https://www.newzimbabwe.com/pair-arrested-for-possession-of-22kgs-dagga-cough-syrups/",
            "content": "By Staff Reporter\n\nPOLICE in Manicaland province have busted two drug dealers, who were found in possession of 22 kilogramme of dagga and other substances stashed in their car.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident that occurred last Thursday along the Harare-Mutare highway.On May 22, 2025, detectives from CID Drugs and Narcotics, Manicaland intercepted a Toyota Wish vehicle and arrested the driver, Erick Manyangadze (42) and passenger, Susan Mutasa (42) in connection with unlawful possession of 22 kilogrammes of skunky dagga and unregistered medicines comprising Broncleer Cough Syrup and Benylin Cough Syrup, said Nyathi.Meanwhile, police in Masvingo arrested Lazarous Mada (54) at Musendo village, Gutu last Saturday in connection with unlawful possession of dagga.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident that occurred last Thursday along the Harare-Mutare highway.\n\nOn May 22, 2025, detectives from CID Drugs and Narcotics, Manicaland intercepted a Toyota Wish vehicle and arrested the driver, Erick Manyangadze (42) and passenger, Susan Mutasa (42) in connection with unlawful possession of 22 kilogrammes of skunky dagga and unregistered medicines comprising Broncleer Cough Syrup and Benylin Cough Syrup, said Nyathi.Meanwhile, police in Masvingo arrested Lazarous Mada (54) at Musendo village, Gutu last Saturday in connection with unlawful possession of dagga.\n\nOn May 22, 2025, detectives from CID Drugs and Narcotics, Manicaland intercepted a Toyota Wish vehicle and arrested the driver, Erick Manyangadze (42) and passenger, Susan Mutasa (42) in connection with unlawful possession of 22 kilogrammes of skunky dagga and unregistered medicines comprising Broncleer Cough Syrup and Benylin Cough Syrup, said Nyathi.\n\nMeanwhile, police in Masvingo arrested Lazarous Mada (54) at Musendo village, Gutu last Saturday in connection with unlawful possession of dagga.\n\nMeanwhile, police in Masvingo arrested Lazarous Mada (54) at Musendo village, Gutu last Saturday in connection with unlawful possession of dagga.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/02/19165033/marijuana-mbanje-e1614188096779.jpg",
            "description": "<p>By Staff Reporter  POLICE in Manicaland province have busted two drug dealers, who were found in possession of 22 kilogramme of dagga and other substances stashed in their car. Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident that occurred last Thursday along the Harare-Mutare highway. “On May 22, 2025, detectives from</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pair-arrested-for-possession-of-22kgs-dagga-cough-syrups/\">Pair arrested for possession of 22kgs dagga, cough syrups</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:38",
            "date": "26 May 2025"
        },
        {
            "title": "Zanu PF factionalism: Suspected State agents abduct Mnangagwa critics’ 73-year-old mother, dump her along highway",
            "url": "https://www.newzimbabwe.com/zanu-pf-factionalism-suspected-state-agents-abduct-mnangagwa-critics-73-year-old-mother-dump-her-along-highway/",
            "content": "By Staff Reporter\n\nSUSPENDED Zanu PF member Godwin Gomwes 73-year-old mother was on Friday night abducted and dumped in Norton, NewZimbabwe.com has learnt.\n\nAccording to Gomwe, his mother was dragged into a Toyota GD6 without number plates, by six suspected State security agents who were looking for his brother, Gifford, at around 8pm.\n\nGodwin Gomwe\n\nGifford, just like his elder brother Godwin, is a vociferous critic of President Emmerson Mnangagwas plot to extend his rule beyond the constitutionally permissible two five-year terms. Also, Gifford contested in Zanu PF primaries to choose a 2023 candidate for Zvimba West against Justice Minister Ziyambi Ziyambi and incumbent legislator Mercy Maruva-Dinha. Besides expulsion which he resists, Gifford recently had his car and rural house vandalized for his stance.\n\nThe suspected Central Intelligence Organisation (CIO) operatives broke down doors, threatened to kill Gomwes mother and burn down her Budiriro 5 house.\n\nRecorded calls between Gomwe and the abductees indicated that they were taking her to their Zvimba rural home, where they sought to have her point out Giffords whereabouts.\n\nGomwe, who was suspended from the ruling party for criticising Mnangagwa and siding with a faction against the partys 2030 Agenda, can be heard in a recorded call begging the abductees to release his mother.\n\nShe had neither eaten nor taken her medication from the time they forcibly took her from their Budiriro home, according to the audios.\n\nA roadblock pitched at an area known as Carina, along the Harare-Bulawayo highway, became a stumbling block for the abductees who felt they could get in trouble with police officers manning the checkpoint.\n\nAs a result, the suspected State agents pushed out the senior from the vehicle a few metres from a Norton roadblock, made a U-turn towards Harare and disappeared. Gomwes mother then approached police officers manning the block for assistance.\n\nThese six men were instructing my mother to share information about Giffords whereabouts but did not tell her why they wanted him, read a statement by Gomwe after she was eventually found.\n\nAfter she was dumped, she walked about 50 metres to the Carina roadblock where I got a call from the Sergeant heading the block to come pick her up.\n\nAn abduction and unlawful entry report has been filed at Budiriro Police Station under RRB number 6414038.\n\nGomwe and nine other party members, who were suspended for challenging a faction in favour of keeping Mnangagwa in power beyond the constitutionally mandated 2028, are yet to be reintegrated.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/03005745/SONA-4-Mnangagwa.png",
            "description": "<p>By Staff Reporter SUSPENDED Zanu PF member Godwin Gomwe’s 73-year-old mother was on Friday night abducted and dumped in Norton, NewZimbabwe.com has learnt. According to Gomwe, his mother was dragged into a Toyota GD6 without number plates, by six suspected State security agents who were looking for his brother, Gifford, at around 8pm. Gifford, just</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-factionalism-suspected-state-agents-abduct-mnangagwa-critics-73-year-old-mother-dump-her-along-highway/\">Zanu PF factionalism: Suspected State agents abduct Mnangagwa critics’ 73-year-old mother, dump her along highway </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:38",
            "date": "26 May 2025"
        },
        {
            "title": "Marshall Munetsi’s equalizer helps Wolves salvage a point against Brentford",
            "url": "https://www.newzimbabwe.com/marshall-munetsis-equalizer-helps-wolves-salvage-a-point-against-brentford/",
            "content": "By Sports Reporter\n\nWARRIORS vice captain Marshall Munetsi scored a crucial goal for English Premier Soccer League (PSL) side Wolverhampton Wanderers, who salvaged a point against Brentford in a match that ended 1-1 Sunday.\n\nMunetsi struck a superb long-range goal in the 75th minute to cancel Bryan Mbeumos first half goal for BrentfordSundays goal marked the Zimbabwean midfieders second EPL goal since joining Wolves in January.The former Orlando Pirates midfieder has played a critical role in helping Wolves to survive relegation since joining the side mid-season from French Legue 1 Nantes.Munetsi made 14 appearances for the side, in the process scoring two goals and proving one assist although for his coach has credited him most for his work rate when they are not in possession of the ball.Wolves finished the 2024/25 season campaign on position 16 thus two above relegation zone with 42 points, the same as giants Manchester United.\n\nMunetsi struck a superb long-range goal in the 75th minute to cancel Bryan Mbeumos first half goal for Brentford\n\nSundays goal marked the Zimbabwean midfieders second EPL goal since joining Wolves in January.The former Orlando Pirates midfieder has played a critical role in helping Wolves to survive relegation since joining the side mid-season from French Legue 1 Nantes.Munetsi made 14 appearances for the side, in the process scoring two goals and proving one assist although for his coach has credited him most for his work rate when they are not in possession of the ball.Wolves finished the 2024/25 season campaign on position 16 thus two above relegation zone with 42 points, the same as giants Manchester United.\n\nSundays goal marked the Zimbabwean midfieders second EPL goal since joining Wolves in January.\n\nThe former Orlando Pirates midfieder has played a critical role in helping Wolves to survive relegation since joining the side mid-season from French Legue 1 Nantes.Munetsi made 14 appearances for the side, in the process scoring two goals and proving one assist although for his coach has credited him most for his work rate when they are not in possession of the ball.Wolves finished the 2024/25 season campaign on position 16 thus two above relegation zone with 42 points, the same as giants Manchester United.\n\nThe former Orlando Pirates midfieder has played a critical role in helping Wolves to survive relegation since joining the side mid-season from French Legue 1 Nantes.\n\nMunetsi made 14 appearances for the side, in the process scoring two goals and proving one assist although for his coach has credited him most for his work rate when they are not in possession of the ball.Wolves finished the 2024/25 season campaign on position 16 thus two above relegation zone with 42 points, the same as giants Manchester United.\n\nMunetsi made 14 appearances for the side, in the process scoring two goals and proving one assist although for his coach has credited him most for his work rate when they are not in possession of the ball.\n\nWolves finished the 2024/25 season campaign on position 16 thus two above relegation zone with 42 points, the same as giants Manchester United.\n\nWolves finished the 2024/25 season campaign on position 16 thus two above relegation zone with 42 points, the same as giants Manchester United.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/08/20220441/Marshall-Munetsi.jpg",
            "description": "<p>By Sports Reporter  WARRIORS vice captain Marshall Munetsi scored a crucial goal for English Premier Soccer League (PSL) side Wolverhampton Wanderers, who salvaged a point against Brentford in a match that ended 1-1 Sunday. Munetsi struck a superb long-range goal in the 75th minute to cancel Bryan Mbeumo’s first half goal for Brentford Sunday’s goal</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/marshall-munetsis-equalizer-helps-wolves-salvage-a-point-against-brentford/\">Marshall Munetsi’s equalizer helps Wolves salvage a point against Brentford</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:38",
            "date": "26 May 2025"
        },
        {
            "title": "Mnangagwa ally Tagwirei’s “Chigananda” remark rattles presidential spokes Charamba",
            "url": "https://www.newzimbabwe.com/mnangagwa-ally-tagwireis-chigananda-remarks-rattle-presidential-spokes-charamba/",
            "content": "By Staff Reporter\n\nPRESIDENT Emmerson Mnangagwas close ally, Kuda Tagwirei has stirred a hornets nest after endorsing a derogatory term Chigananda, which apparently refers to Zanu PF-linked tenderprenuers.\n\nSpeaking at an engagement in Masvingo at the weekend, the tycoon challenged youths to embrace governments economic empowerment programmes, which trigger rapid economic transformation across the country.\n\nHe said the Second Republic under Mnangagwa has created an enabling environment for indigenous people to amass wealth, which inturn translates to power and equates to an army.\n\nTagwirei then invited to the podium successful youthful businesspersons, who included his mentee Obey Chimuka, the proprietor of Fossil Contracting, a company gifted various road construction tenders across the country.\n\nWhile profiling Chimuka, Tagwirei chose to describe him as a Chigananda, a derogatory word for greedy characters which was lately popularised by Vice President Constantino Chiwenga while calling for an end to grand corruption. Plural for the word is Zvigananda.\n\nThis is Obey Chimuka, the owner of Fossil Contracting. He has done so many projects and some people think his projects are my projectshis company is also behind the recent construction of the Mbare Musika Markethe is a Chigananda, said Tagwirei amid wild applause from the audience.\n\nChimuka, who is on the United Kingdom sanctions list, also owns Khaya Cement, formerly LaFarge.\n\nTagwirei, Chief Executive Officer of Sakunda Holdings, was at Masvingo Polytechnic College for the Leadership Success Series programme.\n\nThe utterances by Tagwirei, who doubles as Chairperson of the controversial Land Tenure Implementation Committee, did not sit well with Mnangagwas spokesperson George Charamba, who took to his shadowy X account Dhonzamusoro007 to register his disapproval.\n\nWrote Charamba, My message to Zimbabweans. We can never grow and develop when we give wealth-generating initiatives derogatory names!!!\n\nTitle is key to capitalism we live under. Simply, we must learn to play the game. Unless we want socialism and can have it!!!\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/25083648/Gru8OIOXkAAlzfY.jpeg",
            "description": "<p>By Staff Reporter  PRESIDENT Emmerson Mnangagwa’s close ally, Kuda Tagwirei has stirred a hornet’s nest after endorsing a derogatory term “Chigananda”, which apparently refers to Zanu PF-linked ‘tenderprenuers’. Speaking at an engagement in Masvingo at the weekend, the tycoon challenged youths to embrace government’s economic empowerment programmes, which trigger rapid economic transformation across the country.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-ally-tagwireis-chigananda-remarks-rattle-presidential-spokes-charamba/\">Mnangagwa ally Tagwirei’s “Chigananda” remark rattles presidential spokes Charamba </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:38",
            "date": "26 May 2025"
        },
        {
            "title": "Polytechnic student to perform community service for academic fraud",
            "url": "https://www.newzimbabwe.com/polytechnic-student-to-do-community-service-for-academic-fraud/",
            "content": "By Staff Reporter\n\nIN a significant crackdown on educational corruption, Carlos Tadiwa Mafuwe, a 22-year-old student from Kwekwe Polytechnic, has been convicted for academic fraud and sentenced to perform unpaid work instead of 18 months imprisonment.\n\nThe learner was found guilty under Section 136 of the Criminal Law (Codification and Reform) Act [Chapter 9:23].\n\nThe Zimbabwe Anti-Corruption Commission (ZACC) arrested Mafuwe after he admitted to colluding with a college official to alter his examination results.\n\nCircumstances are that in November 2023, Mafuwe, connived with the colleges Chief Security Officer, Chancemore Sibanda who is still at large, to fraudulently alter his HEXCO (Higher Education Examinations Council) statement of results.\n\nMafuwe paid Sibanda USD70.00 to alter the results for all the modules to distinctions. The matter came to light when the he submitted the statement of results for registration for On Job Educational Training (OJET), and the Examinations Office noticed discrepancies in font size.\n\nThe results were verified with the National Examinations Management Information System (NEMIS), leading to his arrest, said ZAAC in a statement.\n\nDuring police interrogations, Mafuwe confessed to the crime and implicated Sibanda in the scheme.\n\nMafuwe will perform 530 hours of community service after his 18 months jail term was suspended.\n\nMafuwe pleaded guilty to the charge and was convicted and sentenced to 18 months imprisonment. Three months were suspended for five years on condition of good behaviour, while the remaining 15 months were suspended on condition he completes 530 hours of community service.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/29060624/kwekwe-mag.jpg",
            "description": "<p>By Staff Reporter  IN a significant crackdown on educational corruption, Carlos Tadiwa Mafuwe, a 22-year-old student from Kwekwe Polytechnic, has been convicted for academic fraud and sentenced to perform unpaid work instead of 18 months’ imprisonment. The learner was found guilty under Section 136 of the Criminal Law (Codification and Reform) Act [Chapter 9:23]. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/polytechnic-student-to-do-community-service-for-academic-fraud/\">Polytechnic student to perform community service for academic fraud</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:38",
            "date": "26 May 2025"
        }
    ]
}