{
    "news": [
        {
            "title": "ZANU PF demands registration of vehicles donated in party’s name",
            "url": "https://www.newzimbabwe.com/zanu-pf-demands-registration-of-vehicles-donated-in-partys-name/",
            "content": "By Staff Reporter\n\nThe ruling ZANU PF party has directed for the regularisation of cars, among other assets donated to individuals or organisations under its name.\n\nSenior ZANU PF members have been receiving top-of-the-range vehicles like confetti from party donors and well-wishers in what has been viewed as a purchase of power.\n\nIn a memo to the partys provincial leaders, Secretary General Obert Mpofu said cars bearing the logo of ZANU PF should be registered, giving end of the month as a deadline.\n\nPursuant to Section 76, Subsections 4 and 5 of the Party Constitution and relevant sections pertaining to the registration and management of Party assets, the ZANU PF Party is embarking on an exercise to regularise the use and registration of motor vehicles donated in the name of the Party to either individuals or associations.\n\nThis regularisation exercise includes motor vehicles donated directly by well-wishers to individual Party members, Party organs and structures without validation from the Secretary General, Treasurer General or National Secretary for Transport and Social Welfare, and motor vehicles bearing ZANU PF insignia, name, flag or symbols without express authority from the Party.\n\nAccordingly, those in possession of such motor vehicles are requested to surrender these vehicles to the National Secretary for Transport and Social Welfare for regularisation, no later than the 31st of July 2025, read the memo.\n\nSeveral ZANU PF parallel structures received vehicles in the lead up to the 2023 elections, ostensibly to campaign for the ruling party.\n\nMpofus memo comes on the back of factional fights with parallel structures and affiliates being used to support President Emmerson Mnangagwas extension of office beyond the constitutionally limited two terms.\n\nThis is not the first time ZANU PF has demanded its vehicles, as it did so after the 2023 elections, ordering losing parliamentary candidates to return cars that were in their possession.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/08194454/Zanu-PF-cars.png",
            "description": "<p>By Staff Reporter The ruling ZANU PF party has directed for the regularisation of cars, among other assets donated to individuals or organisations under its name. Senior ZANU PF members have been receiving top-of-the-range vehicles like confetti from party donors and well-wishers in what has been viewed as a purchase of power. In a memo</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-demands-registration-of-vehicles-donated-in-partys-name/\">ZANU PF demands registration of vehicles donated in party’s name</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:30",
            "date": "07 Jul 2025"
        },
        {
            "title": "New SRC board appointed",
            "url": "https://www.newzimbabwe.com/new-src-board-appointed/",
            "content": "By Sports Reporter\n\nMinister of Sports Anslem Sanyatwe has appointed a new Sports and Recreation Commission board led by Dr. Nathaniel Madzivanyika.\n\nThe new board is replacing the Gerald Mlotshwa-led executive, which ended its tenure in May.\n\nMlotshwas board stayed for six years after it was trusted with another three-year term in 2022 by the then Minister of Sports, Kirsty Coventry, following the expiration of its first term, which had started in 2019.\n\nMadzivanyikas board will assume duties on Tuesday, the 8th of July and will stay in office up to 2028.\n\nThe Minister of Sport, Recreation, Arts and Culture, Honourable Lt. Gen. (Rtd) A.N.\n\nSanyatwe, has appointed a new Board for the Sports and Recreation Commission (SRC) with effect from 8 July 2025 to 7 July 2029, a strategic move underscoring the Ministrys commitment to ensure inclusive and transparent governance in the sector, announced the Ministry of Sports Permanent Secretary Nicholas Moyo.\n\nThe Ministry has since mandated the board to prioritise grassroots development during its tenure.\n\nTheir collective mandate will be to steer the SRC towards achieving its objectives of promoting, developing and regulating sport and recreation in Zimbabwe, nurturing talent from grassroots to elite levels, improving sports infrastructure, enhancing athlete development programs, added Moyo.\n\nThe appointed Board Members are as follows:\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/07141027/nathaniel.jpg",
            "description": "<p>By Sports Reporter Minister of Sports Anslem Sanyatwe has appointed a new Sports and Recreation Commission board led by Dr. Nathaniel Madzivanyika. The new board is replacing the Gerald Mlotshwa-led executive, which ended its tenure in May. Mlotshwa’s board stayed for six years after it was trusted with another three-year term in 2022 by the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/new-src-board-appointed/\">New SRC board appointed </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:30",
            "date": "07 Jul 2025"
        },
        {
            "title": "More economic turmoil looms as Donald Trump threatens additional tariff for BRICS supporters",
            "url": "https://www.newzimbabwe.com/more-economic-turmoil-looms-as-donald-trump-threatens-additional-tariff-for-brics-supporters/",
            "content": "IOL Business\n\nUS President Donald Trump has threatened an additional 10% tariff on any country aligning with the BRICS nations policies, which could have severe implications for South Africa.\n\nAny country aligning themselves with the Anti-American policies of BRICS will be charged an ADDITIONAL 10% Tariff. There will be no exceptions to this policy, Trump wrote on his Truth Social platform on Sunday night.\n\nThis levy would be implemented over and above the base 10% tariff that is already being planned for all of the countrys global trade partners.\n\nThe new tariff threat was in direct response to criticisms of Trumps unilateral tariff measures, made by BRICS members during a summit held in Rio de Janeiro on Sunday. A joint BRICS statement released after the summit said the upcoming tariffs risked hurting the global economy.\n\nAt the event, BRICS leaders also collectively condemned the recent Israeli and US air strikes on Iran, expressing serious concern over deliberate attacks on civilian infrastructure and peaceful nuclear facilities, and labelling the strikes a violation of international law.\n\nTrumps new threats come at the beginning of a crucial week for the global economy as the US Presidents July 9 tariff deadline looms. While the White House is expected to start sending out letters to its trade partners this week, outlining the new tariffs, Commerce Secretary Howard Lutnick confirmed during a press conference over the weekend that the new tariffs will now take effect from August 1.\n\nThe sweeping global tariffs were originally planned for April 1, but Trump announced a three-month delay after global markets reacted negatively to the looming trade war.\n\nSouth Africa has requested an extension of the 90-day tariff pause, after the US announced its intention to introduce a new trade template for countries in sub-Saharan Africa.\n\nThe US President said he would impose unilateral levies on trade partners unless a deal could be struck by August 1, AFP reported.\n\nSouth Africa stands to lose billions in export revenue should the country face higher tariffs from the US, as well as the potential loss of the African Growth and Opportunity Act (AGOA), which provides duty-free access to that market. SA exports under AGOA amounted to $3.6 billion (R64bn) in 2022.\n\nThe agricultural and automotive sectors could be particularly hard hit. Although in the latter case only BMW and Mercedes export cars from South Africa to the US, these volumes are significant enough to make it the countrys third biggest auto export destination.\n\nBRICS, consisting of 11 emerging nations, including Brazil, Russia, India, China and South Africa, along with more recent entrants such as Iran, accounts for about half of the worlds population and 40% of global economic output.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/24134447/brics.webp",
            "description": "<p>IOL Business US President Donald Trump has threatened an additional 10% tariff on any country aligning with the BRICS nations’ policies, which could have severe implications for South Africa. “Any country aligning themselves with the Anti-American policies of BRICS will be charged an ADDITIONAL 10% Tariff. There will be no exceptions to this policy,” Trump</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/more-economic-turmoil-looms-as-donald-trump-threatens-additional-tariff-for-brics-supporters/\">More economic turmoil looms as Donald Trump threatens additional tariff for BRICS supporters</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:30",
            "date": "07 Jul 2025"
        },
        {
            "title": "UK: We are changing the narrative – says Madzingo as Reading honours Zim-born mayor",
            "url": "https://www.newzimbabwe.com/uk-we-are-changing-the-narrative-says-madzingo-as-reading-honours-zim-born-mayor/",
            "content": "By Gilbert Nyambabvu\n\nThe recent election of Zimbabwe-born researcher,Dr Alice Mpofu-Coles,as mayor in the south-east of English city of Reading is emblematic of the shifting narrative about Africans in the diaspora as they become high achievers and change makers.\n\nThis was said byDiaspora InsuranceCEO Jeff Madzingo at a reception in Reading last week to celebrate Dr Mpofu-Coles election. She took over as mayor of the Berkshire city in May this year, having served four years as a councillor for Whitley Ward.\n\nThis is a huge achievement, not just for yourself but for us as a people and, more importantly, for our children, said Madzingo whosecompanysupported the hosting of the event.\n\nGone are the days when our children grew up without role models and thought that the barriers are too high for them. Your election is evidence that it can be done.\n\nDiaspora Insurance CEO Jeff Madzingo\n\nMadzingoadded; Honourable mayor, we cant salute you enough for doing this because, over the years, the story has been about negativity and poverty, but we are now changing the narrative to a story of resilience and a story of excellence.\n\nBeing mayor in a foreign country is not a joke but success is not accidental; its a culmination of good habits, hard work, professionalism and time management.\n\nDr Mpofu-Coles recounted what she described as a tough journey since relocating to the United Kingdom in 2002 from Zimbabwe and surviving a five-year battle against breast cancer.\n\nIm overwhelmed, she said before kneeling and clapping her hands in appreciation in the traditional Zimbabwean way.\n\nI arrived in the UK in 2002 and thought I would go back to Zimbabwe and become a member of Parliament for the then MDC (party). We were really passionate about Zimbabwe and campaigned right across the country.\n\nShe added, Its been tough; I had breast cancer or five years, and, in that time, I couldnt do anything, but this city of Reading carried me. It was amazing having people care for you.\n\nDr Mpofu-Coles was described as a poster girl of the idea that if I make it, Ill always turn back to pull my sister out too; I wouldnt just walk away.\n\nA former diplomat who served in Zimbabwes foreign service with postings in Mozambique and the former Yugoslavia Dr Mpofu-Coles brings a remarkable personal journey to her mayoral role.\n\nAfter arriving in Reading in 2002 as a refugee she had to rebuild her life in the UK, working hard in a sandwich factory, as a cleaner, a carer for the elderly and disabled, then qualified as social worker, before studying for a doctorate in Human Geography at the University of Reading and building a career in academia.\n\nHaving been supported by Reading Refugee Support Group herself, she became the Chair of the charity and has dedicated her time to advocate for refugees now as a trustee of City of Sanctuary.\n\nAs a Reading councillor, Dr Mpofu-Coles has chaired the Adult Social Care, Childrens Services and Education Committee, and sits on the Parenting Panel, Health and Wellbeing Board and Safer Reading Neighbourhood Forum, among others.\n\nA strong advocate or refugees and fighter against inequalities and poverty, Dr Mpofu-Coles chosen charities for her mayoral year are ReadiFood, a local foodbank service, and Utulivu Womens group, which supports equal opportunities for BAME and refugee women and girls.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/07074126/image00051-e1751870505678.png",
            "description": "<p>By Gilbert Nyambabvu The recent election of Zimbabwe-born researcher, Dr Alice Mpofu-Coles, as mayor in the south-east of English city of Reading is emblematic of the shifting narrative about Africans in the diaspora as they become high achievers and change makers. This was said by Diaspora Insurance CEO Jeff Madzingo at a reception in Reading</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uk-we-are-changing-the-narrative-says-madzingo-as-reading-honours-zim-born-mayor/\">UK: We are changing the narrative – says Madzingo as Reading honours Zim-born mayor</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:30",
            "date": "07 Jul 2025"
        },
        {
            "title": "South Africa’s Mulder makes record score as new Test captain in match against Zimbabwe’s Chevrons",
            "url": "https://www.newzimbabwe.com/south-africas-mulder-makes-record-score-as-new-test-captain-in-match-against-zimbabwes-chevrons/",
            "content": "By Reuters\n\nSOUTH Africas stand-in captain Wiaan Mulder scored an unbeaten double century to set a record for a new test skipper and help his side to a formidable 465 for four wickets on the first day of the second test against Zimbabwe in Bulawayo on Sunday.\n\nMulder made 264 not out, the highest score by a player in his first test innings as captain, eclipsing Graham Dowlings 239 for New Zealand against India 56 years ago.The 27-year-old all-rounder took over as skipper from the injured Keshav Maharaj and led from the front as the touring side thrashed the ball to all corners of the Queens Sports Club.It was a second successive century for Mulder, who hit 147 in the second innings of South Africas 328-run win in the first test.His century came up in 118 balls and his double ton in 214, the second fastest by a South African in test cricket, and as the run rate increased he got to 250 off 243 balls including 35 boundaries.LSouth Africa, playing without many of the key players who helped them to win the World Test Championship final against Australia last month, were put into bat by Zimbabwe, who removed openers Tony de Zorzi (10) and debutant Lesogo Senokwane (3) cheaply in a positive start.But Mulder, promoted up the order to number three since the Lords final, and David Bedingham put on 184 runs for the third wicket before the latter was trapped lbw by Tanaka Chivanga for 82.Teenager Lhuan-dre Pretorius was aggressive from the outset and scored 78 off 87 balls before top edging and being caught to end a 217-run partnership with Mulder.After Pretorius was dismissed, Zimbabwe took the new ball and Mulder was bowled when on 247, only for a no ball to be called as Chivanga had overstepped.Mulder will resume on Monday with Dewald Brevis, who is 15 not out, with Sundays play halted by bad light just before the close.Writing by Mark Gleeson in Cape Town; Editing by Ed Osmond.\n\nMulder made 264 not out, the highest score by a player in his first test innings as captain, eclipsing Graham Dowlings 239 for New Zealand against India 56 years ago.\n\nThe 27-year-old all-rounder took over as skipper from the injured Keshav Maharaj and led from the front as the touring side thrashed the ball to all corners of the Queens Sports Club.It was a second successive century for Mulder, who hit 147 in the second innings of South Africas 328-run win in the first test.His century came up in 118 balls and his double ton in 214, the second fastest by a South African in test cricket, and as the run rate increased he got to 250 off 243 balls including 35 boundaries.LSouth Africa, playing without many of the key players who helped them to win the World Test Championship final against Australia last month, were put into bat by Zimbabwe, who removed openers Tony de Zorzi (10) and debutant Lesogo Senokwane (3) cheaply in a positive start.But Mulder, promoted up the order to number three since the Lords final, and David Bedingham put on 184 runs for the third wicket before the latter was trapped lbw by Tanaka Chivanga for 82.Teenager Lhuan-dre Pretorius was aggressive from the outset and scored 78 off 87 balls before top edging and being caught to end a 217-run partnership with Mulder.After Pretorius was dismissed, Zimbabwe took the new ball and Mulder was bowled when on 247, only for a no ball to be called as Chivanga had overstepped.Mulder will resume on Monday with Dewald Brevis, who is 15 not out, with Sundays play halted by bad light just before the close.Writing by Mark Gleeson in Cape Town; Editing by Ed Osmond.\n\nThe 27-year-old all-rounder took over as skipper from the injured Keshav Maharaj and led from the front as the touring side thrashed the ball to all corners of the Queens Sports Club.\n\nIt was a second successive century for Mulder, who hit 147 in the second innings of South Africas 328-run win in the first test.His century came up in 118 balls and his double ton in 214, the second fastest by a South African in test cricket, and as the run rate increased he got to 250 off 243 balls including 35 boundaries.LSouth Africa, playing without many of the key players who helped them to win the World Test Championship final against Australia last month, were put into bat by Zimbabwe, who removed openers Tony de Zorzi (10) and debutant Lesogo Senokwane (3) cheaply in a positive start.But Mulder, promoted up the order to number three since the Lords final, and David Bedingham put on 184 runs for the third wicket before the latter was trapped lbw by Tanaka Chivanga for 82.Teenager Lhuan-dre Pretorius was aggressive from the outset and scored 78 off 87 balls before top edging and being caught to end a 217-run partnership with Mulder.After Pretorius was dismissed, Zimbabwe took the new ball and Mulder was bowled when on 247, only for a no ball to be called as Chivanga had overstepped.Mulder will resume on Monday with Dewald Brevis, who is 15 not out, with Sundays play halted by bad light just before the close.Writing by Mark Gleeson in Cape Town; Editing by Ed Osmond.\n\nIt was a second successive century for Mulder, who hit 147 in the second innings of South Africas 328-run win in the first test.\n\nHis century came up in 118 balls and his double ton in 214, the second fastest by a South African in test cricket, and as the run rate increased he got to 250 off 243 balls including 35 boundaries.LSouth Africa, playing without many of the key players who helped them to win the World Test Championship final against Australia last month, were put into bat by Zimbabwe, who removed openers Tony de Zorzi (10) and debutant Lesogo Senokwane (3) cheaply in a positive start.But Mulder, promoted up the order to number three since the Lords final, and David Bedingham put on 184 runs for the third wicket before the latter was trapped lbw by Tanaka Chivanga for 82.Teenager Lhuan-dre Pretorius was aggressive from the outset and scored 78 off 87 balls before top edging and being caught to end a 217-run partnership with Mulder.After Pretorius was dismissed, Zimbabwe took the new ball and Mulder was bowled when on 247, only for a no ball to be called as Chivanga had overstepped.Mulder will resume on Monday with Dewald Brevis, who is 15 not out, with Sundays play halted by bad light just before the close.Writing by Mark Gleeson in Cape Town; Editing by Ed Osmond.\n\nHis century came up in 118 balls and his double ton in 214, the second fastest by a South African in test cricket, and as the run rate increased he got to 250 off 243 balls including 35 boundaries.\n\nLSouth Africa, playing without many of the key players who helped them to win the World Test Championship final against Australia last month, were put into bat by Zimbabwe, who removed openers Tony de Zorzi (10) and debutant Lesogo Senokwane (3) cheaply in a positive start.But Mulder, promoted up the order to number three since the Lords final, and David Bedingham put on 184 runs for the third wicket before the latter was trapped lbw by Tanaka Chivanga for 82.Teenager Lhuan-dre Pretorius was aggressive from the outset and scored 78 off 87 balls before top edging and being caught to end a 217-run partnership with Mulder.After Pretorius was dismissed, Zimbabwe took the new ball and Mulder was bowled when on 247, only for a no ball to be called as Chivanga had overstepped.Mulder will resume on Monday with Dewald Brevis, who is 15 not out, with Sundays play halted by bad light just before the close.Writing by Mark Gleeson in Cape Town; Editing by Ed Osmond.\n\nLSouth Africa, playing without many of the key players who helped them to win the World Test Championship final against Australia last month, were put into bat by Zimbabwe, who removed openers Tony de Zorzi (10) and debutant Lesogo Senokwane (3) cheaply in a positive start.\n\nBut Mulder, promoted up the order to number three since the Lords final, and David Bedingham put on 184 runs for the third wicket before the latter was trapped lbw by Tanaka Chivanga for 82.Teenager Lhuan-dre Pretorius was aggressive from the outset and scored 78 off 87 balls before top edging and being caught to end a 217-run partnership with Mulder.After Pretorius was dismissed, Zimbabwe took the new ball and Mulder was bowled when on 247, only for a no ball to be called as Chivanga had overstepped.Mulder will resume on Monday with Dewald Brevis, who is 15 not out, with Sundays play halted by bad light just before the close.Writing by Mark Gleeson in Cape Town; Editing by Ed Osmond.\n\nBut Mulder, promoted up the order to number three since the Lords final, and David Bedingham put on 184 runs for the third wicket before the latter was trapped lbw by Tanaka Chivanga for 82.\n\nTeenager Lhuan-dre Pretorius was aggressive from the outset and scored 78 off 87 balls before top edging and being caught to end a 217-run partnership with Mulder.After Pretorius was dismissed, Zimbabwe took the new ball and Mulder was bowled when on 247, only for a no ball to be called as Chivanga had overstepped.Mulder will resume on Monday with Dewald Brevis, who is 15 not out, with Sundays play halted by bad light just before the close.Writing by Mark Gleeson in Cape Town; Editing by Ed Osmond.\n\nTeenager Lhuan-dre Pretorius was aggressive from the outset and scored 78 off 87 balls before top edging and being caught to end a 217-run partnership with Mulder.\n\nAfter Pretorius was dismissed, Zimbabwe took the new ball and Mulder was bowled when on 247, only for a no ball to be called as Chivanga had overstepped.Mulder will resume on Monday with Dewald Brevis, who is 15 not out, with Sundays play halted by bad light just before the close.Writing by Mark Gleeson in Cape Town; Editing by Ed Osmond.\n\nAfter Pretorius was dismissed, Zimbabwe took the new ball and Mulder was bowled when on 247, only for a no ball to be called as Chivanga had overstepped.\n\nMulder will resume on Monday with Dewald Brevis, who is 15 not out, with Sundays play halted by bad light just before the close.Writing by Mark Gleeson in Cape Town; Editing by Ed Osmond.\n\nMulder will resume on Monday with Dewald Brevis, who is 15 not out, with Sundays play halted by bad light just before the close.\n\nWriting by Mark Gleeson in Cape Town; Editing by Ed Osmond.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/07045406/1749209031240_Wiaan_Mulder_SA_AUS_WTC_Final_2025.webp",
            "description": "<p>By Reuters SOUTH Africa’s stand-in captain Wiaan Mulder scored an unbeaten double century to set a record for a new test skipper and help his side to a formidable 465 for four wickets on the first day of the second test against Zimbabwe in Bulawayo on Sunday. Mulder made 264 not out, the highest score</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africas-mulder-makes-record-score-as-new-test-captain-in-match-against-zimbabwes-chevrons/\">South Africa’s Mulder makes record score as new Test captain in match against Zimbabwe’s Chevrons </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:30",
            "date": "07 Jul 2025"
        },
        {
            "title": "New signing inspires CAPS United to narrow victory over Scottland FC",
            "url": "https://www.newzimbabwe.com/new-signing-inspires-caps-united-to-narrow-victory-over-scottland-fc/",
            "content": "By Sports Reporter\n\nCAPS Uniteds new striker Chris Mugalu announced his arrival at the club with a first half goal against Scottland FC to inspire his side to win 1-0 against Scottland FC.\n\nMugalu, who signed for the Harare giants from Zambia, scored an offensive header which nestled in the top right corner of the net, giving Scottland FC goalkeeper Talbert Shumba no chance.\n\nOther than playing Mugalu, CAPS United coach Ian Bakala also fielded new defender Chitoshu Chinga and Ishamael Wadi who is marking his return at the club after spending four years in South Africa.\n\nSo important was Sundays win that it propelled The Green Machine to tenth position on the log, a huge step in their quest to fight relegation.\n\nI credit most of the players, I think they performed very well according to how we planned, but I saw it coming through training.\n\nDespite the small mistakes which we made, it was a good game, said Bakala.\n\nAlthough Makepekepe walked away with three points, the second half largely belonged to Scottland FC, who missed several chances.\n\nThe Mabvuku-based side even found the back of the net in the 89th minute only for it to be ruled offside.\n\nCommenting after the match, team head coach Tonderai Ndiraya expressed disappointment in his defenders.\n\nVery disappointing results if you really consider the way we played today.\n\nThen we failed to defend, thats how CAPS managed to score today.\n\nIm a bit sad because with the experience that we have in the back, we didnt expect our defenders to allow a free-header like they did in those moments, said Ndiraya.\n\nSundays defeat saw Scottland FC dropping to fifth position on the log table with 28 points, 12 behind pacesetters MWOS, who are on 40.\n\nPSL Results Matchday 19 Results\n\nDynamos 0-2 HerentalsGreenfuel 0-1 Ngezi PlatinumSimba Bhora 1-1 ZPC KaribaMWOS 1-0 BikitaChicken Inn 2-1 YadahKwekwe United 0-0 HighlandersScottland 0-1 CAPS UnitedTriangle United 1-1 TelOne.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/02051721/caps-united.jpeg",
            "description": "<p>By Sports Reporter CAPS United’s new striker Chris Mugalu announced his arrival at the club with a first half goal against Scottland FC to inspire his side to win 1-0 against Scottland FC. Mugalu, who signed for the Harare giants from Zambia, scored an offensive header which nestled in the top right corner of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/new-signing-inspires-caps-united-to-narrow-victory-over-scottland-fc/\">New signing inspires CAPS United to narrow victory over Scottland FC</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:30",
            "date": "07 Jul 2025"
        },
        {
            "title": "Zimbabwean teen karateka wins silver at regional tournament",
            "url": "https://www.newzimbabwe.com/zimbabwean-teen-karateka-wins-silver-at-regional-tournament/",
            "content": "By Tapiwa Svondo\n\nA CROWD funding drive for 17-year-old Zimbabwean karateka Bongeka Mbokodo Mguni ended in triumph, with the karateka clinching a silver medal at the 2025 African Union (AU) Region 5 Youth Games held in Namibia at the weekend.\n\nInorder to meet expenses to attend the tournament, Mguni, who lives with albinism, appealed for $150 for travel costs but the public responded overwhelmingly and raised US$596.\n\nProminent advocate for albinism and cancer awareness, Marvellous Tshuma, spearheaded the campaign.\n\nHowever, the Zimbabwe National Karate Federation (ZNKF) released a statement during the viral appeal, urging the public not to donate money, claiming all athlete expenses were fully covered by the Ministry of Sport. They deemed Mgunis appeal unfortunate, inaccurate, and misleading.\n\nUndeterred by the controversy, Mguni excelled, earning a silver medal in the Under 65kgs karate tournament.\n\nBongeka Mbokodo Mguni\n\nTshuma celebrated Mgunis achievement in a social media post at the weekend.\n\nShe is living proof that albinism is not a limitation. Congratulations to Bongeka Mbokodo Mguni, she is just 17 but she is on a mission to win, inspire and change the narrative that persons with albinism cannot compete in mainstream sports, wrote Tshuma.\n\nBongeka is a decorated young sports girl who has already bagged many accolades in karate. She is living proof that albinism is not a limitation, she too belongs in the arena without fear or favour.\n\nAmhlophe, congratulations, makorokoto for representing Zimbabwe with decorum and pride. She won us a whole silver medal on the under 65kgs karate tournament during the 2025 AU Region 5 Youth Games in Namibia this weekend.\n\nThank you to all who supported her on this. May God continue to bless all for touching the life of our champ, added the lead fundraiser.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/06211851/443321.jpg",
            "description": "<p>By Tapiwa Svondo A CROWD funding drive for 17-year-old Zimbabwean karateka Bongeka ‘Mbokodo’ Mguni ended in triumph, with the karateka clinching a silver medal at the 2025 African Union (AU) Region 5 Youth Games held in Namibia at the weekend. Inorder to meet expenses to attend the tournament, Mguni, who lives with albinism, appealed for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-teen-karateka-wins-silver-at-regional-tournament/\">Zimbabwean teen karateka wins silver at regional tournament </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:30",
            "date": "07 Jul 2025"
        }
    ]
}