{
    "news": [
        {
            "title": "Warriors suffer 3-1 defeat to Algeria as new coach marks debut",
            "url": "https://www.newzimbabwe.com/warriors-suffer-3-1-defeat-to-algeria-as-new-coach-marks-debut/",
            "content": "By Sports Reporter\n\nNew Warriors coach Marian Marinica began his tenure with a 3-1 defeat to Algeria in an international friendly played at the Prince Abdullah Al-Faisal Stadium in Saudi Arabia.\n\nMarinica fielded a starting eleven that featured several new faces, with Gerald Takwara captaining the side.\n\nAlgeria dominated from the first whistle and needed only 14 minutes to open the scoring through Bagdad Bounedjah, who fired past goalkeeper Washington Arubi.\n\nThe Desert Foxes doubled their advantage in the 40th minute when Mohamed Amoura finished superbly after poor marking by the Zimbabwean defence.\n\nRight on the stroke of halftime, Algerian defender Jaouen Ahjam added a third, again capitalising on Zimbabwes weak defense.\n\nAt the start of the second half, Marinica made four changes, bringing on Prosper Padera, Tawanda Chirewa, Godknows Murwira, and Prince Dube to substitute Bill Antonio, Sean Fusire, Washington Navaya, and Tawanda Maswanhise.\n\nThe substitutions steadied the team, and Zimbabwe began to pose occasional threats going forward.\n\nThe Warriors finally found the net in the 86th minute when Chirewa converted a penalty he had won after being fouled in the box.\n\nDespite the 3-1 defeat, Marinica will take some positives, notably helping Zimbabwe end a four-match goal drought, their last goal having come against Niger in a friendly back in June.\n\nZimbabwe now shifts focus to their next fixture against Qatar on Monday.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/13191959/IMG_20251113_211630.jpg",
            "description": "<p>By Sports Reporter New Warriors coach Marian Marinica began his tenure with a 3-1 defeat to Algeria in an international friendly played at the Prince Abdullah Al-Faisal Stadium in Saudi Arabia. Marinica fielded a starting eleven that featured several new faces, with Gerald Takwara captaining the side. Algeria dominated from the first whistle and needed</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/warriors-suffer-3-1-defeat-to-algeria-as-new-coach-marks-debut/\">Warriors suffer 3-1 defeat to Algeria as new coach marks debut</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "13 Nov 2025"
        },
        {
            "title": "Sikhala granted R10,000 bail by South African court",
            "url": "https://www.newzimbabwe.com/sikhala-granted-r10000-bail-by-south-african-court/",
            "content": "By Costa Nkomo\n\nOpposition leader Job Sikhala and his co-accused Alexander Thema have been granted R10 000 bail each by the Pretoria Magistrates Court.\n\nThe matter has been moved to 3 February 2026.\n\nSikhala and his elderly uncle, Thema were arrested last week on charges of possession of explosives. The two maintain their innocence.\n\nAccording to Gauteng regional spokesperson for South Africas National Prosecuting Authority (NPA), Lumka Mahanjana, police intercepted the pair along Kgosi Mampuru Street in Pretoria on November 6 following a tip-off about a suspicious vehicle.\n\nThe vehicle was searched and found with 26 blasting cartridges and 15 capped fuse connectors.\n\nSikhala insists it was a set-up, describing his detention as politically motivated.\n\nSikhala has been frequenting South Africa for medical treatment after his health deteriorated when he spentover 500 days in pretrial detention before being released without charge.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/10115142/20251110_135118.jpg",
            "description": "<p>By Costa Nkomo Opposition leader Job Sikhala and his co-accused Alexander Thema have been granted R10 000 bail each by the Pretoria Magistrates Court. The matter has been moved to 3 February 2026. Sikhala and his elderly uncle, Thema were arrested last week on charges of possession of explosives. The two maintain their innocence. According</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sikhala-granted-r10000-bail-by-south-african-court/\">Sikhala granted R10,000 bail by South African court</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "13 Nov 2025"
        },
        {
            "title": "Gweru medical doctor busted smoking crystal meth",
            "url": "https://www.newzimbabwe.com/gweru-medical-doctor-busted-smoking-crystal-meth/",
            "content": "By Staff Reporter\n\nA Gweru-based medical doctor, Farikai Manjeya (49), has been arrested alongside three accomplices after being caught smoking methamphetamine, commonly known locally asmutoriro.\n\nManjeya was apprehended at his residence in Gweru while allegedly smoking the illicit substance with Tafara Chigoya (28), Kudakwashe Godknows Mutata (29), and Tariro Pambwa (35).\n\nAccording to a statement by the National Prosecuting Authority of Zimbabwe (NPAZ), police received a tip-off on November 9 about suspected drug activity at the doctors cottages.\n\nWhen detectives raided the premises, they reportedly found the group smoking crystal meth using J-pipes and lighters. The items were seized, and all four suspects were immediately arrested.\n\nThe accused have since appeared in court and were remanded in custody pending a bail hearing.\n\nThe NPAZ reiterated that drug offences will not be tolerated and encouraged the public to report drug use to protect young people and communities.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/09/29054941/Doctor.jpg",
            "description": "<p>By Staff Reporter A Gweru-based medical doctor, Farikai Manjeya (49), has been arrested alongside three accomplices after being caught smoking methamphetamine, commonly known locally as mutoriro. Manjeya was apprehended at his residence in Gweru while allegedly smoking the illicit substance with Tafara Chigoya (28), Kudakwashe Godknows Mutata (29), and Tariro Pambwa (35). According to a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/gweru-medical-doctor-busted-smoking-crystal-meth/\">Gweru medical doctor busted smoking crystal meth</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "13 Nov 2025"
        },
        {
            "title": "Mwonzora has destroyed MDC – opposition activist says as youths seize control of party headquarters",
            "url": "https://www.newzimbabwe.com/mwonzora-has-destroyed-mdc-opposition-activist-says-as-youths-seize-control-of-party-headquarters/",
            "content": "By Darlington Gatsi\n\nMovement for Democratic Change (MDC) is in a tense fight for its premises after an activist from the party seized the Morgan Richard Tsvangirai building, popularly known as Harvest House.\n\nThe building, known as Harvest House, was seized by Shakespeare Mukoyi, who serves as the Secretary for Defence, on Wednesday. He claimed to have evicted Douglas Mwonzora, whom he accused of running down the party.\n\nSpeaking after the takeover of the party headquarters, Mukoyi said the once formidable opposition party had fallen under Mwonzoras leadership.\n\nIn the history of the MDC, even in the hostile areas, never had a day it got a zero on a polling station, let alone in a ward. So it gives us a worry as members of the security. Currently, I am holding the position of secretary for defence. It is my obligation and powers invested in my office to make sure that I defend this movement from internal adversaries to external adversaries, said Mukoyi.\n\nThe takeover by Mukoyi is the latest battle for what remains of the MDC, which took a political nosedive after the death of Morgan Tsvangirai in 2018.\n\nSince 2018, the party has been rocked by infighting and splits, weakening a movement that had formidably challenged ZANU PF under Tsvangirai.\n\nThe MDC under Mwonzora took over Harvest House in 2020 from the MDC Alliance, which was then led by Nelson Chamisa, at the height of the partys infighting.\n\nIn a statement, the MDC said the move was an attempt to thwart the partys resistance to ZANU PFs agenda to extend President Emmerson Mnangagwas tenure.\n\nIt has come to the attention of the party leadership that one of our comrades gone rogue, Shaky Mukoyi, has locked the partys head office on the guise of purportedly seeking medical assistance.\n\nIt opened up an opportunity for those who have sold their souls to the regime who are advocating for the 2030 agenda within the party, said MDC.\n\nThe MDC added that it would reclaim the building from the youths.\n\nWe will not give in to extortion and rapacity as the MDC assets belong to bona fide members and under the custodianship of the current leadership under the law.\n\nThuggery and banditry are not an MDC culture and will never be since we have been victims of these since the Mugabe regime.\n\nLastly, let me reassure our members, members of the media, the diaspora, and all those who are concerned that within no time, we are taking our property back.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/29172327/Douglas-Mwonzora.jpg",
            "description": "<p>By Darlington Gatsi Movement for Democratic Change (MDC) is in a tense fight for its premises after an activist from the party seized the Morgan Richard Tsvangirai building, popularly known as Harvest House. The building, known as Harvest House, was seized by Shakespeare Mukoyi, who serves as the Secretary for Defence, on Wednesday. He claimed</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mwonzora-has-destroyed-mdc-opposition-activist-says-as-youths-seize-control-of-party-headquarters/\">Mwonzora has destroyed MDC – opposition activist says as youths seize control of party headquarters </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "13 Nov 2025"
        },
        {
            "title": "Harare residents petition Parliament over weak enforcement of environmental laws amid worsening pollution at Lake Chivero",
            "url": "https://www.newzimbabwe.com/harare-residents-petition-parliament-over-weak-enforcement-of-environmental-laws-amid-worsening-pollution-at-lake-chivero/",
            "content": "By Thandiwe Garusa\n\nHARARE residents have petitioned Parliament, demanding urgent action to address worsening water pollution, citing weak enforcement of environmental laws and institutional failures that have turned Lake Chivero and surrounding water sources into serious health hazards.\n\nThe residents say the persistent pollution is largely caused by the continuous discharge of raw sewage from Chitungwiza, Harare, and Epworth, due to non-functional sewer systems. They also accuse industries of releasing untreated effluent into municipal sewer networks in violation of the Environmental Management Act.\n\nIn a petition tabled before Parliament by the Combined Harare Residents Association (CHRA), residents urged legislators to strengthen water legislation, create a dedicated regulatory authority, and enforce tougher measures to curb pollution and restore water safety.\n\nHarmonise existing environmental water laws and regulations to eliminate overlapping contradictions.\n\nReform water laws to establish a dedicated regulatory authority, the Water and Wastewater Services Regulatory Unit, which would oversee wastewater and drinking water management, enforce water quality standards, conduct regular audits, and ensure public health compliance.\n\nInclude legal provisions in environmental water laws to ensure that fines and permit fees collected under the polluter pays principle are exclusively used for pollution mitigation and ecological restoration, reads part of the petition.\n\nThe petitioners also called for a review of the Environmental Management Act [Chapter 20:27] and related pollution laws to ensure that fines and permit fees reflect the actual cost of environmental damage, while introducing incentives for industries to minimise or prevent pollution.\n\nLake Chivero, Harares main water source, remains heavily polluted with nutrients such as phosphates and nitrates, which have triggered the proliferation of cyanobacteria (blue-green algae) and the release of toxins harmful to aquatic life and human health.\n\nTests conducted on water samples have revealed contamination levels capable of causing serious health complications.\n\nIn November 2024, government banned fishing activities at Lake Chivero after excessive pollution led to the deaths of four rhinos, fish, and other wildlife.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/18163427/chivero-11.jpeg",
            "description": "<p>By Thandiwe Garusa HARARE residents have petitioned Parliament, demanding urgent action to address worsening water pollution, citing weak enforcement of environmental laws and institutional failures that have turned Lake Chivero and surrounding water sources into serious health hazards. The residents say the persistent pollution is largely caused by the continuous discharge of raw sewage from</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-residents-petition-parliament-over-weak-enforcement-of-environmental-laws-amid-worsening-pollution-at-lake-chivero/\">Harare residents petition Parliament over weak enforcement of environmental laws amid worsening pollution at Lake Chivero</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "13 Nov 2025"
        },
        {
            "title": "Police investigating abduction of two CUT students during SRC election campaigns",
            "url": "https://www.newzimbabwe.com/police-investigating-abduction-of-two-cut-students-during-src-election-campaigns/",
            "content": "By Thandiwe Garusa\n\nThe Zimbabwe Republic Police (ZRP) says investigations are underway following the reported abduction of two Chinhoyi University of Technology (CUT) students, Lindon Zanga and Malvin Madanda.\n\nThe two, who are members of the Zimbabwe National Students Union (ZINASU), were allegedly abducted on Monday night at Mzimba Shopping Centre in Chinhoyi during Students Representative Council (SRC) election campaigns.\n\nAccording to ZINASU, Zanga and Madanda were seized by unidentified individuals driving an unmarked grey Isuzu vehicle, which had reportedly been seen on campus earlier distributing campaign materials for their rivals, the Zimbabwe Congress of Students Union (ZICOSU).\n\nThe students were found 12 hours later, allegedly tortured and dumped in Shamva.\n\nIn a statement issued Wednesday, ZRP spokesperson Assistant Commissioner Paul Nyathi confirmed that investigations were in progress and appealed to the public for information that could assist in identifying the perpetrators.\n\nZRP confirms that investigations are being conducted in connection with the alleged abduction of Chinhoyi University of Technology students, Lindon Zanga (21) and Malvin Madanda (29), alias Saint, on 10th November 2025.\n\nZRP urges anyone with information on what actually transpired, as well as the possible location or identification of suspects involved in this incident, to contact any nearest police station or the CID Chinhoyi, Nyathi said.\n\nZINASU has accused Zanu PF Youth League Political Commissar Taurai Kandishaya of being involved in the incident, alleging that he was using state resources to suppress dissent and manipulate the outcome of the student elections.\n\nAfter their release, the two students said they were subjected to 12 hours of torture for allegedly chanting slogans against the ruling Zanu PF party during their SRC campaign activities.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/11111935/CUT-ZINASU.jpeg",
            "description": "<p>By Thandiwe Garusa The Zimbabwe Republic Police (ZRP) says investigations are underway following the reported abduction of two Chinhoyi University of Technology (CUT) students, Lindon Zanga and Malvin Madanda. The two, who are members of the Zimbabwe National Students Union (ZINASU), were allegedly abducted on Monday night at Mzimba Shopping Centre in Chinhoyi during Students</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/police-investigating-abduction-of-two-cut-students-during-src-election-campaigns/\">Police investigating abduction of two CUT students during SRC election campaigns</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "13 Nov 2025"
        },
        {
            "title": "Warriors midfielder Andy Rinomhota back at Reading FC",
            "url": "https://www.newzimbabwe.com/warriors-midfielder-andy-rinomhota-back-at-reading-fc/",
            "content": "By Sports Reporter\n\nAfter spending five months without a club, Warriors midfielder Andy Rinomhota has rejoinedEnglish League One side Reading FC.\n\nRinomhota re-signed for Reading as a free agent following the expiry of his contract with Championship outfit Cardiff City earlier this year.\n\nThe 28-year-old midfielder has agreed to an eight-month deal that will keep him at the club until the end of the current season.\n\nRinomhota is no stranger to the Royals, having come through the clubs development ranks and representing Reading from 2015 to 2022. During that period, he made 138 senior appearances and scored four goals before departing for Cardiff in June 2022.\n\nWelcoming the player back, Reading head coach Leam Richardson said he was confident Rinomhotas experience and commitment would strengthen the squad.\n\nIve worked with Andy before and know exactly what hell bring to the team: energy, honesty, and a real desire to win. He is a great professional who knows this club and what it means to represent Reading. Im delighted to have him back, and Im sure the fans will be too, Richardson said.\n\nRinomhota is expected to make his second debut for Reading on November 22, when club football resumes after the international break.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/12192641/andy.jpeg",
            "description": "<p>By Sports Reporter After spending five months without a club, Warriors midfielder Andy Rinomhota has rejoined English League One side Reading FC. Rinomhota re-signed for Reading as a free agent following the expiry of his contract with Championship outfit Cardiff City earlier this year. The 28-year-old midfielder has agreed to an eight-month deal that will keep</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/warriors-midfielder-andy-rinomhota-back-at-reading-fc/\">Warriors midfielder Andy Rinomhota back at Reading FC</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "13 Nov 2025"
        }
    ]
}