{
    "news": [
        {
            "title": "Five in court after police intercept truck with dagga, broncleer in Harare",
            "url": "https://www.newzimbabwe.com/five-in-court-after-police-intercept-truck-with-dagga-broncleer-in-harare/",
            "content": "By Staff Reporter\n\nThe National Prosecuting Authority has hauled five suspects before the Mbare Magistrates Court after detectives intercepted a 10-tonne truck loaded with 306kg of dagga and 49 boxes of Broncleer cough syrup in Harare.\n\nAccording to prosecutors, the bust was made in the early hours of 23 August 2025 when CID Drugs Harare detectives, acting on a tip-off, intercepted the truck in Kuwadzana Extension.\n\nA search uncovered 20 sacks of dagga and 49 boxes of Broncleer (each box containing 50 x 100ml bottles).\n\nFour suspects were arrested on the spot before implicating a fifth accomplice, who was later trapped and arrested along Robson Manyika Road after allegedly receiving part of the consignment.\n\nThe accused were named as Paradzai Kamungeremu (43), Givemore Tsavayo (38), Nkosikhona Moyo (35), Tafadzwa Mapika (20), and Faith Matekede (37).\n\nProsecutors are opposing bail, arguing that the offence is serious, prejudicial to society, and carries a high risk of absconding. The matter has been remanded as investigations continue.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/28155839/Harare-Magistrates-Court.jpg",
            "description": "<p>By Staff Reporter The National Prosecuting Authority has hauled five suspects before the Mbare Magistrates’ Court after detectives intercepted a 10-tonne truck loaded with 306kg of dagga and 49 boxes of Broncleer cough syrup in Harare. According to prosecutors, the bust was made in the early hours of 23 August 2025 when CID Drugs Harare</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/five-in-court-after-police-intercept-truck-with-dagga-broncleer-in-harare/\">Five in court after police intercept truck with dagga, broncleer in Harare</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "27 Aug 2025"
        },
        {
            "title": "South African influencer apologises over viral Russian job videos",
            "url": "https://www.newzimbabwe.com/south-african-influencer-apologises-over-viral-russian-job-videos/",
            "content": "BBC\n\nA South African influencer linked to a controversial job scheme in Russia has apologised for her role in promoting it in a country where many young people are desperate to find jobs.\n\nCyan Boujee, whose real name is Honour Zuma, came under scrutiny after one of the videos she posted online advertising jobs for women aged between 18 and 22 went viral.\n\nIt prompted the government to issue a warning about the scheme and alert people to the dangers of human trafficking and unverified job opportunities overseas.\n\nImmediately when I saw the comments on my stories and on my videos I knew that this is not something I stand with, the 24-year-old told her 902,000 followers on Instagram.\n\nPopularly known as Cyan, the influencer has removed the promotional videos from her social media pages. They had described an opportunity for a fresh new start for young women at the start of their careers.\n\nIn a video shot in Tatarstan in Russia and posted over the weekend on TikTok, where she has 1.7 million followers, Cyan had said it was a two-year start programme for those wanting to acquire professional skills  though it was not made clear in what professions.\n\nShe had explained those hired would be given jobs and taught how to speak Russian.\n\nThere have been allegations that some of those recruited to work in Tatarstan have ended up working in a weapons factory, making drones that have been used in Russias war in Ukraine.\n\nIn her Instagram apology, Cyan acknowledged that human trafficking is a very, very serious matter, adding that the backlash had been a huge learning curve for her and and all the other influencers.\n\nI knew this is something I had to delete immediately, I didnt care about the money, she said.\n\nI apologise and I believe that this is not something that will be repeated again.\n\nThere has been a huge fallout on social media over the job videos, with a petition launched calling on influencers to use their platforms to instead spread awareness about the signs and dangers of trafficking.\n\nThe authorities have launched an investigation into the scheme. Deputy Justice Minister Andries Nel said so-called opportunities were often linked to serious risks of labour exploitation and human trafficking.\n\nNever rely solely on social media promotions or unsolicited social media advertisements, always cross-check and verify job opportunities through official channels, he said on Wednesday.\n\nOne of the main recruiters in the scheme promoted by Cyan and other influencers is a special economic zone in Tatarstan, which is where weapons are believed to be produced.\n\nA report by the Global Initiative Against Transnational Organized Crime released in May looked into the recruitment of people for the start programme.\n\nIt said that potential recruits are enticed to participate under false pretences regarding the nature of the work, the working conditions and opportunities for education, adding that the objective is to support the drone production programme.\n\nMost work directly in drone production, while others work as support staff  cleaners and caterers.\n\nIn one of her now-deleted videos, Cyan had said apparently girls are treated fairly here  Africans, Asians, Latin Americans.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/27201545/cyan.webp",
            "description": "<p>BBC A South African influencer linked to a controversial job scheme in Russia has apologised for her role in promoting it in a country where many young people are desperate to find jobs. Cyan Boujee, whose real name is Honour Zuma, came under scrutiny after one of the videos she posted online advertising jobs for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-african-influencer-apologises-over-viral-russian-job-videos/\">South African influencer apologises over viral Russian job videos</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "27 Aug 2025"
        },
        {
            "title": "Zimbabwe all-rounder suspended from bowling",
            "url": "https://www.newzimbabwe.com/zimbabwe-all-rounder-suspended-from-bowling/",
            "content": "ICC\n\nKelis Ndhlovu of the Zimbabwe womens team has been suspended from bowling in international cricket with immediate effect.\n\nThe decision regarding Kelis Ndhlovu of theZimbabwewomens team came after an independent assessment confirmed that the left-arm spinner uses an illegal bowling action.\n\nThe 19-year-old has been suspended from bowling in international cricket with immediate effect. She was reported by match officials during the first ODI against Ireland in Belfast on 26 July and she underwent the assessment in Pretoria, South Africa.\n\nIn accordance with Article 6.1 of theBowling Regulations, Ndhlovus suspension shall remain in place until she submits to a re-assessment of her bowling action which confirms that she can bowl without using an illegal bowing action.\n\nNdhlovu captain Zimbabwe U19 side during the inaugural ICC Womens Under-19 T20 World Cup in 2023. Thus far, she has played 13 womens ODIs and 51 womens T20Is with 19 and 44 wickets respectively. With the ball, she averages close to 19 in both the formats.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/27150133/kellis-ndhlovu.webp",
            "description": "<p>ICC Kelis Ndhlovu of the Zimbabwe women’s team has been suspended from bowling in international cricket with immediate effect. The decision regarding Kelis Ndhlovu of the Zimbabwe women’s team came after an independent assessment confirmed that the left-arm spinner uses an illegal bowling action. The 19-year-old has been suspended from bowling in international cricket with immediate</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-all-rounder-suspended-from-bowling/\">Zimbabwe all-rounder suspended from bowling </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "27 Aug 2025"
        },
        {
            "title": "U.S Embassy extends crew or transit visa validity for Zimbabweans as routine services remain suspended",
            "url": "https://www.newzimbabwe.com/u-s-embassy-extends-crew-or-transit-visa-validity-for-zimbabweans-as-routine-services-remain-suspended/",
            "content": "By Thandiwe Garusa\n\nTHE United States (U.S) Embassy in Harare has extended the validity of C1/D (transit or crew member) visas for Zimbabwean applicants to 24 months with multiple entry.\n\nRoutine visa services, however, remain suspended at the Harare Embassy and applications will only be accepted at U.S. missions outside Zimbabwe.\n\nThis comes after the U.S embassy in Harare earlier this month announced suspension of all routine immigrant and non-immigrant visa services, except for most diplomatic and official visas, citing national security and public safety concerns.\n\nIn a statement Wednesday, the embassy said applications cannot be submitted at the U.S embassy in Harare due to the pause on immigrant and non-immigrant visa services.\n\nThe validity of C1/D (transit or crew member) visas for Zimbabwean applicants has been extended to 24 months with multiple entry.\n\nApplications for C1/D visas may be submitted at a U.S. embassy or consulate outside of Zimbabwe at this time.\n\nThe U.S. Embassy in Harare continues the pause on routine immigrant and non-immigrant visa services, the statement reads.\n\nA C1/D visa is a U.S. nonimmigrant visa issued to foreign nationals working as crew members on ships or airlines.\n\nIt allows them to travel through the United States either to join their vessel or aircraft, or to transit on their way to another destination.\n\nMeanwhile, it is alleged that 709 Zimbabweans, or about 10.57%, overstayed in the U.S. on their B1 and B2 visas (non-immigrant visas for temporary stays, either business or tourism).\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/20182253/embassy.jpg",
            "description": "<p>By Thandiwe Garusa THE United States (U.S) Embassy in Harare has extended the validity of C1/D (transit or crew member) visas for Zimbabwean applicants to 24 months with multiple entry. Routine visa services, however, remain suspended at the Harare Embassy and applications will only be accepted at U.S. missions outside Zimbabwe. This comes after the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/u-s-embassy-extends-crew-or-transit-visa-validity-for-zimbabweans-as-routine-services-remain-suspended/\">U.S Embassy extends crew or transit visa validity for Zimbabweans as routine services remain suspended </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "27 Aug 2025"
        }
    ]
}