{
    "news": [
        {
            "title": "Court strikes down University of Zimbabwe’s appeal in contract dispute with former employee",
            "url": "https://www.newzimbabwe.com/court-strikes-down-university-of-zimbabwes-appeal-in-contract-dispute-with-former-employee/",
            "content": "By Mary Taruvinga\n\nThe Constitutional Court has struck down the University of Zimbabwes (UZ) appeal in a long-running labour dispute with former bursar Vengai Mugabe, declaring prior court proceedings a nullity in every sense.\n\nDelivering the judgment, Justice Anne-Mary Gowora ruled that both the Labour Court and the Supreme Court acted without proper jurisdiction.\n\nIt has been made clear that there must be compliance with statutory requirements in order for the court to assert jurisdiction over matters, she said. The lack of adherence to these procedural safeguards rendered the previous judgments ineffective and void.\n\nMugabe, appointed bursar on a fixed-term contract from July 2017 to June 2021, was dismissed following clashes with university management. A labour officer later awarded him US$323,036 for unfair dismissal, a ruling UZ unsuccessfully appealed.\n\nRepresenting Mugabe, attorney Tawanda Zhuwarara said the earlier rulings violated fundamental rights enshrined in sections 56 and 71 of the Constitution, adding that the Supreme Courts decision was an arbitrary deprivation of property.\n\nUZs lawyer, G. Madzoka, countered that the application was nothing more than a disguised appeal, arguing that the underlying issues had already been settled.\n\nJustice Rita Makarau noted the unacceptable failure by lower courts to address preliminary points vital to fairness.\n\nDeclaring both earlier rulings void, the Court found the proceedings fraught with irregularities.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/12142202/UZ-1.png",
            "description": "<p>By Mary Taruvinga The Constitutional Court has struck down the University of Zimbabwe’s (UZ) appeal in a long-running labour dispute with former bursar Vengai Mugabe, declaring prior court proceedings “a nullity in every sense.” Delivering the judgment, Justice Anne-Mary Gowora ruled that both the Labour Court and the Supreme Court acted without proper jurisdiction. “It</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/court-strikes-down-university-of-zimbabwes-appeal-in-contract-dispute-with-former-employee/\">Court strikes down University of Zimbabwe’s appeal in contract dispute with former employee</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:39",
            "date": "21 Oct 2025"
        },
        {
            "title": "Amnesty warns Tanzania General Elections won’t be free and fair",
            "url": "https://www.newzimbabwe.com/amnesty-warns-tanzania-general-elections-wont-be-free-and-fair/",
            "content": "Prime Africa\n\nAmnesty International has accused Tanzanian authorities of carrying outsystematic human rights violationsin the run-up to the countrys October 29 presidential election, which has already been marred by the exclusion of key opposition candidates.\n\nIn a new report released Monday, Amnesty detailed an alarming rise in abuses between January 2024 and October 2025, includingenforced disappearances, torture, and extrajudicial killings of opposition figures and activists.\n\nThe report, reviewed by AFP, is based on interviews with 43 individuals  among them victims, witnesses, family members, NGO workers, and lawyers  as well as verified images and social media publications.\n\nInitially lauded for reversing the repressive legacy of her predecessor, the late PresidentJohn Magufuli, current PresidentSamia Suluhu Hassanis now facing mounting criticism from human rights groups and opposition figures as she seeks a second term in office.\n\nAuthorities have ramped up their clampdown on civic space and the right to participate freely in elections through the passing of deeply flawed legislation,Tigere Chagutah, Amnestys Regional Director for East and Southern Africa\n\nOne of the most shocking cases documented by Amnesty involvesAli Mohamed Kibao, a senior official of the main opposition partyChadema, who was abducted in September 2024 and later found dead. Despite an official investigation, no progress has been reported.In a separate incident this month,Humphrey Hesron Polepole, Tanzanias former ambassador to Cuba and a vocal government critic, disappeared under mysterious circumstances. His whereabouts remain unknown.Chadema has beenbarredfrom participating in the upcoming polls after refusing to sign the governmentsElectoral Code of Conduct, which opposition parties say unfairly restricts their operations.Party leaderTundu Lissu, one of the countrys most prominent opposition voices, remains in detention on treason charges  an offense that carries the death penalty under Tanzanian law.Meanwhile,Luhaga Mpina, the presidential candidate for theAlliance for Change and Transparency (ACT Wazalendo), has also been disqualified from the race, effectively leaving President Hassan with little organized competition.Human rights observers warn that Tanzanias democratic backsliding could deepen political instability and erode hard-won freedoms in one of East Africas largest economies.\n\nOne of the most shocking cases documented by Amnesty involvesAli Mohamed Kibao, a senior official of the main opposition partyChadema, who was abducted in September 2024 and later found dead. Despite an official investigation, no progress has been reported.\n\nIn a separate incident this month,Humphrey Hesron Polepole, Tanzanias former ambassador to Cuba and a vocal government critic, disappeared under mysterious circumstances. His whereabouts remain unknown.\n\nChadema has beenbarredfrom participating in the upcoming polls after refusing to sign the governmentsElectoral Code of Conduct, which opposition parties say unfairly restricts their operations.\n\nParty leaderTundu Lissu, one of the countrys most prominent opposition voices, remains in detention on treason charges  an offense that carries the death penalty under Tanzanian law.\n\nMeanwhile,Luhaga Mpina, the presidential candidate for theAlliance for Change and Transparency (ACT Wazalendo), has also been disqualified from the race, effectively leaving President Hassan with little organized competition.\n\nHuman rights observers warn that Tanzanias democratic backsliding could deepen political instability and erode hard-won freedoms in one of East Africas largest economies.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/07022606/Tanzanias-president-Samia-Suluhu-Hassan.png",
            "description": "<p>Prime Africa Amnesty International has accused Tanzanian authorities of carrying out “systematic human rights violations” in the run-up to the country’s October 29 presidential election, which has already been marred by the exclusion of key opposition candidates. In a new report released Monday, Amnesty detailed an alarming rise in abuses between January 2024 and October 2025, including “enforced</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/amnesty-warns-tanzania-general-elections-wont-be-free-and-fair/\">Amnesty warns Tanzania General Elections won’t be free and fair</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:39",
            "date": "21 Oct 2025"
        },
        {
            "title": "DNC bus accident: Death toll rises to 44 as Zimbabwe and Malawi cover repatriation, medical costs",
            "url": "https://www.newzimbabwe.com/dnc-bus-accident-death-toll-rises-to-44-as-zimbabwe-and-malawi-cover-repatriation-medical-costs/",
            "content": "By Staff Reporter\n\nThe governments of Zimbabwe and Malawi have pledged to cover all repatriation and medical expenses for victims of the DNC Coaches bus accident that claimed 44 lives along South Africas N1 highway near Louis Trichardt, Limpopo.\n\nThe 44th victim succumbed to injuries while receiving treatment in hospital, raising the death toll from the crash.\n\nZimbabwes diplomat Shepherd Gwenzi and Malawis High Commissioner to South Africa Stella Ndau made the announcement during a meeting with Limpopo provincial officials and affected families at Siloam Hospital, where identification of the deceased is currently underway.\n\nThe government of Zimbabwe will continue to assist the families of both the deceased and the injured with transport and accommodation until the conclusion of the ongoing processes. We are working with the government of South Africa and the high commissioner of Malawi to ensure that the requirements enabling the repatriation of the deceased for burial and Zimbabwe and Malawi, respectively, are completed within the shortest time frame possible, Gwenzi said.\n\nThe DNC Coaches bus, which was travelling from Port Elizabeth and East London to Harare, veered off the road and plunged down an embankment near Ingwe Lodge late Saturday. The vehicle was carrying both Zimbabwean and Malawian nationals.\n\nPreliminary investigations have revealed that the accident was due to brake failure and overloading of the bus, which was carrying 91 passengers with only a 62-seater capacity.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/13122907/DNC-Bus-e1760778980550.png",
            "description": "<p>By Staff Reporter The governments of Zimbabwe and Malawi have pledged to cover all repatriation and medical expenses for victims of the DNC Coaches bus accident that claimed 44 lives along South Africa’s N1 highway near Louis Trichardt, Limpopo. The 44th victim succumbed to injuries while receiving treatment in hospital, raising the death toll from</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dnc-bus-accident-death-toll-rises-to-44-as-zimbabwe-and-malawi-cover-repatriation-medical-costs/\">DNC bus accident: Death toll rises to 44 as Zimbabwe and Malawi cover repatriation, medical costs</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:39",
            "date": "21 Oct 2025"
        },
        {
            "title": "Zimbabwe Musicians Union raises red flags over ZIMURA audit report",
            "url": "https://www.newzimbabwe.com/zimbabwe-musicians-union-raises-red-flags-over-zimura-audit-report/",
            "content": "Music in Africa\n\nTheZimbabwe Musicians Union(ZIMU) has called for an immediate review of the 2024 audit report of theZimbabwe Music Rights Association(ZIMURA), citing alleged governance failures, misrepresentation, and breaches of corporate protocol.\n\nIn an open letter dated 19 October 2025 addressed to Baker Tilly Chartered Accountants, ZIMURAs auditors, ZIMU presidentEdith Katijiaccused the firm of overlooking several procedural and ethical irregularities in its audit of the music rights body. The letter was also copied to the Companies and Intellectual Property Office (CIPZ), the Ministry of Sport, Recreation, Arts and Culture, and the National Arts Council of Zimbabwe (NACZ).\n\nQuestions over audit validity\n\nKatiji claimed that ZIMURAs 2024 audited financial statements failed to comply with the organisations Articles of Association. She said the report was signed by only two individuals, board chairpersonAlbert Nyathiand executive director Polisile Ncube-Chimhini, without the mandatory third signature from the company secretary. According to Section 59 of the Articles of Association, the company seal must be accompanied by two directors signatures and that of the secretary.\n\nZIMU further argued that the document was invalid because Ncube-Chimhini allegedly signed under a title that does not exist in ZIMURAs governance structure. The letter cited a High Court ruling in Farai Fred Nyakudanga v Polisile Ncube-Chimhini (HH 438-25), which found that she does not hold the position of executive director.\n\nAlleged omission of material facts\n\nKatiji criticised the auditors for failing to disclose Ncube-Chimhinis reported fraud conviction, while noting that the audit made reference to unrelated legal cases such as Simbisa Brands Zimbabwe (Pvt) Ltd. She said the omission of information about the conviction undermined the integrity and transparency of the report.\n\nWhile every citizen has the right to appeal, the conviction stands until overturned, Katiji wrote. Responsible governance demands immediate suspension, not concealment or legitimisation.\n\nThe musicians body alleged that ZIMURA continues to face multiple governance and legal challenges, including police investigations into fraud and misappropriation of funds, as well as ongoing court cases involving board members. ZIMU said the auditors failure to reference these matters amounted to a serious breach of professional responsibility.\n\nThe letter also raised concerns about the accuracy of the directors list in the audit report, stating that it did not match official records lodged with the Deeds Office. It named Philip Chipfumbu as one of the directors omitted from the published list.\n\nAuditor independence questioned\n\nZIMU questioned Baker Tillys professional conduct, suggesting that the firm may have relied on information supplied by ZIMURAs management without independent verification. The union said the audit created confusion by alternately assigning responsibility for financial statements to both management and the board, which contradicts ZIMURAs Articles of Association.\n\nKatiji urged the audit firm to withhold the report from presentation at ZIMURAs Annual General Meeting (AGM) scheduled for 22 October 2025, warning that using the document to guide governance decisions would be reckless and a breach of ethical responsibilities.\n\nZIMU has requested an urgent reassessment of the 2024 audit, public disclosure of Ncube-Chimhinis legal status, and cooperation with regulatory authorities to restore transparency. The union also called for scrutiny of ZIMURAs legal adviser, Witness Zhangazha, who has reportedly been referred to the Law Society of Zimbabwe over alleged misconduct.\n\nKatiji said the credibility of both ZIMURA and Zimbabwes audit profession was at stake if the issues were not addressed.\n\nNeither ZIMURA nor Baker Tilly had issued a public response to the letter at the time of publication.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/11/18152113/zimura.jpeg",
            "description": "<p>Music in Africa The Zimbabwe Musicians Union (ZIMU) has called for an immediate review of the 2024 audit report of the Zimbabwe Music Rights Association (ZIMURA), citing alleged governance failures, misrepresentation, and breaches of corporate protocol. In an open letter dated 19 October 2025 addressed to Baker Tilly Chartered Accountants, ZIMURA’s auditors, ZIMU president Edith Katiji accused the firm</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-musicians-union-raises-red-flags-over-zimura-audit-report/\">Zimbabwe Musicians Union raises red flags over ZIMURA audit report</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:39",
            "date": "21 Oct 2025"
        },
        {
            "title": "Afrotellers founder Chivhanga wants Africans to reclaim ownership of their stories",
            "url": "https://www.newzimbabwe.com/afrotellers-founder-chivhanga-wants-africans-to-reclaim-ownership-of-their-stories/",
            "content": "The Citizen\n\nThere are usually grumbles about how Africa doesnt tell its stories enough, with the rest of the world being the narrators of whats happening on the continent.\n\nStorytelling is not just about remembering where we come from, its about shaping where we are going, said CEO of Thrive Afrika and Founder of Afrotellers, Willson Chivhanga.\n\nTo strengthen the ecosystem of African storytellers, The Afrotellers Conference returns to Johannesburg for its second edition this week.\n\nAcross the continent, we are seeing a new generation using stories to confront injustice, reframe history, and imagine futures rooted in dignity, said Chivhanga.\n\nThe three-day gathering is set to take place at the Market Theatre Precinct, Market Square, and the Wits University School of Arts from Thursday to Saturday.\n\nThe Afrotellers Conference is convened by social impact agency Thrive Afrika, in partnership with the Wits School of Arts and the Market Theatre Foundation.\n\nAccording to Chivhanga, the conference is a space for African storytellers to reclaim ownership of their narratives and speak about the continent, its people and its possibilities on their own terms.\n\nAfrotellers is a growing movement. It does not end when the doors close; rather its an ecosystem that connects communities through their stories, said the founder.\n\nThe first edition of the conference saw more than 130 participants from across Africa and the diaspora.\n\nAfrotellers has grown into a continental movement connecting artists, activists and thinkers through community storytelling hubs in Malawi, South Africa, Kenya, Ghana, Nigeria, DR Congo, Lesotho and Zimbabwe.\n\nFrom village gatherings to urban collectives, we are seeing a shared language of resistance, creativity and care emerging across Africa, Chivhanga said.\n\nThis years edition will build on the foundation that was laid in the previous year by exploring storytelling as infrastructure  shaping how Africans imagine themselves, relate to one another and influence how the continent is perceived globally.\n\nSome of the speakers for this years Afrotellers include playwright and scholar Dr Refiloe Lepere, Zimbabwean political organiser Gift Ostallos Siziba, visual activist Prof. Sir Zanele Muholi, Ugandan philanthropy leader Jackie Asiimwe, playwright and director Monageng Vice Motshabi and photographer Andrew Tshabangu.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/20203841/Chivanga-Afrotellers.jpg",
            "description": "<p>The Citizen The three-day Afrotellers Conference returns to Johannesburg for its second edition this week. There are usually grumbles about how Africa doesn’t tell its stories enough, with the rest of the world being the narrators of what’s happening on the continent. “Storytelling is not just about remembering where we come from, it’s about shaping</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/afrotellers-founder-chivhanga-wants-africans-to-reclaim-ownership-of-their-stories/\">Afrotellers founder Chivhanga wants Africans to reclaim ownership of their stories</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:39",
            "date": "21 Oct 2025"
        }
    ]
}