{
    "news": [
        {
            "title": "I quit CCC to “teach ED a lesson” – Chamisa",
            "url": "https://www.newzimbabwe.com/i-quit-ccc-to-teach-ed-a-lesson-chamisa/",
            "content": "By Staff Reporter\n\nFormer leader of the Citizens Coalition for Change (CCC), Nelson Chamisa, has revealed that his departure from both the CCC and the Movement for Democratic Change (MDC), was a calculated move aimed at frustrating President Emmerson Mnangagwa, whom he accuses of orchestrating a takeover of the opposition parties.\n\nChamisa resigned as leader of the CCC in January last year, citing the hijacking of his party by Mnangagwa as punishment for his refusal to accept the results of the chaotic August 2023 general elections.\n\nThe fallout from the elections saw Sengezo Tshabangu emerge, seemingly from nowhere, claiming to be the interim Secretary General of the CCC.\n\nTshabangus stated aim was to restore order within the opposition by addressing alleged irregularities in the candidate selection process leading up to the 2023 elections.\n\nTshabangu subsequently initiated a widespread recall of elected representatives, claiming that certain candidates had been improperly selected.\n\nThis led to the unprecedented recall of over 40 MPs and councillors, effectively handing Zanu-PF back the two-thirds parliamentary majority it had failed to secure during the harmonised elections.\n\nChamisas attempts to prevent these recalls, including written appeals to the then Local Government Minister July Moyo and Speaker of the National Assembly Jacob Mudenda, proved futile. The courts upheld the recalls, leaving Chamisa with no option but to step aside.\n\nIn a Facebook post on Thursday, Chamisa confirmed that his decision to leave the CCC was motivated by a desire to spite Mnangagwa.\n\nThe best decision I ever made in my leadership journey was to walk away from MDC & CCC. You will thank me later. I had to break the cycle of going in circles. And that was my best way to teach ED a lesson!, Chamisa declared.\n\nThis was not Chamisas first departure from a major political entity. He had previously walked away from the Movement for Democratic Change (MDC) after a Supreme Court ruling questioned the legitimacy of his assumption of the party leadership following the death of Morgan Tsvangirai.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/15180623/Mnangagwa-Chamisa.jpg",
            "description": "<p>By Staff Reporter Former leader of the Citizens Coalition for Change (CCC), Nelson Chamisa, has revealed that his departure from both the CCC and the Movement for Democratic Change (MDC), was a calculated move aimed at frustrating President Emmerson Mnangagwa, whom he accuses of orchestrating a takeover of the opposition parties. Chamisa resigned as leader</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/i-quit-ccc-to-teach-ed-a-lesson-chamisa/\">I quit CCC to “teach ED a lesson” – Chamisa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:34",
            "date": "17 Jul 2025"
        },
        {
            "title": "UZ reinstates students suspended after protesting in support of lecturers’ strike",
            "url": "https://www.newzimbabwe.com/uz-reinstates-students-suspended-after-protesting-in-support-of-lecturers-strike/",
            "content": "By Thandiwe Garusa\n\nTHE University of Zimbabwe has lifted its suspension on six student activists who were dismissed for staging a protest on campus in May in solidarity with their striking lecturers.\n\nThe students, Narshon Kohlo, Blessing Mtisi, Nodesha Maingehama, Tafadzwa Katsande, Tawana Hove and Tariro Mtukura are members of the Zimbabwe National Students Union (ZINASU), UZ Chapter.\n\nThey staged a flash protest at UZ campus where they demanded an urgent resolution to the grievances of their lecturers, who have been on strike since April 16.\n\nThe student activists were later suspended in July by UZ Vice Chancellor Paul Mapfumo, citing that they had put the institution in disrepute.\n\nThe suspension drew criticism from opposition politicians and was raised in Parliament on Wednesday.\n\nIn separate letters seen by NewZimbabwe.com which were written to the six students by UZ registrar Munyaradzi Madambi, the institution made a U-turn and announced the withdrawal of student disciplinary matter against them.\n\nPlease be advised that the University has reconsidered its position and decided to lift your suspension from the University of Zimbabwe and also withdraw the Student Disciplinary matter which had previously beenleveledagainstyou.\n\nIt is sincerely hoped that you have atoned for your behaviour, which seriously threatens the integrity and reputation of the University.\n\nWe anticipate that you desist from engaging in behaviour that may put the University into disrepute.\n\nBy copy of this letter, the Manager, Examinations and Certification is requested to reactivate your E-mhare account and release your results and all other relevant Departments of the University are advised to take the necessary steps to facilitate the resumption of studies by the student, the letters read.\n\nThree weeks ago, the university also fired four leaders of the ongoing lecturers industrial action after having been initially suspended and undergoing a hearing for using the campuss great hall without approval from authorities.\n\nThe lecturers are demanding a salary increase to at least US$2,250 from their current US$250 as well as improved working conditions.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/12142202/UZ-1.png",
            "description": "<p>By Thandiwe Garusa THE University of Zimbabwe has lifted its suspension on six student activists who were dismissed for staging a protest on campus in May in solidarity with their striking lecturers. The students, Narshon Kohlo, Blessing Mtisi, Nodesha Maingehama, Tafadzwa Katsande, Tawana Hove and Tariro Mtukura are members of the Zimbabwe National Students Union</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uz-reinstates-students-suspended-after-protesting-in-support-of-lecturers-strike/\">UZ reinstates students suspended after protesting in support of lecturers’ strike</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:34",
            "date": "17 Jul 2025"
        },
        {
            "title": "US deports five ‘barbaric’ migrants to Eswatini",
            "url": "https://www.newzimbabwe.com/us-deports-five-barbaric-migrants-to-eswatini/",
            "content": "BBC\n\nThe US has deported five people who it described as criminal illegal aliens to the southern African kingdom of Eswatini.\n\nOn board the flight were five deportees from Vietnam, Jamaica, Laos, Cuba and Yemen who have been convicted of crimes ranging from child rape to murder, US Homeland Security Department Assistant Secretary Tricia McLaughlinsaid in an online post.\n\nThis flight took individuals so uniquely barbaric that their home countries refused to take them back, McLaughlin wrote on X.\n\nEswatini, the last absolute monarchy in Africa, said it acknowledged widespread concern within the country regarding the deportations.\n\nFive inmates are currently housed in our correctional facilities in isolated units, where similar offenders are kept. The nation is assured that these inmates pose no threat to the country or its citizens, government spokesperson Thabile Mdluli said in a statement.\n\nEswatini and the US will work with the United Nations immigration agency to facilitate the transit of the deportees to their country of origin, Mdluli added.\n\nEarlier this month, the USsent eight migrants from several countries to South Sudanafter a court lifted restrictions on sending people to countries where they have no ties.\n\nIn a series of posts on the X social media platform, McLaughlin listed the crimes the five deported to Eswatini had been convicted of, describing them as depraved monsters who had been terrorizing American communities.\n\nA safe third country deportation flight to Eswatini in Southern Africa has landed, she said, adding: They are off of American soil.\n\nThe Eswatini government declined to say whether any payments were made as part of the arrangement.\n\nThe US is the fourth largest market for the countrys biggest export, sugar. Analysts suggest that Eswatini may be trying to safeguard this trade and avoid the imposition of tariffs.\n\nA pro-democracy group, the Swazi Solidarity Network, has condemned the deal as deplorable.\n\nSpokesperson Lucky Lukhele told the BBC that Eswatini must not become a dumping ground for criminals, and that citizens needed protection.\n\nThe news has sparked public concern over whether local prisons are equipped to securely house such inmates.\n\nPreviously known as Swaziland, Eswatini is a small, landlocked country that is surrounded by South Africa and Mozambique. It has been led by King Mswati III since 1986.\n\nLast month, the US Supreme Court cleared the way for the Trump administration to resume deporting migrants to countries other than their own.\n\nRwanda has confirmed discussions have taken place, while Benin, Angola, Equatorial Guinea and Moldova have also been named in media reports as potential recipient countries.\n\nTrumps administration has already deported people to El Salvadorand Costa Rica.\n\nSouth Sudan recently agreed to hold eight men deported from the US and said they were not in handcuffs and appeared to be in good condition.\n\nThe war-torn country said the deportees were kept in a civilian facility in the capital Juba, under the watch of police and the national security service. Only one of them is from South Sudan.\n\nIn April, US Secretary of State Marco Rubio revoked all visas for South Sudanese passport holders blaming the country for failing to accept the return of its repatriated citizens in a timely manner.\n\nIt is not clear if that has now changed.\n\nLast week, Nigeria said it would not bow to pressure from the Trump administration to accept Venezuelan deportees or third-country prisoners from the US.\n\nPresident Donald Trumps pledge to conduct mass deportations was a centrepiece of his election campaign and an issue on which he drew widespread support, including many Hispanic voters.\n\nHe said he wanted to deport people living in the US illegally but White House efforts have been much broader in scope  taking aim at people in the US on student visas, suspending admissions of refugees except white South Africans, and moving to revoke temporary work permits and other protections that had been granted to immigrants by previous presidents.\n\nTo crack down on immigrants, Trumps administration has resumed raids at workplaces, a tactic that had been suspended under his predecessor, Joe Biden.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/17032903/mswati-airport.webp",
            "description": "<p>BBC The US has deported five people who it described as “criminal illegal aliens” to the southern African kingdom of Eswatini. On board the flight were five deportees from Vietnam, Jamaica, Laos, Cuba and Yemen who have been convicted of crimes ranging from child rape to murder, US Homeland Security Department Assistant Secretary Tricia McLaughlin said</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-deports-five-barbaric-migrants-to-eswatini/\">US deports five ‘barbaric’ migrants to Eswatini</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:34",
            "date": "17 Jul 2025"
        },
        {
            "title": "Fidelity insurance contract revenue up 45%",
            "url": "https://www.newzimbabwe.com/fidelity-insurance-contract-revenue-up-45/",
            "content": "By Alois Vinga\n\nFIDELITY Life Assurance has seen insurance contract revenue growing by 45% compared to the prior year, signifying the groups resilience.\n\nPresenting the groups annual report this week, FLA chairman Livingstone Gwata said the segment grew by 45% from US$7,9 million to US$11,4 million in the year under review on the strength of the groups customised service approach which continues to drive uptake of the Companys products offering on the market.\n\nThe Vaka Yako product performed very well and contributed significantly to the Gross Premium Written (GPW) at 85% of the premium inflows. On the premium inflows, the Zimbabwean operation contributed 68% for the year under review compared to 62% in 2023, whilst for the year under review 32% was attributable to the Malawi operation which contributed 38% in 2023, he said.\n\nThe insurance service result declined by 174% owing to higher insurance service expenses incurred compared to the earned revenue. The segments expenses increased by 66% compared to the growth in Insurance Contract Revenue of 45%.\n\nNet investment income grew by 55% compared to the prior year from USD5.6 million to USD9.0 million. The Group profit for the period increased by 174%.\n\nFLA said the Asset Separation exercise, which is currently underway, is close to completion and is set to be concluded in Q1 2025.\n\nThe business is now wrapping up the paperwork required to fully execute the exercise. The exercise brings added transparency and protections to both policyholders and shareholders, especially noting Zimbabwes fluid policy environment.\n\nFor policyholders, the separation of assets will unlock more, in terms of quantum and value, investment opportunities, sustainable growth and profitability, said Gwata.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/03/22145953/Fidelity-Life-Assurance-building.jpg",
            "description": "<p>By Alois Vinga FIDELITY Life Assurance has seen insurance contract revenue growing by 45% compared to the prior year, signifying the group’s resilience. Presenting the group’s annual report this week, FLA chairman Livingstone Gwata said the segment grew by 45% from US$7,9 million to US$11,4 million in the year under review on the strength of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/fidelity-insurance-contract-revenue-up-45/\">Fidelity insurance contract revenue up 45%</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:34",
            "date": "17 Jul 2025"
        },
        {
            "title": "Pedestrian killed, two others injured after trailer dislodged from commuter omnibus",
            "url": "https://www.newzimbabwe.com/pedestrian-killed-two-others-injured-after-trailer-dislodged-from-commuter-omnibus/",
            "content": "By James Muonwa\n\nA PEDESTRIAN died while two others were seriously injured after they were hit by a trailer that had dislodged from a commuter omnibus towing it.\n\nThe Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi, confirmed the tragedy that occurred along Plumtree Road in Bulawayo.\n\nThe ZRP confirms a fatal road traffic accident which occurred on July 14, 2025 at around 1330 hours along Plumtree Road in Belmont, Bulawayo said Nyathi.\n\nA trailer of a Mercedes-Benz Sprinter with one passenger on board disengaged. It then hit three pedestrians who were walking on the edge of the road.\n\nThe victims sustained varying injuries and were ferried to Mpilo Hospital for treatment. Unfortunately, one of the victims succumbed to the injuries.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/31184346/Accident4.jpg",
            "description": "<p>By James Muonwa  A PEDESTRIAN died while two others were seriously injured after they were hit by a trailer that had dislodged from a commuter omnibus towing it. The Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi, confirmed the tragedy that occurred along Plumtree Road in Bulawayo. “The ZRP confirms a fatal road traffic</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pedestrian-killed-two-others-injured-after-trailer-dislodged-from-commuter-omnibus/\">Pedestrian killed, two others injured after trailer dislodged from commuter omnibus</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:34",
            "date": "17 Jul 2025"
        },
        {
            "title": "Dynamos adds foreign players in effort to survive relegation",
            "url": "https://www.newzimbabwe.com/dynamos-adds-foreign-players-in-effort-to-survive-relegation/",
            "content": "By Sports Reporter\n\nRelegation candidates Dynamos FC have signed three new foreign players in a move to beef up the squad.\n\nDembare is currently in the relegation zone as they are second from bottom (17) on the log with 15 points, six ahead of Kwekwe United.\n\nThe three new foreigners are two Ghanaian infield players, Felix Hammond (defender), Mohammed Issaka (striker) and a Zambian goalkeeper, Sitali Nyambe.\n\nNew Zimbabwe.com understands that the trio signed with the club on Tuesday and will be ready for selection for Saturdays match against Simba Bhora at Wadzanayi Stadium in Shamva.\n\nOther than the three foreigners, Dembare has also signed midfielder Wisdom Mutasa, who is coming from Botswanas Orapa United.\n\nThis will mark Mutasas second stint at the Glamour Boys, the first being in 2017 when he played under his father, Lloyd Mutasa, who was head coach then.\n\nMeanwhile, former Zimbabwe Premier Soccer League Soccer Star of the Year Denver Mukamba is training with Dynamos.\n\nMukamba is eyeing a return to Dembare after parting ways with the club in 2012.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/17030319/WhatsApp-Image-2025-07-17-at-04.02.55.jpeg",
            "description": "<p>By Sports Reporter Relegation candidates Dynamos FC have signed three new foreign players in a move to beef up the squad. Dembare is currently in the relegation zone as they are second from bottom (17) on the log with 15 points, six ahead of Kwekwe United. The three new foreigners are two Ghanaian infield players,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dynamos-adds-foreign-players-in-effort-to-survive-relegation/\">Dynamos adds foreign players in effort to survive relegation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:34",
            "date": "17 Jul 2025"
        }
    ]
}