{
    "news": [
        {
            "title": "Bulawayo Chiefs suspend administrator in connection with ex-Highlanders CEO’s fraud case",
            "url": "https://www.newzimbabwe.com/bulawayo-chiefs-suspend-administrator-in-connection-with-ex-highlanders-ceos-fraud-case/",
            "content": "By Sports Reporter\n\nBulawayo Chiefs has suspended its administrator, Andrew Mandigora, in connection with a US$5,000 fraud case involving former Highlanders CEO Brian Moyo.\n\nMandigora is accused of furnishing Moyo with details, which the latter used to generate a fake invoice that was used to defraud Highlanders.\n\nMoyo, who resigned on Saturda,y allegedly generated a fake US$23,000 invoice for Highlanders to pay Bulawayo Chiefs in a transaction involving two players, when Bosso was supposed to pay only US$18,000. He pocketed the extra US$5,000.\n\nMandigora was notified of his suspension on Monday evening.\n\nThe Bulawayo Chiefs Football Club Executive Board is writing to inform you that, effective immediately, you are hereby suspended from your duties as an administrator at Bulawayo Chiefs Football Club.\n\nThis decision has been made in light of serious allegations regarding your involvement in fraudulent transactions, specifically concerning the submission of invoices with exaggerated amounts in collaboration with another clubs official.\n\nIn accordance with our clubs policies and procedures, this suspension is necessary to ensure the integrity of the ongoing investigation.\n\nWe must emphasize that you are not permitted to interfere with or participate in any aspect of this investigation.\n\nThis includes any communication with other parties involved or related to the matter. Please return all club property and ensure that you have no further access to club resources, systems, or confidential information during this period.\n\nWe take these allegations seriously, and appropriate steps will be taken to ensure a thorough investigation is conducted.\n\nYou will be informed of any developments regarding this matter. We appreciate your cooperation in this sensitive issue, reads the suspension letter.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/08082028/bulawayo-chiefs.jpg",
            "description": "<p>By Sports Reporter Bulawayo Chiefs has suspended its administrator, Andrew Mandigora, in connection with a US$5,000 fraud case involving former Highlanders CEO Brian Moyo. Mandigora is accused of furnishing Moyo with details, which the latter used to generate a fake invoice that was used to defraud Highlanders. Moyo, who resigned on Saturda,y allegedly generated a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/bulawayo-chiefs-suspend-administrator-in-connection-with-ex-highlanders-ceos-fraud-case/\">Bulawayo Chiefs suspend administrator in connection with ex-Highlanders CEO’s fraud case</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "08 Apr 2025"
        },
        {
            "title": "Restless Nights, Weary Body: Journalist Mhlanga pens letter as he clocks 42 days in pretrial detention",
            "url": "https://www.newzimbabwe.com/restless-nights-weary-body-journalist-mhlanga-pens-letter-as-he-clocks-42-days-in-pretrial-detention/",
            "content": "By Costa Nkomo\n\nHope for freedom continues to diminish for Alpha Media Holdings (AMH) journalist Blessed Mhlanga, who has been held in pre-trial detention at Harare Remand Prison for 42 days.\n\nHis latest bail application, which was denied for the third time  once by the High Court of Zimbabwe and twice by the Harare Magistrates Court  prompted another emotional letter from within the prison walls on Monday.\n\nMhlanga, the host of the Free Talk interview programme at Heart and Soul Television and Radio (HSTV) under the AMH banner, revealed he is battling a severeflu, exacerbated by the conditions in the overcrowded D class prison section where he is confined.\n\nHe has been placed in the prison section notorious for housing dangerous criminals, a kick in the teeth, one injustice too many.\n\nThrough his latest correspondence, penned on Monday, Mhlanga confessed to sleepless nights, a direct result of his ill health.\n\nHe wrote: As I write from this discomfort of my overcrowded cell, I am suffering from a serious bout of flue which has drained my strength and now threatens my inner peace. Sleep hardly comes as deep thoughts and lice battle for my attention at the most undesirable times. Such is the life I have lived for the past 41 days.\n\nMhlanga admitted that he is often overwhelmed by the gruelling ordeal he has endured for over 40 days. At times, he said, he breaks down, acutely aware of the states intention to inflict undue pain by prolonging his imprisonment. It appears the state intends to squeeze him dry.\n\nMy friends the journey has not been easy and it remains extremely difficult as we nudge forward; it is a marathon, not a sprint. It is very uncomfortable but unavoidable. It is a journey filled with frustrations and pain which at times overwhelms me to tears, anger and pushes me to the edge of emotional breakdown, Mhlanga said.\n\nHe continued: I am in pain, lost and sadly broken. This experience is not just a today event, but it will traumatize me for the rest of my life. It is a terrible battle which however I cannot afford to lose. It is not easy to keep going but I have no choice to quit nor the desire to stop.\n\nMhlanga expressed his deep gratitude for the emotional support he has received from fellow journalists, his legal team, family and friends, who have stood by him during his imprisonment.\n\nI have fought with everyone around me. I have fought with my fantastic legal team, and my fellow colleagues in the media who have been standing head and shoulders in my defense. I have fought with my employer of choice and even with my own family.\n\nHonestly, I cannot imagine how I would have survived without your voices of solidarity and love. Your donations towards my upkeep in this dark place will never be forgotten or taken for granted. My lawyers bring me all your encouraging words and deeds of compassion. I say this without fear of contradicting myself  it is you who have carried me.\n\nDespite the harsh and brutal conditions of the prison, Mhlanga reiterated his unwavering belief that he is being punished for defending the freedoms of others. He is resolved not to break.\n\nAlthough in pain, I remain unshaken and committed to my profession of choice. I strongly believe that it is the ordinary people who matter more than those who control the levers of power, he affirmed. He is determined to continue standing his ground, even if it means going down with the ship.\n\nMhlanga was arrested in February this year and charged under Section 164 of the Criminal Law (Codification and Reform) Act Chapter 9:23 which criminalises the transmission of data that incites public violence.\n\nThe charge stems from HSTVs coverage of a heated press conference given by Blessed Geza, a former member of the Zanu-PF Central Committee and prominent war veteran. Geza warned Stephen Mutamba, the Zimbabwe Republic Police (ZRP) chief, against deploying officers to assault protestors demonstrating against President Emmerson Mnangagwa.\n\nGeza called for Mnangagwas immediate resignation, citing corruption, nepotism, excessive bureaucracy, tribalism, and his alleged attempts to extend his term beyond 2028  something legal experts have consistently maintained is legally untenable.\n\nMnangagwa himself has committed to stepping down in 2028 in respect of the constitution.\n\nGezas current location is unknown after the police released a statement indicating they are seeking him. He has been addressing Zimbabweans from an undisclosed location via his newly created X (formerly Twitter) handle and YouTube channel.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26003108/InShot_20250225_165102005-scaled-e1741780334367.jpg",
            "description": "<p>By Costa Nkomo Hope for freedom continues to diminish for Alpha Media Holdings (AMH) journalist Blessed Mhlanga, who has been held in pre-trial detention at Harare Remand Prison for 42 days. His latest bail application, which was denied for the third time – once by the High Court of Zimbabwe and twice by the Harare</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/restless-nights-weary-body-journalist-mhlanga-pens-letter-as-he-clocks-42-days-in-pretrial-detention/\">Restless Nights, Weary Body: Journalist Mhlanga pens letter as he clocks 42 days in pretrial detention </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "08 Apr 2025"
        },
        {
            "title": "Zimbabwe’s reserves backing the ZiG currency rise to $629m",
            "url": "https://www.newzimbabwe.com/zimbabwes-reserves-backing-the-zig-currency-rise-to-629m/",
            "content": "Bloomberg\n\nGold and foreign currency reserves backing Zimbabwes bullion-linked unit have risen more than twofold since its introduction a year ago, central bank Governor John Mushayavanhu said.\n\nThe reserves stood at $629 million at the end of March, compared with $276 million end-April 2024, Mushayavanhu said in a statement at the weekend. They are sufficient to cover the entire ZiG deposits in the banking sector, pointing to the sustained stability of the ZiG, he said.\n\nThe southern African nation holds 2 771 kilograms of gold in reserves valued at $274 million.\n\nThe ZiG, short for Zimbabwe Gold, started trading April 8, 2024, replacing the defunct Zimbabwean dollar, which was in freefall. Authorities now want it to supersede the dollar, which has been used as a dual transacting currency since 2009 and is currently used in 70% of commerce.\n\nThe ZiG has depreciated 4% against the dollar this year, and lost nearly half its value against the greenback since its launch.\n\nTo provide support, the central bank has tightened monetary policy.\n\nMoney supply growth has declined from 100% prior to the ZiGs introduction to just under 1% at the end of last month, the governor said. The hawkish stance has curtailed the pass-through effects of money supply to the exchange rate and inflation, he said.\n\nAs such, the illegal parallel exchange rate premium has been reduced from over 100% to current levels of below 20%, resulting in the current price and currency stability, said Mushayavanhu.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171609/mushayavanhu-zig-4.jpg",
            "description": "<p>Bloomberg Gold and foreign currency reserves backing Zimbabwe’s bullion-linked unit have risen more than twofold since its introduction a year ago, central bank Governor John Mushayavanhu said. The reserves stood at $629 million at the end of March, compared with $276 million end-April 2024, Mushayavanhu said in a statement at the weekend. They are sufficient</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-reserves-backing-the-zig-currency-rise-to-629m/\">Zimbabwe’s reserves backing the ZiG currency rise to $629m</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "08 Apr 2025"
        },
        {
            "title": "Mutapa Investment Fund value shrouded in secrecy",
            "url": "https://www.newzimbabwe.com/mutapa-investment-fund-value-shrouded-in-secrecy/",
            "content": "By Darlington Gatsi\n\nThe government has become evasive on the value accumulated by the Mutapa Investment Fund (MIF) since its reconfiguration, with the entitys operations remaining opaque.\n\nFormerly the Sovereign Wealth Fund (SWF), the MIF was established by an Act of Parliament in 2024. It was renamed the Mutapa Fund through Statutory Instrument 156 of 2023 by President Emmerson Mnangagwa, using the Presidential Powers (Temporary Measures) Act.\n\nThe MIF oversees the operations of state-owned entities such as ZUPCO, the National Railways of Zimbabwe (NRZ), Kuvimba Mining House, and ZESA, among others.\n\nHowever, concerns have been raised over the lack of transparency, shielding the MIF from scrutiny by taxpayers.\n\nRecently, during a question-and-answer session, Citizens Coalition for Change (CCC) Senator Moses Manyengavana questioned the Minister of Justice Ziyambi Ziyambi on the value of the assets under the MIF.\n\nMy question is people of Zimbabwe applaud the existence of the Sovereign Fund, which is a standard practice the world over but in our case and in the interest of transparency, it is in the national interest for the people of Zimbabwe to know the strength of the fund at the inception and where it is now. At what stage would the people of Zimbabwe begin to see the tangible benefits of the Mutapa Fund? asked Manyengavana.\n\nIn response, Ziyambi said the MIF is still evaluating the assets more than a year after its restructuring.\n\nActually, what the government has done is to lump all the government companies under the Mutapa Fund. So, what Mutapa Fund is doing now, is to quantify the actual value of the companies under Mutapa and once they finish that, then the public will be made aware of the value.\n\nIt is very good because it will allow us now to be credit-rated and we can actually borrow as a nation against that for any developments that we want. So, it is a very good question, but it is a work in progress that the fund is doing, said Ziyambi.\n\nLast year, MIF Chief Executive Officer John Mangudya indicated that they had engaged an external partner to evaluate the assets, which would assist in the recapitalisation of some of the entities.\n\nSo, that is what they are doing so that they will say, when we inherited, this is how we quantified it. They do not want to use historical data. They are doing it for themselves to say, we inherited ZUPCO, this is the status that it was like.\n\nWe inherited ZESA. We inherited this and then they come up with a wholesome figure to say, as Mutapa Fund, these are our assets, these are our liabilities as at inception and that is what they are doing, added Ziyambi.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/02/21044343/Mangudya-2.jpg",
            "description": "<p>By Darlington Gatsi The government has become evasive on the value accumulated by the Mutapa Investment Fund (MIF) since its reconfiguration, with the entity’s operations remaining opaque. Formerly the Sovereign Wealth Fund (SWF), the MIF was established by an Act of Parliament in 2024. It was renamed the Mutapa Fund through Statutory Instrument 156 of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mutapa-investment-fund-value-shrouded-in-secrecy/\">Mutapa Investment Fund value shrouded in secrecy </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "08 Apr 2025"
        },
        {
            "title": "‘Zimbabwe is our home’: says ANC Youth League president Collen Malatji during visit",
            "url": "https://www.newzimbabwe.com/zimbabwe-is-our-home-says-anc-youth-league-president-collen-malatji-during-visit/",
            "content": "IOL\n\nAfrican National Congress (ANC) Youth League presidentCollen Malatjihas led a delegation which visited Zimbabwe for preparatory meetings ahead of the Africa Youth Congress Summit.\n\nThe Africa Youth Congress Summit is set to take place in Harare next month.\n\nDuring his visit, Malatji told a crowd of people who waited for his arrival at the Robert Gabriel Mugabe International Airport in Harare that Zimbabwe and South Africa are going to elevate bilateral relations and cooperation.\n\nWe are here in our home, Zimbabwe is our home, and we are saying the fight must continue. We were told that there is a protest here, we never saw any protest. It was driven by Western media. South Africa and Zimbabwe, we are going to work together for a beneficiation programme of making sure that we take back our land, to benefit our people.\n\nOur minerals must benefit our people. If there is poverty, it is poverty we are ready to go through. We are not prepared to suffer at the expense of countries that have no minerals and have no land.\n\nHe said the African countries should be supplying the world with finished products, not the exportation of raw materials.\n\nOur raw materials must remain here to create employment for the youth, and create employment for everyone in Africa. Africa cannot be the face of poverty when we are the richest continent in the world, he said.\n\nLast week,Zanu PF spokesperson Chris Mutsvangwatold journalists in Harare about Malatjis impending visit.\n\nOur Youth League is receiving the comrade from the ANC, the national president of the ANC Youth League Collen Malatji. He is coming to Zimbabwe. We welcome him to Zimbabwe, we welcome the communion between the youth leagues.\n\nWe are from SADC, born of the frontline states. We shared the trenches with our fellow liberation movements. I have said it time and time again, in SADC we are neighbours, we are sisters, we are brothers, said Mutsvangwa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/07140558/African-National-Congress-ANC-Youth-League-president-Collen-Malatji-shared-pictures-with-President-of-Zimbabwe-Emmerson-Mnangagwa.webp",
            "description": "<p>IOL African National Congress (ANC) Youth League president Collen Malatji has led a delegation which visited Zimbabwe for preparatory meetings ahead of the Africa Youth Congress Summit. The Africa Youth Congress Summit is set to take place in Harare next month. During his visit, Malatji told a crowd of people who waited for his arrival at</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-is-our-home-says-anc-youth-league-president-collen-malatji-during-visit/\">‘Zimbabwe is our home’: says ANC Youth League president Collen Malatji during visit</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "08 Apr 2025"
        },
        {
            "title": "How protests against Mnangagwa’s third term will affect SA",
            "url": "https://www.newzimbabwe.com/how-protests-against-mnangagwas-third-term-will-affect-sa/",
            "content": "Sowetan Live\n\nPolitical instability in Zimbabwe as a result of calls for President Emmerson Mnangagwa to step down from within his governing Zanu-PF could present challenges for SA.\n\nWhile unemployment and poverty are relatively worse in Zimbabwe than in SA, Zimbabweans consider SA a viable destination and land of opportunity.\n\nNot even recent reports from the Department of Home Affairs that deportations from SA have more than tripled since 2020/21 can deter suffering Zimbabweans.\n\nWhy should I stay home when its clear 2025 and beyond will be a waste for me? I would rather go back to SA and take up menial jobs, said Sothini Ncube, a vendor on the streets of Bulawayo, the second-largest city.\n\nNcube holds an honours degree in psychology but job opportunities in Zimbabwe are hard to come by. He has also grown frustrated that basic amenities are lacking and there is no government effort towards poverty alleviation.\n\nA newspaper vendor shows a poster about the unrest on April 1 2025. Picture: PHILIMON BULAWAYO\n\nThere are no pain killers in major hospitals in Zimbabwe. I would rather risk insults in SA but at least get some treatment when I fall sick.We are [stuck] between a rock and a hard place. SA should brace as usual for our influx, he added.\n\nIn February SA announced a nationwide operation to clamp down on illegal immigrants, but with uncertainty for many Zimbabweans growing due to political bickering in the governing party, many may be considering heading to SA.\n\nStevenson Dlamini, an economist from Zimbabwe, said SA should be concerned about the political situation up north because it could lead to a strain on its public services and infrastructure.\n\nSA has on numerous occasions struggled with unregulated Zimbabwean economic and political refugees. Not long ago [2023] an SA doctor [Limpopo health MEC, now premier Phophi Ramathuba] despite diplomatic pressure later, in a raw manner spoke the language of ordinary South Africans. She was not politically correct but she exposed what a political failure in Zimbabwe reflected on SA, he said.\n\nSA is Zimbabwes biggest trade partner and Zimbabwe is SAs gateway to Africa. Therefore, a politically insecure Zimbabwe is bad for business, according to Dlamini.\n\nFissures inside Zanu-PF developed at last years October conference in Bulawayo when a section aligned to Mnangagwa passed a motion to extend his term.\n\nThey proposed a two-way strategy: to extend his term, which ends in 2028, by two years; or to change the constitution to allow him a third term that would see him stay on until 2034.\n\nMnangagwa insists he will not stay beyond his constitutional term. But as the partys most senior member, the first secretary, he has not stopped those calling for constitutional change.\n\nThat is why Blessed Geza, who at the time was a member of Zanu-PFs central committee, decided to be the face of those resisting Mnangagwas extension.\n\nGeza mentioned people he called the looting mafia and political criminals aiding Mnangagwa to butcher the constitution for their selfish ends.\n\nA man sells mobile data on the morning of planned anti-government protests. Picture: KB MPOFU\n\nGeza was then fired from the party and placed on the polices wanted list. He is in hiding but calling on Zimbabweans to mount resistance through protests.\n\nGeza wants Mnangagwa to be replaced by his deputy Constantino Chiwenga, the protagonist of the November 2017 coup, who has not commented on the matter.\n\nParty spokesperson Christopher Mutsvangwa, in an interview with Dug Up, a Zimbabwean investigative group, accused Chiwenga of harbouring presidential ambitions. He also referred to Chiwenga as uneducated and unelectable for the presidency.\n\nMnangagwa moved with speed to change top bosses in the countrys security sector before the March demonstrations viewed as a failed coup attempt within Zanu-PF.\n\nMutsvangwa confirmed there were dramatic changes in the structure of our state apparatus to avoid an unconstitutional change of government.\n\nThey [security sector] proved they are not a joystick for political day dreamers.Ours is not akin to any postcolonial army that can be commanded from London or from Paris to go to the state house and remove leaders. It does not work like that with our army, he said.\n\nIn January Mnangagwa retired Zimbabwe Republic Police (ZRP) commissioner Gen Godwin Matanga, replacing him with Stephen Mutamba.\n\nIn the same month he retired director-general Isaac Moyo from the spy agency, Central Intelligence Organisation (CIO), and in came Fulton Mangwanya.\n\nBut the biggest change came a week before the March 31 planned protests to remove the president from power.\n\nZimbabwe National Army (ZNA) commander Lt-Gen Anselem Sanyatwe, 69, was retired from the army to become minister of sport, arts and culture.\n\nHis replacement was Maj-Gen Emmanuel Matatu, 72.\n\nThe new-look ZRP, ZNA and CIO are near complete overhauls compared with when vice-president Chiwenga led the putsch that removed Robert Mugabe in November 2017, ushering in Mnangagwas regime.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/31133655/march-5.png",
            "description": "<p>Sowetan Live Political instability in Zimbabwe as a result of calls for President Emmerson Mnangagwa to step down from within his governing Zanu-PF could present challenges for SA. While unemployment and poverty are relatively worse in Zimbabwe than in SA, Zimbabweans consider SA a viable destination and land of opportunity. Not even recent reports from</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/how-protests-against-mnangagwas-third-term-will-affect-sa/\">How protests against Mnangagwa’s third term will affect SA</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "08 Apr 2025"
        },
        {
            "title": "Zimbabwe meets UN HIV target, leading fight against AIDS",
            "url": "https://www.newzimbabwe.com/zimbabwe-meets-un-hiv-target-leading-fight-against-aids/",
            "content": "Channel Africa\n\nZimbabwe has made remarkable progress in the fight against HIV/AIDS, as reported by the Joint United Nations Programme on HIV and AIDS (UNAIDS).\n\nThe country has successfully reached the 95-95-95 targets, a global set of goals aimed at eliminating AIDS as a public health threat by 2030. The targets are designed to ensure that 95% of people living with HIV know their status, 95% of those diagnosed receive sustained antiretroviral therapy (ART), and 95% of those on treatment achieve viral suppression.\n\nCountries like Botswana, Eswatini, Rwanda, and Zimbabwe are among those leading the way in meeting these ambitious targets, providing hope and a model for the rest of the continent.\n\nPaul Caris Juru, the National Coordinator of the International Network of Religious Leaders Living with or Affected by HIV/AIDS in Zimbabwe, shared insights into how Zimbabwe achieved these gains. He attributed the countrys success to its unwavering commitment to ending the HIV/AIDS epidemic by 2030, despite ongoing economic challenges. Zimbabwes achievement of the 95-95-95 target is a proof to the countrys commitment to ending the AIDS pandemic by 2030, Juru said. Despite facing economic challenges, Zimbabwe has made significant strides in HIV prevention, treatment, and care.\n\nThe collective efforts of the government, international organisations, and civil society have been essential in expanding access to ART, improving HIV testing and diagnosis, and enhancing prevention efforts.\n\nWith over 10,000 healthcare facilities providing primary health services nationwide, Zimbabwe has successfully reached both urban and rural communities. Village health workers have been instrumental in raising awareness about HIV, and the government, alongside non-governmental organisations (NGOs), has implemented comprehensive awareness campaigns to educate the public on prevention and treatment.\n\nEven with limited resources, Zimbabwe has demonstrated that substantial progress is possible in tackling the HIV/AIDS epidemic. Even countries with limited resources, like Zimbabwe, can make significant strides in addressing the HIV/AIDS epidemic, Juru noted. The countrys network of healthcare providers, especially in rural areas, has been key to reaching those in need of care and support.\n\nFaith communities have also played a critical role in supporting people living with HIV and challenging the stigma associated with the disease. Through organisations such as INERELA+, founded by Anglican pastor Gideon Byamugisha, the faith-based community has been instrumental in addressing stigma and providing care for those affected by HIV. Byamugisha, who was diagnosed with HIV and lost his wife to the disease, faced discrimination within the church and recognised the urgent need to break the silence surrounding HIV in faith communities.\n\nByamugisha and his colleagues founded INERELA+ in 2000, and the organisation has since become a prominent network across Africa, Europe, and Asia. The interfaith approach has been crucial in promoting a more inclusive response to the HIV/AIDS epidemic. Faith leaders who publicly share their HIV-positive status help reduce stigma and encourage others to seek treatment and support.\n\nThe success of Zimbabwes HIV/AIDS response can be attributed to the collaborative and multisectoral approach, which includes the involvement of the faith community, healthcare providers, international organisations, and local NGOs. The church has served as a safe space for counselling, education, and support for individuals living with HIV, offering a welcoming environment where people can access care without fear of discrimination.\n\nWhile Zimbabwe has made significant progress, Juru emphasised that the work is not yet complete. He urged that the country must remain vigilant and continue the fight to meet the ultimate goal of eliminating AIDS by 2030. The work is far from over. We must continue the fight to ensure that we achieve the ultimate goal of ending AIDS by 2030, Juru concluded.\n\nZimbabwes success in achieving the 95-95-95 target is a hopeful reminder of what can be accomplished through unity, dedication, and a commitment to addressing stigma and discrimination in the fight against HIV/AIDS.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/01/17083257/Know-your-HIV-status-e1579250018379.jpeg",
            "description": "<p>Channel Africa Zimbabwe has made remarkable progress in the fight against HIV/AIDS, as reported by the Joint United Nations Programme on HIV and AIDS (UNAIDS). The country has successfully reached the 95-95-95 targets, a global set of goals aimed at eliminating AIDS as a public health threat by 2030. The targets are designed to ensure</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-meets-un-hiv-target-leading-fight-against-aids/\">Zimbabwe meets UN HIV target, leading fight against AIDS</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "08 Apr 2025"
        },
        {
            "title": "City of Harare to fumigate over 5 000 housing units as Mbare battles bed bug outbreak",
            "url": "https://www.newzimbabwe.com/city-of-harare-to-fumigate-over-5-000-housing-units-as-mbare-battles-bed-bug-outbreak/",
            "content": "By Tapiwa Svondo\n\nThe City of Harare (CoH) has identified a total number of 5 490 housing units to be fumigated in Mbare, where there is a bed bug (tsikidzi)outbreak.\n\nIn an interview with the Director of Health at CoH, Prosper Chonzi, said the council will start with the most affected flats: Matererini, Matapi, and Majubeki and then proceed to other areas.\n\nIts almost like its everywhere where there are bed bugs, but we have Matererini, parts of Matapi and Majubeki and all in all we did a mapping and there are 5 490 units that need to be fumigated.\n\nSo we are planning for those 5 490 starting with those who voiced their voices about the outbreak, but we are going to spray everywhere because it doesnt help to just spray the affected and leave other flats in Mbare, said Chonzi.\n\nSamples of bed bugs have been taken to the laboratories to determine which pesticides to use when fumigating.\n\nAdded Chonzi, Its very true there are many bed bugs in this area, the government has chipped in help and other pest control chemicals are being transported from Mashonaland East and other materials. We have taken the bed bugs to our laboratories so that we can determine which chemicals kill the most and the chemicals which we have now are the ones which we always use, but we will come up with the most effective if it requires doing so after our laboratory results.\n\nJane Kariwo of Matererini flats, Block 3, complained that second-hand imported clothes commonly known asmabheroare also contributing to the bed bug outbreak.\n\nWe are pleading that they find a place where cloakrooms are opened somewhere so that we are not close to these second-hand clothes which are transported from Tanzania and other places.\n\nThere should be a place where these clothing items are fumigated before they are brought to the markets to avoid these kinds of outbreaks, said Kariwo\n\nOne youth who spoke to NewZimbabwe.com said they were now turning to drugs in order to manage the itchiness caused by the bed bug bites.\n\nYouths in Mbare where there is a bed bugs (tsikidzi) outbreak say they take drugs to help them manage the bites itchinesspic.twitter.com/xNI8fyhkTg\n\n NewZimbabwe.com (@NewZimbabweCom)April 7, 2025\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/07180257/mbare-8.jpeg",
            "description": "<p>By Tapiwa Svondo The City of Harare (CoH) has identified a total number of 5 490 housing units to be fumigated in Mbare, where there is a bed bug (tsikidzi) outbreak. In an interview with the Director of Health at CoH, Prosper Chonzi, said the council will start with the most affected flats: Matererini, Matapi,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/city-of-harare-to-fumigate-over-5-000-housing-units-as-mbare-battles-bed-bug-outbreak/\">City of Harare to fumigate over 5 000 housing units as Mbare battles bed bug outbreak</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "08 Apr 2025"
        },
        {
            "title": "US stocks are extremely volatile as Wall Street rattled by tariffs",
            "url": "https://www.newzimbabwe.com/us-stocks-are-extremely-volatile-as-wall-street-rattled-by-tariffs/",
            "content": "US stocks were extremely volatile Monday  tumbling, surging and then bouncing around in every direction, as traders searched for any sign that President Donald Trumps tariffs could be negotiated or halted.\n\nMarkets around the world had tumbled earlier in the day over concerns about how Trumpssweeping tariffsmight upend the global economy and stymie economic growth. US stocks opened the day in bear market territory but surged an hour later on rumors that the Trump administration may pause tariffs  perhaps for several months.\n\nThat rumor turned out to be just that  a White House official called any suggestion that Trump would pause tariffs fake news. And despite hopes that some trading partners, including the EU, might be willing to negotiate with Trump, the president dashed detente hopes when he said he could slap another 50% tariff on China.\n\nAnd just like that, the Dow, which had risen nearly 900 points, was back down once again.\n\nThe Dow was most recently trading down 840 points, or 2.2%. The broader S&P 500 was 1.7% lower. The Nasdaq Composite was 1.5% lower.\n\nThe wild swings in markets underscore just how badly investors want Trump to put a pause on his trade war. US stocks surged off their lows and even briefly turned positive on rumors of a pause on tariffs. However, that rebound proved fleeting as traders realized nothing official had been announced.\n\nThat was a good example of what would happen if we actually got some rational thought mixed in with the ignorant tariff policy, Art Hogan, chief market strategist at B. Riley Wealth Management, told CNN in a phone interview Monday. The stock market vigilantes have spoken loudly that we need rational thought mixed in with this trade policy. And there is none so far.\n\nHogan added that oversold markets desperate for good news are subject to wild swings that can quickly reverse.\n\nThe S&P 500 hit its low of the day at 9:43 a.m. ET and then surged on the rumor that Trump might pause tariffs, hitting its highest level of the day at 10:17 a.m. ET. In the span of just over 30 minutes, the S&P 500 surged 8.5%, a massive swing in markets. The benchmark index then shed its gains as the market came back down.\n\nThat was a monster move off the low, Joe Saluzzi, partner and co-founder of Themis Trading, told CNN.\n\nOne of the positive swings Monday morning came when Ursula von der Leyen, a top European Union official, said the bloc is ready to negotiate with the United States, noting that it has offered to scrap tariffs on US industrial goods.\n\nAt the open, the S&P 500 tumbled into bear market territory  a decline of 20% from a recent peak  before pulling back. The decline in US stocks came after ahistoric rout in Asiaand massive losses in Europe.\n\nThe S&P 500 hit a record high less than seven weeks ago, on February 19. If the index closes in bear market territory, that would be the second-fastest peak-to-bear market shift in history (the fastest occurred during the 2020 Covid-19 pandemic).\n\nWall Street is coming off a rout in US stocks Thursday and Friday that saw the Nasdaq confirm it was in a bear market. Investors may be sensing a buying opportunity. With all the recent and rapid selling, stocks are getting cheap: Theyre trading at a historically inexpensive 15 times future earnings projections. That could help markets rebound if investors believe stocks are oversold.\n\nWe are getting close to a bottom, said James Demmert, chief investment officer at Main Street Research. The fact that stocks have dropped so significantly in these deep intraday moves is a clear sign of indiscriminate and fear-based selling. When this happens, we tend to soon see significant rallies.\n\nThat could muddy the message Wall Street has been trying to send to President Donald Trump. Market mayhem has potentially opened the door to some negotiation.\n\nIf the stock market pulls back from its extensive declines, Trump may get the message that he can hold firm and weather the market storm, some market analysts said.\n\nWe need this market to crash  to keep the pressure on the administration, Ed Yardeni, president of Yardeni Research, told CNN in a stunning comment from a prominent market analyst.\n\nYardeni noted to clients earlier in the day that Liberation Day has been followed by Annihilation Days in the stock market.\n\nAs markets whipsawed Monday morning, Trump said in a social mediapostthat hes ready to slap new 50% tariffs on China followingBeijings retaliatory dutiesannounced last week, further escalating the global trade war that has rattled markets.\n\nTrump said the additional tariffs would take effect midweek if China doesnt remove its 34% retaliatory tariff by Tuesday. He also said meetings China had requested would be cancelled, though he said other countries would begin negotiating on trade immediately.\n\nAcross the Atlantic, von der Leyen, president of the EUs executive arm, said the bloc was ready negotiate and offered to scrap its tariffs on industrial goods. Von der Leyen said the zero-tariff offer was made long before Trumps latest tariff announcement and repeatedly, for example, in the automotive sector. She stressed that the EU has long gone zero for zero with other countries that also have a strong automotive sector.\n\nAt the same time, the EU is willing to play hardball: Although it would prefer to strike a negotiated settlement, the bloc is also preparing a potential list (of US imports) for retaliation, von der Leyen told reporters in Brussels.\n\nWall Streets fear gauge, the Cboe Volatility Index, or VIX, has surged to levels not seen since the Covid-19 pandemic as investors fret over the markets next move.CNNs Fear and Greed Indexhas slumped to its lowest levels this year.\n\nAs stocks initially wavered Monday morning, Trump posted on social media that, Countries from all over the World are talking to us.\n\nTough but fair parameters are being set. Spoke to the Japanese Prime Minister this morning. He is sending a top team to negotiate! They have treated the U.S. very poorly on Trade. They dont take our cars, but we take MILLIONS of theirs. Likewise Agriculture, and many other things. It all has to change, but especially with CHINA!!!, Trump said.\n\nTrump, for his part, has also tried to make the case that recession fears could be a good thing. For example, US oil prices plunged below $60 for the first time since April 2021 on fears that global demand will be sapped in an economic downturn. And Treasury yields have fallen as investors have poured money into the apparent safety of government bonds. That could lower some consumer rates pegged to Treasury yields, including mortgages, credit cards and auto loans  althoughFederal Reserve Chair Jerome Powell saidFriday the central bank was in no rush to lower rates.\n\nOil prices are down, interest rates are down (the slow moving Fed should cut rates!), food prices are down, there is NO INFLATION, and the long time abused USA is bringing in Billions of Dollars a week from the abusing countries on Tariffs that are already in place, Trump said in aTruth Social postMonday morning.\n\nTrump said Sunday on Air Force One that he has been fielding calls from tech executives and world leaders over the weekend on tariffs. Trump said he would be open to a deal with China and the European Union, although he demanded they close the trade gap with the United States. Its a feat that isnt solvable overnight, if ever.\n\nIf they want to talk about that, Im open to talking, Trump said.\n\nTrump and his tariffs have taken a bull stock market and are on the precipice of turning it into a bearfaster than any president has overseen in modern history. If the stock market closes in bear territory, it would be the earliest in a new administration a bull market has turned into a bear in the history of the S&P 500, which dates back to 1957.\n\nAmong the reasons for the bearish sentiment is the uncertainty the Trump administration has created regarding its inconsistent messaging about whether tariffs would be open to negotiation.\n\nOn Wednesday, America will impose significantly higher reciprocal tariffs on dozens of countries that have the highest trade imbalances with the United States. In a note to investors Sunday, Goldman Sachs said that if Trump followed through with those threats, it would surely plunge the US and global economies into a recession. JPMorgan CEOJamie Dimon said in an annual letterto shareholders Monday that Trumps tariffs would raise prices and slow economic growth.\n\nIn addition to baseline 10% universal tariffs that went into effect Saturday morning, Trump has also put in place tariffs on autos, steel and aluminum. He placed 25% tariffs on certain goods from Canada and Mexico. And more tariffs could be on their way: Tariffs on auto parts are set to go into effect no later than May 3. Meanwhile Trump has also threatened tariffs on lumber, pharmaceuticals, copper and microchips, among other products.\n\nWhether or not Trump follows through with those threats could be the determining factor in whether the economy plunges into a global downturn.\n\nIf you ask Commerce Secretary Howard Lutnick, Trump isnt bluffing.\n\nThe tariffs are coming. (Trump) announced it, and he wasnt kidding, Lutnick told CBSs Face the Nation on Sunday. The tariffs are coming. Of course they are.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/07181032/us-stock-ex.webp",
            "description": "<p>CNN US stocks were extremely volatile Monday — tumbling, surging and then bouncing around in every direction, as traders searched for any sign that President Donald Trump’s tariffs could be negotiated or halted. Markets around the world had tumbled earlier in the day over concerns about how Trump’s sweeping tariffs might upend the global economy and stymie</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-stocks-are-extremely-volatile-as-wall-street-rattled-by-tariffs/\">US stocks are extremely volatile as Wall Street rattled by tariffs</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "08 Apr 2025"
        },
        {
            "title": "Agroecology: A policy imperative for sustainable and resilient food systems in SADC",
            "url": "https://www.newzimbabwe.com/agroecology-a-policy-imperative-for-sustainable-and-resilient-food-systems-in-sadc/",
            "content": "By Dr Thulasizwe Mkhabela\n\nThe sustainability and resilience of food systems are at the heart of food security discussions globally, and the Southern African Development Community (SADC) is no exception. The region faces multiple challenges, including climate change, land degradation, water scarcity, and socio-economic vulnerabilities that threaten agricultural productivity and food security. Agroecology has emerged as a key approach to addressing these challenges, offering practical and scientifically grounded solutions to ensure long-term sustainability while enhancing food sovereignty and farmer livelihoods.\n\nWhy Agroecology Matters for SADC\n\nAgroecology is a holistic, climate-smart, and ecologically sound agricultural system that integrates traditional knowledge with modern science. It promotes diversified farming systems, enhances soil fertility, fosters biodiversity, and builds resilience to climate shocks. Unlike input-intensive industrial agriculture, which is often associated with environmental degradation and economic vulnerabilities, agroecology aligns with SADCs socio-economic realities and ecological constraints.\n\nThe Food and Agriculture Organization (FAO) and other global institutions have recognised agroecology as a viable pathway to sustainable food systems. In a region where more than 70% of the population depends on agriculture for their livelihoods, adopting agroecology can transform food systems by improving yields, restoring degraded ecosystems, reducing dependence on expensive agrochemicals, and strengthening market linkages for smallholder farmers.\n\nThe Role of Indigenous Foods in Agroecology\n\nIndigenous foods play a crucial role in advancing agroecological practices in SADC. Traditional crops such as sorghum, millet, cowpeas, and amaranth are naturally adapted to local climatic conditions, requiring fewer external inputs while offering high nutritional value. Promoting the cultivation and consumption of these crops enhances food security, strengthens biodiversity, and reduces reliance on imported staples.\n\nFurthermore, indigenous food systems preserve cultural heritage and empower local communities by maintaining traditional farming knowledge. Policies that support the conservation and commercialisation of indigenous crops can create economic opportunities for smallholder farmers and increase resilience to climate change.\n\nSuccess Stories in Agroecology Across SADC\n\nSeveral SADC countries have demonstrated the potential of agroecology in enhancing food security and resilience:\n\nThese success stories illustrate the tangible benefits of agroecology and highlight the need for policies that scale up such initiatives across the region.\n\nPolicy Recommendations for Scaling Agroecology\n\nConclusion\n\nAgroecology presents a clear opportunity for SADC to transition toward more sustainable, resilient, and equitable food systems. It aligns with the African Unions Malabo Declaration commitments on food security, climate adaptation, and sustainable agriculture. However, for agroecology to reach its full potential, strong political will, institutional support, and well-designed policies are necessary.\n\nThe integration of indigenous foods and the scaling of successful agroecology initiatives offer a pathway to revitalizing the regions food systems. SADC governments must act now to embed agroecology into their national and regional agricultural development agendas, ensuring food security and economic stability for future generations.\n\nAuthor\n\nDr Thulasizwe Mkhabela is an agricultural economist.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/13080355/Agroecology-Zimbabwe.jpeg",
            "description": "<p>By Dr Thulasizwe Mkhabela The sustainability and resilience of food systems are at the heart of food security discussions globally, and the Southern African Development Community (SADC) is no exception. The region faces multiple challenges, including climate change, land degradation, water scarcity, and socio-economic vulnerabilities that threaten agricultural productivity and food security. Agroecology has emerged</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/agroecology-a-policy-imperative-for-sustainable-and-resilient-food-systems-in-sadc/\">Agroecology: A policy imperative for sustainable and resilient food systems in SADC</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "08 Apr 2025"
        }
    ]
}