{
    "news": [
        {
            "title": "SADC 34th meeting of Committee of Ministers of Trade kicks off in Harare",
            "url": "https://www.newzimbabwe.com/sadc-34th-meeting-of-committee-of-ministers-of-trade-kicks-off-in-harare/",
            "content": "By Anna Chibamu\n\nSOUTHERN African Development Community (SADC) member states continue to register commendable progress in implementing the SADC Free Trade Area (FTA) and regional programmes.\n\nSADC Senior Officials chairperson Ambassador Albert Chimbindi said this Monday as the 34th meeting of the Committee of SADC Ministers of Trade (CMT) and 24th Ministerial Task Force on Regional Integration (MTF) kicked off in Harare.\n\nChimbindi told regional delegates that it is heartening to note that despite the prolonged hiatus since the last CMT meeting in July, 2023 member states have continued to register commendable progress in implementing the SADC Free Trade Area (FTA) and related regional programmes.\n\nThis demonstrates our unwavering resolve to advance the SADC regional integration agenda, even amid global economic turbulence.\n\nHe, however, challenged member states to equally acknowledge that several decisions from previous CMT meetings remain outstanding and unimplemented due to various challenges, including the prolonged hiatus that the regional bloc witnessed.\n\nI, therefore, call upon all member states and the Secretariat to redouble efforts toward the full and timely implementation of all the pending decisions.\n\nOnly through coordinated action and a sense of urgency can we deliver on our shared aspirations. Intra SADC trade, participation at these trying times globally, should be at the centre of what we do. Trade is so key to regional developments and industrialisation that we should never again allow ourselves to fail to meet, Chimbindi said.\n\nThe meeting is taking place against a background of profound global economic disruptions, marked by increasing protectionism, shifting trade alliances, and unpredictable supply chains.\n\nAdded Chimbindi, In this complex and zero-sum trading environment, adaptation is not optional; it is imperative. We must collectively understand the changing dynamics, anticipate future dynamics and disruptions and adopt responsive policies if we are to remain relevant players in the global economy.\n\nCollectiveaction is key.\n\nAccording to the Ambassador, there has been a growing convergence of views within the region on the need to build greater resilience and deepen intra-regional trade, which must be matched by action.\n\nWe, the member states, hold the key to translating intent into tangible outcomes. Our people expect nothing less from us.\n\nIt is encouraging that our agenda today prioritises critical trade facilitation issues. These are essential levers for improving regional trade cooperation, eliminating all forms of barriers and unlocking the full potential of our industrialisation agenda.\n\nSimplifying trade procedures, harmonising standards, and investing in digital and physical infrastructure will not only boost trade flows but also stimulate innovation and sustainable growth.\n\nHe warned members that they should deliberate, being aware of the far-reaching implications the decisions for the SADC trading ecosystem in the context of an ever-evolving global landscape.\n\nThe Senior Officials Meeting of the 34th SADC Committee of Ministers of Trade (CMT) is a precursor to the CMT session scheduled to be held this Thursday, June 5, 2025, convening in Mount Hampden, New Parliament Building.\n\nThe meeting marks a critical juncture in our collective efforts to deepen regional integration, enhance trade facilitation, and drive industrial development across the SADC region.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/03055726/albert-chimbindi.jpeg",
            "description": "<p>By Anna Chibamu SOUTHERN African Development Community (SADC) member states continue to register commendable progress in implementing the SADC Free Trade Area (FTA) and regional programmes. SADC Senior Officials chairperson Ambassador Albert Chimbindi said this Monday as the 34th meeting of the Committee of SADC Ministers of Trade (CMT) and 24th Ministerial Task Force on</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sadc-34th-meeting-of-committee-of-ministers-of-trade-kicks-off-in-harare/\">SADC 34th meeting of Committee of Ministers of Trade kicks off in Harare</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "03 Jun 2025"
        },
        {
            "title": "Scottland FC winger Nathan smuggled into Warriors COSAFA Cup squad",
            "url": "https://www.newzimbabwe.com/scottland-fc-winger-nathan-smuggled-into-warriors-cosafa-cup-squad/",
            "content": "By Sport Reporter\n\nNathan Mutasa on Monday grabbed the attention of Zimbabwes football fraternity after his surprise inclusion in the 2025 Warriors COSAFA Cup squad.\n\nThe Scottland FC winger is son to socialite Pokello Nare.\n\nMutasas pictures at Robert Mugabe International Airport departures, donning the Warriors travelling kit, were widely shared on social media, with many questioning his inclusion.\n\nHe was not part of the official COSAFA squad announced by Warriors coach Michael Nees lastTuesday.\n\nAccording to sources at ZIFA, the former Grenada player replaced Dynamos midfielder Vusa Ngwenya in the squad. Reasons for Ngwenyas exclusion were not highlighted.\n\nMutasa has been facing criticism from Scottland fans over his poor performance on the pitch.\n\nOn Saturday, Scottland FC coach Tonderai Ndiraya could not give a meaningful answer at Ngoni stadium after he was questioned why Mutasa made it into the starting line-up ahead of better players who play the same position, like Panashe Mutimbanyoka and Michael Tapera.\n\nThe COSAFA Cup tournament is his first senior national team call-up, since he last featured for the Young Warriors at under-17 level.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/03060440/WhatsApp-Image-2025-06-02-at-22.53.54.jpeg",
            "description": "<p>By Sport Reporter Nathan Mutasa on Monday grabbed the attention of Zimbabwe’s football fraternity after his surprise inclusion in the 2025 Warriors COSAFA Cup squad. The Scottland FC winger is son to socialite Pokello Nare. Mutasa’s pictures at Robert Mugabe International Airport departures, donning the Warriors travelling kit, were widely shared on social media, with</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/scottland-fc-winger-nathan-smuggled-into-warriors-cosafa-cup-squad/\">Scottland FC winger Nathan smuggled into Warriors COSAFA Cup squad</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "03 Jun 2025"
        },
        {
            "title": "Zimbabwe’s monthly trade deficit widens to US$228 million",
            "url": "https://www.newzimbabwe.com/zimbabwes-monthly-trade-deficit-widens-to-us228-million/",
            "content": "By Alois Vinga\n\nZIMBABWEs trade deficit widened to US$228 million in just a month, signifying the pressing need to boost local manufacturing capacity.\n\nA trade deficit occurs when a countrys imports exceed exports and is also referred to as a negative balance of trade (BOT).A wider balance of trade, whether surplus or deficit, sends economic signals about a countrys competitiveness, global market access, and the impact of economic policies.\n\nIn the case of Zimbabwe, low productivity has not matched local demand for decades.\n\nLatest data from the Reserve Bank of Zimbabwe (RBZ) confirm that in March 2025, more imports than exports were recorded.\n\nThe countrys trade deficit widened to US$228.0 million in March 2025, compared to US$217.9 million recorded in the previous month. On a year-on-year basis, the deficit increased from US$185.9 million in March 2024 to US$228.0 million in the reporting month, the RBZ said.\n\nDuring the period, merchandise imports amounted to US$809.9 million in March 2025, reflecting a 10.9% increase from US$730.4 million recorded in the previous month. On a year-on-year basis, imports rose by 12.4%.\n\nDuring the month under review, most of the countrys imports originated from South Africa (38.2%), China (15.2%), the Bahamas (11.5%), and Mozambique (4.9%), with the rest sourced from a range of other markets.\n\nThe countrys export basket was predominantly composed of primary commodities, with gold leading at 42.4%, followed by PGMs, (16.0%), tobacco (17.1%), and other mineral exports (6.7%).\n\nIn March 2025, the countrys exports were mainly destined for the United Arab Emirates (40.7%), South Africa (24.4%), and China at 20.8%. The remaining exports were spread across various other international markets, said the RBZ.\n\nMarket watchers are of the view that Zimbabweurgently needs to adopt a radical policy shift to spur local industrial productivity to plug the huge foreign currency outflows.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/05/27170948/rbz_zimbabwe-min.jpg",
            "description": "<p>By Alois Vinga ZIMBABWE’s trade deficit widened to US$228 million in just a month, signifying the pressing need to boost local manufacturing capacity. A trade deficit occurs when a country’s imports exceed exports and is also referred to as a negative balance of trade (BOT). A wider balance of trade, whether surplus or deficit, sends economic</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-monthly-trade-deficit-widens-to-us228-million/\">Zimbabwe’s monthly trade deficit widens to US$228 million</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "03 Jun 2025"
        },
        {
            "title": "New twist to Mpofu, Chimombe fraud case as former Agric Perm Sec gives evidence",
            "url": "https://www.newzimbabwe.com/new-twist-to-mpofu-chimombe-fraud-case-as-former-agric-perm-sec-gives-evidence/",
            "content": "By Staff Reporter\n\nThe case in which businessmen Moses Mpofu and Mike Chimombe are accused of defrauding the government of US$7 million in a botched presidential goats scheme Monday took a new twist after former Permanent Secretary in the Ministry of Agriculture John Basera acknowledged that they only partly failed to meet the contractual agreement.\n\nBasera was being cross-examined by Mpofus lawyer, Advocate Tapson Dzvetero, when he confirmed that the duos company, Blackdeck, had managed to meet their first-year target of a five five-year deal.\n\nBasera told High Court judge Justice Pisirayi Kwenda that Blackdeck supplied 3,595 goats against 3,113, which was written in their agreement.\n\nThe former permanent secretary also confirmed that the company had unforeseen challenges in mobilising the goats locally.\n\nWe had green, red and buffer zones because of Foot and Mouth Disease. If I remember well, we had made a recommendation of not transporting goats from one province to another province, but to do intra-province distributions because of Foot and Mouth Disease, he said.\n\nBasera confirmed that when the Agriculture Ministry asked Blackdeck to supply 500 goats for a launch project in Chipinge, the company delivered.\n\nDzvetero also asked him to confirm that there were also other incidents where the company wrote to the company to supply the goats for other launches, and he said this was correct.\n\nThe court heard that the ministry was supposed to call the guarantor or go for arbitration in cases of conflicts as outlined in the agreement but the ministry did not do so.\n\nBasera said wthat when he left the ministry, plans were being made to call the guarantor.\n\nThe court also heard that the ministry instead went on to request the supply of more goats under the presidential goat pass on scheme despite the conflict which arose.\n\nThe state alleges Blackdeck submitted fraudulent documents to win the US$87 million deal.\n\nIt is alleged that the two were given an advance payment of US$7 million, which they failed to account for, and they both deny the charges.\n\nTrial continues Tuesday.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/03215456/WhatsApp-Image-2024-10-03-at-12.49.46.jpeg",
            "description": "<p>By Staff Reporter The case in which businessmen Moses Mpofu and Mike Chimombe are accused of defrauding the government of US$7 million in a botched presidential goats scheme Monday took a new twist after former Permanent Secretary in the Ministry of Agriculture John Basera acknowledged that they only partly failed to meet the contractual agreement.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/new-twist-to-mpofu-chimombe-fraud-case-as-former-agric-perm-sec-gives-evidence/\">New twist to Mpofu, Chimombe fraud case as former Agric Perm Sec gives evidence</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "03 Jun 2025"
        },
        {
            "title": "Healing or Hustle? Smuggled Meds Are Big Draw in Zimbabwe’s Hidden Markets",
            "url": "https://www.newzimbabwe.com/healing-or-hustle-smuggled-meds-are-big-draw-in-zimbabwes-hidden-markets/",
            "content": "By Gamuchirai Masiyiwa, GPJ Zimbabwe\n\nThis story was originally published byGlobal Press Journal.\n\nHARARE, ZIMBABWE  Its possible to buy pretty much anything at the market in Hopley, an informal settlement south of this capital city: rat poison, mops  even medicine.\n\nThat medicine is sold without prescriptions, to buyers who dont have a diagnosis from a doctor in hand. Some vendors even offer diagnoses to their customers, even though they dont have any medical training. And in many cases, the medicine is fake. At any moment, police could swoop in for a raid. Vendors keep the medicine out of view, and buyers know who to ask.\n\nGladys Chihozhwa buys contraceptive pills from one of them, and even turns to the vendors for diagnoses when shes sick. She knows the drugs might be expired, or even fake. That doesnt deter her. I buy them because they are cheap, she says.\n\nZimbabwe is overwhelmed with counterfeit medicine, driven by the expansion of informal markets and consumer demand for cheaper products. Police routinely impound pharmaceuticals. In just one example, the Medicines Control Authority of Zimbabwe in January discovered counterfeit rabies vaccines in circulation. Their packaging mimicked that of legitimate imports from India, a big supplier of Zimbabwes medicine.\n\nThe vaccines pathway into the market remains unclear, but some products pour into Zimbabwes informal markets through its leaky borders with Zambia, where counterfeit medicines from India are easily available, and cheap.\n\nThe consequences of this trade can be fatal. According to a2022 report by the United Nations Office on Drugs and Crime, in sub-Saharan Africa alone, counterfeit medicines kill just over a quarter of a million people each year.\n\nEven when not immediately fatal, they can cause long-term harm, includingincreasing antibiotic resistance, says Dr. Grant Marewanhema, a public health expert.\n\nIn a written response, public relations officer Davison Kaiyo says the Medicines Control Authority of Zimbabwe has tried to address this problem by conducting raids with the police and intercepting counterfeit medicines at borders. They also conduct regular inspections at pharmacies. Those caught are prosecuted, and the medicines confiscated, he says.\n\nBut demand is high, so new shipments keep pouring in.\n\nDistribution of fake and substandard medicines is a global, highly profitable criminal enterprise. One 2020study by the Pacific Research Instituteestimated that the counterfeit medicine market is worth somewhere between US$200 billion and US$431 billion annually.\n\nMany of the counterfeit drugs are produced in India, where a mix of highly reputable drug manufacturers and unregulated producers creates serious challenges for oversight and quality control.\n\nAfrica is particularly affected. According to the World Health Organization, 42% of globally detected cases of counterfeit and substandard medical products between 2013 and 2017 were in Africa.\n\nIn Zimbabwe, porous borders facilitate the movement, but a combination of other factors fuels the trade. The countrys decades-long economic problems have left thehealth care system hanging by a thread. Many public hospitals simply dont have medicine supply, says Portifa Mwendera, a pharmacist of 25 years. Most times, patients are given prescriptions and told to source the medication elsewhere, he says.\n\nBut Zimbabwe produces only 30% of its essential medicines. The rest is imported and costly in pharmacies. Many people in the country are too strapped for cash, and these vendors offer options that are easier on the pocket, Mwendera says.\n\nSanudi, a cross-border truck driver, has for two decades smuggled medicine into the country through the Chirundu border post, a key trade and travel point between Zambia and Zimbabwe. He knows many other truckers who do the same. Sanudi asked Global Press Journal to use his middle name for fear of arrest.\n\nIts easy, he says. At the border, if the bag is small, he leaves it with a security guard as the truck undergoes scanning. He pays the guard US$50 to US$60, then charges the traders about US$200 to transport two small bags. If the consignment is too big to stash with the guards, he simply bribes the officials scanning the trucks.\n\nIts a risky operation, but I do it for the extra money I get, he says.\n\nGlobal Press Journal reached out to officials at the Zimbabwe Revenue Authority, but they did not respond to interview requests.\n\nGozo, a vendor who also asked Global Press Journal to use only one name for fear of arrest, sells pharmaceuticals without a license, and offers diagnoses. Once the customer describes their symptoms, Gozo says she knows what to sell them. Two years in this trade have sufficiently equipped her, she says, especially in prescribing antibiotics.\n\nThe people I sell the drugs to get better, she says.\n\nAntibiotics such as ciprofloxacin are popular at her stall, and many of them come from a supplier who gets them from Zambia. Ten antibiotics pills go for US$1 at her stall. In licensed pharmacies, the cost can be twice as much.\n\nIf arrested, she could face high fines or even imprisonment. Police conduct raids at the market from time to time, but sellers like her depend on this trade for a living.\n\nI always take the risk, she says.\n\nGamuchirai Masiyiwais a Global Press Journal reporter-in-residence based in Harare, Zimbabwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/02132438/01_GPJNews_Zim_GM_UnregisteredMedicine_-26_L_web.jpg",
            "description": "<p>By Gamuchirai Masiyiwa, GPJ Zimbabwe This story was originally published by Global Press Journal. HARARE, ZIMBABWE — It’s possible to buy pretty much anything at the market in Hopley, an informal settlement south of this capital city: rat poison, mops — even medicine. That medicine is sold without prescriptions, to buyers who don’t have a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/healing-or-hustle-smuggled-meds-are-big-draw-in-zimbabwes-hidden-markets/\">Healing or Hustle? Smuggled Meds Are Big Draw in Zimbabwe’s Hidden Markets</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "03 Jun 2025"
        },
        {
            "title": "Thuli Phongolo denies dating gold dealer Scott Sakupwanya",
            "url": "https://www.newzimbabwe.com/thuli-phongolo-denies-dating-gold-dealer-scott-sakupwanya/",
            "content": "TimesLive\n\nActress and DJ Thuli Phongolo has come out to refute claims she is dating Zimbabwean businessman Scott Sakupwanya.\n\nThis after controversial celebrity bloggerMusa Khawulaalleged the two were an item.\n\nTaking to her Instagram stories recently, Thuli poured water on the rumours, saying:Let me indulge you for a sec. You guys need to stop trying to link me to people I wouldnt even consider dating. Im not dating Scott Kupa. The end.\n\nThuli Ps Instagram story post. Image:Instagram/ Thuli P\n\nThuli was then rumoured to be dating DJ and producer Master KG when she was often spotted in the comment section of his social media posts.She was later linked to DJ Maphorisa after videos of them holding hands and spending time together circulated on the timeline.\n\nWhile Thuli first shut down the rumours, the truth came to light that they were an item when she opened a case of assault against him.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/02124608/thuli.jpg",
            "description": "<p>TimesLive Actress and DJ Thuli Phongolo has come out to refute claims she is dating Zimbabwean businessman Scott Sakupwanya. This after controversial celebrity blogger Musa Khawula alleged the two were an item. Taking to her Instagram stories recently, Thuli poured water on the rumours, saying: “Let me indulge you for a sec. You guys need to stop</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/thuli-phongolo-denies-dating-gold-dealer-scott-sakupwanya/\">Thuli Phongolo denies dating gold dealer Scott Sakupwanya</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "03 Jun 2025"
        },
        {
            "title": "LATEST: UK shock over sudden death of popular DJ and events promoter",
            "url": "https://www.newzimbabwe.com/latest-uk-shock-over-sudden-death-of-popular-dj-and-events-promoter/",
            "content": "By UK Correspondent\n\nTHE Zimbabwean community in the United Kingdom was left in shock Monday following the sudden death of popular entertainer and events promoter, DJ Kay Cie.\n\nThe DJ, real name Kudzaishe Chipadza, was reportedly found dead at a Birmigham hotel on Monday morning.\n\nChipadza had been one of the leading names in the UK-Zimbabwe showbiz industry since 2008.\n\nHe was recently the MC at the annual SAMA Festival which was held in Leicester.\n\nShowbiz colleagues expressed their sadness with DJ Mel saying, Sad day in the music industry. RIP bro#kaycee\n\nAnother colleague King Alfred said, Just woke up to hear this sad news.We have lost one of us in this music industry Rest in bro till meet again.\n\nMC Sebhelebhe was eqally shocked noting that, We spoke on Sunday mwana wamai vangu and you said mukoma Sebhelebhe get well soon ko now whats this bro. Wabirira game bro. Rest in peaceKay Cie. Number 1 Mc.\n\nMore to follow .\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/02134531/DJ-Kay-Cie.png",
            "description": "<p>By UK Correspondent THE Zimbabwean community in the United Kingdom was left in shock Monday following the sudden death of popular entertainer and events promoter, DJ Kay Cie. The DJ, real name Kudzaishe Chipadza, was reportedly found dead at a Birmigham hotel on Monday morning. Chipadza had been one of the leading names in the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/latest-uk-shock-over-sudden-death-of-popular-dj-and-events-promoter/\">LATEST: UK shock over sudden death of popular DJ and events promoter</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "03 Jun 2025"
        },
        {
            "title": "SPCA says pitbull’s owner neglected his dogs",
            "url": "https://www.newzimbabwe.com/spca-says-pitbulls-owner-neglected-his-dogs/",
            "content": "By Staff Reporter\n\nThe Zimbabwe National Society for the Prevention of Cruelty to Animals (SPCA), has in its initial assessment of the fatal pitbull attack on Samuel Machara, stated that the owner of the dogs showed negligence and poor management of the dangerous breeds he kept at his property, which was enclosed by a half-length perimeter wall.\n\nThe owner of the dogs, Mike Mupinga, was arrested Sunday and charged with culpable homicide.\n\nIn a statement issued after the incident, the SPCA said that Mupingas failure to properly care for and handle his dogs led them to develop aggressive behaviours, making them dangerous.\n\nThe organisation has since removed all the dogs from the property and confirmed that they were euthanised.\n\nInitial assessment indicates clear evidence of neglect, confinement, and poor socialization of the animals involved. Such conditions are known to severely affect canine behaviour and are especially dangerous when present in certain breeds, particularly those already classified as high risk or dangerous, the SPCA said.\n\nThe SPCA further warned the public against crossbreeding dangerous dog breeds, explaining that such animals require specialised handling skills that many owners may lack, potentially leading to tragic outcomes.\n\nWe strongly caution the public against the ownership, breeding, and cross-breeding of dangerous dog breeds. These animals require specialised handling, socialization and containment responsibilities that, if neglected, can result in tragic consequences such as these, the SPCA added.\n\nThe organisation urgedthe public to approach its offices for assistance with appropriate animal care, advice, or if they wish to surrender their animals.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/01174941/pitbull-e1748796599291.jpeg",
            "description": "<p>By Staff Reporter The Zimbabwe National Society for the Prevention of Cruelty to Animals (SPCA), has in its initial assessment of the fatal pitbull attack on Samuel Machara, stated that the owner of the dogs showed negligence and poor management of the dangerous breeds he kept at his property, which was enclosed by a half-length</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/spca-says-pitbulls-owner-neglected-his-dogs/\">SPCA says pitbull’s owner neglected his dogs</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "03 Jun 2025"
        }
    ]
}