{
    "news": [
        {
            "title": "Police launch manhunt for ‘fraudster’ branch manager who vanished with US$35,000",
            "url": "https://www.newzimbabwe.com/police-launch-manhunt-for-fraudster-branch-manager-who-vanished-with-us35000/",
            "content": "By Staff Reporter\n\nA branch manager is wanted by police for fraud after disappearing with more than US$35,000 he received from a cash-in-transit crew for depositing.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed authorities had launched a manhunt for the suspect, Mthulisi Cecil Ronald Moyo aged 23.\n\nThe ZRP is appealing for information which may lead to the arrest of Mthulisi Cecil Ronald Moyo (23) who is being sought in connection with a case of fraud.\n\nThe suspect was employed as a branch manager at a wholesaler in Victoria Falls. On October 22, 2024 he reported for duty at the shop and allegedly received US$ 35 390 from a cash-in-transit crew, which he was supposed to deposit into the wholesalers bank account.\n\nHowever, the suspect took the money and fled to an unknown destination, said Nyathi.\n\nZRP is appealing to anyone with information to contact the National Complaints Desk on (0242) 703631 or WhatsApp on 0712 800197 or report at any nearest police station.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/30121623/WhatsApp-Image-2024-12-30-at-13.40.16.jpeg",
            "description": "<p>By Staff Reporter A branch manager is wanted by police for fraud after disappearing with more than US$35,000 he received from a cash-in-transit crew for depositing. Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed authorities had launched a manhunt for the suspect, Mthulisi Cecil Ronald Moyo aged 23. “The ZRP is appealing for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/police-launch-manhunt-for-fraudster-branch-manager-who-vanished-with-us35000/\">Police launch manhunt for ‘fraudster’ branch manager who vanished with US$35,000</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "30 Dec 2024"
        },
        {
            "title": "Sean ‘Diddy’ Combs ‘had meltdown in prison over Christmas’",
            "url": "https://www.newzimbabwe.com/sean-diddy-combs-had-meltdown-in-prison-over-christmas/",
            "content": "IOL\n\nSean Diddy Combsis said to have had a meltdown in prison over Christmas.\n\nThe rapper and music mogul, 55, has been locked up at the notoriously tough Metropolitan Detention Center in Brooklyn, New York, since September and is awaiting trial in 2025 on charges including sex trafficking and racketeering  all of which he strongly denies.\n\nA source has now told The Sun he had to be taken for observation over the festive period as he allegedly couldnt believe he was still behind bars for Christmas.\n\nThe insider said: With his high-powered legal teamDiddythought hed be out on bail by now.\n\nSpending the holidays behind bars was a nightmare for him. He eventually managed to calm himself down with the meditation technique hes been using while hes been behind bars.\n\nIt took him a few hours of deep breathing and focusing to get out of the bad space he was in, but he finally managed it.\n\nAnother source close to the disgraced rapper denied the claims he suffered a meltdown.\n\nThey told the Daily Mail the rapper is continuing to stay strong in prison.\n\nThe reports come after a legal expert said Combs bleak Christmas behind bars was a reminder of the seriousness of the allegations against him.\n\nJames Pipe, from freegrantsforfelons.org, told the Daily Star: The stark contrast between Diddys past life of indulgence and his current circumstances highlights the profound consequences of legal and personal accountability.\n\nWhile the festive season might offer moments of muted cheer for some inmates, for Combs, it serves as a reminder of the seriousness of the allegations against him and the impact of his actions on others.\n\nIts been widely reported Combs and his fellow inmates ate a Christmas Day meal of baked Cornish hen, macaroni and cheese, cranberry sauce and dinner rolls, followed by a holiday dessert.\n\nMr Pipe added inmates might get a hot chocolate or a pastry if the facilitys budget allows.\n\nHe said the jail runs a no frills and no luxury regime.\n\nThe comments on Combs grim Christmas come after it was reported he has lost a huge amount of weight behind bars, according to a journalist who attended his last court proceeding.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/26080331/240325-Sean-Diddy-Combs-ew-436p-35b014.webp",
            "description": "<p>IOL Sean ‘Diddy’ Combs is said to have had a “meltdown” in prison over Christmas. The rapper and music mogul, 55, has been locked up at the notoriously tough Metropolitan Detention Center in Brooklyn, New York, since September and is awaiting trial in 2025 on charges including sex trafficking and racketeering – all of which he</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sean-diddy-combs-had-meltdown-in-prison-over-christmas/\">Sean ‘Diddy’ Combs ‘had meltdown in prison over Christmas’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "30 Dec 2024"
        },
        {
            "title": "Jeju Air shares plummet to record low after deadly plane crash",
            "url": "https://www.newzimbabwe.com/jeju-air-shares-plummet-to-record-low-after-deadly-plane-crash/",
            "content": "Reuters\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/29061022/241229-jeju-air-crash-cc-1214a-f75953.webp",
            "description": "<p>Reuters Shares of South Korean budget carrier Jeju Air (089590.KS), hit their lowest on record on Monday, after the deadliest air crash in the country killed 179 people. Jeju Air shares traded down 8.5% as of 0312 GMT, after falling as much as 15.7% earlier in the session to 6,920 won, the lowest since they were listed in 2015.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/jeju-air-shares-plummet-to-record-low-after-deadly-plane-crash/\">Jeju Air shares plummet to record low after deadly plane crash</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "30 Dec 2024"
        },
        {
            "title": "Govt pats itself on the back for effective response to ‘worst drought since Independence’",
            "url": "https://www.newzimbabwe.com/govt-pats-itself-on-the-back-for-effective-response-to-worst-drought-since-independence/",
            "content": "By Thandiwe Garusa\n\nThe government had an effective response to the ongoing devastating El Nino-induced drought, Zimbabwes worst in four decades, Agriculture Minister Anxious Masuka has said.\n\nSpeaking during the National Thanksgiving and Dedication Service in Bulawayo Sunday, Masuka said there were no queues or rising food prices as had been experienced in other drought years.\n\nThe El Nino drought has been the worst in 43 years since 1980. Wecould go and queue for groceries without even knowing what was being sold there.\n\nThis has been the worst drought since independence and this is the most normal drought, no queues, no escalation in food prices, mealie meal is available and this does not just happen.\n\nThis is leadership and that is the leadership of President Emmerson Mnangagwa. Just to put that into context, the President is currently directly feeding 12.47 million people, 83% of Zimbabweans are dependent directly on what the President is doing, he said.\n\nHowever, food prices have been rising since the introduction of a new currency, the Zimbabwe Gold (ZiG) in April this year. The currency has devalued, now trading at $1:ZWG40 to 60 on the black market.\n\nMost rural areas in Zimbabwe have been experiencing severe hunger and relying on food aid from humanitarian organizations such as the World Food Program, USAID, and Care International.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/01030702/Anxious-Masuka.png",
            "description": "<p>By Thandiwe Garusa The government had an effective response to the ongoing devastating El Nino-induced drought, Zimbabwe’s worst in four decades, Agriculture Minister Anxious Masuka has said. Speaking during the National Thanksgiving and Dedication Service in Bulawayo Sunday, Masuka said there were no queues or rising food prices as had been experienced in other drought</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-pats-itself-on-the-back-for-effective-response-to-worst-drought-since-independence/\">Govt pats itself on the back for effective response to ‘worst drought since Independence’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "30 Dec 2024"
        },
        {
            "title": "Jimmy Carter, former US president, dies aged 100",
            "url": "https://www.newzimbabwe.com/jimmy-carter-former-us-president-dies-aged-100/",
            "content": "BBC\n\nFormer US President Jimmy Carter has died aged 100, the centre he founded has confirmed.\n\nThe former peanut farmer lived longer than any president in history and celebrated his 100th birthday in October.\n\nThe Carter Center, which advocates for democracy and human rights around the world, said he died on Sunday afternoon at his home in Plains, Georgia.\n\nThe Democrat served as president from 1977 to 1981, a period beset by economic and diplomatic crises.\n\nAfter leaving the White House with low approval ratings, his reputation was restored through humanitarian work which earned him the Nobel Peace Prize.\n\nMy father was a hero, not only to me but to everyone who believes in peace, human rights, and unselfish love, his son, Chip Carter, said in a statement.\n\nThe world is our family because of the way he brought people together, and we thank you for honouring his memory by continuing to live these shared beliefs.\n\nCarter  who prior to becoming president was governor of Georgia, a lieutenant in the US navy and a farmer  is survived by his four children, 11 grandchildren and 14 great-grandchildren.\n\nHis wife, Rosalynn, who he was married to for 77 years, died in November 2023.\n\nSince 2018 and the death of George HW Bush, he was the oldest surviving US president.\n\nCarter stopped medical treatment for an undisclosed illness last year and instead began receiving hospice care at his home.\n\nPresident Joe Biden and First Lady Jill Biden said the world had lost an extraordinary leader, statesman and humanitarian.\n\nDescribing him as a dear friend and a man of principle, faith and humility, they added: He showed that we are a great nation because we are a good people  decent and honorable, courageous and compassionate, humble and strong.\n\nThe challenges Jimmy faced as president came at a pivotal time for our country and he did everything in his power to improve the lives of all Americans, President-elect Donald Trump wrote on social media.\n\nFor that, we all owe him a debt of gratitude.\n\nCarters presidency will be remembered for his struggles in dealing with acute economic problems and several foreign policy challenges, including the Iran hostage crisis, which ended with the deaths of eight Americans.\n\nThere was, however, a notable foreign policy triumph in the Middle East when he helped broker an accord between Egypt and Israel, signed at Camp David in the US in 1978.\n\nBut that seemed a distant memory two years later, when voters overwhelmingly chose Republican Ronald Reagan, who had portrayed the president as a weak leader unable to deal with inflation and interest rates at near record highs.\n\nCarter lost the 1980 election by a landslide, winning only six US states plus Washington DC.\n\nIn the aftermath of such a heavy defeat, Carter was frequently held up by Republicans as an example of liberal ineptitude.\n\nMeanwhile, many in his own party either ignored him or viewed his presidential shortcomings as evidence their brand of Democratic politics or policy was a better way.\n\nToday many on the right still deride the Carter years but as the decades passed, his humanitarian efforts and simple lifestyle began to shape a new legacy for many Americans.\n\nAfter leaving the White House, he became the first and only president to return full-time to the house he lived in before politics  a humble, two-bedroom ranch-style home.\n\nHe chose not to pursue the lucrative after-dinner speeches and publishing deals awaiting most former presidents,telling the Washington Post in 2018that he never really wanted to be rich.\n\nInstead, he spent his remaining years trying to address global problems of inequality and disease.\n\nHe also teamed up with Nelson Mandela to found The Elders, a group of global leaders who committed themselves to work on peace and human rights.\n\nIn accepting his Nobel prize in 2002  only the third US president to receive it  he said: The most serious and universal problem is the growing chasm between the richest and the poorest people on Earth.\n\nIn a statement, former President Bill Clinton and wife Hillary Clinton said he worked tirelessly for a better, fairer world, noting his humanitarian, environmental and diplomatic efforts.\n\nGuided by faith, President Carter lived to serve others  until the very end, they added.\n\nFormer President Barack Obama paid tribute to Carters decency and said he taught all of us what it means to live a life of grace, dignity, justice, and service.\n\nRepublican former President George W Bush, meanwhile, said Carter dignified the office and that his efforts to leave behind a better world didnt end with the presidency.\n\nPresident Biden said a state funeral would be held in Washington DC.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/30042552/jimmy-carter-scaled.jpg",
            "description": "<p>BBC Former US President Jimmy Carter has died aged 100, the centre he founded has confirmed. The former peanut farmer lived longer than any president in history and celebrated his 100th birthday in October. The Carter Center, which advocates for democracy and human rights around the world, said he died on Sunday afternoon at his</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/jimmy-carter-former-us-president-dies-aged-100/\">Jimmy Carter, former US president, dies aged 100</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "30 Dec 2024"
        },
        {
            "title": "South Africa’s Zille blasts Zimbabwe’s post-independence failures – argues colonialism was not ‘entirely negative’",
            "url": "https://www.newzimbabwe.com/south-africas-zille-blasts-zimbabwes-post-independence-failures-argues-colonialism-was-not-entirely-negative/",
            "content": "By Staff Reporter\n\nSOUTH African politician Helen Zille says Zimbabwes failure to maintain colonial infrastructure and gains has hindered the countrys development in the post-colonial era.\n\nSince gaining independence in 1980, Zimbabwe has experienced economic decline, shifting from the breadbasket of Africa to an impoverished state.\n\nThis decline has been attributed to several factors, including the fast-tracked land reform program at the turn of the millennium.\n\nDemocratic Alliance (DA) federal chairperson Helen Zille says Zimbabwes weakness has been its failure to maintain the colonial inheritance, which has led to its regression.\n\nThe legacy of colonialism is not entirely negative. Of course, that means a lot of it was negative. But lets keep the things that werent. Formal education is a legacy. Hospitals are a legacy. Electricity generation is a legacy. Hot water is a legacy. Shall we get rid of all of that in the name of decolonization?\n\nUniversities are a legacy. Are we going to get rid of the universities? Science  are we going to get rid of science? No. And one thing I learned in Singapore is that they have become an unbelievable country.\n\nI mean, Zimbabwe started its independence in a much stronger position than Singapore. Yeah, at about the same time. Look at Zimbabwe now. Look at Singapore.\n\nWhat is the difference? And I went there and looked very hard to see why Zimbabwe had gone back to trading with cattle and goats, swapping things in a barter system for other goods, said Zille.\n\nZimbabwe has endured economic hardships, with bouts of inflation and the failure of its local currency, which has characterized its malaise.\n\nThe government has blamed the economic decline on sanctions imposed by the United States.\n\nZille said Zimbabwe failed to replicate Singapore alsoa former British colony.\n\nSo, what did they get right in Singapore? A lot of things. One of the things they got right is that they didnt tear down everything they inherited from the British.\n\nThey took those institutions and built them up into some of the best in the world. Thats what I was saying  take what you inherit from the past, even if a lot of the past was bad, she said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/05055622/HELEN-ZILLE.jpeg",
            "description": "<p>By Staff Reporter SOUTH African politician Helen Zille says Zimbabwe’s failure to maintain colonial infrastructure and gains has hindered the country’s development in the post-colonial era. Since gaining independence in 1980, Zimbabwe has experienced economic decline, shifting from the “breadbasket of Africa” to an impoverished state. This decline has been attributed to several factors, including</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africas-zille-blasts-zimbabwes-post-independence-failures-argues-colonialism-was-not-entirely-negative/\">South Africa’s Zille blasts Zimbabwe’s post-independence failures – argues colonialism was not ‘entirely negative’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "30 Dec 2024"
        },
        {
            "title": "Church jumps on ‘ED2030’ bandwagon as cleric Wutawunashe likens Mnangagwa to Old Testament’s Joshua",
            "url": "https://www.newzimbabwe.com/church-jumps-on-ed2030-bandwagon-as-cleric-wutawunashe-likens-mnangagwa-to-old-testaments-joshua/",
            "content": "By Staff Reporter\n\nPOPULAR cleric Andrew Wutawunashe has sensationally claimed President Emmerson Mnangagwa is steering the country in the right trajectory despite glaring economic stagnation.\n\nWutawunashe said this in Bulawayo, on Sunday, where he led a National Thanksgiving event which was graced by President Mnangagwa.\n\nEquating Mnangagwa with biblical figures, the cleric said the country is witnessing economic gains.\n\nZimbabwe is moving forward and great work is being done and the servant we were given gave us the vision 2030 in the same spirit as that of Joshua and Caleb, said Wutawunashe.\n\nZimbabwe is witnessing economic challenges which have been exacerbated by the drought which was caused by the El Nino weather phenomena. This has left the majority of citizens starving and languishing in poverty.\n\nThe government is also struggling to find solutions to the ailing economy with the new local currency introduced in April this year on a downward spiral.\n\nWutawunashe blasted dissenting voices that have been vocal on the countrys economic path.\n\nHe added, People who speak badly on social media about Zimbabwe saying the country is struggling and there is hunger are not qualified. They know nothing.\n\nProgrammes such as pfumvudza bringing great harvests. Dams, and roads point to a country that is being uplifted. The church believes the country has a bright future .\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/30044557/wutawunashe.jpg",
            "description": "<p>By Staff Reporter POPULAR cleric Andrew Wutawunashe has sensationally claimed President Emmerson Mnangagwa is steering the country in the right trajectory despite glaring economic stagnation. Wutawunashe said this in Bulawayo, on Sunday, where he led a National Thanksgiving event which was graced by President Mnangagwa. Equating Mnangagwa with biblical figures, the cleric said the country</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/church-jumps-on-ed2030-bandwagon-as-cleric-wutawunashe-likens-mnangagwa-to-old-testaments-joshua/\">Church jumps on ‘ED2030’ bandwagon as cleric Wutawunashe likens Mnangagwa to Old Testament’s Joshua</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "30 Dec 2024"
        },
        {
            "title": "Rain curtails play as Bulawayo test heads for draw",
            "url": "https://www.newzimbabwe.com/rain-curtails-play-as-bulawayo-test-heads-for-draw/",
            "content": "Rain curtailed play on the fourth day as the first test between Zimbabwe and Afghanistan looked headed for a draw at the Queens Sports Club.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/30045751/cricket.jpg",
            "description": "<p>Reuters Rain curtailed play on the fourth day as the first test between Zimbabwe and Afghanistan looked headed for a draw at the Queens Sports Club. Afghanistan were 515-3 in reply to their hosts 586 when Sunday’s play was halted, having added 90 runs to their overnight score of 425-2 but seeing Rahmat Shah dismissed</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rain-curtails-play-as-bulawayo-test-heads-for-draw/\">Rain curtails play as Bulawayo test heads for draw</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "30 Dec 2024"
        },
        {
            "title": "Pastor in court for raping in-law on several occasions",
            "url": "https://www.newzimbabwe.com/pastor-in-court-for-raping-in-law-on-several-occasions/",
            "content": "By Staff Reporter\n\nPROMINENT Chinhoyi cleric, Lloyd Kanyangarika Karuru has been arraigned before a local magistrate for allegedly raping, on several occasions, one of his in-laws.\n\nThe 40-year-old is the founding bishop of Followers of Christ Church International, Chinhoyi.\n\nHe appeared at Chinhoyi Magistrates Court this Friday having spent two nights behind bars following his arrest on Christmas Day.\n\nProsecutor Mutsai Mollen Chitsiga argued there was reasonable suspicion the pastor committed the offence and State wanted the complainant to undergo further medical examinations, hence the matter had to be postponed.\n\nDefence counsel, Joshua Mangeyi consented to bail pending trial stating that Karuru is a deserving candidate for bail being of a fixed abode, and had no motive to abscond as he was cooperating with authorities having voluntarily surrendered himself to police.\n\nThe defence lawyer also argued that no one knew the medical status of complainant hence it was unfair to speculate accused persons guilt. Mangeyi also put it that the complainant and accused do not reside at the same residence and prayed for court to grant him US$50 bail, among other reporting conditions.\n\nState did not oppose bail, but proposed a review of the quantum of bail to US$100. The prosecution also averred that stringent bail conditions were only necessary if there were fears an accused person might abscond or interfere with State witnesses.\n\nRegional Magistrate Ignatius Mugova remanded accused person on free bail to January 10, 2025 for routine remand. The ruling sparked frenzied celebrations among the sizeable crowd of Karurus followers, who packed the courtroom in solidarity with the cleric.\n\nCircumstances are that sometime in 2019 complainant was staying at the Staff Quarters section of Chikonohono with the pastors family.\n\nIt is alleged that accused person and complainant would play games on a mobile phone and the former took advantage to fondle and have sexual intercourse with the girl without her consent.\n\nCourt further heard accused person threatened complainant with unspecified action if she disclosed the rape encounters to anyone as this would ruin his marriage and career.\n\nThe sexual violations are said to have continued from 2019 up to September 2024 when the matter came to light.\n\nThe victim was referred to Chinhoyi Provincial Hospital for medical examination and an affidavit can be produced in court as an exhibit.\n\nThe state submitted that the accused person acted unlawfully.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/29070725/WhatsApp-Image-2024-12-28-at-05.54.09.jpeg",
            "description": "<p>By Staff Reporter PROMINENT Chinhoyi cleric, Lloyd Kanyangarika Karuru has been arraigned before a local magistrate for allegedly raping, on several occasions, one of his in-laws. The 40-year-old is the founding bishop of Followers of Christ Church International, Chinhoyi. He appeared at Chinhoyi Magistrates’ Court this Friday having spent two nights behind bars following his</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pastor-in-court-for-raping-in-law-on-several-occasions/\">Pastor in court for raping in-law on several occasions </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "30 Dec 2024"
        },
        {
            "title": "Govt hails Prospect Lithium Zimbabwe community activities",
            "url": "https://www.newzimbabwe.com/govt-hails-prospect-lithium-zimbabwe-community-activities/",
            "content": "By Alois Vinga\n\nTHE government has saluted Prospect Lithium Zimbabwe (PLZ) for unveiling a series of community projects on the back of calls for deeper engagement with local leaders in charting the development agenda.\n\nPLZ recently tabled a US$1,3 million community projects initiative targeting youth, women and infrastructure development.\n\nTheprojects dubbed,Goromonzi Community Development Project, Launch Ceremony and Public Welfare Experience Daywere launched at a function held recently at Vhuta Primary School in Goromonzi, Zimbabwe.\n\nMinister of State for Mashonaland East Provincial Affairs and Devolution, Dr Apollonia Munzverengwi hailed the company for completing the governments development efforts.\n\nThese community projects initiated by PLZ are designed to uplift and empower our communities and will go a long way in ensuring that there is continuous and sustainable development in Goromonzi district.\n\nThe initiative by Prospect Lithium Zimbabwe resonates well with the desired corporate social responsibility, as we seek to contribute immensely towards the Governments commitment to creating a better life for all. As we traverse in our Presidents mantra ofleaving no one and no place behind she said.\n\nThe top government official said the slated projects by PLZ were aimed at addressing some of the most pressing challenges facing our communities in the Goromonzi district such as the community health project, the vocational training project, the womens empowerment project and energy equity project.\n\nMunzverengwi said these initiatives will help create jobs, and stimulate local economies in the pursuit to improve the provincial GDP and will go a long way in improving the livelihood of our general populace in the district, the province and the nation at large.\n\nI am also delighted that PLZ found it prudent and sensible to also give hampers to eighty-four elderly-headed households from the villages surrounding the PLZ plant. This complimentary gesture is plausible, giving Christmas to the befitting vulnerable elderly beneficiaries.\n\nThe hampers for the elderly are essential in ensuring that our seniors receive the nourishment they need to maintain a healthy well-being. Many elderly individuals experience loneliness and isolation and through programs like food hampers distribution there is a sense of community and social connection, she added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/12/22104808/Prospect-Lithium.jpeg",
            "description": "<p>By Alois Vinga THE government has saluted Prospect Lithium Zimbabwe (PLZ) for unveiling a series of community projects on the back of calls for deeper engagement with local leaders in charting the development agenda. PLZ recently tabled a US$1,3 million community projects initiative targeting youth, women and infrastructure development. The projects dubbed, Goromonzi Community Development Project, Launch</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-hails-prospect-lithium-zimbabwe-community-activities/\">Govt hails Prospect Lithium Zimbabwe community activities</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "30 Dec 2024"
        }
    ]
}