{
    "news": [
        {
            "title": "Venezuela plans new embassy in Zimbabwe,  snubs Norway and Australia",
            "url": "https://www.newzimbabwe.com/venezuela-plans-new-embassy-in-zimbabwe-snubs-norway-and-australia/",
            "content": "Business Live\n\nVenezuelas government said on Monday it will close its embassies in Norway and Australia and open new ones in Zimbabwe and Burkina Faso as part of a restructuring of its foreign service, after weeks of growing tensions with the US.\n\nThe closures are part of the strategic re-assignation of resources, President Nicolas Maduros government said in a statement, adding that consular services to Venezuelans in Norway and Australia would be provided by diplomatic missions, with details to be shared in coming days.\n\nCaracas said it was setting up new embassies in two sister nations, strategic allies in the anti-colonial fight and in the resistance against hegemonic pressures.\n\nIt added that these new embassies would serve to launch joint projects involving agriculture, energy, education, mining and other common interests. The announcement occurred just days after the Nobel Committee in Oslo announced that Venezuelan opposition leaderMaria Corina Machadohad won the 2025 Nobel Peace Prize for fighting dictatorship in the South American country.\n\nThe embassy closures with the two US allies also followed weeks of escalating tensions between Caracas and Washington.\n\nVenezuela has called on the UN for support over several deadly US military strikes on vessels off its Caribbean coast, which Washington alleges were carrying drugs.\n\nSome US allies on the UN Security Council called for de-escalation and dialogue.\n\nVenezuela has said it is in a situation where it is rational to expect an armed attack against the country in the short term, and Maduro has alleged the US is seeking a change in government.\n\nWashington has not responded to this accusation but has called Venezuelas socialist leader the illegitimate head of a narco-state. The US has also announced a new counter-narcotics task force in its Southern Command, a military branch that oversees Latin America.\n\nThe governments of Zimbabwe and Burkina Faso are more aligned with that of Russia, which has supported Venezuela at the UN and accused the US of acting according to the cowboy principle of shoot first.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/14054735/venezuela-president.jpg",
            "description": "<p>Business Live Venezuela’s government said on Monday it will close its embassies in Norway and Australia and open new ones in Zimbabwe and Burkina Faso as part of a restructuring of its foreign service, after weeks of growing tensions with the US. The closures are part of the “strategic re-assignation of resources”, President Nicolas Maduro’s</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/venezuela-plans-new-embassy-in-zimbabwe-snubs-norway-and-australia/\">Venezuela plans new embassy in Zimbabwe,  snubs Norway and Australia</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "14 Oct 2025"
        },
        {
            "title": "“2017 taught us a big lesson” – Chamisa rejects calls to join Geza’s planned protests",
            "url": "https://www.newzimbabwe.com/2017-taught-us-a-big-lesson-chamisa-rejects-calls-to-join-gezas-planned-protests/",
            "content": "By Staff Reporter\n\nFormer Citizens Coalition for Change (CCC) leader Nelson Chamisa said he will not participate in the 17 October planned protests against President Emmerson Mnangagwas government.\n\nThis decision, he explains, stems from the oppositions experience with the November 2017 military takeover. He says their involvement then served as a salutary lesson, teaching them not to become entangled in Zanu-PFs internal factional and succession battles.\n\nThis follows a call from ousted Zanu-PF Central Committee member Blessed Runesu Geza for a one-million-man march on Friday, aimed at protesting against Mnangagwa and his alleged corrupt cartel. Gezas accusations target a number of high-profile figures, including controversial business tycoons such as Wicknell Chivayo, Geo Pomona CEO Delish Nguwaya, Paul Tungwarara, and Kudakwashe Tagwirei.\n\nHowever, analysts suggest that the planned protest goes beyond mere accusations of corruption but points to a deeper succession war playing out between Mnangagwas faction and his deputy, Rtd General Constantino Chiwenga.\n\nChiwenga is the favourite to take over from Mnangagwa, with many believing he has been patiently waiting for his turn. Yet, his path is reportedly being obstructed by Mnangagwa loyalists, who are now calling for the incumbent to extend his term of office beyond the constitutional limit of two terms.\n\nThis echoes the experience of the opposition previously, the Movement for Democratic Change (MDC), as it was then known, which took to the streets in a protest that ousted former President Robert Mugabe from power, anticipating a role in a new government.\n\nThat hope proved to be short-lived. The MDC felt betrayed and used, having been abandoned by Zanu-PF and Mnangagwa himself shortly after Mugabes departure.\n\nResponding directly to calls for him and his supporters to join Fridays protests in Harare, Chamisa wrote, 2017 taught us a big lesson!.\n\nHe added that the root cause of the countrys problems lies in disputed elections, maintaining that until this issue is addressed, Zimbabwe will remain trapped in its socioeconomic and political challenges.\n\nIgnoring the 2023 stolen election is ignoring the root of our crisis. Anything that does not address the 2023 stolen election is a fraud and a waste of time. Corruption, capture, suffering  theyre symptoms of a disputed mandate and a contested government. Lets treat the cause, not the symptoms, Chamisa wrote on his X account Monday.\n\nChamisa still commands a considerable following among opposition supporters despite his resignation from the CCC in January 2024, which left the opposition in further disarray.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/08/28082345/chamisa_.jpg",
            "description": "<p>By Staff Reporter Former Citizens Coalition for Change (CCC) leader Nelson Chamisa said he will not participate in the 17 October planned protests against President Emmerson Mnangagwa’s government. This decision, he explains, stems from the opposition’s experience with the November 2017 military takeover. He says their involvement then served as a salutary lesson, teaching them</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/2017-taught-us-a-big-lesson-chamisa-rejects-calls-to-join-gezas-planned-protests/\">“2017 taught us a big lesson” – Chamisa rejects calls to join Geza’s planned protests</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "14 Oct 2025"
        },
        {
            "title": "Oscar Mbo’s eyes Grammy Award glory with ‘Vuka’",
            "url": "https://www.newzimbabwe.com/oscar-mbos-eyes-grammy-award-glory-with-vuka/",
            "content": "IOL\n\nSouth Africas beloved Amapiano star, Oscar Mbongeni Ndlovu, popularly known asOscar Mbo, is making headlines once again, but this time for more than just his iconic style.\n\nKnown for his smooth blend of deep house, deep tech, Nu Jazz, broken beat, and lounge music, the DJ, producer, and podcaster has officially submitted his track Vuka featuring Jazzworld and ThukutOscar Mbo: Amapiano Stars Journey from Fashion Icon to Grammy Recognition held for Grammy Award consideration under the Best African Music Performance category.\n\nCould this be the breakthrough moment his music career has been waiting for?\n\nAlthough he hasnt collected many traditional music accolades, his impact in both music and fashion is undeniable.\n\nIn 2024, he won Best Styled Artist at the Metro FM Awards and Best Dressed Celebrity at the GQ Best Dressed Awards ceremony. With so much focus on his fashion, its easy to wonder: Is he a music artist or a fashion icon?\n\nBut his artistry and influence suggest hes more than capable of balancing both worlds  and now, with Vuka up for Grammy consideration, the spotlight may finally shift toward his musical achievements.\n\nFor being on the list of the artists considered, Oscar responded, Thank you to everyone who keeps on streaming the music, attending shows, and getting merch, youre appreciated.\n\nOscars journey into music wasnt part of the original plan. After matriculating, his parents offered him a choice: a new car or R100,000 in cash. He chose the money and used it to invest in DJ equipment. With his entrepreneurial parents full support  and encouragement to pursue formal education  he began his career, carefully tracking every cent spent. Their belief in his vision laid the foundation for his success, and he remains deeply grateful for it.\n\nBeyond the decks and designer fits, Oscar is also a devoted family man. In a recent podcast, he opened up about his love for his family and his role as a father.\n\nI just want to keep inspiring the youth, guiding them, and helping them avoid the mistakes we made, he shared, looking forward to the next chapter of his journey.\n\nOscar Mbo is also the founder and lead voice behind The Ashmed Hour, a popular entertainment podcast that blends music and thoughtful conversation  showcasing not only his talent but his depth as a creative.\n\nNow, with Vuka being considered for a Grammy,Oscar Mbostands at the edge of a new era. Whether or not he clinches the nomination, one thing is clear: hes more than just a sharply dressed entertainer  hes an art.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/14051506/oscar-mbo.jpg",
            "description": "<p>IOL South Africa’s beloved Amapiano star, Oscar Mbongeni Ndlovu, popularly known as Oscar Mbo, is making headlines once again, but this time for more than just his iconic style. Known for his smooth blend of deep house, deep tech, Nu Jazz, broken beat, and lounge music, the DJ, producer, and podcaster has officially submitted his track</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/oscar-mbos-eyes-grammy-award-glory-with-vuka/\">Oscar Mbo’s eyes Grammy Award glory with ‘Vuka’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "14 Oct 2025"
        },
        {
            "title": "Kavango Resources mobilises additional funds in the UK and Zimbabwe",
            "url": "https://www.newzimbabwe.com/kavango-resources-mobilises-additional-funds-in-the-uk-and-zimbabwe/",
            "content": "By Alois Vinga\n\nKavango Resources plc (LSE: KAV, VFEX: KAV.VX), a Southern Africa-focused metals exploration and gold production company, has successfully raised additional capital following its recent 2.2 million UK placing and US$4.5 million VFEX subscription.\n\nThe company has secured a further 150,000 in the UK and US$129,035.24 in Zimbabwe, responding to continued investor demand for its shares.\n\nIn total, 24,557,448 new ordinary shares have been issued, comprising 15,000,000 shares at 0.01 each in the UK and 9,557,448 shares at the equivalent price in Zimbabwe.\n\nKavango said the additional fundraising strengthens its market position and supports its strategic goal of expanding its footprint in Southern Africa.\n\nThe new UK shares will be admitted to the Equity Shares (Transition) segment of the Financial Conduct Authoritys (FCA) Official List and traded on the London Stock Exchange (LSE). Similarly, the VFEX shares will first be listed on the LSE before being transferred to a branch register in Zimbabwe, where they will be listed and traded on the Victoria Falls Stock Exchange.\n\nBoth the UK and VFEX share admissions are expected to take effect, with trading commencing at 8:00 a.m. on or around 16 October 2025.\n\nProceeds from the fundraising will be used to strengthen the companys working capital and fund ongoing exploration and mine development activities across Southern Africa. This follows the firms earlier announcement on 10 September 2025, where it outlined plans to use raised capital to drive its growth and operational objectives.\n\nKavango Resources plc focuses on the exploration and development of metals in Southern Africa, with particular emphasis on copper, nickel, and gold projects. The company aims to unlock long-term value through exploration, resource development, and eventual production.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/06/27102047/Kavango-Resources.webp",
            "description": "<p>By Alois Vinga Kavango Resources plc (LSE: KAV, VFEX: KAV.VX), a Southern Africa-focused metals exploration and gold production company, has successfully raised additional capital following its recent £2.2 million UK placing and US$4.5 million VFEX subscription. The company has secured a further £150,000 in the UK and US$129,035.24 in Zimbabwe, responding to continued investor demand</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kavango-resources-mobilises-additional-funds-in-the-uk-and-zimbabwe/\">Kavango Resources mobilises additional funds in the UK and Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "14 Oct 2025"
        },
        {
            "title": "‘We are sorry guys’ says DNC bus company after 42 passengers killed in Limpopo crash",
            "url": "https://www.newzimbabwe.com/we-are-sorry-guys-says-dnc-bus-company-after-42-passengers-killed-in-limpopo-crash/",
            "content": "IOL\n\nThe DNC bus company has expressed condolences to families and relatives of the 42 people who lost their lives on Sunday when a bus crashed near Makhado (formerly Louis Trichardt), Limpopo.\n\nEarlier,IOL reported that President Cyril Ramaphosa expressed his deep condolences to the nations of Zimbabwe and Malawiafter the horrific bus crash that claimed 42 lives.\n\nThe passengers, mostly Zimbabwean and Malawian nationals, were travelling from Gqeberha (Port Elizabeth) in the Eastern Cape to their home countries when the bus veered off a mountainous section of the N1 and plunged down an embankment.\n\nDozens more were injured and rushed to nearby hospitals for treatment.\n\nA manager from DNC Coaches in Gqeberha toldbroadcaster Newzroom Afrikathat the passengers included children and old women.\n\nYeah, it is so sad for such event and its a national disaster. We were not expecting it, you know. There were about children, magogos (old women), you know, Dennis Jakopo spoke to the television news channel.\n\nHe said the ill-fated bus left the rank in Gqeberha on Saturday at around 3 pm, embarking on the 2,100-kilometer journey to Harare. In Harare, the Malawian passengers were scheduled to be transferred to another DNC bus, according to Jakopo.\n\nIts so sad to receive such news. We are sorry guys to all the families who lost their relatives, yeah, we are very sorry, he said.\n\nOther representatives of the company were, on Monday morning, said to be travelling to the crash scene, even though the horrific crash happened on Sunday afternoon.\n\nIm sure in an hour or two hours they will be there with enough information and here at the office we are also trying to get in touch with the next of kin, Jakopo said.\n\nHe said the Harare-bound 61-seater bus was carrying two drivers and one host.\n\nIn his condolences message, President Ramaphosa said the tragedy was compounded by the fact that it occurred during Transport Month, a time when South Africa highlights the importance of road safety.\n\nThis incident is a tragedy for South Africa and our sister states of Zimbabwe and Malawi alike. Our roads are economic networks that bring the people of our region together across our national borders.\n\nWe must do everything we can as road users, as transport operators, drivers and passengers to ensure that we stay safe and that we share our roads responsibly and with care for one another, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/13122907/DNC-Bus.png",
            "description": "<p>IOL The DNC bus company has expressed condolences to families and relatives of the 42 people who lost their lives on Sunday when a bus crashed near Makhado (formerly Louis Trichardt), Limpopo. Earlier, IOL reported that President Cyril Ramaphosa expressed his deep condolences to the nations of Zimbabwe and Malawi after the horrific bus crash that claimed</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/we-are-sorry-guys-says-dnc-bus-company-after-42-passengers-killed-in-limpopo-crash/\">‘We are sorry guys’ says DNC bus company after 42 passengers killed in Limpopo crash</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "14 Oct 2025"
        },
        {
            "title": "Doctor loses bid to overturn professional ban for refusing to authorise blood transfusion on religious grounds",
            "url": "https://www.newzimbabwe.com/doctor-loses-bid-to-overturn-professional-ban-for-refusing-to-authorise-blood-transfusion-on-religious-grounds/",
            "content": "By Mary Taruvinga\n\nA Harare doctor who believes that blood is sacred and must not be transfused has failed in his bid to overturn a professional ban restricting his medical practice after the High Court ruled that his constitutional challenge was filed prematurely.\n\nDr Seleman Saidi, who was disciplined for refusing to administer blood transfusions on religious grounds, had approached the High Court arguing that his faith-based stance should not cost him his practising licence.\n\nHowever, Justice Samuel Deme dismissed his constitutional application, ruling that he should have first pursued the appeal process provided under the Health Professions Act.\n\nThe judge said the doctor was required to exhaust the internal appeal procedures before seeking constitutional redress.\n\nThe present application was prematurely instituted before exhausting other legal remedies, the judge said before striking the application off the roll.\n\nDr Saidi, a registered medical practitioner, was found guilty of unprofessional conduct by the Medical and Dental Practitioners Council and the Health Professions Authority after he refused to perform or authorise blood transfusions for patients, citing his religious convictions.\n\nFollowing the disciplinary hearing, his medical practice was restricted to public health, forensic pathology, and histopathology, areas that do not involve blood transfusions.\n\nThrough his lawyer, Professor Lovemore Madhuku, Saidi argued that his beliefs about the sanctity of blood were protected by the Constitution, particularly the rights to freedom of conscience (Section 60) and freedom to choose and carry on a profession (Section 64).\n\nThe applicant maintains his belief that blood is sacred and therefore he would not order or administer blood transfusions, Madhuku argued, insisting his clients stance should not cost him his licence.\n\nSaidi filed the case against the Medical and Dental Practitioners Council, the Health Professions Authority of Zimbabwe, and the Minister of Health and Child Care.\n\nAdvocate Tawanda Zhuwarara represented the first and second respondents, while the Minister did not participate in the proceedings.\n\nAfter hearing arguments, Justice Deme upheld Zhuwararas position that Saidi should have first appealed under Section 128 of the Health Professions Act before approaching the constitutional court.\n\nIt is the settled position of our law that where there exist other remedies, a litigant may not approach a court on a constitutional basis and ignore the remedies at his disposal, the judge said, quoting from a previous Constitutional Court ruling.\n\nThe judge noted that the appeal route was more effective, allowing direct review of the disciplinary authoritys decision while preserving Saidis right to later seek constitutional relief if necessary.\n\nDeme also criticised Saidis decision to withdraw an earlier appeal, describing his reasoning as vague and unconvincing.\n\nHe held that Section 85(2) of the Constitution, which guarantees access to the courts, could not override the subsidiarity principle.\n\nThe application was struck off the roll, with no order as to costs.\n\nThis is a constitutional matter which does have a bearing on the public interest. An order that there shall be no order as to costs is appropriate in the circumstances, Justice Deme ruled.\n\nDr Saidi remains barred from practising general medicine and must first lodge an appeal through the Health Professions Authority before seeking constitutional redress.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/03/16165714/Blood-Zimbabwe.jpg",
            "description": "<p>By Mary Taruvinga A Harare doctor who believes that blood is sacred and must not be transfused has failed in his bid to overturn a professional ban restricting his medical practice after the High Court ruled that his constitutional challenge was filed “prematurely.” Dr Seleman Saidi, who was disciplined for refusing to administer blood transfusions</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/doctor-loses-bid-to-overturn-professional-ban-for-refusing-to-authorise-blood-transfusion-on-religious-grounds/\">Doctor loses bid to overturn professional ban for refusing to authorise blood transfusion on religious grounds</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "14 Oct 2025"
        },
        {
            "title": "Investigation launched after boxes of ARVs, prescription drugs found in deadly Limpopo bus crash that killed over 40",
            "url": "https://www.newzimbabwe.com/investigation-launched-after-boxes-of-arvs-prescription-drugs-found-in-deadly-limpopo-bus-crash-that-killed-over-40/",
            "content": "IOL\n\nAuthorities in South Africa have launched a full-scale investigation after boxes of antiretroviral (ARV) drugs and other prescription medications were discovered among the wreckage of a cross-border bus that crashed on the N1 near Makhado, killing at least 42 people.\n\nThe long-distance bus, which was traveling from Gqeberha in the Eastern Cape to Harare, Zimbabwe, veered off the road and overturned late Tuesday night, leaving bodies scattered across the crash site and dozens injured. Emergency teams described the scene as horrific, with rescue operations lasting through the night.\n\nEmergency responders and police found a box containing ARVs and other medical supplies in the bus.\n\nThis is highly irregular, said a senior official involved in the recovery operation. There was no documentation for the medical cargo, and its unclear whether the transport of these drugs was legal or who the intended recipient was.\n\nAuthorities are now treating the crash site as both an accident scene and a potential site of pharmaceutical smuggling. ARVs, used to manage HIV, are tightly regulated and are often subject to trafficking due to their high value and demand in the region.\n\nThe presence of the medication has added a complex twist to the investigation, which is still trying to determine what caused the crash. Early reports suggest the driver may have lost control of the bus on a bend, but officials have not ruled out mechanical failure or driver fatigue.\n\nLimpopo Premier Dr Phophi Ramathuba is expected to visit the crash site and meet with the multidisciplinary response team. Speaking briefly on Wednesday morning, she expressed concern about both the loss of life and the possible illegal transport of medical goods.\n\nThis is not just a tragic accident  it now involves deeper issues of public health and criminal conduct, Ramathuba said. We are treating this with the seriousness it deserves.\n\nMost of the passengers were believed to be Zimbabwean nationals making the long journey home. Names of the deceased have not yet been released, pending identification and consular notification. Survivors are receiving treatment at hospitals in Makhado and Polokwane, some with life-threatening injuries.\n\nMeanwhile, transport authorities have reiterated concerns over the growing number of long-distance buses operating with limited oversight. The crash has reignited calls for stricter inspections and better enforcement of passenger safety regulations, especially on international routes.\n\nEmergency responders and police found a box containing ARVs and other medical supplies in the bus.\n\nThis is highly irregular, said a senior official involved in the recovery operation. There was no documentation for the medical cargo, and its unclear whether the transport of these drugs was legal or who the intended recipient was.\n\nAuthorities are now treating the crash site as both an accident scene and a potential site of pharmaceutical smuggling. ARVs, used to manage HIV, are tightly regulated and are often subject to trafficking due to their high value and demand in the region.\n\nThe presence of the medication has added a complex twist to the investigation, which is still trying to determine what caused the crash. Early reports suggest the driver may have lost control of the bus on a bend, but officials have not ruled out mechanical failure or driver fatigue.\n\nLimpopo Premier Dr Phophi Ramathuba was expected to visit the crash site and meet with the multidisciplinary response team. She expressed concern about both the loss of life and the possible illegal transport of medical goods.\n\nThis is not just a tragic accident  it now involves deeper issues of public health and criminal conduct, Ramathuba said. We are treating this with the seriousness it deserves.\n\nMost of the passengers were believed to be Zimbabwean nationals making the long journey home. Names of the deceased have not yet been released, pending identification and consular notification. Survivors are receiving treatment at hospitals in Makhado and Polokwane, some with life-threatening injuries.\n\nMeanwhile, transport authorities have reiterated concerns over the growing number of long-distance buses operating with limited oversight. The crash has reignited calls for stricter inspections and better enforcement of passenger safety regulations, especially on international routes.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/13122907/DNC-Bus.png",
            "description": "<p>IOL Authorities in South Africa have launched a full-scale investigation after boxes of antiretroviral (ARV) drugs and other prescription medications were discovered among the wreckage of a cross-border bus that crashed on the N1 near Makhado, killing at least 42 people. The long-distance bus, which was traveling from Gqeberha in the Eastern Cape to Harare,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/investigation-launched-after-boxes-of-arvs-prescription-drugs-found-in-deadly-limpopo-bus-crash-that-killed-over-40/\">Investigation launched after boxes of ARVs, prescription drugs found in deadly Limpopo bus crash that killed over 40</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "14 Oct 2025"
        }
    ]
}