{
    "news": [
        {
            "title": "Gene Hackman and his wife found dead at their home",
            "url": "https://www.newzimbabwe.com/gene-hackman-and-his-wife-found-dead-at-their-home/",
            "content": "BBC\n\nOscar-winning US actor Gene Hackman, his wife Betsy Arakawa, and their dog have been found dead at their home in Santa Fe, New Mexico.\n\nIn a wide-ranging career spanning more than six decades, Hackman won two Academy Awards for his work on The French Connection and Unforgiven.\n\nA statement from the Santa Fe County Sheriff in New Mexico said: We can confirm that both Gene Hackman and his wife were found deceased Wednesday afternoon at their residence on Sunset Trail.\n\nThis is an active investigation  however, at this time we do not believe that foul play was a factor.\n\nHackman was 95, and his wife  a classical pianist  63.\n\nHe won the best actor Oscar for his role as Jimmy Popeye Doyle in William Friedkins 1971 thriller The French Connection, and another for best supporting actor for playing Little Bill Daggett in Clint Eastwoods Western film Unforgiven in 1992.\n\nA relative latecomer to Hollywood, Hackmans breathrough came in his thirties, when he was nominated for an Oscar for portraying Buck Barrow in 1967s Bonnie and Clyde  opposite Warren Beatty and Faye Dunaway  and again for I Never Sang for My Father in 1970.\n\nBoth films saw him recognised in the supporting actor category. He was also nominated for best leading actor in 1988 for playing the agent in Mississippi Burning.\n\nThe Santa Fe County Sheriffs office said: On 26 February, 2025, at approximately 1:45pm, Santa Fe County Sheriffs deputies were dispatched to an address on Old Sunset Trail in Hyde Park where Gene Hackman, his wife Betsy Arakawa, and a dog were found deceased.\n\nMuch-celebrated actor Hackman played more than 100 roles in total, including supervillain Lex Luthor in the Christopher Reeve-starring Superman movies in the 1970s and 1980s.\n\nHackman acted opposite many Hollywood heavyweights including Al Pacino in 1973s Scarecrow, Gene Wilder in 1974s Young Frankenstein and Warren Beatty and Diane Keaton in 1981s Reds.\n\nHe also starred in the hit movies Runaway Jury, Wes Andersons The Royal Tenenbaums and Francis Ford Coppolas The Conversation.\n\nCoppola led the tributes to the late star on Thursday, calling him a great artist.In a statement posted on Instagram,the director wrote: Gene Hackman a great actor, inspiring and magnificent in his work and complexity. I mourn his loss, and celebrate his existence and contribution.\n\nValerie Perrine, who featured alongside Hackman in Superman (1978) as his characters on-screen girlfriend Eve Teschmacher, described the late actor as a genius and one of the greatest to grace the silver screen.\n\nShe posted on X: His performances are legendary. His talent will be missed. Goodbye my sweet Lex Till we meet again.\n\nStar Trek actorGeorge Takei postedthat we have lost one of the true giants of the screen.\n\nGene Hackman could play anyone, and you could feel a whole life behind it, he wrote. He could be everyone and no one, a towering presence or an everyday Joe. Thats how powerful an actor he was. He will be missed, but his work will live on forever.\n\nSlumdog Millionaire star Anil Kapoor also called Hackman a genius performer. A true legend whose legacy will live on,he wrote.\n\nAs well as his Oscar wins, Hackman also collected two Baftas, four Golden Globes and a Screen Actors Guild Award.\n\nHe took a comedic turn playing a conservative senator in 1996s The Birdcage alongside Robin Williams and Nathan Lane, who starred as a gay couple.\n\nHis last big-screen appearance came as Monroe Cole in Welcome to Mooseport in 2004, after which he stepped back from Hollywood for a quieter life in New Mexico.\n\nBorn in California in 1930, Hackmans family moved frequently, and after lying about his age at 16, he enlisted in the US Marine Corps serving for four-and-a-half years.\n\nHe was stationed in China, Hawaii and Japan before being discharged in 1951.\n\nFollowing his military service, Hackman lived and worked in a variety jobs in New York, and studied journalism and television production at the University of Illinois, before deciding to drop out and move back to California to pursue his childhood acting dream.\n\nHe joined the Pasadena Playhouse in California, where he befriended a young Dustin Hoffman.\n\nI suppose I wanted to be an actor from the time I was about 10, maybe even younger than that, Hackman once said. Recollections of early movies that I had seen and actors that I admired like James Cagney, Errol Flynn, those kind of romantic action guys.\n\nWhen I saw those actors, I felt I could do that. But I was in New York for about eight years before I had a job. I sold ladies shoes, polished leather furniture, drove a truck.\n\nI think that if you have it in you and you want it bad enough, you can do it.\n\nHe added that he wanted to act but had always been convinced that actors had to be handsome.\n\nThat came from the days when Errol Flynn was my idol. Id come out of a theatre and be startled when I looked in a mirror because I didnt look like Flynn. I felt like him.\n\nHackman moved back to New York in 1963, performing in Off-Broadway productions  including at the Music Box Theatre for the comedy Any Wednesday  and smaller TV roles.\n\nBut he began to really make his name in the 1970s, becoming a leading man as New York City detective Jimmy Popeye Doyle in The French Connection.\n\nFrom then on he became a fixture on the big screen in the likes of 1972 disaster film The Poseidon Adventure.\n\nHe also appeared in Children From Their Games at the former Morosco Theatre, Poor Richard at Helen Hayes Theatre and The Natural Look at Longacre Theatre, before later returning in 1992 to perform Death And The Maiden at the Brooks Atkinson Theatre.\n\nHackman and his first wife, Faye Maltese, were together for 30 years and raised three children before getting divorced in 1986.\n\nIn his later years, he and his second wife, Betsy stayed out of the spotlight, but made a rare public appearance together at the 2003 Golden Globe Awards, where he won the Cecil B. deMille award.\n\nIn 2008 he told Reuters that despite the lack of any official announcement, he was not going to act any longer.\n\nIve been told not to say that over the last few years, in case some real wonderful part comes up, but I really dont want to do it any longer.\n\nHe also explained he was focusing his attentions away from the big screen and towards his quieter, calmer passion for writing novels.\n\nI was trained to be an actor, not a star. I was trained to play roles, not to deal with fame and agents and lawyers and the press, he once said.\n\nIt really costs me a lot emotionally to watch myself on-screen. I think of myself, and feel like Im quite young, and then I look at this old man with the baggy chins and the tired eyes and the receding hairline and all that.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/27165159/gene-hackman.webp",
            "description": "<p>BBC Oscar-winning US actor Gene Hackman, his wife Betsy Arakawa, and their dog have been found dead at their home in Santa Fe, New Mexico. In a wide-ranging career spanning more than six decades, Hackman won two Academy Awards for his work on The French Connection and Unforgiven. A statement from the Santa Fe County</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/gene-hackman-and-his-wife-found-dead-at-their-home/\">Gene Hackman and his wife found dead at their home</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:41",
            "date": "27 Feb 2025"
        },
        {
            "title": "Every day that passes perpetuates his suffering for doing his work – lawyer says as journalist Mhlanga’s bail ruling is postponed again",
            "url": "https://www.newzimbabwe.com/every-day-that-passes-perpetuates-his-suffering-for-doing-his-work-lawyer-says-as-journalist-mhlangas-bail-ruling-is-postponed-again/",
            "content": "By Staff Reporter\n\nThe bail ruling in the case Alpha Media Holdings (AMH) journalist Blessed Mhlanga is accused of transmitting information that incites violence or damage to property, has been postponed to Friday 12 pm by stand-in Magistrate Marewanazvo Gofa.\n\nGofa deferred the ruling, citing that Magistrate Farai Gwatima, who is presiding over Mhlangas case is absent, attending to a bereavement.\n\nMhlanga was arrested on Monday after presenting himself at the Harare Central Police Station in the company of his lawyer, Chris Mhike.\n\nHe is charged under Section 164 of the Criminal Law (Codification and Reform) Act Chapter 9:23.\n\nThe charges relate to him granting an interview to Blessed Geza, a war veteran and a staunch opponent of the Mnangagwa 2030 agenda.\n\nGeza had issued press briefings through AMH broadcaster HSTv, calling for President Emmerson Mnangagwa to resign from office immediately. Mhlanga is the head of HSTv.\n\nMhike said he is disappointed in the postponement of the bail ruling, which means his client, Mhlanga, will spend another night in jail for doing his journalistic work.\n\nWe are disappointed with this development because every day that passes with this journalist in custody is an elongation or perpetuation of his suffering, suffering for doing his work as a journalist, said Mhike.\n\nWe sympathise with the circumstances of the magistrate, but we remain deeply aggrieved by the fact that the time in which our client is in custody has been made longer, so we wait with hope that when we come back tomorrow (February 28) Blessed will find his liberty once again.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26003108/InShot_20250225_165102005-scaled.jpg",
            "description": "<p>By Staff Reporter The bail ruling in the case Alpha Media Holdings (AMH) journalist Blessed Mhlanga is accused of transmitting information that incites violence or damage to property, has been postponed to Friday 12 pm by stand-in Magistrate Marewanazvo Gofa. Gofa deferred the ruling, citing that Magistrate Farai Gwatima, who is presiding over Mhlanga’s case</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/every-day-that-passes-perpetuates-his-suffering-for-doing-his-work-lawyer-says-as-journalist-mhlangas-bail-ruling-is-postponed-again/\">Every day that passes perpetuates his suffering for doing his work – lawyer says as journalist Mhlanga’s bail ruling is postponed again</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:41",
            "date": "27 Feb 2025"
        },
        {
            "title": "WATCH: Teen girl goes missing following dispute with mother; family appeals for help in locating her",
            "url": "https://www.newzimbabwe.com/watch-teen-girl-goes-missing-following-dispute-with-mother-family-appeals-for-help-in-locating-her/",
            "content": "By Tapiwa Svondo\n\nA Seke family is appealing for help in locating their 16-year-old daughter after she left home on January 23 after a dispute with her mother and has not returned since.\n\nLillian Manjore told NewZimbabwe.com that her teen daughter Mercy Morlean Mandividze had visited her workplace in Greendale when a dispute ensued over the latters messages to her boyfriend.\n\nMercy is16 years old, I couldnt find her since the 23rd of January and she was staying with my sister here in Besa, Seke, learning at Eagle Private Secondary, and she had written her form 4 but hadnt taken her results.\n\nShe had been here for 3 days and I told her she might have failed because shes also someone who doesnt have a passion for school but we had agreed that she do a catering course and she was accepted at Makoni. The purpose of her visit was to collect the cash for her course, Manjore said.\n\nShe has since quit her job in Greendale so she can focus on finding her missing daughter.\n\nMercy Morlean has been missing for over a month now.\n\nI then asked to use my daughters phone since my phones battery had died.While I was using the phone, I saw messages received from a boy. It was around 9 pm and she was already sleeping, she added.\n\nManjore says she reprimanded Mercy the following morning before leaving for work adding that she had barred her from interacting with the same boy in the past and had even asked school authorities to intervene in the matter.\n\nWhen she returned home for lunch she summoned Mercy who then left and has not been seen since.\n\nAt lunchtime, I came back again and told her that I needed to sit down and talk to her, I assume she thought I wanted to beat her and she just left the house without saying anything. She was not even wearing shoes, and had no money, the distraught mother added.\n\nMercy was last seen wearing a blue top, jacket, and floral skirt. Her hair was plaited with black and maroon braids.\n\nLillian has tried all possible ways of looking for her daughter by going to the police station but they havent found her yet.\n\nManjore has filed a missing persons report with the police and has looked for her daughter at shopping centres, and enquired with her friends and even prophets but with no luck.\n\nShe pleaded, Iam kindly appealing for assistance in locating my daughter. If she sees this news coverage I want her to know that I did not reprimand her because I hate her but because I care and love her.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/27101751/Screenshot-2025-02-27-at-12.17.21.png",
            "description": "<p>By Tapiwa Svondo A Seke family is appealing for help in locating their 16-year-old daughter after she left home on January 23 after a dispute with her mother and has not returned since. Lillian Manjore told NewZimbabwe.com that her teen daughter Mercy Morlean Mandividze had visited her workplace in Greendale when a dispute ensued over</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/watch-teen-girl-goes-missing-following-dispute-with-mother-family-appeals-for-help-in-locating-her/\">WATCH: Teen girl goes missing following dispute with mother; family appeals for help in locating her</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:41",
            "date": "27 Feb 2025"
        },
        {
            "title": "Former Zimbabwe Rugby Union president Aaron Jani dies",
            "url": "https://www.newzimbabwe.com/former-zimbabwe-rugby-union-president-aaron-jani-dies/",
            "content": "By Sport Reporter\n\nFormer Zimbabwe Rugby Union president Aaron Janihasdied aged 55.\n\nJani passed away on Wednesday morning after battling cancer for some time.\n\nRated one of the best administrators ever in the rugby fraternity, he led the union as president from 2017 to May 2024.\n\nHe also served at Rugby Africa as the Treasurer.\n\nJani was one of the first black players to play for the Sables in the early 90s before he retired and continued to serve the game as an administrator.\n\nIn a condolence message, the Zimbabwe Rugby Union described him as a visionary leader who helped the game to grow.\n\nAaron was a towering figure in our sporta leader, a visionary, and a passionate advocate for rugby in Zimbabwe and beyond.\n\nJani was a Sable, living for the game, and his passing marks one of the saddest days in Zimbabwe Rugby.\n\nHis unwavering dedication during his tenure as ZRU President brought stability, growth, and pride to our community, leaving an indelible mark on the Sables, junior rugby, and womens rugby development.\n\nOn behalf of the entire ZRU family, we extend our deepest sympathies to Aarons loved ones during this difficult time.\n\nHis legacy will forever inspire us as we continue to build on the foundation he so tirelessly strengthened, read part of ZRU message.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/11/17055951/Aaron-Jani-scaled-e1605592830868.jpg",
            "description": "<p>By Sport Reporter Former Zimbabwe Rugby Union president Aaron Jani has died aged 55. Jani passed away on Wednesday morning after battling cancer for some time. Rated one of the best administrators ever in the rugby fraternity, he led the union as president from 2017 to May 2024. He also served at Rugby Africa as the Treasurer.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/former-zimbabwe-rugby-union-president-aaron-jani-dies/\">Former Zimbabwe Rugby Union president Aaron Jani dies </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:41",
            "date": "27 Feb 2025"
        },
        {
            "title": "Zimplats faces challenges as half-year production dips amid operational disruptions",
            "url": "https://www.newzimbabwe.com/zimplats-faces-challenges-as-half-year-production-dips-amid-operational-disruptions/",
            "content": "Business Report\n\nImpala Platinums Zimbabwean unit, Zimplats was affected by power supply interruptions and poor availability of trackless machinery during the half-year period to December 2024, consequently lowering mined volumes by 2.5% compared to the same period a year earlier.\n\nZimplats has completed re-development of the large Bimha mine which now has capacity of 3.1 million tons per year.\n\nHowever, during the period under review, Zimplats mined volumeswere hampered by poor trackless mobile machinery (TMM) availability at Mupfuti, Bimha andMupani mines while intermittent interruptions to power supply at operationsand a slow ramp-up at Bimha Minefollowing several lost-time injuries also weighed in.\n\nThis forced down mined volumes by2.5% to 3.9 million tonscompared to4million tonsin the comparable periodin 2023.\n\nTons milledalsodecreased by 2.6% to 3.8 million tons due to lower ore supplywhile metal in concentrateproduction declined by 2% year-on-year to 279 890 6E ounces.\n\nHowever, Zimplats 6E mill head grade improvedmarginally to 3.38grammes per ton. This has been attributed to improved miningquality across the mines and increased tonnage from higher-grade zonesat Rukodzi and Bimha mines.\n\nLower-than-planned concentrator production, increase in furnace lockup and the delayed commissioning of the expanded smelter converters impacted 6E production, which decreased by 15% to 279 890 ounces from 327 810 ounces. In total 23 191 6E ounces were accumulated between concentrate and final production in the period, said Zimplats CEO, Alex Mhembere.\n\nDuring the half year period, Zimplats suffered a 6% dip in revenues to$350.2 million (R6.4 billion). This was caused bya 13% decline in sales volumes to 279 740 6Eouncesas average metal prices were 8% higherfor the period.\n\nMoreover, cost of sales decreased by 6% to $323m on the lower sales volumes, partly offset by a 7%increase in costs to $885 per 6E ounce produced.\n\nConsequently, profit before income tax was 37% lower at $8.9m after an income tax charge of $4.7m for the half year,\n\nInterim post tax profits in Zimplatsimproved to$4.1m compared toa loss of $8.8m in the previous contrasting period, although there was no dividend declared for the period.\n\nZimplatsaccessed borrowings of US$4.5m during the half year andclosed the period with cash and cash equivalents of$41.4m .\n\nThe development and upgrade of Mupani Mine which will replace Ngwarati, Rukodzi and part of Mupfuti mines that are depleting remains on schedule, with full production of 3.6 million tonnes per annum planned for the first half of 2029.\n\nZimplats has spend a cumulative$339mas at 31 December 2024 against an approved project budgetof $386m on Mupani mine development.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/06/15101253/IMG_20230614_124141-scaled.jpg",
            "description": "<p>Business Report Impala Platinum’s Zimbabwean unit, Zimplats was affected by power supply interruptions and poor availability of trackless machinery during the half-year period to December 2024, consequently lowering mined volumes by 2.5% compared to the same period a year earlier. Zimplats has completed re-development of the large Bimha mine which now has capacity of 3.1</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimplats-faces-challenges-as-half-year-production-dips-amid-operational-disruptions/\">Zimplats faces challenges as half-year production dips amid operational disruptions</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:41",
            "date": "27 Feb 2025"
        },
        {
            "title": "We can come after you – says acting principal as Roman Catholic institution is caught up in sexual harassment storm",
            "url": "https://www.newzimbabwe.com/we-can-come-after-you-says-acting-principal-as-roman-catholic-institution-is-caught-up-in-sexual-harassment-storm/",
            "content": "By Leopold Munhende\n\nAN official at Roman Catholic-run St. Peters Kubatana Industrial Training College has threatened to come after anyone who continues to write articles about a messy sexual harassment scandal, alleged to involve learners and teachers.\n\nAbout three cases of sexual harassment are said to have been swept under the carpet in the past year, with the latest raising a storm for a lecturer identified as Kudakwashe Jongwe.\n\nA parent who spoke toNewZimbabwe.comnarrated saddening exchanges between themselves and the institutions Principal, a Mr Gatsi, whose institution they allege to be shielding teachers accused of sexually exploiting students.\n\nOne Mlambo, who is the institutions Acting Principal told this publication to drop the story as the Roman Catholic Church was too big and could come after the writer.\n\nWe can come for you, this is a big institution, this is the Roman Catholic, said Mlambo in a conversation with this publication.\n\nWe dont want to comment on this issue. Why do you want to write an article that is done?\n\nIf you were the police we would consider your questions but we do not want to speak about it, this matter is dead.\n\nJongwe, who politely told this publication that he had been barred from commenting on the issue by the institution, is said to have been sending sleazy messages to students and inviting them home for what he told a local daily were extra lessons.\n\nThe parent said he got wind of the act, confiscated their daughters phone and discovered the comments she said bordered on sexual harassment.\n\nJongwe has been harassing my daughter considering his love comments to her, said the parent.\n\nAfter taking our matter to the principal, he defended him and that angered me.\n\nJongwe is also accused of having taken the daughter for a questionable shopping spree against her parents will after they got wind of it.\n\nSt. Peters Kubatana Industrial Training College is run by Roman Catholic Jesuits, a religious order of priests and brothers in the church.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26181433/st-peters.jpg",
            "description": "<p>By Leopold Munhende AN official at Roman Catholic-run St. Peter’s Kubatana Industrial Training College has threatened to come after anyone who continues to write articles about a messy sexual harassment scandal, alleged to involve learners and teachers. About three cases of sexual harassment are said to have been swept under the carpet in the past</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/we-can-come-after-you-says-acting-principal-as-roman-catholic-institution-is-caught-up-in-sexual-harassment-storm/\">We can come after you – says acting principal as Roman Catholic institution is caught up in sexual harassment storm</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:41",
            "date": "27 Feb 2025"
        },
        {
            "title": "Such policies turned Zimbabwe into a basket case – Free Market Foundation slams DA over ‘liberal betrayal’ on Expropriation Act",
            "url": "https://www.newzimbabwe.com/such-policies-turned-zimbabwe-into-a-basket-case-free-market-foundation-slams-da-over-liberal-betrayal-on-expropriation-act/",
            "content": "IOL\n\nSouth Africa  The Free Market Foundation (FMF) has said that the Democratic Alliance (DA) had only one role to play regarding the new Expropriation Act, which is unconditional and unrelenting opposition, but with the formation of the GNU, FMF said the party has allowed itself to be ideologically co-opted and has betrayed liberals.\n\nMartin van Staden, Head of Policy at the FMF, said in a statement issued on Tuesday that the DA has charted a different course, skirting around the acts fundamental constitutional, economic, and moral deficiencies and focusing instead on some peripheral formalities.\n\nThis is a weak  and failed  attempt to show its constituency that it is still againstthe Expropriation Actwhile protecting its position in the government of national unity (GNU).\n\nLiberalisms value proposition is simple: individuals and communities  society  must chart their course. The state must secure society against coercion directed at people or their property. Beyond this, the state must be severely limited by constitutional law so it cannot utilise its incredible power to deprive society of civil liberty or property.\n\nSince the establishment of the Progressive Party in 1959, followed by the Progressive Reform Party, Progressive Federal Party, the Democratic Party, and finally the DA, the DA has been the foremost representative of this political ideology in SA. However, with the formation of the GNU, the party has allowed itself to be ideologically co-opted.\n\nVan Staden added that co-option does not always mean sharing the precise philosophical imperatives of the co-opted,arguing that the DA is not yet a Marxist-Leninist party such as the ANC.\n\nUS President Donald Trump, in his usual unrefined fashion, did SA an excellent service by speaking out in favour of property ownership. He pointed out that property confiscation is now law in SA, that a class of people in SA  property owners  is being badly mistreated, and that this amounts to a human rights violation. On all counts, like him or not, Trump is right.\n\nAnd yet the DA, among the regimes usual cheerleaders in the media and academia, felt compelled to condemn Trump for speaking the truth rather than condemn Parliament and President Cyril Ramaphosa for adopting the kinds of policies that have turned relatively prosperous societies such as Zimbabwe and Venezuela into humanitarian disasters and basket cases, he said.\n\nThe FMF said the DA has been advised repeatedly and in excruciating detail about the constitutional and constitutionalist errors in the Expropriation Act.\n\nTruthfully, this should have been the final red line for the GNU\n\nIt is a betrayal that liberals and those who understand the key role property rights play in safeguarding freedom and democracy and creating the conditions for prosperity should not soon forgive the party for.The DA was supposed to be part of the solution, not part of the problem, read the FMF statement.\n\nApproached for comment, the DA dismissed the FMF statement alleging the party has been co-opted by the ANC and betrayed its supporters on the Expropriation Act.\n\nThe partys national spokesperson, Karabo Khakhau, said she is unsure what informed the FMF statement before dismissing it as baseless.\n\nAnyone with their finger on the pulse of South African politics would know that the DA has submitted court papers challenging the Act.\n\nWe are fundamentally opposed to the Act, in principle, because it opens the door to potential abuse through expropriation without compensation, which threatens property rights. Section 12 of the Act is particularly problematic.\n\nOur legal advice is that the best chance of getting a straightforward victory is to tackle the patently unconstitutional process by which it was passed.\n\nKhakhau mentioned that even if the FMF had fundamental constitutional objections to a piece of legislation, the best court strategy would provide the best chance of victory.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26170156/The-Free-Market-Foundation-says-the-Democratic-Alliance-has-betrayed-liberals-on-property-rights.webp",
            "description": "<p>IOL South Africa – The Free Market Foundation (FMF) has said that the Democratic Alliance (DA) had only one role to play regarding the new Expropriation Act, which is “unconditional and unrelenting opposition”, but with the formation of the GNU, FMF said the party has allowed itself to be ideologically co-opted and has betrayed liberals.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/such-policies-turned-zimbabwe-into-a-basket-case-free-market-foundation-slams-da-over-liberal-betrayal-on-expropriation-act/\">Such policies turned Zimbabwe into a basket case – Free Market Foundation slams DA over ‘liberal betrayal’ on Expropriation Act</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:41",
            "date": "27 Feb 2025"
        },
        {
            "title": "Latvian jailed 15 years for attempting to smuggle 8.3kgs of heroin",
            "url": "https://www.newzimbabwe.com/latvian-jailed-15-years-for-attempting-to-smuggle-8-3kgs-of-heroin/",
            "content": "By Mary Taruvinga\n\nA Latvian has been jailed for 15 years for attempting to smuggle heroin to India via Robert Mugabe International Airport two years ago.\n\nVitalis Kurdrjasovs (27) was sent to jail by Harare magistrate Donald Ndirowei after a full trial.\n\nThe state proved that he tried to smuggle 8,3 kgs of heroin which was found hidden in his luggage on September 8 2022 at the airport.\n\nKurdrjasovs was in Zimbabwe as a visitor.\n\nProsector Tendai Tapi proved that on 8 September 2022 at around 1500 hours, the accused proceeded to the Robert Gabriel Mugabe International Airport intending to leave the country on an Ethiopian Airways 1500-hour flight bound for Addis Ababa en route to India.\n\nHe had two bags of luggage.\n\nKurdrjasovs completed all the check-in formalities with Ethiopian Airlines and handed over his two bags for loading onto the aircraft.\n\nThe bags were endorsed with name tag bearing his particulars for identification. He underwent all the Customs and Immigration formalities.\n\nKurdrjasovs declared that he only had clothing as his baggage to the Airline and Customs officials.\n\nHis black bag was intercepted at the Airport Ground Zero scanner by the Airport Aviation Security after it was noticed that it had suspicious visual images, the court heard.\n\nKurdrjasovs was summoned to the scanner and questioned over the contents of his bag but he maintained that it was his clothing.\n\nThe black bag was searched in his presence, customs and the police and it was discovered that there were four packages of brownish substances suspected to be dangerous drugs stashed in the bags false compartment.\n\nA preliminary field test was carried out on the seized brownish substances and they tested positive for heroin.\n\nThe heroin was seized by customs (ZIMRA).\n\nThe seized heroin was taken to Forensic Science Laboratory for examination and it tested positive for heroin.\n\nThe seized drugs recorded a total weight of 8350,2 grammes with a street value of ZWL$6 680 160.\n\nNdirowei also ordered him to pay US$5,000 fine or face five more years in jail.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/30055718/white-powder-heroin-scaled-1.jpg",
            "description": "<p>By Mary Taruvinga A Latvian has been jailed for 15 years for attempting to smuggle heroin to India via Robert Mugabe International Airport two years ago. Vitalis Kurdrjasovs (27) was sent to jail by Harare magistrate Donald Ndirowei after a full trial. The state proved that he tried to smuggle 8,3 kgs of heroin which</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/latvian-jailed-15-years-for-attempting-to-smuggle-8-3kgs-of-heroin/\">Latvian jailed 15 years for attempting to smuggle 8.3kgs of heroin</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:41",
            "date": "27 Feb 2025"
        },
        {
            "title": "ZWG month-on-month inflation rate recedes to 0,5% – ZimStat",
            "url": "https://www.newzimbabwe.com/zwg-month-on-month-inflation-rate-recedes-to-05-zimstat/",
            "content": "By Alois Vinga\n\nThe month-on-month inflation rate has tumbled to 0,5%, giving strong signals of a positive inflationary outlook in the year ahead, Zimbabwe National Statistics Agency (Zimstat) reported Wednesday.\n\nThe stats agency said the inflation rate for the local unit tumbled to 0.5% in February 2025, shedding 10.0% on the January 2025 rate of 10,5% implying that prices as measured by the all items ZWG CPI, increased by an average of 0.5% from January 2025 to February 2025.\n\nThe ZWG month-on-month Food and Non-Alcoholic Beverages inflation rate was 0.8 percent in February 2025, shedding 6.0 percentage points on the January 2025 rate of 6.8 percent while the month-on-month non-food inflation rate was 0.3 % shedding 4,3% on the January 2025 rate of 4,6%, said Zimsat.\n\nMarket watchers have credited the latest recovery to the tight Monetary Policy stance pursued by monetary authorities but warned that such economic trends could be signals of deeper problems in the economy such as reduced productive borrowing, and disposable incomes prompting very slow economic growth.\n\nThe policy measures, if not well managed, can also choke companies capability to invest in new projects.\n\nZimstat said the US$ month-on-month inflation rate for the period stood at 0,2% in February 2025, shedding 11.3% on the January 2025 rate of 11,5% implying that prices as measured by the all items index increased by an average of 0,2% from January 2025 to February 2025.\n\nThe USD month-on-month Food and NonAlcoholic Beverages inflation rate was 0,2% in February 2025, shedding 16.6% on the January 2025 rate of 16,8%. The February 2025 USD month-on-month non-food inflation rate was 0.2 % shedding 8,9% on the January 2025 rate of 9,1%.\n\nThe USD year-on-year inflation rate (annual percentage change) for the month of February 2025 as measured by the all-items USD Consumer Price Index (CPI), was 15.1%.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/02115157/zig.webp",
            "description": "<p>By Alois Vinga The month-on-month inflation rate has tumbled to 0,5%, giving strong signals of a positive inflationary outlook in the year ahead, Zimbabwe National Statistics Agency (Zimstat) reported Wednesday. The stats agency said the inflation rate for the local unit tumbled to 0.5% in February 2025, shedding 10.0% on the January 2025 rate of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zwg-month-on-month-inflation-rate-recedes-to-05-zimstat/\">ZWG month-on-month inflation rate recedes to 0,5% – ZimStat</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:41",
            "date": "27 Feb 2025"
        },
        {
            "title": "United Nations Human Rights Council: Zimbabwe hailed for abolishing death penalty",
            "url": "https://www.newzimbabwe.com/united-nations-human-rights-council-zimbabwe-hailed-for-abolishing-death-penalty/",
            "content": "By Alois Vinga\n\nCOUNTRIES attending the ongoing 58th session of the United Nations Human Rights Council have saluted Zimbabwe for successfully abolishing the death penalty.\n\nSpeaking at the high-level convention, Zimbabwes Attorney General Virginia Mabiza chronicled the countrys journey in ending the death penalty which was introduced by British colonial powers and remained in place even beyond the attainment of Zimbabwes independence in 1980.\n\nShe said at independence, Zimbabwe inherited a wide array of offences that attracted the death penalty and since then, various legislative and policy interventions have been implemented to gradually reduce the number of crimes attracting the death penalty.\n\nIn 2013, the number of offences attracting the death penalty had been reduced from nine to only murder committed in aggravating circumstances in sync with the United Nations General Assembly Resolution 52 on reducing the number of offences that attract the death penalty.\n\nUltimately, in 2024, the Government enacted the Death Penalty Abolition Act [Chapter 9:26], a significant milestone in the countrys human rights journey. The Death Penalty Abolition Act [Chapter 9:26] outlawed the imposition of the Death Penalty.\n\nIt further placed a positive legal obligation on the Minister responsible for Justice, the Prosecutor General and the Commissioner General of Prisons to do everything within their respective competencies to ensure every prisoner under the sentence of death is brought before the High Court for resentencing, Mabiza told the gathering.\n\nMaxime Prevot, Deputy Prime Minister and Minister of Foreign Affairs, European Affairs and Development Cooperation, speaking on behalf of the core group on the question of the death penalty (Belgium, Benin, Costa Rica, France, Mexico, Mongolia, Republic of Moldova, and Switzerland), hailed the recent decision of Zimbabwe to abolish the death penalty and encouraged other states to follow suit, or, pending its abolition, to impose a moratorium on its use.\n\nSwitzerland welcomed Mabizas presence at the Human Rights Council and congratulated Zimbabwe for the major step in the protection of human rights.\n\nThe High Commissioner for Human Rights Volker Trk observed that 113 countries have abolished the death penalty completely. He commended the Zimbabwean government for joining 26 other countries in Africa that have abolished the death penalty.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26182920/death-penalty.jpg",
            "description": "<p>By Alois Vinga COUNTRIES attending the ongoing 58th session of the United Nations Human Rights Council have saluted Zimbabwe for successfully abolishing the death penalty. Speaking at the high-level convention, Zimbabwe’s Attorney General Virginia Mabiza chronicled the country’s journey in ending the death penalty which was introduced by British colonial powers and remained in place</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/united-nations-human-rights-council-zimbabwe-hailed-for-abolishing-death-penalty/\">United Nations Human Rights Council: Zimbabwe hailed for abolishing death penalty  </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:41",
            "date": "27 Feb 2025"
        }
    ]
}