{
    "news": [
        {
            "title": "Zambia and Zimbabwe to jointly host energy summit",
            "url": "https://www.newzimbabwe.com/zambia-and-zimbabwe-to-jointly-host-energy-summit/",
            "content": "JN/APA\n\nZambia and Zimbabwe will co-host a landmark regional energy summit in November aimed at fast-tracking investment in southern Africas power sector.\n\nThe Zimbabwe-Zambia Energy Projects Summit (Zim-Zam 2025), scheduled for 26-28 November in Livingstone, will bring together government officials, investors and developers to unlock financing and scale up renewable energy and infrastructure projects across the region.\n\nHosted by Zambias Copperbelt Energy Corporation (CEC), the summit comes at a critical juncture for southern Africa where energy deficits, aging infrastructure and rising industrial demand have placed pressure on national grids.\n\nBoth Zambia and Zimbabwe have committed to expanding clean energy generation, with flagship projects such as Zambias 100MW Chisamba Solar Farm, Zimbabwes Great Zimbabwe Hydro Project and the Zambia-Tanzania Interconnector leading the way.\n\nOrganisers said Zambias Energy Minister Makozo Chikote will deliver the keynote address during the summit that will spotlight bankable investment opportunities, regional interconnectors and innovative financing models to bring energy commitments to financial close.\n\nIt will also address persistent challenges in transmission, off-taker risk and climate resilience, with a focus on balancing solar, wind and hydro portfolios.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/01/29093058/Solar.jpg",
            "description": "<p>JN/APA Zambia and Zimbabwe will co-host a landmark regional energy summit in November aimed at fast-tracking investment in southern Africa’s power sector. The Zimbabwe-Zambia Energy Projects Summit (Zim-Zam 2025), scheduled for 26-28 November in Livingstone, will bring together government officials, investors and developers to unlock financing and scale up renewable energy and infrastructure projects across</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zambia-and-zimbabwe-to-jointly-host-energy-summit/\">Zambia and Zimbabwe to jointly host energy summit</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "26 Sep 2025"
        },
        {
            "title": "Zimbabwean blueberry farmers set sights on China’s lucrative market",
            "url": "https://www.newzimbabwe.com/zimbabwean-blueberry-farmers-set-sights-on-chinas-lucrative-market/",
            "content": "Xinhua\n\nIn recent years, Zimbabwes blueberry industry has grown rapidly, bringing local farmers higher incomes. This year, producers are setting their sights on exporting blueberries to China, one of the worlds largest and most lucrative markets.\n\nHARARE, Sept. 25 (Xinhua)  Inside a greenhouse located in ZimbabwesMashonaland West Province, workers carefully hand-pick fresh blueberries from lush green shrubs, ensuring only the best fruit makes it to the baskets.\n\nIn recent years, Zimbabwes blueberry industry has grown rapidly, bringing local farmers higher incomes. This year, producers are setting their sights on exporting blueberries to China, one of the worlds largest and most lucrative markets.\n\nEarlier this month, Zimbabwe signed a trade agreement allowing fresh blueberry exports to China, a move farmers say will spur production to meet the surge in demand.\n\nIt is a huge market. They are the biggest exporters of blueberries, among the biggest growers of blueberries, and also one of the biggest importers of blueberries. So, it really has taken off there, said Alistair Campbell, a blueberry farmer from the province.\n\nSupported by favorable climate conditions, increased agricultural investment, and rising demand for this healthy food, Zimbabwes blueberry industry is expanding. According to the countrys Horticultural Development Council (HDC), production is expected to rise from 8,000 metric tons in 2024 to 12,000 metric tons in 2025.\n\nFarmers believe that Zimbabwes strategic geographic location  allowing early access to global markets  gives the country a competitive edge. Our product is well received. We get big, nice-tasting berries. And its well-received in the market thus far. We just need more scale, more blueberries, Campbell said, adding that the opportunity to export to China positions Zimbabwe as a significant player in blueberry production.\n\nWe really need to get things moving pretty quickly. We hope to have some really good engagements with government to see what we can get done there, and also with funders to make sure that we get enough plants in the ground to satisfy at least a part of that Chinese market, he added.\n\nIn a statement following the signing of the blueberry export agreement, the HDC called for policies to increase investment, expand production to required volumes, and ensure that Zimbabwes blueberries consistently meet Chinas quality and phytosanitary standards.\n\nJoseph Kakoto, president of the Zimbabwe Young Farmers Association for Sustainable Development, a youth-led organization, expressed optimism about the growth prospects of the Chinese export market, saying the protocol would attract new investment in plantations, packhouses, and cold chain infrastructure, creating jobs along the value chain.\n\nThis protocol is a win-win. Zimbabwe gains access to a lucrative market, while China secures reliable food imports, Kakoto told Xinhua.\n\nThe deal, he said, signals Zimbabwes entry into high-value horticultural exports such as blueberries, opening the door to greater foreign currency earnings and investment.\n\nI am very confident about the Chinese market because it is huge and steadily growing with a rising middle class that demands healthy premium foods such as blueberries. Zimbabwes climate and soil are highly suitable for premium berries, giving us a competitive edge, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/25153032/blueberry-farmer.jpeg",
            "description": "<p>Xinhua In recent years, Zimbabwe’s blueberry industry has grown rapidly, bringing local farmers higher incomes. This year, producers are setting their sights on exporting blueberries to China, one of the world’s largest and most lucrative markets.   HARARE, Sept. 25 (Xinhua) — Inside a greenhouse located in Zimbabwe’s Mashonaland West Province, workers carefully hand-pick fresh blueberries</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-blueberry-farmers-set-sights-on-chinas-lucrative-market/\">Zimbabwean blueberry farmers set sights on China’s lucrative market</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "26 Sep 2025"
        },
        {
            "title": "“Consider debt cancellation to alleviate the economic burden” – Zimbabwe Christian leaders say",
            "url": "https://www.newzimbabwe.com/consider-debt-cancellation-to-alleviate-the-economic-burden-zimbabwe-christian-leaders-say/",
            "content": "ACI Africa\n\nMembers of theZimbabwe Heads of Christian Denominations(ZHOCD) marked theInternational Day of Peacewith an appeal to the international community to cancel Zimbabwes debt, saying such a step would help revive the countrys economy, reduce poverty, and build lasting peace.\n\nZimbabwe is struggling with an US$8.3 billion debt, mostly in arrears, which blocks access to affordable international financing and slows economic recovery.\n\nIn a joint statementpublishedon X by theZimbabwe Council of Churches(ZCC), the ZHOCD body which consists of theZimbabwe Catholic Bishops Conference(ZCBC),Evangelical Fellowship of Zimbabwe(EFZ), and theUnion for Development of Apostolic Churches in Zimbabwe Africa(UDACIZA), the Christian leaders stressed that peace cannot be separated from social and economic well-being.\n\nOn this International Peace Day, we urge international partners to consider debt cancellation to alleviate the economic burden on our nation and local leadership to alleviate the situation and arrest the social evils that threaten the very fibre of our society, members of ZHOCD said in their collective statement dated September 21.\n\nSuch a step could enable Zimbabwe to redirect critical resources towards vital sectors like healthcare, education, and infrastructure development, addressing poverty and inequality, they added.\n\nThe Christian leaders from reflected on the state of peace in the Southern African nation, saying that despite the countrys good security, the people of God are still experiencing injustices and inequalities.\n\nThey noted that while Zimbabwe is not embroiled in outright violence or war, the situation of the country can be characterised as negative peace, a concept they said highlights the absence of direct violence but presence of underlying structural injustices and inequalities.\n\nThe Church leaders said Zimbabwe is grappling with economic hardships, political polarisation, and social injustices.\n\nThey specifically pointed out social ills like drug and substance abuse, gross domestic violence, and armed robberies that they described as a worrisome phenomenon that impacts the well-being of the people, particularly vulnerable groups like women, youths, and persons with disabilities.\n\nThe members of ZHOCD called upon all political leaders in Zimbabwe to prioritise peace, justice, and the human rights of Zimbabweans, especially the vulnerable.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/08111459/harare.jpeg",
            "description": "<p>ACI Africa Members of the Zimbabwe Heads of Christian Denominations (ZHOCD) marked the International Day of Peace with an appeal to the international community to cancel Zimbabwe’s debt, saying such a step would help revive the country’s economy, reduce poverty, and build lasting peace. Zimbabwe is struggling with an US$8.3 billion debt, mostly in arrears, which</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/consider-debt-cancellation-to-alleviate-the-economic-burden-zimbabwe-christian-leaders-say/\">“Consider debt cancellation to alleviate the economic burden” – Zimbabwe Christian leaders say</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "26 Sep 2025"
        },
        {
            "title": "Politburo Reshuffle: Mpofu demoted over failure to unite Zanu PF, suspected links to corruption dossier",
            "url": "https://www.newzimbabwe.com/politburo-reshuffle-mpofu-demoted-over-failure-to-unite-zanu-pf-suspected-links-to-corruption-dossier/",
            "content": "By Staff Reporter\n\nZanu PFs Obert Mpofu was removed from his influential position as the ruling party Secretary General amid suspicions he had knowledge of the origins of a corruption dossier recently tabled before the politburo.\n\nPresident Emmerson Mnangagwa reassigned Mpofu to the relatively minor post of Secretary for Information and Communication Technology (ICT) in a politburo reshuffle announced this week.\n\nZanu-PFs politburo is the partys highest decision-making body, and its resolutions are binding.\n\nAccording to Zanu PF activist Tonderai Chidawa, Mpofus demotion reflects concerns within the party over his leadership and his possible ties to the dossier that implicated senior officials in corruption.\n\nChidawa alleges Mpofu failed to unite the party, whose membership, he claims, is fragmented.\n\nMpofu was replaced by the Speaker of the National Assembly, Jacob Mudenda, who previously served as Treasurer General.\n\nSpeaking to a local online TV channel, Chidawa said, He (Mpofu) was failing to unite the party. The party is disintegrated.\n\nChidawa further questioned why Mpofus name was absent from the dossier, suggesting this as evidence that Mpofu had an idea of its source.\n\nWhy is his name not being mentioned in the dossier?\n\nOn Monday, Zanu PF spokesperson Christopher Mutsvangwa stated that the politburo did not discuss the dossier at length, claiming its originator was unknown but believed to be based in South Africa.\n\nThe dossier, which Mutsvangwa said the politburo barely acknowledged, included names such as controversial business tycoons Wicknell Chivayo and Kudakwashe Tagwirei. Vice President Constantino Chiwenga reportedly questioned Mnangagwa as to why those named as corrupt had not been arrested.\n\nChidawa also claimed that Zanu PFs grassroots support in the Matebeleland Provinces erupted in celebration upon hearing news of Mpofus demotion.\n\nPeople are celebrating. There are celebrations in Matebeleland. We are talking of the downfall of a man who owns many big buildings in Bulawayo and Victoria Falls, he said.\n\nThe Zanu PF succession war is reaching a new crescendo as factions aligned to Mnangagwa and Chiwenga vie for power.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/08/02042119/Obert-Mpofu.jpg",
            "description": "<p>By Staff Reporter Zanu PF’s Obert Mpofu was removed from his influential position as the ruling party Secretary General amid suspicions he had knowledge of the origins of a corruption dossier recently tabled before the politburo. President Emmerson Mnangagwa reassigned Mpofu to the relatively minor post of Secretary for Information and Communication Technology (ICT) in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/politburo-reshuffle-mpofu-demoted-over-failure-to-unite-zanu-pf-suspected-links-to-corruption-dossier/\">Politburo Reshuffle: Mpofu demoted over failure to unite Zanu PF, suspected links to corruption dossier</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "26 Sep 2025"
        },
        {
            "title": "South African house duo Liquideep reunites after hiatus",
            "url": "https://www.newzimbabwe.com/south-african-house-duo-liquideep-reunites-after-hiatus/",
            "content": "Kaya 959\n\nBeloved South African house music duo Liquideep has officially reunited, ending a long hiatus that left fans longing for their signature sound.\n\nThe group, composed of Jonathan Ziyon Hamilton and Thabo Ryzor Shokgolo, made the exciting announcement on 24 September 2025, through a humorous video posted on the social media platform X.\n\nThe clip, which quickly went viral, shows the pair comically discussing their past fame before teasing their reunion, sparking a wave of excitement across social media.\n\nFormed in Johannesburg in 2007, Liquideep quickly rose to prominence, becoming a staple in the local music scene. Their debut album,Fabrics of the Heart, achieved multi-platinum status, producing chart-topping hits like Alone and Fairytale.\n\nThe duos success was cemented at the 2011 South African Music Awards, where they took home several accolades, solidifying their place as one of the countrys most successful house acts.\n\nFollowing their reunion announcement, Liquideep has already lined up several performances, with a show scheduled in Durban on 1 November and another in Bloemfontein. While the duo has not yet announced a new album, a recent remake of their classic track BBM has fans speculating about new material.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/25160715/Liquideep-1.jpg",
            "description": "<p>Kaya 959 Beloved South African house music duo Liquideep has officially reunited, ending a long hiatus that left fans longing for their signature sound. The group, composed of Jonathan “Ziyon” Hamilton and Thabo “Ryzor” Shokgolo, made the exciting announcement on 24 September 2025, through a humorous video posted on the social media platform X. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-african-house-duo-liquideep-reunites-after-hiatus/\">South African house duo Liquideep reunites after hiatus</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "26 Sep 2025"
        },
        {
            "title": "Nketsi denies rumours she is dating Mbau’s partner Kudzai Mushonga",
            "url": "https://www.newzimbabwe.com/nketsi-denies-rumours-she-is-dating-mbaus-partner-mushonga/",
            "content": "The Citizen\n\nReality TV star Faith Nketsi has set the record straight on claims she is dating Khanyi Mbaus partner, Kudzai Mushonga.\n\nGossip blogMaphepha Ndabaclaimed Nketsi was Mushongas new flame, posting a picture of the two together.\n\nNketsi has since denied the rumours, explaining that Mushonga and another man, who was cropped out of the picture, asked to take a photo with her.\n\nPlease neh. Since no one wants to come forward and say something, therefore creating a false narrative. Im not with Kudzai. NEVER WILL, NEVER BEEN AND NEVER WOULD BE. Can a girl just travel in peace? Nketsi wrote on her Instagram Stories.\n\nNketsi has not gone public with a relationship since her split from businessman Nzuzo Njilo, which ended in divorce in November 2023, less than a year aftertheir April 2022 wedding.\n\nNketsi and herHave Faithcast member and friend Andzelo Tivani are currently travelling.\n\nA few days ago, they jetted off to Germany for Drakes $ome $pecial $hows 4 EU ($$$4EU) tour, which made a stop in Hamburg.\n\n24 hours in Germany to catch Drake concert, Nketsi wrote, captioning pictures and videos of their trip.\n\nOn Wednesday, she shared more travel content from Italy, including a boat cruise and lunch at a beachside restaurant.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/25154030/nketsi-kudzai.png",
            "description": "<p>The Citizen Reality TV star Faith Nketsi has set the record straight on claims she is dating Khanyi Mbau’s partner, Kudzai Mushonga. Gossip blog Maphepha Ndaba claimed Nketsi was Mushonga’s new flame, posting a picture of the two together. Nketsi has since denied the rumours, explaining that Mushonga and another man, who was cropped out of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nketsi-denies-rumours-she-is-dating-mbaus-partner-mushonga/\">Nketsi denies rumours she is dating Mbau’s partner Kudzai Mushonga</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "26 Sep 2025"
        }
    ]
}