{
    "news": [
        {
            "title": "SA: R680,000 fines imposed on 68 employers for hiring illegal foreign workers",
            "url": "https://www.newzimbabwe.com/sa-r680000-fines-imposed-on-68-employers-for-hiring-illegal-foreign-workers/",
            "content": "The Department of Employment and Labour (DEL) has slapped 38 employers with fines amounting to R68 000 for hiring illegal foreign nationals without valid work permits in contravention of immigration laws.\n\nIn a parliamentary reply, Minister Nomakhosazana Meth said her department conducts blitz inspections in collaboration with the Department of Home Affairs and the police.\n\nMeth said her departments mandate was to enforce the implementation of labour laws to ensure the protection of workers, while the Department of Home Affairs scrutinised the validity of visas and work permits through the application of immigration laws.\n\nIn the event of non-compliance with immigration laws, the Department of Home Affairs arrests the non-compliant employers and employees.\n\nMeth said during the blitz, 68 employers and 322 foreign nationals were found on the wrong side of the law across the nine provinces.\n\nWith respect to the 68 employers arrested, each employer paid an admission of guilt fine to the amount of R10 000. Therefore, the total amount paid in lieu of fines is R680 000 while the 322 employees were taken for further processing as per immigration requirements, she said.\n\nMeths response showed that Eastern Cape led the pack with 34 employers that flouted the laws and were fined a collective R340 000, followed by Mpumalanga with 15, Limpopo eight, KwaZulu-Natal five, and two in the Western Cape.\n\nShe also said of the 322 foreign employees that were arrested, the largest number, 163, were from Limpopo.\n\nThe Western Cape came second with foreign nationals at 43, Eastern Cape and Gauteng at 34 each, Mpumalanga 30, KwaZulu-Natal 16, and Free State two.\n\nIn a separate response to another set of questions, Meth said her department received 6 255 work permit applications between April 2023 and March last year.\n\nShe said the role of her department was to make recommendations on corporate work visa applications regarding the availability of local labour in various categories.\n\nThe Department of Home Affairs makes final decisions or waive any recommendation made by any of these three departments after following their final internal processes or after consulting further with other departments such as those in the security cluster.\n\nShe added that of the 60 corporate applications her department received and processed, 5 383 were rejected.\n\nA total of 872 work visas for migrant workers were recommended.\n\nThe applications were mainly from foreign nations from Zimbabwe with 445, Lesotho with 250, Mozambique 86, and Namibia 70.\n\nThe applications were for mining, agriculture, and education and training.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/19051751/Employment-and-Labour-Minister-Nomakhosazana-Meth-Picture-Bheki-Radebe-Independent-Newspapers.webp",
            "description": "<p>The Department of Employment and Labour (DEL) has slapped 38 employers with fines amounting to R68 000 for hiring illegal foreign nationals without valid work permits in contravention of immigration laws. In a parliamentary reply, Minister Nomakhosazana Meth said her department conducts blitz inspections in collaboration with the Department of Home Affairs and the police.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sa-r680000-fines-imposed-on-68-employers-for-hiring-illegal-foreign-workers/\">SA: R680,000 fines imposed on 68 employers for hiring illegal foreign workers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:29",
            "date": "19 Feb 2025"
        },
        {
            "title": "Mozambique’s national airline suspends Maputo-Lisbon route, citing unsustainability",
            "url": "https://www.newzimbabwe.com/mozambiques-national-airline-suspends-maputo-lisbon-route-citing-unsustainability/",
            "content": "Xinhua\n\nMozambique Airlines (LAM), the national flag carrier of the southern African country, has announced the suspension of its Maputo-Lisbon flights starting Wednesday, citing accumulated losses of more than 21 million U.S. dollars since 2023.\n\nAs long as the company is not well-organized and we continue to face irregularities in domestic flights, we cannot aim for major operations, LAM spokesperson Alfredo Cossa told a press conference in Maputo on Tuesday.\n\nThe route, which had been resumed on Nov. 20, 2023, after nearly 12 years of suspension, was part of the airlines revitalization plan under the management of the South African firm Fly Modern Ark.\n\nOperated with a 302-seat Boeing 777 in partnership with EuroAtlantic, the route connected the capitals of Mozambique and Portugal three times a week.\n\nHowever, according to Cossa, the airlines new board concluded that the operation was unsustainable.\n\nWe were financing this route using funds from the domestic market, he said. We produced and paid, but we have now reached a point where we can no longer sustain it.\n\nIn addition to suspending the Lisbon route, LAM also canceled flights between Maputo and Harare, Zimbabwe, and between Maputo and Lusaka, Zambia, due to the same reason.\n\nFor the 1,080 passengers who had already purchased tickets for the flights, Cossa said, LAM will make alternative travel arrangements through agreements with other operators.\n\nOnce we have restructured and consolidated our position, we will look toward intercontinental and regional operations, the spokesperson added.\n\nThe decision to suspend international routes aligns with LAMs 100-Day Governance Plan, which seeks to assess operational performance and strengthen the quality of domestic and regional services, Cossa said.\n\nFor years, LAM has struggled with operational challenges, including a reduced fleet, lack of investment, and non-fatal incidents linked to poor aircraft maintenance.\n\nIn February, the Mozambican government approved the sale of a 91 percent state-owned stake in LAM to public companies, aiming to raise 130 million dollars for the acquisition of eight new aircraft and the airlines restructuring.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/19051537/moza-airline.jpg",
            "description": "<p>Xinhua Mozambique Airlines (LAM), the national flag carrier of the southern African country, has announced the suspension of its Maputo-Lisbon flights starting Wednesday, citing accumulated losses of more than 21 million U.S. dollars since 2023. “As long as the company is not well-organized and we continue to face irregularities in domestic flights, we cannot aim</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mozambiques-national-airline-suspends-maputo-lisbon-route-citing-unsustainability/\">Mozambique’s national airline suspends Maputo-Lisbon route, citing unsustainability</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:29",
            "date": "19 Feb 2025"
        },
        {
            "title": "Jalai stays put at Dynamos, rewarded with armband",
            "url": "https://www.newzimbabwe.com/jalai-stays-put-at-dynamos-rewarded-with-armband/",
            "content": "By Sport Reporter\n\nDynamos have rewarded Emmanuel Jalai for his loyalty to the club by appointing him as team captain for the 2025 season.\n\nThis was confirmed by the club on Tuesday via its social media handles.\n\nJalai is currently the longest-serving player at the club which he joined in 2019.\n\nThe 25-year-old defender was the only Dynamos player to make it on the 2024 Premier Soccer League calendar after a good outing which saw him getting several national team call-ups.\n\nDembare had a mass player exodus; more than 10 players left the team including last seasons captain Frank Makarati who joined Tel One, industrious midfielder Donald Mudadi who went to Simba Bhora and Tanaka Shandirwa who is now at CAPS United.\n\nJalais signature was being chased by several topflight league teams: Manica Diamonds, Simba Bhora and league newcomers Scottland, but the defender opted to stay at Dynamos.\n\nThe current teams head coach Lloyd Mablanyo Chigowe signed him at the club in 2019 during his first stint as the teams gaffer.\n\nMablanyo is believed to have played a critical role for the right back to stay at the club following the expiryof his contract in December last year.\n\nAlthough details of Jalais new contract have not been revealed, the Warriors defender will lead the pack on Saturday when they face Simba Bhora in the Castle Challenge Cup match scheduled to be played at Rufaro stadium.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/02/18144839/200853473_277859160786955_7126518592801743654_n.jpg",
            "description": "<p>By Sport Reporter Dynamos have rewarded Emmanuel Jalai for his loyalty to the club by appointing him as team captain for the 2025 season. This was confirmed by the club on Tuesday via its social media handles. Jalai is currently the longest-serving player at the club which he joined in 2019. The 25-year-old defender was</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/jalai-stays-put-at-dynamos-rewarded-with-armband/\">Jalai stays put at Dynamos, rewarded with armband</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:29",
            "date": "19 Feb 2025"
        },
        {
            "title": "9 527 illicit drug offenders arrested, 79 bases destroyed",
            "url": "https://www.newzimbabwe.com/9-527-illicit-drug-offenders-arrested-79-bases-destroyed/",
            "content": "By Thandiwe Garusa\n\nA total of 9 527 people were arrested in the past five months for supplying and using drugs and substances, while 79 bases were destroyed, the government has said.\n\nZimbabwe is grappling with an alarming rise in drug and substance abuse cases, particularly among the youth.\n\nAs a result, President Emmerson Mnangagwa last year launched a multi-sectoral drug and substance abuse plan to fight the scourge.\n\nAddressing the media during a post-cabinet briefing on Tuesday, Information Minister Jenfan Muswere said that through international law enforcement, three people were also arrested after they were found in possession of 23 kilograms of dagga.\n\nCabinet wishes to advise the nation that during the period under review, 79 illegal drug bases were destroyed, with a total of 9 527 offenders arrested.\n\nOf this total, 616 were suppliers while 8 911 were end users.\n\nCollaboration with international law enforcement agencies led to the arrest of three people carrying 23 kilograms of dagga in Zambia.\n\nThe Medicines Control Authority of Zimbabwe conducted 117 inspections and closed five non-compliant premises, Muswere said.\n\nAs part of intensified efforts to end drug abuse, the government has also added drug and substance abuse awareness to the school curriculum.\n\nThe Ministry of Primary and Secondary Education has integrated drug and substance abuse into the school curricula, reaching 7,274,939 learners, while 62,656 students were engaged in prevention programmes through the Ministry of Higher and Tertiary Education, Innovation, Science and Technology Development, Muswere added.\n\nThe information minister also announced that three new rehabilitation centres were established in Victoria Falls, Harare, and Kwekwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/07/01024100/Drug-and-Substance-Abuse.png",
            "description": "<p>By Thandiwe Garusa A total of 9 527 people were arrested in the past five months for supplying and using drugs and substances, while 79 bases were destroyed, the government has said. Zimbabwe is grappling with an alarming rise in drug and substance abuse cases, particularly among the youth. As a result, President Emmerson Mnangagwa</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/9-527-illicit-drug-offenders-arrested-79-bases-destroyed/\">9 527 illicit drug offenders arrested, 79 bases destroyed</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:29",
            "date": "19 Feb 2025"
        },
        {
            "title": "Shut up and just do the work! Uebert Angel tells ZANU PF faction pushing for extension of Mnangagwa’s term",
            "url": "https://www.newzimbabwe.com/shut-up-and-just-do-the-work-uebert-angel-tells-zanu-pf-faction-pushing-for-extension-of-mnangagwas-term/",
            "content": "By Darlington Gatsi\n\nPRESIDENT Emmerson Mnangagwas ally Uebert Angel has criticised a faction within the ruling Zanu PF party that is pushing for the extension of the presidents term limit beyond the constitutionally stipulated two terms.\n\nZanu PF is currently divided, with one faction advocating for Mnangagwa to remain in office beyond the expiration of his current term, while the other insists on respecting the constitutional limits. These internal divisions have spilled into the public domain, fracturing the ruling party.\n\nSeveral government ministers, including Jenfan Muswere, Daniel Garwe, and Tinoda Machakaire, are among those backing the move to disregard the constitution by allowing Mnangagwa to remain in power until 2030.\n\nIn a recent sermon, Angel who is theAmbassador at Large to Europe and the Americas, condemned the calls by these cabinet ministers, describing them as retrogressive and damaging to Mnangagwas reputation.\n\nWe should be talking about targets for this road. Target next week. Target next week for this one. Target next week for that hospital. Target next week for this one.\n\nIf the president has already said he is not interested in [extending his term], focus on when we are putting a road here. Some of these politicians are the ones that give good people bad names because they party at night, but we, the public, get the hangover.\n\nYou dont have a place to stay. People are arguing over stupid things. Is it 2030? Is it 2033? Is it 2024? Shut up. Lets just do the work. I normally dont comment on this.\n\nWhy do you speak for the man who has already said, Im not going there. Im not interested in that? Just do your thing, said Angel.\n\nAngel made headlines in 2023 following the release of Al Jazeeras Gold Mafia documentary which exposed him as a key player in the money laundering and gold smuggling syndicate. In the expos he offered to assist undercover journalists pretending to be Chinese gangsters with money to launder.\n\nI look at the political dialogue in this country, where people are fighting. They are fighting. Who said hes going to 2030? Who said hes going to 2018? Who said hes going until 2033? From both sides, something is wrong, he added.\n\nWhile Muswere, Garwe, and Machakaire have been vocal in their push for the term extension, their performances in their respective ministerial roles have come under scrutiny for delivering lacklustre results.\n\nTheir calls also contradict Mnangagwas public declaration that he will not run for the presidency in the next elections, scheduled for 2028.\n\nHowever, Mnangagwas refusal has been questioned, as he has not publicly rebuked the faction aligned with him.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/03/31042023/Mnangagwa-Angel.png",
            "description": "<p>By Darlington Gatsi PRESIDENT Emmerson Mnangagwa’s ally Uebert Angel has criticised a faction within the ruling Zanu PF party that is pushing for the extension of the president’s term limit beyond the constitutionally stipulated two terms. Zanu PF is currently divided, with one faction advocating for Mnangagwa to remain in office beyond the expiration of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/shut-up-and-just-do-the-work-uebert-angel-tells-zanu-pf-faction-pushing-for-extension-of-mnangagwas-term/\">Shut up and just do the work! Uebert Angel tells ZANU PF faction pushing for extension of Mnangagwa’s term</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:29",
            "date": "19 Feb 2025"
        },
        {
            "title": "Harare City Council executives blow US$1 million from City Parking on posh cars, US$120,000 a year on holidays amid poor service delivery",
            "url": "https://www.newzimbabwe.com/harare-council-executives-blow-us1-million-from-city-parking-on-posh-cars-us120000-a-year-on-holidays-amid-poor-service-delivery/",
            "content": "By Darlington Gatsi\n\nHARARE Mayor Jacob Mafume has exposed a can of worms regarding how Council executives embezzled over US$1 million to purchase the latest vehicles in an inexplicable scheme.\n\nMafume made these revelations on Tuesday as he concluded his testimony before the Commission of Inquiry, which is investigating the operations of the Harare City Council.\n\nIn 2023, the Harare City Council (HCC) executive, led by the then Town Clerk Hosiah Chisango, purchased Toyota Fortuners using remittances from Harare City Parka subsidiary of the HCC.\n\nMafume revealed that the vehicles are being used by top officials, and no action has been taken to explain the purchase, which was made without the Councils approval.\n\nThat is one of the biggest challenges because last year City Parking brought to the City Council about a million. When we started asking where that US$1 million went that is where the problem began and I am told that the US$1 million was used to purchase executive cars or Fortuners and so forth, said Mafume.\n\nMafume told the Commission, led by retired Justice Maphios Cheda, that the purchase of the top-of-the-range vehicles was made when the Council was dissolved before the elections.\n\nIt happened towards 2023. Towards the elections. City Parking used to enforce one by-law which is the parking by-law then we made a resolution for them to enforce another by-law to give them two.\n\nThe sharing of the revenue was that they collect the revenue and we get 50 percent of that. Now because it was the first time they implemented that by-law, it raised US$2 million and the US$1 million was then remitted to the City Council.\n\nWe were going to the elections and the City Council dissolved. When we came back we said what happened with that US$1 million because we had earmarked it for doing the parking and all that. We were told that it was used. What it was used for and how it was used and we then learnt that purchases of vehicles for the Executives had been done in the time whilst we had the electioneering, he said.\n\nThe chaos currently reigning at the Town House has been attributed to the lack of a functioning Electronic Resource Planning (ERP) system.\n\nThe absence of an ERP system has resulted in financial mismanagement and unaccounted leakages of funds by the City Council.\n\nThe Commission of Inquirys evidence leader, Thabani Mpofu, revealed that executives at the Council are spending US$125,000 per year on holidays. The Town Clerk is entitled to one international trip per year, while other executives are entitled to a regional trip.\n\nThese holidays are paid for using ratepayers money, which the Council has claimed it does not have, hence the poor service delivery in the city.\n\nWhen questioned about the astronomical figures, Mafume professed ignorance, stating that he was shocked by the amounts.\n\nFrom the figures, I will have no right to dispute those figures they do not come through me. I have no access to that. I am actually shocked at the figures and the information because they come at a time when we as Councillors are being asked and everybody is being asked to tighten their belts. Others are loosening, said Mafume.\n\nMeanwhile, the Commission of Inquiry has completed its public hearings. The Commission will compile a report, which will be presented to President Emmerson Mnangagwa upon finalisation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/02040727/mafume-chisango.jpeg",
            "description": "<p>By Darlington Gatsi HARARE Mayor Jacob Mafume has exposed a can of worms regarding how Council executives embezzled over US$1 million to purchase the latest vehicles in an inexplicable scheme. Mafume made these revelations on Tuesday as he concluded his testimony before the Commission of Inquiry, which is investigating the operations of the Harare City</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-council-executives-blow-us1-million-from-city-parking-on-posh-cars-us120000-a-year-on-holidays-amid-poor-service-delivery/\">Harare City Council executives blow US$1 million from City Parking on posh cars, US$120,000 a year on holidays amid poor service delivery </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:29",
            "date": "19 Feb 2025"
        },
        {
            "title": "Zimbabwe pushes landmine clearance deadline to 2028 due to funding gaps",
            "url": "https://www.newzimbabwe.com/zimbabwe-pushes-landmine-clearance-deadline-to-2028-due-to-funding-gaps/",
            "content": "By Thandiwe Garusa\n\nZimbabwes efforts to clear landmines and explosive remnants of the war have been delayed due to a lack of funding and disruptions by the Covid-19 pandemic.\n\nThe landmines were put in by Rhodesian colonial forces during the fight for independence in the 1970s to stop freedom fighters from moving to and from Zambia and Mozambique.\n\nThe government has been working towards achieving a landmine-free environment by December 2025 however the deadline has been pushed to 2028 due to financial challenges.\n\nSpeaking at the national stakeholders dialogue on humanitarian demining and mine victim assistance Tuesday, Defence Minister Oppah Muchinguri said changes in financial support from international donors have affected the demining project.\n\nOur projection was to complete demining by December 2025. This is no longer realisable due to challenges associated with the outbreak of the Covid-19 pandemic and fluctuation in funding from the international donor community.\n\nAs a result, we are working on submitting another three-year extension request to the Secretariat of the Treaty.\n\nThe funding gap as at September 2024 and completion of mine clearance in Zimbabwe by 2028 was US$23.79 million. Muchinguri said.\n\nShe addedthatthe government will keep funding the demining project.\n\nOn its part, the Government of Zimbabwe will continue to fund the National Mine Clearance Unit which requires a minimum of US$2,000,000 per year.\n\nIt is our hope that deliberations during this workshop will help unlock funding for mine action in Zimbabwe as completion of mine clearance hinged on sustained funding from the government and current and new donors.\n\nCompletion of mine clearance in Zimbabwe will not only help enhance safety and security in affected communities but will also go a long way in unlocking sustainable socio-economic development, she added.\n\nSince 1980, landmines have killed or injured over 1,500 people, while more than 120,000 livestock have also died as a result.\n\nThese minefields are in six provincesMatabeleland North, Mashonaland West, Mashonaland Central, Mashonaland East, Manicaland, and Masvingocovering 310,650 square kilometers.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/09/13122619/oppah-kazembe-e1712810265882.jpg",
            "description": "<p>By Thandiwe Garusa Zimbabwe’s efforts to clear landmines and explosive remnants of the war have been delayed due to a lack of funding and disruptions by the Covid-19 pandemic. The landmines were put in by Rhodesian colonial forces during the fight for independence in the 1970s to stop freedom fighters from moving to and from</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-pushes-landmine-clearance-deadline-to-2028-due-to-funding-gaps/\">Zimbabwe pushes landmine clearance deadline to 2028 due to funding gaps</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:29",
            "date": "19 Feb 2025"
        },
        {
            "title": "Informal retailers must abide by set labour standards  – Commercial Workers Union",
            "url": "https://www.newzimbabwe.com/informal-retailers-must-abide-by-set-labour-standards-commercial-workers-union/",
            "content": "By Alois Vinga\n\nTHE Commercial Workers Union of Zimbabwe (CWUZ) has implored the government to compel the informal retail sector to comply with appropriate employment standards if beneficial formalization is to see the light of day.\n\nThe calls come shortly after regional retailer Choppies Enterprise Limited (Choppies) and British multinational professional services and fast-moving consumer goods firms, PricewaterhouseCoopers International Limited and Unilever plc indicatedthey wouldshut downoperations in Zimbabwe.\n\nFirms like cement manufacturer Khayah Cement Limited and clothing retailer Truworths Limited entered corporate rescue in December and August 2024, respectively.\n\nEven the most resilient brands like OK Zimbabwe which have stood the test of rough economic periods in Zimbabwe are now struggling to fill up their shelves.\n\nThe retail sector has blamed the rapid growth of informality in Zimbabwe as chief among the causes prompting unfair competition which is now pushing the formal sector out of business. The shadow economy is also enjoying easy access to foreign currency and tax evasions.\n\nIn a bid to ease informalisation of the sector, Finance Minister, Mthuli Ncube this week recommended a raft of measures which include the adoption of e-money and use of bank accounts for all businesses.\n\nBut speaking to NewZimbabwe.com, CWUZ General Secretary, Cuthbert Chikwekwete implored the government to consider compelling the informal sector to abide by appropriate labour standards if formalization is to subsist.\n\nThe formalization agenda cannot be complete if players in the shadow economy are not compelled to follow the retail sectors set standards. These tuck shop owners continue to enjoy easy operating conditions such as underemployment where they hire two or three employees and overwhelm them with mammoth tasks. Their employees are often not allowed to join trade unions and most of the business owners resist becoming a part and parcel of the National Employment Council, he said.\n\nThe workers leader also criticized the informal sector for subjecting short-staffed workers to long hours of work with poor remuneration.\n\nOne would note that at a time when OK Zimbabwe and Spar entities are contributing immensely to fiscus through Pay As You Earn (PAYE), the informal sector which creams off a huge chunk of the retail sectors profits is not injecting anything at all. The revenue leakages through the sector could be larger than anticipated, he said.\n\nChikwekwete added that there is an urgent need for the government to join hands and compel all informal players to contribute towards the fiscus and Social Protection of their workers as the nation journeys towards formalization.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/05/28154248/pic.png",
            "description": "<p>By Alois Vinga THE Commercial Workers Union of Zimbabwe (CWUZ) has implored the government to compel the informal retail sector to comply with appropriate employment standards if beneficial formalization is to see the light of day. The calls come shortly after regional retailer Choppies Enterprise Limited (Choppies) and British multinational professional services and fast-moving consumer</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/informal-retailers-must-abide-by-set-labour-standards-commercial-workers-union/\">Informal retailers must abide by set labour standards  – Commercial Workers Union</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:29",
            "date": "19 Feb 2025"
        },
        {
            "title": "ARTUZ calls on govt to scrap two examination boards for Ordinary, Advanced Level",
            "url": "https://www.newzimbabwe.com/artuz-calls-on-govt-to-scrap-two-examination-boards-for-ordinary-advanced-level/",
            "content": "By Alois Vinga\n\nTHE Amalgamated Rural Teachers Union of Zimbabwe (ARTUZ) has implored the government to scrap the current set-up of two examination boards for Ordinary and Advanced Level students arguing that this is increasing inequalities among learners.\n\nStudents in the country can sit for their examinations under the Zimbabwe Schools Examinations Council (ZIMSEC) board while those who can afford can opt for the University of Cambridge exams board.\n\nHowever, the teachers group contends that some learners have enjoyed the prestige of the foreign examinations board, diminishing the value of equality in education.\n\nARTUZ reiterates its demand for a single examination board that serves all candidates, regardless of their socioeconomic status. The current system, which favours elites who can afford Cambridge examinations, is discriminatory and perpetuates inequality.\n\nIt is deeply concerning that duty bearers, including government officials, continue to neglect ZIMSEC while their own children sit for Cambridge examinations, the union said.\n\nIn the wake of ZIMSEC exam registrations, the teachers group bemoaned chronic underfunding of the local exams body and called for the urgent availing of resources by the government.\n\nThe teachers union castigated ZIMSECs higher fees for private candidates saying they are unjust and exploitative and warned that the excess funds collected from private candidates are likely to be lost to corruption, further undermining the integrity of the examination system.\n\nThe lobby group said the gazetted US$11 and US$24 to be paid subject to payment by O and ALevel students is way beyond affordability and brings to question whether the governments subsidies towards basic education still exist.\n\n The governments claim of covering 55% of the fees is a fabrication designed to create the illusion of support while shifting the burden onto parents and guardians, added ARTUZ.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/04192721/Zimbabwe-Examination-pupil.jpeg",
            "description": "<p>By Alois Vinga THE Amalgamated Rural Teachers Union of Zimbabwe (ARTUZ) has implored the government to scrap the current set-up of two examination boards for Ordinary and Advanced Level students arguing that this is increasing inequalities among learners. Students in the country can sit for their examinations under the Zimbabwe Schools Examinations Council (ZIMSEC) board</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/artuz-calls-on-govt-to-scrap-two-examination-boards-for-ordinary-advanced-level/\">ARTUZ calls on govt to scrap two examination boards for Ordinary, Advanced Level</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:29",
            "date": "19 Feb 2025"
        },
        {
            "title": "Government approves transfer of Zimbabwean prisoners from SADC countries",
            "url": "https://www.newzimbabwe.com/government-approves-transfer-of-zimbabwean-prisoners-from-sadc-countries/",
            "content": "By Staff Reporter\n\nZimbabweans serving prison sentences in SADC countries will complete their sentences back home following the governments approval of the ratification of SADC Inter-State Protocol on the transfer of sentenced offenders.\n\nUnder the protocol, Zimbabwe will also be able to send convicted offenders from neighbouring nations back to their home countries to complete their sentences.\n\nSpeaking during a post-cabinet briefing Tuesday, Information Minister Jenfan Muswere said the transfer will only happen after an agreement between the country where the person was convicted and their home country that will take over imprisonment.\n\nCabinet received and approved the proposal for ratification of the SADC Inter-State Protocol on the transfer of sentenced offenders, as presented by the Minister of Justice, Legal and Parliamentary Affairs, Honourable Ziyambi Ziyambi, as Chairperson of the Cabinet Committee on Legislation.\n\nOn 18 August 2019, President Emmerson Mnangagwa signed the SADC Inter-State Protocol on the transfer of sentenced offenders.\n\nThe objective of the protocol is to facilitate the transfer of sentenced offenders from foreign territories they would be serving prison sentences, to enable them to serve the remaining sentences in their home countries.\n\nIn terms of the protocol, the transfer of sentenced offenders may take place upon request and with the consent of the sentencing and the administering states, Muswere said.\n\nThe majority of foreign nationals arrested in Zimbabwe would be attempting to illegally cross to neighbouring South Africa for greener pastures with Zimbabwe serving as a key transit route.\n\nAs of October last year, Harare remand prison had illegal immigrants who had stayed in custody for overten years awaiting deportation.\n\nImmigration Chief Director Respect Gono last year told state-controlled media that as of September 2024, there were 368 jailed illegal immigrants, 274 were awaiting deportation, 61 were serving prison sentences and 33 were awaiting trial for various offences.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/05/31071600/prison-e1559283452384.jpg",
            "description": "<p>By Staff Reporter Zimbabweans serving prison sentences in SADC countries will complete their sentences back home following the government’s approval of the ratification of SADC Inter-State Protocol on the transfer of sentenced offenders. Under the protocol, Zimbabwe will also be able to send convicted offenders from neighbouring nations back to their home countries to complete</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/government-approves-transfer-of-zimbabwean-prisoners-from-sadc-countries/\">Government approves transfer of Zimbabwean prisoners from SADC countries </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:29",
            "date": "19 Feb 2025"
        }
    ]
}