{
    "news": [
        {
            "title": "ZAA partners with IOM, African Development Bank to strengthen diaspora engagement and investment",
            "url": "https://www.newzimbabwe.com/zaa-partners-with-iom-african-development-bank-to-strengthen-diaspora-engagement-and-investment/",
            "content": "By Own Correspondent\n\nThe Zimbabwe Achievers Awards (ZAA) has entered a landmark partnership with the International Organization for Migration (IOM) and the African Development Bank (AfDB) to scale up diaspora engagement and inclusive investment for Zimbabwes development. The collaboration is part of a multinational initiative by the African Development Bank Group (AfDB) and the International Organization for Migration (IOM) to leverage the African diasporas financial and professional contributions to strengthen economic growth and resilience in several African countries, including Zimbabwe.\n\nThe partnership will be anchored on the ZAA Diaspora Forum & Global Awards, a premier platform that connects Zimbabweans abroad with their homeland through structured dialogue, investment opportunities, and recognition of excellence. The collaboration comes at a crucial time when diaspora remittances and expertise are increasingly recognised as critical drivers of sustainable development across Africa.\n\nResearch by IOM has consistently shown that diaspora communities play a pivotal role in shaping national development through remittances, knowledge transfer, and skills development. Zimbabwes diaspora contributes significantly to the national economy, with remittances surpassing foreign direct investment in recent years. The AfDB has equally prioritised diaspora financing as a vital resource for economic transformation and resilience across the continent.\n\nThrough this tripartite partnership:\n\nSpeaking on the partnership, Conrad Mwanza, ZAA Founder, said:\n\nThis collaboration is a milestone in our mission to transform the Zimbabwean diaspora from being just remittance senders into full development partners. By working with IOM and AfDB, we are creating pathways for structured investments, innovation, and lasting impact.\n\nMs. Diana Cartier, IOM Zimbabwe Chief of Mission, added:\n\nBy formalizing partnerships such as this one with ZAA and the African Development Bank, we are ensuring that Zimbabweans abroad are not just celebrated for their achievements but are meaningfully engaged as drivers of social and economic development. IOM is committed to supporting frameworks that connect migration with sustainable growth.\n\nThe upcoming ZAA Diaspora Forum & Global Awards in Harare will serve as the launchpad for this collaboration, bringing together government leaders, private sector actors, and diaspora representatives to explore practical ways of turning geographical dispersion into a powerful national asset.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/28133357/IOM-Diana-Cartier.jpeg",
            "description": "<p>By Own Correspondent The Zimbabwe Achievers Awards (ZAA) has entered a landmark partnership with the International Organization for Migration (IOM) and the African Development Bank (AfDB) to scale up diaspora engagement and inclusive investment for Zimbabwe’s development. The collaboration is part of a multinational initiative by the African Development Bank Group (AfDB) and the International</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zaa-partners-with-iom-african-development-bank-to-strengthen-diaspora-engagement-and-investment/\">ZAA partners with IOM, African Development Bank to strengthen diaspora engagement and investment</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "28 Aug 2025"
        },
        {
            "title": "Nees names Warriors World Cup Qualifiers squad, Khama Billiat dropped due to injury",
            "url": "https://www.newzimbabwe.com/nees-names-warriors-world-cup-qualifiers-squad-khama-billiat-dropped-due-to-injury/",
            "content": "By Sports Reporter\n\nWarriors coach Michael Nees has named the Zimbabwe senior mens football team to represent the nation in the upcoming World Cup Qualifiers.\n\nThe Warriors are scheduled to play Benin on September 5 before hosting Rwanda in South Africa at Orlando Stadium four days later.\n\nOf the 23-man squad named, Scottland FC star Khama Billiat is a notable absenteewithZIFA statingthat the former Mamelodi Sundowns player is nursing an injury.\n\nBilliat, who was called out of international football retirement by Nees last year, is currently not in his best form, as he has started the last six games for Scottland FC on the bench.\n\nThe Mabvuku side has, however, dominated the team with four players in the squad: Godknows Murwira, Terence Dzvukamanja, Walter Musona, and Knowledge Musona.\n\nDynamos captain Emmanuel Jalai and MWOS FC goalkeeper Martin Mapisa also made it into the squad.\n\nWarriorsSquad for the FIFA World Cup 2026 Qualifiers  Benin and Rwanda:\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/08/23073751/WhatsApp-Image-2024-08-23-at-08.36.47.jpeg",
            "description": "<p>By Sports Reporter Warriors coach Michael Nees has named the Zimbabwe senior men’s football team to represent the nation in the upcoming World Cup Qualifiers. The Warriors are scheduled to play Benin on September 5 before hosting Rwanda in South Africa at Orlando Stadium four days later. Of the 23-man squad named, Scottland FC star</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nees-names-warriors-world-cup-qualifiers-squad-khama-billiat-dropped-due-to-injury/\">Nees names Warriors World Cup Qualifiers squad, Khama Billiat dropped due to injury</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "28 Aug 2025"
        },
        {
            "title": "Herentals booted out of COSAFA Championship despite Wednesday’s win",
            "url": "https://www.newzimbabwe.com/herentals-booted-out-of-cosafa-championship-despite-wednesdays-win/",
            "content": "By Sports Reporter\n\nHerentals Queens are out of the COSAFA Cup Championship despite Wednesdays 4-2 win over Comoros side Olympic de Morena.\n\nWednesdays match was a must-win match for The Students, who finished second in Group C with 3 points, following a 2-0 defeat at the hands of Mozambican side Costa do Sol on Saturday.\n\nOnly the top team from the three groups automatically qualified for the semi-finals, along with the second-best finisher.\n\nHerentals win against Morena was not enough to see them qualify as the second-best finisher, as they needed a five-goal margin win.\n\nMeanwhile, Herentals Queens defender Alice Moyo was voted Player of the Match in their game against Morena on Wednesday afternoon.\n\nMoyo scored a goal and provided an assist, making her the standout performer of the day.\n\nThe Womens CAF Champions League COSAFA qualifiers continue on Friday when Botswanas Gaborone United faces Mozambiques Costa do Sol in the first semi-final match, before South Africas Mamelodi Sundowns clash with Zesco Ndola Girls later in the day for the second semi-final match.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/28140129/herentals-.jpeg",
            "description": "<p>By Sports Reporter Herentals Queens are out of the COSAFA Cup Championship despite Wednesday’s 4-2 win over Comoros side Olympic de Morena. Wednesday’s match was a must-win match for The Students, who finished second in Group C with 3 points, following a 2-0 defeat at the hands of Mozambican side Costa do Sol on Saturday.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/herentals-booted-out-of-cosafa-championship-despite-wednesdays-win/\">Herentals booted out of COSAFA Championship despite Wednesday’s win</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "28 Aug 2025"
        },
        {
            "title": "Gruesome murders send Norton into panic as MP Tsvangirai calls for immediate investigations",
            "url": "https://www.newzimbabwe.com/gruesome-murders-send-norton-into-panic-as-mp-tsvangirai-calls-for-immediate-investigations/",
            "content": "By Staff Reporter\n\nIN the aftermath of the discovery of mutilated bodies in Norton recently, legislator Richard Tsvangirai has demanded speedy investigations into the gruesome murders.\n\nNorton was shaken to the core when the mutilated body of a man, Patrice Chipaumire, was discovered on Monday, before another, that of Jack Gedion, was found on Tuesday in disturbing circumstances.\n\nThe images of the bodies have since circulated on social media, with widespread speculation that they might be linked to ritual killings.\n\nIn a statement, Tsvangirai called for quick investigations into the murders that have sent Norton into a state of panic.\n\nI share in the deep sorrow and shock these events have caused. My heartfelt condolences go to the families who have lost their loved ones under such painful circumstances.\n\nPlease know that your grief is our grief, and you are not alone during this time. I have visited the bereaved families to offer my support and solidarity, and I will continue to walk with them through this difficult period.\n\nI have also spoken with law enforcement authorities and investigations are currently ongoing. Justice must not only be done; it must be seen to be done. We will not rest until answers are found and those responsible are held accountable, said Tsvangirai.\n\nTsvangirai also urged for an increase in police patrols in Norton to prevent any recurrence of such tragedies.\n\nI further call for intensified police patrols in the area to reassure residents and enhance community safety. To the people of Norton, I urge you to remain vigilant and avoid unnecessary movement during late hours.\n\nI know fear and uncertainty weigh heavily on us, but let us not lose our sense of community. Let us watch over one another, support the grieving, and remain calm as investigations unfold, said Tsvangirai.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/09/22050655/Richard-Tsvangirai-e1679426553746.jpg",
            "description": "<p>By Staff Reporter IN the aftermath of the discovery of mutilated bodies in Norton recently, legislator Richard Tsvangirai has demanded speedy investigations into the gruesome murders. Norton was shaken to the core when the mutilated body of a man, Patrice Chipaumire, was discovered on Monday, before another, that of Jack Gedion, was found on Tuesday</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/gruesome-murders-send-norton-into-panic-as-mp-tsvangirai-calls-for-immediate-investigations/\">Gruesome murders send Norton into panic as MP Tsvangirai calls for immediate investigations</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "28 Aug 2025"
        },
        {
            "title": "High court cannot be substituted for the executor – judge dismisses $193k estate claim",
            "url": "https://www.newzimbabwe.com/high-court-cannot-be-substituted-for-the-executor-judge-dismisses-193k-estate-claim/",
            "content": "By Mary Taruvinga\n\nThe High Court has thrown out businessman Julian Martin Hamilton Barns bid to be registered as a secured creditor in the estate of the late Phillip Mugadza, ruling that his application was clearly incompetent and wrongly sought to force the court to step into the shoes of the executor.\n\nIn a judgment handed down in Harare, Justice Sylvia Chirawu-Mugomba said Barns had misconceived the law on claims against deceased estates and tried to bypass the executors statutory powers.\n\nThe order sought is akin to asking this court to step into the shoes of the first respondent and literally force the acceptance of the claims, as if to ask this court to now act as the executor, the judge said. This court cannot be substituted for the executor.\n\nBarns argued that he had advanced payments amounting to US$193,600 on behalf of Mugadza to stave off foreclosure of his Gunhill property, and sought to compel executor Emmanuel Ngwarati to register him as a secured creditor. But the executor rejected the claim, citing a lack of supporting documents, absence of any lending agreement, and the fact that some payments were made to third parties and not to the deceased himself.\n\nMugomba said the executor had duly provided reasons for rejecting the claim.\n\nWhether they are adequate or not is neither here nor there, she observed. The applicant wants this court to put all the claims under a microscope and literally force the first respondent to accept them. All these questions and issues can only lead to one logical conclusion. This court cannot be substituted for the executor.\n\nThe judge also criticised both sides legal representatives for failing to properly engage with the key legal issues. Had all the legal practitioners applied their minds, perhaps they would have been more helpful to the court. Because they did not, this impacts the order of costs.\n\nConcluding, Justice Chirawu-Mugomba dismissed the application, ordering each party to bear its own costs.\n\nThe application is akin to one for review disguised as a court application to compel. It is clearly incompetent, she ruled.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg",
            "description": "<p>By Mary Taruvinga The High Court has thrown out businessman Julian Martin Hamilton Barns’ bid to be registered as a secured creditor in the estate of the late Phillip Mugadza, ruling that his application was “clearly incompetent” and wrongly sought to force the court to step into the shoes of the executor. In a judgment</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-cannot-be-substituted-for-the-executor-judge-dismisses-193k-estate-claim/\">High court cannot be substituted for the executor – judge dismisses $193k estate claim</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "28 Aug 2025"
        },
        {
            "title": "Mnangagwa reads the riot act as Zanu PF succession battle rages on",
            "url": "https://www.newzimbabwe.com/mnangagwa-reads-the-riot-act-as-zanu-pf-succession-battle-rages-on/",
            "content": "By Staff Reporter\n\nAs the Zanu-PF succession war intensifies, President Emmerson Mnangagwa has issued a stern warning, telling senior party members to fall in line, stressing that individualism has no place within his party.\n\nMnangagwa addressed a Politburo meeting at party headquarters in Harare on Wednesday, amid escalating tensions within Zanu-PF as rivals jostle to succeed him in 2028, when his current term expires.\n\nParty spokesperson Chris Mutsvangwa told the press a couple of weeks ago that controversial business tycoon Kudakwashe Tagwirei, the newly co-opted Zanu-PF Central Committee member, could not buy his way to the top of the party leadership. He asserted that measures to halt Tagwireis bid to rise to the Central Committee had been put in place.\n\nHowever, weeks later, Zanu-PF Secretary for Legal Affairs Patrick Chinamasa dismissed Mutsvangwas attempt to block Tagwireis ascent into the partys Central Committee as a wasted effort, via a post on social media platform X.\n\nMnangagwa convened the Politburo meeting in the absence of his deputy, Constantino Chiwenga, who is understood to be in India on state business.\n\nChairing Wednesdays Politburo meeting, Mnangagwa warned that the bad apples determined to tear the party apart must be cautioned.\n\nTactics and political chicanery meant to mislead, confuse, as well as divide the Party and nation, must be nipped in the bud.\n\nWe must all speak with one voice and march in one direction. Leaders of the Party are bound by collective responsibility and must unite around Party decisions and resolutions which serve as our ideological and moral compass. Hauroti zvinhu kumba kwako woenda uchitaura sehurongwa hweMusangano, he said.\n\nMnangagwa further urged party members to communicate with discipline, as officials have been using social media to attack each other while the power struggle intensifies.\n\nOur communication must be disciplined. MuZANU PF tinomira pachokwadi. Zvemazvake mazvake, pasi nazvo.\n\nZanu-PF factionalism is becoming increasingly apparent, with two distinct groups  one aligned to Mnangagwa and the other to Chiwenga  seeking to outmanoeuvre one another.\n\nMnangagwa views controversial tenderpreneurs like Kudakwashe Tagwirei and Wicknell Chivayo as genuine philanthropists, while Chiwenga has labelled them zvigananda  those who loot state resources to enrich themselves at the expense of impoverished Zimbabweans.\n\nThis division between Mnangagwa and Chiwenga has become so evident that it seems only a matter of time before all hell breaks loose.\n\nMnangagwa is allegedly seeking to extend his term beyond 2028, although he has publicly denied this ambition on more than one occasion.\n\nChiwenga is projecting himself as an anti-corruption champion, asserting that he will not tolerate corruption at any cost, describing it as a threat to national security.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/01/07033353/Emmerson-Mnangagwa.png",
            "description": "<p>By Staff Reporter As the Zanu-PF succession war intensifies, President Emmerson Mnangagwa has issued a stern warning, telling senior party members to fall in line, stressing that individualism has no place within his party. Mnangagwa addressed a Politburo meeting at party headquarters in Harare on Wednesday, amid escalating tensions within Zanu-PF as rivals jostle to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-reads-the-riot-act-as-zanu-pf-succession-battle-rages-on/\">Mnangagwa reads the riot act as Zanu PF succession battle rages on</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "28 Aug 2025"
        },
        {
            "title": "Ex-minister’s attacker jailed 4 years for attempted murder",
            "url": "https://www.newzimbabwe.com/ex-ministers-attacker-jailed-4-years-for-attempted-murder/",
            "content": "By Staff Reporter\n\nThe Regional Court in Hwange has jailed Samson Siazuza (46) to an effective four years behind bars after convicting him of attempted murder for a savage attack on former Cabinet Minister Joel Gabuza.\n\nOn June 5, 2025, at Siamwake Village under Chief Pashu in Binga, Siazuza dragged Gabuza from his vehicle and stabbed him in the right eye with a homemade knife before repeatedly striking him with logs.\n\nThe victim suffered deep head wounds and cuts, narrowly surviving after emergency treatment at Mpilo Hospital.\n\nThe court initially imposed a six-year term, suspending two years on condition of good behaviour, leaving Siazuza to serve four years in prison.\n\nPolice recovered the knife and logs used in the attack. Investigations are ongoing to track down Siazuzas fugitive accomplice, Smart Sipu, who is still on the run.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/27202646/Joel-Gabuza.jpg",
            "description": "<p>By Staff Reporter The Regional Court in Hwange has jailed Samson Siazuza (46) to an effective four years behind bars after convicting him of attempted murder for a savage attack on former Cabinet Minister Joel Gabuza. On June 5, 2025, at Siamwake Village under Chief Pashu in Binga, Siazuza dragged Gabuza from his vehicle and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ex-ministers-attacker-jailed-4-years-for-attempted-murder/\">Ex-minister’s attacker jailed 4 years for attempted murder</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "28 Aug 2025"
        },
        {
            "title": "Thandolwenkosi Ngwenya scores debut Betway Premiership Goal",
            "url": "https://www.newzimbabwe.com/thandolwenkosi-ngwenya-scores-debut-betway-premiership-goal/",
            "content": "By Sports Reporter\n\nWarriors international Thandolwenkosi Ngwenya, on Wednesday evening, scored his first Betway Premiership goal for Amazulu, who played a one-all draw against Sekukhune United in South Africa.\n\nNgwenya opened the scoring account of the match in the 17th minute, giving Usuthu a 1-0 halftime lead.\n\nHowever, Sekhukune Uniteds Ronaldo Maarmanscoredin the 84th minute to make it one-all.\n\nWednesdays goal was important for the Zimbabwean forward, who moved to South Africa in July after an impressive run with former Zimbabwe Premier League champions FC Platinum.\n\nNgwenya has been included in the Warriors World Cup qualifiers squad which will face Benin and Rwanda next month.\n\nThe full squad is expected to be named on Thursday afternoon by the Warriors gaffer, who arrived back in the country a few weeks ago fromGermany.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/28135313/thandolwenkosi-ngwenya.jpg",
            "description": "<p>By Sports Reporter Warriors international Thandolwenkosi Ngwenya, on Wednesday evening, scored his first Betway Premiership goal for Amazulu, who played a one-all draw against Sekukhune United in South Africa. Ngwenya opened the scoring account of the match in the 17th minute, giving Usuthu a 1-0 halftime lead. However, Sekhukune United’s Ronaldo Maarman scored in the 84th minute</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/thandolwenkosi-ngwenya-scores-debut-betway-premiership-goal/\">Thandolwenkosi Ngwenya scores debut Betway Premiership Goal  </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "28 Aug 2025"
        }
    ]
}