{
    "news": [
        {
            "title": "Fraud-accused Highlanders CEO resigns just four months into new job",
            "url": "https://www.newzimbabwe.com/fraud-accused-highlanders-ceo-resigns-just-four-months-into-new-job/",
            "content": "By Sports Reporter\n\nFOLLOWING his suspension Thursday over fraud allegations, Highlanders Chief Executive Officer Brian Moyo has resigned.\n\nMoyo was alleged to have forged a fake invoice of US$23,000 for Highlanders to pay Bulawayo Chiefs in a two players transaction they were supposed to pay US$18,000 hence pocketing US$5,000.\n\nThis led to his suspension after the club sat for a joint board and executive meeting.\n\nHowever, in a twist of events, the CEO has since submitted his resignation letter, which has been accepted by the club.\n\nHighlanders FC has received and accepted a letter of resignation from its Chief Executive Officer Brian Moyo.\n\nHis resignation comes at a time when the club had initiated investigations and a disciplinary process against him as a result of allegations of corruption and misappropriation of club funds.\n\nThe club would like to assure its stakeholders that due processes will be followed to deal with this issue, read Highlanders statement.\n\nMoyo quits four months after he was appointed to take over from the late Sihlangu Dhlodhlo.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/05154042/brian-bosso-CEO.jpeg",
            "description": "<p>By Sports Reporter  FOLLOWING his suspension Thursday over fraud allegations, Highlanders Chief Executive Officer Brian Moyo has resigned. Moyo was alleged to have forged a fake invoice of US$23,000 for Highlanders to pay Bulawayo Chiefs in a two players’ transaction they were supposed to pay US$18,000 hence pocketing US$5,000. This led to his suspension after</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/fraud-accused-highlanders-ceo-resigns-just-four-months-into-new-job/\">Fraud-accused Highlanders CEO resigns just four months into new job</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:30",
            "date": "05 Apr 2025"
        },
        {
            "title": "Another Zimbabwean shot dead at Chinese-owned mine",
            "url": "https://www.newzimbabwe.com/another-zimbabwean-shot-dead-at-chinese-owned-mine/",
            "content": "By Costa Nkomo\n\nTHE Centre for Natural Resources Governance (CNRG) is demanding a thorough investigation into the death of another Zimbabwean at the Chinese-run Sino Africa Huijin Mine at Premier Estate in Old Mutare.\n\nAlfred Dzodzo was allegedly shot dead Wednesday night by a security guard who, without warning, fired directly into his face. Dzodzo was accused of attempting to steal gold.\n\nThe mine has operated illegally since 2023, its licence having expired. This unlawful operation has continued with the full knowledge of the government through the Environmental Management Agency (EMA), as confirmed to Parliament two years ago.\n\nIn a statement Thursday, CNRG called for a comprehensive investigation charging that the company has an apparent disregard for human life.\n\nWe also call for a thorough investigation into the killing of Alfred Dzodzo, with those responsible held accountable under the Zimbabwean law, reads part of the statement.\n\nAdditionally, an audit should be carried out on Sino Africa Huijins financial activities, particularly its alleged involvement in gold smuggling and organized crime, their statement reads.\n\nFollowing Dzodzos death, CNRG has urged the Zimbabwean government to shut down the mine, expel the Chinese operatorswho are understood to be working without a valid licenceand grant mining rights to local artisanal miners. They argue these miners deserve to benefit from the natural resources in their communities.\n\nIn light of this, CNRG calls on the government to permanently shut down Sino Africa Huijin and open the site to Zimbabwean artisanal miners under the auspices of Zimbabwe Mining Development Corporation and Minerals Marketing Corporation of Zimbabwe. This will ensure Zimbabwean nationals can benefit from their natural resources whilst also ensure government generate revenues, part of the statement reads.\n\nSino Africa Huijin is no stranger to controversy. In January this year, Taurai Dozva died mysteriously while on night duty at the mine. The Chinese offered his family US$2,000 as compensation  a plaster on a gaping wound.\n\nIn November 2023, CNRG implored Parliament to shut down the mine due to environmental crimes and exploitative labour practices. The company also reportedly smuggles unprocessed gold out of the country, robbing Zimbabwe of crucial revenue, a financial haemorrhage bleeding the nation dry.\n\nReports of killings and abusive labour practices by Chinese nationals at Zimbabwean mining sites are rampant, a grim tapestry woven with threads of exploitation.\n\nThe Zimbabwe Environmental Law Society (ZELA) and other labour rights activists have condemned these killings.\n\nA violent confrontation at Bijou Farm in Gweru on January 21 further illustrates the tension. A worker demanding unpaid wages clashed with supervisors, igniting outrage on social media and strengthening calls for action against exploitative Chinese investors.\n\nThe incident involved Kholwani Dube, an excavator operator employed by Ming Chang Sino-Africa Mining Investments.\n\nBeyond its appalling human rights and safety record, Sino Africa Huijin is accused of siphoning gold from Zimbabwe. Workers allege that much of the gold they mine goes undeclared, disappearing into the pockets of the Chinese owners.\n\nDzodzos killing has reignited the debate surrounding the treatment of Zimbabwean workers by Chinese investors, with critics accusing authorities of turning a blind eye to labour violations, leaving a bitter taste of injustice.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/23170027/Screenshot-2025-01-23-at-18.58.25.png",
            "description": "<p>By Costa Nkomo THE Centre for Natural Resources Governance (CNRG) is demanding a thorough investigation into the death of another Zimbabwean at the Chinese-run Sino Africa Huijin Mine at Premier Estate in Old Mutare. Alfred Dzodzo was allegedly shot dead Wednesday night by a security guard who, without warning, fired directly into his face. Dzodzo</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/another-zimbabwean-shot-dead-at-chinese-owned-mine/\">Another Zimbabwean shot dead at Chinese-owned mine </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:30",
            "date": "05 Apr 2025"
        },
        {
            "title": "Govt, local stakeholders partner in rehabilitating environment damaged by mining activities",
            "url": "https://www.newzimbabwe.com/govt-local-stakeholders-partner-in-rehabilitating-environment-damaged-by-mining-activities/",
            "content": "By Alois Vinga\n\nTHE government has joined hands with local stakeholders in the Mutoko community to pool resources towards fixing environmental damage wrought by rapid mining activities in the area.\n\nMining activities in the area are blamed for causing significant environmental damage and habitat destruction, soil erosion, water contamination, and air pollution, impacting the livelihoods and health of local communities.\n\nDeputy Minister Dr. Caleb Makwiranzou\n\nSpeaking to NewZimbabwe.com shortly after a stakeholders meeting recently, Deputy Mines and Mining Development Minister, Dr Caleb Makwiranzou said government had launched a pilot project to deal with mining related environmental effects.\n\nWe have set up a steering committee in Mutoko to repair mining related environmental damages. To begin with, we have identified roads infrastructure. We need to fix these roads, which were damaged by miners as they ferried their produce to the market.\n\nWe realise that the government alone has no capacity to single handedly repair these roads so concerned stakeholders have to join hands in solving the problem, he said.\n\nMakwiranzou said the programme, which is being rolled out on the basis of mutual engagement and dialogue has seen miners in the area being asked to assist with machinery like front-end loaders and graders to repair the roads.\n\nHe said the 11 mining companies in Mutoko North constituency can assist with trucks to ferry gravel as well as fuel to capacitate villagers and the local authority in realising their objectives.\n\nEnvironmentalists have attributed the ongoing concerted efforts to CSOs like Silveira House for implementing programmes fostering engagement and dialogue, allowing communities to express their concerns to mining companies, political actors, and policymakers.\n\nThis engagement has seen the culmination of community cohesion which is vital for promoting responsible and sustainable mining practices, ultimately, amplifying the voice and agency of mining-impacted communities.\n\nWhile we are aware that CSR is voluntary, we will be using engagement and dialogue to source for these resources.\n\nWe also need assistance with school furniture, ICT consumables in learning. Specifically, it is a pilot programme in Mutoko North, we will roll it out as a national programme, added Makwiranzou.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/01/07054955/Mining-Excavator.jpg",
            "description": "<p>By Alois Vinga THE government has joined hands with local stakeholders in the Mutoko community to pool resources towards fixing environmental damage wrought by rapid mining activities in the area. Mining activities in the area are blamed for causing significant environmental damage and habitat destruction, soil erosion, water contamination, and air pollution, impacting the livelihoods</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-local-stakeholders-partner-in-rehabilitating-environment-damaged-by-mining-activities/\">Govt, local stakeholders partner in rehabilitating environment damaged by mining activities </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:30",
            "date": "05 Apr 2025"
        },
        {
            "title": "Zimbabwean Nobuhle Tshuma challenges Gerda Steyn at the Two Oceans Marathon",
            "url": "https://www.newzimbabwe.com/zimbabwean-nobuhle-tshuma-challenges-gerda-steyn-at-the-two-oceans-marathon/",
            "content": "By IOL\n\nCAPE TOWN  Nobuhle Tshuma did not flinch. With Gerda Steyn to her left, the Entsika Athletic Club starlet threw down the gauntlet to the darling of South African road running.\n\nThis race is not all about Gerda, the South Africa-based Zimbabwean athlete said to rapturous applause.\n\nIts also about me against myself. Anything can happen (in a race). Why should we have fear and say Gerda is here shes gonna win. No! I am not gonna do that.\n\nIt was a breath of fresh air really, Tshumas boldness breaking the somewhat monotonous nature of road races where Steyn is involved  the rest of the athletes often being afraid to rate themselves as capable of challenging the Smiling Assassin.\n\nTshuma has shown herself to be a competitive runner in the ultras with last years edition and then going on to get gold (fifth place) in her maiden Comrades Marathon later in the year.\n\nIntent on challenging Steyn as she is, the woman who is married to 2023 Totatlasport Two Oceans Marathon champion and last years third-place finisher Givemore Mudzinganyama is using the 56 km race as preparation for her second World Major Marathon.\n\nMy training has gone very well. I am just here for a long run anyway Gerda, she said, turning to look at the multiple champion and record holder as if to say dont worry you can keep your title.\n\nThe amusement in the room knew no bounds as just about everyone, including Steyn herself burst into laughter.\n\nGerda, I am preparing for the London Marathon. But the Two Oceans Marathon is my favourite marathon so I just said let me come do my last long run. And theres only one month left before Comrades so I just wanted to check their fitness for Comrades.\n\nSuch confidence! Such bravado! It can only augur well for the sport to have someone who dares to challenge the road running queen who is going for a sixth successive victory in the 56km world famous ultra.\n\nSteyn remained her ice cool self though amidst Tshumas goading and described it as a blessing to be back again to do the Two Oceans.\n\nThe distance is where my sweet spot lies and also the Two Oceans in the few years since I started running opened so many doors for me and winning it in 2018 really made me believe I can be a champion.\n\nAnd I dont know if my career would have been the same way if it wasnt for it. And each year Ive managed to come back and push a little step up and push myself to see what I can do.\n\nWhile the way she has registered her five victories in the race always seemed to suggest she finds it easy, Steyn says the Two Oceans is a tough challenge.\n\nThe Two Oceans is not like any other race. It is not the Comrades and it is not a (standard) marathon.\n\nSo, you need to be really specific about how you prepare for this race, making sure that youve got the speed in your legs as well as the strength to conquer the hills. So the uniqueness of the race is really something that draws me to it year after year.\n\nIs she going to break the record yet again?\n\nIts always difficult for me to talk about the record and I dont want to sound like a record on repeat  pun intended  because especially for today the contenders for this race tomorrow is specifically strong.\n\nAnd it is not just those who are sitting here but there will be more at the start tomorrow.\n\nIt is going to be a fast race and it could be very tactical with the competition being so strong, it is very difficult to speak about the record.\n\nIn my personal space I have to have the confidence that I can break the record; that I am able to push myself to the limit and  first of all to win the race and second of all to break the record.\n\nAnd perhaps to win the race tomorrow might require breaking the record. So, I am prepared for every scenario and we will just have to wait and see how it all unfolds.\n\nShe now also knows that there is a Nobuhle Tshuma who is eager to take her on.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/05081547/ELITE-athletes-Nobuhle-Tshuma-second-left-and-Gerda-Steyn-second-right-will-have-all-eyes-on-them-in-the-Two-Oceans-Marathon-Matshelane-Mamabolo-Independent-Newspapers.webp",
            "description": "<p>By IOL CAPE TOWN – Nobuhle Tshuma did not flinch. With Gerda Steyn to her left, the Entsika Athletic Club starlet threw down the gauntlet to the darling of South African road running. “This race is not all about Gerda,” the South Africa-based Zimbabwean athlete said to rapturous applause. “It’s also about me against myself.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-nobuhle-tshuma-challenges-gerda-steyn-at-the-two-oceans-marathon/\">Zimbabwean Nobuhle Tshuma challenges Gerda Steyn at the Two Oceans Marathon</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:30",
            "date": "05 Apr 2025"
        },
        {
            "title": "Life lessons from 107-year-old Tannie Cora",
            "url": "https://www.newzimbabwe.com/life-lessons-from-107-year-old-tannie-cora/",
            "content": "By Tracy-Lynn Ruiters l Weekend Argus\n\nCora Tannie Cora Snyman Louw, born on April 4, 1918, in Klipdam near Kimberley, South Africa has lived through an extraordinary century of history, witnessing world events and personal milestones that few can fathom.\n\nBorn towards the end of World War I, she has lived through two World Wars, two pandemics, and witnessed the rapid transformation of technologyfrom horse-drawn carts to self-driving cars.\n\nHer journey is not just one of longevity but of an incredible life well-lived, marked by wisdom, and deep appreciation for family and lifes small pleasures.\n\nAs one of the first nurses at Groote Schuur Hospital, Tannie Coras career was centered on care, dedication, and an eagerness to learn.\n\nShe married a doctor in 1942, with whom she had two children, Leon and Zandra. Her passion for floristry began when her youngest was just nine years old, and she later expanded her business into an estate agency.\n\nI went through the thick and thin of life\n\nHer life took her to Durban, Johannesburg, and back to Cape Town, where she lived out her later years near the beach, developing a close bond with her neighbour, Sylwa Malan.\n\nIn her later years, Tannie Cora moved to the then Huis Lckhoff, now known as Rosebank House, at the age of 81, where she enjoyed a rich community life filled with music, scripture studies, and visits from loved ones.\n\nNow, at 107 years old, Tannie Cora has become a living testament to resilience and a source of wisdom for those around her, imparting life lessons that include the importance of family unity, fairness, humor, and staying engaged with life.\n\nJames Wichary, the Manager of Rosebank House, recalled the first day he met Tannie Cora. She was one of the first people I met when I started here, Wichary shared.\n\nEveryone talked about Tannie Cora, and when I heard she was 106, I thought, That means she was born in 1918, absolutely astonishing! She lived through two world wars, two pandemics, and witnessed the world transform. She is like a living, breathing encyclopedia.\n\nWichary admires Tannie Coras vitality, noting, You can still have a conversation with her.\n\nThe energy is vibrant and engaging, and she knows whats going on around her. She enjoys family visits, soaking up the sun, and is quite funny.\n\nStaff member Allison Goodheart also fondly remembers when Tannie Cora was wheeled into the sunroom on her birthday, beaming with delight.\n\nShes still very aware of everything around her, Goodheart said.\n\nWhen we brought her cake, she looked at it and said, Beautiful!\n\nWhen asked how she feels at 107, Tannie Cora replied with a twinkle in her eye: Happy chappy! I still look 91, and then cracked a little smirk, adding a playful touch to the conversation.\n\nHer great-niece, Margi Marshland, shared how Tannie Cora had been feeling after her recent birthday, which they had feared might be her last.\n\nLast year, we thought it would be her last birthday.\n\nShe got very sick, and she even told us she was ready to meet the Lord. But this year, she started asking about the days leading up to her birthday, counting them down. Its a blessing to spend another birthday with her.\n\nMarshlands sister, Berit Bradfield, and family friend Alet Steenkamp expressed gratitude for every moment spent with Tannie Cora.\n\nWe are thankful to the Lord for sparing her another year, Marshland said. There are good and bad days, but today, were just happy to be with her. Even when shes not as talkative, you can still feel her presence.\n\nLife Lessons from Tannie Cora include, You can make life very beautiful just by having a united family; Learn how to get along with people; It takes a lot of energy and patience to be a parent; Dont assume that another person is a fool; being late is an insult and disrespectful to those waiting for you; friends are very important and never forget your sense of humour.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/05072454/Life-lessons-from-107-year-old-Tannie-Cora.webp",
            "description": "<p>By Tracy-Lynn Ruiters l Weekend Argus  Cora “Tannie Cora” Snyman Louw, born on April 4, 1918, in Klipdam near Kimberley, South Africa has lived through an extraordinary century of history, witnessing world events and personal milestones that few can fathom. Born towards the end of World War I, she has lived through two World Wars,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/life-lessons-from-107-year-old-tannie-cora/\">Life lessons from 107-year-old Tannie Cora</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:30",
            "date": "05 Apr 2025"
        },
        {
            "title": "Woman dies after husband forces poison down her throat during fight",
            "url": "https://www.newzimbabwe.com/woman-dies-after-husband-forces-poison-down-her-throat-during-fight/",
            "content": "By Staff Reporter\n\nAN enraged Kwekwe man did the unthinkable during a domestic dispute by forcing his wife to drink a poisonous substance, which resulted in health complications leading to her death.\n\nNorest Ndlovu (29) of Qagani village, Chief Malisa was arraigned before the Kwekwe Magistrates Court facing a murder charge.\n\nCircumstances are that on May 17, 2024, at around 9pm, a domestic dispute broke out between the accused person and his wife, who is now deceased.\n\nCourt heard that during the ensuing battle, Ndlovu overpowered his wife before shoving a poisonous substance down her throat.\n\nShe gulped the poison and started frothing on the mouth and writhing in agony complaining of stomach cramps and was later rushed to hospital.\n\nThe now deceased was admitted in medical facility and later discharged. Thereafter, she was in and out of hospital until she succumbed to the effects of the poison on March 4 this year.\n\nNdlovu was remanded in custody to April 17, 2025, and advised to apply for bail at the High Court.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/08/04045212/mortuary.jpeg",
            "description": "<p>By Staff Reporter  AN enraged Kwekwe man did the unthinkable during a domestic dispute by forcing his wife to drink a poisonous substance, which resulted in health complications leading to her death. Norest Ndlovu (29) of Qagani village, Chief Malisa was arraigned before the Kwekwe Magistrates’ Court facing a murder charge. Circumstances are that on</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/woman-dies-after-husband-forces-poison-down-her-throat-during-fight/\">Woman dies after husband forces poison down her throat during fight</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:30",
            "date": "05 Apr 2025"
        },
        {
            "title": "Abuse scandal rocks school: Deputy Head flees after allegedly molesting over 30 pupils",
            "url": "https://www.newzimbabwe.com/abuse-scandal-rocks-school-deputy-head-flees-after-allegedly-molesting-over-30-pupils/",
            "content": "By Costa Nkomo\n\nCONTROVERSY has engulfed Masase High School in Mberengwa district, as Deputy Headmaster Anymore Gumbo is on the run after allegedly sexually molesting over 30 pupils at the iconic boarding school, NewZimbabwe.com can reveal.\n\nTaungana Ndoro, Director of Communications for the Ministry of Primary and Secondary Education, confirmed the incident.\n\nWe are aware of the incident and investigations are in progress, he said.\n\nGumbo allegedly carried out his depraved acts on numerous occasions on different pupils over a period of time, until he recently injured a Form Two student.\n\nThe victim, reportedly experiencing severe discomfort, cried out, alerting fellow pupils and shattering the wall of silence that had concealed Gumbos alleged abuse. This marked the beginning of Gumbos downfall as his web of deceit began to unravel.\n\nGumbo reportedly fled the school premises last Friday night as law enforcement agents came to investigate the matter and question him.\n\nThe scandal came to light after one of the pupils required medical attention following an alleged assault by Gumbo. This medical intervention, like Pandoras Box, unleashed a torrent of accusations.\n\nIn a letter addressed to parents and guardians Wednesday, headmaster Albion Masukume confirmed that investigations are underway, involving both the police and the Ministry of Primary and Secondary Education.\n\nI write with deep sorrow to inform you that allegations of child abuse by one of our staff members was reported, he said.\n\nCurrently thorough investigations by Ministry of Primary and Secondary Education and the police are underway. The alleged victim was taken to hospital swiftly and was examined by a medical doctor.\n\nA police report was filed with the Victim Friendly Unit at Mberengwa Charge Office the same day. Meanwhile the alleged perpetrator is not at the station and being sought after for interrogation so that he responds to the allegations, reads part of the letter dated April 3, 2025.\n\nWhile Midlands provincial police spokesperson Inspector Emmanuel Mahoko would neither confirm nor deny the incident to NewZimbabwe.com. He was quoted in a State-run newspaper confirming the incident.\n\nHowever, when contacted by this publication, Mahoko denied ever speaking to any journalist concerning the matter.\n\nTafanana Zhou, legislator for Mberengwa North, which encompasses Masase High School, confirmed the assaults but refrained from speculating on the number of victims.\n\nWe need to wait for investigations to complete so that we will be able to establish the number of learners that were involved in this incident. We should not speculate.\n\nObert Masaraure, President of the Amalgamated Rural Teachers Union of Zimbabwe (ARTUZ), condemned the alleged abuse, urging the school to bolster its safeguarding procedures.\n\nThe molestation of children at a learning institution is extremely worrisome, he said.\n\nSchools should be safe for both teachers and learners. ARTUZ has proposed safe schools regulations and if these had been adopted such incidents would have been avoided.\n\nIn Zimbabwe, engaging in sexual acts with a minor under 18, including sodomy, is illegal under Section 73 (3) of the Criminal Law (Codification and Reform) Act Chapter 9:23 and carries a maximum prison sentence of 10 years.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/05062130/img_1_1743830355508.jpg",
            "description": "<p>By Costa Nkomo CONTROVERSY has engulfed Masase High School in Mberengwa district, as Deputy Headmaster Anymore Gumbo is on the run after allegedly sexually molesting over 30 pupils at the iconic boarding school, NewZimbabwe.com can reveal. Taungana Ndoro, Director of Communications for the Ministry of Primary and Secondary Education, confirmed the incident.  “We are aware</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/abuse-scandal-rocks-school-deputy-head-flees-after-allegedly-molesting-over-30-pupils/\">Abuse scandal rocks school: Deputy Head flees after allegedly molesting over 30 pupils</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:30",
            "date": "05 Apr 2025"
        },
        {
            "title": "Chiragwi and Navaya scoop monthly PSL awards",
            "url": "https://www.newzimbabwe.com/chiragwi-and-navaya-scoop-monthly-psl-awards/",
            "content": "By Sports Reporter\n\nNGEZI Platinum Stars coach Takesure Chiragwi has been voted Premier Soccer League (PSL) Coach of The Month for March.\n\nChiragwi has managed a four-match unbeaten run in the league, a performance that has seen his side seating on the summit of the log table.\n\nThe Mhondoro-based side is one of the four teams yet to taste defeat in the league, the other three being MWOS, Dynamos and FC Platinum.\n\nNgezi recorded a false start into the league, after a 1-1 draw against Kwekwe United on match-day one before winning its last three encounters against Green Fuel, Scottland F.C and Triangle.\n\nChiragwi was voted Coach of The Month ahead of MWOS FC coach Lloyd Mutasa, who has managed eight points from four matches.\n\nMeanwhile, TelOne striker Washington Navaya has scooped the leagues Player of The Month award.\n\nThe veteran forward banged four goals in four matches, the highest by any player so far in the league.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/05052112/IMG-20250404-WA0063.jpg",
            "description": "<p>By Sports Reporter  NGEZI Platinum Stars coach Takesure Chiragwi has been voted Premier Soccer League (PSL) Coach of The Month for March. Chiragwi has managed a four-match unbeaten run in the league, a performance that has seen his side seating on the summit of the log table. The Mhondoro-based side is one of the four</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chiragwi-and-navaya-scoop-monthly-psl-awards/\">Chiragwi and Navaya scoop monthly PSL awards</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:30",
            "date": "05 Apr 2025"
        },
        {
            "title": "PSL outfit Kwekwe United faces financial crisis, fails to pay players",
            "url": "https://www.newzimbabwe.com/psl-outfit-kwekwe-united-faces-financial-crisis-fails-to-pay-players/",
            "content": "By Sports Reporter\n\nCASTLE Lager Premier Soccer League (PSL) newcomers Kwekwe United are in a financial logjam that has seen it failing to pay players for two consecutive months, New Zimbabwe.com has learnt.\n\nThe Midlands province-based side is owing players monthly salaries accumulating to two months, while other members of the squad are yet to be fully paid their sign on fees.\n\nLed by head coach Saul Chaminuka, the outfit is currently occupying position 15 with four points, three places on top of bottom place occupiers Triangle.\n\nTalking to NewZimbabwe.com on condition of anonymity, one of the players said the club is struggling to meet match-day expenses.\n\nThe situation here (Kwekwe United) is tough. Most of the guys are owed part of their sign-on fees.\n\nOther than that, we are owed two months salaries by the club and there is no guarantee when we can receive our dues.\n\nOur superiors are struggling to adjust to the financial demands that comes with topflight league football, because its always a hustle for us to camp and prepare for each match-day, be it home or away, said the source.\n\nKwekwe Uniteds woes are now a public secret. On Friday afternoon an audio in which team assistant coach Clemence Zuze was asking for players to bring personal blankets in camp ahead of their clash against FC leaked and was circulating on social media.\n\nMorning l am kindly advising you that todays camping in Gweru will be at a farm, as per programme, lunch will be served there as well as our dinner, the same tomorrow.\n\nIt seems their accommodation does not have enough necessities hence you are being asked to bring your personal blankets.\n\nFor those at the club house, kindly carry along your mattresses as well, said Zuze in the audio.\n\nKwekwe United hosts FC Platinum at Bata Stadium in Gweru this Saturday afternoon, a match they will be hoping to bounce back to winning ways after last weeks defeat to Yadah F.C.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/05051602/kwekwe-united.jpg",
            "description": "<p>By Sports Reporter CASTLE Lager Premier Soccer League (PSL) newcomers Kwekwe United are in a financial logjam that has seen it failing to pay players for two consecutive months, New Zimbabwe.com has learnt. The Midlands province-based side is owing players monthly salaries accumulating to two months, while other members of the squad are yet to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/psl-outfit-kwekwe-united-faces-financial-crisis-fails-to-pay-players/\">PSL outfit Kwekwe United faces financial crisis, fails to pay players</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:30",
            "date": "05 Apr 2025"
        },
        {
            "title": "Ex-Finance minister rejects Mnangagwa’s third term bid; flags corrupt plan to protect tycoon Tagwirei and cartels",
            "url": "https://www.newzimbabwe.com/ex-finance-minister-rejects-mnangagwas-third-term-bid-flags-corrupt-plan-to-protect-tycoon-tagwirei-and-cartels/",
            "content": "By Staff Reporter\n\nFORMER Finance minister Tendai Biti has rejected President Emmerson Mnangagwas 2030 agenda, calling it a corrupt plan meant to hedge ill-gotten wealth and thrust known plunderers into powerful government positions.\n\nAccording to vocal war veteran Blessed Bomshell Geza, Mnangagwas third term bid known as 2030 agenda is being pushed by corrupt individuals surrounding him, who include his ally Kuda Tagwirei, controversial businessmen Wicknell Chivayo, Obey Chimuka and Scott Sakupwanya, Finance Minister Mthuli Ncube, Finance Permanent Secretary George Guvamatanga, former Reserve Bank of Zimbabwe (RBZ) Governor John Mangudya and others.\n\nGeza also recently claimed that Mnangagwa was clandestinely grooming Tagwirei to take over the presidency, thereby thwarting his deputy Constantino Chiwengas leadership ambitions.\n\nTagwirei has started maneuvering into the structures of the ruling party Zanu PF after his name was put forward by the Harare provincial leadership to assume a role in the Central Committee, one of the partys most powerful organs.\n\nHowever, Biti condemned Mnangagwas plot to perpetuate his incumbency and expressed strong opposition to the corrupt cartels and individuals, who have been looting Zimbabwes wealth for years.\n\nWe are totally opposed to the third term agenda and its cousin Agenda 2030.We make no apology for this.\n\nWe firmly believe that this is an agenda spurned by corruption and the need to protect lucre loot and ill begotten sachets.\n\nWe therefore stand firmly against cartels, bandits, charlatans and brigands, who have been looting Zimbabwe for decades.\n\nWe object to dangerous attempts to elevate some of these looters into the countrys corridors of power.\n\nWe are not members of Zanu PF. We refuse to be drawn in by their endless toxic factions and power struggles, Biti wrote on his official social media account.\n\nTagwirei has come under fire for allegedly using his close relationship with Mnangagwa to secure lucrative government deals, growing his influence in mining and fuel, and taking key leadership roles in agriculture and land policy.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/25044732/Tendai-Biti.png",
            "description": "<p>By Staff Reporter FORMER Finance minister Tendai Biti has rejected President Emmerson Mnangagwa’s “2030 agenda”, calling it a corrupt plan meant to hedge ill-gotten wealth and thrust known plunderers into powerful government positions. According to vocal war veteran Blessed ‘Bomshell’ Geza, Mnangagwa’s third term bid known as “2030 agenda” is being pushed by corrupt individuals</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ex-finance-minister-rejects-mnangagwas-third-term-bid-flags-corrupt-plan-to-protect-tycoon-tagwirei-and-cartels/\">Ex-Finance minister rejects Mnangagwa’s third term bid; flags corrupt plan to protect tycoon Tagwirei and cartels</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:30",
            "date": "05 Apr 2025"
        }
    ]
}