{
    "news": [
        {
            "title": "Public Accounts Committee “satisfied” with Treasury’s report on issues flagged by Auditor General",
            "url": "https://www.newzimbabwe.com/public-accounts-committee-satisfied-with-treasurys-report-on-issues-flagged-by-auditor-general/",
            "content": "By Anna Chibamu\n\nFINANCE Permanent Secretary George Guvamatanga finally appeared before the Public Accounts Committee last Friday and presented a report on the issues raised by the Auditor Generals report, which the legislators said they were satisfied with.\n\nPart of the findings of the AG report were that there had been a gross mishandling of public funds amounting to US$400 million by the Finance Ministry which was also bypassing ministries and agencies and making payments directly to suppliers,failure by private companies to supply vehiclesand Treasury minutes not being submitted to the committee.\n\nGuvamatanga who had been a no-show on several occasions had requestedthe Committee to give him more time to gather evidence.\n\nAccording to the PAC chairperson, Charlton Hwende, Guvamatangas oral evidence regarding the raised concerns fully satisfied the Committee members during the inquiry.\n\nWe just finished an inquiry with the Finance ministry led by the permanent secretary.\n\nWe received a report on those issues and I think the committee was satisfied that the appropriate response has been given, said Hwende.\n\nHe highlighted: We discussed the burning issue of suppliers that are getting government money and disappearing without supplying goods.\n\nThe secretary has committed that hes going to give us a whole list of every supplier that has received money from the government and has failed to supply, because thats criminal in our view.\n\nWe want to bring them we want to call every supplier to come here because most of them have realized that they receive government money and immediately use it where they receive it in zig, if the ministers follow up they start claiming that the money is lost value they can find us dollars but its a criminal enterprise.\n\nOf the direct payments made to TAPO Commercial Private Limited by the treasury, Guvamatanga explained:\n\nFinance Ministry went into an agreement on December 16, 2022, with TAPO Commercial Private Limited, for the command to supply serving Toyota Hi-Lax GT6 2.8-litre double-cab motor vehicles.\n\nThe ministry paid the US$25,866 to the contractor on December 30, 2022. Since 2021 to date, only four of the seven vehicles have been delivered, leaving three outstanding, Guvamatanga said.\n\nHe told PAC the company had made an undertaking to deliver the outstanding vehicles by the 2nd of July 2025.\n\nThe ministry has also returned to pass a request for the outcome of the debatement hearing to enable the initiation of federal protection against the supplier if they fail to deliver in July.\n\nAlso, the ministry has ensured that no prepayments are made to suppliers of vehicles before delivery.\n\nPayments are only made for vehicles that are already delivered.\n\nIn the event that the supplier is set to receive an advance payment, the ministry will ensure that a bank guarantee equivalent to the requested payment value is provided by a registered commercial bank, said the Finance secretary.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/05/03011105/George-Guvamatanga.jpg",
            "description": "<p>By Anna Chibamu FINANCE Permanent Secretary George Guvamatanga finally appeared before the Public Accounts Committee last Friday and presented a report on the issues raised by the Auditor General’s report, which the legislators said they were satisfied with. Part of the findings of the AG report were that there had been a gross mishandling of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/public-accounts-committee-satisfied-with-treasurys-report-on-issues-flagged-by-auditor-general/\">Public Accounts Committee “satisfied” with Treasury’s report on issues flagged by Auditor General</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "27 May 2025"
        },
        {
            "title": "DStv cuts ties with MacG’s Podcast and Chill",
            "url": "https://www.newzimbabwe.com/dstv-cuts-ties-with-macgs-podcast-and-chill/",
            "content": "The Citizen\n\nFollowing a controversial statement about one of South Africas loved celebrities by Podcast and Chill host Macgyver Mukwevho, popularly known as MacG, Dstv has decided to stop airing the show on its platform.\n\nMacG has been in the hot seat after making a comment about media personality Minnie Dlaminis private part in one of the episodes. However, Dstv did not air the episode in question; it was only aired on the Podcast and Chill channel on YouTube.\n\nDstvs digital distribution partner, Leading Edge Growth, confirmed toTimeslivethat Dstv has removed the popular podcast.\n\nLeading Edge Growth CEO Lufuno Maliavusa gave the confirmation that the show has been pulled.\n\nCiting To keep our content slate dynamic and engaging, we will continue to make adjustments to our roster. Notably, season one ofPodcast and Chilland season one ofAwkward Datesare nearing their final episodes in the coming weeks, making way for fresh and exciting content to take their place in these time slots.\n\nThis follows after MultiChoice refused to confirm the news of the shows cancellation. The Group only said it licensed a slate of podcasts from Leading Edge Growth, which was responsible for curating the podcast slate, taking into account audience dynamics and content demand.\n\nHowever, MacG is reportedlyunmoved by the news, as he is pursuing other endeavours.\n\nThe episode that spoke about Dlaminireceived attention from the Deputy Ministerof Women, Youth and Persons with Disabilities, Mmapaseka Steve Letsike.\n\nShe said MacGs comments were nauseating in their vulgarity and must be regarded as an unconstitutional violation of Dlaminis rights to freedom and security of the person, equality, and human dignity as enshrined in the Constitution of the Republic of South Africa.\n\nLetsike wanted MacG to be referred to the Parliaments Portfolio Committee, however,this was declined.\n\nI think the majority of members are not in favour of us proceeding as the honorable minister, deputy minister had requested us to do, the committees chairperson Liezl van der Merwe said.\n\nShe pointed out that Dlamini had not approached Parliament nor laid a criminal case.\n\nI think all of you have touched on this point that if we do decide it is our mandate to proceed with hearing one case of cyber-bullying, it would mean that this portfolio committee would have to extend that to every other person because they cannot be selective in choosing one case.\n\nMacG has since apologisedin one his episodes, saying he never intended to offend anyone.\n\nI want to apologise, first and foremost, to all the female chillers, and women in general in SA, I might have offended with that comment. That was not the intention. We never say things to offend people, he said.\n\nI want to extend an invite to Minnie Dlamini to the show. You are more than welcome to come.\n\nThis thing started on the podcastlets end it on the podcast. She said some things, I said some things. Lets squash it once and for all.\n\nDlamini saidshe was hurt and shocked by the commentsmade about her body and personal life on the podcast.\n\nOver the past few weeks, I have watched in disbelief and deep pain as my name, body, and dignity were dragged through the mud of public discourse, she said.\n\nShe described the remarks made by MacG as vile, humiliating, and inexcusable.\n\nDlamini said she is taking legal action to stand up for herself and the dignity of women.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/27042300/MacG.jpg",
            "description": "<p>The Citizen Following a controversial statement about one of South Africa’s loved celebrities by Podcast and Chill host Macgyver Mukwevho, popularly known as MacG, Dstv has decided to stop airing the show on its platform. MacG has been in the hot seat after making a comment about media personality Minnie Dlamini’s private part in one</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dstv-cuts-ties-with-macgs-podcast-and-chill/\">DStv cuts ties with MacG’s Podcast and Chill</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "27 May 2025"
        },
        {
            "title": "Sean Fusire eyes international debut with Zimbabwe",
            "url": "https://www.newzimbabwe.com/sean-fusire-eyes-international-debut-with-zimbabwe/",
            "content": "Footboom\n\nSean Fusire, the 19-year-old midfield dynamo who previously sharpened his skills on loan at Carlisle United, is reportedly gearing up to step onto the international stage by committing to play for Zimbabwe. The anticipation of his potential debut is palpable, as the young talent looks to make his mark on the world stage.\n\nHailing from Sheffield, with Zimbabwean roots coursing through his veins, Fusire has captured the attention of the Zimbabwean Football Association. This move could see him join a burgeoning roster of UK-based players proudly donning the Zimbabwean jersey, a decision that adds a new chapter to his promising career.\n\nIn an exciting revelation, Marshall Gore, chairperson of the Zimbabwean Football Associations global and diaspora committee, announced the news following a pivotal meeting with Fusire and his father in London. Gore enthusiastically revealed that the midfielder has officially embarked on the process of obtaining a Zimbabwean passport, setting the stage for his international representation.\n\nExciting news! Were thrilled to announce that Sheffield Wednesdays Sean Fusire has committed to represent Zimbabwe, Gore declared with enthusiasm. Sean was among the talented players scouted during the UK tour by our astute coach Michael Nees.\n\nIf Fusire pulls on the Warriors jersey, he will join a squad that already boasts several British-based talents. This includesLuton Towns Marvelous Nakamba, Wolverhampton Wanderers Marshall Munetsi,Brentfords Marley Tavaziva,Cardiff Citys Andy Rinomhota, andMotherwells Tawanda Maswanhise. Together, they form a formidable lineup that promises to bring flair and skill to the international arena.\n\nFusires stint at Carlisle United, which kicked off in January 2025, saw him make 14 appearances under the guidance of managers Mike Williamson and Mark Hughes. Notably, he was a fixture in the clubs final seven matches, where he dazzled fans and staff alike with his performances, leaving a lasting impression on all who watched.\n\nReflecting fondly on his time at Carlisle, Fusire described the experience as representing a great city and great club, underlining the profound impact this loan spell had on his development as a player.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/27041455/sean-fusire-Sheffield-Wednesday.jpeg",
            "description": "<p>Footboom Sean Fusire, the 19-year-old midfield dynamo who previously sharpened his skills on loan at Carlisle United, is reportedly gearing up to step onto the international stage by committing to play for Zimbabwe. The anticipation of his potential debut is palpable, as the young talent looks to make his mark on the world stage. Hailing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sean-fusire-eyes-international-debut-with-zimbabwe/\">Sean Fusire eyes international debut with Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "27 May 2025"
        },
        {
            "title": "Zimbabwean man arrested in Limpopo while driving Toyota RAV4 stolen in Pretoria",
            "url": "https://www.newzimbabwe.com/zimbabwean-man-arrested-in-limpopo-while-driving-toyota-rav4-stolen-in-pretoria/",
            "content": "IOL\n\nThe Polokwane Magistrates Court has remanded 43-year-old Zimbabwean national Mhlalisi Moyo in custody after he was arrested in Limpopo for possession of a suspected stolen motor vehicle.\n\nProvincial police spokesperson in Limpopo, Brigadier Hlulani Mashaba, said Moyo appeared in court on Friday, and his case was postponed to May 29 for formal bail application.\n\nLast week, Mashaba said Moyo was arrested during a joint operation comprising the SAPS anti-smuggling task team, Tshimollo Security and Investigation, Reflex Anti-hijacking Security, and Tracker SA.\n\nTheToyota RAV4was intercepted at approximately 8 pm (on Wednesday) near Shell Ultra City in Polokwane on the N1 highway, said Mashaba.\n\nZimbabwean man, Mhlalisi Moyo, was remanded in custody by the Polokwane Magistrates Court after he was arrested for possession of suspected stolen motor vehicle, a Toyota RAV4. Image: SAPS\n\nThe sport utility vehicle was reported stolen in Brooklyn, Tshwane.\n\nThe 43-year-old foreign national male was arrested at the scene, said Mashaba.\n\nOn Friday,IOL reported that the Mokopane Magistrates Court remanded 34-year-old Lucky Msizi Tshabanguin custody after he was arrested in Limpopo, while driving a stolen vehicle towards Zimbabwe.\n\nAt the time, Mashaba said the case against Tshabangu was postponed to Monday, enabling him to get legal representation.\n\nTshabangu is facing charges of possession of a suspected stolen motor vehicle, as well as reckless and negligent driving after he allegedly tried to flee from police.\n\nThe 34-year-old South African national was arrested at Mokopane last week, and police believe he was travelling to Zimbabwe with the stolen vehicle.\n\nLucky Msizi Tshabangu, 34, was remanded in custody after he was arrested in Limpopo, while allegedly driving a stolen Toyota Corolla Cross vehicle towards Zimbabwe. Image: SAPS\n\nIn an intelligence-driven operation, police officers intercepted a Toyota Corolla Cross at Mokopane CBD on the R101, which was en route to the Beitbridge port of entry, said Mashaba.\n\nInvestigations revealed that this vehicle had been reported stolen from the Wierdabrug policing area in Tshwane on Friday (16 May 2025).\n\nMeanwhile, provincial commissioner of police in Limpopo, Lieutenant General Thembi Hadebe has praised the vigilance of all law enforcement units involved.\n\nThe recovery of these twelve vehicles represents a significant blow to this criminal networks. Our officers and their partners continue to work tirelessly to dismantle these syndicates that threaten our communities and economy, she said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/27035716/Screenshot-2025-05-27-at-04.55.57.png",
            "description": "<p>IOL The Polokwane Magistrate’s Court has remanded 43-year-old Zimbabwean national Mhlalisi Moyo in custody after he was arrested in Limpopo for possession of a suspected stolen motor vehicle. Provincial police spokesperson in Limpopo, Brigadier Hlulani Mashaba, said Moyo appeared in court on Friday, and his case was postponed to May 29 for formal bail application.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-man-arrested-in-limpopo-while-driving-toyota-rav4-stolen-in-pretoria/\">Zimbabwean man arrested in Limpopo while driving Toyota RAV4 stolen in Pretoria</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "27 May 2025"
        },
        {
            "title": "Macron says he and wife were ‘horsing around’ in apparent fight caught on camera",
            "url": "https://www.newzimbabwe.com/macron-says-he-and-wife-were-horsing-around-in-apparent-fight-caught-on-camera/",
            "content": "A video that appears to show Frances First Lady Brigitte Macron pushing her husband in the face as the couple landed in Vietnam this weekend made the rounds in French and international media on Monday. President Emmanuel Macron has dismissed speculations that the worlds cameras may have been witness to a domestic squabble, saying the two were simply horsing around.\n\nFrench media on Monday tried to decipher the interaction that cameras spotted through the just-opened door of the plane as the couple disembarked in Hanoi Sunday for the start of a tour of Southeast Asia. The headline of a story on the website of the daily Le Parisien newspaper asked: Slap or squabble? The images ofEmmanuelandBrigitte Macrondisembarking in Vietnam trigger a lot of comment.\n\nTo display this content from X (Twitter), you must enable advertisement tracking and audience measurement.\n\nMacron later told reporters that the couple  married since 2007 after meeting at the high school where he was a student and she was a teacher  were simply joking around.\n\nWe are horsing around and, really, joking with my wife, he said, adding that the incident was being overblown: It becomes a sort of geo-planetary catastrophe.\n\nHe added that other videos had been misinterpreted, like ones purportedly showing him sharing abag of cocaineor confronting the Turkish president. None of these are true, he said, and everyone needs to calm down.\n\nHis office earlier offered a similar explanation.\n\nIt was a moment where the president and his wife were decompressing one last time before the start of the trip by horsing around. Its a moment of complicity. It was all that was needed to give ammunition to the conspiracy theorists, his office said.\n\nThe video showed a uniformed man pulling open the plane door and revealing the president standing inside, dressed in a suit and talking to someone who was not visible.\n\nTwo arms  in red sleeves  reached out and pushed Macron away, with one hand covering his mouth and part of his nose while the other was on his jawbone. The French leader recoiled, turning his head away. Then, apparently realising that he was on camera, he broke into a smile and gave a little wave.\n\nIn subsequent images, Macron and his wife, wearing a red jacket, appeared at the top of the stairs. He offered an arm but she did not take it. They walked down the carpeted stairs side by side.\n\nBrigitte Macron was Brigitte Auzire, a married mother of three children, when they met at his high school. A teacher, she supervised the drama club where Emmanuel Macron, a literature lover, was a member.\n\nHe moved to Paris for his last year of high school, but promised to marry Brigitte. She later moved to the French capital to join him and divorced before they finally married.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/27035439/macron-scaled.webp",
            "description": "<p>A video that appears to show France’s First Lady Brigitte Macron pushing her husband in the face as the couple landed in Vietnam this weekend made the rounds in French and international media on Monday. President Emmanuel Macron has dismissed speculations that the world’s cameras may have been witness to a domestic squabble, saying the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/macron-says-he-and-wife-were-horsing-around-in-apparent-fight-caught-on-camera/\">Macron says he and wife were ‘horsing around’ in apparent fight caught on camera</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "27 May 2025"
        },
        {
            "title": "Citizens transform urban green space in Zimbabwe",
            "url": "https://www.newzimbabwe.com/citizens-transform-urban-green-space-in-zimbabwe/",
            "content": "By Tawanda Mupatsi | DW\n\nWith Africas urban population expected to double by 2050, green city spaces will be vital. In Bulawayo, citizens have restored a neglected conservation area.\n\nThe historic Hillside Dams Conservancy in Bulawayo,Zimbabwe, is battling the spread of lantana camara, an invasive plant species that threatens the native vegetation. Conservationist Bernadette Mupinda and her team, along with volunteers, regularly uproot these plants to protect the areasbiodiversity. With over 100 indigenous plant species within the park as well as 200 bird species, their decline could harm this heritage site and its valuable ecosystem.\n\nFor volunteer student Zothile Zulu, community involvement is key to theconservationeffort  and she believes that tangible results encourage participation. The conservancy tracks plant populations using smartphone apps, and their work has led to a 70% reduction in invasive species.\n\nBut Zimbabwes urban green spaces also face broader threats, includingdeforestationand urban expansion. Each year, over 200,000 hectares (nearly 500,000 acres) of forest are cleared, often on wetlands, leading towater shortagesand increased wildfire risks.\n\nThe Hillside Dams Conservancy is also facing financial struggles. Its a popular spot with locals, but visitor fees cover only a portion of conservation costs, forcing the organization to seek external funding. Conservationists hope the area can serve as a model for other parks. With continued support, they aim to safeguard this landmark area and its biodiversity for the sake of future generations.\n\nThis article was originally publishedhere.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/27041934/Screenshot-2025-05-27-at-05.17.03-scaled.png",
            "description": "<p>By Tawanda Mupatsi | DW With Africa’s urban population expected to double by 2050, green city spaces will be vital. In Bulawayo, citizens have restored a neglected conservation area. The historic Hillside Dams Conservancy in Bulawayo, Zimbabwe, is battling the spread of lantana camara, an invasive plant species that threatens the native vegetation. Conservationist Bernadette Mupinda</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/citizens-transform-urban-green-space-in-zimbabwe/\">Citizens transform urban green space in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "27 May 2025"
        }
    ]
}