{
    "news": [
        {
            "title": "Govt declares DNC Coaches accident a national disaster, calls on families to identify victims for repatriation",
            "url": "https://www.newzimbabwe.com/govt-declares-dnc-coaches-accident-a-national-disaster-calls-on-families-to-identify-victims-for-repatriation/",
            "content": "By Thandiwe Garusa\n\nPresident Emmerson Mnangagwa has declared the fatal DNC Coaches bus accident, which claimed 43 lives along South Africas N1 highway on Sunday, a national disaster, pledging government support for repatriation and funeral expenses.\n\nIn a statement Tuesday, Local Government Minister Daniel Garwe issued an urgent appeal to relatives and friends of the victims to come forward and assist in identifying the deceased.\n\nGarwe said the government has arranged transport to ferry next of kin from Harares Makombe Building to Polokwane, where the bodies are currently being kept.\n\nThe President of the Republic of Zimbabwe, Cde Dr E.D. Mnangagwa, has since declared a State of Disaster and directed the Ministry of Local Government and Public Works through the Department of Civil Protection to provide state-assisted burials as well as payment of medical bills for the injured following the DNC Coach road accident in Makhado, Limpopo Province, South Africa.\n\nMeanwhile, next of kin are in the process of identifying the bodies of their loved ones to facilitate repatriation.\n\nIn this regard, the Ministry of Local Government and Public Works in collaboration with the Ministry of Foreign Affairs and International Trade and other Government entities, are calling upon relatives of the deceased to come forward and assist in the identification process, said Garwe.\n\nHe added that buses will depart from the National Disaster Management Centre at Makombe Building in Harare on 15 October 2025 at 12:00 p.m. to transport the next of kin to South Africa.\n\nThe repatriation process will commence after positive identification of the deceased. Government continues to rally behind the bereaved families during these trying times. In the same stride, we wish speedy recovery to the injured, Garwe said.\n\nThe tragic crash occurred around 6 p.m. on Sunday along the N1 North near Ingwe Lodge after the bus veered off the road and plunged down an embankment, killing 43 passengers and injuring several others.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/11/11180630/Daniel-Garwe-Minister-of-National-Housing-and-Social-Ammenities.jpg",
            "description": "<p>By Thandiwe Garusa President Emmerson Mnangagwa has declared the fatal DNC Coaches bus accident, which claimed 43 lives along South Africa’s N1 highway on Sunday, a national disaster, pledging government support for repatriation and funeral expenses. In a statement Tuesday, Local Government Minister Daniel Garwe issued an urgent appeal to relatives and friends of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-declares-dnc-coaches-accident-a-national-disaster-calls-on-families-to-identify-victims-for-repatriation/\">Govt declares DNC Coaches accident a national disaster, calls on families to identify victims for repatriation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "14 Oct 2025"
        },
        {
            "title": "Duo’s bid to stop US$250k fraud trial flops, court rules there is a case to answer",
            "url": "https://www.newzimbabwe.com/duos-bid-to-stop-us250k-fraud-trial-flops-court-rules-there-is-a-case-to-answer/",
            "content": "By Mary Taruvinga\n\nThe High Court has thrown out a bid by two Harare men accused of defrauding a woman of her US$250,000 house under the guise of a US$30,000 loan, ruling that their ongoing fraud trial must continue because there was a case to answer.\n\nJustice Joel Mambara last week dismissed an application for review filed by Leon Zvarevashe and Nyasha Mhuru, who had sought to overturn a magistrate Ethel Chicheras decision refusing to acquit them at the close of the States case.\n\nThe pair argued that the trial court had grossly misdirected itself by placing them on their defence despite what they called a complete lack of evidence.\n\nBut Justice Joel Mambara found that although the magistrate had misstated the legal test by saying a discharge is granted only in exceptional cases, the ruling itself was sound.\n\nStrictly speaking, the magistrate did err in suggesting that a discharge is granted only in exceptional circumstances, the judge said. However, her conclusion aligned with the substance of the law; there was a case to answer.\n\nZvarevashe and Mhuru are on trial for allegedly tricking complainant Debra Mullin into signing away her Hillside house in Harare, worth about US$250,000, when she believed she was signing a loan agreement.\n\nCourt papers show that in February 2023, Mullin and her daughter approached the two men seeking a US$30,000 loan. They were made to sign documents they thought related to the loan, only to later discover it was in fact an agreement of sale transferring ownership of the property.\n\nThe State alleges the pair unlawfully and intentionally misrepresented the true nature of the documents, causing potential prejudice of US$250,000.\n\nAt the close of the prosecutions case, the defence sought an acquittal, arguing that there was no proof of fraudulent intent and that the complainant had voluntarily signed the agreement. The magistrate dismissed the application, prompting the accused to approach the High Court seeking to halt the trial.\n\nIn his judgment, Mambara ruled that the magistrates decision did not amount to a gross irregularity warranting High Court intervention before the trial concludes.\n\nThe core allegation is that the complainant was deceived about what she was signing. On this point, the complainant testified unequivocally that she believed she was signing a loan agreement, not a sale, he said.\n\nIf a court believes that testimony, then a misrepresentation is established. There was evidence linking the applicants to the alleged fraud.\n\nThe judge said the complainants testimony, the signed documents, and evidence of partial repayments all pointed to a transaction that could reasonably be found to be a sham.\n\nHe said that mid-trial interference by the High Court is reserved for the rarest of cases.\n\nThis Court will not short-circuit the normal trial and appellate process absent a truly compelling reason, Mambara J stated. The magistrates decision was one a reasonable court could reach in light of the evidence.\n\nMambara concluded that there was no gross irregularity or injustice in the lower courts handling of the matter.\n\nThe alleged misdirection in articulating the test for discharge, while noted, did not result in any substantial miscarriage of justice, he ruled. The trial must proceed to completion, and the applicants remedies, if any, lie in the normal course of trial and appeal.\n\nThe application for review was accordingly dismissed, paving the way for Zvarevashe and Mhuru to either testify or exercise their right to silence when the defence hearing resumes.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/13181521/high-court-of-zimbabwe-3.jpg",
            "description": "<p>By Mary Taruvinga The High Court has thrown out a bid by two Harare men accused of defrauding a woman of her US$250,000 house under the guise of a US$30,000 loan, ruling that their ongoing fraud trial must continue because “there was a case to answer.” Justice Joel Mambara last week dismissed an application for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/duos-bid-to-stop-us250k-fraud-trial-flops-court-rules-there-is-a-case-to-answer/\">Duo’s bid to stop US$250k fraud trial flops, court rules there is a case to answer </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "14 Oct 2025"
        },
        {
            "title": "Survivors of horrific Limpopo crash that left 42 dead claim bus was overloaded",
            "url": "https://www.newzimbabwe.com/survivors-of-horrific-limpopo-crash-that-left-42-dead-claim-bus-was-overloaded/",
            "content": "Daily Maverick\n\nFamilies of passengers killed in a horrific bus crash near Makhado say the operator of the cross-border bus from Gqeberha to Zimbabwe and Malawi failed to provide information or a passenger list, leaving them desperate for answers.\n\nFriends and relatives of the victims of a bus crash near Makhado in Limpopo on Sunday, 12 October said they were frustrated by the bus companys failure to help them locate missing loved ones, leaving them unsure if they had died or were in hospital.\n\nThe bus was travelling on the N1 highway outside Makhado when it veered off the mountainous road and plunged down an embankment, killing 42 passengers.\n\nLimpopo Premier Dr Phophi Ramathuba said, This is a heartbreaking tragedy. Losing so many lives in one incident is painful beyond words  We extend our deepest condolences to the affected families, including those in Zimbabwe and Malawi. We wish a full and speedy recovery to all survivors.\n\nDanny Jacob, the manager of DNC Bus Services, which operates the bus, said the 61-seater bus was two years old. He said it left Gqeberha on Saturday with 40 passengers and picked up other passengers in East London and other places along the route to make up a total of 58 passengers.\n\nHowever, Transport Minister Barbara Creecy said that in addition to the 42 who died, another 49 passengers were injured  six critically, 31 seriously and 12 slightly.\n\nJacob said, I want to clear the air on this issue. The bus was never overloaded, and everything was in order when it was travelling. This is the work of people with bad intentions who are taking advantage of the advent of social media to spread wrong information.\n\nIt should also be noted that the area where the accident happened is notorious for accidents. This is our second bus to have had an accident there, and there were also several buses, trucks and small vehicles that overturned there before. Our condolences go to the affected families. We will stand with the survivors and families of the deceased.\n\nBut relatives are unconvinced.\n\nEdith Mukuse, whose sister and sister-in-law boarded the bus in Gqeberha, said repeated attempts to get information from the company had failed.\n\nHer relatives worked on a farm in Patensie. She said what hurt most was that her many calls to the bus operator were fruitless, and she had to physically visit its offices at the Gqeberha Railway Station.\n\nA tearful Mukuse said the bus operators should update people through their WhatsApp channels. Her relatives, whom she did not want to name until they were located, were seasonal workers in Patensie.\n\nI never thought that such a disaster would happen to me, said Mukuse. What I want to know is the fate of my relatives. We depend on information from the bus operator, but it then baffles me if they fail to inform us. They keep saying they are busy compiling the passenger log.\n\nMy sister was building her house in Masvingo and had spent a lot of money buying equipment that she had. This means everything is lost. What will I say to her three young children?\n\nShe was the breadwinner, and things are made complicated now that we are failing to locate both of them. Why is the bus owner not updating us on the developments, and to also provide a passenger log so that they can dispel allegations that the bus had 91 passengers? They should at least show empathy and have a human heart by telling the truth.\n\nA Malawian national who came to check the whereabouts of his two friends also went home disheartened. He did not want to divulge his name, but said he would return to the office the next day.\n\nHe said, Theres nothing I can say about the behaviour of the bus operators except to demand transparency. The person at the office is just a lady who knows nothing. It seems they took away from the office the experienced people we normally see there. She has no helpful information at all. This is the time when they should put people with information at the front office. This kind of unprofessionalism should stop.\n\nThe man, who works in Seaview in Nelson Mandela Bay as a domestic worker together with his friends, said he gave them groceries and money to give to his parents in Lilongwe, Malawi.\n\nI dont care about the money and the groceries I gave them; what I want is to know about the whereabouts of my friends. We were working together, but they got an early leave and were to return at the end of November so that I would also take my annual leave.\n\nI only want to have the truth told about their welfare. I am receiving countless calls from their relatives in Malawi, and I dont have words to soothe them, he said.\n\nTichaona Mukandiona (24) was one of the survivors of the crash. On Monday, he said he had only realised earlier in the day that he was in hospital. He said he was unsure what happened as he had fallen asleep before the crash.\n\nI boarded the bus [in East London] on Saturday around 6pm. The bus was already full with passengers. I had no seat, so I had to travel the whole of Saturday night and part of Sunday while standing. As we were about to reach Louis Trichardt, I felt so tired that I had to sit on another passenger who was asleep.\n\nMukandiona, who was travelling to Harare, Zimbabwe, said the belongings and money he was travelling with  R2,500 in his wallet, a satchel and clothes  were missing.\n\nWillard Suwedi, a Malawian passenger, said the bus had a few empty seats when they left Gqeberha.\n\nThe bus got overloaded at East London, but the conductor kept on picking up other passengers as we travelled towards Gauteng. As we travelled towards Louis Trichardt, the driver stopped because he had discovered the bus had developed some faults, but he decided to continue with the journey, he said.\n\nSuwedi said the bus started to speed up after Makhado and the driver did not heed his pleas to slow down.\n\nHe said none of his family members was aware of what had happened to him and that he did not know where his belongings, including two mobile phones, were. He sustained multiple bruises all over his body.\n\nPresident Cyril Ramaphosa said, This incident is a tragedy for South Africa and our sister states of Zimbabwe and Malawi alike. This sadness is compounded by the fact that this incident has taken place during our annual Transport Month, where we place a special focus on the importance of safety on our roads.\n\nOur roads are also economic networks that bring the people of our region together across our national borders. We must do everything we can as road users, as transport operators, drivers and passengers to ensure that we stay safe and that we share our roads responsibly and with care for one another.\n\nForensic investigations into the cause of the crash continued on Monday, with the N1 near Ingwe Lodge closed for several hours as emergency services cleared the wreckage.\n\nZimbabwean President Emmerson Mnangagwa issued a statement pledging to assist in the burial of Zimbabweans and to assist the injured.\n\nI have instructed the relevant government departments and agencies in Zimbabwe to extend state assistance towards the repatriation of the remains of Zimbabweans who perished in the accident, and to extend similar assistance towards the burial. In respect to the injured, the government will meet all hospital bills, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/14083758/dnc-bus.webp",
            "description": "<p>Daily Maverick Families of passengers killed in a horrific bus crash near Makhado say the operator of the cross-border bus from Gqeberha to Zimbabwe and Malawi failed to provide information or a passenger list, leaving them desperate for answers. Friends and relatives of the victims of a bus crash near Makhado in Limpopo on Sunday,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/survivors-of-horrific-limpopo-crash-that-left-42-dead-claim-bus-was-overloaded/\">Survivors of horrific Limpopo crash that left 42 dead claim bus was overloaded</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "14 Oct 2025"
        },
        {
            "title": "Venezuela plans new embassy in Zimbabwe,  snubs Norway and Australia",
            "url": "https://www.newzimbabwe.com/venezuela-plans-new-embassy-in-zimbabwe-snubs-norway-and-australia/",
            "content": "Business Live\n\nVenezuelas government said on Monday it will close its embassies in Norway and Australia and open new ones in Zimbabwe and Burkina Faso as part of a restructuring of its foreign service, after weeks of growing tensions with the US.\n\nThe closures are part of the strategic re-assignation of resources, President Nicolas Maduros government said in a statement, adding that consular services to Venezuelans in Norway and Australia would be provided by diplomatic missions, with details to be shared in coming days.\n\nCaracas said it was setting up new embassies in two sister nations, strategic allies in the anti-colonial fight and in the resistance against hegemonic pressures.\n\nIt added that these new embassies would serve to launch joint projects involving agriculture, energy, education, mining and other common interests. The announcement occurred just days after the Nobel Committee in Oslo announced that Venezuelan opposition leaderMaria Corina Machadohad won the 2025 Nobel Peace Prize for fighting dictatorship in the South American country.\n\nThe embassy closures with the two US allies also followed weeks of escalating tensions between Caracas and Washington.\n\nVenezuela has called on the UN for support over several deadly US military strikes on vessels off its Caribbean coast, which Washington alleges were carrying drugs.\n\nSome US allies on the UN Security Council called for de-escalation and dialogue.\n\nVenezuela has said it is in a situation where it is rational to expect an armed attack against the country in the short term, and Maduro has alleged the US is seeking a change in government.\n\nWashington has not responded to this accusation but has called Venezuelas socialist leader the illegitimate head of a narco-state. The US has also announced a new counter-narcotics task force in its Southern Command, a military branch that oversees Latin America.\n\nThe governments of Zimbabwe and Burkina Faso are more aligned with that of Russia, which has supported Venezuela at the UN and accused the US of acting according to the cowboy principle of shoot first.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/14054735/venezuela-president.jpg",
            "description": "<p>Business Live Venezuela’s government said on Monday it will close its embassies in Norway and Australia and open new ones in Zimbabwe and Burkina Faso as part of a restructuring of its foreign service, after weeks of growing tensions with the US. The closures are part of the “strategic re-assignation of resources”, President Nicolas Maduro’s</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/venezuela-plans-new-embassy-in-zimbabwe-snubs-norway-and-australia/\">Venezuela plans new embassy in Zimbabwe,  snubs Norway and Australia</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "14 Oct 2025"
        },
        {
            "title": "“2017 taught us a big lesson” – Chamisa rejects calls to join Geza’s planned protests",
            "url": "https://www.newzimbabwe.com/2017-taught-us-a-big-lesson-chamisa-rejects-calls-to-join-gezas-planned-protests/",
            "content": "By Staff Reporter\n\nFormer Citizens Coalition for Change (CCC) leader Nelson Chamisa said he will not participate in the 17 October planned protests against President Emmerson Mnangagwas government.\n\nThis decision, he explains, stems from the oppositions experience with the November 2017 military takeover. He says their involvement then served as a salutary lesson, teaching them not to become entangled in Zanu-PFs internal factional and succession battles.\n\nThis follows a call from ousted Zanu-PF Central Committee member Blessed Runesu Geza for a one-million-man march on Friday, aimed at protesting against Mnangagwa and his alleged corrupt cartel. Gezas accusations target a number of high-profile figures, including controversial business tycoons such as Wicknell Chivayo, Geo Pomona CEO Delish Nguwaya, Paul Tungwarara, and Kudakwashe Tagwirei.\n\nHowever, analysts suggest that the planned protest goes beyond mere accusations of corruption but points to a deeper succession war playing out between Mnangagwas faction and his deputy, Rtd General Constantino Chiwenga.\n\nChiwenga is the favourite to take over from Mnangagwa, with many believing he has been patiently waiting for his turn. Yet, his path is reportedly being obstructed by Mnangagwa loyalists, who are now calling for the incumbent to extend his term of office beyond the constitutional limit of two terms.\n\nThis echoes the experience of the opposition previously, the Movement for Democratic Change (MDC), as it was then known, which took to the streets in a protest that ousted former President Robert Mugabe from power, anticipating a role in a new government.\n\nThat hope proved to be short-lived. The MDC felt betrayed and used, having been abandoned by Zanu-PF and Mnangagwa himself shortly after Mugabes departure.\n\nResponding directly to calls for him and his supporters to join Fridays protests in Harare, Chamisa wrote, 2017 taught us a big lesson!.\n\nHe added that the root cause of the countrys problems lies in disputed elections, maintaining that until this issue is addressed, Zimbabwe will remain trapped in its socioeconomic and political challenges.\n\nIgnoring the 2023 stolen election is ignoring the root of our crisis. Anything that does not address the 2023 stolen election is a fraud and a waste of time. Corruption, capture, suffering  theyre symptoms of a disputed mandate and a contested government. Lets treat the cause, not the symptoms, Chamisa wrote on his X account Monday.\n\nChamisa still commands a considerable following among opposition supporters despite his resignation from the CCC in January 2024, which left the opposition in further disarray.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/08/28082345/chamisa_.jpg",
            "description": "<p>By Staff Reporter Former Citizens Coalition for Change (CCC) leader Nelson Chamisa said he will not participate in the 17 October planned protests against President Emmerson Mnangagwa’s government. This decision, he explains, stems from the opposition’s experience with the November 2017 military takeover. He says their involvement then served as a salutary lesson, teaching them</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/2017-taught-us-a-big-lesson-chamisa-rejects-calls-to-join-gezas-planned-protests/\">“2017 taught us a big lesson” – Chamisa rejects calls to join Geza’s planned protests</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "14 Oct 2025"
        },
        {
            "title": "Madagascar president hiding in ‘safe place’ as he warns of coup attempt",
            "url": "https://www.newzimbabwe.com/madagascar-president-hiding-in-safe-place-as-he-warns-of-coup-attempt/",
            "content": "BBC\n\nMadagascars embattled President Andry Rajoelina has said he is sheltering in a safe place after an attempt on his life, following weeks of protests calling for him to quit.\n\nIn a live broadcast to the nation on Facebook, Rajoelina, 51, said a group of military personnel and politicians planned to assassinate me.\n\nHe did not reveal his location, but unconfirmed reports earlier suggested that he had fled the country on a French military aircraft.\n\nIt follows a fortnight of nationwide protests, mainly led by young demonstrators, aimed at kicking him out of power.\n\nRajoelinas failed attempts to placate the young protesters  dubbed Gen Z Mada  saw the president sack his entire government and makeother concessionsto no avail.\n\nHe has not been seen since Wednesday, and at the weekend Rajoelinas office said an attempt was under way to force him from power.\n\nHis address to the nation was delayed several times on Monday amid the chaos, as soldiers threatened to seize the state TV headquarters in the Indian Ocean island.\n\nEventually, in the Facebook broadcast he said: Since 25 September, there have been attempts on my life and coup attempts. A group of military personnel and politicians planned to assassinate me.\n\nI was forced to find a safe place to protect my life.\n\nThere is only one way to resolve these issues; that is to respect the constitution in force in the country.\n\nAFP via Getty Images Young people spearheaded nationwide rallies demanding a fairer deal for citizens\n\nOver the weekend, CAPSAT, a powerful army unit that helped install Rajoelina into power in 2009 moved to undermine him by declaring itself in command of all the armed forces, while some of its officers joined protesters on the streets of the capital, Antananarivo.\n\nFollowing a meeting of military commanders on Monday, the new Chief of Army Staff installed by CAPSAT, Gen Demosthene Pikulas, assured the public that the security forces were working together to maintain order in the island nation.\n\nBy Monday evening, the general was at state TV headquarters trying to resolve the crisis, according to a statement from the presidency.\n\nSpeaking on condition of anonymity, a senior leader in Madagascars largest opposition party, TIM, told the BBC that Madagascar was now effectively being run by the army unit.\n\nThe TIM party has also said that it plans to bring impeachment proceedings against Rajoelina for abandonment of post.\n\nSeveral of Rajoelinas inner circle have fled to nearby Mauritius. They include former Prime Minister President Richard Ravalomanana and the businessman Maminiaina Ravatomanga.\n\nDespite its abundant natural resources, Madagascar is one of the poorest countries in the world. About 75% of people there live below the poverty line, the World Bank says, while data from the International Monetary Fund (IMF) shows just over one-third of people have access to electricity.\n\nThe protests began over anger with repeated water and power cuts, then escalated to reflect wider dissatisfaction with Rajoelinas government over high unemployment, corruption and the cost-of-living crisis.\n\nAt least 22 people were killed and more than 100 injured in the first few days of the protests, according to the UN, although the government has rejected these figures.\n\nEyewitnesses describe security officers opening fire on protesters with live ammunition. In one case,a newborn baby diedfrom smoke inhalation after being exposed to tear gas.\n\nMadagascar has been rocked by multiple uprisings since it gained independence in 1960, including mass protests in 2009 that forced then-President Marc Ravalomanana to step down and saw Rajoelina ushered into office.\n\nAged just 34 at the time, Rajoelina became Africas youngest leader  going on to govern for four years, then returning to power again after the 2018 election.\n\nRajoelina was born into wealth and, before entering politics, had made a name for himself as an entrepreneur and DJ  setting up a radio station and an advertising company along the way.\n\nBut his sharp-suited, baby-faced appeal soon waned, as allegations of cronyism and entrenched corruption became unshakeable.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/14050708/madagascar-andry.webp",
            "description": "<p>BBC Madagascar’s embattled President Andry Rajoelina has said he is sheltering in a “safe place” after an attempt on his life, following weeks of protests calling for him to quit. In a live broadcast to the nation on Facebook, Rajoelina, 51, said “a group of military personnel and politicians planned to assassinate me”. He did</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/madagascar-president-hiding-in-safe-place-as-he-warns-of-coup-attempt/\">Madagascar president hiding in ‘safe place’ as he warns of coup attempt</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "14 Oct 2025"
        }
    ]
}