{
    "news": [
        {
            "title": "Comic Elder strikes gold again, gifted US$150,000 by Chivayo for ‘making President laugh’",
            "url": "https://www.newzimbabwe.com/comic-elder-strikes-gold-again-gifted-us150000-by-chivayo-for-making-president-laugh/",
            "content": "By Mary Taruvinga\n\nComedian Leeroy Tadiwanashe Zavare, popularly known as Comic Elder, has once again found himself in the spotlight, this time after controversial businessman Wicknell Chivayo gifted him a staggering US$150,000 for making the President laugh.\n\nThis comes a few daysafter President Emmerson Mnangagwa personally handed hima brand-new Ford Raptor.\n\nIn a lengthy social media post, Chivayo said the cash gift was a small token of appreciation for the comedians talent and humour.\n\nFor a young comedian to make the President of the Republic laugh is never a small achievement!His Excellencys words  Ndafara newe mfana  set you apart. Ukafadza President, neniwo unenge wandifadza and wafadza nyika yese!\n\nThe controversial tenderpreneur, known for showering public figures with luxury cars and cash gifts, told Comic Elder to collect US$150,000 from his lawyer Sikhumbuzo Mpofu andbuy a decent house.\n\nFor safety, the money can be transferred directly to your preferred bank account, Chivayo added. Or my lawyer can facilitate the purchase of your desired house and transfer it into your name. The choice is entirely yours.\n\nComic Elderscharacters,including Anna Mugwaku, Obvious Mututu, Alfred Mweya, Nichodimas Chigovanyika, and Potipher Zvombo, have become household favourites.\n\nChivayos lavish spending on public figures landed him in a corruption dossier reportedly authored by Vice President Constantino Chiwenga, calling for investigations into possible siphoning of state funds through dubiously awarded tenders.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/27064152/comic-elder.jpg",
            "description": "<p>By Mary Taruvinga Comedian Leeroy Tadiwanashe Zavare, popularly known as Comic Elder, has once again found himself in the spotlight, this time after controversial businessman Wicknell Chivayo gifted him a staggering US$150,000 “for making the President laugh.” This comes a few days after President Emmerson Mnangagwa personally handed him a brand-new Ford Raptor. In a lengthy social</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/comic-elder-strikes-gold-again-gifted-us150000-by-chivayo-for-making-president-laugh/\">Comic Elder strikes gold again, gifted US$150,000 by Chivayo for ‘making President laugh’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:47",
            "date": "27 Oct 2025"
        },
        {
            "title": "South Africa boosts deportations amid jobs crisis, minister says",
            "url": "https://www.newzimbabwe.com/south-africa-boosts-deportations-amid-jobs-crisis-minister-says/",
            "content": "Bloomberg\n\nSouth Africa is pushing to deport more undocumented migrants who compete with citizens for jobs in an economy with one of the highest unemployment rates globally, the minister overseeing the program said.\n\nThe nation is a neglected part of the global migration story, with the contestation between foreigners and locals for positions becoming a real tinderbox, Home Affairs Minister Leon Schreiber said in an interview on Bloomberg Television Friday. Weve deported 51,000 people in the last year  thats more than France and Germany combined. If we had more resources, wed be doing more of that.\n\nSouth Africa has the continents most industrialised economy and sees a constant influx of job seekers from neighbouring countries, including Zimbabwe and Mozambique. But with the unemployment rate running at 33.2%, tensions between locals and foreigners run high. About 8.4 million people are eligible to work yet dont have jobs.\n\nIn 2008, about 60 people died and 50 000 were displaced in a wave of xenophobic violence, with foreigners blamed for everything from unemployment to poor government services.\n\nThere were similar riots in 2015 and again in 2019, when President Cyril Ramaphosa was forced to apologize to other African nations who were appalled by the treatment of their citizens. Local media recently reported on incidents of foreigners being chased away from health clinics by angry residents.\n\nSouth Africa is managing the situation responsibly, said Schreiber, who is a member of the Democratic Alliance, the second-biggest member of the countrys 10-party governing coalition.\n\nWere anchoring what we do in the rule of law to make sure that we also protect social cohesion, even as we enhance our enforcement operations, he said.\n\nA so-called government of national unity was formed in June last year, when the ruling African National Congress failed to secure a parliamentary majority in a national vote for the first time since apartheid ended in 1994. The ANC and DA have since clashed repeatedly over policy and appointments, raising doubts over whether the alliance will remain intact.\n\nWere in a better space now than we were initially, Schreiber said, adding that disputes are quite normal in any society with a coalition government.\n\nThe coalition succeeded in navigating a budget impasse and with a new fiscal cycle about to begin, Schreiber said hes hopeful any differences can be resolved in a less public and destructive way.\n\nIf we can succeed in that, I think that builds another layer of confidence that we actually are working pretty well together, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/23051938/leon-schreiber.jpg",
            "description": "<p>Bloomberg South Africa is pushing to deport more undocumented migrants who compete with citizens for jobs in an economy with one of the highest unemployment rates globally, the minister overseeing the program said. The nation “is a neglected part of the global migration story,” with the contestation between foreigners and locals for positions becoming “a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africa-boosts-deportations-amid-jobs-crisis-minister-says/\">South Africa boosts deportations amid jobs crisis, minister says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:47",
            "date": "27 Oct 2025"
        },
        {
            "title": "Storm brews over Zimbabwe presidential extension plan",
            "url": "https://www.newzimbabwe.com/storm-brews-over-zimbabwe-presidential-extension-plan/",
            "content": "By AFP\n\nThe Zimbabwe ruling partys backing of a term extension for President Emmerson Mnangagwa, which requires a change to the constitution, has fuelled anger and fears of deepening authoritarianism.\n\nZanu-PF, accused of corruption and misrule during its 45 years in power, announced a week ago that its annual congress supported moves to keep Mnangagwa in office until 2030, and required legislative amendments would be initiated.\n\nProminent lawyer Tendai Biti immediately pledged to defend the constitution against its capture while opposition figures called a press conference for Tuesday to respond to the constitutional crisis.\n\nMnangagwa, 83, came to power in 2017 in a military-backed coup that ousted Robert Mugabe, who was president for 30 years.\n\nElected in 2018 and re-elected in 2023, Mnangagwa has been accused of allowing rampant corruption and suppressing human rights, while ordinary Zimbabweans endure hardship even though the economy is growing.\n\nMoves to keep him on were a huge scandal, said Moses Msipa, a former soldier living in the second largest city of Bulawayo.\n\nAs Zimbabweans, we must say no to this, the 48-year-old told AFP. One of the main reasons Mugabe became reviled is because he became a dictator and overstayed, and now they want to take us back to that.\n\nOrdinary Zimbabweans have suffered under years of economic crisis while ruling party elites are accused of corruption  Zinyange Auntony / AFP\n\nZanu-PFs 2030 agenda had been on the cards for months before it was announced as the party position on October 18.\n\nAttempts over the past months to demonstrate against the plan were met with a harsh police crackdown that put scores of people in jail.\n\nOnly mass popular expression of dissent may change course, but prospects of such are low at the moment on account of weak grassroots organising and mobilising, said Musa Kika, director of the Institute for Human Rights and Development in Africa.\n\nResistance is highly unlikely under such circumstances, notwithstanding the public anger that they harbour, political analyst and university professor Eldred Masunungure told AFP.\n\nThe constitutional limit of two five-year presidential terms was introduced in 2013. Any change would require a series of legal steps, including the approval of two-thirds of both houses of parliament and a national referendum.\n\nIf the term extension agenda was put to a referendum, it would be defeated, said Stephen Chan, a professor at the School of Oriental and African Studies in London.\n\nThe Zimbabwean people also want No Kings, he said, referring to rallies in the United States this month critical of President Donald Trump.\n\nResistance within the Zanu-PF could see a faction backing Vice President Constantino Chiwenga join forces with the opposition to block any constitutional amendment, he said.\n\nThe analysts warned that the party that has governed since independence in 1980 would not be above bypassing constitutional safeguards.\n\nZanu-PF uses the law as a tool to achieve its ends, never as a boundary for compliance and accountability, said Kika. The party is good at manipulating the institutions that operationalise the law through coercion and capture.\n\nEfforts to keep Mnangagwa in office were led by self-serving party elites seeking immunity from accountability for past and present wrongs, and assurance for continued accumulation of wealth, he said.\n\nMnangagwa was useful for party members who abuse state power and its resources more or less unhindered, added Masunungure.\n\nWith the opposition splintered and weak after years of repression, unemployed Bulawayo university graduate Tafadzwa Moyo told AFP he understood the nervousness about standing up to the government.\n\nStill, the 29-year-old said, it was time for citizens to unite across political divisions and fight to reclaim democracy.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/07/22195935/F1o4Bw1WwAEXt93.jpg",
            "description": "<p>By AFP The Zimbabwe ruling party’s backing of a term extension for President Emmerson Mnangagwa, which requires a change to the constitution, has fuelled anger and fears of deepening authoritarianism. Zanu-PF, accused of corruption and misrule during its 45 years in power, announced a week ago that its annual congress supported moves to keep Mnangagwa</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/storm-brews-over-zimbabwe-presidential-extension-plan/\">Storm brews over Zimbabwe presidential extension plan</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:47",
            "date": "27 Oct 2025"
        },
        {
            "title": "Dynamos in nail-biting victory against Highlanders, books place in Chibuku Super Cup final",
            "url": "https://www.newzimbabwe.com/dynamos-in-nail-biting-victory-against-highlanders-books-place-in-chibuku-super-cup-final/",
            "content": "By Sports Reporter\n\nHARARE footballing giants, Dynamos have become the first club in Premier Soccer League (PSL) history to qualify for three consecutive Chibuku Super Cup finals.\n\nDembares ticket to the final came after beating Highlanders 5-3 on penalties after playing a 1-1 draw in regulation time.\n\nSundays win gave Dynamos a chance to defend the Chibuku Super Cup, which they won in 2023 and 2024.\n\nDynamos took a first-half lead, thanks to Emmanuel Jalais 15th-minute strike.\n\nHowever, Bosso came back in the second half with determination and focus, which saw them score an equaliser in the 68th minute through Melikhaya Ncube.\n\nAfter playing a one-all draw in regulation time, the match headed straight for penalty shootouts, where they scored all their spot kicks, taking advantage of Bosso, who missed their fourth kick through Prince Ndlovu.\n\nDynamos coach Kelvin Kaindu could not hide his happiness as he praised his charges performance.\n\nIm happy; if you look, there is an improvement in how we are keeping possession as a team.\n\nOur performance was good; even in penalty shootouts, we proved to be the best, and I have to praise the boys, said Kaindu.\n\nDynamos will now play Triangle FC in the final, which is scheduled for next month on a date to be announced.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/11/24052151/dynamos-google-supporter.png",
            "description": "<p>By Sports Reporter HARARE footballing giants, Dynamos have become the first club in Premier Soccer League (PSL) history to qualify for three consecutive Chibuku Super Cup finals. Dembare’s ticket to the final came after beating Highlanders 5-3 on penalties after playing a 1-1 draw in regulation time. Sunday’s win gave Dynamos a chance to defend</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dynamos-in-nail-biting-victory-against-highlanders-books-place-in-chibuku-super-cup-final/\">Dynamos in nail-biting victory against Highlanders, books place in Chibuku Super Cup final</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:47",
            "date": "27 Oct 2025"
        },
        {
            "title": "SustiGlobal celebrates US$6 billion projects in decade",
            "url": "https://www.newzimbabwe.com/sustiglobal-celebrates-us6-billion-projects-in-decade/",
            "content": " As environmental, social impact comes under spotlight\n\nBy Tichaona Zindoga\n\nA local environmental consultancy firm, SustiGlobal, has set a major milestone after clocking over US$6 billion worth of investment and infrastructure projects in its first decade in business.\n\nSustiGlobal, whichintegratesenvironmental, engineering, and development consultancy,conducted environmental and social impact assessments (ESIA) in nearly 160 major projects in the country and the region.\n\nThe uptick of investments in recent years, especially with the proliferation of Chinese investments, has increased demand for ESIAs as a key pillar for sustainability. In Zimbabwe, the Environmental Management Agency approves ESIAs for projects with significant environmental (natural or biophysical) andsocial impacts, which is a legal requirement under the Environmental Management Act.\n\nSustiGlobal founder and chairman Oliver Mutasa\n\nSince inception, we have exponentially grown to be a significant player in the sustainability consultancy industry by being clients best choice, saysSustiGlobalfounder and chairman, Oliver Mutasa.\n\nBeing a multi-faceted advisory company, we pride in our vast hands-on experience in offering environmental management, occupational health safety, quality management, baseline surveys, and GIS services that are designed tosurpass international standards and environmental capacity building of various communities and stakeholders, Mutasa says.\n\nThe firm has undertaken ESIA for 155 projects wortha cumulativeUSD 6,7 billionaccording to Mutasa. These include:\n\nWorking with Communities\n\nLocal communities are key in the undertaking of ESIAs, as they are the ones impacted by projects, some of whom leave negative footprint scarring the environment forever.\n\nSustiGlobalconsulting teams are in communities courtersy of projects that theywill be working on, they use the opportunity to fully disclose to the same stakeholders about the project in question and use the same project to train the same communities and stakeholders about their environmental rights as premised in Section 73 of theConstitution of Zimbabwe (2013), which deals with Environmental Rights which are;Right to a Safe and Healthy Environment,Duty to Protect the Environmentand States Responsibility to make laws. These trainings empower communities to hold their developers (investors) and government agencies to account and any behaviour that may affect the same communities.\n\nOver the decade, in the 155 projects thatSustiGlobal has done, about 155 communities that translate to 4,650 people have been trained in theircommunities on impacts of development on environment.The same training would equip the communities to be knowledgeable about what they should demand from future investors who may come to them.\n\nConcurrently, SustiGlobal has undertaken Social Upliftment Programmes in communities through donation of soccer and netball ballsand distribution of sanitary pads in underprivileged ruralcommunitiessorely and in partnership with other organizations. The company alsopayfees for orphans and the vulnerable children in the communities,reflecting the deep philanthropic values of the founder, who is a devout Christian and community builder and change maker.\n\nCapacity\n\nSustiGlobal partly ownsSusti Global Africa (in South Africa) as a subsidiary, in charge of projects in South Africa.To broaden its capacity, the company has partnered consulting firms in Canada, Ethiopia, Egypt, Zambia, Mozambique and South Africa in a number of projects and that is expected to continue into Europe as the company is ushered into the second decade.\n\nAs part of diversification strategy since 2022, the company has entered into civil and structural engineering space in itsdesire to contributeto thebrick-by-brickbuilding of this countryand the global south region. This strategic direction is driven by a desire toaddgoods to the services that the firm has already been offering to the market, the firm says.\n\nMutasa looks back at the past decade, noting that the company has played its part in contributing positively to Zimbabwe.\n\nWe are deeply honored to have reached this important milestone as we continue contributing to national development in our professional capacity, he said.\n\nThe journey has certainly not beeneasy,particularly given the challenging economic environment our nation has faced.\n\nHowever, through resilience and invaluable support from the government, we have persevered and achieved significant progress. As weenter our second decade in this business, we look forward to continued collaboration and support from stakeholders both locally and internationally.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/26125259/power.jpeg",
            "description": "<p>… As environmental, social impact comes under spotlight By Tichaona Zindoga A local environmental consultancy firm, SustiGlobal, has set a major milestone after clocking over US$6 billion worth of investment and infrastructure projects in its first decade in business. SustiGlobal, which integrates environmental, engineering, and development consultancy, conducted environmental and social impact assessments (ESIA) in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sustiglobal-celebrates-us6-billion-projects-in-decade/\">SustiGlobal celebrates US$6 billion projects in decade</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:47",
            "date": "27 Oct 2025"
        },
        {
            "title": "Report suspicious police roadblocks, says ZRP",
            "url": "https://www.newzimbabwe.com/report-suspicious-police-roadblocks-says-zrp/",
            "content": "By Costa Nkomo\n\nTHE Zimbabwe Republic Police (ZRP) has urged members of the public to report any suspected bogus traffic roadblocks, warning that rogue officers found conducting such operations will face disciplinary action.\n\nThis follows growing public concern over the increasing number of police roadblocks, particularly in cities such as Harare, where some motorists have complained about encountering several checkpoints within short distances in some cases less than 10 kilometres apart.\n\nIn a statement issued on Thursday, national police spokesperson, Commissioner Paul Nyathi called on the public to alert authorities if they come across suspicious roadblocks.\n\nIn this regard, members of the public are encouraged to engage the Commissioner General of Police or the respective Provincial Command if there are concerns about unusual roadblock deployments in certain areas. Disciplinary action will be taken against any police officer who conducts roadblock duties in a manner which is not in conformity with police set standards, said Nyathi.\n\nHe emphasised that official police roadblocks are not conducted randomly, explaining that, under traffic regulations, they are typically located within a 30 to 50-kilometre radius and are subject to close supervision to prevent misconduct and corruption.\n\nThe Zimbabwe Republic Police Command reiterates that all police roadblock schedules are submitted by Station, District and Provincial Police Commanders to the Police General Headquarters Operations Department for guidance and clearance.\n\nThe policy of the Zimbabwe Republic Police is that no roadblocks are manned within a 30 to 50 kilometre radius of each policing area, whether in urban or rural set up. The police officers conducting roadblock duties are supervised by Station, District and Provincial Commanders to prevent cases of indiscipline or corruption and ensure quality service to the public, he said.\n\nCommissioner Nyathi further explained that exceptions to these guidelines may occur when the police respond to national events or urgent security situations.\n\nHowever, the public should take note that police roadblocks are heightened or increased during public order situations, national events, or special operations such as reacting to an immediate incident or scene involving moving criminals or stolen property. Soon after, the situation has to revert back to the ideal scenario.\n\nThe ZRP has faced growing criticism in recent years over reports of police officers accepting bribes from motorists, particularly commuter operators in major cities such as Harare and Bulawayo. Several officers have been caught on camera allegedly taking money from public transport drivers and other motorists, further fuelling public mistrust.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/19204352/Paul-Nyathi-3.png",
            "description": "<p>By Costa Nkomo THE Zimbabwe Republic Police (ZRP) has urged members of the public to report any suspected bogus traffic roadblocks, warning that rogue officers found conducting such operations will face disciplinary action. This follows growing public concern over the increasing number of police roadblocks, particularly in cities such as Harare, where some motorists have</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/report-suspicious-police-roadblocks-says-zrp/\">Report suspicious police roadblocks, says ZRP </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:47",
            "date": "27 Oct 2025"
        }
    ]
}