{
    "news": [
        {
            "title": "China and the US are in a race for critical minerals. African countries need to make the rules",
            "url": "https://www.newzimbabwe.com/china-and-the-us-are-in-a-race-for-critical-minerals-african-countries-need-to-make-the-rules/",
            "content": "By The Conversation\n\nCritical mineralssuch as lithium, cobalt, nickel, copper, rare earth elements, and platinum group metals are essential for modern technologies. They are key to industries ranging from electronics and telecommunications to renewable energy, defence, and aerospace systems.\n\nThe global demand for these minerals has been growing, as has the competition for them.\n\nThe supply and production of these minerals is largely concentrated in the global South. Most of the worlds cobalt is produced in the Democratic Republic of Congo (DRC). It produces almostthree-quartersof the global cobalt output. Australia produces nearly half of the worlds lithium.Chile accounts for another quarter of global lithium production, with China following at 18%.\n\nChina dominates the supply chain through massive investments in mining operations, particularly in Africa.It is responsible for refining 90% of rare earth elements and graphite, and 60-70% of lithium and cobalt. The United States and European Union  long-term trading partners with African nations  have also adopted policies to secure access to Africas resources.\n\nThe question is what African countries are doing to take advantage of this demand for these critical minerals, especially to drive their own development.\n\nAs developmentresearcherswe address this question in aspecial publicationon the rising significance of critical minerals in Africa by theIndian Council of World Affairs. In anotherpublication, we look at how emerging resource diplomacy may reinforce Africas position in the global economy as a mere source of raw materials.\n\nWe recommend that African countries determine for themselves how to benefit from this global competition. This includes developing national strategies that emphasise local value addition and benefits. Also, national strategies should begin positioning African countries to gain from their resources beyond value addition.\n\nThe competition for Africas critical minerals underscores the urgency of governance reforms and regional cooperation to transform mineral wealth into sustainable prosperity, avoiding another resource curse.\n\nA Chinese-led New World Order is emerging to counter the US-led Western influence. Eastern and global South countries demonstrate this shift through groupings likeBRICSand South-South cooperation in technology and development. China has strengthened its influence in the global South through initiatives such as theBelt and Road Initiative.\n\nLaunched in 2013, the Belt and Road Initiative is an ambitious infrastructure project that connects continents by land and sea. Since then,over 200 agreementshave been signed with over 150 countries and 30 international organisations. The initiative has expanded Chinas access to resources. This is often in exchange forinfrastructure developmentthat links mining regions to ports.\n\nIn Africa, China has invested heavily in mining and infrastructure. Its firms have spent aboutUS$4.5 billionin lithium projects in Zimbabwe, the DRC, Mali, and Namibia. Chinas strategic focus includes resource-rich countries such as the DRC, Zimbabwe, Zambia, South Africa and Ghana.\n\nChina recentlymarked the 80th anniversaryof the end of World War II with a military parade. The parade projected Chinas military strength withPresident Xi warning that China is unstoppable.\n\nChina is emboldened by its influence and access to critical minerals. This has strengthened its ability to acquire military hardware and other advanced technologies.\n\nAfrica holds about 30% of the worlds critical mineral deposits, making it central to geopolitical contest. The US and EU have sought agreements to secure supplies and reduce reliance on China.\n\nThe EU hasstrategic partnershipson minerals with the DRC, Rwanda, Namibia and Zambia. China hasbilateral agreementswith eleven African countries in the mining sector. The US also has atrilateral agreementwith the DRC and Zambia. Its purpose is to support an integrated value chain for electric vehicle (EV) batteries. It also recently signed a Minerals for Peace deal with the DRC and Rwanda to help end decades of conflict in eastern Congo.\n\nAlthough African countries need support to turn their resources into prosperity, our research found that these partnerships risk reinforcing Africas marginal position in the global value chain. They often reproduce conditions reminiscent of colonialism: dependency, resource extraction, and power imbalances.\n\nOur research argues that the struggle between the US-led and Chinese-led world orders will hinge on a few things. One is control over emerging technologies. These include renewable energy, defence, aerospace, and AI  all of which depend on critical minerals. Expanded access to, and control of, these minerals and their supply chains will be a key determinant of global power.\n\nCompetition between the US and China for critical minerals will intensify. Yet it is crucial that African countries remain neutral. They must engage only in meaningful, mutually beneficial partnerships that genuinely advance their countries and its economies.\n\nAfrican countries must explicitly define their priorities in the extractives sector. Without clear strategies, external powers will continue to dictate Africas future. The continent will be locked into dependency rather than enabling it to capture real value from its mineral wealth.\n\nFinally, rather than just competing for Africas critical minerals, China, the US, and the EU should equitably engage with African countries in the extractives sector to ensure just development across the continent.\n\nLecturer in Sustainability and Fellow of Indo Pacific Research Centre, Murdoch University\n\nAssociate Professor, Development Studies, Murdoch University\n\nPostdoctoral Researcher, Universit di Torino\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/05/24130533/Lithium-Mining.jpeg",
            "description": "<p>By The Conversation Critical minerals such as lithium, cobalt, nickel, copper, rare earth elements, and platinum group metals are essential for modern technologies. They are key to industries ranging from electronics and telecommunications to renewable energy, defence, and aerospace systems. The global demand for these minerals has been growing, as has the competition for them. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/china-and-the-us-are-in-a-race-for-critical-minerals-african-countries-need-to-make-the-rules/\">China and the US are in a race for critical minerals. African countries need to make the rules</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:45",
            "date": "15 Oct 2025"
        },
        {
            "title": "Madagascar military says it has seized power as president moves to ‘safe place’",
            "url": "https://www.newzimbabwe.com/madagascar-military-says-it-has-seized-power-as-president-moves-to-safe-place/",
            "content": "BBC\n\nAn elite military unit says it has seized power in Madagascar from President Andry Rajoelina following weeks of youth-led protests in the Indian Ocean island.\n\nStanding outside the presidential palace on Tuesday, CAPSAT chief Col Michael Randrianirina said the military would form a government and hold elections within two years. He also suspended key democratic institutions, like the electoral commission.\n\nGen Z protesters will be part of the changes because the movement was created in the streets so we have to respect their demands, he added.\n\nTroops and protesters have been celebrating the apparent ousting of President Rajoelina, with thousands waving flags in the capital, Antananarivo.\n\nCAPSAT, or the Personnel Administration and Technical and Administrative Services Corps, is the most powerful military unit in Madagascar.\n\nThe unit supported Rajoelina when he came into power in 2009, but joined the protesters on Saturday.\n\nMadagascars constitutional court has named Col Randrianirina as the countrys new leader, even though a statement from the presidents office said he was still in charge and denounced what it described as an attempted coup detat.\n\nRajoelinas whereabouts are unknown, but he has said he is sheltering in a safe place following an alleged attempt on his life by military personnel and politicians. CAPSAT has denied any involvement in any such move.\n\nThere have been unconfirmed reports that the president was flown out of the country on a French military aircraft.\n\nAlso on Tuesday the US state department urged all sides to pursue a peaceful solution in line with the constitutional order.\n\nCol Randrianirina told the BBC that Madagascar was a country where chaos reigns right now.\n\nChaos because theres no president  hes gone abroad.\n\nThe unrest began just over two weeks ago, after a youth-led movement beganprotesting against chronic water and power cuts across the country.\n\nThe demonstrations soon escalated, to reflect wider dissatisfaction with Rajoelinas government over high unemployment, rampant corruption and the cost-of-living crisis.\n\nProtestors clashed with security forces resulting in the death of at least 22 people and more than 100 others injured, according to the UN, although the Malagasy government has dismissed those figures and described them as based on rumours and misinformation.\n\nPresident Rajoelina, an entrepreneur and former DJ, was once seen as a fresh start for Madagascar.\n\nThe baby-faced leader became president when he was just 34, earning the title of Africas youngest leader, and going on to govern for four years, before returning to power after the 2018 election.\n\nBut he fell out of favour following allegations of cronyism and corruption, which he denied.\n\nDespite the fact that power appears to have shifted away from him, he has continued to try to influence events.\n\nRajoelina attempted to dissolve the national assembly before the opposition could vote to strip him of his presidency for abandonment of post, but that did not work.\n\nLawmakers voted to impeach Rajoelina by 130 votes to one blank ballot on Tuesday. Even members of his party, Irmar, voted overwhelmingly to impeach him.\n\nRajoelina rejected the vote, calling it null and void.\n\nThe African Union (AU) has warned against soldiers meddling in Madagascars political affairs and rejected any attempt at unconstitutional changes of government.\n\nFrench President Emmanuel Macron called the situation greatly worrying.\n\nThe island has gone through a series of political upheavals in recent years.\n\nMadagascar is one of the poorest countries in the world, with 75% of its 30 million people living below the poverty line, according to the World Bank.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/15064752/madagascar-military.webp",
            "description": "<p>BBC An elite military unit says it has seized power in Madagascar from President Andry Rajoelina following weeks of youth-led protests in the Indian Ocean island. Standing outside the presidential palace on Tuesday, CAPSAT chief Col Michael Randrianirina said the military would form a government and hold elections within two years. He also suspended key</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/madagascar-military-says-it-has-seized-power-as-president-moves-to-safe-place/\">Madagascar military says it has seized power as president moves to ‘safe place’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:45",
            "date": "15 Oct 2025"
        },
        {
            "title": "Court dismisses ex-cop’s bid to have Police Commissioner General jailed",
            "url": "https://www.newzimbabwe.com/court-dismisses-ex-cops-bid-to-have-police-commissioner-general-jailed/",
            "content": "By Mary Taruvinga\n\nThe High Court has dismissed a contempt of court application filed by former police officer Tatenda Shiri, who sought to have top police officials, including Commissioner-General Stephen Mutamba, jailed for allegedly defying a reinstatement order.\n\nJustice Fatima Maxwell sitting at the Harare High Court ruled that Shiris application was without merit, finding that the police bosses could not be held in contempt because they lacked the authority to reinstate him, and because the order he relied on was under legal challenge.\n\nFirst and second respondents do not have the authority to reinstate the applicant. They cannot be committed to civil imprisonment for failing to do an act which is beyond their mandates, said the judge.\n\nShiri, who once served under the Zimbabwe Republic Police (ZRP), had been discharged after being convicted of violating the Police Act [Chapter 11:10].\n\nHe appealed his dismissal, arguing he was never given a fair hearing, and later won a default court order reinstating him to the force without loss of salary and benefits.\n\nHowever, despite the court order, the ZRP and the Police Service Commission allegedly failed to act, prompting Shiri to file for contempt, accusing the police leadership of being in wilful and mala fide defiance of a lawful order.\n\nThrough his lawyer Mugiya, Shiri argued that civil contempt is the wilful and mala fide refusal or failure to comply with a court order, insisting that the respondents were deliberately ignoring the judgment.\n\nBut the police, represented by F. Chimunoko from the Attorney Generals Office, opposed the bid, saidthe reinstatement order was a default judgment and had since been challenged through an application for rescission.\n\nIt is ill-advised for the applicant to seek to enforce an order which is being challenged, the police argued, warning that executing the order would impede justice if it is successfully rescinded.\n\nMaxwell agreed, noting that the pending rescission proceedings meant the police could not be said to have acted in bad faith.\n\nThe existence of a court case challenging the very order they are alleged to be in contempt of removes the mala fides. If their application for rescission fails and they still do not comply, then the respondents would indeed be acting wilfully and mala fide, he ruled.\n\nThe judge further said the contempt application was procedurally defective, as Shiri had failed to personally serve the respondents as required by law.\n\nShiri, who was dismissed following disciplinary proceedings within the police force, has been fighting to regain his job since last year.\n\nHis reinstatement order  granted in HCH 1269/24  remains suspended pending the outcome of the rescission applications filed by the ZRP and the Police Service Commission.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/22180446/Stephen-Mutamba.jpg",
            "description": "<p>By Mary Taruvinga The High Court has dismissed a contempt of court application filed by former police officer Tatenda Shiri, who sought to have top police officials, including Commissioner-General Stephen Mutamba, jailed for allegedly defying a reinstatement order. Justice Fatima Maxwell sitting at the Harare High Court ruled that Shiri’s application was “without merit,” finding</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/court-dismisses-ex-cops-bid-to-have-police-commissioner-general-jailed/\">Court dismisses ex-cop’s bid to have Police Commissioner General jailed</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:45",
            "date": "15 Oct 2025"
        },
        {
            "title": "Supreme Court upholds dismissal of ZIMRA officer fired for emailing pornographic content",
            "url": "https://www.newzimbabwe.com/supreme-court-upholds-dismissal-of-zimra-officer-fired-for-emailing-pornographic-content/",
            "content": "By Mary Taruvinga\n\nThe Supreme Court has upheld the dismissal of Zimbabwe Revenue Authority (ZIMRA) officer Stanford Sithole, who was fired for distributing pornographic material through his official work email, ending a legal battle that has dragged on for nearly a decade.\n\nIn a ruling delivered on October 7, 2025, Justice Alphius Chitakunye said the decision underscored the critical importance of maintaining professional standards in the workplace, reaffirming the courts stance on integrity within public institutions.\n\nSithole, stationed in Gweru, was dismissed in 2016 after an internal ZIMRA probe revealed he had sent 13 explicit emails from his work account, a clear breach of the authoritys IT policy, which bans misuse of company assets.\n\nA designated agent initially cleared him, citing insufficient evidence, a decision later upheld by the Labour Court, which noted the possibility of hacking.\n\nBut the Supreme Court overturned that finding, ruling that the burden was on Sithole to prove his account had been compromised.\n\nWhile hacking is difficult, it is not impossible. However, the evidence presented sufficiently pointed to the respondents responsibility for the emails in question, the court said.\n\nZIMRAs IT manager, Mazhindu, testified that investigators used secure forensic tools to trace the emails, explaining the system was difficult to alter or compromise.\n\nSithole had argued he was a victim of a management conspiracy over his involvement in a workers committee. But the judges dismissed that claim, stating, Allegations of bias must be backed by convincing evidence, not mere assertions.\n\nHe also suggested the emails could have been sent by others sharing his workstation. The court rejected that, noting ZIMRAs system required individual credentials for access, which Sithole admitted he had not shared.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/07024130/Supreme-Court.png",
            "description": "<p>By Mary Taruvinga The Supreme Court has upheld the dismissal of Zimbabwe Revenue Authority (ZIMRA) officer Stanford Sithole, who was fired for distributing pornographic material through his official work email, ending a legal battle that has dragged on for nearly a decade. In a ruling delivered on October 7, 2025, Justice Alphius Chitakunye said the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/supreme-court-upholds-dismissal-of-zimra-officer-fired-for-emailing-pornographic-content/\">Supreme Court upholds dismissal of ZIMRA officer fired for emailing pornographic content</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:45",
            "date": "15 Oct 2025"
        },
        {
            "title": "Exiled Jonathan Moyo sucked into plot to scrap 2028 elections, extending Mnangagwa’s rule",
            "url": "https://www.newzimbabwe.com/exiled-jonathan-moyo-sucked-into-plot-to-scrap-2028-elections-extending-mnangagwas-rule/",
            "content": "By Darlington Gatsi\n\nPOLITICAL analyst and former opposition party leader Jealousy Mawarire has accused former cabinet minister Jonathan Moyo of involvement in a plot to scrap the 2028 elections and extend President Emmerson Mnangagwas tenure.\n\nThe alleged plot is detailed in a blueprint document titled Breaking Barriers Initiative, which aims to amend Section 92 of the Constitution.\n\nAccording to Mawarire, the document will be smuggled into Parliament to set in motion plans to extend Mnangagwas rule.\n\nThat document talks about, it is an attempt actually, to legally, so to speak, extend the Presidents term of office by amending Section 92 of the Constitution. Section 92 states that the president is to be elected by all the registered voters in Zimbabwe.\n\nThe repeal of Section 92, which is being pushed by that document, would then result in a situation where the President would be elected only by Parliament. The thinking is that if that constitutional amendment goes through, it has the legal effect of ending the Presidents current term, said Mawarire.\n\nIn the build-up to ZANU PFs National Peoples Conference, which began on Tuesday, attention has been focused on last years Bulawayo resolutions, including the proposal to extend Mnangagwas reign.\n\nThis is despite the Zanu PF leader having publicly denied any ambition to rule beyond 2028, when his mandate expires.\n\nMawarire also claimed that a clique of influential businessmen is pushing for the document to be tabled to prolong corruption through state avenues.\n\nThis is motivated by criminality because the guy has accumulated a lot of wealth, and he knows that, along the way, there are issues to do with human rights violations that he wants to run away from, and this one is a very good cover for him to go for as long as possible.\n\nI am actually thinking this guy is pushing to die in office. If you look at 2035, how old will he be? A lot of people are not happy with how he is running the country, said Mawarire.\n\nIn a post on his social media account recently, Jonathan Moyo dismissed the allegations as baseless.\n\nBut first it would help to unpack the proverb itself, for its origins reveal a deeper truth. Far from literal, it stems from the grim reality of rabies: a suspected animal is often quarantined or euthanised to curb the spread of its disease, making the disease a perfect pretext for destruction. Though sometimes attributed to French or German roots, the proverb is universal, its a cautionary tale against false accusations as cover for harm.\n\nAt its core, the proverb delivers a twofold moral maxim: Beware of false accusations or pretexts for unjust actions. On the dark side, it warns against the toxic tendencies such as the kind of poisoning Zimbabwean politics today.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/03/06225846/Jonathan-Moyo.jpg",
            "description": "<p>By Darlington Gatsi POLITICAL analyst and former opposition party leader Jealousy Mawarire has accused former cabinet minister Jonathan Moyo of involvement in a plot to scrap the 2028 elections and extend President Emmerson Mnangagwa’s tenure. The alleged plot is detailed in a blueprint document titled “Breaking Barriers Initiative,” which aims to amend Section 92 of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/exiled-jonathan-moyo-sucked-into-plot-to-scrap-2028-elections-extending-mnangagwas-rule/\">Exiled Jonathan Moyo sucked into plot to scrap 2028 elections, extending Mnangagwa’s rule </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:45",
            "date": "15 Oct 2025"
        }
    ]
}