{
    "news": [
        {
            "title": "UK police arrest three men on suspicion of spying for Russia",
            "url": "https://www.newzimbabwe.com/uk-police-arrest-three-men-on-suspicion-of-spying-for-russia/",
            "content": "Agencies\n\nPolice in the United Kingdom have arrested three men on suspicion of assisting Russias foreign intelligence service, as tensions between a key ally of Ukraine in the war and Moscow continue to simmer.\n\nThe Metropolitan Police said on Thursday the men  aged 44, 45 and 48  were arrested from west and central London under the 2023 National Security Act on suspicion of assisting a foreign intelligence service.\n\nThey said the country in question isRussia, according to The Associated Press news agency.\n\nThose addresses, along with another, are currently being searched, with counterterrorism police leading the investigation, they said.\n\nBritish authorities allege that Russia is conducting an increasingly boldcampaignof espionage, sabotage and cyber-interference against the United Kingdom.\n\nWere seeing an increasing number of who we would describe as proxies being recruited by foreign intelligence services, and these arrests are directly related to our ongoing efforts to disrupt this type of activity, said Commander Dominic Murphy, head of counterterrorism policing in London.\n\nThe developments came as six men were being sentenced for their part in an arson attack on Ukraine-linked businesses in east London last year. Prosecutors said it had been ordered by the Russian mercenary group Wagner.\n\nThe ringleader, Dylan Earl, was the first person convicted under the National Security Act, which gives prosecutors powers to put spying suspects on trial in a wider set of circumstances.\n\nLast week, the head of the UKs MI5 security service, Ken McCallum, alleged that Russia is committed to causing havoc and destruction.\n\nIn the last year, we and the police have disrupted a steady stream of surveillance plots with hostile intent aimed at individuals [whom] Russian leaders perceive as their enemies, he said.\n\nThe Kremlin has denied accusations that it is involved in any such acts of sabotage, saying the British government repeatedly blames Russia for anything bad that happens in the UK.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/23201037/new-scotland-yard.webp",
            "description": "<p>Agencies Police in the United Kingdom have arrested three men on suspicion of assisting Russia’s foreign intelligence service, as tensions between a key ally of Ukraine in the war and Moscow continue to simmer. The Metropolitan Police said on Thursday the men – aged 44, 45 and 48 – were arrested from west and central</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uk-police-arrest-three-men-on-suspicion-of-spying-for-russia/\">UK police arrest three men on suspicion of spying for Russia</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "24 Oct 2025"
        },
        {
            "title": "Culture as Capital: Fungai Zvirawa’s mission to transform Zimbabwe’s creative sector",
            "url": "https://www.newzimbabwe.com/culture-as-capital-fungai-zvirawas-mission-to-transform-zimbabwes-creative-sector/",
            "content": "By Takudzwa Nyambi, Glamour South Africa\n\nOver the past few years weve witnessed a renaissance on the continent when it comes to African culture and creativity. Fashion houses reference Accra streetwear in Paris runways. Amapiano is the unofficial soundtrack of Berlin clubs. Nollywood stars are headlining Netflix features.\n\nAccording to a 2023 UNESCO report, Africas film and audiovisual sector already employs around five million people and generates $5 billion annually. With proper investment, the broader cultural and creative industries could pull in $20 billion a year and create 20 million jobs. This is soft power and real economic transformation.\n\nAfricas creative future wont be written in isolation. Marcus Garvey once envisioned a global Black network, the diaspora and continent working hand in hand. A century later, that vision is finding its feet in people like Fungai Zvirawa, the Zimbabwean advertising executive who built her chops in London boardrooms only to bring them back to Harare, determined to stitch together a local industry that could stand tall on the global stage.\n\nI was raised in South East London by two fiercely patriotic Zimbabwean parents, she recalls. Like many immigrants, I had my share of go back to your country. But instead of breaking me, those words reminded me that I did have a country. That sense of belonging became her compass. The moment crystallized in 2002 when she watched Robert Mugabe address the UN. Politics aside, his message of sovereignty and youth empowerment struck something deep within me. It was a reminder I had a home, a heritage, and a responsibility.\n\nAfter nearly three decades abroad, Fungai Zvirawa returned, stumbling at first, but eventually planting firm roots. It took me four attempts as a returnee to really break ground, she admits. There have been incredible wins and an equal share of losses, but thats the reality of building in Africa. She shares about keeping it simple, embracing culture, and resisting the urge to impose a foreign mindset.\n\nThat mindset birthed Khaya Defero, her cultural events company, and Rogue & Associates, her boutique ad agency. Khaya Defero has staged RSVP, AGW, The Big Chill, and Zimdaba, experiences designed to elevate the very idea of what Zimbabwean hospitality and show business could look like. When I began curating events in Harare, I realised there was no real separation between the celebrity and fan, no true culture of hospitality that elevated talent. Through these platforms, we changed that.\n\nShes also helped shepherd multi-award-winning talents like Shingai and ShaSha, bridging the tricky gap between diaspora fame and local relevance. Many artists who succeed abroad struggle to reconnect at home. The balance is always authenticity, keeping Zimbabwean creativity intact, while packaging it in ways that resonate globally and locally.\n\nThat same dual vision threads through her leadership roles as President of the Zimbabwe Association of Accredited Practitioners in Advertising (ZAAPA) and CEO of the Zimbabwe Music Awards (ZIMA). For her, the two industries arent as far apart as people assume. Advertising and music are two sides of the same coin. In advertising, we shape narratives that move markets. In music, we shape narratives that move people.\n\nIf that sounds like the voice of a seasoned operator, its because Zvirawa has been navigating and leading in male-dominated spaces for decades. When you show up prepared, deliver, and stay true to your values, respect eventually follows, even if it takes longer than it should.\n\nWhat makes her tick is the idea of rebranding Zimbabwe through creativity. Zimbabwes greatest resource is its people and their creativity. Im in the business of exporting that, our music, our ideas, our artistry. Its a project both ambitious and pragmatic to put Zimbabwean work in front of global audiences, and watch assumptions shift.\n\nIn her next chapter, Zvirawa is betting on technology as a force for transformation. She has invested in Black Mobile, a Pan-African mobile value-added services company with a footprint in Zimbabwe, South Africa, Nigeria, Kenya, Botswana, and Zambia.\n\nFor me, this is about future-proofing Africas creative economy. Our artists, brands, and storytellers need platforms that are homegrown, designed with our realities at the core, yet powerful enough to scale globally. Black Mobile represents that opportunity.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/01055945/WhatsApp-Image-2024-04-30-at-16.24.28-e1714539609546.jpeg",
            "description": "<p>By Takudzwa Nyambi, Glamour South Africa Over the past few years we’ve witnessed a renaissance on the continent when it comes to African culture and creativity. Fashion houses reference Accra streetwear in Paris runways. Amapiano is the unofficial soundtrack of Berlin clubs. Nollywood stars are headlining Netflix features. According to a 2023 UNESCO report, Africa’s</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/culture-as-capital-fungai-zvirawas-mission-to-transform-zimbabwes-creative-sector/\">Culture as Capital: Fungai Zvirawa’s mission to transform Zimbabwe’s creative sector</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "24 Oct 2025"
        },
        {
            "title": "IVF test could misjudge embryo health, study finds",
            "url": "https://www.newzimbabwe.com/ivf-test-could-misjudge-embryo-health-study-finds/",
            "content": "BBC\n\nResearchers have raised concerns about the reliability of a widely used IVF screening method, which checks for chromosomal abnormalities.\n\nScientists at the Loke Centre for Trophoblast Research, University of Cambridge, said the test, used in many fertility clinics for IVF, was likely to overestimate the number of embryos with abnormalities.\n\nThe treatment is often offered to older women or women with a history of miscarriage or failed IVF cycles.\n\nHowever, scientists believed the test could be picking up errors in cells that would form in the placenta, rather than those that had developed in the embryos.\n\nThe test, known as pre-implantation genetic testing for aneuploidy (PGT-A), is designed to screen embryos before implantation.\n\nWhen abnormalities were detected, the embryo may be deemed inviable and discarded, so patients may undergo another cycle of treatment, which can be costly.\n\nButnew researchsuggested that some of the abnormalities detected by the tests may not be relevant to the embryos viability.\n\nLooking to better understand the development of the embryo at its early stage, Cambridge researchers and the Francis Crick Institute developed a new, state-of-the-art method to watch embryos live in high resolution.\n\nIt used fluorescent tagging to track cell division in 3D.\n\nAbnormalities arise at a relatively late stage of the embryos development and appear in the outer layer of the blastocyst.\n\nThe blastocyst develops into the placenta, and it is from this layer that biopsies were taken for pre-genetic testing.\n\nFirst author Dr Ahmed Abdelbaki, a postdoctoral researcher at the Loke Centre, said it was the first time the imaging technique had been used, and it allowed them to see what was happening.\n\nIt meant that we could watch the embryos as they developed over a two-day period, the longest continuous time that this process has been observed.\n\nCo-author Professor Ben Steventon from the Department of Genetics at the University of Cambridge said: Its proof of the power of direct observation to uncover unexpected findings in human biology.\n\nThe embryos in the study were donated by families who had successful pregnancies.\n\nProfessor Kathy Niakan, director of the Loke Centre and chair of Cambridge Reproduction, said her team was now studying cells in the inner cell layer, which forms the fetus.\n\nMuch more basic research is needed to inform future clinical practice and improve rates of assisted conception, she added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/13080322/baby-feet.jpg",
            "description": "<p>BBC Researchers have raised concerns about the reliability of a widely used IVF screening method, which checks for chromosomal abnormalities. Scientists at the Loke Centre for Trophoblast Research, University of Cambridge, said the test, used in many fertility clinics for IVF, was likely to overestimate the number of embryos with abnormalities. The treatment is often</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ivf-test-could-misjudge-embryo-health-study-finds/\">IVF test could misjudge embryo health, study finds</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "24 Oct 2025"
        },
        {
            "title": "Essex care worker jailed for sex offences at hospital",
            "url": "https://www.newzimbabwe.com/essex-care-worker-jailed-for-sex-offences-at-hospital/",
            "content": "Echo News\n\nA healthcare assistant has been jailed for engaging in sexual activity with a vulnerable patient while working at a secure mental health unit.\n\nNelson Ncube, 57, of Gratian Close, Highwoods, Colchester, appeared at Ipswich Crown Court for sentencing on Tuesday after admitting two counts of engaging in sexual activity with a person with a mental disorder while being a care worker.\n\nThe offences took place between late 2020 and early 2023 at a mental health hospital in Colchester, where Ncube was employed as a healthcare assistant.\n\nThe victim was detained under the Mental Health Act and described as acutely unwell during the period of abuse.\n\nThe court heard that Ncube was assigned to long shifts, sometimes lasting up to 12 hours, and responsible for observing the woman, whose room was adjacent to the nurses station and under camera surveillance.\n\nHowever, there were blind spots in areas such as a storage area and patient toilets.\n\nNcube took the patient to these locations, where the offending occurred.\n\nProsecutor details revealed that the behaviour began with unexpected physical contact before escalating to overtly sexual acts.\n\nThe court heard that Ncube requested and exchanged explicit photographs with the woman.\n\nIn a victim impact statement, the woman described the deep psychological impact of Ncubes abuse while she was sectioned and under his care.\n\nHow dare you, she told the defendant from the witness box as he kept his eyes to the ground in the dock.\n\nThe victim added: Very often you were part of the team restraining me. It must have been very clear to you I was intensely unwell.\n\nShe added: I felt ashamed, unclean and embarrassed.\n\nBut with my improved strength and sense of self worth a feeling of clarity arrived  it was not my fault or responsibility, it was wholly yours.\n\nJudge Richard Kelly told Ncube he had shown a warped sense of responsibility by suggesting the victim initiated the conduct.\n\nNcube, previously of good character, was sentenced to four years and nine months imprisonment.\n\nHe expressed remorse through his barrister, who said he felt nothing but shame and guilt for his actions.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/23200301/nelson-ncube.jpg",
            "description": "<p>Echo News A healthcare assistant has been jailed for engaging in sexual activity with a vulnerable patient while working at a secure mental health unit. Nelson Ncube, 57, of Gratian Close, Highwoods, Colchester, appeared at Ipswich Crown Court for sentencing on Tuesday after admitting two counts of engaging in sexual activity with a person with</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/essex-care-worker-jailed-for-sex-offences-at-hospital/\">Essex care worker jailed for sex offences at hospital</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "24 Oct 2025"
        }
    ]
}