{
    "news": [
        {
            "title": "Zimbabwe’s miners spending a paltry US$11 million on exploration",
            "url": "https://www.newzimbabwe.com/zimbabwes-miners-spending-a-paltry-us11-million-on-exploration/",
            "content": "By Alois Vinga\n\nA mineral asset valuation expert has raised alarm over Zimbabwes mining sectors paltry US$11 millionannual spend on exploration, warning that the country risks missing out on vast untapped mineral value unless both government and industry invest more.\n\nMining exploration is the systematic process of locating economically viable mineral deposits through geological, geophysical and geochemical methods. It is the first and most critical stage of mining, involving mapping, surveys and exploratory drilling to identify potential ore bodies before mining decisions are made.\n\nSpeaking toNewZimbabwe.comon the sidelines of the inaugural Zimbabwe Gold Investment Conference on Monday, Ernst & Young Associate Partner Dr Godknows Njowasaid Zimbabwes exploration spending remains far too low.\n\nErnst & Young Associate Partner Dr Godknows Njowa\n\nIn terms of exploration, Zimbabwe spends only 0.2% of annual global exploration expenditure, and within Africa, we contribute just 2%. Yet Africas total share is around 9%, he said.\n\nSo this shows that in Zimbabwe, we are not spending enough money on exploration. During my presentation, I gave the example of Canada, which is the highest spender in the world at about 20% of the annual global exploration budget.\n\nNjowa warned that Zimbabwe continues to lose opportunities, saying the country has the potential to double its current gold outputif it adequately explores and develops new deposits.\n\nFor decision makers,both government and private sector,more money must be allocated to exploration. Gold mining companies globally are making super profits because prices are at levels not seen in the past 30 or 40 years.\n\nSo some of that money should be reinvested into exploration. You need to spend between US$50 and US$80 per ounceof what you produce on exploration, he added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/07/06173942/mine.webp",
            "description": "<p>By Alois Vinga A mineral asset valuation expert has raised alarm over Zimbabwe’s mining sector’s paltry US$11 million annual spend on exploration, warning that the country risks missing out on vast untapped mineral value unless both government and industry invest more. Mining exploration is the systematic process of locating economically viable mineral deposits through geological, geophysical</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-miners-spending-a-paltry-us11-million-on-exploration/\">Zimbabwe’s miners spending a paltry US$11 million on exploration</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:46",
            "date": "18 Nov 2025"
        },
        {
            "title": "In Canadian documentary ‘Mbira Talks’, a Zimbabwean musical instrument connects two worlds",
            "url": "https://www.newzimbabwe.com/in-canadian-documentary-mbira-talks-a-zimbabwean-musical-instrument-connects-two-worlds/",
            "content": "The Globe and Mail\n\nThe documentaryMbira Talks, about a Zimbabwean-Canadian musicians relationship with an instrument once banned during colonisation, took a long time to make. We know this because Moyo Rainos Mutamba is shown plucking his mbira on a Toronto street, with the glittering Honest Eds department store in the background.\n\nThe lights went out in that building in 2016, and it was torn down a year later. Director Adrienne Amato originally planned to make a film about Stella Chiweshe, the pioneering rebel queen of the instrument, often referred to as a thumb piano because of the metal tines affixed to a wooden board that are struck by the first digits of the human hand.\n\nLogistics sabotaged the film on Chiweshe, who died in 2023 at age 76. Amato, who is white and was born in Zimbabwe when it was still under British rule as Rhodesia, immigrated to Toronto in 1977. After Chiweshes death, she shifted her focus to Mutamba. Still, the documentary, which premieres online and at the South African Film Festival in Toronto on Monday, took years to make, mostly because of money.\n\nIts very specific what gets funding these days, said the filmmaker, who joined Mutamba on a video call. Unless you have a celebrity in your doc or its a whodunnit crime thing, its a difficult landscape for making documentaries these days.\n\nAmato did not have a celebrity in her film, but she and Mutamba did have one on their side. Canadian indie-pop star Leslie Feist donated her frequent-flier miles for the trip to Africa by Amato, Mutamba and cinematographer Tess Girard. She also helped pay for the digging of a well at the Ubuntu Learning Village, the educational and community hub Mutamba co-founded in rural Zimbabwe.\n\nMutamba came to Canada more than 20 years ago to study economics at Trent University in Peterborough, Ont. The self-described village human finds Toronto too loud and crowded. In 2007, longing for a connection with his homeland, he took up the mbira, a ceremonial instrument tied to traditions of the Shona culture.\n\nThe late Chiweshe called the mbira a telephone to the spirits of people, water, trees and birds. Deeming it subversive, Rhodesias white authorities and Christian missionaries banned the instrument. The mbira is part of Mutambas educational mission involving food sovereignty, arts and cultural reclamation.\n\nIm intrigued by the power of community, he said. People are searching for it. Were all searching for village.\n\nFormer Toronto landmark Honest Eds can be seen across the street from Mutamba in a still from the documentary.Supplied\n\nMutamba is both a facilitator and a searcher himself. He longs for home, but Toronto is where he earns a living as co-director of Bloom Consulting, specializing in strategic planning, conflict mediation and psychotherapy. Canadas wealthy biggest city is his hunting place, where money is made to be used in Zimbabwe.\n\nThe mbira is more popular in Western Canada than in its eastern counterpart  Vancouver Island is the hotbed. Though the instrument is foreign to Canada, Mutamba believes its effect is universal.\n\nIt provokes certain emotions, he said. It is in the body. Its beyond the otherness. It is a sound that is human.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/18051030/rainos-mutamba-mbira-canada.jpg",
            "description": "<p>The Globe and Mail The documentary Mbira Talks, about a Zimbabwean-Canadian musician’s relationship with an instrument once banned during colonisation, took a long time to make. We know this because Moyo Rainos Mutamba is shown plucking his mbira on a Toronto street, with the glittering Honest Ed’s department store in the background. The lights went</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-canadian-documentary-mbira-talks-a-zimbabwean-musical-instrument-connects-two-worlds/\">In Canadian documentary ‘Mbira Talks’, a Zimbabwean musical instrument connects two worlds</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:46",
            "date": "18 Nov 2025"
        },
        {
            "title": "ZimbosAbantu’s solar-powered mobile clinics deliver healthcare to villages in rural Zimbabwe",
            "url": "https://www.newzimbabwe.com/zimbosabantus-solar-powered-mobile-clinics-deliver-healthcare-to-villages-in-rural-zimbabwe/",
            "content": "Hackster\n\nRemoteness from care is a major challenge to health services worldwide. Half of the worlds population resides in rural areas, but only 36% of the global nursing workforce lives there. This means infant mortality, maternal death, and poor health outcomes are much prevalent in rural areas than in urban locations.\n\nTelehealth (healthcare delivery via electronic means) has helped in overcoming some barriers, but it requires internet access. One in three people globally will still live in a rural area by 2050, and there is a critical need for healthcare access solutions that are built to work in rural areas.\n\nIn rural Zimbabwe, a person who is sick might walk 15 to 20 kilometres to reach a clinic.ZimbosAbantu a social enterprise in Harare, Zimbabwes capital has a fleet of mobile clinics that offer medical services to vulnerable populations in the rural and peri-urban areas of the city. Its goal is to reduce the distance that women, youth, and children walk to access primary healthcare from 15km to 3km.\n\nZimbosAbantu roughly translates to Zimbabwean people. It operates five mobile clinics, offering services like dental care, maternal health, immunisation, eye care, and nutrition education.\n\nEach mobile clinic has a wind turbine and solar panels generating enough power for a 190-litre vaccine freezer. They are equipped with examination rooms, vital monitoring machines, diagnostic kits, and medications. They operate 12 hours a day and are staffed full-time by health professionals. Each clinic serves an average of 18-20 patients per day, or about 1000 patients per month.\n\nThe social enterprise was founded by Chiedza and Tawanda Mushawedu in 2021. Chiedza serves as the organizations executive director and previously worked for a private hospital. While working there, she saw people suffering from undiagnosed chronic conditions and dying from treatable conditions, simply because care was out of reach.\n\nZimbosAbantu offers a subsidised healthcare scheme to solve affordability disparities. Men, women, and youth are organized in groups of 10 or 20, and each member pays about $3 every month for access to healthcare, drugs, and other benefits. About 1,000 people are currently enrolled in the scheme.\n\nRemoteness from care is a wide-scale problem that needs a similarly-sized solution. ZimbosAbantu has recently added more vehicles to its fleet and expanded its operations to a second province. In a conversation with Africa Business Radio, Chiedza admits that there is still a large gap to be addressed, and ZimbosAbantu is a drop in the ocean. She emphasizes the need for investors and partners to help expand the organizations reach and impact.\n\nZiplineis another company working to improve medical access in Africa, but with autonomous drones.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/18050427/zimbosabantu.jpg",
            "description": "<p>Hackster Remoteness from care is a major challenge to health services worldwide. Half of the world’s population resides in rural areas, but only 36% of the global nursing workforce lives there. This means infant mortality, maternal death, and poor health outcomes are much prevalent in rural areas than in urban locations. Telehealth (healthcare delivery via</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbosabantus-solar-powered-mobile-clinics-deliver-healthcare-to-villages-in-rural-zimbabwe/\">ZimbosAbantu’s solar-powered mobile clinics deliver healthcare to villages in rural Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:46",
            "date": "18 Nov 2025"
        },
        {
            "title": "Brendan Galloway injury update as Plymouth Argyle defender set to get all clear",
            "url": "https://www.newzimbabwe.com/brendan-galloway-injury-update-as-plymouth-argyle-defender-set-to-get-all-clear/",
            "content": "Plymouth Live\n\nPlymouth Argyle defender Brendan Galloway is expected to be available for the important League One away game against Port Vale on Saturday despite not being involved for Zimbabwe in a friendly international against Qatar on Monday.\n\nThe 27-year-old suffered a minor facial injury playing for his country in a 3-1 defeat by Algeria in another friendly international last Thursday, which was played in Saudi Arabia.\n\nGalloway started the match at the Prince Abdullah Al-Faisal Stadium in Jeddah but was substituted in the 84th minute as he made his seventh appearance for Zimbabwe.\n\nGalloway will be assessed by Argyles medical department on his return to Home Park from international duty later this week.\n\nThe friendly internationals against Algeria and Qatar, under newly-appointed head coach Mario Marinica, are Zimbabwes final games before they compete at the 2025 Africa Cup of Nations in Morocco at the end of December.\n\nZimbabwe have been drawn in Group B and will play games against Egypt on December 22, South Africa on December 26 and Angola on December 29.\n\nWith Galloway expected to be included in the Warriors squad for the tournament, he is likely to miss a few matches for Argyle over the Christmas and New Year period.\n\nArgyle are bottom of League One and did not have a game at the weekend because of international call-ups, including that of Galloway, while Port Vale moved up one position to 22nd after a 0-0 draw at home to Wycombe Wanderers.\n\nPilgrims boss Tom Cleverley was among the crowd at Vale Park as he took the opportunity to get a first-hand glimpse of Darren Moores Valiants.\n\nIt was a result which moved the Staffordshire side a point clear of the Pilgrims, but they have now played one more match than them.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/18042712/Brendan-Galloway.png",
            "description": "<p>Plymouth Live Plymouth Argyle defender Brendan Galloway is expected to be available for the important League One away game against Port Vale on Saturday despite not being involved for Zimbabwe in a friendly international against Qatar on Monday. The 27-year-old suffered a minor facial injury playing for his country in a 3-1 defeat by Algeria</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/brendan-galloway-injury-update-as-plymouth-argyle-defender-set-to-get-all-clear/\">Brendan Galloway injury update as Plymouth Argyle defender set to get all clear</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:46",
            "date": "18 Nov 2025"
        },
        {
            "title": "Tagwirei bankrolled Zanu PF’s 2013 campaign, reveals former Minister Shamu – says controversial tycoon ‘not new’ to the ruling party",
            "url": "https://www.newzimbabwe.com/tagwirei-bankrolled-zanu-pfs-2013-campaign-reveals-former-minister-shamu-says-controversial-tycoon-not-new-to-the-ruling-party/",
            "content": "By Leopold Munhende\n\nFormer Zanu PF political commissar Webster Shamu has revealed that businessman Kudakwashe Tagwirei played a major role in the ruling partys 2013 election victory by financing its campaign.\n\nShamu, famed for his vaMugabe iCremora praise-singing, made the remarks at a Provincial Coordinating Committee (PCC) meeting in Chinhoyi over the weekend.\n\nHe said Tagwirei, who was recently co-opted into Zanu PFs influential Central Committee, quietly provided key resources that helped secure the partys win.\n\nFormer Minister Webster Shamu\n\nI did not get to know Tagwirei today; many of us have known him for years.\n\nFor the first time in public, I will tell you that Tagwirei financed our 2013 election campaign. He gave us resources, ensured we had fuel, and provided everything we needed.\n\nWe did not say this in newspapers because he is a quiet, disciplined, and humble leader, said Shamu.\n\nZanu PF went on to claim 61.88% of the presidential vote in 2013 and secured 196 of the 270 contested parliamentary seats.\n\nTagwirei has recently taken an increasingly visible role in the ruling partys affairs and is widely viewed as a potential successor to President Emmerson Mnangagwa in 2028 or 2030, depending on whether Mnangagwas second-term extension push succeeds.\n\nHis main rival remains Vice President Constantino Chiwenga, whose presidential ambitions have long been known.\n\nWhile Chiwenga has kept a low profile, Tagwirei has been a prominent guest at party events, reportedly donating more than US$500,000.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/15160729/tagwirei.jpeg",
            "description": "<p>By Leopold Munhende Former Zanu PF political commissar Webster Shamu has revealed that businessman Kudakwashe Tagwirei played a major role in the ruling party’s 2013 election victory by financing its campaign. Shamu, famed for his “vaMugabe iCremora” praise-singing, made the remarks at a Provincial Coordinating Committee (PCC) meeting in Chinhoyi over the weekend. He said</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tagwirei-bankrolled-zanu-pfs-2013-campaign-reveals-former-minister-shamu-says-controversial-tycoon-not-new-to-the-ruling-party/\">Tagwirei bankrolled Zanu PF’s 2013 campaign, reveals former Minister Shamu – says controversial tycoon ‘not new’ to the ruling party</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:46",
            "date": "18 Nov 2025"
        },
        {
            "title": "Over 2,500 people affected by political violence in October, Zanu PF the leading perpetrator – report",
            "url": "https://www.newzimbabwe.com/over-2500-people-affected-by-political-violence-in-october-zanu-pf-the-leading-perpetrator-report/",
            "content": "By Thandiwe Garusa\n\nAt least 2,531 people were affected by political violence in October across the country, according to the latest report by the human rights watchdog Zimbabwe Peace Project (ZPP).\n\nZPP listed the ruling Zanu PF as the leading perpetrator of human rights violations, followed by local authorities, the police, and traditional leaders.\n\nThe organisation recorded 116 incidents, which included threats of violence, restrictions on freedoms of assembly and expression, denial of access to social services, politically motivated assaults, displacement, unfair distribution of food aid, and arbitrary arrests.\n\nAcross the country, 116 violations affected 2,531 individuals, including persons with disabilities, highlighting the vulnerability of marginalised groups. Citizens were subjected to forced displacements, politically motivated assaults, hate-driven attacks, and threats of violence, while fundamental rights to freedom of assembly, association, and expression were routinely curtailed, reads the report.\n\nOf those affected, 1,360 were women and 1,171 were men, including 109 persons with disabilities.\n\nThe watchdog urged authorities to strengthen human rights protections, ensure transparent delivery of public services, and establish safe reporting mechanisms that protect victims from retaliation.\n\nThe actions of ruling party supporters, local authorities, police, and traditional leaders illustrate how political power is often leveraged to intimidate, coerce, and control communities, eroding public trust and reinforcing inequalities.\n\nZimbabwe must urgently improve protections for civic and political rights, ensure fair and transparent delivery of public services, and create strong, safe systems for reporting abuses. These steps are needed to protect victims from retaliation and to make sure human rights are genuinely respected, not just promised in law.\n\nZanu PF has repeatedly been cited this year as the main perpetrator of human rights violations in Zimbabwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/04031733/Political-Violence.png",
            "description": "<p>By Thandiwe Garusa At least 2,531 people were affected by political violence in October across the country, according to the latest report by the human rights watchdog Zimbabwe Peace Project (ZPP). ZPP listed the ruling Zanu PF as the leading perpetrator of human rights violations, followed by local authorities, the police, and traditional leaders. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/over-2500-people-affected-by-political-violence-in-october-zanu-pf-the-leading-perpetrator-report/\">Over 2,500 people affected by political violence in October, Zanu PF the leading perpetrator – report</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:46",
            "date": "18 Nov 2025"
        },
        {
            "title": "Cash-strapped Zimbabweans cut back on cigarettes – BAT",
            "url": "https://www.newzimbabwe.com/cash-strapped-zimbabweans-cut-back-on-cigarettes-bat/",
            "content": "By Alois Vinga\n\nBritish American Tobacco (BAT) Zimbabwe says cigarette consumption has dropped by 7%, a decline it attributes to reduced disposable incomes owing to macroeconomic challenges.\n\nWhile the exact annual number of cigarettes smoked in Zimbabwe is not publicly available, market forecasts suggest national consumption could reach 531.4 million sticks by 2030.\n\nIn its trading update for the nine months ended September 30, 2025, BAT chairperson Lovemore Manatsa said tightening consumer spending was beginning to weigh on volumes.\n\nBAT chairperson Lovemore Manatsa\n\nSales volumes declined by 7% to 593 million sticks, and consequently cigarette revenue fell 22% to US$21 million compared to the same period last year. This was due to stretched consumer spending, a challenging macroeconomic environment, and a shift in pricing strategy from ZWG to US dollars, said Manatsa.\n\nDespite the volume and revenue drops, profitability recovered significantly. Profit before tax rose to US$11 million, a turnaround from a US$3 million loss recorded during the same period last year,a 491% year-on-year growth. The improvement was largely driven by reduced foreign-exchange losses and lower inflationary impacts.\n\nOperating costs also fell sharply to US$10 million, a 66% decline from the prior year, reflecting lower forex losses, easing inflation pressures, and the implementation of cost-management initiatives.\n\nThe company noted that enhanced distribution efficiency, closer engagements with traders, and performance-focused trade programmes helped support volume delivery. BAT described the external environment as dynamic but relatively stable, bolstered by steady inflation and a more stable exchange rate driven by ongoing monetary policy interventions.\n\nHowever, Manatsa warned that challenges persist, including liquidity constraints, high borrowing costs, and frequent power outages that continue to disrupt industrial productivity.\n\nLooking ahead, the Company remains focused on reinforcing the strength and sustainability of the business by driving volume recovery through increased focus on the value segment, improving product availability across all markets and channels, and enhancing operational efficiency by optimising supply-chain processes and reducing our cost to serve in order to protect profitability, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/18040956/smoking.jpg",
            "description": "<p>By Alois Vinga British American Tobacco (BAT) Zimbabwe says cigarette consumption has dropped by 7%, a decline it attributes to reduced disposable incomes owing to macroeconomic challenges. While the exact annual number of cigarettes smoked in Zimbabwe is not publicly available, market forecasts suggest national consumption could reach 531.4 million sticks by 2030. In its</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cash-strapped-zimbabweans-cut-back-on-cigarettes-bat/\">Cash-strapped Zimbabweans cut back on cigarettes – BAT</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:46",
            "date": "18 Nov 2025"
        }
    ]
}