{
    "news": [
        {
            "title": "Malcolm-Jamal Warner, The Cosby Show star, dies aged 54",
            "url": "https://www.newzimbabwe.com/malcolm-jamal-warner-the-cosby-show-star-dies-aged-54/",
            "content": "BBC\n\nMalcolm-Jamal Warner, an actor best known for his role as Theo Huxtable on The Cosby Show, has died.\n\nWarner, who was 54, drowned at the weekend while on holiday in Costa Rica, local authorities said.\n\nWarner appears to have been dragged out to sea by a swift ocean current while swimming at Playa Grande around 14:00 (20:00 GMT) local time on Sunday in Cocles, a town in the province of Limn, Costa Ricas Judicial Investigation Agency said.\n\nWarner played the son of Bill Cosby on the hugely popular US sitcom from 1984-1992. Tributes swiftly poured in from celebrities, including Questlove, Jennifer Hudson, Taraji P Henson, Jennifer Love Hewitt and Magic Johnson.\n\nAuthorities said bystanders rescued Warner and brought him to shore, where the Costa Rican Red Cross tried to treat him, but he was declared dead at the scene.\n\nHe is survived by his wife and daughter.\n\nWarner was Emmy-nominated in the Outstanding Supporting Actor in a comedy series for his work on The Cosby Show in 1986.\n\nHe was handpicked for his breakout role by Cosby on the final day of a nationwide audition.\n\nI was literally the last person they saw, he recalled in a 2023 interview.\n\nThe Cosby Show ranked as the number one TV show for five seasons from 1985-90. It portrayed a cosy middle-class family  a relatively rare depiction at the time of black Americans on television.\n\nWhen the show first came out, there were white people and black people talking about [how] the Huxtables dont really exist, black people dont really live like that, Warner said in a 2013 interview.\n\nMeanwhile, we were getting tens of thousands of fan letters from people saying, Thank you so much for this show.'\n\nAfter The Cosby Show, Warner appeared in several other television programmes including Malcom & Eddie, alongside comedian Eddie Griffin.\n\nGriffin paid respects to him on social media after his death, writing R.I.P. King and My big little brother.\n\nWarner had guest appearances on The Fresh Prince of Bel-Air and Sesame Street. More recently, he played AJ Austin, a cardio-thoracic surgeon on the medical drama series The Resident.\n\nWarner also won a Grammy for Best Traditional R&B Performance in 2015, alongside Robert Glasper and Lalah Hathaway for their cover of Stevie Wonders song Jesus Children of America.\n\nHis spoken word album Hiding In Plain View garnered him another Grammy nomination in 2023.\n\nLast year, he started a podcast  Not All Hood  which discussed mental health in the black community.\n\nFormer co-stars and fans has been posting their tributes to him online.\n\nBasketball star Magic Johnson, who appeared in an AIDS awareness video directed by Warner, wrote that he and his wife were both super fans of the hit Cosby Show and continued to follow his career over the years.\n\nEvery time I ran into Malcolm, we would have deep and fun conversations about basketball, life, and business. He will truly be missed, Johnson wrote.\n\nActress Jennifer Love Hewitt called him a gentleman and an incredible talent.\n\nActress Vivica A Fox posted that she was stunned and saddened by his sudden death, writing: Thanks for ya gifts, king.\n\nTracee Ellis Ross, who starred with Warner on Reed Between the Lines, also mourned him, writing: My heart is so so sad.\n\nWhat an actor and friend you were: warm, gentle, present, kind, thoughtful, deep, funny, elegant. You made the world a brighter place.\n\nSending so much love to your family. Im so sorry for this unimaginable loss.\n\nActress Taraji P Henson posted: Malcolm, we grew up with you. Thank you for the art, the wisdom, the grace you gave us!!!!!\n\nYou left the world better than you found it. Rest easy, king!!!! Your legacy lives far beyond the screen.\n\nActress Niecy Nash posted that she had recently spoken to Warner.\n\nWe talked about how happy we both were in our marriages. Damn friend. You were cornerstone of The Cosby Show.\n\nWe all loved Theo! Never to be forgotten. You will be missed. Rest Easy.\n\nGeorgia Senator Raphael Warnock also praised Warner, writing in a post: For me and so many in my generation, Malcolm-Jamal Warner was a part of our childhood, a brother whose character Theo felt like one of my own.\n\nMay God grant peace to his soul, strength and grace to his grieving family.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/22081900/malcolm-jamal.jpg",
            "description": "<p>BBC Malcolm-Jamal Warner, an actor best known for his role as Theo Huxtable on The Cosby Show, has died. Warner, who was 54, drowned at the weekend while on holiday in Costa Rica, local authorities said. Warner appears to have been dragged out to sea by a swift ocean current while swimming at Playa Grande</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/malcolm-jamal-warner-the-cosby-show-star-dies-aged-54/\">Malcolm-Jamal Warner, The Cosby Show star, dies aged 54</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:39",
            "date": "22 Jul 2025"
        },
        {
            "title": "Zimbabwe’s export of minerals used in battery production surges 30%",
            "url": "https://www.newzimbabwe.com/zimbabwes-export-of-minerals-used-in-battery-production-surges-30/",
            "content": "Reuters\n\nPrices of lithium  used in batteries to power renewable energy technologies  have tumbled nearly 90% over the past two years, mainly due to oversupply, but producers remain positive about the metals long-term prospects amid a global push towards cleaner energy sources and electric vehicles.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/05/24130533/Lithium-Mining.jpeg",
            "description": "<p>Reuters  Zimbabwe’s exports of spodumene concentrate, a lithium-bearing mineral essential for battery production, surged 30% in the first half of 2025 despite weak global lithium prices, official statistics show. Africa’s top lithium producer exported 586,197 metric tons of spodumene concentrate between January and June, compared to 451,824 metric tons during the same period last year,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-export-of-minerals-used-in-battery-production-surges-30/\">Zimbabwe’s export of minerals used in battery production surges 30%</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:39",
            "date": "22 Jul 2025"
        },
        {
            "title": "We will survive relegation – Chaminuka backs Dynamos’ flops",
            "url": "https://www.newzimbabwe.com/we-will-survive-relegation-chaminuka-backs-dynamos-flops/",
            "content": "By Darlington Gatsi\n\nDYNAMOS coach Saul Chaminuka has chosen to put on a brave face as the fallen Harare giants continue to sink deeper into crisis.\n\nMediocrity continues to reign at Dynamos after they failed to secure a win at Wadzanayi Stadium, falling 1-0 to defending Castle Lager Premier Soccer League (PSL) champions Simba Bhora.\n\nThe defeat marked their ninth loss of the season, having managed just two wins in 20 matches, laying bare the troubles at the once dominant force of Zimbabwean football.\n\nConsequently, this paints a grim picture for Dynamos, with the reality of relegation becoming increasingly evident.\n\nChaminuka, who has won just once since taking over in May, remains confident his side will avoid the drop.\n\nThere are still plenty of games to play. If you look at the teams, we are not very far away. Maybe five or six teams are in the 25 [points], what we need is to win twice on the trot and we are out of the relegation zone, said Chaminuka.\n\nDynamos are currently eight points from safety, having amassed only 15 points, with their abandoned match against FC Platinum yet to be resolved.\n\nThe beleaguered giants situation is further compounded by a poor transfer system, which has seen the club fail to reinforce the squad with quality players.\n\nSuch are the low standards at Dynamos that past their prime players, Denver Mukamba and Ocean Mushure, who last played professional football a combined 19 months ago, are now training with the team.\n\nSo dire is the situation that defender Shadreck Nyahwa is the clubs top scorer this season with just two goals, prompting the administration to trial unknown players from Ghana in a desperate bid to salvage their campaign.\n\nChaminuka, however, insists his flops can turn things around.\n\nWe are capable of winning the matches. If games are handled well, we will win games. We are going to win games and we are going to survive, said Chaminuka.\n\nDynamos next challenge is against another struggling side, Manica Diamonds, on Wednesday at Rufaro Stadium, where they have claimed both of their victories this season.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/11073111/Saul-Chaminuka.webp",
            "description": "<p>By Darlington Gatsi DYNAMOS coach Saul Chaminuka has chosen to put on a brave face as the fallen Harare giants continue to sink deeper into crisis. Mediocrity continues to reign at Dynamos after they failed to secure a win at Wadzanayi Stadium, falling 1-0 to defending Castle Lager Premier Soccer League (PSL) champions Simba Bhora.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/we-will-survive-relegation-chaminuka-backs-dynamos-flops/\">We will survive relegation – Chaminuka backs Dynamos’ flops </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:39",
            "date": "22 Jul 2025"
        },
        {
            "title": "Zimbabwe names squad for Test series against New Zealand",
            "url": "https://www.newzimbabwe.com/zimbabwe-names-squad-for-test-series-against-new-zealand/",
            "content": "By Sports Reporter\n\nZimbabwe Cricket has announced a 16-man squad for the upcoming two-match Test series against New Zealand, scheduled to be played at Queens Sports Club in Bulawayo.\n\nThe first Test will take place from 30 July to the 3rd of August, with the second match following from 7th to 11th of the same month.\n\nThe Chevrons have made four changes to the squad that played two Test matches against South Africa early this month.\n\nBen Curran, Sikandar Raza, Roy Kaia and Tanunurwa Makoni will be replacing the quartet of Takudzwanashe Kaitano, Prince Masvaure, Wessly Madhevere and Kundai Matigimu.\n\nZimbabwe will be led by Craig Ervine as captain, with experienced campaigners Sean Williams and Blessing Muzarabani providing key support in the batting and bowling departments, respectively.\n\nThe upcoming series will mark the first Test meeting between Zimbabwe and New Zealand since July-August 2016, when the visitors claimed a 2-0 series win at the same venue in Bulawayo.\n\nZIMBABWE SQUAD FOR TEST SERIES\n\nCraig Ervine (Captain), Brian Bennett, Tanaka Chivanga, Ben Curran, Trevor Gwandu, Roy Kaia, Tanunurwa Makoni, Clive Madande, Vincent Masekesa, Wellington Masakadza, Blessing Muzarabani, Newman Nyamhuri, Sikandar Raza, Tafadzwa Tsiga, Nicholas Welch, Sean Williams.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/01/12030952/Craig-Ervine.png",
            "description": "<p>By Sports Reporter Zimbabwe Cricket has announced a 16-man squad for the upcoming two-match Test series against New Zealand, scheduled to be played at Queens Sports Club in Bulawayo. The first Test will take place from 30 July to the 3rd of August, with the second match following from 7th to 11th  of the same</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-names-squad-for-test-series-against-new-zealand/\">Zimbabwe names squad for Test series against New Zealand</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:39",
            "date": "22 Jul 2025"
        },
        {
            "title": "Uganda green lights military trials for civilians despite court ruling",
            "url": "https://www.newzimbabwe.com/uganda-green-lights-military-trials-for-civilians-despite-court-ruling/",
            "content": "By Nakisanze Segawa and Apophia Agiresaasi, GPJ Uganda\n\nThis story was originally published byGlobal Press Journal\n\nIn January, Eron Kiiza, a human rights lawyer, represented opposition leader and four-time presidential candidate Kizza Besigye in military court. Soldiers blocked his entry and directed him to sit in a different section. Kiiza refused. They forcibly removed him, and minutes later, he was arrested and placed next to Besigye  as a defendant, facing charges of treason. He was convicted of contempt of court and sentenced to nine months in prison.\n\nThere was no trial, says Kiiza, who is out of prison on bail.\n\nThe same month, Ugandas Supreme Court ruled thattrying civilians in military court  a practice on the rise in recent years  is unconstitutional. There are anywhere from a few hundred civilians, according to government numbers, to a few thousand civilians, according to lawyers, who are currently in military custody.\n\nPresident Yoweri Museveni said on social media that the January ruling is wrong, adding that trying civilians in the military court was a way to protect Ugandans from what he called criminals armed with guns.\n\nIn June, Ugandas Parliament passed a law allowing the practice, a move critics are calling an act of revenge after the January ruling. They worry the law will stifle political opposition and stoke fear ahead of the January 2026 general elections.\n\nColonel Chris Magezi, acting spokesperson for the Uganda Peoples Defence Forces, said on television in May that the judiciary is overwhelmed, so trying some cases that threaten national security in military courts is essential. He pointed to a 2023 disarmament in Karamoja, where armed residents were attacking neighbors and conducting raids across the border with Kenya.\n\nTheres an urgent security problem to deal with in Karamoja that should hold, he said. In civil courts, when they are released, they go back to the community and commit crimes again.\n\nThe lawallows the court-martial of civilians in cases of suspected treason, as well as cattle rustling, murder, aggravated robbery and more. But critics say the law opens the door to widespread civilian arrests.\n\nNkunyingi Muwada, a member of Parliament for Kyadondo East, says the bill is Musevenis attempt to dismantle the court system and create a new system within the military courts to remand opposition politicians and activists.\n\nIts obvious that this bill is in preparation of 2026 election, Muwada says, adding that Museveni wants the political realm to remain a one-man show.Sarah Bireete, executive director for Centre for Constitutional Governance, a regional constitutional watchdog, says the bills hurried passage didnt allow for public participation.\n\nThe clerk to Parliament sent an advert one day before the bill was tabled, she says. We were required to analyze the bill and file in a matter of hours. We submitted memorandum hoping to be invited to the committee. We were never invited.\n\nOpposition supporters from the 2021 general electionshave been in court since then.\n\nThe regime wants this same court in place for the same purpose, Bireete says.\n\nCivilians are concerned that the law makes them vulnerable. Namukasa Khadija, a Wakiso resident, says shes debating whether to participate in the upcoming elections.\n\nI saw the arrest, the brutality against opposition supporters, especially Bobi Wine supporters, by the armed forces in the last 2021 elections, she says. I saw the brutality against journalists in the recent Kawempe North election, and I dont know if I am ready to attend any political rally in the 2026 elections because I dont think it will be safe.\n\nOthers, though, are confident the law will promote national security.\n\nAnthony Akol, a member of Parliament for Kilak North, says the bill will protect Ugandans from armed robberies and those who use military attire to commit crimes.\n\nThe law is good, he says, but the problem is that citizens of Uganda dont trust this government.\n\nHe, like Magezi, points to Karamoja.\n\nSome who have guns and use them to rob people and others put on army uniform and try to steal from people, he says. I have no problem if such a person is arrested.\n\nKiiza, the human rights lawyer, says the bills main purpose is to deny Ugandans involvement in what should be a fair, democratic election.\n\nPolitical activists and opposition supporters will be arrested and remanded to prison without trial, he says. This only happened because the military started to engage in politics.\n\nNakisanze Segawais a Reporter-in-Residence based in Kampala, Uganda. She specializes in reporting on LGBTQ+ issues. Born in Luweero and raised in Ugandas capital, she holds a degree in Mass Communications from Muteesa I Royal University. Known for her powerful photography and deep community access, her 2015 story about school policies that forced Black girls to keep their hair shortwhile girls of other races could grow theirs longprovoked widespread social media outcry and led to a policy change.\n\nApophia Agiresaasiis a Reporter-in-Residence based in Kampala, Uganda. She has been covering human rights and global health stories for over a decade. In 2020, she was part of the team honored with the Media Hero of the Year Award by the Stevie Awards for their coverage of the COVID-19 pandemic. Apophia holds a bachelors degree in Literature and a masters degree in Population and Reproductive Health from Makerere University.\n\nNakisanze Segawa, GPJ,translatedsome interviews from Luganda.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/21124711/GPJNews_Uganda_CivilLiberties_NS_AA_CourtMartial_Illustration-1.png",
            "description": "<p>By Nakisanze Segawa and Apophia Agiresaasi, GPJ Uganda This story was originally published by Global Press Journal In January, Eron Kiiza, a human rights lawyer, represented opposition leader and four-time presidential candidate Kizza Besigye in military court. Soldiers blocked his entry and directed him to sit in a different section. Kiiza refused. They forcibly removed</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uganda-green-lights-military-trials-for-civilians-despite-court-ruling/\">Uganda green lights military trials for civilians despite court ruling</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:39",
            "date": "22 Jul 2025"
        },
        {
            "title": "Magistrate sues hubby’s mistress for adultery",
            "url": "https://www.newzimbabwe.com/magistrate-sues-hubbys-mistress-for-adultery/",
            "content": "By Staff Reporter\n\nA magistrate, Sandra Mupindu is suing her husbands mistress, Catherine Tatenda Chitopota, accusing her of snatching him.\n\nMupindu has filed a summons with the High Court claiming damages for loss of contumelia and consortium.\n\nHowever, the alleged mistress tried to evade the lawsuit after showing no intention to stop the affair.\n\nChitopota hassired three kids with the magistrates husband Simon Mupindu who she now lives with.\n\nChitopotaexcepted to the allegations pleading that the matter is prescribed.\n\nShe excepted to the declarationtelling court that Mupindu condoned the adultery and was compensated under the customary law.\n\nChitopota also said Simon was supposed to be joined to the proceedings.\n\nShe argued that Mupindu became aware of her relationship with Simon in 2014 therefore her course of action crystallised then.\n\nShe told court that Mupindu demanded customary compensation, which was received by both her relatives and herself.\n\nMupindu hit back, arguing that defense does not apply to a continuing wrong.\n\nMupindu also disputed that there was no jointer, adding that she does not need the non-joined party to prove adultery.\n\nIn deciding the case, High Court Judge Fatima Maxwell said a claim for damages prescribe depending on the circumstances.\n\nIn my view, adultery damages, the cause of action is complete when sexual intercourse takes place.\n\nIn casu, that act is said to have taken place in 2024.\n\nHowever, plaintiff stated that it was not a one-off incident. Sexual liaison continued even after the summons were issued, and plaintiff position which was not disputed, was that the acts were happening even when the matter is being prosecuted.\n\nAccording to her, defendant seems not to have an intention of ceasing such sexual liaison, the court noted.\n\nThe judge said it, therefore follows that the portions of the claim which relate to adultery that occurred more than three years prior to the commencement of the action are whittled away.\n\nHowever, as it was not disputed that the acts of sexual intercourse are continuing, the defense of prescription cannot succeed.\n\nMaxwell ruled, No cause or matter shall be defeated by reason of the misjoinder or non-joinder of any party and the court may in any cause or matter determine the issues or questions in dispute so far as they affect the rights and interests of the persons who are parties to the cause or matter.\n\nThe Plaintiffs claim therefore, cannot be dismissed because of non-joinder.\n\nIn any event, the Plaintiff stated that she does not need the non-joined party to prove her case.\n\nThe exceptions raised are not dispositive of the matter. The special plea has not succeeded. The matter must therefore proceed.\n\nIn her declaration, Mupindu stated that the defendant intruded into the marriage institution between herself and her husband sometime in 2014 and proceeded to engage in a sexual relationship with her husband.\n\nMupindu claimed was despite Chitopotas knowledge of the romantic and peaceful marriage relationship existing between the plaintiff and her husband.\n\nShe further stated that three children were born to Chitopota, having been sired by her husband.\n\nFurther that Chitopota has contributed to causing her husband to move out of the matrimonial home to stay with her.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/13181521/high-court-of-zimbabwe-3.jpg",
            "description": "<p>By Staff Reporter A magistrate, Sandra Mupindu is suing her husband’s mistress, Catherine Tatenda Chitopota, accusing her of snatching him. Mupindu has filed a summons with the High Court claiming damages for loss of contumelia and consortium. However, the alleged mistress tried to evade the lawsuit after showing no intention to stop the affair. Chitopota</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/magistrate-sues-hubbys-mistress-for-adultery/\">Magistrate sues hubby’s mistress for adultery</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:39",
            "date": "22 Jul 2025"
        },
        {
            "title": "Zimbabwe faces resurgence of malaria amid U.S. aid cuts, experts warn of funding shortfall",
            "url": "https://www.newzimbabwe.com/zimbabwe-faces-resurgence-of-malaria-amid-u-s-aid-cuts-experts-warn-of-funding-shortfall/",
            "content": "DNE Africa\n\nZimbabwe is grappling with a sharp resurgence of malaria following a significant drop in international aid, particularly after the withdrawal of U.S. funding. Health experts have raised the alarm, citing a dramatic increase in infections and fatalities across the country in 2025, with fears that ongoing national response efforts could be severely undermined.\n\nAccording to the Ministry of Health, the number of malaria infections surged by 180% in the first four months of 2025, while related deaths jumped by 218% compared to the same period last year. Over 119,000 cases were reported between January and June, with at least 143 fatalities, up from 45 during the same period in 2024.\n\nHealth officials reported the emergence of 115 malaria outbreak hotspots this yearan alarming contrast to just one outbreak recorded in all of 2024.\n\nImpact of U.S. Funding Withdrawal\n\nThe resurgence coincides with the suspension of key U.S. financial assistance under a policy shift initiated by former President Donald Trump, who earlier this year halted funding for several global health programmes, including malaria and HIV/AIDS initiatives.\n\nExperts say the funding cut has disrupted critical scientific research, interrupted mosquito control programmes, and delayed national malaria prevention campaigns. The absence of U.S. support is also affecting basic prevention tools such as insecticide-treated mosquito nets and essential medicines.\n\nIts a serious setback, said Itai Rusike, director of the Community Working Group on Health at Zimbabwes Ministry of Health. The country had made tremendous progress over the past two decades, but all of that is now at risk.\n\nRusike warned that without adequate supplies of mosquito nets and preventive drugs, especially for pregnant women and young children, the number of infections and fatalities will likely continue to climb. Lives will be lost. When diagnostic kits and frontline treatments are unavailable, the system collapses, he added.\n\nShortage of Nets and Medical Supplies\n\nIn May, the Ministry of Health launched a campaign to distribute over 1.6 million insecticide-treated mosquito nets. However, officials acknowledged a shortfall of at least 600,000 nets due to the funding freeze. This gap is particularly concerning given that bed nets remain one of the most cost-effective tools in malaria prevention.\n\nChildren under the age of 15 account for a significant proportion of the affected population, representing nearly 14% of all reported cases, according to government data.\n\nRoad to 2030: Struggling to Stay on Track\n\nZimbabwe is among several African Union member states committed to eliminating malaria by 2030. The countrys national strategy includes increasing public awareness, widespread distribution of treated mosquito nets, indoor spraying, and enhancing surveillance systems.\n\nHowever, health officials admit the funding shortfall has disrupted the roadmap toward malaria eradication. Former Health Minister Dr. Henry Madzorera stressed the need for mobilising domestic resources, saying Zimbabwe must rely less on external donors.\n\nWe need to increase health sector allocations, use existing tax revenues more efficiently, and prioritise domestic financing to safeguard our health goals, he said.\n\nDeputy Health Minister Sleiman Kudini also acknowledged the funding gap, adding that the government is making efforts to procure essential supplies. Weve started the process of purchasing critical items and remain committed to the 2030 malaria elimination target, Kudini said.\n\nDespite government assurances, experts caution that unless sustainable funding mechanisms are secured quickly, the country risks reversing years of progress in malaria control.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/04/23184924/Malaria-mosquito.jpg",
            "description": "<p>DNE Africa Zimbabwe is grappling with a sharp resurgence of malaria following a significant drop in international aid, particularly after the withdrawal of U.S. funding. Health experts have raised the alarm, citing a dramatic increase in infections and fatalities across the country in 2025, with fears that ongoing national response efforts could be severely undermined.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-faces-resurgence-of-malaria-amid-u-s-aid-cuts-experts-warn-of-funding-shortfall/\">Zimbabwe faces resurgence of malaria amid U.S. aid cuts, experts warn of funding shortfall</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:39",
            "date": "22 Jul 2025"
        },
        {
            "title": "FlySafair strike: Top alternative airlines for South African travellers facing flight cancellations",
            "url": "https://www.newzimbabwe.com/flysafair-strike-top-alternative-airlines-for-south-african-travellers-facing-flight-cancellations/",
            "content": "IOL\n\nOn Monday morning, FlySafair was forced to cancel at least 26 flights after receiving last-minute notices from pilots that they would not report for duty.\n\nThe company said the disruption is regrettable but largely out of its control. This is pilots are planning a stay-away for up to two weeks.\n\nWhat we are experiencing is industrial action on the part of our pilots. Unfortunately, our hands are tied, said Kirby Gordon, Chief Marketing Officer at FlySafair, speaking from OR Tambo International Airport. We are issuing refunds and rebooking where we can, but negotiations remain tense.\n\nThe airline claims pilots already earn between R1.8 million and R2.3 million per year, placing them within the top 1% of earners in the country.\n\nIt is believed that FlySafair pilots down tools due to a pay dispute, sparking widespread flight cancellations and renewed debate around pilot remuneration.\n\nThis begs the question: What other airlines can South Africans use?\n\nLift Airlines was launched in December 2020,making it thecountrys youngest low-cost carrier. The company is based in Cape Town and operates primarily across Johannesburg, Cape Town and Durban on Airbus A320s.\n\nIt has earned multiple awards and is known for flexibility (zero change/cancellation fees), generous baggage policies, pet-friendly service and free onboard snacks and premium coffee.\n\nThe countrys flag carrier, South African Airways, relaunched in 2021 under the Takatso Consortium, with majority private ownership but government retaining strategic influence via a golden share.\n\nSince its relaunch, it has restored several intercontinental routes. It was ranked 4th best airline in Africa in 2025 and earned praise as the cleanest airline on the continent. SAA recorded its first profit since 2011 recently and is actively seeking listing on the Johannesburg Stock Exchange to attract fresh capital.\n\nA privately owned regional airline founded in 1992, Airlink operates about 70 Embraer aircraft (including new E195E2s arriving through 2027) and serves networks across 4555 destinations in up to 15 subSaharan countries.It partners with major global carriers.\n\nQatar Airways holds a 25% equity stake and two board seats to deepen codeshare and network integration.The airline is noted for punctual service, strong regional connectivity, and operational efficiency.\n\nCemAir, founded in 2005 and headquartered at OR Tambo Airport in Kempton Park, operates a fleet of around 26 smaller aircraft, serving both domestic routes (to cities such as Cape Town, Durban, Bloemfontein, Kimberley) and charter or interline destinations in neighbouring countries like Mozambique, Botswana, Zimbabwe and South Sudan.\n\nIt has had past regulatory challenges but resumed full operations after legal interventions in 2019.Passenger feedback is mixed, as some report reliability and comfort, while others describe last-minute cancellations without adequate rebooking support.\n\nBritish Airways, operating domestic South African routes through its regional unit, offers a higher-end travel experience for domestic passengers. It focuses on premium service quality and reliability for inter-city travel on routes like Johannesburg to Cape Town and Durban. While not ranked among the top domestic airlines in Skytrax awards, it maintains a strong reputation among business and premium leisure travellers for comfort and in-flight amenities.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/08/05202240/flysa.png",
            "description": "<p>IOL On Monday morning, FlySafair was forced to cancel at least 26 flights after receiving last-minute notices from pilots that they would not report for duty. The company said the disruption is regrettable but largely out of its control. This is pilots are planning a stay-away for up to two weeks. “What we are experiencing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/flysafair-strike-top-alternative-airlines-for-south-african-travellers-facing-flight-cancellations/\">FlySafair strike: Top alternative airlines for South African travellers facing flight cancellations</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:39",
            "date": "22 Jul 2025"
        },
        {
            "title": "Charcoal brazier smoke kills five family members in their sleep",
            "url": "https://www.newzimbabwe.com/charcoal-brazier-smoke-kills-five-family-members-in-their-sleep/",
            "content": "By Staff Reporter\n\nFive family members from Gudhuza Village in Zvishavane are suspected to have died after inhaling smoke from a charcoal brazier in their sleep.\n\nAccording to the Zimbabwe Republic Police the family slept with a charcoal brazier burning in their bedroom.\n\nPolice spokesperson Paul Nyathi announced the unfortunate incident, stating that bodies have been taken for postmortem.\n\nThe ZRP confirms a tragic incident in which five family members died at Gudhuza Village, Zvishavane after they had brought a charcoal brazier into their bedroom to warm themselves overnight on 20/07/25.\n\nThe bodies were taken to Zvishavane District Hospital Mortuary for post mortem, Nyathi said.\n\nThe victims were identified by their next of kin as Jeremiah Simango (42), John Ncube (57), Nigel Ncube, Denzel Simango (15) and Joedire Simango (8).\n\nWithout proper ventilation, carbon monoxide can quickly build up to dangerous levels.\n\nInhaling this toxic gas can lead to unconsciousness or death in severe cases.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/21205805/mbaura.png",
            "description": "<p>By Staff Reporter Five family members from Gudhuza Village in Zvishavane are suspected to have died after inhaling smoke from a charcoal brazier in their sleep. According to the Zimbabwe Republic Police the family slept with a charcoal brazier burning in their bedroom. Police spokesperson Paul Nyathi announced the unfortunate incident, stating that bodies have</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/charcoal-brazier-smoke-kills-five-family-members-in-their-sleep/\">Charcoal brazier smoke kills five family members in their sleep</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:39",
            "date": "22 Jul 2025"
        },
        {
            "title": "South African president removes minister criticised by key coalition partner",
            "url": "https://www.newzimbabwe.com/south-african-president-removes-minister-criticised-by-key-coalition-partner/",
            "content": "South African President Cyril Ramaphosa has removed the higher education minister from her position, his office said on Monday, after his partys key coalition partner accused her of misconduct.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/08/06202604/Cyril-Ramaphosa-e1597328711901.jpg",
            "description": "<p>Reuters South African President Cyril Ramaphosa has removed the higher education minister from her position, his office said on Monday, after his party’s key coalition partner accused her of misconduct. The removal of Nobuhle Nkabane from her post could help defuse tensions between Ramaphosa’s African National Congress (ANC) and the Democratic Alliance (DA), the two</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-african-president-removes-minister-criticised-by-key-coalition-partner/\">South African president removes minister criticised by key coalition partner</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:39",
            "date": "22 Jul 2025"
        }
    ]
}