{
    "news": [
        {
            "title": "State media houses to digitalise for enhanced output, audience reach— Information minister",
            "url": "https://www.newzimbabwe.com/state-media-houses-to-digitalise-for-enhanced-output-audience-reach-information-minister/",
            "content": "By Anna Chibamu\n\nINFORMATION, Publicity and Broadcasting Services Minister, Jenfan Muswere has called for a complete overhaul of the State media inorder to improve its operations in the digital age.\n\nAddressing journalists at a Cabinet media engagement cafe this Monday at Munhumutapa offices, Muswere expressed concern over the continued decrease of copy circulation at government-controlled media institutions, reiterating the need to digitalise operations.\n\nHe said it was important to adapt to new ways of publishing and incorporate digital tools as a means to catch up with other media companies elsewhere.\n\nOn that note, Muswere highlighted that this year, his ministry will hold media training sessions in digital media incorporating AI and data analytics for media practitioners to be able to report effectively.\n\nAccording to Muswere, the number of printed copy has gone down by a huge margin compared to some years back owing to many reasons, amongst them the coming of new and digital media, respectively.\n\nThe ministers call comes at the backdrop of a number of challenges facing newsrooms, where most are at the brink of collapse due to economic hardships, hence the importance of navigating new ways of survival.\n\nWe have had quite a number of meetings with some of the executives and editors on how best we can deal with the challenges related to the low circulation per day in terms of the print media.\n\nWe are all aware that we used to print more than 200,000, and to less than 10,000 daily circulations, all print media houses combined on average, that we now need to implement digital transformation strategies.\n\nI can highlight that Zimpapers is undergoing the total transformation of the institution, focusing primarily on digital transformation, behavioural transformation of management, board, and staff, a cultural transformation, and at the same time ensuring that the institution is totally restructured to align with online media platform operations.\n\nDue to the new technology and new media, online platforms have been the favorite among Zimbabweans who now shun hard copies for online platforms.\n\nThe minister emphasised the importance of digital sovereignty to find best ways to work together with all media houses in order to ensure whatever diversity that is there, everyone should always defend Zimbabwe.\n\nThere are some of the programmes that we have put in place, starting with the ZimDigital project, which seeks to ensure that we achieve 100% media sovereignty in our country, and the ZimDigital project received funding in the last quarter of 2024, and we believe that we can catapult television coverage from 38% to 100% within a space of two years.\n\nWe can also accelerate digital transformation in terms of the ZimDigital for radio from 62% to 100% within the next two years. So, all modalities have been put in place with a steering committee that I chair to ensure that we can accelerate the ZimDigital project, said Muswere.\n\nHe expects the project will be completed within the first quarter of 2025.\n\nWe are pretty sure that before April, we will be in a position to invite the President to officially launch the ZimDigital project.\n\nThe same applies with the media and communication policy, which will now go through other government processes for refinement and approval. The same also applies with regards to the tax holidays that we have offered to the media fraternity in order to support the growth and robustness of the sector.\n\nHe said among other strategies, the ministry adopted the heritage-based broadcasting, because our language, culture, values as a people define.who we are, and we have 16 official languages, which also includes Kalanga, Chindawu, and many other local languages.\n\nSo, the primary focus is for us to be able to participate even on the digital highway, even on digital platforms, as you collect, as you gather news and content across the country, let us also support our languages as the modernisation of Montrose Studios is taking place, and this will become the center of heritage-based broadcasting.\n\nWe want broadcasters, media practitioners, to be able to contribute to the digital world in our own local languages, so that each and every Zimbabwean is not left behind. The ZBC restructuring is also taking place,\n\nMuswere said there are no enemies anymore and media houses should find each other and work towards putting Zimbabwe first regardless of differences.\n\nZimbabwe comes first, that it is the responsibility of each and every Zimbabwean, and for the media fraternity, let us always ensure that we protect, advance, and defend the interests and rights of Zimbabwe, that whatever differences.\n\nSaid the minister: I am also happy to indicate that the members of the Fourth Estate have responded appropriately in order to support nation building. We all know that genocide, wars, instabilities in other countries, its the social media, its members of the Fourth Estate.\n\nIm happy to announce that weve had a number of sessions together with the Zimbabwe Media Commission (ZMC), which commission, in terms of the ZMC Act amendments, we are strengthening the legislation in order to manage the conduct of journalism as a profession.\n\nWe need to protect members of the Fourth Estate, because what we want is diversity, what we want is pluralism, what we want is to ensure that with all those different views, we remain united to defend the media sovereignty of our country, Muswere said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/16100957/Dr-Jenfan-Muswere.png",
            "description": "<p>By Anna Chibamu INFORMATION, Publicity and Broadcasting Services Minister, Jenfan Muswere has called for a complete overhaul of the State media inorder to improve its operations in the digital age. Addressing journalists at a Cabinet media engagement cafe this Monday at Munhumutapa offices, Muswere expressed concern over the continued decrease of copy circulation at government-controlled</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/state-media-houses-to-digitalise-for-enhanced-output-audience-reach-information-minister/\">State media houses to digitalise for enhanced output, audience reach— Information minister</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "08 Jan 2025"
        },
        {
            "title": "Zimbabwe ranked among Top 10 African countries with high crime rate",
            "url": "https://www.newzimbabwe.com/zimbabwe-ranked-among-top-10-african-countries-with-high-crime-rate/",
            "content": "By Staff Reporter\n\nPOVERTY in Zimbabwe is fuelling criminal activities that have seen the Southern African nation ranked among the Top 10 countries with a high crime rating.\n\nAccording to Numbeo Crime Index, Zimbabwe is ranked seventh on the continent comparing lowly to crime-riddled South Africa, which came tops.\n\nThe Rainbow nation is Africas most crime-affected country, with a crime index score of 74.7, placing it 5th on the globe while Zimbabwe is ranked 25th globally.\n\nThe survey says inequalities and high unemployment are among the leading causes of crime globally, and Africa is no exception. Poverty, unemployment, and lack of access to education create conditions where individuals resort to illegal activities for survival.\n\nThe prevalence and types of crimes vary widely across African countries. It was also noted that crime is a universal issue, reflective of societal disparities and struggles, but its manifestations vary across regions.\n\nIn urban centres, particularly in informal settlements, these challenges are acute. Many African cities are grappling with rapid urbanisation, leaving governments struggling to provide adequate housing, sanitation, and security services. This neglect fosters environments where petty theft, burglary, and violent crime thrive, noted Numbero Crime Index.\n\nSouth Africa, the most dangerous country to be on the continent and fifth globally, faces pervasive violent crimes such as homicides, robberies, and assaults, exacerbated by unemployment and inadequate law enforcement. Despite efforts to curb crime, such as community policing initiatives and social programmes, many South Africans report feeling unsafe.\n\nNigeria ranked 11th globally with a crime index score of 66.6, confronts widespread security issues, including organised crime, armed robberies, and kidnappings.\n\nAngola follows closely, ranked 13th globally with a score of 66.3, where both violent and property crimes remain prevalent, particularly in urban areas.\n\nBelow are the top 10 African countries with the highest crime index at the start of 2025, according to Numbero Crime Index.\n\n1. South Africa 74.7 (5th globally)\n\n2. Nigeria 66.6 (11th)\n\n3. Angola 66.3 (13th)\n\n4. Cameroon 65.5 (14th)\n\n5. Somalia 63.9 (17th)\n\n6. Namibia 63.5 (19th)\n\n7. Zimbabwe 60.7 (25th)\n\n8. Mozambique 60.1 (28th)\n\n9. Ivory Coast 56.4 (35th)\n\n10. Libya 56.4 (36th)\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/10/18162129/Police-helmet.jpg",
            "description": "<p>By Staff Reporter  POVERTY in Zimbabwe is fuelling criminal activities that have seen the Southern African nation ranked among the Top 10 countries with a high crime rating. According to Numbeo Crime Index, Zimbabwe is ranked seventh on the continent comparing lowly to crime-riddled South Africa, which came tops. On the African continent, Nigeria, Angola,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-ranked-among-top-10-african-countries-with-high-crime-rate/\">Zimbabwe ranked among Top 10 African countries with high crime rate</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "08 Jan 2025"
        },
        {
            "title": "Aspiring homeowners urged to desist from buying residential stands from land barons",
            "url": "https://www.newzimbabwe.com/aspiring-homeowners-urged-to-desist-from-buying-residential-stands-from-land-barons/",
            "content": "By Anna Chibamu\n\nAS government is in the process of regularising informal settlements in most urban areas countrywide, a call has been made to citizens to desist from buying residential stands from land barons.\n\nWith the housing waiting list in urban Harare said to be over two million, government says people should not continue to buy stands from criminals posing as council officials or those working with officials.\n\nThousands have lost millions of dollars to suspected or known land barons, especially in Harare as they seek to own properties.\n\nAddressing journalists in Harare, Local Government Minister, Daniel Garwe said members of the public must not buy land from unscrupulous elements.\n\nHe highlighted the need to regularise all the informal settlements across the country.\n\nIf we are to speak of an upper middle income economy status by 2030, we need to make conscious decisions, not only the central government, but all Zimbabweans to ensure that we regularise. How do we start it? It starts with you and me.\n\nPlease stop buying land from land barons. That is the first call on regularisation.\n\nWe now have structures put in place to ensure that you can come to the Minister of Local Government, you can go to any local authority and be able to get information of the availability of a stand in the area of choice if they are there. So, stop buying land from criminals. Thats the first step of regularisation, Garwe said.\n\nFor already existing informal settlements such as Caledonia and Harare South, a budget is now in place to ensure that government engages developers to do servicing and put water, sewer and roads infrastructure.\n\nWe want residents to participate. How do they participate? If they are desirous of having a title deed, they pay for the land first.\n\nGarwe reiterated land belongs to the State and the public should be made aware that land barons were stealing government property and parceling it out to unsuspecting homeseekers.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/04/24044211/Housing-development.jpg",
            "description": "<p>By Anna Chibamu AS government is in the process of regularising informal settlements in most urban areas countrywide, a call has been made to citizens to desist from buying residential stands from land barons. With the housing waiting list in urban Harare said to be over two million, government says people should not continue to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/aspiring-homeowners-urged-to-desist-from-buying-residential-stands-from-land-barons/\">Aspiring homeowners urged to desist from buying residential stands from land barons</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "08 Jan 2025"
        },
        {
            "title": "Gweru water rationing eases as supply improves from 35 to 62 megalitres per day",
            "url": "https://www.newzimbabwe.com/gweru-water-rationing-eases-as-supply-improves-from-35-to-62-megalitres-per-day/",
            "content": "By Tapiwa Svondo\n\nPARTS of the Midlands provinces city of Gweru that once endured water rationing, sometimes going days without a drop, have seen improved water supply owing to increasing levels at various dams.\n\nCurrently pumping capacity is at 62 megalitres per day up from 35 megalitres, according to Gweru Mayor, Martin Chivoko.\n\nThe mayor announced the latest development while presenting the citys 2024 achievements.\n\nIn the statement, Chivoko said the upgrade was made possible through the procurement of low-lift pumps for the Amapongokwe Dam, which has boosted the raw water production for the Gwenoro Water Treatment Plant.\n\nOne of the most notable achievements of the City of Gweru in 2024 was the improvement in its water supply.\n\nThe procurement of low-lift pumps for Amapongokwe Dam enabled the city to increase its raw water production for the Gwenoro Water Treatment Plant.\n\nAs a result, the city was able to increase its treated water pumping capacity from 35 megalitres to 62 megalitres.\n\nThis significant increase in water supply has eased water rationing, with some areas now receiving water for 5 to 6 days a week.\n\nThe improvement in the citys water supply has had a positive impact on the lives of its residents, said the premier.\n\nFurthermore, the City of Gweru is pushing its 2025 plans to increase the water supply system to high-lying areas that do not receive water.\n\nAs we look to 2025, the City of Gweru has outlined several exciting plans.\n\nOne of the citys top priorities is to increase the pumping capacity of Whitewaters Dam. This will enable the city to supply water to high-lying areas such as Ridgemont, Northgate, Hertfordshire, Harben Park, and Athlone.\n\nThe city has budgeted for this project and is expected to commence work soon, he said.\n\nIn an interview with NewZimbabwe.com, Chivoko confirmed that the water that is being supplied to its residents is treated using several chemicals and it is safe for human consumption.\n\nYes, our water is treated. We use standard water treatment chemicals, including chlorine and alum, to ensure the water is safe for consumption.\n\nOur treatment process involves coagulation, sedimentation, filtration, and disinfection. We treat the water from our dams regularly, following strict safety protocols, the mayor explained.\n\nWith a more reliable water supply, residents are now able to access clean water for drinking, cooking, and other domestic uses.\n\nThis has improved the overall health and well-being of the citys residents, particularly children and the elderly, who are most vulnerable to water-borne diseases.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/20024409/Water-Tape.jpeg",
            "description": "<p>By Tapiwa Svondo  PARTS of the Midlands province’s city of Gweru that once endured water rationing, sometimes going days without a drop, have seen improved water supply owing to increasing levels at various dams. Currently pumping capacity is at 62 megalitres per day up from 35 megalitres, according to Gweru Mayor, Martin Chivoko. The mayor</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/gweru-water-rationing-eases-as-supply-improves-from-35-to-62-megalitres-per-day/\">Gweru water rationing eases as supply improves from 35 to 62 megalitres per day</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "08 Jan 2025"
        },
        {
            "title": "Prophet Walter Magaya launches ‘miracle’ card he claims heals and exorcises evil spirits",
            "url": "https://www.newzimbabwe.com/prophet-walter-magaya-launches-miracle-card-he-claims-heals-and-exorcises-evil-spirits/",
            "content": "By Staff Reporter\n\nPROPHETIC Healing and Deliverance (PHD) leader, Prophet Walter Magaya has launched a card he claims has power to heal and deliver congregants and other users.\n\nMagaya, who once claimed to carry Zimbabwes problems and prayers in two black satchels for delivery in Israel, said those who will respect and sacrifice to get the card will greatly benefit from it.\n\nIn Israel he took images while carrying the satchels, while in the river Jordan where Jesus Christ was baptised and then shared more of him stuffing letters written by his congregants through a hole on a wall he claimed was closer to where God lived.\n\nA controversial religious figure, Magaya runs one of the biggest charismatic churches in Zimbabwe, with his followers stretching across the continent and beyond.\n\nI can safely say to you the cards are officially launched. They are for you, for your use, said Magaya in a video shared on his social media platforms.\n\nThe card will be sold for an unspecified amount.\n\nIt is anointing that you respect that will work for you, he goes on.\n\nRespect is found in sacrifice, if one comes all the way from Bulawayo to attend a service to get a card, that sacrifice I tell you will get the anointing to work.\n\nIf one meditates and takes their time, it will work.\n\nIf one takes out money and says this is my seed towards this anointing that anointing will work because you will honour it, you will respect where your money is.\n\nMagaya once launched lipstick which he claimed would increase certain particulars in the bodies of those that would use it.\n\nHe claimed it would work for those with low blood-sugar levels.\n\nIn 2019, he bit more than he could chew however and was fined US$700 when he claimed to have found the cure for HIV and AIDS.\n\nAGUMA, a plant based drug he presented as the cure, was dismissed by government and got him arrested. He was forced to apologise to Zimbabweans.\n\nSpeaking on the same video, Magaya said the cards he launched were already on their way to South Africa, Botswana and other western countries on order.\n\nAs we speak right now some of the cards are in an aeroplane to Australia, Cape Town, Johannesburg, Durban, Botswana because on Sunday when I make a massive prayer you shall hold your card and pray with me, said Magaya.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/10/31230010/Magaya.jpg",
            "description": "<p>By Staff Reporter PROPHETIC Healing and Deliverance (PHD) leader, Prophet Walter Magaya has launched a card he claims has power to heal and deliver congregants and other users. Magaya, who once claimed to carry ‘Zimbabwe’s problems and prayers’ in two black satchels for delivery in Israel, said those who will respect and sacrifice to get</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/prophet-walter-magaya-launches-miracle-card-he-claims-heals-and-exorcises-evil-spirits/\">Prophet Walter Magaya launches ‘miracle’ card he claims heals and exorcises evil spirits </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "08 Jan 2025"
        },
        {
            "title": "Zimbabwe’s ZiG currency set for more volatility, says business grouping",
            "url": "https://www.newzimbabwe.com/zimbabwes-zig-currency-set-for-more-volatility-says-business-grouping/",
            "content": "By Bloomberg\n\nZIMBABWEAN companies should brace for further exchange rate volatility this year following a shock devaluation of the nations bullion-backed currency in September, a local commerce group said.\n\nThe ZiG, short for Zimbabwe Gold and the nations sixth attempt at a stable currency since 2009, fell 43% against the dollar on 27 September last year to narrow the gap between the official and parallel-market rates.\n\nThe move hit consumers disposable incomes, fanned inflation and crimped businesses profits.\n\nFor OK Zimbabwe Ltd it necessitated a reevaluation of working capital and risk-management strategies, the nations largest retailer told an analyst briefing in late December.\n\nThe exchange-rate volatility hasnt completely gone away, said the Zimbabwe National Chamber of Commerces chief executive officer, Christopher Mugaga.\n\nAfter the devaluation, balance sheets have been eroded, and most executives are worried. To plan using the local currency is to plan to fail.\n\nShelton Sibanda, chief investment officer at Imara Asset Management, which oversees $100 million, expects companies to reduce their ZiG holdings to protect themselves.\n\nThe velocity, that is speed of using ZiG will increase, he said in an interview by phone from the capital, Harare.\n\nNo one will want to keep any ZiG.\n\nPower shortages\n\nOther factors that are expected to impact companies profits this year include power shortages that last as long as 18-hours a day, and their fight with informal traders for US dollar revenues amid strict local-currency pricing controls imposed by authorities, Mugaga said.\n\nThe power issue will remain for the first half of the year as its linked closely to the hydropower situation in Kariba, said Mugaga.\n\nAn El Nio-induced drought has reduced water levels at the dam, one of the nations main power sources.\n\nBusinesses also dont expect the trading conditions to improve any time soon.\n\nThe operating environment is expected to remain bearish driven by exchange-rate and inflation dynamics, said Maxen Karombo, OK Zimbabwes CEO.\n\nThe ZiG traded little changed on Monday at 25.83 per dollar on the official market, according to data on the central banks website.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/02115157/zig.webp",
            "description": "<p>By Bloomberg  ZIMBABWEAN companies should brace for further exchange rate volatility this year following a shock devaluation of the nation’s bullion-backed currency in September, a local commerce group said. The ZiG, short for Zimbabwe Gold and the nation’s sixth attempt at a stable currency since 2009, fell 43% against the dollar on 27 September last</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-zig-currency-set-for-more-volatility-says-business-grouping/\">Zimbabwe’s ZiG currency set for more volatility, says business grouping </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "08 Jan 2025"
        },
        {
            "title": "Zimbabwe issues floods warning amid anticipated thunderstorms",
            "url": "https://www.newzimbabwe.com/zimbabwe-issues-floods-warning-amid-anticipated-thunderstorms/",
            "content": "By Anna Chibamu\n\nLOCAL Government Minister, Daniel Garwe says floods are expected in the country as the whole Southern African region braces for thunderstorms.\n\nHeavy rains were expected from Monday up until early next week, and areas to be affected include Harare, Bulawayo and Victoria Falls.\n\nSpeaking in Harare Monday, Garwe said his ministry received intelligence to the effect that heavy rains would be falling for almost a week.\n\nWe received a communication from the Meteorological Services Department telling us that starting from today, for the next seven days, we are likely going to be receiving a lot of rains.\n\nThere will likely be thunderstorms and there is going to be a lot of flooding in our streams and rivers. People are warned to be careful as they cross streams and small rivers.\n\nPeople must be careful not to be under trees when it is raining. They must be careful not to walk barefooted when it is raining and must be indoors because it is coming with some harshness, Garwe said.\n\nThe Civil Protection Unit (CPU), Garwe said, is fully prepared for any eventualities caused by the rains.\n\nAreas that are likely to experience the thunderstorms are Harare, Bulawayo and Victoria Falls.\n\nWe are prepared for any mishap that might befall us and resources are available, Garwe said, adding the anticipated rains were not as strong as the rains expected from Cyclone Chido, which did not affect Zimbabwe last month.\n\nThe CPU was fully prepared for Cyclone Chido but, fortunately for Zimbabwe, Chido did not visit us.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/02/18045403/Zimbabwe-Floods.png",
            "description": "<p>By Anna Chibamu LOCAL Government Minister, Daniel Garwe says floods are expected in the country as the whole Southern African region braces for thunderstorms. Heavy rains were expected from Monday up until early next week, and areas to be affected include Harare, Bulawayo and Victoria Falls. Speaking in Harare Monday, Garwe said his ministry received</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-issues-floods-warning-amid-anticipated-thunderstorms/\">Zimbabwe issues floods warning amid anticipated thunderstorms</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "08 Jan 2025"
        },
        {
            "title": "Stochastic Momentum Index Guide",
            "url": "https://www.newzimbabwe.com/stochastic-momentum-index-guide/",
            "content": "Trading in the stock market can be difficult, especially given the variety of technical indicators accessible to traders. The Stochastic Momentum Index (SMI) is a lesser-known yet extremely powerful indicator.\n\nThestochastic momentum indexisa technical indicator that traders use to identify potential buy and sell signals in the market.Instead of reading the assets closing price as the standard stochastic indicator, the SMI calculates the closing price based on the high/low range average. Lets explore this article in detail.\n\nThe stochastic oscillator is calculated by comparing an assets closing price to its price range over a specified period. The price range represents the difference between the highest and lowest prices at the same time.\n\nThe stochastic oscillator generates the %K and %D lines. The %K line displays the current closing price as a percentage of the price range for a given time period, usually 14 days. The %D line is a moving average of the %K line, typically calculated as a 3-day simple moving average.\n\nThese oscillators are also known as oversold and overbought indicators.\n\nYoull need to pay attention on two lines %D and %K that are here:\n\n%K is commonly set to 5 and indicates the main changes of price (slow line).\n\n%D is the quick line, a simple moving average of the %K, which is set to 3.\n\nThese two lines fluctuate between the values of +100 and -100. The 0 line represents the midpoint of our observation periods high/low range.\n\nAn additional level, +/- 40, is where traders identify a market as overbought or oversold.\n\n+40 is viewed as overbought\n\n-40 is viewed as oversold\n\nYoull see overline that is green and overload line will be red. When the current closing price plot is more than the average of the high/low, positive youll see return on the SMI.\n\nIf the current closing plot is less than the average of the high and low, youll get a negative return plot.\n\nWhen you use SMI, youll use three maintradingstrategies:\n\nThere are various methodical steps include in calculating stochastic momentum index. Here are the following steps below:\n\nFor calculating the median price, this is the average of the highest high and the lowest low over a given period.\n\nMedian Price = (Highest High + Lowest Low) / 2\n\nIts the methodical step of calculating the distance from median price.\n\nDistance = Closing Price  Median Price\n\nTo smooth the data and eliminate noise, use a Simple Moving Average (SMA) on the distance.\n\nSmoothed Distance = SMA (Distance, period)\n\nHigh  Low Range = Highest High  Lowest Low\n\nSmoothed Range = SMA (High  Low Range, period)\n\nSMI = 100  Smoothed Range / Smoothed Distance\n\nSMI (final) = SMA (SMI, signal period)\n\nIn this way, traders can identify the potential of trading signals.\n\nThe Stochastic Momentum Index (SMI) is a useful indicator. It provides the detailed information aboutmarket momentum. It also allows traders to better understand price movements and potential turning moments. The SMI enhances the standard stochastic oscillator by giving a more refined and sensitive measure of market momentum.\n\n",
            "image_url": null,
            "description": "<p>Trading in the stock market can be difficult, especially given the variety of technical indicators accessible to traders. The Stochastic Momentum Index (SMI) is a lesser-known yet extremely powerful indicator. The stochastic momentum index is a technical indicator that traders use to identify potential buy and sell signals in the market. Instead of reading the asset’s closing price as</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/stochastic-momentum-index-guide/\">Stochastic Momentum Index Guide</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "08 Jan 2025"
        },
        {
            "title": "19 Hippos die mysteriously in the last three months — ZimParks official",
            "url": "https://www.newzimbabwe.com/19-hippos-die-mysteriously-in-the-last-three-months-zimparks-official/",
            "content": "By Tapiwa Svondo\n\nAT least 19 hippopotamuses have died in the last three months under unclear circumstances in the Sapi Safari Area and another in Chirundu, located in the Mid Zambezi region, Hurungwe district, Mashonaland West.\n\nIn a statement, Zimbabwe Parks and Wildlife Management Authority (ZimParks) spokesperson, Tinashe Farawo confirmed the mysterious deaths of the hippos and indicated that samples have been taken for further investigations.\n\nZimbabwe Parks and Wildlife Management Authority is saddened to report the deaths of 18 hippos in the Sapi Safari Area and one in Chirundu over the last three months.\n\nThe Authority is carrying out investigations with various partners to ascertain the cause of deaths. Samples have been taken and sent for lab testing and we are waiting for the results, said Farawo.\n\nDeaths of the giant mammals in the Mid Zambezi region follows an ecological disaster at Lake Chivero, where hordes of fish species and four rhinos, succumbed to suspected toxic substances spewed into the water body by unknown elements.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/02/23164802/hippo_16x9.jpg",
            "description": "<p>By Tapiwa Svondo  AT least 19 hippopotamuses have died in the last three months under unclear circumstances in the Sapi Safari Area and another in Chirundu, located in the Mid Zambezi region, Hurungwe district, Mashonaland West. In a statement, Zimbabwe Parks and Wildlife Management Authority (ZimParks) spokesperson, Tinashe Farawo confirmed the mysterious deaths of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/19-hippos-die-mysteriously-in-the-last-three-months-zimparks-official/\">19 Hippos die mysteriously in the last three months — ZimParks official </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "08 Jan 2025"
        },
        {
            "title": "Crisis Coalition commends SADC Troika’s swift action to resolve Mozambique turmoil",
            "url": "https://www.newzimbabwe.com/crisis-coalition-commends-sadc-troikas-swift-action-to-resolve-mozambique-turmoil/",
            "content": "By Staff Reporter\n\nTHE Southern African Development Community (SADC) has been hailed for its timely response to the ongoing political crisis in Mozambique resulting from disputed October elections.\n\nIn a statement, Crisis in Zimbabwe Coalition (CiZC) pat SADC Chairman, President Emmerson Mnangagwa and the organs Troika for swiftly reacting to try and resolve the turmoil in the former Portuguese colony.\n\nCiZC applauds the recent actions taken by SADC, particularly in convening an Extraordinary Summit of Heads of State and Government of the Organ Troika on Sunday, 5 January 2025.\n\nDuring the summit, the Troika acknowledged the gravity of the ongoing post-election insecurity in Mozambique. They highlighted that this instability not only poses a significant threat to national stability but also has far-reaching repercussions for regional trade and security dynamics, said the coalition.\n\nThe Troika expressed deep concern regarding the potential implications of this turmoil on the broader SADC region, which could adversely affect cooperation and unity among member states.\n\nConvening of the summit is said to have followed considerable advocacy and pressure from various regional civil society organisations.\n\nIn December 2024, the Coalition, alongside other regional organizations and coalitions, launched a fact-finding mission in Mozambique. The aim was to assess the situation on the ground and collaboratively urged the SADC to take prompt action by organizing a meeting of the Organ on Politics, Defence and Security Cooperation.\n\nThe emphasis was placed on the urgent necessity for dialogue and conflict resolution within Mozambique. The petition highlighted the importance of SADC leveraging its existing mechanisms, such as the Panel of Elders, to directly engage with various stakeholders, including government representatives and civil society organisations in Mozambique.\n\nIn response to this call for action, SADC demonstrated its responsiveness by mandating the SADC Panel of Elders. This panel, supported by the Ministerial Committee of the Organ (MCO) comprising Troika member statesnamely Malawi, Zambia, and the United Republic of Tanzaniaand the SADC Secretariat, has been empowered to engage with the Government of Mozambique and key opposition leaders to assess and navigate the challenging post-election environment, further said CiZC.\n\nA comprehensive report on findings and recommendations is to be submitted to the Chairperson of the SADC Organ by January 15, 2025.\n\nThe lobby group expressed confidence that a coordinated and multifaceted approach will be deployed to facilitate genuine dialogue among squabbling parties to resolve the crisis in Mozambique.\n\nThis is essential for restoring peace and ensuring long-term stability in the country.\n\nWe applaud the Troikas commitment to the core objectives of SADC, which focus on fostering a peaceful, secure, and prosperous region for all member states.\n\nWe remain hopeful that this initiative represents the beginning of a constructive process that will ultimately lead to a sustainable and peaceful resolution to the current challenges in Mozambique.\n\nCiZC said the Troikas proactive approach in engaging the conflicting parties is a significant advancement towards achieving lasting peace and genuine dialogue.\n\nAs SADC moves forward, it is crucial not only to address the immediate crisis but also to strive for the establishment of sustainable peace that will benefit the entire region.\n\nCiZC is actively coordinating regional solidarity efforts, which are vital in supporting Mozambican civil society. We are committed to promoting constructive and genuine dialogue aimed at achieving a peaceful solution that will facilitate necessary institutional reforms in Mozambique.\n\nThe success of these regional efforts will rely on sustained cooperation between local, regional, and international actors. It is vital to maintain a clear focus on supporting locally-led solutions while simultaneously providing essential external support and solidarity, said the lobby group.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/04041156/2024-10-21T115556Z_2141171617_RC2YOAA9KH7P_RTRMADP_3_MOZAMBIQUE-ELECTION-1729538456.jpg",
            "description": "<p>By Staff Reporter  THE Southern African Development Community (SADC) has been hailed for its timely response to the ongoing political crisis in Mozambique resulting from disputed October elections. In a statement, Crisis in Zimbabwe Coalition (CiZC) pat SADC Chairman, President Emmerson Mnangagwa and the organ’s Troika for swiftly reacting to try and resolve the turmoil</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/crisis-coalition-commends-sadc-troikas-swift-action-to-resolve-mozambique-turmoil/\">Crisis Coalition commends SADC Troika’s swift action to resolve Mozambique turmoil</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "08 Jan 2025"
        }
    ]
}