{
    "news": [
        {
            "title": "Social Development Practitioners seek seat at the table",
            "url": "https://www.newzimbabwe.com/social-development-practitioners-seek-seat-at-the-table/",
            "content": "By Staff Reporter\n\nA newly formed local organisation, the Institute of Social Development Practices (ISDP) has set its sights on upscaling the relevance and role that development practitioners play in Zimbabwes economic development agenda.\n\nAccording to the ISDP founder, Petronella Tatenda Muungani, increased focus on STEM education in light of rapid technological advances had relegated other key fields such as Development Studies.\n\nSTEM education, an acronym for Science, Technology, Engineering, and Mathematics, is seen as increasingly vital in shaping the future workforce of Zimbabwe.\n\nHowever, Muungani believes that it is also important to pay similar attention to other fields such as Development Practices.\n\nWe noticed that there was a gap in the market for a social science/humanities-oriented institute.\n\nThere has been a lot of interest around STEM so those outside that discipline eagerly wanted an entity that makes them feel seen and relevant. That is what we are offering, she said.\n\nMuungani added that their objectives are to ensure that development practice remains relevant and effective at a time when unemployment is on the rise.\n\nWe want to see graduates within the social sciences and humanities field having an entrepreneurial spirit, being change makers who can effectively be productive without wasting their qualifications while idle waiting for jobs.\n\nOn top of fostering an entrepreneurial mindset in students and graduates, the institute also supports programmes for employees and employers.\n\nWhile we are trying to create jobs, we also help employers to retain existing employees by co-facilitating programs that provide value and support to the organization as a whole and to each individual employee, she added.\n\nISDP is set to be officially launched in October and also seeks to complement the governments thrust on Skills development being spearheaded by the Skill Audit and Development Ministry.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/28074305/IMG-20250828-WA0005.jpg",
            "description": "<p>By Staff Reporter A newly formed local organisation, the Institute of Social Development Practices (ISDP) has set its sights on upscaling the relevance and role that development practitioners play in Zimbabwe’s economic development agenda. According to the ISDP founder, Petronella Tatenda Muungani, increased focus on STEM education in light of rapid technological advances had relegated</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/social-development-practitioners-seek-seat-at-the-table/\">Social Development Practitioners seek seat at the table</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "28 Aug 2025"
        },
        {
            "title": "Ex-minister’s attacker jailed 4 years for attempted murder",
            "url": "https://www.newzimbabwe.com/ex-ministers-attacker-jailed-4-years-for-attempted-murder/",
            "content": "By Staff Reporter\n\nThe Regional Court in Hwange has jailed Samson Siazuza (46) to an effective four years behind bars after convicting him of attempted murder for a savage attack on former Cabinet Minister Joel Gabuza.\n\nOn June 5, 2025, at Siamwake Village under Chief Pashu in Binga, Siazuza dragged Gabuza from his vehicle and stabbed him in the right eye with a homemade knife before repeatedly striking him with logs.\n\nThe victim suffered deep head wounds and cuts, narrowly surviving after emergency treatment at Mpilo Hospital.\n\nThe court initially imposed a six-year term, suspending two years on condition of good behaviour, leaving Siazuza to serve four years in prison.\n\nPolice recovered the knife and logs used in the attack. Investigations are ongoing to track down Siazuzas fugitive accomplice, Smart Sipu, who is still on the run.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/27202646/Joel-Gabuza.jpg",
            "description": "<p>By Staff Reporter The Regional Court in Hwange has jailed Samson Siazuza (46) to an effective four years behind bars after convicting him of attempted murder for a savage attack on former Cabinet Minister Joel Gabuza. On June 5, 2025, at Siamwake Village under Chief Pashu in Binga, Siazuza dragged Gabuza from his vehicle and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ex-ministers-attacker-jailed-4-years-for-attempted-murder/\">Ex-minister’s attacker jailed 4 years for attempted murder</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "28 Aug 2025"
        },
        {
            "title": "Mwanza to launch The Zimbabwean Dream at ZAA Diaspora Forum",
            "url": "https://www.newzimbabwe.com/mwanza-to-launch-the-zimbabwean-dream-at-zaa-diaspora-forum/",
            "content": "Founder of the Zimbabwe Achievers Awards (ZAA), Conrad Mwanza, will officially launch his much-anticipated book, The Zimbabwean Dream, during the ZAA Diaspora Forum at the Hyatt Regency, Harare, on Friday, 29 August 2025, starting at 9:00 AM.\n\nThe book captures Mwanzas vision for Zimbabwe, highlighting the power of the diaspora, the resilience of its people, and the need for a bold, united dream that can transform the nations future. Blending personal reflections, inspiring stories, and a roadmap for engagement, The Zimbabwean Dream sets out to ignite conversations about economic empowerment, leadership, and nation-building.\n\nIn the book, Mwanza explores themes such as:\n\nThe foreword was written by Dr. Ted, who commended the work, stating:\n\nThe Zimbabwean Dream is not just a bookit is a call to action. It challenges us to think beyond limitations, to harness the strength of our people, and to believe that a better Zimbabwe is possible if we dream and work collectively.\n\nThe launch will be a major highlight of the Diaspora Forum, which brings together business leaders, policymakers, innovators, and the global Zimbabwean community to explore new pathways for collaboration and investment.\n\nSpeaking ahead of the launch, Conrad Mwanza said:\n\nThe Zimbabwean Dream is about reimagining our countrys future and recognising that the greatest resource Zimbabwe has is its peopleboth at home and abroad. I believe this book will serve as a rallying point for unity, progress, and visionary action.\n\nThe Diaspora Forum will be followed by the prestigious ZAA Global Awards Gala on Saturday, 30 August 2025, at Manna Resort, Glenlorne, Harare.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/07/10123440/Conrad-Mwanza-scaled-e1625916896590.jpg",
            "description": "<p>Founder of the Zimbabwe Achievers Awards (ZAA), Conrad Mwanza, will officially launch his much-anticipated book, The Zimbabwean Dream, during the ZAA Diaspora Forum at the Hyatt Regency, Harare, on Friday, 29 August 2025, starting at 9:00 AM. The book captures Mwanza’s vision for Zimbabwe, highlighting the power of the diaspora, the resilience of its people,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mwanza-to-launch-the-zimbabwean-dream-at-zaa-diaspora-forum/\">Mwanza to launch The Zimbabwean Dream at ZAA Diaspora Forum</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "28 Aug 2025"
        },
        {
            "title": "MasterChef 2025 – Meet Zim-born contestant Munopa, other Heat 7 hopefuls",
            "url": "https://www.newzimbabwe.com/masterchef-2025-contestants-meet-zim-born-munopa-other-heat-7-hopefuls/",
            "content": "BBC\n\nMasterChef is back uncovering the countrys best amateur cooks as they battle it out in the MasterChef kitchen.\n\nWho will be the 2025 Champion? Lets meet the Heat 7 contenders\n\nGap Year Student, Aged 19\n\nMunopa lives in Taunton with her family. She was born in Harare, Zimbabwe. She moved to the UK as a young child and grew up in Taunton.\n\nHow would you describe your style of cooking?\n\nI would describe my style of cooking as classical French and British with international influences. My cooking is inspired by the people I meet and their stories. I make dishes that usually have very few key ingredients or look quite simple but use various techniques and textural elements to make them interesting. I blend the respect for seasonal and British produce that is prevalent in my community here in Taunton but also spices and flavours symbolic of my heritage in Southern Africa.\n\nI will cook anything from virtually anywhere as I think food is a good vehicle for understanding a persons history and culture.\n\nHow did you get into cooking?\n\nMy mum initially taught me how to cook, and the principles of her cooking are ones I still carry to this day. A lot of her dishes were lightly spiced and allowed the ingredients to speak for themselves which is something I try to do in my cooking. But I mainly got into cooking through reading and watching cooking shows on television. As I read books, I would highlight any mentions of foods I didnt know and research them. This opened my mind to how vast a food culture can be at a young age.\n\nI probably fell in love with food the moment I started to exist, there is no real start for my passion for food. There are stories of me managing to eat in my sleep as a baby. If that isnt a testament to the strength of my relationship with food I dont know what is.\n\nEarliest cooking memory?\n\nMy earliest cooking memory is making packed lunches. I would try to replicate dishes I had seen on television and would make my friends try them as we sat in a little circle on the field at school. Looking back that was my first judging panel for my cooking and made me strive to improve my dishes week by week.\n\nWhat is your favourite ingredient to cook with and why?\n\nMy favourite ingredient to cook with would probably be any type of seafood or fish. Living in a town with access to some of the best fish in the country by way of local fish markets, Ive been spoiled for choice. I find my creativity is pushed by finding new ways to enjoy the foods I eat most often. I have dozens of seafood and fish dishes and being able to still come up with new combinations each time shows the versatility. The flavour pairings are dependent on the season, fish can be utilised in so many ways, and I never get tired of cooking and especially eating it.\n\nWhy did you enter MasterChef this year?\n\nI honestly didnt want to go on MasterChef. Ive always been very protective of my recipes and like to cook at a leisurely pace in my kitchen at home. The idea of a fast-paced competition didnt originally jump out at me but after some consideration and encouragement from my family I decided that there wasnt a better use of my gap year.\n\nIm so glad I went for it. Its the most recognised amateur cooking competition and I wanted to get out there and do something with my last year of being a teenager. I think its important for me to take every opportunity available to me and see where it can take me.\n\nDo you have a dream of working in the food world? What is it?\n\nMy food dream is to run a boutique hotel and restaurant. I love how food can be a destination and combining hotels and restaurants is something that would fulfil my food philosophy. The focus would be sustainable and local farm grown produce regardless of where in the world these hotels may be. I would experiment with cuisines but always keep that modern European style at the forefront. I want people to be able to eat a Michelin level meal from the comfort of their rooms. To enjoy the food in both formal and non-traditional settings. I love entertaining at home, and these would serve as an opportunity for people to get to experience that.\n\nData Scientist, Aged 30\n\nVishal lives in Glasgow, Scotland. He was born and raised in India. He also lived in Bristol for a year in 2016.\n\nHow would you describe your style of cooking?\n\nI like cooking everything but mostly love feeding people Indian food to show its range.\n\nIts the food I grew up with and it holds a special place in my heart. However, I have an extensive collection of cookbooks that constantly challenge me to explore and master recipes from around the world. In addition to Indian cuisine, I am particularly fond of Korean and Thai dishes. I find great joy in cooking stews and curries, relishing the rich, complex flavours and the comforting experience they bring.\n\nHow did you get into cooking?\n\nI learned the basics of cooking from my mother, who instilled in me a love for home-cooked food and traditional flavours.\n\nEarliest cooking memory?\n\nIve always loved food, but the moment I truly fell in love with it was during my time in university accommodation. I started living in different places and sharing kitchens with people from all walks of life. Living with friends from around the world. Each an incredible cook in their own right, I was introduced to a whole new universe of flavours, ingredients, techniques and cooking styles.\n\nOur kitchen became a melting pot of cultures, where every meal was a discovery. That experience ignited my passion not just for eating, but for exploring and understanding the rich diversity of food.\n\nOver time, Ive made it a point to keep learning and refining my skills, turning everyday experiences into stepping stones toward becoming a better cook.\n\nWhat is your favourite ingredient to cook with and why?\n\nI love cooking with onions  it adds depth, sweetness, and a rich umami base to almost any dish. Their versatility  from sharp and pungent when raw to mellow and caramelized when cooked, makes them a flavour powerhouse in the kitchen. Onions just effortlessly elevate the taste of home-cooked meals.\n\nWhy did you enter MasterChef this year?\n\nI think I am finally ready to showcase my cooking skills. I feel confident about the flavours I can produce. Being part of MasterChef will allow me to showcase my knowledge of food and the rich Indian cultural heritage I carry. Its a platform to share my culinary skills with a global audience, highlighting the diverse flavours and traditions I grew up with across every corner of India. Ultimately, I find peace and joy in feeding people, and my goal is to build a fulfilling career in the culinary world.\n\nDo you have a dream of working in the food world? What is it?\n\nOwning a restaurant has always been a dream of mine. While many Indian eateries in the UK focus on Punjabi or South Indian cuisine, I see a wonderful opportunity to showcase the incredible diversity of Indias regional food. My goal is to create a space that brings lesser-known dishes and flavours  from the coasts to the mountainsto a wider audience, offering a fresh and authentic perspective on Indian cuisine.\n\nFishmonger, Aged 31\n\nHarry lives in London with his partner Katie. He was born in London but lived in Edinburgh, Scotland when he was younger. He spent four years at University in Newcastle.\n\nHow would you describe your style of cooking?\n\nId say my food is a fusion of classic British and French cooking. I also like using modern techniques combined with great British ingredients.\n\nMy cooking inspiration came from my mum at an early age. We rarely had takeaways and Mum always used to cook from scratch every night. It wasnt limited to British food either, my mum cooked Asian and north African food quite a lot.\n\nAs I got older my brother became a big cooking influence. He owns his own catering business, so hes always cooked phenomenal food on a large scale. Ive learned a lot from him.\n\nIve started trying new cultures of food and all our holidays are always dominated by what cuisines we can try. Being a fishmonger, I now have more access to the best of British fish and seafood. So, cooking with exciting types of fish is really challenging and exciting for me.\n\nHow did you get into cooking? Earliest cooking memory?\n\nI didnt really take my cooking seriously until my late teens, but one of my earliest food memories is my dad calling me saying he was coming back to the house and asked me to cook something for him and his friends. It was the first time getting that rush of cooking for people and them loving it!\n\nMy mums side of the family is Irish so another one of my early food memories is eating my grandmothers coddle. Boiled sausages, boiled bacon, boiled potatoes, boiled everything in a pot. Looking back, it wasnt the most cheffy thing she ever cooked but me and my brothers used to absolutely love the warming stew.\n\nWhat is your favourite ingredient to cook with and why?\n\nMy favourite ingredient to cook with is fish. For years I was afraid of cooking fish, it always stuck to the pan and was overcooked and dry. It was always a weakness that I wanted to turn into a strength, and its one of the main reasons I decided to become a fishmonger.\n\nNot only do I now feel comfortable cooking fish, but I have also so much more understanding of so many different types of fish and their flavours, not just salmon and cod!\n\nWhy did you enter MasterChef this year?\n\nIve recently changed careers to being a fishmonger after working in branding for five years and Ive rediscovered my love for home cooking. I wanted to prove to myself that Im a talented cook, Ive been told for years by my friends and family that I should apply. Now that Im a fishmonger I feel its the perfect time to test my skills in the kitchen.\n\nId really like to prove to myself that Im capable of creating exciting and new dishes and not just following recipes. This life change and career as a fishmonger has brought me closer to food in my life.\n\nDo you have a dream of working in the food world? What is it?\n\nI havent decided whether I want my own relaxed local restaurant or catering company. Ive got no desire to win any Michelin stars; I just want to be cooking every day. A cookbook might be a nice milestone as well!\n\nBehavioural Coach, Aged 46\n\nMichal lives in St Albans with her long-term partner Simon. She was born and raised in Glasgow, Scotland.\n\nHow would you describe your style of cooking?\n\nI would describe my cooking as elevated home cooking.\n\nI love to travel, so I like to combine my passion for food with travel. I like to experience the local cuisine wherever I go and try to replicate the flavours and dishes when I get home.\n\nHow did you get into cooking? Earliest cooking memory?\n\nWhen I was very young, I would sit in the kitchen with my mum. She would cook and bake whilst listening to music and they were fun memories. I would stand next to my mum with a mixing bowl and wooden spoon and pretend to make a cake!\n\nWhat is your favourite ingredient to cook with and why?\n\nI would have to say herbs. I have started growing a variety of herbs in my garden. I currently grow sage, mint, thyme, parsley, rosemary, bay, basil, coriander and chives. The satisfaction of growing these fantastic plants and elevating a dish with them- for example making a herb oil.\n\nWhy did you enter MasterChef this year?\n\nI have watched every season of MasterChef and dreamed of entering. I was talking with a friend, who also loves to cook, and when we spoke about MasterChef, he said whats stopping you  and I thought he was right. So I applied.\n\nDo you have a dream of working in the food world? What is it?\n\nI would love to work with food. Either having a TV show combining food and travel and then cooking the food that Ive tried. Id also love to own a restaurant. I have thought about the concept and even have the name  but its my secret for now.\n\nPlasterer, Aged 42\n\nDarren lives in Northamptonshire with his partner Carly her two children Zach and Tyler and his daughter Fearne on weekends. They share the house with their three dogs Monty, Dougie and Winnie and three cats Lucky, Bowie and Freddie. Darren was born and grew up in Leicester.\n\nHow would you describe your style of cooking?\n\nI would describe my style as classical, big flavours and big portions!\n\nI really enjoy doing steaks with different vegetables.\n\nI tend to be inspired by a lot of television cooking programmes and chefs such as Tom Kerridge, Sally Abe and former MasterChef professional Aaron Middleton, to name a few. I like to see what dishes they create and try to put my own spin on them.\n\nHow did you get into cooking?\n\nI got into cooking with my nana from a young age as she used to look after me after school. We would often cook together. I also have really fond memories of both my grandparents and family around Christmas time. I just loved the Christmas dinner and the happy feeling of being with the people you love.\n\nEarliest cooking memory?\n\nOne of my earliest cooking memories was making Yorkshire puddings and eating them in different ways. Sometimes Id make them with butter and sugar as well as with a roast.\n\nWhat is your favourite ingredient to cook with and why?\n\nBeef is my favourite ingredient due to the fact you can do so many different things with it. From cottage pie, beef stew to amazing melt in the mouth steaks.\n\nWhy did you enter MasterChef this year?\n\nI entered MasterChef as Ive always been quite vocal when watching these types of programmes and my partner challenged me to apply if I thought I could do better. I wanted to learn and test my cooking out with some other amazing home cooks.\n\nDo you have a dream of working in the food world? What is it?\n\nI would love to see what opportunities arise after my experience in MasterChef as I do envision a career in food in my future.\n\nId love to do food festivals and pop ups and to develop skills in a professional environment. Maybe one day I could open an establishment inside of the food industry.\n\nFashion Designer, Aged 56\n\nMojgan lives in Bournemouth with her children. She was born in Tehran, she moved to the UK when she was 12.\n\nHow would you describe your style of cooking?\n\nMy Persian cooking is a heartfelt tribute to the beauty and deep heritage of Iranian cuisine. Every dish I create is rooted in centuries of tradition. Flavours layered with saffron, rose, dried limes and fresh herbs, each telling stories from ancient Persia.\n\nI have a broad palette which means I can cook many cuisines but Im mainly inspired by Persian cuisine. Thai, Indian and French cooking are another specialty of mine.\n\nI was inspired by my mother, who cooked not just with her hands but with her heart. In our home food was never just nourishment, it was love, care and connection. She taught me that Persian cooking is an art.\n\nHow did you get into cooking?\n\nI fell in love with food when I was only five . My mother would create a huge table full of colourful delicious dishes. I have inherited her cooking passion deeply. I can cook beautiful dishes and make my guests mesmerised with the presentation and taste of my dishes.\n\nEarliest cooking memory?\n\nMy earliest cooking memory is standing beside my mother. I remember the scent of saffron and herbs filling our home as I stood beside her. Learning that was an act of love and I passed that same warmth and tradition on to my own children.\n\nWhat is your favourite ingredient to cook with and why?\n\nMy favourite ingredient is saffron. It can transform a dish with its colour, aroma and warmth. For me its a soul of Persian cooking, a symbol of beauty, patience and depth.\n\nWhy did you enter MasterChef this year?\n\nI entered MasterChef because I believe food is the heart of the family. I want to inspire families and children to enjoy cooking together, creating memories. Cooking is love and I want to share that. Everyone is impressed with my cooking, and I love cooking, so Id like to show the nation a mixture of Persian and British cuisine and make everyone inspired. I believe if you cook well you love life!\n\nDo you have a dream of working in the food world? What is it?\n\nIm currently writing a Persian cookbook filled with delicious recipes, memories and the love behind each dish. If the chance for a cooking series came along, I wouldnt say no!\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/27202506/master-chef.jpg",
            "description": "<p>BBC MasterChef is back uncovering the country’s best amateur cooks as they battle it out in the MasterChef kitchen. Who will be the 2025 Champion? Let’s meet the Heat 7 contenders… Meet the MasterChef contestants   Munopa Gap Year Student, Aged 19 Munopa lives in Taunton with her family. She was born in Harare, Zimbabwe.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/masterchef-2025-contestants-meet-zim-born-munopa-other-heat-7-hopefuls/\">MasterChef 2025 – Meet Zim-born contestant Munopa, other Heat 7 hopefuls</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "28 Aug 2025"
        }
    ]
}