{
    "news": [
        {
            "title": "Limpopo police foils attempt to smuggle stolen vehicle into Zimbabwe",
            "url": "https://www.newzimbabwe.com/limpopo-police-foils-attempt-to-smuggle-stolen-vehicle-into-zimbabwe/",
            "content": "The Citizen\n\nLIMPOPO  A 44-year-old man was arrested for fraud and possession of a suspected stolen vehicle at Beitbridge Port of Entry on Monday afternoon.\n\nThe suspect was apprehended at the Departure Vehicle Check Point at around 15:30 while allegedly attempting to smuggle a grey Hyundai H1 into Zimbabwe.\n\nAccording to the Limpopo police spokesperson Col Malesela Ledwaba, the suspect is said to have presented fraudulent documentation for the vehicle, which had been reported stolen in Pretoria on August 12, 2024.\n\nPolice immediately took the man into custody and he has been charged with possession of a suspected stolen vehicle and fraud. The vehicle has been seized for further investigation, Ledwaba said.\n\nThe provincial police commissioner, Lt Gen Thembi Hadebe commended the officers at the port for their vigilance and swift response.\n\nThe suspect is expected to appear in the Musina Magistrates Court soon while investigations continue.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/18174906/hyundai-stolen.jpg",
            "description": "<p>The Citizen LIMPOPO – A 44-year-old man was arrested for fraud and possession of a suspected stolen vehicle at Beitbridge Port of Entry on Monday afternoon. The suspect was apprehended at the Departure Vehicle Check Point at around 15:30 while allegedly attempting to smuggle a grey Hyundai H1 into Zimbabwe. According to the Limpopo police</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/limpopo-police-foils-attempt-to-smuggle-stolen-vehicle-into-zimbabwe/\">Limpopo police foils attempt to smuggle stolen vehicle into Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "19 Jun 2025"
        },
        {
            "title": "Getbucks corners Magaya over US$400k debt, moves to liquidate his estate",
            "url": "https://www.newzimbabwe.com/getbucks-corners-magaya-over-us400k-debt-moves-to-liquidate-his-estate/",
            "content": "By Darlington Gatsi\n\nPROPHETIC Healing and Deliverance Ministries founder Walter Magaya is in hot soup following his failure to pay a US$420,140 debt owed to GetBucks Microfinance.\n\nGetBucks has approached the High Court seeking to liquidate his estate after the cleric allegedly frustrated efforts by the company to recover its money declaring he has nothing.\n\nLast year, the High Court granted an order against the self-proclaimed prophet, his wife Tendai and their firm Planet Africa (Private) Limited in which the two are directors for payment of US$420,140.72 together with interest to Getbucks.\n\nA writ of execution was subsequently issued resulting in the attachment of the principal debtors immovable property being a certain piece of land called the Remainder of Stand 166 of Prospect measuring 3, 2323 hectares held under Deed of Transfer number 407 6118 dated 27th July 2018 by the principal debtor Planet Africa (Private) Limited which was declared executable by the High Court and was due for sale on March 28 2025 as the debt security.\n\nIn the current application, GetBucks said efforts to execute the judgement have been unsuccessful as Magaya and wife have committed acts of insolvency.\n\nThe court has been told that a couple of days before the sale in execution, the respondent voluntarily resolved to place the principal debtor under Corporate Rescue which position frustrated the sale in execution of the immovable property.\n\nThere being no further assets of the 1st and 2nd Respondent and after frustration of all execution avenues to frustrate the judgment of this court and to render it a brutum fulmen, it follows that the two are insolvent and their estates should be liquidated.\n\nThe 1st and 2nd Respondents are generally unable to pay debts which are due and payable. Procedures have been abused to frustrate execution. Entities linked to the applicant have been used to frustrate genuine execution of court orders.\n\nThese include the PHD Ministries and The Walter Magaya Family Trust, saidGetBucks in the application.\n\nIt also said Magaya and his wife are popular figures in the society with Magaya being a prophet at PHD Ministries.\n\nThe two have presented themselves as individuals with nothing and have used entities as agents. They should show the court how they are settling personal obligations and sustaining themselves, reads the application.\n\nA prima facie case has been made entitling the applicant to be granted a provisional order pending confirmation for the liquidation process to promptly commence.\n\nGetBucks also prayed for costs on a higher scale.\n\nThis is classic abuse of proceedings to frustrate court orders and the creditor. Applicant has been put out of pocket unnecessarily by the 1st Respondent and have been forced to resort to this application. Costs on a punitive scale are warranted in cases of abuse of processes, reads the application.\n\nThe matter was set down for a virtual hearing, Wednesday.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/14120808/magaya.gif",
            "description": "<p>By Darlington Gatsi PROPHETIC Healing and Deliverance Ministries founder Walter Magaya is in hot soup following his failure to pay a US$420,140 debt owed to GetBucks Microfinance. GetBucks has approached the High Court seeking to liquidate his estate after the cleric allegedly frustrated efforts by the company to recover its money declaring he has nothing.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/getbucks-corners-magaya-over-us400k-debt-moves-to-liquidate-his-estate/\">Getbucks corners Magaya over US$400k debt, moves to liquidate his estate</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "19 Jun 2025"
        }
    ]
}